{"id": 471, "name": "WAGA - Fox 5 - Atlanta", "domain": "fox5atlanta.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox5atlanta.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Live News Weather Good Day Sports Contests Email More Local National Politics Health Entertainment FOX 5 Atlanta Mobile Apps FOX News Sunday Call for Action Closings Netcams Savannah Cams FOX 5 Storm Team App Traffic FOX Weather Burgers with Buck Casting Call Follow Paul Pet of the Day Atlanta Braves Atlanta Falcons Atlanta Hawks Atlanta United High 5 Sports World Cup Good Day Atlanta Portia The Georgia Gang The Road to November Deidra Dukes Reports The_Next_Atlanta Like It or Not Watch Live What's On FOX TV Schedule How To Stream Seen on TV Contests FOX 5 News Team Contact Us Sign up for Email Alerts Jobs Internships FCC Public File FCC Applications Captioning Politics Georgia Politics Election Results Personal Finance Economy Business Stock Market Small Business Tampa News - FOX 13 News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville **FOX News Sunday with Shannon Bream: How and when to watch on FOX 5 Atlanta** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 5 Atlanta starting at 9 a.m. on Sundays. ATLANTA-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 5 Atlanta from 9 a.m. to 10 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 5 Atlanta starting at 9 a.m. on Sundays. **** **Latest News** **Gathering at South Forsyth: Forsyth County greenlights $3B mixed-use development with NHL-ready arena** **New hearings for Colt Gray, Colin Gray scheduled this summer** **One-year countdown to FIFA World Cup, Atlanta provides update** **Atlanta woman claims 'water boys' scammed her out of $800** **Douglas County residents want the trucks to stop** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. Local National Politics Health Entertainment FOX 5 Atlanta Mobile Apps FOX News Sunday Call for Action Closings Netcams Savannah Cams FOX 5 Storm Team App Traffic FOX Weather Burgers with Buck Casting Call Follow Paul Pet of the Day Atlanta Braves Atlanta Falcons Atlanta Hawks Atlanta United High 5 Sports World Cup Good Day Atlanta Portia The Georgia Gang The Road to November Deidra Dukes Reports The_Next_Atlanta Like It or Not Watch Live What's On FOX TV Schedule How To Stream Seen on TV Contests FOX 5 News Team Contact Us Sign up for Email Alerts Jobs Internships FCC Public File FCC Applications Captioning Politics Georgia Politics Election Results Personal Finance Economy Business Stock Market Small Business Tampa News - FOX 13 News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville youtube facebook twitter instagram email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File FCC Applications EEO Public File About Us Jobs Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}