{"id": 721, "name": "Sterling Journal-Advocate", "domain": "journal-advocate.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.journal-advocate.com/2025/05/27/logan-county-sheriffs-deputies-make-arrests-for-drug-possession-driving-under-the-influence-3/", "title": "Logan County Sheriffs Deputies Make Arrests For Drug Possession Driving Under The Influence 3", "content": "e-Edition e-Edition NewsNewsLocal NewsCrime & Public SafetyHealthWeatherNational NewsWorld News News Local News Crime & Public Safety Health Weather National News World News News Local News Crime & Public Safety Health Weather National News World News Business and AgBusiness and AgBest Reviews Business and Ag Best Reviews Business and Ag Best Reviews SportsColorado Eagles Colorado Eagles Colorado Eagles LifestylesLifestylesEntertainmentLocal Events Lifestyles Entertainment Local Events Lifestyles Entertainment Local Events OpinionOpinionLetters to the EditorOpinion Columnists Opinion Letters to the Editor Opinion Columnists Opinion Letters to the Editor Opinion Columnists ObituariesObituariesPlace an Obituary Obituaries Place an Obituary Obituaries Place an Obituary MarketplaceMarketplaceReal EstateJobsSpecial SectionsBusiness DirectoryToday’s AdsCouponsAdvertise With UsSubmitSponsored ContentPublic Notices Marketplace Real Estate Jobs Special Sections Business Directory Today’s Ads Coupons Advertise With Us Submit Sponsored Content Public Notices Marketplace Real Estate Jobs Special Sections Business Directory Today’s Ads Coupons Advertise With Us Submit Sponsored Content Public Notices EntertainmentDaily Horoscope Daily Horoscope Daily Horoscope Advice Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint e-Edition Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition Local News Crime Trending: 📖 2025-2026 Explore Colorado Magazine FAQ – New eEdition ♊ Daily Horoscope ✍️ Asking Eric Classifieds **Logan County Sheriff’s deputies make arrests for drug possession, driving under the influence** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X The following are reports from local law enforcement agencies. All defendants are presumed innocent until found guilty. At 1:00 a.m. deputies were dispatched to the 100 block of Hamilton St., in Sterling, for suspicious activity. At 1:39 a.m. deputies were dispatched to the 300 block of State St., in Sterling,. for a disturbance. At 1:52 p.m. deputies were dispatched to mile marker 153 on Interstate 76 for an assist. At 1:55 p.m. deputies were dispatched to the 28100 block of County Road 74, in Peetz, for a burglary alarm. At 4:20 p.m. deputies were dispatched to Highway 113 and C.R. 50, in Iliff, for an assist. At 5:19 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for an offense. At 7:25 p.m. deputies were dispatched to mile marker 153 on I-76 for an assist. At 7:43 p.m. deputies were dispatched to C.R. 43.5 and Hwy. 138, in Sterling, for a vehicle crash without injuries. At 4:25 a.m. deputies were dispatched to the 700 block of N. Fourth St., in Sterling, for an offense. At 10:10 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 11:25 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an assist. At 12:53 p.m. deputies were dispatched to S. 10th Ave. and W. Main St., in Sterling, for a hit-and-run vehicle crash. At 4:53 p.m. deputies were dispatched to mile marker 448 on Hwy. 6 for an assist. At 8:28 p.m. deputies were dispatched to mile marker 151 on I-76 for an assist. At 10:44 p.m. deputies were dispatched to C.R. 44 and 43, in Sterling, for suspicious activity. At 1:06 p.m. Josie Nygaard, 34, was arrested at Platte St. and Weston Ct., in Sterling, on charges of operating an uninsured motor vehicle on a public roadway, displaying/possessing an altered/fictitious tab title sticker on plate, driving a vehicle with only one number plate attached and violation of a protection order. At 3:31 a.m. deputies were dispatched to mile marker 149 on I-76 for a vehicle crash with injuries. At 8:06 a.m. deputies were dispatched to the 200 block of S. Fremont Ave., in Fleming, for an offense. At 1:51 a.m. deputies were dispatched to Edith Ave. and C.R. 26, in Sterling, for an offense. At 7:02 p.m. deputies were dispatched to the 12000 block of C.R. 370, in Sterling, for a welfare check. At 9:26 p.m. deputies were dispatched to C.R. 56 and Hwy. 113, in Iliff, for a welfare check. At 9:34 p.m. deputies were dispatched to C.R. 18 and 23, in Merino, for a vehicle crash with injuries. At 4:44 p.m. Eric Bostwick, 43, was arrested in the 12200 block of Highway 6, in Sterling, on a warrant for flight to avoid. At 10:50 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for a forgery. At 2:30 p.m. deputies were dispatched to the 28700 block of C.R. 6, in Sterling, for a 911 investigation. At 6:57 p.m. deputies were dispatched to the 15000 block of C.R. 28.1, in Sterling, for an assist. At 10:03 p.m. deputies were dispatched to Phelps St. and S. 11th Ave., in Sterling, for an assist. At 1:29 a.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for a burglary alarm. At 1:53 a.m. deputies were dispatched to mile marker 133 on I-76 for a welfare check. At 8:29 a.m. deputies were dispatched to the 28200 block of U.S. Hwy. 6, in Fleming, for an animal complaint. At 11:52 a.m. deputies were dispatched to the 12900 block of Desert Dr., in Sterling, for an assist. At 12:32 p.m. deputies were dispatched to the 36200 block of C.R. 95, in Crook, for a theft. At 2:37 p.m. deputies were dispatched to the 104800 block of C.R. 20.5, in Sterling, for a burglary alarm. At 5:43 p.m. deputies were dispatched to the 13500 block of C.R. 37, in Sterling, for a disturbance. At 8:13 a.m. deputies were dispatched to the 300 block of Coleman Ave., in Peetz, for harassment. At 10:18 a.m. deputies were dispatched to the 19700 block of Barnes Cir., in Sterling, for a forgery. At 3:10 p.m. deputies were dispatched to the 12200 block of Hwy. 61, in Sterling, for an assist. At 3:32 p.m. deputies were dispatched to the 14400 block of Greenway Dr., in Sterling, for an offense. At 7:21 p.m. deputies were dispatched to C.R. 24 and 37, in Sterling, for suspicious activity. At 10:24 p.m. deputies were dispatched to the 8900 block of C.R. 59, in Sterling, for a 911 investigation. At 6:19 a.m. deputies were dispatched to the 15800 block of C.R. 16.5 for a trespass. At 12:24 p.m. deputies were dispatched to the 100 block of N. Fourth St., in Iliff, for an assist. At 4:32 p.m. deputies were dispatched to mile marker 3 on Hwy. 138 for a trespass. At 6:50 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an assist. At 12:21 p.m. deputies were dispatched to the 6400 block of C.R. 29.7 for an offense. At 7:43 p.m. deputies were dispatched to C.R. 25 and 54, in Sterling, for suspicious activity. At 7:37 a.m. deputies were dispatched to the 18500 block of C.R. 24, in Sterling, for an abandoned vehicle. At 8:10 a.m. deputies were dispatched to the 14200 block of C.R. 370, in Sterling, for a forgery. At 8:37 a.m. deputies were dispatched to the 14500 block of C.R. Bluestem St., in Sterling, for an assist. At 8:47 a.m. deputies were dispatched to the 25000 block of C.R. 65.5, in Iliff, for an offense. At 9:09 a.m. deputies were dispatched to Bluestem St. and C.R. 33, in Sterling, for a vehicle crash with injuries. At 12:54 p.m. deputies were dispatched to assist the Wyoming State Patrol. At 9:24 p.m. deputies were dispatched to the 8900 block of CR. 59, in Sterling, for a 911 investigation. At 9:44 p.m. deputies were dispatched to Seventh St. and Third Ave., in Crook, for a noise complaint. At 11:23 p.m. deputies were dispatched to Pioneer Rd. and Sidney Ave., in Sterling, for an animal complaint. At 12:08 p.m. Charles Lile, 39, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for fugitive from another jurisdiction. At 3:33 a.m. deputies were dispatched to the 400 block of W. Third Ave., in Iliff, for a suspicious activity. At 10:33 a.m. deputies were dispatched to the 100 block of N. Third St., in Sterling, for a forgery. At 10:52 a.m. deputies were dispatched to the 28600 block of Hwy. 113, in Peetz, for an assist. At 1:56 p.m. deputies were dispatched to Hwy. 6 and C.R. 6, in Merino, for an assist. At 3:06 p.m. deputies were dispatched to the 100 block of N. Washington Ave., in Fleming, for an offense. At 5:24 p.m. deputies were dispatched to the 20600 block of C.R. 85, in Fleming, for a burglary alarm. At 6:25 p.m. deputies were dispatched to mile marker 117 on I-76 for an assist. At 10:35 a.m. Michael Martinez, 32, was arrested in the 500 block of Iris Dr., in Sterling, on a warrant for flight to avoid and charges of possession of less than four grams of a schedule I/II controlled substance and violation of a protection order. At 7:58 a.m. deputies were dispatched to the 17700 block of C.R. 15, in Fort Morgan, for an offense. At 11:03 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 2:35 p.m. deputies were dispatched to the 300 block of Fifth St., in Crook, for a forgery. At 4:31 p.m. deputies were dispatched to Hwy. 14 and Desert Dr., in Sterling, for a 911 investigation. At 10:48 p.m. deputies were dispatched to the 400 block of N. Fourth Ave., in Sterling, for a weapons violation. At 11:45 p.m. deputies were dispatched to the 300 block of Hays Ave., in Sterling, for a 911 investigation. At 1:07 p.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for an offense. At 1:45 p.m. deputies were dispatched to the 40000 block of C.R. 26, in Fleming, for suspicious activity. At 3:40 p.m. deputies were dispatched to C.R. 33 and Hwy. 14, in Sterling, for a vehicle crash with injuries. At 6:41 p.m. deputies were dispatched to the 12200 block of C.R. 31, in Sterling, for a weapons violation. At 9:29 p.m. deputies were dispatched to the 300 block of Coleman Ave., in Peetz, for harassment. At 9:00 a.m. deputies were dispatched to the 100 block of Juniper Dr., in Sterling, for a 911 investigation. At 9:58 a.m. deputies were dispatched to the 11400 block of C.R. 37, in Sterling, for an assist. At 5:17 p.m. deputies were dispatched to the 23400 block of Cedar Ave., in Padroni, for a theft. At 6:53 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for an assist. At 5:45 a.m. deputies were dispatched to the 200 block of Hwy. 6, in Sterling, for a 911 investigation. At 10:06 a.m. deputies were dispatched to the 300 block of Railroad Ave., in Iliff, for an offense. At 12:31 p.m. deputies were dispatched to the 40000 block of C.R. 18, in Fleming for a civil standby. At 2:44 p.m. deputies were dispatched to mile marker 149 on I-76 for an assist. At 6:46 p.m. deputies were dispatched to C.R. 85 and 138, in Crook, for an animal complaint. At 1:01 p.m. Nicholas Miesbach, 31, was arrested in the 12200 block of Hwy. 61, in Sterling, for a community corrections violation. At 1:14 p.m. deputies were dispatched to the 10700 block of Hwy. 6, in Merino, for suspicious activity. At 6:21 p.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an assist. At 10:16 p.m. deputies were dispatched to C.R. 74 and Hwy. 113, in Peetz, for a vehicle crash. At 3:31 p.m. Garet Getty, 40, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for failure to appear. At 2:23 p.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an assist. At 3:42 p.m. deputies were dispatched to the 400 block of N. Fourth St., in Sterling, for an offense. At 4:31 p.m. deputies were dispatched to mile marker 117 on I-76 for an offense. At 7:36 a.m. Jason White, 43, was arrested in the 14000 block of Cottonwood Cir., in Sterling, on charges of felony menacing, child abuse without injury, harassment and domestic violence habitual offender. At 2:53 p.m. Pavel Fedorovitch, 42, was arrested in the 12200 block of Hwy. 61, in Sterling, on a warrant for flight to avoid. At 7:05 p.m. Eric Velasquez Ortiz, 34, was arrested in the 1500 block of E. Chestnut St. on a warrant for flight to avoid. At 11:47 p.m. Crystle Forsythe, 41, was arrested in the 300 block of Hereford Ave., in Sterling, on a warrant for flight to avoid. At 5:45 a.m. deputies were dispatched to mile marker 115 on I-76 for a welfare check. At 7:36 a.m. deputies were dispatched to the 14000 block of Cottonwood Cir., in Sterling, for a disturbance. At 2:05 p.m. deputies were dispatched to mile marker 160 on I-76 for an assist. At 7:12 p.m. deputies were dispatched to C.R. 63 and 54.2, in Iliff, for a vehicle crash with injuries. At 10:22 p.m. deputies were dispatched to the 22000 block of Hwy. 138, in Sterling, for an assist. At 12:46 a.m. deputies were dispatched to the 100 block of W. Hall St., in Fleming, for an assist. At 9:09 a.m. deputies were dispatched to the 14000 block of Greenway Dr., in Sterling, for an offense. At 10:00 a.m. deputies were dispatched to the 16100 block of C.R. 35, in Sterling, for a 911 investigation. At 10:35 a.m. deputies were dispatched to the 1300 block of Adams Cir., in Sterling, for an assist. At 2:31 p.m. deputies were dispatched to the 12500 block of Hwy. 61, in Sterling, for an assist. At 6:10 p.m. deputies were dispatched to C.R. 46 and N. Sixth St., in Iliff, for a welfare check. At 3:08 p.m. Jan Brandt, 33, was arrested in the 12200 block of Hwy. 61, in Sterling, on a warrant for flight to avoid. At 6:59 p.m. Derek Tucker, 41, was issued a citation in the 100 block of N. Riverview Rd., in Sterling, for violation of a protection order. At 12:49 a.m. deputies were dispatched to the 14800 block of Hwy. 14, in Sterling, for a theft. At 2:40 p.m. deputies were dispatched to the 600 block of N. Custer Ave., in Fleming, for a disturbance. At 7:04 p.m. deputies were dispatched to the 100 block of E. First Ave., in Iliff, for a welfare check. At 9:39 p.m. deputies were dispatched to Hwy. 61 and C.R. 22, in Sterling, for a welfare check. At 11:30 a.m. Justin Falk, 25, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for flight to avoid and a charge of failure to appear. At 8:11 a.m. deputies were dispatched to N. Third Ave. and Clark St., in Sterling, for an animal complaint. At 9:00 a.m. deputies were dispatched to the 1500 block of E. Chestnut St., in Sterling, for an abandoned vehicle. At 2:01 p.m. deputies were dispatched to the 18100 block of Westwood Dr., in Sterling, for an offense. At 2:30 p.m. deputies were dispatched to mile marker 399 on Hwy. 6 for an assist. At 3:55 p.m. deputies were dispatched to the 400 block of Colorado Ave., in Merino, for a welfare check. At 4:40 p.m. deputies were dispatched to the 600 block of N. Second Ave., in Sterling, for a civil standby. At 4:53 p.m. deputies were dispatched to the 200 block of Colorado Ave., in Merino, for a civil standby. At 7:41 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for a disturbance. At 9:16 p.m. Duane Dobbins, 51, was arrested at Platte St. and Kings Ct. on charges of possession of less than four grams of a schedule I/II controlled substance, attempting to influence a public servant, possession of drug paraphernalia, introducing contraband in the second degree, violation of a protection order, driving a vehicle with only one number plate attached and driving a vehicle without a valid driver’s license. At 9:16 p.m. Benjamin Swenson, 47, was arrested at Platte St. and Kings Ct., in Sterling, on charges of possession of a schedule I/II controlled substance, attempting to influence a public servant, possession of drug paraphernalia, introducing contraband in the second degree, violation of a protection order, driving a vehicle with only one number plate attached and driving a vehicle without a valid driver’s license. At 5:56 a.m. deputies were dispatched to the 1500 block of E. Chestnut St., in Sterling, for an assist. At 9:56 a.m. deputies were dispatched to mile marker 109 on I-76 for an assist. At 2:45 p.m. deputies were dispatched to C.R. 34 and 39, in Sterling, for an animal complaint. At 2:56 p.m. deputies were dispatched to the 400 block of N. Fourth St., in Sterling, for an offense. At 3:35 p.m. deputies were dispatched to the 200 block of Pine St., in Sterling, for an offense. At 7:12 p.m. deputies were dispatched to Hwy. 6 and C.R. 26, in Sterling, for suspicious activity. At 3:00 p.m. Timothy Mims, 27, was issued a citation at N. Third Ave. and State St., in Sterling, for failure to appear. At 7:45 p.m. Keith McCurdy, 66, was arrested at Hwy. 113 and C.R. 52, in Iliff, on charges of driving under the influence, failure to drive in a single lane and DUI per se. At 5:45 a.m. deputies were dispatched to the 18200 block of Iris Dr., in Sterling, for a 911 investigation. At 11:03 a.m. deputies were dispatched to the 19600 block of C.R. 54, in Padroni, for suspicious activity. At 11:40 a.m. deputies were dispatched to the 200 block of Colorado Ave., in Merino, for a civil standby. At 11:54 a.m. deputies were dispatched to N. Seventh Ave. and Franklin St., in Sterling, for a vehicle crash without injuries. At 5:12 p.m. deputies were dispatched to the 500 block of Lily Ln., in Sterling, for a disturbance. At 8:15 p.m. deputies were dispatched to the 100 block of Roxberry Ln., in Sterling, for a burglary alarm. At 8:53 p.m. deputies were dispatched to the 10500 block of C.R. 35, in Sterling, for an offense. At 9:52 p.m. deputies were dispatched to the 22900 block of C.R. 67, in Iliff, for a 911 investigation. At 10:50 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for a disturbance. At 3:09 p.m. Ian Hale, 30, was arrested in the 12200 block of Hwy. 61, in Sterling, on a community corrections violation and a warrant for flight to avoid. At 12:31 p.m. deputies were dispatched to the 15500 block of Deerfield St., in Sterling, for an offense. At 6:56 p.m. deputies were dispatched to the 600 block of Fifth Ave., in Crook, for a 911 investigation. At 12:05 p.m. David Brown, 47, was arrested in the 12200 block of Hwy. 61, in Sterling, on a warrant for flight to avoid. At 3:05 p.m. Joshua Thomas, 32, was arrested in the 100 block of N. Riverview Rd., in Sterling, on charges of attempting to influence a public servant and harboring a minor. At 10:12 p.m. Marcus Huell, 22, was arrested at mile marker 399 on Hwy. 6 on charges of failure to stop at a stop sign, operating an uninsured motor vehicle on a public roadway and driving under the influence. At 1:01 a.m. deputies were dispatched to McKinley St. and Pawnee Ave., in Padroni, for suspicious activity. At 11:01 a.m. deputies were dispatched to C.R. 40 and Hwy. 138, in Sterling, for an assist. At 2:43 p.m. deputies were dispatched to the 13800 block of C.R. 33, in Sterling, for an offense. At 6:04 p.m. deputies were dispatched to the 18200 block of Hwy. 6, in Sterling, for a disturbance. At 7:45 p.m. deputies were dispatched to the 300 block of E. Larimer St., in Fleming, for a disturbance. At 9:50 p.m. deputies were dispatched to the 17600 block of C.R. 24, in Sterling, for an animal complaint. At 1:05 p.m. Gilbert Sanmiguel, 54, was arrested at N. Third St. and Sidney Ave., in Sterling, on charges of possession of drug paraphernalia, possession of a schedule I/II controlled substance, distributing/manufacturing/possessing dangerous drugs with intent to distribute, special circumstances pattern of manufacturing/selling/displaying, distributing substances, possession of weapons by a previous offender, tampering withy physical evidence and a warrant for flight to avoid. At 7:38 p.m. Thomas Carr, 44, was arrested in the 600 block of Broadway St., in Sterling, on charges of driving under the influence, DUI per se, driving without a seat belt/restraint in use and failure to use turn signals. At 1:05 a.m. deputies were dispatched to the 900 block of Glenora St., in Sterling, for a burglary alarm. At 1:18 a.m. deputies were dispatched to the 1600 block of W. Main St.., in Sterling, for a burglary alarm. At 8:35 a.m. deputies were dispatched to the 200 block of Edwards Ave., in Sterling, for a theft. At 8:49 a.m. deputies were dispatched to the 600 block of Fourth Ave., in Crook, for an animal complaint. At 11:12 a.m. deputies were dispatched to the 1200 block of W. Main St., in Sterling, for a disturbance. At 11:19 a.m. deputies were dispatched to the 700 block of Mindy Ct., in Sterling, for a welfare check. At 5:03 p.m. deputies were dispatched to the 100 block of E. First Ave., in Iliff, for an animal complaint. At 5:12 p.m. deputies were dispatched to Hwy. 138 and First St., in Crook, for an animal complaint. At 9:38 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for a disturbance. At 11:16 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for a disturbance. At 3:12 p.m. Joshua Thomas, 32, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for fugitive from another jurisdiction. At 7:42 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 7:56 a.m. deputies were dispatched to the 700 block of N. Sixth St., in Sterling, for a disturbance. At 2:48 p.m. deputies were dispatched to the 200 block of S. Custer Ave., in Fleming, for a 911 investigation. At 3:19 p.m. deputies were dispatched to the 14200 block of C.R. 71, in Fleming, for a theft. At 6:54 p.m. Christian Cure, 21, was arrested in the 300 block of Pine St., in Sterling, on charges of failure to drive in a single lane, driving with an open alcohol container in the vehicle, driving under the influence and DUI per se. At 6:54 p.m. Cody Ward-Katchen, 31, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for flight to avoid. At 9:43 a.m. deputies were dispatched to the 400 block of N. Seventh Ave., in Sterling, for a civil standby. At 10:34 a.m. deputies were dispatched to the 13500 block of C.R. 16.5, in Merino, for an offense. At 11:48 a.m. deputies were dispatched to the 15500 block of Deerfield St., in Sterling., for a burglary alarm. At 1:15 p.m. deputies were dispatched to the 15400 block of Blair St., in Sterling, for harassment. At 1:46 p.m. deputies were dispatched to the 12900 block of Desert Dr., in Sterling, for a burglary. At 2:42 p.m. deputies were dispatched to the 1700 block of C.R. 25, in Merino, for suspicious activity. At 2:54 p.m. deputies were dispatched to Skyline Ct. and C.R. 34, in Sterling, for suspicious activity. At 5:23 p.m. deputies were dispatched to C.R. 33 and 32, in Sterling, for suspicious activity. At 5:32 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for an offense. At 9:54 p.m. deputies were dispatched to the 10400 block of C.R. 20.5, in Sterling, for suspicious activity. At 10:55 p.m. deputies were dispatched to the 12500 block of C.R. 37, in Sterling, for an offense. At 1:02 a.m. Nicholas Mangione, 38, was issued a citation in the 100 block of N. Riverview Rd., in Sterling, for contempt of court. At 9:11 a.m. deputies were dispatched to the 3400 block of C.R. 23.5, in Merino, for an offense. At 1:20 a.m. deputies were dispatched to the 1500 block of E. Chestnut St., in Sterling, for a disturbance. At 1:40 a.m. deputies were dispatched to the 100 block of S. Front St., in Sterling, for a disturbance. At 4:19 p.m. deputies were dispatched to N. Fifth Ave. and Clark St., in Sterling, for harassment. At 4:51 a.m. deputies were dispatched to the 17000 block of C.R. 30, in Sterling, for an offense. At 6:32 a.m. deputies were dispatched to the 1000 block of C.R. 71, in Fleming, for an offense. At 7:49 a.m. deputies were dispatched to mile marker 155 on I-76 for a welfare check. At 12:44 p.m. deputies were dispatched to the 8400 block of C.R. 31 for a vehicle crash with injuries. At 11:53 a.m. Larry Paul, 51, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for fugitive from another jurisdiction. At 4:54 p.m. Brea Hunter, 31, was arrested in the 800 block of Elm St., in Sterling, on a warrant for flight to avoid. At 8:09 p.m. Miranda Baker, 44, was arrested in the 100 block of N. Riverview Rd., in Sterling, on a warrant for flight to avoid. At 9:17 a.m. deputies were dispatched to the 400 block of W. Logan Ave., in Iliff, for a theft. At 3:57 p.m. deputies were dispatched to the 600 block of Beattie St., in Sterling, for a welfare check. At 4:51 p.m. deputies were dispatched to the 800 block of Elm St.,. in Sterling, for an offense. At 9:53 p.m. deputies were dispatched to the 600 block of Fourth Ave., in Crook, for a 911 investigation. At 7:14 a.m. deputies were dispatched to C.R. 38 and 89, in Fleming, for an abandoned vehicle. At 12:45 p.m. deputies were dispatched to C.R. 15 and Hwy. 14, in Sterling, for a vehicle crash with injuries. At 1:44 p.m. deputies were dispatched to the 700 block of N. Seventh Ave., in Sterling, for an assist. At 3:11 p.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for an offense. At 8:48 p.m. deputies were dispatched to the 400 block of W. Fourth Ave., in Iliff, for an offense. At 11:03 a.m. deputies were dispatched to C.R. 37 and C.R. 46, in Sterling, for a vehicle crash with injuries. At 1:44 p.m. deputies were dispatched to the 17400 block of Hwy. 14, in Sterling, for an offense. At 10:05 p.m. deputies were dispatched to C.R. 490 and Hwy. 113, in Peetz, for a welfare check. At 11:32 p.m. deputies were dispatched to mile marker 397 on Hwy. 6 for a fire. At 11:52 p.m. deputies were dispatched to mile marker 143 on I-76 for a welfare check. At 7 p.m. Angela Torres, 42, was arrested at mile marker 399 on Hwy. 6 on charges of tampering with physical evidence, reckless endangerment, possession of less than four grams of a schedule I/II controlled substance, driving with an open marijuana container in the vehicle, driving without a child restraint in use, failure to stop at a stop sign, child abuse, driving with an open alcohol container in the vehicle and violation of a protection order. At 1:35 p.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for suspicious activity. At 2:11 p.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for found property. At 3:56 p.m. deputies were dispatched to mile marker 126 on I-76 for an assist. At 4:13 p.m. deputies were dispatched to Hwy. 6 and C.R. 69, in Fleming, for an assist. At 7:06 p.m. deputies were dispatched to the 300 block of Country Club Dr., in Sterling, for a burglary alarm. At 8:34 p.m. deputies were dispatched to C.R. 50 and 37, in Sterling, for an assist. At 9:32 a.m. Dominic Neel, 21, was issued a citation in the 12200 block of Hwy. 61, in Sterling, for contempt of court. At 9:39 a.m. Esteban Dominguez Cardenas, 21, was arrested in the 12200 block of Hwy. 61, in Sterling, on a warrant for flight to avoid. At 9:21 p.m. George Cooper, 25, was arrested at mile marker 7 on Hwy. 138 on a warrant for flight to avoid and charges of vehicle not equipped with two reflectors on the rear, driving on a suspended license and driving under the influence. At 12:03 a.m. deputies were dispatched to C.R. 37 and Parkview Dr., in Sterling, for suspicious activity. At 7:13 a.m. deputies were dispatched to the 20600 block of C.R. 85, in Fleming, for a burglary alarm. At 11:48 a.m. deputies were dispatched to the 15500 block of Harris St., in Sterling, for a forgery. At 2:17 p.m. deputies were dispatched to the 600 block of N. Logan Ave., in Fleming, for a theft. At 6:05 p.m. deputies were dispatched to Hwy. 6 and C.R. 24, in Sterling, for a vehicle crash with injuries. At 9:12 a.m. Matthew Garcia, 40, was arrested in the 12900 block of Desert Dr., in Sterling, on charges of possession of a dangerous or illegal weapon, violation of a protection order, second-degree motor vehicle theft, second-degree burglary of a dwelling, possession of less than four grams of a schedule I/II controlled substance, first-degree trespass of an unoccupied dwelling and theft – $300 to $999. At 9:12 a.m. Josie Nygaard, 34, was arrested in the 12900 block of Desert Dr., in Sterling, on charges of violation of a protection order, second-degree motor vehicle theft, second-degree burglary of a dwelling, possession of less than four grams of a schedule I/II controlled substance, first-degree trespass of an unoccupied dwelling and theft – $300 to $999. At 9:12 a.m. deputies were dispatched to the 12900 block of Desert Dr., in Sterling, for a motor vehicle theft. At 1:19 p.m. deputies were dispatched to C.R. 10 and 25, in Merino, for an abandoned vehicle. At 7:41 p.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for harassment. At 9:50 p.m. deputies were dispatched to C.R. 81 and 18, in Fleming, for a noise complaint. At 12:37 p.m. deputies were dispatched to the 500 block of Park Ave., in Merino, for a welfare check. At 6:35 p.m. deputies were dispatched to the 4500 block of Hwy. 63 for a welfare check. At 8:26 p.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for harassment. At 12:33 a.m. deputies were dispatched to C.R. 20.2 and 33 for a vehicle crash with injuries. At 7:03 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 9:27 a.m. deputies were dispatched to the 400 block of W. Fourth Ave., in Iliff, for suspicious activity. At 4 p.m. deputies were dispatched to C.R. 17 and Hwy. 14, in Sterling, for vandalism. At 4:31 p.m. deputies were dispatched to the 19300 block of Chambers Dr., in Sterling, for an offense. At 4:57 p.m. deputies were dispatched to mile marker 148 on I-76 for a welfare check. At 5:13 p.m. deputies were dispatched to the 19300 block of C.R. 26, in Sterling, for a welfare check. At 5:45 p.m. deputies were dispatched to the 200 block of S. Logan Ave., in Fleming, for a civil standby. At 6:08 p.m. deputies were dispatched to the 14500 block of C.R. 24, in Sterling, for an assault. At 7:47 p.m. deputies were dispatched to mile marker 121 on I-76 for a welfare check. At 10:36 p.m. deputies were dispatched to C.R. 55 and 385, in Iliff, for a vehicle crash without injuries. At 6:28 p.m. Kaileen Bordeaux, 32, was arrested in the 12200 block of Hwy. 61, in Sterling, on a warrant for flight to avoid. At 4:23 a.m. deputies were dispatched to the 2100 block of E Chestnut St., in Sterling, for a trespass. At 7:38 a.m. deputies were dispatched to the 200 block of Second Ave., in Crook, for a theft. At 8:20 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for harassment. At 11:36 a.m. deputies were dispatched to the 200 block of Sixth St., in Crook, for a disturbance. At 12:09 p.m. deputies were dispatched to Iris Dr. and Hwy. 6, in Sterling, for a vehicle crash with injuries. At 4:36 p.m. deputies were dispatched to the 14400 block of Greenway Dr., in Sterling, for a 911 investigation. At 8:12 p.m. deputies were dispatched to the 28700 block of C.R. 81, in Crook for a welfare check. At 2:30 p.m. Dominic Flores., 48, was issued a citation in the 100 block of N. Riverview Rd., in Sterling, for failure to appear. At 2:30 a.m. deputies were dispatched to the 300 block of Hereford Ave., in Sterling, for an assist. At 3:01 p.m. deputies were dispatched to the 12200 block of Hwy. 61, in Sterling, for a vehicle crash without injuries. At 8:51 a.m. Amanda Nelson, 34, was issued a citation in the 100 block of N. Riverview Rd., in Sterling, for contempt of court. At 5:07 a.m. deputies were dispatched to the 19600 block of Chambers Dr., in Sterling, for an assist. At 10:02 a.m. deputies were dispatched to the 300 block of N. Custer Ave., in Fleming, for a welfare check. At 9:32 p.m. deputies were dispatched to the 300 block of W. First Ave., in Iliff, for an animal complaint. At 2:45 p.m. deputies were dispatched to Hwy. 6 and 63 for found property. At 2:56 p.m. deputies were dispatched to the 100 block of Parkview Dr., in Sterling, for a burglary alarm. At 4:53 p.m. deputies were dispatched to the 300 block of Lee St., in Merino, for an offense. At 7:34 a.m. deputies were dispatched to the 300 block of Ballpark Rd, in Sterling, for suspicious activity. At 8:40 a.m. deputies were dispatched to the 100 block of N. Logan Ave., in Fleming, for a 911 investigation. At 10:15 a.m. deputies were dispatched to mile marker 123 on I-76 for an animal complaint. At 10:32 a.m. deputies were dispatched to the 29500 block of Hwy. 55, in Fleming, for a vehicle crash without injuries. At 12:29 p.m. deputies were dispatched to the 400 block of N. Front St., in Sterling, for suspicious activity. At 7:05 p.m. deputies were dispatched to C.R. 93 and Hwy. 138, in Crook, for a vehicle crash with injuries. At 3:07 a.m. deputies were dispatched to the 16700 block of Hwy. 14, in Sterling, for a noise complaint. At 2:13 p.m. deputies were dispatched to mile marker 414 on Hwy. 6 for an animal complaint. At 2:26 p.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 4:37 p.m. deputies were dispatched to the 300 block of Railroad Ave., in Iliff, for an offense. At 9:25 p.m. deputies were dispatched to C.R. 75 and Hwy. 6, in Fleming, for an animal complaint. At 3:48 a.m. deputies were dispatched to the 18800 block of Hwy. 6, in Sterling, for a vehicle crash without injuries. At 7:28 a.m. deputies were dispatched to the 300 block of Railroad Ave., in Iliff, for harassment. At 1:21 p.m. deputies were dispatched to the 13500 block of C.R. 33, in Sterling, for vandalism. At 1:30 p.m. deputies were dispatched to the 13200 block of C.R. 31.5, in Sterling, for an assist. At 6:19 p.m. deputies were dispatched to the 27700 block of Hwy. 138, in Iliff, for harassment. At 9:54 a.m. deputies were dispatched to the 13800 block of Hwy. 14, in Sterling, for a motor vehicle theft. At 11:38 a.m. deputies were dispatched to the 100 block of N. Riverview Rd., in Sterling, for an offense. At 2:29 p.m. deputies were dispatched to the 25000 block of C.R. 65.5, in Iliff, for an offense. At 5:32 p.m. deputies were dispatched to the 500 block of N. Fremont Ave., in Fleming, for a 911 investigation. At 12:57 p.m. deputies were dispatched to mile marker 410 on Hwy. 6 for a welfare check. At 1:52 p.m. deputies were dispatched to the 2500 block of E. Chestnut St., in Sterling, for found property. At 4:09 p.m. deputies were dispatched to the 21800 block of C.R. 34.5, in Sterling, for an abandoned vehicle. At 7:04 p.m. deputies were dispatched to the 19200 block of Marigold Dr., in Sterling, for suspicious activity. At 7:46 p.m. deputies were dispatched to the 600 block of N. Sixth Ave., in Sterling, for a theft. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Events** **Most Popular** Your Free Daily Horoscope for June 11, 2025Your Free Daily Horoscope for June 11, 2025 **Your Free Daily Horoscope for June 11, 2025** **Your Free Daily Horoscope for June 11, 2025** On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicampOn red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp **On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp** **On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp** Business meeting, city manager finalists on council’s busy calendarBusiness meeting, city manager finalists on council's busy calendar **Business meeting, city manager finalists on council’s busy calendar** **Business meeting, city manager finalists on council’s busy calendar** Chamber Member of the Week: Credible PaymentsChamber Member of the Week: Credible Payments **Chamber Member of the Week: Credible Payments** **Chamber Member of the Week: Credible Payments** Enduring gifts to our communityEnduring gifts to our community **Enduring gifts to our community** **Enduring gifts to our community** Logan County Sheriff’s deputies make arrests for drug possession, driving under the influenceLogan County Sheriff's deputies make arrests for drug possession, driving under the influence **Logan County Sheriff’s deputies make arrests for drug possession, driving under the influence** **Logan County Sheriff’s deputies make arrests for drug possession, driving under the influence** ‘Emergency’ repairs on Sidney Ave. bridge on commissioner’s agenda Tuesday'Emergency' repairs on Sidney Ave. bridge on commissioner's agenda Tuesday **‘Emergency’ repairs on Sidney Ave. bridge on commissioner’s agenda Tuesday** **‘Emergency’ repairs on Sidney Ave. bridge on commissioner’s agenda Tuesday** Heritage Festival entertainment to include Ingrid Griffin, Mud CountyHeritage Festival entertainment to include Ingrid Griffin, Mud County **Heritage Festival entertainment to include Ingrid Griffin, Mud County** **Heritage Festival entertainment to include Ingrid Griffin, Mud County** Colorado Senate’s top Republican official resigns seat to take new jobColorado Senate’s top Republican official resigns seat to take new job **Colorado Senate’s top Republican official resigns seat to take new job** **Colorado Senate’s top Republican official resigns seat to take new job** Your Free Daily Horoscope for June 10, 2025Your Free Daily Horoscope for June 10, 2025 **Your Free Daily Horoscope for June 10, 2025** **Your Free Daily Horoscope for June 10, 2025** **More in Crime & Public Safety** As Douglas County’s home-rule election gets underway, the battle is already red hot. Here’s what’s at stake. **As Douglas County’s home-rule election gets underway, the battle is already red hot. Here’s what’s at stake.** **As Douglas County’s home-rule election gets underway, the battle is already red hot. Here’s what’s at stake.** Suspect in Boulder antisemitic terror attack charged with 118 counts including attempted murder **Suspect in Boulder antisemitic terror attack charged with 118 counts including attempted murder** **Suspect in Boulder antisemitic terror attack charged with 118 counts including attempted murder** Federal judge blocks deportation of Boulder attack suspect’s family **Federal judge blocks deportation of Boulder attack suspect’s family** **Federal judge blocks deportation of Boulder attack suspect’s family** Scam texts impersonating DMV prompt warning from state **Scam texts impersonating DMV prompt warning from state** **Scam texts impersonating DMV prompt warning from state** 2025 May 27 Subscribee-EditionSign Up For NewslettersSubmitRSS Feeds e-Edition Sign Up For Newsletters Submit RSS Feeds e-Edition Sign Up For Newsletters Submit RSS Feeds Contact UsArchivesWork With UsGreeley TribunePrivacy PolicyAccessibilityPublic NoticesSitemap Archives Work With Us Greeley Tribune Privacy Policy Accessibility Public Notices Sitemap Archives Work With Us Greeley Tribune Privacy Policy Accessibility Public Notices Sitemap Advertise With UsMNG Network AdvertisingAdtaxi SolutionsMy Town Colorado MNG Network Advertising Adtaxi Solutions My Town Colorado MNG Network Advertising Adtaxi Solutions My Town Colorado Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}