{"id": 1601, "name": "WNIN - NPR - Evansville", "domain": "wnin.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://video.wnin.org/video/regional-voices-habitat-for-humanity-ivy-tech-build-together-learn-together-mo6eff/", "title": "Regional Voices Habitat For Humanity Ivy Tech Build Together Learn Together Mo6eff", "content": "Live TV Shows My List DonateSupport your local PBS station in our mission to inspire, enrich, and educate.Donate toWNIN PBS Support your local PBS station in our mission to inspire, enrich, and educate. Support your local PBS station in our mission to inspire, enrich, and educate. Best of PBS Passport Arts & Music Culture Documentaries & Indie Films Drama Dr. Henry Louis Gates Jr. PBS America @ 250 Food History Home & How-To News & Public Affairs Science & Nature Live TV Shows My List Donate Sign In Evansville Rotary Club Evansville Rotary Club Regional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn Together Season 2025 Episode 21 | 45m 46s Representatives from Ivy Tech and Habitat for Humanity talk about Build Together, Learn Together. Aired 06/04/2025 Evansville Rotary Club Evansville Rotary Club **Regional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn Together** Season 2025 Episode 21 | 45m 46s Representatives from Ivy Tech and Habitat for Humanity talk about Build Together, Learn Together. Representatives from Ivy Tech and Habitat for Humanity talk about the housing problems in the community, the growing need for volunteers, and establishing a foundation to Build Together and Learn Together. Aired 06/04/2025 Problems playing video?Report a Problem|Closed Captioning Feedback **Report a Problem** Before you submit an error, please consult ourVideo Help page. Problems playing video?Report a Problem|Closed Captioning Feedback **Report a Problem** Before you submit an error, please consult ourVideo Help page. Evansville Rotary Clubis a local public television program presented byWNIN PBS Partial funding provided by the Evansville Rotary Club About This Episode More Episodes You Might Also Like Evansville Rotary Club Evansville Rotary Club **Regional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn Together** Season 2025 Episode 21 | 45m 46s Representatives from Ivy Tech and Habitat for Humanity talk about the housing problems in the community, the growing need for volunteers, and establishing a foundation to Build Together and Learn Together. Aired 06/04/2025 Problems playing video?Report a Problem|Closed Captioning Feedback **Report a Problem** Before you submit an error, please consult ourVideo Help page. **Share This Video** Embed VideoEvansville Rotary ClubRegional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn TogetherS2025Ep21Fixed iFrameWidth:in pixelspxHeight:in pixelspxCopyResponsive iFrameCopy **Embed Video** Evansville Rotary Club **Regional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn Together** S2025Ep21 **Fixed iFrame** **Responsive iFrame** **Embed Video** Evansville Rotary Club **Regional Voices: Habitat for Humanity & Ivy Tech - Build Together, Learn Together** S2025Ep21 **Fixed iFrame** **Responsive iFrame** Link Copied to Clipboard **How to WatchEvansville Rotary Club** Evansville Rotary Clubis available to stream on pbs.org and the free PBS App, available on iPhone, Apple TV, Android TV, Android smartphones, Amazon Fire TV, Amazon Fire Tablet, Roku, Samsung Smart TV, and Vizio. Stream Here on PBS.org Download the PBS App Check Your Local Listings for Broadcast Schedules Providing Support for PBS.org Support for PBS provided by: Evansville Rotary Clubis a local public television program presented byWNIN PBS Partial funding provided by the Evansville Rotary Club About PBS Privacy Policy Terms of Use WNIN PBSHome Copyright ©2025Public Broadcasting Service (PBS), all rights reserved. New to PBS?Create an account or By creating an account, you acknowledge that PBS may share your information with our member stations and our respective service providers, and that you have read and understand thePrivacy PolicyandTerms of Use. Are you sure you want to remove null from My List?"}