{"id": 804, "name": "Kyiv Independent", "domain": "kyivindependent.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://kyivindependent.com/the-kyiv-independents-commenting-guidelines/", "title": "The Kyiv Independents Commenting Guidelines", "content": "20,000 peoplechose to be part of the Kyiv Independent community — thank you. About Team Jobs Advertising Store War Business Opinion Eastern Europe Video Culture Investigations War Crimes Dare to Ukraine Explaining Ukraine War Business Opinion Eastern Europe Video Culture Investigations War Crimes Dare to Ukraine Explaining Ukraine **The Kyiv Independent’s Commenting Guidelines** Share on Twitter Share on Facebook Share on LinkedIn Share via Email The Kyiv Independent is proud to be driven by our readers – the majority of our revenue comes from our readers’ support. We want to foster an environment where our content sparks civil discussion and an exchange of views between readers, both in the open comment section directly underneath articles or in our members-only Discord server. Our commenting guidelines are designed with our readers in mind. Comments that do not adhere to the guidelines will be subject to moderation. The following comments will be deleted, while authors that repeatedly spread such comments will be banned from the website: Ad hominem attacks or personal attacks that go beyond civil discussion on a given topic Vague and senseless comments that are not relevant to the subject of the article Aggressive comments or comments that use offensive or insulting language Comments that incite hatred or are discriminatory on the basis of ethnicity, sex, age, disability, etc. Comments written with the intent to mislead the reader or spread disinformation Comments that appear under multiple articles with the same wording or are copy-pasted under multiple articles Ads, pornographic material, links to external irrelevant content Please note that your first comment from a new Kyiv Independent account will be subject to moderation before being visible to other users on our website. Please allow 48 hours for this process. **News Feed** **News Feed** **Drapatyi ends tenure as Ground Forces chief, says he leaves with 'clear conscience'.** **Putin’s suspected daughter found working in anti-war galleries in Paris** **Vucic offers to help rebuild Ukrainian cities, reaffirms support for Ukraine's territorial integrity.** **Ukraine war latest: Ukraine strikes targets in Russia, including gunpowder plant** **EU, Germany boost Ukraine's energy efficiency fund with 18 million euros.** **Ukraine bracing for 'painful' reduction in US military aid after Hegseth announces cuts** **'Ukrainians have been stripped of illusion of control' — Filmmaker Kateryna Gornostai on Russia's war, cinema and reclaiming the narrative** **Zelensky urges 'stronger' EU sanctions on Russia, lower oil price cap.** **Ukrainian drones strike targets in Russia, including gunpowder plant, General Staff says.** **America’s weak strongman** **Author Yuri Andrukhovych on Ukrainian dissident art in Soviet times** **Transnistria again declares economic emergency over Russian gas cut.** **What Russia's 1 million casualties mean for Ukraine.** **Ukrainians among foreign nationals in US targeted for transfer to Guantanamo, WP reports.** **Ukraine to get $2.26 billion from UK for arms purchases, PM says.** **Russia’s nuclear deterrent against US not 'significantly' affected by Ukraine’s Operation Spiderweb, official claims.** **Russia sentences top Navalny ally Volkov to 18 years in prison in absentia.** **Ukraine grants Poland permission to exhume 1939 war graves in Lviv.** **Ukraine repatriates bodies of 1,212 fallen soldiers.** **Serbia's Vucic, Romania's Dan travel to Ukraine in their first official visits.** **NATO summit statement omits Ukraine's entry bid, $40 billion pledge, Bloomberg reports.** **Kyiv, not Kiev — Kyiv Independent community helps rename street in Oregon.** **Massive Russian drone attack kills 3, injures at least 64 in Kharkiv.** **Poland detains citizen suspected of spying for Russia.** **Ukraine's SBU releases fresh video of Operation Spiderweb, teases 'new surprises.'** **Editors' Picks** **As Russia inches closer to Dnipropetrovsk Oblast, new Ukrainian region might soon be at war** **In African universities, Russia’s war against Ukraine finds new supporters** **‘Find and destroy’ – how Ukraine’s own Peaky Blinders mastered the art of bomber drones** **Inside Russia, calls for peace come with conditions — and Kremlin talking points** News Feed Newsletters War Business Opinion Eastern Europe Video Culture Investigations War Crimes Dare to Ukraine Explaining Ukraine War Analysis National Field Report Russia’s War Human Story Company News About Contacts Team Jobs Join the Team Advertising Submit an Opinion Content Licensing J-School Store Cookie Policy Privacy Policy Comments policy News Feed Newsletters War Business Opinion Eastern Europe Video Culture Investigations War Crimes Dare to Ukraine Explaining Ukraine **Subscribe**"}