{"id": 415, "name": "Engadget", "domain": "engadget.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.engadget.com/science/space/nasa-is-shutting-down-some-official-social-media-accounts-including-the-curiosity-rovers-handle-192016918.html", "title": "Nasa Is Shutting Down Some Official Social Media Accounts Including The Curiosity Rovers Handle 192016918.html", "content": "Home NewsiOS 26Everything announced at WWDCNintendo Switch 2Summer Game Fest 2025AIAppsComputingEntertainmentMobileScienceSocial mediaSpaceStreamingTransportation iOS 26 Everything announced at WWDC Nintendo Switch 2 Summer Game Fest 2025 AI Apps Computing Entertainment Mobile Science Social media Space Streaming Transportation iOS 26 Everything announced at WWDC Nintendo Switch 2 Summer Game Fest 2025 AI Apps Computing Entertainment Mobile Science Social media Space Streaming Transportation ReviewsSmartphonesLaptops and PCsGamingHeadphonesWearablesAudio gearPhotographyTabletsHome Smartphones Laptops and PCs Gaming Headphones Wearables Audio gear Photography Tablets Home Smartphones Laptops and PCs Gaming Headphones Wearables Audio gear Photography Tablets Home Buying guidesBest VPNsBest laptopsBest headphonesBest smart homeBest gamingBest health and fitnessBest accessoriesBest lifestyle tech Best VPNs Best laptops Best headphones Best smart home Best gaming Best health and fitness Best accessories Best lifestyle tech Best VPNs Best laptops Best headphones Best smart home Best gaming Best health and fitness Best accessories Best lifestyle tech GamingNintendoPC gamingPlayStationXboxPlaydate Nintendo PC gaming PlayStation Xbox Playdate Nintendo PC gaming PlayStation Xbox Playdate Big techAmazonAppleGoogleMetaMicrosoftSamsungElon Musk Amazon Apple Google Meta Microsoft Samsung Elon Musk Amazon Apple Google Meta Microsoft Samsung Elon Musk DealsApple dealsDeals under $50 Apple deals Deals under $50 Apple deals Deals under $50 EntertainmentTV and moviesMusicStreamingYouTube TV and movies Music Streaming YouTube TV and movies Music Streaming YouTube ScienceSpaceRobotics Space Robotics Space Robotics CybersecurityVPN VPN VPN More GuidesBest streaming servicesBest wireless earbudsBest laptopsBest power banksBest robot vacuumsBest Mint alternatives Best streaming services Best wireless earbuds Best laptops Best power banks Best robot vacuums Best Mint alternatives Best streaming services Best wireless earbuds Best laptops Best power banks Best robot vacuums Best Mint alternatives Prime Day 2025Amazon Prime Day: Everything you need to know Amazon Prime Day: Everything you need to know Amazon Prime Day: Everything you need to know NewsiOS 26Everything announced at WWDCNintendo Switch 2Summer Game Fest 2025AIAppsComputingEntertainmentMobileScienceSocial mediaSpaceStreamingTransportation iOS 26 Everything announced at WWDC Nintendo Switch 2 Summer Game Fest 2025 AI Apps Computing Entertainment Mobile Science Social media Space Streaming Transportation iOS 26 Everything announced at WWDC Nintendo Switch 2 Summer Game Fest 2025 AI Apps Computing Entertainment Mobile Science Social media Space Streaming Transportation ReviewsSmartphonesLaptops and PCsGamingHeadphonesWearablesAudio gearPhotographyTabletsHome Smartphones Laptops and PCs Gaming Headphones Wearables Audio gear Photography Tablets Home Smartphones Laptops and PCs Gaming Headphones Wearables Audio gear Photography Tablets Home Buying guidesBest VPNsBest laptopsBest headphonesBest smart homeBest gamingBest health and fitnessBest accessoriesBest lifestyle tech Best VPNs Best laptops Best headphones Best smart home Best gaming Best health and fitness Best accessories Best lifestyle tech Best VPNs Best laptops Best headphones Best smart home Best gaming Best health and fitness Best accessories Best lifestyle tech GamingNintendoPC gamingPlayStationXboxPlaydate Nintendo PC gaming PlayStation Xbox Playdate Nintendo PC gaming PlayStation Xbox Playdate Big techAmazonAppleGoogleMetaMicrosoftSamsungElon Musk Amazon Apple Google Meta Microsoft Samsung Elon Musk Amazon Apple Google Meta Microsoft Samsung Elon Musk DealsApple dealsDeals under $50 Apple deals Deals under $50 Apple deals Deals under $50 EntertainmentTV and moviesMusicStreamingYouTube TV and movies Music Streaming YouTube TV and movies Music Streaming YouTube ScienceSpaceRobotics Space Robotics Space Robotics CybersecurityVPN VPN VPN More GuidesBest streaming servicesBest wireless earbudsBest laptopsBest power banksBest robot vacuumsBest Mint alternatives Best streaming services Best wireless earbuds Best laptops Best power banks Best robot vacuums Best Mint alternatives Best streaming services Best wireless earbuds Best laptops Best power banks Best robot vacuums Best Mint alternatives Prime Day 2025Amazon Prime Day: Everything you need to know Amazon Prime Day: Everything you need to know Amazon Prime Day: Everything you need to know News Reviews Buying guides Gaming Big tech Deals Entertainment Science Cybersecurity More Guides Prime Day 2025 Nintendo Switch 2 review Android 16 has arrived WWDC 2025: Everything Apple announced Prime Day 2025: What you need to know How to buy the Nintendo Switch 2 **NASA is shutting down some official social media accounts, including the Curiosity rover's handle** **The organization says it has over 400 accounts across 15 different platforms.** NASA isshutting downseveral social media accounts run by the Science Mission Directorate, including the official Mars Curiosity Rover account on X. The organization says it made the decision in order to \"make its work more accessible to the public, avoiding the potential for oversaturation or confusion.\" The \"social media consolidation project\" is concentrated in part on X, where there are dozens NASA accounts affiliated with specific missions and areas of research. So far29 accountsare being archived or consolidated with other accounts, including@MarsCuriosityand@NASAPersevere, the two accounts for the organization's Mars rovers. Posts about both missions will now come from the more general@NASAMars. Some social media accounts will also \"rebranded to better align with the new strategic framework,\" NASA says, \"reflecting a broader scope or a more direct connection to core NASA initiatives.\" With \"over 400 individual accounts across 15 platforms\" it's not exactly unreasonable that NASA is trying to streamline things, but there is some much appreciated specificity lost when news and information is coming from a more general account. NASA's Curiosity is beloved and the agency's research into Mars was likely more well-known because the social media account made identifying with the rover easier. Beyond social media accounts, NASA could be heading into next year with far fewer resources in general. The Trump administration'sproposed 2026 budgetincludes around a $6 billion cut to NASA's funding. The limited resources could lead to multiple planned missions being cancelledThe Washington Postreports, including sending a probe to Venus, taking mineral samples from asteroids and studying gravitational waves with the European Space Agency. Subscribe to our newsletter: - A twice-weekly dose of the news you need Please enter a valid email address Please select a newsletter By subscribing, you are agreeing to Engadget'sTermsandPrivacy Policy. Follow Us About Us Reprints and Permissions TermsandPrivacy Policy Privacy Dashboard Trademarks Advertise About Our Ads"}