{"id": 618, "name": "Grit Daily News", "domain": "gritdaily.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://gritdaily.com/ancient-civilizations-dr-richard-hansen-in-guatemala/", "title": "Ancient Civilizations Dr Richard Hansen In Guatemala", "content": "**GRITDAILY®** **** **GRITDAILY®** **** **** NewsFinanceBlockchainTechEntertainmentConsumerClean EnergyGadgets & AppsReal EstateE-commerce Finance Blockchain Tech Entertainment Consumer Clean Energy Gadgets & Apps Real Estate E-commerce Finance Blockchain Tech Entertainment Consumer Clean Energy Gadgets & Apps Real Estate E-commerce LeadershipReputation ManagementGrit Daily’s Top PicksLegalIndustry CommentaryPersonal DevelopmentDiversity Reputation Management Grit Daily’s Top Picks Legal Industry Commentary Personal Development Diversity Reputation Management Grit Daily’s Top Picks Legal Industry Commentary Personal Development Diversity Entrepreneur LifestyleWomen EntrepreneursLifestylePersonal FinanceTravel Women Entrepreneurs Lifestyle Personal Finance Travel Women Entrepreneurs Lifestyle Personal Finance Travel Podcasts & ShowsStartup Show PodcastFrom the Ground Up Startup Show Podcast From the Ground Up Startup Show Podcast From the Ground Up EventsGrit Daily House Grit Daily House Grit Daily House ResourcesContributor LoginAgency MembershipLeadership NetworkMedia DatabaseEditorial Guidelines Contributor Login Agency Membership Leadership Network Media Database Editorial Guidelines Contributor Login Agency Membership Leadership Network Media Database Editorial Guidelines Awards × News Entrepreneurship Leadership Editorial Guidelines Advertise on Grit Daily Startup Show Podcast Awards **Exploring Ancient Civilizations: The Work of Dr. Richard Hansen in Guatemala** Richard Hansen, PhD, is the president and founder of the Foundation for Anthropological Research & Environmental Studies (FARES), the director of the Mirador Basin Project, and a research professor at Idaho State University. For the last 43 years, Dr. Hansen has been pivotal in the exploration of the Mirador-Calakmul Karst Basin, a remote region of Guatemala and southern Mexico encompassing 1.6 million acres of mostly pristine tropical forest. **About Dr. Hansen** Since 1992, Dr. Hansen has distinguished himself in academia as a professor at several universities, including the University of Utah and the University of California, Los Angeles (UCLA). At UCLA, he received a PhD in archaeology as a National Graduate Fellow and Jacob Javits Scholar. He was also recognized as the Outstanding Graduate Student of the University and has received many other university and national awards. He is currently a research professor in the Department of Anthropology at Idaho State University. In this capacity, he conducts classes in remote jungle sites in Guatemala that are a two to three-day hike from the nearest road. Dr. Hansen’s students learn archaeological techniques and practices through hands-on experience. Dr. Hansen started on the path to his successful career in 1978, when he graduated with honors from Brigham Young University in Provo, Utah, earning a Bachelor of Science in archaeology and Spanish. He also received a Master of Science in anthropology at BYU in 1984. **Vital Anthropological Research in Guatemala** Dr. Hansen is the director of the Mirador Basin Project, one of the largest archaeological projects in the history of Guatemala. Beyond trying to “understand the dynamics of these ancient cultures,” the project also invests significant time and millions of dollars in the conservation of the untouched jungle. The project is committed to protecting the last intact tropical forest remaining in Central America. “The principal focus of our work is the investigation, conservation and responsible development of that area. There is tremendous potential there for the world, such as a huge ancient city named Balamnal that no one’s even been to before,” Dr. Hansen says. The project is committed to developing the communities around the basin. Dr. Hansen oversees significant scientific research, which includes biology, geology, geomorphology, hydrology, herpetology, archaeology, anthropology, ornithology, and entomology. “We’re doing all those sciences simultaneously with scholars from all over the world,” Dr. Hansen explains. Using Light Detection and Ranging (LiDAR) technology, the project has discovered 964 sites that form 417 ancient cities, towns, and villages within the geographical confines of the Basin. LiDAR can penetrate the tree canopy and uncover the structures hiding in the dense jungle. Some of these sites date back to 1000 B.C., and the impressive discoveries and investigations are allowing the study of artifacts, art, and architecture that haven’t been seen for more than 2,500 years. The Mirador Basin Project and the FARES Foundation, together with the government of Guatemala, are adding “a new page to the history of humanity.” For Dr. Hansen’s successful endeavors, he was awarded the Order of the Quetzal, the highest honor in Guatemala, and the Order of the Guatemalan Cultural Heritage by two presidents of Guatemala, in addition to numerous other national and international awards from Europe and Latin America. He was honored as one of the “24 individuals that changed Latin America” by the Latin Trade Association and was named Environmentalist of the Year for Latin America in 2008 by the Latin Bravo Business Association. **A Future Preserving the Past** “This area is worth protecting. It’s worth conserving for the future,” Dr. Hansen says in regard to the Mirador-Calakmul Karst Basin. Dr. Hansen plans to help the Guatemalan government, community, and indigenous associations establish the area as a natural and cultural sanctuary to permanently preserve the area while simultaneously developing natural prosperity for the country. He is actively searching for individuals to mentor who can continue this important work in the future. “We have to pay attention to history. We have to pay attention so as not to repeat the follies and errors of the past so we can start a prosperous and productive future,” Dr. Hansen says. Jordan French is theFounder and Executive Editor of Grit Daily Group, encompassing Financial Tech Times, Smartech Daily, Transit Tomorrow, BlockTelegraph, Meditech Today, High Net Worth magazine, Luxury Miami magazine, CEO Official magazine, Luxury LA magazine, and flagship outlet, Grit Daily. The champion of live journalism, Grit Daily's team hails from ABC, CBS, CNN, Entrepreneur, Fast Company, Forbes, Fox, PopSugar, SF Chronicle, VentureBeat, Verge, Vice, and Vox. An award-winning journalist, he was on the editorial staff at TheStreet.com and a Fast 50 and Inc. 500-ranked entrepreneur with one sale. Formerly an engineer and intellectual-property attorney, his third company, BeeHex, rose to fame for its \"3D printed pizza for astronauts\" and is now a military contractor. A prolific investor, he'sinvestedin 50+ early stage startups with 10+ exits through 2023. **#Features** **One Title Man: Rajesh Michael Lalloo’s Vision for a New Hollywood Beyond Borders** **Sports Science Drives Randi R. Baptiste’s Mission to Protect Young Athletes** **Dr. Duncan Charters Advocates for the Power of Language for Global Unity** **Victor Garayar: Driving Customer Success Through Conversational AI Innovation** **Exploring Ancient Civilizations: The Work of Dr. Richard Hansen in Guatemala** **MoreGD News** **GRITDAILY®** **** **GRITDAILY®** **** **** About Us Advertise Pitch News User Agreement Privacy Policy Team Cookie Policy Events Subscribe Editorial Policy Contact info Terms & Conditions Get Grit Daily’s latest stories every day in your email. CasinoChan athttps://casinochan-onlinecasino.com/– your one-stop online casino in Canada 2023! Epic slot & table games, warm welcome bonuses, and all of that – mobile-ready. scatters Thank you for signing up! © Grit Daily Group. All Rights Reserved."}