{"id": 1478, "name": "Tomdispatch.com", "domain": "tomdispatch.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://tomdispatch.com/books/in-the-shadows-of-the-american-century-the-rise-and-decline-of-u-s-global-power/", "title": "In The Shadows Of The American Century The Rise And Decline Of U S Global Power", "content": "A regular antidote to the mainstream media Facebook Twitter Reddit RSS Feed Facebook Twitter Reddit RSS Feed Home Archive Authors Books About Contact Donate **In the Shadows of the American Century: The Rise and Decline of U.S. Global Power** In a completely original analysis, prize-winning historian Alfred W. McCoy explores America’s rise as a world power—from the 1890s through the Cold War—and its bid to extend its hegemony deep into the twenty-first century through a fusion of cyberwar, space warfare, trade pacts, and military alliances. McCoy then analyzes the marquee instruments of US hegemony—covert intervention, client elites, psychological torture, and worldwide surveillance. Peeling back layers of secrecy, McCoy exposes a military and economic battle for global domination fought in the shadows, largely unknown to those outside the highest rungs of power. Can the United States extend the “American Century” or will China guide the globe for the next hundred years? McCoy devotes his final chapter to these questions, boldly laying out a series of scenarios that could lead to the end of Washington’s world domination by 2030. Alfred W. McCoy, aTomDispatchregular,is the Harrington professor of history at the University of Wisconsin-Madison. He is the author ofIn the Shadows of the American Century: The Rise and Decline of U.S. Global Power. His most recent book isTo Govern the Globe: World Orders and Catastrophic Change(Dispatch Books). His next book,Cold War on Five Continents: The Geopolitics of Empire & Espionage, will be out in December. Part of theDispatch Book series.Buy the book. **Reviews/Praise** “In the Shadows of the American Centurypersuasively argues for the inevitable decline of the American empire and the rise of China. Whether or not one is a believer in American power, the case that Alfred McCoy makes—that much of America’s decline is due to its own contradictions and failures—is a sad one. He provides a glimmer of hope that America can ease into the role of a more generous, more collaborative, if less powerful, world player. Let’s hope that Americans will listen to his powerful arguments.” “[A] brilliant and deeply informed must-read for anyone seriously interested in geopolitics, the history of Empire, and the shape of the future.” “What is the character of this American empire?” Alfred McCoy asks at the outset of this provocative study. His answer not only limns the contours of the American imperium as it evolved during the twentieth century, but explains why its days are quite likely numbered. This is history with profound relevance to events that are unfolding before our eyes.” “Alfred McCoy offers a meticulous, eye-opening account of the rise, since 1945, and impending premature demise of the American Century of world domination. As the empire’s political, economic, and military strategies unravel under cover of secrecy, America’s neglected citizens would do well to read this book.” “Sobering reading for geopolitics mavens and Risk aficionados alike…” “McCoy’s detailed, panoramic analysis of the past, present, and future of the American empire covers all spheres of activity including not just land, sea, air, space, and cyberspace, but also the netherworld of covert operations — and seasons all of this with some fascinating personal vignettes. His new book,In The Shadows of the American Century, joins the essential short list of scrupulous historical and comparative studies of the United States as an awesome, conflicted, technologically innovative, routinely atrocious, and ultimately hubristic imperial power.” “One of our best and most underappreciated historians takes a hard look at the truth of our empire, both its covert activities and the reasons for its impending decline.” “In the Shadows of the American Centuryis a valuable contribution to geopolitical discourse that draws important lessons from history.” “McCoy’s latest book,In the Shadow of the American Century: The Rise and Decline of U.S. Global Power, provides an autopsy on a dying empire, which has squandered its moral capital by promoting wide-scale torture and mass surveillance….The end of empire scenarios relayed by McCoy in dark terms could in turn provide positive opportunities for societal change as the necessity for constant war is removed.” **Newsletter** **Recent Articles** Freedom of Movement and Global ApartheidJune 10, 2025 Is Nuclear Winter a Climate Issue?June 8, 2025 A World Without iPhones?June 5, 2025 The War on Trans PeopleJune 3, 2025 Upside-Down WorldJune 1, 2025 Home Archive Authors Books About Contact Donate Privacy Policy Terms of Service Facebook Twitter Reddit RSS Feed"}