{"id": 1657, "name": "Die Zeit", "domain": "zeit.de", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.zeit.de/gesellschaft/zeitgeschehen/2025-06/lina-e-bundesanwaltschaft-linksextremismus-linksextremistische-gruppe#comments", "title": "Lina E Bundesanwaltschaft Linksextremismus Linksextremistische Gruppe#comments", "content": "suchenSuche Nicht mehr suchen, Antworten findenBETAWir entwickeln derzeit eine neue Suche, die sich noch in der Beta-Phase befindet.Jetzt ausprobieren **Nicht mehr suchen, Antworten finden** Wir entwickeln derzeit eine neue Suche, die sich noch in der Beta-Phase befindet. **Nicht mehr suchen, Antworten finden** Wir entwickeln derzeit eine neue Suche, die sich noch in der Beta-Phase befindet. **Nicht mehr suchen, Antworten finden** Wir entwickeln derzeit eine neue Suche, die sich noch in der Beta-Phase befindet. Startseite Exklusive Artikel Politik ZEITmagazin Wirtschaft Wochenmarkt Geld Wochenende Gesellschaft Arbeit Kultur Campus Pol. Feuilleton Wissen Gesundheit Familie Digital Entdecken Mobilität Sinn Hamburg Sport Österreich Schweiz Podcasts Video Newsletter Schlagzeilen Daten und Visualisierung Aktuelle ZEIT-Ausgabe DIE ZEIT Ausgabenarchiv Spiele Shop Bucheditionen Geschenke HeyStudium Studium-Interessentest Suchmaschine für Studiengänge Hochschulranking BOA Berufstest Jobs im ZEIT ONLINE Stellenmarkt BOA Berufstest academics academics.com GoodJobs e-fellows.net Abo Akademie Jobs Partnersuche Im Einsatz für die Demokratie FH Dortmund Professur Karriere in Familienunternehmen No Other Land How it works: Studium und Job ZEIT LEO Weltretter-Mission Deutsches Schulportal ZEIT für Forschung ZEIT für X Danke, dass Sie ZEIT ONLINE nutzen.Melden Sie sich jetzt mit Ihrem bestehenden Account an oder testen Sie unser digitales Abo mit Zugang zu allen Artikeln.Abo testen Danke, dass Sie ZEIT ONLINE nutzen. Melden Sie sich jetzt mit Ihrem bestehenden Account an oder testen Sie unser digitales Abo mit Zugang zu allen Artikeln. Danke, dass Sie ZEIT ONLINE nutzen. Melden Sie sich jetzt mit Ihrem bestehenden Account an oder testen Sie unser digitales Abo mit Zugang zu allen Artikeln. Anmelden ErscheinungsbildAutomatischHellDunkel Erscheinungsbild Automatisch Hell Dunkel Erscheinungsbild Automatisch Hell Dunkel **Gruppe um Lina E.:Bundesanwaltschaft klagt sieben mutmaßliche Linksextremisten an** **Artikelzusammenfassung** Die Bundesanwaltschaft hat sieben mutmaßliche Linksextremisten, darunter den mutmaßlichen Anführer Johann G., aus dem Umfeld der bereits verurteilten Linksextremistin Lina E. angeklagt. Der Staatsschutzsenat des Oberlandesgerichts Dresden muss über einen möglichen Prozess entscheiden. Die Gruppe wird beschuldigt, tatsächliche oder vermeintliche Neonazis in Deutschland überfallen zu haben, wobei drei der Männer des versuchten Mordes verdächtigt werden. Die Gruppe war auch an Angriffen in Budapest beteiligt. Ein weiteres mutmaßliches Mitglied, Maja T., sitzt in Budapest in Untersuchungshaft. Lina E. verbüßt bereits eine Haftstrafe wegen Mitgliedschaft in einer kriminellen Vereinigung und gefährlicher Körperverletzung. Fanden Sie die Zusammenfassung hilfreich? Aus dem Umfeld der bereits verurteilten Linksextremistin Lina E. sind sieben weitere mutmaßliche Linksextremisten von derBundesanwaltschaftangeklagt worden. Unter ihnen ist der mutmaßliche Anführer der Gruppe,Johann G. – ein früherer Lebensgefährte von Lina E.Die Karlsruher Behörde wirft sechs von ihnen die Mitgliedschaft und einem die Unterstützung einer linksextremistischen kriminellen Vereinigung vor. Der Staatsschutzsenat des Oberlandesgerichts Dresden muss nun entscheiden, ob und wann es zu einem Prozess kommt. Die Gruppe soll laut der Bundesanwaltschafttatsächliche oder vermeintliche Neonazis überfallen haben.Acht konkrete Überfälle in Deutschland listet die Bundesanwaltschaft auf, an Bahnhöfen, Kneipen oder in Innenstädten. Die Tatorte lagen vor allem in Thüringen und Sachsen – die Gruppe hatte sich laut Bundesanwaltschaft in und um Leipzig gegründet. Gegen drei der Männer bestehe der hinreichende Verdacht des versuchten Mordes. Sie schlugen teilweise mit Hammer und Eisenstange zu. Vier der Angeschuldigten sitzen aktuell in Untersuchungshaft. Sie wurden zwischen Oktober und Januar festgenommen. Die drei anderen Angeschuldigten sind auf freiem Fuß. Die Bundesanwaltschaft hat die Gruppe schon länger im Visier und wirft ihnen vor, eine militante linksextremistische Ideologie zu teilen. Sie habe die Aktionen intensiv vorbereitet und unter anderem vorab Lebensgewohnheiten der ausgewählten Opfer ausgespäht. Außerdem habe es Schulungen gegeben, bei denen Kampftechniken vermittelt und Angriffsszenarien trainiert wurden. **Gruppe soll auch an Überfällen in Budapest beteiligt gewesen sein** Die Gruppe war laut Bundesanwaltschaft überregional vernetzt und soll auch an mehreren Angriffen in Budapest rund um den sogenannten \"Tag der Ehre\" 2023 beteiligt gewesen sein. Zu der Veranstaltung reisen Rechtsextremisten aus ganz Europa jedes Jahr in die ungarische Hauptstadt. Im Zusammenhang mit dem Überfall in Budapest hatten sichmehrere weitere bis dahin untergetauchte Personen im Januar den Behörden gestellt. Ihre Verteidiger wollten eine Auslieferung nach Ungarn verhindern und forderten Strafverfahren in Deutschland. **Was jetzt? – Der tägliche Morgenüberblick** Starten Sie mit unserem kurzen Nachrichten-Newsletter in den Tag. Erhalten Sie zudem freitags den US-Sonderletter \"Was jetzt, America?\" sowie das digitale Magazin ZEIT am Wochenende. Mit Ihrer Registrierung nehmen Sie dieDatenschutzerklärungzur Kenntnis. **Vielen Dank! Wir haben Ihnen eine E-Mail geschickt.** **Diese E-Mail-Adresse ist bereits registriert.** Ein weiteres mutmaßliches Mitglied der Gruppe, Maja T., sitzt derzeit in Budapest in Untersuchungshaft. Auch Maja T. wird vorgeworfen, an den gewalttätigen Angriffen auf tatsächliche und vermeintliche Rechtsextremisten in Budapest beteiligt gewesen zu sein. Maja T. war im Dezember 2023 in Berlin festgenommen worden. Ende Juni 2024 erklärte das Kammergericht Berlin die Auslieferung nach Ungarn für zulässig – noch in derselben Nacht wurde die Person nachBudapestausgeflogen, obwohl beim Bundesverfassungsgericht ein Eilantrag gegen die Überstellung vorlag. Am Morgen des 28. Juni untersagte das Bundesverfassungsgericht die Auslieferung – da befand sich T. jedoch bereits in Ungarn. Anfang Juni 2025kündigte Maja T. aus Protest gegen die Isolationshaft einen Hungerstreik an. Lina E. selbst sitzt bereits eine Haftstrafe ab. Das OLGDresdenhatte sie 2023 unter anderem wegen der Mitgliedschaft in einer kriminellen Vereinigung und gefährlicher Körperverletzungschuldig gesprochen. Im März bestätigte der Bundesgerichtshof die Verurteilung,sie ist damit rechtskräftig. Wie lange E. noch im Gefängnis bleiben muss, war zunächst unklar. Unter anderem wird ihre Untersuchungshaft angerechnet. **Gruppe um Lina E.** **Z+ (abopflichtiger Inhalt);Menschenrechte:Orbáns Opfer** **Z+ (abopflichtiger Inhalt);Menschenrechte:Orbáns Opfer** **Z+ (abopflichtiger Inhalt);Urteil gegen Lina E.:Harmlos sind sie lange nicht mehr** **Z+ (abopflichtiger Inhalt);Urteil gegen Lina E.:Harmlos sind sie lange nicht mehr** **Z+ (abopflichtiger Inhalt);Prozess um Lina E.:\"Du hast uns verraten!\"** **Z+ (abopflichtiger Inhalt);Prozess um Lina E.:\"Du hast uns verraten!\"** **Seitennavigation** **Jetzt teilen auf:** **Teilen** Facebook X Flipboard WhatsApp Telegram Facebook Messenger Pocket E-Mail Bundesanwaltschaft, Linksextremismus, Justiz, Neonazi, Untersuchungshaft, Dresden, Aktuelle Themen **Navigationspfad** Aktuelle Nachrichten Gesellschaft Schlagzeilen Gruppe um Lina E. : Bundesanwaltschaft klagt sieben mutmaßliche Linksextremisten an Impressum Hilfe & Kontakt Unternehmen Karriere Presse Jobs Shop ZEIT REISEN Inserieren Mediadaten Bildrechte Rechte & Lizenzen AGB Datenschutz Privacy Einstellungen Cookies & Tracking Utiq verwalten Abo kündigen **Merkliste** Hier können Sie interessante Artikel speichern, um sie später zu lesen und wiederzufinden. Sie haben bereits ein Konto?Hier anmelden."}