{"id": 2169, "name": "Vos Iz Neias", "domain": "vinnews.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://vinnews.com/2025/06/09/investigative-researcher-ryan-mauro-warns-of-growing-anti-american-anti-israel-extremism-among-pro-palestinian-groups/#comments", "title": "Investigative Researcher Ryan Mauro Warns Of Growing Anti American Anti Israel Extremism Among Pro Palestinian Groups", "content": "Home Jewish Israel US Obituaries Contact Podcast Advertiser Disclosure About Advertiser Disclosure Home Jewish Israel US Obituaries Contact Podcast Advertiser Disclosure FLORIDA Happenning Now Israel Jewish News Ticker NY US Video World **Investigative Researcher Ryan Mauro Warns of Growing Anti-American, Anti-Israel Extremism Among Pro-Palestinian Groups** ByReuven Rosenfeld LONG ISLAND, NY (VINnews)— In a recent interview with podcast host Alan Skorski, investigative researcher Ryan Mauro of the Capital Research Center sounded the alarm on what he described as an increasingly dangerous coalition of extremist groups operating in the United States under the banner of pro-Palestinian activism Mauro, who has spent years researching radical networks including Students for Justice in Palestine (SJP), Columbia University Apartheid Divest (CUAD), and the Marxist-linked Popular Front for the Liberation of Palestine (PFLP), claims that nearly 500 groups across the country are united not only by hostility toward Israel, but by a broader agenda to undermine the United States. “Many of these extremist groups hate Israel because of America—not the other way around,” Mauro told Skorski, challenging what he says is a commonly held assumption about the motivations behind anti-Israel activism. Among the most concerning groups identified in his research is Unity of Fields (UoF), a Palestinian group that explicitly promotes militant protest tactics and has engaged in direct confrontations with U.S. police. Mauro said the group’s stated mission is to “disrupt and dismantle Zionism and U.S. imperialism through direct militant actions.” The group frequently deploys slogans such as “No cops, no KKK, no Fascist USA!” and refers to the NYPD as “IOF-trained pigs,” a reference to the Israel Defense Forces. In a recent paper titled Marching Towards Violence, Mauro reports that anarchist groups are increasingly aiming to operate as an “anti-police wannabe insurgency.” He said that his research tracked 150 of the most active “pro-Palestinian” groups on social media in the 15 months before and after the October 7 Hamas-led terror attack in Israel. The findings showed a 186% increase in anti-American rhetoric and a more than 3,000% rise in posts calling for violence on U.S. soil. Mauro also warned of an unlikely alliance between far-left and far-right elements seeking to exploit civil unrest in the U.S. “They believe that once the system collapses, their ideology will rise to the top,” he said. “It’s an accelerationist strategy.” Despite what he describes as a current moment of unity among radical groups, Mauro predicts internal fractures ahead. He believes Indian Hindus may become the next target of the radical coalition due to tensions between India and Pakistan. “Once these groups pivot to attacking Hindus, it will become clear they were never about Palestine,” Mauro said. “They jump from cause to cause to create chaos and insurgency in America.” Mauro also emphasized the threat posed by far-right antisemitism, pointing to conspiracy theories spread by figures such as Tucker Carlson and controversial statements from conservative commentator Candace Owens. “The far-left’s antisemitism is dangerous, but the far-right can’t be ignored,” Mauro said. “We’re seeing toxic ideologies from both ends feeding into the same destructive current.” Mauro’s research, including publications such as When Charities Betray America: How “Pro-Palestinian” Protest Groups Promote Anti-Americanism and Pro-Hamas Extremism Taking Root in America, forms part of an expanding body of work examining domestic extremism and its links to global terror movements. **Follow VINnews for Breaking News Updates** **Connect with VINnews** Δ Δ This man speaks powerful truths! Senior Houthi Official Threatens To Disrupt Netanyahu’s Son’s Wedding With ‘Deterrent Punishment’ Tragic Accident Claims Life of Grandson of Rav Elya Ber Wachtfogel in South Fallsburg The Trump-Musk Reconciliation and Machzir Gerushaso EL AL Faces $169M Class Action Lawsuit Over Wartime Price Gouging Allegations Baghdad Jewish Family Sues France For $20M In Rent On Former Home Used As Embassy Jeff Bezos Shuts Down 5th Ave for Lavish Crane Delivery to $119M Penthouse24 comments|posted on June 7, 2025 Orthodox Jewish Family Sues Boca Raton HOA for Religious Discrimination53 comments|posted on June 6, 2025 Mamdani Gains Surprising Hearing from Satmar Leader in NYC Mayoral Race162 comments|posted on June 10, 2025 $36.9M Fort Hamilton Parkway Bridge Project Underway in Brooklyn36 comments|posted on June 9, 2025 Brooklyn Café Accused of Refusing Service to Israeli Man62 comments|posted on June 8, 2025 Jewish Child Assaulted in Brooklyn: Mayor Adams Condemns “Vile” Attack21 comments|posted on June 6, 2025 Israeli Navy Tows Activist Vessel Bound for Gaza; Thunberg Among Passengers25 comments|posted on June 8, 2025 Lashon Harah Policy Privacy Policy"}