{"id": 782, "name": "KSBY - San Luis Obispo News", "domain": "ksby.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ksby.com/news/california-news/california-governor-asks-court-to-block-trump-administration-from-using-troops-in-immigration-raids", "title": "California Governor Asks Court To Block Trump Administration From Using Troops In Immigration Raids", "content": "Menu NewsLocal NewsAmerica VotesCalifornia NewsNational NewsWorld NewsKristin Smart CaseFire WatchPositively Central CoastNews Tips Local News America Votes California News National News World News Kristin Smart Case Fire Watch Positively Central Coast News Tips Local News America Votes California News National News World News Kristin Smart Case Fire Watch Positively Central Coast News Tips VideoWatch Live NewscastsKSBY News on YouTube Watch Live Newscasts KSBY News on YouTube Watch Live Newscasts KSBY News on YouTube In Your CommunitySeason of Hope6 Things to DoContestsCommon CentsHealthBreak by Dignity HealthEquity, Diversity, and Inclusion at KSBYGive a Child a BookNews Literacy ProjectUnited Way Season of Hope 6 Things to Do Contests Common Cents HealthBreak by Dignity Health Equity, Diversity, and Inclusion at KSBY Give a Child a Book News Literacy Project United Way Season of Hope 6 Things to Do Contests Common Cents HealthBreak by Dignity Health Equity, Diversity, and Inclusion at KSBY Give a Child a Book News Literacy Project United Way WeatherInteractive RadarDaily ForecastHourly ForecastLocal CamsCalifornia DroughtWeather App Interactive Radar Daily Forecast Hourly Forecast Local Cams California Drought Weather App Interactive Radar Daily Forecast Hourly Forecast Local Cams California Drought Weather App Traffic SportsFriday Night Highlights Friday Night Highlights Friday Night Highlights Don't Waste Your Money About UsOn KSBYContact UsNews TeamJobs at KSBYKSBY AppsLocal Business Resources On KSBY Contact Us News Team Jobs at KSBY KSBY Apps Local Business Resources On KSBY Contact Us News Team Jobs at KSBY KSBY Apps Local Business Resources Sign In Newsletters Sign Out Manage Emails Apps Careers Search In Your Community News Local News Microclimate Weather News Team Contact Us Video Fire Watch 6 Things to Do Contests **Actions** Facebook Tweet Email **California governor asks court to block Trump administration from using troops in immigration raids** LOS ANGELES (AP) — California Gov.Gavin Newsomasked a federal court Tuesday to block the Trump administration from using the National Guard and Marines to assist withimmigration raids in Los Angeles, saying it would only heighten tensions. Newsom filed the emergency request after President Donald Trumpordered the deploymentto LA of roughly 4,000 National Guard members and 700 Marinesfollowing protestsof the president’s stepped-up enforcement of immigration laws. The demonstrations in the city of 4 million people have largely been centered in several blocks of downtown. The federal government said Newsom was seeking an unprecedented and dangerous order that would interfere with its ability to carry out enforcement operations. A judge set a hearing for Thursday. WATCH: How three days of protests unfolded in Los Angeles in dramatic images The governor's request said it was in response to a change in orders for the Guard members, who were originally deployed to protect federal buildings. The court documents said sending troops on immigration raids would only escalate tensions and promote civil unrest. The Marines and another 2,000 National Guard troopswere ordered to LAon Monday, adding toa military presence that local officialsandNewsom do not wantand that the police chief says makes it harder to handle the protests safely. Marine CorpsGen. Eric Smithsaid Tuesday that the Marines deployed to the area had not yet been called to respond to the protests and were there only to protect federal officials and property. The Marines were trained for crowd control but have no arrest authority, Smith told a budget hearing on Capitol Hill. Paul Eck, deputy general counsel in the California Military Department, said the agency was informed that the Pentagon plans to direct the California National Guard to start providing support for immigration operations. That support would include holding secure perimeters around areas where raids are taking place and securing streets for immigration agents, he said in the governor's emergency request. According to U.S. officials, the California Guard members who were deployed were authorized to provide protection and secure streets and perimeters around areas where enforcement actions are taking place. The officials, who spoke on condition of anonymity to discuss military operations, said the Guard members are not participating in any of the enforcement actions, but are providing security and have already been doing some of those missions in the Los Angeles area. Trump says he's open to using Insurrection Act Trump left open the possibility of invoking the Insurrection Act, which authorizes the president to deploy military forces inside the U.S. to suppress rebellion or domestic violence or to enforce the law in certain situations. It's one of the most extreme emergency powers available to a U.S. president. “If there’s an insurrection, I would certainly invoke it. We’ll see,” he said Tuesday from the Oval Office. “But I can tell you last night was terrible, and the night before that was terrible.” Trumphas described Los Angeles in dire terms that Mayor Karen Bass and Newsom say arenowhere close to the truth. While protesters blocked a major freeway and set cars on fire over the weekend, the demonstrations in the city of 4 million people have largely been centered in several blocks of downtown. On Monday, they were far less raucous, with thousands of people peacefully attending a rally at City Hall and hundreds more protesting outside a federal complex that includes a detention center where some immigrants are being held following workplace raids across the city. Los Angeles police said they made over 100 arrests Monday evening, mostly for failing to disperse in the downtown area. One person was arrested for assault with a deadly weapon and two police officers were injured, the department said. Obscene slogans directed at Trump and federal law enforcement remained scrawled across several buildings. At the Walt Disney Concert Hall, workers were busy washing away graffiti Tuesday morning. In nearby Santa Ana, armored Guard vehicles blocked a road leading to federal immigration and government offices. Workers swept up plastic bottles and broken glass. Sending in the military is the latest step in theadministration’s immigration crackdownas Trump pursues the mass deportations he promised last year during the presidential campaign. The protests have been driven by anger over enforcement that critics say is breaking apart migrant families. Defense Secretary Pete Hegsethsuggested Tuesday that the use of troops inside the U.S. willcontinue to expand. “I think we’re entering another phase, especially under President Trump with his focus on the homeland, where the National Guard and Reserves become a critical component of how we secure that homeland,” he said on Capitol Hill. Los Angeles officials say police don't need help The mayor and the governor say Trump is putting public safety at risk byadding military personnel, even though police say they don’t need the help. Los Angeles Police Chief Jim McDonnell said he was confident in the police department’s ability to handle large-scale demonstrations and that the Marines’ arrival without coordinating with the police department would present a “significant logistical and operational challenge.” The protests began Friday after federal immigration authorities arrested more than 40 people across Los Angeles and continued over the weekend as crowds blocked a major freeway and set self-driving cars on fire.Police respondedwith tear gas, rubber bullets and flash-bang grenades. Demonstrations have spreadto other cities nationwide, including San Francisco, as well as Dallas and Austin, Texas. Authorities in Austin said police used pepper spray balls and tear gas to disperse a crowd that threw rocks and bottles at officers Monday, injuring four. LA response takes stage on Capitol Hill The Pentagon said deploying the National Guard and Marinescosts $134 million.That figure came out Tuesday just after Hegseth engaged in a testy back-and-forth about the costs during a congressional hearing. The defense secretary defended Trump’sdecision to send the troops, saying they are needed to protect federal agents doing their jobs. Meanwhile, Democratic members of California’s congressional delegation on Tuesday accused the president of creating a “manufactured crisis” with his orders to send in troops. On Monday, California Attorney General Rob Bonta filed a lawsuit over the use of National Guard troops following the first deployment, seeking an order declaring Trump’s use of the Guard unlawful and asking for a restraining order to halt the deployment. Trump said the city would have been “completely obliterated” if he had not deployed the Guard. U.S. officials said the Marineswere needed to protect federal buildings and personnel, including immigration agents. Despite their presence, there has been limited engagement so far between the Guard and protesters while local law enforcement implements crowd control. The deployment appeared to be the first time in decades that a state’s National Guardwas activatedwithout a request from its governor, a significant escalation against those who have sought to hinder theadministration’s mass deportationefforts. The last time the National Guard was activated without a governor's permission was in 1965, when President Lyndon B. Johnson sent troops to protect a civil rights march in Alabama, according to the Brennan Center for Justice. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News Weather Sports In Your Community Contests Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact ksbynews ksbynews KSBY"}