{"id": 1650, "name": "YouMatter.World", "domain": "youmatter.world", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://youmatter.world/fr/categorie-economie-business/csrd-80-des-entreprises-sorties-du-champ-dapplication-du-reporting-de-durabilite/", "title": "Csrd 80 Des Entreprises Sorties Du Champ Dapplication Du Reporting De Durabilite", "content": "Le médiaÉco & businessEnvironnementSociétéTerritoiresDossiersPodcastsDictionnaire de la transformationLa ligne éditoriale **Le média** Éco & business Environnement Société Territoires Dossiers Podcasts Dictionnaire de la transformation La ligne éditoriale **Le média** Éco & business Environnement Société Territoires Dossiers Podcasts Dictionnaire de la transformation La ligne éditoriale Nos formationsPar niveauxComment former votre CODIR / COMEX ?Comment former l’ensemble de vos collaborateurs ?Comment former un service métier spécifique ?Comment former vos ambassadeurs RSE ?Nos fresquesNos e-learningNos MOOC en ligneNos formationsNos formations sur catalogueNos formations sur mesureNos parcours de formation **Nos formations** Par niveauxComment former votre CODIR / COMEX ?Comment former l’ensemble de vos collaborateurs ?Comment former un service métier spécifique ?Comment former vos ambassadeurs RSE ? Comment former votre CODIR / COMEX ? Comment former l’ensemble de vos collaborateurs ? Comment former un service métier spécifique ? Comment former vos ambassadeurs RSE ? Nos fresques Nos e-learning Nos MOOC en ligne Nos formationsNos formations sur catalogueNos formations sur mesure Nos formations sur catalogue Nos formations sur mesure Nos parcours de formation **Nos formations** Par niveauxComment former votre CODIR / COMEX ?Comment former l’ensemble de vos collaborateurs ?Comment former un service métier spécifique ?Comment former vos ambassadeurs RSE ? Comment former votre CODIR / COMEX ? Comment former l’ensemble de vos collaborateurs ? Comment former un service métier spécifique ? Comment former vos ambassadeurs RSE ? Comment former votre CODIR / COMEX ? Comment former l’ensemble de vos collaborateurs ? Comment former un service métier spécifique ? Comment former vos ambassadeurs RSE ? Nos fresques Nos e-learning Nos MOOC en ligne Nos formationsNos formations sur catalogueNos formations sur mesure Nos formations sur catalogue Nos formations sur mesure Nos formations sur catalogue Nos formations sur mesure Nos parcours de formation Tous nos servicesConseil et stratégie RSEConseil CSRD et reporting extra-financierProduction de contenus **Tous nos services** Conseil et stratégie RSE Conseil CSRD et reporting extra-financier Production de contenus **Tous nos services** Conseil et stratégie RSE Conseil CSRD et reporting extra-financier Production de contenus À Propos de YoumatterToutes les actualités proTous nos évènementsNos success storiesNotre équipeNotre méthodologie de formation **À Propos de Youmatter** Toutes les actualités pro Tous nos évènements Nos success stories Notre équipe Notre méthodologie de formation **À Propos de Youmatter** Toutes les actualités pro Tous nos évènements Nos success stories Notre équipe Notre méthodologie de formation Accueil Rechercher Formations Services Mode dyslexique Mode sombre FrançaisEnglish Accueil >Economie et business >CSRD : 80% des entreprises sorties du champ d'application du reporting de durabilité **CSRD : 80% des entreprises sorties du champ d’application du reporting de durabilité** Publié le26 février 2025 Mis à jour le28 février 2025 La Commission européenne vient de dévoiler son projet tant attendu de simplification de la CSRD et du devoir de vigilance, textes phares du Green Deal pour les entreprises. Plus qu’une simplification c’est un amenuisement radical des exigences qui seront demandées aux entreprises en termes de reporting de durabilité. Youmatter fait le point sur les premières annonces. Réduire les obligations environnementales demandées aux entreprises pour restaurer la compétitivité, c’est le mantra de la nouvelle Commission européenne, dans le droit fildu rapport Draghipublié en 2024. Les grandes lignes de « simplification » des reporting de durabilitédévoilées aujourd’huivia un projet de loi dit omnibus, prennent ce cap au mot. Jusqu’à la fin de son mandat, la Commission s’est ainsi fixé« un effort de simplification sans précédent, en réduisant les charges administratives d’au moins 25 %, et d’au moins 35 % pour les PME », rappelle l’institution dans son communiqué. Et les textes phares du Green Deal pour les entreprises que sont la CSRD et la CS3D sur le devoir de vigilance en font particulièrement les frais. En savoir + :Les nouvelles voies de la décarbonation européenne « Moins de charges administratives, un accès plus facile au financement et des règles plus claires et plus prévisibles. Nous conservons nos objectifs, mais nous changeons la manière de les atteindre »,assure Stéphane Séjourné, le vice-président exécutif pour la prospérité et la stratégie industrielle. La nouvelle trajectoire,proche de celle souhaitée par le patronat, risque cependant de retarder l’atteinte de l’objectif de décarbonation et de transition juste. Cette « simplification » est «la réponse de l’exécutif européen à la grogne d’une petite partie du patronat et surtout de postures politiques démagogiques »,réagit Sylvain Boucherand, CEO du cabinet de conseils spécialisé BL évolution.« On peut s’interroger sur la méthode, car ces dispositions du Green Deal commençaient tout juste à être mises en œuvre et aucune évaluation des effets, difficultés ou du fameux ruissellement dans la chaîne de valeur n’ont pu être démontrés pour justifier ce repositionnement ». En savoir + :Grand détricotage en vue du Green Deal **CSRD : Plus que 20% des entreprises initialement concernées soumises à un reporting de durabilité, simplifié** Le texte propose ainsi de retirer près de 80 % des entreprises initialement concernées du champ d’application de la directive CSRD, en concentrant les obligations en matière de rapports sur le développement durable sur les plus grandes entreprises. Seules les entreprises de plus de 1000 employés, un chiffre d’affaires de 50 millions d’euros et/ou un bilan de plus de 25 millions d’euros seront désormais concernées. Les exigences du reporting sont aussi réduites : – Décalage de deux ans (jusqu’en 2028) les exigences de reporting pour les entreprises actuellement dans le champ d’application du CSRD et qui sont tenues de produire un rapport à partir de 2026 ou 2027. – Réduction de la charge des obligations de déclaration de la taxonomie de l’UE et la limiter aux plus grandes entreprises (correspondant au champ d’application de la CS3D), tout en conservant la possibilité de déclarer volontairement pour les autres grandes entreprises dans le futur champ d’application de la CSRD. – Suppression des normes sectorielles et réduire le nombre de points de données obligatoires pour les normes « classiques », priorisation des données quantitatives. – Conservation de la double matérialité – Conservation de l’audit des rapports de durabilité mais avec une assurance « limitée » et suppression de la transition vers une assurance raisonnable. Cette question de l’audit est l’un des points clés de la contestation de la CSRD. «Sur le terrain, ce qui s’est effectivement avéré assez lourd c’est la pression mise sur l’audit des données et le niveau d’assurance de la vérification« , souligne Sylvain Boucherand.En passant d’une « assurance raisonnable«à une simple« assurance limitée« , nous sommes dans un «allègement substantiel justifié» mais «peut être faudrait-il reconsidérer la question dans 3 ou 5 ans une fois que l’on aura une vision plus précise sur la qualité et fiabilité des données des reportings », estime-t-il. **Un report d’un an du devoir de vigilance, vidé de sa substance** Concernant le devoir de vigilance, la Commission propose de : – Reporter d’un an (au 26 juillet 2028) l’application des exigences de diligence raisonnable en matière de développement durable pour les plus grandes entreprises, tout en avançant d’un an (à juillet 2026) l’adoption des lignes directrices. – Réduire les exigences systématiques en matière de diligence raisonnable sur les seuls partenaires commerciaux directs (et non plus l’ensemble de la chaîne de valeur) et en réduisant la fréquence des évaluations périodiques et du suivi de leurs partenaires d’une année à cinq ans, avec des évaluations ad hoc le cas échéant. – Limiter la quantité d’informations pouvant être demandées aux PME et petites ETI dans le cadre de la cartographie de la chaîne de valeur par les grandes entreprises – Supprimer l’obligation de mettre en œuvre les plans climatiques. – Supprimer les conditions de responsabilité civile **Taxonomie verte : une déclaration volontaire pour les entreprises de moins de 1000 salariés** -Introduction de la possibilité de rendre compte des activités qui sont partiellement alignées sur la taxonomie de l’UE, en encourageant une transition environnementale progressive des activités au fil du temps. – La taxonomie verte qui s’appliquait à toutes les entreprises va désormais s’appliquer aux entreprises de plus de 1000 employés et 450 millions d’euros de chiffre d’affaires, et resterait optionnelle pour les autres entreprises. -Introduire des simplifications dans les critères « Do no Significant harm » (DNSH) les plus complexes pour la prévention et le contrôle de la pollution liés à l’utilisation et à la présence de produits chimiques qui s’appliquent horizontalement à tous les secteurs économiques dans le cadre de la taxonomie de l’UE – comme première étape de la révision et de la simplification de tous ces critères DNSH. -Introduire un seuil de matérialité financière pour les rapports de la taxonomie et réduire les modèles de rapport d’environ 70 %. -Les banques pourront exclure du dénominateur du GAR (Green Asset Ratio, le principal indicateur clé de performance des banques basé sur la taxonomie), les expositions liées à des entreprises qui ne relèvent pas du futur champ d’application de la CSRD (c’est-à-dire les entreprises comptant moins de 1 000 employés et réalisant un chiffre d’affaires de 50 millions d’euros). **Un patronat classique qui salue les réformes tout en demandant d’aller plus loin, un patronat engagé qui regrette un « détricotage »** A l’annonce des premières lignes directrices, les réactions ne se sont pas faites attendre. Sans surprise, les représentants du patronat européen saluent« une étape importante pour faire de l’Europe un meilleur endroit pour faire des affaires ».« En réduisant les charges réglementaires et les rapports inutiles, le premier Omnibus permettra aux entreprises de contribuer plus efficacement aux objectifs de durabilité de l’UE tout en préservant la compétitivité de l’économie européenne »,a déclaré Markus J. Beyrer, le directeur général de BusinessEurope. Tout en demandant d’aller encore plus loin« pour garantir une approche harmonisée de la diligence raisonnable ». Tout comme l’Afep, le MEDEF et France Industrie qui fournissent une liste derecommandationspour faire en sorte que les réformes corrigent davantage« la charge bureaucratique »des entreprises de plus de 1000 salariés. Pour BusinessEurope,« faire mieux avec moins de normes et des normes plus claires, c’est ce que demandent les entreprises européennes de toutes tailles ». Ce n’est pourtant pas tout à fait le cas. Depuis l’annonce de la réforme de ces réglementations, une partie des entreprises, souvent les plus engagées dans la transition écologique et sociale mais aussi des grandes entreprises plus classiques, ont demandé des simplifications sans dénaturer l’esprit de ces textes essentiels pour la transformation durable de l’économie. C’est aussi ce qui ressort d’unsondage effectué par plusieurs organisations françaisesoù 80% d’entreprises se disent satisfaites ou très satisfaites du cadre actuel mais avec plus de soutien ou de simplification. **Une« dérégulation massive et sans précédent, qui rappelle la politique de déréglementation en cours aux États-Unis »** « La réduction de son champ d’application est vraiment regrettable. On tricote puis on détricote. Les entreprises sont en mouvement, elles ont investi, recruté, maintenant qu’on fait demi-tour on va licencier ? Ce qui se joue est ridicule. Ce retour en arrière est une faute de nos dirigeants politiques« , souligne de son côté le président du CJD, Mathieu Hetzer, qui voit dans la CSRD «un outil de compétitivité pour mieux évaluer les risques et définir des stratégies d’entreprises plus robustes ». Autre son de cloche du côté des ONG.« Sous couvert de « simplifier » la vie des entreprises, la directive « Omnibus » de la Commission propose de démanteler nombre d’obligations en matière de durabilité et de protection des droits humains »,a réagit le CCFD-Terre Solidaire, très impliqué dans l’élaboration et le suivi de ces réglementations. Selon l’ONG, les changements annoncés« priveraient le devoir de vigilance européen de tout effet utile » et vont faire perdre « certaines informations essentielles pour orienter les financements vers la transition climatique juste ».Pour Notre Affaire à tous », «il s’agit d’une dérégulation massive et sans précédent, qui rappelle la politique de déréglementation en cours aux États-Unis« . **Et maintenant ?** Les propositions législatives vont maintenant être soumises au Parlement européen et au Conseil pour examen et adoption. Et la Commission insiste pour que le paquet omnibus soit traité« en priorité », en particulier la proposition reportant certaines obligations d’information au titre de la CSRD et le délai de transposition au titre de la CS3D. Les modifications entreront en vigueur une fois que les colégislateurs seront parvenus à un accord sur les propositions et après leur publication au Journal officiel de l’UE. « Le paquet de révision d’aujourd’hui est la première étape de nos efforts de simplification à grande échelle dans tous les secteurs de la législation. (…) Nous pouvons ainsi montrer que l’Europe n’est pas seulement un formidable marché pour investir, produire, vendre et consommer, mais aussi un marché simple », assure Stéphane Séjourné. Mais pas forcément ni le plus efficace, ni le plus stable… Alors que tous les pays d’Europe n’ont pas encore transposé la CSRD, de nombreuses entreprises pourraient en profiter pour retarder la préparation voire la publication de ces reportings jusqu’à ce que les changements potentiels soient finalisés. De quoi retarder d’autant le changement de leurs pratiques et de leur business model. Une réduction des coûts administratifs espérée de 6,3 milliards d’eurosSi elles sont adoptées et mises en œuvre telles qu’elles sont présentées aujourd’hui, les propositions devraient, selon des « estimations prudentes », permettre de réduire les coûts administratifs annuels d’environ 6,3 milliards d’euros et de mobiliser une capacité d’investissement public et privé supplémentaire de 50 milliards d’euros pour soutenir les priorités politiques, assure la Commission dans son communiqué. Illustration : Canva Ecrit par : Rédactrice en chef Suivez le fil de l'article Temps de lecture : 10 minutes CSRD : Plus que 20% des entreprises initialement concernées soumises à un reporting de durabilité, simplifié Un report d'un an du devoir de vigilance, vidé de sa substance Taxonomie verte : une déclaration volontaire pour les entreprises de moins de 1000 salariés Un patronat classique qui salue les réformes tout en demandant d'aller plus loin, un patronat engagé qui regrette un \"détricotage\" Une \"dérégulation massive et sans précédent, qui rappelle la politique de déréglementation en cours aux États-Unis\" Et maintenant ? Écrit parBéatrice Héraud, Rédactrice en chef **Green Deal : grand détricotage en vue de la CSRD, du devoir de vigilance et autres** **Green Deal : grand détricotage en vue de la CSRD, du devoir de vigilance et autres** Une révision de plusieurs textes phares du Green Deal sont attendues par la voie d’une loi dite « omnibus » qui sera dévoilée le 26 février, dans le cadre du Clea... Une révision de plusieurs textes phares du Green Deal sont attendues par la voie d’une loi dite « omnibus » qui sera dévoilée le 26 février, dans le cadre du Clea... Écrit parBéatrice Héraud, Rédactrice en chef **Omnibus : face à la possibilité d'une suppression du reporting CSRD, les entreprises se mobilisent** **Omnibus : face à la possibilité d'une suppression du reporting CSRD, les entreprises se mobilisent** Actualisation : 18H58, 20 janvier, précision du cabinet de Stéphane Séjourné Après les appels du pieds du gouvernement français puis allemand demandant une révision for... Actualisation : 18H58, 20 janvier, précision du cabinet de Stéphane Séjourné Après les appels du pieds du gouvernement français puis allemand demandant une révision for... Écrit parBéatrice Héraud, Rédactrice en chef **CSRD : ces PME qui se lancent volontairement dans le reporting de durabilité** **CSRD : ces PME qui se lancent volontairement dans le reporting de durabilité** Alors que le patronat tire à boulets rouges sur la CSRD, que certains n’hésitent pas à qualifier de « fardeau réglementaire », des PME s’engagent volontaire... Alors que le patronat tire à boulets rouges sur la CSRD, que certains n’hésitent pas à qualifier de « fardeau réglementaire », des PME s’engagent volontaire... Écrit parBéatrice Héraud, Rédactrice en chef **Omnibus, PFAS, RH...les brèves de la semaine du 24 février** **Omnibus, PFAS, RH...les brèves de la semaine du 24 février** L’actualité de la RSE en brèves. Cette semaine, à quelques jours de la présentation de la loi omnibus qui doit réviser la CSRD et le devoir de vigilance, on se pe... L’actualité de la RSE en brèves. Cette semaine, à quelques jours de la présentation de la loi omnibus qui doit réviser la CSRD et le devoir de vigilance, on se pe... Écrit parFlorentin Roy, Journaliste **La CSRD, un outil à disposition des CSE pour challenger la durabilité des entreprises** **La CSRD, un outil à disposition des CSE pour challenger la durabilité des entreprises** Les comités économique et social (CSE) des entreprises ont désormais des compétences en matière de durabilité. À ce titre, les nouvelles réglementations comme la CSRD e... Les comités économique et social (CSE) des entreprises ont désormais des compétences en matière de durabilité. À ce titre, les nouvelles réglementations comme la CSRD e... Écrit parBéatrice Héraud, Rédactrice en chef **La transition vers le Net zero couteraît moins d'un point de PIB selon le Trésor** **La transition vers le Net zero couteraît moins d'un point de PIB selon le Trésor** Chaque jeudi, l’actualité de la RSE en chiffres. Cette semaine, on se penche sur le coût de la transition vers le Net Zero. Un coût qui n’est pas neutre mai... Chaque jeudi, l’actualité de la RSE en chiffres. Cette semaine, on se penche sur le coût de la transition vers le Net Zero. Un coût qui n’est pas neutre mai... Écrit parBéatrice Héraud, Rédactrice en chef **IA, COP régionales, CS3D...les brèves RSE de la semaine du 17 février** **IA, COP régionales, CS3D...les brèves RSE de la semaine du 17 février** Chaque mardi, l’actualité RSE en brèves ! Cette semaine, on se penche encore sur la loi omnibus qui doit ouvrir la révision des textes du Green Deal (au minimum l... Chaque mardi, l’actualité RSE en brèves ! Cette semaine, on se penche encore sur la loi omnibus qui doit ouvrir la révision des textes du Green Deal (au minimum l... Écrit parBéatrice Héraud, Rédactrice en chef **Dialogue social : seulement un tiers des CSE se sont emparés de l'environnement** **Dialogue social : seulement un tiers des CSE se sont emparés de l'environnement** Chaque jeudi, Youmatter traite l’actualité RSE en chiffres. Cette semaine on se penche sur la façon dont les comités économique et social (CSE) se saisissent de l... Chaque jeudi, Youmatter traite l’actualité RSE en chiffres. Cette semaine on se penche sur la façon dont les comités économique et social (CSE) se saisissent de l... Écrit parFlorentin Roy, Journaliste **ZFE et logistique urbaine : rendre le dernier kilomètre plus durable** **ZFE et logistique urbaine : rendre le dernier kilomètre plus durable** Depuis janvier 2025, les Zones à Faibles Émissions mobilité (ZFE-m) interdisent les véhicules Crit’Air 3 dans plusieurs grandes agglomérations françaises. Si cett... Depuis janvier 2025, les Zones à Faibles Émissions mobilité (ZFE-m) interdisent les véhicules Crit’Air 3 dans plusieurs grandes agglomérations françaises. Si cett... Le médiaDictionnaire de la transformationEco & businessEnvironnementSociétéTerritoiresTous les dossiersTous les podcastsLa ligne éditoriale du média **Le média** Dictionnaire de la transformation Eco & business Environnement Société Territoires Tous les dossiers Tous les podcasts La ligne éditoriale du média **Le média** Dictionnaire de la transformation Eco & business Environnement Société Territoires Tous les dossiers Tous les podcasts La ligne éditoriale du média Nos FormationsFormationsFormations par niveauxE-LearningMOOCsFresquesParcours de formation **Nos Formations** Formations Formations par niveaux E-Learning MOOCs Fresques Parcours de formation **Nos Formations** Formations Formations par niveaux E-Learning MOOCs Fresques Parcours de formation Nos servicesConseil et stratégie RSEConseil CSRD et reporting extra-financierProduction de contenusYoumatter Transitions **Nos services** Conseil et stratégie RSE Conseil CSRD et reporting extra-financier Production de contenus Youmatter Transitions **Nos services** Conseil et stratégie RSE Conseil CSRD et reporting extra-financier Production de contenus Youmatter Transitions À ProposS’informerSe formerTransformerNotre équipeTous nos évènementsNotre méthodologie de formationL’actualité pro YoumatterMentions légalesCookiesConditions Générales d’UtilisationPolitique de confidentialité **À Propos** S’informer Se former Transformer Notre équipe Tous nos évènements Notre méthodologie de formation L’actualité pro Youmatter Mentions légales Cookies Conditions Générales d’Utilisation Politique de confidentialité **À Propos** S’informer Se former Transformer Notre équipe Tous nos évènements Notre méthodologie de formation L’actualité pro Youmatter Mentions légales Cookies Conditions Générales d’Utilisation Politique de confidentialité"}