{"id": 1913, "name": "Change.org", "domain": "change.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.change.org/impact-stories/tell-the-indiana-assembly-to-pass-bill-1483-to-stop-bullying", "title": "Tell The Indiana Assembly To Pass Bill 1483 To Stop Bullying", "content": "Victory! **A child's tragedy sparks a State's crusade against bullying** Becky Claypool never thought of herself as an activist, but after her friends lost their 13-year-old son Terry to suicide, she knew something had to change. Shocked to discover how warning signs were missed at his school, she started a Change.org petition calling for stronger school bullying policies in her home state of Indiana. The petition quickly gained nearly 100,000 signatures, drawing the attention of lawmakers and leading to an invitation to speak at the Indiana State House, where her testimony helped push forward a bill that will change the lives of kids across the state. “I never thought I’d be standing here, fighting for a law in my son’s name. But if it stops just one family from feeling this pain, it’s worth it.” The bill requires schools to investigate bullying claims and inform parents, a step Becky believes could spare other families from the same grief. For her, the petition wasn’t just about policy—it was about accountability and action. She hopes others see that even without political experience or a platform, persistence can lead to real change. **Every successful petition starts with someone like you** Deutsch English (Australia) English (Canada) English (India) English (United Kingdom) English (United States) Español (Argentina) Español (España) Español (Latinoamérica) Français हिन्दी Bahasa Indonesia Italiano 日本語 Português (Brasil) Русский ภาษาไทย Türkçe"}