{"id": 1893, "name": "Belltower.News", "domain": "belltower.news", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.belltower.news/patchworkextremismus-das-haben-die-anschlaege-von-villach-ueber-senftenberg-bis-magdeburg-gemeinsam-158535/", "title": "Patchworkextremismus Das Haben Die Anschlaege Von Villach Ueber Senftenberg Bis Magdeburg Gemeinsam 158535", "content": "Themen Lexikon Über uns Spenden Newsletter **Patchworkextremismus:Das haben die Anschläge von Villach über Senftenberg bis Magdeburg gemeinsam** Die jüngsten Anschläge in Villach, München, Aschaffenburg, Magdeburg sowie der vereitelte Anschlag in Senftenberg markieren eine neue Dimension extremistischer und terroristischer Bedrohungen. Die ausschließlich männlichen Täter folgen keinem einheitlichen ideologischen Weltbild, sondern kombinieren Elemente verschiedener autoritärer und rechtsextremistischer Bewegungen, die am Ende trotzdem den gleichen Kern haben. Ein Kommentar von Timo Reinfrank. Dieser neue Patchworkextremismus erschwert es Sicherheitsbehörden, zivilgesellschaftlichen Präventionsakteuren und betroffenen Communitys zunehmend, Radikalisierungsprozesse frühzeitig zu erkennen und zu unterbrechen. Besonders herausstechend ist, dass die Gewaltakte in einer Phase gefühlter Polarisierung stattfinden: Der Bundestagswahlkampf 2025 ist von rassistisch aufgeladenen Asyl- und Migrationsdebatten geprägt – eine Entwicklung, die insbesondere Rechtsextreme bewusst nutzen, um bestehende Spannungen weiter anzuheizen. Vor allem die AfD und teilweise auch das Bündnis Sarah Wagenknecht (BSW) profitieren von dieser gesellschaftlichen Zuspitzung,die auch von einigen Medien befeuert wird,und verstärken gezielt Ängste und Ressentiments. **Eine Anschlagsserie mit unterschiedlichen Hintergründen** Der Messerangriff in Villach am 15. Februar 2025 zeigt, wie sich individuelle Radikalisierung, Online-Propaganda und islamistischer Terrorismus verbinden können. Ein 23-jähriger syrischer Asylbewerber griff in der österreichischen Stadt mehrere Passant*innen an, tötete einen 14-jährigen Jungen und verletzte fünf weitere Menschen schwer. Der Täter rief während der Tat „Allahu Akbar“ und bekannte sich zum Islamischen Staat (IS). Ermittlungen ergaben, dass er sich über soziale Medien radikalisiert hatte. In seiner Wohnung fanden die Ermittler*innen Schriften und die IS-Flagge. Ein couragierter 42-jähriger Syrer stoppte den Angreifer. Wenige Tage zuvor, am 10. Februar 2025, raste in München ein Mann mit seinem Auto in einen Demonstrationszug der Gewerkschaft ver.di und verletzte fast vierzig Menschen zum Teil schwer,eine 37-jährige Frau und ihre zweijährige Tochter sind tot. Der Täter soll bei der Tat „Allahu Akbar“ gerufen haben und radikalen Geistlichen in den sozialen Medien gefolgt sein, alles als Fitness-Influencer mit über 60.000 Follower*innen auf Instagram. Die Behörden gehen von einem möglichen islamistischen Hintergrund aus. Mittlerweile hat die Bundesstaatsanwaltschaft die Ermittlungen übernommen. Im brandenburgischen Senftenberg konnte dagegen am 12. Februar nur knapp ein Anschlag vereitelt werden. Sicherheitsbehörden nahmen einen 21-jährigen Tatverdächtigen fest, der Sprengsätze und Waffen für einen Angriff auf eine Asylbewerberunterkunft vorbereitet hatte. Der Täter hatte sich nach dem aktuellen Stand der Ermittlungen in rechtsextremen Online-Foren radikalisiert. Bereits am 22. Januar 2025 sorgte ein Messerangriff in Aschaffenburg für Entsetzen. Ein 28-jähriger Afghane attackierte eine Kindergartengruppe, tötete dabei einen zweijährigen Jungen marokkanischer Abstammung sowie einen 41-jährigen Passanten. Drei weitere Personen, darunter ein zweijähriges Mädchen, wurden schwer verletzt. Der Täter war polizeibekannt und in psychiatrischer Behandlung. Hinweise auf eine politische oder religiöse Motivation liegen bislang nicht vor. Der Anschlag in Magdeburg am 20. Dezember 2024 zeigt besonders deutlich die gesellschaftliche Überforderung bei der Einordnung (rechts-)extremer Ideologien. Der Täter raste mit einem LKW in den Weihnachtsmarkt der Stadt. Zunächst ging man von einer islamistischen Motivation aus, doch schnell wurde klar, dass der Täter ein selbsternannter „aggressivster Islamkritiker“ war. Der Mann ahmte bewusst islamistische Anschläge nach, um maximalen gesellschaftlichen Schaden zu verursachen. Seine Radikalisierung vereinte Elemente des Rechtsextremismus, Islamhasses und Verschwörungsmythen. **Patchwork mit gemeinsamen Kern** Diese Anschläge verdeutlichen, dass sich klassische Kategorien von Extremismus zunehmend auflösen könnten. Die Täter bedienen sich verschiedener radikaler Narrative und kombinieren mitunter Anschlagsmuster oder Feindbilder unterschiedlicher extremistischer Strömungen. Antisemitismus, Frauenhass, toxische Männlichkeit und Verschwörungserzählungen bleiben dabei jedoch immer der Kern. Rechtsextreme und jihadistische Gruppen setzen zudem gezielt auf Feindbildmobilisierungen, Chaos und Eskalation, um demokratische Gesellschaften zu destabilisieren. +++ Eine Broschüre der Amadeu Antonio Stiftung:Rechtsterroristische Online-Subkulturen+++ **Islamisten zusammen mit Rechtsextremen und Russland** Patchworkextremismus wird nicht nur durch persönliche Radikalisierungen – oft infolge von krankhaften Persönlichkeitsstörungen, individueller Sinnsuche oder sozialen Dynamiken –, sondern auch durch gezielte externe Einflussnahme befeuert. Islamistische Netzwerke, rechtsextreme Gruppen und Kreml-gesteuerte Desinformationen setzen gezielt auf Narrative, die bestehende Konflikte verstärken. Islamist*innen setzen darauf, Einzelne über Online-Propaganda zur Gewalt anzustacheln. In den sozialen Medien kursieren Anleitungen für Anschläge, die bewusst niedrigschwellige Angriffsmöglichkeiten propagieren. Schon lange setzen Rechtsextreme auf das Konzept des „führerlosen Widerstands“. Radikalisierte Täter*innen führen individuell Anschläge aus, um Sicherheitsbehörden zu überfordern. Es sind Botschaftstaten für potentielle, gewaltbereite Nachahmer*innen. Die russische Regierung nutzt hybride Kriegsführung, um westliche Demokratien zu destabilisieren. Dazu gehört die gezielte Verstärkung gesellschaftlicher Konflikte durch Desinformation und Propaganda, insbesondere im Bereich Asyl und Migration sowie die Finanzierung und direkte Unterstützung von rechtsextremen und verschwörungsideologischen Gruppen. Zuletzt belegtenRecherchen vonSpiegelundThe Insider, dass mehrere ehemalige Mitglieder einer russischen Sabotageeinheit als Asylbewerber in Deutschland leben. **Konsequenzen für Sicherheitsbehörden und Präventionsarbeit** Die wachsende Unberechenbarkeit rechtsextremer und islamistischer Gewalt stellt Sicherheitsbehörden und Präventionsakteure vor erhebliche Herausforderungen. Da sich Täter*innen nicht gleich klaren Kategorien zuordnen lassen, wird es schwieriger, Gefährder*innen frühzeitig zu identifizieren. Radikalisierung kann heute oft ohne formale Zugehörigkeit zu einer Gruppe erfolgen. Besonders besorgniserregend ist die Rolle sozialer Medien. Plattformen wie TikTok, Telegram und Alternative fungieren als algorithmenbasierte Radikalisierungsorte, die verstärkt in den Blick der Sicherheitsbehörden gehören. Digitale Analysekapazitäten müssen dort, aber auch in der Zivilgesellschaft ausgebaut werden, um neue Entwicklungen frühzeitig zu erkennen und zu benennen. In der Debatte um hybride Bedrohungen kommt die Politik zunehmend an ihre Grenzen, da die Wirkung insbesondere im Bereich neuer Anti-Terror-Gesetze zweifelhaft ist und Überwachungsmaßnahmen oder Plattformregulierungen an nationalstaatliche Grenzen stoßen. Die Präventionsarbeit darf sich nicht nur auf einzelne extremistische Milieus konzentrieren, sondern muss individuelle Radikalisierungsprozesse in den Blick nehmen und zugleich müssen staatliche Regelinstitutionen auf diese Herausforderungen angemessen reagieren, insbesondere die Jugend- sowie die Migrations- und Flüchtlingssozialarbeit müssen dafür gestärkt und nicht eingespart werden. Vor allem Ansätze von aufsuchender „Digital Streetwork“ sollten als Sofortmaßnahme flächendeckend ausgebaut werden, um Radikalisierungen in den digitalen Medien frühzeitig zu begegnen. Schließlich muss auch die Gesellschaft als Ganzes widerstandsfähiger werden. Die Bundestagswahl 2025 entscheidet nicht nur über politische Programme, sondern auch, ob sich demokratische Institutionen gegen Spaltungsversuche behaupten können. Während vor allem die AfD und eingeschränkt auch das BSW von der Polarisierung profitierten, ist es für die Demokratie entscheidend, dass Gesellschaft und (Partei-)Politik sich nicht in diesen Sog der rassistisch motivierten Eskalation ziehen lassen. Die Stärkung der gesellschaftlichen Resilienz gegen antidemokratische, autoritäre und populistische Strömungen wird in den kommenden Jahren eine zentrale Herausforderung sein. Themen:Gruppenbezogene Menschenfeindlichkeit|Symbole--Codes--Themen Lexikon:Bundestagswahl 2025|Gewalt|Islamismus|Männer|Rechtsextremismus|Social Media|Strategien|Terrorismus Bundesland:Bundesweit Belltower.News macht gemeinnützigen Journalismus, denn wir klären auf und machen das Wissen von Expert*innen zu Antisemitismus, Rassismus undRechtsextremismus und allen anderen Themen der Amadeu Antonio Stiftung für ein breites Publikum zugänglich.Unsere Reportagen, Recherchen und Hintergründe sollen immer frei verfügbar sein und nie hinter einer Paywall verschwinden.Dafür brauchen wir aber auch Ihre Hilfe.Bitte unterstützen Sie unseren Journalismus, Sie helfen damit der digitalen Zivilgesellschaft! **Weiterlesen** **Orchestrierte Gegenkampagne:Wie mit konstruierten Vorwürfen gegen Demokratieprojekte Stimmung gemacht wird** Die orchestrierte Kampagne der Springer-Presse gegen zivilgesellschaftliche Organisationen ist ein alarmierendes Signal. „Wer heute die Gemeinnützigkeit von Initiativen gegen Rechtsextremismus infrage stellt, will morgen keine kritische Zivilgesellschaft mehr haben“, mahnt Timo Reinfrank. **Tahera Ameer im Interview:„Rassismus ist gewalttätig wie immer“** Tahera Ameer ist Vorständin der Amadeu Antonio Stiftung. Der folgende Text ist Teil eines Gesprächs über Rassismus, Intersektionalität und die Aufgaben der Stiftung. **Geschichtsrevisionismus:Das who is who der Nazis beim Marsch in Dresden** Am Samstag marschierten rund 2.000 Neonazis, begleitet von lautem Gegenprotest, durch Dresden. Anlass war der Jahrestag der Bombardierung der Stadt durch die Alliierten, ein wichtiges Datum im Neonazi-Aktions-Kalender. Unser Demobericht. Schlagen Sie Wissenswertes in unserem Lexikon nach. **Kontakt** belltowernews@amadeu-antonio-stiftung.deTel.: +49 (0)30 240 886 10Fax: +49 (0)30 240 886 22 **Spendenkonto** Amadeu Antonio StiftungGLS Bank BochumBLZ 430 609 67Konto 6005 0000 00IBAN: DE32 4306 0967 6005 0000 00BIC: GENODEM1GLS Spenden **Socials** Icon FacebookFacebook Instagram Bluesky **Menü** Lexikon Redaktionsstatut Kontakt English Newsletter Datenschutz Impressum"}