{"id": 2150, "name": "The Postil Magazine", "domain": "thepostil.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.thepostil.com/sustainable-development-sustainable-exploitation/", "title": "Sustainable Development Sustainable Exploitation", "content": "Home Library About Contact Knowledge Kino Books of the Month Technology Politics **Sustainable Development, or Sustainable Exploitation?** The concept of sustainable development has been promoted for many years at international forums, primarily at the United Nations, where 193 countries signed 17 sustainable development goals at the 2015 summit. All participants agreed that the world needs a model that takes into account political, economic, social, and environmental aspects. Even earlier, at the Earth Summit in Rio de Janeiro in 1992, the concept of sustainability was adopted as the basis for economic and environmental programs under the auspices of the same UN. The UN Millennium Development Goals were also directly linked to this theory. Although no one denies the need to conserve natural resources and care for the environment, it is alarming that sustainable development issues are being actively promoted by typically globalist projects such as the Davos Forum, founded by Klaus Schwab. Similarly, George Soros and Bill Gates, with their projects also linked to the UN through the WHO and other initiatives, regularly speak out in favor of sustainable development. It is therefore necessary to examine in more detail what this theory and methodology is all about. And also who is promoting it and for what purpose. And if we delve deeper into history, we can see that this concept is directly linked to the globalist organization “The Club of Rome” and the Malthusian theory of the need to limit the world’s population. In 1972, the Club of Rome published its first report, “The Limits to Growth,” which used mathematical modeling to show various scenarios for the future development of humanity. It is telling and, apparently, no coincidence that the United Nations Environment Programme was established in the same year, laying the foundations for discussing and addressing environmental issues at the global level. This gave rise to the theory of global warming, concerns about the Earth’s ozone layer, and other doctrines, including pseudoscientific constructs designed to fool gullible people. Incidentally, the latest achievements in the sustainable development program are the agreements on limiting CO2 emissions at the Paris Climate Summit and the continued implementation of this program, which has been signed by many countries. Although the authors of the sustainable development concept declare their lofty goals alongside a pragmatic approach—rational use of resources for prosperity; a high standard of living and equitable distribution of benefits; and preservation of the environment and natural resources—these represent the three pillars of the economy, the social sphere, and ecology, the term itself is rather vague and ambiguous. Everyone can interpret it in their own way. Therefore, conflicts of interest are inevitable not only between the economy and politics, but also between political actors, as evidenced by the refusal of a number of countries to join the Paris Agreement. Moreover, even earlier, at the Group of 77 summit held in Bolivia in 2014, the final declaration expressed disagreement with the policy of forcing Western countries to comply with certain environmental standards. It was quite rightly stated that, under the guise of concern for the environment and the need to introduce special taxes on CO2 emissions, an attempt is being made to halt the development of other countries. While industrialized countries have already gone through a period of industrial growth and are transitioning to a new type of economy, they are trying to impose their model on other countries, regardless of the actual damage that rejecting industrialization could cause to their economies. Of course, the West promised to help with the introduction of new technologies. But apparently, this had to be paid for with resources and political sovereignty. It should be noted that despite its name, the Group of 77 includes more than 130 countries, making it the largest international organization in the world after the UN. So why were all the strange “environmental” decisions on sustainable development supported and most often adopted by the UN? Such a dichotomy is strange, to say the least, but the answer may lie in the corrupt strategy traditionally practiced by the G7 countries, which buy the votes of developing countries in the UN in exchange for economic aid from the IMF and the World Bank. Another example of how globalists push their interests under the guise of sustainable development is the agro-industrial monopolies associated with genetically modified organisms (GMOs). This is presented as promising agricultural biotechnology that can achieve sustainable development goals (primarily in the food production sector). However, the price that must be paid for this is not mentioned. This includes not only the destruction of endemic crops in different parts of the world that are directly linked to authentic agriculture and the traditional way of life of many peoples, but also the outright imposition of a monopoly on the purchase of GMO seeds from their producers, the vast majority of whom are located in the US. In fact, statistics confirm that half of all agricultural land in the US is already controlled by GMO giants. This experiment on American farmers could be instructive for other countries. Supporters of GMOs also point out that organic farming requires more land and also leads to higher carbon dioxide emissions due to the use of organic fertilizers derived from animals. Here we see a clear link between the narratives that globalists are trying to promote under the guise of environmental knowledge and a green agenda. However, experts have noted that the use of modern biotechnologies such as GMOs is directly linked to other transitional technologies, but no detailed assessment of this issue has been developed. Despite this, attempts to control agricultural markets by transnational corporations such as Monsanto (acquired by Bayern in 2016) continue. Similar efforts are being made by Western pharmaceutical companies – the so-called Big Pharma. However, the coronavirus epidemic has revealed the ugly side of the interaction between Western political elites and pharmaceutical giants, primarily the scandal within the EU over the purchase of vaccines from a company approved by Ursula von der Leyen without the proper procedures and required transparency and accountability. But this has not weakened the efforts of the Western pharmaceutical oligarchy to capture the global market for the sale of its substandard products, quite the contrary. The height of globalist cynicism can be seen in the Brazilian Amazon, where several cases stand out. There, after forest fires, certain biotechnology companies appear, offering their services to “normalize” the soil in the burned-out areas. Local activists directly link these fires, which have recently been occurring more frequently and on a larger scale, to the interests of these companies. All this leads to the conclusion that the concept of “sustainable development” was originally a political project of globalist oligarchs. But with the current fragmentation and deadlock of globalization, they are trying to present it as the only scenario for the future of all. That is, part of their famous “rules-based order.” So that their exploitation and control can continue under a plausible pretext. Courtesy:Geopolitika. **About The Author** The IconSalus Populi Romani The IconSalus Populi Romani First Principles Universally True? First Principles Universally True? **Related Articles** **The Wealth Of The One-Percent?** **A Radically New Economy: The Dawn of the Caritas State** **Is Marx Still Useful?** **Friedrich Hayek On The Individual and Social Controls** **Economics And Human Rights** **A Journey Without Distance – Reflections of a self-professed Libertarian** **Monopolies, Or More Is Less** **Modernity And Freedom – A Paradox?** **Greta Thunberg And Eco-Eugenics** **Why Environmentalism Fails** **Corporate Christianity And Conservative Inc.** **In The Green Reich, We Are All Jews** **Interview: Drieu Godefridi** **Wilhelm Röpke And The Third “Neo-Liberal” Path** **How To Slay The Climate Change Dragon** **Recent Articles** Our Lady of Good Counsel Saints Melania the Elder and Melania the Younger Thoughts on the Pontificate of Francis I My Windmill asAletheia Jacques Baud:Covert Wars in Ukraine Copyright © 2025 The Postil Magazine As an Amazon Associate, please note that we earn from qualifying purchases, with no extra cost to you. Thank you for your kind support."}