{"id": 444, "name": "Fifth Estate", "domain": "fifthestate.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fifthestate.org/archive/416-spring-2025/how-political-violence-resistance-was-represented-in-1960s-1970s-arthouse-cult-films/", "title": "How Political Violence Resistance Was Represented In 1960s 1970s Arthouse Cult Films", "content": "Main Navigation Home About / ContactContact usDonate to Fifth EstateAddress Change FormCall for submissionsWriters’ GuidelinesFE Mirror SitePrivacy Policy Contact us Donate to Fifth Estate Address Change Form Call for submissions Writers’ Guidelines FE Mirror Site Privacy Policy Contact us Donate to Fifth Estate Address Change Form Call for submissions Writers’ Guidelines FE Mirror Site Privacy Policy Print EditionSubscribe / RenewBuy Current IssueBuy Back IssuesSpecial – 5 random issues Subscribe / Renew Buy Current Issue Buy Back Issues Special – 5 random issues Subscribe / Renew Buy Current Issue Buy Back Issues Special – 5 random issues FE StoreBuy Print EditionSpecial OffersBooksMerchPostersRecordingsT-shirts Buy Print Edition Special Offers Books Merch Posters Recordings T-shirts Buy Print Edition Special Offers Books Merch Posters Recordings T-shirts FE Facebook Archive Search FE **How political violence & resistance was represented in 1960s & 1970s arthouse & cult films** A review ofRevolution in 35mm: Political Violence and Resistance in Cinema From the Arthouse to the Grindhouse 1960-1990, Editors: Andrew Nette and Samm Deighan. PM Press, 2024 “Leftist terrorism and state terrorism, even if their motivations cannot be compared, are two jaws of the same mug’s game. The state hates terrorism, but prefers it to revolution.” So says Buenaventura Diaz in the 1974 French/Italian co-productionNada, one of the dozens of films profiled inRevolution in 35mm, edited by Andrew Nette and Samm Deighan. Nette is no stranger to sifting through pop cultural detritus to find revolutionary messages. His previous three books for PM Press covered similar topics in pulp novels and the New Wave of science fiction. The two editors contribute most of the pieces within, but there are spaces for other talented writers to shine. The book begins with the oeuvre of Gillo Pontecorvo, most famous for directing 1966’sBattle of Algiers, one of the most iconic films of colonial revolt. In between the longer chapters are shorter outtakes that cover one film or a few films at a time, rather than a genre. Even if one hasn’t seen the films discussed, the editors generously supply over 200 production stills and posters from around the world that give a sense of each film’s visuals and tone. Genre is no object for the films covered. Neither is the often-thin line between the grindhouse and arthouse. Contributors look at films from the somewhat mainstream spaghetti Westerns to the much more obscure Indian gangster movies. Political violence and resistance are a large umbrella that many films can, and do, fit into. The publisher’s description notes that “the book examines film-making movements like the French, Japanese, German, and Yugoslavian New Waves; sub-genres like spaghetti westerns, Italianpoliziotteschi, Blaxploitation, and mondo movies; and films that reflect the values of specific movements, including feminists, Vietnam War protesters, and Black militants.” At the same time that Hollywood was pushing saccharine films in the mid-1960s like The Sound of Music, outsiders were crafting films that went far beyond even the supposed rebelliousness of the New Hollywood of Coppola and Scorcese. The time frame covered byRevolution in 35mmspans the colonial revolts that put the final nails in classic European imperialism’s coffin to the collapse of the Soviet Union heralding the end of the Cold War. It’s clear from contributor Matthew Kowalski’s discussions of the Yugoslavian New Wave that “actually existing socialism” was just as ripe for counter-cultural films as the capitalist West. Trying to make films under authoritarian regimes is a recurrent theme of the book. Brazilian Directors Glauber Rocha and Jose Mojica Marins dealt with their U.S. backed junta. Lino Brocka struggled to realize his vision under the Marcos dictatorship (also U.S. backed) in the Philippines. Certainly, living in the Communist Bloc allowed for little freedom of artistic expression during the Cold War. For instance, the New Wave in Yugoslavia came under heavy official pressure. Andrzej Zulawski’s surreal horror filmThe Devilwas banned in his native Poland. Nor were the capitalist democracies an easy place to make films. German filmmakers grappled with the legacies of Nazism and the inadequate de-Nazification all the while urban guerrillas like the Red Army Faction (the Baader-Meinhoff Gang) and the Revolutionary Cells waged war against the postwar state. In Italy, the Years of Lead from the late 1960s until the late ’80s were replayed on movie screens inpoliziotteschi, films that pitted hardboiled cops against the political establishment and right-wing conspirators. “Are you asking us to investigate or to overthrow the government?” asks one beleaguered police superintendent in Sergio Martino’sSuspicious Death of a Minor. The attitude of these films followed the old Latin phrase: “Let justice be done though the heavens fall.” Some of the best essays include focus on one film or a small group of films. Greek-Australian novelist Christos Tsiolkas explores his complicated feelings towardsZ, the 1969 Costa-Gavras anti-Greek junta film which has acquired a reputation of being immune from criticism. Cultural commentator Annie Rose Malement attempts to rehabilitate one of the most despised subgenres in exploitation cinema: the rape/revenge film. Exemplified by the 1978 American production,I Spit On Your Grave, the genre came under attack from both conservative moral guardians and feminist activists. Malement analyzes the films through the lens of Valerie Solanus’sSCUM Manifesto(Society for Cutting Up Men) that argues men have ruined the world, and finds much to recommend in them. Even the shlocky 1974Rape Squad(also listed by the less outrageous title, Act of Vengeance) is praised for referencing Chicago Women Against Rape and Sisters of Color Ending Sexual Assault for its plot featuring a group of rape victims taking bloody direct action against a serial rapist. Writer Robert Skvarla takes an interesting look at another much-maligned genre, Italian mondo films. Essentially over-the-top exploitive documentaries, mondos earned a reputation for racism and colonialism due to films like 1966’sAfrica Addio(Goodbye Africa). That film was picketed by abolitionist and former Black Panther Angela Davis in East Berlin over its alleged racism the year of the film’s release. By contrast, Svarkla views the film as an attack on European colonialism, one that places the blame for the continent’s violence on European exploitation. He makes the case for the ’80s mondo filmThe Killing of Americaas “one of the most damning indictments of America ever made.” How did contemporary radicals feel about the films profiled in this book? The record is mixed. For one, the Black Panthers thrilled to Melvin van Peebles’sSweet Sweetback’s Badassss Song, recommending the film on the front page of their party’s newspaper. On the other hand, one student radical criticized the filmThe Strawberry Statement, based on the 1968 Columbia University occupation, as “a cheap attempt at the commercial co-option and exploitation of the anguish of a generation.” In their introduction, editors Nette and Deighan argue that films from the fringes are just as worthwhile of critical attention as the blockbusters and critical darlings. Their book gives that attention to many under-seen and under-appreciated films. Revolution in 35mmcovers enough films in its 350 pages for a year’s worth of viewings. It would make for a great alternative to the standard film curriculums with theirCitizen KaneorBirth of a Nation. It challenges a reader of the book to resist making a list, mental or physical, of films they would want to watch. I know I couldn’t. Hank Kennedy is a Metro Detroit activist who writes regularly on comics, film, and their connections to politics. Fifth Estate @ No ads, No Copyright @ Powered byResponsive Theme"}