{"id": 1779, "name": "Organic Facts", "domain": "organicfacts.net", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.organicfacts.net/health-benefits/essential-oils/health-benefits-of-frankincense-essential-oil.html", "title": "Health Benefits Of Frankincense Essential Oil.html", "content": "Read Articles Saved Articles Liked Articles FoodFruitsHerbsVegetablesSeeds & NutsCerealsFish & MeatView All Fruits Herbs Vegetables Seeds & Nuts Cereals Fish & Meat View All Fruits Herbs Vegetables Seeds & Nuts Cereals Fish & Meat View All BeverageTypes & Benefits Types & Benefits Types & Benefits RecipesView AllSubmit Recipe View All Submit Recipe View All Submit Recipe Essential OilsTypes & Benefits Types & Benefits Types & Benefits Mental HealthView All View All View All Weight LossDiet PlansHoneyTop RemediesBlack Seed OilBest TeasView All Diet Plans Honey Top Remedies Black Seed Oil Best Teas View All Diet Plans Honey Top Remedies Black Seed Oil Best Teas View All LifestyleView All View All View All WellnessFitnessMineralsVitaminsOther Fitness Minerals Vitamins Other Fitness Minerals Vitamins Other Conditions A-ZDiseasesRemedies Diseases Remedies Diseases Remedies Report Error bookmark this article FoodFruitsHerbsVegetablesSeeds & NutsCerealsFish & MeatView All BeverageTypes & Benefits RecipesView AllSubmit Recipe Essential OilsTypes & Benefits Weight LossDiet PlansHoneyTop RemediesBlack Seed OilBest TeasView All WellnessFitnessMineralsVitaminsOther Home› Essential Oils› Frankincense Oil **10 Health Benefits of Frankincense Essential Oil** byMeenakshi Nagdevelast updated -April 22, 2024Medically reviewed byScott Johnson (AMP, CEEOS, CCMA, CPC)✓Evidence Based The health benefits of frankincense essential oil can be attributed to its properties as an antiseptic, disinfectant, astringent, carminative, cicatrizant, cytophylactic, digestive, diuretic, emmenagogue, expectorant, sedative, tonic, uterine, and a vulnerary substance. Apart from being used as a cosmetic and a fragrance, frankincense oil has many medicinal uses and health benefits such as reducing stress, boosting immunity, improving skin health, and promoting memory. **What IsFrankincense Oil?** Frankincense oil is extracted from the gum or resin of frankincense or olibanum trees, of the genusBoswellia carteri. Common species used to extract essential oil includeBoswellia carterii,B. frereana, andB. sacra. The maincomponentsof this essential oil (depending on the species and chemotype) are alpha-pinene, octanol, alpha-thujene, octyl acetate, incensole, and incensole acetate. Frankincense has been a popular ingredient in cosmetics and incense burners for centuries. It has even been found in the remains of ancient Egyptian and Anglo-Saxon civilizations. Furthermore, it is closely associated with religious traditions and rites, particularly the Christian tradition.[1] **Frankincense Essential Oil Health Benefits** Let us look at the most powerful healing benefits ofFrankincense oil. **Antimicrobial Properties** Frankincense oil iseffective asan antiseptic, and even the fumes or smoke obtained from burning it has antiseptic and disinfectant qualities that eliminate the germs as the smoke filters them out.Accordingto a 2012 study frankincense oil has antimicrobial properties and may help protect against pathogens. It can be applied to wounds to protect them from infections and becoming septic. It is equally good for internal wounds and protects them from developing infections.[2][3] **Improves Oral Health** Frankincense oil is best known for fighting harmful microorganisms. These properties work well for maintaining dental health as well. While it finds wide dental uses in several cultures where it is hailed for its protective properties, a double-blind randomized clinicaltrialhas found it to be especially useful against gingivitis. The study deems this to be a safe and cheaper medicine that can be used in aid of conventional treatment.[4] **Astringent Property** Frankincense oil is experiencing growing popularity in the world of clean, alternative beauty. While its antimicrobial properties prove useful on the path to clear skin, frankincense oil also works well as anastringent. Moreover, it works at deeper levels for troubled skin thus providing more sustainable results and works especially well for oily skin types. You can make your serum or oil blend at home or can opt for several readily available products in the market.[5] It canhelpeliminate sun spots, remove micro-wrinkles around the eyes and cheeks, and generally tone and tighten skin all over your body, while simultaneously raiding cell regeneration.[6] **Regulates Menstruation** Frankincense essential oil reduces obstructed and delayed menstruation and delays the advent of menopause. It also helps with other symptoms associated with menstruation and premenstrual syndromes (PMS), such as pain in the abdominal region, nausea, headache, fatigue, and mood swings. **Reduces Scars** This is one of the most interesting properties of frankincense oil. When applied topically or inhaled, it canhelpthe scars and marks of boils, acne, and pox on the skin fade at a much faster rate. This also includes the fading of stretch marks and surgery scars, making it quite useful for pregnant women and new mothers.[7] Frankincense essential oil is a great perfume. Photo Credit: Shutterstock **Aids Digestion** Fed up with those antacids? You should try frankincense oil instead. This oil hasdigestiveproperties without any side effects, and it facilitates digestion the way most medicines should, unlike common antacids which only suppress the symptoms. This oil speeds up the secretion of digestive juices (gastric juices, bile, and acids) in the stomach and facilitates the movement of food through the intestines bystimulatingperistaltic motion. This means an all-around improvement in the digestion of food.[8][9] **Reduces Respiratory Issues** Itsoothesthe cough and eliminates phlegm deposited in the respiratory tracts and the lungs. Frankincense essential oil also provides relief from bronchitis and congestion of the nasal tract, larynx, pharynx, bronchi, and lungs. Its antidepressant and anti-inflammatory properties also help relax the breathing passages, which can reduce thedangersof asthma attacks, and its antiseptic qualities give it thereputationof being an immune system booster! It also eases body pain, headaches, toothaches, and balances the rise in body temperaturecommonlyassociated with colds.[10][11][12][13] Frankincense oil is extracted from the gum or resin of frankincense or olibanum trees, of the genus Boswellia carteri. **Relieves Stress** Frankincense forms an important part of several rituals in some cultures. It is meant to purify and repel negativity. Interestingly, similar effects are to be observed in frankincense oil. The results of a 2019 animalstudyfound that the oil can easily help lower stress in rats by reducing sleep debt as well as maintaining antioxidant capacity. It was used topically in sleep-deprived rats with jojoba oil as a carrier.[14] **Keeps Uterus Healthy** Frankincense oil is also very good for uterinehealth. Since it regulates the production of the estrogen hormone, it reduces the chances of cyst formation in the uterus. It also keeps the uterus healthy by regulating proper menstrual cycles. It regulates gynecologic conditions or stressors that can lead to complicated dysfunctions in certain women.[15] **Speeds up Healing** Simply apply a diluted solution of this oil on wounds, or use it after blending with skin cream, and your wounds will heal faster and will also be protectedfrominfections. This oil is equally beneficial in healing internal wounds, cuts, and ulcers.[16] Other Benefits Frankincense oil relieves pain associated with rheumatism and arthritis. It helps to heal boils, infected wounds, acne, circulatory problems, insomnia, and varioustypesof inflammation as well.[17] Word of Caution:There are no known adverse side effects. That being said, frankincense essential oil should not be used during pregnancy and lactation or with medications without physician approval. Blending:Frankincenseoil blends well with other oils such as lime, lemon, orange, and other citrus oils as well as benzoin, bergamot, lavender, myrrh, pine, and sandalwood oil. This makes it a popular element of various aromatherapy combinations. https://www.sciencedirect.com/science/article/pii/S0254629910001705 http://www.ijnpnd.com/article.asp?issn=2231-0738;year=2012;volume=2;issue=2;spage=79;epage=79;aulast=Khan http://www.znaturforsch.com/ac/v58c/s58c0230.pdf https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2664784/ http://books.google.co.in/books?id=7nM3AgAAQBAJ http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1295557/ https://www.ncbi.nlm.nih.gov/pubmed/27117114 http://www.sciencedirect.com/science/article/pii/S1875686708000092 http://www.sciencedirect.com/science/article/pii/S1546250106000077 https://www.ncbi.nlm.nih.gov/pubmed/22288378 Meenakshi Nagdeve, Co-Founder, Organic FactsÂ is aÂ health and wellness enthusiast and is responsible for managing it. She has completed theNutrition And Healthy Living Cornell Certificate Program,Â Cornell University, US.Â She holds a Post Graduate Diploma in Management from IIM Bangalore and B. Tech in Metallurgical Engineering and Materials Science from IIT Bombay. Prior to this, she worked for a few years in IT and Financial services. An ardent follower ofÂnaturopathy, she believes in healing with foods. In her free time, she loves to travel and taste different types of teas. Curious about apple cider vinegar benefits? Discover how drinking cider vinegar can improve digestion, aid weight loss, & boost your healthâ\u0080\u0094find out today! Curious about the benefits of dates? Discover how this nutritious fruit improves digestion, boosts energy, & promotes overall health. explore the benefits today! Ginger also helps boost bone health, strengthen the immune system, and increase appetite. This spicy root is also good for mitigating obesity and relief from menstrual pain. Health benefits of hibiscus tea include its ability to control hypertension & reduce high blood pressure, lower blood sugar levels, & improve liver health. Read more! Benefits of calamansi juice include bleaching the skin, detoxifying the body, aiding in weight loss & managing diabetes. This juice also helps in soothing acidity. Moringa, a native plant of India, is rich in antioxidants. It helps manage diabetes, lower cholesterol levels, improve bone health, and is also beneficial for skin and hair. Lime has benefits that include weight loss, skin & eye care, improved digestion, & scurvy treatment. It also helps provide relief from piles, respiratory & urinary disorders. Barley grass helps strengthen the immune system, detoxify the body, & protects from radiation. It is a nutrient-rich superfood loaded with vitamins A, B, K & E. Read more! Home About Us Contact Us Terms of Use Privacy Policy Cookie Policy Affiliate Disclosure Organic Products Parenting Pet Care Â© 2025 Organic Information Services Pvt Ltd. All the information on this website is for education purpose only. Consult a medical practitioner for health problems. Images are provided by Shutterstock & our contributors. Organic Facts may receive a portion of revenues if you click on the sponsored ads and links by Google, Ezoic, or the Amazon Affiliate program. You must belogged into post a comment. Our articles are evidence-based and contain scientific references, fact-checked by experts. We source information from studies, clinical trial findings, and meta-analyses published in peer-reviewed journals. To increase transparency to the user, we provide reference links marked by numbers in parentheses in the copy of the article. The entire list of reference links is also provided at the bottom of the article."}