{"id": 1764, "name": "Natural Blaze", "domain": "naturalblaze.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://naturalblaze.com/2025/06/this-is-going-to-be-a-slog-senate-hearing-on-cover-up-of-covid-vaccine-risks-just-the-tip-of-the-iceberg-johnson-tells-committee.html", "title": "This Is Going To Be A Slog Senate Hearing On Cover Up Of Covid Vaccine Risks Just The Tip Of The Iceberg Johnson Tells Committee.html", "content": "Reading List FREE PDF Advertise Home Health Food Freedom Big Pharma Environment Remedies Preparedness Home & Garden Video Home Health Food Freedom Big Pharma Environment Remedies Preparedness Home & Garden Video **‘This Is Going to Be a Slog’: Senate Hearing on Cover-Up of COVID Vaccine Risks Just the ‘Tip of the Iceberg,’ Johnson Tells Committee** Total0 0 0 0 Like Facebook Twitter Email WhatsApp Wednesday’s hearing by the U.S. Senate Permanent Subcommittee on Investigations on evidence of a cover-up by public health officials of the extent of the risks associated with COVID-19 vaccines was the first of many to come, said Sen. Ron Johnson, chair of the committee. What began as aU.S. Senate hearingon the failure of public health officials to adequately warn about the risk of myocarditis associated with COVID-19 vaccines quickly morphed into areferendum on vaccine safetyin general, the liability protections afforded to vaccine makers, and the failure to provide resources and compensation to the vaccine-injured. Wednesday’s hearing before thePermanent Subcommittee on Investigationspitted Sen. Richard Blumenthal (D-Conn.), subcommittee ranking member, and Hawaii Gov. Josh Green, a doctor, staunch supporters of theCOVID-19vaccinecampaign and vaccines in general, against Sen. Ron Johnson (R-Wis.), subcommittee chair, and a panel of witnesses who criticized the government’s handling ofCOVID-19. “I am satisfied that our Senate hearing delivered America the truth on the COVID-19 vaccine debacle,”Dr. Peter McCullough, one of the witnesses, toldThe Defender. “Sadly, an untold number of primarily young individuals suffered devastating vaccine heart damage. Some lost their lives because of governmentagencycover-up on safety data that was emerging early in 2021.” Other witnesses includedDr. Jordan Vaughn,Dr. James Thorp,Dr. Joel Wallskogandattorney Aaron Siri. Green also appeared as a witness. Children’s Health DefenseCEO Mary Holland, who attended the hearing, said she was grateful to Johnson for “shining a bright light on what happened during the COVID era.” “The public has lost faith in the government because the government’s policies were catastrophic,” Holland said. “Senator Johnson is leading the charge to get to the truth about what happened to our country during COVID and to ensure that nothing like it will ever happen again.” Holland added: “The hearing initiated a dialogue between those of differing views, which is needed. But it was disappointing that the majority of subcommittee members either didn’t show up at all or showed up for cameo appearances.” Johnson warned at the close of the hearing that acknowledging and rectifying the problems of the COVID-19 era is going to take time. “This is going to be a slog,” he said. He said to “stay tuned” for announcements of future reports and hearings on the issue, as the evidence released so far is just “the tip of the iceberg.” Hearing held on the heels of 55-page report Wednesday’s hearing opened with Johnson reading highlights from a55-page reportreleased by the subcommittee earlier that day. The report detailed how federal health officials in spring 2021 failed to swiftlywarn the public of the risk of myocarditisand other cardiac-related issues following COVID-19 and, instead, downplayed the risk. Along with the report, thesubcommittee released over 2,400 pagesof U.S. Department of Health and Human Services (HHS) documents, including COVID-19 vaccine safety records and communications about the COVID-19 pandemic.Johnson subpoenaed HHSfor the documents in January. Before the committee heard from witnesses, Blumenthal pushed back against the claim that federal health officials had initially hidden data about myocarditis risk. He also praised the COVID-19 vaccine, saying the “most important fact” was that COVID-19vaccineshad saved “millions and millions” of lives. Blumenthal’s assistant placed posters behind him that echoed his claim. Later in the hearing, Siri called out Blumenthal on those claims, saying they were sourced from a blog, not from reliable data or sources. Blumenthal also showed a poster that claimed three deaths in 2025 had beencaused by measles. “Misinformation about the safety of vaccines has led to a deadly outbreak of a preventable disease,” he said. “We all know it: measles.” He went on to make statements undermining the credibility of the witnesses, including that some profited from selling “disproven” wellness treatments and suing vaccine companies. The witnesses gave testimony about what they had seen and experienced. Their comments varied greatly. Below are some highlights. Witnesses cite studies showing cardiac harm after COVID vaccines McCullough, a cardiologist and president of theMcCullough Foundation, cited numerous studies documentingsudden cardiac deathafter COVID-19 vaccination. “There are 1,065 papers in the peer-reviewed literature on COVID vaccine myocarditis. … This is in the peer-reviewedliterature,” McCullough said. “This is not misinformation.” McCullough said he’s worried that cases of acute COVID-19 vaccine-induced myocarditis while continue until the COVID-19 vaccines are halted. 💥 TRUTH BOMB: Peter McCullough Doesn’t Hold Back — “IT WAS NOT SAFE BY DESIGN.”@P_McCulloughMD: “The lethal part of the virus in the vaccinated, it’s circulating in the blood … It is a KILLER PROTEIN.” Bet your doctor didn’t share that LIFE-ALTERING fact with you…pic.twitter.com/LYhf6zNT0Z — Children’s Health Defense (@ChildrensHD)May 22, 2025 Vaughn, founder and president of theMicrovascular Research Foundation, which develops “effective, research-based treatment protocols for patients suffering from Long COVID,” said he’s treated over 4,000 long COVID and COVID-19 vaccine injury patients. Roughly 80% of the long COVID patients took the COVID-19 vaccine, Vaughn said. The spike protein is not a “benign” protein, Vaughn explained. “It triggers inflammation.” He criticized the Centers for Disease Control and Prevention (CDC) for failing to formally alert healthcare practitioners nationwide via its Health Action Network to the vaccine’s risk of myocarditis. According to the CDC, theHealth Alert Networkis the agency’s “primary method of sharing cleared information about urgent public health incidents with public information officers; federal, state, territorial, tribal, and local public health practitioners; clinicians; and public health laboratories.” “Instead of actually giving a health alert notice to all the physicians,” Vaughn said, “they decided with the help of the Biden administration to actually just update thewebsite of the CDC.” Thorp, an obstetrician and gynecologist, spoke on the potential harms topregnant womenfrom the COVID-19 vaccines, which he accused former public health officials of disregarding. For instance, Thorp cited a study he co-authored that was published in February in the peer-reviewed journalScience, Public Health Policy and the Law. The study identified37 safety signalsfor COVID-19 vaccines during pregnancy, including miscarriage, fetal malformations, premature birth, stillbirth, newborn asphyxia and newborn death. Orthopedic surgeon says one COVID shot left him disabled Wallskog, a board-certified orthopedic surgeon, told the committee how he became medically disabled after one dose of Moderna’s COVID-19 vaccine: “I proudly elected to get vaccinated and within a week I developed leg weakness, numbness, substantial balance loss leading to falls … I have been diagnosed withdysautonomiaand an undefined autoimmune disorder, both debilitating conditions affecting multiple body systems.” Wallskog is co-chair ofReact19, a nonprofit formed after the rollout of COVID-19 vaccines to help connect thoseinjured by the shotswith resources that can help them. In anX post, Wallskog called the hearing “a critical step toward accountability, transparency, and justice.” When it was Siri’s turn to speak, he emphasized that vaccine makers — unlike drug makers — are free of the risk of being sued for injury caused by their products, thanks to theNational Childhood Vaccine Injury Act of 1986. Vaccine companies aren’t incentivized to do rigorous, multi-year, placebo-controlled safety trials, since they don’t have to worry about costly lawsuits, Siri said. Hawaii governor says country is in ‘great peril’ of abandoning public health Green said he was testifying as a doctor. He blamed vaccine skepticism for the deaths of children from vaccine-preventable diseases, including COVID-19 and measles. He praised the COVID-19 vaccine, saying it lessened the severity of outcomes for those who got sick. Green said: “My heart is with everyone who had any kind of reaction to the vaccines that we’re talking about or loses a loved one. Of course we love our fellow mankind, but we cannot turn away from science.” He claimed the country is currently in “great peril” of no longer being “committed to public health.” Residents inHawaii recently killed a billthat was part ofGreen’s legislative agendathat would have removed residents’ right to religious exemptions from vaccines. Related articles in The Defender Breaking: Senate Report Exposes How Federal Health Officials ‘Downplayed’ COVID Vaccine Risks, Failed to Warn Public Mounting Evidence Suggests CDC Hid Data on COVID Vaccines and Myocarditis ‘Criminal Neglect’: CDC Knew COVID Vaccine Could Cause Myocarditis in Young Males Months Before Telling the Public CDC Stonewalls Requests for COVID Vaccine Safety Monitoring Documents Study of 1.7 Million Kids and Teens Who Got Pfizer COVID Vaccine Found Myopericarditis Only in Vaxed Enter Email Below To Stay Informed! Children's Health Defense Suzanne Burdick Ph.D. **Post navigation** **Holistic Health to Your Inbox!** Enter Email Below To Stay Informed! **Follow Us** June 7, 2025 June 7, 2025 June 6, 2025 June 6, 2025 June 4, 2025 June 4, 2025 June 9, 2025 June 9, 2025 June 8, 2025 June 8, 2025 June 11, 2025 June 11, 2025 June 5, 2025 June 5, 2025 June 10, 2025 June 10, 2025 **Natural Blaze** Disclaimer Privacy Policy Copyright Policy DMCA Natural Holistic Health News - Creative Commons 2020 Free yourself from Big Pharma with holistic medicine, homeopathic remedies, health food freedom, homesteading, preparedness, and natural lifestyle.Affiliate Disclaimer: Natural Blaze website is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com. **10 Best Books To Survive Food Shortages & Famines** Your survival library won’t be complete without these books! Plus get top natural health news delivered daily. Stay informed about health and food freedom, holistic remedies, and preparedness. Claim your FREE download TODAY! Enter Email Below To Stay Informed! **Login access is disabled**"}