{"id": 2117, "name": "Revcom.us", "domain": "revcom.us", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://revcom.us/en/worlds-attention-focused-gaza-israel-escalates-terror-forced-displacement-and-moves-take-over", "title": "Worlds Attention Focused Gaza Israel Escalates Terror Forced Displacement And Moves Take Over", "content": "**** **Main navigation** Home Donate Subscribe Sign Up, Get Involved **Revcom secondary menu** Bob AvakianBob Avakian@BobAvakianOfficial social mediaFeatured works from BABA's Collected WorksGet to Know BAThe Bob Avakian Institute Bob Avakian @BobAvakianOfficial social media Featured works from BA BA's Collected Works Get to Know BA The Bob Avakian Institute Bob Avakian @BobAvakianOfficial social media Featured works from BA BA's Collected Works Get to Know BA The Bob Avakian Institute The Revcom CorpsThe Revcom Corps The Revcom Corps The Revcom Corps Revolutionary Communist PartyRevolutionary Communist PartyRevolution BooksImportant Publications and MediaOf Continuing Interest and Key Questions of Orientation and Strategy Revolutionary Communist Party Revolution Books Important Publications and Media Of Continuing Interest and Key Questions of Orientation and Strategy Revolutionary Communist Party Revolution Books Important Publications and Media Of Continuing Interest and Key Questions of Orientation and Strategy ResourcesAmerican CrimeResource Page on the Genocidal Assault on Palestine — And Israel as an Enforcer of ImperialismA Resource Page: Capitalism—Imperialism Is Destroying the PlanetThe Real History of Communist RevolutionOrganizing Materials (English)Organizing Materials (Spanish)Donate / Sustain / SubscribeVolunteer with revcom.usSpecial Issues of RevolutionLatest PostsDownload this week’s posts American Crime Resource Page on the Genocidal Assault on Palestine — And Israel as an Enforcer of Imperialism A Resource Page: Capitalism—Imperialism Is Destroying the Planet The Real History of Communist Revolution Organizing Materials (English) Organizing Materials (Spanish) Donate / Sustain / Subscribe Volunteer with revcom.us Special Issues of Revolution Latest Posts Download this week’s posts American Crime Resource Page on the Genocidal Assault on Palestine — And Israel as an Enforcer of Imperialism A Resource Page: Capitalism—Imperialism Is Destroying the Planet The Real History of Communist Revolution Organizing Materials (English) Organizing Materials (Spanish) Donate / Sustain / Subscribe Volunteer with revcom.us Special Issues of Revolution Latest Posts Download this week’s posts **** **As World’s Attention Focused on Gaza, Israel Escalates Terror, Forced Displacement, and Moves to Take Over the Palestinian West Bank** As World’s Attention Focused on Gaza, Israel Escalates Terror, Forced Displacement, and Moves to Take Over the Palestinian West Bank As World’s Attention Focused on Gaza, Israel Escalates Terror, Forced Displacement, and Moves to Take Over the Palestinian West Bank June 9, 2025 Palestinian residents of the West Bank search the rubble of a family house demolished by the Israeli army, May 22, 2025. Photo:AP As much of the world’s attention is focused on Israel’s horrific genocide in Gaza, Israel is also escalating its multi-pronged campaign of terror, forced displacement and ethnic cleansing in the occupied Palestinian West Bank. This is coupled with a violent expansion of illegal Israeli settlements right on Palestinian-owned land. The West Bank is the area of historic Palestine west of the Jordan River (on the east side of what is now Israel). It is home to nearly three million Palestinians and has been mandated by the United Nations to be part of a future Palestinian state. Yet it has been under military occupation by Israel since it was seized by Israel through war in 1967. It is a basic principle of international law that a country that is occupying a territory cannot just take it over and make it part of its country. But since 1967, Israel—with U.S. backing—has violated international law and flooded the West Bank with illegal settlements and 500,000 settlers. These settlements are vehicles for Israel’s theft of what, according to international law, is Palestinian land, and to carve it up, forcing Palestinians into small areas surrounded by Israeli military and hemmed in with “checkpoints.” At the same time, the Palestinian population is subjected to continuous terror by mobs of heavily armed, rabidly racist “settlers,” who rampage across the West Bank terrorizing and brutalizing unarmed Palestinian farmers with impunity. Here are some of the main Israeli assaults on Palestinians in the West Bank in recent months: Israel’s New Settlement Expansion—Huge Step Toward Annexation.On May 29, theIsraeli government announcedit was planning to create 22 new settlements in the West Bank—the biggest expansion in decades.1Also, on June 3,Bezalel Smotrich, Israel’s pro-genocide Finance Minister, announced that the government would move ahead with construction plans, including 15,000 new housing units, that will “effectively divide the territory's northern and southern regions,”Haaretz reports. “This is how you kill the Palestinian state… This is how you bring in a million residents,” he said. “God willing, there'll be [Israeli] sovereignty [i.e., annexation of the West Bank] during this term.” West Bank Land Registration: Enabling Palestinian Dispossession.For the first time since Israel occupied the West Bank in 1967,the government has decidedto implement land registration. This is a step toward annexation in that Israelis will be able to claim permanent legal ownership of land while Palestinians, for all practical purposes, will not. This decision violates the prohibition against occupying powers making long-term changes in occupied territory, according to an international human rights lawyer. “There's no chance that any Palestinian will have their rights recognized,\" he said, adding that the decision will lead to \"a massive land grab by Israel of all lands in Area C.\" (A part of the West Bank administered by Israel.) Israeli Displaces Tens of Thousands—“Huge, Under-the-Radar Shift.”Israel has forced tens of thousands of Palestinians from their homes in the last several months. “Some Palestinians fear it may be laying the ground to annex the territory,”theNew York Timesreports, calling it a “Huge, Under-the-Radar Shift” in the West Bank. Jenin is one of the towns targeted. One densely populated Jenin neighborhood where “more than 10,000 people lived until recently,\" now \"is empty—its roads blocked by mounds of dirt and flanked by piles of rubble.” So far some 40,000 Palestinians have been displaced, more than any other Israeli military operation since Israel captured the territory during the 1967 Middle East war. (SeeIsrael Targets Jenin, Escalates Violent Ethnic Cleansing Across the West Bank, revcom.us, January 27, 2025.) Palestinians in the West Bank with posters of friends and relatives taken prisoner by Israeli forces. Photo:AP The Deadliest Period for Palestinian Prisoners in Israeli Detention. After October 7, 2023, the abuse of prisoners has gravely worsened, with at least 70 deaths, and a “dramatic escalationin the number of Palestinians behind bars”—more than 10,100, nearly double the number from before October 7—as well as “increasing prisoner abuse and mistreatment by Israeli authorities.” Most Settler Attacks in Over Two Decades.There are now more Israeli settler attacks on Palestinian communities in the West Bank than any other time in at least two decades, with an average of 44 Palestinians injured each month by settler attacks.2 Jerusalem Day Flag March: Mass Pogrom (Race Riot) Against Palestinians.May 26.This annual, government-sponsored commemoration ofIsrael's seizure of East Jerusalem in 1967,features tens of thousandsof fanatical youths from the religious Zionist movement rampaging through the streets of Jerusalem’s Old City, attacking Palestinians, “stealing merchandise, smashing shop signs, beating on metal doors with flagpoles, plastering racist stickers by the hundreds, and more.”In addition to “Death to Arabs” chants, this year these rabid Zionist youths celebrated the genocide in Gaza: \"There's no school in Gaza, there's no children left,\" \"Let the IDF fuck the Arabs,\" and \"Flatten Gaza.\" One Haaretz writer summed up, “Contrary to claims from religious-nationalist leaders, this hate is not the work of a small fringe… It wasn't a fringe few singing the racist songs, it was the majority.” Adding, “There is a straight line that connects the crude racism, violence, and cruelty unleashed every Jerusalem Day with the horrors unfolding in Gaza.” Jerusalem Day Flag March: Mass Pogrom (Race Riot) Against Palestinians.May 26.This annual, government-sponsored commemoration ofIsrael's seizure of East Jerusalem in 1967,features tens of thousandsof fanatical youths from the religious Zionist movement rampaging through the streets of Jerusalem’s Old City, attacking Palestinians, “stealing merchandise, smashing shop signs, beating on metal doors with flagpoles, plastering racist stickers by the hundreds, and more.” In addition to “Death to Arabs” chants, this year these rabid Zionist youths celebrated the genocide in Gaza: \"There's no school in Gaza, there's no children left,\" \"Let the IDF fuck the Arabs,\" and \"Flatten Gaza.\" One Haaretz writer summed up, “Contrary to claims from religious-nationalist leaders, this hate is not the work of a small fringe… It wasn't a fringe few singing the racist songs, it was the majority.” Adding, “There is a straight line that connects the crude racism, violence, and cruelty unleashed every Jerusalem Day with the horrors unfolding in Gaza.” Jerusalem Day Flag March: Mass Pogrom (Race Riot) Against Palestinians.May 26.This annual, government-sponsored commemoration ofIsrael's seizure of East Jerusalem in 1967,features tens of thousandsof fanatical youths from the religious Zionist movement rampaging through the streets of Jerusalem’s Old City, attacking Palestinians, “stealing merchandise, smashing shop signs, beating on metal doors with flagpoles, plastering racist stickers by the hundreds, and more.” In addition to “Death to Arabs” chants, this year these rabid Zionist youths celebrated the genocide in Gaza: \"There's no school in Gaza, there's no children left,\" \"Let the IDF fuck the Arabs,\" and \"Flatten Gaza.\" One Haaretz writer summed up, “Contrary to claims from religious-nationalist leaders, this hate is not the work of a small fringe… It wasn't a fringe few singing the racist songs, it was the majority.” Adding, “There is a straight line that connects the crude racism, violence, and cruelty unleashed every Jerusalem Day with the horrors unfolding in Gaza.” Israel Shuts Six UNRWA Schools Sending Hundreds of Students Home.UNRWA, the United Nations Relief and Works Agency for Palestine Refugees, was formed in 1948 to address the basic needs of the Palestinian people, including for food, shelter, education, and other basic necessities.The May 8 order carried out by Israeli security forces, forced some 700 students in East Jerusalem to leave school and go home. Israel has prohibited UNRWA’s activities in Israel, and this is yet another escalation of its campaign to destroy the organization which provides vital humanitarian support and services to Palestinians. Israeli Military Fires on Foreign Diplomats.On May 21, a diplomatic delegation from the European Union came under Israeli fire (“warning shots”) as it was conducting an official investigation of the humanitarian situation in the besieged Jenin refugee camp, which has been under violent Israeli attack. Israel Launches Public Relations Campaign to Legitimize Illegal West Bank Settlements.On May 7,Israel's Diaspora Ministry announcedthe launch of a nearly $1 million global public relations campaign to \"bolster the legitimization of settlements\" in the international arena. Trump Regime Shuts Down Direct Communications with Palestinians.“The U.S. ambassador to Israel, Mike Huckabee, plans to shut down a direct communications channel between U.S. diplomats in Jerusalem working on Palestinian issues and agencies in Washington,”the New York Times reports. This is a big signal that under Trump, the U.S. no longer considers Palestinian issues as important, or that the Israeli-occupied West Bank and Gaza Strip are separate from Israel. In short, it’s a step in the direction of Israeli annexation. *** These illegal Israeli assaults represent a serious and deadly leap. As in Gaza, these crimes are being accelerated thanks to the big green light from the Trump/MAGA fascist regime. Hamas' October 7, 2023 attack on Israel was launched from Gaza, not the West Bank. Yet the people of the West Bank too are being imprisoned, tortured, terrorized, murdered and their land is being taken anyway. This is further irrefutable proof that Israel isn’t “defending itself against terrorism”—it’s seizing this moment to carry out an all-around genocide of the Palestinian people. Resource Page on the Genocidal Assault on Palestine — And Israel as an Enforcer of Imperialism Resource Page on the Genocidal Assault on Palestine — And Israel as an Enforcer of Imperialism _______________ FOOTNOTES: 1.“Israel has built about 160 settlements housing some 700,000 Jews since it occupied the West Bank and East Jerusalem - land Palestinians want, along with Gaza, for their hoped-for future state - in the 1967 Middle East war. An estimated 3.3 million Palestinians live alongside them.”Israel announces major expansion of settlements in occupied West Bank, BBC News, May 29, 2025.[back] 2. “Israeli Forces Kill 14-Year-Old West Bank Palestinian as Settler Attacks Soar,”Democracy Now!,June 3, 2025.[back] **** Follow:@BobAvakianOfficialFollow: @TheRevcomsRead:www.revcom.usWatch:youtube.com/TheRevComs **** We are at a turning point in history. The capitalist-imperialist system is a horror for billions of people here and around the world and threatening the very fabric of life on earth. Now the election of fascist Trump poses even more extreme dangers for humanity—and underscores the total illegitimacy of this system, and the urgent need for a radically different system. The website Revcom.us follows the revolutionary leadership of Bob Avakian (BA), the author of the new communism.Bob Avakian has scientifically analyzed that we are in a rare time when an actual revolution has become more possible in the U.S. He’s charted a strategy for making that revolution, and laid out a sweeping vision and concrete blueprint for “what comes next” in theConstitution for the New Socialist Republic in North America. Revcom.us projects BA’s voice, leadership, and vision throughout society. It posts his timely leadership for the revcoms (revolutionary communists) and the whole movement for revolution, including hissocial mediaposts, and curates his whole body of work. Our website applies the scientific approach BA has developed to analyze major events in society and the world—why they are happening, how they relate to each other, how all this relates to the system we live under, where people's interests lie, how revolution is in fact the solution to all this, and what the goals of that revolution are. Revcom.us acts as a guiding and connecting hub for the revcom movement nationwide: showing what’s being done, digging into what’s right and what’s wrong, and rapidly learning—and recruiting new people into what has to be a rapidly growing force. As part of this, revcom.us feature and promotes the weeklyThe RNL—Revolution, Nothing Less!—Showon YouTube.com. Put it this way: there will be no revolution unless this website not only “keeps going” but rises to a whole different level! DONATE NOWto revcom.us and get with BA and the revcoms! Your donations contribute to: Strengthening revcom.us as an accessible, secure, robust website able to rise to the challenge of meeting the extraordinary demands of navigating the challenges of fascism and preparing for revolution in this pivotal, unprecedented year Expand the reach and coverage of revcom.us, including enabling revcoms to go to “hotspots” across the country. Printing and distribution of key revcom materials, includingWE NEED AND WE DEMAND:A WHOLE NEW WAY TO LIVE, A FUNDAMENTALLY DIFFERENT SYSTEMandWE ARE THE REVCOMS (Revolutionary Communists). More ways to donate If you are horrified at the Trump/MAGA fascism spawned by this system of capitalism-imperialism coming to power in the world’s top nuclear-armed superpower… outraged at the tremendous harm this fascism is perpetrating on people in this country and the whole world… hate the Dark Ages morality and Christian fascism that they are trying to forcibly impose…see the very existence of humanity being threatened by the increasing danger of nuclear war and destruction of the environment:Be part of supporting this revcom.us website that—now more than ever—plays a crucial role in exposing the system ruling over us and in leading people out of this madness to a radically different and far better future. See FIVE REASONSyou should donate, spread the word about revcom.us, and urge your friends and others to donate andsubscribeto this website. **** **FEATURED: BOB AVAKIAN** Social media messages from @BobAvakianOfficial: Opposing theenemy withinthe fight to defeat Trump/MAGA fascism: this putrid culture, lies and slander Social media messages from @BobAvakianOfficial: Opposing theenemy withinthe fight to defeat Trump/MAGA fascism: this putrid culture, lies and slander Important Messages from Bob Avakian: Trump/MAGA Fascism: What We'reReallyFacing, Why, and What Must Be Done toDefeatIt Before It's Too Late. Important Messages from Bob Avakian: Trump/MAGA Fascism: What We'reReallyFacing, Why, and What Must Be Done toDefeatIt Before It's Too Late. **FEATURED: NEWS** ITISHAPPENING HERE... AND IT’S HAPPENING NOW... What areyougoing to do?? ITISHAPPENING HERE... AND IT’S HAPPENING NOW... What areyougoing to do?? The Throwdown in Los Angeles: Fascist Attacks on Immigrants, People Stand Up The Throwdown in Los Angeles: Fascist Attacks on Immigrants, People Stand Up WWW.REVCOM.US/REVOLUTIONNEWSPAPERbrings alive a scientific analysis of major events in society and the world—why they are happening, how different events and developments relate to each other, how all this relates to the system we live under, where people's interests lie in relation to all this, how revolution is in fact the solution to all this and what the goals of that revolution are, how different viewpoints and programs relate, positively or negatively, to the revolution that is needed, and how people can move, and are moving, to build toward that revolution. Revcom.us/Revolutionis the guide, the pivot, the crucial tool in drawing forward, orienting, training, and organizing thousands, and influencing millions—fighting the power, and transforming the people, for revolution—hastening and preparing for the time when we can go for the whole thing, with a real chance to win. Subscribe to revcom.us|Donate to/Sustain revcom.us| Send your correspondence torevolution.reports@yahoo.com HOME FEATURED Bob Avakian: A Radically Different Leader—A Whole New Framework for Human Emancipation WatchThe RNL—Revolution, Nothing Less!—Show We Need and We Demand : A Whole New Way to Live, A Fundamentally Different System We Are The Revcoms Find Out About The Revcom Corps for the Emancipation of Humanity Points of Attention for the Revolution American Crime BOB AVAKIAN Bob Avakian: A Radically Different Leader—A Whole New Framework for Human Emancipation BA’s Collected Works Bob Avakian — Breakthroughs — The Historic Breakthrough by Marx, and the Further Breakthrough with the New Communism—A Basic Summary The New Communism (PDF) Constitution For The New Socialist Republic In North America (PDF) Bob Avakian on social media! The Bob Avakian Institute REVOLUTIONARY COMMUNIST PARTY, USA Revolutionary Communist Party Main Page Find Out About The Revcom Corps For The Emancipation Of Humanity Revolution Books Of Continuing Interest and Key Questions of Orientation and Strategy Important Publications and Media WHAT YOU CAN DO NOW Find Out About The Revcom Corps For The Emancipation Of Humanity WatchThe RNL—Revolution, Nothing Less!—Show Revolution Books Volunteer with revcom.us DONATE SUBSCRIBE RESOURCES Latest Posts & Past Articles Download This Week’s Posts WatchThe RNL—Revolution, Nothing Less!—Show Special Issues ofREVOLUTIONnewspaper Subscribe – Donate – Sustain Browse the REVCOM.US library CONTACT Follow revcom.us: Subscribe Send correspondence/ photos / videos to revcom.us Volunteer Find Revolution Books locations and contacts. Revcom Corps For The Emancipation Of Humanity Contact RCP Publications:PO Box 804956Chicago, IL 60680-4111rcppublications@gmail.com This site is owned byRCP PublicationsPO Box 804956, Chicago, IL 60680-4111rcppublications@gmail.com Legal Notice"}