{"id": 1471, "name": "WTMJ - Milwaukee News", "domain": "tmj4.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.tmj4.com/news/milwaukee-county/its-honestly-very-surreal-milwaukee-students-reflect-on-getting-the-chance-to-meet-pope-leo-xiv-at-the-vatican", "title": "Its Honestly Very Surreal Milwaukee Students Reflect On Getting The Chance To Meet Pope Leo Xiv At The Vatican", "content": "Menu WeatherToday's ForecastInteractive RadarHourly Forecast7-Day ForecastLive Weather CamsWeather MapsTravel ForecastWeather AlertsClosingsScience ExperimentsWeather BlogWeather Kids Today's Forecast Interactive Radar Hourly Forecast 7-Day Forecast Live Weather Cams Weather Maps Travel Forecast Weather Alerts Closings Science Experiments Weather Blog Weather Kids Today's Forecast Interactive Radar Hourly Forecast 7-Day Forecast Live Weather Cams Weather Maps Travel Forecast Weather Alerts Closings Science Experiments Weather Blog Weather Kids Traffic News by TopicLocal NewsPride MonthTMJ4 Price Tracker: Local grocery pricesLighthouseDuty to DiscloseMilwaukee TonightPositively MilwaukeeMade in WisconsinNationalSubmit News Tips Local News Pride Month TMJ4 Price Tracker: Local grocery prices Lighthouse Duty to Disclose Milwaukee Tonight Positively Milwaukee Made in Wisconsin National Submit News Tips Local News Pride Month TMJ4 Price Tracker: Local grocery prices Lighthouse Duty to Disclose Milwaukee Tonight Positively Milwaukee Made in Wisconsin National Submit News Tips News by LocationDodge CountyFond du Lac CountyJefferson CountyKenosha CountyMilwaukee CountyOzaukee CountyRacine CountySheboygan CountyState CapitolWalworth CountyWashington CountyWaukesha County Dodge County Fond du Lac County Jefferson County Kenosha County Milwaukee County Ozaukee County Racine County Sheboygan County State Capitol Walworth County Washington County Waukesha County Dodge County Fond du Lac County Jefferson County Kenosha County Milwaukee County Ozaukee County Racine County Sheboygan County State Capitol Walworth County Washington County Waukesha County VideosLive NewscastsYoutube Channel Live Newscasts Youtube Channel Live Newscasts Youtube Channel SportsGreen Bay PackersMilwaukee BrewersMilwaukee BucksFriday Football FrenzyGreen & Gold LiveGreen & Gold One Minute Drill Green Bay Packers Milwaukee Brewers Milwaukee Bucks Friday Football Frenzy Green & Gold Live Green & Gold One Minute Drill Green Bay Packers Milwaukee Brewers Milwaukee Bucks Friday Football Frenzy Green & Gold Live Green & Gold One Minute Drill The Morning Blend What's Brewing Wisconsin EntertainmentTV ListingThe Kelly Clarkson ShowWatch NBC Shows TV Listing The Kelly Clarkson Show Watch NBC Shows TV Listing The Kelly Clarkson Show Watch NBC Shows About UsContact UsNews TeamJobsAdvertise With UsTV ListingsMug Shot PolicyFacebook Comment PolicyMoving ForwardSupportWatch TMJ4 News anywhere Contact Us News Team Jobs Advertise With Us TV Listings Mug Shot Policy Facebook Comment Policy Moving Forward Support Watch TMJ4 News anywhere Contact Us News Team Jobs Advertise With Us TV Listings Mug Shot Policy Facebook Comment Policy Moving Forward Support Watch TMJ4 News anywhere ContestsExplore Elgin Area SweepstakesWeather Kids Explore Elgin Area Sweepstakes Weather Kids Explore Elgin Area Sweepstakes Weather Kids Featured ContentIf You Give a Child a Book...Every Day Health If You Give a Child a Book... Every Day Health If You Give a Child a Book... Every Day Health Sign In Newsletters Sign Out Manage Emails Apps Careers Search Dodge County Fond du Lac County Jefferson County Kenosha County Milwaukee County Ozaukee County Racine County Sheboygan County State Capitol Walworth County Washington County Waukesha County **Actions** Facebook Tweet Email **'Very surreal': Milwaukee students reflect on getting the chance to meet Pope Leo XIV at the Vatican** ROME — Students from St. Anthony School in Milwaukee are having an audience with Pope Leo XIV at the Vatican on Wednesday, fulfilling a rare opportunity for the young Catholics. I caught up with the students while they were on their tour bus in Rome, where the group was headed back to their hotel after a day of sightseeing and meeting with Cardinal James Michael Harvey, who is the archpriest of the papal basilica in Rome but originally from Milwaukee. The students participated in a Mass with the cardinal before their scheduled audience with the pope. \"I honestly don't know. It's kind of crazy to think about that we're going to be able to meet the pope, and that we are going to be in Mass with him. It's honestly very surreal,\" said Dael Colchado, Class of 2025. \"Yes, especially because he kind of has a Hispanic Latino background like us, so having that similarity excites me a lot,\" said Jaimy Huerta, Class of 2025. Watch: Milwaukee students reflect on getting the chance to meet Pope Leo XIV Cardinal James Michael Harvey knew Pope Leo when they were both serving in the Catholic Church in the Midwest and was instrumental in arranging this special visit. This story was reported on air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. It’s about time to watch on your time. Stream local news and weather 24/7 by searching for “TMJ4” on your device. Available for download on Roku, Apple TV, Amazon Fire TV, and more. Report a typo or error//Submit a news tip Report a typo **Sign up for our newTMJ4 Morning Headlines Newsletterand get the latest news and weather delivered straight to your inbox.** **now signed up to receive theMorning Headlines Newsletter.** **Meet your northern Milwaukee County reporter: Gideon Verdin** **Meet your northern Milwaukee County reporter: Gideon Verdin** **Meet your southern Milwaukee County reporter: Brendyn Jones** **Meet your southern Milwaukee County reporter: Brendyn Jones** Traffic News Sports Contact Us Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact tmj4 tmj4news tmj4"}