{"id": 1210, "name": "San Diego Free Press", "domain": "sandiegofreepress.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://sandiegofreepress.org/2018/12/obama-once-again-getting-the-word-out-on-health-insurance-enrollment-and-this-years-deadline-of-december-15-video-worth-watching/", "title": "Obama Once Again Getting The Word Out On Health Insurance Enrollment And This Years Deadline Of December 15 Video Worth Watching", "content": "Home Subscribe! About Us / FAQ Staff Columns Awards Terms of Use Facebook Twitter Contact OB Rag Donate **San Diego Free Press** **Grassroots News & Progressive Views** **Obama Once Again Getting the Word Out on Health Insurance Enrollment and This Year’s Deadline of December 15 | Video Worth Watching** December 11, 2018byRich Kacmar **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X More Click to share on LinkedIn (Opens in new window)LinkedIn Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on Reddit (Opens in new window)Reddit Click to share on Pocket (Opens in new window)Pocket Click to share on WhatsApp (Opens in new window)WhatsApp The deadline this year for enrolling in an ACA health plan is December 15th. President Barack Obama is back to remind potential enrollees of the need to sign up for health insurance coverage atHealthCare.govby that date. No jump shots. No ferns. No memes. Not this time. I’m going to give it to you straight: If you need health insurance for 2019, the deadline to get covered is December 15. Go tohttps://t.co/ob1Ynoesodtoday and pass this on — you just might save a life.pic.twitter.com/8mHMsXGY0g — Barack Obama (@BarackObama)December 10, 2018 We atSan Diego Free Presslove watching all kinds of video. Those short visual stories entertain, inform, and agitate in a way completely different from the written word. Since our platform is about expressing ideas and ideals instead of cash flow, clicks, or fundraising, we have the freedom to include a wide range of topics and formats that might not work elsewhere. We don’t need or want paid content, promotional materials, or story lines designed to please donors. So the idea here is to present videos one or more of the editors feel speaks to them. Sometimes it will be news. Sometimes it will be history. And a lot of the time it will be culture. You can not and should not separate these things: it is diversity and intersectionality that makes our movement strong. Feel free to suggest videos atcontact@sandiegofreepress.org Subscribe with an RSS reader Bio Latest Posts Movin’ on with style and grace … | Video Worth Watching- December 14, 2018 Paul Ryan’s Cowardly Act On Yemen | Video Worth Watching- December 13, 2018 Don’t Believe Trump Is an Idiot? Don’t Take Our Word For It. Ask Google Images … | Video Worth Watching- December 12, 2018 **Like this:** **Related** Filed Under:Government,Health,Video Worth Watching Let it be known that Frank Gormlie, Patty Jones, Doug Porter, Annie Lane, Brent Beltrán, Anna Daniels, and Rich Kacmar did something necessary and beautiful together for 6 1/2 years. Together, we advanced the cause of journalism by advancing the cause of justice. It has been a helluva ride. \"Sometimes a great notion...\" (Click here for more details) Click for the #ResistanceSD archives Click here to listen to KNSJ live online Sitemap Contact About Us Terms of Use ©2010-2017 SanDiegoFreePress.org Code is Poetry"}