{"id": 2013, "name": "Informed Comment (Juan Cole)", "domain": "juancole.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.juancole.com/2025/06/international-businesses-institutions.html", "title": "International Businesses Institutions.html", "content": "Thoughts on the Middle East, History and Religion **Header Right** Featured US politics Middle East Environment US Foreign Policy Energy Economy Politics About Archives Submissions © 2025 Informed Comment Skip to content Skip to primary sidebar **How Israeli and International Businesses and Financial Institutions Sustain Illegal Occupation** Dan Steinbock06/11/2025 As the West Bank is being annexed to Israel through blood and violence, many Israeli and international businesses and financials are tacitly supporting the ethnic cleansing with their business operations in the Israeli-occupied Palestinian territories. Recently, the Norwegian parliament rejected efforts to tighten rules on its huge sovereign wealth fund investing in companies operating in the West Bank. Despite Norway’s central role in the initiation of the two-state peace process in the 1990s, the Norwegians lawmakers voted by88 to 16 against a proposalthat would have ordered the fund to withdraw from companies “that contribute to Israel’s war crimes and the illegal occupation” of the West Bank. Fueled by vast revenue from Norway’s abundant oil and gas exports, Norway’s sovereign wealth fund is the biggest in the world and has some $1.8 trillion invested around the globe. Its precedence-setting example matters, especially as it prides itself over the fact that many companies are excluded from its portfolios “on ethical grounds.” Why then the vote for continued war crimes, illegal occupation and ethnic cleansing? Double standards According to its ethical guidelines, the Fund cannot invest money in companies that directly or indirectly contribute to killing, torture, deprivation of freedom or other violations of human rights in conflict situations or wars. But in practice, the fund is allowed to invest in a number of arms-producing companies, as only some kind of weapons, such as nuclear arms, are banned by the ethical guidelines as investment objects. In the past two decades, the Fund has excluded some Israeli companies, but in a highly restrictive manner, including Elbit Systems (Sep. 2009), due to supply of surveillance systems for the Israeli West Bank barrier; Africa Israel Investments and Danya Cebus (Aug. 2010), and Shikun Uvinui (Jun. 2012), due to violation of international humanitarian law in occupied Palestinian territory by being involved in developing settlements. Such exclusions create an impression of token concern because there are dozens and dozens of both Israeli and international companies operating in the West Bank, even as its Palestinian residents are under constant threat of violence and ethnic cleansing. In Norway, the government was under pressure to use its financial clout to influence Israel’s policies in Gaza and the West Bank, where its settlement policy has long been deemed illegal under international law. Some 50 Norwegian NGOs, spearheaded by the country’s main union, called on the Labor government to ensure that the fund’s investments were in line with the country’s legal obligations. Meanwhile, UN special rapporteur on the Palestinian territories, Francesca Albanese, urged Oslo to “fully and unconditionally divest from all entities linked to Israel’s unlawful presence in the occupied Palestinian territory.” In his reply of May 30, Norway’s finance minister Jens Stoltenberg said the Norwegian government was deeply concerned by developments in Palestine, both in Gaza and in the West Bank. Then he proceeded todefend the “legality” of the Fund’s controversial investmentsin the Israeli-occupied Palestinian territories. Stoltenberg is the former chief of NATO. Business operations in the West Bank Since the late 2010s, the UN Human Rights Office of the High Commissioner (OHCHR) has used independent international fact-finding missions to investigate the implications of the Israeli settlements on the civil, political, economic, social and cultural rights of the Palestinian people throughout the occupied territories, including East Jerusalem. These reports do not cover all companies operating in the occupied territories. However, they do include the major ones that play the most critical roles (seeTableat bottom). The overwhelming majority of these firms are headquartered in Israel. There are more than 110 such companies. Since the first OHCHR report in 2020, some are no longer involved in the listed activities, such as General Mills and its Israeli subsidiary, which likely divested following a campaign to get the company to stop manufacturing its Pillsbury products on stolen Palestinian land. In addition to a broad variety of Israeli companies making money on the illicit territories, several international companies prevail in these areas, including Airbnb and Expedia (U.S.), Booking.com and Tahal Group (Netherlands), J.C. Bamford Excavators and Opodo (UK). Still others operate through their parent organizations, including Motorola and Booking Holdings (U.S.), Egis (France), and Altice (Luxembourg), and licensors or franchisors, such as Greenkote (UK). European financial institutions behind settler expansion According toDon’t Buy into Occupation(DBIO), a coalition of 25 Palestinian, regional and European organizations, in the early 2020s almost 800 European financial institutions, including banks, asset managers, insurance companies, and pension funds, had financial relationships with more than 50 businesses that were actively involved with Israeli settlements. All of these companies were involved in activities that raise particular human rights concerns, which constitute the basis for inclusion in the UN database of business enterprises. The list had almost 40 major European creditors, including BNP Paribas, HSCBC and Barclays, and 50 European investors, including Crédit Agricole, Deutsche Bank and Allianz. In addition to Israeli companies, defense contractors, financial institutions and universities that have been targeted in boycott and sanction campaigns for years, recent boycott efforts have increasingly centered on companies that play a critical role in the occupied territories, especially in the West Bank and East Jerusalem. Under international law, Israeli settlements, their maintenance and expansion are illegal activities, which give rise to individual criminal liability as war crimes and crimes against humanity under the Rome Statute of the International Criminal Court. Israeli, European, and international business enterprises, operating with or providing services to Israeli settlements, play a critical role in the functioning, sustainability and expansion of illegal settlements. Israelis for boycotts In the past decade, the Israeli government has invested hundreds of millions of dollars in PR struggles against the international boycott movement. Though controversial, the latter has attracted some Israeli Jews. Despite different political motivations, they are united by the quest for peace and the view that international pressure is necessary to achieve change in Israel. In 2012, Avraham Burg, the former chair of the Knesset and interim president of Israel, endorsed a boycott of Israeli settlement products. Personally, he boycotted all products produced in the settlements, refusing to cross the Green Line; that is, the pre-1967 borders. Such products were not “made in Israel” and should not be mislabeled that way. Colonizing Palestinian lands has made Israel “the last colonial occupier in the Western world.” Burg’s views were echoed byHa’aretzjournalist Gideon Levy, who also supported boycotting Israel, stressing that it was “the Israeli patriot’s final refuge.” As far he was concerned, “the change won’t come from within.” International boycotts are painful, but they cost less than human massacres and economic expenditures associated with forever wars. They are neither antisemitic nor anti-Israel. They target the occupation, the settlers and their allies in Israel and elsewhere, and their violence. Yet, the likelihood that most Israelis would adopt Gideon Levy’s view of Israeli boycotts is currently minimal, thanks to the parallel universe created by decades of massive U.S. military aid and money flows by American Jewry to Israel. If the status quo is untenable and change won’t come from within, then change can only come from without. “Squatters,” Digital, 2024 Table Israeli and International Companies in the Occupied Territories Companies in settlements*A. Business enterprises no longer involved in listed activities:Amnon Mesilot Ltd.Ashtrom Properties LtdAvgol Industries 1953Bank Otsar Ha-HayalBrand Industries Ltd.Citadis Israel Ltd.Darban Investments Ltd.Energy Renewable EnergiesGeneral Mills Inc.General Mills IsraelIndorama Ventures P.C.L.Jerusalem Economy Ltd.Municipal Bank Ltd.Pelegas Ltd.Zorganika Ltd. B. Business enterprises involved in listed activitiesAirbnb Inc.American Israeli Gas CorpAmir Marketing and Investment Inc.Amos Hadar Properties and Inv.Angel BakeriesArchivists Ltd.Ariel Properties GroupAshtrom Industries Ltd.Bank Hapoalim B.M.Bank Leumi Le-Israel B.MBank of Jerusalem Ltd.Beit Haarchiv Ltd.Bezeq the Israel Telecom CorpBooking.com B.V.C Mer Industries Ltd.Café Café Israel Ltd.CaliberCellcom Israel Ltd.Cherriessa Ltd.Chish Nofei Israel Ltd.Comasco Ltd.D.B.S Satellite Services LtdDelek Group Ltd.Delta Israel Brands LtdDor Alon Energy in Israel 1988 LtdEgis RailEgged Transportation Ltd.Electra AfikimEPR Systems Ltd.Extal Ltd.Expedia Group Inc.Field Produce Ltd.Field Produce Marketing Ltd.First International Bank of IsraelGalshan Shvakim Ltd.Hadiklaim Israel Date GrowersHot Mobile Ltd.Hot Telecom SystemsMivne Real EstateIsrael Discount BankIsrael Railways CorpItalek Ltd.J.C. Bamford ExcavatorsKavim Public TransportationLipski InstallationMatrix IT Ltd.Mayer Davidov GaragesMekorot Water CompanyMercantile Discount BankMerkavim Transportation TechMizrahi Tefahot BankModi’in Ezrachi GroupMordechai Aviv TassiotMotorola Solutions IsraelNaaman Group Ltd.Nof Yam SecurityOfertex Industries 1997Partner CommunicationPaz OilPelephone CommunicationsProffimat S.R.Rami Levy Chain StoresRami Levy HashikmaRe/Max IsraelShalgal Food Ltd.Shapir EngineeringShufersal Ltd.Sonol Israel Ltd.Superbus Ltd.Supergum IndustriesTahal Group InternationalTripAdvisor IncTwitoplast Ltd.Unikowsky Maoz Ltd.Zakai Agriculture Know-howZF DevelopmentZMH Hammerman Ltd.Zriha Hlavin Industries C. Business enterprises involved as parent companies:Alon Blue SquareAlstom S.A.10Altice International Ltd.Ashtrom Group Ltd.Booking Holdings Inc.Delta Galil IndustriesODIGEO S.A.Egis GroupElectra Group Ltd.Export Investment CoHadar GroupHamat Group Ltd.Kardan N.V.Mayer’s Cars and TrucksMotorola Solutions Inc.Natoon GroupVillar International Ltd. D. Business enterprise involved as licensors or franchisorsGreenkote P.L.C. European creditors *Loans and underwriting services to selectedcompanies, by creditor parent:BNP ParibasHSBCDeutsche BankSociété GénéraleKfWBarclaysCrédit AgricoleSantanderING GroupUniCreditBanco Bilbayo Vizcaya ArgetariaCommerzbankGroupe BPCESkandinaviska Enskilda BankenNatWestStandard CharteredIntesa SanpaoloCrédit MutuelLa CaixaDanske BankSwedbankLandesbank Baden WürttembergDZ BankNordeaBayernLBRabobankLandesbank Hessen-ThüringenSvenska HandelsbankenKBC GroupDNBLloyds BankingRaiffeisen BankingNorddeutsche LandesbankHamburg Commercial BankErste GroupParagon BankLa Banque PostaleBNP FinanceBanco de Sabadell European investors *Share and bondholding in selected companies,by investor parent:Government Pension Fund GlobalCrédit AgricoleDeutsche BankGroupe BPCELegal & GeneralAllianzDeka GroupNordeaAB IndustrivärdenBNP ParibasDZ BankSchrodersSwedbank“Algemeen BurgerlijkPensioenfonds”HSBCJanus HendersonIntesa SanpaoloBarclaysAMF PensionsförsäkringSkandinaviska Enskilda BankenSvenska HandelsbankenAXAAlectaAbrdn“Pensioenfonds Zorgen Welzijn”Sjunde AP-fondenM&GBaillie GiffordLa Banque PostaleStorebrandAvivaFlossbach & von Storch“Pensioenfonds Metaal enTechniek”BpifranceFörsta AP-FondenB-FlexionAckermans & Van HaarenIndependent Franchise PartnersCrédit MutuelMan GroupRoyal LondonRothschild“Pensioenfonds van deMetalektro”Fjärde AP-FondenBanco MediolanumAKO CapitalAegonTredje AP- FondenKBCAnima * OHCHR update, UN Human Rights Office of the Commissioner, June 30, 2023. ** European Financial Institutions’ Continued Complicity in the Illegal Israeli Settlement Enterprise, Don’t Buy into Occupation, Dec., 2023. Filed Under:Featured,Israel/ Palestine **About the Author** Dan Steinbockis the author ofThe Fall of Israel,. He is the founder of Difference Group and has served at the India, China and America Institute (US), Shanghai Institute for International Studies (China) and the EU Center (Singapore). For more, seehttps://www.differencegroup.net/ **Primary Sidebar** **Support Independent Journalism** Click hereto donate via PayPal. Personal checks should be made out to Juan Cole and sent to me at: **STAY INFORMED** **Social Media** **Popular** In New Low, Israel's Netanyahu has Recklessly allied with ISIS in Gaza The Madeleine ship: A Message of Solidarity with Gaza and resolve to break the Blockade A World of Enemies: America's Wars at Home and Abroad Gov. Newsom asks Trump to Withdraw Troops from Los Angeles and Protests Intensify Illegal and Immoral: Israel's Kidnapping of Greta Thunberg and the Madleen Aid Ship on the High Seas **Gaza Yet Stands** **Muhammad: Prophet of Peace amid the Clash of Empires** **The Rubaiyat of Omar Khayyam** © 2025 All Rights Reserved"}