{"id": 552, "name": "Frontiers in Environmental Economics", "domain": "frontiersin.org/journals/environmental-economics", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/environmental-economics/articles/10.3389/frevc.2025.1603746/full", "title": "Environmental Economics", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Agricultural Economics Ecological Economics Economics of Climate Change Energy Economics Resource Economics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Agricultural Economics Ecological Economics Economics of Climate Change Energy Economics Resource Economics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Agricultural Economics Ecological Economics Economics of Climate Change Energy Economics Resource Economics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Environ. Econ., 23 May 2025 Sec. Ecological Economics Volume 4 - 2025 |https://doi.org/10.3389/frevc.2025.1603746 This article is part of the Research TopicThe Contribution of Environmental Economics to the Real Estate SectorView all articles **Flood risk management and real-estate prices: between prevention and “crowding out” effect** UR ETTIS, INRAE Nouvelle-Aquitaine Bordeaux, Bordeaux, France Adapting to climate change is a key challenge for metropolis, and it partly deals with population location and flood risk management. The objective of this article is to understand the way flood risk is actually taken into account in residential choices. To this end, we measure how flood risk influences property prices and in particular, we target two specific flood management public instruments: the flood risk prevention plan (PPRI) and the public insurance mechanism (CatNat). We applied the hedonic price method over the period 2011–2016 to the French metropolitan area of Bordeaux, extended to include its neighboring estuarine municipalities. We show that flood risk zoning produces an expected significant deflating effect on prices whereas the CatNat system's insurance mechanism would appear to have a perverse effect. These results highlight an interesting crowding-out effect on the residential market that we finally discuss. **1 Introduction** Climate change is creating an increasing risk for urban areas, due in particular to more frequent and violent storms and flood phenomena (IPCC, 2022). The United Nations estimate that by 2050 almost 65% of the world's population will be living in urban zones, thus implying a new allocation of additional resources and services (to the population) (United Nations, 2019). The population in France is expected to reach 74 million in 2050, essentially distributed around urban centers increasing their vulnerability to global change. In such a context, and in this medium and long-term perspective, our cities have to deal with new challenges in terms of governance and more particularly to respond to the imperative of implementing measures to adapt to climate change. French current flood risk management strategy involves a combination of devices, alongside a number of classic flood defense infrastructures, the high maintenance costs of which are causing local managers to consider more flexible adaptation measures. Since 1982, plans to prevent natural risks (PPRN) (known as PPRI when related to flood risk) are France's main management and prevention tools. Through zoning and associated easements, these plans govern urbanization rights in accordance with the exposure and vulnerability of the zones at risk. In tandem with the “CatNat” compensation system, these tools constitute an original national solidarity system (Barraqué, 2014). In 1982, France created the “CatNat” system, a fund financed on the basis of national solidarity via home and car insurance premiums. When there is flooding, the mayor of a municipality can ask the State (via the Prefect) to declare the event as a natural disaster (“catastrophe naturelle” in French), hence the terminology CatNat. If, following an expertise, the State makes such a declaration, the system then grants all victims the right to financial compensation via their insurance. Through the introduction of such mechanisms, public action supposedly encourages better behavior by economic actors from a risk exposure standpoint, and real estate market prices should reflect such risk exposure. Even if risk has some subjective dimensions that are difficult to quantify, some study have attempted to measure its impact on residential choices and prices. Economic research has shown that flood risk is capitalized in properties prices. A drop in value is usually found, with, all things being equal, properties located in flood zones being less expensive than those in non-vulnerable zones (Holway and Burby, 1990;Bin and Polasky, 2004;Bin and Kruse, 2006;Kousky, 2010). Furthermore, this capitalization can also be observed by studying the market's reaction to an extreme event. Some have shown that real estate market may be affected by certain aspects of the event, such as its frequency or severity (Tobin and Montz, 1989,1990), or the repetition of a natural disaster which might permanently lower the price (Tobin and Newton, 1986). Temporal proximity to the hazard is a major factor, as the latter's occurrence might be deemed a way of “updating information on the risk” (Atreya et al., 2013, p. 578). However, some researchers have shown how risk can have an upward impact on real estate prices. The frequency of flooding can create a form of learning for public actors, particularly regarding how to act, and can motivate them to renovate certain public infrastructures at the municipal level, which will have a positive impact on prices (Tobin and Montz, 1989). The experience of flooding can also create this learning phenomenon at an individual level, encouraging households to adopt adaptive (Siegrist and Gutscher, 2008) or preparative (Becker et al., 2017) behaviors that can then be capitalized into prices. Finally, this capitalization of risk may also be affected by insurance premiums and by the capacity of the insurance system to be mobilized in order to reduce the risk (Surminski et al., 2015). A specific attention has been given to the case of central government actions and their negative impacts on the involvement of other local sectors especially in the insurance market. This leads to some crowding out effects (Slavikova, 2018). This may occur “when people feel that they are protected against flood risk by the government or other actors, either through public protection (e.g., large levee systems) or financial compensation (e.g., government disaster funds)” (Duijndam et al., 2023, p. 7). This phenomenon refers to moral hazard, which has been extensively studied in the literature on the insurance market. Indeed, the possession of insurance cover can directly reduce the incentive to resort to risk reduction measures, as has been shown in relation to flood risk in particular (Hudson et al., 2017;Hudson and Thieken, 2022). For example,Kousky et al. (2018)has shown how the existence of government aid in compensating for damage caused by natural disasters led to a fall in demand for private insurance. Such a perverse effect may even be greater when aid becomes “certain” and the system is institutionalized (Raschky et al., 2013). Some have concluded that post-disaster aid has a negative effect on the adoption of self-protection measures (Botzen et al., 2009), while others have observed the negative effect of this type of aid in terms of the adoption of personal insurance and adaptation measures (Kelly and Kleffner, 2003). If a high level of trust in the authorities and in their ability to act can thus alter people's perception of risk and reduce their coping behaviors (Wachinger et al., 2013), we might examine the consequences for residential market behaviors. This article proposes to contribute to this literature with a French case study. We study flood risk capitalization in real-estate market, looking at the effects on prices of the two specific French measures of the PPRI zoning and the CatNat. After setting out the methodological aspects in Section 2, we present the results in Section 3 followed by a discussion and a conclusion (Section 4). **2 Materials and methods** **2.1 Study area and datasets** The main object of the analysis is the residential property values in Bordeaux Métropole, France, in the recent period from 2011 to 2016. The Bordeaux conurbation is subject to a fluvial-maritime system, simultaneously affected by the Garonne and Dordogne rivers and their principal tributaries, and by the ocean. Eighteen municipalities of the Bordeaux Metropolis (BM) are thus wholly or partly at risk of flooding. 13,500 ha are below highest water levels of the Garonne (1/4 of the territory), and more than 40,000 people live in a flood zone. Bordeaux Métropole has been responsible for the management of aquatic environments and flood prevention (GEMAPI) since 2016. As part of the introduction of the “flood” European directive (2007/60/EC), a local flood risk management strategy (2016–2021) on the scale of the TRI (territory with a high flood risk) was defined and was notably operated by BM. One of the axes of this strategy concerns the reduction in vulnerability of property and person. Flood zone challenges were identified, and included numerous economic, agricultural, natural and human issues; property damage for an average event in the Bordeaux Metropolis was estimated at 190 M€. But other Gironde estuary municipalities are also vulnerable, and with the creation of a flood prevention program (PAPI) for the 2016–2021 period, reflection on flood risk management expanded from the metropolitan perimeter to the scale of the estuary as a whole. Given the challenges of global warming, its impact on sea-level rise and the loss of biodiversity, BM is pursuing an ambitious policy of managing aquatic environments and preventing flooding (GEMAPI), with a strategy adopted by the Council on November 25, 2022: it will be implemented over 10 years, at a cost of 120 million euros, throughout the Metropole. In order to study the metropolitan property market in relation to the flood risk that has an impact beyond the metropolitan perimeter, we decided to focus on the Bordeaux conurbation and its neighboring estuarine territories along the river that are also prone to flood risk, as shown onFigure 1below. Figure 1. Study area: the Bordeaux Metropole and its neighboring areas. Looking at property transactions between 2011 and 2016 within this territory of the extended Bordeaux metropolis, we use the DVF (Property Value Requests) database, provided by the DGFIP,1which lists real estate transactions based on notarized deeds and land registry information. It contains a brief description of the property's intrinsic characteristics such as the number of rooms, surface area of the land or surface of the building area. A statistical summary for the price and the 8 intrinsic characteristics of properties is proposed inTable 1. Our sample is of 24,871 houses. Table 1. Variables of the model and their statistics. We focus on two main flood management measures may affect properties prices. The two variables used to demonstrate it are PPRI and CatNat, also presented inTable 1. The first variable is based on the geographical layer of regulatory zonings of the flood risk prevention plans (PPRI) from the GéoRisques portal. This binary variable PPRI indicates whether the effected property transaction is located in a PPRI zone or not. We have first made sure that the PPRI takes precedence over the transaction, in which case it will constrain the property in terms of urban planning. This first variable represents the preventive dimension of the flood risk management strategy. In order to capture the compensation aspect of this policy, we use a second variable provided by the GASPAR national database produced by the French Ministry of Ecological Transition, Biodiversity, Forestry, Sea and Fisheries. This variable indicates the number of events recognized by decree as being natural disasters. In other words, it provides information about the number of events that fall within the “CatNat” mechanism described above. Using this variable, we look to capture the intensity of government aid effectively provided through the CatNat system, in the form of compensation for damage. In order to measure the intensity of public action, we have opted for a dummy variable, which also facilitates interpretation. This will enable us to distinguish between municipalities with a high level of natural disaster reporting and those with a lower level. This threshold was defined based on the statistical distribution of the variable. We set it at the third quartile of the distribution (9 decrees). We thus created a dummy variable CatNat that takes the value 1 when the transaction occurs in a municipality that has known at least 9 flood events recognized as natural disaster by decree, and 0 otherwise. According to the CatNat insurance mechanism, such a situation opens up the right to compensation from the insurers. Thus, CatNat variable informs on the intensity of municipality reactivity, on their ability to trigger compensation, on a significant frequency of the activation of the damage compensation mechanism. Even if the target is to look at the impact of flood on real estate prices, usual factors need to be taken into account to capture the classic mechanisms underlying residential choices, i.e., the impact of green amenities, the logic behind socio-spatial segregation, or access to services and jobs. Thus, residential and municipal environments of properties need are informed using INSEE's socioeconomic data at the “aggregated units for statistical information” (IRIS) or municipal scales, and spatialized data on the urban and natural environment from IGN “Topo Adresse” and “BD Parcellaire” databases, and from Corine Land Cover 2006. We thus set 9 variables (presented in group of variables E inTable 1) to capture the logics of accessibility, of landscape proximity and of communal social environment. In this way, the variable of distance from Bordeaux (dist_BX)captures the traditional effects of accessibility to the city center, with a negative coefficient reflecting a search for proximity to the city center. ABMdichotomous variable that allows identifying the specific effect of the Bordeaux metropolis compared to the rest of the territory. In addition, the metropolitan urban area is an administrative division that makes sense in the daily lives of inhabitants, particularly in terms of public transport. Moreover,dist_roadis a variable that measures distance to the main transport infrastructure. It is used to capture the accessibility dimension of the urbanization process of the metropolis. Thedist_riveris also a distance variable that is supposed to identify the amenity effect of the Garonne river of Bordeaux. Indeed, the river produces some positive externalities (such as recreative or landscape amenities), and this variable capture this dimension. The variable relating to urban density (surf_built_neigh) represents the total living area in square meters within a radius of 200 meters around the property. Similarly the variable relating to natural surface areas (surf_nature) represents the total surface area of green zones and water in square meters within a radius of 200 meters. The variable relating to the average height of the building (height_built_neigh) was calculated by adding up the heights of the buildings around the property within a 200 meter radius, and dividing by the number of buildings. Indeed, like (Girard, 2017), we took into consideration a “building height” variable rather than a volume in m3so as to provide an approximation of the density that people perceive through the urban forms that surround them. In order to characterize the social environment of properties, we decided to design two synthetic variables2: the social composition of the neighborhood (Social_compo_GX) and the isolation index (isolation). They were built at the IRIS scale using the 2014 Census database and INSEE's permanent facilities database. Social composition is a three-group partition indicator that classifies the IRIS in terms of their socioeconomic conditions. Group 1 clusters the “mixed” IRIS in terms of workforce and education and are essentially related to peri-urban zones. Group 2 contains the IRIS with the least favorable socioeconomic conditions. Group 3 contains the IRIS with a majority of people with favorable socioeconomic conditions. The isolation index is defined based on the average distance to reference facilities (such as supermarkets, primary schools, dentists, etc.). This distance is equal to 0 if the facility is within the IRIS; if this is not the case, it is equal to the distance separating the transaction from the closest IRIS with the missing facility. Hence the higher the isolation index, the more the IRIS is considered to be isolated. **2.2 Model** We use the hedonic price method (HPM) to study the impact of flood risk on property prices. Initially developed byRosen (1974), it has been widely used to study the calculation of land and property prices. It is a method based onLancaster's (1966)consumer theory, according to which the value of goods can be calculated from the value of their different characteristics. In other words, real estate properties values depend on their structural or intrinsic characteristics, and neighborhood or environmental characteristics (Freeman, 1979). We have therefore estimated a hedonic price function in an attempt to explain how different variables affect house prices. There is no consensus on the best way to formalize this hedonic function (Dubé et al., 2011). We opted for a semi-logarithmic model, with the price expressed in a logarithmic form and the explanatory variables expressed in a linear or logarithmic form according to the variables. This form is consistent withRosen (1974)and has been widely validated in the literature (Kim et al., 2003;Bourassa et al., 2004). The recent hedonic literature on risk capitalization usually favors double-difference approaches to study the effects of the implementation of a particular public policy or a particular event on prices (Hennighausen and Suter, 2020;Banzhaf, 2021). In our case, we do not adopt this approach (as some others did;Bin et al., 2008;Catma, 2021) because we are not studying the effect of a specific event such as the introduction of zoning or the declaration of a catastrophic flood. Actually, we do want to study the way in which these measures produce a discount theoretically expected on the market. More particularly, we explore the effect when these two political instruments are combined. However, we are in the continuity of studies that propose spatial hedonic modeling, seeking to take account of possible spatial effects (Brasington and Hite, 2005;Bin et al., 2011;Bui et al., 2024). Indeed, by its very nature property has a spatial character that requires one to consider possible spatial effects—i.e., that the prices of property in a given place are dependant of the prices of property in their neighborhood. Modeling spatial effects in the hedonic equation requires a spatial weights matrixW, which describes the pattern of spatial interactions between the real estate transactions.Windicates whether pairs of houses are spatially connected and have to be considered as neighboring observations. In our case, regarding the area under concern, the most appropriate W matrix is a 1-nearest neighbor matrix (WK= 1). We carried out a Moran general spatial autocorrelation test. The result (IK= 1= 0.50) confirmed the existence of a positive spatial dependence between the prices of the properties studied (suggesting a relative concentration of similar observations). However, it does not tell us anything about the type of spatial effect to be corrected. Based on a relationship of dependence between the property and its 1-nearest neighbor, we therefore estimated several econometric models in order to identify the various factors affecting house prices. Given the results of Lagrange and common factor tests, we retained a Spatial Error Model (SEM) (Halleck Vega and Elhorst, 2015). It means that one or more omitted variables in the hedonic equation vary spatially, and thus the error terms are spatially autocorrelated. In such a specification, spatial dependence is simply a nuisance and the implicit prices are directly given by the estimated coefficients (Maslianskaïa-Pautrel and Baumont, 2016). We therefore retained the following hedonic model: where logPis the vector of the logarithmic of sale prices of houses;Z, E, T, are respectively, the vectors of thekintrinsic,genvironmental, andmtemporal characteristics of real estate proprieties; ε represents the vector of the error terms. In the case of a SEM, ε follows a spatial autoregressive distribution with λ the spatial autoregressive coefficient, W the spatial weighting matrix, and u a vector of independent and identically distributed random error terms. PPRI, CatNat and their interaction PPRI*CatNat are the variables of main interest, as previously defined. **3 Estimation results** The spatial autoregressive error model (SEM) is estimated via maximum likelihood (ML), and estimations were performed under R (package spdep). Results are set out inTable 2. The OLS base hedonic model is an a-spatial model that serves as a benchmark against which the SEM effects can be compared. Table 2. Results of the MCO and SEM for hedonic valuation of real estate prices (The test's risk levels are noted: 1% “***”, 5% “**” and 10% “*”.). We will present and interpret the results in two stages. Before focusing on the impacts of the main variable of interest (flood risk variables), we comment first on the other determinants of housing prices and underline some stylized facts. **3.1 Stylized facts** In line with the literature (Baumont and Legros, 2013), the results relating to the intrinsic characteristics of property (variables groupZ) suggest that the greater its built area, the more land it has, the more rooms, whether it has a terrace, a swimming pool, more than one bathroom, a garage, and the better its condition, the higher its price is. In addition to these structural variables, temporal variables also prove to have a positive effect on prices (taking 2011 as the year of reference), which relates to the general price increase seen in the real estate market over that period in this area (A'Urba, 2018). Regarding the property's environment (variables group E), the distance to the Bordeaux urban center has a significantly negative (but very low) effect on prices meaning that the prices decrease with the distance to city center. Conversely, we notice positive coefficients for the variables of distance from the river and distance to the main road. The dichotomous BM variable is highly significant in the model, which means that the metropolitan effect is captured into prices. Several other variables that refer to the environment surrounding the property affect prices. Thus, a large green area, a small built area, and a significant average building height within 200 m of the house, will increase its value. The market therefore appears to valorize a green and dense neighborhood. The social environment also affects house prices through positive and significant effects relating to the social composition of the neighborhood.Socio_compo_G2andSocio_compo_G3have highly significant and positive coefficients. It illustrates the search for neighborhoods that are socioeconomically homogenous and above all without diversity (this mixed composition is represented by the reference level for social composition). Finally, theisolationindex has a positive effect on prices. All other things being equal, the market valorizes isolated properties but it should be noted that the interaction term between this isolation index and the distance from the road variable has an overall negative effect. It means that people valorize isolated houses, but that a property far from the main transport infrastructures will be less expensive, all other things being equal. People look for isolated housing but easily accessible. **3.2 Flood risk** As far as the results specifically relating to vulnerability to flooding are concerned, the two variables, and their interaction, reveal significant effects on house prices, albeit in different ways. The three flood components of the hedonic equation are highly significant. In the presence of the interaction term, the coefficients γ and δ are marginal effects and must be interpreted as holding the other variable equal to zero. For example, γ is the impact of being located in the PPRI zone of a municipality that has not experienced a high number of CatNat. Similarly, δ captures the impact of being located in a municipality with a high number of CatNat outside a PPRI zone. The interaction term θ informs about the marginal effect of being located in the PPRI zone of a municipality that has experienced a high number of CatNat flood events. PPRI variable has a negative and significant effect (γ^= −0.1143) on prices. This means that all other things being equal, a property located in a flood area in a municipality that has not experienced many CatNat events is less expensive than a property located outside that zone. The discount due to a flood zone location is ~11% in municipalities that have not experienced many CatNat events. The CatNat variable, on the other hand, has a positive effect on price (δ^= 0.0748), which means that all other things being equal, the fact of being located in a municipality that has experienced numerous floods recognized by decree as being natural disasters leads to higher prices for houses that are not located in flood zones. At first glance this is a counter-intuitive result that requires an explanation. It needs to be interpreted in relation to the compensative dimension that the variable CatNat conveys. Indeed, recognition of a flood event as a CatNat leads to financial compensation. The market would therefore appear to value significant activity by a municipality in terms of post-flood crisis management. According to the estimations, this CatNat variable leads to an appreciation in property value of ~7.8%. Finally, cross-referencing the two flooding variables allows us to capture their interaction effect. This interaction effect is significantlypositive(θ^= 0.0583). It means that people positively value being in the PPRI area of a municipality that has had numerous CatNat events. This marginal effect is positive and may be qualified as an “additional premium”. The impact of CatNat is therefore almost twice that in a non-flooded zone, i.e., almost 12% of the value of the property. In the same way, and symmetrically, comparing with the PPRI variable, the discount is therefore reduced to 5.6% of the value of the property: the drop in value due to being located in a flood zone is lower when the municipality has shown itself to be in a position to trigger aid. **4 Discussion/Conclusion** The results relating to stylized facts highlight the presence of the traditional process of peri-urbanization driven by the search for accessibility to the city center and to green amenities in the immediate vicinity of the home. On the other hand, as the literature has shown (Travers et al., 2009), proximity to the main transport infrastructures appears to be mainly perceived as nuisances which outweigh the advantages in terms of accessibility. This point requires qualification regarding isolated housing for which access to the road network is a sign of accessibility. The phenomenon of socio-spatial segregation often highlighted in contemporary urban forms would seem to be confirmed here, with the search for homogeneous and non-mixed socio-economic environments (Baumont and Legros, 2013). This result had already been demonstrated on the smaller scale of the Bordeaux metropolis alone (Décamps and Gaschet, 2013). Moreover, given the broader metropolitan scale that we have chosen, our results also ask questions about the emergence, parallel to this process of peri-urbanization, of a process of urbanization. This is characterized by a growing attractiveness for spaces far from the metropolis, spaces that will (re-)become attractive in their own right (Bailly and Bourdeau-Lepage, 2011). However, alongside these more general processes, our main results regarding the flood risk variables focus on two important phenomena that must be taken into account when considering the strategy for adapting cities to climate change. The first phenomenon concerning the PPRI zoning, which is standard in the literature, relates to people risk aversion. Indeed, locating in a flood prone area is negatively valued, meaning that people tend to move away from the risk and choose not to live in a flood zone. Such depreciation in property value due to being located in a flood zone is consistent with the literature (Bin and Kruse, 2006). The policy preventive instrument PPRI seems to produces what is expected. This analysis assumes that individuals are aware of this risk, without which the asymmetry of information might lead to poor residential choices. Yet in our case, the transaction data are all post-IAL (information to buyers and tenants) which has required, since 2006, buyers or tenants to be informed of the natural risks to which the property they wish to buy or rent is exposed. Furthermore, as the literature has shown, buyers must have information about a dwelling's exposure to risk and hence hope that the preventive mechanism is effective (Mauroux, 2015). We can therefore reasonably consider that our data do not contain any risk-related information asymmetry bias, and assume that the market is aware that a property is located within a PPRI zone. The average discount of being in a PPRI zone in a municipality that has not experienced any particular CatNat-type events is about 11%. The second mechanism relating to the effect of the “CatNat” variable is more complex and original, and requires precisions. As mentioned above, when a flood is recognized as a “natural disaster” by decree, this opens up the right to redress through compensation for damage. Such compensation reduces the final cost to the individual of the event-related damage. A buyer's risk of financial loss (in the case of material damage) is therefore minimized when local managers activate the compensation procedure. Despite the information conveyed by the fact of being both in a PPRI zoneandin a municipality that has experienced numerous CatNat events, our results show a premium for being located there. The impact of CatNat is almost 12% of the value of the property when it is located in this specific zone. It suggests that there is more to “gain” from the near certainty of seeing a compensation mechanism deployed when one is in a flood-prone area of the municipality. In the same way, and symmetrically, the discount of being in a flooding zone is therefore reduced to 5.6% of the value of the property: the drop in value due to being located in a flood zone is lower when the municipality has shown itself to be in a position to trigger aid. More generally, the CatNat coefficient taken in isolation is also positive, meaning that, even outside a flood prone area, houses are more expensive, all other things being equal, in communes that have experienced a large number of CatNat events, than those located in communes that have not. Our results can thus be read from two specific angles: that of governance and public action, and that of insurance and moral hazard. Through the prism of works on governance and public action, our results refer in particular to institutional factors and to levers of adaptation to climate change (Adger, 2000). The capacity of a local institution to take steps to reduce the risk of negative effects of flooding can indeed be linked to its capacity to adapt to flood events (Næss et al., 2005). This is an opportunity for the managers of these communes to undertake a number of repairs and make investments that can be capitalized in house prices. Yet given the nature of the CatNat system, which refers to a logic of both compensation and adaptation, our results are similar to a premium linked to the “compensation capacity” of the municipalities and it can be read through the prism of moral hazard and the crowding out effect. Some authors have described this premium as “financial security” produced by the “CatNat” system at the cost of a reduction in the effectiveness of prevention mechanisms (Cazaux et al., 2019). The significance and positivity of the interaction effect of the two variables underline the fact that the more a property is within a flood zone, the stronger this “compensation capacity” premium becomes, which supports our interpretation concerning the reparative and financial nature of the variable. This is clearly a perverse effect, having been analyzed in the literature as moral hazard, and more particularly a crowding out effect. In our case, individuals who feel certain that they will be able to benefit from compensation in the event of a disaster recognized as “CatNat” may be less inclined to avoid a location in a high-risk municipality. These results are in line with various studies in the literature that have shown the existence of moral effects or even crowding-out effects in the case of private insurance. Indeed, in the case of private insurance,Kousky et al. (2018)have shown the existence of a crowding-out effect associated with a government aid after a natural disaster, which discourages people from taking out private insurance. This effect is even more marked when the public aid is institutionalized, and considered as certain (Raschky et al., 2013). Even though in our case we are not studying private insurance take-up, we note that the very institutionalized Cat Nat mechanism produces a perverse effect and runs counter to the prevention mechanism supposed to encourage residential choices outside flood-prone areas. More broadly, then, this ties in with the work ofBotzen et al. (2009), for whom post-disaster government aid presents a moral hazard since it has a negative effect on the adoption of self-protection measures. Among those who focused more specifically on the French “CatNat” insurance system, some have shown that the CatNat system crowd out particular incentive for individuals to take mitigation measures (Poussin et al., 2013). But others have shown that the CatNat system does not appear to penalize individual flood protection behavior (Richert et al., 2019). In our case, the CatNat system does appear to produce this moral contingency, but in relation to the choice to locate and not to mitigate. Climate change is creating new challenges for urban territories, especially in terms of natural risk management. The necessary adaptive strategy to be implemented questions the role of public action mechanisms, whether they intervene at the level of prevention or compensation. Our study focuses on the combination of PPRI zoning and the CatNat system, by analyzing house prices in the Bordeaux metropolitan area, and in the more rural neighboring estuarine municipalities. Despite the limitation of not having price data over a longer period, our results confirm that zoning has a deflating effect on prices, but also reveal a perverse effect associated with the compensation mechanism. Properties thus have a premium for being located where the municipalities are the most reactive in triggering the CatNat system in the event of a flood. We explain such a premium by a moral hazard mechanism, according to which individuals know that they can count on the compensation for damage if they are affected by a natural disaster, so there is no need for them to take any specific action. In our particular case, individuals have no incentive to avoid residential location in vulnerable territories. This is our main contribution. Where the literature has until now focused on the occurrence of such crowding out in the private insurance market, or on the adoption of mitigation behaviors, we have studied the impact of CatNat-type compensation on the residential market. In terms of general recommendations, our results underline the importance of improving articulation between prevention and compensation in the governance of flooding risks. Further empirical investigations should make it possible to refine our understanding of the process at work and to provide other elements to assist decision-making. Given the current debate surrounding the CatNat system, which raises questions about its viability in the face of climate change, this study could open the door to new investigations in connection with possible adjustments of the national system. For instance, based on Hudson et al.'s work (Hudson et al., 2017), according to which a high degree of risk aversion can be a means of avoiding the crowding-out effect, we could question the possible effects of differentiating premiums according to risk level. **Data availability statement** The data analyzed in this study is subject to the following licenses/restrictions: the data was supplied by the Gironde Department under an agreement to make data available as part of the URBEST project. Requests to access these datasets should be directed toYy5kZWJyaWV1LWxldnJhdEBnaXJvbmRlLmZy. **Author contributions** JD-B: Writing – original draft, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was realized in the URBEST Program, funded by Labex COTE. **Conflict of interest** The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Footnotes** 1.^DGFiP: Direction Générale des Finances Publiques (Public Finances General Directorate). 2.^The author would be pleased to provide reviewers with details of how these two variables were constructed. It is not presented here, as it is not the focus of the paper. **References** Adger, W. N. (2000). Institutional adaptation to environmental risk under the transition in Vietnam.Ann. Assoc. Am. Geograp. 90, 738–758. doi: 10.1111/0004-5608.00220 Crossref Full Text|Google Scholar Atreya, A., Ferreira, S., and Kriesel, W. (2013). Forgetting the flood? An analysis of the flood risk discount over time.Land Econ.89, 577–596. doi: 10.3368/le.89.4.577 Crossref Full Text|Google Scholar A'Urba (2018). “Le prix de l'immobilier résidentiel dans Bordeaux Métropole,” inPrix de l'immobilier ~ Cahier n° 1 ~ 2018. ~ © a'urba. Bordeaux: A'Urba. Google Scholar Bailly, A., and Bourdeau-Lepage, L. (2011). Concilier désir de nature et préservation de l'environnement : vers une urbanisation durable en France.Géograp. Econ. Soc.13, 27–43. doi: 10.3166/ges.13.27-43 Crossref Full Text|Google Scholar Banzhaf, H. S. (2021). Difference-in-differences hedonics.J. Polit. Econ.129, 2385–2414. doi: 10.1086/714442 Crossref Full Text|Google Scholar Barraqué, B. (2014). The common property issue in flood control through land use in France.J. Flood Risk Manag.10, 182–194. doi: 10.1111/jfr3.12092 Crossref Full Text|Google Scholar Baumont, C., and Legros, D. (2013). Nature et impacts des effets spatiaux sur les valeurs immobilières.Rev. Écon.64, 911–950. doi: 10.3917/reco.645.0911 PubMed Abstract|Crossref Full Text|Google Scholar Becker, J. S., Paton, D., Johnston, D. M., Ronan, K. R., and McClure, J. (2017). The role of prior experience in informing and motivating earthquake preparedness.Int. J. Disaster Risk Reduct.22, 179–193. doi: 10.1016/j.ijdrr.2017.03.006 PubMed Abstract|Crossref Full Text|Google Scholar Bin, O., Crawford, T. W., Kruse, J. B., and Landry, C. E. (2008). Viewscapes and flood hazard: coastal housing market response to amenities and risk.Land Econ.84, 434–448. doi: 10.3368/le.84.3.434 Crossref Full Text|Google Scholar Bin, O., and Kruse, J. (2006). Real estate market response to coastal flood hazards.Nat. Hazards Rev.7, 137–144. doi: 10.1061/(ASCE)1527-6988(2006)7:4(137) Crossref Full Text|Google Scholar Bin, O., and Polasky, S. (2004). Effects of flood hazards on property values: evidence before and after hurricane floyd.Land Econ.80, 490–500. doi: 10.2307/3655805 Crossref Full Text|Google Scholar Bin, O., Poulter, B., Dumas, C. F., and Whitehead, J. C. (2011). Measuring the impact of sea-level rise on coastal real estate: a hedonic property model approach.J. Region. Sci.51, 751–767. doi: 10.1111/j.1467-9787.2010.00706.x Crossref Full Text|Google Scholar Botzen, W. J. W., Aerts, J. C. J. H., and van den Bergh, J. C. J. M. (2009). Willingness of homeowners to mitigate climate risk through insurance.Ecol. Econ.68, 2265–2277. doi: 10.1016/j.ecolecon.2009.02.019 Crossref Full Text|Google Scholar Bourassa, S. C., Hoesli, M., and Sun, J. (2004). What's in a view?Environ. Plann. A36, 1427–1450. doi: 10.1068/a36103 Crossref Full Text|Google Scholar Brasington, D. M., and Hite, D. (2005). Demand for environmental quality: a spatial hedonic analysis.Reg. Sci. Urban Econ.35, 57–82. doi: 10.1016/j.regsciurbeco.2003.09.001 Crossref Full Text|Google Scholar Bui, N., Wen, L., and Sharp, B. (2024). House prices and flood risk exposure: an integration of hedonic property model and spatial econometric analysis.J. Real Estate Finan. Econ. 69, 100–131. Google Scholar Catma, S. (2021). The price of coastal erosion and flood risk: a hedonic pricing approach.Oceans2, 149–161. doi: 10.3390/oceans2010009 Crossref Full Text|Google Scholar Cazaux, E., Meur-Ferec, C., and Peinturier, C. (2019). Le régime d'assurance des catastrophes naturelles à l'épreuve des risques côtiers. Aléas versus aménités, le cas particulier des territoires littoraux.Cybergeo Eur. J. Geogr. doi: 10.4000/cybergeo.32249. [Epub ahead of print]. Crossref Full Text|Google Scholar Décamps, A., and Gaschet, F. (2013). La contribution des effets de voisinage à la formation des prix du logement. Une évaluation sur l'agglomération bordelaise.Rev. Écon.64, 883–910. doi: 10.3917/reco.645.0883 PubMed Abstract|Crossref Full Text|Google Scholar Dubé, J., Des Rosiers, F., and Thériault, M. (2011). Segmentation spatiale et choix de la forme fonctionnelle en modélisation hédonique.Revue d'Economie Reg. Urbaine. 1, 9–37. doi: 10.3917/reru.111.0009 PubMed Abstract|Crossref Full Text|Google Scholar Duijndam, S. J., Botzen, W. W., Endendijk, T., de Moel, H., Slager, K., and Aerts, J. C. (2023). A look into our future under climate change? Adaptation and migration intentions following extreme flooding in the Netherlands.Int. J. Disast. Risk Reduct.95, 103840. doi: 10.1016/j.ijdrr.2023.103840 Crossref Full Text|Google Scholar Freeman, A. M. III (1979). Hedonic prices, property values and measuring environmental benefits: a survey of the issues.Scand. J. Econ.81, 154–173. doi: 10.2307/3439957 Crossref Full Text|Google Scholar Girard, M. (2017).Organisation spatiale et densités urbaines: une application à l'agglomération du Grand Dijon. Working paper. Google Scholar Halleck Vega, S., and Elhorst, J. P. (2015). The SLX model.J. Reg. Sci.55, 339–363. doi: 10.1111/jors.12188 Crossref Full Text|Google Scholar Hennighausen, H., and Suter, J. F. (2020). Flood risk perception in the housing market and the impact of a major flood event.Land Econ.96, 366–383. doi: 10.3368/le.96.3.366 Crossref Full Text|Google Scholar Holway, J. M., and Burby, R. J. (1990). The effects of floodplain development controls on residential land values.Land Econ.66, 259–271. doi: 10.2307/3146728 Crossref Full Text|Google Scholar Hudson, P., Botzen, W. W., Czajkowski, J., and Kreibich, H. (2017). Moral hazard in natural disaster insurance markets: empirical evidence from Germany and the United States.Land Econ. 93, 179–208. doi: 10.3368/le.93.2.179 Crossref Full Text|Google Scholar Hudson, P., and Thieken, A. H. (2022). The presence of moral hazard regarding flood insurance and German private businesses.Nat. Hazards112, 1295–1319. doi: 10.1007/s11069-022-05227-9 Crossref Full Text|Google Scholar IPCC (2022).Climate Change 2022: Impacts, Adaptation and Vulnerability. Geneva: IPCC. Google Scholar Kelly, M., and Kleffner, A. E. (2003). Optimal loss mitigation and contract design.J. Risk Insur.70, 53–72. doi: 10.1111/1539-6975.00047 PubMed Abstract|Crossref Full Text|Google Scholar Kim, C. W., Phipps, T. T., and Anselin, L. (2003). Measuring the benefits of air quality improvement: a spatial hedonic approach.J. Environ. Econ. Manag.45, 24–39. doi: 10.1016/S0095-0696(02)00013-X Crossref Full Text|Google Scholar Kousky, C. (2010). Learning from extreme events: risk perceptions after the flood.Land Econ.86, 395–422. doi: 10.3368/le.86.3.395 Crossref Full Text|Google Scholar Kousky, C., Michel-Kerjan, E. O., and Raschky, P. A. (2018). Does federal disaster assistance crowd out flood insurance?J. Environ. Econ. Manag.87, 150–164. doi: 10.1016/j.jeem.2017.05.010 Crossref Full Text|Google Scholar Lancaster, K. J. (1966). A new approach to consumer theory.J. Polit. Econ.74, 132–157. doi: 10.1086/259131 Crossref Full Text|Google Scholar Maslianskaïa-Pautrel, M., and Baumont, C. (2016). Environmental spillovers and their impacts on housing prices: a spatial hedonic analysis.Revue d'économie Polit.126, 921–945. doi: 10.3917/redp.265.0921 PubMed Abstract|Crossref Full Text|Google Scholar Mauroux, A. (2015). Exposition aux risques naturels et marchés immobiliers.Revue d'économie Finan. 117, 91–103. doi: 10.3917/ecofi.117.0091 PubMed Abstract|Crossref Full Text|Google Scholar Næss, L. O., Bang, G., Eriksen, S., and Vevatne, J. (2005). Institutional adaptation to climate change: flood responses at the municipal level in Norway.Global Environ. Change15, 125–138. doi: 10.1016/j.gloenvcha.2004.10.003 Crossref Full Text|Google Scholar Poussin, J. K., Botzen, W. W., and Aerts, J. C. (2013). Stimulating flood damage mitigation through insurance: an assessment of the French CatNat system.Environ. Hazards12, 258–277. doi: 10.1080/17477891.2013.832650 Crossref Full Text|Google Scholar Raschky, P. A., Schwarze, R., Schwindt, M., and Zahn, F. (2013). Uncertainty of governmental relief and the crowding out of flood insurance.Environ. Resour. Econ.54, 179–200. doi: 10.1007/s10640-012-9586-y Crossref Full Text|Google Scholar Richert, C., Erdlenbruch, K., and Grelot, F. (2019). The impact of flood management policies on individual adaptation actions: insights from a French case study.Ecol. Econ. 165:106387. doi: 10.1016/j.ecolecon.2019.106387 Crossref Full Text|Google Scholar Rosen, S. (1974). Hedonic prices and implicit markets: product differentiation in perfect competition.J. Polit. Econ.82, 34–55. doi: 10.1086/260169 Crossref Full Text|Google Scholar Siegrist, M., and Gutscher, H. (2008). Natural hazards and motivation for mitigation behavior: people cannot predict the affect evoked by a severe flood.Risk Anal.28, 771–778. doi: 10.1111/j.1539-6924.2008.01049.x PubMed Abstract|Crossref Full Text|Google Scholar Slavikova, L. (2018). Effects of government flood expenditures: the problem of crowding-out.J. Flood Risk Manag.11, 95–104. doi: 10.1111/jfr3.12265 Crossref Full Text|Google Scholar Surminski, S., Aerts, J. C., Botzen, W. J., Hudson, P., Mysiak, J., and Pérez-Blanco, C. D. (2015). Reflections on the current debate on how to link flood insurance and disaster risk reduction in the European Union.Nat. Hazards79, 1451–1479. doi: 10.1007/s11069-015-1832-5 Crossref Full Text|Google Scholar Tobin, G. A., and Montz, B. E. (1989). Catastrophic flooding and the response of the real estate market.Soc. Sci. J.25, 167–177. doi: 10.1016/0362-3319(88)90004-3 PubMed Abstract|Crossref Full Text|Google Scholar Tobin, G. A., and Montz, B. E. (1990). Response of the real estate market to frequent flooding: the case of Des Plaines, Illinois.Bull. Illinois Geograp. Soc.33, 11. Google Scholar Tobin, G. A., and Newton, T. G. (1986). A theoretical framework of flood induced changes in urban land values.J. Am. Water Resour. Assoc.22, 67–71. doi: 10.1111/j.1752-1688.1986.tb01861.x Crossref Full Text|Google Scholar Travers, M., Bonnet, E., Chevé, M., and Appéré, G. (2009). Risques industriels et zone naturelle estuarienne: une analyse hédoniste spatiale.Econ. Prévis. 190–191, 135–158. doi: 10.3917/ecop.190.0135 PubMed Abstract|Crossref Full Text|Google Scholar United Nations (2019).World Urbanization Prospects: The 2018. Revision. 126. New York, NY: United Nations—Department of Economic and Social Affairs—Population Division. PubMed Abstract|Google Scholar Wachinger, G., Renn, O., Begg, C., and Kuhlicke, C. (2013). The risk perception paradox—implications for governance and communication of natural hazards.Risk Anal.33, 1049–1065. doi: 10.1111/j.1539-6924.2012.01942.x PubMed Abstract|Crossref Full Text|Google Scholar Keywords:real-estate prices, flood risk, crowding out effect, residential choices, flood management Citation:Dachary-Bernard J (2025) Flood risk management and real-estate prices: between prevention and “crowding out” effect.Front. Environ. Econ.4:1603746. doi: 10.3389/frevc.2025.1603746 Received:31 March 2025;Accepted:30 April 2025;Published:23 May 2025. Edited by: Reviewed by: Copyright© 2025 Dachary-Bernard. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Jeanne Dachary-Bernard,amVhbm5lLmRhY2hhcnktYmVybmFyZEBpbnJhZS5mcg== Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Materials and methods 3 Estimation results 4 Discussion/Conclusion Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note Footnotes References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}