{"id": 868, "name": "Manchester Evening News", "domain": "manchestereveningnews.co.uk", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/14m-refurbishment-planned-stockport-crematorium-31829590#comments-wrapper", "title": "14m Refurbishment Planned Stockport Crematorium 31829590#comments Wrapper", "content": "**** **** News In Your Area Man Utd Man City More Manchester Evening News Icon News Greater Manchester News Stockport **The £14m refurbishment planned at Stockport Crematorium and Cemetery** **It includes a package of repairs** A major refurbishment is planned at Stockport Crematorium and Cemetery, which could cost around £14m. An extensive package of repairs and modernisation has been proposed for the site, including asbestos removal, replacing doors and windows, a new car park to the east, and an extension to the existing crematorium building. This work will focus on the buildings and cremators, rather than the wider grounds. In March 2023, the council was advised that three cremators at the facility were nearing the ‘end of their useful operating capacity’ and needed replacing in the short term. Interim repairs were carried out with two of these in 2024 to extend their lifespan, then in March this year it was decided that the third cremator, after ‘extensive’ use, required repairs too. A report on the works stated: 'The recommended option is estimated to cost c£14m, funded by directly funded borrowing, however, there will be an unsupported borrowing requirement for the first eleven years which is not yet built into the Medium Term Financial Plan.' Bosses hope the refurbishment will bring down overall maintenance costs at the location in the long run. The plan is to split the works over a three to four year period so the site can stay fully open while the refurbishment takes place. The facility on Buxton Road is currently closed for new burials, but is still used for cremations with services in Cypress and Rowan chapels. The Cypress Chapel is a locally listed building, and there is also the non-operational North Chapel located on the north west of the cemetery site. Coun Grace Baynham, the town hall’s lead on parks, highways and transport, said the service was previously contracted out but a “full review” of the estate was carried out when it was brought back in-house in early 2024. “As a result we’ve come up with a piece of work which involves future-proofing the estate around the crematorium and also the cemeteries,” she added. Coun Jon Byrne said it \"absolutely makes sense to do this\", but said the car parking situation “does cause a bit of a problem” and that the cemetery area in general is looking “very tired”. The crematorium first opened in 1936 to serve Heaviley, Offerton, Davenport, Adswood, Great Moor and the rest ofStockport. Stockport councilsaid it carries out 200 burials a year as well as around 3,000 cremations at the Stockport Crematorium on Buxton Road. Facebook X (Twitter) Instagram News Local News What's on In Your Area Sport Man Utd Man City Business **Follow Manchester Evening News on socials:** InYourArea mynewsassistant Beauty Box Subscription Yimbly Shop Marketplace Public Notices Buy a photo Contact Us About Us Work for us Advertise with us Mirror Bingo How to Complain Corrections & Clarifications Terms & Conditions Privacy Notice AI Notice Cookie Notice Our RSS Feeds Newsletters Signup Syndication & Licensing Notifications and alerts help **© 2025 M.E.N Media** AtReach and across our entitieswe and our partners use information collected through cookies and other identifiers from your device to improve experience on our site, analyse how it is used and to show personalised advertising. You can opt out of the sale or sharing of your data, at any time clicking the \"Do Not Sell or Share my Data\" button at the bottom of the webpage. Please note that your preferences are browser specific. Use of our website and any of our services represents your acceptance of the use of cookies and consent to the practices described in ourPrivacy NoticeandCookie Notice."}