{"id": 2086, "name": "OutKick", "domain": "outkick.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.outkick.com/culture/paulina-gretzky-brings-her-lacy-lingerie-oakmont-riley-answers-katie-nolans-dumb-question-wacky-costas", "title": "Paulina Gretzky Brings Her Lacy Lingerie Oakmont Riley Answers Katie Nolans Dumb Question Wacky Costas", "content": "Sports Betting Culture Analysis Watch Shows Shop Newsletters Search Home Culture Paulina Gretzky Brings Her … **Paulina Gretzky Brings Her Lacy Lingerie To Oakmont, Riley Answers Katie Nolan's Dumb Question & Wacky Costas!** **If Paulina Gretzky in white lingerie can't fire up Dustin Johnson, nothing can.** If Paulina Gretzky in white lingerie can't fire up Dustin Johnson, nothing can. If Paulina Gretzky in white lingerie can't fire up Dustin Johnson, nothing can. Facebook Twitter Email Copy Link Hump Day! This is our time to shine, boys and girls. And what a WEEK it's been for OutKick. We've got Simone Biles on the ropes, the lefties are angry at me, and the US Open starts in less than 24 hours. We're not here to break up the momentum. Not us. Not this class. Not today. We're gonna ride this wave until the ocean goes dry. Sure, it's 100 degrees out, my kids got me sick, and Jerome Powell refuses to lower the damn rate, but whatever. We push forward. It's why we win awards around here. Welcome to a Hump DayNightcaps– the one where check in with Paulina Gretzky, who last night unloaded anabsolute HEATERto get us ready for Oakmont. What else? I've got Bob Costas back to spewing BS despite promising us last fall he was gonna finally shut up. The lefties attacked me because I called Simone Biles a quitter, and Brittany Aldean gets tipsy at a beach bar. And, if y'all are good, maybe we'll end the day by asking Riley how she sleeps at night. Katie Nolan poked her head up for the first time in five yearsand asked her first,so we might as well let Riley respond. It's only fair! Grab you something tall, strong, and overflowing with enough alcohol to kill a horse (responsibly, of course), and settle in for a Hump Day 'Cap! **Bobby's BACK!** Didn't think I'd be starting my day with insufferable Bob Costas, but here we are. Oh well. You can't fix stupid! So, that above clip is from last fall, and it was one of the last times we heard from Bob. He retired shortly after, which delighted baseball fans far and wide because we've had to suffer through Bob's constant yapping for years now. YEARS. We'd be in some crucial moment in the ninth inning of a postseason game, and Costas would be talking about a Kevin Bacon movie. Seriously. That actually happened. Anyway, sometime around 2016 (wonder what happened then?!), Bob came down with a nasty case of TDS. Oddly enough, he also became the moral compass of America at the same time. Bob knows best! That's been his motto for years now, especially when it comes to Trump. And now – despite promising to leave us all the hell alone last year – he's BACK tospewing just the biggest pile of BS you've ever heard: **The lefties are MAD at me today!** When I say these people – and by 'these people,' I mean unhinged lefties – have their heads so far in the sand, they can't possibly breathe … this is what I mean. Right here. They truly believe they are right on everything, and thatwe'rethe weird ones. Bob just compared MAGA to flat-earthers. That's essentially what he said. Bob Costas really believes that. He thinks he's the moral authority on everything in this country. He thinks the propaganda machine that is the MSM is right, while themean orange manin Washington is wrong. Remember, this is the same Trump that just won a $15 million defamation lawsuit against ABC! You don't realize how out of touch some of these lunatics really are until you see stuff like that in writing. And then it really hits you … \"My God. I really am surrounded by the dumbest people in the history of time.\" Speaking of … let's check in with #TheMOB after I was ‘sUpeR mEaN tO SiMoNe!’ **What a takedown!** Amazing. That's me! I'm the OutKick reporter! I made it. Now, to be fair, I didn't really make it. This ain't exactly CNN calling me out, although, to be fair, the readership numbers are probably pretty close. That being said, let's get to some of the real gems from this Pulitzer winner: But one of Gaines’ buddies at OutKick, Zach Dean, crossed a line.He mocked Bilesfor pulling out of several events at the 2020 Olympics in Tokyo – even though it’s been well-documented that she did so for her own safety. And in so doing, to use the most diplomatic terms I can use, Dean proved he’s an asshole of the highest order. It was painfully obvious where Dean was going with the headline of his piece: \"Danica Patrick Tells Quitter Simone Biles To Go Where She Belongs.\" Side note: I assume he's implying that I'm being racist here? I'm not sure. Danica said all of these lunatics need to go to therapy. That's where I'mimplyingshe needs to go. Therapy. She literally says it. I do always appreciate #TheMOB pulling out the race card, though. A crowd-pleaser for sure. Had Biles pressed through as Dean apparently would have wanted her to do, she could have been seriously injured, even paralyzed. Has Dean considered even for one minute that someone could have been reading that piece who is going through issues similar to what Biles faced? Do you want it on your conscience that you may have kept someone from getting help, Zach? Wow! What a takedown! Inject it straight into my veins, baby. Love the energy here. Yes, I'm sure all of our OutKick readers who read that earlier this week are now in serious distress. Some have probably been weeping uncontrollably in their pillows for days now. I'm the one hurting people, not the gaslighter who said boys should be in women's sports. Okeedokee! These people are just the best. God, I love them. Speaking of … **Oakmont, Paulina & the countdown is ON!** I love when the left uses that as some kind of ‘GOTCHA’ moment. \"How do you sleep at night?!\" Huh? I don't know, Katie, pretty damn well. We won. Again. OutKick won again, because we don't put up with the nonsense. Simone's PR team cobbled up some BS statement because of all the blowback on a 95-5 issue, and backed off. I'd imagine Riley slept just fine last night. PS: Katie's a Red Sox fan, so this one hurts. PPS: Remember this CRACK broadcast team over on Apple TV? Weird that it didn't work out. It was so solid. Modern day Buck and McCarver! OK, let's quickly rapid-fire this into a big Hump Day night. First up? The fairways and greens at Oakmont this week seem reasonable: Remember, the US Open is the best golf tournament of the year. Augusta has the prestige, but this weekend is always –always –the best four-day stretch of the season. Now, I don't expect Dustin Johnson to do much, given he's STUNK since joining LIV, but … if he's EVER going to win another major, feel like it's now or never: Yeah, I mean, how do you not go out and at least give yourself a shot on the weekend afterthat?Paulina Gretzky is doing all she can, DJ. Time for you to produce! You simply can't go out and miss cuts when your wife is posting heaters like that. Can't do it. (You really can, though, because clearly you're gonna be just fine at home with the extra time off. Hell, that's probably as good an excuse as any.) Finally … we haven't done a solid countdown here in a while, so let's get a quick pulse-check as we enter the meat of summer: **Take us home, Brittany Aldean!** 73 days till Week 0 of the college football season 80 days till the first Saturday 85 days till the TNF opener 88 days till our first NFL Sunday I mean, who has it better than us? Nobody! Take us home, Brittany. OutKick Nightcaps is a daily column set to run Monday through Friday at 4 p.m. (roughly, we’re not robots). You angry at me over my Simone Biles story? Email me at Zach.Dean@OutKick.com. bkt Nightcaps **Get the Daily OutKick and get smarter every day.** Thanks for signing up! You are agreeing to OutKick'sTerms of UseandPrivacy Policy, but don't worry we don't spam. Sports Betting Culture Analysis Watch Shows Newsletters Shop Updated Terms of Use Updated Privacy Policy Your Privacy Choices Help About Us Press Sitemap DISCLAIMER: This site is 100% for entertainment purposes only and does not involve real money betting. Gambling related content is not intended for anyone under the age of 21. If you or someone you know has a gambling problem and wants help, call1-800-GAMBLER."}