{"id": 1552, "name": "WBEZ - NPR - Chicago", "domain": "wbez.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wbez.org/public-safety/2025/06/06/violence-intervention-frederick-seaton-street-outreach-institute-nonviolence-chicago-cure-violence", "title": "Violence Intervention Frederick Seaton Street Outreach Institute Nonviolence Chicago Cure Violence", "content": "MenuNewsLatest NewsReset with Sasha-Ann SimonsCurious CityArts & CultureCriminal JusticeEducationImmigrationPoliticsRace, Class & CommunitiesVocaloListenFull Radio ScheduleShows & PodcastsLiveWBEZ 91.5LiveVocalo 91.1MoreAboutEventsMobile AppsNewsletters & Email AlertsSearchSupport UsManage Your Membership Menu **News** Latest News Reset with Sasha-Ann Simons Curious City Arts & Culture Criminal Justice Education Immigration Politics Race, Class & Communities Vocalo **Listen** Full Radio Schedule Shows & Podcasts LiveWBEZ 91.5 WBEZ 91.5 LiveVocalo 91.1 Vocalo 91.1 **More** About Events Mobile Apps Newsletters & Email Alerts Search Support Us Manage Your Membership Menu **News** Latest News Reset with Sasha-Ann Simons Curious City Arts & Culture Criminal Justice Education Immigration Politics Race, Class & Communities Vocalo **Listen** Full Radio Schedule Shows & Podcasts LiveWBEZ 91.5 WBEZ 91.5 WBEZ 91.5 LiveVocalo 91.1 Vocalo 91.1 Vocalo 91.1 **More** About Events Mobile Apps Newsletters & Email Alerts Search Support Us Manage Your Membership MenuNewsLatest NewsReset with Sasha-Ann SimonsCurious CityArts & CultureCriminal JusticeEducationImmigrationPoliticsRace, Class & CommunitiesVocaloListenFull Radio ScheduleShows & PodcastsLiveWBEZ 91.5LiveVocalo 91.1MoreAboutEventsMobile AppsNewsletters & Email AlertsSearchSupport UsManage Your Membership Menu **News** Latest News Reset with Sasha-Ann Simons Curious City Arts & Culture Criminal Justice Education Immigration Politics Race, Class & Communities Vocalo **Listen** Full Radio Schedule Shows & Podcasts LiveWBEZ 91.5 WBEZ 91.5 LiveVocalo 91.1 Vocalo 91.1 **More** About Events Mobile Apps Newsletters & Email Alerts Search Support Us Manage Your Membership Menu **News** Latest News Reset with Sasha-Ann Simons Curious City Arts & Culture Criminal Justice Education Immigration Politics Race, Class & Communities Vocalo **Listen** Full Radio Schedule Shows & Podcasts LiveWBEZ 91.5 WBEZ 91.5 WBEZ 91.5 LiveVocalo 91.1 Vocalo 91.1 Vocalo 91.1 **More** About Events Mobile Apps Newsletters & Email Alerts Search Support Us Manage Your Membership Listen Live Listen Live Listen Live Donate Frederick Seaton works with the Institute for Nonviolence Chicago, supervising nine street-outreach workers in West Garfield Park, the neighborhood where they all grew up. Manuel Martinez/WBEZ **Why is Chicago violence plummeting? Some credit street outreach workers.** **A reporter rides along to get an up-close look at the violence intervention work that aims to prevent retaliation in the aftermath of shootings.** SHARE COPY LINK Share Email Facebook Twitter Print Mid-morning is usually a quiet time in Frederick Seaton’s profession. I’m across the table at the Institute for Nonviolence Chicago’s main office on the West Side, ready to record an interview. But his phone keeps lighting up. “What’s going on?” Seaton answers a call from one of the nine street outreach workers he supervises in West Garfield Park, the neighborhood where they all grew up. Seaton hears there was a shooting minutes ago near West Madison Street, the neighborhood’s main drag. The outreach worker on the phone, who’s already there, tells Seaton there are two victims, a man and a woman. Seaton’s team is looking into what sparked the attack and gathering information about the victims’ relatives. Their goal is to track down anyone prone to retribution, he says. “Everybody has got a crazy cousin,” Seaton says. “Everybody has got a family member that’s hotheaded.” A half hour later, Seaton receives a notification about the shooting from the police. One of the victims has died: the man, 33, who sustained gunshot wounds to the chest. Seaton offers to continue our interview. But he also wants to stop by where the shooting took place and then strategize with his staff on their response. He invites me to ride along and get a closer look at street outreach, a publicly funded approach known as community violence intervention, or CVI. “We’ve been working at this for years,” Seaton, 66, says, talking about his team’s credibility with people living in West Garfield Park and about the neighborhood’s plummeting shooting numbers. “We’ve been chipping at it and chipping at it,” he says. “Now, we’re seeing some of the results.” **The racial safety gap in Chicago** Chicago’s violence surged in 2016, as police community relations tanked in the months following the court-ordered release of video showing teenager Laquan McDonald’s killing on the Southwest Side by a cop who repeatedly shot him. The numbers of shootings and killings soared again in 2020 — the year of COVID-19’s arrival and George Floyd’s killing by a Minneapolis police officer. Since 2021, the violence numbers have been dropping. By Wednesday, Chicago had recorded 157 murders this year — the fewest of any year to that date since 2014. At the same time, the “safety gap” — the difference in murder counts by race — has narrowed. Since 2021, the numbers of white victims hardly has budged. That’s while the number of Black victims has plunged. Through Tuesday, there have been 50% fewer this year than during the same period of 2021. Still, the safety gap remains staggering. This year, Black Chicagoans have been 19 times more likely than white Chicagoans to be the victim of a homicide. The community areas where violence numbers have fallen fastest includeWest Garfield Park. Through Tuesday, the area has had three homicides and 24 nonfatal shootings this year. Those numbers are significantly down from the same span of 2021, when there were 15 homicides and 56 nonfatal shootings. There is no shortage of agencies and people — from police to youth mentors — who have been credited with having a hand in Chicago’s public safety improvement, which also mirrors national trends. Some experts point to CVI, a field Seaton entered 18 years ago. Like many doing similar work in Chicago, Seaton spent years in prison and then, after his release, learned violence intervention skills at Ceasefire, a nonprofit now known as Cure Violence, where he started in 2005. Since 2016, Seaton has worked for the Institute for Nonviolence Chicago, an agency focused on several West Side and South Side neighborhoods. **Building trust — with cops and communities** Seaton takes me to his car, a 9-year-old gray sedan, and we hustle to the shooting scene. “I have a team on location, and I have a team at the hospital,” he says. Seaton says they’re all trying to find out whether the shooting stemmed from domestic violence, some other sort of interpersonal conflict or a dispute among drug dealers or gangs. Not the big gangs that held sway on the West Side when Seaton was young. Today’s gangs are much smaller. They’re known as cliques. Seaton says West Garfield Park alone has 24 cliques. A half block from the shooting scene, Seaton spots one of his staffers. It’s not hard. They all wear neon-yellow T-shirts. “I’ll see you at the office,” Seaton tells him. Then, Seaton gets a text from the police district commander. “Good morning,” Seaton reads me the message. “Reaching out to get you any assistance that we can help.” Many street outreach groups maintain relations with the local police district. They might rely on the police for security at large gatherings such as funerals. And sometimes the cops will flag a particular conflict and ask the institute to intervene. But Seaton says the commander knows that his outreach team won’t help the police solve crimes or make arrests. “The professional understanding is we don’t share information,” Seaton says. That’s key, he says. Because, if they told the police what they know about any shooting, they could lose the community’s trust. “We don’t work for them,” Seaton says. “Our job is to do what we do because we can get into some crannies and some holes that [the police] can’t get in, and we can try to stop the shooting before the young men have to deal with law enforcement.” Still, the commander’s text conveys respect for Seaton and the institute. “This has been a long time coming,” Seaton says, recalling decades of mistrust between Chicago cops and street outreach organizations. **Working to prevent retaliation, to stop more violence** After rolling past the shooting scene, Seaton heads to the hospital, where vital work takes place to prevent retaliation. Two of his staffers are already there. Their job includes listening and validating feelings. “When someone is experiencing trauma, they need some comfort,” Seaton says. “We want to show love to the families.” At the hospital, there’s also crucial information to gather. “There might be somebody that’s related, that’s a friend that you might have a relationship with, that can help you in determining your course of action,” Seaton says. At the emergency entrance, dozens of friends and relatives of the 33-year-old man who was killed have gathered. “This is a hostile situation,” Seaton says, “the level of tension right now, trying to figure it out or point the finger.” He checks in with his staff members. He finds out the man’s loved ones still don’t know he is deceased. When the word finally comes, they start crying. They wail. A man with a beard runs from the crowd to a car and climbs behind the wheel. Two women follow. “The family’s trying to stop him from going to retaliate against anybody,” Seaton says. The women get the man out of the car. All three embrace. They wail together. But the man can’t hold himself up. He collapses to the pavement. Fred Seaton with two fellow street outreach workers on the West Side. Manuel Martinez / WBEZ **Relief, but still a need ‘to stop this incident from escalating’** “The most important part about any crime scene or any shooting is buying time,” Seaton says. “We get some love in there, and they get time to think.” He gets a call from a staffer back near the crime scene. “What’s that?” Seaton asks. “All right, I’ll slide on you in a minute.” He hangs up and mulls what he’s been told. “Interpersonal,” Seaton concludes. He means the shooting motive wasn’t mainly a matter of gang rivalries. “That’s a big relief,” Seaton says, “because, when cliques are involved, it’s a longer mediation.” The perpetrators of a shooting stemming from an interpersonal conflict tend to be known by the victim’s loved ones and are often arrested, he says. That simplifies the response of the outreach workers. “The strategy now is to try to get the family members not to react,” Seaton says. That starts with the bearded man who tried to drive off from the hospital. “We get to that young man, then to his closest friends,” Seaton says. “And we get to some of those young ladies” who got him out of the car “to stop this incident from escalating.” It’s the approach that Seaton’s team and other outreach workers from the institute have taken countless times. They can’t do much about the easy access to guns throughout the city. In West Garfield Park, though, they have resources to head off retaliation. “With relationship gathering and being credible messengers, we’re going to be able to work with the community to stop the next shooting,” Seaton says. Seaton heads from the hospital to his office. He and his staff need to get to work on a plan to do that. Chip Mitchellreports for WBEZ Chicago on policing, public safety and public health. Follow him atBlueskyandX. Contact him atcmitchell@wbez.org. SHARE COPY LINK Share Email Facebook Twitter Print **The Latest** AboutCareersStaffBoard of DirectorsManagement TeamPressroomPublic & Financial DocumentsFCC LicensesContest and Rules Careers Staff Board of Directors Management Team Pressroom Public & Financial Documents FCC Licenses Contest and Rules Careers Staff Board of Directors Management Team Pressroom Public & Financial Documents FCC Licenses Contest and Rules ConnectContact UsNewsletters & Email AlertsEvents CalendarWait Wait…Don’t Tell Me! TicketsMobile AppsRadio ScheduleThe Sounding Board Contact Us Newsletters & Email Alerts Events Calendar Wait Wait…Don’t Tell Me! Tickets Mobile Apps Radio Schedule The Sounding Board Contact Us Newsletters & Email Alerts Events Calendar Wait Wait…Don’t Tell Me! Tickets Mobile Apps Radio Schedule The Sounding Board SupportDonateJoin Our Giving CirclesDonate Your CarGifts of SecuritiesPlanned GivingMatching GiftsBecome a SponsorManage Your Membership Account Donate Join Our Giving Circles Donate Your Car Gifts of Securities Planned Giving Matching Gifts Become a Sponsor Manage Your Membership Account Donate Join Our Giving Circles Donate Your Car Gifts of Securities Planned Giving Matching Gifts Become a Sponsor Manage Your Membership Account © 2025 Chicago Public Media Inc. |Privacy Policy|Terms of Use|FCC Public Filing Info|Notice of FCC Applications"}