{"id": 893, "name": "Mendocino Beacon", "domain": "mendocinobeacon.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mendocinobeacon.com/2025/06/09/the-phoenician-scheme-review-wes-anderson-and-co-embark-on-an-elaborate-save-a-soul-mission/", "title": "The Phoenician Scheme Review Wes Anderson And Co Embark On An Elaborate Save A Soul Mission", "content": "e-Edition e-Edition NewsNewsLocal NewsCrime and Public SafetyCourtsMarijuanaBusinessBest ReviewsHealth News Local News Crime and Public Safety Courts Marijuana Business Best Reviews Health News Local News Crime and Public Safety Courts Marijuana Business Best Reviews Health SportsSportsSports SubmissionsHigh School SportsFishing the North Coast Sports Sports Submissions High School Sports Fishing the North Coast Sports Sports Submissions High School Sports Fishing the North Coast LifestyleLifestyleEntertainmentRestaurants Food and DrinkHome & GardenSpecial SectionsEvents Lifestyle Entertainment Restaurants Food and Drink Home & Garden Special Sections Events Lifestyle Entertainment Restaurants Food and Drink Home & Garden Special Sections Events ObituariesObituariesNews Obituaries Obituaries News Obituaries Obituaries News Obituaries Opinion AdvertisingAdvertise with UsPublic NoticesAdvertising Articles Advertise with Us Public Notices Advertising Articles Advertise with Us Public Notices Advertising Articles Subscribe Sign up for email newsletters to submit an obituary For information on submitting an obituary, please contact The Mendocino Beacon by phone at 707.964.5642, or email atclassads@advocate-news.comor fax at 707.964.0424. Obituaries must be completed by 10 a.m. on Monday. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Subscribe Sign up for email newsletters Subscribe e-Edition e-Edition News Sports Lifestyle Obituaries Opinion Special Sections Advertise e-Edition **‘The Phoenician Scheme’ review: Wes Anderson and Co. embark on an elaborate save-a-soul mission** **Benicio Del Toro is the star of Wes Anderson's 12th and latest outing. But the ringer is Michael Cera, reason enough to see this occasionally frustrating movie again.** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print A peculiar tension exists inside nearly every frame created by writer-director Wes Anderson. The geometric visual preoccupation of the framing; the actors, sometimes in motion but more frequently motionless; the manifestation of storytelling as a series of the prettiest shoebox dioramas in modern cinema: It’s more than a style or a look to Anderson. It’s his way of seeing the world through a lens of comic stoicism, right at the edge of art-installation territory. **Related Articles** Movie Review: ‘How to Train Your Dragon’ might have just redeemed the live-action adaptation ‘Life of Chuck’ review: It’s a wonderful, apocalyptic life in Stephen King land Movie review: Ana de Armas is better at killing than ballet in ‘Ballerina,’ a John Wick spinoff Top 10 summer movies: ‘Fantastic Four,’ meet ‘Jurassic Park 7’ and the new man from Krypton Column: How ‘Jaws’ changed our chumminess with swimming 50 years ago this summer The tension in those images comes from two places. The unfortunate place: When the comic banter or monologuing strains for laughs, or goes sideways, it sometimes dies an extra, tiny, momentary death because of the arch, extreme formality of the presentation. The more fortunate source of tension is where the actors live. In Anderson’s lavishly talented ensembles, the majority of the performers fulfill the basic requirements of being in a Wes Anderson movie, which can involve spitting out long reams of dialogue quickly, directly, without a lot of sauce. It also involves the task of portraying a human in a specific realm of unreality and in a kind of permanent repose, even in motion. But hitting the marks and holding the pose isn’t enough. There’s movement, of course, in every Anderson comedy, and in the best ones, the movement and the sight gags are funnier because of the stillness surrounding that movement. Whatever you want to call Anderson’s universe — I’ll go with Deadpandia — it’s not easy to activate as a performer. When the right actor wriggles free of the constraints and finds a rhythm, a heartbeat and a human spark, it’s magic. Benicio Del Toro is the star of “The Phoenician Scheme,” Anderson’s 12th and latest. But the ringer is Michael Cera, as Norwegian tutor Bjørn Lund, employed as an all-purpose factotum by the shady, swaggering, death-defying entrepreneur played by Del Toro. In one go, Cera joins the top tier of Anderson alums, which includesRalph Fiennes(“The Grand Budapest Hotel,” “The Wonderful Story of Henry Sugar”) and, from Anderson’s earlier, looser years,Gene Hackman and Anjelica Huston(“The Royal Tenenbaums”) and, of course, Bill Murray in everything (he has a brief cameo here, as God). Cera is terrifically subtle in everything he does, from pricelessly cheap dialect humor to sudden bursts of jealousy. He’s delightful, even if “The Phoenician Scheme” is only occasionally that. The movie’s largely about other characters. A frequent target of assassins, forever surviving plane crashes in between business deals, Anatole “Zsa-zsa” Korda (Del Toro) embarks on the riskiest development project of his life, indicated by Anderson’s title. It consists of a dam, tunnels, a canal and a general colonialist ravaging of a desert region (fictional, but with plenty of real-world Middle Eastern inspirations). Funding this beast means negotiating with several investors, among them a French nightclub owner (Mathieu Amalric), a pair of American industrialists (Tom Hanks, Bryan Cranston) and, above all, Korda’s estranged daughter, Liesl, a cynical novitiate and Korda’s intended heiress, played by Mia Threapleton. “The Phoenician Scheme” is a tale of what money can buy, and what money can’t. Stringing episodes together, screenwriter Anderson (working from a story co-created by Roman Coppola) treats Korda as a cocky survivor of fabulous riches. Through his adventures in fundraising, and realization that he won’t last forever, Korda learns from Liesl a little about what makes a legacy important. Meantime, he negotiates family matters with his 10 young sons and his scowling brother, Uncle Nubar (Benedict Cumberbatch), who may be Liesl’s father, and whose massive woodcut of a beard comes straight from Orson Welles’ billionaire in “Mr. Arkadin.” The overall vibe of fishy exoticism owes something to “Mr. Arkadin” as well. Anderson works here with a cinematographer new to him, the excellent Bruno Delbonnel, shooting on 35mm film. Anderson regulars Adam Stockhausen (production design, first-rate) and Milena Canonero (costume design, brilliant and vibrant as always) evoke a dreamlike 1950s setting in every soundstage-bound detail. And the story? Well, it has a little problem with over-elaboration. “The Phoenician Scheme” follows a relatively straightforward narrative line, ticking off chapters as Korda addresses each of his prized (and literal) shoeboxes of research and minutiae regarding the massively disruptive, slave labor-dependent construction project. It’s easier to parse what’s going on here compared to the hyperlinking and layering of “The French Dispatch” and “Asteroid City.” But the protagonist is a bit of a bore. And somehow, right now, on planet Earth in 2025, a movie about a craven oligarch on a spree hits a mixed chord, let’s say. It is, however, striking to see what happens in the epilogue of this up-and-down Anderson film, when Del Toro — who looks splendid but struggles to locate a lightness of touch the material could use — finally gets a few moments of on-screen relaxation in the epilogue. That’s by design: He is not the same person at the end of his story. But I wonder if Anderson erred in maintaining such a tight hold on Del Toro and Threapleton en route to the story destination. A beautiful mixed bag, let’s say, all told. But I’ll see “The Phoenician Scheme” a second time sometime for Cera, who will surely return to the Anderson fold. “The Phoenician Scheme” — 2.5 stars (out of 4) MPA rating: PG-13 (for violent content, bloody images, some sexual material, nude images, and smoking throughout) Running time: 1:45 How to watch: Premieres in theaters June 6 Michael Phillips is a Tribune critic. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Sister Jane Kelly dies at age 95Sister Jane Kelly dies at age 95 **Sister Jane Kelly dies at age 95** **Sister Jane Kelly dies at age 95** Study finds little agreement between Republicans and Democrats on media sources they trustStudy finds little agreement between Republicans and Democrats on media sources they trust **Study finds little agreement between Republicans and Democrats on media sources they trust** **Study finds little agreement between Republicans and Democrats on media sources they trust** Louisiana lawmakers pass bill targeting out-of-state doctors who prescribe and mail abortion pillsLouisiana lawmakers pass bill targeting out-of-state doctors who prescribe and mail abortion pills **Louisiana lawmakers pass bill targeting out-of-state doctors who prescribe and mail abortion pills** **Louisiana lawmakers pass bill targeting out-of-state doctors who prescribe and mail abortion pills** Federal immigration raid at Omaha food production plant sparks protestsFederal immigration raid at Omaha food production plant sparks protests **Federal immigration raid at Omaha food production plant sparks protests** **Federal immigration raid at Omaha food production plant sparks protests** Urchin barrens: what is to be done?Urchin barrens: what is to be done? **Urchin barrens: what is to be done?** **Urchin barrens: what is to be done?** MCSO: Suspect dies during incident on Hearst Willits RoadMCSO: Suspect dies during incident on Hearst Willits Road **MCSO: Suspect dies during incident on Hearst Willits Road** **MCSO: Suspect dies during incident on Hearst Willits Road** ‘The Better Sister’ review: Estranged sisters reunite after a husband is murdered. Cue the intrigue‘The Better Sister’ review: Estranged sisters reunite after a husband is murdered. Cue the intrigue **‘The Better Sister’ review: Estranged sisters reunite after a husband is murdered. Cue the intrigue** **‘The Better Sister’ review: Estranged sisters reunite after a husband is murdered. Cue the intrigue** Sacred Rock, a good neighborSacred Rock, a good neighbor **Sacred Rock, a good neighbor** **Sacred Rock, a good neighbor** **More in Movies** Movie Review: ‘How to Train Your Dragon’ might have just redeemed the live-action adaptation **Movie Review: ‘How to Train Your Dragon’ might have just redeemed the live-action adaptation** **Movie Review: ‘How to Train Your Dragon’ might have just redeemed the live-action adaptation** ‘Life of Chuck’ review: It’s a wonderful, apocalyptic life in Stephen King land **‘Life of Chuck’ review: It’s a wonderful, apocalyptic life in Stephen King land** **‘Life of Chuck’ review: It’s a wonderful, apocalyptic life in Stephen King land** Movie review: Ana de Armas is better at killing than ballet in ‘Ballerina,’ a John Wick spinoff **Movie review: Ana de Armas is better at killing than ballet in ‘Ballerina,’ a John Wick spinoff** **Movie review: Ana de Armas is better at killing than ballet in ‘Ballerina,’ a John Wick spinoff** Top 10 summer movies: ‘Fantastic Four,’ meet ‘Jurassic Park 7’ and the new man from Krypton **Top 10 summer movies: ‘Fantastic Four,’ meet ‘Jurassic Park 7’ and the new man from Krypton** **Top 10 summer movies: ‘Fantastic Four,’ meet ‘Jurassic Park 7’ and the new man from Krypton** 2025 June 9 Subscribee-EditionSign Up For Newsletters e-Edition Sign Up For Newsletters e-Edition Sign Up For Newsletters HomeNewsSportsOpinionThings to Do News Sports Opinion Things to Do News Sports Opinion Things to Do Contact UsWork With UsClassifiedsPublic NoticesPrivacy PolicyAccessibilitySitemap Work With Us Classifieds Public Notices Privacy Policy Accessibility Sitemap Work With Us Classifieds Public Notices Privacy Policy Accessibility Sitemap Advertise With UsMediaNews Group AdvertisingToday’s AdsLocal GuideJobsRentals MediaNews Group Advertising Today’s Ads Local Guide Jobs Rentals MediaNews Group Advertising Today’s Ads Local Guide Jobs Rentals Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}