{"id": 2154, "name": "Think Progress", "domain": "thinkprogress.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://archive.thinkprogress.org/exposed-for-1967-blackface-skit-alabama-governor-issues-written-statement-rather-than-face-cameras-d35fe818c65b/", "title": "Exposed For 1967 Blackface Skit Alabama Governor Issues Written Statement Rather Than Face Cameras D35fe818c65b", "content": "Contact Us Facebook Twitter Youtube Instagram Latest Stories Facebook Twitter Youtube Instagram **Topics Menu** Video ClimateProgress Politics Immigration World Health Care **More Menu** Contact Us **Exposed for 1967 blackface skit, Alabama governor issues written statement rather than face cameras** **\"She had put some black paint on her face.\"** Facebook Twitter Email SMS WhatsApp Share Alabama Gov. Kay Ivey (R) performed a comedic skit in blackface in 1967 at Auburn University, audio tapes circling the web on Thursday reveal. “She had on a pair of blue coveralls and she had put some black paint all over her face,” Ben LaRavia, then Ivey’s fiancé,says in the interview. “We were acting out this skit called Cigar Butts. I cannot go into a lengthy explanation but to say the least I think this skit, it did not require a lot of talent as far as verbal talent.” The performance he describes in the interview appears consistent with the ugliest core patterns of minstrel show tradition: A white audience invited to hoot with laughter at a portrayal of black people as groveling, graceless, inferior beings. Ivey’s blackface role involved “crawling around on the floor looking for cigar butts” and “certainly got a big reaction out of the audience,” her then-fiancé said in the interview. LaRavia chuckles as he recalls the evening. Ivey responds with a story about forgetting her lines later on in the evening’s performance, chuckling as well but not saying anything further about her blackface role. The date of the pageant in question is particularly significant. The 1967 school year would have been the first time in a while that Auburn kids didn’t have to wonder if a black student might see or hear what they had to say. The first black person to matriculate at the school, Harold Franklin, had left Auburn in 1966. “I got tired of the crap,” he told AL.com in a 2013 interview, saying the faculty seemed to block his preferred routes of study at every turn. Franklin’s enrollment in January 1964 followed two separate court cases overturning the white establishment’s attempts to keep black people out of the school. **Ralph Northam’s neighbors shaped his views on race. Here’s what they want the governor to do next.** People like to think Virginia's Eastern Shore has a nobler racial past than its neighbors can claim. It's not quite so simple. **Ralph Northam’s neighbors shaped his views on race. Here’s what they want the governor to do next.** People like to think Virginia's Eastern Shore has a nobler racial past than its neighbors can claim. It's not quite so simple. The interview tape comes six months after Ivey narrowly avoided the kind of scandalous re-examination of her moral character that faced Virginia Gov. Ralph Northam (D) in the winter. Photographs showing members of Ivey’s sorority in blackface emerged in February, during a nationwide wave of such reveals sparked by Northam’s own offensive past behavior and stubborn response to the criticism it unleashed. Opinions about the Virginia governor deeply divided the state; the gap appeared more connected to generational than racial lines, as ThinkProgress reported based on a visit to Northam’s remote Eastern Shore home town. Reaction among Alabama politicians to Ivey’s blackface past echo those that came in Virginia after Northam’s pictures were revealed. And like her Democratic counterpart, Ivey does not appear interested in any discussion of whether or not she can be trusted to lead her state in the best interests of its black residents. One notable difference, however, is that Northam eventually appeared before reporters and cameras to talk about the whole affair. Ivey — perhaps aware that Northam nearly broke into a moonwalk in his fervor to reject the idea that blackface is a marker of racist personal prejudices — has opted for a written statement instead. It is a striking document, by turns conciliatory and minimizing of her responsibility. Throughout, she is adamant that she is no longer the sort of person who would shoe-polish her face to help college kids laugh at a perverse denigration of black people. “While some may attempt to excuse this as acceptable behavior for a college student during the mid-1960s, that is not who I am today, and it is not what my Administration represents all these years later,” she wrote. That portion of the statement engages a slippery rhetorical technique: Placing a defense of her character in the hypothetical voice of some imagined other, then moving swiftly on having neither agreed with nor condemned that argument in her own voice. State Rep. Mike Ball (R) was happier to take up the some-may-say invitation Ivey coded into her typed statement. “People do stupid things when they are young,” Ball told reporters Thursday. “One of the wonderful things about life is that we can learn and we can change over time.” The governor’s written statement went on to offer “heartfelt apologies” and a pledge to “do all I can — going forward — to help show the nation that the Alabama of today is a far cry from the Alabama of the 1960s.” Multiple state legislators condemned Ivey on Thursday. “This is who she was then. It is who she is now. I have nothing for her. I don’t accept her apology,” state Rep. Juandalynn Givan (D) said. Givan gave special attention to Ivey’s decision to release a written statement without facing cameras or supporters, while also succinctly capturing the kinds of questions the governor likely sought to avoid fielding under klieg lights. “She should have stood before the people of Alabama herself,” Givan said. “Just as she stood there in blackface, how many times has she said n*****? I’m going to say the word. That is the question black folk need to ask themselves today.” Contact Us Facebook Twitter Youtube Instagram"}