{"id": 840, "name": "The Lever", "domain": "levernews.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.levernews.com/profits-over-patients-the-corporatization-of-american-health-care-and-what-you-can-do-to-protect-yourself/", "title": "Profits Over Patients The Corporatization Of American Health Care And What You Can Do To Protect Yourself", "content": "All News Deep Reads Politics Business Health Tech Environment Labor Lever Daily Podcasts Books About Merch All News Deep Reads Politics Business Health Tech Environment Labor Lever Daily Podcasts Books About Merch **Profits Over Patients** The Corporatization of American Health Care And What You Can Do To Protect Yourself. Profits Over Patients: The Corporatization of American Health Care And What You Can Do To Protect Yourselfweaves together years of investigative reporting on America’s extraordinarily complicated health care system, identifying the private interests and craven politicians profiting off misery. The result is a sweeping account of America’s cruel, dysfunctional, and corrupt health care system — and a toolkit you can use to protect yourself and your loved ones from exploitation. InProfits Over Patients, theLeverteam breaks down the latest troubling developments in the state of American health care: How private insurers are taking over and scamming from Medicare, costing taxpayers as much as $140 billion a year. Why Democrats are letting states purge millions of low-income Americans from Medicaid, often for arbitrary reasons like missing a piece of mail. How hospitals are padding executive pay and investing in Wall Street while their nurses strike over short staffing and meager pay. How pharmaceutical giants have gotten away with charging Americans the highest drug prices of any wealthy country — even though the U.S. public subsidizes all their drugs. And how you can protect yourself from corporate health care’s worst practices — and fight for reform. FullLever Readers,likeProfits Over Patients,are only available to our paid supporting subscribers. They can read them on the e-reader of their choice, or download them and read them at their convenience. Click hereto learn about our supporting subscriber options, if you are not one already. **This full story is for paid subscribers.** Sign up for a paid subscription toThe Levernow to gain access to this story and more. Already have an account?Sign in **The Latest FromThe Lever** **Waymo On The Way Out** **Everything You Think About The Deficit Is Wrong** **Trump Just Quietly Teed Up $20 Billion In Starlink Contracts** **For Wall Street, Gentrification Is Tax Deferred** About us Account FAQ Podcasts Contact us Jobs Pitch Us Got A News Tip? Bluesky Youtube Facebook Twitter Instagram Google News Apple News Code of Ethics Privacy Policy Cancellation Policy Advertising Policy About us Account FAQ Podcasts Contact us Jobs Pitch Us Got A News Tip? Code of Ethics Privacy Policy Cancellation Policy Advertising Policy Bluesky Youtube Facebook Twitter Instagram Google News Apple News"}