{"id": 2162, "name": "Twitchy", "domain": "twitchy.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://twitchy.com/dougp/2025/06/11/keep-rioting-its-going-great-new-quinnipiac-poll-on-dem-party-approval-delivers-some-brutal-news-n2414123", "title": "Keep Rioting Its Going Great New Quinnipiac Poll On Dem Party Approval Delivers Some Brutal News N2414123", "content": "Politics Media Culture Videos Podcasts Store Account Settings Newsletters Comment Settings Log Out Politics Media Culture Videos Podcasts Store **Keep Rioting, It's Going Great! New Quinnipiac Poll on Dem Party Approval Delivers Some BRUTAL News** It's time to check in and see how the Democratic Party is doing when it comes to public approval after spending the last several weeks going to the mat to keep criminal illegals in the country and insisting that men should be able to compete in women's sports. How crazy have the Dems gotten? This crazy: LA MAYOR: The looting of the Nike store was \"provoked by the White House.\"pic.twitter.com/cObTZ5sQkC These Democrats have reached \"Trump enforcing immigration laws has caused law-abiding people to loot a Nike store\" levels of deranged. It's showing up in the polls as well. A new Quinnipiac survey has some news that shows the Dem Party is on the right path... as far as the Republican Party is concerned: Democratic Party Approval Rating🟢 Approve: 21% (-49)🔴 Disapprove: 70%Quinnipiac | June 5-9 | 1,283 RVpic.twitter.com/akG3iBTiDm You know what the Dems' problem is? They haven't had enough margaritas with illegal aliens and made Tim Walz and Jasmine Crockett the faces of their party nearly aggressively enough. New Quinnipiac poll just dropped showing the Democrat Party with 21% approval.Turns out, if you die on enough 80/20 hills, that’s where you’ll end up. If Gavin Newsom runs for the Democrat presidential nomination it'll be fun watching him pretend to have never been the lefty that he is. Poll was taken Thursday through Monday - so could have also picked up some LA riots and chaos.https://t.co/Gr1swHTDfk Exactly. Quinnipiac is ridiculously left leaning - tooThey're in the teens. Operation Backfire in full effect. 🤣 I figured it would be bad ... but not that bad. Holy cow. The Dems just can't stop taking the crazy side of all the issues. 21% approve of the Democratic Party.Wonder why 🤔https://t.co/AujeFv5GBlpic.twitter.com/QPwubZ9aNS Maybe the lefties the Dems are cheering on haven't blocked enough traffic or looted nearly enough. When the primary message is opposing federal deportation of murderers, rapists and child molesters who entered illegally, 21% approval is actually a blessing.https://t.co/xp653fOkcB The Dem Party approval rating should actually be almost ZERO but you can't have everything. **Join the conversation as a VIP Member** 1UPDATED: U.S. Prepping for an Earth-Shattering Kaboom in the Middle East? 2Karoline Leavitt's Truth Nukes Leave Multiple Mushroom Clouds Over Gavin Newsom, Karen Bass and the Dems 3Massive Setback for Rioters, Democrats After DHS Announces Results of Latest LA Immigration Sweep Cory Booker Reposts Video of Woman Insisting That We Need Illegals for Slave Labor Woman Peacefully Rams Cops With Motorcycle Because They’re Deporting Her People White House Drops Video of the 'Rallies' Going on in Los Angeles Jesse Kelly, Twitter Troll Extraordinaire, Unleashes Chaos on Unsuspecting Law Enforcement Supporters Copyright Twitchy.com/Salem Media. All Rights Reserved. Terms under which this service is provided to you."}