{"id": 1050, "name": "The Observatory", "domain": "observatory.journalism.wisc.edu", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://observatory.journalism.wisc.edu/2018/10/16/wisconsin-gov-scott-walkers-claims-about-economy-are-accurate-but-do-not-apply-to-many-blacks-latinos/", "title": "Wisconsin Gov Scott Walkers Claims About Economy Are Accurate But Do Not Apply To Many Blacks Latinos", "content": "Go Fact ChecksWisconsinUS National Politics Wisconsin US National Politics Wisconsin US National Politics Explaining WisconsinCivic EngagementElectionsPolicy-making Civic Engagement Elections Policy-making Civic Engagement Elections Policy-making Experts’ Corner Ask Us To Observe About UsHow We ObservePublishersReportersPartners How We Observe Publishers Reporters Partners How We Observe Publishers Reporters Partners **The Observatory- Produced by the University of Wisconsin-Madison School of Journalism and Mass Communication** The Observatory(https://observatory.journalism.wisc.edu/2018/10/16/wisconsin-gov-scott-walkers-claims-about-economy-are-accurate-but-do-not-apply-to-many-blacks-latinos/) Fact ChecksWisconsinUS National Politics Wisconsin US National Politics Wisconsin US National Politics Explaining WisconsinCivic EngagementElectionsPolicy-making Civic Engagement Elections Policy-making Civic Engagement Elections Policy-making Experts’ Corner Ask Us To Observe About UsHow We ObservePublishersReportersPartners How We Observe Publishers Reporters Partners How We Observe Publishers Reporters Partners **Wisconsin Gov. Scott Walker’s claims about economy are accurate, but do not apply to many blacks, Latinos** More on Wisconsin Subscribe to Wisconsin Gov. Scott Walker Instagram account Gov. Scott Walker tours Metro Market in Milwaukee on Sept. 13, 2018 to see Kroger and Roundy’s $300 million investment in their 106 Wisconsin stores. In his run for a third term, Walker is touting the strength of Wisconsin’s economy under his tenure. In atweetfrom Sept. 3, Gov. Scott Walker praised Wisconsin’s economy, claiming “wage growth in Wisconsin is higher than the national rate. And the percentage of people working is one of the best in the country.” The Observatory checked both claims by Walker. According to Walker, Wisconsin’s wages are growing faster than the national rate. When asked about the claim, Walker’s campaign press secretary Austin Altenburg referenced a July BizTimesarticle. From January to May of 2018, Wisconsin experienced a year-over-year increase of 5.7 percent, according to the article. The U.S. average was 2.7 percent. Altenburg also sent a link to atweetfrom University of Wisconsin-Madison economics professor Noah Williams, who said Wisconsin’s wages grew 5.9 percent from June 2017 to June 2018. The national average during that time was also 2.7 percent. According to the U.S. Bureau of Labor Statistics’ Quarterly Census of Employment and Wages, for thefirst quarter of 2018, the average weekly wage in the U.S. increased 3.7 percent, and in Wisconsin the average weekly wage increased 3.8 percent. Because each of these sources looks at a different time frame, the percent increase for Wisconsin and the United States is different. However, no matter the time frame, Wisconsin’s wage growth is beating the national average. While Wisconsin’s wage growth rate is higher than the national rate, the average Wisconsinite is paid less per week than the average American. Nationally, the average weekly wage was $1,152, and in Wisconsin, it was $968, according to the U.S. Bureau of Labor Statistics. Moreover,one in fiveWisconsin workers has a poverty-wage job, according to UW-Madison’s COWS, a “national think-and-do tank that promotes ‘high road’ solutions to social problems.” COWS defined a poverty-wage job as one that pays less than $11.55 per hour. In Wisconsin, 22 percent of white workers, 41 percent of black workers and 41 percent of Hispanic workers hold poverty-wage jobs. “Low-wage jobs – indeed, low-wage careers – define and constrain the prospects of too many workers,” COWS found. “And … while racial inequality is not unique to Wisconsin, it is extreme here.” Despite these caveats, The Observatory rates Walker’s first claim, that the state has experienced higher wage growth than the national average, asVerified. Walker’s second claim was that the percentage of people working in Wisconsin is one of the best in the country. The state has a 69 percent labor force participation rate compared to the national rate of 62.9 percent, according to COWS. This is thefifth highestrate in the country. U.S. Bureau of Labor Statistics Furthermore, Wisconsin’s current unemployment rate is3 percent— it’s tied for 10th along with South Dakota and Virginia. The national unemployment rate is 3.9 percent. Wisconsin’s neighbors Minnesota, Iowa, Illinois have an unemployment rate of 2.9, 2.5 and 4.1 percent, respectively. But Wisconsin’s low unemployment rate is not the same for everyone. The 2018 COWS report broke down the state’s unemployment rate by race. COWS found white unemployment was at 2.6 percent, Hispanic unemployment was 5.4 percent and unemployment among African-Americans was 9.3 percent. The black unemployment rate is more than three and a half times the white unemployment rate — the highest disparity in the nation, COWS associate director Laura Dresser said. “Even as the white unemployment rate is almost the lowest it’s ever been, the black unemployment rate is at levels that we would call a recession,” Dresser said. InApril, The Observatory found that although the state’s unemployment rate was at a historic low, many Wisconsinites have to work two jobs due to low wages. Overall unemployment is low, and labor force participation is high, but that leaves out the context of high unemployment for black residents. As a result, it does not provide a complete picture of Wisconsin’s economy — especially since the disparity between white and black unemployment is the worst in the nation. Nevertheless, The Observatory rates the claim of Wisconsin’s high overall labor participation asVerified. SourcesTweetfrom Gov. Scott Walker, Sept. 3, 2018Email from Walker’s campaign press secretary Austin Altenburg, Sept. 28, 2018Tweetfrom University of Wisconsin-Madison economics professor Noah Williams, Aug. 14, 2018BizTimes,Wage growth in Wisconsin outpacing U.S., July 23, 2018U.S. Bureau of Labor Statistics,Covered establishments, employment, and wages by state, Aug. 22, 2018State of Wisconsin Department of Workforce Development,Wisconsin Ranks 1st Nationally in Manufacturing Jobs Added Over Last Three Months, Sept. 21, 2018Interview with COWS associate director Laura Dresser, Sept. 27, 2018Bureau of Labor Statistics,Local Area Unemployment Statistics, Sept. 21, 2018Bureau of Labor Statistics,Unemployment rates by state map, August 2018COWS,The State of Working Wisconsin, Aug. 31, 2018 **AboutIzabela Zaluska** Izabela Zaluska is an undergraduate at UW-Madison studying journalism with an emphasis on reporting and pursuing a certificate in criminal justice. In addition to The Observatory, she has had her work published by The Badger Herald, UW's Global Health Institute and Madison Commons. In her free time, she loves to cook, listen to true crime podcasts and watch Netflix. More by Izabela **Read Next** Vukmir: 3.4 million in Wisconsin would lose coverage under Medicare for All. Is that true?During her unsuccessful run for U.S. Senate, Republican state Sen. Leah Vukmir claimed that 3.4 million people would lose employer-sponsored health care coverage if Congress passed Medicare for All, a bill co-sponsored by her opponent, Democratic U.S. Sen. Tammy Baldwin. We check that claim. During her unsuccessful run for U.S. Senate, Republican state Sen. Leah Vukmir claimed that 3.4 million people would lose employer-sponsored health care coverage if Congress passed Medicare for All, a bill co-sponsored by her opponent, Democratic U.S. Sen. Tammy Baldwin. We check that claim. During her unsuccessful run for U.S. Senate, Republican state Sen. Leah Vukmir claimed that 3.4 million people would lose employer-sponsored health care coverage if Congress passed Medicare for All, a bill co-sponsored by her opponent, Democratic U.S. Sen. Tammy Baldwin. We check that claim. Candidate Evers calls Wisconsin’s roads 2nd worst in the U.S. Are they?The debate about Wisconsin’s infrastructure and road quality remains at the forefront of the 2018 gubernatorial election. The Observatory fact-checks Tony Evers’ claims about making fixing Wisconsin’s roads a top priority. The debate about Wisconsin’s infrastructure and road quality remains at the forefront of the 2018 gubernatorial election. The Observatory fact-checks Tony Evers’ claims about making fixing Wisconsin’s roads a top priority. The debate about Wisconsin’s infrastructure and road quality remains at the forefront of the 2018 gubernatorial election. The Observatory fact-checks Tony Evers’ claims about making fixing Wisconsin’s roads a top priority. Comments are closed. The Observatory Fact Checks Explaining Wisconsin Experts’ Corner About Us **About Us** **Contact** © Copyright 2025, The Observatory Built with theLargo WordPress Themefrom theInstitute for Nonprofit News. Back to top ↑"}