{"id": 2108, "name": "Progressive International", "domain": "progressive.international", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://progressive.international/blueprint/9be64adc-4f0d-423d-bc5f-42cc3cef1921-program-of-action-on-the-construction-of-a-new-international-economic-order/en", "title": null, "content": "**Program of Action on the Construction of a New International Economic Order** **Document** **Preface** 50 years ago, the nations of the Third World united behind a vision of sovereign development and international cooperation across areas such as trade, finance, and technology. That vision became known as the New International Economic Order (NIEO) — and in 1974, they won a UN Declaration on its Establishment (3201 S-VI) and a Program of Action (3202 S-VI) for its implementation. The prosperity of the international community as a whole depends upon the prosperity of its constituent parts. The political, economic and social well-being of present and future generations depends more than ever on co-operation between all the members of the international community on the basis of sovereign equality and the removal of the disequilibrium that exists between them. Five decades later, however, that disequilibrium endures. The world may have undergone profound transformations in the intervening years: social, political, and economic in nature. But the ‘Brandt Line’ that once defined the developmental divide between North and South persists today — along with the institutions that sustain this international disequilibrium. On its 50th anniversary, the NIEO thus merits revival, but requires renovation. How might we adapt this vision to the conditions of the twenty-first century? How might we confront the crises of climate change, viral pandemic, and extreme poverty that threaten billions of lives and livelihoods across the planet? And how might we ensure the success of such a program of action where its predecessor failed? Over the past two years, the Progressive International has convened scholars, diplomats, and policymakers from over 50 countries to answer these questions. From Brussels to Kampala and beyond, these deliberations have called on representatives from across the Group of 77 to reimagine the New International Economic Order, and the tactics to win it. At the 5th International Conference for World Equilibrium in Havana, these collective deliberations yielded a strategy to ‘assert Southern power’ to secure a new global contract on sovereign development, as set out in the Havana Declaration presented to the Conference presidium in January 2023. The Congress recognizes that economic liberation will not be granted, but must be seized. Our vision can only be realized through the formation of new and alternative institutions to share critical technology, tackle sovereign debt, drive development finance, and face future pandemics together. Since then, the members of this ‘Havana Group’ have collaborated from their respective corners of the world to develop that vision into a comprehensive Program of Action on the Construction of a New International Economic Order: a handbook for an insurgent South in the 21st century, with measures that combine clarity and audacity to drive sovereign development in turbulent times. The Program of Action is divided into five main issue areas, each of which articulates their objectives and the concrete measures to reach them. Such measures are neither prescriptions for Southern states nor pleas for the generosity of their Northern neighbors. Rather, they focus on shared institutions and coordinated actions that Southern governments can take collectivelyand unilaterally to transform the global economic architecture. The publication of the Program of Action coincides with the 50th anniversary of the original NIEO, and concludes the two-year phase of the Progressive International’s commemoration. But it remains a living document: a draft to be amended and adapted to the conditions of the nations and peoples that seek to implement it. The task of the Havana Group is to accompany them on that historic journey toward implementation. **Preamble** The Havana Group, Decryingthe inequities of the existing international economic order, structured by centuries of imperial conquest and colonial domination, designed to drain wealth, talent, and opportunity from the world’s South to its North; Consideringthe enormous costs of these inequities for the billions of people condemned to hunger, poverty, illness, and displacement, while an increasing share of world resources flow into weapons of war; Stressingthe existential risks of an international economic order that prizes competition between states, inflames conflict between peoples, and induces crisis with overwhelming but unequal impact across the global economy; Commemoratingthe New International Economic Order on the occasion of its 50th anniversary, and the legacy of all those who have fought to bring the world’s economy into greater harmony with the needs of its peoples and the natural world; Recallingthe Havana Declaration presented to 5th International Conference for World Equilibrium, and its conviction that economic liberation will not be granted, but seized by the combined and collective action of the South; Recognizingthat, in this same spirit and with this same determination, the Havana Group and its allies across the South prepares for the most colossal, legitimate, dignified and necessary battle for the life and future of our peoples, nations, and planet; Presents the following Program of Action: **I. Climate, Energy, and Natural Resources** The accelerating collapse of the conditions of life on earth is humanity’s foremost challenge, requiring a radical reconfiguration of our economies, energy systems, and ways of life. But this process of climate reparation will require a confrontation with the system that bears responsibility for its breakdown. For centuries, the world’s dominant powers depleted the soil, poisoned the air, cut down the trees and displaced the caretakers of the fields and forests. Today, the trajectory of the global ‘green transition’ is set to reproduce the same colonial dynamics that first caused the crisis. The North seeks to divert attention from its broken climate commitments, pinning responsibility for the crisis on those most vulnerable to its effects. Meanwhile, the South confronts increasing pressure to prioritize climate mitigation over adaptation, transition, and the social imperative of sustainable development. A new path is needed — a path of collective action to regain full and permanent sovereignty over land, food, and resources, while charting a fair and rapid green transition along the way. **Objectives** **Full Permanent Sovereignty** That peoples and nations exercise full and permanent sovereignty over their natural wealth and resources as a fundamental constituent of their right to self-determination and a precondition to their collective flourishing. **Clean Energy Abundance** That all peoples enjoy an abundance of clean renewable energy through an international system that minimizes inequalities of nation, class, and exposure to harmful externalities of production and consumption. **The End of Dependency** That the states and corporations of the North no longer exercise domination over global systems such as energy, agriculture, and food, and the technologies that produce them, guaranteeing to the South greater independence, resilience, and prosperity. **Ecologically Equal Exchange** That the terms of ecological exchange, defined for centuries by extreme inequality, are brought into balance, replacing a system of exploitation — in which the South serves as a source of cheap resources and a sink for expensive waste — with a system of sovereign equality. **Environmental Justice** That the era of environmental impunity is brought to its final end, not only ensuring accountability for the crimes committed against peoples and the territories they inhabit, but also establishing equity in the distribution of impact from and influence over the climate system. **Climate Reparation** That the ecological debt is finally repaid, providing ample and urgent reparations to the nations of the South that suffer the greatest consequences for the reckless, cumulative carbon emissions and ruthless resource extraction of their Northern neighbors. **Measures** **Global Ecological Emergency** For a coordinated declaration of global emergency in order to respond to the global climate crisis. As global society confronts a rapidly escalating climate crisis, institutional responses to catastrophic global warming and ecological collapse remain tepid at best under the conditions of business as usual. Vast and transformative amounts of resources critical for ecological restoration and climate change mitigation remain inaccessible to nations of the South, where the most devastating ecological impacts of extractivism and exploitation are felt. To unlock these resources, Southern countries can make a coordinated declaration of global emergency to provide legal and political backing for a range of measures necessary to respond to the global ecological crisis, including the triggering of force majeure clauses and automatic compulsory licensing of intellectual property restrictions. While a declaration of global emergency alone would not address the drivers of ecological breakdown, it would establish a powerful legal and political precedent for Southern nations to take necessary actions. It would be a tool to influence the process of defining key terms in negotiations of climate, trade, investment, and other aspects of international cooperation. These terms could provide the shared institutional basis on which a long-term, multilateral “sustainable development plan” could be constructed and implemented across the South. The collective existential threat of the climate crisis must be declared as such — and addressed accordingly. **Common Framework for Extraction** For the development and implementation of a shared policy framework for the management of extractive industries across the South. Under the paradigm of unequal exchange, multinational corporations housed in the Global North are granted carte blanche to pursue rapacious and unending extraction of natural resources across the South, with devastating consequences and virtually no channels for recourse or regulation. A coordinated regulatory framework for the operations of extractive corporations across the South—including common tax policies, labor regulations, and redistributive mechanisms—could end contemporary race-to-the bottom regulatory regimes that drain value from Southern communities and aggravate the ecological crisis. A shared regulatory framework is a critical step in promoting a collective and sustained reduction in extractive activities across the South, ensuring the extraction of only that which is socially necessary. Specific mechanisms could include standardized contracts with common taxation clauses that formally exclude recourse to arbitration in Western-led forums, while providing alternatives in institutions led by the South. These contracts could also include common labor and community protections—collectively determined by state, labor, and civil society leaders—to ensure fair compensation, adequate labor protections, and ecologically sustainable practices. Sector-specific royalties, taxes, and legal mechanisms would guarantee investment in the diversification of development pathways and a sustainable future (e.g., by investing profits from non-renewable resource extraction into industrialization and ecological restoration efforts). No longer can extractivism control the South; it is time for the South to control extraction. **Energy Authority of the South** For the creation of Southern energy authorities to reduce energy dependence and coordinate the development of green alternatives. The future of Southern societies depend on reliable, affordable, renewable energy. Yet today, access to this essential component of development is far from assured. While the South remains a key source of natural resource extraction, it is Northern nations that typically reap the benefits. Northern nations are among the top energy producers, purchase and refine raw Southern products, consume inordinate and unsustainable quantities of the world’s energy, and monopolize essential energy technologies. In pursuit of a transition to green energy — a tragically delayed and wholly inadequate response to a climate crisis that is not of Southern making — Northern nations are already coordinating efforts to maximize the exploitation of Southern critical minerals. At this pivotal juncture, Southern energy sovereignty depends on Southern cooperation. Regional or pan-Southern energy authorities could pool resources and capacities to develop alternative energy sources, leverage economies of scale of regional energy infrastructure, develop common standards to mitigate the impacts of energy projects on the environment and local communities, reduce vulnerabilities to Northern energy overconsumption, and distribute the benefits of energy production equitably across the South — to serve development and the public good rather than private profit. Northern nations can no longer be allowed to extract and consume without limit, while leaving the people of the South in the dark. The future of energy must be one of sustainability, equity, and shared abundance; this future can only be realized through Southern unity. **Resource Sellers’ Clubs** For the establishment of organizations for economic coordination between natural resource exporters of the South. The history of North-South relations is a history of exploitation of the natural wealth of the Southern peoples. The gifts of the land — that which should rightfully bring prosperity to the people who call that land home — are instead looted for the profit of Northern capital, trapping Southern nations in the dependent position of commodity exporters, on unequal and declining terms. But this dependence is a two-way street. Northern reliance on the flow of cheap resources endows Southern exporters with an untapped power to take back what is owed and reorder economic relations. By coordinating the production and sale of agricultural, mineral, and other primary goods, sellers’ clubs might serve to stabilize prices, improve the bargaining power of sellers, align sustainable production practices, and — in recognition of the inequality of natural endowments and the urgency of the ongoing ecological collapse — establish solidarity funds to invest in industrial advancement, human development, and ecological restoration across the South. The natural wealth of the South should benefit the people of the South; through primary commodity sellers’ clubs, Southern nations might unite to reclaim what is rightfully theirs. **Farming Framework** To develop a coordinated policy framework for small-scale, cooperative, and family farming in order to promote sustainable agricultural practices, food sovereignty, and crop diversity across the South. The extreme concentration of land in the hands of the few, the domination of the global food systems by a handful of multinational corporations, the erosion of peasant livelihoods and devastation of peasant communities, the deterioration of Southern food sovereignty in favor of monocrop exports, the persistence of hunger in a world capable of providing abundance, the degradation of land, water, and air — these are the combined consequences of a global food system designed for the profits of Northern capital rather than the needs of Southern peoples. From financialization to trade liberalization to monopolization, the causes of the global food system’s dysfunction are many, but the solutions are clear: the empowerment of peasants to defend their land, invest in agroecology, and defend food sovereignty. Southern nations can help to promote these goals across borders by establishing common policy frameworks and regional coordination bodies for cooperative, family, and small-scale farming — pooling expertise, capacities, and investments, coordinating in the development of agricultural and environmental standards, and constructing regional programs that promote local agricultural production using a range of tools from peasant land protections laws to coordinated economic measures such as subsidies, tax credits, import tariffs, and export quotas. Through the development of bodies and frameworks for agricultural policy coordination, Southern nations can ensure that peasants and agricultural workers do not labor to feed Northern capital — but labor to feed their people. **Seed Banks** For the formation of an international seed bank or network of seed banks to promote agricultural diversity and foster food sovereignty and food system resilience across the South. The South is home to the majority of the world’s biodiversity. Yet, multinational corporations and other Northern institutions control the preservation of and access to agrobiodiversity across the world. Southern food systems are thus left underfunded, unreliable, and dependent on the North in times of scarcity or crisis. The establishment of an international seed bank or network of regional or national seed banks can enable nations of the South to promote agricultural diversity and progress toward objectives of food sovereignty and food system resilience by protecting and preserving indigenous seeds. Such seed banks could issue seeds to Southern nations seeking to diversify their agricultural production, thereby offering a pathway to move beyond the limitations of agricultural specialization and the resulting dependence on Northern imports. In this way, a multilateral Southern seed bank operating for the public good would help to ensure that the world’s biodiversity is protected, not exploited; its natural wealth put in service of global needs, not corporate profit. **Circularity Strategy** For the creation of a resource recycling program that repurposes waste into material inputs for future production. Industrial production in the existing international economic order is characterized by waste at all stages—from raw material extraction to manufacturing to consumption to disposal. Each year, billions of tons of resources are extracted in service of industrial commodity production, and billions of tons of waste are produced as a result of mass commodity consumption, placing disproportionate ecological burdens upon the South. In addition to planning industrial production around human needs as opposed to corporate profit, nations of the South can address the dual threats of extractivism and waste by establishing infrastructure to recycle waste produced by processes of industrial production and mass consumption, process and repurpose this waste, and reuse it as a material input for future productive activities. Such a program would promote more sustainable and regenerative forms of industrialization by transforming the nature of transnational production from a linear model—in which the resource extraction and waste disposal at the starting and end points are peripheralized as afterthoughts or externalities—into a circular model, wherein the final material outputs flow back into the production process as future inputs. A program to promote resource circularity and materials recycling across the South can spur industrial growth while curtailing resource extraction and mitigating resource wastage. **II. Industry, Labor, and International Trade** The rules of trade have trapped Southern economies in a permanent position of subordination. Far from mutually beneficial exchange, these systems extract commodities and labor for the North while blocking the path to industrialization and sovereign development for the South. The NIEO identified the “fundamental problem” of the South’s declining terms of trade; those unequal terms continue to sustain the South’s dependency today. But now, Southern nations must also contend with a regime of institutions and agreements designed to erode their sovereignty under the guise of “free trade,” even as their Northern neighbors betray these common rules with impunity. Nations of the South can and must break these fetters, challenging the systems of unequal exchange with the North, prioritizing the development of their own productive capacities, coordinating with one another to ascend the value chain, and orienting trade and industrial production toward human and ecological harmony. **Objectives** **Common But Differentiated Rules** That all nations enjoy a universal, rules-based, open, non-discriminatory and equitable multilateral trading system, as a vehicle for international cooperation, peace, and shared prosperity across the world. **Equal Terms** That the international trading system yield an enduring improvement in the terms of trade between North and South, supporting knowledge transfer and adaptation of technical standards and greater global integration on terms that favor the sovereign development of the world’s poorest nations. **Fair, Stable Prices** That the institutions of global economic governance proactively reduce volatility, prevent shocks, and protect vulnerable populations from crises that destabilize commodity prices and damage their producers or their consumers in the process. **New International Division of Labor** That the world economy exhibit a division of labor no longer defined by the colonial past and its enduring dynamics of North-South exploitation, but that all workers enjoy equal rights and all nations pursue the developmental path that is best suited to the well-being of their peoples. **Rights, Redistributed** That the international system of trade reorder the priorities of people and profit, redistributing the rights afforded to transnational corporations to the communities impacted by their practices and the collective voice of the workers they employ. **Race to the Top** That the institutions of the international trade system guard against deregulatory dynamics that seek to attract foreign investment at the cost of workers, their communities, and the environment, promoting instead the fortification and harmonization of standards based on their equal rights. **Measures** **Commodity Buffer Stocks** For a multilateral buffer stock system to stabilize essential commodity prices. Southern nations have for too long been battered by the volatility of the commodity market. Locked into the role of non-diversified commodity producers, forced by the rules of trade into food import dependence, and lacking the resources to safeguard against the vagaries of global prices, Southern producers and consumers alike are buffeted by both boom and bust. In the case of certain agricultural goods, the consequences of this volatility can mean starvation. A new framework for regulating commodity markets based around a multi-layered buffer stock system for essential commodities at the global, regional, and national levels would help to stabilize international prices and markets for select commodities, while carving room for sovereign promotion of resilient provisioning systems. Such a buffer stock system would be supported by equitable contributions, and managed by an intelligence unit tasked with monitoring markets, estimating risk, and designing and updating commodity-specific intervention strategies. Entrusted with a dual mandate of reducing extreme price fluctuations and stock viability — this system would be prepared in the event of imminent global or regional price spike or collapse to raise the alarm, call on nations to pursue joint measures to stabilize supply and demand, and, as needed, buy to or sell from reserves. The sovereign development route is a necessary but arduous one; a global buffer stock system to reduce price volatility would help smooth the path and provide a global public good that the “free market” alone cannot deliver. **Local Content Requirements** For the requirement of minimum quotas for production and trade within and between South nations to promote and protect industrial productive capacities across the South. While industrial protectionism is a common practice among countries of the Global North, developing industries in the South are left vulnerable to domination by multinational corporate interests with outsized influence under the auspices of “free trade.” As countries in the Global North maintain local content requirements to sustain domestic productive capabilities (e.g. Buy American), Southern countries too can develop their own requirements to develop Southern production. Unlike Northern measures, Southern nations might define their content requirements regionally, or as pan-Southern measures, allowing for mutual benefit even when individual nations may lack sufficient pre-existing production networks domestically or the individual bargaining power to impose such requirements. “Buy Southern” requirements, alongside Southern investment and production clubs, would help to foster coordinated green production networks prioritizing the fulfillment of regional needs with affordable and good quality products, develop diversified industrialized economies, and address persistent trade imbalances. By using and coordinating local content and technology transfer requirements for public procurement and investment, South countries can catalyze industrialization while creating sustained demand for products from across the South. South countries should enforce increasing percentages of local products in national and local bidding processes to boost economic growth and technological advancement. Coordinated local content requirements can stimulate national economies, create jobs, and foster green industrial development across the South. **Procurement Clubs** For the coordination of public procurement to secure fairer prices in the purchase of Northern goods. Southern nations are not only forced by their subordinate global position to export their primary goods cheaply, but also to import Northern goods dearly, straining public budgets and fueling a vicious cycle of financial, ecological, and technological dependency. As lone buyers, Southern nations must accept unequal terms and monopoly prices. But united, buyers might wield collective leverage for fairer prices. Just as Northern nations, while espousing “free market” rhetoric, have developed buyers’ clubs for critical materials, so might Southern buyers’ clubs reduce the costs of certain imports from the North such as medicines and green technologies, easing access to essential goods and helping to rebalance the terms of trade. While the South remains committed to the development of productive capacities that reduce dependence on Northern imports, by pooling resources for public procurement, Southern nations can collectively bolster buying power, extract better terms of procurement, and mitigate the influence of oligopolistic sellers of goods in areas where productive capacities cannot yet be readily developed. Pooled procurement clubs might at the same time align technical specifications and regional scientific, technological, health, and environmental standards, thereby inciting industrialization, bolstering economies, and improving the quality of life of Southern peoples. Southern nations aspire to be more than importers of Northern products. But until that time, Northern goods should come at a fair price. Southern buyers clubs can help to realize that goal. **Value Chain Coordination** For regional coordination of industrial policy in strategic sectors and critical technologies. In the era of footloose capital, the project of development is distorted into a competition— neighbors that might work together for mutual benefit, instead pitted in a rivalry to attract foreign capital. The task of coordinating production, in this context, is ceded to multinationals that answer solely to profit, and not the long-term development needs of the nations in which they operate. For Southern nations, the result is the misallocated resources, supply chain redundancies, and the continued deference to the interests of foreign capital. A coordinated approach offers an alternative path. Together, Southern countries can coordinate industrial policy across borders, unlocking the benefits of scale, reducing productive redundancies, and ensuring that limited resources are more effectively targeted without reliance on Northern capital. Southern nations could form regional networks of state-owned enterprises that focus on the key industries required to support human life but which are presently dominated by capitalist imperatives — including clean energy, vital infrastructure, healthcare technologies, and food production — to reclaim sovereignty over the processes of production required for our survival. These state-owned enterprises would follow coordinated and democratic plans, which would ensure that the benefits of industrialization are equitably distributed throughout the region. By prioritizing strategic industries and critical supply chains, these coordinated efforts can reduce dependence on Northern imports, ensure vibrant and resilient regional production networks, and advance a just green transition. Forging the industrial policy path alone risks reducing development to a zero-sum game. But by coordinating productive efforts, Southern nations can share in benefits that far exceed the sum of their parts. **Transnational Labor Councils** To establish transnational workers’ councils in order to halt the race to the bottom and defend against the exploitation of Southern labor. To multinational corporations, the South exists as a near-limitless pool of workers — cheap, exploitable, and expendable. Courageous struggles to resist this pattern of exploitation have been undermined at every turn: by direct imperial intervention, by systematic attacks on workers’ movements and their allied governments, and, in the neoliberal era, by the ability of footloose global capital to force Southern nations to vie for their investment, fueling a race to the bottom in wages and labor standards that harms workers everywhere. In the age of globalized supply chains, the forces of organized labor must build power across borders. But when such movements are weak, absent, or disunited, Southern nations might coordinate to build the infrastructure for their coordination. Transnational Workers Councils — fora for the development of common policy composed of representatives of major stakeholders in any productive sector, including workers, employers, impacted communities, and national governments — allow for a form of collective bargaining in contexts where traditional labor unions have been weakened or cannot easily function. Catalyzing the unification of workers across borders, Transnational Workers Councils could institute minimum sectoral wages and labor standards in coordination with national governments that might act for their enforcement. In this way, Southern labor might begin to win adequate remuneration and labor protections across borders, put an end to the race to the bottom, and unite against the forces that seek to divide, conquer, and impoverish the workers of the South. **Southern Trade Alternative** For the coordinated withdrawal from harmful North-South trade and investment agreements, and the development of South-South alternatives. To the nations of the South, “free trade” agreements are the antithesis of freedom. The neoliberal era is underpinned by the proliferation of a vast and tangled network of bilateral and multilateral trade and investment agreements designed not to facilitate mutually beneficial trade, but to render Southern economies more readily exploitable by multinational corporations. Eroding labor, environmental, and health regulations, these agreements fuel the mutually destructive race to the bottom which pits Southern nations against one another in competition to attract foreign investors by maximizing the vulnerability of their nations. To break these shackles, Southern nations might coordinate their withdrawal from, or renegotiation of, harmful trade and investment agreements, wielding collective power for better negotiating terms and “safety in numbers” against the threat of unilateral retaliation. In their place, Southern nations might develop amongst themselves alternative trade agreements that, while facilitating economic exchange, ensure that trade is a means to an end of shared prosperity, rather than the end in itself.Such alternative agreements could enshrine firm labor, environmental, and other regulatory standards, with defined and increasing floors. Through the development of firmer standards in South-South economic exchange, such agreements could not only act as models for the proliferation of a new type of trade policy, but also strengthen the hand of Southern nations in renegotiating or replacing existing agreements with the North. In place of the extractive North-South trade and investment agreements, South-South agreements can help end the race to the bottom and ignite a new climb to the top. **III. Money, Debt, and Finance** Globalization promised to forge a flat and frictionless global economy, blind to color and continent of origin. Yet the old colonial structure of the international economic order endures today. Shaped by the dominant interests of the North, the architecture of the international financial system serves to suffocate Southern economies, drain their resources, and maintain a monetary hierarchy between the most and least ‘privileged’ economies. Nations across the world’s South remain burdened by untenable debts with little control over the terms of loan agreements and virtually no accountability from multinational corporations. Attempts to break free of this architecture have been met with economic coercion, political pressure, or military violence. A comprehensive reconstruction of the international monetary and financial systems is a precondition for shared prosperity, from the cancellation of untenable sovereign debts to the creation of an international taxation regime for multinational enterprises. **Objectives** **Monetary Multilateralism** That the international monetary system bestow no exorbitant privilege upon any of its members, enshrining instead the effective monetary sovereignty of all states as a precondition of their self-determination, and the basket of their currencies as the system’s international reserve. **Financial Insubordination** That the long-term tendency of Northern finance to dominate Southern development move in reverse, asserting the primacy of planned public investment rather than accommodating the risks of footloose foreign capital. **Disarmed Interdependence** That all states exercise collective control over the circuitry of the global economy, stripping the excess power granted to developed nations and their private corporations to choke, surveil, and profit from shared financial infrastructure. **Abundance, Not Austerity** That no state be forced to choose between caring for its people and fair access to finance, supporting all states with strong social programs instead of punitive structural adjustment packages that privilege returns to Northern capital over the well-being of Southern peoples. **Debt, Redefined** That unpayable sovereign debts go unpaid, not only freeing Southern nations from the enduring burden of unjust and illegitimate debt, but also redistributing that burden to the Northern nations that bear greatest historical responsibility for the underdevelopment of their neighbors. **Fiscal Justice** That the international tax system be refounded on principles of disclosure, fairness and justice, terraforming the global archipelago of tax havens into a common terrain of regulated private corporations and redistributed hidden profits repatriated to the peoples from which they have been extracted. **Measures** **Payment Systems for South** For the development of multilateral, Southern-based payment systems as alternatives to the Northern-controlled global economic architecture. Cross-border payments are overwhelmingly facilitated through Northern-based and -dominated institutions. These systems of messaging, clearing, and settlement — critical functions of the global economic architecture — endow the North with a unique structural power that has been weaponized through unilateral coercive measures, violating Southern sovereignty, undermining Southern development, and punishing those who dare challenge the global hierarchy. A new payment architecture is needed. Alternative multilateral payment systems, based on the principles of sovereign equality and noninterference, would facilitate cross-border payments while preventing their cooptation for geopolitical ends. The beginnings of such a project exist today. Alternative financial messaging, clearing, and settlement systems are already eroding the monopoly of Northern payment systems. Linking, expanding, and further legitimizing these systems would create the basis for the replacement of Northern-based systems altogether without losing the benefits of centralization and scale. Southern-created and Southern-controlled payment systems would neutralize the threat of exclusion from current systems while creating the infrastructure necessary for South-South economic integration to flourish. **Alternative Currencies** For the development of alternative units of account and common currencies to challenge the hegemony of the US dollar. The US dollar sits atop a global currency hierarchy. The unique structural power of the dollar, alongside other Northern currencies, subjects Southern nations to the vagaries of foreign monetary cycles, constrains their ability to pursue independent monetary policy, and renders them vulnerable to unilateral coercive measures imposed by the dominant currencies’ issuers. While measures can be taken individually to insulate against certain effects of dollar dominance, ending the hegemony of Northern currencies in the long term will require Southern nations to cooperate in the development of alternatives. Agreements to denominate trade in existing local currencies or new common units of account, the expansion of the use of Special Drawing Rights or other multilateral currency alternatives, the more ambitious aspirations to develop common, circulatable, and commercially-used currencies — each of these measures, some of which are already in formation, marks a step down the path toward de-dollarization. The US dollar will not be dethroned without a challenger; while such an alternative cannot be created overnight, these cooperative steps would help to erode the dollar’s singular power and lay the foundation for stable, sovereign, development-oriented alternatives. There is no Southern sovereignty without monetary sovereignty, and there is no monetary sovereignty without the development of credible alternative currencies. **Multilateral Credit Ratings** For the creation of Southern-led multilateral credit rating agencies (CRAs) to challenge the structural power of the dominant CRAs. Northern-based and privately-owned, the major Credit Rating Agencies hold the unique and undemocratic power to define the so-called creditworthiness of Southern nations. Access to finance — that lifeblood of the global economy — is thus granted or denied according to the whims of an unaccountable triumvirate, which wields its definition of risk and worthiness according to the needs of Northern capital and its rapacious drive to exploit Southern wealth, even at the expense of long-term stability and returns. An alternative, Southern-based multilateral CRA, or CRAs, established at the regional level or under UN auspices, would challenge this oligopoly, assessing creditworthiness within the context of the long-term goals of shared prosperity and sustainable development, mitigating the speculative and procyclical tendencies of private CRAs, aligning credit assessment timelines with development timelines, countering structural biases against developing nations and state-led sovereign development paths, and incorporating climate and social needs within the calculation of credit risk. While multilateral Southern CRAs alone are insufficient to unseat the major existing CRAs or shift the incentives of Northern capital, the development and adoption of alternative assessments would serve to blunt their weaponization of creditworthiness and open the door to financing for sovereign development on Southern terms. **Debtors’ Clubs** For the formation of a “Club” of debtor nations to strengthen collective bargaining power and renegotiate the terms and conditions of borrowing and servicing sovereign debt. Today, the nations of the South confront the worst debt crisis in history, with another lost decade looming on the horizon. Together, the South now pays out more in debt service than it receives in development assistance. This debt burden will not be lifted voluntarily; rather, it must be rejected collectively. While individual nations can and have courageously repudiated debts found to be odious, solitary action leaves vanguard nations vulnerable to retribution. As creditor nations have formed common bodies to further their leverage over debtors, so might debtor nations increase their forms of cooperation to mitigate the risks of targeted retaliation and shift the balance of power between sovereign debtors and creditors. As the saying goes: \"If you owe the bank a million dollars, the bank owns you. If you owe the bank $100 million, you own the bank.\" The Club of Debtors applies this logic at world scale. Through the sharing of information, alignment of negotiating positions, and the threat of coordinated default, a debtors’ club or clubs would not only extract better terms of debt restructuring, but could help to shift the wider balance of power between North and South across domains such as trade and technology. In doing so, such a club would deliver on the dream of Thomas Sankara, set out in Addis-Ababa a half-century ago, of a united front against debt: “That is the only way to assert that the refusal to repay is not an aggressive move on our part, but a fraternal move to speak the truth.” **Tax Framework** For the coordination of taxation across the South to protect against tax avoidance, tax evasion, and the global race to the bottom. Hundreds of billions of dollars are lost annually to tax avoidance and tax evasion. A fractured global tax system designed by and for Northern capital allows the wealth of the South to be siphoned into hidden coffers, while competition to attract footloose capital fuels a race to the bottom on tax rates, eroding public revenue globally. The North is home to the majority of corporate perpetrators of avoidance and evasion, the networks of legal and financial institutions that enable them, and even many of the most harmful secrecy and low-tax jurisdictions. Unsurprisingly, global tax policy remains in the hands of the rich countries’ club, which is resisting efforts to democratize the process of global tax coordination. Southern-led initiatives to seize the reins of tax policy and build equitable, global alternatives through the United Nations system are invaluable. The present push for a Framework Convention, led by the African Group, promises a new and more comprehensive tax regime, in which developing countries would have equal status and full participation. Alongside these efforts, Southern nations can move toward a just tax system by strengthening information-sharing efforts to identify and crack down on tax evasion, establishing multilateral registries of beneficial ownership to track down hidden wealth, and developing regional and international agreements to standardize tax policy and align minimum rates. **Southern Development Bank** For the construction of Southern development banks and liquidity provision agreements as alternatives to the World Bank and International Monetary Fund. The Bretton Woods Institutions will not be reformed; they must be replaced. The World Bank and IMF use their unique position in the global economic architecture to impose the will of their Northern backers on the economies of the South. Indebtedness, austerity, privatization, deregulation — the monopolistic reign of these Northern-dominated institutions have wrought decades of destruction across the South. While efforts to reform the governance of these institutions are worthwhile, the interests of Northern capital will continue to prevail until true alternatives exist. The seeds of such alternative Southern development banks and reserve agreements have already been sowed. But these efforts often remain limited in scope, underfunded, and in some cases, stained by the continued formal and informal influence of Northern capital. To construct true alternatives to the Bretton Woods Institutions — alternatives rooted in economic sovereignty and mutual cooperation — Southern-led multilateral institutions for development financing and liquidity provision must be expanded, better funded, wiped clean of neoliberal policy conditionality, and decoupled from lingering Northern control. While constructing credible alternatives to the IMF and World Bank will require considerable financial contributions from fellow Southern nations, such contributions will offer a return on investment that can be found nowhere else: the end of the singular dominance of the World Bank and International Monetary Fund. **Remittance Services** For the creation of a public, multilateral institution to cheaply and securely facilitate the flow of remittances. Every year, hundreds of billions of dollars flow from global North to South in the form of remittances. Hard-earned by the sweat of Southern migrants — separated from their homelands, missing their loved ones, and often exploited as cheap labor for Northern employers — global remittance flows triple those of foreign “assistance,” in many cases performing an indispensable function in their home economies. Yet this lifeblood of Southern economies flows through unreliable arteries. Money orders, cash transfers, electronic transfers — the functions that faciliate the flow of remittances are dominated by Northern-based, private financial institutions that charge exorbitant fees and fully cooperate with Northern powers in the weaponization of global finance. A public, Southern remittance institution, however, could provide an alternative. Acting for the public good rather than private profit, a multilateral Southern institution could facilitate the flow of remittances at little or no charge, funded through public contributions and benefitting from the scale that no singular domestic institution could achieve. While such an institution may yet have to comply with certain economic sanctions in order to operate in remittance-sending countries, it could seek to limit the overcompliance that plagues Northern institutions fearful of jeopardizing profits by running afoul of coercive measures. Remittances are not a fringe financial activity, but an essential public good. A multilateral, Southern remittance institution would put this Southern public good in the hands of the Southern public. **IV. Technology, Innovation, and Education** Knowledge is an engine of human prosperity. But in the present era of monopoly corporations and multinational conglomerates, the production, diffusion, and application of knowledge is constrained by a regime of ‘intellectual property’ and secrecy that concentrates innovation capacity and even the profits of globally co-produced knowledge in a narrow sector of the North. The South must develop its own institutions for knowledge production and technological innovation in service of social and ecological wellbeing. Nations of the South can and must work collectively to counteract the barriers presented by intellectual property laws and trade secrets, facilitate free transfers of emergent and critical technologies across borders, pursue ambitious universal public education and literacy programs, establish publicly-funded research and training institutions, and share the gains realized by these institutions in order to foster a robust environment for innovation in service of the public and planetary good. **Objectives** **Knowledge Decolonized** That the system of knowledge production facilitate shared and even development, reversing the drain of Southern talent to Northern institutions to build resilient and robust local ecosystems of knowledge development, valuing rather than denigrating their Indigenous forms. **Innovation Democratized** That all nations and peoples have the tools to drive technological innovation, unfettered by the system of “intellectual property” that hyper-concentrates innovative capacity and perverts its priorities toward war-mongering and profit-making against the global public good. **Data Solidarity** That the institutions of the international scientific system facilitate greater collaboration between states, universities, and peoples, sharing the fruits of discovery across borders rather than restricting them on the basis of “national security” or private profits. **Technological Sovereignty** That all states secure technological sovereignty as a precondition of their self-determination, as a tool for their sustainable development, and as a means to manage geopolitical risks in an age of weaponized interdependence. **Ecological Harmony** That the pursuit of innovation never come at the cost of the planet and its species, bringing into harmony the systems of technological development, application, and management with the ecosystems of all nations and peoples. **Measures** **Research & Development** For the elimination of corporate monopolies on essential knowledge and the coordinated development of Southern alternatives. Technology has the potential to help to liberate humanity. But today, as the Covid-19 pandemic and the ongoing climate catastrophe have clearly demonstrated, technologies with the power to fuel development and save lives are instead hoarded for the sake of private profit. In the name of incentivizing innovation, international intellectual property law — as embodied in the work of the World Intellectual Property Organization (WIPO) and the World Trade Organizations Trade-Related Aspects of Intellectual Property Rights (TRIPS) agreement — segregates access to critical technologies between those who can and those who cannot afford to pay monopoly prices. When these technologies are needed to address global crises, it is not only the South that suffers. To decolonize this knowledge, the “intellectual property” system as it exists today must be rejected; Southern nations might advance this goal by collectively demanding reform, and coordinating withdrawal from key legal constraints such as TRIPS and WIPO’s Patent Cooperation Treaty. In their place, Southern nations may work together to pool resources and capacities for the development of critical technologies for the public good, including medicines and medical equipment, green technologies, disaster preparedness technology, and frontier technologies such as artificial intelligence. One or multiple multilateral Southern critical technologies organizations might identify evolving domains of knowledge to be made public, invest in alternative solutions that meet Southern needs, develop coordinated policies to incentivize the transfer of technology from North to South, and design mechanisms to facilitate the dissemination and sharing of benefits. Together, Southern nations can reject the hoarding of essential technology, and ensure that innovation serves human liberation, not corporate profit. **Public Digital Infrastructure** For the coordinated development of public digital infrastructure against the monopoly of multinationals. In the digital era, the infrastructure on which our peoples and economies depend is not solely physical. Roads, bridges, pipes, and power lines are joined by software, hardware, and data centers as essential public goods. These latter, however, are at present overwhelmingly controlled by a small handful of Northern-based corporate giants. Countries in the South are net providers of raw data that are freely harvested and monetized by a handful of intellectual monopolies. As the world becomes more data-driven, building data solidarity and redistributing the gains associated with globally created data would contribute to limiting data extractivism from the South. In addition to creating exorbitant costs, this reliance on Northern digital infrastructure renders Southern nations vulnerable to Northern interference and deepens dependencies that hinder technological growth. While the development of alternative infrastructures may be prohibitively expensive for individual nations, coordination would allow for the benefits of scale, the reduction of redundancies, and the sharing of costs. Publicly-owned, multilaterally managed, and, where possible, open source, a Southern public digital infrastructure would distribute the costs of the massive investment required and ensure sufficient processing power, storage, and availability of other computing services benefitting Southern consumers, reducing costs to Southern economies, and insulating against the vulnerabilities of Northern coercion. At the same time, the South can adopt a combined set of actions to foster data solidarity, which involves sharing data for public research and the common good as an alternative to profit-driven technologies. Individual freedoms require collective goods, which can be realized through the proper regulation, governance, and sharing of data. For example, anonymised health data could help address pandemics and other global health crises. Just as ceding physical infrastructure to an oligopoly of Northern multinational corporations would present an unacceptable threat to Southern independence, so should Southern digital infrastructure not be left in private Northern hands. The struggle for sovereignty must include digital sovereignty. **Transnational Training Institutes** For the creation of an international system of labor training and accreditation across the South, including paid apprenticeships with worker-led trainings and public funding for small entrepreneurs. Trade and industrial policy informed by Ricardian notions of comparative advantage hinder the educational advancement of entire national workforces across the South as entire national economies are specialized toward particular forms and industries of production. Horizons for industrial development in the South are restricted, and without domestic options for advanced employment, many skilled workers are forced to emigrate to the Global North. Nations of the South could reverse these concomitant crises of underdevelopment and “brain drain” by establishing labor training institutes wherein skilled workers in each host country would train workers across the South in specific industries (e.g., healthcare, clean energy, agroecology, and construction) with the aim of transmitting this knowledge to facilitate economic growth in less-industrialized nations. These opportunities could be offered as paid apprenticeships for trainees with guaranteed employment opportunities (including access to start-up capital) in their home countries after training, to offer insurance against the potential for “brain drain.” As a complement to the labor training institutes, nations of the South could assemble international “delegations” of skilled workers to mobilize in moments of acute need. For example, a delegation of doctors could be deployed to respond to public health emergencies, a delegation of agricultural workers could be deployed in response to food insecurity, or a delegation of engineers could be deployed to rebuild civil infrastructure in the wake of ecological or humanitarian crises. These delegations could also be deployed on a longer-term basis to facilitate the diffusion of key knowledge and skills throughout the region. In this way, new networks of solidarity and resource sharing can be established to offer collective benefits to workers across the Global South. To achieve collective economic emancipation, however, workers of the world must unite. **Southern Accreditation** For the development of a transnational standard of education titling and credentials to stem the brain drain and decolonize knowledge. The South has no shortage of brilliance. Southern scholars make immeasurable contributions to the development of new knowledge, Southern institutions foster the education of the next generation, and Southern students aspire to gain the knowledge and skills that will allow them to transform their societies, and the world, for the better. Yet many of the finest minds of Southern nations depart in search of prestigious accreditations abroad — often never to return and contribute to the national project. Whatever the caliber of Southern schooling, Northern educational institutions remain atop a global education hierarchy, capturing talent and resources, reaping its benefits, and reinforcing colonial patterns of scholarship. A South accreditation and certification institution could help to reverse this dynamic. The development of a common standard of titling and credential evaluation would ease the transferability of certifications and professional credentials, facilitate South-South mobility, advance the global credibility of Southern educational institutions, and enhance the value of, and investment in, Southern educational institutions. These institutions can develop their capacities further through the establishment of pan-Southern research networks, pooling resources, coordinating research agendas, sharing research results, and disseminating the benefits for the public good rather than private profit. Stemming the drain of skilled professionals and scholars, and investing in homegrown alternatives to the dominant Northern educational institutions — Southern education, for Southern peoples, for Southern benefit. **Health Regulation Agency** For the creation of a South health and biosecurity agency to save lives and reduce reliance on Northern health institutions. The development and evaluation of health standards for foods, medicines, crops, and other biochemical products is an essential function of both public health and technological innovation. But prohibitive costs, the benefits of scale, and entrenched interests have left the reins of health regulation nearly entirely in Northern hands, distorting incentives and consolidating biases against Southern actors. While developing alternatives may strain the budget and capabilities of many individual nations, a transnational Southern health and biosecurity agency built through the collective effort of Southern nations could work for the collective Southern benefit. Such an agency, or regional-level agencies, could serve the interests of all people by pooling resources and capacity, coordinating standards, and gaining the scale necessary for adequate evaluations of health and security impacts. This agency would ensure that Southern peoples and ecologies are kept safe, while facilitating the development of Southern biotechnologies — saving lives and advancing the aspirations of sovereign development, rather than entrenching existing global political and technological hierarchies. **Sustainable Innovation Incubator** For the administration of a multilateral, pooled fund to issue loans, grants, and subsidies to support research and implementation of emerging, ecologically sustainable technologies. In the modern era, the horizons of technological innovation transcend the limits of previously imagined possibilities. Yet, this innovation, control thereover, and the benefits thereof are concentrated in the hands of a select few corporations housed in the Global North, stifling the knowledge production potential of the Global South. This Northern monopoly on global knowledge production — from artificial intelligence to clean energy — has exacerbated ecological crises across the Global South while restricting Southern nations’ abilities to respond effectively to these crises. To reclaim sovereignty over knowledge production, nations of the Global South could establish a pooled loan fund to promote research and implementation of innovative technologies that promote human development alongside ecological restoration and sustainability. Such a fund would offer loans to emergent technology researchers and producers across the Global South to investigate and implement effective climate mitigation, adaptation, and resilience strategies in Southern nations. **V. Governance, Multilateralism, and International Law** The existing international order serves to betray the universal principles on which it was founded. Where the UN Charter enshrined the principle of sovereign equality, the multilateral system today concentrates power in the hands of Northern nations that abuse their veto power and military might to erode the tenets of international law. Nations of the South can and must act unilaterally to reconstruct the multilateral system and resurrect the principles enshrined in the UN Charter, exercising their collective leverage both to force democratic reforms of international institutions and to forge alternative institutions that enhance the sovereign resilience of Southern nations to respond to foreign aggression. **Objectives** **Sovereign Equality** That the new international economic order be founded on full respect for sovereign equality among states and the self-determination of all peoples as a precondition for their social development and the peace of present and future generations. **Legal Integrity** That the system of international law flourish on the basis of equality and universality, subject to no state of exception, privilege or exemption, but applied rigorously and fairly for the purpose of development of all nations, and peace between all peoples. **Democratic Multilateralism** That the institutions of global economic governance not only count on the full and effective participation of all countries in solving world economic problems, but also do so on the basis of their equity of voice and vote in the pursuit of those solutions. **Dialogue & Diplomacy** That the bellicosity of empire is checked by a shared commitment to the practice and principle of dialogue and diplomacy, drowning out the drumbeat of war with a new international movement for disarmament and demilitarization across the world. **Southern Unity** That the states of the South once again identify their common interests and shared fate, and act in unity upon them to realize the shared dream of peace, justice, and development for the well-being of all peoples. **Measures** **ISDS Eradication** For the coordinated withdrawal from Investor-State Dispute Settlement systems and the creation of an alternative treaty to bind the behavior of multinational corporations. The ISDS system is one of the purest forms of neocolonialism today, enshrining the interests of transnational capital at the expense of state sovereignty, ecological wellbeing, and human needs. Even Northern nations have increasingly recognized the dangers of its precepts, removing themselves from under its burden. But as is often the case, the same liberties are not afforded to the South. As a few trailblazing governments have shown, it is possible to unilaterally withdraw from the ISDS system, leaving its conventions and terminating or renegotiating the trade and investment treaties in which it is found. Yet solitary action leaves such vanguard nations vulnerable to being singled out for both legal retribution and the discipline of the market. Coordinating the timing of unilateral withdrawal, however — through private agreement or via multilateral withdrawal pacts — would help to shield any one country from being singled out for retaliation, while maximizing the impact of the blow to an expiring system. Freed from ISDS’s burden, Southern nations might develop in its stead a new, binding treaty on the behavior of multinational corporations. Such a treaty would invert the broken profit-above-sovereignty logic of the ISDS system, barring the excesses of profit-seeking, enshrining the primacy of sovereign policymaking, and subordinating corporate interests to the long-term wellbeing of people and planet. **A Unified Disarmament Agenda** For the wielding of the South’s collective leverage to advance a global disarmament agenda. No progressive international agenda can thrive in a world dominated by militarization. An inordinate percentage of the world’s scarce resources — human, fiscal, and ecological — are consumed each year in the attempt to keep up in the runaway global arms race that no one can win. Militarization in the South is fueled in turn by the desperate attempt to defend against the overwhelming dominance and unhesitating imperial violence of the global North. The South can, and should, construct within itself a zone of peace; but it cannot disarm unilaterally. Instead, the South can peacefully wield its collective might, at all available pressure points, to advance an agenda of global disarmament. Article 26 of the UN Charter, for instance, mandates the “least diversion for armaments of the world's human and economic resources” and assigns the regulation of armaments as a key responsibility of the UN Security Council. To counter the ongoing arms race, South states elected as non-permanent members of the UN Security Council can unite in placing Article 26 back on the Council's agenda and pressuring permanent members to fulfill their obligations under this article. Achieving the aspirations of global demilitarization is perhaps a distant hope, but it is a hope on which the realization of any true agenda for a more equitable, prosperous, and peaceful world order depends. **Southern Legal Services** For the coordination of legal capacities and legal interventions to uphold, and transform, international law. No nation is above the law — though a common refrain and worthy aspiration, this is not the reality of the international legal system today. While preaching the gospel of rules-based orders, the few, powerful nations of the North, and their clients and allies, violate international law with impunity. As recent events have demonstrated, however, the South can intervene to demand accountability. Rather than ad hoc measures in extreme cases, the South can proactively develop the institutions and capacities to make such legal interventions forceful and systematic. Strengthening ties between legal training institutions to develop human capital and end the reliance on Northern barristers, pooling resources and capacities and coordinating solidaristic legal interventions in cases of infringements of Southern sovereignty, and establishing a permanent multilateral legal force designed to leverage existing fora to hold Northern nations accountable for their flagrant violations of international law — while even these may not eliminate Northern impunity, the united force of the South may yet expose the North’s wanton violations of international law, and exact a measure of much-needed accountability. **Disobedience for Democratization** For the consolidation of Southern voting blocs to demand democratization of multilateral fora. The vast majority of the world’s population are citizens of the South. Yet the institutions that shape our world are dominated by the governments of the North. Despite lofty rhetoric of democratic decision-making and rules-based orders, the rules are ultimately made by the North, for the North. Yet this inequity of voice and vote is exacerbated by Southern divisions. As history has shown, the South can exert its power even in a tilted playing field — but only if it acts as one. From a reinvigoration of existing fora such as the G77 in the UN, to the consolidation of more steadfast voting blocs capable of blocking Northern agendas in institutions such as the IMF, to the development of solidaristic agreements for Southern UN Security Council members to only act on behalf of the consensus of the South, and beyond — if united, Southern nations can not only extract greater outcomes of existing fora of global governance today, but can exert their collective strength to demand the democratization of the institutions themselves. While the interests of the South are not homogenous, all have an interest in developing a global governance that cannot be usurped for the few, but instead represents the needs of the world’s many. **Binding Right to Development** For the ratification of a binding Right to Development treaty that explicitly recognizes and protects the fundamental right to self-determination for all peoples of the world. For decades, nation states of the South have struggled to guarantee the full enjoyment of human rights to their peoples as a result of the conditions of poverty, inequality, and conflict created by colonialism, neocolonialism, foreign domination, territorial aggression, and racial discrimination. First proposed during a summit of the Movement of Non-Aligned countries in 1998 in Durban, South Africa, a binding Right to Development would place obligations on all states to recognize the fundamental right of peoples to self-determination, and individually and collectively, formulate international development policies that promote higher standards of living, full employment, and free and meaningful participation in development. For instance, the duty to cooperate, as defined in the Draft Convention on the Right to Development, would give rise to concrete and implementable obligations that direct states to observe “principles of special and differential treatment for developing countries” to promote non-discriminatory and equitable international trading systems and ‘‘[ensure] enhanced representation and voice for developing countries …in order to deliver more effective, credible, accountable and legitimate institutions.” An enforceable Right to Development treaty today would provide a critical tool for the South to advance its economic and social agenda globally, addressing both historical injustices and contemporary challenges in a legally binding manner with concrete norms and legal protections that empower South nations to demand enhanced power in international economic and financial institutions, permanent sovereignty over natural resources, fairer terms of trade, and international cooperation in service of their sovereign development goals. Nations of the South cannot achieve full sovereignty by asking for power from the North; this power must be demanded and asserted, collectively. **Conclusion** The Havana Group, Recognizingthe emergency that calls us collectively to action, in the combination of accelerating ecological crisis, vanishing developmental prospects, and escalating risk of world war; Reiteratingthe promise of a bold and ambitious Program of Action, with concrete measures to deliver sovereign development and sustain peaceful coexistence; Realizingthe opportunity for its implementation in the present interregnum, with the old international economic order in an advance state of decay and a new order waiting to be built, Calls to: Take the Program Home,transporting its proposals from New York City to every country represented at the Group, and planting their seed in every community we call home; Bring the Program to Life,sustaining the coalition forged in the Congress to implement the coordinated actions that are the precondition to the construction of a new international economic order; Build the Broader Bloc,calling on all nations and peoples to join that coalition and fulfill its shared vision of peace and prosperity; Break the Brandt Line, advancing in unity toward the horizon of true economic liberation, where the domination of the North finally gives way to the dreams of the Sout"}