{"id": 1795, "name": "Renegade Tribune", "domain": "renegadetribune.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://www.renegadetribune.com/well-do-it-ourselves-dutch-vigilantes-stop-cars-at-german-border-in-protest-over-illegal-migration/#comment-362228", "title": "Well Do It Ourselves Dutch Vigilantes Stop Cars At German Border In Protest Over Illegal Migration", "content": "Renegade Tribune Honest, uncensored, and hard-hitting articles Latest Featured SectionsCurrent Events and PoliticsPhilosophy and InsightArt & CultureRace and NationalismReligion and SpiritualityPodcasts and PresentationsVideosHealth & Wellness Current Events and Politics Philosophy and Insight Art & Culture Race and Nationalism Religion and Spirituality Podcasts and Presentations Videos Health & Wellness Current Events and Politics Philosophy and Insight Art & Culture Race and Nationalism Religion and Spirituality Podcasts and Presentations Videos Health & Wellness Support Contact Log In Home Race and Nationalism “We’ll Do It Ourselves!” Dutch Vigilantes Stop Cars At German Border In Protest Over Illegal Migration Race and Nationalism **“We’ll Do It Ourselves!” Dutch Vigilantes Stop Cars At German Border In Protest Over Illegal Migration** Renegade Editor’s Note: Geert Wilders is a kosher shill, but you all know that. A group of Dutch citizens staged an unauthorized border control operation this weekend between Ter Apel and the German village of Rütenbrock, citing frustration with what they describe as uncontrolled illegal immigration. Wearing reflective clothing and wielding torches, the group of around 12 men began stopping vehicles on Saturday evening along the N366, a key route between Germany and the Netherlands. The vigilantes, who pulled cars over and even inspected trunks, say they took action because authorities are failing to secure the border and stem the flow of asylum seekers entering the country.“Nothing is happening. Then we’ll do it ourselves,”said one activist, as cited byAlgemeen Dagblad. The action, although brief, drew sharp criticism from police and government officials. The municipality of Westerwolde and Dutch police released a joint statement declaring that “citizens are forbidden to stop cars” and that such actions “create enormously dangerous situations” and are “really unacceptable.”The vigilantes are believed to have violated road traffic laws, though it is unclear whether any formal charges will be brought. 🇳🇱‼️ Dutch vigilantes fed up with illegal immigration set up their own border controls with Germany this weekend, between Ter Apel and Rütenbrock. Geert Wilders, the PVV leader who just collapsed the Dutch government over asylum red lines, called it a \"fantastic initiative.\"pic.twitter.com/FfjTtkuO6k — Remix News & Views (@RMXnews)June 8, 2025 One vehicle stopped by the group turned out to be a German police van. The officers promptly ordered the group to leave German soil, threatening to tow their vehicles if they did not comply. The activists relocated their checkpoint to a parking lot on the Dutch side of the border and continued stopping traffic from Germany. The group, reportedly organized via Facebook, primarily includes residents from the municipality of Westerwolde. Outgoing Justice and Migration Minister David van Weel, of the center-right VVD, responded by urging the group to stop. “I understand the frustration, but I really call on this group not to do this,” he said. “Let the police and military police do their job and abide by the law.” Van Weel acknowledged the Netherlands “cannot handle the current influx,” but insisted that border enforcement must remain the responsibility of the authorities. Mayor Jaap Velema of Westerwolde expressed sympathy for the frustrations, citing “the lack of solutions to the crisis in asylum reception,” but warned:“This is not the way to express frustrations. We can’t all drive through red lights either.” Geert Wilders, leader of the anti-immigration PVV party,praised the citizens’ actions on X, calling it a “fantastic initiative”and adding, “If [Prime Minister] Schoof and the VVD do not immediately deploy the army en masse for this, we will have to do it ourselves! I would like to participate next time!” Wilders has been vocal about tightening the Dutch asylum regime. His party recently withdrew from the governing coalition after other parties refused to adopt his 10-point plan for what he called “the strictest asylum policy ever.” The cabinet’s collapse triggered early elections, which are scheduled to take place on Oct. 29, 2025. Van Weel reiterated the government’s focus on “stricter asylum laws and better border control.” Wilders, however, responded by accusing him of inaction. “Weakling. You don’t do anything at all. You could have had the army guard the borders now and sent away all asylum seekers on the basis of Article 72 TFEU, just like the Germans do,” he posted on social media. “If people are frustrated, it is because the VVD is completely failing.” Ter Apel is the home of the Netherlands’ largest asylum reception center, where officially around 2,000 asylum seekers are currently housed. In March, residents of Nieuw-Weerdinge, a Dutch town between Ter Apel and the nearest city of Emmen, launched a fundraiser in support of a 51-year-old local man convicted of assaulting an Algerian asylum seeker during an attempted citizen’s arrest. He was found to have confronted an Algerian national from the reception center for allegedly stealing €40 from a delivery van. The town has established its own neighborhood watch app used by concerned residents to ensure anyone acting suspiciously in the area is identified after a surge in crime. Read more here… **Continue Reading** Of course it drew criticism from police. It made them look ‘bad,’ like they aren’t doing their jobs. They certainly aren’t doing them well. Most police are secure in their finances and therefore secure in themselves with “keeping the peace.” People will naturally encounter resistance from the police for trying to fix the genocidal policies with which the state has sabotaged them. Good point.Even though the police don’t generally make a lot of money they want those jobs because it’s a steady paycheck with benefits and not labor intensive.Therefore they are a group that is more ready to go against their innermost beliefs and support the state that employs them. My favorite Dutchman was Radbod King of The Frisians. Race and Nationalism Race and Nationalism Race and Nationalism **Recent Comments** GregonViral Footage Appears To Show Waymo Vehicles Fleeing Los Angeles After Riots Robert FerraraonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ michaelonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ michaelonAlan Dershowitz Pushing for Trump to Pardon Ghislaine Maxwell Aryan SunonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ **Popular This Week** Dave Portnoy Demands Censorship Because Jokes Kill jews Ana Kasparian: “You are not gonna silence my ass by invoking the Holocaust or calling me an antisemite.” ‘Forced Mixing’ Housing Plan To Integrate Migrants Pushed By Sweden’s Social Democrats Otto Ernst Remer Trump To Deploy National Guard In Los Angeles As Anti-ICE Demonstrations Turn Violent You’ve Already Lost the Narrative: A Reply to Rabbi Eric Fusfield Dark Irony: 75th Anniversary Edition Of Orwell’s 1984 Comes With Trigger Warnings Alan Dershowitz Pushing for Trump to Pardon Ghislaine Maxwell The LA Unrest Poses A Pressing National Security Threat To The US Elon Musk: ‘Trump is in the Epstein Files. That is the Real Reason They Have Not Been Made Public’ Philosophy and Insight Current Events and Politics Current Events and Politics Race and Nationalism **Latest Posts** The Origins of the ‘Nazi Palestine Flags’ Photos Viral Footage Appears To Show Waymo Vehicles Fleeing Los Angeles After Riots Green Dominoes Fall: Sunnova Files For Bankruptcy After SunPower’s Collapse DOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ Iran Warns They’ll Strike Israel’s Nuclear Sites If Their Own Are Attacked Legal **Sections** Race and Nationalism Current Events and Politics Religion and Spirituality Philosophy and Insight Art and Culture Videos Podcasts and Presentations Health & Wellness **Recent Comments** GregonViral Footage Appears To Show Waymo Vehicles Fleeing Los Angeles After Riots Robert FerraraonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ michaelonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’ michaelonAlan Dershowitz Pushing for Trump to Pardon Ghislaine Maxwell Aryan SunonDOJ Sues Coffee House for Allegedly ‘Refusing to Serve Jews Coffee’"}