{"id": 711, "name": "Journal of Cheminformatics", "domain": "jcheminf.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jcheminf.biomedcentral.com/articles/10.1186/s13321-020-00448-1", "title": null, "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Submission Guidelines About the Editors Collections Submit manuscript Editorial Open access Published:06 August 2020 **Adoption of the Citation Typing Ontology by theJournal of Cheminformatics** Egon WillighagenORCID:orcid.org/0000-0001-7542-02861 Journal of Cheminformaticsvolume12, Article number:47(2020)Cite this article 3701Accesses 3701Accesses 3701Accesses 3Citations 3Citations 3Citations 36Altmetric 36Altmetric 36Altmetric Metricsdetails Metricsdetails Metricsdetails As authors, we cite literature for many reasons. The reasons are normally positive: it supports a statement we make in our article, the new work extends earlier ideas, or the cited paper outlines a method or a dataset we use. Sometimes, however, we cite an article differently, such as when we disagree with the conclusions from that article. Citations help us find more information about a concept and allow individual journal article to focus on the new content. Furthermore, they position the new work in its historical context and citation analyses can point us to research topics we would otherwise not have thought of [1]. Of course, citations have found additional uses that stem from the idea that articles that are cited a lot may be important. If we assume that all citations to an article are positive, this is a logical conclusion. However, citations are not always positive. We can cite an article because we disagree with the statements. For example, a 2011 paper in Science about the possible inclusion of arsenate ions in DNA has seen mostly disagreeing citations [2]. Then the article is important for a different reason. This was picked up 10 years ago, when Shotton et al. published an ontology that formalizes a hierarchy of reasons: the Citation Typing Ontology (CiTO,purl.org/spar/cito) [3]. This ontology defines a citation as the act of citing some article. That allows one to make statements about the citation, in a machine readable way. Using the CiTO we can say the citation is neutral (cito:citesAsAuthority), positive (cito:confirms), or negative (cito:disagreesWith). The ontology also allows us to indicate reuse of methods and software (cito:usesMethodIn) and data (cito:usesDataFrom). This, of course, is closely related to recent efforts in data citation [4] and software citation [5]. The adoption of the CiTO, however, has so far not been wide in publishing. CiteULike [6] was one of the first tools that had support [7]. It allowed users to create citations with CiTO typing (see Fig.1). Screenshot of CiteUlike showing the citation between two articles and that the reason is that the citing article uses the method proposed in the cite article (cito:usesMethodIn) **Adopting the CiTO** If the past 10 years has shown anything, it is that the activity of scholarly communication via journal articles is not easily changed. Whether it is widespread adoption of data repository, minimal reporting standards, or freely sharing citations, the interest may be there, but the uptake is slow. The OpenCitations project [8,9] and Initiative for Open Citations [10] show how hard it is to change the momentum. And while CiteULike introduced support for the CiTO, other references managers have not (yet). A chicken-and-egg situation may be an underlying issue: if there are no providers of CiTO annotation, why should tools that work with citations use it? And at the same time, if there is no use of it, why invest effort to provide such annotation. However, theJournal of Cheminformaticsconsiders adoption important. For example, we may want to learn what articles are using a method proposed in some article. We may want to see how data is reused, or we may want to get warned that we are citing an article that has been refuted repeatedly. Therefore, we are starting a pilot to roll out CiTO annotation in theJournal of Cheminformatics. We take advantage here of the ability to add notes tofull form(see [3]) references in bibliographies. These are referred to asbibnotes. The content of the note will be strictly formatted: it will use the syntax[cito:usesMethodIn]and formatted in bold. That is, the bibnote starts with the[character, followed by one of the CiTO types, and ending with the]character. If you wish to provide more than one annotation, you can repeat this syntax, separated by one or more spaces, for example:[cito:usesMethodIn][cito:citeAsAuthority]. By using this specific syntax, we introduce a level of machine readability such that this annotation can be extracted with text mining approaches and used by downstream citation projects. These bibnotes can be used to overwrite the defaultcito:cites. We currently encourage authors interested in participating in this pilot to use the following CiTO types:cito:citesAsDataSourcewhen you use data in your paper from the cited source,cito:usesMethodInwhen you use a method from the cites source,cito:citesAsAuthorityfor articles that you cite as authorative works in the field,cito:discusseswhen you discuss the content of the cited article, andcito:extendswhen your article describes a new release of software or database described in the cited article. However, you are free to use any of the other CiTO types, includingcito:agreesWithandcito:disagreesWith. We also plan to adopt this approach for comments (cito:repliesTo) and errata/corrigenda/corrections (cito:updates). These annotations will be handled at an editorial level. With this pilot we hope to trigger further adoption of approaches like CiTO. We plan to use this information in WikiCite [11] and Scholia [12] to demonstrate downstream use, but hope that projects like OpenCitations and SciGraph (www.springernature.com/gp/researchers/scigraph) will pick it up too. During the pilot, we will also develop practical guidance on how to use reference managers and type setting tools like Microsoft Word and LaTeX can be used to add these annotations. Let this be the egg or chicken (depending on your philosophy), we are looking to innovate how we cite our literature. **References** Agarwal P, Searls DB (2009) Can literature analysis identify innovation drivers in drug discovery? Nat Rev Drug Discov. 8(11):865–878.https://doi.org/10.1038/NRD2973ArticlePubMedPubMed CentralCASGoogle Scholar Agarwal P, Searls DB (2009) Can literature analysis identify innovation drivers in drug discovery? Nat Rev Drug Discov. 8(11):865–878.https://doi.org/10.1038/NRD2973 ArticlePubMedPubMed CentralCASGoogle Scholar Agarwal P, Searls DB (2009) Can literature analysis identify innovation drivers in drug discovery? Nat Rev Drug Discov. 8(11):865–878.https://doi.org/10.1038/NRD2973 ArticlePubMedPubMed CentralCASGoogle Scholar Wolfe-Simon F, Blum JS, Kulp TR, Gordon GW, Hoeft SE, Pett-Ridge J et al (2010) A bacterium that can grow by using arsenic instead of phosphorus. Science 332(6034):1163–1166.https://doi.org/10.1126/SCIENCE.1197258ArticlePubMedGoogle Scholar Wolfe-Simon F, Blum JS, Kulp TR, Gordon GW, Hoeft SE, Pett-Ridge J et al (2010) A bacterium that can grow by using arsenic instead of phosphorus. Science 332(6034):1163–1166.https://doi.org/10.1126/SCIENCE.1197258 ArticlePubMedGoogle Scholar Wolfe-Simon F, Blum JS, Kulp TR, Gordon GW, Hoeft SE, Pett-Ridge J et al (2010) A bacterium that can grow by using arsenic instead of phosphorus. Science 332(6034):1163–1166.https://doi.org/10.1126/SCIENCE.1197258 ArticlePubMedGoogle Scholar Peroni S, Shotton D (2012) FaBiO and CiTO: ontologies for describing bibliographic resources and citations. J Web Semantics. 17:33–43.https://doi.org/10.1016/j.websem.2012.08.001[cito:usesMethodIn]ArticleGoogle Scholar Peroni S, Shotton D (2012) FaBiO and CiTO: ontologies for describing bibliographic resources and citations. J Web Semantics. 17:33–43.https://doi.org/10.1016/j.websem.2012.08.001[cito:usesMethodIn] ArticleGoogle Scholar Peroni S, Shotton D (2012) FaBiO and CiTO: ontologies for describing bibliographic resources and citations. J Web Semantics. 17:33–43.https://doi.org/10.1016/j.websem.2012.08.001[cito:usesMethodIn] ArticleGoogle Scholar Brase J (2009) DataCite-A Global Registration Agency for Research Data.https://doi.org/10.1109/coinfo.2009.66 Brase J (2009) DataCite-A Global Registration Agency for Research Data.https://doi.org/10.1109/coinfo.2009.66 Brase J (2009) DataCite-A Global Registration Agency for Research Data.https://doi.org/10.1109/coinfo.2009.66 Smith AM, Katz DS, Niemeyer KE, Group FSCW (2016) Software citation principles. Peroni S, editor. PeerJ Comput Sci. 2:e86.https://doi.org/10.7717/peerj-cs.86 Smith AM, Katz DS, Niemeyer KE, Group FSCW (2016) Software citation principles. Peroni S, editor. PeerJ Comput Sci. 2:e86.https://doi.org/10.7717/peerj-cs.86 Smith AM, Katz DS, Niemeyer KE, Group FSCW (2016) Software citation principles. Peroni S, editor. PeerJ Comput Sci. 2:e86.https://doi.org/10.7717/peerj-cs.86 McMullen A (2010) CiteULike. Public Services Q. 6(4):368–369.https://doi.org/10.1080/15228951003772595[cito:citesAsAuthority]ArticleGoogle Scholar McMullen A (2010) CiteULike. Public Services Q. 6(4):368–369.https://doi.org/10.1080/15228951003772595[cito:citesAsAuthority] ArticleGoogle Scholar McMullen A (2010) CiteULike. Public Services Q. 6(4):368–369.https://doi.org/10.1080/15228951003772595[cito:citesAsAuthority] ArticleGoogle Scholar Willighagen EL, CiTO/CiteULike: publishing innovation, 2012, chem-bla-ics,https://chem-bla-ics.blogspot.com/2012/02/cito-citeulike-publishing-innovation.html Willighagen EL, CiTO/CiteULike: publishing innovation, 2012, chem-bla-ics,https://chem-bla-ics.blogspot.com/2012/02/cito-citeulike-publishing-innovation.html Willighagen EL, CiTO/CiteULike: publishing innovation, 2012, chem-bla-ics,https://chem-bla-ics.blogspot.com/2012/02/cito-citeulike-publishing-innovation.html Shotton D (2013) Publishing: open citations. Nature 502(7471):295–297.https://doi.org/10.1038/502295AArticlePubMedGoogle Scholar Shotton D (2013) Publishing: open citations. Nature 502(7471):295–297.https://doi.org/10.1038/502295A ArticlePubMedGoogle Scholar Shotton D (2013) Publishing: open citations. Nature 502(7471):295–297.https://doi.org/10.1038/502295A ArticlePubMedGoogle Scholar Peroni S, Shotton D (2020) OpenCitations, an infrastructure organization for open scholarship. Quantitative Sci Stud. 1(1):428–444.https://doi.org/10.1162/qss_a_00023[cito:citesAsAuthority]ArticleGoogle Scholar Peroni S, Shotton D (2020) OpenCitations, an infrastructure organization for open scholarship. Quantitative Sci Stud. 1(1):428–444.https://doi.org/10.1162/qss_a_00023[cito:citesAsAuthority] ArticleGoogle Scholar Peroni S, Shotton D (2020) OpenCitations, an infrastructure organization for open scholarship. Quantitative Sci Stud. 1(1):428–444.https://doi.org/10.1162/qss_a_00023[cito:citesAsAuthority] ArticleGoogle Scholar Schiermeier Q (2017) Initiative aims to break science’s citation paywall. Nature.https://doi.org/10.1038/nature.2017.21800[cito:citesForInformation]ArticlePubMedGoogle Scholar Schiermeier Q (2017) Initiative aims to break science’s citation paywall. Nature.https://doi.org/10.1038/nature.2017.21800[cito:citesForInformation] ArticlePubMedGoogle Scholar Schiermeier Q (2017) Initiative aims to break science’s citation paywall. Nature.https://doi.org/10.1038/nature.2017.21800[cito:citesForInformation] ArticlePubMedGoogle Scholar Taraborelli D, Dugan JM, Pintscher L, Mietchen D, Neylon C. WikiCite 2016 Report. Wikimedia Commons. 2016.https://doi.org/10.6084/m9.figshare.4042530 Taraborelli D, Dugan JM, Pintscher L, Mietchen D, Neylon C. WikiCite 2016 Report. Wikimedia Commons. 2016.https://doi.org/10.6084/m9.figshare.4042530 Taraborelli D, Dugan JM, Pintscher L, Mietchen D, Neylon C. WikiCite 2016 Report. Wikimedia Commons. 2016.https://doi.org/10.6084/m9.figshare.4042530 Nielsen FÅ, Mietchen D, Willighagen E (2017) Scholia, Scientometrics and Wikidata. The semantic web: ESWC 2017 satellite events. Springer, Berlin, pp 237–259.https://doi.org/10.1007/978-3-319-70407-4_36[cito:citesAsAuthority]BookGoogle Scholar Nielsen FÅ, Mietchen D, Willighagen E (2017) Scholia, Scientometrics and Wikidata. The semantic web: ESWC 2017 satellite events. Springer, Berlin, pp 237–259.https://doi.org/10.1007/978-3-319-70407-4_36[cito:citesAsAuthority] BookGoogle Scholar Nielsen FÅ, Mietchen D, Willighagen E (2017) Scholia, Scientometrics and Wikidata. The semantic web: ESWC 2017 satellite events. Springer, Berlin, pp 237–259.https://doi.org/10.1007/978-3-319-70407-4_36[cito:citesAsAuthority] BookGoogle Scholar Download references **Acknowledgements** Thanks to Emma Schymanski, Rajarshi Guha, Nina Jeliazkova, Matthew Smyllie, and Silvio Peroni for feedback. **Author information** **Authors and Affiliations** Dept of Bioinformatics-BiGCaT, NUTRIM, Maastricht University, Universiteitssingel 50, 6229 ER, Maastricht, The NetherlandsEgon Willighagen Dept of Bioinformatics-BiGCaT, NUTRIM, Maastricht University, Universiteitssingel 50, 6229 ER, Maastricht, The Netherlands Egon Willighagen Dept of Bioinformatics-BiGCaT, NUTRIM, Maastricht University, Universiteitssingel 50, 6229 ER, Maastricht, The Netherlands Egon Willighagen Egon WillighagenView author publicationsYou can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar **Contributions** The author read and approved the final manuscript. **Corresponding author** Correspondence toEgon Willighagen. **Ethics declarations** **Competing inretests** The author declares that he has no competing interests **Additional information** **Publisher's Note** Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. **Rights and permissions** Open AccessThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visithttp://creativecommons.org/licenses/by/4.0/. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated in a credit line to the data. Reprints and permissions **About this article** **Cite this article** Willighagen, E. Adoption of the Citation Typing Ontology by theJournal of Cheminformatics.J Cheminform12, 47 (2020). https://doi.org/10.1186/s13321-020-00448-1 Download citation Received:29 June 2020 Received:29 June 2020 Received:29 June 2020 Accepted:30 June 2020 Accepted:30 June 2020 Accepted:30 June 2020 Published:06 August 2020 Published:06 August 2020 Published:06 August 2020 DOI:https://doi.org/10.1186/s13321-020-00448-1 DOI:https://doi.org/10.1186/s13321-020-00448-1 DOI:https://doi.org/10.1186/s13321-020-00448-1 **Share this article** Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article. Provided by the Springer Nature SharedIt content-sharing initiative **Associated content** Collection **Citation Typing Ontology (CiTO) Pilot** Advertisement ISSN: 1758-2946 Submission enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}