{"id": 775, "name": "KRDO - Colorado Springs News", "domain": "krdo.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://krdo.com/stacker-entertainment/2025/06/06/how-the-billionaire-lifestyle-at-a-park-city-utah-mansion-fueled-a-new-movie-by-the-creator-of-succession/", "title": "How The Billionaire Lifestyle At A Park City Utah Mansion Fueled A New Movie By The Creator Of Succession", "content": "NewsColorado Springs NewsPueblo NewsAbsolutely Colorado13 InvestigatesOn the LookoutHigh Country AdventuresDigital ExclusivesColoradoCrimeMilitaryUS/WorldPolitics Colorado Springs News Pueblo News Absolutely Colorado 13 Investigates On the Lookout High Country Adventures Digital Exclusives Colorado Crime Military US/World Politics Colorado Springs News Pueblo News Absolutely Colorado 13 Investigates On the Lookout High Country Adventures Digital Exclusives Colorado Crime Military US/World Politics 13 InvestigatesRestaurant RoundupBody of LiesFuneral Home InvestigationIdentity Crisis: Olympic City USAClub Q: One Year LaterIllicit Spas: Hiding In Plain SightBlack Forest Fire: 10 Years LaterWaldo’s Inferno: 10 Years Later Restaurant Roundup Body of Lies Funeral Home Investigation Identity Crisis: Olympic City USA Club Q: One Year Later Illicit Spas: Hiding In Plain Sight Black Forest Fire: 10 Years Later Waldo’s Inferno: 10 Years Later Restaurant Roundup Body of Lies Funeral Home Investigation Identity Crisis: Olympic City USA Club Q: One Year Later Illicit Spas: Hiding In Plain Sight Black Forest Fire: 10 Years Later Waldo’s Inferno: 10 Years Later What’s Up In The 719! School Buzz WeatherClosures & DelaysWeather Maps and ForecastsSchool Visits with ChevyLive HD DopplerNeighborhood Weather NetworkViaero Wireless Network CamerasWeather VideoSki ReportWeather Photo Galleries Closures & Delays Weather Maps and Forecasts School Visits with Chevy Live HD Doppler Neighborhood Weather Network Viaero Wireless Network Cameras Weather Video Ski Report Weather Photo Galleries Closures & Delays Weather Maps and Forecasts School Visits with Chevy Live HD Doppler Neighborhood Weather Network Viaero Wireless Network Cameras Weather Video Ski Report Weather Photo Galleries SportsFriday Night Blitz Friday Night Blitz Friday Night Blitz LivestreamsLive NewscastsLivestream Special Coverage Live Newscasts Livestream Special Coverage Live Newscasts Livestream Special Coverage Telemundo Sur ColoradoTelemundoTelemundo ProgramacionTu Salud Telemundo Telemundo Programacion Tu Salud Telemundo Telemundo Programacion Tu Salud RadioKRDO NewsRadio TrafficWeather Maps and ForecastsListen LiveRadio Program GuidePodcastsRadio ContestsPet of the Week KRDO NewsRadio Traffic Weather Maps and Forecasts Listen Live Radio Program Guide Podcasts Radio Contests Pet of the Week KRDO NewsRadio Traffic Weather Maps and Forecasts Listen Live Radio Program Guide Podcasts Radio Contests Pet of the Week Road Warrior Patriot Perks TrafficTraffic TrackerGas Prices Traffic Tracker Gas Prices Traffic Tracker Gas Prices HealthHealthy ColoradoBreast Cancer Awareness Healthy Colorado Breast Cancer Awareness Healthy Colorado Breast Cancer Awareness Colorado LivingCooking TipsNext ChapterThe Military FamilyEventsCalendarYour House & HomeSki ReportSouthern Colorado JobsWear Red Friday’s Cooking Tips Next Chapter The Military Family Events Calendar Your House & Home Ski Report Southern Colorado Jobs Wear Red Friday’s Cooking Tips Next Chapter The Military Family Events Calendar Your House & Home Ski Report Southern Colorado Jobs Wear Red Friday’s ContestsBroadcast ContestsRadio ContestsEntertainment Broadcast Contests Radio Contests Entertainment Broadcast Contests Radio Contests Entertainment Share About UsAdvertise with UsContact KRDOMeet the TeamCareersClosed CaptioningDownload our AppsEEO Public FilingFCC Public FileNewsletters/AlertsRadio Program GuideTV Listings Advertise with Us Contact KRDO Meet the Team Careers Closed Captioning Download our Apps EEO Public Filing FCC Public File Newsletters/Alerts Radio Program Guide TV Listings Advertise with Us Contact KRDO Meet the Team Careers Closed Captioning Download our Apps EEO Public Filing FCC Public File Newsletters/Alerts Radio Program Guide TV Listings News Weather Sports Road Warrior Health Radio Telemundo Contests Share **Today’s Forecast** **Better Chance For Severe Weather Arrives Thursday** **GET ALERTS TO YOUR INBOX** **How the ‘billionaire lifestyle’ at a Park City, Utah, mansion fueled a new movie by the creator of ‘Succession’** **How the ‘billionaire lifestyle’ at a Park City, Utah, mansion fueled a new movie by the creator of ‘Succession’** The old saying in real estate — that the three most important things are “location, location, location” — also applies to making movies, as evident in the new film, “Mountainhead,” shot this spring near Park City, Utah. The dark comedy — which debuts Saturday evening on HBO (at 6 or 9 p.m. Mountain time, depending on your provider) and starts streaming Saturday at 1:01 a.m. Mountain time onMax (soon to be rebranded, again, as HBO Max)— centers on four tech moguls, three multibillionaires and their half-billionaire host, during what’s supposed to be a luxurious guys’ weekend in the Utah mountains. The fun stops when news comes in of global riots and turmoil, all blamed on misinformation generated by new social media tools just released on a platform owned by the richest of the four men (Cory Michael Smith). Smith’s character, Venis (pronounced “Venice”), tries to minimize his responsibility, all while trying to talk his friend-rival, Jeff (Ramy Youssef), into selling his new A.I. system, which Jeff says is less prone to spewing lies and fascism. The group’s elder statesman, Randall (Steve Carell), muses about how they can leverage the impending apocalypse to take over a few countries, while the house’s less-rich owner, Souper (Jason Schwartzman), pitches a meditation app — as if it can help fend off the toxicity boiling out of everyone’s smartphones. If the story feels close to current events, that’s because writer-director Jesse Armstrong worked on a fast schedule. The “Succession” creator wrote the script for his first feature film in January and February, then filming happened over five weeks, mostly in March. The movie’s release date, Saturday, isthe last day of eligibilityfor this year’s Emmy Awards. Central to the movie is Souper’s house, named Mountainhead. The house sits at 3566 W. Crestwood Court, in the gated Deer Crest neighborhood on the northeast side of Deer Valley in Wasatch County.It made news last fallwhen it was listed at $65 million — then considered a record for a single-family home in Utah. At 21,000 square feet, the house boasts an NBA-regulation basketball court, a two-lane bowling alley and a two-story climbing wall, all of which are deployed in the movie. What’s not in the movie is one of the house’s signature amenities: a private ski gondola. In interviews last week, Schwartzman and Smith each said “the house is a character” in the movie. They, along with Carell and Youssef, remarked on how it added to Armstrong’s examination of the super-rich — a subject that fueled “Succession” over four Emmy-winning seasons. The Salt Lake Tribune interviewed the actors over Zoom — Carell and Schwartzman in one session, and Youssef and Smith in another. Their comments have been lightly edited for clarity. **What makes Park City a good place to ride out the apocalypse?** Smith:Park City is adorable, and these people are not. It was nice to be in a cute, charming, sweet place. Carell:I love it there. I’ve been going up there for years. My kids learned to ski up there. It was icing on the cake, in terms of doing this movie, that we got to shoot there. It’s beautiful, it’s serene. It’s the best skiing I’ve ever had in my life. The people are kind and nice. … If I could film everything in Park City, I would. Youssef:The sheer altitude, right? The whole thing is an allegory. I think about how many of us are in the comfort of our homes and watching suffering happening on our phones. And these guys are in a home that is at a much higher altitude, and the stakes of that suffering are much higher, because they’re actually directly responsible for it. So there was something about that luxe isolationism that was really symbolic. **What was your impression when you first walked into that house?** Schwartzman:The first thing I thought when I walked into the house was, “Which is the first floor?” Because there’s not just one front door. There’s many different doors. So I was always disoriented. Most houses have the main part. There were so many main parts. Youssef:It was just, “Whoa. This is crazy.” A few questionable design choices. Smith:There’s nowhere for art to be hung — well, that’s not true, but there aren’t many. It’s like everything is textured in material, which is just really a fascinating way to design. … I think 60% of the house is built for recreational areas. You don’t need to leave. If you want to play basketball, you can play basketball on your full court downstairs. Or if you want to go rock climbing, you can go rock climbing on your wall. Or bowling, pingpong, shuffleboard. Youssef:It is so nestled in nature, despite being this incredibly man-made structure. It’s the most man-made house I’ve ever been in, in terms of just the sheer opulence. But then it’s nestled right in the heart of nature. So that juxtaposition was cool. Schwartzman:It’s so funny, that in the beginning we walked in and were like, “Whoa, mama mia!” Steve even said, “No one’s going to think this is a real place that we’re shooting in, because this house and that view are so perfect, people are going to think it’s fake.” … We left the house for a few days and shot at Snowbird. It’s funny, we came back and I was, like, “Ah, home.” Carell:We acclimated very quickly. We could very easily embrace the billionaire lifestyle. **Did the house help you get into character?** Carell:My character is very passé about all of it. Seen bigger, seen better. None of the trappings mean anything, really, to any of these guys, except maybe [Schwartzman’s] character. Material things just have no meaning, the nice cars or whatever. They’re so far beyond that, their lives aren’t even about that. That’s just incidental. Smith:Jesse [Armstrong] said this early on: “When you walk in, there’s nothing impressive about this.” As the wealthiest man in the world, you’re just constantly in impressive environments, so you’re numb to being wowed by a $65 million overpriced piece of real estate, because it’s on a mountain with its own private ski lift. Like it’s cool, convenient, fun. But it’s not an amazing house. [When Armstrong said] that to me early on, when I was walking in, I was, like, “Oh, that’s just really helpful.” Just for a person to have lost all sense of awe over really extraordinary things. Carell:It [has this] vastness, and there’s a solitary nature to that house, too. You feel like you’re away from everything in that house. It is your own world, right there. As the story progresses, and they become more and more isolated from the rest of the world, you really feel like this is their bunker, in a way. Schwartzman:It has a feeling like it’s the only home there, at the top of the mountain. It has an unobstructed view, which I always found haunting in the movie. You just see the emptiness, and when we cut outside and you see the camera coming in, there’s like this creeping feeling. When we read the script, the whole thing was in this house. And when they showed us the photos of the house, I was, like, “There it is. That’s done.” If it wasn’t that house, it wouldn’t have been this movie. Carell:It benefited the story and the shooting, because there were so many different places to film in the house. Different vibes, different rooms, for different types of scenes. Schwartzman:That spiral staircase that goes from floor 1 to 7 in a straight shot — it just became a weird physical metaphor of the movie for me. Kind of a downward spiral. That shape is the movie to me. This storywas produced byThe Salt Lake Tribuneand reviewed and distributed byStacker. Jump to comments ↓ **Stacker** **Related Articles** **Movies and TV shows casting across the US** **Movies and TV shows casting across the US** **Movies and TV shows casting across the US** **8 most popular online casino card games** KRDO NewsChannel 13 is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here If you would like to share a story idea, please submit ithere. Terms of Service|Privacy Policy|Community Guidelines|KRDO Jobs|FCC Applications| KRDO FCC Public File|KRDO FCC Applications |Do Not Sell My Personal Information |Contest Rules **Subscribe to our Email Alerts** Breaking NewsSevere WeatherMorning ForecastDaily BriefingContests & Promotions **Download Our Apps**"}