{"id": 38, "name": "WFTS - Tampa News", "domain": "abcactionnews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.abcactionnews.com/news/region-sarasota-manatee/mother-voices-concern-after-arrest-of-manatee-county-teacher-accused-of-inappropriate-contact-with-student", "title": "Mother Voices Concern After Arrest Of Manatee County Teacher Accused Of Inappropriate Contact With Student", "content": "Menu ABC Action News Gives VideoLatest VideoWatch ABC Action News+ABC Action Weather 24/7Full Circle Florida Latest Video Watch ABC Action News+ ABC Action Weather 24/7 Full Circle Florida Latest Video Watch ABC Action News+ ABC Action Weather 24/7 Full Circle Florida NewsLocal NewsI-Team InvestigationsPrice of ParadiseFlorida NewsNational NewsNews LinksIn Your CommunityFull Circle FloridaABC Action News Anchors ReportYour Voice Local News I-Team Investigations Price of Paradise Florida News National News News Links In Your Community Full Circle Florida ABC Action News Anchors Report Your Voice Local News I-Team Investigations Price of Paradise Florida News National News News Links In Your Community Full Circle Florida ABC Action News Anchors Report Your Voice I-Team InvestigationsPatient No More Patient No More Patient No More WeatherABC Action Weather 24/7RadarSevere Weather AlertsDaily ForecastHourly ForecastMaps & ForecastsTracking the Tropics ABC Action Weather 24/7 Radar Severe Weather Alerts Daily Forecast Hourly Forecast Maps & Forecasts Tracking the Tropics ABC Action Weather 24/7 Radar Severe Weather Alerts Daily Forecast Hourly Forecast Maps & Forecasts Tracking the Tropics Tracking the Tropics Traffic SportsLightningRaysBuccaneersUSF Lightning Rays Buccaneers USF Lightning Rays Buccaneers USF Pride Month LifestyleThings To DoAt Home with Shay Things To Do At Home with Shay Things To Do At Home with Shay Mental Health Tampa Bay's Morning Blend Tampa Bay's Operation Honoring Heroes Florida Lottery MarketplaceDon't Waste Your MoneyYour Health MattersWFTS Tampa Bay's Home ProsReal Estate EssentialsBest of BayCare Don't Waste Your Money Your Health Matters WFTS Tampa Bay's Home Pros Real Estate Essentials Best of BayCare Don't Waste Your Money Your Health Matters WFTS Tampa Bay's Home Pros Real Estate Essentials Best of BayCare About UsWhat's on TVMeet the ABC Action News TeamContactAppsWFTS SweepstakesFresh StartAdvertise with UsSupportJobs at WFTS What's on TV Meet the ABC Action News Team Contact Apps WFTS Sweepstakes Fresh Start Advertise with Us Support Jobs at WFTS What's on TV Meet the ABC Action News Team Contact Apps WFTS Sweepstakes Fresh Start Advertise with Us Support Jobs at WFTS Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Hillsborough Pinellas Polk Pasco Manatee Sarasota Hernando Citrus DeSoto Highlands Hardee **Actions** Facebook Tweet Email **Mother expressed concern over teacher accused of inappropriate contact with a student** BRADENTON, Fla. — A mother voiced her frustration and concern at a Manatee County School Board meeting on June 10 over the handling of a situation at a local school after the arrest of a teacher. “I think the community is outraged,” mother Beverly Hernandez told ABC Action News. **Watch full report from Mary O'Connell** According to the Manatee County Sheriff’s Office, on March 3, a school resource deputy learned from a student at Haile Middle School in Bradenton that one of his teachers, 28-year-old Oliver Fell, had been communicating with him through Snapchat since December. The Sheriff’s Office said the 14-year-old student reported that the teacher sent him an explicit photo. The Sheriff’s Office said school administration was informed of the allegations, and detectives started an investigation. According to the Sheriff’s Office, after obtaining a search warrant and getting permission to access data from phones and social media accounts, detectives discovered evidence indicating that the communications led to lewd conduct involving the victim. “My son bravely and with great courage reported this horrific abuse to the school administration,” Hernandez said during public comment at Tuesday’s meeting. “He was not met with protection, support, or compassion. He was called a liar by the principal at Haile Middle School and met with a severe punishment of a 10-day suspension.” District leaders said they can’t comment on student disciplinary issues because they’re private and protected under the Family Educational Rights and Privacy Act (FERPA). The Sheriff’s Office said on May 12, detectives received more evidence to strengthen the case. The school district said Fell was reassigned on May 14 to a position without contact with students. Last week, Fell was arrested and charged with lewd contact with a student by an authority figure, a second-degree felony, and transmission of harmful material to a minor, a third-degree felony. “We take this very seriously,” said Interim Superintendent Kevin Chapman. ABC Action News received the message sent from the school’s principal to parents last week, which read in part: “It took several weeks of investigation to confirm the allegations of the illegal communications. Once law enforcement had sufficient confirmation, our school and district were informed and Ms. Fell was immediately reassigned to a position away from our school where she had no contact with students.” On Tuesday, the school board voted unanimously to fire the teacher. “If you have a problem working in our district and you don’t know where that line ends and begins with a student, you don’t need to be in our classroom, period,” said School Board Member Cindy Spray. The school district reiterated in a statement to ABC Action News that student safety is the highest priority. “I really recommend that parents have those uncomfortable conversations with their kids early on because if I hadn’t, he probably wouldn’t have spoken up, and he does know right from wrong, and so I’m glad he did, and I’m just here to support him,” Hernandez said. The School District of Manatee County shared the following statement on Tuesday:\"The School Board of Manatee County voted unanimously today to terminate Haile Middle School ESE Teacher Oliver Fell. Ms. Fell was arrested and charged on Tuesday, June 3, 2025, with lewd contact with a student by an authority figure, a second-degree felony, and transmission of harmful material to a minor, a third-degree felony. The highest priority of the School District of Manatee County is student safety. While we do not typically comment on matters which are still under investigation by law enforcement, the details of this case, as described in the Manatee County Sheriff’s Office Press Release on June 3rd, are alarming and contemptible for anyone serving as a school teacher. The District and school have been and will continue to fully cooperate with law enforcement throughout this active investigation. The district is also cooperating with the Florida Department of Education regarding appropriate state action toward the teacher’s future certificate status.\" Pasco County woman trying to rebuild mobile home after hurricanes \"I cried, of course, because I've worked very hard getting it nice, which has been difficult for me since I lost my husband and being alone,” Kelly Welty said.Welty's mobile home lost its roof during Hurricane Milton. She said it was the only one in the Buena Vista community to get totaled by a tornado. More Sarasota and Manatee County News from ABC Action News Woman arrested for torching boyfriend's car in Bradenton: BPDKiley Vaughan **Woman arrested for torching boyfriend's car in Bradenton: BPD** Kiley Vaughan **Woman arrested for torching boyfriend's car in Bradenton: BPD** Kiley Vaughan **Woman arrested for torching boyfriend's car in Bradenton: BPD** Kiley Vaughan Sarasota family demands return of daughter held by ICEAnnette Gutierrez **Sarasota family demands return of daughter held by ICE** Annette Gutierrez **Sarasota family demands return of daughter held by ICE** Annette Gutierrez **Sarasota family demands return of daughter held by ICE** Annette Gutierrez Sarasota woman's family says she was sent to ICE detention center in TexasRebekah Nelson **Sarasota woman's family says she was sent to ICE detention center in Texas** Rebekah Nelson **Sarasota woman's family says she was sent to ICE detention center in Texas** Rebekah Nelson **Sarasota woman's family says she was sent to ICE detention center in Texas** Rebekah Nelson 19-year-old with mental limitations located after going to Walmart in BradentonAmanda Boettcher **19-year-old with mental limitations located after going to Walmart in Bradenton** Amanda Boettcher **19-year-old with mental limitations located after going to Walmart in Bradenton** Amanda Boettcher **19-year-old with mental limitations located after going to Walmart in Bradenton** Amanda Boettcher Report a typo **Sign up for theMorning Headlines Newsletterand receive up to date information.** **now signed up to receive theMorning Headlines Newsletter.** About Us **FREE Local News & Weather on Your Phone or Streaming TV. Click Here.** About Us **FREE Local News & Weather on Your Phone or Streaming TV. Click Here.** News Video Good Morning Tampa Bay Driving Tampa Bay Forward Taking Action for You Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact FCC Application tampabaynews abc_action_news abcactionnews/ abcactionnews"}