{"id": 1540, "name": "Voice of San Diego", "domain": "voiceofsandiego.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://voiceofsandiego.org/2025/04/11/sacramento-report-how-san-diego-is-coping-with-trumps-slash-and-burn-strategy-for-climate-funding/", "title": "Sacramento Report How San Diego Is Coping With Trumps Slash And Burn Strategy For Climate Funding", "content": "🛍️Shop VOSD 👤Sign In 👤My Account DONATE All StoriesOpen dropdown menuAll Recent StoriesEducationPoliticsSouth CountyGovernmentOpinionSong of the WeekHomelessnessNorth CountySacramento ReportBorderElectionsEnvironment All Recent Stories Education Politics South County Government Opinion Song of the Week Homelessness North County Sacramento Report Border Elections Environment All Recent Stories Education Politics South County Government Opinion Song of the Week Homelessness North County Sacramento Report Border Elections Environment ProjectsOpen dropdown menu20 Years of Impactful JournalismSchools GuideSan Diego Is Less BluePublic MattersPolitifest 2024: News and MediaBeef WeekProgress ReportStadium Concession InvestigationSan Diego 101Military SuicidesSan Diego’s Cost-of-Living CrisisTijuana River 20 Years of Impactful Journalism Schools Guide San Diego Is Less Blue Public Matters Politifest 2024: News and Media Beef Week Progress Report Stadium Concession Investigation San Diego 101 Military Suicides San Diego’s Cost-of-Living Crisis Tijuana River 20 Years of Impactful Journalism Schools Guide San Diego Is Less Blue Public Matters Politifest 2024: News and Media Beef Week Progress Report Stadium Concession Investigation San Diego 101 Military Suicides San Diego’s Cost-of-Living Crisis Tijuana River NewslettersOpen dropdown menuNewsletter HubNot Getting Our Emails? Newsletter Hub Not Getting Our Emails? Newsletter Hub Not Getting Our Emails? PodcastsOpen dropdown menuVOSD PodcastSan Diego 101 PodcastVOSD Podcast Network VOSD Podcast San Diego 101 Podcast VOSD Podcast Network VOSD Podcast San Diego 101 Podcast VOSD Podcast Network EventsOpen dropdown menuAll EventsPolitifest 2025Brews & News All Events Politifest 2025 Brews & News All Events Politifest 2025 Brews & News Support UsOpen dropdown menuWays to GiveMembershipPlanned GivingMember HubVehicle DonationCommunity Partners Ways to Give Membership Planned Giving Member Hub Vehicle Donation Community Partners Ways to Give Membership Planned Giving Member Hub Vehicle Donation Community Partners About UsOpen dropdown menuOur Story and MissionOur TeamWhat We Stand ForNewsroom DiversityBoard of DirectorsOur SupportersCareersOur Interns Our Story and Mission Our Team What We Stand For Newsroom Diversity Board of Directors Our Supporters Careers Our Interns Our Story and Mission Our Team What We Stand For Newsroom Diversity Board of Directors Our Supporters Careers Our Interns Contact UsOpen dropdown menuHelp Page and FAQ’sContact UsContent Sharing PolicySubmit a CommentarySubmit a News TipPrivacy Policy Help Page and FAQ’s Contact Us Content Sharing Policy Submit a Commentary Submit a News Tip Privacy Policy Help Page and FAQ’s Contact Us Content Sharing Policy Submit a Commentary Submit a News Tip Privacy Policy Twitter Facebook Instagram YouTube Bluesky Twitter Facebook Instagram YouTube Bluesky Voice of San Diego Investigative journalism for a better San Diego 🛍️Shop VOSD 👤Sign In 👤My Account DONATE All StoriesOpen dropdown menuAll Recent StoriesEducationPoliticsSouth CountyGovernmentOpinionSong of the WeekHomelessnessNorth CountySacramento ReportBorderElectionsEnvironment All Recent Stories Education Politics South County Government Opinion Song of the Week Homelessness North County Sacramento Report Border Elections Environment All Recent Stories Education Politics South County Government Opinion Song of the Week Homelessness North County Sacramento Report Border Elections Environment ProjectsOpen dropdown menu20 Years of Impactful JournalismSchools GuideSan Diego Is Less BluePublic MattersPolitifest 2024: News and MediaBeef WeekProgress ReportStadium Concession InvestigationSan Diego 101Military SuicidesSan Diego’s Cost-of-Living CrisisTijuana River 20 Years of Impactful Journalism Schools Guide San Diego Is Less Blue Public Matters Politifest 2024: News and Media Beef Week Progress Report Stadium Concession Investigation San Diego 101 Military Suicides San Diego’s Cost-of-Living Crisis Tijuana River 20 Years of Impactful Journalism Schools Guide San Diego Is Less Blue Public Matters Politifest 2024: News and Media Beef Week Progress Report Stadium Concession Investigation San Diego 101 Military Suicides San Diego’s Cost-of-Living Crisis Tijuana River NewslettersOpen dropdown menuNewsletter HubNot Getting Our Emails? Newsletter Hub Not Getting Our Emails? Newsletter Hub Not Getting Our Emails? PodcastsOpen dropdown menuVOSD PodcastSan Diego 101 PodcastVOSD Podcast Network VOSD Podcast San Diego 101 Podcast VOSD Podcast Network VOSD Podcast San Diego 101 Podcast VOSD Podcast Network EventsOpen dropdown menuAll EventsPolitifest 2025Brews & News All Events Politifest 2025 Brews & News All Events Politifest 2025 Brews & News Support UsOpen dropdown menuWays to GiveMembershipPlanned GivingMember HubVehicle DonationCommunity Partners Ways to Give Membership Planned Giving Member Hub Vehicle Donation Community Partners Ways to Give Membership Planned Giving Member Hub Vehicle Donation Community Partners About UsOpen dropdown menuOur Story and MissionOur TeamWhat We Stand ForNewsroom DiversityBoard of DirectorsOur SupportersCareersOur Interns Our Story and Mission Our Team What We Stand For Newsroom Diversity Board of Directors Our Supporters Careers Our Interns Our Story and Mission Our Team What We Stand For Newsroom Diversity Board of Directors Our Supporters Careers Our Interns Contact UsOpen dropdown menuHelp Page and FAQ’sContact UsContent Sharing PolicySubmit a CommentarySubmit a News TipPrivacy Policy Help Page and FAQ’s Contact Us Content Sharing Policy Submit a Commentary Submit a News Tip Privacy Policy Help Page and FAQ’s Contact Us Content Sharing Policy Submit a Commentary Submit a News Tip Privacy Policy **Sacramento Report: How San Diego Is Coping with Trump’s Slash-and-Burn Strategy for Climate Funding** **Share this:** Click to share on Bluesky (Opens in new window)Bluesky Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Sign up for The Morning Reportwith all your must-read news for the day. Last year the Environmental Health Coalition received a $20 million grant from the Environmental Protection Agency to improve air quality, build green spaces and add electric transit to some of San Diego’s most polluted neighborhoods. Organizers were excited to get the award, which supplemented state funds for projects in Barrio Logan, National City and other communities exposed to pollution from truck traffic and industrial pollution. Everything went as expected on the start date Jan. 6, but by Jan. 28 the payment system for the grant was frozen after President Donald Trump cancelled climate action funding. Sacramento ReportHow lawmakers are tackling San Diego issues at the state Capitol.​ Browse all newsletters atvosd.org/newsletters “We are incurring costs, but we are unable to tap into the funds that are contractually obligated to us,” Amy Castañeda, policy co-director for the coalition, told me. “We continue to spend money with no hope that the funds will be reinstated.” Attacks on climate action:San Diego organizations are grappling with Trump’s plans to claw back federal climate funding and attack state greenhouse gas reduction laws, in a blitz that leaves local climate goals in doubt. With San Diego cities already falling behind on their targets, however, it might also provide cover for those shortfalls. On Jan. 20, Trump signed an ordercancelling federal fundingfor climate programs and compelling production of oil, gas, coal, nuclear and other energy sources. Then hesigned anotherthis week that takes aim at state climate programs, includingCalifornia’s cap and trade, the state’s market for reducing greenhouse gases. Legal experts say the attempt to kill state climate laws is an overreach that’s likely to fail. California’s cap-and-trade program creates a market that limits overall greenhouse emissions, but lets companies buy and sell carbon credits. The state uses that money to pay for renewable energy, alternative fuel transportation and other projects. Carbon credit auctions have brought in $28.3 billion to the state Greenhouse Gas Reduction Fund since the program started in 2012, according to theCalifornia Air Resources Board.Nicole Capretz, CEO of Climate Action Campaign, said this is Trump’s second stab at ending the program. “He already tried to dismantle California’s cap and trade and he was unsuccessful,” in his first term, she told me. “I think California is feeling pretty secure in their cap-and-trade law. It is a massive revenue generator for the state and funds a whole suite of programs.” But reversing funding approved during the Biden administration is trickier. Trump’s day one order calls for “terminating the Green New Deal” by halting grants for electric vehicle charging stations and other infrastructure authorized in the 2022 Inflation Reduction Act and the 2021 Infrastructure Investment and Jobs Act. It’s been an ordeal for the Environmental Health Coalition, which has struggled to access money, plan projects, manage staffing and even communicate with the EPA. For a few weeks in February and early March the funding was restored, Castañeda said. Then it shut off again. The EPA project manager for the grant has cancelled every monthly check-in. “We’re doing the work but have zero communication and we’re in limbo now,” Castañeda told me. The coalition has contacted local lawmakers and is asking state officials to backfill the missing money with funds from Proposition 4, the $10 billion state climate bond measure that passed in November. If the coalition can’t get grant funding restored, they’ll have to look at staff cuts, Castañeda said. “We’re considering layoffs, we’re considering furloughs and staff time reductions, because we cannot sustain that big a hit,” she said. Local governments and advocacy groups have challenged Trump’s authority to cancel spending Congress authorized, arguing that only Congress – not the president – has the power of the purse. Those cases are making their way through the courts, but in the meantime, Trump is slashing staff and funding at federal agencies. “This is more of a bullying tactic than anything else, meant to silence, to intimidate, to chill any new actions on climate,” Capretz said. What does this mean for public climate action programs in San Diego?Those include the city’sClimate Action Plan, the county’sRegional Decarbonization Framework, which lays out countywide choices for transitioning from fossil fuels to renewable energy, and many other municipal climate action plans. I called San Diego County Board Chair Terra Lawson-Remer, who has been leading the county’s climate action efforts. Her office said she didn’t have any comment; things are moving too fast and she’s waiting to see how it shakes out. Environmental leaders say the cuts could throw a monkey wrench in local efforts to slash greenhouse gas emissions, which are already behind schedule. The Climate Action Coalition’sannual report cardgrades the county’s nine biggest cities on their climate progress. It gave mixed reviews last year. The report card urged cities to set annual benchmarks for greenhouse gas reductions and noted that California needs to triple its rate of greenhouse gas cuts to effectively fight climate change. San Diego has done a good job promoting renewable energy through community choice programs that offer a greener portfolio of energy sources than utility companies, Capretz said. But it’s behind the curve on electrifying buildings, switching to electric vehicles and cutting the amount that people drive. Could the Trump onslaught offer cover for cities to let their climate plans slide? Maybe, Capretz said. “It would be an excuse not to take action because of the threat by the federal government, or it could dampen political will,” she said. But she thinks California’s vast size and economic clout give us options. “California is going to have to invest more into climate solutions and backfill what the federal government will say it won’t fund,” she said. “We should have more ballot measures and redirect more funding so we don’t slow down progress. If you’re the fifth largest economy in the world you can act independently.” **How are Education Cuts Landing in San Diego?** Our education reporter Jackob McWhinney and investigative reporter Will Huntsberry attended a San Diego event withEducation Secretary Linda McMahon, who insisted that the elimination of the federal Department of Education means cuts to bureaucracy, not school funding. Last week, McWhinney wrote thatUCSD could lose hundreds of millions of dollarsfrom Trump cuts to higher education. The administration is slashing research grants for clinical trials on HIV and AIDS, and studies on how domestic violence affects pregnant women. That’s on top of the state’s plans to cut 8 percent across the UC system. All told, UC San Diego could lose half a billion dollars, UCSD Chancellor Pradeep Khosla warned. For more on the school front, check out thisCalMatters storyon California’s lawsuit to reclaim hundreds of millions of dollars in pandemic education funds that the Trump administration cancelled. The Sacramento Report runs every Friday. Do you have tips, ideas or questions? Send them to me atdeborah@voiceofsandiego.org. **WHAT TO READ NEXT** **Trump’s Cuts Thrust San Diego Students into Chaos and Homelessness** **Politics Report: Trash Fee Day Approaches** **VOSD Podcast: ICE Raids Reveal Limits of Sanctuary Declarations** **Water Authority Floats Lower Rate Hike — Council Says Not Good Enough** **North County Report: The Encinitas Mayor Is Saying I Told You So** Something went wrong. Please refresh the page and/or try again. **Deborah Sullivan Brennan** Deborah writes the Sacramento Report and covers San Diego and Inland Empire politics for Voice of San Diego, in partnership with CalMatters. She formerly...More by Deborah Sullivan Brennan **Join the Conversation** 3 Comments Stewart Teazesays:April 12, 2025 at 1:36 amSo-called “ClimateChange” has, for many decades, been a sky-screaming delusional and wasteful leftist HOAX. Absolute nonsense.Loading...ReplyStewart Teazesays:April 12, 2025 at 1:13 pmJust STOP with the incessant hyper-fibbery gaslighting.Loading...Reply So-called “ClimateChange” has, for many decades, been a sky-screaming delusional and wasteful leftist HOAX. Absolute nonsense. Stewart Teazesays:April 12, 2025 at 1:13 pmJust STOP with the incessant hyper-fibbery gaslighting.Loading...Reply Just STOP with the incessant hyper-fibbery gaslighting. So-called “ClimateChange” has, for many decades, been a sky-screaming delusional and wasteful leftist HOAX. Absolute nonsense. Stewart Teazesays:April 12, 2025 at 1:13 pmJust STOP with the incessant hyper-fibbery gaslighting.Loading...Reply Just STOP with the incessant hyper-fibbery gaslighting. Just STOP with the incessant hyper-fibbery gaslighting. Dougsays:April 14, 2025 at 5:04 pmSo file a lawsuit against the US Congress for not holding up their end of the deal. Congress was given the power under the US Constitution even though the oval office needs to be decorated with padded wall paper since Jan 20, 2025.It seems only the court system is left to stop this crazy man.Loading...Reply So file a lawsuit against the US Congress for not holding up their end of the deal. Congress was given the power under the US Constitution even though the oval office needs to be decorated with padded wall paper since Jan 20, 2025.It seems only the court system is left to stop this crazy man. So file a lawsuit against the US Congress for not holding up their end of the deal. Congress was given the power under the US Constitution even though the oval office needs to be decorated with padded wall paper since Jan 20, 2025.It seems only the court system is left to stop this crazy man. Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. **Leave a comment** Twitter Facebook Instagram YouTube Bluesky **About** Voice of San Diego is a registered trademark of Voice of San Diego, a California non-profit. 110 West A St. Suite 650, San Diego, CA 92101Phone: 619-325-0525 **Links** About Us Contact Us Newsletters Podcasts Submit a News Tip **Support Public Service Journalism** We rely on people like you to support this service. Please donate or sponsorVoice of San Diego®today. DONATE NOW"}