{"id": 2018, "name": "KBOI - 93.1 - Boise", "domain": "kboi.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.kboi.com/2025/06/03/feeding-americas-annual-map-the-meal-gap-report-reveals-disparities-in-food-insecurity/", "title": "Feeding Americas Annual Map The Meal Gap Report Reveals Disparities In Food Insecurity", "content": "ShowsKBOI LineupThe Kasper and Chris Show LIVEThe Vince Show LIVEGuy Benson Show LIVEThe Nate Shelman Show LIVEMark LevinThe Will Cain ShowRed Eye RadioThe Home Fix ShowNewstalk KBOI Staff KBOI Lineup The Kasper and Chris Show LIVE The Vince Show LIVE Guy Benson Show LIVE The Nate Shelman Show LIVE Mark Levin The Will Cain Show Red Eye Radio The Home Fix Show Newstalk KBOI Staff KBOI Lineup The Kasper and Chris Show LIVE The Vince Show LIVE Guy Benson Show LIVE The Nate Shelman Show LIVE Mark Levin The Will Cain Show Red Eye Radio The Home Fix Show Newstalk KBOI Staff Ways To Listen PODCASTKasper and Chris PodcastThe Nate Shelman ShowThe Real Money ProsThe Home Fix ShowMedical MomentThe Zamzows ShowThe Ben Shapiro ShowThe Matt Walsh ShowThe Michael Knowles Show Kasper and Chris Podcast The Nate Shelman Show The Real Money Pros The Home Fix Show Medical Moment The Zamzows Show The Ben Shapiro Show The Matt Walsh Show The Michael Knowles Show Kasper and Chris Podcast The Nate Shelman Show The Real Money Pros The Home Fix Show Medical Moment The Zamzows Show The Ben Shapiro Show The Matt Walsh Show The Michael Knowles Show Concerts And Events ContestsContest Rules Contest Rules Contest Rules Sweet Deals Advertising Contact Us The KBOI Store **Feeding America’s Annual Map the Meal Gap Report Reveals Disparities in Food Insecurity** Rural Areas Continue to Have Higher Rates of Food Insecurity For Immediate ReleaseJune 2, 2025 Meridian, ID– Feeding America, the nation’s largest hunger-relief organization, has released its annual Map the Meal Gap report. In Idaho, Map the Meal Gap estimates that 12.7% of Idahoans are food insecure. The report also estimates that 16.2% of Idaho children are food insecure. The Idaho Foodbank is one of more than 200 food banks that are part of Feeding America’s nationwide network. Map the Meal Gap estimates that in Idaho250,260people, or12.7 percent,of Idahoans, are food insecure. This year’s Map the Meal Gap report also found that75,640Idaho children, or16.2 percent, are estimated to be food insecure. This is an increase from last year’s Map the Meal Gap report, which estimated 11.4% of Idahoans and 14.5% of Idaho children were food insecure. Food insecurity is when people don’t have enough to eat and don’t know where their next meal will come from. The Map the Meal Gap report uses publicly available data from 2023 from various publicly-available sources of information, including the USDA Economic Research Service, U.S. Census Bureau, and Bureau of Labor Statistics. “The latest Map the Meal Gap report reaffirms what we have been seeing across Idaho, that more of our neighbors are reaching out for support,” said Randy Ford, President and CEO of The Idaho Foodbank. “The Map the Meal Gap report provides valuable insights that help us strengthen our efforts to nourish Idaho communities and raise awareness about the realities of food insecurity across the state. Together, with our partner network, we remain committed to ensuring that every Idahoan has access to the food they need to thrive.” Map the Meal Gap is the only study that provides local-level estimates of food insecurity for every county. The study builds upon the USDA’s latest report of national and state data, which showed 47 million people, including 14 million children, experienced food insecurity in 2023, the highest level in nearly a decade.Map the Meal Gapemphasizes the need for the public to join the movement to end hunger. You can find more information from the Map the Meal Gap report, including an interactive map, atFeedingAmerica.org/MaptheMealGap. MAP THE MEAL GAP 2025: KEY HIGHLIGHTS 63% of food insecure Idahoans have an income that is higher than the qualifications for the Supplemental Nutrition Assistance Program (SNAP). Nationwide, 85% of counties with the highest food insecurity are rural. North and North Central Idaho 50,000 people in North & North Central Idaho are estimated to be food insecure. That is 14.7% of the population in the region 14,950 children in North & North Central Idaho are estimated to be food insecure. That is 21% of children in the region Eastern Idaho 54,840 people in Eastern Idaho are estimated to be food insecure. That is 12.8% of the population in the region 18,690 children in Eastern Idaho are estimated to be food insecure. That is 16.5% of children in the region Southwest Idaho 129,070 people in Southwest Idaho are estimated to be food insecure. That is 13% of the population in the region 40,170 children in Southwest Idaho are estimated to be food insecure. That is 17% of children in the region The highest rates of food insecurity in Idaho are in Lewis County (17.6%), Butte County (16.9%), and Shoshone County (16.6%). The Idaho counties with the highest rates of food insecurity among children are Lewis County (25%), Shoshone County (24.8%), Boundary County (24%), and Clearwater County (23.4%). About The Idaho FoodbankThe Idaho Foodbank is an independent, donor-supported, nonprofit organization and is the largest statewidedistributor of free food assistance in Idaho. The Idaho Foodbank was established in 1984 and since that time hasdistributed millions of pounds of food through its facilities in Lewiston, Meridian and Pocatello. In Fiscal Year2024, The Foodbank provided food for nearly 22 million meals to Idahoans living with food insecurity. TheFoodbank distributes food through a network of more than 400 partners including schools, food pantries, seniorcenters, feeding sites, shelters, mobile pantries and churches. Recognizing the crucial connection betweenhunger and health, The Idaho Foodbank focuses on providing nutritious food and collaborates with communityorganizations to promote nutrition education, wellness tools and healthy living. Visit idahofoodbank.org formore information. Find us on your favorite social media platform. **Free Apps** Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information EEO Reports FCC Public File FCC Applications Employment Opportunities Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}