{"id": 240, "name": "Clanton Advertiser", "domain": "clantonadvertiser.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.clantonadvertiser.com/2025/06/04/billingsleys-jones-on-1st-team-boice-an-honorable-mention-on-class-1a-all-state-teams/", "title": "Billingsleys Jones On 1st Team Boice An Honorable Mention On Class 1a All State Teams", "content": "Home NewsLifestylesSchoolsBusinessRecordsNorth Chilton Lifestyles Schools Business Records North Chilton Lifestyles Schools Business Records North Chilton Sports Obituaries Opinion ServicesCalendarAbout UsPoliciesSubmit a News TipSubmit a PhotoSubmit a Classified Ad Calendar About Us Policies Submit a News Tip Submit a Photo Submit a Classified Ad Calendar About Us Policies Submit a News Tip Submit a Photo Submit a Classified Ad Classifieds Best Of Peach Mag Public Notices E-Edition **Billingsley’s Jones on 1st team, Boice an honorable mention on Class 1A All-State teams** Published 1:49 pm Wednesday, June 4, 2025 ByCarey Reeder By Carey Reeder | Managing Editor Billingsley High School had two of its pillar players from their recent string of playoff appearances be named to the Class 1A All-State baseball teams by the Alabama Sports Writers Association. Graduating senior Landon Jones put a bow on his career in the Bears’ program with a Class 1A First-Team All-State Team selection at catcher, the only catcher on the first team. Rising senior Kyle Boice had a solid junior season that earned him an honorable mention spot on the Class 1A All-State teams as a utility player. “It is a great thing for the program, and it shows we are able to develop these kids to their highest potential,” Jeffrey Alexander, Billingsley head coach, said. “That shows on the field and off the field.” Jones batted .524 in his final season of high school baseball with 43 hits and 41 RBIs. Ten of those knocks went for doubles and four for triples. While his stats at the plate were impressive, Jones defensive abilities behind the plate were what set himself apart last season. According to Billingsley’s MaxPreps stats, Jones had 20 opportunities last season to throw out baserunners trying to steal, and he nabbed 15 of them for a 75% caught stealing percentage. “This is just a kid that loves baseball, and he is always putting the work in,” Alexander said. “Having a good catcher with a great arm behind the plate slows down the running game. Not a lot of guys stole on us … When you are able to hold the other team from taking extra bases it really helps you out with the good pitching staff we had.” Jones said he takes pride in his defense at the catcher’s position, and he has no interest in playing the field and not getting a ball but every fourth or fifth batter. He added that he is passionate about making sure he makes his pitchers look as good as he can, always looking to frame pitches well and possibly steal a strike or two throughout any given game. Boice batted over the .400 mark with a .405 effort at the plate in his junior season with 32 base hits, 19 RBIs, five doubles and two triples. Boice also offered his services on the mound for Billingsley when Alexander needed a solid arm at certain times. “I am really proud of Kyle, and he puts in a lot of work and time,” Alexander said. “You will see more out of Kyle next year, and I feel like you will see his full potential. He is (another) kid that could play at the next level.” The rising senior made nine appearances on the mound and started six games, tossing 20.1 innings. He earned two saves during the season coming on in relief and struck out 30 batters. **Pierce moves on to Chatt Valley after inking scholarship** **Red Devils, Mustangs represent Chilton at state softball tournaments** **Daffodils win inaugural Petals Volleyball championship** **Varner signs with Miles College on cheer scholarship** Chamber Newsletters **Chamber Newsletters** **Chamber Newsletters** Special Section **Special Section** **Special Section** Home News Sports Obituaries Lifestyles Opinion Small Business About Us Policies Subscriptions Submit a News Tip Submit a Photo Birth Announcement Birthday Announcement Engagement Announcement Wedding Announcement Anniversary Announcement © 2025, The Clanton Advertiser"}