{"id": 242, "name": "Clarin", "domain": "clarin.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.clarin.com/deportes/alpine-cierra-filas-mejorar-rendimiento-colapinto-analisis-argentino-cara-gp-canada-briatore-frustrado-tener-mejor-auto_0_4QQvis88XM.html", "title": "Alpine Cierra Filas Mejorar Rendimiento Colapinto Analisis Argentino Cara Gp Canada Briatore Frustrado Tener Mejor Auto_0_4qqvis88xm.html", "content": "Para disfrutar los contenidos de Clarín es necesario que actives JavaScript en tu navegador. Modo Día/Noche Suscribitepor $470 Secciones Home Newsletters JuegosClaringrillaLos 8 erroresTest ActualidadLexi retoLetrasBaldosasSudokuPalagrama Último Momento Tienda Clarín Política Economía y RuralEconomíaRuralDolár, divisas, acciones y bonosMercado InmobiliarioCalculadora de GananciasCalculadora de inflaciónCalculadora de aguinaldoCalculadora de monotributoCalculadora de alquileres SociedadCiudadesPolicialesHistoriasServiciosEspeciales Clarín MundoNYT International Weekly OpiniónCartas al País DeportesFútbolAgenda DeportivaEstadísticas Cultura y EspectáculosCulturaRevista ÑEspectáculosFama EstiloVivaTecnologíaBuena VidaRelacionesArqRecetasAutosAstrologíaGourmetViajesFamiliasDe unaInternacional ServiciosClimaHoróscopoLoterías y QuinielasClasificadosHumor e ilustracionesEmpleosArgenpropFeriados 2025Gran DTHoróscopo ChinoÚltimas noticiasClarín em portuguésRadio Mitre en VivoAplicación Clarín MultimediaVideosFotogalerías Edición impresaTapas de ClarínEdiciones anterioresKiosco Clarín Suscribitepor $470Ingresar **Alpine cierra filas para mejorar el rendimiento de Colapinto: el análisis del argentino de cara al GP de Canadá y un Briatore “frustrado” por no tener un mejor auto** **\"Ojalá podamos volver a casa con puntos desde ambos lados del garaje\", deseó el argentino en referencia al octavo puesto de Pierre Gasly en la última fecha.Será su debut en el circuito Gilles Villeneuve.** \"Ojalá podamos volver a casa con puntos desde ambos lados del garaje\", deseó el argentino en referencia al octavo puesto de Pierre Gasly en la última fecha. Será su debut en el circuito Gilles Villeneuve. \"Ojalá podamos volver a casa con puntos desde ambos lados del garaje\", deseó el argentino en referencia al octavo puesto de Pierre Gasly en la última fecha. Será su debut en el circuito Gilles Villeneuve. 0 LaFórmula 1vuelve a poner primera en Canadá tras dos semanas de descanso yFranco Colapintocorrerá por primera vez en una pista conocidas por sus rectas largas de alta velocidad separadas por chicanas estrechas y técnicas en las que el argentino espera que suAlpineno pierda demasiado tiempo respecto a sus rivales y pueda luchar por posiciones en su cuarta carrera en el equipo francés, que volvió a sumar puntos conPierre Gaslyen España aunquesigue último en el Campeonato de Constructores, donde en 2024 fue sexto. \"Vivimos muchos altibajos como equipodurante el triplete europeo. No obtuvimos los resultados que queríamos, pero podemos ver el potencial y el ritmo que tiene el coche cuando logramos unir todas las piezas. Pierre y yo pasamos un tiempo con el equipo en Enstone para analizar las últimas carreras y trabajar en el simulador de cara a la próxima ronda\", explicó el argentino de 22 años que tras la carrera en Montmeló viajó con el resto del equipo a Inglaterra para trabajar lunes y martes en el simulador y charlar con los ingenieros. El bonaerense se presentará por primera vez en su carrera en el Circuito Gilles Villeneuve, que ha sido sede de todas las carreras en Canadá desde 1978 pero ausente de las categorías teloneras mientras corrió Colapinto. \"Estoy muy entusiasmado con el Gran Premio de Canadá este fin de semana y con muchas ganas de volver a salir a pista. Nunca he corrido en el Circuito Gilles-Villeneuve, así queserá clave para mí adaptarme lo más rápido posible y familiarizarme con el trazadopara llegar bien preparado a la clasificación\", remarcó. Asimismo, advirtió que el clima puede ser un factor crucial en la Île Notre-Dame, una isla artificial que fue sede de los Juegos Olímpicos de Verano de Montreal 1976. \"El clima probablemente jugará un papel importante durante el fin de semana, como ya hemos visto en años anteriores, así que es algo a tener en cuenta. El objetivo será completar un fin de semana sólido yojalá podamos volver a casa con puntos desde ambos lados del garaje\", se esperanzó, luego de que Gasly sumara los diez puntos que tiene Alpine, tras los seis del GP de Bahréin -donde Jack Doohan era su compañero de equipo- y recientemente los cuatro del octavo puesto en España. En estas tres carreras, el ex piloto de Williams fue 16° en Imola, 13° en Mónaco y 15° en España. Justamente, el francés reconoció que quedaron \"relativamente satisfechos como equipocon cerrar la triple ronda con un resultado en el top 10 en Barcelona, pero aún queda mucho trabajo por hacer para maximizar nuestro rendimiento durante el resto de la temporada\". \"La semana pasada volvimos directamente a la fábrica y al simulador para trabajar con el equipo yanalizar las carreras anteriores, asegurándonos de poder mantener esa forma en Montreal\", precisó. Sobre el circuito, en el que corrió cinco veces en la F1 desde el primero en 2017, cuando corría con Toro Rosso, agregó: \"Es un circuito de alto riesgo pero también de alta recompensa. Además, el clima puede ser bastante extremo, como ya hemos visto en años anteriores, así que ese será otro factor a tener en cuenta durante el fin de semana de carrera. Como hemos visto durante toda la temporada,las diferencias entre los coches son mínimas, así que trabajaremos duro para ejecutar el fin de semana de la mejor manera posible y tratar de sumar más puntos\". A raíz de lo expresado por sus pilotos,Flavio Briatore, asesor ejecutivo en los papeles aunque con un rol preponderante en el equipo, también habló sobre las expectativas del equipo para el Gran Premio de Canadá. Si bien reconoció que la temporada ha sido complicada, subrayó la importancia de aprovechar al máximo las próximas oportunidades. “Vamos a Montreal motivados para construir sobre el resultado con puntos obtenido en Barcelona. Sí, el equipo sumó cuatro puntos, pero también hemos perdido terreno en el Campeonato, y eso nos da una determinación extra para corregirlo en las próximas carreras”, comentó. El exjefe de Renault F1 destacó la buena disposición de los pilotos y el trabajo continuo con los ingenieros. “Tanto Pierre como Franco están trabajando duro con los ingenieros para impulsar al equipo hacia adelante. Tienen todo mi apoyo, y depende de nosotros, como equipo, darles un mejor coche y las herramientas para competir.Aunque Franco aún se está adaptando, estoy satisfecho con cómo ambos pilotosy el equipo están comprometidos para salir de esta situación difícil”, dijo el italiano, quien también se mostró frustrado por el rendimiento inconsistente del coche. “Me frustra el nivel de rendimiento inconsistente del coche, algo que debemos resolver con rapidez”, concluyó Briatore. Newsletter Clarín Recibí en tu email todas las noticias, coberturas, historias y análisis de la mano de nuestros periodistas especializados Franco Colapinto Fórmula 1 Alpine Beneficios Ingresar Google Play App Store Últimas noticias Política Economía Sociedad Deportes Espectáculos Opinión Cultura Rural Mapa del sitio Clima Horóscopo Loterías y Quinielas Divisas Claringrilla Sudoku Lexi Reto Los 8 Errores Test de Actualidad Más juegos 7 Minutos Humor político La intimidad del poder Más newsletters Grupo Clarín Noticias Clarín TN El Trece TV Mitre La 100 Ciudad Cienradios TyCSports La Voz del Interior VíaPaís Rumbos Diario Olé Gran DT Argenprop Empleos Guía Clarín Clasificados Receptoria online Colecciones Clarín Elle Kenja Anúnciese con nosotros Contacte a la Redacción Atención al Cliente Ayuda Archivo Edición impresa Términos y Condiciones Política de protección de datos personales Normas de confidencialidad y privacidad Defensa de las y los consumidores: para reclamos ingreseaquí"}