{"id": 735, "name": "KATC - Lafayette News", "domain": "katc.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.katc.com/science-and-tech/animals-and-insects/man-gored-by-bison-at-yellowstone-national-park-second-incident-this-year", "title": "Man Gored By Bison At Yellowstone National Park Second Incident This Year", "content": "Menu NewsKATC InvestigatesSubmit a News TipIn Your ParishCovering LouisianaAcadia ParishCalcasieu ParishEvangeline ParishIberia ParishJeff Davis ParishLafayette ParishSt. Landry ParishSt. Martin ParishSt. Mary ParishVermilion ParishNational News KATC Investigates Submit a News Tip In Your Parish Covering Louisiana Acadia Parish Calcasieu Parish Evangeline Parish Iberia Parish Jeff Davis Parish Lafayette Parish St. Landry Parish St. Martin Parish St. Mary Parish Vermilion Parish National News KATC Investigates Submit a News Tip In Your Parish Covering Louisiana Acadia Parish Calcasieu Parish Evangeline Parish Iberia Parish Jeff Davis Parish Lafayette Parish St. Landry Parish St. Martin Parish St. Mary Parish Vermilion Parish National News WeatherHurricane CenterRadars and FuturecastMore Futurecast ProductsInteractive StormTrackerVideo ForecastsAcadiana Sportsman ForecastHourly ForecastDaily ForecastWeather AlertsTracking the Tropics Hurricane Center Radars and Futurecast More Futurecast Products Interactive StormTracker Video Forecasts Acadiana Sportsman Forecast Hourly Forecast Daily Forecast Weather Alerts Tracking the Tropics Hurricane Center Radars and Futurecast More Futurecast Products Interactive StormTracker Video Forecasts Acadiana Sportsman Forecast Hourly Forecast Daily Forecast Weather Alerts Tracking the Tropics SportsHigh School SportsSaintsFriday Night FootballUL SportsLSU SportsNational Sports High School Sports Saints Friday Night Football UL Sports LSU Sports National Sports High School Sports Saints Friday Night Football UL Sports LSU Sports National Sports CommunityGMACrime StoppersSpirit of AcadianaTools for SchoolsKATC Trusted AdvisorAcadiana CalendarContestsDon't Waste Your MoneyCool SchoolsBrand SpotlightFestival International GMA Crime Stoppers Spirit of Acadiana Tools for Schools KATC Trusted Advisor Acadiana Calendar Contests Don't Waste Your Money Cool Schools Brand Spotlight Festival International GMA Crime Stoppers Spirit of Acadiana Tools for Schools KATC Trusted Advisor Acadiana Calendar Contests Don't Waste Your Money Cool Schools Brand Spotlight Festival International Traffic VideosLive Videos Live Videos Live Videos EntertainmentOn KATC On KATC On KATC AboutContact UsNews TeamKATC JobsKATC Sales TeamHow to Order Copies of NewscastsClosed CaptioningKATC Apps Contact Us News Team KATC Jobs KATC Sales Team How to Order Copies of Newscasts Closed Captioning KATC Apps Contact Us News Team KATC Jobs KATC Sales Team How to Order Copies of Newscasts Closed Captioning KATC Apps Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Weather Hurricane Center Sports In Your Parish Videos What's Your Story About Contests Legal Specialist **Actions** Facebook Tweet Email **Man gored by bison at Yellowstone National Park, second incident this year** A 30-year-old man from New Jersey was gored by a bison at Yellowstone National Park on June 10, according to National Park Officials. This is the second goring incident this year. The man was among a group of visitors at the park that approached the animal too closely, officials said. The incident happened around 9:45 a.m. in the Upper Geyser Basin at Old Faithful. Officials said the man was treated by local medics and his injuries were not life-threatening. The incident is still under investigation. RELATED STORY |Invasive Asian needle ants with potentially deadly sting spreading across multiple states Another individual, a 47-year-old Florida man, was gored by a bison on May 4 in the Lake Village area of the park. His injuries were also minor. On May 4, 2025, a 47-year-old man from Cape Coral, Florida, was injured by a bison in Yellowstone National Park. Officials said there were two reported goring incidents in 2024 and one in 2023. National Park Service officials said bison are territorial and have injured more people in Yellowstone than any other animal. \"They are unpredictable and can run three times faster than humans,\" officials said. Visitors are supposed to stay more than 25 yards away from all large animals — including bison, elk, bighorn sheep, deer, moose, and coyotes — and at least 100 yards away from bears, wolves and cougars. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News Weather Sports Community Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File Public File Contact Us Accessibility Statement Scripps Media Trust Center Scripps Media Trust Center Closed Captioning Contact FCC Application katctv3 katctv3 katctv3"}