{"id": 400, "name": "El Diario NY", "domain": "eldiariony.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://eldiariony.com/2025/06/10/por-que-causa-polemica-la-presencia-de-la-bandera-de-mexico-en-las-protestas-en-los-angeles-contra-las-redadas-migratorias/", "title": "Por Que Causa Polemica La Presencia De La Bandera De Mexico En Las Protestas En Los Angeles Contra Las Redadas Migratorias", "content": "Últimas Noticias Nueva York Estados Unidos Mundo Política Inmigración Entretenimiento Deportes Dinero Salud Comida Estilo de Vida Videos ICE Donald Trump Eric Adams Seguro social El Diario NY Estados Unidos **Por qué causa polémica la presencia de la bandera de México en las protestas en Los Ángeles contra las redadas migratorias** **Funcionarios de EE.UU. tachan a quienes la portan de \"insurrectos enarbolando banderas extranjeras\", mientras expertos dicen que es una referencia a las raíces** Expertos dicen que la bandera de México \"representa la familia, la identidad, la cultura\".Crédito: Getty Images PorBBC News Mundo Un hombre ondea la bandera mexicanaencaramado a un auto parcialmente quemado y lleno de pintadas en medio de una calle que parece un campo de batalla. Esa fotografía captada en Paramount, una localidad al sur del centro de Los Ángeles en la que el fin de semana se registraron enfrentamientos entreagentes federales y manifestantes en rechazo a las redadas migratorias de la administración Trump, ha acaparado portadas y circulado en redes sociales hasta hacerse viral. También lo han hecho otras imágenes que reflejan una tónica más pacífica de las movilizaciones en la ciudad californiana. En ellasla presencia de la bandera tricolor con el escudo del águila, la serpiente y el nopales ubicua, tanto que los grandes medios de Estados Unidos ya la describen como uno de los símbolos de las protestas. Un hecho que no ha pasado desapercibido para funcionarios del gobierno estadounidense, que no han tardado en condenar las escenas que, dicen, retratan a quienes describen como“insurrectos enarbolando banderas extranjeras”. El embajador estadounidense en México, Ronald Johnson, hizo referencia al tema en su cuenta de X: “Nuestras banderas representan identidad nacional, orgullo y valores compartidos, no división ni ilegalidad.Enarbolar una bandera extranjera mientras se ataca a las fuerzas del orden de los EE.UU. y se destruye propiedad pública o privada solo daña una relación bilateral que trabaja unida para que todos nuestros ciudadanos estén más seguros y sean más prósperos”. Ante ello,hay manifestantes que instan a sus pares a no ondear banderas mexicanas.“Mostrarlas alimenta la narrativa de que en este país se vive una invasión”, hace el llamado Beatriz Antún. Pero hay quien opina distinto.“Cuando veo una bandera de México en una protesta, me siento menos solo”,le dice a BBC Mundo Carlos Ramírez, un estudiante universitario con ascendencia mexicana. “Es una declaración de unidad y de visibilidad”, explica Patrick Díaz en su canal de TikTok. Sacando la bandera de México“expresamos nuestra identidad y nos resistimos a la idea de que debemos esconder quiénes somos para pertenecer”. **“Insurrectos con banderas extranjeras”** “Los insurrectos que portan banderas extranjeras están atacando a los agentes de inmigración, mientras la mitad del liderazgo político de Estados Unidos ha decidido que vigilar la frontera es malvado”, escribió sobre la cuestión el vicepresidente de EE.UU., J.D. Vance, en la red social X el sábado. Insurrectionists carrying foreign flags are attacking immigration enforcement officers, while one half of America's political leadership has decided that border enforcement is evil.Time to pass President Trump's beautiful bill and further secure the border. Para entonces, tras dos días de protestas y disturbios aislados, el presidenteDonald Trump ya había ordenado el envío de 2,000 efectivos de la Guardia Nacionalpara ayudar a “restaurar la ley y el orden” en la metrópolis californiana ante la “incapacidad” de la autoridad local. “Turbas violentas e insurrectas acosan y atacan a nuestros agentes federalespara intentar detener nuestras operaciones de deportación. Pero estos disturbios ilegales solo refuerzan nuestra determinación”, escribió el mandatario en su red social Truth Social. “Se restablecerá el orden,los inmigrantes indocumentados serán expulsados ​​y Los Ángeles será libre”,añadió, ante el categórico rechazo del gobernador del estado, el demócrata Gavin Newsom, quien describió la decisión como una “maniobra que solo escalará la tensión”. En el pulso que mantiene desde entonces con el gobierno federal,Newsom anunció una demanda por la medida, al tiempo que otros gobernadores demócratas la han tachado de “un alarmante abuso de poder”. A esto se suma el anuncio del Pentágono, que este lunes confirmó que está activando700 marines en el área de Los Ángelespara ayudar en la respuesta federal a las protestas. Entre tanto, las marchas no parecen cesar ni los manifestantes parecen dispuestos a dejar las banderas en casa. “No hay ni una bandera estadounidense a la vista”,escribía un usuario en la red social X al compartir un video que muestra un auto en llamas en el barrio angelino de Compton y al menos cinco banderas mexicanas. Del mensaje se hizo pronto eco Stephen Miller, asesor de la Casa Blanca y uno de los principales arquitectos de las políticas migratorias más duras de la administración, al que añadió: “Insurrección”. Not an American flag in sight.https://t.co/UtvcJTNa8z El uso del concepto tanto por parte de Miller como de Vance ha hecho que muchos se vuelvan a preguntar siel gobierno de Trump estaría evaluando la posibilidad de invocar la Ley de Insurrección de 1807, quepermite al Ejecutivo desplegar tropas en el territorio en caso de rebelión. El presidente ya puso la idea sobre la mesa en enero, cuando, al emitir la orden ejecutiva que declaraba la emergencia en la frontera, les dio al secretario de Defensa, Pete Hegseth, y a la secretaria de Seguridad Nacional (DHS, por sus siglas en inglés), Kristi Noem, 90 días para que le aconsejaran si invocar o no dicha ley para ayudar a tener el “control operativo completo” del área colindante con México. Sin embargo, al ser consultado este domingo sobre si estaba dispuesto a invocar ahora la ley, Trump respondió ante los periodistas en Nueva Jersey que“depende de si hay o no una insurrección”. Ante la pregunta de si consideraba que eso estaba ocurriendo en Los Ángeles, dijo:“No, pero hay personas violentas, y no vamos a dejar que se salgan con la suya”. **Referencia a las raíces y al sentido de comunidad** Y en ese sentido la bandera mexicana está siendo asociada con los manifestantes que la enarbolan. “Comentarios como los de Miller y Vance apelan a una audiencia que no conoce la historia y no hacen más que arrojar leña al fuego entre quienes no entienden la razón por la que la bandera mexicana es enarbolada”, le dice a BBC Mundo Alexandro J. Gradilla, profesor asociado deChicana and Chicano Studiesen la California State University, Fullerton. Y con ello, el experto no sólo se refiere al hecho de que California –así como los estados estadounidenses de Nevada, Nuevo México, Texas y Utah— fueron en su día territorio mexicano. O a queCalifornia es hogar de más de 10 millones de personas nacidas en el extranjero, incluidos unos 1,8 millones sin un estatus legal, según datos de 2022 del centro de investigación Pew. Un hecho al que sí ha hecho referencia recientemente la presidenta de México, Claudia Sheinbaum, al señalar que “EE.UU. no sería lo que es si no fuera por los mexicanos y mexicanas que trabajan del otro lado”. Este domingo,la mandataria dijo no estar de acuerdo con las redadas en EE.UU.e instó al vecino del norte a aprobar una reforma migratoria. Sin embargo, “gran parte de los que enarbolan la bandera de México hoy son ciudadanos estadounidenses por nacimiento”, matiza Gradilla. Eso mismo le subrayaba a BBC Mundo en Paramount un jornalero salvadoreño que lleva cinco décadas en EE.UU. y que logró regularizar su estatus migratorio en el año 2000: “Muchos están saliendo a protestar porque sus padres o las generaciones anterioresaguantamos durante tiempo en las sombras”. “Soy una estadounidense muy orgullosa (de serlo)”, le decía en esa línea aThe New York TimesElizabeth Torres, de 36 años, quien sostenía una bandera de México fuera de un centro de detención de Los Ángeles en torno al cual se han registrado protestas. “Pero tambiéndebo mostrar apoyo a nuestros hermanos y hermanas mexicanos”,añadía la mujer, cuyos abuelos emigraron a Estados Unidos. “En ese sentido, como ciudadanos de pleno derecho, deberían poder levantar la bandera que les parezca”, prosigue el profesor Gradilla. “¿Que sería buena idea enarbolar la estadounidense? Tal vez sí, pero más bien hay que cuestionarse por quégenera esa reacción de rechazo entre algunos”,añade el experto, quien cree que tiene que ver con que desde algunos sectores se les considere “ciudadanos de segunda categoría”. Sea como fuere, para Gradilla, el uso de la bandera en las protestas nada tiene que ver “con narrativas de México vs EE.UU.”. “Representa la familia, la identidad, la cultura”,explica. Quien la saca estos días a la calle “es gente que tiene un sentido de la historia, de la comunidad, porque durante mucho tiempo esta bandera ha sido para una comunidad marginalizada económica y socialmente unsímbolo de inclusión, de pertenencia“, concluye. Haz clic aquípara leer más historias de BBC News Mundo. Suscríbete aquía nuestro nuevo newsletter para recibir cada viernes una selección de nuestro mejor contenido de la semana. También puedes seguirnos enYouTube,Instagram,TikTok,X,Facebooky en nuestrocanal de WhatsApp. Y recuerda que puedes recibir notificaciones en nuestra app. Descarga la última versión y actívalas. “Esto lo construyeron los migrantes. No somos el enemigo”: Paramount, el barrio de Los Ángeles que se levantó en protestas contra las redadas de deportación El desafío del gobernador Gavin Newsom a Trump tras el envío de la Guardia Nacional a California por las protestas (y el pedido del presidente para que lo arresten) En esta nota **Secretario de Estado ordena que procedan al despido de todo el personal de USAID en el extranjero** **Trump: Las protestas en Los Ángeles buscan “prolongar la invasión extranjera”** **Jennifer López roba miradas con atrevidos atuendos en el World Pride Music Festival** **¿Cómo votar por tu favorita en Miss Universe Latina, El Reality?** **El Niño Prodigio: Horóscopo de hoy 11 junio de 2025** **Suscríbete al boletín de Noticias** Este sitio está protegido por reCAPTCHA y GooglePolítica de privacidady Se aplican lasCondiciones de servicio. ¡Muchas gracias! **Secretario de Estado ordena que procedan al despido de todo el personal de USAID en el extranjero** **Trump: Las protestas en Los Ángeles buscan “prolongar la invasión extranjera”** **Jennifer López roba miradas con atrevidos atuendos en el World Pride Music Festival** **¿Cómo votar por tu favorita en Miss Universe Latina, El Reality?** **El Niño Prodigio: Horóscopo de hoy 11 junio de 2025** Secciones Nueva York Estados Unidos Mundo Inmigración Entretenimiento Deportes Salud Comida Estilo de Vida Astrología Tecnología Opinión Servicios CLASIFICADOS NEWSLETTER EMPLEOS SUSCRIPCIÓN CLIMA HORÓSCOPO LOTERÍA ANUNCIOS Acerca de nosotros Advertise with Us/Anuncios Politica de Privacidad Editorial Guidelines Sitemap Copyright © 2025. All rights reserved Newsletter Suscríbete Clasificados Empleos Últimas Noticias Horóscopo Videos SeccionesNueva YorkEstados UnidosPolíticaInmigraciónEntretenimientoDeportesSaludComidaEstilo de VidaAstrologíaDineroTecnologíaOpinión Nueva York Estados Unidos Política Inmigración Entretenimiento Deportes Salud Comida Estilo de Vida Astrología Dinero Tecnología Opinión Nueva York Estados Unidos Política Inmigración Entretenimiento Deportes Salud Comida Estilo de Vida Astrología Dinero Tecnología Opinión Lotería Clima Acerca de nosotros Advertise with Us/Anuncios Politica de Privacidad Editorial Guidelines Sitemap Síguenos **Suscríbete al boletín de Noticias** Este sitio está protegido por reCAPTCHA y GooglePolítica de privacidady Se aplican lasCondiciones de servicio. ¡Muchas gracias! **Suscríbete al boletín de Noticias** Este sitio está protegido por reCAPTCHA y GooglePolítica de privacidady Se aplican lasCondiciones de servicio. ¡Muchas gracias!"}