{"id": 1399, "name": "The Local (France)", "domain": "thelocal.fr", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.fr/20210413/reader-question-where-can-i-find-professional-help-with-the-french-tax-declaration/#article-comments", "title": "Reader Question Where Can I Find Professional Help With The French Tax Declaration", "content": "**Advertisement** French NewsLatest newsTravel newsStrikesPoliticsJohn LichfieldParisLyonNiceBrittany Latest news Travel news Strikes Politics John Lichfield Paris Lyon Nice Brittany Latest news Travel news Strikes Politics John Lichfield Paris Lyon Nice Brittany Podcasts EssentialsFrench citizenshipResidency permitsVisasHealthDrivingTaxesLiving costsFood and DrinkReader questions French citizenship Residency permits Visas Health Driving Taxes Living costs Food and Drink Reader questions French citizenship Residency permits Visas Health Driving Taxes Living costs Food and Drink Reader questions Discover FranceMoving to FranceLiving in FranceFrance explainedDiscover FranceAmericans in France Moving to France Living in France France explained Discover France Americans in France Moving to France Living in France France explained Discover France Americans in France LanguageLanguage LessonsLanguage TestsLearning FrenchFrench Word of the Day Language Lessons Language Tests Learning French French Word of the Day Language Lessons Language Tests Learning French French Word of the Day HomesPropertyRentingSecond homesProperty SalesFind rentals Property Renting Second homes Property Sales Find rentals Property Renting Second homes Property Sales Find rentals JobsWorking in FranceJobs in France Working in France Jobs in France Working in France Jobs in France French NewsLatest newsTravel newsStrikesPoliticsJohn LichfieldParisLyonNiceBrittany Latest news Travel news Strikes Politics John Lichfield Paris Lyon Nice Brittany Latest news Travel news Strikes Politics John Lichfield Paris Lyon Nice Brittany Podcasts EssentialsFrench citizenshipResidency permitsVisasHealthDrivingTaxesLiving costsFood and DrinkReader questions French citizenship Residency permits Visas Health Driving Taxes Living costs Food and Drink Reader questions French citizenship Residency permits Visas Health Driving Taxes Living costs Food and Drink Reader questions Discover FranceMoving to FranceLiving in FranceFrance explainedDiscover FranceAmericans in France Moving to France Living in France France explained Discover France Americans in France Moving to France Living in France France explained Discover France Americans in France LanguageLanguage LessonsLanguage TestsLearning FrenchFrench Word of the Day Language Lessons Language Tests Learning French French Word of the Day Language Lessons Language Tests Learning French French Word of the Day HomesPropertyRentingSecond homesProperty SalesFind rentals Property Renting Second homes Property Sales Find rentals Property Renting Second homes Property Sales Find rentals JobsWorking in FranceJobs in France Working in France Jobs in France Working in France Jobs in France franceAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **Where can I find professional help with the French tax declaration?** 1 comment There are lots of people advertising their services to help with the annual French tax declaration but you need to make sure that anyone you hire has the right qualifications - here is how to check. **Advertisement** Springtime in France means tax season and unlike in the UK where swathes of the population including salaried employees and pensioners are generally exempt from filing a tax return, in France almost everyone has to complete the annual tax declaration - even if they don't owe any tax. READ ALSOWho has to fill in a tax declaration in France? **Advertisement** And the combination of complicated tax jargon and French bureaucracy is enough to strike fear into the hearts of many. So where can you get help? Online There are lots of English-language guides to French tax forms and the French tax website even has a section in English to help out foreigners. The tax declarations have now moved online and once you have registered and filed for the first year, the process is relatively straightforward. More information can be found at ourtax section. **Advertisement** Professional help But if you feel that your French is not up to the task, or your financial affairs are very complicated or you'd just rather hack off your own foot than spend an afternoon filling in French tax forms, you might prefer to pay someone to help you. There are lots of people who advertise their services in this area, particularly in forums or online groups for foreigners, but be careful that you hire someone with the correct qualifications. We asked chartered accountant Faten Amamou for her tips. She said: \"French tax returns can seem complicated, but if your financial affairs are straightforward, you can probably file your own. The calculations will be worked out for you, so you don’t need to do any complicated mathematics.\" But if you're looking for professional help you have two main options - anexpert comptableor afiscaliste. Faten said: “Tax authorities recommend that you fill your individual and household tax returns with anexpert comptable. \"This assures them your tax return will be accurate, and they have a knowledgeable point of contact for any questions.“You can also use afiscaliste- or a tax-specialist lawyer (avocat). But note that for business tax returns (liasse fiscale) based on bookkeeping, onlyexpert comptablescan advise you, not tax lawyers. “If your French is very good, you can call the tax helpline on 0809 401 401. \"Or if you have a fluent friend who can go with you, you can also make an appointment at your local tax office (centre des impôts) with an adviser who can explain how to fill in the form and answer any questions about it. \"But in both cases, they cannot give financial advice and can only answer questions about the form. “There are some translators and other non-registered professionals who will offer to help you fill in your tax return, and I have seen people landed with some hefty tax bills, fines and even jail because of poor advice. If anyone offers to help you with your tax return, check that they are either a lawyer or an accountant registeredHERE “You can also use that form to find a qualified local accountant, or Google ‘Expert-comptablesEnglish-speaking’ to find bilingual accountants. But do double-check they are registered at the website above before using them. \"If someone is offering you accounting services and they aren’t registered on that site, then there’s also a link to report them to the authorities.” Faten Amamou is a Chartered Accountant in France at ESCEC Internationaland member of the Institute of chartered accountants in France (ordre des experts-comptables). Fluent in English, French and Arabic she provides accounting services to both individuals and businesses, and specialises in helping foreign entrepreneurs set up their business and careers in France. Find out morehere. **More** **Comments (1)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.fr.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. Anonymous2022/01/14 17:41This response is only nine months late but I'm advised the strictly applicable exchange rate is when the actual transaction takes place. However the French tax office also issues an official global rate for the year around when the tax forms are issued or shortly before on-line returns are due. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}