{"id": 1332, "name": "Canadian Taxpayers Federation", "domain": "taxpayer.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.taxpayer.com/campaigns/youve-seen-investigative-journalisms-power-do-you-want-to-supercharge-it", "title": "Youve Seen Investigative Journalisms Power Do You Want To Supercharge It", "content": "**Before you go…** Today, we’re looking for 5 Canadians committed to making sure we’re standing up for them 365 days a year. Would you consider making a $10 monthly donation right now? **Thank you for signing the petition. Your support helps us fight for lower taxes, less waste and more accountable government.** **You’ve seen investigative journalism’s power – do you want to supercharge it?** About 99% of taxpayers who get our investigative journalism emails are taking a big step. It’s a big step because knowledge is power and they need that power to hold politicians accountable. But what about the other 1%? About 1% want to do more than read about government waste. Those folks want to get in on the digging. And they do it by donating to the Canadian Taxpayers Federation. If you want to pull more government waste out into the sunlight, please donate now! **You’ve seen investigative journalism’s power – do you want to supercharge it?** **** If you prefer to usepaypalclick hereor continue below to donate via credit card A monthly gift will go even further to hold politicians accountable and fight for lower taxes and against government waste. $10 $15 $20 Other Monthly donations of $9 and higher receive The Taxpayer magazine. Donations to the Canadian Taxpayers Federation are not tax deductible $10 $25 $50 $100 $200 Other Donations of $100 and higher receiveThe Taxpayermagazine. Donations to the Canadian Taxpayers Federation are not tax deductible **Enter your information:** **Credit card information** **Other donation options** Debit Cards:If you have a Visa or Mastercard debit card you can use it to make a donation using the Credit Card Information form above. Debit Cards:If you have a Visa or Mastercard debit card you can use it to make a donation using the Credit Card Information form above. Debit Cards:If you have a Visa or Mastercard debit card you can use it to make a donation using the Credit Card Information form above. If you prefer to usepaypalclick here If you prefer to usepaypalclick here If you prefer to usepaypalclick here By calling 1-800-667-7933 By calling 1-800-667-7933 By calling 1-800-667-7933 To donate via E-Transfer, please contact Shannon Morrison at[email protected] To donate via E-Transfer, please contact Shannon Morrison at[email protected] To donate via E-Transfer, please contact Shannon Morrison at[email protected] By mail.Click herefor a printable version of our donation form.Mail: 501 - 2201 11th Ave, Regina, SK S4P 0J8 By mail.Click herefor a printable version of our donation form.Mail: 501 - 2201 11th Ave, Regina, SK S4P 0J8 By mail.Click herefor a printable version of our donation form.Mail: 501 - 2201 11th Ave, Regina, SK S4P 0J8 Click hereif you would like more information on leaving a permanent contribution to the Canadian Taxpayers Federation! Click hereif you would like more information on leaving a permanent contribution to the Canadian Taxpayers Federation! Click hereif you would like more information on leaving a permanent contribution to the Canadian Taxpayers Federation! If you have any questions regarding your donation please contact us at[email protected] If you have any questions regarding your donation please contact us at[email protected] If you have any questions regarding your donation please contact us at[email protected] There was a problem completing your donation. Please try again later. ..."}