{"id": 1782, "name": "Pennsylvania Daily Star", "domain": "pennsylvaniadailystar.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "high", "questionable": null, "url": "https://pennsylvaniadailystar.com/news/anti-ice-protests-fueled-in-part-by-ccp-linked-communist-revolutionary-organization-and-a-tech-millionaire/jtnews/2025/06/11/", "title": "Anti Ice Protests Fueled In Part By Ccp Linked Communist Revolutionary Organization And A Tech Millionaire", "content": "Home About NewsPennsylvaniaNationalWorld Pennsylvania National World Pennsylvania National World CommentaryLetters to the EditorSubmit a Letter to the Editor Letters to the EditorSubmit a Letter to the Editor Submit a Letter to the Editor Letters to the EditorSubmit a Letter to the Editor Submit a Letter to the Editor Submit a Letter to the Editor The Star News NetworkThe Tennessee StarThe Ohio StarThe Minnesota SunThe Michigan StarThe Virginia StarThe Georgia Star NewsThe Arizona Sun TimesThe Florida Capital StarThe Wisconsin Daily StarThe Pennsylvania Daily StarThe Connecticut StarThe Texas Lone StarThe Iowa StarThe Missouri SunThe North Carolina Daily Star The Tennessee Star The Ohio Star The Minnesota Sun The Michigan Star The Virginia Star The Georgia Star News The Arizona Sun Times The Florida Capital Star The Wisconsin Daily Star The Pennsylvania Daily Star The Connecticut Star The Texas Lone Star The Iowa Star The Missouri Sun The North Carolina Daily Star The Tennessee Star The Ohio Star The Minnesota Sun The Michigan Star The Virginia Star The Georgia Star News The Arizona Sun Times The Florida Capital Star The Wisconsin Daily Star The Pennsylvania Daily Star The Connecticut Star The Texas Lone Star The Iowa Star The Missouri Sun The North Carolina Daily Star ContactCorrectionsPrivacy PolicyTerms of UseCookie NotificationDMCA PolicyAdvertise Corrections Privacy Policy Terms of Use Cookie Notification DMCA Policy Advertise Corrections Privacy Policy Terms of Use Cookie Notification DMCA Policy Advertise Education FoundationConstitution Bee Sign-up Constitution Bee Sign-up Constitution Bee Sign-up Email Update **Anti-ICE Protests Fueled in Part by CCP-Linked Communist Revolutionary Organization and a Tech Millionaire** An avowedly Communist revolutionary group with ties to a China-linked Marxist funding network has been at the forefront of organizing nationwide protests opposing illegal immigration crackdowns by U.S. Immigration and Customs Enforcement (ICE) — including protests which spiraled into violent riots in parts of Los Angeles. The Party for Socialism and Liberation(PSL) — which openly calls for revolution to bring down the current American system and which publicly sympathizes with murderous Communist regimes — has been a leader in organizing and fueling anti-ICE demonstrations in LA as well as in other cities nationwide. President Donald Trump activated elements of the California National Guard to help quell the anti-ICE violence in Los Angeles. Defense Secretary Pete Hegseth said Marines stationed at Camp Pendleton are being deployed “to restore order” as well. First Amendment or a right to riot? “Stop the raids! National Guard OUT of LA!” PSLsaidin a lengthy Sunday statement. “The National Guard deployment is a desperate attempt to intimidate people out of exercising their First Amendment rights. If they can get away with it in Los Angeles, then that will only embolden the Trump administration to use greater and greater repressive force all across the country, against any expression of dissent regardless of the issue in question. For those who believe in immigrant rights, for those who believe in democracy, for the entire working class — now is the time to take to the streets in protest!” “If I didn’t ‘SEND IN THE TROOPS’ to Los Angeles the last three nights, that once beautiful and great City would be burning to the ground right now,” Trumpsaidon his Truth Social account on Tuesday. PSL has also been running a“Don’t Open for ICE”campaign in both English and Spanish, which says, “Don’t let Trump and ICE win without a fight! Papers or not, everyone has certain rights they can use when an agent is trying to deport them. We are workers with dignity and we deserve to stay where we are.” The leadership and activities of PSL are closely tied to far-left groups bolstered by the financial network ofwealthy Marxist businessmanNeville Roy Singham, whosoldhis ThoughtWorks tech company in 2017 and has used the money to fund openly Communist endeavors globally. A communist “incubator” Singham has been described as a “comrade” of — and is a financial backer of —the People’s Forum, a Marxist revolutionary group based in New York City. The group calls itself “a movement incubator for working class and marginalized communities to build unity across historic lines of division at home and abroad.” That incubation has been integral to backing the illegal Columbia University encampments and the protests for Mahmoud Khalil, asJust the Newsdetailed inmultipleextensive investigative reports.The forum and PSL share a number of connections. Singham has also financially backed a number of other Marxist groups with links to PSL. “We are united in our belief that capitalism — the system in which all wealth and power is held by a tiny group of billionaires and their state — is the source of the main problems confronting humanity today,” PSLsayson their website. “It must be replaced by socialism.” PSL did not respond to a request for comment fromJust the News. Singham did not respond to a request for comment sent to him byJust the Newsthrough his ThoughtWorks company website. The PSLsaysit has dozens of chapters nationwide — and it has activated them to combat the Trump administration’s efforts to crack down on illegal immigration. PSL and the violent riots in Los Angeles PSL played akey rolein organizing some of LA’s anti-ICE protests and demonstrations this weekend. Photographs taken by theLos Angeles Timesshowsome of the signs waved by protesters were reportedly produced by PSL. “The people of Los Angeles and surrounding areas have taken a courageous stand against Trump’s reign of terror targeting immigrant families. In response, the administration has falsely labeled those taking to the streets in protest of the brutal war on immigrants as ‘rioters’ and called in thousands of National Guard soldiers for a crackdown,” PSL said in along screedon Monday. “But the people are not deterred — in Los Angeles and across the country, protest is continuing with even more determination. This could be a turning point where the entire working class unites to push back Trump’s efforts to shred our basic rights and dignity.” The Communist group hadtweetedon Friday that “thousands march in Los Angeles against a blitz of multiple ICE raids” and included video of the demonstration. PSLtweetedon Sunday about “MASS MOBILIZATION. ICE OUT OF LA. NATIONAL GUARD GO AWAY.” It then organized a demonstration that day outside LA City Hall. The groupthensharednumerousvideosof the anti-ICE rallies across the city, with numerous captions putting PSL’s slant on the day’s events: “The people continue to righteously stand up for justice for immigrant communities in the face of growing state repression! … Thousands in Los Angeles have made clear that they will continue to stand up for immigrant families against deportations, even in the face of growing repression! … Thousands have taken the highway and halted traffic in LA to send the Trump administration a powerful message that the people demand an end to the war being waged on immigrant communities. … Cops in full riot gear deployed against protesters in LA demanding an end to deportations.” PSL continued its efforts on Monday,tweetingthat “thousands are rallying in downtown LA against ICE, as the agency continues to terrorize the people of Los Angeles, kidnapping our neighbors, friends and families.” PSL also leads anti-ICE protests elsewhere PSL has also organized, hosted, or participated in multiple other anti-ICE protests and demonstrations elsewhere in California — includingSan Francisco,Sacramento, andFresno— and across the country. On its social media accounts, PSL touted such anti-ICE demonstrations held in the Texas cities ofAustinandHouston; in the Ohio cities ofClevelandandColumbus; inProvidence, Rhode Island; inChicago, Illinois; and inWashington, DC. It wasreportedbyBreitbart Newsthat PSL organized an anti-ICE protest in San Antonio, Texas — and the outlet “noted the signs provided and carried by PSL members in San Antonio were identical to those held by PSL members in the Los Angeles demonstrations.” Media outlets have noted PSL’s role in other anti-ICE protests in Texas, including inDallas,Waco, andSan Antonio. The media has also reported on PSL’s role in such demonstrations inLouisville,Kentucky, andRaleigh, North Carolina.PSL said on Instagram that it was planning demonstrations inRichmond, Virginialater this week. The group is also reportedly planning an anti-ICE rally inAnchorage,Alaskathis weekend. The Marxist group also issued a lengthy statement on Monday criticizing the broad sweep of the illegal immigration crackdown — dubbedOperation Tidal Wave— carried out by ICE in coordination with Gov. Ron DeSantis (R-Fla.). “I’ve insisted that Florida be the tip of the spear when it comes to state support of federal immigration enforcement,” DeSantissaidin May. “The success of Operation Tidal Wave is proof of our commitment.” PSL was not pleased. PSL’s ties to the CCP-linked funding network exposed PSL is closely tied to a number of groups which are part of Neville Singham’s funding network, including theMarxist-orientedPeople’s Forum, thefar-leftBreakThrough Newsmedia outlet, and Singham’s Justice and Education Fund. The Network Contagion Research Institute (NCRI), whichsaysits platform plays a “critical role in the identification and forecasting of emerging threats” to the U.S.,assessedlast year that PSL “shares considerable fiscal and personnel connections” with “members of the ‘Singham Network’ donor portfolio.” The People’s Forum is aMarxist revolutionary groupthat is pro-Communism, pro-China, and anti-Israel. The group has produced dozens of what it describes as teaching materials, many of them pro-CCP. The forumtaggedPSL on Twitter in March in a post about upcoming protests on “All Out for Mahmoud Khalil” and “Shut It Down For Palestine.” The NCRIarguedlast year that 2024 the People’s Forum is “closely allied” with PSL. Brian Becker isreportedlya “founding member” of PSL as well as a national organizer for the far-left ANSWER Coalition. He is also listed as an“instructor”on the People’s Forum website, where he has taught classes on “Lenin and the Path to Revolution” and the “History of theCommunist Manifesto.” “What part of Marx’s diagnosis of capitalism is not correct?” Beckerasked rhetoricallyon Twitter in 2023. Becker’s X accountdescribes himas “Director @answercoalition [ANSWER Coalition], a founder of @pslweb [the Party for Socialism and Liberation], and show host of @TheSocProgram [the Socialist Program].” The Heritage Foundationassessedin 2024 that “another Singham-funded group, ANSWER, is a front operation for the Party for Socialism and Liberation.” Marxist leader Claudia De La Cruz said in a2024 interviewabout her campaign as the PSL nominee to be U.S. president that “I co-founded and co-directed … the People’s Forum.” The forumsaysthat De la Cruz “is a central committee member of The Party for Socialism and Liberation” and that “in 2018, she co-founded The People’s Forum.” De La Cruz is listed as a director at the forum intax records. ThetaxformsforBreakThrough Mediashow that many of the group’s top leaders are all tied to PSL as well. The NCRI also detailed more deep links between PSL and Singham’s Marxist efforts in itsreportlast year, noting that “BT Media was founded in 2020 by Ben Becker, a founding member of PSL” and that “the key offices and editorial team of BT News are likewise dominated by PSL members.” This includes De La Cruz serving as “BT Media’s Secretary and Director, as well as PSL’s candidate for the 2024 Presidential election”; Karla Reyes serving as “BT Media’s Chair and Director and De la Cruz’s 2024 PSL Presidential campaign running mate”; Yari Osorio serving as “BT Media’s Treasurer and Director and PSL’s 2012 Vice-Presidential candidate”; and Eugene Puryear serving as “BT Media’s Host and Producer” and also running as “a PSL Vice-Presidential candidate in 2008 and 2016.” The group assessed that “the degree of overlap between BT Media and PSL on their executive and editorial teams is so significant that one can easily conclude that the former is functionally serving as a mouthpiece for the latter.” The far-leftBreakThrough Newshas shared anti-ICE content in recent days that is similar to — and sometimes identical to — that shared by PSL, and BreakThrough has promoted PSL’s work directlymultiple times. Network ContagionreportedPSL founding member Ben Becker as having foundedBreakThroughin 2020. The Network Contagionreleaseda 2024 report which found that BT Media is “known for promoting pro-CCP geopolitical interests through its outletBreakThrough News, shares numerous fiscal and organizational connections with other core organizations of the Singham Network.” The People’s Forum also “provided grants to BT Media in 2021 and 2022, in addition to significant financial support that BT Media received from other Singham-linked entities,” the report found, and “these grants account for a substantial portion of BT Media’s revenue, which nearly doubled year-over-year from $253,000 in 2020 to a total of $951,000 in 2022.” The Heritage Foundation alsoassessedlast year thatBreakThrough News“exemplifies the internal coordination among all the tentacles of the Singham network and of the ecosystem in general.” A “torrent of dark money” BreakThroughNewsis also part of the International People’s Media Network, whichdescribes itselfas “a network of independent media projects from across the globe that collaborate, working collectively to uplift people’s voices and stories.” A report by theDaily Beastrevealedthat “all of the International People’s Media Network’s affiliates … appear to drink from the same torrent of dark money pouring out of the bank accounts and nonprofits of tech mogul Neville ‘Roy’ Singham.” The outlet said that “filings submitted to the Internal Revenue Service and the New York State Charities Bureau show BreakThrough News is a nonprofit that has drawn the bulk of its funding from the Justice and Education Fund.” The outletsaidPSL “appears as an allied group to the International People’s Media Network on its webpage.” The People’s Forum andBreakThrough Newsalsolistthemselvesas sharing the same address in New York City.New Lines MagazinedescribesBreakThrough News as being “housed within The People’s Forum New York office.” TheFree Beaconpreviously alsoreportedthat key leaders for the People’s Forum “serve in top positions at Singham’s Justice and Education Fund.” The forum’sexecutive director, Manolo De Los Santos, is also listed as the director and secretary at the fund, according totax records. De Los Santos is affiliated with PSL as well, and has beenfeatured at eventspromoted by PSL and haswrittenarticlesshared on the PSL website. PSL and the Communist Revolution in America The “Program of the Party for Socialism and Liberation” — essentially PSL’s political platform —declaresthat the group’s members are “Marxists in the United States.” The platform is heavy on calls for Communist revolution. “Capitalism cannot be voted out of power — it will take a revolution,” PSL says, adding, “The Party for Socialism and Liberation is dedicated to building a revolutionary workers’ party in the United States […] For the working class, revolution is a necessity and a right. The most brutal aspects of capitalism will not go away unless there is a socialist revolution. Only a revolution can do away with the rule of the capitalists once and for all.” The far-left group’s 2024presidential platformopposed essentially all U.S. foreign policy efforts to confront U.S. adversaries. “The new Cold War against China and Russia must end, along with associated aggression like the proxy war in Ukraine, massive military shipments to Taiwan, or any and all military build up against any targeted nation,” PSL said. “The vast network of military bases the Pentagon maintains in other countries should be immediately closed. We demand the abolition of the NATO military alliance and AFRICOM. Cruel economic sanctions imposed on countries around the world – including Cuba, Venezuela, Zimbabwe, Eritrea, North Korea and Iran – must be lifted. All U.S. aid to apartheid Israel must immediately end.” PSL’s “Liberation School” The Communist group also hosts an online“Liberation School”which it says is an “educational site for activists and fighters.” “In addition to in-depth articles, analysis, and Party documents, Liberation School features a growing number of online courses as well as study and discussion guides to help a new generation of revolutionaries learn, study, and apply Marxist theory,” PSL says. There are dozens of lessons under the category of“Fundamentals of Marxism”and dozens of lessons under the category of“Marxist Theory”as well as more than a dozen lessons under the category of“The Soviet Union.” PSL says that in one lesson —“Lenin and the Path to Revolution”— PSL’s Becker “teaches the life and legacy of Lenin, the formation of Leninism, and the revolutionary paths it generated across the world.” Becker also put together a lesson for PSL and the People’s Forum on“The History of theCommunist Manifesto.” “Travel with The People’s Forum through a time machine to when theCommunist Manifestowas written!” the website says. “You will learn about the political and economic forces that made writing theManifestonot only possible, but necessary. This text created international and timeless ripples, inspiring the masses to organize themselves to fight for a worker-led society across the world.” PSL embraces Communist dictatorships The far-left group has also celebrated a number of Communist dictators. PSL has praised the Chinese Communist Party’s takeover of China. “Victory would have been unimaginable without the existence of the Chinese Communist Party and the extraordinary military it created, the People’s Liberation Army,” PSL’swebsitesays. “The CCP-led government charted a course to build a new, socialist society.” Becker, the co-founder of PSL, also wrote a piece for the communist group’s website attempting to whitewash the Tiananmen Square Massacre of 1989. “The hysteria generated about the Tiananmen Square ‘massacre’ was based on a fictitious narrative about what actually happened when the Chinese government finally cleared the square of protestors on June 4, 1989,” Beckerclaims. “The demonization of China was highly effective. Nearly all sectors of U.S. society, including most of the ‘left,’ accepted the imperialist presentation of what happened.” PSL has also repeatedly declared its love for Communist-led Cuba,writingin January, “We stand with the Cuban Revolution! … Today, on the 66th anniversary of the victory of the great Cuban Revolution, we in the Party for Socialism and Liberation send our warm greetings and solidarity to the Cuban people.” PSL’s Marxist “Liberation” merch store Despite being avowedly Marxist, PSL still features a“Liberation” merchonline store. Some of the merchandise is fairly standard leftwing fare: a“Cancel the Rent”poster, a“Build Schools Not Prisons”hat, and“Freedom for Palestine”gear.But much of it displays the group’s Communist and revolutionary aims. There arePaul Robesont-shirtsavailable for purchase. Robeson — a famous far-leftist — “supported and funded Communist-led organizations,”accordingto the African American Intellectual History Society. A“Revolutionary Study”poster shows a woman reading The Communist Manifesto by Karl Marx, a banner in her home featuring vicious dictators Vladimir Lenin and Joseph Stalin, a picture in her home featuring the Communist hammer and sickle, and a book by American Communist Angela Davis. A poster declaring that“The Future is Communist!”features a small child dressed as a CCP red guard or a People’s Liberation Army soldier. Andthereis a “hand-designed poster uplifting Vietnamese anti-colonial revolutionary leader and fighter Nguyen Thi Binh.” The National Museum of American Historysaidthat she was a “Vietnamese communist leader and politician who negotiated at the Paris Peace Conference on behalf of the Viet Cong.” PSL’s pro-Hamas stance PSL is openly hostile to Israel and defended the Hamas terrorist attacks which murdered hundreds of innocent civilians on October 7, 2023. “The unrelenting oppression, murder, torture and occupation carried out by the Israeli apartheid regime has precipitated a counter-offensive by Palestinian resistance forces. … The … false ‘terrorism’ label is being applied to the Palestinian people,” the Communist groupsaidthe day of the deadly jihadist attack. The PSL also says: “Resistance to apartheid and fascist-type oppression is not a crime! It is the inevitable outcome for all people who demand self-determination rather than living with the boot-heel of the oppressors on their necks.” PSLsaidon the one-year anniversary of the Hamas attacks that “one year ago, a mass movement in solidarity with Palestine emerged in the United States that transformed the political landscape of this country… The Party for Socialism and Liberation joins with so many other people around the world in this commitment: we will keep up the struggle until the occupation falls and Palestine is free from the river to the sea!” Backing away from Elias Rodriguez Elias Rodriguez, the confessed murderer of two Israeli Embassy staff members in the nation’s capital in May, had a previous association with one of PSL’s local chapters. “This brutal, anti-Semitic violence has no place in our country or anywhere in civilization,” Attorney General Pamela Bondisaidlast month when announcing murder charges. “We will follow the facts and secure the most severe possible punishment for the perpetrator of this heinous crime, which robbed two wonderful young people of a bright future together.” Rodriguez shot and killed Yaron Lischinsky, an Israeli national, and Sarah Lynn Milgrim, an American citizen, on the street outside an event for the American Jewish Committee.He reportedly shouted”I did this for Gaza. Free Palestine. There’s only one solution, intifada revolution” after the shooting. In a 2017 article on PSL’s Liberation News website, Rodriguez wasreportedlyphotographed at a protest holding signs distributed by ANSWER Coalition Chicago, and Rodriguez was quoted and described as being a member of PSL. The article has since been deleted, and PSL has denied any association with the murderer. “We reject any attempt to associate the PSL with the DC shooting,” PSLtweetedon May 22. “Elias Rodriguez is not a member of the PSL. He had a brief association with one branch of the PSL that ended in 2017. We know of no contact with him in over 7 years. We have nothing to do with this shooting and do not support it.” Neville “Comrade” Singham PSL’s links to Singham’s funding network are not surprising — the tech billionaire is a true Marxist. “For months we’ve been the target of a campaign that alleges our funding comes from ‘dark money.’ A few years ago we met Roy Singham, a Marxist comrade who sold his company & donated most of his wealth to non-profits that focus on political education, culture, & internationalism,” the People’s Forumtweetedin December 2021. SinghammarriedJodie Evans, the co-founder of the radical left-wing group Code Pink, in 2017. Her group touts itself as antiwar and has become increasingly pro-China in recent years. The New York Timesreportedthat Singham works in Shanghai, that his efforts there are linked to the CCP, and that he has attended at least one CCP workshop on promoting the party globally. The outlet also said Singham shares offices with a Chinese media company called Maku Group. The Chinese group’s“About Us”page — which has since been deleted but which was archived by the Wayback Machine in 2023 — says the goal of the company is to promote a positive vision of China worldwide. Singham alsowrotethat he had served on the Central Committee from the League of Revolutionary Black Workers. The league,according tothe Marxists Internet Archive, “played a key role in inspiring the Black Liberation Movement and spreading Marxist-Leninist ideas among Black workers and workers in general.” Singhamreportedlyworked as a “strategic technical consultant” with the Chinese government-linkedChinese telecom giant Huaweifrom 2001 to 2008, according toNew Lines Magazine. Then-senator and now Secretary of State Marco Rubiotoldthe Biden Justice Department that “it appears that organizations tied to Neville Roy Singham, a U.S. citizen, have been receiving direction from the CCP.” “I categorically deny and repudiate any suggestion that I am a member of, work for, take orders from, or follow instructions of any political party or government or their representatives,” SinghamtoldThe New York Timesin 2023. “I am solely guided by my beliefs, which are my long-held personal views.” – – – Jerry Dunleavy is a reporter for Just the News. **Post navigation** **Related posts** Trump Declares US-China Trade Deal ‘Done’ After London Talks Conservative Watchdog Judicial Watch Sours on Patel, Bongino: ‘Hostages of the Deep State’ Google Begs Employees to Quit as It Turbocharges AI Spending **CommentsCancel reply** Save my name, email, and website in this browser for the next time I comment. **BREAKING HEADLINES** DOJ Ousts Lawyer Who Said Abrego Garcia Deportation Was a MistakeU.S. Government Issues Sanctions on Los Chapitos Faction of Sinaloa CartelNews Sites Are Getting Crushed by Google’s New AI ToolsMeta’s Platforms Showed Hundreds of ‘Nudify’ Deepfake Ads, CBS News Investigation FindsMost Republicans Side with Trump over Musk: Poll DOJ Ousts Lawyer Who Said Abrego Garcia Deportation Was a Mistake U.S. Government Issues Sanctions on Los Chapitos Faction of Sinaloa Cartel News Sites Are Getting Crushed by Google’s New AI Tools Meta’s Platforms Showed Hundreds of ‘Nudify’ Deepfake Ads, CBS News Investigation Finds Most Republicans Side with Trump over Musk: Poll DOJ Ousts Lawyer Who Said Abrego Garcia Deportation Was a Mistake U.S. Government Issues Sanctions on Los Chapitos Faction of Sinaloa Cartel News Sites Are Getting Crushed by Google’s New AI Tools Meta’s Platforms Showed Hundreds of ‘Nudify’ Deepfake Ads, CBS News Investigation Finds Most Republicans Side with Trump over Musk: Poll **Story Calendar** The Pennsylvania Daily Star © 2023"}