{"id": 2206, "name": "FARK.com", "domain": "fark.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.fark.com/comments/13701352/A-shelter-dog-named-Sienna-is-being-praised-after-she-alerted-folks-at-an-adoption-event-that-a-man-shed-never-met-before-was-about-to-have-a-seizure-We-hope-attention-she-got-will-help-her-find-a-forever-home-in-time-for-Woofday-Wetnose-Wednesday-wvideo", "title": "A Shelter Dog Named Sienna Is Being Praised After She Alerted Folks At An Adoption Event That A Man Shed Never Met Before Was About To Have A Seizure We Hope Attention She Got Will Help Her Find A Forever Home In Time For Woofday Wetnose Wednesday Wvideo", "content": "FARK TotalFark myFark About/FArQ Contests Store Contact Us Mobile Main Discussion Sports Business STEM Entertainment Fandom D'awww Food Politics Otera:My MIL sent me a follow-up article on Benji this morning. He's now available for adoption YabbaDabbaDouchebag:With the missus recovering from hand surgery, and me caring for her,Cha Cha hasn't been getting her walks.So she's assembled all her stuffies in the living room, along with several of her (human) sibling's stuffies as well.[Fark user image 425x239] kdawg7736:[scontent-iad3-1.xx.fbcdn.net image 512x540] Diocletian's Last Cabbage:[Fark user image 425x280] Diocletian's Last Cabbage:kdawg7736: [scontent-iad3-1.xx.fbcdn.net image 512x540]The Mommas And The Puppers. Bathia_Mapes:[i.chzbgr.com image 752x750] CrankyAndi:Yesterday I went to my storage unit to look for Tootsie's thunder shirt. I could not find it easily......it is probably in a box somewhere. I checked boxes that I could get into but there are lots of boxes I cannot get to. So, I came home and ordered a new one from Amazon. It will be here today. It will be needed soon. And since it is Florida, we have lots of storms. It is the fireworks I dread. And I am guessing that there will be a lot of fireworks on this street. Lots of kids and people who no doubt will shoot off fireworks all night. sigh. I REALLY hate fireworks. CrankyAndi:Yesterday I went to my storage unit to look for Tootsie's thunder shirt. I could not find it easily......it is probably in a box somewhere. I checked boxes that I could get into but there are lots of boxes I cannot get to. So, I came home and ordered a new one from Amazon. It will be here today. It will be needed soon. And since it is Florida, we have lots of storms. It is the fireworks I dread. And I am guessing that there will be a lot of fireworks on this street. Lots of kids and people who no doubt will shoot off fireworks all night. sigh. I REALLY hate fireworks.Sophia is napping on the window seat after watching out the window for a bit. Forry is in front of the door and Tootsie is in front of the closet. We did our morning walk already which is good. We did get some more dog poop bags on our walk. the neighborhood provides bags for us. I'm sure there are some folks who do not like that they pay for the bags. People like to complain. LukeR:Rainbow hanging out with her friend Nala[Fark user image image 850x1133]Nala's got a friend that lives a couple of doors down from her and comes to the park with her. This is Ariel. She's a dachshund and maybe a pittie mix. She's longer than she is tall, doesn't take crap from any of the big dogs, and loves to put her paws on your shoulders when you're crouched down and nibble on your ears.[Fark user image image 850x1133] kdawg7736:[scontent-iad3-2.xx.fbcdn.net image 526x526] Want to see behind the curtain? Try It's how we feed the squirrel Sign up for the Fark NotNewsletter! TotalFark signup BareFark signup Purchase FarkUnits Purchase OhFark Top Links Top Comments Top Submitters Top Smart Comments Top Sources/Topics Top Funny Comments Press/Publicity All Latest Fark Forum Link Voting Sports Forum Fark Blogs Fandom Forum Fark Book Entertainment Forum Fark Quiz Politics Forum Fark Parties Fark Party Forum PS/Photo Browser Photoshop Forum Fark Chat Farktography Forum Discussion/TF Live Forum Top Commented Top Clicked Top Voted My Recent Commented Recent Mentions Links are submitted by members of the Fark community. Links are submitted by members of the Fark community. Links are submitted by members of the Fark community. When community members submit a link, they also write a custom headline for the story. When community members submit a link, they also write a custom headline for the story. When community members submit a link, they also write a custom headline for the story. Other Farkers comment on the links. This is the number of comments. Click here to read them. Other Farkers comment on the links. This is the number of comments. Click here to read them. Other Farkers comment on the links. This is the number of comments. Click here to read them. You need to create an account to submit links or post comments. You need to create an account to submit links or post comments. You need to create an account to submit links or post comments. Click here to submit a link. Click here to submit a link. Click here to submit a link. Also on Fark Fark ::Main|Discussion|Sports|Business|STEM|Entertainment|Fandom|D'awww|Food|Politics Total Fark ::TotalFark|TF Live|TF Advice|TF Discussion|Commented|Top Voted|Greenlit FArQ ::About Us|Quick Answers|Posting Rules|Farkisms Contests ::Photoshop|Farktography|Caption Buy Fark ::Fark Book|Fark Store Submit a Link » Copyright © 1999 - 2025 Fark, Inc | Last updated: Jun 11 2025 19:33:50Contact Us via Farkback|Report a bug/error msg|Terms of service/legal/privacy policy|Do Not Sell or Share My Personal InformationRuntime: 0.197 sec (196 ms)"}