{"id": 772, "name": "Kotaku", "domain": "kotaku.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://kotaku.com/eric-sparrow-thps-3-4-thug-underground-remake-cameo-ps5-1851784341", "title": null, "content": "Home Latest Entertainment Reviews News Tips & Guides Games EditionsEspañolDeutschFrançais Español Deutsch Français Español Deutsch Français Home Latest Entertainment Reviews News Tips & Guides Games **The Villain FromTony Hawk's UndergroundIs InTHPS 3+4** **Eric Sparrow fromTHUGcan be found and defeated once more in the upcoming remake** Players will be able to find a classic skater villain inTony Hawk’s Pro Skater 3+4when it launches in July on consoles and PC. And they’ll once again be able to defeat the asshole who first appeared back inTony Hawk’s Undeground. Off English Off English In a recent videofrom Jeff Gertsmann,as spotted byVGC, he was able to play and stream an early build ofTHPS 3+4and also showcase some b-roll footage of the game from Activision.THPS 3+4is a full remake of the PS2-era gamesTony Hawk’s Pro Skater 3and4, complete with new levels, improved visuals, and more. And it was in this video that Gertsmann revealed that Eric Sparrow fromTony Hawk’s Undergroundmakes an appearance in Waterpark, which is one of the remake’s new levels. Sparrow, sporting a new look, can be found in the waterpark-themed level and is part of an objective titled “Get Back at Eric Sparrow.” When touched, he will push the player and yell at them in a voice that sounds a lot like how he sounded in the OG PS2 game. Sadly, the build Gerstmann was playing didn’t let him actually complete the mission, so we aren’t sure yet how the player will “get back” at theTHUGvillain. It might involve grinding a piece of the map to knock over a large bucket filled with water above Sparrow. If you’ve never playedTHUG, then it’s just a random and odd challenge in a level filled with other things to do. If you have playedTHUG,you’ll remember Sparrow is a real assholewho screwed you over and betrayed you in that game’s campaign. So, is this a tease that Activision and Iron Galaxy have plans to develop a full remake ofTony Hawk’s Underground? Many fans of the series want that to happen.Even Tony Hawk himself has said he’d love a remake ofTHUG. “I always have aspirations,” Hawk toldScreenRantin May. “It’s not up to me generally. I’ll campaign all I can, but I’m working with a much bigger company that’s a lot smarter than me.” It’s also possible that while developing a brand new level inTHPS 3+4, Iron Galaxy decided to pay tribute to a fan favorite game in the series with a cheeky little cameo. We’ll have to wait and see what happens. ."}