{"id": 1721, "name": "Food Babe", "domain": "foodbabe.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://foodbabe.com/my-visit-to-the-white-house-exposing-big-food-and-advocating-major-food-chemical-reform/", "title": "My Visit To The White House Exposing Big Food And Advocating Major Food Chemical Reform", "content": "HOME START HERE ABOUTMy StoryMy BookPressPodcastsSpeakingAdvisory CouncilFAQContact My Story My Book Press Podcasts Speaking Advisory Council FAQ Contact My Story My Book Press Podcasts Speaking Advisory Council FAQ Contact BOOKSFood Babe Family (New!)Food Babe KitchenThe Food Babe WayFeeding You Lies Food Babe Family (New!) Food Babe Kitchen The Food Babe Way Feeding You Lies Food Babe Family (New!) Food Babe Kitchen The Food Babe Way Feeding You Lies BLOG INVESTIGATIONS RECIPES PRODUCTSMy BookSupplementsProtein PowderPersonal CareThe Only BarSugar DetoxJuice CleanseHow-To Guides My Book Supplements Protein Powder Personal Care The Only Bar Sugar Detox Juice Cleanse How-To Guides My Book Supplements Protein Powder Personal Care The Only Bar Sugar Detox Juice Cleanse How-To Guides LOGIN DONATE **My Visit To The White House – Exposing Big Food and Advocating Major Food Chemical Reform** ByFood Babe Someone needs to pinch me, because I almost can’t believe this is happening… I was invited to speak at the White House this week to advocate for safer food for our children. I was joined by a powerful coalition of moms who all want to get the harmful chemicals out of our food to protect our future generations. To have this opportunity to expose the truth about how Big Food poisons us with ingredients they don’t use overseas was a DREAM COME TRUE. I had my charts with me to show how billion-dollar corporations like PepsiCo, Kellogg’s, Mars, General Mills and Coca-Cola make safer versions of their products to sell in other countries. You could hear gasps in the room as I went through the ingredient comparisons! It was extraordinary to sit there across from the Department Secretaries (HHS, USDA, Education) where this is now a major topic of discussion! I’m so grateful that we now have leaders at the highest levels of government who are making this a top priority and looking to make changes fast. A post shared by Vani Hari | Food Babe (@thefoodbabe) This week really felt like a “pinch me” moment because I can’t believe how far we’ve come in just the past few months… Everything has been moving so fast, but nothing can stop us now. This week I alsospoke at the Florida State Capitalin support of a bill that will require warning labels on products with artificial dyes, just like they have in Europe. This is our moment! But there is so much work to be done. Most people still don’t know that food corporations have reformulated safer products to sell in Europe. Thank you for continuing to share and for being part of the Food Babe Army! Xo, Vani **Sign Up For Updates** Find out what to buy and where at the top grocery stores near you **You might also like:** Taking a Breather in Bali Taking a Breather in Bali Wonderful Wedding Weekend In Asheville Wonderful Wedding Weekend In Asheville Is Coconut Oil Healthy? The Controversy Explained Is Coconut Oil Healthy? The Controversy Explained Alina Habba,america vs europe,Artificial Dyes,Artificial Food Dyes,Banned ingredients,blue #1,Brooke Rollins,Chemicals Banned In Europe,Coca Cola,fda,General Mills,HHS,Karoline Leavitt,kellogg's,Kellogg's petition,Kraft,Linda McMahon,maha,make america healthy again,Pepsico,red 40,RFK Jr.,Robert f. Kennedy Jr.,school lunch,School lunches,speech,talk,the white house,us vs. uk,usda,Vani Hari,video,white house,Yellow #5,Yellow #6 Posts may contain affiliate, sponsorship and/or partnership links for products Food Babe has approved and researched herself. If you purchase a product through an affiliate, sponsorship or partnership link, your cost will be the same (or at a discount if a special code is offered) and Food Babe will benefit from the purchase. Your support is crucial because it helps fund this blog and helps us continue to spread the word. Thank you. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ Are your favorite foods safe from harmful additives? Blog Categories Popular Posts **Are you eating harmful food additives?** Get my 54 page report for FREE Start Cooking! Meal Plans, Grocery Lists and More Read the Blog Get the Book Investigations Recipes Shop Contact Ask Vani to Speak FAQ"}