{"id": 1496, "name": "Truth Be Told", "domain": "truthbetold.news", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://truthbetold.news/2023/04/ticketmaster-and-live-nation-entertainment-change-live-music-experience-for-concert-go-ers/", "title": "Ticketmaster And Live Nation Entertainment Change Live Music Experience For Concert Go Ers", "content": "Home News Election 2020 Fact-Checks A&EBig BrothaMusic Big Brotha Music Big Brotha Music For the Record Enduring Myths About UsOur TeamOur FundingTruth Be Told Wins $10K Poynter Flash GrantContact Us! Our Team Our FundingTruth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Contact Us! Our Team Our FundingTruth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Contact Us! Home NewsNo imageTruth be Told: DEI CompilationNo imageYouth with Disabilities Working and Accomplishing Their DreamsNo imageDebunking Drag—Family Friendly Art is Under Attack No imageTruth be Told: DEI Compilation No imageYouth with Disabilities Working and Accomplishing Their Dreams No imageDebunking Drag—Family Friendly Art is Under Attack No imageTruth be Told: DEI Compilation No imageYouth with Disabilities Working and Accomplishing Their Dreams No imageDebunking Drag—Family Friendly Art is Under Attack Election 2020Election 2024: The Ethical Dilemma of Billionaire InfluencersNo imageElection 2024: Local Candidates are the Foundation for Major Systemic ChangesNo imageElection 2024: The Power of the Latinx Vote: Why Every Vote Counts in 2024 Election 2024: The Ethical Dilemma of Billionaire Influencers No imageElection 2024: Local Candidates are the Foundation for Major Systemic Changes No imageElection 2024: The Power of the Latinx Vote: Why Every Vote Counts in 2024 Election 2024: The Ethical Dilemma of Billionaire Influencers No imageElection 2024: Local Candidates are the Foundation for Major Systemic Changes No imageElection 2024: The Power of the Latinx Vote: Why Every Vote Counts in 2024 Fact-ChecksNo imageNIL Truth be Told CompilationNo imageTruth be Told: DEI CompilationNo imageDebunking Drag—Family Friendly Art is Under Attack No imageNIL Truth be Told Compilation No imageTruth be Told: DEI Compilation No imageDebunking Drag—Family Friendly Art is Under Attack No imageNIL Truth be Told Compilation No imageTruth be Told: DEI Compilation No imageDebunking Drag—Family Friendly Art is Under Attack A&ENo imageEating Before Bed ≠ Weight GainThe Power of MusicTicketmaster and Live Nation Entertainment Change Live Music Experience for Concert go-ersBig BrothaMusic No imageEating Before Bed ≠ Weight Gain The Power of Music Ticketmaster and Live Nation Entertainment Change Live Music Experience for Concert go-ers Big Brotha Music No imageEating Before Bed ≠ Weight Gain The Power of Music Ticketmaster and Live Nation Entertainment Change Live Music Experience for Concert go-ers Big Brotha Music For the RecordNo imageStarbucks and their Watermelon Mug: A Mere CoincidenceWatching TV Before Bed is Not Beneficial for SleepExperts Seek to Diversify Tech Industry No imageStarbucks and their Watermelon Mug: A Mere Coincidence Watching TV Before Bed is Not Beneficial for Sleep Experts Seek to Diversify Tech Industry No imageStarbucks and their Watermelon Mug: A Mere Coincidence Watching TV Before Bed is Not Beneficial for Sleep Experts Seek to Diversify Tech Industry Enduring MythsDo Homeless People Really Not Want to Work?Watching TV Before Bed is Not Beneficial for SleepThe Facts About Voter Fraud Do Homeless People Really Not Want to Work? Watching TV Before Bed is Not Beneficial for Sleep The Facts About Voter Fraud Do Homeless People Really Not Want to Work? Watching TV Before Bed is Not Beneficial for Sleep The Facts About Voter Fraud About UsOur TeamOur FundingTruth Be Told Wins $10K Poynter Flash GrantContact Us! Our Team Our FundingTruth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Contact Us! Our Team Our FundingTruth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Truth Be Told Wins $10K Poynter Flash Grant Contact Us! By: Mekala Seme, student writer Eboni Brown was ecstatic when she secured pre-sale tickets to attend SZA’s “SOS” tour show at the Capital One Area in Washington, D.C. on Feb. 26. As an avid concert go-er, the North Carolina native and Howard University student has become a master at securing concert tickets using the infamous ticket sale and distribution company,Ticketmaster. Brown is from Goldsboro, North Carolina, a small and secluded town in the state’s eastern region. Up until her move to Washington, DC to attend Howard University in August of 2021, Brown’s live music experiences was almost non-existent. Over the past year, the junior international relations major has attended 10 concerts and plans on attending two more to cap off her concerts for the rest of the year. However, Brown is one among the many concertgoers, who have become frustrated with Ticketmaster ticket-selling practices. This past November, Ticketmaster’s owner was under fire by the United States Justice Department following the sale of tickets for Taylor Swift’s “The Eras” Tour. Ticketmaster systems crashed during the pre-sale for Swift’s tour, generating frustration and retaliation against Ticketmaster and Live Nation Entertainment from Swift’s fans. Like Swift’s fans, Brown’s experience with Ticketmaster is an experience met with many hurdles. Brown has learned to grapple with the long wait times, resellers, and website crashes while navigating Ticketmasters platform. “Every time I buy a concert ticket from a Live Nation affiliated artist, it’s a crazy time,” said Brown. In 2010, theDepartment of Justiceapproved the merging of Live Nation and Ticketmaster. Since the companies merged in 2010, they’ve been considered an “industry giant,” and have a monopoly over the live entertainment music industry which the Department of Justice originally sought to prevent. According to theNew York Times, Ticketmaster tickets “80 of the top 100 arenas in the country.” Ticketmaster and Live Nation are under investigation by the Department of Justice for their alleged violation of antitrust laws. More recently, three United States Senators have called on the Department of Justice to hold Ticketmaster and Live Nation Entertainment responsible for their practices. Richard Blumenthal (D-CT), Amy Klobuchar (D-MN), and Edward J. Markey (D-MA) addressed aletterto Attorney General Garland and Assistant Attorney General Kanter calling on the Department of Justice to break the merger between Ticketmaster and Live Nation and uncover any antitrust law violations. As the Department of Justice, and United States Senators are calling for transparency from Ticketmaster and Live Nation, fans are demanding it as well. Like Brown, Tusmo Olhaye was excited to see Sza at the Capital One Arena in Washington, D.C., but was quickly offset when she realized how much it would take to finance tickets. “I wish I got tickets earlier, or realized you could buy tickets at the box office,” said Olhaye. The junior Howard University student intended on buying tickets at the Capital One Arena when she realized nosebleed tickets were being sold on Ticketmaster’s website for over $400. By the time she arrived at the box office, Olhaye was discouraged to find out tickets for the concert had sold out. As summer is quickly approaching, artists have announced upcoming tour dates and locations across the United States and globally. Beyonce Knowles recently announced the beginning of her Renaissance World tour which is set to begin on May 10, 2023, in Stockholm, Sweden. The Renaissance World Tour will be the artist’s first solo tour since her “Lemonade” tour in 2016. The Renaissance tour announcement has become a part of the ongoing saga regarding the live music entertainment experience. Drake also announced his North American Tour “It’s All a Blur Tour” alongside rapper 21 Savage via Instagram on March 13. The tour is set to begin June 16, 2023, in New Orleans, Louisiana at the Smoothing King Center. Fans could get pre-sale access on Ticketmaster by accessing the pre-sale code onCash App. As fans anticipate new tour announcements, they also hope Ticketmaster doesn’t ruin the live entertainment music experience. “I’m inclined to go to concerts because there’s nothing like going to see my favorite artists, and knowing I’m gonna have a great time,” said Brown. “I wanna continue to experience concerts because you never know when the next time your favorite artist will go on tour.” The COVID-19 pandemic greatly impacted the live music entertainment experience. With so much uncertainty, fans want to engage with their favorite artists via concerts but Ticketmaster and Live Nation Entertainment have made it difficult to make this possible. **About Author** t.cms Credits Contact Us! **Searching** **Choose language** English French Chinese Japanese"}