{"id": 1108, "name": "Political Critique", "domain": "politicalcritique.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://politicalcritique.org/cee/hungary/2019/orban-sides-with-erdogan-against-the-thousands-of-hungarians-protesting-in-solidarity-with-rojava/", "title": "Orban Sides With Erdogan Against The Thousands Of Hungarians Protesting In Solidarity With Rojava", "content": "AboutIdeaContact UsSupport us!About Krytyka Polityczna Idea Contact Us Support us! About Krytyka Polityczna Idea Contact Us Support us! About Krytyka Polityczna Partners CEECzech RepublicLife in Skoda’s Factory TownCzechia, Slovakia, and some lessons learnedCzechia loses a voice, a university tries to lose its voice, and the PM voices a complaintAbortions, amnesties and accusations: September in Czech and Slovak politicsMoving a statue the Czech wayHungaryThe Future of European Gender PoliticsOrbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with RojavaBehind Viktor Orbán’s Surprise DefeatDoomed to Failure: Orban’s neoconservative family policies in HungaryPockets of resistance in Orbán’s HungaryPolandPoland’s Changing Climate ActivistsUnder Attack: Reproductive Rights in PolandHope and Fear in LGBT PolandPolitical Cynicism: The Case of PolandPoland’s Future: A view from the countrysideSlovakiaCzechia, Slovakia, and some lessons learnedAbortions, amnesties and accusations: September in Czech and Slovak politicsSlovakia: Restricted cinema in the era of economic transformationThe White Dream of Marian KotlebaWhere are you going, Slovakia?UkraineBLACK CLOUD – KYIV BIENNIAL 2019What Europe Does Ukraine need?Different languages and symbols but still our common fightA New Lexicon for a New InternationalAgainst National Vigilante Czech Republic Life in Skoda’s Factory TownCzechia, Slovakia, and some lessons learnedCzechia loses a voice, a university tries to lose its voice, and the PM voices a complaintAbortions, amnesties and accusations: September in Czech and Slovak politicsMoving a statue the Czech way Life in Skoda’s Factory Town Czechia, Slovakia, and some lessons learned Czechia loses a voice, a university tries to lose its voice, and the PM voices a complaint Abortions, amnesties and accusations: September in Czech and Slovak politics Moving a statue the Czech way Hungary The Future of European Gender PoliticsOrbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with RojavaBehind Viktor Orbán’s Surprise DefeatDoomed to Failure: Orban’s neoconservative family policies in HungaryPockets of resistance in Orbán’s Hungary The Future of European Gender Politics Orbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with Rojava Behind Viktor Orbán’s Surprise Defeat Doomed to Failure: Orban’s neoconservative family policies in Hungary Pockets of resistance in Orbán’s Hungary Poland Poland’s Changing Climate ActivistsUnder Attack: Reproductive Rights in PolandHope and Fear in LGBT PolandPolitical Cynicism: The Case of PolandPoland’s Future: A view from the countryside Poland’s Changing Climate Activists Under Attack: Reproductive Rights in Poland Hope and Fear in LGBT Poland Political Cynicism: The Case of Poland Poland’s Future: A view from the countryside Slovakia Czechia, Slovakia, and some lessons learnedAbortions, amnesties and accusations: September in Czech and Slovak politicsSlovakia: Restricted cinema in the era of economic transformationThe White Dream of Marian KotlebaWhere are you going, Slovakia? Czechia, Slovakia, and some lessons learned Abortions, amnesties and accusations: September in Czech and Slovak politics Slovakia: Restricted cinema in the era of economic transformation The White Dream of Marian Kotleba Where are you going, Slovakia? Ukraine BLACK CLOUD – KYIV BIENNIAL 2019What Europe Does Ukraine need?Different languages and symbols but still our common fightA New Lexicon for a New InternationalAgainst National Vigilante BLACK CLOUD – KYIV BIENNIAL 2019 What Europe Does Ukraine need? Different languages and symbols but still our common fight A New Lexicon for a New International Against National Vigilante Czech Republic Life in Skoda’s Factory TownCzechia, Slovakia, and some lessons learnedCzechia loses a voice, a university tries to lose its voice, and the PM voices a complaintAbortions, amnesties and accusations: September in Czech and Slovak politicsMoving a statue the Czech way Life in Skoda’s Factory Town Czechia, Slovakia, and some lessons learned Czechia loses a voice, a university tries to lose its voice, and the PM voices a complaint Abortions, amnesties and accusations: September in Czech and Slovak politics Moving a statue the Czech way Life in Skoda’s Factory Town Czechia, Slovakia, and some lessons learned Czechia loses a voice, a university tries to lose its voice, and the PM voices a complaint Abortions, amnesties and accusations: September in Czech and Slovak politics Moving a statue the Czech way Hungary The Future of European Gender PoliticsOrbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with RojavaBehind Viktor Orbán’s Surprise DefeatDoomed to Failure: Orban’s neoconservative family policies in HungaryPockets of resistance in Orbán’s Hungary The Future of European Gender Politics Orbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with Rojava Behind Viktor Orbán’s Surprise Defeat Doomed to Failure: Orban’s neoconservative family policies in Hungary Pockets of resistance in Orbán’s Hungary The Future of European Gender Politics Orbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with Rojava Behind Viktor Orbán’s Surprise Defeat Doomed to Failure: Orban’s neoconservative family policies in Hungary Pockets of resistance in Orbán’s Hungary Poland Poland’s Changing Climate ActivistsUnder Attack: Reproductive Rights in PolandHope and Fear in LGBT PolandPolitical Cynicism: The Case of PolandPoland’s Future: A view from the countryside Poland’s Changing Climate Activists Under Attack: Reproductive Rights in Poland Hope and Fear in LGBT Poland Political Cynicism: The Case of Poland Poland’s Future: A view from the countryside Poland’s Changing Climate Activists Under Attack: Reproductive Rights in Poland Hope and Fear in LGBT Poland Political Cynicism: The Case of Poland Poland’s Future: A view from the countryside Slovakia Czechia, Slovakia, and some lessons learnedAbortions, amnesties and accusations: September in Czech and Slovak politicsSlovakia: Restricted cinema in the era of economic transformationThe White Dream of Marian KotlebaWhere are you going, Slovakia? Czechia, Slovakia, and some lessons learned Abortions, amnesties and accusations: September in Czech and Slovak politics Slovakia: Restricted cinema in the era of economic transformation The White Dream of Marian Kotleba Where are you going, Slovakia? Czechia, Slovakia, and some lessons learned Abortions, amnesties and accusations: September in Czech and Slovak politics Slovakia: Restricted cinema in the era of economic transformation The White Dream of Marian Kotleba Where are you going, Slovakia? Ukraine BLACK CLOUD – KYIV BIENNIAL 2019What Europe Does Ukraine need?Different languages and symbols but still our common fightA New Lexicon for a New InternationalAgainst National Vigilante BLACK CLOUD – KYIV BIENNIAL 2019 What Europe Does Ukraine need? Different languages and symbols but still our common fight A New Lexicon for a New International Against National Vigilante BLACK CLOUD – KYIV BIENNIAL 2019 What Europe Does Ukraine need? Different languages and symbols but still our common fight A New Lexicon for a New International Against National Vigilante EU Talk Real World Events Follow us: Follow us: Follow us: **Orbán sides with Erdoğan against the thousands of Hungarians protesting in solidarity with Rojava** On a rainy November day, public transport broke down in important parts of Budapest under the burden of extraordinary security measures enacted for the visit of Turkish President Recep Tayyip Erdoğan. Erdoğan spent an entire day in the Hungarian capital as part of a visit that can best be described as a diplomatic middle finger to practically the entire world outraged by Turkey’s recent offensive in Northern Syria against the Kurdish forces of Rojava. Erdoğan is a relatively frequent visitor in Hungary, where he is welcomed every time by an enthusiastic Prime Minister Orbán and small groups of protesters. This time, however, the Northern Syrian operation — and the outrage against Orbán’s complacency towards it — brought thousands to the streets of Budapest as well as a couple of other Hungarian cities and towns. But the Turkish president was not the only authoritarian leader to pop in Orbán’s picturesque Buda Castle office in the last couple of weeks: Vladimir Putin has a habit of visiting his closest European allies at least once a year. On previous occasions, his arrival has also given rise to significant protests, although this time his visit passed with smaller waves. The two visits came in the context of, on the one hand, the Turkish invasion in Northern Syria and its settlement plan negotiated by the Russian president, and on the other hand, the intensifying discussions over the so-calledTurk Stream pipelinewhose construction began in February 2017. The pipeline is planned to transport Russian natural gas to Turkey, and later on to Central Europe, including Hungary. Turk Stream is aimed at circumventing Ukrainian territory for the transport of Russian gas, but in practice would also mean an increase in Turkish “blackmail potential”, which in many respects is already at a historic high point due to Ankara’s role managing migrant routes into Europe. Yet the two joint press conferences, held by Orbán with Putin and Erdoğan, made clear that the main nature of the visits was symbolic. Apart from a couple of minor agreements and declarations (in the fields of education, sport, social security, and culture), the leaders did not really cut any significant deals. For all three politicians involved, however, the meetings offered significant gains. For Putin, every visit in Budapest is atour de forcemeant to display the strong connection between the Hungarian and Russian governments and to send a message to European decision-makers about Moscow’s political clout within the European Union. Faced with strong diplomatic hostility from Poland and Romania — both of whom see themselves as bridgeheads of US presence in the region — Putin can demonstrate through his regular visits in Hungary that he is a regional player to be taken into account. For Erdoğan, the Hungarian trip was also a symbolic demonstration, one that tries to counteract Ankara’s almost total diplomatic isolation in the wake of its anti-Kurdish offensive. Faced with condemnation from large parts of the US diplomatic establishment (with the notable exception of Donald Trump) and the EU, Erdoğan used his Hungarian visit to show that he is not, in fact, a diplomatic pariah, but rather a respected world leader welcomed with extreme security measures and official acts of veneration in the capital of an EU member state. Hungary has been the only EU member not willing to condemn the military incursion into Rojava, and the Hungarian government has repeatedly vetoed any act that would show a unified European front on this issue. In response to the protest of Hungarian opposition MPs and civil society representatives, Orbán has repeatedly demonstrated that he does not care about reports of human rights abuses, war crimes, or civilian casualties. In a parliamentary intervention not long ago, the Prime Minister emphasized that Hungarian state interests lie exclusively in Turkey’s capacity and willingness to withhold Middle Eastern refugees from reaching the shores of the European Union. With this attitude, Orbán has lent credibility to Erdoğan’s repeated threats to Brussels and other European capitals that Turkey would open its borders to the refugees wanting to reach the EU. Realistically speaking, it cannot be denied that through its deals with governments like Turkey, Libya or Sudan, Brussels has placed extraordinary power and financial resources in the hands of authoritarian leaders, war criminals, and armed regional strongmen. In this sense, the Hungarian position towards Erdoğan can be considered less duplicitous. Nevertheless, the fact that the Hungarian government visibly sided with a foreign dictator, in opposition to its own protesting citizens, is a step that warrants attention. Besides the thousands on the streets who demonstrated their solidarity with the Syrian Kurds, large parts of Budapest’s inhabitants were simply outraged by the breakdown of the public transportation system and the closure of entire neighborhoods prompted by Erdoğan’s visit. The government’s response was that public transportation came to a halt because of the protesters (factually incorrect) who are undermining Hungary’s capability to “defend itself against the migrants”. At the joint press conference Orbán went so far as to claim that not only can he not accept ridiculing the leader of another country, but that if such an offense takes place, his role as head of the government is to apologize for it. Besides the obvious illiberal sympathies with Putin and Erdoğan, and Orbán’s own well-known anti-refugee brand, the close ties with Russian and Turkish autocrats have more profound structural underpinnings as well. As pointed outby the left-wing Hungarian scholarly community, Helyzet Műhely, the current Hungarian regimes can be understood as a constantly recalibrated attempt at constructing a hegemonic political-economic order which secures capital accumulation in the context of the long crisis of US hegemony and the postwar patterns of global capitalist production. Besides securing the interests of multinational capital and building a local “national” capitalist class, the internal economic stability of the regime also depends on the diversification of political and economic dependencies. Hence, since 2010 the Orbán’s governments have tried (and many times succeeded) to attract foreign investments from outside the Euro-American space: Russian mega-investment into the Paks 2 nuclear plant, and Chinese funding for the Budapest-Belgrade railway line are foremost examples of such a strategy. During these two recent visits, Orbán has repeated his mantra, that due to its geographical position Hungary is placed within the triangle of “Berlin-Moscow-Istanbul”, and thus needs to cultivate close ties with all three centers of power. Besides the fact that these investments have run entire generations of Hungarians into debt, the large-scale project of attracting multiple sources of foreign investment can only be sustained by sacrificing the interests of Hungarian workers. With its radically anti-labor agenda, the Hungarian government is increasingly placing the burdens of everyday physical and social reproduction exclusively on the shoulders of the individuals. At a certain point, this tension can seriously undermine the stability of this system of semi-peripheral capital accumulation that we call the Orbán regime. **Donate** Never has the world needed independent journalism more. PoliticalCritique.org relies on the support of our readers. Help us bring you the news that matters and make a contribution to support citizen journalism in the CEE region and beyond. Monthly recurring donation: One-time gift: We are an independent newsroom producing high-quality journalism in the public interest. We always provide our content free of charge. **Related Stories** Behind Viktor Orbán’s Surprise Defeat Doomed to Failure: Orban’s neoconservative family policies in Hungary Pockets of resistance in Orbán’s Hungary **Political Critique** Krytyka Polityczna | Stowarzyszenie im. Stanisława Brzozowskiego | KRS 0000242083, REGON 140369159, NIP 701-000-25-99 | Address: ul. Jasna 10, lok. 3, 00-013 Warsaw, Poland.[email protected]| +48 22 505 66 90 | fax: +48 22 505 66 84 |Terms and conditions of use|Cookie policy Home CEE World Talk Real In Pictures Podcasts Partners About Support us! Contact PoliticalCritique.org was active between 2010 and 2020. We are making its digital records available on this website free of charge. Find out moreabout the projectContact Krytyka Polityczna:krytykapolityczna.pl"}