{"id": 509, "name": "Frontiers in Big Data", "domain": "frontiersin.org/journals/big-data", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/big-data/articles/10.3389/fdata.2025.1603106/full", "title": "Big Data", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Big Data Networks Big Data and AI in High Energy Physics Cybersecurity and Privacy Data Analytics for Social Impact Data Mining and Management Data Science Data-driven Climate Sciences Machine Learning and Artificial Intelligence Medicine and Public Health Recommender Systems Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Big Data Networks Big Data and AI in High Energy Physics Cybersecurity and Privacy Data Analytics for Social Impact Data Mining and Management Data Science Data-driven Climate Sciences Machine Learning and Artificial Intelligence Medicine and Public Health Recommender Systems Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Big Data Networks Big Data and AI in High Energy Physics Cybersecurity and Privacy Data Analytics for Social Impact Data Mining and Management Data Science Data-driven Climate Sciences Machine Learning and Artificial Intelligence Medicine and Public Health Recommender Systems Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Big Data, 06 June 2025 Sec. Data Mining and Management Volume 8 - 2025 |https://doi.org/10.3389/fdata.2025.1603106 **Conceptual design of a decision knowledge service model integrating a multi-agent supply relationship diagram for electric power emergency equipment** 1State Grid Jinhua Power Supply Company, Jinhua, Zhejiang, China 2Modern Business Research Center, Zhejiang Gongshang University, Hangzhou, Zhejiang, China 3College of Artificial Intelligence & E Commerce, Zhejiang Gongshang University Hangzhou College of Commerce, Hangzhou, Zhejiang, China Introduction:The decision regarding the supply of emergency equipments for power emergencies requires timeliness, efficiency, and accuracy. The multi-agent supply relationship graph, based on complex data fusion, enables the comprehensive exploration of interconnections among key entities in power emergency supplies. Methods:This approach enhances decision-making efficiency and quality by uncovering multiple relationships between main bodies involved. The present study focuses on the decision-making process for power emergency equipments supply and aims to enhance its professionalization. To achieve this goal, multi-modal data regarding power emergency equipments supply is collected from both internal and external power enterprises. Subsequently, a decision support knowledge base is established, along with a four-dimensional relationship graph that integrates events, time, equipments, and suppliers based on the knowledge graph. This enables the mining of multidimensional relationships pertaining to the main body. Finally, supported by the graph, the platform can offer intelligent assistance in decision-making, supplier recommendation, optimization of emergency equipment scheduling for electric power supply, and provides effective information and guidance for decision-making in electric power emergency equipment supply. Results:After conducting a comparative analysis, the decision support system based on the knowledge graph proposed in this study demonstrates superior effectiveness and precision. By integrating the four-dimensional relationship graph with data mining algorithms, precise decision support can be provided for power emergency response. After verification through case studies, the model developed in this study was utilized to recommend suppliers of power emergency equipment, and the recommendation results demonstrated a closer alignment with actual procurement outcomes. Conclusion and recommendation:This system proposed by this study delivers multidimensional knowledge guidance and optimized decision pathways for emergency supply management. **1 Introduction** Effective management of electric power emergencies is critical for preventing, mitigating, and minimizing the impact of unforeseen disruptions. In recent years, frequent natural disasters have triggered widespread power outages, severely affecting both livelihoods and industrial production. Rapid restoration of power supply during emergencies is essential to minimize socioeconomic disruptions. Moreover, given the inherent unpredictability of large-scale power outages, a robust emergency equipment dispatching and response system is indispensable for effective crisis management. Such a system enables data-driven decision-making for emergency resource allocation, thereby reducing losses during power crises. The integration of digital technologies and big data analytics enables knowledge-based decision-making for power emergency supply management, providing scientifically grounded, rational, and efficient allocation strategies. Furthermore, this approach significantly reduces costs and improves energy efficiency, positioning it as the future standard for power emergency supply decision-making. A knowledge graph (KG) is an intelligent knowledge base integrating principles from knowledge engineering, artificial intelligence, and traditional databases. KGs organize heterogeneous data while supporting intelligent information management, exploration, and mining (Wang et al., 2020). Furthermore, KGs facilitate intelligent search, question-answering systems, recommendation mechanisms, and decision-making support (Sawant et al., 2019;Li et al., 2021). These capabilities have seen growing adoption across finance, public security, healthcare, and other sectors (Zhu et al., 2024). The power industry has similarly adopted KG technologies for specialized applications including grid scheduling, marketing, operations, and equipment inspection (Sun et al., 2023;Zhao et al., 2015). KG construction typically involves four core processes: knowledge extraction, representation learning, knowledge mining, and knowledge reasoning/fusion (Wu et al., 2018). Artificial intelligence technology facilitates knowledge graph construction by extracting nodes and relationships from extensive power system data, integrating complex information into a unified structure that enhances management efficiency (Wu et al., 2024). The processed data enables the establishment of power industry standards and offers practical guidance for engineering applications. KGs enable synchronization and coordination across power system subsystems by establishing relationships among system entities. Time-series-based dynamic knowledge graphs support real-time updates of nodes and relationships, enabling adaptation to both system upgrades and external environmental changes (Ji et al., 2021). Platform-based organizations have gained widespread adoption across industries, enabling intelligent service integration, cross-departmental data sharing, and comprehensive service support. The platform model has become predominant in business, with Amazon and Alibaba representing prominent examples. O'Reilly extended the platform concept to government governance through the “government as a platform” paradigm, accelerating public administration digital transformation. As demonstrated, KGs enable data-driven decision-making by systematically analyzing entity relationships, improving both operational efficiency and analytical accuracy through existing data resources. However, existing research lacks a comprehensive theoretical framework for integrating entity-relationship graphs with AI technologies using platform-based approaches. In practice, emergency power resource allocation requires consideration of multiple complex factors: resource inventories, multi-agent supply networks, socioeconomic conditions, and environmental variables. Systematically enhancing knowledge graphs is essential to bridge the supply-demand gap for emergency power resources. Thus, developing a multi-agent supply-relationship knowledge graph system for power distribution decision-making is critically important. This study addresses these theoretical and practical challenges through two key research objectives: (1) Developing an integrated theoretical framework combining inter-agent network relationships with platform organization theory, enhanced by multi-agent power supply relationship knowledge services to expand both domains' theoretical and applied boundaries. (2) Creating a four-dimensional knowledge graph (events-time-equipments-suppliers) and corresponding decision-support platform to optimize intelligent power equipment supply decisions through multi-agent relationship modeling. **2 Literature review** **2.1 The application of KG in electric power** Network structures effectively model complex relationships and serve as fundamental components in computational social science research (Lazer et al., 2020). Recent research has successfully applied network analysis across multiple domains, including finance (Kejriwal, 2021), crisis informatics (Sadri et al., 2021), and biotechnology (Szklarczyk et al., 2021). Specific network algorithms, particularly link prediction and community detection methods, have enabled advanced applications like collaborative forecasting and group pattern mining (Kumar et al., 2020;Jin et al., 2023;Ju and Cao, 2025). KGs are built upon structured semantic knowledge bases that represent entities as nodes and relationships as edges in graph structures (Yan et al., 2018). The KG represents entities and relations as triplets, specifically in the form of “entity-relation-entity”, while the characteristics of entities are represented using the format of “attribute-attribute value” (Hogan et al., 2021). The construction process of a KG involves four essential steps: knowledge extraction, learning of knowledge representation, mining of knowledge, and reasoning and fusion of knowledge. The extraction of terms can be facilitated through the utilization of dictionaries, rules, statistics, and machine learning techniques (Etzioni et al., 2008). Relationship and concept extraction utilizes both linguistic and statistical methods (Zhou et al., 2014;Fu et al., 2020). Representation learning transforms real-world knowledge into computational representations (Viloria and Lezama, 2019). Traditional representation learning models include TransE, TransR, TransD, TransG, and TransH (Cesar et al., 2019). Recent advances have introduced new models including MGTransE (Warren et al., 2019) and KG2E (Lei et al., 2020). Knowledge mining identifies novel entity relationships to enrich the KG (Zhang et al., 2021). This phase utilizes link prediction, neural networks, and decision trees to infer implicit relationships. The goal is to discover potential future collaborative relationships. Finally, KGs require continuous updating to reflect evolving entities and relationships. Key updating algorithms include NBFNET (Zhu et al., 2021), PALT (Shen et al., 2022), KGLM (Youn and Tagkopoulos, 2022), and LP-BERT (Li et al., 2023). An event relationship graph represents event logic through nodes (events) and directed edges (causal/consequent relationships), forming a cyclic structure that captures event development patterns and evolutionary mechanisms. As an extension of KGs, event graphs specifically model dynamic event causality and underlying mechanisms. Neural networks and pre-trained models now dominate event extraction tasks (Du and Cardie, 2020;Ma et al., 2022), outperforming traditional pattern matching and machine learning approaches. Relational recognition identifies and classifies textual relationship pairs, employing either rule-based knowledge bases (Kosari et al., 2024) or deep learning methods for implicit semantic relationship extraction (Che et al., 2021). Relational recognition aims to identify relationship pairs in text and classify their semantic types. KGs enable semantic search and intelligent question answering by inferring implicit relationships from existing entity connections. This approach improves both search accuracy and result predictability. Furthermore, it supports abnormal behavior detection (Hatirnaz et al., 2020), managerial relationship analysis (Chen et al., 2020), and news article clustering (Kallipolitis et al., 2012). Intelligent Q&A systems enhance online customer service through advanced AI capabilities. Multi-modal Q&A systems have attracted considerable research attention. These systems have been applied in diverse domains including education (Yang et al., 2021), healthcare (Peng et al., 2025), voice interfaces (Kumar et al., 2017), tourism (Do et al., 2021), traditional medicine (Yu et al., 2017;Xiong et al., 2021), and finance (Ma et al., 2021). KGs utilize existing node relationships to predict future connections. Consequently, they have become increasingly sophisticated with AI advancements, finding wide application in power forecasting, scheduling, and related domains. Current applications demonstrate significant efficacy in: power load forecasting (Yin and Xie, 2021;Sheng et al., 2021), fault diagnosis (Zera and Ayati, 2021), system optimization (Xi et al., 2021), resource scheduling (Ong et al., 2021), and maintenance detection (Liu et al., 2022). **2.2 Power emergency equipments supply decision-making** Emergency power equipment distribution utilizes demand forecasting and storage facility locations to enable precise dispatching, ensuring supply-demand matching throughout the process and effectively reducing the impact of power outages. Non-standardized emergency power equipments storage complicates reserve quantity determination and increases response time requirements. Effective reserve quota management ensures adequate power grid emergency equipment reserves, while analyzing key influencing factors is essential for quota optimization (Huang, 2019). Scholars have applied the DEMATEL method to quantify interrelationships among indicators and classify power emergency equipments by identifying key influencing factors (Zhang et al., 2024). For reserve warehouse location, researchers have developed the fuzzy evaluation model for site selection, multi-objective path optimization model (Wan et al., 2023), and the mobile storage configuration model (Jiang et al., 2021). For equipment distribution,Mojtaba et al. (2016)developed a dynamic model maximizing disaster site utility under supply-demand, time, and transportation constraints.Zhuang and Zhang (2023)utilized the SEIR model to predict emergency equipment demand during public health crises and also created an optimization model minimizing both shortage impacts and distribution distances. **2.3 Limitations of current research** Current research on knowledge graphs, relationship graphs, and power emergency supply decision-making has developed effective optimization methods and produced significant findings in supply strategies. However, scholars have largely overlooked the relationship between graph construction and electric emergency supply management. Optimizing power emergency supplies requires intelligent, data-driven decision-making with scientific rigor and timeliness. Rational allocation and scientific planning are essential for multi-agent supply chain coordination. Relationship graphs effectively model entity relationships and demonstrate strong event reasoning capabilities. Current knowledge and reasoning graphs fail to adequately model the complex time-event-supplier-equipment relationships in power emergency supply scenarios. They also lack comprehensive decision-support capabilities for emergency supply management. Therefore, a multi-agent supply relationship graph system would provide significant theoretical and practical benefits for power emergency decision-making. This approach would both expand knowledge graph applications and optimize power emergency supply decisions. **3 Methods** Following platform organization principles, developing a decision knowledge service system involves three core tasks: (1) Role integration within the system; (2) Platform module design using reusable knowledge bases and algorithm libraries; (3) Coordinated resource integration among stakeholders including equipment suppliers, power departments, technical personnel, and management entities. This internet-connected, multi-terminal platform enables efficient emergency equipment management and intelligent decision support. This study follows a three-platform framework construction process: (1) Role and function identification, (2) function library construction, and (3) platform construction, as shown inFigure 1. Figure 1. The method of platform construction. **3.1 Roles and functional identification** Big data-driven role identification for power emergency equipment decision-support platforms, augmented by process expertise, improves operational accuracy. Domain policy documents provide comprehensive guidelines that govern all roles and behaviors within the power emergency ecosystem. Keyword extraction from these policy documents identifies role-specific functions, clarifying the platform's operational responsibilities. First, we collected power emergency equipment supply policies from the Chinese government's official website to build the text corpus. Second, we used Python's Jieba library for Chinese word segmentation, followed by stop-word removal and TF-IDF analysis to identify term importance. Finally, we ranked roles and functions by TF-IDF values, selecting the top five most significant contributors for platform development. **3.2 Function library construction** Following role identification, we acquire data and construct preliminary databases through two primary approaches: (1) Role-specific internal data including workflows and equipment metadata; (2) Open data including patents and standards which involve structured, semi-structured, and unstructured data formats. Comprehensive data collection is essential for optimal platform functionality. Entity/characteristic extraction identifies and extracts relevant terms from power emergency-related unstructured data. We employ a Hidden Markov Model (HMM) for corpus classification. In HMM-based segmentation, each observed word corresponds to a hidden state. The state set G = {B, M, E, S} represents: B-beginning, M-middle, E-end, and S-single character words. We augmented segmentation accuracy using a domain-specific power emergency terminology dictionary. Segmented words matching the domain dictionary become knowledge graph entity/characteristic nodes. The term “coreference resolution” refers to the process of identifying and linking entity/characteristic that have the same meaning but are expressed differently within the power emergency equipments corpus. The specific steps are as follows: (1) Tokenization using Python's Jieba package and POS tagging; (2) The word2vec algorithm is employed to vectorize each term within the set of parts of speech. The vector dimension is set to 50, and the part of speech set after vectorization is Vword= (v1, v2, v3, L, v50). (3) Similarity calculation via Formula 1 (higher values indicate stronger semantic similarity). Coreference established at cosθ ≥ 0.88 threshold. Relation extraction identifies relationships between entities in power emergency equipment corpora. We employ BERT for domain-specific relationship extraction due to its effectiveness with power systems' unique attributes.Figure 2illustrates the relationship extraction pipeline. Figure 2. Relationship extraction process. Traditional knowledge graphs represent facts as triplets (v1, r, v2), where v1 and v2are entities connected by relation r. However, power emergency supply decisions require more comprehensive relationship representations than single triplets provide. They demand multi-dimensional relationship characterization. We propose a four-dimensional graph architecture for power emergency supply decision support, incorporating: (1) knowledge domains, (2) top-level designs, (3) spatiotemporal sequences, and (4) equipment responses, enabling efficient knowledge reasoning. As shown inFigure 3, our four-dimensional relationship graph is formally defined as Gr = (S, G, I, T, R), where: Figure 3. Construction logic for the four-dimensional relationship graph of power emergency supply. S: supplier dimension (entity and attributes) G: equipment dimension (required resources and attributes) I: event dimension (emergency characteristics) T: temporal dimension (event timeline) R: relationship set (inter-dimensional connections) R = {R (S, G), R (S, I), R (S, T), R (G, I), R (G, T), R (I, T), R (G, I, T), R (S, I, T), R (S, G, T), R (S, G, I)}, The relation set R contains logical reasoning relationships such as conditional, compositional, and causal relations. Figure 3adepicts event-time-equipment relationships centered on emergency equipment suppliers. It shows temporal event patterns and corresponding equipment supplies.Figure 3billustrates, with suppliers as the focal nodes, the provider-equipment correlations during power emergency events.Figure 3canalyzes supplier-equipment-time responses to emergency events.Figure 3dvisualizes event-supplier-equipment temporal interactions at discrete time points. Each graph's vertices represent pairwise entity correlations. These 4D relationships enable historical and cross-event comparative analyses. Reasoning techniques applied to these models yield scientific decision support for emergency supply management. **3.3 Function clarity and platform construction** Platform functions are determined through combined function keyword extraction and expert consultation, guiding appropriate data mining technique selection. These functional requirements were then implemented using the relational graph structure. The platform architecture provides accessible, encapsulated function packages, maintaining core platform principles while ensuring scalability. The final architecture incorporates specialized functionalities for power emergency equipment decision support. **4 Conceptual design of a decision-knowledge service model** **4.1 Data sources** We collected 23 highly relevant policy documents (2014-present) from Chinese government portals, selected through role-function analysis. For relational graph construction, we utilized emergency equipment management data from State Grid's Jinhua branch. This dataset reflects years of accumulated emergency response experience. We anonymized data by replacing organizational identifiers with numerical codes. Preprocessing included: (1) missing value imputation, (2) duplicate removal, and (3) noise filtration. The dataset contains both structured and unstructured records: (1) Structured: equipment inventories, demand logs (standardized formats); and (2) Unstructured: incident reports (variable formats requiring complex processing). **4.2 Role identification and function identification** Applying the Section 3.1 methodology, we extracted keywords, computed TF-IDF values, and generated separate rankings for role and function keywords.Table 1presents these keyword rankings. Table 1. Roles and functions of knowledge service platform. **4.3 Function library construction** Constructing the power emergency supplies knowledge base requires four key processes: (1) information acquisition, (2) knowledge extraction, (3) knowledge fusion, and (4) knowledge updating.Figure 4details this knowledge base construction workflow. Figure 4. The construction process of the knowledge base for power emergency supplies supply. Building a reliable knowledge service platform for power emergency supplies requires verifiable, objective data sources. These sources form the foundation for modeling supply-chain relationships in power emergency systems. The platform must integrate multi-format data including structured, semi-structured, and unstructured statistics, texts, and charts. The knowledge base must span multiple administrative levels, from international standards to local enterprise data, to adequately support emergency power supply needs. Power emergency supply information sources divide into internal (professional) and external categories. Internal sources include both subsidiary-level and cross-departmental headquarters data. External sources consist of supplier-provided data and publicly available information. Data integration leverages internal expertise while incorporating diverse external sources.Figure 5details this knowledge source classification framework. Figure 5. Data source and classification. Internal data originates from power companies, comprising emergency event records, equipment inventories, supplier databases, and related operational data. Company intranets host additional headquarters documents including standards, notices, and minutes, along with provincial and subsidiary company equipments. Structured/semi-structured internal data includes technical specifications, feasibility studies, project acceptance reports, and internal media releases. These datasets require classification, organization, thematic tagging, and keyword/phrase extraction. External data collection integrates multiple sources, including public online data and supplier submissions. Web-based sources provide economic indicators, policy documents, industry trends, and corporate performance metrics. Regulatory agencies' websites serve as primary sources for official industry development news. Energy corporations' websites offer operational updates through news releases and official statements. Power companies additionally publish industry-specific research reports through official channels. These include expert policy analyses and industry development interpretations. Scientific research data provides theoretical foundations for optimizing emergency power supply decisions. This research data originates from global academic platforms. Patent data is acquired from Derwent Innovation Index. Supplier data interfaces provide access to: business registrations, equipment specifications, storage capacities, and transportation logistics. Entity labeling in the knowledge base enables efficient resource management while supporting entity relationship mapping and knowledge mining. Labels are metadata-defined, describing entity/attribute characteristics. This framework supports resource discovery, retrieval, management, and tracking. Our template-based metadata extraction analyzes power emergency resources from: (1) academic databases (e.g., CNKI), (2) government documents, and (3) energy company publications. Key metadata attributes encompass topics, keywords, publishers, timestamps, and usage metrics. The labeling system allows customizable field-specific collection, intelligent label-entity matching, and autonomous semantic expansion. Figure 6illustrates the fact ontology construction process through data-to-model layer mapping. This transformation converts knowledge databases into structured graphs while supporting unified knowledge management. Figure 6. Power emergency equipment supply ontology and relationship construction. The emergency power supply knowledge base integrates multidisciplinary data from diverse sources. Its hybrid methodology combines data-driven bottom-up processing and knowledge-driven top-down structuring. The bottom-up approach analyzes structural patterns to incrementally build ontologies from heterogeneous external data. The top-down method leverages existing power system knowledge to enhance KG robustness for complex scenarios. While structured data imports directly into databases, unstructured data frequently contains input errors and semantic ambiguities from manual processing. Data cleansing ensures unstructured data accuracy. We first apply a Hidden Markov Model (HMM) for semantic analysis, then combine it with domain-specific terminology to perform word segmentation. Next, we filter irrelevant corpus using a power emergency equipment dictionary. Finally, we detect and remove anomalies in the emergency equipments data.Figure 7details this workflow. Figure 7. Workflow of data processing and graph construction. Using the Section 3.2.2 relation extraction method, we establish inter-entity relationships. This extraction yields multidimensional relationships (Figure 4) between identified entities. We implement these relationships in Neo4j, producing the relationship graph shown inFigure 8. Figure 8. Relationship graph of electric power emergency equipments. **4.4 Platform architecture design** The Power Emergency Equipments Decision-Support Platform is designed to meet operational requirements of emergency power supply management. By leveraging comprehensive supply chain data, it delivers intelligent decision-support capabilities for emergency response scenarios. Shown asFigure 9. Figure 9. Functional architecture of the power emergency equipments supply decision support service platform. The data layer performs core data acquisition and preprocessing functions. Data sources, which contains predominantly semi-structured and unstructured documents and minimal structured data, include both internal emergency records and external inputs from suppliers, policies, patents, and literature. This layer acquires/stores raw data and analyzes structured formats (Excel, JSON, etc.) through import, parsing, and structured storage operations. Then semi-/unstructured data preprocessing includes text cleansing (noise removal, term normalization) and object standardization. The fusion layer critically enables power emergency knowledge base construction. A multi-agent relationship map integrates fragmented data to support knowledge base development. This layer performs NLP, knowledge extraction, and integration functions. NLP focuses on text annotation through segmentation, semantic analysis, POS tagging, corpus classification, and topic modeling. These techniques enable deep knowledge understanding. Neo4j stores entities, attributes, and relationships within the fusion layer, which supports ontology fact creation, many-to-many relationship mapping and robust knowledge base development with advanced reasoning capabilities. The inference layer supplies algorithmic models for upper-level applications, including representation learning, relational inference, graph search, path computation and contextual inference. Representation learning converts inputs into discriminative features to interpret user intent. Relational inference deduces logically connected knowledge points from user queries. Graph search accurately matches queries to knowledge base elements. Path computation generates adaptive learning trajectories by optimizing knowledge sequences. Contextual inference analyzes trending topics and provides predictive insights. As the platform's output module, the application layer enables user interaction and real-world implementation through supplier recommendation/valuation, intelligent supply chain management, decision support with path planning and emergency technology forecasting. Beyond operational decision-making, it provides research insights for power emergency management. Role-based access control with tiered portals and confidentiality protocols ensures enterprise-grade security. The platform incorporates a feedback mechanism that evaluates prediction accuracy during user interactions and overall system performance. Specific metrics assess supplier recommendation quality and emergency resolution efficacy. Feedback analysis drives continuous improvement through data/algorithm optimization, relationship graph reasoning updates and supply-demand pattern discovery - enabling precise decision support. **4.5 Validation of the decision knowledge service model** Our multi-agent power supply relationship platform provides intelligent support for emergency decisions, supplier recommendations and equipment scheduling optimization. Given system complexity, we focus validation on representative supplier recommendations. The evaluation using historical power emergency events. By extracting event keywords via text mining and identifying the most relevant knowledge base matches via case similarity analysis, this yields optimal equipment/supplier recommendations. We validate superiority by comparing our multi-agent approach with conventional knowledge graph methods. Results demonstrate our method's advantages. We analyzed five representative power emergency events (2024–2025; seeAppendixfor details). To prevent bias, we first excluded these events' data from similarity assessments. For each event description, we conducted platform-compatible word segmentation and vectorization.Table 2displays representative word vectors from Case 1. Table 2. Keyword vectors for case studies (case 1, partial data). We computed case-to-knowledge base similarity scores using vector distance metrics. The highest-scoring match yielded the optimal equipment supplier.Table 3presents the recommended supplier (with database-derived identifiers). These recommendations help purchasers overcome emergency equipment procurement challenges and which proves particularly valuable for unprecedented events. Table 3. Recommended optimal equipment and suppliers for case study (to be procured). Current research predominantly employs knowledge graphs as foundational frameworks for decision-support systems. We accordingly evaluate our model's effectiveness through comparative analysis with established knowledge graph approaches proposed bySun et al. (2023), highlighting our methodological advantages. For all five case events, we compared each model's recommended supplier counts against actual procurement data.Table 4presents these comparative results. Our model's recommendations demonstrate significantly closer alignment with actual procurement outcomes than the baseline knowledge graph approach. These results validate our model's superior efficacy. Table 4. Comparison of different models with actual procurement data. **5 Summary** This study constructs a 4D relationship graph modeling power emergency supply chains by employing knowledge engineering and AI techniques to aggregate internal and external emergency supply data from the power industry, tailored to demand patterns. This framework reveals implicit time-event-supplier-equipment correlations, enabling intelligent emergency supply decisions. Our multi-agent supply network emphasizes critical supply chain interdependencies. The system adapts to stakeholder-specific needs, enables holistic data analysis, and enhances both data utility and emergency decision-making. Leveraging digital technologies (data processing, mining, and algorithmic modeling), we develop a conceptual framework for power emergency supply decision support. The four-tier architecture (data, fusion, reasoning, application) enables a complete data-to-knowledge-to-service pipeline. This system delivers multidimensional knowledge guidance and optimized decision pathways for emergency supply management. **6 Research limitations and future directions** While this conceptual framework establishes foundational planning, several limitations require attention. First, internal data (event records, policies) demonstrate high reliability, but external supplier data necessitates advanced validation techniques to ensure accuracy. Second, internal data interoperability and sharing protocols require refinement. Additionally, external data acquisition demands improved timeliness and quality control. Furthermore, knowledge base construction methodologies need comprehensive development. Finally, the platform requires modular, scalable architecture for decision-support services. It is imperative to conduct high-quality learning and training on extensive samples of knowledge reasoning models, accurately comprehend the interrelationships between events, and precisely investigate and assess the evolutionary patterns and developmental trends of such events. The challenge in enhancing the knowledge service platform lies in effectively leveraging graph analysis technology to optimize data resource utilization, enabling intelligent cognition and reasoning. Additionally, it involves integrating human-computer interaction to accurately transmit and provide feedback on reasoning requirements, as well as consolidating reasoning results for decision-making assistance. **Data availability statement** The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. **Author contributions** JS: Conceptualization, Writing – original draft. CL: Conceptualization, Investigation, Writing – original draft. JY: Conceptualization, Data curation, Writing – review & editing. JWu: Data curation, Writing – original draft. JWa: Data curation, Software, Writing – original draft. KH: Writing – original draft. CJ: Conceptualization, Writing – review & editing. QC: Writing – original draft. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was supported by Major Project of National Social Science Foundation (21ZD119). **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Cesar, S., Zhang, H., Imran, S., Maqbool, M. W., Silva, D. C., Edward, S., et al. (2019). Experience based knowledge representation for internet of things and cyber physical systems with case studies.Future Gener. Comp. Syst. Int. J. e-Sci.92, 604–616. doi: 10.1016/j.future.2018.01.062 Crossref Full Text|Google Scholar Che, W. X., Feng, Y. L., Qin, L. B., and Liu, T. (2021). “N-LTP: an open source neural language technology platform for Chinese,” inThe 2021 Conference on Empirical Methods in Natural Language Processing: System Demonstrations (EMNLP)(Punta Cana), 42–49. doi: 10.18653/v1/2021.emnlp-demo.6 Crossref Full Text|Google Scholar Chen, T., Zhang, S. J., Wang, Y., Chen, Z. B., and Jing, W. F. (2020). Construction methods of knowledge mapping for full service power data semantic search system.J. Signal Process. Syst. Signal Image Video Technol.93, 275–284. doi: 10.1007/s11265-020-01591-6 Crossref Full Text|Google Scholar Do, P., Phan, T., and Gupta, B. B. (2021). Developing a vietnamese tourism question answering system using knowledge graph and deep learning.ACM Trans. Asian Low-Resour. Lang. Inf. Process.20:81. doi: 10.1145/3453651 Crossref Full Text|Google Scholar Du, X., and Cardie, C. (2020). “Event extraction by answering (almost) natural questions,” inProceedings of The 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)(Punta Cana), 671–683. doi: 10.18653/v1/2020.emnlp-main.49 Crossref Full Text|Google Scholar Etzioni, O., Banko, M., Cafarella, M. J., Soderland, S., and Broadhead, M. (2008). Open information extraction from the web.Communication ACM51, 68–74. doi: 10.1145/1409360.1409378 Crossref Full Text|Google Scholar Fu, S. Y., Chen, D., He, H., Liu, S. J., Moon, S., Peterson, K. J., et al. (2020). Clinical concept extraction: a methodology review.J. Biomed. Inf.109, 1–16. doi: 10.1016/j.jbi.2020.103526 PubMed Abstract|Crossref Full Text|Google Scholar Hatirnaz, E., Sah, M., and Direkoglu, C. (2020). A novel framework and concept- based semantic search interface for abnormal crowd behaviour analysis in surveillance videos.Multimed. Tools Appl.79, 17579–17616. doi: 10.1007/s11042-020-08659-2 Crossref Full Text|Google Scholar Hogan, A., Blqmqvist, E., Cochez, M., D'amato, C., de Melo, G., et al. (2021). Knowledge Graphs.ACM Comput. Surv.54, 1–37. doi: 10.1145/3447772 Crossref Full Text|Google Scholar Huang, X. (2019).Research on Reserve Distribution and Application of Power Grid Emergency Materials Based on Internet of Things. Beijing: China Beijing North China Electric Power University. Google Scholar Ji, S. X., Pan, S. R., Cambria, E., Marttinen, P., and Yu, P. S. (2021). A survey on knowledge graphs: representation acquisition and applications.IEEE Trans. Neural Netw. Learn. Syst.33, 494–514. doi: 10.1109/TNNLS.2021.3070843 PubMed Abstract|Crossref Full Text|Google Scholar Jiang, X. Y., Chen, J., Chen, M., Qiu, J. F., Peng, B., Yang, T. Y., et al. (2021). Optimal configuration of mobile energy storage in resilient distribution network considering efficiency improvement.Southern Power Syst. Technol.15, 40–47. doi: 10.13648/j.cnki.issn1674-0629.2021.02.006 Crossref Full Text|Google Scholar Jin, D., Yu, Z. Z., Jiao, P. F., Pan, S. R., He, D. X., Wu, J., et al. (2023). A survey of community detection approaches: from statistical modeling to deep learning.IEEE Trans. Knowl. Data Eng.35, 1149–1170. doi: 10.48550/arXiv.2101.01669 Crossref Full Text|Google Scholar Ju, C. H., and Cao, Q. W. (2025). Selection of collaborative partners for ambidextrous technological innovation: an approach based on community detection.Int. J. Technol. Manage.98, 52–77. doi: 10.1504/IJTM.2025.145462 Crossref Full Text|Google Scholar Kallipolitis, L., Karpis, V., and Karali, I. (2012). Semantic search in the world news domain using automatically extracted metadata files.Knowl. Based Syst. 27, 38–50. doi: 10.1016/j.knosys.2011.12.007 Crossref Full Text|Google Scholar Kejriwal, M. (2021). On using centrality to understand importance of entities in the Panama Papers.PLoS ONE16, 1–17. doi: 10.1371/journal.pone.0248573 PubMed Abstract|Crossref Full Text|Google Scholar Kosari, S., Qiang, X. L., Kacprzyk, J., Ain, Q. T., and Rashmanlou, H. (2024). A study on topological indices in fuzzy graphs with application in decision making problems.J. Multi. Valued Log. Soft Comp.42, 567–589. Google Scholar Kumar, A., Singh, S. S., Singh, K., and Biswas, B. (2020). Link prediction techniques applications and performance: a survey.Phys. A Stat. Mech. Its Appl.553, 1–46. doi: 10.1016/j.physa.2020.124289 Crossref Full Text|Google Scholar Kumar, A. J., Schmidt, C., and Koehler, J. (2017). A knowledge graph based speech interface for question answering systems.Speech Commun.92, 1–12. doi: 10.1016/j.specom.2017.05.001 Crossref Full Text|Google Scholar Lazer, D. M., Pentland, A., Watts, D. J., Aral, S., Athey, S., Contractor, N., et al. (2020). Computational social science: obstacles and opportunities.Science369, 1060–1062. doi: 10.1126/science.aaz8170 PubMed Abstract|Crossref Full Text|Google Scholar Lei, Z., Sun, Y., Nanehkaran, Y. A., Yang, S. Y., Islam, M. S., Lei, H. Q., et al. (2020).A novel data-driven robust framework based on machine learning and knowledge graph for disease classification.Future Gen. Comp. Syst. Int. J. eSci. 102, 534–548. doi: 10.1016/j.future.2019.08.030 Crossref Full Text|Google Scholar Li, D., Zhu, B., Yang, S., Yi, M., He, Y., and Wang, H. (2023). Multi-task pre-training language model for semantic network completion.ACM Trans. Asian Low-Resour. Lang. Inf. Process.22, 1–20. doi: 10.1145/3627704 Crossref Full Text|Google Scholar Li, Q., Wang, D., Feng, S., Niu, C., and Zhang, Y. F. (2021). Global graph attention embedding network for relation prediction in knowledge graphs.IEEE Trans. Neural Networks Learn. Syst.33, 6712–6725. doi: 10.1109/TNNLS.2021.3083259 PubMed Abstract|Crossref Full Text|Google Scholar Liu, L. Q., Wang, B., Ma, F. Q., Zheng, Q., Yao, L., Zhang, C., and Mohamed, M. A. (2022). A concurrent fault diagnosis method of transformer based on graph convolutional network and knowledge graph.Front. Energy Res.10:837553. doi: 10.3389/fenrg.2022.837553 Crossref Full Text|Google Scholar Ma, C., Sun, H. Y., Wang, S. F., and Lu, S. L. (2021). Bond default prediction based on deep learning and knowledge graph technology.IEEE Access9, 12750–12761. doi: 10.1109/ACCESS.2021.3052054 Crossref Full Text|Google Scholar Ma, Y. B., Wang, Z. H., Cao, Y. X., Li, M. K., Chen, M. Q., Wang, K., et al. (2022). “Prompt for extraction? PAIE: prompting argument interaction for event argument extraction,” inThe 60th Annual Meeting of the Association for Computational Linguistics (ACL) 2022(Dublin), 6759–6774. doi: 10.18653/v1/2022.acl-long.466 Crossref Full Text|Google Scholar Mojtaba, M., Travis, W., and Claude, S. (2016). Matching experts' decisions in concrete delivery dispatching centers by ensemble learning algorithms: tactical level.Autom. Constr.68, 146–155. doi: 10.1016/j.autcon.2016.03.007 Crossref Full Text|Google Scholar Ong, L., Karmakar, G., Atherton, J., Chadzynski, A., Li, L., Wang, X., et al. (2021). Embedding energy storage systems into a dynamic knowledge graph.Ind. Eng. Chem. Res.61, 8390–8398. doi: 10.1021/acs.iecr.1c03838 Crossref Full Text|Google Scholar Peng, Q., Cai, Y., Liu, J. K., Zou, Q., Chen, X., Zhong, Z., et al. (2025). Integration of multi-source medical data for medical diagnosis question answering.IEEE Trans. Med. Imag.44, 1373–1385. doi: 10.1109/TMI.2024.3496862 PubMed Abstract|Crossref Full Text|Google Scholar Sadri, A. M., Ukkusuri, S. V., and Ahmed, M. A. (2021). Review of social influence in crisis communications and evacuation decision-making.Trans. Res. Interdiscip. Perspect.9, 1–12. doi: 10.1016/j.trip.2021.100325 Crossref Full Text|Google Scholar Sawant, U., Garg, S., Chakrabarti, S., and Ramakrishnan, G. (2019). Neural architecture for question answering using a knowledge graph and web corpus.Inf. Retr. J.22, 324–349. doi: 10.1007/s10791-018-9348-8 Crossref Full Text|Google Scholar Shen, J. H., Wang, C. G., Yuan, Y., Han, J. W., Ji, H., Sen, K., et al. (2022). “PALT: parameter-lite transfer of language models for knowledge graph completion,” in2022 Conference on Empirical Methods in Natural Language Processing (EMNLP)(Abu Duabi: Association for Computational Linguistics), 115. doi: 10.18653/v1/2022.findings-emnlp.281 Crossref Full Text|Google Scholar Sheng, Z. Y., Wang, H. W., Chen, G., Zhou, B., and Sun, J. (2021). Convolutional residual network to short-term load forecasting.Appl. Intell.51, 2485–2499. doi: 10.1007/s10489-020-01932-9 Crossref Full Text|Google Scholar Sun, X. J., Hao, T., and Li, X. (2023). Knowledge graph construction and Internet of Things optimisation for power grid data knowledge extraction.Appl. Math. Nonlinear Sci.8, 2729-2738. doi: 10.2478/amns.2021.2.00283 Crossref Full Text|Google Scholar Szklarczyk, D., Gable, A. L., Nastou, K. C., Lyon, D., Kirsch, R., Pyysalo, S., et al. (2021). The STRING database in 2021: customizable protein-protein networks and functional characterization of user-uploaded gene/measurement sets.Nucleic Acids Res.49, D605–D612. doi: 10.1093/nar/gkab835 PubMed Abstract|Crossref Full Text|Google Scholar Viloria, A., and Lezama, O. B. P. (2019). An intelligent approach for the design and development of a personalized system of knowledge representation.Proc. Comput. Sci.151, 1225–1230. doi: 10.1016/j.procs.2019.04.176 Crossref Full Text|Google Scholar Wan, M. R., Ye, C. M., and Peng, D. J. (2023). Multi-period dynamic multi-objective emergency material distribution model under uncertain demand.Eng. Appl. Artif. Intell.117:105530. doi: 10.1016/j.engappai.2022.105530 Crossref Full Text|Google Scholar Wang, F., Liu, J. P., and Liu, B. (2020). Survey on construction of code knowledge graph and intelligent software development.J. Softw.31, 47–66. doi: 10.13328/j.cnki.jos.005893 Crossref Full Text|Google Scholar Warren, P., Mulholland, P., Collins, T., and Motta, E. (2019). Improving comprehension of knowledge representation languages: a case study with description logics.Int. J. Hum. Comp. Stud.122, 145–167. doi: 10.1016/j.ijhcs.2018.08.009 Crossref Full Text|Google Scholar Wu, T. X., Qi, G. L., Li, C., and Wang, M. (2018). A survey of techniques for constructing Chinese knowledge graphs and their applications.Sustainability10, 1–26. doi: 10.3390/su10093245 Crossref Full Text|Google Scholar Wu, Y. Y., Feng, S. H., Zhao, G. P., and Jin, Y. (2024). Transformer driven matching selection mechanism for multi-label image classification.IEEE Trans. Circuits Syst. Video Technol.34, 924–937. doi: 10.1109/TCSVT.2023.3288205 Crossref Full Text|Google Scholar Xi, L., Wu, J. N., Xu, Y. C., and Sun, H. B. (2021). Automatic generation control based on multiple neural networks with actor-critic strategy.IEEE Trans. Neural Networks Learn. Syst.32, 2483–2493. doi: 10.1109/TNNLS.2020.3006080 PubMed Abstract|Crossref Full Text|Google Scholar Xiong, W. P., Cao, J., Zhou, X., Du, J. Q., Nie, B., Zeng, Z. J., et al. (2021). Design and evaluation of a prescription drug monitoring program for Chinese patent medicine based on knowledge graph.Evidence-Based Complementary Altern. Med.5:9970063. doi: 10.1155/2021/9970063 PubMed Abstract|Crossref Full Text|Google Scholar Yan, J., Wang, C., Cheng, W., Gao, M., and Zhou, A. A. (2018). Retrospective of knowledge graphs.Front. Comp. Sci. 12, 55–74. doi: 10.1007/s11704-016-5228-9 Crossref Full Text|Google Scholar Yang, Z. J., Wang, Y., Gan, J. H., Li, H., and Lei, N. (2021). Design and research of intelligent question- answering(Q&A) system based on high school course knowledge graph.Mobile Netw. Appl.26, 1884–1890. doi: 10.1007/s11036-020-01726-w Crossref Full Text|Google Scholar Yin, L. F., and Xie, J. X. (2021). Multi-temporal-spatial-scale temporal convolution network for short-term load forecasting of power systems.Appl. Energy283:116328. doi: 10.1016/j.apenergy.2020.116328 Crossref Full Text|Google Scholar Youn, J., and Tagkopoulos, I. (2022). “KGLM: integrating knowledge graph structure in language models for link prediction,” inProceedings of the 12th Joint Conference on Lexical and Computational Semantics (*SEM 2023), Toronto, Canada(Association for Computational Linguistics), 217–224. doi: 10.18653/v1/2023.starsem-1.20 Crossref Full Text|Google Scholar Yu, T., Li, J. H., Yu, Q., Tian, Y., Shun, X. F., Xu, L. L., et al. (2017). Knowledge graph for TCM health preservation: design construction and applications.Artif. Intell. Med.77, 48–52. doi: 10.1016/j.artmed.2017.04.001 PubMed Abstract|Crossref Full Text|Google Scholar Zera, S., and Ayati, M. (2021). Simultaneous fault diagnosis of wind turbine using multichannel convolutional neural networks.ISA Trans.108, 230–239. doi: 10.1016/j.isatra.2020.08.021 PubMed Abstract|Crossref Full Text|Google Scholar Zhang, F., Wang, R. J. Z., Song, J., and He, Y. B. (2024). Optimisation of the national grain reserve system using a two-phase algorithm.J. Simul.17, 746–764. doi: 10.1080/17477778.2022.2077664 Crossref Full Text|Google Scholar Zhang, R., Chen, X., and Luo, J. (2021). Knowledge mining of low specific speed centrifugal pump impeller based on proper orthogonal decomposition method.J. Ther. Sci.30, 840–848. doi: 10.1007/s11630-020-1356-5 Crossref Full Text|Google Scholar Zhao, Y., Ball, R., Mosesian, J., de Palma, J. F., and Lehman, B. (2015). Graph-based semi-supervised learning for fault detection and classification in solar photovoltaic arrays.IEEE Trans. Power Electron.30, 2848–2858. doi: 10.1109/TPEL.2014.2364203 Crossref Full Text|Google Scholar Zhou, D., Zhong, D., and He, Y. (2014). Biomedical relation extraction: from binary to complex.Comput. Math. Method Med.1, 1–18. doi: 10.1155/2014/298473 PubMed Abstract|Crossref Full Text|Google Scholar Zhu, J., Zhang, J. B., Zhu, Q., Li, W. L., Wu, J. L., Guo, Y. K., et al. (2024). A knowledge-guided visualization framework of disaster scenes for helping the public cognize risk information.Int. J. Geogr. Inf. Sci.38, 626–653. doi: 10.1080/13658816.2023.2298299 Crossref Full Text|Google Scholar Zhu, Z., Zhang, Z., and Xhonneux, L. P. (2021). Neural bellman-ford networks: a general graph neural network framework for link prediction.Adv. Neural Inf. Process. Syst.34, 29476–29490. doi: 10.48550/arXiv.2106.06935 Crossref Full Text|Google Scholar Zhuang, Y. Y., and Zhang, K. Y. (2023). Optimization of material allocation under public health events based on SEIR model.J. Shandong Univ. 58, 109–120. doi: 10.6040/j.issn.1671-9352.0.2021.256 Crossref Full Text|Google Scholar **Appendix** Case Summaries: Case 1: On February 27, the Jinhua region was hit by a cold wave, causing the overhead ground wire of the 220 kV Xizhai 4400 transmission line to detach due to severe ice accumulation, resulting in a power outage. Case 2: On June 25, due to flood discharge from the Xin'anjiang Reservoir, the water level of the Lan River continued to rise, reaching the warning level of 28 meters. Five major reservoirs in Lanxi were near full capacity, and the Jinshantou Reservoir began discharging water. Case 3: As Typhoon In-Fa approached, to ensure power supply resilience, State Grid Yiwu Power Supply Company canceled all weekend leave for its employees starting July 24, mobilizing full efforts for typhoon response. Over 10 emergency repair teams were formed, with 120 repair personnel, 80 service vehicles, and 15 backup generators deployed. Emergency staff maintained 24/7 readiness to address contingencies. Case 4: On the morning of April 7, the Integrated Energy Team of State Grid Lanxi Power Supply Company received an urgent repair request from Sanjiang Warehouse. The manager reported a power failure on a docked vessel at the Nübu Port. The team promptly responded, conducting a comprehensive inspection of wiring and sockets using multimeters and insulation resistance testers to ensure stable power restoration. Case 5: On February 5, a renewed cold wave swept through Zhejiang, triggering a sharp temperature drop and prolonged, widespread rain and snow. The extreme weather caused severe ice accumulation on high-altitude transmission lines, posing critical risks to grid stability. According to State Grid Jinhua Power Supply Company's Transmission Monitoring Center, multiple lines in Jinhua faced hazardous ice buildup. Keywords:electric power emergency supplies, relationship diagram, supply decision, intelligent optimization, conceptual design Citation:Si J, Liu C, Ye J, Wu J, Wang J, Hu K, Ju C and Cao Q (2025) Conceptual design of a decision knowledge service model integrating a multi-agent supply relationship diagram for electric power emergency equipment.Front. Big Data8:1603106. doi: 10.3389/fdata.2025.1603106 Received:31 March 2025;Accepted:16 May 2025;Published:06 June 2025. Edited by: Reviewed by: Copyright© 2025 Si, Liu, Ye, Wu, Wang, Hu, Ju and Cao. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Qianwen Cao,MjQyMDUwMDAxQHpqaHpjYy5lZHUuY24= Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Literature review 3 Methods 4 Conceptual design of a decision-knowledge service model 5 Summary 6 Research limitations and future directions Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note References Appendix EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}