{"id": 370, "name": "Detroit Lakes Tribune", "domain": "dl-online.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dl-online.com/news/local/arvig-awards-108-000-to-recent-high-school-graduates-students-from-perham-detroit-lakes-and-wadena-awarded-arvig-scholarship", "title": "Arvig Awards 108 000 To Recent High School Graduates Students From Perham Detroit Lakes And Wadena Awarded Arvig Scholarship", "content": "Advertise with us Crime & Courts Obituaries Summer Fun Prep sports standings 📣 Best of the Best 2025 Advertise With UsDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public NoticeGet Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Sponsored Content NewsLocalMinnesotaNationalWorldThe VaultAgweekWDAY LiveForum News Network Local Minnesota National World The Vault Agweek WDAY Live Forum News Network Local Minnesota National World The Vault Agweek WDAY Live Forum News Network Weather SportsPrepPrep StandingsCollegeBison Media ZoneProNorthland OutdoorsWDAY+ Prep Prep Standings College Bison Media Zone Pro Northland Outdoors WDAY+ Prep Prep Standings College Bison Media Zone Pro Northland Outdoors WDAY+ Obituaries Health BusinessBusiness Announcements Business Announcements Business Announcements OpinionEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters LifestyleArts / EntertainmentHome / GardenComicsFree Games Arts / Entertainment Home / Garden Comics Free Games Arts / Entertainment Home / Garden Comics Free Games CommunityMilestonesCalendarContestsAnnouncements Milestones Calendar Contests Announcements Milestones Calendar Contests Announcements Podcasts ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **Students from Perham, Detroit Lakes, Wadena and other area communities awarded Arvig scholarship** **Thirty-six high school graduates from the class of 2025 received $3,000 scholarships from Arvig's Royale B & Eleanor M Arvig Memorial Scholarship fund.** PERHAM— Arvig awarded a total of $108,000 from the Royale B & Eleanor M Arvig Memorial Scholarship fund to 36 high school graduates, according to an Arvig press release. Each student will receive a $3,000 scholarship to their chosen college, university or vocational school. “Awarding these scholarships is a highlight for us every year,” said David Arvig, vice president and COO at Arvig. “We’re thrilled to congratulate each of our 2025 scholarship recipients on their remarkable achievements, and we wish them the very best in their higher education journeys.” ADVERTISEMENT Joint investigation recovers $65,000 worth of stolen goods across Otter Tail County and surrounding counties1d ago DNR dog helps sniff out zebra mussels in Minnesota lakes2d ago 67-year-old rural Dent woman treated for smoke inhalation after trash fire gets out of control Thursday night5d ago Students who were awarded the scholarship were selected based on achievements or interests in mathematics, engineering, accounting, computer science, telecommunications or any physical sciences. Arvig established the scholarship fund to emphasize the importance of higher education and encourage civic leadership in honor of founders Royale and Eleanor Arvig, who began offering telephone service to the Perham area in 1950. Arvig awards more than $100,000 in scholarship funding annually to high school students in the Arvig service area. For more information about scholarships, visitarvig.com/community-impact. Scholarship winners are as follows: Isabella Wimmer of Perham is pursuing a degree in communication science. Anika Erickson of Detroit Lakes is pursuing a degree in biology. Maxwell Pichardo of Wadena is pursuing a degree in computer science. Samantha Pederson of New York Mills is pursuing a degree in aerospace engineering. Jorja Weishalla of Bertha-Hewitt is pursuing a degree in biochemistry. Grace McNamee of Nevis is pursuing a degree in kinesiology. Emersyn Engen of Norman County East is pursuing a degree in pharmacy. Ansley Braseth of Ulen-Hitterdal is pursuing a degree in engineering. Britta Rand of Walker is pursuing a degree in mechanical engineering. Aden Hoban of Waubun is pursuing a degree in cybersecurity Tiffany Weber of Henning is pursuing a degree in business administration/mass communications. Aidan Heggem of Battle Lake is pursuing a degree in engineering. Dillan Robben of Staples-Motley is pursuing a degree in computer science. Peggy Whitteron of Hawley is pursuing a degree in finance and accounting. Tyler Schoenborn of Mahnomen is pursuing a degree in engineering. David Hoagland III of White Earth is pursuing a degree in biology. Bryce Vogt of Parkers Prairie is pursuing a degree in biological science. Seth Staloch of Osakis is pursuing a degree in kinesiology. Anastasia Haataga of Bigfork is pursuing a degree in engineering. Tyler Officer of Park Rapids is pursuing a degree in engineering. Judson Gross of Cass Lake is pursuing a degree in computer science. Logan Bachman of Grand Meadow is pursuing a degree in mechanical engineering. Grant Eveslage of Melrose is pursuing a degree in civil engineering. Servin Anderson of Sauk Centre is pursuing a degree in electrical engineering. Justin Becker of Eden Valley-Watkins is pursuing a degree in mechanical engineering. Jordyn Theis of Kimball is pursuing a degree in wildlife biology. Bethany Posch of Rocori High School is pursuing a degree in food science. Blake Schultz of Long Prairie-Grey Eagle is pursuing a degree in actuarial science. Lillian Deblieck of Redwood Falls is pursuing a degree in chemical engineering. Ethan Jenniges of Wabasso is pursuing a degree in accounting. Zachary Sandgren of Cedar Mountain is pursuing a degree in computer science. Asher Blaine of Frazee-Vergas is pursuing a degree in business management. William Pesch of Pelican Rapids is pursuing a degree in computer science. Thor Erickson of Lake Park Audubon is pursuing a degree in engineering. Makayla Bjelland of Dilworth-Glyndon-Felton is pursuing a degree in nursing. Austin McCraven of Ada-Borup is pursuing a degree in accounting. Turtles take to the track in Perham's 2025 turtle race season opener6d ago Is it back to the drawing board for Perham Area EMS?May 1 Surgeons thought they removed a kidney from a Vergas teen, only to discover they didn'tApr 28 ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersE-PaperOur News Network Subscription Options Email Newsletters E-Paper Our News Network Subscription Options Email Newsletters E-Paper Our News Network ContactGet HelpContact UsAdvertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Facebook"}