{"id": 138, "name": "Birmingham Mail", "domain": "birminghammail.co.uk", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.birminghammail.co.uk/whats-on/food-drink-news/gallery/inside-new-birmingham-restaurant-diners-31819052#comments-wrapper", "title": "Inside New Birmingham Restaurant Diners 31819052#comments Wrapper", "content": "NewsBirmingham NewsMidlands NewsWorcestershireLiveUK and WorldLatest NewsPropertyBusinessMotorsCelebs and TVNews By AreaExpand Birmingham News Midlands News WorcestershireLive UK and World Latest News Property Business Motors Celebs and TV News By Area Birmingham News Midlands News WorcestershireLive UK and World Latest News Property Business Motors Celebs and TV News By Area In Your Area Black Country Villa Birmingham City What's OnRestaurant and BarsThings To DoGigs and ClubsShoppingFamilyStay InExpand Restaurant and Bars Things To Do Gigs and Clubs Shopping Family Stay In Restaurant and Bars Things To Do Gigs and Clubs Shopping Family Stay In Nostalgia Who We Are Albion Wolves Bears Partner Stories Follow us Buy a Paper Funeral Notices Jobs Advertise with Us Directory Dating Book an Ad Public Notices Buy a photo Newsletter signup InYourArea mynewsassistant Beauty Box Subscription Yimbly Shop Marketplace Public Notices Contact Us About Us Work for us Advertise with Us Mirror Bingo Buy a photo How to Complain Corrections and Clarifications Feedback Terms & Conditions Privacy Notice AI Notice Cookie Notice Sell Your Story Bands Directory Newsletters Signup Syndication & Licensing Notifications and Alerts help © 2025 a Reach plc subsidiary Home What's On Food & Drink Birmingham Restaurants **Inside new Birmingham restaurant diners travel three hours to try** **A new Greek restaurant has moved from Kent to Hall Green in Birmingham and loyal diners are still travelling three hours for the food. Co-owned by husband and wife team Mike and Gina Andrianopoulou, Pirouni aims to deliver fresh and affordable food in a friendly and welcoming space. With gyros starting from £8 and traditional favourites of baklava and Greek salad included on the menu, Pirouni was called a 'little gem' by one reviewer. Read more: New Birmingham restaurant has fans travelling three hours for 'delicious' £8 item On Google Reviews, Pirouni has a perfect 5.0 score, based on eight independent reviews. Read more about the restaurant and it's backstory here. One customer identified as Emmanouela said: \"What a little gem. A family-run business which serves homemade gyros with huge variety of other homemade meals. \"The couple went above and beyond to serve us and do their best for us and every single customer that was there. \"We felt like we were at home.\" A different diner identified as Lesley posted: \"We love Greek food so wanted to try this newly opened place. \"Absolutely delicious. We had fried halloumi, a pork gyros wrap and a chicken gyros wrap. \"Couldn't fault it and we will definitely be returning.\" And a different guest added: \"Delicious Greek food, well priced, and lovely owners. \"Highly recommend. Great to see a different takeaway pop up, a great local addition.\" Check out our photo gallery below of Pirouni, Birmingham's newest Greek restaurant...** Bookmark Share Comments 11:46, 11 JUN 2025 Bookmark The new Greek restaurant opened at the end of March(Image: Pirouni)1of8ShareComments The new Greek restaurant opened at the end of March Share Comments The new Greek restaurant opened at the end of March Share Comments The restaurant is designed to make you feel like you're inside a home(Image: Pirouni)2of8ShareComments The restaurant is designed to make you feel like you're inside a home Share Comments The restaurant is designed to make you feel like you're inside a home Share Comments Pirouni is located on Priory Road(Image: Pirouni)3of8ShareComments Pirouni is located on Priory Road Share Comments Pirouni is located on Priory Road Share Comments (Image: Pirouni)4of8ShareComments Share Comments Share Comments Inside Pirouni restaurant(Image: Pirouni)5of8ShareComments Inside Pirouni restaurant Share Comments Inside Pirouni restaurant Share Comments A mixed meat platter at Pirouni(Image: Pirouni)6of8ShareComments A mixed meat platter at Pirouni Share Comments A mixed meat platter at Pirouni Share Comments The entrance to Pirouni restaurant in Hall Green(Image: Pirouni)7of8ShareComments The entrance to Pirouni restaurant in Hall Green Share Comments The entrance to Pirouni restaurant in Hall Green Share Comments Pirouni co-owners Mike and GinaAndrianopoulou.(Image: Pirouni)8of8ShareComments Pirouni co-owners Mike and GinaAndrianopoulou. Share Comments Pirouni co-owners Mike and GinaAndrianopoulou. Share Comments Birmingham Restaurants Billesley and Hall Green What's On all Most Read Most Recent Most Read Most Recent News What's On Sport Football Follow us InYourArea mynewsassistant Beauty Box Subscription Yimbly Shop Marketplace Public Notices Contact Us About Us Work for us Advertise with Us Mirror Bingo Buy a photo How to Complain Corrections and Clarifications Feedback Terms & Conditions Privacy Notice AI Notice Cookie Notice Sell Your Story Bands Directory Newsletters Signup Syndication & Licensing Notifications and Alerts help © 2025 a Reach plc subsidiary"}