{"id": 741, "name": "KCRW - NPR - Santa Monica", "domain": "kcrw.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kcrw.com/culture/shows/the-treatment/wes-anderson-bill-murray-tyler-james-williams-carol-leifer/carol-leifer-carl-reiner-mel-brooks-the-2000-year-old-man", "title": "Wes Anderson Bill Murray Tyler James Williams Carol Leifer", "content": "Listen Live KCRW LiveEclectic 24News 24All Streams All Streams Music News Culture Shows Playlist Schedule Newsletters Donate Playlist Schedule Newsletters Donate **How ‘The 2000 Year Old Man’ shaped comedian Carol Leifer's career** “Growing up in my generation, what your parents listened to was what everybody listened to. There was one phonograph and the family was the captive audience. My parents were both big comedy lovers, and they played this “The 2000 Year Old Man” album all the time, so much that I could lip-sync it at this point.”Photo by Shutterstock/Kathy Hutchins For decades, trailblazing comedian and Emmy-winner Carol Leifer has entertained audiences with her sharp wit and comedic talents — both on stage and behind the scenes. A seasoned stand-up comic, she has also lent her writing brilliance to iconic, fan-favorite shows likeSeinfeld,Modern Family,Curb Your Enthusiasm, andHacks. Leifer’s latest project finds her expanding her creative repertoire as an author. Teaming with fellow comedy writer Rick Mitchell, she co-authored the hilarious and practical bookHow to Write a Funny Speech...for a Wedding, Bar Mitzvah, Graduation & Every Other Event You Didn't Want to Go to in the First Place. More:Comedian Carol Leifer wants you to shine in your next speech (The Treatment, 2025) For her Treat, Leifer credits Carl Reiner and Mel Brooks' classic sketch-turned-comedy albumThe 2000 Year Old Manas a major influence on her life and career. It was a staple in her household growing up, igniting her passion for comedy and fueling her ambition to bring joy through laughter. More:Carol Leifer (The Treatment, 2001) This segment has been edited and condensed for clarity. I have to say, what had the most impact on me was Carl Reiner and Mel Brooks' comedy album,The 2000 Year Old Man. Growing up in my generation, what your parents listened to was what everybody listened to. There was one phonograph and the family was the captive audience. My parents were both big comedy lovers, and they played thisThe 2000 Year Old Manalbum all the time, so much that I could lip-sync it at this point. There was so much laughter growing up in my house. And not only laughter, but it really made me want to be funny.Making people laugh like those two with that album did in my house was such an impetus for me to really seek out the joy of laughing and making other people laugh. To the point [that] when I went to college at SUNY Binghamton - Harpur College, and I met Paul Weiser, we both knew that album and knew it word by word. It's not only an influence on me but other people of my generation.So when I think of that album, I think about my family and me wanting to go into comedy. Hey! Did you enjoy this piece? We can’t do it without you. We are member-supported, so your donation is critical to KCRW's music programming, news reporting, and cultural coverage. Help support the DJs, journalists, and staff of the station you love. Here's how: Sign-up for our newsletters. Become aKCRW member. Subscribe to ourPodcasts. Donate to KCRW. Download our App. **Credits** Carol Leifer- Comedian More from The Treatment Latest From this Episode: Wes Anderson, Bill Murray, Tyler James Williams, and Carol Leifer on The Treat **Bill Murray and Wes Anderson discuss ‘The Phoenician Scheme’** Frequent collaborators — actor Bill Murray and filmmaker Wes Anderson — visit the Elvis Suite at Cannes to chat about their new movie, “The Phoenician Scheme.” 29 min **Bill Murray and Wes Anderson discuss ‘The Phoenician Scheme’** Frequent collaborators — actor Bill Murray and filmmaker Wes Anderson — visit the Elvis Suite at Cannes to chat about their new movie, “The Phoenician Scheme.” 29 min **Tyler James Williams on ‘Abbott Elementary’ and showcasing multi-faceted Black lives** Actor and director Tyler James Williams joins to discuss tapping into his comedic side at a young age and his approach for directing “Abbott Elementary.” 18 min **Tyler James Williams on ‘Abbott Elementary’ and showcasing multi-faceted Black lives** Actor and director Tyler James Williams joins to discuss tapping into his comedic side at a young age and his approach for directing “Abbott Elementary.” 18 min **How ‘The 2000 Year Old Man’ shaped comedian Carol Leifer's career** Comedian and TV writer Carol Leifer shares how a classic Mel Brooks/Carl Reiner comedy bit inspired her. 4 min **How ‘The 2000 Year Old Man’ shaped comedian Carol Leifer's career** Comedian and TV writer Carol Leifer shares how a classic Mel Brooks/Carl Reiner comedy bit inspired her. 4 min **Share your passion for new experiences, sounds, & ideas** Get Involved **Share your passion for new experiences, sounds, & ideas** Get Involved Featured **5 Things To Do Newsletter** The best of what to see, hear, eat, do, and more. **Upcoming Events** **Summer nights** Make your summer shine with KCRW’s Summer Nights — FREE, all-ages, outdoor parties so you can experience SoCal like never before. rsvp now About KCRW Contact Careers Help / FAQ Support KCRW Events Become a Sponsor Terms of Service Privacy Policy FCC Public Files FCC Applications EEO Report Pledge for Equity Get the latest from KCRW in your inbox 3x a week."}