{"id": 1924, "name": "Color of Change", "domain": "colorofchange.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://colorofchange.org/terms-and-conditions/", "title": "Terms And Conditions", "content": "ABOUTBack to mainOur WorkOur teamContact UsCareers Back to main Our Work Our team Contact Us Careers Back to main Our Work Our team Contact Us Careers Our Campaigns Create a Campaign Join Us Press DONATE facebook icon twitter icon youtube icon **Terms of Service** **Terms of Service** Please read this Terms of Service agreement (the “Agreement”) carefully. Your use of the Site (as defined below) constitutes your assent to this Agreement. This Agreement is between you (“you”) and ColorOfChange.org (“CoC,” “we,” “us”), a California nonprofit public benefit corporation exempt from taxation under section 501(c)(4) of the Internal Revenue Code of 19086 as amended, concerning your use of the online site currently located at https://colorofchange.org (together with any successor site(s) and all Services (as defined below), the “Site”). **1. Acceptance of Terms** The Site is made available by CoC subject to this Agreement. We reserve the right to update or make changes to this Agreement from time to time in our sole discretion, which changes we may provide to you by any reasonable means, including by posting the revised version of this Agreement on the Site. You can determine when this Agreement was last revised by referring to the “LAST UPDATED” legend at the top of this Agreement. When using any Services (as defined below), you agree that you are subject to any additional posted guidelines, rules, terms and conditions applicable to such Services, which are hereby incorporated by reference into this Agreement. We reserve the right, at any time, temporarily or permanently, in whole or in part, to: modify or discontinue the Site, with or without notice, and/or offer opportunities to some or all users of the Site. You agree that neither the CoC nor any of its affiliates including without limitation Color of Change.org Education Fund and ColorOfChange PAC, nor any of the CoC’s or its affiliates’ respective employees, officers, directors, shareholders, affiliates, agents, representatives, licensors, suppliers and service providers (collectively, “Affiliated Entities”) shall be liable to you or to any third party for any modification, suspension or discontinuance of the Site, in whole or in part, or of any Service, content, feature or product offered through the Site. Your continued use of the Site after such changes will indicate your acceptance of such changes. **2. Jurisdictional Issues** The Site is controlled and operated by CoC from the United States, and is not intended to subject CoC to the laws or jurisdiction of any state, country or territory other than that of the United States. CoC does not represent or warrant that the Site or any part thereof is appropriate or available for use in any particular jurisdiction other than the United States. In choosing to access the Site, including Campaigns (as defined below) available through the Site, you do so on your own initiative and at your own risk, and you are responsible for complying with and ensuring that your Campaigns (if any) comply with all local laws, rules and regulations. You are also subject to United States export controls and are responsible for any violations of such controls, including any United States embargoes or other federal rules and regulations restricting exports. We may limit the Site’s availability, in whole or in part, to any person, geographic area or jurisdiction we choose, at any time and in our sole discretion. **3. Description of the Services** We provide users with access to certain content and services that are intended to strengthen the voice of Black Americans and pressure targets in government and corporate America to take actions that create important real-world changes for Black folks and our allies, which may include: (a) services such as profiles, forums, the ability to create petition Campaigns and post Submissions (as defined below), registration functionality, RSS feeds of news, tools, photos, video, blogs, reviews, ratings and links to third party web sites; and (b) content such as audio and video clips, photographs, graphics, images, text, data, user comments, opinions, postings and messages and other similar content (such content and services, collectively, the “Services”). **4. Information Submitted Through the Site** Your submission of information through the Site is governed by CoC’s Privacy Policy, which is currently located at https://colorofchange.org/privacy_policy/ (the “Privacy Policy”), which is hereby incorporated into this Agreement by this reference. You represent and warrant that any information you provide in connection with your use of the Site is and shall remain true, accurate, and complete, and that you will maintain and update such information regularly. You agree that if any information you provide is false, inaccurate, obsolete or incomplete, we may terminate your use of the Site or any Services. **5. Rules of Conduct** While using the Site you will comply with all applicable laws, rules and regulations. In addition, we expect users of the Site to respect the rights and dignity of others. Your use of the Site is conditioned on your compliance with the rules of conduct set forth in this section; your failure to comply with such rules may result in termination of your access to the Site pursuant to Section 17 below. You agree that you will not: Upload, post, transmit, share, store or otherwise make available, through or in connection with the Site: Anything that is or may be (a) threatening, harassing, degrading, hateful or intimidating; (b) defamatory; (c) fraudulent or tortious; (d) obscene, indecent, pornographic or otherwise objectionable; or (e) protected by copyright, trademark, trade secret, right of publicity or other proprietary right without the express prior consent of the owner of such right. Any virus or other computer code, file, or program that is harmful or invasive or may or is intended to damage or hijack the operation of, or to monitor the use of, any hardware, software or equipment. Any unsolicited or unauthorized advertising, promotional material, “junk mail,” “spam,” or investment opportunity, or any other form of solicitation. Anything that would constitute, encourage or provide instructions for a criminal offense, violate the rights of any party, or that would otherwise create liability or violate any local, state, national or international law. Use the Site for any fraudulent or unlawful purpose. Use the Site to defame abuse, harass, stalk, threaten or otherwise violate the legal rights of others, including others’ privacy rights or rights of publicity, or harvest or collect personally identifiable information about other users of the Site. Harvest or collect e-mail addresses, phone numbers, or any other personal information about other Site users from the Site by electronic or other means for the purposes of sending unsolicited e-mails or other unsolicited communications. Impersonate any person or entity; falsely state or otherwise misrepresent your affiliation with any person or entity in connection with the Site; or express or imply that we endorse any statement you make. Interfere with or disrupt the operation of the Site or the servers or networks used to make the Site available; or violate any requirements, procedures, policies or regulations of such networks. Restrict or inhibit any other person from using the Site (including by hacking or defacing any portion of the Site). Use the Site to advertise or offer to sell or buy any goods or services without CoC’s express prior written consent. Reproduce, duplicate, copy, sell, resell or otherwise exploit for any commercial purposes, any portion of, use of, or access to the Site. Modify, adapt, translate, reverse engineer, decompile or disassemble any portion of the Site. Remove any copyright, trademark or other proprietary rights notice from the Site or materials originating from the Site. Frame or mirror any part of the Site without CoC’s express prior written consent. Use any robot, spider, site search/retrieval application or other manual or automatic device to retrieve, index, “scrape,” “data mine” or in any way gather Site content or reproduce or circumvent the navigational structure or presentation of the Site without CoC’s express prior written consent. Notwithstanding the foregoing, CoC grants the operators of public search engines permission to use spiders to copy materials from the site for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials, but not caches or archives of such materials. CoC reserves the right to revoke these exceptions either generally or in specific cases. Additionally, you acknowledge and agree that you (and not CoC) are responsible for obtaining and maintaining all telecommunications, broadband, and computer hardware, equipment, and services needed to access and use the Site, and paying all charges related thereto. **6. Registration; User Names and Passwords** You may be required to register with CoC in order to access certain Services or areas of the Site. With respect to any such registration, we may refuse to grant you, and you may not use, a user name (or e-mail address) that is already being used by someone else; that may be construed as impersonating another person; that belongs to another person; that violates the intellectual property or other rights of any person; that is offensive; or that we reject for any other reason in our sole discretion. Your user name and password are for your personal use only, and not for use by any other person. You are responsible for maintaining the confidentiality of any password you may use to access the Site, and agree not to transfer your password or user name, or lend or otherwise transfer your use of or access to the Site, to any third party. You are fully responsible for all interaction with the Site that occurs in connection with your password or user name. You agree to immediately notify CoC of any unauthorized use of your password or user name or any other breach of security related to your account or the Site, and to ensure that you “log off”/exit from your account with the Site (if applicable) at the end of each session. We are not liable for any loss or damage arising from your failure to comply with any of the foregoing obligations. **7. Petition Campaigns** We and/or our service providers may make available through the Site platforms or functionality through which you are able to create a petition campaign to advocate for strengthening the voice of Black Americans and pressuring targets in government and corporate America to take actions that create important real-world changes for Black folks and our allies (each, a “Campaign”). You may not, however, use our campaign platforms to create Campaigns to advocate the election or defeat of, or promote, advocate, support or oppose, any candidate for political office, or to promote hatred, violence, discrimination or stereotypes based on race, gender, gender identity, ethnicity, sexuality, or religion (which determination will be made by CoC in its sole discretion). You may not use the Site to create a petition or communication to offer any goods or services for sale, or to engage in any fundraising for or solicitation of contributions to any person, group, organization, candidate or entity. (a) Generally. A Campaign may be created by an individual or an organization (each, a “Campaigner”). Campaigners must register with CoC through the Site to create a Campaign. You acknowledge and agree that you (and not CoC) are responsible for promoting your Campaigns, but that CoC may, in its sole discretion, select Campaigns to promote by any means, including featuring a Campaign on the Site or e-mailing information about a Campaign to registered Site users. (b) Campaign Partners. We may, at our sole discretion, elect to work with and provide Services (including maintaining Campaign sites located on the Site) for certain individual or organization-based Campaigners (each, a “Campaign Partner”). To become a Campaign Partner, you or your organization must receive from CoC a confirmation e-mail specifically identifying you or your organization as a Campaign Partner. To apply to become a Partner go to www.organizefor.org/partners-application/. By becoming a Partner, you agree to comply with thePartner Terms and Conditions here. Please note that Site visitors may access a Campaign Partner’s Campaign sites by clicking on links provided by the Campaign Partner or by a third party. Any Site visitor who accesses a Campaign Partner’s Campaign site is subject to CoC’s Privacy Policy and Terms of Service and may also be subject to the Campaign Partner’s (or a third party’s) own privacy policy and terms of service. If there is any content, advertising, products, services or other materials included or accessible through a Campaign Partner’s Campaign sites other than Campaigns themselves, CoC and its Affiliated Entities neither endorse nor are responsible or liable for any such content, advertising, products, services or other materials. (c) All petitions and associated content that you create and upload for any Campaign are subject to the prohibitions and rules set forth in section 5 of these Terms of Use. Any petition or posting that violates these rules may be removed immediately by CoC, at any time, and without notice to you. **8. Submissions** We may allow you to post certain messages, information, content and/or materials (each, together with any petition and any other Campaign-related content that you submit or post, a “Submission”) on your “profile page” (your “Profile”) and in connection with Campaigns. Further, we and/or our service providers may make available through the Site services (for example, message boards, forums, blogs, chat functionality, messaging functionality and comment functionality on the Site, among other services) to which you are able to post Submissions (each, a “Forum”). Please note that Site visitors (including Campaigners and Campaign Partners) may post Submissions in Campaigns, Profiles and/or Forums that are inaccurate, misleading or deceptive. Without limitation of Section 14, CoC and its Affiliated Entities neither endorse nor are responsible for (a) any positions taken by or associated with Site visitors or any organizations represented by, affiliated or associated with Site visitors (including positions taken by Campaigners in their Campaigns, social media sites, or other web sites) or (b) any opinion, advice, information or statements made in Campaigns, Profiles and/or Forums by Site visitors. The opinions expressed in Campaigns, Profiles and/or Forums reflect solely the opinions of the individuals or organizations who submitted such opinions, and do not necessarily reflect the opinions of CoC. In addition and without limitation to the foregoing, CoC and its Affiliated Entities are not responsible for any information or materials made available through Campaigns, Profiles and/or Forums (including errors or omissions in Campaigns, Profiles and/or Forum postings or links or images embedded in Campaigns, Profiles and/or Forum postings) or results obtained by using any such information or materials. Under no circumstances will CoC, the Affiliated Entities or their respective employees, officers, directors, shareholders, affiliates, agents, representatives, licensors, suppliers or service providers, be liable for any loss or damage caused by your reliance on such information or materials. **9. Signing Petitions** If you sign a petition created through this Site or posted on any CoC or ColorOfChange PAC website, you are agreeing that (i) your name, city and state and zip code can be provided to the intended recipient of the petition; (ii) you are opting in to receive e-mails in the future from CoC, ColorOfChange Education Fund and ColorOfChange PAC, on any issues or topics any of those organizations believes may be of interest to you; and (iii) if the Campaign was created by a Partner (as defined in the Partner Terms of Use) and you have not UNCHECKED the box on the Partner Petition page allowing Partner to send you e-mails in the future, you will have agreed to receive such e-mails in the future from that Partner. **10. Signatures on and Delivery of Petitions** The signatures on any petition created through this Site are not guaranteed to be legally valid signatures that would be recognized and/or accepted by any government agency or entity. Each Campaigner is responsible for ensuring that the petition and petition signatures are delivered to its intended recipients. Campaigns may not edit a signature in a way that compromises the intent of the signer. **11. License** You retain ownership of your Submissions, including information, content and/or materials protected by copyright, trademark, trade secret, right of publicity or other proprietary right. However, please note that we need certain rights to your Submissions in order to make them available on the Site. As such, you hereby grant to CoC, the Affiliated Entities and their respective service providers and designees a worldwide, non-exclusive, transferable, sublicenseable (through multiple tiers), royalty-free, perpetual, irrevocable right and license, without compensation to you: to use, reproduce, distribute, adapt (including edit, modify, translate, and reformat), create derivative works of, transmit, publicly display and publicly perform such Submission, in any media now known or hereafter developed, for any purpose in connection with the Site, including to use your Submission in connection with CoC campaigns or advertisements and to publicize your Campaign through any media. This license is non-exclusive (so you can license your Submissions to others), worldwide (as the Internet is global in its reach), fully-paid up and royalty-free (so that we do not have to pay you for posting your Submissions), sublicenseable through multiple tiers (so that we can use our service providers and subcontractors to provide Services). For each Submission, you represent and warrant that you have all rights necessary for you to grant the licenses granted in this section, and that such Submission, and your provision thereof to and through the Site, comply with all applicable laws, rules and regulations. You further irrevocably waive any “moral rights” or other rights with respect to attribution of authorship or integrity of materials regarding each Submission that you may have under any applicable law under any legal theory. We request this waiver to help ensure that we have all the rights we may need to provide the Services available through the Site. **12. Monitoring** You acknowledge and agree that we reserve the right (but have no obligation) to do any or all of the following, at our sole discretion: (a) monitor Submissions and Campaigns; (b) alter, remove, or refuse to post or allow to be posted any Submission; (c) alter, remove, or refuse to create or allow to be created any Campaigns; and/or (d) disclose any Submissions and/or Campaigns, and the circumstances surrounding their transmission, to any third party in order to operate the Site or provide any Services; to protect CoC, its Affiliated Entities, and the Site’s users and visitors; to comply with legal obligations or governmental requests; to enforce this Agreement; or for any other reason or purpose. **13. COC’s Proprietary Rights** The information and materials made available through the Site, including the Services, are and shall remain the property of CoC and its Affiliated Entities, and are protected by copyright, trademark, patent, and/or other proprietary rights and laws. Subject to your compliance with this Agreement, and solely for so long as you are permitted by CoC to access and use the Site, you may view any content on the Site to which we provide you access hereunder solely for your personal, non-commercial use, provided that you keep intact all copyright and other proprietary notices. Except as expressly authorized in advance by CoC in writing, you agree not to reproduce, modify, rent, lease, loan, sell, distribute, or create derivative works based (whether in whole or in part) on, all or any part of the Site or any materials made available through the Site. All trademarks and service marks on the Site not owned by CoC are the property of their respective owners. The trade names, trademarks and service marks owned by CoC, whether registered or unregistered, may not be used in connection with any product or service that is not ours, in any manner that is likely to cause confusion. Nothing contained on the Site should be construed as granting, by implication, estoppel or otherwise, any license or right to use any of CoC’s trade names, trademarks or service marks without our express prior written consent. **14. Links** The Site and visitors to the Site (including Campaigners and Campaign Partners) may provide links to other web sites and online resources (including the Payment Service Page and Campaign Partner Campaign sites and other web sites). Because CoC has no control over such sites and resources, you acknowledge and agree that CoC and its Affiliated Entities are not responsible for the availability of such external sites or resources, and CoC and its Affiliated Entities neither endorse nor are responsible or liable for any content, advertising, products, services or other materials on or available through such sites or resources. Other web sites (including any Campaign Partner’s web sites) may provide links to the Site with or without our authorization. You acknowledge and agree that CoC and its Affiliated Entities do not endorse such sites, and are not and shall not be responsible or liable for any links from those sites to the Site, any content, advertising, products, services or other materials available on or through such other sites, or any loss or damages incurred in connection therewith. YOU AGREE THAT YOUR USE OF THIRD PARTY WEB SITES AND RESOURCES, INCLUDING YOUR USE OF ANY CONTENT, INFORMATION, DATA, ADVERTISING, PRODUCTS, OR OTHER MATERIALS ON OR AVAILABLE THROUGH SUCH WEB SITES AND RESOURCES, IS AT YOUR OWN RISK AND IS SUBJECT TO THE TERMS AND CONDITIONS OF USE APPLICABLE TO SUCH SITES AND RESOURCES. CoC shall have the right, at any time and in its sole discretion, to block links to the Site through technological or other means without prior notice. **15. Disclaimer of Warranties** THE SITE AND ANY GOODS OR SERVICES (INCLUDING CAMPAIGNS) MADE AVAILABLE THROUGH OR IN CONNECTION WITH THE SITE ARE PROVIDED TO YOU “AS IS” WITHOUT ANY WARRANTIES OF ANY KIND, WHETHER EXPRESS, IMPLIED OR STATUTORY. YOU AGREE THAT YOU MUST EVALUATE, AND THAT YOU BEAR ALL RISKS ASSOCIATED WITH, THE USE OF THE SITE, INCLUDING ANY RELIANCE ON THE ACCURACY, COMPLETENESS OR USEFULNESS OF ANY MATERIALS AVAILABLE THROUGH THE SITE. COC AND ITS AFFILIATED ENTITIES DISCLAIM ALL WARRANTIES WITH RESPECT TO THE SITE AND ANY GOODS OR SERVICES (INCLUDING THIRD PARTY GOODS AND SERVICES) OBTAINED THROUGH THE SITE, TO THE FULLEST EXTENT PERMISSIBLE UNDER APPLICABLE LAW, INCLUDING THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, AND TITLE. **16. Limitation of Liability** COC AND ITS AFFILIATED ENTITIES WILL NOT BE LIABLE FOR ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL, SPECIAL, EXEMPLARY OR PUNITIVE DAMAGES OF ANY KIND, UNDER ANY CONTRACT, NEGLIGENCE, STRICT LIABILITY OR OTHER THEORY, INCLUDING DAMAGES FOR LOSS OF PROFITS, USE, DATA, LOSS OF OTHER INTANGIBLES, LOSS OF SECURITY OF INFORMATION YOU HAVE PROVIDED IN CONNECTION WITH YOUR USE OF THE SITE, OR UNAUTHORIZED INTERCEPTION OF ANY SUCH INFORMATION BY THIRD PARTIES, EVEN IF ADVISED IN ADVANCE OF SUCH DAMAGES OR LOSSES. IN PARTICULAR, AND WITHOUT LIMITATION, COC AND ITS AFFILIATED ENTITIES WILL NOT BE LIABLE FOR DAMAGES OF ANY KIND RESULTING FROM YOUR USE OF OR INABILITY TO USE THE SITE OR FROM ANY CONTENT OR CAMPAIGN POSTED ON THE SITE BY COC OR ANY THIRD PARTY. YOUR SOLE AND EXCLUSIVE REMEDY FOR DISSATISFACTION WITH THE SITE IS TO STOP USING THE SITE. THE MAXIMUM LIABILITY OF COC FOR ALL DAMAGES, LOSSES AND CAUSES OF ACTION, WHETHER IN CONTRACT, TORT (INCLUDING NEGLIGENCE) OR OTHERWISE, SHALL NOT EXCEED ONE HUNDRED U.S. DOLLARS. **17. Indemnity** You agree to defend, indemnify and hold harmless CoC and its Affiliated Entities, from and against all claims, losses, costs and expenses (including attorneys’ fees) arising out of or relating to (a) your use of, or activities in connection with, the Site; (b) any violation of this Agreement by you; (c) your Submissions; or (d) if you are a Campaigner, any of your Campaigns. **18. Termination** This Agreement is effective until terminated. CoC, in its sole discretion, may terminate your access to or use of the Site or this Agreement (including terminating your Campaigns or Campaign Partner Campaign sites), at any time and for any reason, including if CoC believes that you have violated or acted inconsistently with the letter or spirit of this Agreement. Upon any such termination, your right to use the Site will immediately cease. You agree that any termination of your access to or use of the Site may be effected without prior notice, and that CoC may immediately deactivate or delete your password and user name, and all related information and files associated with it (including any Campaigns), and/or bar any further access to such information or files. You agree that CoC and its Affiliated Entities shall not be liable to you or any third party for any termination of your access to the Site or to any such information or files, and shall not be required to make such information or files available to you after any such termination. Sections 2, 10, 12, 14-18, 22 and 23 shall survive any expiration or termination of this Agreement. **19. Governing Law; Jurisdiction** This Agreement is governed by and shall be construed in accordance with the laws of the State of California, without regard to its principles of conflicts of law. You agree to exclusive jurisdiction of the federal and state courts located in San Francisco County, California. You consent to the exclusive jurisdiction of such courts in any such action or proceeding and waive any objection to venue laid therein. **20. Contact Us** If you have any questions regarding the meaning of application of this Agreement, please direct such questions to info@colorofchange.org Please note that e-mail communications will not necessarily be secure; accordingly you should not include credit card information or other sensitive information in your e-mail correspondence with us. **21. Notice for California Residents** Under California Civil Code Section 1789.3, California users are entitled to the following consumer rights notice: If you have a question or complaint regarding the Site, please send an e-mail to info@colorofchange.org You may also contact us by writing to 1714 Franklin Street Ste 100-136 Oakland, CA 94612. California residents may reach the Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs by mail at 1625 North Market Blvd., Sacramento, CA 95834, or by telephone at (916) 445-1254 or (800) 952-5210. **22. Claims of Copyright Infringement** The Digital Millennium Copyright Act of 1998 (the “DMCA”) provides recourse for copyright owners who believe that material appearing on the Internet infringes their rights under U.S. copyright law. If you believe in good faith that materials available on the Site (including materials on any Campaigns) infringe your copyright, you (or your agent) may send CoC a notice requesting that CoC remove the material or block access to it. If you believe in good faith that someone has wrongly filed a notice of copyright infringement against you, the DMCA permits you to send CoC a counter-notice. Notices and counter-notices must meet the then-current statutory requirements imposed by the DMCA. See http://www.copyright.gov/ for details. Notices and counter-notices should be sent to info@colorofchange.org **23. Ability to Enter Into This Agreement** By using the Site, you affirm that you are of legal age to enter into this Agreement or, if you are not, that you have obtained parental or guardian consent to enter into this Agreement. **24. Miscellaneous** This Agreement does not, and shall not be construed, to create any partnership, joint venture, employer-employee, agency or franchisor-franchisee relationship between you and CoC. If any provision of this Agreement is found to be unlawful, void or for any reason unenforceable, that provision will be deemed severable from this Agreement and will not affect the validity and enforceability of any remaining provision. You may not assign, transfer or sublicense any or all of your rights or obligations under this Agreement without our express prior written consent. We may assign, transfer, delegate or sublicense any or all of our rights or obligations under this Agreement without restriction. No waiver by either party of any breach or default hereunder will be deemed to be a waiver of any preceding or subsequent breach or default. Any heading, caption or section title contained herein is inserted only as a matter of convenience, and in no way defines or explains any section or provision hereof. This, together with all policies referred to herein, is the entire Agreement between you and CoC relating to the subject matter herein and supersedes any and all prior or contemporaneous written or oral agreements or understandings between you and CoC relating to such subject matter. Notices to you may be made via posting to the Site, by e-mail, or by regular mail, in CoC’s sole discretion. The Site may also provide notices of changes to this Agreement or other matters by displaying such notices or by providing links to such notices. Without limitation, you agree that a printed version of this Agreement and of any notice given in electronic form shall be admissible in judicial or administrative proceedings based upon or relating to this Agreement to the same extent and subject to the same conditions as other business documents and records originally generated and maintained in printed form. CoC will not be responsible for failures to fulfill any obligations due to causes beyond its control. About Contact Us Careers Privacy Policy Terms and Conditions **Chip In To Fuel The Fight For Justice!** **Chip In To Fuel The Fight For Justice!** **Chip In To Fuel The Fight For Justice!**"}