{"id": 1895, "name": "BizNews", "domain": "biznews.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.biznews.com/thought-leaders/smiling-refugees-grim-realities-politics-behind-afrikaner-asylum-us", "title": "Smiling Refugees Grim Realities Politics Behind Afrikaner Asylum Us", "content": "BNIC#2BNIC#2BNIC#2 registrationBNC archives BNIC#2 registration BNC archives BNIC#2 registration BNC archives NewsNewsAfricaBriefBudgetEnergyInterviewsLeadershipMailboxMotoringRugbyThought LeadersWEF Africa Brief Budget Energy Interviews Leadership Mailbox Motoring Rugby Thought Leaders WEF Africa Brief Budget Energy Interviews Leadership Mailbox Motoring Rugby Thought Leaders WEF InvestingInvestingAsset ManagementGlobal CitizenGlobal InvestingSA InvestingUndictatedWealth Advisors Asset Management Global Citizen Global Investing SA Investing Undictated Wealth Advisors Asset Management Global Citizen Global Investing SA Investing Undictated Wealth Advisors Good Hope Sponsored 🔒 BN Portfolios 🔒 SA share prices BizNewsTV BizNewsRadio **Smiling refugees, grim realities: The politics behind Afrikaner asylum in the US - Ivo Vegter** Copied **Key topics:** Afrikaner refugees welcomedwith US government fanfare Afrikaner refugees welcomedwith US government fanfare Afrikaner refugees welcomedwith US government fanfare Unequal refugee treatmentraises questions of race and politics Unequal refugee treatmentraises questions of race and politics Unequal refugee treatmentraises questions of race and politics Trump's claims on SA persecutionlack factual backing Trump's claims on SA persecutionlack factual backing Trump's claims on SA persecutionlack factual backing Sign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Registerhere. Support South Africa’s bastion of independent journalism, offering balanced insights on investments, business, and the political economy, by joining BizNews Premium. Registerhere. If you preferWhatsAppfor updates, sign up to the BizNews channelhere. By Ivo Vegter* The first flight of 49 supposedly persecuted Afrikaners who landed in the United States this week were given a royal welcome. Let’s play a little game, shall we? Here are nine photographs of refugees. Which is the odd one out? The photos represent Rohingya refugees in Malaysia (Free Malaysia Today); Central American refugees on the border with Texas (UNHCR); Kosovar refugees fleeing Kosovo (UNHCR); refugees from the DRC entering Uganda (Wikimedia); South African refugees on their way to the United States (source unknown); Syrian refugees in Budapest, Hungary (Wikimedia); Syrian and Iraqi refugees sinking off the Greek coast (Wikimedia); Afghan refugees in Pakistan (UNCHA); and Kosovar refugees arriving at a Red Cross camp in North Macedonia (Pascal Parrot/Sygma). What is different about the picture in the middle? Being a refugee is awful. It is scary. Refugees typically flee with nothing but the clothes on their back. They’re hungry, tired, and often traumatised. Their present is insecure, and their future is uncertain. What refugees are not, is smiling happy people, like the people in the centre photo. They spend weeks, months or even years in camps with minimal services, limited hygiene, and no privacy. They are dependent on overstretched international NGOs and charities for basic shelter, food and medical needs. They struggle to get low-level bureaucrats and border guards to accept their bona fides as humanitarian refugees or asylum seekers. Do the Afrikaner “refugees” in that middle picture look hungry, tired and traumatised? No, because they just won the immigration lottery, and are fêted all the way to a safe and secure destination. Visiting royalty They didn’t have to brave the seas in dodgy, overcrowded boats. They got a charter flight. They didn’t have to argue with border security. They were processed in three weeks flat before they even left. They weren’t interned in a camp in inhumane conditions, with families split up and children separated from their parents. They werepersonally welcomedby the Deputy Secretary of State, Christopher Landau, and Deputy Secretary of Homeland Security, Troy Edgar. They were given the personal information of these two senior officials, should they want for anything. They were treated like visiting royalty, which is why they’re grinning their heads off and waving cute little American flags. This is a public relations exercise. Read more: **Leaving South Africa** I’ve said before, and I’ll say again, that I cannot blame anyone for wanting to leave South Africa. This is a tough place to live. The economy is bad, the politics divisive, the unemployment rate is high, and most importantly, the crime rate is terrifying. It is true that employment equity and other race-based redress laws can make it hard to earn a living for some white South Africans. Many are forced to start their own businesses because the odds of finding employment are low. It is true that living in rural South Africa is scary. For that matter, so is living anywhere else, but when you’re an hour’s drive from the nearest police station, and a long way from the nearest neighbour, the isolation heightens the danger. Do I blame these 49 people for being opportunistic and taking up America’s offer of refugee status for Afrikaners? Absolutely not. A chance to relocate, for free, to the richest large country in the world doesn’t come along every day. Do I think they’re cowards, as President Cyril Ramaphosa has said? Absolutely not. And it is pretty offensive for a billionaire president with full-time VIP protection to call ordinary South Africans cowardly for fleeing crime. But do I think these Afrikaners merit refugee status? Absolutely not. Refugee status If these people merit refugee status, then millions of South Africans merit refugee status, whether they’re Afrikaners or not. One of the supposed refugees sat fora lengthy interviewwith retired US Army colonel Chris Wyatt, who has taken a special interest in Africa. He identified her as “Athea van Straaten”. She claims to have survived four farm attacks, and I have no reason to doubt her account. I strongly sympathise and wouldn’t for a minute seek to minimise the seriousness of farm attacks. I can certainly understand her desire to flee South Africa. However, the notion that her case is unique, or that she is being targeted because of the colour of her skin, is highly questionable. **Victimhood** I have been the victim of assault three times, myself. Once, I was tied up at knifepoint in my own house, before being cleaned out. Once, a drug addict attacked me from behind on the street. I needed stiches in my head and was on crutches for three months. Once, a drunk guy the size of a rugby prop assaulted me and kicked the living daylights out of me while I was on the ground. All of these cases, plus a few more burglaries, a laptop theft, and two car thefts, were reported to the police. None of the perpetrators were ever caught. For what it’s worth, the racial breakdown of my attackers in the three assault cases were black, coloured, and white, respectively. Several people I knew personally have been murdered in South Africa. Many more, of all races, have been burgled, hijacked, raped, defrauded, or viciously assaulted. I’m a refugee of sorts myself, having fled crime (and traffic) in Johannesburg for the relative safety of a small town in the Western Cape. When political agitators want to “slit the throat of whiteness”, or announce, “whites are thieves and there won’t be peace”, they’re referring to me as much as they refer to any Afrikaner or farmer. Am I as much of a victim as Ms Van Straaten? It is a meaningless comparison. Do I think of myself as a victim, or think I merit refugee status in the US? Absolutely not. Read more: By Trump’s criteria, every single white person in South Africa ought to qualify for refugee status, along with every single coloured and Indian person. Black South Africans outside the ruling elite would qualify on all counts other than racial discrimination laws. In short, the admission as refugees of only white Afrikaners is entirely arbitrary. **Mistaken claims** Theexecutive orderthat led to the strange sight of happy Afrikaners en route to the land of plenty was based on some sorely mistaken claims. “In shocking disregard of its citizens’ rights, the Republic of South Africa (South Africa) recently enacted Expropriation Act 13 of 2024 (Act), to enable the government of South Africa to seize ethnic minority Afrikaners’ agricultural property without compensation,” it said. That is incorrect. The Act enables the government to seizeanyone’s propertywithout compensation. It is not limited to agricultural land, nor to land in general. It could confiscate cars, computers, machinery, and books. It is not limited to ethnic minority Afrikaners, but can be invoked against anyone, regardless of their ethnic or racial identity. “This Act follows countless government policies designed to dismantle equal opportunity in employment, education, and business, and hateful rhetoric and government actions fueling disproportionate violence against racially disfavored landowners.” Again, that is incorrect. The policies are designed torestoreequal opportunity in employment, education, and business. (Whether they do so, and whether they are justified, is a separate issue.) Hateful rhetoric happens, but that is mostly limited to the fringes of politics and is hardly unique to South Africa. That there is disproportionate violence against racially disfavoured landowners is also false. According to the Transvaal Landbou Unie (TLU SA),as quoted byAFP, Farm murders peaked at 119 in 2002, and have steadily decreased to 32 in 2024. That’s 32 too many, but that’s hardly “disproportionate violence”. The executive order undertakes that “the United States shall promote the resettlement of Afrikaner refugees escaping government-sponsored race-based discrimination, including racially discriminatory property confiscation”. Yes, there is race-based discrimination, and I (like the IRR) have been arguing that such redress measures ought to be retired for nigh on 20 years, but there has not been any “racially discriminatory property confiscation”. Not a single one of the 49 “refugees” has had their property confiscated without compensation. As far as I know, the newly amended Expropriation Act (objectionable though it is) has never been used in practice. **White genocide** The South African Police Service does not provide racially classified victim statistics, but it is highly likely that black people, both men and women, are far more likely to be victims of violence than relatively well-off (and consequently well-defended) white Afrikaners. US President, Donald Trump, and his MAGA enablers have long repeated “white genocide” talking points that are either wildly exaggerated or outright falsehoods. Back in 2018, whenTrump first raised this issue, the IRR’s Terrence Corrigan wrote anexcellent analysisthat concluded: “Both the white genocide narrative, and those who set it up as a straw man are doing no favours to the society they claim to care about.” Genocide Watch has a “watch” alert status on South Africa, but puts the country at the “polarisation” stage, which is a long way short of actual genocide. If polarisation was the criterion, one would have to conclude that left-wing professors, the LGBT+ community, immigrants, and Christian Nationalist right-wingers are all under imminent threat of genocide in the US. **Assimilation** Both of the Deputy Secretaries who welcomed the Afrikaners to the US spoke in vague and often mistaken terms about the hardships the new arrivals allegedly endured in South Africa. When asked why the Trump administration was welcoming Afrikaner refugees, while it blocked the entry of all other refugees into the US, both Landau and Edgar said that among the criteria for admission were “making sure that refugees did not pose any challenge to our national security and that they could be assimilated easily into our country”. Trump has declared a national emergency in order to bypass statutory law obliging the US to process the asylum applications of all other refugees. WatchChris Murphy, the ranking member of the US Senate Appropriations Subcommittee on Homeland Security, excoriating the Secretary of Homeland Security over a department “out of control” that violates both the Constitution and the rule of law. Admitting only white Afrikaners because they can be “assimilated easily” is a clear dog-whistle to the far right. Along with the “white genocide” talking points, it plays right into white nationalist rhetoric about the socio-economic stresses caused by “diversity”. **Great replacement** It also aligns with the “great replacement theory”, which argues that dark-skinned people from Muslim-majority countries are moving to “white” and “Christian” countries like the US with the objective of replacing the native (largely white and Christian) population. For clarity, immigrants comprised 14.3% of the US population in 2023, which is below peaks of nearer 15% in 1870, 1890, and 1910. Most of those immigrants are Catholic Christians from Central America. That Trump denounces South Africa’s government for racism may be true, but coming from him it is blatantly hypocritical. See if he admits any non-white refugees from South Africa’s stagnant economy, crumbling infrastructure, failing public services, endemic crime and violence, and world-record unemployment rate. There are real refugees, from regions far more dangerous than South Africa, that are being denied entry into the US. Some of them fought alongside American soldiers in its foreign campaigns. That the Trump administration ignores them, in favour of white Afrikaners, smacks of racism. Perhaps they deserve each other. I wish the happy Afrikaner refugees the best of luck. I hear a lot of vacancies for farm workers, janitors, and domestic cleaners have opened up since the mass deportations of insufficiently white immigrants began. *Ivo Vegteris a freelance journalist, columnist and speaker who loves debunking myths and misconceptions, and addresses topics from the perspective of individual liberty and free markets. This article was first published by theDailyfriendand is republished with permission **Related Stories** © biznews 2025"}