{"id": 2090, "name": "The Palestine Chronicle", "domain": "palestinechronicle.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.palestinechronicle.com/intl-law-in-the-face-of-genocide-seven-takeaways-from-floodgate-interview-with-triestino-mariniello/", "title": "Intl Law In The Face Of Genocide Seven Takeaways From Floodgate Interview With Triestino Mariniello", "content": "English Français Italiano Facebook Twitter Instagram Youtube Linkedin Home Page Articles News Live Blogs Videos Reviews About Support Us Contact Us Israel’s Experiment: Abu Shabab’s Criminal Militia Targeted by Gaza Resistance[ June 11, 2025 ] 64% of Israelis Believe ‘There are No Innocents’ in Gaza – New Poll Reveals[ June 11, 2025 ] Hague Group to Discuss ‘Legal and Diplomatic Measures’ to End Gaza Genocide[ June 11, 2025 ] Gaza Flotilla Activist Begins Hunger Strike as Israel Detains Eight, Deports Four[ June 11, 2025 ] Ben-Gvir Storms Al-Aqsa Hours after UK Sanctions for ‘Inciting Violence’[ June 11, 2025 ] **Intl Law in the Face of Genocide: Seven Takeaways from FloodGate Interview with Triestino Mariniello** ByRomana Rubeo **A recent FloodGate podcast featuring Professor Triestino Mariniello dissected the role of international law in the face of the Gaza genocide, raising critical questions about accountability and justice for Palestine.** The latest episode of the FloodGate podcast explores the urgent intersection of international law, human rights, and the Israeli occupation of Palestine amid the ongoing genocide in Gaza. I spoke with Professor Triestino Marinello, an expert in international law, who offered critical insights into the challenges of pursuing justice and accountability through existing legal mechanisms. We unpacked the key differences between the International Court of Justice (ICJ) and the International Criminal Court (ICC), and analyzed the legal and political ramifications of recent developments, including the genocide case against Israel and the arrest warrants issued for members of its leadership. Here are the seven takeaways from the interview: The discussion delved into the intricate role of international law and its institutions in addressing the case of Palestine. Marinello elucidated the distinct functions of the ICJ, which handles disputes between states, and the ICC, which prosecutes individuals for serious crimes. The conversation underscored the challenges inherent in applying and enforcing international law, particularly in politically charged situations where state cooperation is crucial yet often fraught. “The International Court of Justice is the highest judicial body of the United Nations. It has competence in relation to the state’s responsibility. So in contrast to the International Criminal Court, the International Court of Justice does not deal with individual criminal responsibility, but in other words, it deals with potential violations of international law by states,” Mariniello explained. “On the other side, we have the International Criminal Court, which is not a UN body. It’s an independent body created by states in 1998 in Rome, and (…) it deals with individual criminal responsibility. In other words, it has competence over individuals allegedly responsible for war crimes, genocide, crimes against humanity, and potentially the crime of aggression.” A significant portion of the discussion addresses the grave accusations leveled against Israel concerning its violations of international law. Marinello highlighted the ICJ’s findings indicating the plausibility of Israel committing genocide in the Gaza Strip and the ICC’s issuance of arrest warrants targeting Israeli leaders. “With regards to the International Court of Justice, first of all, South Africa has brought a case against Israel for the violation of the genocide convention uh in 2024,” he said. “So on three different occasions, the International Court of Justice has found that it’s plausible that Israel is committing genocide in the Gaza Strip. In other words, it’s violating the genocide convention of 1948 and has imposed provisional measures on the Israeli authorities.” “So far, Israel has not complied with any of the provisional measures uh imposed by the International Court of Justice,” Mariniello added. Rubeo and Marinello explored the persistent concerns about double standards and political influence within international legal frameworks. The conversation questioned the perceived neutrality of these institutions, raising the issue of selective enforcement and the potential for political bias to undermine their legitimacy. “It’s not clear why Netanyahu would have immunity for this state but not Putin, who is still the president of another state,” Maniello said. “It’s again the usual double standards policy, which so far, in my personal views, has been one of the main causes behind the commission of the most serious violation of international law by the Israeli authority in Gaza, but overall in the entire Palestinian occupied territory.” The podcast emphasized the critical importance of considering the broader historical and political context surrounding the ongoing genocide. Marinello argued against viewing recent events in isolation, stressing the need to acknowledge the ongoing occupation and its impact on the legal analysis. “The occupation itself in the last 70 years; the blockade of Gaza itself, without looking at any context, constitutes under international criminal law in my view, a crime against humanity itself,” Mariniello said. “So far, unfortunately, in this investigation, there is no proper reference to the context,” he added, lamenting the narrow scope of the ongoing investigations. In a recent interview for the FloodGate Podcast, Professor Richard Falk had stated that international institutions were “designed to be weak with respect to the enforcement of international law, particularly when geopolitical interests were engaged.” Marinello agreed with Professor these remarks and underscored the fundamental role of state cooperation in the efficacy of international law. ICC Rejects Israeli Appeal: Arrest Warrants Still Stand, Legal Expert Tells Palestine Chronicle He pointed out that the enforcement of legal decisions, such as arrest warrants, hinges on the willingness of states to act, a factor heavily influenced by political considerations. “It means that the court needs state cooperation. State cooperation depends on political will of states of course to even you know implement some decision that in a domestic context will not be very difficult in theory to implement like the one of an arrest warrants the court does not have its own police does not have its own army so it depends on on states for the implementation,” he explained. Despite the challenges and limitations, the discussion acknowledged the crucial role of civil society organizations and grassroots legal initiatives. Marinello highlighted their contributions to documenting violations, pursuing legal avenues, and keeping pressure on the political establishment. “There are a lot of organizations or individual lawyers, human rights lawyers, criminal lawyers bringing cases under the so-called universal jurisdiction or on the basis of double nationality of members of the IDF, just uh a few days ago in London,” he said. “I think it’s very important that we assist in an increase of these cases both before national authorities and in (…) the role of civil society organizations”. Is International Law Dead After Gaza? w/ Prof. Triestino Mariniello The podcast grappled with the ongoing debate about the actual effectiveness of international law. While recognizing its importance in establishing legal norms and pursuing accountability, the discussion also voices skepticism about its capacity to bring about tangible change in the face of political resistance and power imbalances. “I fully understand all the skepticism in relation to international law, international law instruments, in light of the ongoing genocide. But again, I think it’s important, especially for international lawyers, to make clear what the expectations are that we should have from international law.” “The problem again is not international law itself, is the states’ lack of political will to implement such in contrast to their obligation under international under international law,” Mariniello concluded. (The Palestine Chronicle) – Romana Rubeo is an Italian writer and the managing editor of The Palestine Chronicle. Her articles appeared in many online newspapers and academic journals. She holds a Master’s Degree in Foreign Languages and Literature and specializes in audio-visual and journalism translation. FloodGate Podcast gaza genocide International Law israel palestine Palestine Chronicle TV ‘Misleading the Public’ – UK Sent Arms to Israel despite Suspension ‘Misleading the Public’ – UK Sent Arms to Israel despite Suspension Trump Administration to Probe UW Protests for ‘Antisemitic Violence’ – Students Detained Trump Administration to Probe UW Protests for ‘Antisemitic Violence’ – Students Detained **Related Articles** **Rafah Ground Invasion Would Be Devastating – Canadian Foreign Minister** By Palestine Chronicle Staff Canada’s Foreign Minister Mélanie Joly has warned that an Israeli ground invasion of Rafah, in the southern Gaza Strip, would be devastating. “I’m very concerned about what’s going on in[…] **LIVE BLOG: New Year Rockets | Firing Ben-Gvir? | Missiles from Yemen – Day 452** By Palestine Chronicle Staff The Yemeni movement Ansarallah announced they carried out two military operations, targeting a power station and the Ben Gurion airport in Tel Aviv. The Gaza Civil Defense received many distress[…] **Israel to Deduct Stipends for Palestinian Prisoners from PA Tax Money** The Israeli Diplomatic-Security ‘Cabinet’ is expected to approve a major cut to the tax revenues Israel collects on behalf of the Palestinian Authority (PA). The amount the PA pays as stipends to the families of[…] **Leave a ReplyCancel reply** Your email address will not be published. Comment Name* Email* Website ×6=24 Momodou Taal is the perfect blend between intellect, ethics, and direct action. In this episode, he explains why he self-deported from the US. Your support fuels our fearless, truth-driven journalism. Together, we amplify Palestinian voices and stand for justice.PayPal|GoFundMe Your support fuels our fearless, truth-driven journalism. Together, we amplify Palestinian voices and stand for justice. PayPal|GoFundMe Your support fuels our fearless, truth-driven journalism. Together, we amplify Palestinian voices and stand for justice. PayPal|GoFundMe **Killed** **Missing** **Wounded** Israel’s Experiment: Abu Shabab’s Criminal Militia Targeted by Gaza ResistanceJune 11, 2025 64% of Israelis Believe ‘There are No Innocents’ in Gaza – New Poll RevealsJune 11, 2025 Hague Group to Discuss ‘Legal and Diplomatic Measures’ to End Gaza GenocideJune 11, 2025 Gaza Flotilla Activist Begins Hunger Strike as Israel Detains Eight, Deports FourJune 11, 2025 Ben-Gvir Storms Al-Aqsa Hours after UK Sanctions for ‘Inciting Violence’June 11, 2025 Red Card for Genocide: Why FIFA Must Be Held to AccountJune 11, 2025 ‘The War Has Exhausted Itself’: Trump Urges Netanyahu to Halt Gaza GenocideJune 11, 2025 Massacre at Aid Centers: Scores of Palestinians Killed by Israeli Fire in GazaJune 11, 2025 Bill to Dissolve Knesset Advances amid Deepening Israeli Political CrisisJune 11, 2025 Israel’s Coalition Verges on Collapse Again, but Netanyahu Will Put Up a FightJune 11, 2025 **DON'T MISS OUT** A recent New York Times made many claims about the ‘mass rape’ of Israeli women on October 7. But two leading Palestinian media organizations, The Palestine Chronicle and Friends of Palestine Network, conducted a joint investigation, the outcome of which resulted in the ‘The Black Dress’, a groundbreaking 18-minute documentary looking into allegations and the possible falsification of evidence. Palestine Chronicle Chronique de Palestine Palestine Chronicle Italia Facebook Twitter Instagram Youtube Linkedin Disclaimer RSS Feed Contact Us Copyright © 1999-2025 PalestineChronicle.com. All rights reserved | Powered ByMedia Seniors"}