{"id": 2196, "name": "Bullshit News", "domain": "bullshitnews.org", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://bullshitnews.org/2017/12/13/antifa-supersoldiers-are-killing-americans-in-their-own-home-over-americans-saying-merry-christmas-instead-of-the-liberally-correct-happy-hollidays/", "title": "Antifa Supersoldiers Are Killing Americans In Their Own Home Over Americans Saying Merry Christmas Instead Of The Liberally Correct Happy Hollidays", "content": "Bullshit News News For Your Brain, Not For Your Heart Home About Bullshit News Contact Donate for Freedom! **Antifa Supersoldiers Are KILLING AMERICANS IN THEIR OWN HOME Over Americans Saying “Merry Christmas” Instead Of The Liberally-Correct “Happy Hollidays”** Written by Don Kaftan, Editor-in-Chief, and Founder We have more depressing news today, little Timmy from Grand Forks, North Dakota was gunned down this morning from the anarchist and Democratic party faction called “Antifa”, which allegedly is short for “Anti-Fascist”. Antifa claims to be a “citizen’s organization dedicating to preparing for and fighting against fascism”. As usual with Democrats, they are hypocritical in their aims and really seek to take-over the state and replace it with fascism. Hmmm, this kind of story sounds familiar, does anyone remember how Stalin came into power from the USSR? He did the exact same thing these “Antifa” folks are doing. Sickening. There is a specialized branch in Antifa, where they inject their best men/women/third rails with tons of anabolic Tom Brady-endorsed steroids and quaaludes to bulk their soldiers to become Supersoldiers, which I had to infer is comparable to the United States Marine Corps, only the Marines have honor, and Antifa seeks to destroy the state with Stalinesque intentions. In any case, Antifa is a terrorist organization and what they did to poor little Timmy from North Dakota is something that needs to be more magnified in our mainstream media, but they are suspiciously quiet about this story. Hmmm…. Lil Timmy, from a God-fearing Protestant household of five, had his home invaded by five or six of these so-called “Super Soldiers” and asked poor old lil’ Timmy if he would wish them a “Happy Holidays” (sic). Five-year-old Timmy, who can only think from exposure of the mainstream media and perhaps also from his mother, did wish the Antifa Super-soldiers a “Merry Christmas”, and poor old lil’ Timmy from Grand Forks, North Dakota was gunned down not a second later. He was rushed to the hospital but the doctors said he died just as soon as he went inside the ER. He was only 5 years old. Antifa doesn’t care about you or your children, they want blood and they want to seek total control and abolition of the State, IE: OUR COUNTRY. Do not let the Antifa or their Ray Lewis ways of intimidation haunt you or change your political beliefs, that is exactly what they want. They are the American ISIS, and if you dare cross their beliefs, they’ll have their crosshairs on you. Be the God-fearing patriot that you are, and invoke the Second Amendment if need be. These Antifa maniacal bastards only their way to be the American way, and America cannot afford to become a terrorist state. We do not want Islam in America and these Antifa-Isis goons must be labeled as an extremist group from their liberal counterpart, the FBI, if we want to be a safe country that is tough on crime as the president wants it to be. Antifa will find anyone they label as a “dissident” or a “fascist” with their flawed terminology, and their Supersoldiers are the ones that act with total malice. Find your local arms dealer via the NRA or other means of self-protection to counter these liberal coons, it’s your rights you are fighting for, not theirs. Don Kaftan is the founder of Bullshitnews.org. He specializes in Mainstream Media Criticism, Foreign Policy, and Presidential Administrations. Don Kaftan says Merry Christmas to all, and so should you. **Share this:** Tweet Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Share on Tumblr Pocket Click to share on Telegram (Opens in new window)Telegram Click to share on WhatsApp (Opens in new window)WhatsApp **Related** **Post navigation** **5 thoughts on “Antifa Supersoldiers Are KILLING AMERICANS IN THEIR OWN HOME Over Americans Saying “Merry Christmas” Instead Of The Liberally-Correct “Happy Hollidays””** Pingback:Anti-Christmas Terrorist Arrested In Iowa Wal-Mart – Bullshit News Pingback:Propaganda And You: How To Become A More Informed And Productive Citizen – Bullshit News Pingback:If You Don’t Go To Church You Are A Terrorist – Bullshit News Pingback:Why Do Democrats Hate The Police? – Bullshit News Pingback:Donald Trump Thwarts Leftist Secret Service Assassination Attempt – Bullshit News **Leave a commentCancel reply** **History Of Bullshit News** July 2024 February 2023 July 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 September 2017 August 2017 July 2017 June 2017 **Recent Posts** Trump Selects “Zoomer”, JD Vance, As His Vice Presidential Running MateJuly 25, 2024 Weak Leftist President Joe Biden Decides To Not Run For ReelectionJuly 21, 2024 Donald Trump Thwarts Leftist Secret Service Assassination AttemptJuly 13, 2024 They’re Making JFK Woke NowFebruary 26, 2023 I Was At The January 6th Patriot Rally And This Is My StoryJuly 6, 2021 **Archives** July 2024 February 2023 July 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 September 2017 August 2017 July 2017 June 2017 Twitter Comment Reblog SubscribeSubscribedBullshit NewsJoin 48 other subscribersSign me upAlready have a WordPress.com account?Log in now. Bullshit News Already have a WordPress.com account?Log in now. Bullshit News Already have a WordPress.com account?Log in now. Bullshit NewsSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Bullshit News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Bullshit News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}