{"id": 689, "name": "Interpreter Magazine", "domain": "interpretermag.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.interpretermag.com/kill-the-messenger-how-russian-and-post-soviet-oligarchs-undermine-the-first-amendment/", "title": "Kill The Messenger How Russian And Post Soviet Oligarchs Undermine The First Amendment", "content": "ABOUT LATESTSpecial ReportsWindow on EurasiaGlobal Far RightUkraine At WarRussia UpdatePutin In SyriaThe Power VerticalThe Daily Vertical Special Reports Window on Eurasia Global Far Right Ukraine At War Russia Update Putin In Syria The Power Vertical The Daily Vertical Special Reports Window on Eurasia Global Far Right Ukraine At War Russia Update Putin In Syria The Power Vertical The Daily Vertical PODCASTSThe Power VerticalThe Daily VerticalPodcast The Power Vertical The Daily Vertical Podcast The Power Vertical The Daily Vertical Podcast **Kill the Messenger: How Russian and Post-Soviet Oligarchs Undermine the First Amendment** America has become a safe harbor for incredibly wealthy men who made billions from their post-Soviet homelands. For some, the U.S. offered a fresh start to those seeking to leave behind bad reputations, political risks or legal problems in their home countries. For others, it was a society that allowed them to safely park their assets all while continuing to indulge the leaders they sought to escape. Enter the twenty-first century and the posse of Putin’s oligarchs: Deripaska, Malofeev, Blavatnik, Vekselberg, Yakunin, and Prigozhin with their sacks of money, their blandishments, and, when necessary, their legal threats. These are men used to making their own rules—including rule No. 1: Don’t call them oligarchs. They come from their own closed societies to bask in the freedom offered in the U.S. But, in their own ways, they insist on tweaks to our society to suit their needs and habits. If their dark pasts or motives are challenged by journalists, threats to investigators and reporters often follow. To launder their reputations, they have been buying up experts and think-tanks, and even bribing politicians. This is a story of powerful men using seemingly unlimited resources to purchase their own version of the American dream—with a distinctly Soviet-style twist. Read the report “Kill the Messenger: How Russian and Post-Soviet Oligarchs Undermine the First Amendment” on how Putin’s oligarchs are working to reshape American society by corrupting its values and institutions, and what can be done to curtail their brutish ways. **Related Articles**"}