{"id": 1153, "name": "The Maple", "domain": "readthemaple.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.readthemaple.com/frequently-asked-questions/", "title": "Frequently Asked Questions", "content": "News Opinion Sign Up TopicsAbout UsClass Struggle Topics About Us Class Struggle Topics About Us Class Struggle Sign in Become a member **FAQ** Experiencing an issue with our website, your subscription, or your account? You’ve come to the right place. We’ve compiled answers to the most common questions we get from readers. **The Maple and Passage have merged. Find all your merger related questions here.** On April 19th, The Maple and Passage merged to to create an even more impactful media outlet. Read our full announcementhere.We’ve also prepared a separate FAQs page specifically for questions regarding the merger. You can find thathere. **Who funds The Maple?** The Maple is 100% reader-funded. Every dollar of our revenue comes from subscriptions to our daily newsletter and additional monthly donations from readers. We do not accept donations from third-party organizations of any kind and do not allow our publication to be used for advertising. **How do I sign in to my account?** Logging into your account allows you to change your preferences, subscription, and billing information. If you are a subscriber, it also allows you to access subscriber-only articles and newsletters.To access your account click the“Sign In”button on the top right of our website.Or click this link.You will be prompted to put in your email address (make sure it’s the one you signed up with).Once inputed, you’ll receive an email with a link that allows you to log in directly. No password is needed - just click the link that gets forwarded to you.Once logged in, your computer browser will remember you and keep you logged in until you sign out. **I’m a subscriber, why am I not receiving the daily newsletter?** There are a few possible reasons why this could be happening:Your email provider might be putting us in your Spam.Check your junk or spam inboxes. Could even be in another folder such as “promotions” or “updates.” If you see us there, here’s how to fix it.If you use Gmail: move this email to your primary inbox. How? On your phone: Tap the 3 dots in the top right corner, click “Move to”, then click “Primary”. If on desktop, drag and drop this email into the “Primary” tab in your inbox.If you use Apple Mail: tap on our email addresses at the top of this email (in the “From” line) and click “Add to VIPs”.If you use something else: Add our email address (hello@readthemaple.com) to your address book. You could have accidentally unsubscribed from emails. To see if this is the problem,sign into your account and then visit youraccount settings.Under the “Emails” section, manage your preferences to make sure you're subscribed to receive emails (The circle should be to the right and coloured in). If neither of these is the problem, contact us athello@readthemaple.comso we can help you get to the bottom of this. **How do I unsubscribe from emails from The Maple?** You can easily stop receiving emails through your account portal.Sign into your account and then visit youraccount settings.Under the “Emails” section, manage your preferences to turn off receiving newsletters. (The circle should be to the left and greyed out). Note that thisdoes not cancel your paid subscriptionif you have one. **How do I switch my account to a new email address?** You can easily change your email address through your account portal.Sign into your account and then visit youraccount settings. At the top of the portal, you will see an option to “Edit” your name and email address. **I have a new credit card, how do I change my payment information?** Credit card expired? No problem. You can update or change your payment information byclicking this linkor visiting the account portal.If you are a former Passage member, you can manage paid membership options by visitingthis link. **Why did I get charged again for a Maple membership?** As is standard for most media publications, memberships are yearly or monthly recurring charges. You'll be charged on the date you made the payment. If you aren’t interested in renewing, no problem! Check the FAQ below to see how to cancel. If you want a refund, please check our policy below. **How do I change or cancel my subscription?** You can change or cancel your subscription by going into your account portal.Sign into your account and then visit youraccount settings. The second row in the portal should list your plan and the rate you pay. Click on the “Change” option to pull up a second page that shows all of our available monthly and yearly plans. Here you can select any of these options to change your subscription plan.At the bottom of this page should be an option to “Cancel subscription.”Alternatively, you can try visitingour payment portal. If you have any difficulties cancelling your subscription, please contact us atpriority@readthemaple.comso we can fulfill your request. **What is your policy on refunds?** We know online payments can be frustrating, so we try to make it as simple as possible. We offer a full refund up to 365 days after purchase. **How do I turn off automatic subscription renewal?** To turn off automatic renewal, go to your account portal bysigning into your account and then visiting youraccount settings. Under your plan information select “Cancel subscription.” Your subscription will not be renewed at the end of your billing cycle. You can re-continue your subscription at any time by visiting the account portal. **Is my subscription tax-deductible?** Unfortunately, The Maple is not currently a registered journalism organization. That means our subscribers and donors are not eligible for charitable tax deductions.As a non-profit, we hope to eventually acquire this status so our supporters like you can claim the benefit of tax receipts. **Is The Maple related to North99?** The Maple was founded in August 2021 as the successor to North99, an advocacy group dedicated to building a more just Canada. Unlike North99, however, The Maple is solely a journalistic project, and does not conduct any advocacy work whatsoever. Further, The Maple has no affiliation or relationship of any kind with any political party, advocacy group or third-party advertisers. While The Maple is broadly aligned with North99’s aspiration for a more just Canada, The Maple’s managing editor had no involvement with North99, and has full independence and control over the new publication’s content and editorial direction. You can read more aboutour history here. **I made regular donations to North99, but now it’s going to ‘The Maple.’ What happened?** In August 2021, North99 changed to The Maple, becoming an independent digital news publication, covering Canadian politics from the perspective of the many, not the few. After years of advocacy work, it became clear that the mission of championing the issues of the 99% through media and analysis needed to take the next step.So many of the issues North99 was attempting to address through advocacy were rooted in the same problem. An establishment media that ignores the stories of everyday people while overrepresenting the wealthy and powerful.Founded from the ashes of North99, we’ve sought to makeThe Maplea media outlet for the people and funded by the people. We are 100% funded by individual Canadians like you - no ads, no outside funding, no corporate support. If you supported North99, we encourage you to check out our public-interest journalism. It’s our belief thatThe Maple’s fact-driven journalism from a progressive perspective is what is sorely needed in Canada’s media landscape. If you’ve continued your support through recurring donations, keep in mind that you are entitled to a complimentary Maple subscriptionthat gets you full access to our daily newsletter. Due to limitations with our email software, we asked that donors reach out to us to receive their benefits. If you have not yet, please contact us atpriority@readthemaple.comso we can get you in the loop. **Are you hiring or taking pitches from freelance journalists?** Unfortunately, we are not hiring at the moment. But we hope to expand our team as we grow our readership.The Maple does welcome unsolicited pitches for news and opinion pieces. If you are interested in sending us a pitch, please visit ourPitch Uspage to learn more about our process.We also maintain a \"writer roster\" of freelancers to regularly contribute to The Maple.Join our writer rosterand if we have a story or article idea that looks right for you, we’ll reach out to you directly and offer it as an assignment. **Can I Republish Articles By The Maple?** If you wish to republish or translate our content (including articles, photos, graphics or other media), you must first seek permission from the editors by emailinghello@readthemaple.com. Please do not use our content before you have obtained permission. If permission is granted, you must clearly indicate that the article was originally published by The Maple and provide a link to the original article. You may not make any edits or additions of any kind to the content. We reserve the right to take action if this policy is violated. If you have any additional questions or concerns, feel free to reach out to us at hello@readthemaple.com **Get all the latest posts delivered straight to your inbox.** The Big Tech companies should be broken up. Until then, you can follow us on their websites. Twitter Twitter: Opinion Instagram TikTok About Us Our Values Journalistic Standards Our History Sign In FAQ Commenting Policy Privacy Policy Courses Podcast Ebooks Transparency Reports Pitch Us Join Our Writer Roster Contact Us"}