{"id": 2087, "name": "Oxfam America", "domain": "oxfamamerica.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.oxfamamerica.org/explore/emergencies/gaza-and-israel-emergency-appeal/gaza-blockade-leading-to-widespread-suffering/", "title": "Gaza Blockade Leading To Widespread Suffering", "content": "**You can help right now** Rush a donation today to help us reach people with lifesaving aid in Gaza The futureis equal About usAbout usOxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together.OverviewWhat We BelieveFinancial information and annual reportsAnnual reportsFAQsKeeping people safe at Oxfam - SafeguardingOur leadershipSenior leadershipBoard of DirectorsOur historyMeasuring impactAmbassadorsSisters on the Planet®MusiciansCareersAvailable PositionsContact UsGeneral FAQsHelp making a donationEthics violations & complaintsThe future is equal.Equal rights. Equal treatment. Equal opportunities. For everyone.Start here About usOxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together.OverviewWhat We BelieveFinancial information and annual reportsAnnual reportsFAQsKeeping people safe at Oxfam - SafeguardingOur leadershipSenior leadershipBoard of DirectorsOur historyMeasuring impactAmbassadorsSisters on the Planet®MusiciansCareersAvailable PositionsContact UsGeneral FAQsHelp making a donationEthics violations & complaintsThe future is equal.Equal rights. Equal treatment. Equal opportunities. For everyone.Start here Oxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together. Overview What We Believe Financial information and annual reportsAnnual reportsFAQs Annual reports FAQs Keeping people safe at Oxfam - Safeguarding Our leadershipSenior leadershipBoard of Directors Senior leadership Board of Directors Our history Measuring impact AmbassadorsSisters on the Planet®Musicians Sisters on the Planet® Musicians CareersAvailable Positions Available Positions Contact UsGeneral FAQsHelp making a donationEthics violations & complaints General FAQs Help making a donation Ethics violations & complaints The future is equal. Equal rights. Equal treatment. Equal opportunities. For everyone. About usOxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together.OverviewWhat We BelieveFinancial information and annual reportsAnnual reportsFAQsKeeping people safe at Oxfam - SafeguardingOur leadershipSenior leadershipBoard of DirectorsOur historyMeasuring impactAmbassadorsSisters on the Planet®MusiciansCareersAvailable PositionsContact UsGeneral FAQsHelp making a donationEthics violations & complaintsThe future is equal.Equal rights. Equal treatment. Equal opportunities. For everyone.Start here Oxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together. Overview What We Believe Financial information and annual reportsAnnual reportsFAQs Annual reports FAQs Keeping people safe at Oxfam - Safeguarding Our leadershipSenior leadershipBoard of Directors Senior leadership Board of Directors Our history Measuring impact AmbassadorsSisters on the Planet®Musicians Sisters on the Planet® Musicians CareersAvailable Positions Available Positions Contact UsGeneral FAQsHelp making a donationEthics violations & complaints General FAQs Help making a donation Ethics violations & complaints The future is equal. Equal rights. Equal treatment. Equal opportunities. For everyone. Oxfam is a global organization that fights inequality to end poverty and injustice. Let’s build a more equal future—together. Overview What We Believe Financial information and annual reportsAnnual reportsFAQs Annual reports FAQs Annual reports FAQs Keeping people safe at Oxfam - Safeguarding Our leadershipSenior leadershipBoard of Directors Senior leadership Board of Directors Senior leadership Board of Directors Our history Measuring impact AmbassadorsSisters on the Planet®Musicians Sisters on the Planet® Musicians Sisters on the Planet® Musicians CareersAvailable Positions Available Positions Available Positions Contact UsGeneral FAQsHelp making a donationEthics violations & complaints General FAQs Help making a donation Ethics violations & complaints General FAQs Help making a donation Ethics violations & complaints The future is equal. Equal rights. Equal treatment. Equal opportunities. For everyone. Our workOur workWe demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive.OverviewStoriesCountries we work inFocus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justiceEmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blogGaza and Israel emergency appealMillions of people in Gaza are facing starvation and need urgent aid to survive.Learn more Our workWe demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive.OverviewStoriesCountries we work inFocus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justiceEmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blogGaza and Israel emergency appealMillions of people in Gaza are facing starvation and need urgent aid to survive.Learn more We demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive. Overview Stories Countries we work in Focus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice EmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Gaza and Israel emergency appeal Millions of people in Gaza are facing starvation and need urgent aid to survive. Our workWe demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive.OverviewStoriesCountries we work inFocus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justiceEmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blogGaza and Israel emergency appealMillions of people in Gaza are facing starvation and need urgent aid to survive.Learn more We demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive. Overview Stories Countries we work in Focus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice EmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Gaza and Israel emergency appeal Millions of people in Gaza are facing starvation and need urgent aid to survive. We demand equal rights, equal treatment, and equal opportunities so that everyone can thrive, not just survive. Overview Stories Countries we work in Focus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice EmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Gaza and Israel emergency appeal Millions of people in Gaza are facing starvation and need urgent aid to survive. Get InvolvedGet InvolvedWe believe in the power of people to fight inequality to end poverty and injustice.Act NowVolunteerAt concerts & eventsJoin the Action NetworkHost an Oxfam Hunger Banquet®Work at OxfamDonateTax the Ultra-RichPut working people before billionaires and corporations.Sign the Petition Get InvolvedWe believe in the power of people to fight inequality to end poverty and injustice.Act NowVolunteerAt concerts & eventsJoin the Action NetworkHost an Oxfam Hunger Banquet®Work at OxfamDonateTax the Ultra-RichPut working people before billionaires and corporations.Sign the Petition We believe in the power of people to fight inequality to end poverty and injustice. Act Now VolunteerAt concerts & eventsJoin the Action Network At concerts & events Join the Action Network Host an Oxfam Hunger Banquet® Work at Oxfam Donate Tax the Ultra-Rich Put working people before billionaires and corporations. Get InvolvedWe believe in the power of people to fight inequality to end poverty and injustice.Act NowVolunteerAt concerts & eventsJoin the Action NetworkHost an Oxfam Hunger Banquet®Work at OxfamDonateTax the Ultra-RichPut working people before billionaires and corporations.Sign the Petition We believe in the power of people to fight inequality to end poverty and injustice. Act Now VolunteerAt concerts & eventsJoin the Action Network At concerts & events Join the Action Network Host an Oxfam Hunger Banquet® Work at Oxfam Donate Tax the Ultra-Rich Put working people before billionaires and corporations. We believe in the power of people to fight inequality to end poverty and injustice. Act Now VolunteerAt concerts & eventsJoin the Action Network At concerts & events Join the Action Network At concerts & events Join the Action Network Host an Oxfam Hunger Banquet® Work at Oxfam Donate Tax the Ultra-Rich Put working people before billionaires and corporations. Ways to giveWays to giveMake a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact.Give onceGive monthlyMy monthly giftOxfam Partner FAQsGive to an emergencyStart a fundraiserCreate a legacy giftGive through your workplaceGive stockDonate Crypto to OxfamDonor advised fund giftsGive from your IRAGive in someone's honorCorporate partnershipsMake a grantRenew your membershipHelp making a donationOxfam Change MakersJoin the Impact CircleDonate nowMake a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice.Give now Ways to giveMake a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact.Give onceGive monthlyMy monthly giftOxfam Partner FAQsGive to an emergencyStart a fundraiserCreate a legacy giftGive through your workplaceGive stockDonate Crypto to OxfamDonor advised fund giftsGive from your IRAGive in someone's honorCorporate partnershipsMake a grantRenew your membershipHelp making a donationOxfam Change MakersJoin the Impact CircleDonate nowMake a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice.Give now Make a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact. Give once Give monthlyMy monthly giftOxfam Partner FAQs My monthly gift Oxfam Partner FAQs Give to an emergency Start a fundraiser Create a legacy gift Give through your workplace Give stock Donate Crypto to Oxfam Donor advised fund gifts Give from your IRA Give in someone's honor Corporate partnerships Make a grant Renew your membership Help making a donation Oxfam Change Makers Join the Impact Circle Donate now Make a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice. Ways to giveMake a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact.Give onceGive monthlyMy monthly giftOxfam Partner FAQsGive to an emergencyStart a fundraiserCreate a legacy giftGive through your workplaceGive stockDonate Crypto to OxfamDonor advised fund giftsGive from your IRAGive in someone's honorCorporate partnershipsMake a grantRenew your membershipHelp making a donationOxfam Change MakersJoin the Impact CircleDonate nowMake a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice.Give now Make a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact. Give once Give monthlyMy monthly giftOxfam Partner FAQs My monthly gift Oxfam Partner FAQs Give to an emergency Start a fundraiser Create a legacy gift Give through your workplace Give stock Donate Crypto to Oxfam Donor advised fund gifts Give from your IRA Give in someone's honor Corporate partnerships Make a grant Renew your membership Help making a donation Oxfam Change Makers Join the Impact Circle Donate now Make a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice. Make a donation to Oxfam to help families in more than 75 countries overcome poverty, hunger, and injustice. Learn how you can help make a positive impact. Give once Give monthlyMy monthly giftOxfam Partner FAQs My monthly gift Oxfam Partner FAQs My monthly gift Oxfam Partner FAQs Give to an emergency Start a fundraiser Create a legacy gift Give through your workplace Give stock Donate Crypto to Oxfam Donor advised fund gifts Give from your IRA Give in someone's honor Corporate partnerships Make a grant Renew your membership Help making a donation Oxfam Change Makers Join the Impact Circle Donate now Make a donation to Oxfam to help families in 75 countries overcome poverty, hunger, and injustice. About usOverviewWhat We BelieveFinancial information and annual reportsAnnual reportsFAQsKeeping people safe at Oxfam - SafeguardingOur leadershipSenior leadershipBoard of DirectorsOur historyMeasuring impactAmbassadorsSisters on the Planet®MusiciansCareersAvailable PositionsContact UsGeneral FAQsHelp making a donationEthics violations & complaints Overview What We Believe Financial information and annual reportsAnnual reportsFAQs Annual reports FAQs Keeping people safe at Oxfam - Safeguarding Our leadershipSenior leadershipBoard of Directors Senior leadership Board of Directors Our history Measuring impact AmbassadorsSisters on the Planet®Musicians Sisters on the Planet® Musicians CareersAvailable Positions Available Positions Contact UsGeneral FAQsHelp making a donationEthics violations & complaints General FAQs Help making a donation Ethics violations & complaints Overview What We Believe Financial information and annual reportsAnnual reportsFAQs Annual reports FAQs Annual reports FAQs Keeping people safe at Oxfam - Safeguarding Our leadershipSenior leadershipBoard of Directors Senior leadership Board of Directors Senior leadership Board of Directors Our history Measuring impact AmbassadorsSisters on the Planet®Musicians Sisters on the Planet® Musicians Sisters on the Planet® Musicians CareersAvailable Positions Available Positions Available Positions Contact UsGeneral FAQsHelp making a donationEthics violations & complaints General FAQs Help making a donation Ethics violations & complaints General FAQs Help making a donation Ethics violations & complaints Our workOverviewStoriesCountries we work inFocus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justiceEmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Overview Stories Countries we work in Focus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice EmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Overview Stories Countries we work in Focus areasClimate actionEconomic and racial justiceHumanitarian responseWomen's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice Climate action Economic and racial justice Humanitarian response Women's rights and gender justice EmergenciesMyanmar earthquake appealGaza and Israel emergency appealLebanon crisis appealDemocratic Republic of Congo crisis appealSudan displacement crisisEast Africa hunger crisisGlobal refugee crisisWest Africa hunger crisis & Sahel droughtSaving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Myanmar earthquake appeal Gaza and Israel emergency appeal Lebanon crisis appeal Democratic Republic of Congo crisis appeal Sudan displacement crisis East Africa hunger crisis Global refugee crisis West Africa hunger crisis & Sahel drought Saving lives 24/7 Research and publicationsAnnual reportsOxfam Closeup MagazineImpact updatesFact sheetsEvaluationsBriefsBrochuresResearchBooksPolitics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Annual reports Oxfam Closeup Magazine Impact updates Fact sheets Evaluations Briefs Brochures Research Books Politics of Poverty blog Get InvolvedAct NowVolunteerAt concerts & eventsJoin the Action NetworkHost an Oxfam Hunger Banquet®Work at OxfamDonate Act Now VolunteerAt concerts & eventsJoin the Action Network At concerts & events Join the Action Network Host an Oxfam Hunger Banquet® Work at Oxfam Donate Act Now VolunteerAt concerts & eventsJoin the Action Network At concerts & events Join the Action Network At concerts & events Join the Action Network Host an Oxfam Hunger Banquet® Work at Oxfam Donate Ways to giveGive onceGive monthlyMy monthly giftOxfam Partner FAQsGive to an emergencyStart a fundraiserCreate a legacy giftGive through your workplaceGive stockDonate Crypto to OxfamDonor advised fund giftsGive from your IRAGive in someone's honorCorporate partnershipsMake a grantRenew your membershipHelp making a donationOxfam Change MakersJoin the Impact Circle Give once Give monthlyMy monthly giftOxfam Partner FAQs My monthly gift Oxfam Partner FAQs Give to an emergency Start a fundraiser Create a legacy gift Give through your workplace Give stock Donate Crypto to Oxfam Donor advised fund gifts Give from your IRA Give in someone's honor Corporate partnerships Make a grant Renew your membership Help making a donation Oxfam Change Makers Join the Impact Circle Give once Give monthlyMy monthly giftOxfam Partner FAQs My monthly gift Oxfam Partner FAQs My monthly gift Oxfam Partner FAQs Give to an emergency Start a fundraiser Create a legacy gift Give through your workplace Give stock Donate Crypto to Oxfam Donor advised fund gifts Give from your IRA Give in someone's honor Corporate partnerships Make a grant Renew your membership Help making a donation Oxfam Change Makers Join the Impact Circle About us Stories Press Careers Contact us Help Home Our work Emergencies Donate to the Gaza and Israel emergency appeal Gaza blockade leading to widespread suffering **Gaza blockade leading to widespread suffering** As humanitarian partners struggle to help Palestinians in Gaza survive, Oxfam is pushing the U.S. to pressure the Israeli government to allow in humanitarian aid. Humanitarian efforts to help people in Gaza are on the brink of complete collapse, following the re-imposition of a full blockade on March 2nd. Palestinians are facing starvation, displacement, and bombardment, as conditions continue to worsen in the now more than 18-month-old conflict. With support from Oxfam and others, Palestinian organizations in Gaza are providing food, clean water, basic sanitation, and support for survivors of violence in Gaza. But they are carrying out their work in an increasingly dangerous environment since the end of the most recent ceasefire in March. “We have had to continue our work, despite the lack of safety, as countless people rely on us for water during these dire times,” says Mohammad Nairab, the executive manager of Palestinian Environmental Friends Association (PEF). International humanitarian groups are also speaking out about the difficulties facing people in Gaza, and those who are committed to helping them. “Every day, aid workers - the majority of whom are Palestinian - are targeted, detained, obstructed or killed,” readsa statement signed by 24 humanitarian organizations(including Oxfam), released on April 17th. “People are in terror, fearing for their lives as displacement orders tell them to move with whatever they can carry,” says Clemence Lagouardat, who is leading Oxfam’s humanitarian response Gaza. “We must see an end to this terror and carnage right now, with a lifting of the siege to allow urgent humanitarian aid to reach all of those in need.” **Is aid getting into Gaza?** By preventing all food and humanitarian aid from entering Gaza, the government of Israel is starving the population. On April 25th, theWorld Food Programme (WFP) announced it had run out of suppliesin Gaza, and was no longer able to support the bakeries and kitchens providing affordable bread and free hot meals. WFP analysis in April reported “a sharp rise in food prices, high volatility, and significant shortages of essential commodities” following the closure of all crossings in early March. Increasingly scarce food and high prices are creating a deadly combination, particularly for children. Nearly 3,700 children in March were admitted to health facilities for treatment for acute malnutrition, compared to slightly over 2,000 in February, according to figures from the UN. A recent report from the Integrated Food Security Phase Classification, which monitors famine conditions in multiple countries, says that people in Gaza face a “critical risk of famine. ... The entire population is facing high levels of acute food insecurity, with half a million people ... facing starvation.” A post shared by Oxfam US (@oxfamamerica) **What Oxfam is doing in Gaza** Despite dangerous operating conditions, PEF and otherOxfam partners in Gazaare providing water to people who have been displaced from their homes (in many cases, multiple times). Working with rapidly diminishing resources, they are building or repairing latrines, and delivering soap and other hygiene items that will help people avoid water-borne diseases. In rural areas, Oxfam partners are assisting farmers in need of basics like seeds, tools, and irrigation equipment to re-start agricultural production—part of a long-term effort to head off thethreat of faminein Gaza. **Advocating for peace** While our staff continues its work in Gaza, Oxfam America is advocating for the U.S. government to do everything possible to achieve and preserve a permanent ceasefire, secure the release of all remaining hostages, and allow unimpeded access for humanitarian aid to reach the civilians. Oxfam has been meeting with members of Congress to update them on the humanitarian situation and urge their support for ending the blockade and protecting the humanitarian delivery system in Gaza. The U.S. must also stop lethal arms transfers to the Israeli government. The proposed sales of $8.8 billion in offensive weapons to Israel would violate U.S. laws prohibiting sales of weapons to governments that block humanitarian aid or commit violations of human rights. **Global aid cuts also affecting Gaza** The U.S. government has recently stopped more than 80 percent of funds directed to, and laid off staff at, theU.S. Agency of International Development(USAID), resulting in a significant reduction of resources available to many of the organizations assisting people in humanitarian emergencies across the globe. In Gaza, these cuts are also affecting several UN agencies (which were already facing budget cuts) that are assisting Palestinians.Oxfam has filed a lawsuitalleging the cancellation of USAID contracts and other measures to cut off lifesaving humanitarian aid violate U.S. law. Oxfam staff, in collaboration with Oxfam supporters and representatives of civil society organizations directly affected by the international aid cuts, have met with Congressional and State Department staff to advocate for humanitarian assistance funds that can help civilians in Gaza and other emergencies. As part of this effort in Washington, 100Oxfam Action Networkvolunteers andSisters on the Planet Ambassadors(a group of influential women leaders committed to fighting inequality) held 130 meetings on Capitol Hill in March, urging members of Congress to invest in humanitarian aid and economic policies that have the greatest impact on women and girls. Oxfam is calling on supporters tourge the U.S. governmentto help achieve a permanent ceasefire and allow humanitarian assistance into Gaza. So far more than 50,000 supporters have sent this powerful message to the president advocating for a ceasefire, the safe return of hostages, and unimpeded humanitarian access to Gaza. **Gaza needs a permanent ceasefire now** Urge the U.S. government to help achieve a permanent ceasefire, the safe return of all hostages, and humanitarian access to Gaza. **Share this article:** **Related content** **What USAID does, and the impact of Trump’s cuts on foreign aid** Oxfam outlines the latest in the closing of the U.S. Agency for International Development. Take action to protect U.S. humanitarian aid. **Making foreign aid work** **Humanitarian response** **Donate now** $ Donate Make sure your gift to Oxfam America goes directly to where it's most needed, without delay, with a secure online donation. (Looking to make a monthly donation, fundraise for Oxfam, or give some other way?Visit our donate page.) **Explore** Financial information Stories & updates Research & publications FAQs **Take action** Act Now Volunteer Host a Hunger Banquet Work at Oxfam Donate (800)-776-9326[email protected] (800)-776-9326 [email protected] (800)-776-9326 [email protected] Oxfam About us Stories Press Careers Contact us Help © 2025 Oxfam America Inc. All rights reserved. Oxfam is a global organization that fights inequality to end poverty and injustice. We offer lifesaving support in times of crisis and advocate for economic justice, gender equality, and climate action. We demand equal rights and equal treatment so that everyone can thrive, not just survive. The future is equal. Oxfam America is a 501(c)(3) organization. Gifts are tax deductible to the full extent allowable under the law. Privacy & Terms of Use"}