{"id": 1071, "name": "Ottumwa Courier", "domain": "ottumwacourier.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ottumwacourier.com/news/record/database-2024-area-public-salaries/html_0b74d04e-034e-11f0-9edf-9bf0826cfb1d.html", "title": "Database 2024 Area Public Salaries", "content": "Facebook Instagram Email Local News Ottumwa Wapello County Southeast Iowa Public Records The Up Beat Centerville State news National news Savvy_senior Comics Puzzles Games Local Sports High School Sports National Sports Iowa Sports Columns Editorials Letters to the Editor Rules Submit an announcement Submit an obituary/notice Jobs Autos Homes Place An Ad iowapublicnotices.com Personnel listing Advertising rate card Submit a Letter to the Editor Submit a News Tip Submit an Obituary Submit a lifestyles announcement Work at The Courier Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Weekly Ads Newspaper Ads Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an ObituaryAdvertise With Us Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Advertise With Us Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Advertise With Us SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Login E-Paper EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event CelebrationsSubmit an announcement Submit an announcement Submit an announcement ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary Classifieds Public Noticesiowapublicnotices.com iowapublicnotices.com iowapublicnotices.com Photo Reprints 91°Ottumwa, IA(52501)TodayA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph..TonightA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.Updated: June 11, 2025 @ 4:25 pmFull Forecast Ottumwa, IA(52501)TodayA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph..TonightA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.Updated: June 11, 2025 @ 4:25 pm A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.. A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph. Updated: June 11, 2025 @ 4:25 pm Full Forecast Ottumwa, IA(52501)TodayA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph..TonightA few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.Updated: June 11, 2025 @ 4:25 pm A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.. A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph. Updated: June 11, 2025 @ 4:25 pm A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph.. A few clouds. A stray shower or thunderstorm is possible. Low 64F. Winds S at 10 to 15 mph. Updated: June 11, 2025 @ 4:25 pm Full Forecast E-paper Newsletter Facebook Instagram **DATABASE: 2024 Area Public Salaries** Apr 16, 2025 Apr 16, 2025 A database of public salaries including the City of Ottumwa, Wapello County, Ottumwa Community School District, Indian Hills Community College, Ottumwa Water Works, City of Eldon, City of Blakesburg, City of Eddyville, South Iowa Area Detention Service Agency, South Iowa Area Crime Commission, Eddyville Water Department. Wapello_county Salaries Salary Pay Government Local Iowa Ottumwa Wapello Eddyville Blakesburg Water Works Officials Database 2024 Courier Indian Hills Community College School Schools **Trending Recipes** **Submit news tip** We're always interested in hearing about news in our community. Let us know what's going on! **Public Salaries Database** A searchable database of public salaries including the City of Ottumwa, Wapello County, Ottumwa Community School District, Indian Hills Community College, Ottumwa Water Works, City of Eldon, City of Blakesburg, City of Eddyville, South Iowa Area Detention Service Agency, South Iowa Area Crime Commission, Eddyville Water Department. **Obituaries** More Obituaries **Most Popular** Articles Images Videos Mexican police kill 4 gunmen, cross into Guatemala in dramatic border shootout Ottumwa Job Corps to shut down Council members, public bristle over Pride Month proclamation Prep baseball: Mohawks win EBF Invite City revises fireworks ordinance to match new state law Federal immigration raid at Omaha meat production plant sparks protests After 81 years, D-Day soldier from Iowa buried in home state Prep baseball: Pitching powers Bulldogs past Roosevelt Ottumwa Pride Block Party returns Saturday with new venue and full lineup Former deputy fire chief charged with theft Sign up now to get our FREE breaking news coverage delivered right to your inbox. Sign up now to get news, sports, deals and more delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Work At The Courier Advertise with Us Personnel Contests Rules Subscriber Services Submission Forms Cookie Preferences Home News Comics Puzzles Sports Community Centerville News & Sports Opinion Obituaries Photos Video Gallery Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}