{"id": 122, "name": "Beacon Research/Shaw & Co", "domain": "beaconresearch.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://beaconresearch.com/contact/privacy-policy/", "title": "Privacy Policy", "content": "617-939-0125 contact@beaconresearch.com 617-939-0125 contact@beaconresearch.com Home Who We Are Our Work News & Insights Contact **Privacy Policy** **Privacy Policy for Beacon Research, LLC** Last updated: February 22, 2024 This Privacy Policy (“Policy”) describes how Beacon Research, LLC (“we,” or “us”) collects, uses, and discloses your information in connection with your use of our websites (collectively, the “Site”). Except as otherwise explicitly provided herein, this Policy applies only to information collected on or through the Site, and it does not apply to information collected or obtained by or through any other means (including, without limitation, information collected offline, in person, over the telephone and/or by mail, or from third parties outside the Site). By using the Site, you consent to the data practices described in this Policy. If you do not agree with these terms, then please do not use the Site or provide us with any personal information. **Information Collection and Use** Beacon Research, LLC maintains strict privacy policies, ensuring that personal information of our users and members is not sold, rented, released, or traded to others without prior consent or a legal obligation. We collect information directly from you when you use the Site, for example, when you fill out our Contact Us form, send us email messages, participate in surveys, or apply for employment or an internship opportunity on our Site. The information you provide directly to us may include, but is not limited to: name, email address, company name, and any other information you may choose to provide when communicating with us. **Log Data** We collect information that your browser sends whenever you visit our Service (“Log Data”). This Log Data may include information such as your computer’s Internet Protocol (“IP”) address, browser type, browser version, the pages of our Service that you visit, the time and date of your visit, the time spent on those pages and other statistics. **Cookies** Cookies are files with small amount of data, which may include an anonymous unique identifier. Cookies are sent to your browser from a web site and stored on your computer’s hard drive. We use “cookies” to collect information. You can instruct your browser to refuse all cookies or to indicate when a cookie is being sent. However, if you do not accept cookies, you may not be able to use some portions of our Service. **Service Providers** We may employ third party companies and individuals to facilitate our Service, to provide the Service on our behalf, to perform Service-related services or to assist us in analyzing how our Service is used. **Security** The security of your Personal Information is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we strive to use commercially acceptable means to protect your Personal Information, we cannot guarantee its absolute security. **Links To Other Sites** Our Service may contain links to other sites that are not operated by us. If you click on a third party link, you will be directed to that third party’s site. We strongly advise you to review the Privacy Policy of every site you visit. We have no control over, and assume no responsibility for the content, privacy policies or practices of any third party sites or services. **Children’s Privacy** Our Service does not address anyone under the age of 18 (“Children”). We do not knowingly collect personally identifiable information from children under 18. If you are a parent or guardian and you are aware that your child has provided us with Personal Information, please contact us. If we discover that a child under 18 has provided us with Personal Information, we will delete such information from our servers immediately. **SMS Opt-Out** If you are receiving text messages from us and wish to stop receiving them, simply respond with either “STOP” or “UNSUBSCRIBE” to the number from which you received the message. Once we receive your message, you will no longer receive further text messages from us. **Changes To This Privacy Policy** We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page. **Contact Us** If you have any questions about this Privacy Policy, please contact us. Home Who We Are Our Work News & Insights Contact 617-939-0125 contact@beaconresearch.com ©2025 Beacon Research, LLC. All Rights Reserved. •Privacy Policy"}