{"id": 2062, "name": "Santa Barbara News-Press", "domain": "newspress.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.newspress.com/2025/04/22/we-bought-our-hometown-paper-to-preserve-its-past-now-were-setting-it-on-a-course-for-the-future/", "title": "We Bought Our Hometown Paper To Preserve Its Past Now Were Setting It On A Course For The Future", "content": "NEWSLETTER DONATE Facebook Instagram LinkedIn Facebook Instagram LinkedIn Santa Barbara News Press NEWSLETTER DONATE **We bought our hometown paper to preserve its past. Now, we’re setting it on a course for the future** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit Over the past year, I have been a partner in a philanthropic effort to secure and preserve the archives of the Santa Barbara News-Press for community benefit. When the News-Press filed for bankruptcy in 2023, I heard from local journalists that the physical archives of the paper were of significant historical value. There was concern about the state of the archives and what might become of them in the bankruptcy process. Last March, a company from Malta offered — through the U.S. Bankruptcy Court — to buy the News-Pressdigitalarchives, trademark, internet domains and social media accounts. We wanted to keep these historical resources under local control, so we competed for the assets at auction in the Bankruptcy Court, and ours was the winning bid. Upon securing thedigitalarchives, we soon had the pleasure of getting to know the Santa Barbara Historical Museum when they announced their desire to secure thephysicalarchives. It quickly became clear that the Historical Museum is the logical place to receive and preserve the archives — both physical and digital. The physical archives were to be sold by the Bankruptcy Court separately. The Historical Museum successfully bid on them in September. We were pleased to support them in these efforts and also made clear our intention to share the digital archives with them. We are exceedingly pleased with this outcome, and we hope others will join us in supporting the Historical Museum as they take on the herculean effort of conserving the archives. You can make a tax-deductible donation to theHistorical Museum. As a result of our winning bid for the digital archives, we inadvertently also ended up owning the assets necessary to restart the News-Press as a business: the trademark, domains, social media accounts and copyrights to the digital archives. While many suggested we restart the paper, we had no interest in doing so ourselves and were also concerned about selling the business to for-profit actors who might not be driven by the community’s best interests. However, since we owned the News-Press as a business, we had to consider what to do with it. Through our research, we became aware of a national movement devoted to preserving local news. Journalistic and philanthropic leaders in this movement pointed us to a relatively new nonprofit organization calledNEWSWELL, which is affiliated with Arizona State University’sWalter Cronkite School of Journalism and Mass Communication. NEWSWELL is led by highly respected journalists with impeccable credentials. Through a nonprofit approach, they are at the forefront of national efforts to help local news outlets that are struggling to stay afloat. More information about NEWSWELL is locatedhere. We found the NEWSWELL model to be very exciting, so we decided to donate the News-Press as a business to them. NEWSWELL intends to restart the News-Press as a locally based online media outlet. NEWSWELL will provide administrative and strategic support, but the News-Press will be led by local editors, reporters and staff. A local advisory board will also be established to help further ensure that the News-Press is connected with, and responding to, the local community. Freedom of the press is explicitly protected in the First Amendment of the U.S. Constitution. Professional, unbiased, independent reporters and media outlets are among the core foundations of our democratic system. They are critical to the health and strength of local communities and the continuance of civic dialogue. At a time of extreme partisanship and divisiveness at the national level, local news matters more than ever. This is an excellent opportunity for Santa Barbara to be part of a national movement to save local news and to expand news coverage in our community. While we have no desire to stay involved with the News-Press going forward, we are pleased it will be revived and led by professionals who have unbiased news coverage and the best interests of our community as their guiding principles. In closing, we would like to thank a few people who have helped us in these efforts. Credit is due to Will Belfiore and Zachary Grimshaw whose research and written commentary in the local media about the importance of keeping News-Press assets in local hands helped inspire us to get involved. Also, special thanks to Steve Sereboff, our intellectual property attorney, and our bankruptcy attorney, Will Beall. Ben Romo, a former Santa Barbara News-Press paperboy,is a consultant in Santa Barbara, focused on government relations, philanthropy and nonprofit services. **Ben Romo** Ben Romo, a former Santa Barbara News-Press paperboy, is a consultant in Santa Barbara, focused on government relations, philanthropy and nonprofit services.More by Ben Romo Facebook Instagram LinkedIn Contact usDonateRepublication guidelinesPrivacy statementTerms of use"}