{"id": 1927, "name": "Conservative Base", "domain": "conservativebase.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://conservativebase.com/warning-from-catholic-archbishop-president-trump-is-preparing-to-fight-against-the-demonic-deep-state-and-new-world-order/#comment-931667", "title": "Warning From Catholic Archbishop President Trump Is Preparing To Fight Against The Demonic Deep State And New World Order", "content": "**Conservative Base** Information for conservatives, by conservatives. Home About Featured U.S. News Commentary Politics Contact **Warning from Catholic Archbishop: President Trump Is Preparing to Fight Against the Demonic Deep State and New World Order** Archbishop Carlo Maria Viganò, the former apostolic nuncio to the United States, wrote a letter this year for the National Catholic Prayer Breakfast, which was held on Wednesday. Archbishop Vigano warned Catholics on the importance of the 2020 presidential election on the future of the United States and the world. President Donald Trump is standing up against the demonic forces of the deep state and the New World Order, the Archbishop said. (An apostolic nuncio (also known as a papal nuncio or simply as a nuncio) is an ecclesiastical diplomat, serving as an envoy or a permanent diplomatic representative of the Holy See to a state or to an international organization.) The devout cleric views the 2020 presidential election as being the “Children of Light against the Children of Darkness.” “President Trump is the greatest defender of the Supreme Values of the Christian civilization: of life, from conception to natural death; of the natural family composed of one man and one woman and children; and of love for the homeland:One Nation under God!”the Archbishop noted. The prayer breakfast leaders chose not to read this letter during the breakfast. Here this the letter from Archbishop: I would like to make myself present on this memorable occasion, in which I participated with great enthusiasm as Apostolic Nuncio during the years of my mission in Washington, D.C. (2011-2016). I therefore join all the participants in this extraordinary celebration and all American Catholics, who see in President Donald Trump the greatest defender of the supreme values of Christian civilization: of life, from conception to natural death; of the natural family composed of one man and one woman and children; and of love for the homeland: One Nation under God! And, most importantly, he stands for defending the right to freely practice our Faith, thus allowing us more fully to honor God. The presidential elections in November represent an epochal challenge, a biblical challenge, the outcome of which will be decisive not only for the United States of America but for the whole world. It is necessary that all of you Catholics of America are well aware of the role that Providence has deigned to entrust to your President, and that you are aware of the extraordinary battle that He is preparing to fight against the demonic forces of the deep state and against the New World Order. I am at your side with fervent prayer, together with millions of Catholics and with all people of good will throughout the world. Our trust rests in God, the Almighty, whose right hand always works wonders. Carlo Maria Viganò,Titular Archbishop of UlpianaFormer Apostolic Nuncio of Washington, D.C. (2011-2016) In a previous letter to President Donald Trump, Archbishop Vigano wrote: For the first time, the United States has in you a President who courageously defends the right to life, who is not ashamed to denounce the persecution of Christians throughout the world, who speaks of Jesus Christ and the right of citizens to freedom of worship. Your participation in the March for Life, and more recently your proclamation of the month of April as National Child Abuse Prevention Month, are actions that confirm which side you wish to fight on.And I dare to believe that both of us are on the same side in this battle, albeit with different weapons. For this reason, I believe that the attack to which you were subjected after your visit to the National Shrine of Saint John Paul II is part of the orchestrated media narrative which seeks not to fight racism and bring social order, but to aggravate dispositions; not to bring justice, but to legitimize violence and crime; not to serve the truth, but to favor one political faction. And it is disconcerting that there are Bishops – such as those whom I recently denounced – who, by their words, prove thatthey are aligned on the opposing side. They are subservient to the deep state, to globalism, to aligned thought, to the New World Orderwhich they invoke ever more frequently in the name of a universal brotherhood which has nothing Christian about it, but which evokes the Masonic ideals of those want to dominate the world by driving God out of the courts, out of schools, out of families, and perhaps even out of churches. The American people are mature and have now understood how much the mainstream media does not want to spread the truth but seeks to silence and distort it, spreading the lie that is useful for the purposes of their masters.However, it is important that the good – who are the majority – wake up from their sluggishness and do not accept being deceived by a minority of dishonest people with unavowable purposes. It is necessary that the good, the children of light, come together and make their voices heard. What more effective way is there to do this, Mr. President, than by prayer, asking the Lord to protect you, the United States, and all of humanity from this enormous attack of the Enemy? Before the power of prayer, the deceptions of the children of darkness will collapse, their plots will be revealed, their betrayal will be shown, their frightening power will end in nothing, brought to light and exposed for what it is: an infernal deception. Mr. President, my prayer is constantly turned to the beloved American nation, where I had the privilege and honor of being sent by Pope Benedict XVI as Apostolic Nuncio. In this dramatic and decisive hour for all of humanity, I am praying for you and also for all those who are at your side in the government of the United States. I trust that the American people are united with me and you in prayer to Almighty God. United against the Invisible Enemy of all humanity, I bless you and the First Lady, the beloved American nation, and all men and women of good will. + Carlo Maria Viganò Titular Archbishop of Ulpiana ←Biden Family Cashed In On Joe Biden’s Vice Presidency, Says Senate Probe Report Joe Biden’s Habitual Lying: Claims of Attending Black College Proven False→ Jim Kouri, CPP, is founder and CEO of Kouri Associates, a homeland security, public safety and political consulting firm. He's formerly Fifth Vice-President, now a Board Member of the National Association of Chiefs of Police, a columnist, and a contributor to the nationally syndicated talk-radio program, the Chuck Wilder Show.. He's former chief of police at a New York City housing project in Washington Heights nicknamed \"Crack City\" by reporters covering the drug war in the 1980s. In addition, he served as director of public safety at St. Peter's University and director of security for several major organizations. He's also served on the National Drug Task Force and trained police and security officers throughout the country. **2 thoughts on “Warning from Catholic Archbishop: President Trump Is Preparing to Fight Against the Demonic Deep State and New World Order”** MR PSeptember 29, 2020 at 12:14 pmPermalinkBERNIE SANDERS IS IN CONTROL OF THE SOCIALIST DEMOCRATIC PARTY. BIDEN HAD TO ACCEPT HIS SOCIALIST MOVEMENT TO WIN THE DEMOCRATIC NOMINATION.SOCIALISM= FEED THE AMERICAN PEOPLE SMALL DOSES OF SOCIALISM UNTIL THEY FINALLY AWAKE AND FIND THEY ARE UNDER COMMUNIST LAW AND ORDER.HOW WILL SOCIALISM AND COMMUNISM TAKE OVER AMERICA.(1) RELIGION: REMOVING THE BELIEF IN “GOD”. REMOVE GOD FROM THE GOVERNMENT AND SCHOOLS. THE AMERICAN PEOPLE NEED TO BELIEVE IN ONLY THE GOVERNMENT. GOVERNMENT KNOWS WHAT’S BEST FOR THE PEOPLE.(2) EDUCATION= TAKE CONTROL OF WHAT PEOPLE READ, SEE ON T.V.,RADIO, CELL PHONES AND ESPECIALLY WHAT CHILDREN ARE TAUGHT IN SCHOOL AND THE UNIVERSITY SYSTEMS.(3) DEBT= INCREASE THE NATIONAL DEBT TO UNSUSTAINABLE LEVELS, THAT WAY YOU WILL BE ABLE TO INCREASE TAXES AND THIS WILL PROVIDE MORE POVERTY.(4) POVERTY= INCREASE THE POVERTY LEVEL AS HIGH AS POSSIBLE. POOR PEOPLE ARE EASIER TO CONTROL AND WILL NOT FIGHT BACK IF YOU ARE PROVIDING EVERYTHING FOR THEM.(5) WELFARE= TAKE CONTROL OF EVERY ASPECT( FOOD, HOUSING, AND INCOME) THIS WILL MAKE THEM FULLY DEPENDENT ON THE GOVERNMENT.(6) HEALTH CARE.= CONTROL HEALTHCARE AND YOU CAN CONTROL THE PEOPLE..(7) CLASS WARFARE: DIVIDE THE PEOPLE INTO WEALTHY VS THE POOR. ELIMINATE THE MIDDLE CLASS. THIS WILL CAUSE MORE DISCONTENT AND IT WILL BE EASIER TO TAX THE RICH WITH THE SUPPORT IF THE POOR..(8) GUN CONTROL:: REMOVE THE ABILITY FOR THE AMERICAN PEOPLE TO DEFEND THEMSELVES FROM THE GOVERNMENT. . THIS WAY YOU WILL BE ABLE TO CREATE A POLICE STATE. NO POLICE DEPARTMENT BUT A FEDERAL ARMY RULED BY COMMUNIST . .IN 1959 RUSSIAN PRESIDENT NIKITA KHRUSHCHEV BANGED HIS SHOE ON THE PODIUM AT THE UNITED NATIONS AND DECLARED THAT OUR CHILDREN WILL LIVE UNDER COMMUNISM–AMERICANS ARE SO GULLIBLE. .IF AMERICA VOTERS WANT SOCIALISM THIS NOVEMBER, THEN ALL THE MEN AND WOMEN WOULD HAVE DIED IN VAIN.WAKE UP AMERICA. THIS GENERATION HAS NO IDEA WHAT AMERICAN MEN AND WOMEN SACRIFICED IN SWEAT AND BLOOD TO MAKE THEM FREE!!!!!!.ReplyPeter PirozziOctober 8, 2020 at 7:54 pmPermalinkWell saidReply BERNIE SANDERS IS IN CONTROL OF THE SOCIALIST DEMOCRATIC PARTY. BIDEN HAD TO ACCEPT HIS SOCIALIST MOVEMENT TO WIN THE DEMOCRATIC NOMINATION.SOCIALISM= FEED THE AMERICAN PEOPLE SMALL DOSES OF SOCIALISM UNTIL THEY FINALLY AWAKE AND FIND THEY ARE UNDER COMMUNIST LAW AND ORDER.HOW WILL SOCIALISM AND COMMUNISM TAKE OVER AMERICA.(1) RELIGION: REMOVING THE BELIEF IN “GOD”. REMOVE GOD FROM THE GOVERNMENT AND SCHOOLS. THE AMERICAN PEOPLE NEED TO BELIEVE IN ONLY THE GOVERNMENT. GOVERNMENT KNOWS WHAT’S BEST FOR THE PEOPLE.(2) EDUCATION= TAKE CONTROL OF WHAT PEOPLE READ, SEE ON T.V.,RADIO, CELL PHONES AND ESPECIALLY WHAT CHILDREN ARE TAUGHT IN SCHOOL AND THE UNIVERSITY SYSTEMS.(3) DEBT= INCREASE THE NATIONAL DEBT TO UNSUSTAINABLE LEVELS, THAT WAY YOU WILL BE ABLE TO INCREASE TAXES AND THIS WILL PROVIDE MORE POVERTY.(4) POVERTY= INCREASE THE POVERTY LEVEL AS HIGH AS POSSIBLE. POOR PEOPLE ARE EASIER TO CONTROL AND WILL NOT FIGHT BACK IF YOU ARE PROVIDING EVERYTHING FOR THEM.(5) WELFARE= TAKE CONTROL OF EVERY ASPECT( FOOD, HOUSING, AND INCOME) THIS WILL MAKE THEM FULLY DEPENDENT ON THE GOVERNMENT.(6) HEALTH CARE.= CONTROL HEALTHCARE AND YOU CAN CONTROL THE PEOPLE..(7) CLASS WARFARE: DIVIDE THE PEOPLE INTO WEALTHY VS THE POOR. ELIMINATE THE MIDDLE CLASS. THIS WILL CAUSE MORE DISCONTENT AND IT WILL BE EASIER TO TAX THE RICH WITH THE SUPPORT IF THE POOR..(8) GUN CONTROL:: REMOVE THE ABILITY FOR THE AMERICAN PEOPLE TO DEFEND THEMSELVES FROM THE GOVERNMENT. . THIS WAY YOU WILL BE ABLE TO CREATE A POLICE STATE. NO POLICE DEPARTMENT BUT A FEDERAL ARMY RULED BY COMMUNIST . .IN 1959 RUSSIAN PRESIDENT NIKITA KHRUSHCHEV BANGED HIS SHOE ON THE PODIUM AT THE UNITED NATIONS AND DECLARED THAT OUR CHILDREN WILL LIVE UNDER COMMUNISM–AMERICANS ARE SO GULLIBLE. . IF AMERICA VOTERS WANT SOCIALISM THIS NOVEMBER, THEN ALL THE MEN AND WOMEN WOULD HAVE DIED IN VAIN. WAKE UP AMERICA. THIS GENERATION HAS NO IDEA WHAT AMERICAN MEN AND WOMEN SACRIFICED IN SWEAT AND BLOOD TO MAKE THEM FREE!!!!!!. Peter PirozziOctober 8, 2020 at 7:54 pmPermalinkWell saidReply Well said BERNIE SANDERS IS IN CONTROL OF THE SOCIALIST DEMOCRATIC PARTY. BIDEN HAD TO ACCEPT HIS SOCIALIST MOVEMENT TO WIN THE DEMOCRATIC NOMINATION.SOCIALISM= FEED THE AMERICAN PEOPLE SMALL DOSES OF SOCIALISM UNTIL THEY FINALLY AWAKE AND FIND THEY ARE UNDER COMMUNIST LAW AND ORDER.HOW WILL SOCIALISM AND COMMUNISM TAKE OVER AMERICA.(1) RELIGION: REMOVING THE BELIEF IN “GOD”. REMOVE GOD FROM THE GOVERNMENT AND SCHOOLS. THE AMERICAN PEOPLE NEED TO BELIEVE IN ONLY THE GOVERNMENT. GOVERNMENT KNOWS WHAT’S BEST FOR THE PEOPLE.(2) EDUCATION= TAKE CONTROL OF WHAT PEOPLE READ, SEE ON T.V.,RADIO, CELL PHONES AND ESPECIALLY WHAT CHILDREN ARE TAUGHT IN SCHOOL AND THE UNIVERSITY SYSTEMS.(3) DEBT= INCREASE THE NATIONAL DEBT TO UNSUSTAINABLE LEVELS, THAT WAY YOU WILL BE ABLE TO INCREASE TAXES AND THIS WILL PROVIDE MORE POVERTY.(4) POVERTY= INCREASE THE POVERTY LEVEL AS HIGH AS POSSIBLE. POOR PEOPLE ARE EASIER TO CONTROL AND WILL NOT FIGHT BACK IF YOU ARE PROVIDING EVERYTHING FOR THEM.(5) WELFARE= TAKE CONTROL OF EVERY ASPECT( FOOD, HOUSING, AND INCOME) THIS WILL MAKE THEM FULLY DEPENDENT ON THE GOVERNMENT.(6) HEALTH CARE.= CONTROL HEALTHCARE AND YOU CAN CONTROL THE PEOPLE..(7) CLASS WARFARE: DIVIDE THE PEOPLE INTO WEALTHY VS THE POOR. ELIMINATE THE MIDDLE CLASS. THIS WILL CAUSE MORE DISCONTENT AND IT WILL BE EASIER TO TAX THE RICH WITH THE SUPPORT IF THE POOR..(8) GUN CONTROL:: REMOVE THE ABILITY FOR THE AMERICAN PEOPLE TO DEFEND THEMSELVES FROM THE GOVERNMENT. . THIS WAY YOU WILL BE ABLE TO CREATE A POLICE STATE. NO POLICE DEPARTMENT BUT A FEDERAL ARMY RULED BY COMMUNIST . .IN 1959 RUSSIAN PRESIDENT NIKITA KHRUSHCHEV BANGED HIS SHOE ON THE PODIUM AT THE UNITED NATIONS AND DECLARED THAT OUR CHILDREN WILL LIVE UNDER COMMUNISM–AMERICANS ARE SO GULLIBLE. . IF AMERICA VOTERS WANT SOCIALISM THIS NOVEMBER, THEN ALL THE MEN AND WOMEN WOULD HAVE DIED IN VAIN. WAKE UP AMERICA. THIS GENERATION HAS NO IDEA WHAT AMERICAN MEN AND WOMEN SACRIFICED IN SWEAT AND BLOOD TO MAKE THEM FREE!!!!!!. Peter PirozziOctober 8, 2020 at 7:54 pmPermalinkWell saidReply Well said Well said **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment Name* Email* Website Save my name, email, and website in this browser for the next time I comment. **Recent Posts** George Pataki’s Bipartisan Leadership Needed Now More Than Ever: Van Hipp President Biden Failed To Leave No American Or Comrade Behind Pentagon Announces Identities of Deceased Service Members Biden’s Bragging About Killing Osama bin Laden Cost American Military Lives During Covert Operation Fox News: More Than 10 Service Members Killed In Afghan Debacle **Recent Comments** Donald Trump on Iran: After Iraq missile strikes, let’s give diplomacy a chance by James Robbins – Maga News 2020onDonald Trump on Iran: After Iraq missile strikes, let’s give diplomacy a chance by James Robbins Peter PirozzionWarning from Catholic Archbishop: President Trump Is Preparing to Fight Against the Demonic Deep State and New World Order MR PonWarning from Catholic Archbishop: President Trump Is Preparing to Fight Against the Demonic Deep State and New World Order RConList of Soros Politicians ‘Bought and Paid For’ Includes Republicans Rep. Illhan Omar Encourages the Downfall of the United States – Patriot PowerlineonRep. Illhan Omar Encourages the Downfall of the United States **Archives** September 2021 August 2021 July 2021 February 2021 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 July 2013 **Categories** campaign rally. protests. Commentary Commentary 2 Donald Trump Elections/Local Elections/National Featured Geopolitics Guest Commentary Hillary Clinton Joe Biden Law Enforcement/Crime Military/Defense Nathan Phillips Natural and Man Made Disasters Politics State and National Terrorism/National Security U.S. News Uncategorized **Meta** Log in Entries feed Comments feed WordPress.org"}