{"id": 1997, "name": "Imprimis", "domain": "imprimis.hillsdale.edu", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://imprimis.hillsdale.edu/religious-liberty-and-the-genius-of-the-american-founding/", "title": "Religious Liberty And The Genius Of The American Founding", "content": "Home TopicsCultureGovernmentEconomicsEducationHistoryForeign PolicyConservatismLawReligionNational Defense Culture Government Economics Education History Foreign Policy Conservatism Law Religion National Defense Culture Government Economics Education History Foreign Policy Conservatism Law Religion National Defense Subscribe Support Imprimis Select Page December 2024 | Volume 53, Issue 12 **Religious Liberty and the Genius of the American Founding** **Glenn Ellmers** Author,The Soul of Politics: Harry V. Jaffa and the Fight for America The following is adapted from a talk delivered at Hillsdale College on September 29, 2024, during a conference on “Christianity in America.” One of the most beautiful things written during the American Founding period is George Washington’s 1790 Letter to the Hebrew Congregation in Newport, Rhode Island. Washington had visited Newport in August of that year, and shortly after his visit, one of the leaders of the Jewish community sent Washington a letter thanking him and congratulating him on his conduct as president. Washington responded, in part: The Citizens of the United States of America have a right to applaud themselves for having given to mankind examples of an enlarged and liberal policy: a policy worthy of imitation. All possess alike liberty of conscience and immunities of citizenship. It is now no more that toleration is spoken of, as if it was by the indulgence of one class of people, that another enjoyed the exercise of their inherent natural rights. For happily the Government of the United States, which gives to bigotry no sanction, to persecution no assistance, requires only that they who live under its protection, should demean themselves as good citizens, in giving it on all occasions their effectual support. . . . May the Children of the Stock of Abraham, who dwell in this land, continue to merit and enjoy the good will of the other Inhabitants; while every one shall sit in safety under his own vine and fig tree, and there shall be none to make him afraid. May the father of all mercies scatter light and not darkness in our paths, and make us all in our several vocations useful here, and in his own due time and way everlastingly happy. Washington here magnificently summarizes the principle of religious liberty, a principle at the heart of the American Founding and one of the greatest accomplishments in human history. Today, this principle has been under assault—think of the vicious antisemitism we have seen on many college campuses recently or the persecution of Christians by our federal government. The faith of American Christians and Jews has been mocked and increasingly threatened by an aggressively secular, even atheistic, ruling class. We are in danger of losing the precious gift of religious liberty, which took almost 2,000 years for the Christian West to put into practice. *** To understand why it took so long for the principle of religious liberty to be implemented in practice, let’s turn to the ancient, pre-Christian world. Prior to Christianity, all religions were emphatically political. We can see an example of this in the following from the Book of Exodus: I am the Lord thy God, which have brought thee out of the land of Egypt, out of the house of bondage. Thou shalt have no other gods before me. Thou shalt not make unto thee any graven image, or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth. Thou shalt not bow down thyself to them, nor serve them: for I the Lord thy God am a jealous God. We read in the Old Testament of God’s special covenant with the Jews, who are repeatedly described as a “chosen people.” In fact, in the ancient world, all tribes or nations considered themselves chosen—and protected—by their gods. Whether it was Apollo and the other Olympian gods in Greece, Marduk and Nabu for the Babylonians, Rah and Isis and Osiris in Egypt, or Jehovah among the Jews—the gods of the ancient world were always the gods of a particular people. That is what it means to say religion in the ancient world was political. In this respect, the Hebrews were like other ancient peoples. However, they were unique in one very important way: they were monotheistic, while other ancient nations typically had pantheons of gods. The Hebrew God was singular, mysterious, and omnipotent, and He was the God of the whole world. In this sense, Judaism prepared the way for Christianity, the first universal religion. But the ancient Israelites did not proselytize or seek converts. No pre-Christian people, including the Jews, wanted to share its gods. All ancient nations were closed societies in which civil and religious obedience were identical. All law was divine law. There was no such thing as religious toleration or religious pluralism. Priests were public officials, and there was no distinction between church and state. To defeat another nation in war meant defeating its gods. Even this militant aspect of ancient life appears in the Old Testament. Consider the following from Deuteronomy: When the Lord thy God shall bring thee into the land whither thou goest to possess it, and hath cast out many nations before thee, the Hittites, and the Girgashites, and the Amorites, and the Canaanites, and the Perizzites, and the Hivites, and the Jebusites, seven nations greater and mightier than thou; And when the Lord thy God shall deliver them before thee; thou shalt smite them, and utterly destroy them; thou shalt make no covenant with them, nor show mercy unto them. And this, also from Deuteronomy: “Ye shall overthrow their altars, and break their pillars, and burn their groves with fire; and ye shall hew down the graven images of their gods, and destroy the names of them out of that place.” This kind of rhetoric was perfectly normal in the ancient world. Every people saw its enemies as unclean heretics who had to be destroyed because they worshipped false gods. Perhaps the most famous example of the laws being absolutely sacred and binding is the story of Moses descending from Mount Sinai, carrying God’s commandments to his people. Every ancient people had divine commandments of this kind. This also meant that political authority—for Moses and every other ancient leader—came directly from God. Therefore there was no distinction between religious and civic obligations. Every ancient city understood itself to be aholycity. *** With this in mind, let’s consider the twelfth century confrontation between King Henry II and St. Thomas Becket. Becket was the Archbishop of Canterbury—the highest ranking religious figure in England—and he and the King were close friends and confidants. But their friendship was strained when Becket refused to submit to the King’s authority over the church, a dispute that at its heart concerned the question of whether the church could be independent of the King. When Henry II rejected any distinction between political and religious authority, he was relying on the old tradition. He thought that piety and citizenship go together because his authority came directly from God—that it was impossible to separate the obligations of piety from the obligations of citizenship. Good citizens obey the law, which was seen to be issued ultimately by God. The solution to this dilemma was an agreement that the king and the church would have their own separate spheres of authority. The king would oversee worldly or political matters, while the church would have sovereignty in the spiritual or ecclesiastical realm. Each would recognize the independence of the other, and this would lead to harmony and peace. This solution marked the beginnings of religious liberty, but only the beginnings. About 100 years later, St. Thomas Aquinas started to develop the philosophical distinctions between the ecclesiastical and political realms. But his efforts were very preliminary, strictly theoretical, and would not have any practical effect until the American Founding. What Becket and Aquinas had in common was that they were wrestling with problems that did not exist in the ancient world. They were confronting problems created by Christianity. I am not suggesting that the Christian faith is a problem. Rather, I am arguing that it is problematic from the point of view of how political obligation had previously been understood. The problems were in fact caused by not one but two monumental events: the spread of the Christian monotheism of the New Testament and the rise of the Roman Empire. When Julius Caesar brought an end to the Roman Republic, the Roman Empire that took its place became “the universal city.” Many tribes and nations that had previously been independent were incorporated into a single empire. Then, when Emperor Theodosius made Christianity the official religion of the Roman Empire in 380, the ancient unity between citizenship and piety was restored: one regime, one God, one law. However, after Rome was sacked by the Visigoths in 410 and the Western Roman Empire collapsed in 476,threedilemmas emerged. First, there was one God, but many regimes. For the first time in the history of Western Civilization, religious and civil authority were separated. To put it another way, divine and civil law were no longer the same. All of Europe belonged to one church, but it was split into many principalities. Citizens confronted the challenge of dual allegiances for the first time: they were required to obey both their king and their pope. But what if the king and the pope disagreed? This was something new. Second, following the split between divine and civil law, what was the source of political authority? In the ancient city, laws came directly from God. But where did, for instance, the Prince of Bavaria get his authority? The solution the Europeans came up with is the theory of the divine right of kings, which was an attempt to reconnect civil and divine authority as in the ancient world. In practice, however, the divine right of kings means hereditary monarchy. If the king’s ancestors received their authority directly from God—as the idea of divine right holds—then only the king’s direct descendants can exercise that authority. This causes enormous succession problems. What if the king has no legitimate heirs? What if the only heir is utterly unqualified to rule? What if a nephew or a cousin has a partial claim on the throne and is far more qualified? In fact, we know what happens because itdidhappen, over and over again, as anyone familiar with the history of England and Shakespeare’s history plays can tell you. Civil wars happened. The third dilemma was that thecontentof belief, or doctrine, became incredibly important in a way it was not in the ancient world. There was little investigation into matters of conscience prior to Christianity. It was theoutwardexpression of piety—demonstrating loyalty to the community and its gods by obeying the divine law and participating in the public ceremonies and rituals—that mattered in the ancient world. It is only with Christianity that belief becomes paramount. And this opened the door to persecution. Even before the Reformation, which ushered in centuries of conflict between Catholics and Protestants, the problem of doctrine manifested itself in terms of heresy. The church spent centuries hammering out the precise content of the catechism. Gnosticism, Arianism, Pelagianism, and many other heresies were investigated, declared to be errors, and stamped out. These three dilemmas emerged because Christianity was the first non-political religion in the West. Being a Christian was not a question of what political community you belonged to, it was a matter of faith or belief. While that was incredibly liberating—because it meant salvation was open to every human being—it created unprecedented challenges for politics and citizenship. *** In order to establish republican self-government, the American Founders had to solve these complicated problems. That meant figuring out how to create moral and political legitimacy for the new nation. It also meant establishing the sacredness of the law—which alone can command the citizens’ devotion and obedience—while avoiding the religious conflict and persecution that had plagued Europe. The solution they came up with is famously stated in the Declaration of Independence: “the Laws of Nature and of Nature’s God.” This revolutionary truth, combining human reason and divine revelation, provided the basis for establishing religious liberty for the first time in human history. By looking to the laws of nature (or laws of reason) and nature’s God as the ultimate justification for their revolution, the Founders were asserting that there was an objective moral order in the world because that world was created by a benevolent and reasonable God. Since our minds are a gift from God, and He intended us to use them, we can perceive much of this moral order through our own rational faculties. We can’t know through reason alone those things that only come directly from revelation, including five of the Ten Commandments. Aristotle, who lived hundreds of years before Christ, could not know about keeping the Sabbath holy. But he could know that one should honor one’s parents and that theft and murder are wrong. That is why Aristotle’s teaching in hisNicomachean Ethicsis almost perfectly compatible with the morality proclaimed in the Bible. This natural moral order exists outside of our will—it exists whether we like it or not. We are born into both a physical and a moral world that we do not create. Today’s Leftists think they can alter human nature—for example, by allowing children to choose “gender reassignment surgery”—but this will never work and will never lead to true happiness because we cannot change our nature. By contrast, the laws of nature and nature’s God are fixed and unchanging. They serve as the ground for political authority and supply conventional or everyday law with sacred and transcendent authority. In establishing this foundation for American politics, the Founders addressed the three problems mentioned above. First, they solved the split between piety and citizenship by supplying a common ground for morality. Since we can understand virtue and vice through our own rational faculties, the law can enforce moral precepts that are acknowledged by both political and ecclesiastical authorities. In other words, because the morality of the Bible and the morality of reason are compatible, one can be both a pious believeranda good citizen, while avoiding the contentious sectarian disputes that tore Europe apart. Second, this common ground of morality makes it possible to delineate in a clear way the political and religious realms. That the separation of church and state becomes possible for the first time can be seen most clearly in Jefferson’s Virginia Bill for Religious Freedom. The Declaration’s teaching about the laws of nature and nature’s God establishes a kind of political theology, a non-sectarian ground of legitimacy that makes the laws “sacred” without getting the government involved in theological disputes about the Trinity, faith versus works, etc. According to many Protestant ministers of the Founding era, this also allowed true Christianity to flourish for the first time because Christianity could be practiced by choice rather than by coercion. Third, the Founders solved the problem of religious persecution. Because the government and the churches can agree on a moral code that is compatible with both reason and revelation, each can operate in its proper realm without intruding on the other. It becomes possible to institutionalize religious liberty by prohibiting religious tests for office and keeping government out of the business of punishing heresy. The American Founders’ invocation of the transcendent moral authority ofnatureis one of the most remarkable acts of statesmanship in human history. The question which we and all American patriots confront today is whether we still understand and appreciate this incredible gift of religious liberty bequeathed to us by the Founders. Do we still have the knowledge and courage to keep alive the sacred fire of liberty? **Glenn Ellmers** Glenn Ellmersis the Salvatori Research Fellow in the American Founding at the Claremont Institute. He received a B.A. from Boston University and an M.A. and Ph.D. from the Claremont Graduate University. He has served as a visiting research fellow at Hillsdale College and as a speechwriter for two cabinet secretaries. He has written for numerous publications, including theClaremont Review of Books,The New Criterion,Perspectives on Political Science, Law & Liberty, andThe American Mind. He is the author ofThe Soul of Politics: Harry V. Jaffa and the Fight for AmericaandThe Narrow Passage: Plato, Foucault, and the Possibility of Political Philosophy, and he is co-editor, with Michael Anton, ofLeisure with Dignity: Essays in Celebration of Charles R. Kesler. Imprimisis the free monthly speech digest of Hillsdale College and is dedicated to educating citizens and promoting civil and religious liberty by covering cultural, economic, political, and educational issues. The content ofImprimisis drawn from speeches delivered at Hillsdale College events. First published in 1972,Imprimisis one of the most widely circulated opinion publications in the nation with over six million subscribers. The opinions expressed inImprimisare not necessarily the views of Hillsdale College. Privacy Policy"}