{"id": 597, "name": "Gladstone Dispatch", "domain": "gladstonedispatch.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.gladstonedispatch.com/march-2024-nkc-high-school-shooting-results-in-11-year-sentence/", "title": "March 2024 Nkc High School Shooting Results In 11 Year Sentence", "content": "My Account Contact Us Contact Us HomeSpecial Sections Special Sections Special Sections News Outdoors Entertainment Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJob Board Submit a Classified Job Board Submit a Classified Job Board LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues **March 2024 NKC High School shooting results in 11-year sentence** June 6, 2025 News By Kellie HouxKHoux@cherryroad.com By Kellie HouxKHoux@cherryroad.com By Kellie HouxKHoux@cherryroad.com CLAY COUNTY — Michael Smallwood, 20, Kansas City, will serve 11 years in the Missouri Department of Corrections for his role in the March 2, 2024 shooting outside North Kansas City High School. Smallwood received his sentence June 6. His sentencing included six years for assault in the second degree, seven years for assault in the second degree, four years for unlawful use of a weapon and one year for assault in the fourth degree. The second and third counts will run consecutive to each other for the total of 11 years. Initially the Clay County Prosecutor’s Office was seeking 19 years. The judge in the case said he has been thinking about the case for some time, during the final sentencing. Smallwood pleaded guilty in mid-March. In this petition, Smallwood wrote that “I was fired at and I shot back understanding that it was reckless for me to do that in a crowd of people. I had a gun on me in a school.” During the final presentation of witnesses before the sentencing, Smallwood’s attorney Linda Mock said that Smallwood was acting in self defense and was not the initial aggressor. “The man has pled guilty,” the judge said. “He has accepted responsibility.” The charges follow a dispute between two groups of young men after a Missouri Class 6, District 8 basketball game between Staley and North Kansas City high schools. Surveillance footage from the school showed children and adults fleeing the scene and seeking shelter. The videos were again shown in the courtroom. North Kansas City Police Detective Scott Baker, the lead investigator, prior to final sentencing, said he was told that the action was a “beef over a girl.” “The fact that he pled guilty to carrying a loaded firearm into a school,” the judge said. “It happens far too often. People in the metropolitan area have the right to expect that they will be safe during a school day or sporting event.” The judge continued that the particular arena at the high school is not big and that two groups of young men at odds with each other would see each other. There was an opportunity to either avoid conflict or not.” Assistant Prosecuting Attorney Angela Ravkin as well as the judge remarked that the shooting could have been a mass casualty event. Two people were wounded during the gunfire exchange. “I hope that Mr. Smallwood will have time to reflect on how many lives could have been lost and that this isn’t a murder case,” Ravkin said. The judge said that the two groups mutually exchanged gunfire which resulted in 54 shots being exchanged. “This is at a high school after a basketball game, not Iraq, Gaza or Afghanistan,” the judge said. “It’s unacceptable. This was not self defense. It’s just shocking especially at that location. None of this had to happen. You could have waited to leave later than the first group. They were looking for the fight. There was no restraint and a complete disregard.” Prior to the sentencing, North Kansas City Police Detective Scott Baker said the shell casings came from 9mm, 10mm, 40-caliber and 45-caliber handguns. Kyle Hollins, founder of the Lyrik Institution, a group with a mission to reduce crime and violence by targeting destructive thinking errors and reworking them into productive behaviors, spoke as a character witness for Smallwood. Hollins said he worked with Smallwood in 2023. “We requested a sentence of 19 years in prison, because we wanted justice for the victims and to send an unmistakable message that violent crime committed in Clay County will be punished severely,” said Clay County Prosecutor Zachary Thompson. “… now he can spend the next eleven years in prison thinking about those decisions. … We won’t tolerate violence where families and students should feel safe …” Smallwood’s younger brother, Lavon’dre Smallwood, who was part of the shooting, is currently in the Clay County Detention Center, charged with five felonies: assault in the first degree, armed criminal action, aiding or abetting a person discharging or shooting a firearm at or from a motor vehicle; armed criminal action; and unlawful use of a weapon including carrying the weapon into a school or bus. Currently, he is set for trail on Dec. 1 of this year. Atkins-Johnson Farm & Museum activities comingJune 11, 2025 Gladstone man marks century of lifeJune 9, 2025 March 2024 NKC High School shooting results in 11-year sentenceJune 6, 2025 Signs kids may have allergiesJune 5, 2025 Sunscreen recommended for infants older than 6 monthsJune 5, 2025 Ramp closures on tap for construction workJune 5, 2025 MDC Free Fishing Days this weekendJune 4, 2025 House explosion in Gladstone under investigationJune 2, 2025 House explodes in GladstoneMay 31, 2025 Missouri State Beekeepers Association help with swarmsMay 28, 2025 **Other News** June 9, 2025 June 5, 2025 June 2, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 Gladstone Dispatch, aCherryRoad MediaNewspaper. All rights reserved."}