{"id": 2005, "name": "Intercollegiate Studies Institute", "domain": "isi.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://isi.org/event/student-seminar-civilization-and-the-post-christian-right/", "title": "Student Seminar Civilization And The Post Christian Right", "content": "About Our Campus People Modern Age Leadership Careers Financials Contact StudentsHonors ProgramChaptersStudent Journalism Honors Program Chapters Student Journalism Honors Program Chapters Student Journalism FacultyAmerican Politics and Government SummitISI Forum GrantsStart an ISI Chapter American Politics and Government Summit ISI Forum Grants Start an ISI Chapter American Politics and Government Summit ISI Forum Grants Start an ISI Chapter AlumniAlumni Giving ClubWeaver Fellowship Alumni Giving Club Weaver Fellowship Alumni Giving Club Weaver Fellowship Events Discourse Donate About Our Campus People Modern Age Leadership Careers Financials Contact Students Faculty Alumni Events Discourse Donate **Student Seminar: Civilization and the Post-Christian Right** Jul 11-14, 2025 Cold Spring, NY **Overview** This seminar will give students a chance to delve into one of the most compelling, troubling elements of contemporary political philosophy: the rise of the neo-pagan, anti-Christian right. Our faculty will guide students through the history behind this reactionary movement, tracing the ideas of online figures such as so-called “Bronze Age Pervert” to their ideological father, Friedrich Nietzsche. Students will also explore a robust Christian response to these ideas and see how the post-Christian right fails to solve the civilizational challenges posed by the illiberal left. Our faculty for this seminar are Dr. Khalil Habib and Dr. Zachary Ailes. If you have a question about this event, please contact Jane Scharl at[email protected]. **Details** **Speakers** Khalil Habib is Associate Professor of Politics at Hillsdale College, where he teaches political philosophy and American political thought. Students Faculty Alumni Events Discourse Donate About People Careers Financials Contact 3901 Centerville Road, Wilmington, DE 19807•800-526-7022•[email protected]• ©2023 Intercollegiate Studies Institute. All Rights Reserved. ISI is a 501(c)(3) organization under the Internal Revenue Code Privacy Policy Terms of Use Site by Beck&Stone"}