{"id": 2218, "name": "Observer Online", "domain": "observeronline.news", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://observeronline.news/category/breaking-news/", "title": "Breaking News", "content": "OBSERVER ONLINE HOME BREAKING NEWS POLITICS WORLD WOW Home Privacy Policy Contact Us OBSERVER ONLINE The latest news and headlines! HOME BREAKING NEWS POLITICS WORLD WOW **Category:BREAKING NEWS** BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Suspect in Deadly Kansas SWATting Charged with Manslaughter** Tyler Barriss, the suspected serial SWATter who was arrested after a hoax phone call to police led to the death of Andrew Finch in Wichita, Kansas, has now been charged with manslaughter: The Los... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Thoughts On â\u0080\u009cS**thole Countriesâ\u0080\u009d and the Man Who Used The Phrase** Maybe I’m just getting desensitized to Trump’s schtick, but I’m having trouble getting alarmed by his “s**thole countries” remarks. First off, yesterday’s now-famous meeting was in the Oval Office and there were eight lawmakers... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **BREAKING: Sean Hannity Revealed WHO PAID For Trump Dossier And Itâ\u0080\u0099s NOT Who You Thought(VIDEO)!!!** Sean Hannity revealed who paid for Trump dossier and itâ\u0080\u0099s not who you thought. Conservative TV host Sean Hannity in his most recent show revealed his info that Trump dossier was actually a big... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Trump to Friends After â\u0080\u009cSh*tholeâ\u0080\u009d Comment: Wha? What Did I Say?** Because of course heâ\u0080\u0099s defending this. As our nationâ\u0080\u0099s diplomats are in panic mode, rushing about to try and smooth over the ruffled feathers of those nationâ\u0080\u0099s Trump insulted with his â\u0080\u009cSh*tholeâ\u0080\u009d comment, the... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Judge Napolitano UNCOVERED Hillary Like Never Before Comey Caught Red-Handed(VIDEO)!!!** Judge Napolitano uncovered Hillary like never before Comey caught red handed. Judge Napolitano bashes Hillary Clintonâ\u0080\u0099s aide Huma Abedin for her blatant lies about the emails found on Anthony Weinerâ\u0080\u0099s laptop BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **The White House Is Not Hot on the Gang of Six Dreamers Plan Because It Sucks** The biggest political crisis facing the Congress in the next 90 days is how to resolve the Dreamer issue. Dreamers are those illegals allegedly brought to the United States before they were 16 years... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Sean Hannity ‘Either Jim Comey Or Andrew McCabe Who Paid For The Phony Dossier'(VIDEO)!!!** Sean Hannity: Iâ\u0080\u0099m hearing it was either Jim Comey or Andrew McCabe who paid for the phony dossier. Sean Hannity told his audience he heard either former FBI Director James Comey or FBI Deputy... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **GOP Senate Candidate Tells Party to â\u0080\u009cGrow A Pair Of Ovaries.â\u0080\u009d (Video)** U.S. House Rep. Martha McSally (R – Az.) made her long-expected official announcement that she is running for the state’s open U.S. Senate seat being vacated by Jeff Flake this year. In her campaign... BREAKING NEWS/POLITICS January 13, 2018 byobserveronline· PublishedJanuary 13, 2018 **Mike Pence to Dems: Sorry, But I Wonâ\u0080\u0099t Be Testifying on Russian Collusion** Democratic leadership very much wants Vice President Mike Pence â\u0080\u0094 who you may remember was publicly lied to by Michael Flynn regarding the former Trump adviser’s contacts with Russia during the Trump team’s transition... BREAKING NEWS/POLITICS January 12, 2018 byobserveronline· PublishedJanuary 12, 2018 **A New Report Says Public Schools are Still Very Segregatedâ\u0080¦Hereâ\u0080\u0099s How to Fix That** A report from the U.S. Commission on Civil Rights released Thursday reveals that segregation in public schooling is still disturbingly prevalent, with black and latino students often schooling in subpar conditions. The commission said... Next Page » More **** Suspect in Deadly Kansas SWATting Charged with Manslaughter13 Jan, 2018 Suspect in Deadly Kansas SWATting Charged with Manslaughter 13 Jan, 2018 Suspect in Deadly Kansas SWATting Charged with Manslaughter 13 Jan, 2018 Missouri Man Faces Terrorism Charges for Attempted Train Hijacking6 Jan, 2018 Missouri Man Faces Terrorism Charges for Attempted Train Hijacking 6 Jan, 2018 Missouri Man Faces Terrorism Charges for Attempted Train Hijacking 6 Jan, 2018 Michael Wolff to Trump: Thanks for Helping Me Sell Books6 Jan, 2018 Michael Wolff to Trump: Thanks for Helping Me Sell Books 6 Jan, 2018 Michael Wolff to Trump: Thanks for Helping Me Sell Books 6 Jan, 2018 â\u0080\u009cFire and Furyâ\u0080\u009d Author Is Standing by His Claims of White House Staffersâ\u0080\u0099 Concerns6 Jan, 2018 â\u0080\u009cFire and Furyâ\u0080\u009d Author Is Standing by His Claims of White House Staffersâ\u0080\u0099 Concerns 6 Jan, 2018 â\u0080\u009cFire and Furyâ\u0080\u009d Author Is Standing by His Claims of White House Staffersâ\u0080\u0099 Concerns 6 Jan, 2018 Water Cooler 1/06/17 Open Thread; Things to be Thankful for: Pets6 Jan, 2018 Water Cooler 1/06/17 Open Thread; Things to be Thankful for: Pets 6 Jan, 2018 Water Cooler 1/06/17 Open Thread; Things to be Thankful for: Pets 6 Jan, 2018 OBSERVER ONLINE © 2018. All Rights Reserved."}