{"id": 1646, "name": "YLE News", "domain": "yle.fi", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://yle.fi/aihe/yleisradio/ylen-yhteystiedot", "title": "Ylen Yhteystiedot", "content": "Hae Ylen sisältöjä Lähetä uutiskuva tai -video Pinnalla nyt Venäjän hyökkäys Sanapyramidi Sanoita linnunlaulu Etusivu Uutisia lyhyesti Tuoreimmat Urheilu Sää Paikallisuutiset Kotimaa Ulkomaat Politiikka Talous Kulttuuri Tiede Luonto Oppiminen Abitreenit Kolumnit Uutiset viittomakielellä Selkouutiset Uutisluokka Elävä arkisto Teksti-TV Uutiskirjeet TV-opas Radio-opas RSS-syötteet Svenska Sápmi News Новости Новини Uudizet karjalakse Lähetä uutiskuva tai -video Asiakaspalvelu Ylen yhteystiedot Uutisten yhteystiedot Evästeasetukset **Ylen perus- ja yhteystiedot** Organisaatio Strategia Talous Vuosikertomukset ja tilinpäätös Avoimet työpaikat Kesätoimittajaksi Harjoittelu Julkinen palvelu Vastuullisuus Saavutettavuus Toimintaperiaatteet Usein kysyttyä Yhteystiedot Anna palautetta Medialle Yhteistyö Ylen kanssa Tuotantoyhtiöille Bolaget på svenska About Yle in English **Sisältöä aiheesta Ylen perus- ja yhteystiedot** **Ota yhteyttä** Ylen asiakaspalveluIYles kundserviceSoita Ylen vaihteeseen puh. 09 14801 (tietosuojaseloste)Lähetä sähköpostiaetunimi.sukunimi@yle.fi **Osoitteet** **Yle-keskus Pasila, Helsinki** Yle Mediatalo, Uutiskatu 5 00024 Helsinki postiosoite:00024 Yleisradio **Mediatalo** Uutiskatu 5A, 24h (kartta) **Luova talo** Radiokuja 1A, klo 8–16 (kartta) **Studiotalo** Uutiskatu 8A (kartta) **Mediapolis, Tampere** Ransunraitti 1, 33270 Tampere (kartta) **Ota yhteyttä uutistoimituksiimme** Suomenkieliset toimitukset Uutiset, tiedotteet ja kutsut sposti:yle.uutiset@yle.fi Uutiset, tiedotteet ja kutsut sposti:yle.uutiset@yle.fi Uutiset, tiedotteet ja kutsut sposti:yle.uutiset@yle.fi Ruotsinkieliset toimitukset Yle Sápmi Yle News Novosti Yle Yle Urheilu, sposti:yle.urheilu@yle.fi **Organisaatiomme** Ylen organisaatio Ylen organisaatio Ylen organisaatio Ylen yksiköt Ylen yksiköt Ylen yksiköt Ylen vastaavat toimittajat Ylen vastaavat toimittajat Ylen vastaavat toimittajat **Toivo ohjelmaa tai anna palautetta** lomakkeella lomakkeella lomakkeella postitse Ylen Asiakaspalvelu, PL 17, 00024 Yleisradio postitse Ylen Asiakaspalvelu, PL 17, 00024 Yleisradio postitse Ylen Asiakaspalvelu, PL 17, 00024 Yleisradio Svenska Ylellesvenska@yle.fi Svenska Ylellesvenska@yle.fi Svenska Ylellesvenska@yle.fi **Asiakaspalvelu teknisissä häiriötilanteissa** lomakkeella lomakkeella lomakkeella Asiakaspalvelu teknisissä häiriötilanteissapuh. 09 1480 5500 arkisin klo 12–14 Asiakaspalvelu teknisissä häiriötilanteissapuh. 09 1480 5500 arkisin klo 12–14 Asiakaspalvelu teknisissä häiriötilanteissapuh. 09 1480 5500 arkisin klo 12–14 tekninen.neuvonta@yle.fi tekninen.neuvonta@yle.fi tekninen.neuvonta@yle.fi Yle Areenan toimivuus:areena.info@yle.fi Yle Areenan toimivuus:areena.info@yle.fi Yle Areenan toimivuus:areena.info@yle.fi Areena-ohjeet ja tiedossa olevat ongelmat Areena-ohjeet ja tiedossa olevat ongelmat Areena-ohjeet ja tiedossa olevat ongelmat **Asiakaspalvelumme viittomakielisille** Ylen Asiakaspalvelulla ja Teknisellä neuvonnalla on käytössä Chabla-palvelu viittomakielisille asiakkaille. Lataa maksutoniOS-sovellustaiAndroid-sovellus. **Visiitille Yleen tai yleisöksi ohjelmiin** tapahtumakalenteri tapahtumakalenteri tapahtumakalenteri **Radion sinfoniaorkesteri** liput ja konsertit liput ja konsertit liput ja konsertit yhteystiedot yhteystiedot yhteystiedot **Medialle** Ylen viestinnän yhteystiedot Ylen viestinnän yhteystiedot Ylen viestinnän yhteystiedot Kuvapalvelu ja Ylen muu kuvamateriaali Kuvapalvelu ja Ylen muu kuvamateriaali Kuvapalvelu ja Ylen muu kuvamateriaali Yle Pressi – Tietoa ja kuvia Ylen sisällöistä Yle Pressi – Tietoa ja kuvia Ylen sisällöistä Yle Pressi – Tietoa ja kuvia Ylen sisällöistä Ylen brändi, ilme ja logot Ylen brändi, ilme ja logot Ylen brändi, ilme ja logot **Yhteistyö** Kumppaneille Kumppaneille Kumppaneille Tuotantoyhtiöille Tuotantoyhtiöille Tuotantoyhtiöille Freelancereille Freelancereille Freelancereille Yle Myynti Yle Myynti Yle Myynti Arkistoaineisto ammattikäyttöön Arkistoaineisto ammattikäyttöön Arkistoaineisto ammattikäyttöön Arkistoaineisto yksityis- ja tutkimuskäyttöön Arkistoaineisto yksityis- ja tutkimuskäyttöön Arkistoaineisto yksityis- ja tutkimuskäyttöön Ylen avoin data Ylen avoin data Ylen avoin data Viranomaisten yhteydenotot(mm. DSA) Viranomaisten yhteydenotot(mm. DSA) Viranomaisten yhteydenotot(mm. DSA) Yleisradio Oy on sijoittautunut Suomeen. Keskeiset audiovisuaalisten sisältöpalvelujen tarjoamista ja radio- ja televisiotoiminnan harjoittamista valvovat viranomaiset Suomessa ovat Liikenne- ja viestintävirasto Traficom (www.traficom.fi), Kilpailu- ja kuluttajavirasto (www.kkv.fi) ja Kansallinen audiovisuaalinen instituutti (https://kavi.fi). Yleisradion osakkeista 99,98 prosenttia omistaa Suomen valtio. Tutustuyle.fiIareena.yle.fi **Muualla Yle.fi:ssä** Abitreenit Areena Arkistoidut sivut Arkistomyynti Elävä arkisto Kulttuuri Lapset Maakuntaradiot Myynti News in English Novosti po-russki Oppiminen Pikku Kakkonen Radio-ohjelmatiedot Teksti-tv TV-ohjelmatiedot Urheilu Uutiset Yle Fem Yle Klassinen Yle Mondo Yle Radio 1 Yle Radio Suomi Yle Sámi Radio Yle Teema Yle TV1 Yle TV2 Yle Vega Yle X3M YleX Yle yhtiönä Tietosuoja Saavutettavuus Palaute Avoimet työpaikat Vastaavat toimittajat Ylen perus- ja yhteystiedot"}