{"id": 601, "name": "Global Voices", "domain": "globalvoices.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://globalvoices.org/2025/06/09/what-is-happening-in-gaza-is-a-genocide-brazils-president-lula-da-silva-reinforces-criticism-of-israel-in-south-america/", "title": "What Is Happening In Gaza Is A Genocide Brazils President Lula Da Silva Reinforces Criticism Of Israel In South America", "content": "Support non-profit journalism and perspectives from around the world. English русский Español Română Malagasy 日本語 bahasa Indonesia عربي Esperanto Català Português українська srpski Ελληνικά Nederlands Français Italiano Igbo Қазақша Deutsch Yorùbá বাংলা Hrvatski 繁體中文 Filipino ਪੰਜਾਬੀ македонски Aymara नेपाली Shqip فارسی 简体中文 한국어 हिन्दी ᱥᱟᱱᱛᱟᱲᱤ Magyar polski اردو Dansk ଓଡ଼ିଆ Swahili čeština Türkçe Български Svenska Ўзбекча አማርኛ كوردی မြန်မာ עברית Tetun ភាសាខ្មែរ دری See all those languages? The Lingua project at Global Voices works to bring down barriers to understanding through translation. **** Africa Americas Asia Europe The Bridge Elections Culture Human Rights Digital Activism All topics » **‘What is happening in Gaza is a genocide’: Brazil’s President Lula da Silva reinforces criticism of Israel in South America** In 2023, after the Hamas attacks and the war, Brazilian citizens were repatriated from Gaza. Photo:Paulo Pinto/Agência Brasil, used with permission At a press conference on June 3, 2025, Brazil’s president,Luiz Inácio Lula da Silvawasasked by a journalistto comment on astatement by the Israeli Embassyin the country, which claimed the nationalist Palestinian groupHamaslies about the current situation in Gaza‘‘to feed antisemitism around the world.”The statement was released after Lula called what is happening in the regiona genocide. Answering the question,he reinforcedthisposition: Vem dizer que é antissemitismo? Precisa parar com esse vitimismo e saber o seguinte: o que está acontecendo na Faixa de Gaza é um genocídio. É a morte de mulheres e crianças que não estão participando de guerra. É a decisão de um governo que nem o povo judeu quer. Não dá para, como ser humano, não é nem como presidente do Brasil, mas como ser humano, aceitar isso como se fosse uma guerra normal. They come and say it is antisemitism? They need to stop playing the victim and know the following: what is happening in Gaza is a genocide. It’s the death of women and children who are not part of the war. It’s a government’s decision that not even the Jewish people want. I cannot, as a human being, not even as Brazil’s president, but as a human being, accept it as a normal war. Lula’s criticism over the war in Gaza, following Hamas’ attacks of October 7, 2023, is not new. Alongside Chile’s Gabriel Boric, he has been an outspoken critic of the actions taken byBenjamin Netanyahu’s government since the early days of the conflict, a position that is not unanimous among their neighbors in theSouthern Coneand that helps to brew narratives of political polarization in the region. For instance, Lula’s predecessor,Jair Bolsonaro, a close ally of Netanyahu when he was in office, wasinvited to visit Israelin 2024, a few days after Lula was declared‘‘persona non grata”for his criticism. Underinvestigation for attempting a coupd’état, however, Bolsonaro’spassport is currently being retainedby the authorities. Check out how the region’s countries are positioned on the war in Gaza: In 2010, during Lula's second term as president,Brazil recognizedthe Palestinian state with the borders establishedup to 1967. It became one of the first Latin American countries to do so. While criticizing what happens in Gaza now,saying‘‘It is not a war, but an army killing women and children,”he kept standing for a two-state solution. The government also approached the matter officially, on June 1, when itpublished a statementagainst the creation of 22 new settlements on the West Bank, announced by Israel a few days before: O Brasil repudia as recorrentes medidas unilaterais tomadas pelo governo israelense, que, ao imporem situação equivalente a anexação do território palestino ocupado, comprometem a implementação da solução de dois Estados. Reafirma, ainda, seu histórico compromisso com um Estado da Palestina independente e viável, convivendo em paz e segurança ao lado de Israel, nas fronteiras de 1967, incluindo a Cisjordânia e a Faixa de Gaza, com capital em Jerusalém Oriental. Brazil repudiates the recurring one-sided measures taken by the Israeli government, which, by imposing a situation equivalent to the annexation of the occupied Palestinian territories, compromises the implementation of a two-state solution. Brazil also reaffirms its historical commitment to an independent and viable Palestinian State, living in peace and safety alongside Israel, within the 1967 borders, including the West Bank and the Gaza Strip, having Eastern Jerusalem as its capital. The organization Conib (Brazil’s Israelite Confederation)statedthat the president was once again attacking Jewish people and risking their safety. PresidentGabriel Boric, like Lula, has been an outspoken critic of Israel’s war on Gaza. On June 1, during hisannual address, he also classified the Israeli government as‘‘genocidal” andsaidhe would send a bill to the Legislature toban any importsfrom Israeli-occupied territories: Considerando la permanente violación del derecho internacional por parte de Israel, mediante asentamientos ilegales en territorio palestino, y el reciente anuncio de expansión de esta política, he decidido que es de toda justicia patrocinar y poner urgencia al proyecto de ley que prohíbe la importación de productos producidos en territorios ilegalmente ocupados. Considering the ongoing violation of international law by Israel's government, regarding illegal settlements in the Palestinian territory, and their recent announcement about expanding this policy, I've decided that is fair to sponsor, and ask urgently, for a bill forbidding the import of products from illegally occupied territories. Boric also said hedemanded that his defence minister draw a planso they can stop depending on Israeli industry in other sectors. AsReutersreports, the Chilean president recently‘‘recalled military personnel from Chile’s embassy in the country and summoned the ambassador for questioning.” On May 15, 2025, hundreds of people marched in Montevideo, Uruguay’s capital, commemorating the anniversary of theNakba— adatethat marks the violent displacement of Palestinians from their land. Besides calling for an end to the war, protesters demanded that PresidentYamandú Orsi’s new government cease its relations with Israel, reportsnewspaper La Diaria. A few days later, on May 19, the Defense Minister, Sandra Lazo, met with the Israeli ambassador, Michal Hershkovitz. The meeting was made public by the Israeli representativeon social media, while Lazosaidshe decided not to take the protocol picture alongside Hershkovitz, knowing it could ‘‘hurt feelings.” Shealso claimedto have reinforced that Uruguay recognized the Palestinian State’s independence since 2011, and does not agree with this ‘‘completely asymmetrical conflict.” Orsi’s left-wing political coalition,Frente Amplio (FA, Broad Front), through its executive secretariat,issued a resolutionon June 3, calling for support for actions defending the human rights of the Palestinian people.Thedocument says: Estas acciones comprenderán la movilización articulada con organizaciones sociales, culturales y de derechos humanos (…) y todas aquellas que de forma pacífica y organizada contribuyan a respaldar a nuestro gobierno nacional en la toma de medidas que aboguen por el fin de la masacre, el ingreso de ayuda humanitaria sin restricciones, el respeto de los Derechos Humanos. These actions will encompass the articulated mobilization with social, cultural and human rights organizations (…) and all those that, in a pacific and organized way, contribute to support our national government in all their measures advocating for the end of the massacre, the entering of humanitarian aid without restriction, the respect for human rights. The stand also drew criticism from the opposition, such as the Colorado party, whichissuedtheir own statement saying FA’s stance could promote hate and the demonization of Israel and the Jewish people. The Blanco party, also in opposition,statedthat Israel had a right to self-defense, while calling for respect for humanitarian principles to prevent harming people not involved in the conflict. Orsi himselfsaid on June 5that the statement came from a political force, ‘‘and that the government is something else.” He also told journalists that the people in Gaza need more than announcements, and he plans to send them powder, milk and rice, among other products. Javier Milei, the ultra libertarian Argentine president, is the most vocalsupporterof Israel in the region. TheNY Times calledhim ‘‘a Catholic president who consults with a rabbi,” pointing out that his devotion to the Jewish faith influences his national politics. Last July, Milei’s cabinetissued an official statementdeclaring Hamas an ‘‘international terrorist organization”: El Presidente Javier Milei tiene el compromiso inquebrantable de reconocer a los terroristas por lo que son. Es la primera vez que existe voluntad política de hacerlo. President Javier Milei has the unbreakable commitment to acknowledge terrorists for what they are. This is the first time that there is a political willingness to do it so. The support for Israel recently granted Mileithe Genesis award, the ‘‘Jewish Nobel Prize,” whichis worth 1 million US dollars. As reported byAP news, the organizers of the award explained their decision as an appreciation of‘‘Milei for reversing Argentina’s long history of anti-Israel votes at the United Nations, designating the Hamas and Hezbollah militant groups as terrorist organizations and reopening investigations into the bombings of Jewish and Israeli targets in Argentina in the 1990s.” Last year, in an interview withBen Shapiroon his YouTube channel, Milei said: Es muy importante entender el vínculo de la libertad con Israel. Es fundamental porque es un pueblo que además ha logrado la conjunción entre lo espiritual y lo material. Y esa armonía espiritual y material genera progreso. It’s important to understand the freedom bond with Israel. It’s fundamental, because it’s a people that has achieved the conjunction between the spiritual and the material. And this spiritual and material harmony generates progress. Last December, the country re-opened its embassy in Jerusalem, acknowledging the city as Israel’s capital, and was the first country to do so since the Hamas attacks on October 7, 2023. According toAP news, the move by President Santiago Peña, whoattended the embassy reopeningin person, was‘‘a rare diplomatic victory’’ for Israel. As reported byReuters, Peña didn’t mention the war in Gaza on that occasion, but declared:‘‘This step symbolizes our commitment to shared values and the strengthening of the ties that build a future of peace, development and mutual understanding.” Previously, the Paraguayan embassy had been located in Tel Aviv, and went through back-and-forth changes since 2018, amid shifts in government, as also reportedby the news agency. This May, the Israeli foreign relations minister, Gideon Sa’ar,calledthe gesture‘‘friendship in the harshest moment’’ for his country. **Categories** Latin America West Asia & North Africa Argentina Brazil Chile Israel Palestine Paraguay Uruguay Human Rights Humanitarian Response International Relations Politics War & Conflict A region on the brink: The global implications of the war on Gaza Israel's war on Gaza **Support our work** Global Voicesstands out as one of the earliest and strongest examples of how media committed to building community and defending human rights can positively influence how people experience events happening beyond their own communities and national borders. Please consider making a donation to help us continue this work. Donate now **Recent Latin America Stories** **Creative writing in Kaqchikel with children: Cecilia Ixmukane's project in Guatemala** **Peruvian farmer loses climate case against fossil fuel giant, but paves way for future action** **‘I sold my iris; now what?’: What drives Brazilians to hand over their unique, personal data** **Top World Stories** **United States: International student visa suspension also affects African countries** **Jailed Hong Kong activist Joshua Wong faces new foreign collusion charges** **Bridging cultures: How Korean passion is shaping a new generation in Egypt** **Start the conversation** Authors, pleaselog in » Name (required) Email (will not be published) (required) Website Subscribe to comments on this post via email All comments are reviewed by a moderator. Do not submit your comment more than once or it may be identified as spam. Please treat others with respect. Comments containing hate speech, obscenity, and personal attacks will not be approved. Δ **Menu** **About Us** What Is Global Voices? Our People Join Us! Partner with Global Voices Donate Contact Translation Services Sponsors **Receive great stories from around the world directly in your inbox.** Stay up to date about Global Voices and our mission. See ourPrivacy Policyfor details.Newsletter powered by Mailchimp (Privacy PolicyandTerms). **Sponsors** Global Voices is supported by the efforts of our volunteer contributors, foundations, donors and mission-related services. For more information please read ourFundraising Ethics Policy. Special thanks to our manysponsors and funders. Please support our important work: This site is licensed asCreative Commons Attribution 3.0. Please read ourattribution policyto learn about freely redistributing our workSome Rights Reserved What Is Global Voices? Our People Join Us! Partner with Global Voices Donate Contact Translation Services Sponsors **Topics** Caribbean Central Asia & Caucasus East Asia Eastern & Central Europe Latin America North America Oceania South Asia Sub-Saharan Africa West Asia & North Africa Western Europe The Bridge Elections Culture Human Rights Digital Activism All topics » **Receive great stories from around the world directly in your inbox.** Stay up to date about Global Voices and our mission. See ourPrivacy Policyfor details.Newsletter powered by Mailchimp (Privacy PolicyandTerms). **Sponsors** Global Voices is supported by the efforts of our volunteer contributors, foundations, donors and mission-related services. For more information please read ourFundraising Ethics Policy. Special thanks to our manysponsors and funders. Please support our important work:"}