{"id": 1756, "name": "LoonWatch", "domain": "loonwatch.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.loonwatch.com/2018/01/official-in-party-that-says-islam-does-not-belong-to-germany-converts-to-islam/comment-page-1/#comment-303455", "title": "Official In Party That Says Islam Does Not Belong To Germany Converts To Islam", "content": "**Top Menu** Home AboutHelp Promote Loonwatch.com!Ads Help Promote Loonwatch.com! Ads Help Promote Loonwatch.com! Ads Contact Send Us a Tip **Navigation** **loonwatch.com** **Main Menu** About act act for america admin Ads aljazeera allahu akbar amago amago america american sole animism anti muslim anti semitism antisemitism atheism attacks barack obama benjamin netanyahu bible bigotry bosnia breitbart watch brigitte gabriel britain cair car central african republic child marriages christian christianity clash of civilizations conservatives Contact convert conviction crimes criminality danios david cameron david rubin donald trump dorado edl emperor europe exmna fathima rifqa bary fbi feature featured florida fox news france garibaldi geert wilders gefilte genocide germany godless spellchecker gop guest haddock hate hate crime hate crimes Help Promote Loonwatch.com! Home ilisha ilisha Index of Hoaxes & Fabrications india isis islam islamic terrorism islamism islamofohobia islamophobia israel jerlerup jewishness jews jihad jihad watch jihadwatch judaism manchester mooneye mosque murder muslim muslims new atheism nicolai sennels palestine pamela geller pamela geller watch Privacy Policy quran race racism radical rape Register report right wing riots robert spencer robert spencer watch sam harris sarah haider saudi arabia Send Us a Tip serbia sex crimes share email share facebook share google plus 1 share reddit share twitter sharia sorcery srebrenica stephen colbert stoning tarek fatah terrorism toby keith tommy robinson uk usa violence war on terror wars what if they were muslim witch witch hunt witchcraft xenophobia zingel zionism **Official in party that says Islam does not Belong to Germany converts to Islam** Arthur Wagner, a leading AfDpartyofficialin the state of Brandenburg, Germany hasconvertedtoIslam. This is noteworthy considering he comes from apartywhich takes an adversarial position towardIslam,holding that“Islam does not belong to Germany.” The AfD has seen its political fortunes ascend the past year as it made major inroads on its anti-immigrant, anti-Islamplatform in elections. Popular Latest Comments Tags In 2017 Attacks Increased by 44% Against Muslim AmericansJanuary 12, 2018 Official in Party that says “Islam does not belong to Germany” Converts to IslamJanuary 25, 2018 CJ Werleman on Quilliam’s Faulty Report Tying Culture, Race To “Grooming Gangs”January 5, 2018 Dutch Reporters Blast US Ambassador Pete Hoekstra For Lying About “No-Go Zones”January 11, 2018 Greece: Neo-Nazi Group Threatens Muslim AssociationJanuary 19, 2018 Official in Party that says “Islam does not belong to Germany” Converts to IslamJanuary 25, 2018 Greece: Neo-Nazi Group Threatens Muslim AssociationJanuary 19, 2018 In 2017 Attacks Increased by 44% Against Muslim AmericansJanuary 12, 2018 Dutch Reporters Blast US Ambassador Pete Hoekstra For Lying About “No-Go Zones”January 11, 2018 CJ Werleman on Quilliam’s Faulty Report Tying Culture, Race To “Grooming Gangs”January 5, 2018 Omar_The_Egyptian: probably because he had an in depth chat with a Mu... NotAMuslamic: He must have eaten halal meat by accident! Now he... Khizer: Hopefully the Greek leftists/Antifa go pay the Naz... Mehdi: End of the article: In the past two years several... Mehdi: rest of the article: The earliest representations... Mehdi: Stalkers of Anxiety by C Scott Jordan: A new dist... Mehdi: Hi Khizer and thanks for your message. My view is ... **Like LoonWatch** **Follow me on Twitter** Index of Hoaxes & Fabrications **Blogroll** Anti-Hate: Krapuul (Netherlands) B-Boy Blue: Tweets, Rhymes and Life Bartholomew’s Notes on Religion Breitbart Watch Cartoon Muslim Collectif contre l'Islamophobie en France Danish Anti-Hate: Tosseanstalten or Booby Hatch EDL News (UK) Euroblog: Yellow Stars FAIR (Fairness & Accuracy in Reporting) Fake Ex-Muslims Gates of Vienna Vs. The World Vs. LGF Hope Not Hate (UK) Institute for Social Policy & Understanding (ISPU) Islamophobia Today: e-News Magazine Jadaliyya Jews Against Islamophobia Juan Cole: Informed Comment Kanz (France) Lesley Hazleton: The Accidental Theologist Max Blumenthal Media Matters MEMRI Watch Mondoweiss: The War of Ideas in the Middle East Muslim 4 Liberty Muslims Wearing Things ObsessionForHate.com Plunderbund Religion Dispatches Reza Aslan Richard Silverstein: Tikun Olam Right-Wing Watch Sadly, No! Sapelo Square: An Online Resource On Black Muslims In The US Sheila Musaji: The American Muslim SpencerWatch SPLC (Southern Poverty Law Center) The Electronic Intifada War in Context © 2018 loonwatch.com. All Rights Reserved."}