{"id": 354, "name": "Demopolis Times", "domain": "demopolistimes.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.demopolistimes.com/2025/06/04/the-100-deadliest-days-teen-driver-deaths-jump-in-summer-months/", "title": "The 100 Deadliest Days Teen Driver Deaths Jump In Summer Months", "content": "Home News Sports Obits Opinion Records Life Business Contests SubmitSubmit a news tipSubmit a photoBirth announcementBirthday announcementEngagement announcementWedding announcementSubmit a classified Submit a news tip Submit a photo Birth announcement Birthday announcement Engagement announcement Wedding announcement Submit a classified Submit a news tip Submit a photo Birth announcement Birthday announcement Engagement announcement Wedding announcement Submit a classified Classifieds Public Notices E-Edition **The 100 Deadliest Days: Teen Driver Deaths Jump in Summer Months** Published 8:45 am Wednesday, June 4, 2025 ByStaff Reports Crash data reveals concerning seasonal patterns as teen driving deaths continue to climb. Across the country, 13,135 people were killed in a crash involving a teen driver between 2019-2023. Over 30% of those deaths occurred during the 100 deadliest days between Memorial Day and Labor Day, according to a AAA review of crash data from the National Highway Traffic Safety Administration. On average, 8 people are killed per day in teen-involved driving crashes in the summer, compared to 7 per day during the rest of the year. During that same time for Alabama, 91 out of a total of 317 fatalities, were teen drivers. **Email newsletter signup** In 2023 alone, the most recent year of complete crash data, 2,897 people were killed in crashes involving a teen driver. A third of those deaths, 860, happened during the 100 Deadliest Days. “Summer months are particularly dangerous as more young drivers hit the road during school breaks with many logging more unsupervised driving time than usual,” said Clay Ingram, spokesperson for AAA Alabama. “We encourage families to take advantage of AAA resources like our driver education classes and parent-teen safe driving agreements to help set clear expectations for driving privileges.” There are steps teens and parents can take to save lives. Parents should model safe driving behavior and talk with their teens about buckling up, obeying speed limits, and putting phones away. With teens out of school, summer is also a great time for young drivers to complete a comprehensive driver education course to learn the rules of the road. The AAA Foundation for Traffic Safety also has new research highlighting the life-saving potential of smartphone-blocking technology. Parents should encourage teens to use “do not disturb” features on their phones to silence distractions while driving. **Richard Vaughn, Sr.** **Jimmy Branch** **William Crispin** **Kim Duhe** Home News Sports Opinion Life Faith Obituaries Records Classifieds Small Business About Us Subscribe Policies Terms of Use Submit a news tip Submit a photo Birth announcement Birthday announcement Engagement announcement Wedding announcement © 2025, The Demopolis Times"}