{"id": 1675, "name": "Asia-Pacific Research", "domain": "asia-pacificresearch.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.asia-pacificresearch.com/the-us-led-militarization-of-southeast-asia-china-russia-north-korea-and-iran-are-targets-in-pentagon-world-war-iii-scenarios/5535938", "title": "The Us Led Militarization Of Southeast Asia China Russia North Korea And Iran Are Targets In Pentagon World War Iii Scenarios", "content": "Home About Contact South Asia Southeast Asia China East Asia Oceania Pacific World Centre for Research on Globalization **Asia Pacific Research** grtv youtube twitter facebook rss Politics Economy Society Environment History Science Defence Media Justice **The US-Led Militarization of Southeast Asia. China, Russia, North Korea and Iran Are Targets in Pentagon World War III Scenarios** **Hague Court Ruling against China: A 'Side Show'** Image: Prof Michel Chossudovsky On Tuesday, the Hague ruled that China has no legal basis for its claims in the South China Sea. Asked to comment,Michel Chossudovsky,the director of the Montreal-based Center for Research on Globalization, told Sputnik that the Hague ‘tempest in a teapot’ is much less worrying than Washington’s efforts to militarize the region. There are two central issues, Professor Chossudovsky explained. “One is the fact that the United States has a project to militarize the Asia Pacific region, specifically threatening China. The other issue is …the [territorial] disputes between China, the Philippines, Vietnam, etc.” The second issue, according to the analyst, would be much easier to resolve if it weren’t for US involvement, which is using the territorial disputes as part of its so-called ‘pivot to Asia’, “essentially preventing these countries from reaching negotiations, and building a situation of crisis within the Asia-Pacific region.” © PHOTO: WIKIPEDIA/VOICE OF AMERICA Leaving aside the details of the ruling itself, Chossudovsky emphasized that when talking about a diplomatic conflict involving the Philippines and China, one has to understand that “we’re not talking about a conflict between one sovereign nation and another sovereign nation. The Philippines is a former colony of Spain and the United States, and today it remains almost a de facto colony of the United States, in terms of its broad alignments, military cooperation agreements, and so on and so forth.”Therefore, the analyst noted, “when the president of the Philippines negotiates with China, he does it in consultation with Washington.” Asked about the prospects of the diplomatic flare-up provoking a new arms race in the region, Chossudovsky suggested that unfortunately, one has already begun. “We are already in an arms race situation, triggered by the United States.That arms race, at this particular juncture, is essentially directed against four countries – Russia, China…Iran and North Korea.These are the four countries which are on the drawing board of the Pentagon, and they have been there for many, many years. In all the war games – the World War 3 scenarios that the Pentagon [plays out] on a routine basis – these four countries are the targets…This is ultimately what is at stake.” The professor reiterated that the militarization of the South China Sea is “there for two purposes: for threatening China, and [for preventing] the countries of the region – of Southeast Asia and the Far East from entering into cooperation agreements which would be more of a regional type.” Such agreements, Chossudovsky noted, would serve as a clear threat to Washington’s efforts to enforce the Trans-Pacific Partnership, aimed at putting countries throughout the region “under the geopolitical control of the United States.” The professor also emphasized that under normal circumstances, the issue of maritime rights would be resolved through bilateral discussions. A Canadian, Chossudovsky recalled that the United States and Canada also have water boundary disputes. But this doesn’t mean that the Chinese Navy butts in and deploys its own ships to these areas. “In other words, what I think is deplorable here is that a legal dispute under the laws of the sea is [being] used by the United States to threaten China and militarize strategic waterways in the South China Sea,”the analyst noted. Ultimately, commenting on other recent developments in the region, from the deployment of theTHAAD missile defense systemin South Korea, to the approval of anaval baseon the island of Jeju, the professor noted that it’s extremely important not to get lost in the details of this ruling. “A legal decision in the Hague is one thing – it’s a trivial issue, and should lead to bilateral discussions. The other more serious issue is the militarization of that entire region, which incidentally is also related to the militarization of Eastern Europe by NATO; it’s the same process, and is directed against China, Russia, Iran and North Korea; those are the four so-called rogue states defined in US foreign policy,”Chossudovsky concluded. * * * Michel Chossudovsky’s Bookcan be ordered directly from Global Research (click image) by Michel Chossudovsky **Related** Comment on Global Research Articles on our Facebook page Become a Member of Global Research **About the author:** Disclaimer:The contents of this article are of sole responsibility of the author(s). Asia-Pacific Research will not be responsible for any inaccurate or incorrect statement in this article. Asia-Pacific Research grants permission to cross-post Asia-Pacific Research articles on community internet sites as long the source and copyright are acknowledged together with a hyperlink to the original Asia-Pacific Research article. For publication of Asia-Pacific Research articles in print or other forms including commercial internet sites, contact:[email protected] www.asia-pacificresearch.comcontains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of \"fair use\" in an effort to advance a better understanding of political, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than \"fair use\" you must request permission from the copyright owner. For media inquiries:[email protected] Asia-Pacific Research Politics Economy Society Environment Defence Media Culture Science Latest Asian News and Top Stories"}