{"id": 1446, "name": "ThinkPol", "domain": "thinkpol.ca", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thinkpol.ca/2024/02/24/temporary-foreign-workers-in-canada-have-increased-by-almost-300-to-over-1-25-million-under-trudeau/#more-214449", "title": "Temporary Foreign Workers In Canada Have Increased By Almost 300 To Over 1 25 Million Under Trudeau", "content": "Home About UsAuthors Authors Authors Terms of Use Privacy Policy Contact Civil Liberties EconomyLabourBusinessIndustryOil and GasRenewable Energy Labour Business Industry Oil and Gas Renewable Energy Labour Business Industry Oil and Gas Renewable Energy GovernmentElectionsTransparencyPolicy Elections Transparency Policy Elections Transparency Policy SecurityCrime Crime Crime ScienceEnvironmentHealth Environment Health Environment Health International **Temporary foreign workers in Canada have increased by almost 300% to over 1.25 million under Trudeau** By Rohana Rezel The number of temporary foreign workers in Canada has increased by nearly 300 per cent to over 1.25 million since Prime Minister Justin Trudeau took office, according to data obtained from Canada’s immigration department. The number of valid work permit holders for work purposes on December 31 rose from 323,980 in 2015 to 1,270,360 in 2023 representing a 295 per cent increase. Prime Minister Justin Trudeau’s Liberal took over the reigns of power from Stephen Harper’s Conservatives in November 2015. Temporary foreign workers now account for 6.25 per cent of Canada’s workforce, which stood at 20,313,000 in December 2023.[1]Statistics Canada Labour Force Survey, December 2023 Table 14-10-0287-01 https://www150.statcan.gc.ca/n1/daily-quotidien/240105/dq240105a-eng.htm 1,081,780, or 85 per cent, of the workers at the end of 2023 were in Canada under the International Mobility Program[2]Temporary Residents: Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP) Work Permit Holders – Monthly IRCC Updates (Record ID: bed6c44f-1cc7-47c2-9483-9b467c3c0f97), which allows an employer to hire a temporary foreign worker without having to submit a Labour Market Impact Assessment (LMIA) request. The workers under IMP include spouses of temporary residents, and those on an intra-company transfer visa – a program that has been abused by outsourcing companies to bring in cheap offshore IT staff at the expense of local workers. Only 15 per cent, or 188,580, of the workers in Canada were under the Temporary Foreign Worker Program, which requires an employer to obtain an LMIA to hire a temporary foreign worker[3]Temporary Residents: Temporary Foreign Worker Program (TFWP) and International Mobility Program (IMP) Work Permit Holders – Monthly IRCC Updates (Record ID: 8d4c4240-88ea-421d-b80d-6cc6a3d28044). 502,885 temporary foreign workers were based in Ontario, while 200,665 worked in British Columbia. Contact the Author You can reach Rohana Rezel at[email protected]. You can also find him onTwitter,FacebookandGithub. References[+] Receive latest updates straight to your inbox Recent Posts **Recent Posts** **Recent Posts**"}