{"id": 1882, "name": "Arizona Daily Independent", "domain": "arizonadailyindependent.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://arizonadailyindependent.com/2025/06/10/more-attacks-planned-after-anti-ice-activists-assault-police-over-immigration-raids-in-peoria/", "title": "More Attacks Planned After Anti Ice Activists Assault Police Over Immigration Raids In Peoria", "content": "HomeOur TeamAbout UsContact UsPrivacy Policy Our Team About Us Contact Us Privacy Policy Our Team About Us Contact Us Privacy Policy News Opinion Daily Crossword Puzzle Comics Subscribe **More Attacks Planned After Anti-ICE Activists Assault Peoria Police** Anti-ICE activists are mobilizing over anticipated immigration raids across Phoenix this week. One encounter has already turned violent. On Tuesday, anti-ICE activists assaulted police during what they believed to be an immigration raid in Peoria. DEVELOPING: Protests against a supposed ICE raid in Peoria, Ariz. devolves into a chaotic situation.@LaurenCFox10captured this escalation between some there and officers. Peoria PD tells us this HSI bust was about narcotics – not immigration.@FOX10Phoenixpic.twitter.com/Ay5COL4QE9 — Trenton Hooker (@trentonhooker)June 10, 2025 The activists turned up to confront police after receiving a community alert from the Party for Socialism and Liberation of Phoenix. The Peoria Police Department (PPD) issued a statement to correct the record: the Homeland Security Investigation (HSI) operation in Peoria concerned a search warrant for a drug investigation — not immigration enforcement. “During the incident, misinformation circulated online, drawing protesters to the scene under the false belief it involved immigration enforcement,” stated PPD. “Unfortunately, the situation escalated when a suspect assaulted a police officer, and the crowd’s behavior became increasingly disruptive.” https://x.com/PeoriaPoliceAZ/status/1932548341755490778 The Peoria Police Department is among Arizona’s finest, and they did a wonderful job de-escalating a chaotic situation. It is disappointing to see Maricopa County Supervisor Steve Gallardo was so quick to spread misinformation and throw law enforcement under the bus. Arizona…https://t.co/Sp42hMGQv3 — Office of Congressman Abe Hamadeh (@RepAbeHamadeh)June 11, 2025 Progress Arizona, one of the leading dark money-funded nonprofits in the state, sent out a community alert defending their activists’ involvement. The nonprofit made no apologies about the assault on an officer. “Today, Arizonans came together to show support for immigrants by bearing witness to law enforcement actions, and to protect individuals’ constitutional rights in various locations across the valley, including at the intersection of 67th and Peoria avenues based on reports of ICE presence,” said Progress Arizona. The nonprofit included a statement from an involved activist and former state representative, John Loredo, promising more activist presence wherever they believe immigration enforcements may take place. “This is going to be the norm from now on; Arizonans will respond to defend our communities and protect our constitutional rights,” said Loredo. “We have resisted these attacks before, and we will do so again by preparing people for ICE raids now in a movement rooted in mutual support and community care.” Another ex-lawmaker (now spokesperson for activist organization Proyecto Progreso, which coordinated with Progress Arizona), Raquel Teran, said they would “peacefully observe and document” to ensure illegal immigrants’ rights weren’t violated during immigration enforcement proceedings. Proyecto Progreso launched earlier this year as a coalition of Spanish-language media outlets and progressive organizations in response to the Trump administration’s mass deportation efforts. In addition to Progress Arizona, their “community allies” are One Arizona, Mi Familia Vota, Corazon, Arizona Working Families Party, Arizona Democracy Resource Center, TheyBirth TheyArt, CHISPA, Poder Latinx, Arizona AANHPI, and Arizona Center for Empowerment. The organization’s “media allies” are Conecta Arizona, La Onda, 101.9 Campesina, La Reyna Radio, Entre Mujeres Radio, Prensa Arizona, Mary Rabago Productions, Chavez Media, and Contacto Total Radio. Proyecto Progreso offers connection to free legal advice and representation through the Legal Assistance Program for Mexicans through External Legal Counsel (PALE) — a program funded by the Mexican government. These activists have support from their Democratic elected officials. Maricopa County Supervisor Steve Gallardo joined protesters in defending their interruption of police operations. Gallardo declared illegal immigrants had a constitutional right to remain in the country. “It’s a sad day not only for Arizona but particularly for the city of Peoria. I’m kind of shocked to see the coordination within the city of Peoria and the federal government,” said Gallardo. “Police here in Peoria took an oath to uphold the Constitution, people that are being taken away — yeah they do have rights that need to be protected.” Governor Katie Hobbs spoke against Tuesday’s show of violence — though this latest statement may have come across as mixed messaging, given her recent response to the California riots. “Violence is completely unacceptable, and I urge any protesters to remain peaceful,” said Hobbs. https://x.com/GovernorHobbs/status/1932558919072952817 The governor’s statement addressing the Los Angeles riots may have led anti-ICE activists to believe she would look the other way or even support acts of violence. Hobbs signed onto a letter condemning President Donald Trump’s deployment of the National Guard over the weekend in response to the ongoing riots in Los Angeles, California. Maricopa County Attorney Rachel Mitchell pledged to hold rioters accountable for their actions. “This afternoon, people in the area of 67th Avenue and Cheryl Drive made a bad decision and an officer was hurt. While their assumption that he was involved in an immigration enforcement was wrong, let me be clear: assaulting a police officer, or hurting another person, or damaging property for any reason is not acceptable and those who do so will be held accountable for their unlawful actions.” https://x.com/Rachel1Mitchell/status/1932587613049008624 Self-Proclaimed “Election Integrity” Crusader Austin Smith Indicted for Election Fraud Self-Proclaimed “Election Integrity” Crusader Austin Smith Indicted for Election Fraud Mesays:June 11, 2025 at 3:23 amBOOK’EM ! JAIL’EM! Mark’em – you’ve made it to the ‘poo list’Reply BOOK’EM ! JAIL’EM! Mark’em – you’ve made it to the ‘poo list’ BOOK’EM ! JAIL’EM! Mark’em – you’ve made it to the ‘poo list’ MXB4Freedomsays:June 11, 2025 at 3:01 amdemocrats have declared war on Americans to protect their ‘new-slaves’. DejaVu all over again.Reply democrats have declared war on Americans to protect their ‘new-slaves’. DejaVu all over again. democrats have declared war on Americans to protect their ‘new-slaves’. DejaVu all over again. Scottsays:June 10, 2025 at 11:54 pmI can only imagine what Romero and Grijalva, et al, will do when ICE shows up in Pima CO. Who will they back and won’t that be fun!Reply I can only imagine what Romero and Grijalva, et al, will do when ICE shows up in Pima CO. Who will they back and won’t that be fun! I can only imagine what Romero and Grijalva, et al, will do when ICE shows up in Pima CO. Who will they back and won’t that be fun! **Leave a ReplyCancel reply** Your email address will not be published. Comment Name* Email* Website Save my name, email, and website in this browser for the next time I comment. **Arizona House Still Fighting For Conservative Budget Alternative** **Apache Junction Officer Dies After Being Shot In The Line Of Duty** **Will the “Abundance” Theme Work in Tucson?** **Media Dismisses Claims of Thousands of Arizona Voters Claiming Disenfranchisement** **AZ Legislature Week In Review – Week Ending June 8, 2025** **Superintendents – Respect Your Elected Officials** **Luke Air Force Base Near Phoenix Faces Possible Downgrade** **Latest Poll: Arizona Voters Equally Divided On The Direction The State Is Heading** Front Page Use of Site Terms Privacy Policy Refund Policy Our Team Contact Us ARIZONA DAILY INDEPENDENT LLC © Contact Us: 20118 North 67th Avenue Suite 300 #239, Glendale, AZ, 85308 (520) 906-8081"}