{"id": 914, "name": "The Mining Journal", "domain": "miningjournal.net", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.miningjournal.net/news/local/2025/06/us-reports-the-arrest-of-another-chinese-scientist-with-no-permit-to-send-biological-material/", "title": "Us Reports The Arrest Of Another Chinese Scientist With No Permit To Send Biological Material", "content": "NewsFront Page NewsLocalPolice LogSuperiorland YesterdaysCommunityMichigan NewsNational NewsInternational NewsBusinessRecordsLotteryPoundStocksToday in historyVesselsWeatherRegionSpotlightSuperior peopleSuperior HistoryElectionsBus schedules Front Page News Local Police Log Superiorland Yesterdays Community Michigan News National News International News Business Records Lottery Pound Stocks Today in history Vessels Weather Region Spotlight Superior people Superior History Elections Bus schedules Front Page News Local Police Log Superiorland Yesterdays Community Michigan News National News International News Business Records Lottery Pound Stocks Today in history Vessels Weather Region Spotlight Superior people Superior History Elections Bus schedules SportsLocal SportsSports ColumnsPrep SportsNMU SportsMichigan SportsNational SportsScoreboard Local Sports Sports Columns Prep Sports NMU Sports Michigan Sports National Sports Scoreboard Local Sports Sports Columns Prep Sports NMU Sports Michigan Sports National Sports Scoreboard OpinionColumnsEditorialLetters To The Editor Columns Editorial Letters To The Editor Columns Editorial Letters To The Editor LifeMonday: In BusinessTuesday: HealthWednesday: LearningThursday: Boomers & BeyondFriday: OutdoorsSaturday: WeekendSunday: Our YouthHouse To HomeSceneHealthy LivingGas tank getaways Monday: In Business Tuesday: Health Wednesday: Learning Thursday: Boomers & Beyond Friday: Outdoors Saturday: Weekend Sunday: Our Youth House To Home Scene Healthy Living Gas tank getaways Monday: In Business Tuesday: Health Wednesday: Learning Thursday: Boomers & Beyond Friday: Outdoors Saturday: Weekend Sunday: Our Youth House To Home Scene Healthy Living Gas tank getaways Obituaries Jobs Classifieds Garage Sales Special Sections Contact InformationContact UsSubscribeDistributionAdvertiseStatement of ValuesTerms of Service Contact Us Subscribe Distribution Advertise Statement of Values Terms of Service Contact Us Subscribe Distribution Advertise Statement of Values Terms of Service Submit News Public NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice News Sports Opinion Life Obituaries Jobs Classifieds Garage Sales SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **US reports the arrest of another Chinese scientist with no permit to send biological material** **** Jun 11, 2025 This image provided by United States District Court For The Eastern District Of Michigan shows toxic plant pathogens that a Chinese scientist entered the U.S. last year stashed in his backpack, federal authorities said Tuesday. As they filed charges against him and a girlfriend who worked in a lab at the University of Michigan. (United States District Court For The Eastern District Of Michigan via AP) DETROIT (AP) — A Chinese scientist was arrested while arriving in the U.S. at the Detroit airport, the second case in days involving the alleged smuggling of biological material, authorities said Monday. The scientist is accused of shipping biological material months ago to staff at a laboratory at the University of Michigan. The FBI, in a court filing, described it as material related to certain worms and requires a government permit. “The guidelines for importing biological materials into the U.S. for research purposes are stringent, but clear, and actions like this undermine the legitimate work of other visiting scholars,”said John Nowak, who leads field operations at U.S. Customs and Border Protection. The scientist was interviewed and arrested Sunday after arriving on a flight from China, where she is pursuing an advanced degree at Huazhong University of Science and Technology in Wuhan. She planned to spend a year completing a project at the University of Michigan. Her shipments, including an envelope stuffed inside a book, were intercepted last year and earlier this year and opened by authorities, the FBI said. The court filing doesn’t indicate whether the FBI believes the biological material was risky, though U.S. Attorney Jerome Gorgon Jr. said smuggling“threatens our security.” The scientist remains in custody awaiting a bond hearing Wednesday. “It doesn’t strike me as something that is dangerous in any way. But there are rules to ship biological material,”said Michael Shapira, a biologist at the University of California, Berkeley, who read the court filing and spoke to The Associated Press. The government last week charged two Chinese scientists who are accused of conspiring to smuggle a toxic fungus into the U.S. One was turned around at the Detroit airport and sent back to China last year, while the other, a researcher at the University of Michigan, was arrested. She remains in custody. **Newsletter** **Local** **Local** **Superiorland Yesterdays** **Superiorland Yesterdays** 30 years ago MARQUETTE — After the passing of a new state school spending bill, time students spend on the ... **New cell phone scam afoot** **New cell phone scam afoot** MARQUETTE — There is a new cell phone scam making its way across the state of Michigan, including right here in ... **Dance scheduled in Rock** **Dance scheduled in Rock** ROCK — A dance will be held at the Rock Community/Senior Center, located at 3892 W. Mapleridge Road, from 1-4 ... **US reports the arrest of another Chinese scientist with no permit to send biological material** **US reports the arrest of another Chinese scientist with no permit to send biological material** **Marquette city announcements made** **Marquette city announcements made** MARQUETTE — The city of Marquette has made several announcements of community interest: • The South Main St. ... **IHS Class of 1956 to Meet** **IHS Class of 1956 to Meet** ISHPEMING — The Ishpeming High School Class of 1956 will have its monthly gathering on Monday, June 16, at noon ... MOST READ **T.J. Oshie, US Olympic star in Sochi and Capitals Stanley Cup champion, announces he's retiring** **T.J. Oshie, US Olympic star in Sochi and Capitals Stanley Cup champion, announces he's retiring** **What's real problem?** **What's real problem?** **US reports the arrest of another Chinese scientist with no permit to send biological material** **US reports the arrest of another Chinese scientist with no permit to send biological material** **Protests over immigration raids popping up across the country with more planned** **Protests over immigration raids popping up across the country with more planned** **History quiz** **History quiz** **AG Nessel issues summer travel tips** **AG Nessel issues summer travel tips** **Newsletter** **Starting at $3.23/week.** **Subscribe Today** **Subscribe Today** NewsFront Page NewsCommunitySpotlightObituaries Front Page News Community Spotlight Obituaries Front Page News Community Spotlight Obituaries SportsLocal SportsPrep SportsSports ColumnsNMU Sports Local Sports Prep Sports Sports Columns NMU Sports Local Sports Prep Sports Sports Columns NMU Sports OpinionColumnsEditorialLetters To The Editor Columns Editorial Letters To The Editor Columns Editorial Letters To The Editor LifeHouse To HomeMonday: In BusinessSaturday: WeekendSunday: Our Youth House To Home Monday: In Business Saturday: Weekend Sunday: Our Youth House To Home Monday: In Business Saturday: Weekend Sunday: Our Youth ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Public NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice Copyright © 2025 Ogden News Publishing of Michigan, Inc. | https://www.miningjournal.net | 249 W. Washington, Marquette, MI 49855 | 906-228-2500"}