{"id": 842, "name": "Lexington Institute", "domain": "lexingtoninstitute.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://lexingtoninstitute.org/new-yorkers-will-trumps-golden-dome-missile-defense-work-from-am970-the-joe-piscopo-show-and-shake-it-off-with-mert-and-lucas/", "title": "New Yorkers Will Trumps Golden Dome Missile Defense Work From Am970 The Joe Piscopo Show And Shake It Off With Mert And Lucas", "content": "AboutMissionBiographical InformationContact Us Mission Biographical Information Contact Us Mission Biographical Information Contact Us Defense Energy Logistics Innovation DC Tech Tracker **New Yorkers: Will Trump’s Golden Dome Missile Defense Work? (From AM970 The Joe Piscopo Show and Shake it Off with Mert and Lucas)** Golden Dome missile defense is such a hot topic that it’s breaking through on New York radio. On May 28, deep into a discussion of Putin’s chaos in Ukraine, Joe Borelli, guest host ofThe Joe Piscopo Show,asked about President Donald Trump’s plan for Golden Dome, a missile defense shield for America. Highlights below. Joe Borelli noted that “President Trump has been talking about the Golden Dome for the last couple of weeks. Is this really a way to neutralize Russian nuclear attacks, that could sideline Putin and make him less of a threat?” Grant: “So what I hear in Washington is definitely we can improve missile defenses here in the continental U.S. We saw how well our Navy did helping Israel defend against Iran. The other difference is space tracking. We can now put up small satellites run by our U.S. Space Force that give a much better ability to track a missile after it gets up out of the atmosphere and is coming back down. That space-based tracking is the big new technical development that may help us build better missile defenses here in the U.S. and for our forces overseas.” Full cliphere. Then on June 1, the Sunday night hosts ofShake it OFF with Mert and Lucasdove into why Golden Dome is a real possibility. “Now Trump is promising Golden Dome,” said host and superlawyer Lucas Ferrara. “What’s the likelihood this is going to happen by 2029 or the end of his term, whenever?” Grant: “I’m going to tell you: 100%. Because there is a lot of new technology available. What Golden Dome can do is to improve the missile defense here in the United States, and also for how we do missile defense against hypersonic missiles for our forces overseas. “What’s really exciting about this is that after Reagan’s speech, there was a lot of research that went into missile defense. For a while, it was difficult. We came out of that with two contributions that are going to make Golden Dome possible. The first is that the U.S. Navy is really good at sea-based missile defense. They have a whole range of Standard Missile Interceptors. They helped Israel defend against Iran in those two attacks last year. The other thing that came out of the Reagan era, after a lot of research, was a technology called hit-to-kill. Instead of using a missile warhead to blow up and hit an enemy missile, they just use a projectile. It’s a bullet hitting a bullet, and it gives you a much better probability of a kill. Then there is the United States Space Force. They have some great, smaller satellites going up into orbit that will improve our ability to detect missiles that fly in unusual patterns. There are also some fantastic improvements in the power level of ground-based radars. Roll all this together, and you’ve got an opportunity now to greatly improve the missile defenses of the U.S. We actually have a missile defense on the West Coast, it’s based up in Alaska, and a little bit of it is in California. What President Trump is talking about is a missile defense that would cover all the continental U.S. and Canada, too. So, yes, he can do it.” Lucas reflected that the whole purpose of Reagan’s “Star Wars” Strategic Defense Initiative was to bankrupt the Soviet Union. Reagan launched SDI partly as an economic fake-out to the Soviet Union. “Is Golden Dome also a fake-out, or do we need this protection?” he asked. Grant: “We can and do need this protection. I think Reagan, in his heart, wanted to do everything he could to provide this defense. It had a huge impact on the Russian military, who said to Gorbachev and others, ‘hey, we can’t match this’. Golden Dome will be helpful in neutralizing China’s buildup. China has doubled its nuclear arsenal in the last few years. They had a small arsenal and were trying to go up to 1500 nuclear weapons, the same number held by the U.S. and Russia. There’s no reason to do this. The defenses should help reset some of China’s ambitions. “We need to do this anyway. A lot of this would work just as well for our forces overseas. A piece of America we are defending much better right now is Guam. We just activated a top-of-the-line missile defense system for Guam back late last year. They are within the range of a lot of Chinese forces, and they need that defense. Lucas: “Okay Doc, but half a trillion they are projecting, the cost for this Golden Dome. But do you think it’s doable? Or will it be higher cost? Grant: “It’s a defense program, guaranteed it’s going to be higher. If it’s done quickly and managed smartly, it can be close to that estimate. If they string it out, it’s going to cost more. The value of what you’re defending, It’s worth it.” Full show linkhere. Find Archived Articles: 1600 Wilson Boulevard - Suite 203|Arlington, VA 22209 USAPhone:703.522.5828| Fax: 703.522.5837© 2025Lexington Institute **Sign Up for LexNext Emails** \"*\" indicates required fields **Sign Up for LexNext Emails** \"*\" indicates required fields"}