{"id": 1120, "name": "The Post and Courier", "domain": "postandcourier.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.postandcourier.com/beaufort-county/", "title": "Beaufort County", "content": "Facebook Twitter YouTube TikTok Instagram Newsletters News Business Politics Opinion Events Calendar Obituaries Best of Beaufort County Charleston Columbia Greenville Spartanburg Myrtle Beach Beaufort County Pee Dee York County Aiken Standard North Augusta Branded Content Interactive Media Kit Submit a Press Release Print Ads Classifieds Marketplace Download the app! Travel Post and Courier Foundation 101 Things to do in SC Post and Courier Store Evening Post Books Join our Team Contact Us 83°Partly CloudyCharleston, SC(29403)TodayPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph..TonightPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:50 pmFull Forecast Charleston, SC(29403)TodayPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph..TonightPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:50 pm Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.. Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:50 pm Full Forecast Charleston, SC(29403)TodayPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph..TonightPartly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:50 pm Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.. Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:50 pm Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph.. Partly cloudy skies early will give way to cloudy skies late. A stray shower or thunderstorm is possible. Low around 75F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:50 pm Full Forecast Login Donate Buy & SellClassifiedsPrint AdsMarketplaceSpecial SectionsJobsJobs (Mobile)AutosReal EstateRecreationPetsPlace an Ad Classifieds Print Ads Marketplace Special Sections Jobs Jobs (Mobile) Autos Real Estate Recreation Pets Place an Ad Classifieds Print Ads Marketplace Special Sections Jobs Jobs (Mobile) Autos Real Estate Recreation Pets Place an Ad My AccountBecome a SubscriberManage your SubscriptionSubscribers OnlyFAQsAccess E-PaperArchivesEmail NewslettersContact UsMobile AppsSocial Media Become a Subscriber Manage your Subscription Subscribers Only FAQs Access E-Paper Archives Email Newsletters Contact Us Mobile Apps Social Media Become a Subscriber Manage your Subscription Subscribers Only FAQs Access E-Paper Archives Email Newsletters Contact Us Mobile Apps Social Media Subscribe Beaufort County News E-Paper Newsletters Obituaries **BEAUFORT COUNTY EDITION** — All the news you need to know from the Beaufort County area. **Marine commandant shifts blame about bizarre F-35B crash in South Carolina in first public comment** 43 mins ago An Alabama senator questioned Marine Commandant Gen. Eric Smith about the mysterious F-35B crash in South Carolina in 2023, prompting the commandant to pin blame on the pilot despite investigations that cleared him.Read moreMarine commandant shifts blame about bizarre F-35B crash in South Carolina in first public comment **TODAY'S HIGHLIGHTS** Lowcountry Legal Volunteers has provided free legal services to low-income residents for 25 years. A wave of grants will allow the group to expands the range of legal services it provides.Read moreAfter 25 years in the Lowcountry, new grants allow legal volunteers to expand their services The victim of a fatal weekend accident in Okatie has been identified by the Beaufort County Coroner's Office.Read moreCoroner's office identifies victim of fatal weekend accident in Okatie Leaders of Mitchelville Freedom Park are working to find and transport a commemorative stone from Sierra Leone to Hilton Head Island. A newly enacted travel restriction on Sierra Leone could hinder those efforts.Read moreSC's history connects to West Africa. Will travel restrictions hurt efforts to honor those ties? **AROUND THE STATE** 28 mins ago Attorneys for convicted killer Stephen Stanko did not find a hospitable audience in front of a federal judge in Charleston two days before Stanko’s scheduled execution.Read moreJudge rejects arguments to delay SC killer Stephen Stanko's June 13 execution 5 hrs ago An employee and associate of \"Tiger King\" star Bhagavan \"Doc\" Antle were sentenced June 10 after a federal probe into money laundering and animal trafficking schemes led by Antle and others.Read moreEmployee, associate of 'Tiger King' star Doc Antle sentenced in federal probe Jun 10, 2025 Researchers tested 44 seafood restaurants in Charleston to determine if they sold local, wild-caught shrimp as advertised. \"Eye-opening\" results published June 10 show only four of the restaurants did.Read more40 Charleston restaurants boasting local seafood are committing 'shrimp fraud', testing reveals Jun 10, 2025 The contract paints a far more alarming picture of security risks and health dangers on the island than government officials and contractor Alpha Genesis, who took over the colony's management in 2023, have acknowledged.Read moreSC's Monkey Island poses 'potentially life-threatening situations,' documents reveal **Latest News** Jun 10, 2025 Jun 9, 2025 Jun 8, 2025 Jun 6, 2025 Jun 5, 2025 Jun 4, 2025 Jun 4, 2025 **Today's Top SC Headlines** Southern socialite's $12M Charleston home lands on 'Zillow Gone Wild.' Look inside. 40 Charleston restaurants boasting local seafood are committing 'shrimp fraud', testing reveals Former Sheriff Chuck Wright hired L.B. Watson 20 years ago. Now the FBI has questions. How a Columbia luxury condo complex went from upscale living to a public danger facing demolition Dockside's repair cost could reach $151M, estimate says. Should residents cut their losses? **Palmetto Politics** **SC lawmaker sues state over pay raise, calls move 'unconstitutional'** UpdatedJun 9, 2025 A Republican senator is suing the state of South Carolina over an increase in compensation in this year's budget. And he and his attorney are asking the Supreme Court to immediately enjoin the increase, arguing there is \"no time for ordinary trial.\"Read moreSC lawmaker sues state over pay raise, calls move 'unconstitutional' **More Politics** **Sports** 16 mins ago Clemson baseball coach Erik Bakich reiterated his determination to assemble a roster worthy of Omaha in 2026, and he just added a couple of star-studded pieces via the transfer portal this week. **Latest Posts in Sports** Meet the Team Staff Mobile apps Newsletters Become a member Place an ad Advertising rates Editorial Classifieds RSS feed Careers Aiken Standard - Aiken, SC Georgetown Times - Georgetown, SC The Berkeley Independent - Moncks Corner, SC Journal Scene - Summerville, SC Moultrie News - Mount Pleasant, SC The Star - North Augusta, SC Free Times - Columbia, SC Kingstree News - Kingstree, SC Evening Post Books - Charleston, SC The Post and Courier148 Williman StreetCharleston, SC 29403 Phone:843-577-7111 News tips/online questions:newstips@postandcourier.com Delivery/subscription questions:subserve@postandcourier.com Facebook Twitter LinkedIn YouTube TikTok Instagram Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: , Post and Courier, an Evening Post Publishing Newspaper Group. All rights reserved. |Terms of Sale"}