{"id": 1738, "name": "Institute for Creation Research", "domain": "icr.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://store.icr.org/earth-systems-an-introduction-to-earth-system-orig.html", "title": "Earth Systems An Introduction To Earth System Orig.html", "content": "JavaScript is disabled in your browser. Enable it if you want to make full use of the features on our website. Store SpecialsComing Soon!On Sale!PacksClearanceMultilingual Coming Soon! On Sale! Packs Clearance Multilingual Coming Soon! On Sale! Packs Clearance Multilingual BooksBible & CommentaryBiographyCreation ClassicsFamilyGuide to SeriesLife SciencePhysical ScienceeBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks MediaDVDsFamilyLife SciencePhysical ScienceTruth on TourDownloadsVideo DownloadsAudio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour Family Life Science Physical Science Truth on Tour DownloadsVideo DownloadsAudio Downloads Video Downloads Audio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour Family Life Science Physical Science Truth on Tour Family Life Science Physical Science Truth on Tour DownloadsVideo DownloadsAudio Downloads Video Downloads Audio Downloads Video Downloads Audio Downloads GiftsApparelShirtsEducationalModelsPrintsWares ApparelShirts Shirts Educational Models Prints Wares ApparelShirts Shirts Shirts Educational Models Prints Wares **Your cart is empty** Total:$0.00 Home SpecialsComing Soon!On Sale!PacksClearanceMultilingual Coming Soon! On Sale! Packs Clearance Multilingual Coming Soon! On Sale! Packs Clearance Multilingual BooksBible & CommentaryBiographyCreation ClassicsFamilyGuide to SeriesLife SciencePhysical ScienceeBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks MediaDVDsFamilyLife SciencePhysical ScienceTruth on TourDownloadsVideo DownloadsAudio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour Family Life Science Physical Science Truth on Tour DownloadsVideo DownloadsAudio Downloads Video Downloads Audio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour Family Life Science Physical Science Truth on Tour Family Life Science Physical Science Truth on Tour DownloadsVideo DownloadsAudio Downloads Video Downloads Audio Downloads Video Downloads Audio Downloads GiftsApparelShirtsEducationalModelsPrintsWares ApparelShirts Shirts Educational Models Prints Wares ApparelShirts Shirts Shirts Educational Models Prints Wares **Earth Systems: An Introduction to Earth System Origins, Structures, and Processes** $95.00 > Wish List > Compare Information Specifications Reviews(1) Since the late eighteenth century, most scientists have argued for a uniformitarian view of Earth’s history. They claim the world that exists today was sculpted by natural processes over billions of years. However, this interpretation presents many issues both scientifically and theologically. Contrary to popular belief, the global evidence indicates a recent catastrophic past. Earth Systems: An Introduction to Earth System Origins, Structures, and Processesequips students with a biblical understanding of Earth science. The three authors include experienced researchers and professors who have deeply studied geology, meteorology, oceanography, climatology, and more. Filled with practical information and colorful visuals, this undergraduate-level textbook is designed to reinforce a Christian worldview in the classroom and beyond. This book is available as a digital downloadhere. Tags: Thomas Breuner, Timothy Clarey, and Jake Hebert, 2153 Bought with the intention of deciding if an appropriate textbook for home schooled high school age grandchildren. It is, but better used as a read & discuss together textbook. Chapter 2 on plate tectonics is thorough and outstanding! It fully validates my belief in Catastrophic Plate Tectonics, which I have held since a 1972 public college geography class, but never had all the proof in front of me until now. Thank you! **Related products** $39.99 $29.99 $21.99 SpecialsComing Soon!On Sale!PacksClearanceMultilingual Coming Soon! On Sale! Packs Clearance Multilingual Coming Soon! On Sale! Packs Clearance Multilingual BooksBible & CommentaryBiographyCreation ClassicsFamilyGuide to SeriesLife SciencePhysical ScienceeBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks Bible & Commentary Biography Creation Classics Family Guide to Series Life Science Physical Science eBooks MediaDVDsFamilyLife SciencePhysical ScienceTruth on TourDownloadsVideo DownloadsAudio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour FamilyLife SciencePhysical ScienceTruth on Tour Life SciencePhysical ScienceTruth on Tour Physical ScienceTruth on Tour Truth on Tour DownloadsVideo DownloadsAudio Downloads Video DownloadsAudio Downloads Audio Downloads DVDsFamilyLife SciencePhysical ScienceTruth on Tour FamilyLife SciencePhysical ScienceTruth on Tour Life SciencePhysical ScienceTruth on Tour Physical ScienceTruth on Tour Truth on Tour FamilyLife SciencePhysical ScienceTruth on Tour Life SciencePhysical ScienceTruth on Tour Physical ScienceTruth on Tour Truth on Tour Life SciencePhysical ScienceTruth on Tour Physical ScienceTruth on Tour Truth on Tour Physical ScienceTruth on Tour Truth on Tour Truth on Tour DownloadsVideo DownloadsAudio Downloads Video DownloadsAudio Downloads Audio Downloads Video DownloadsAudio Downloads Audio Downloads Audio Downloads GiftsApparelShirtsEducationalModelsPrintsWares ApparelShirts Shirts Educational Models Prints Wares ApparelShirts Shirts Shirts Educational Models Prints Wares New to ICR? | Learn More Here Need Help? | Contact us today ICR's New Discovery Center Check your Order Status $95.00 **Customer service** About Us Contact Us General Terms & Conditions Help Privacy Policy Shipping Agreement **Products** All products New products ICR DVD Series ICR Tracts Authors Tags **My account** Register My orders RSS feed My wishlist Reward Program **ICR** Donate to ICR Subscribe Close SpecialsOn Sale!Packs On Sale! Packs On Sale! Packs BooksBible & CommentaryCreation ClassicsFamilyGuide to SeriesLife SciencePhysical Science Bible & Commentary Creation Classics Family Guide to Series Life Science Physical Science Bible & Commentary Creation Classics Family Guide to Series Life Science Physical Science MediaDVDsAudio DVDs Audio DVDs Audio GiftsApparelEducationalModelsPrints Apparel Educational Models Prints Apparel Educational Models Prints DownloadsAudio DownloadsVideo DownloadseBooks Audio Downloads Video Downloads eBooks Audio Downloads Video Downloads eBooks SocialMedia"}