{"id": 1305, "name": "St. Louis Post-Dispatch", "domain": "stltoday.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.stltoday.com/life-entertainment/local/food-drink/restaurants/best-restaurants-in-st-louis-stl-100/article_32b29e66-e16c-11ee-91ac-0f41a6733f29.html", "title": "Best Restaurants In St Louis Stl 100", "content": "**Satisfy your cravings** With our weekly newsletter packed with the latest in everything food. **Take advantage of theseexclusive benefits:** E-edition PLUS unlimited articles & videos Personalized news alerts with our mobile app *FREE access to newspapers.com archives Hundreds of games, puzzles & comics online *Refers to the latest 2 years of stltoday.com stories. Cancel anytime. Log In Subscribe Guest Logout NewsMetroSt. CharlesIllinoisNation & WorldSend a news tip Metro St. Charles Illinois Nation & World Send a news tip Metro St. Charles Illinois Nation & World Send a news tip ExploreEmail newslettersSTL 100 RestaurantsTop WorkplacesWinning STLHomicide trackerPublic salariesSTL Headliner Awards Email newsletters STL 100 Restaurants Top Workplaces Winning STL Homicide tracker Public salaries STL Headliner Awards Email newsletters STL 100 Restaurants Top Workplaces Winning STL Homicide tracker Public salaries STL Headliner Awards News topicsEducationLaw & orderPoliticsTrafficWeather Education Law & order Politics Traffic Weather Education Law & order Politics Traffic Weather Columnists BusinessHealth careNation & WorldMarkets & Stocks Health care Nation & World Markets & Stocks Health care Nation & World Markets & Stocks OpinionEditorialsColumnistsMailbagSubmit a letter Editorials Columnists Mailbag Submit a letter Editorials Columnists Mailbag Submit a letter ObituariesShare your storyFind an Obituary Share your story Find an Obituary Share your story Find an Obituary SportsCardinalsBluesSTL City SCB'Hawks & morePodcastsMizzouIlliniSLUForumsBetting Cardinals Blues STL City SC B'Hawks & more Podcasts Mizzou Illini SLU Forums Betting Cardinals Blues STL City SC B'Hawks & more Podcasts Mizzou Illini SLU Forums Betting High school sportsSchedulesSchoolsStats Schedules Schools Stats Schedules Schools Stats Fun & gamesComics - A to ZGamesPuzzlesEvents Comics - A to Z Games Puzzles Events Comics - A to Z Games Puzzles Events Life & EntertainmentBooksDiningMusicMovies & TVArts & TheatreHome & gardenGet HealthyPetsPeopleTravel Books Dining Music Movies & TV Arts & Theatre Home & garden Get Healthy Pets People Travel Books Dining Music Movies & TV Arts & Theatre Home & garden Get Healthy Pets People Travel Digital exclusivesArchivesE-editionLive chatsMobile appsNewslettersPodcastsPhoto galleriesVideos Archives E-edition Live chats Mobile apps Newsletters Podcasts Photo galleries Videos Archives E-edition Live chats Mobile apps Newsletters Podcasts Photo galleries Videos Share with usNews tipPress releasesShare videoSend a storyShare a photo News tip Press releases Share video Send a story Share a photo News tip Press releases Share video Send a story Share a photo STL Pinch Hits Feast Magazine Ladue News Brand Ave. StudiosCollege ConnectionNursesStories of HonorTeacher Appreciation College Connection Nurses Stories of Honor Teacher Appreciation College Connection Nurses Stories of Honor Teacher Appreciation Buy & SellPlace an AdMarketplacePublic NoticesShop Local Place an Ad Marketplace Public Notices Shop Local Place an Ad Marketplace Public Notices Shop Local Shopping Jobs Customer serviceManage SubscriptionActivate Digital SubscriptionContact usCookiesDiagnostics Manage Subscription Activate Digital Subscription Contact us Cookies Diagnostics Manage Subscription Activate Digital Subscription Contact us Cookies Diagnostics Gift Subscriptions Facebook Twitter Bluesky LinkedIn YouTube TikTok Pinterest Instagram Log In Welcome,GuestMy SubscriptionHelp CenterMy AccountDashboardProfileSaved itemsLogout My SubscriptionHelp Center My Account Dashboard Profile Saved items Logout My SubscriptionHelp Center My Account Dashboard Profile Saved items Logout E-edition News Obits Sports Opinion Puzzles Podcasts Lifestyles Business STL Headliner 88°Fair Facebook Twitter Bluesky WhatsApp SMS Email Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save **Ian Froeb’s STL 100: The best St. Louis restaurants of 2024** Ian Froeb | Post-Dispatch Apr 13, 2024 Apr 13, 2024 0 Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save This year’s STL 100 is brought to you by my car. It's not even two years old yet, but has already been racking up miles in search of St. Louis' best, most exciting restaurants. Seriously, I needed only 18 months to reach my 3-year/30,000-mile maintenance appointment. I have traveled more extensively than ever before for the 2024 STL 100, from St. Peters to the Metro East. I ate Vietnamese banh mi with a side of cheese fries in Florissant and pork cracklings with a Gruyère fondue in O’Fallon, Missouri. This is the ninth edition of the STL 100. Choosing which restaurants make the list has gotten more difficult each year. The 2024 edition includes the usual crop of must-visit new spots, but you will also find the return of a few familiar names that have been absent for a while. Get your own car or bike or most comfortable pair of walking shoes. Let’s go eat. **People are also reading…** Local Illinois spot airs on ‘Bar Rescue’ in June. ‘Nothing was staged,’ owner says. Chesterfield contractor allowed to keep filing liens on hundreds of McBride homes North Carolina school officials admit they chose wrong valedictorian after mom stands up for son Cardinals could get big money from Missouri stadium deal for Chiefs, Royals St. Louis sheriff buying new take-home SUV, despite budget woes Kendrick Lamar, SZA weave acts in stunning show at the Dome at America’s Center MetroLink opens unattended security gates. Riders complained of delays City says St. Louis sheriff is refusing a key duty. ‘They’re lying,’ sheriff’s lawyer says. Raised, glazed and amazed: St. Louis’ most essential doughnut shops Six tornado-damaged St. Louis public schools won’t reopen this fall McClellan: The story of Rosemary, and other people who left St. Louis St. Louis police spike up to 50 cars fleeing stunt-driving gathering Battlehawks’ attendance and TV ratings fall, but still (mostly) best in UFL: Media Views IRS drops investigation of Maryland Heights megachurch for political activity Billionaire David Hoffmann buys newspaper in Washington, Mo., his hometown • The information in this guide is current as of April 2024. We will update essential information as necessary atstltoday.com/stl100. However, restaurant hours and prices and the availability of specific dishes are all subject to change. Contact each restaurant directly for the most up-to-date information. • Restaurants must have opened by Dec. 31, 2023, to be eligible for inclusion. Restaurants returning from the 2023 edition of the STL 100 have been visited, most within three months before publication. • A few restaurants from last year's list were omitted in 2024 due to scheduling issues. Elaia, Olio and Taqueria Morita temporarily closed to relocate. The Benevolent King announced an entirely new menu format, and Cellar House underwent a chef change, both too late in the research process to evaluate fairly. • Pricing information is an estimate based on what an average diner would spend given a restaurant’s format:$($20 and under),$$($20-$40),$$$($40-60),$$$$($60 and up). • Usethis list, or click on the cuisine category under each restaurant name, to see an index by cuisine. An acorn doughnut filled with potato mousse at Bulrush **1. Bulrush, now closed** UPDATE:In June 2024, chefRob Connoley announced Bulrush was closed, saying he could no longer run a business in a state that is \"actively working to harm\" the LGBTQ community. Bulrush isn’t the No. 1 restaurant in St. Louis because, in the course of a dinner during Lent, chef Rob Connoley served an uncanny tribute to the McDonald’s Filet-O-Fish. Bulrush chef Rob Connoley is shown on March 9, 2023, in his highly acclaimed restaurant. Bulrush is the No. 1 restaurant because Connoley’s fillet of fish was as inspired as anything I ate over the past year: walleye (one of the few fishes Connoley allows in his rigorously local, historical pantry) with homemade American cheese and tartar sauce on a cushy Taiwanese style-bun. In the 2023 STL 100, I hoped to convey that Bulrush, while a Serious Restaurant, is a hell of a lot of fun. In 2024, Connoley made the point in a single course, maybe three or four bites total. And there were five courses left to go. Throughout your dinner, you will learn about the important work Connoley and Bulrush are doing — even beyond the fact of the restaurant’s existence, that is, a project to resurrect Ozark cuisine and pay appropriate tribute to the enslaved and indigenous persons who called the region home. Connoley developed a dish that celebrated carrots — a carrot mousse and a carrot panisse with bacon, hen of the woods mushrooms, pumpkin-seed pesto and grits — with the Normandy High School students he mentors for their culinary competition. The restaurant’s commitment to producing zero waste pays off in the actual seasonings used in your food. It’s exciting, to the point where detailing the zero-waste policy’s role in a dish of grilled green-meat radish with sausage of duck raised in Florissant would be a spoiler. Spoiler alert: Dinner at Bulrush is often surprising, always delicious and thought-provoking in the best way. You leave sated, and your satisfaction grows later when your read Connoley’s essay on Bulrush’s role in the community. Connoley also sends you home with breakfast for the next day, a treat I won’t reveal partly because it might change before your visit, partly because you deserve the shock when you realize, on top of everything else at Bulrush, he has also improved one of St. Louis’ most beloved desserts. Last year: No. 2 3307 Washington Boulevard 314-449-1208;bulrushstl.com Dinner Thursday-Sunday (closed Monday-Wednesday) $$$$ Turnip tacos at Vicia **2. Vicia** As I write this, Vicia is preparing to shift from its Farmers Feast experience to a conventional a-la-carte menu. The change makes sense in the current dining landscape, not least because it should entice even more people to try the exceptional food and hospitality from Tara and Michael Gallina, the couple’s business partner and culinary director Aaron Martinez and Vicia chef de cuisine Jane Sacro Chatham. Having said that, I do want to salute Vicia’s Farmers Feast a final time. Essentially a family-style three-course dinner — a flurry of snacks, a main course with sides and dessert — it showcased Vicia’s range and inventiveness while keeping to the natural rhythm of a meal rather than becoming a steady, potentially stultifying parade of bites. At my recent dinner, it delivered both the fleeting “Wow!” moments of Vicia’s vegetable-forward ethos, like carrot “tartare” atop a bite-size blue-corn masa cake, and the triumphant showstopper of four different cuts of impeccably sourced pork in a sauce with the complex fruitiness of a habanero chile, but intentionally without the overwhelming heat, alongside bowls of late-winter cabbage and potatoes, both tastier than I could have imagined anywhere else. Last year: No. 3 4260 Forest Park Avenue 314-553-9239;viciarestaurant.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$$ Takiawase, a red snapper stew with squid, at Nobu's in University City **3. Nobu’s** The relocated, reimagined Nobu’s already ranked No. 7 in last year’s STL 100, which was published six months after Noboru Kidera opened the new version of his sushi restaurant in the Delmar Loop. When I returned to Nobu’s this February, the 75-year-old Kidera — working alongside his wife, Taeko, and son, George — had taken this essential restaurant to yet another level of confidence, execution and beauty. The nigiri sushi that made Nobu’s former home destination dining is still remarkable for the precision of Kidera’s cuts and the clarity of the fishes’ flavors, but nigiri is only one highlight of the restaurant’s omakase (chef-directed) menus. A seafood salad leads with king crab and shrimp, but dazzles with its bevy of vegetables (young cauliflower, fresh bamboo shoot and arrowroot, to name a few), each prepared in a separate manner. A red snapper bone broth is as memorably soulful as a spoonful of Hokkaido uni is ridiculously luscious. George Kidera, who narrates the meal, will extol the virtues of locally grown daikon, sushi ginger from Fiji and the olive oil in which your tempura course has been fried — perfectly, of course. Dinner at Nobu’s requires pre-paid reservations, and it is a required experience for any St. Louisan serious about sushi or restaurants, period. Last year: No. 7 6253 Delmar Boulevard, University City 314-323-9147;nobustl.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$$$ The pork chop at Little Fox **4. Little Fox** Little Fox has become my go-to destination when out-of-town friends visit St. Louis, and when my wife and I were planning dinner recently with another couple in town who had never visited Mowgli and Craig Rivard’s Fox Park restaurant, it became the only possible choice. Little Fox is so friendly and its food so inviting that it can appeal to even the most jaded big-city appetites — it certainly helps in the latter respect that the Rivards moved to Craig’s native St. Louis from New York City — yet its vibes and cooking are wholly unique to St. Louis, its neighborhood and Craig’s kitchen team. Missouri produce can hardly look or taste better than Little Fox’s grilled Ozark Forest royal trumpet mushrooms over soubise with chive oil and a sherry vinaigrette or the ‘nduja-marinated pork chop from Newman Farm in Myrtle. Few restaurants so young have so many dishes vying for the title of signature — the short ribs, the herb cavatelli, the chicken marinated with anchovy and rosemary to name just three — and I can’t think of any place where I would excitedly tell locals and tourists to try the onion soup, distinguished here by roasted bone marrow and a splash of apple brandy. Last year: No. 6 2800 Shenandoah Avenue 314-553-9456;littlefoxstl.com Dinner Tuesday-Saturday, brunch Saturday-Sunday (closed Monday) $$$-$$$$ Pide (left) and cevapi at Balkan Treat Box **5. Balkan Treat Box** Balkan Treat Box owners Loryn and Edo Nalic have continued their remarkable journey with the January 2024 opening of a second restaurant, Telva at the Ridge. Also located in Webster Groves, Telva expands the couple’s exploration of the cuisines of Bosnia and, more broadly, the Balkans into cafe culture, with breakfast fare, sweets, coffee and tea. Telva debuted too late for this year’s STL 100, but its arrival speaks to the drive that, over the past seven years, has taken Balkan Treat Box from food truck to brick-and-mortar restaurant to No. 1 in last year’s list. A smaller example: not two months after the publication of the 2023 STL 100, I encountered a dish better than anything I’d eaten here before, a seasonal spin on the pide (a wood-fired flatbread) that captured the fleeting glory of spring with asparagus and pickled ramp. As at my recent visits to Little Fox (see No. 4), I ordered this pide as part of a ridiculously oversized meal to introduce a visiting friend to Balkan Treat Box: the cevapi, of course; the rolled flatbread lahmacun; the kumru, a pressed sandwich. Though not No. 1 in 2024, Balkan Treat Box is unquestionably one of St. Louis' very best restaurants. Last year: No. 1 8103 Big Bend Boulevard, Webster Groves 314-733-5700;balkantreatbox.com Lunch Tuesday-Saturday (closed Sunday-Monday) $-$$ Supper featuring Midwestern Prime Rib, Coconut Creamed Spinach and Mala Broccoli with a Mohaattan cocktail at the Mainlander **6. Mainlander 🆕** Mainlander was the best new restaurant of 2023, and for this reservations-only debut behind a virtually unmarked Central West End storefront, \"new” is no mere chronological marker. St. Louis has never seen anything like Mainlander, where chef Blake Askew and his partner in business and life, Gordon Chen, build a remarkable dinner experience from a kitsch-risking throwback aesthetic, the dusty canon of Midwestern cuisine and modern touches from Taiwan and beyond. The menu, which changes monthly, might reinvent the old-school, LBJ-approved King Ranch casserole with duck confit and hand-made blue-corn tortillas. Or Askew might serve you the mightiest, beefiest slab of prime rib you’ve eaten in your life. The smaller bites that precede the main event are more subtly stunning, from the porridge congee made with rice from Cahokia and served with late-season produce and a Taiwanese cruller to a fall “candy apple” chicken wing glazed with apple cider and apple butter. The praise that has followed Mainlander, including a semifinalist honor as “Best New Restaurant” nationwide from the James Beard Foundation, makes securing seats here a new, but exceptionally worthy challenge each month. 8 South Euclid Avenue mainlanderstl.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$$$ The sashimi masu at Sado **7. Sado 🆕** Mere weeks after the Hill sushi restaurant Sado made the list of the best new restaurants of 2023, chef Nick Bognar announced his next project, Pavilion. This isn’t another new restaurant so much as an expansion of Sado where Bognar will feature the omakase (chef’s choice) dinners that were the pre-pandemic showpiece of his first restaurant, Indo. Sado has already restored Bognar to his place behind the sushi counter, forming the nigiri sushi that kindled his rising-superstar reputation at Indo and, before that, at his family’s late restaurant Nippon Tei. (For Indo’s current path, see No. 10.) He can mesmerize you with the supple lusciousness of tuna and the funky oceanic sweetness of uni, but his real skill is coaxing brilliant flavors and textures from fish like snapper (madai) or the blackthroat perch (nodoguro). Sado brings this modern approach together with the sushi rolls, crab Rangoon and other crowd-pleasers that defined Nippon Tei, which his mother, Ann Bognar, opened in 2001. You might be tempted to call Sado a greatest hits restaurant, but with a chef as talented as Bognar, I will reserve “the greatest” for the future tense. 5201 Shaw Avenue 314-390-2883;sado-stl.com Dinner Tuesday-Sunday (closed Monday) $$$-$$$$ Grilled Spanish Octopus, Potato, Chickpeas, Soppressata, Calabrian from Louie in Clayton. **8. Louie** The blockbuster first year of Wright’s Tavern (see No. 15) has made it marginally less difficult to score a reservation at Matt McGuire’s other cozy, can’t-miss Clayton restaurant. Marginally — I managed to land a bar seat at Louie at 9 p.m. on a weeknight and was thrilled to see a restaurant crackling with energy at a time that, on our weird new post-pandemic dining clock, might as well be midnight. I didn’t see McGuire himself at his standard post slicing prosciutto di Parma, a first on my dinners here, but he has finely tuned Louie to hum in his absence. Chef Sean Turner hasn’t needed to tweak Louie’s signature dishes since the restaurant opened six years ago, but I still marvel at the perfect accent of mint with its hummus, at how the swirl of chermoula seemingly buried under a whopping double-cut pork chop and a plant’s worth of shishito peppers bursts through the plate with its herbaceous vibrancy. The wood-fired hearth at the back of the dining room blisters the Neapolitan-style pizzas and the hearth bread accompanying the hummus. It also, I like to think, sparks the feeling of warmth that spreads through Louie, embodied by the best server in St. Louis, Jordan VanZandt. Last year: No. 10 706 DeMun Avenue, Clayton 314-300-8188;loueidemun.com Dinner Monday-Saturday (closed Sunday) $$$-$$$$ Scallops in a white mole sauce are surrounded counterclockwise by the blue crab tostada, dulce de calabaza, tostada de calabaza, kaaxil sikil and beef tongue taco from El Molino del Sureste. **9. El Molino del Sureste, Sureste 🆕** Alex Henry is one of St. Louis’ most talented chefs, and his cooking, which bridges local, seasonal ingredients and the cuisine of his native Yucatán in Mexico, demands national attention. Sureste, his Food Hall at City Foundry kitchen, is now a three-time STL 100 honoree. El Molino del Sureste, the restaurant he and his brother, Jeff, opened last year in Southampton, takes his work to another level entirely. Thrill to plates small and large, from squash blossom and beef tongue tacos to brawny venison sausage in tomato-habanero sauce and the tremendous pavo en escabeche, grilled turkey in citrus broth. El Molino features painterly compositions of Sureste’s signature ceviche, and seafood in general is a must-order. Henry’s Hokkaido scallops in white chocolate mole are unlike anything I’ve eaten in St. Louis. His restaurants are unlike any other, too. Last year: No. 16 (Sureste) El Molino del Sureste,5007 South Kingshighway314-925-8431;elmolinostl.comDinner Tuesday-Saturday (closed Sunday-Monday)$$$ 5007 South Kingshighway 314-925-8431;elmolinostl.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$ 5007 South Kingshighway 314-925-8431;elmolinostl.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$ Surestethe Food Hall at City Foundry, 3730 Foundry Waysurestemexican.comLunch and dinner daily$-$$ the Food Hall at City Foundry, 3730 Foundry Way surestemexican.com Lunch and dinner daily $-$$ the Food Hall at City Foundry, 3730 Foundry Way surestemexican.com Lunch and dinner daily $-$$ Lamb Ribs at Indo **10. Indo** Nick Bognar has moved his acclaimed nigiri-sushi program to Sado, his new restaurant on the Hill (see No. 7). He has announced plans to refine that program further at Pavilion, the ticketed sushi counter opening later this year at Sado. Meanwhile, his original Botanical Heights restaurant Indo makes a compelling argument that Bognar would be one of the most exciting chefs of his — or any other — generation even if he had never placed a small piece of aged raw fish on top of a clump of rice. At Indo, you will encounter composed sashimi dishes as thrilling to eat as they are beautiful to behold, like cold-smoked masu — imagine the best lox you have eaten, but even more luscious — with an apple relish, lime zest and a finishing touch of salt. Indo finds the intersection of comfort and elegance (fried rice with crab) and new touches to energize dishes that, in only its fifth year, are already classics (the shrimp toast, recently served with a mango-sweet chile garnish). And while you now must visit Sado for nigiri sushi, in its place Indo offers temaki, hand rolls with fillings both simple and luxe. Last year: No. 5 1641D Tower Grove Avenue 314-899-9333;indo-stl.com Tuesday-Sunday (closed Monday) $$$-$$$$ The rib chop at the Crossing **11. The Crossing** About a dozen years ago, believe it or not, Clayton was the most exciting place to dine in St. Louis. Gerard Craft had just moved his flagship Niche there and was cooking his most ambitious food yet. At night, Mike Randolph turned his cafe Half & Half into Little Country Gentlemen, serving anything-goes tasting menus. Meanwhile, Jim Fiala’s the Crossing did what it has always done — seamlessly bringing together classic French and Italian influences, top-notch produce and a keen eye for the trends it can embrace and those it will easily outlast. These days in Clayton, you can spend a lot of money on steaks and overpriced hotel food. Thankfully, the Crossing remains exciting, whether you grab dinner at the bar or splurge on the chef’s grand tasting menu. At a recent dinner, Fiala, chef Thu Rein Oo and their team took umami-jacked black garlic — an ingredient I saw many times this STL 100 cycle — and smartly softened its edges, folding it into a velvety beurre blanc for a gorgeous piece of red snapper. Alongside such can’t-miss Crossing dishes as crudo, tagliolini with mushrooms and fried apple pie, the dinner wasn’t showy, just spectacular. As always. Last year: No. 11 7823 Forsyth Boulevard, Clayton 314-721-7375;thecrossing-stl.com Dinner Monday-Saturday, lunch Monday-Friday (closed Sunday) $$$$ Mushroom soup is poured table side at Root Food + Wine in Augusta December 2021. **12. Root Food + Wine** Chef Philip Day has brought the attention of the James Beard Foundation to tiny Augusta, scoring a semifinalist nod for “Best Chef: Midwest” in the 2024 edition of the organization’s awards. (At press time, this year’s finalists haven’t been announced.) In the three years since Day opened Root Food + Wine to acclaim, his cooking has grown only more impressive. A recent visit found his smoked-mushroom consommé, a signature winter dish, transformed into a clever play on ramen, minus the noodles: the broth with oyster mushrooms in one small bowl; in the other, more mushrooms and a sous-vide egg yolk over a sesame-chile crunch. Day can plate gorgeous main courses, like roasted duck breast and a confit of duck thigh with beets several different ways and a cocoa gastrique, but he can also floor you with smaller bites like that mushroom consommé or a German-style cabbage pancake with hackleback caviar and green-goddess dressing or even just an amuse bouche “taco” of beets in a pecan tuile. If that ballyhooed plan to transform Augusta into the Napa of the Midwest never comes to fruition, you still have every reason to visit to experience one of the area’s best and most exciting chefs. Last year: No. 21 5525 Walnut Street, Augusta 636-544-1009;rootfoodwine.com Dinner Thursday-Saturday, lunch Saturday (closed Sunday-Wednesday) $$$-$$$$ Herb sorbet with lemon milk crumb from the Lucky Accomplice **13. The Lucky Accomplice** Logan Ely is one of St. Louis’ best chefs and also one of its most restless. For 2024, I caught the Lucky Accomplice a few months after Ely and chef de cuisine Justin Bell had sidelined the a-la-carte format the restaurant had used since its September 2020 debut in favor of a tasting menu — an ambitious approach anywhere, but downright daunting in post-pandemic St. Louis dining. On the other hand, if anyone can pull off a tasting menu, it’s Ely, who won acclaim (including a No. 2 ranking in the 2020 edition of this list) at his late restaurant Shift. My tasting-menu dinner at the Lucky Accomplice didn’t reach those heights, but its highlights showed the combination of inspired techniques, striking plating and unexpected star ingredients that is the hallmark of Ely’s cooking: fermented wheat berries with chicken skin, maitake mushrooms and Parmesan and deeply charred carrots with grapefruit in duck jus, both of which delivered more swaggering umami than the ostensible showstopper, beef short rib with black garlic. Since then, the Lucky Accomplice has brought back it’s a-la-carte options alongside the tasting menu, offering two different, equally compelling reasons to visit. Last year: No. 9 2501 South Jefferson Avenue 314-354-6100;theluckyaccomplice.com Dinner Thursday-Saturday (closed Sunday-Wednesday) $$$-$$$$ Cavatelli at Sidney Street Café **14. Sidney Street Cafe** One of the unfortunate realities of even upscale dining these days is the absence of noteworthy desserts. Credit Benton Park institution Sidney Street Cafe for still trusting the final course to an actual pastry chef, and credit pastry chef Amelia Lytle for the spectacular dessert that ended my dinner at Sidney Street this March. This was ostensibly an apricot cheesecake, but the bartender and fellow diners at the bar persuaded me to order the dessert because it included foie gras. The foie-gras torchon practically melted into the cheesecake, elevating its richness and sweetness into decadence. The focus from the beignets at the beginning of your meal through dessert at the end shouldn’t be surprising at Kevin Nashan’s flagship, which continues in its groove of old-school touches amid a contemporary sensibility. You can build dinner from a-la-carte main courses and sides, or you can trust the kitchen to subtly enrich hamachi crudo with avocado crema or pair duck breast with a maple syrup jus. Last year: No. 13 2000 Sidney Street 314-771-5777;sidneystreetcafestl.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$-$$$$ A wagyu beef Tavern Burger with Prairie Breeze cheddar at Wright's Tavern **15. Wright’s Tavern** My research for this year’s STL 100 included numerous visits to steakhouses and other old-school restaurants, all of which simply affirmed the magnificence of what owner Matt McGuire, chef Cary McDowell and their team have accomplished at Wright’s Tavern. A nearly impossible reservation since its late 2022 debut, Wright’s doesn’t reinvent the classic American steakhouse, but it takes pains to get it right. That means excellent beef properly seasoned, gorgeously browned and cooked to your desired temperature — none of those steps a given, my aforementioned research proved — and generous portions of the best fries and the best onion rings in town. Take away the steaks, and Wright’s remains a top-tier restaurant thanks to a seafood lineup like the glory days of Pujols-Rolen-Edmonds: sweet oysters, sizzling shrimp scampi and a crab cake to sway this jaded Baltimorean’s heart. Last year: No. 18 7624 Wydown Boulevard, Clayton 314-390-1466;wrightswydown.com Dinner Monday-Saturday (closed Sunday) $$$$ Ceviche Classico at Jalea **16. Jalea** The 2023 edition of the STL 100 celebrated Jalea as 2022’s standout debut, ranking the Peruvian restaurant on St. Charles historic Main Street No. 20. Last year’s list also found Jalea’s chef and owner Andrew Cisneros busy consulting on other restaurateurs’ projects. In 2024, Cisneros has focused on his own work, including one of the most exciting restaurants slated to open this year: Brasas in the Delmar Loop, which will feature Peruvian rotisserie chicken and other grilled meats. Meanwhile, Jalea returns to the Top 25 with its modern take on Peruvian fare. Ceviche is the must-order here, thanks to the electrifying leche de tigre marinade that “cooks” the seafood. The tuna tiradito version will make a run at your favorite sushi restaurant’s sashimi (and nods to Japanese cuisine’s influence on Peru). Main courses might preview the rotisserie chicken at Brasas or pair a tremendous wine-braised pork shank with the potato-peanut stew carapulcra. Last year: No. 20 323 North Main Street, St. Charles 314-303-0144;jaleaperuvianbistro.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$$ Cavolo pizza at Noto Italian Restaurant in St. Peters **17. Noto Italian Restaurant** You will (still) find the best pizza in the metro area at Noto Italian Restaurant in St. Peters — and not just because Kendele and Wayne Sieve’s Neapolitan pies, fired at 1,000 degrees in a wood-burning oven, have received the official stamp of approval from the Associazione Verace Pizza Napoletana. That stamp doesn’t hurt, but Noto had reached the summit of St. Louis pizza even before it arrived, and if it vanishes tomorrow, Noto will remain on top thanks to its puffy, tangy, gorgeously blistered crust and mad-genius creations like the Apricot and ‘Nduja pizza. Apricot jam is the base of this pie, its peak-summer sweetness ripe but not cloying. Dollops of soft, spicy ‘nduja sausage alternate with fresh, cooling ricotta cheese, while hazelnuts and gremolata provide a zippy finishing crunch. If you need even more reason to return to Noto, the Sieves have recently opened a new Italian wine bar, Bacaro, on the lower level. Last year: No. 12 5105 Westwood Drive, St. Peters 636-317-1143;notopizza.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$-$$$ A full rack of ribs with turkey and candied bacon at Beast Craft BBQ Co. **18. Beast Craft BBQ Co.** Technically, you don’t have to travel to Belleville to find the metro area’s best barbecue. Though David and Meggan Sandusky closed Beast Craft BBQ Co.’s ambitious Butcher & Block location in the Grove shortly after the publication of last year’s STL 100, they have since opened an outpost at Washington University, and they still operate Beast’s food truck. That said, to experience Beast in full, you currently must visit the original Belleville restaurant, where pitmaster David first staked his “all killer, no filler” claim. It was true when Beast debuted in 2014, and it is true now. Sandusky is unapologetic in his pursuit of barbecue perfection, from the Texas-style brisket smoked over white oak to the signature cherry-smoked pork steak. Beast is one of the very few — maybe the only — members of the barbecue-boom generation to pay proper homage to St. Louis-style snoots, and the restaurant’s sides (fries, mac and cheese with bacon, Brussels sprouts with pork belly) have never been an afterthought. That barbecue boom has ended. Long live Beast, wherever it goes next. Last year: No. 14 20 South Belt West, Belleville 618-257-9000;beastcraftbbq.com Lunch and dinner daily $-$$ Garlic Chives Gnocchi, a vegetarian dish featuring wood ear & oyster mushrooms, crispy chickpeas, sweet peas, Malaysian coconut curry. **19. Akar** The cooking at Akar spans the globe while remaining deeply personal. Only a chef and restaurateur as talented — and hungry and curious — as Bernie Lee could have created the conditions for these dishes to excel. I’m still wrapping my head around a special main course on my most recent visit, a whopping, fork-tender lamb shank in a nutty, creamy Thai massaman curry sauce garnished with tart little pops that evoked Persian cuisine. Akar can go big and bold: that lamb, duck breast with a raspberry-hoisin reduction, the signature beef short ribs. But Lee also impresses with a simple appetizer of garlicky ramen noodles without any broth, and few restaurants of this caliber offer as many options for vegetarian, vegan and gluten-free diners. Akar also boasts a nearly extinct personal touch: For reservations (highly recommended), you must call. Last year: No. 17 7641 Wydown Boulevard, Clayton 314-553-9914;akarstl.com Dinner Tuesday-Sunday (closed Monday) $$$ Whole-roasted Romanesco at Olive + Oak **20. Olive + Oak** I doubt I ever could have given a thumbnail description of Olive + Oak. I certainly can’t now, eight years and one relocation within the Old Webster district of Webster Groves (brief in distance, significant in scope) later. Chef Jesse Mendica and her team range widely and with confidence across a global palate and larder. A visit this fall found succulent braised boar, itself a notable ingredient in St. Louis' conservative post-pandemic menus, layered with black-bean puree over a fried tortilla — part of a menu that also featured goat and nods to Japanese and Korean cuisine. You can still find Olive + Oak standards like steak, oysters and the signature blue-crab gratin to be spread on toast or eaten directly from the spoon. One constant here since 2016: reservations are effectively mandatory, and depending on the day any time, a walk-in seat at the long bar counter is no sure thing. Last year: No. 8 216 West Lockwood Avenue, Webster Groves 314-736-1370;oliveandoak.oohosp.com Dinner daily $$$-$$$$ Shoyu with pork shoulder chasyu, scallions, menma, yori, a soft-boiled egg and shoyu ramen in an aromatic rendered fatback at Menya Rui **21. Menya Rui** If you were waiting for the buzz about Menya Rui to settle before you tried Steven Pursley’s ramen restaurant, where you must line up outside for one of the restaurant’s few seats, I bring bad news. In September 2023, Food & Wine magazine named Pursley one of its “Best New Chefs” nationwide. A few months later, Yelp declared Menya Rui the No. 2 restaurant in the country. The queue for a table reached new lengths. The great news is that Pursley’s ramen is more than worth the time you spend in line, and once you are seated, your dinner comes together quickly. Slurp up homemade noodles in drain-the-bowl-delicious pork shoyu, chicken shoyu or tantanmen broth, or try Pursley’s unique-to-St. Louis takes on tsukemen (dipped) and mazemen (brothless) ramen. Once you finally do partake of Menya Rui, you won’t hesitate to spread the gospel farther. Last year: No. 21 3453 Hampton Avenue 314-601-3524;menyarui.com Dinner Wednesday-Sunday (closed Monday-Tuesday) $-$$ A sushi platter for two by Taberu **22. Taberu** Set your alarm and don’t hit snooze. At 6 a.m. on the first of each month, Heidi Hamamura opens the next month’s reservation book for her unparalleled sushi-by-delivery service Taberu. Available dates quickly vanish. The fish is exceptional in flavor, knifework and presentation: a platter of tuna, salmon, shrimp, yellowtail and more nigiri in vibrant red, orange, pink and white. Hamamura excels with deft accents like the sake-kombu marinade that imbues red snapper with oceanic sweetness or the smoke that renders octopus shockingly flavorful and tender. Simple albacore tuna jolted with charred garlic is as memorable as luscious medium-fatty tuna with a dollop of brilliant lemongrass-shiso chimichurri. The Taberu experience loses nothing for being enjoyed at home. What it gains in wonder is immeasurable. Last year: Unranked Taberu, catering and delivery service instagram.com/taberu_stl $$$$ Mar i muntanya, Catalan-style roasted chicken with lobster, at Bar Moro in Clayton **23. Bar Moro** This year’s STL 100 finds chef and restaurateur Ben Poremba at an especially busy moment, even by his ambitious standards: relocating three restaurants, opening two more and completely revamping the concept of yet another. (And that doesn’t include Deli Divine, his 2023 debut.) Bar Moro, which opened in October 2022, is suddenly the veteran of Poremba’s lineup. This sleek, sexy Spanish restaurant is ready for the challenge. Impressive from the beginning, Bar Moro has grown only more confident — and delicious. That confidence is obvious in the showstopping roasted rabbit with chistorra sausage in tomato sauce, each bite fragrant with cumin and paprika. A restaurant this confident also knows a classic like pan con tomate needs nothing more complicated than perfect Don Bocarte anchovies to become a superior version of itself. Last year: Unranked 7610 Wydown Boulevard, Clayton 314-932-1088;bengelina.com/bar-moro Dinner daily $$$$ Pistachio ravioliat Pastaria **24. Pastaria, Pastaria Deli & Wine** This year, Niche Food Group will bring back its fast-casual restaurant Porano Pasta, with the first location set to open in Des Peres. Porano isn’t a direct spinoff of Gerard Craft’s Pastaria, but you can see the connections — beyond the obvious noodle strands. At Pastaria, acclaimed chef Craft learned to meet diners where they are (often with kids in tow) and only then dazzle them with his wood-fired pizzas and big plates of bucatini, tagliatelle and pappardelle. The lesson has benefited all of Niche Food Group, including Pastaria’s pandemic-born neighbor, Pastaria Deli & Wine, where the sandwiches are no less impressive for being classic combinations. Add in Craft’s experience curating top-notch restaurant vendors for the crowds at City Foundry and Citypark stadium, and Porano 2.0’s future looks almost as bright as Pastaria’s still does. Last year: No. 19 Pastaria7734 Forsyth Boulevard, Clayton314-862-6603;eatpastaria.comDinner daily$$-$$$ 7734 Forsyth Boulevard, Clayton 314-862-6603;eatpastaria.com Dinner daily $$-$$$ 7734 Forsyth Boulevard, Clayton 314-862-6603;eatpastaria.com Dinner daily $$-$$$ Pastaria Deli & Wine7734 Forsyth Boulevard, Clayton314-773-7755;pastariadeliwine.comLunch daily$ 7734 Forsyth Boulevard, Clayton 314-773-7755;pastariadeliwine.com Lunch daily $ 7734 Forsyth Boulevard, Clayton 314-773-7755;pastariadeliwine.com Lunch daily $ Bucatini alla'Amatriciana at Charlie Gitto's on the Hill **25. Charlie Gitto’s 🆕** I would feel like an idiot for excluding Charlie Gitto’s from the STL 100 until now if I had eaten nothing more than its bucatini all’Amatriciana last year. Here is this iconic Hill restaurant in one dish, generous in serving and spirit, as alluringly simple as pasta in a summery San Marzano tomato sauce with quivering hunks of luscious guanciale. This experience — let's call it joy — repeated itself during my overdue visits to Gitto’s, whether I was snacking on toasted ravioli (the supposed original of the species) or tackling the brontosaurus chop of the bone-in veal Parmesan. You could pick any dish to explain why chef Charlie Gitto Jr. continues to draw a full house in his restaurant’s 43rd year. If the bucatini all’Amatriciana weren’t my clear favorite, I might point to the humble Caprese salad, which Gitto takes pains to present in season with homegrown tomatoes. Charlie Gitto’s5226 Shaw Avenue314-772-8898;charliegittos.comDinner daily$$$-$$$$ 5226 Shaw Avenue 314-772-8898;charliegittos.com Dinner daily $$$-$$$$ 5226 Shaw Avenue 314-772-8898;charliegittos.com Dinner daily $$$-$$$$ Charlie Gitto’s, Hollywood Casino777 Casino Center, Maryland Heights314-770-7663;charliegittos.comDinner Wednesday-Sunday (closed Monday-Tuesday)$$$-$$$$ 777 Casino Center, Maryland Heights 314-770-7663;charliegittos.com Dinner Wednesday-Sunday (closed Monday-Tuesday) $$$-$$$$ 777 Casino Center, Maryland Heights 314-770-7663;charliegittos.com Dinner Wednesday-Sunday (closed Monday-Tuesday) $$$-$$$$ Listed alphabetically A pizza cooks in the oven at 1929 Pizza & Wine. **1929 Pizza & Wine 🆕** UPDATE:1929 Pizza & Wine relocated in October 2024 from Wood River to 921 Arbor Vitae in Edwardsville. You know St. Louis-style pizza, of course. Amy and Matt Herren want to introduce you to Wood River-style pies. The couple tend a wood-fired oven at 1929 Pizza & Wine, which they opened in late 2022 in downtown Wood River, but their pizza isn’t Neapolitan. The naturally leavened crust is wholly their own, blistered from the hearth, with a lovely chew and a firm structure. It supports both ideal versions of pizza combinations you expect (sausage and peppers) and new creations that vanquish any skepticism (the Greens, with wilted kale and walnut pesto). 1929 Pizza & Wine creates its own microclimate beyond its signature dish, with produce the Herrens grow themselves, like the green beans that distinguished an end-of-harvest bruschetta last year. 921 Arbor Vitae, Edwardsville 618-216-2258;1929pizzaandwine.com Dinner Thursday-Saturday (closed Sunday-Wednesday) $$ The spaghetti alla chitarra at Acero **Acero** This year’s STL 100 features the long overdue first appearance of the classic Charlie Gitto’s and the debut of Madrina, which seeks to remake that classic style for the modern moment. It’s difficult for an Italian restaurant to stand out in St. Louis — which makes Acero all the more remarkable. Jim Fiala’s Maplewood restaurant has made every edition of the STL 100 since the original list in 2015, and it remains unparalleled for its take on traditional dishes like crudo, pasta all’ Amatriciana and gnocco fritto (the fabled “meat doughnuts” of fried dough layered with prosciutto di Parma) and, of course, for its signature egg raviolo. Fiala and his team prepare Acero’s main dishes with the same rigor of prime ingredients thoughtfully composed that you find at his even higher-end the Crossing, and Acero’s $58 four-course prix-fixe dinner is, as ever, an irresistible deal. 7266 Manchester Road, Maplewood 314-644-1790;acero-stl.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$-$$$$ A double cheeseburger and fries topped with Style sauce at Jack Nolen's in Soulard **AJ’s Smashed and Smoked, Jack Nolen’s 🆕** Jim Grindstaff opened the Soulard smash-burger joint Jack Nolen’s only a few months before COVID arrived. He has emerged on the far side of the pandemic with a restaurant strong enough to support a second location in Belleville — a second location with a special tempting enough to draw Jack Nolen’s regulars to the Metro East. At both Jack Nolen’s and AJ’s Smashed and Smoked, the star is the smash burger: juicy griddled patties delicious as a cheeseburger, a patty melt or the Firecracker, with pepper jack cheese, spicy ranch dressing and a jalapeño relish. Grindstaff also serves a standout specimen from another crowded field, the fried chicken sandwich, and loaded fries crisp enough to stand up to a Busch beer-cheese sauce, bacon and grilled onions. At AJ’s, he also features a Saturday special of Texas-style barbecue, including peppery, tender brisket worth seeking out on its own. AJ's Smashed and Smoked6980 West Main Street, Bellevillesmashedandsmoked.comLunch and dinner Tuesday-Saturday (closed Sunday-Monday)$ 6980 West Main Street, Belleville smashedandsmoked.com Lunch and dinner Tuesday-Saturday (closed Sunday-Monday) $ 6980 West Main Street, Belleville smashedandsmoked.com Lunch and dinner Tuesday-Saturday (closed Sunday-Monday) $ Jack Nolen’s2501 South Ninth Streetjacknolens.comLunch and dinner Tuesday-Sunday (closes at 5 p.m. Sunday, closed Monday)$ 2501 South Ninth Street jacknolens.com Lunch and dinner Tuesday-Sunday (closes at 5 p.m. Sunday, closed Monday) $ 2501 South Ninth Street jacknolens.com Lunch and dinner Tuesday-Sunday (closes at 5 p.m. Sunday, closed Monday) $ Grilled Marcho Farms lamb loin chops with mushroom chutney and potato gratin at Annie Gunn's **Annie Gunn’s, the Smokehouse Market** I have spent so much of Annie Gunn’s STL 100 presence over the years celebrating chef Lou Rook III’s cooking — understandably, given his skill with burgers and wings, steaks and sweetbreads —that I have neglected the other half of the Sehnert family’s Chesterfield landmark, the Smokehouse Market. Yes, this is a small, upscale grocery store, which isn’t this list’s typical concern, but with the same culinary acumen as the restaurant next-door, it is also one of St. Louis’ best sandwich shops. That sandwich selection would take several uninterrupted months’ worth of lunches to research. The French dip sandwich, juicy enough even before you plunk it in the accompanying, deeply savory jus, is a good place to start. Meanwhile, Annie Gunn’s is looking to the future with its striking new event-space addition, the Fáilte Room. Annie Gunn’s 16806 Chesterfield Airport Road, Chesterfield 636-532-7684;anniegunns.com Lunch and dinner Tuesday-Sunday (closed Monday) $$$-$$$$ The Smokehouse Market 16806 Chesterfield Airport Road, Chesterfield 636-532-3314;smokehousemarket.com 9-a.m.-6 p.m. Tuesday-Sunday (closed Monday) Patacones rellenos, plantain patties topped with shrimp, at Asador del Sur in Maplewood **Asador del Sur** Asador del Sur isn’t a conventional steakhouse, which is good news for conventional steakhouses in St. Louis. This nearly 4-year-old Maplewood restaurant grills a more succulent, tastier rib-eye than many stuffier restaurants, and here you can pair your steak with verdant, garlicky chimichurri. Maria Giamportone and Daniel Gonzalez’s restaurant looks to the cuisines of the married couple’s native Ecuador and Uruguay, respectively. The grill chars sweetbreads, lamb-lemongrass sausages and Uruguayan tira de asado (skinny beef short ribs) as well as rib-eyes, and the seafood selection is as appealing as the steaks. Grilled langostinos might be the seafood specialty, but don’t overlook the shrimp patacones, an appetizer that serves the tender shrimp and exceptionally fiery chiles on twice-fried plantains. 7322 Manchester Road, Maplewood 314-802-8587;asadordelsur.com Dinner daily, lunch Wednesday-Friday, brunch Saturday-Sunday (closed Tuesday) $$$-$$$$ Maizel McPhee, 2, of Richmond Heights peers into the bagel case at Bagel Union in Webster Groves. **Bagel Union 🆕** Sean Netzer and Ted Wilson, owners of STL 100 mainstay Union Loafers, began planning their Webster Groves bagel shop before the pandemic, so the January 2023 opening of Bagel Union would have been highly anticipated even if it hadn’t also kicked off St. Louis’ Year of the Bagel. As you would expect from Union Loafers’ wizards of dough, Bagel Union bakes and boils an excellent bagel, glossy and chewy, delicious with or without a schmear of cream cheese. Those bagels also cradle sandwiches as appealing as any at Union Loafers, including dueling salmon creations: the luscious lox of the DeLox and the chili crisp-charged kippered salmon of the Iggy. Bagel Union’s from-day-one success might not be surprising, but in St. Louis’ bagel desert, it has been more than welcome. 8705 Big Bend Boulevard, Webster Groves 314-320-7556;bagel-union.com 7 a.m.-2 p.m. Wednesday-Sunday (closed Monday-Tuesday) $ Pork steak with compressed red cabbage, German potato salad and Carolina mustard barbecue sauce at the Bellwether **The Bellwether** I feel fortunate if I encounter a worthwhile new take on a familiar dish once every couple of months. On a recent visit to the Bellwether, chef Daniel Sammons managed it twice in one dinner. He dared to highlight both the brightness and the essential beefiness of beef tartare, an appetizer, dressing it with a sharp mustard aioli and a spoon-coating, umami-laden black garlic molasses. For an entrée, he boldly doubled down on the buttery richness of seared diver scallops by pairing them with crisp chunks of pork belly trembling with fat on a bed of Champagne-splashed risotto. The Bellwether’s owners are adding the café Well Met in Shaw to their formidable portfolio (Polite Society and two Food Hall at City Foundry restaurants, Sub Division Sandwich Co. and Intergalactic), but this sleek restaurant in the former City Hospital power plant stands above them all. 1419 Carroll Street 314-380-3086;thebellwetherstl.com Dinner Tuesday-Saturday, brunch Saturday-Sunday (closed Monday) $$$-$$$$ The OG breakfast sandwich at the Biscuit Joint **The Biscuit Joint 🆕** Elliott Brown has packed a wealth of experience into the Biscuit Joint’s small Downtown West storefront. He has cooked at some of St. Louis’ best restaurants, and he has baked bread and butchered meat as well as worked the kitchen line. Brown’s experience pays off in golden-brown, buttery biscuits delicious by themselves and outstanding when smothered in gravy or sandwiching sausage and eggs. Even without Brown’s resume at hand, you know a chef who understands high-end sauces made the Biscuit Joint’s gravies: silky, fragrant with herbs (the classic sausage), strikingly spiced (roasted chicken with paprika oil) and delicious without meat (mushroom-sage). For the obligatory fried chicken biscuit sandwich, Brown pays tribute to the chicken patties of his youth with a skinny, but juicy piece of chicken sausage. As tasty as the Biscuit Joint’s biscuits are, save some room for its cinnamon roll. 2649 Washington Avenue 314-769-9434;thebiscuitjoint.com 8 a.m.-1 p.m. Tuesday-Sunday (Monday) $ Steak tartare with steamed egg yolk, crispy shallots, smoked bone marrow vinaigrette, salt and vinegar potato chips at Bistro La Floraison **Bistro La Floraison** St. Louis, name and history notwithstanding, doesn’t offer many choices for classic French fare. Take Root Hospitality, the team behind all-world Vicia, could have played it safe with Bistro La Floraison, its successor in spirit to the late, beloved Bar Les Frères and part of the Murderers’ Row on Wydown Boulevard in Clayton with fellow STL 100 honorees Akar, Bar Moro and Wright’s Tavern. Instead — unsurprisingly if you know Take Root’s work over the years — within its romantic nook, Bistro La Floraison dares to push beloved dishes further. A steamed egg yolk renders beef tartare even more luscious atop housemade salt-and-vinegar potato chips, while chicken cordon bleu goes big, delivering all the crunchy, juicy pleasure of a whole fried chicken breast with the added thrill of its bacon-Gruyère filling and a classy, meaty side of oyster mushrooms. 7637 Wydown Boulevard, Clayton 314-725-8880;bistrolafloraison.com Dinner Wednesday-Saturday, brunch Sunday (closed Monday-Tuesday) $$$-$$$$ Chicken biryani, with sides of raita and naan, at Black Salt in Chesterfield **Black Salt 🆕** I can hardly keep up with the flourishing Indian-restaurant scene in Chesterfield, but I don’t doubt that 2023 debut Black Salt is a standout among standouts. Co-owner Raj Pandey and chef Madan Chhetri have cultivated an elegant, though unstuffy ambience in their relatively compact shopping-plaza storefront. Chhetri delivers brilliant flavors and nuanced spicing across dishes from India’s many regions. He tweaks heat not simply for the sweaty capsaicin rush — though he can do that, too, if you order anything on the hot end of Black Salt’s scale — but for effects as intrinsic to each plate as the main ingredients: the dusky backbeat of rogan josh or the electric ripple through the coconut creaminess of the Andhra sea bass. So many details distinguish Black Salt that you could easily miss one of its signature dishes, an invigorating glass of fresh lime soda. 1709 Clarkson Road, Chesterfield 636-204-6441;blacksaltstl.smartorder.com Lunch and dinner Tuesday-Sunday (closed Monday) $$-$$$ Mike's Spicy Beef N' Cheddar at Blues City Deli **Blues City Deli** Blues City Deli turns 20 this year, and the line to order at Vinnie Valenza’s Benon Park sandwich shop is still likely to snake out the door and down the block. Valenza told me in an interview this January that the anniversary feels like “a dream state at times.” Blues City was a hit more or less from the get-go, and Valenza took the restaurant to another level when it began smoking its own pastrami and roasting its own beef. Blues City would be a St. Louis institution if it served only its roast beef and Italian beef sandwiches and variations like the Creole Deluxe (with roast pork, pepperoncini and Creole mayonnaise). If you have come to take Blues City Deli’s greatness for granted— like, say, a certain restaurant critic when assembling last year’s list — this anniversary is the perfect occasion to become reacquainted. 2438 McNair Avenue 314-773-8225;bluescitydeli.com 10:30 a.m.-3 p.m. Monday-Saturday (closed Sunday) $ A pulled beef sandwich and potato salad at Bolyard's Meat & Provisions **Bolyard’s Meat & Provisions** To appreciate the commitment to using the whole animal at Bolyard’s Meat & Provisions, you need to study its retail selection. Recently, I asked if a cut of beef Bolyard’s advertised online was a cut I rarely see in the area, rose meat. It was an even more obscure cut I didn’t even know, toro. The STL 100 focuses on restaurants, not butcher shops, but Bolyard’s menu also showcases its passion — and not simply because they grind beef for some of St. Louis’ best smash burgers. Beef broth is a nourishing drink seasoned with lemongrass, ginger and makrut lime. Tallow is the secret to the extraordinary fries, and the shatteringly crisp pork rinds may make you forget about those fries. The sandwiches showcase owner Chris Bolyard’s background as a top-notch chef. Even humble fried bologna gets a glow-up courtesy of chow chow, pimento cheese and hot sauce aioli. 2733 Sutton Boulevard, Maplewood 314-647-2567;bolyardsmeat.com 11 a.m.-6 p.m. Tuesday-Friday, 9 a.m.-5 p.m. Saturday, 9 a.m.-2 p.m. Sunday (closed Monday) $ Brioche avocado toast at Bowood by Niche **Bowood by Niche** The food and vibes at Bowood by Niche are so irresistible that even after the end of its excellent dinner program, its return to the STL 100 was a slam dunk. Since its fall 2021 debut, this Niche Food Group restaurant has steadily expanded the canon of great St. Louis breakfast and lunch dishes both savory and sweet: cacio e pepe scrambled eggs, eggs benedict with prosciutto, a stack of blueberry pancakes as daunting to tackle as Mount Everest, a burger to rival the patties at its sibling Brasserie by Niche. More recently, Bowood by Niche has joined the area’s pastrami renaissance with its Reuben sandwich and has found the groove between savory and sweet in a fluffy waffle subtly tangy with Vermont cheddar cheese. 4605 Olive Street 314-454-6868;bowoodbyniche.com 9 a.m.-3 p.m. daily $$ Roasted chicken with shiitake mushrooms and chicken jus at Brasserie by Niche **Brasserie by Niche** I could list any number of reasons to celebrate Brasserie by Niche, not least the Central West End restaurant’s 15 years of consistent excellence at cassoulet, onion soup and other beloved French dishes. This year, though, I must focus on the Brass Burger, a dish with enough swagger to launch the spinoff concept Brasswell at Rockwell Beer Co. in Botanical Heights — and to have made news twice this year already, first when Brasswell left Rockwell, then when Brasswell announced a pop-up at the Urban Chestnut Brewing Co. Biergarten in Grand Center. It’s a mighty burger: two patties, skinny but not smashed to oblivion, gilded with the high-low combo of Dijonnaise and American cheese, garnished with onion and pickles. If the Brass Burger looks like nothing you would find in Paris, it is further proof that Brasserie, for all its classic touches, is still uniquely St. Louis. 4580 Laclede Avenue 314-454-0600;brasseriebyniche.com Dinner daily, brunch Sunday $$$-$$$$ Sweet-and-sour pork at Cate Zone Chinese Cafe **Cate Zone Chinese Cafe, Cate Zone Chinese Cuisine** The debut of Cate Zone Chinese Cafe was a key moment in last decade’s blossoming of regional Chinese restaurants in St. Louis. Within its small University City storefront, Cate Zone focused on the fare of China’s far north, most of its dishes previously unavailable in the area. Not all of those regional Chinese restaurants have survived — RIP, Bing Bing, Famous Szechuan Pavilion and Private Kitchen — but Cate Zone has continued to pack its original home, and earlier this year it expanded to Chesterfield. The new Cate Zone Chinese Cuisine features a significantly bigger dining room. The menu follows the original, which has expanded over the years to include Sichuan and other regions. Choosing one dish is difficult at a restaurant that handles cumin lamb and Chengdu spicy chicken with such aplomb, but newcomers should start with the light, crisp sweet-and-sour pork, Cate Zone’s signature from the beginning. Cate Zone Chinese Cafe8148 Olive Boulevard, University City314-738-9923Lunch and dinner Tuesday-Sunday (closed Monday)$-$$ 8148 Olive Boulevard, University City 314-738-9923 Lunch and dinner Tuesday-Sunday (closed Monday) $-$$ 8148 Olive Boulevard, University City 314-738-9923 Lunch and dinner Tuesday-Sunday (closed Monday) $-$$ Cate Zone Chinese Cuisine24 Four Seasons Shopping Center, Chesterfield314-392-9624Lunch and dinner Tuesday-Sunday (closed Monday)$-$$ 24 Four Seasons Shopping Center, Chesterfield 314-392-9624 Lunch and dinner Tuesday-Sunday (closed Monday) $-$$ 24 Four Seasons Shopping Center, Chesterfield 314-392-9624 Lunch and dinner Tuesday-Sunday (closed Monday) $-$$ Gaeng som at Chao Baan **Chao Baan** The Prapaisilp family has relocated their beloved original Thai restaurant from Tower Grove South to Richmond Heights, streamlining its look and feel in the process. Meanwhile, Chao Baan, which they opened in 2019 in the Grove, has become an even more interesting and appealing restaurant. The debut menu brought together dishes from founders Sue and Suchin Prapsaisilp’s respective homes in the northeast and south of Thailand, like khao tod nam sod (a smashed rice cake with pork sausage) and kua kling (stir-fried ground beef with lemongrass and makrut lime). Those dishes remain available at Chao Baan, but the menu has expanded to include red and green curries, the Four Kings of Thailand and other King & I classics. On a recent visit, I tried Chao Baan’s version of khao soi, the Chiang Mai specialty of noodles in a curry broth, for the first time — and found another reason to return. 4087 Chouteau Avenue 314-925-8250;chaobaanstl.com Dinner daily (closed Tuesday) $$ Jerk chicken at Chez Ali **Chez Ali** If I ranked the 10 best individual dishes over the Food Hall at City Foundry’s first two and a half years, there is a good chance Alioun “Ali” Thiam’s West African and Afro-Caribbean restaurant would land four of the spots. Ask me to rank the top 5, and Chez Ali still probably scores two or three. Which of Thiam’s dishes would I place highest, though? I could argue for either the fork-tender (practically spoon-tender) oxtails or the smoky, peppery jerk chicken. Let’s give it to the oxtails, if barely, because your side of rice and beans is perfect for sopping up all of that braising gravy. Chicken curry and Senegalese yassa chicken round out the restaurant’s must-orders, and Chez Ali’s cafeteria-style set-up means that whichever you choose, you won’t need to wait long to devour it. Food Hall at City Foundry, 3730 Foundry Way chezali-mo.com Lunch and dinner daily $-$$ Khao soi with chicken at Chiang Mai **Chiang Mai** This Webster Groves restaurant continues to set the standard for Thai cuisine in the metro area. Dishes from Chiang Mai’s eponymous city and Thailand’s north are the go-to orders here: hung lay curry with pork, sai oua (grilled sausage) and khao soi, egg noodles in a coconut-curry broth with chicken. The kitchen lets you set your own heat level on a five-point scale, though you should err on the side of your personal limit, especially when ordering the brightly flavored larb. Since opening in 2020, Chiang Mai has expanded its menu beyond Thailand’s north to include curries red, green and yellow, among other familiar dishes, but first-time visitors should begin with the signature oven-roasted pork ribs with honey and garlic (gra dook moo). 8158 Big Bend Boulevard, Webster Groves 314-961-8889;chiangmaistl.com Lunch and dinner Tuesday-Saturday (closed Sunday-Monday) $$ Whole chickens turn on the rotisserie at Chicken Scratch at the City Foundry Food Hall **Chicken Scratch** Chicken Scratch already touts top-notch rotisserie chicken and fried chicken sandwiches (spicy or not) at its original Food Hall at City Foundry location and its Glendale brick-and-mortar location. Do owners Nate and Christine Hereford really need to muscle into the wing game, too? They do indeed — to our benefit. Thanks to Chicken Scratch’s signature dry rub, the wings are just as flavorful as those rotisserie birds, and the exterior might be even crisper. (You can also order them trashed in barbecue sauce or with both the house Scratch and hot sauces.) Fans of Chicken Scratch’s rotisserie chicken have been practicing for these wings since the beginning, grabbing every last bit of meat from the bone with fingers and teeth. Food Hall at City Foundry, 3730 Foundry Way; Lunch and dinner daily 9900 Manchester Road, Glendale; 11 a.m.-8 p.m. Monday and Thursday-Sunday (closed Tuesday-Wednesday) chxscratchstl.com $-$$ Chongqing-style fried chicken at ChiliSpot **ChiliSpot** ChiliSpot’s name notwithstanding, not every dish at this Sichuan-focused Chinese restaurant is spicy, and not every spicy dish is incendiary. The Chongqing chicken delivers a truly fearsome number of dusky red chiles with its crisp bites of fried chicken, but the dish is as much about the chiles' fragrance as the heat they impart. And while your brow will dampen, your lips and mouth will also tingle with Sichuan peppercorns — the traditional mala effect revered in this cuisine. Pair this with a simple cucumber salad to see how heat can transform a dish through brightness rather than mere punch. Another of ChiliSpot’s signature dishes, fried tofu, will impress you with its crunchy-creamy texture and the deep savoriness of its sauce, without even a whisper of heat. ChiliSpot isn’t the best Chinese restaurant in the metro area because of its heat; it’s the best because, hot or not, it doesn’t compromise. 7930 Olive Boulevard, University City 314-925-8711;instagram.com/chilispotstlouis Lunch and dinner daily (closed Wednesday) $$ An open-faced Kentucky Hot Brown Sandwich featuring house smoked turkey, bacon, fried green tomato, and cheese sauce on sourdough bread **Clara B’s Kitchen Table** The third consecutive STL 100 appearance for Clara B’s Kitchen Table finds chef Jodie Ferguson finally cooking inside her restaurant’s brick-and-mortar location at LongStory Coffee in Belleville. When I visited last year, Ferguson had moved to LongStory, but was still operating from Clara B’s original food truck. Not that location has ever mattered for her singular blend of influences from Texas, Louisiana and elsewhere in the South. I once tracked down her truck in the parking lot of a marijuana dispensary and would do so again for her signature breakfast burrito or shrimp and grits. The permanent kitchen does allow Ferguson to expand her menu, and this year I found a stunning riff on the Kentucky Hot Brown sandwich, perfect in its expected ingredients of tender, smoky turkey and silky cheese sauce, brilliant in her addition of crunchy, tart fried green tomatoes. 732 South Illinois Street, Belleville 618-416-1812;clarabs.com 9 a.m.-2 p.m. Monday-Friday, 8 a.m.-2 p.m. Saturday-Sunday (closed Tuesday) $ Three scoops of Clementine's ice scream, Buttermilk Black Berry, Kick Ass Chocolate and Gooey Butter Cake **Clementine’s Naughty & Nice Creamery** The return of one of my favorite flavors at Clementine’s Naughty & Nice Creamery—strawberry subtly accented by balsamic vinegar and white pepper—is an occasion to celebrate the return of Tamara Keefe’s ice cream parlor to the STL 100. So is a less subtle, but no less delicious strawberry ice cream tricked out with bits of gooey butter cake. So too is Clementine’s new Central West End location, a lovely, spacious dining room to sit and enjoy ice cream decadent with butterfat in an ever-changing array of flavors: the swanky duo of brown sugar and butter pecan in Grandma Marie’s Butter Brickle or the sophistication (and cookie bits) in the Italian Butter Cookie. In recent years, Keefe has also gained attention for her vegan ice cream. Don’t take my word for it. Comedian and practicing vegan Marc Maron has shouted out Clementine’s vegan offerings on his influential “WTF” podcast. Multiple area locations, including 308 North Euclid Avenue 314-858-6100;clementinescreamery.com All locations open daily $ Jerk chicken with cilantro-coconut rice, black beans and passion fruit boba at Cleveland-Heath **Cleveland-Heath** Evan and Gina Buchholz, the married duo that took over Cleveland-Heath in 2022, have put their own stamp on the downtown Edwardsville fixture — including a retro-groovy new logo — without sacrificing any of the restaurant’s charm. Here you will still find dishes that have been Cleveland-Heath highlights since the eponymous Ed Heath and Jenny Cleveland founded the restaurant in 2011, like the pork chop with jalapeño cornbread and the cherry pie for dessert. Evan Buchholz cooked here before he and his wife took over, so he knows what works. But he isn’t afraid to play with the menu, whether using, say, boba as an accent to a dish, as I discovered last year, or more subtly tweaking the smash burger with an intensely savory black-garlic aioli. Cleveland-Heath is one of a vanishing breed, a neighborhood restaurant that is also destination dining. 106 North Main Street, Edwardsville 618-307-4830;clevelandheath.com Lunch and dinner Monday-Saturday, brunch Saturday (closed Sunday) $$-$$$ A cook prepares a dosa on the grill at the Curry Club **The Curry Club** Five-year-old the Curry Club anticipated the boom in destination Indian dining in Chesterfield, and while newer restaurants might boast more expansive menus or more elegant settings — or both — no one has yet to match the Curry Club’s combination of convenience and quality. The restaurant’s small cafeteria-style counter compels frequent visits for the rotating selection of curries and other dishes and the lunch combination that gives you two of those curries with rice and naan. Made-to-order dosas are also available, and Curry Club regulars know to look out for special versions of the restaurant’s biryani and pulao as well as weekend breakfast. The Curry Club also anticipated the expanded availability of dishes from the south of India; the heat level and the spicing in general is uncompromising. 1635 Clarkson Road, Chesterfield 636-778-7777;stlcurryclub.com Lunch and dinner daily, breakfast Saturday-Sunday $ A vermicelli bowl with steak at DD Mau Vietnamese Eatery in Webster Groves **DD Mau Vietnamese Eatery** For the second time in my 18 years covering St. Louis restaurants, my search for the area’s best chicken wings has brought me to a Vietnamese restaurant. Years ago, it was a small Tower Grove South spot, since shuttered, called Linh Mi Gia. Today, it is DD Mau Vietnamese Eatery, the fast-casual restaurant chef and owner Julie Truong founded in Maryland Heights and later expanded to Webster Groves. At both locations, you can find the crackling-crunchy, exceptionally juicy Thai chile pepper wings, which don’t hold back on the chile punch. These are a “snack” on DD Mau’s menu, so feel free to order them alongside soup (beef pho or the sensational vegan lemongrass broth), banh mi or vermicelli bowl. Those main courses would earn DD Mau a spot on the STL 100 even if those wings disappeared tomorrow. (Please don’t.) While “fast-casual,” the food here is vibrant and fresh — serious cooking. 20 Allen Avenue, Suite 120, Webster Groves; 314-926-0900 11982 Dorsett Road, Maryland Heights; 314-942-2300 ddmaustl.com Lunch and dinner daily $ The Porchetta Louie sandwich with fries at Dressel's Public House **Dressel’s Public House 🆕** After a three-year pandemic hiatus, Dressel’s Public House emerged from its chrysalis in 2023 as a thoroughly refreshed version of the pub that has been a Central West End institution since 1980. Owner Ben Dressel, son of founder Jon, has added a small brewhouse to Dressel’s basement, among other structural and cosmetic changes, and he has returned the menu to its roots, albeit with a contemporary gloss. The fish in the fish in chips is sustainable haddock in a crunchy beer-batter jacket, and the burger is now a double-patty riff on the Big Mac. No updates are required for the signature rarebit with potato chips or an oversized pretzel, nor for the Porchetta Louie’s brilliant St. Louis take on Philadelphia’s roast pork sandwich. 419 North Euclid Avenue 314-361-1060;dresselspublichouse.com Dinner Tuesday-Sunday, lunch Friday-Sunday (closes at 6 p.m. Sunday, closed Monday) $$ Torta carnitas at El Toluco Taqueria & Grocery **El Toluco Taqueria & Grocery** You won’t find birria tacos at El Toluco Taqueria & Grocery. This is a relief, frankly. I love birria, but the dish has soaked up so much oxygen at taquerias and Mexican restaurants more broadly over the past few years that you sometimes need the reminder that there is a vast universe of other tacos out there. You can find many of them under the roof of Maggie and Fausto Pizarro’s small restaurant and grocery store, where seven years after I first reviewed it, I know better than to ask the secret behind the exceptional al pastor pork with pineapples. (You can guess there is probably citrus, vinegar and a generous dose of garlic in the recipe, though.) The al pastor might not even be the best taco here if the tender lamb barbacoa is available, and El Toluco is as deservedly renowned for its monster tortas as for its tacos. 14234 Manchester Road, Manchester 636-686-5444;eltolucotaqueria.com 10:30 a.m.-3 p.m. Tuesday-Thursday, 10:30 a.m.-7 p.m. Friday, 10:30 a.m.-3 p.m. Saturday (restaurant closed Sunday-Monday, store hours vary) $ Ozark Forest Roasted Mushroom Salad at Farmhaus **Farmhaus** Farmhaus returns to the STL 100 after its departure from the list last year. When I returned to Kevin Willmann’s Lindenwood Park restaurant during my research for the 2024 edition, I found an energy and precision to the cooking that harkened back to Farmhaus’ early days — qualities that had been only intermittent in more recent years. The restaurant’s format hasn’t changed, with often-changing a-la-carte and chef’s tasting menus from Willmann and his top lieutenant, Dillon Witte. The tasting menu when I ordered it in February moved with confidence from a firecracker amuse bouche of grapefruit and lardo to a palate-tickling citrus tarte for dessert. Along the way, Willmann paired his signature ingredient, Florida red snapper, with one of his signature dishes, spoonbread, in a silken serrano anglaise sauce. The bold duo of a soubise and a black-truffle bordelaise further enriched flatiron steak (and Ozark French horn mushrooms that were nearly as meaty). I was thrilled with my entire meal — and happy to be back in the restaurant of one of St. Louis’ most acclaimed chefs of the past 20 years. 3257 Ivanhoe Avenue 314-647-3800;farmhausrestaurant.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$$-$$$$ The Kamayan Box from the Fattened Caf **The Fattened Caf** If you pay attention to barbecue, you pay attention to Texas, which has emerged as the dominant style of the 21st century’s smoked-meat obsession. Central Texas-style brisket is still that state’s most famous dish, but in recent years, you are just as likely to meet ‘cue aficionados raving about barbecue influenced by the pitmaster’s Ethiopian or Vietnamese heritage. While the conventional barbecue boom in St. Louis has petered out — in no small part due to conformity — Fattened Caf owners Charlene and Darren Young have dared to introduce a wholly new approach to smoking meat, fusing traditional American barbecue with Charlene’s Filipino background. The restaurant’s Pinoy Pork Steak is one of the few truly new takes on specifically St. Louis barbecue I’ve encountered, and the Fattened Caf is the unquestioned champion of smoked sausage thanks to its longanisa, both spicy and subtly sweet, like all great barbecue should be. 3405 S. Jefferson (Has moved from Earthbound Beer on Cherokee Street) thefattenedcaf.com 10 a.m.-3 p.m. Monday to Saturday, 5:30-9 p.m. Friday and Saturday $ Chicken gangjeong at Fire Chicken **Fire Chicken** Overland is the epicenter of must-visit takeout-only Korean dining. Yes, the category is niche, but it’s no less essential for that. Unlike Sides of Seoul, its fellow to-go STL 100 honoree a quarter of a mile east on Page Avenue, Fire Chicken is a destination for one dish, the spicy chicken gangjeong that inspired the restaurant’s name. Owners Michelle and Sungmin Baik do offer variety, though. The heat level of the chicken gangjeong’s sauce ranges from Fire to Red to no-fooling Buldak (the most recent time I ordered this, Michelle made sure that was really what I wanted), and there is a mild teriyaki version, to boot, as well as a shrimp version of gangjeong and a few other dishes. The chicken remains crisp within that sauce, but you can hardly resist opening your takeout as soon as you exit Fire Chicken’s small building. 10200 Page Avenue, Overland 314-551-2123;facebook.com/firechickenstl Lunch and dinner Monday-Saturday (closed Sunday) $ A double cheeseburger with house-cut fries at Fleur STL **Fleur STL** A year and a half after replacing the famed, occasionally infamous Eat-Rite Diner, Fleur STL has made this tiny building just south of downtown its own. Chef and owner Tim Eagan Jr. moves deftly in the galley kitchen, which affords him just enough room to turn 360 degrees where he stands. He flips patties for Fleur’s burger, holds those cheese-slicked patties at temperature while he toasts the bun halves, then puts everything together and — Fleur’s signature move — sticks a steak knife through the center of the stack. At some point, Eagan also manages to cook and season your side of fries and prepare another diner’s seasonal eggs benedict with crab cakes. Eagan and his small staff seem to know half of the dining room by name, and once you’ve sampled the compact menu, you’ll want to be a regular, too. 622 Chouteau Avenue fleurstlfoodgroup.com 9 a.m.-3 p.m. Thursday-Sunday (closed Monday-Wednesday) $-$$ Supreme pizza at Fordo's Killer Pizza **Fordo’s Killer Pizza** The grilled cheese & tomato pizza, a special at Fordo’s Killer Pizza at the beginning of the year, wasn’t the most visually striking creation from this Food Hall at City Foundry restaurant — which makes the pie’s wizardry all the more impressive. Put it another way: How often is the sauce the most exciting part of a pizza? Executive chef Joe Luckey began with a spicy tomato bisque as its base, and this replicated the velvety creaminess of a great tomato soup without turning the wood-fired pizza itself soupy. The sauce stood out even under its gooey blanket of American, Parmesan and fontina cheeses and its accents of garlic, basil and — the unexpected, but brilliant finishing touch — brown butter. Luckey is yet another example of one of the hallmarks of Gerard Craft’s Niche Food Group, placing talented young chefs in positions to thrive. Food Hall at City Foundry, 3730 Foundry Way fordospizza.com Lunch and dinner daily $$ The hot salami sandwich from Gioia's **Gioia’s Deli** Once again this year, the STL 100 welcomes a new location for Gioia’s Deli. In May 2023, Gioia’s opened a storefront near the bustling Highway 141-Interstate 44 interchange in Valley Park, which joins the venerable Hill original, the Creve Coeur outpost and the Maryland Heights walkup window. The signature hot salami is just as meaty or tender in Valley Park, just as likely to meld with your sandwich’s garlic-cheese bread into the ultimate pork-carb hybrid. Owners Alex and Amanda Donley have expanded Gioia’s aggressively (don’t forget the pandemic-launched line of frozen pizzas) but have focused on delivering a consistent product and experience. This makes for even smarter business than you might think, given the trends in diner preferences for value, convenience and familiar names. 1934 Macklind Avenue; 314-776-9410; 10 a.m.-4 p.m. Monday-Saturday (closed Sunday) 623 North New Ballas Road, Creve Coeur ; 14-776-9410; 10 a.m.-4 p.m. Monday-Saturday (closed Sunday) 11855 Adie Road, Maryland Heights; 314-776-9410; 10 a.m.-2 p.m. Monday-Friday (closed Saturday-Sunday) 922 Meramec Station Road, Valley Park; 314-776-9410; 10 a.m.-4 p.m. Monday-Saturday (closed Sunday) gioiasdeli.com $ Kebab plates at Golden Chicken **Golden Chicken, Mazaj Mediterranean** Three years after Amjed Abdeljabbar and his uncle Mahmoud Abualizz opened now three-time STL 100 honoree Golden Chicken in St. Peters, they have brought their spit-roasted magic to the Food Hall at City Foundry with Mazaj Mediterranean. Chicken shawarma takes the starring role at the duo’s new venture, where a generous portion of juicy, golden-brown meat is wrapped with crisp pickles and garlic sauce. The kebabs — chicken, beef and kefta (lamb and beef) — will tempt you from the vertical shawarma spit. The mixed grill featuring all three styles is a solid value. Not every dish has taken the journey from St. Peters, though. You still must visit Golden Chicken for beef shawarma and, especially gorgeous, citrus-kissed rotisserie chicken, the dish that put the restaurant on the map. Golden Chicken632 Jungermann Road, St. Peters636-244-3031; goldenchickenstpeters.coLunch and dinner daily (closed Thursday)$-$$ 632 Jungermann Road, St. Peters 636-244-3031; goldenchickenstpeters.co Lunch and dinner daily (closed Thursday) $-$$ 632 Jungermann Road, St. Peters 636-244-3031; goldenchickenstpeters.co Lunch and dinner daily (closed Thursday) $-$$ Mazaj Mediterraneanthe Food Hall at City Foundry, 3730 Foundry Waycityfoundrystl.com/directory/mazaj-mediterraneanLunch and dinner daily$-$$ the Food Hall at City Foundry, 3730 Foundry Way cityfoundrystl.com/directory/mazaj-mediterranean Lunch and dinner daily $-$$ the Food Hall at City Foundry, 3730 Foundry Way cityfoundrystl.com/directory/mazaj-mediterranean Lunch and dinner daily $-$$ A fried bologna sandwich from Grace Meat + Three **Grace Meat + Three** By now, you know what to expect from Rick Lewis’ Grace Meat + Three — which is more than enough when one restaurant can claim top-notch fried chicken (spicy or not, by itself or in a sandwich), fried catfish and fried bologna. You can also add the smash burger and, when it’s available on the weekend brunch menu, the Egg Rick Muffin breakfast sandwich to that honor roll. This year, though, as a longtime supporter of the Grove restaurant and even longer-time supporter of Lewis as a chef, I finally learned how best to appreciate Grace. Supplement your existing favorites with the monthly specials, where Lewis and his team stretch their talents. This September, they reminded me of Grace’s barbecue prowess with a smoked version of an Italian beef sandwich, and they whipped up an apple-butter milkshake so perfectly pitched for fall and winter, it could have stayed on the menu for months. 4270 Manchester Avenue 314-533-2700;stlgrace.com Lunch and dinner Wednesday-Sunday, brunch Saturday-Sunday $-$$ The When Pigs Fly at the Gramophone **The Gramophone** I have found a new reason to love the Gramophone. New for me, that is. In last year’s STL 100, I mentioned that being a dad with young kids, I could only imagine what the Grove sandwich shop and bar’s night business is like. This summer, able to escape from the house for an actual concert and desperate for dinner after 11 p.m. — always a challenge in St. Louis — I ordered dinner from the Gramophone online, drove back to the city from far out in the ‘burbs, and was eating a terrific sandwich by midnight or thereabouts. The Gramophone offers any number of specific sandwiches to highlight, from cold cuts to cold-smoked salmon to house-roasted meats, from chicken Parm (the Chicka Chicka Parm Parm) to pulled pork (When Pigs Fly), but an underappreciated, unsexy aspect of the restaurant’s success is its consistency. Whatever volume the Gramophone is doing, and I’ve never seen it not busy, the quality of my sandwiches never diminishes. 4243 Manchester Avenue 314-531-5700;gramophonestl.com Lunch and dinner Tuesday-Sunday (closed Monday) $ The Cuban sandwich at Havana's Cuisine **Havana’s Cuisine** More of St. Louis’ acclaimed chefs should open downtown. I will save further thoughts on that subject for another time. The post-pandemic convention throngs abhor a vacuum, though, and over the past few years, the absence of Big Names has allowed several rising stars to stake their claims. Among the first was Tamara Landeiro, who turned her food truck Havana’s Cuisine into a brick-and-mortar lunch destination on Washington Avenue. Landeiro brings in bread from the famed La Segunda Central Bakery in Tampa, Florida, for her Cuban sandwiches, but her actual secret weapon is roasted pork marinated with garlic and Seville orange. The succulent result anchors the Cuban sandwich and takes center stage in pan con lechon. With its sandwiches, empanadas and black-bean soup, Havana’s Cuisine argues that downtown’s newer restaurants might really signal a changing of the guard. 1131 Washington Avenue 314-449-6771;havanascuisine.com 11 a.m.-4 p.m. Monday-Thursday, 11 a.m.-7 p.m. Friday-Saturday (closed Sunday) $ The spinach pita at J's Pitaria **J’s Pitaria** Big, bright photographs of Bosnian scenes adorn one wall of J’s Pitaria. Their colors are nearly as vivid as the flavors at Josi and Zamir Zahic’s restaurant. If you order J’s Stuffed Flatbread — ground beef, cheese and spinach stuffed inside a blistered, crisp and very lightly chewy shell roughly the size of two standard calzones — you might think your food is as big as one of those photos. J’s has expanded its menu from its original Bevo Mill days in its current South County home, but the Zahics’ spirit of abundance has been a constant. The Sarajevo-style cevapi, the beef sausages still fragrant from the grill, roll out of their cradle of somun bread. Tender spit-roasted beef and its garnishes spill from the doner kebab. Even the lahmacun, or Turkish pizza, isn’t wrapped tightly enough to contain its ground beef, tomatoes and tzatziki sauce (and more) in a mere flatbread. 91 Concord Plaza Shopping Center, south St. Louis County 314-270-8005;jspitaria.us 11 a.m.-7 p.m. Wednesday-Saturday, 11 a.m.-6 p.m. Sunday (closed Monday-Tuesday) $-$$ The Coppa pizza at Katie's Pizza & Pasta **Katie’s Pizza & Pasta Osteria** Last year, Katie Collier debuted her biggest restaurant yet at Ballpark Village. The new downtown location of Katie’s Pizza & Pasta would be impressive if it were just the dining room and patio, but here you will see the open kitchen and a separate pasta-making station as well as a retail counter for Katie’s frozen pizzas and jarred sauces. (The availability of those pandemic-pivot frozen pizzas also continues to grow.) As breathtaking as the Ballpark Village Katie’s is — especially for those of us who remember the ad hoc style of Katie’s Pizza Cafe, the restaurant she once ran with her late father, Tom Lee — and while the new location’s menu has expanded to such swanky main courses as lobster thermidor and filet mignon, the appeal remains simple: elegant, often seasonal pastas and pizzas, like charred broccolini and sweet dollops of buffalo ricotta over a silky tomato-buffalo ricotta spread. 9568 Manchester Road, Rock Hill; 314-942-6555 14171 Clayton Road, Town and Country; 636-220-3238 751 Clark Avenue; 314-942-2416 katiespizzandpasta.com Lunch and dinner daily, brunch Saturday-Sunday $$$-$$$$ Goat biryani at Khanna's Desi Vibes in Chesterfield **Khanna’s Desi Vibes** Khanna's Desi Vibes will permanently close after lunch service April 30. Stop the presses! Khanna’s Desi Vibes, one of the standout examples in Chesterfield’s buzzing Indian-dining scene, has added a buffet to its lunch repertoire. The buffet is modestly sized, and those of you who have already fallen for Pravin Khanna’s restaurant know the full menu features more great dishes than any buffet could hold. Still, whatever brings more diners into Khanna’s is fine by me. Once here, you will discover a kitchen that finely calibrates spice and heat for such signature dishes as chicken curry, Amritsari chole (chickpea curry) and smoky, creamy tandoori chicken malai. The expansive menu also makes room for chaat, Indo-Chinese dishes and its own take on Indian fusion cuisine, drawn from Khanna’s travels, with pizza, tacos, wings and fries. 13724 Olive Boulevard, Chesterfield 314-392-9348;desivibesstl.com Lunch and dinner daily (closed Wednesday) $$ The dining room at Kreis' Steakhouse & Bar in Frontenac **Kreis’ Steakhouse & Bar** Since the STL 100 returned from its pandemic hiatus, I have expanded my year-round research to include more of St. Louis' old-school institutions, the classic steakhouses and Italian restaurants that for so many people are synonymous with special-occasion dining. That project finally brought me to Kreis’ Steakhouse & Bar in Frontenac for the 2023 list, and my research since then — and my recent return to Kreis’ — only reinforced how special this chophouse remains in its 76th year. You could argue Kreis’ belongs here for its prime rib alone: juicy, luscious and daunting even when you order the smallest queen cut. I would argue with equal passion for the peppery Colorado double lamb chops, which in true old-school fashion come with a side of mint jelly. 535 South Lindbergh Boulevard, Frontenac 314-993-0735;kreissteakhouse.com Dinner daily $$$$ Macarons at La Patisserie Chouquette **La Patisserie Chouquette** For the second consecutive year, Simone Faure’s La Patisserie Chouquette is a semifinalist for the James Beard Foundation’s “Outstanding Bakery” award. Any nod from the James Beard Awards is prestigious, but it is especially so in La Patisserie Chouquette’s case, as the Botanical Heights gem stands honored among bakeries nationwide, not just in the Midwest. I can’t speak to how Faure’s pastries and baked good compare to those other semifinalists, but La Patisserie Chouquette has been a mainstay of the STL 100 since the inaugural edition because Faure celebrates the joy in every sweet bite, from a straightforward croissant or the signature macaron (available, during the bakery’s annual National Macaron Day celebration, in a wider variety of flavors than you thought possible) to lemon tarts precariously, precisely bejeweled with blueberries and freshly whipped cream. 1626 Tower Grove Avenue 314-932-7935;simonefaure.com 9 a.m.-2 p.m. Tuesday-Friday, 9 a.m.-3 p.m. Saturday (closed Sunday-Monday) $-$$ The octopus at Le Ono **Le Ono 🆕** How best to describe Le Ono’s self-proclaimed French-Polynesian fusion cuisine? I’m going to put away the thesaurus and urge you just to go to this standout O’Fallon, Illinois, newcomer from chef Talani Mo’e and his wife, Lisa Udasco-Mo’e. Mo’e’s cooking can be elegant and playful, reverential and ridiculous, sometimes in a single dish, like pork cracklings dusted with herbs de Provence and served with a crock of Gruyère fondue for dipping. He ranges from Filipino lumpia to Korean bao to a swanky lobster version of St. Louis’ beloved crab Rangoon. His signature dish is a recurring special: meaty grouper encrusted with macadamia nuts and pineapple salsa. If this casts a shadow over Le Ono’s more conventional main courses (chicken, short ribs), it is only because here Mo’e is writing the first draft of his own, very exciting culinary language. 101 South Cherry Street, O’Fallon, Illinois leonorestaurant.com Dinner Wednesday-Saturday (closed Sunday-Tuesday) $$$-$$$$ The Lox o’ Love bagel at Lefty’s Bagels in Chesterfield **Lefty’s Bagels 🆕** Remember early pandemic bread baking? While you were Googling how to cultivate your sourdough starter, Scott “Lefty” Lefton was burning out a mixer trying to perfect his home bagel game. With his brother-in-law Doug Goldenberg on board, he sold those bagels to the public, and demand led to the 2023 debut of the brick-and-mortar Lefty’s Bagels. One bagel, by itself or with cream cheese, justifies the hype. Lefty’s bagels are properly chewy and full of your selected flavor (I’m an everything bagel partisan myself), with a hint of malty sweetness from the boiling kettle. A selection of breakfast and lunch sandwiches, including one with egg, pastrami or corned beef and a latke (the I Want It All!), rounds out the appealing menu. 13359 Olive Boulevard, Chesterfield 314-275-0959;leftysbagels.com 7 a.m.-2 p.m. Tuesday-Sunday (closed Monday) $ Grilled whole tilapia marinated with sauteed bell peppers and onions, jollof rice and plantains at Levels Nigerian Cuisine **Levels Nigerian Cuisine 🆕** You might not guess it from the sedate exterior, but Downtown West newcomer Levels Nigerian Cuisine has infused its neighborhood with a vital burst of culinary and artistic energy. On the first floor, first-time restaurateurs and married couple Ono Ikanone and Justice Johnson guide diners through the fare of Ikanone’s native Nigeria. Take the menu’s advice: Kick off your party with the Party Jollof, smoky rice cooked with tomato and the fruity, potent heat of Scotch bonnet chiles. Pairing goat with your jollof is worth the marginal upcharge, and the meat also stars alongside a bracing medley of herbs in the pepper soup. Though compact, Levels’ menu shows exceptional range, from traditional, melon-seed based egusi soup to a whole grilled tilapia. On its second floor, Levels becomes a gallery of African and African-inspired art curated by Ikanone and Johnson. 1405 Washington Avenue 314-571-9990;levelsstl.com Dinner Wednesday-Saturday, lunch Wednesday-Friday, brunch Sunday (closed Monday-Tuesday) $$-$$$ Dumplings with beef filling at Lona's Lil Eats **Lona’s Lil Eats** Lona’s Lil Eats has transcended the counter-service category since its debut 10 years ago, and it’s one of the dwindling number of restaurants to make every edition of the STL 100 since the inaugural list in 2015. Still, without deviating from its core menu, Lona’s has retained the capacity to surprise. Most recently, I tried a new (to me) take on the dumplings that have been chef Lona Luo’s signature dish since she was a vendor at Soulard Farmers Market, as plump and pan-crispy as ever, but now stuffed with pastrami, Napa cabbage and bok choy. Then again, if you know Lona’s smokes a mean beef brisket, it won’t shock you to learn the restaurant’s pastrami can hold its own against anyone else’s. Still, after a decade of dumplings, rice paper wraps with brisket or lemongrass turkey and the Hill Tribe Soup, I appreciated the reminder of Lona’s unparalleled range. 2199 California Avenue 314-925-8938;lonaslileats.com Lunch and dinner Tuesday-Saturday (closed Sunday-Monday) $ Ahi tuna and foie gras crostini at Madrina **Madrina 🆕** Call it the Wright’s Tavern theory of restaurant design: Take a beloved, but tired style of dining and invigorate it with finesse and tremendous steaks. Madrina, a new joint venture from the owners of nearby Robust Bistro & Wine Bar and the Parkmoor Drive-In, applies this idea to the Sinatra tunes and (synthetic) leather booths of the old-school Italian restaurant. Chef Max Crask can deliver an outstanding take on classic chicken marsala and a real-deal carbonara sauce (eggs yes, peas no). He can also bring you up to the moment with an audacious appetizer of tuna crudo over foie gras mousse on toast. Madrina’s tremendous steaks include a “three-finger-thick” porterhouse for two for $175, but the 12-ounce prime ribeye is deliriously overwhelming enough for one. 101 West Lockwood Avenue, Webster Groves 314-963-1976;madrinastl.com Dinner daily $$$$ Stir-fried lamb at Mai Lee **Mai Lee** Of its many distinctions, Mai Lee holds one that is particular to me — though I bet something similar is true for more than a few of you as well. I can’t think of a restaurant I’ve visited more times in the 21 years I’ve lived in St. Louis, where so much of the menu remains for me to explore. The menu at the Tran family’s Brentwood institution numbers some 200 Vietnamese dishes, plus several more pages of the Chinese fare that Lee Tran has served since she first opened her restaurant’s original location nearly 40 years ago. I can’t resist favorites from spring rolls and pho to deeper cuts like truu xao xa ot, lamb stir-fried with chiles and lemongrass, knowing I have yet to dig into, say, the selection of firepot soups, and unable to remember when I last ordered the deliriously spicy bun bo Hue instead of the signature, warmly spiced pho. 8396 Musick Memorial Drive, Brentwood 314-645-2835;maileestl.com Lunch and dinner Tuesday-Sunday (closed Monday) $$ Arrachera Calavera at Malinche Mexican Culinary Experience **Malinche Mexican Culinary Experience** Ellisville gem Malinche Mexican Culinary Experience has given itself a makeover for 2024, with millennial-pink accents and a pinkish-purplish glow. Malinche’s approach to Mexican cuisine has not changed, with Angel Jiminez-Gutiérrez and his mother, María Gutiérrez Molina, and their team presenting beautifully composed dishes that can put a delicious, personal spin even on such overexposed fare as quesabirria. This year, I want to highlight the taco-only menu that Malinche features on Monday and Tuesday. Though these tacos are scaled down in size from the restaurant’s standard dishes, each one bursts with the same brilliant flavors and thoughtful accents, from the dusky guajillo chile spice of the El de Chicharron to the hibiscus-led El Vegano to a smoky, spicy chipotle note to the ground beef in the El Gringo. As on the regular menu, the highlight is Del Trompo, a tribute to and top-notch example of the pork-pineapple al pastor taco. 15939 Manchester Road, Ellisville 636-220-8514;malinchestl.com Dinner Monday-Saturday (closed Sunday) $$ A jibarito at Mayo Ketchup **Mayo Ketchup** Mandy “Plantain Girl” Estrella and her partner, Bradley Payne, opened a second restaurant in 2023, Salsa Rosada, featuring Colombian and Venezuelan cuisine. Salsa Rosada is a welcome addition to Midtown — try both the Colombian- and Venezuelan-style hot dogs — but it’s no insult to Estrella’s newer venture to say her Lafayette Square restaurant Mayo Ketchup set a high bar to match. Cuban, Dominican and Puerto Rican dishes are the focus of the counter-service Mayo Ketchup. Estrella’s nickname notwithstanding, pork is the star ingredient here: luscious citrus-roasted pernil served as a bowl with arroz con gandules (rice and pigeon peas); pork and ham in a classic Cuban sandwich; pork and potato sticks in the puerquito sandwich. The jibarito sandwiches pork — or steak, chicken or a vegan option — between slabs of twice-fried green plantains, bringing together Mayo Ketchup’s two essential ingredients. 2001 Park Avenue 314-696-2699;plantaingirl.com Lunch and dinner Tuesday-Sunday (closes at 4 p.m. Sunday, closed Monday) $ The Sambava, a chocolate, vanilla and hazelnut cake at Nathaniel Reid Bakery **Nathaniel Reid Bakery** By now, you know you can walk into Nathaniel Reid Bakery in Kirkwood, close your eyes and point and end up with one of the best desserts of your life, from a simple one-bite macaron to a double-chocolate brownie to share to one of the eponymous Nathaniel Reid’s signature pastries, each an intricately crafted bauble like a piece of jewelry the world’s most famous actress can only borrow for the Oscars. (You might actually point to the display case of savory sandwiches, in which case you’ll also be happy, though you’ll still want to pick out an actual dessert.) On a recent visit, though, I experienced that rarer thrill at Nathaniel Reid’s: a pastry I had never tried or even seen before, the Angelo, sophisticated even by Reid’s reckoning, with the texture of a cloud and the lingering, grown-up sweetness of hazelnut, coffee and caramel. 11243 Manchester Road, Kirkwood 314-858-1019;nrbakery.com 8 a.m.-4 p.m. Tuesday-Saturday (closed Sunday-Monday) $-$$ The rib plate at O'B Que's **O’B Que’s 🆕** The St. Louis barbecue boom might have ended, but every now and then, a new barbecue joint can kindle excitement. O’B Que’s, which opened last summer, leads with its unlikely location: adjacent to a gas station’s convenience store in Chesterfield. It benefits from the O’B in its name, the family behind Brentwood institution (and impromptu 2019 Stanley Cup celebration site) O’B Clark’s. The key, though, is co-owner and pitmaster John Maness, who boasts more than 30 years of experience at the iconic Salt Lick BBQ in Driftwood, Texas. Yes, there is brisket, smoked over post oak and a bit of cherry wood. At its best, this ranks with the best Texas-style brisket in the metro area. The burnt ends might be even better, and O’B Que’s is no slouch with pork ribs, pulled pork or turkey, either. 158 Long Road, Chesterfield 636-778-9675;obques.com 10:30 a.m.-7 p.m. Monday-Saturday, 10:30 a.m.-5 p.m. Sunday $-$$ The \"OG\" Pepperoni pizza at O+O Pizza **O+O Pizza** I have appreciated the talent of chef Mike Risk for the better part of two decades now, since my quest for St. Louis’ best cheesesteak led me to his version at a small Soulard deli. At O+O Pizza in Webster Groves, Risk and his team push the boundaries of what a modern, ostensibly conventional Italian restaurant can be. On a recent visit, they threaded a line from Italy to the American South via Maryland’s Chesapeake Bay, serving gnocchi in a tomato-cream sauce larded with smoked pork and seasoned with Old Bay. O+O Pizza doesn’t stint on more straightforward fare, either, from a simple, beautiful piece of grilled swordfish to such house signatures as toasted ravioli and pizza. And for those intrigued by Risk’s cheesesteak, you’ll find the modern edition, still the best in town, at O+O Pizza’s next-door sibling, the Clover and the Bee. 102 West Lockwood Avenue, Webster Groves 314-721-5422;oandopizza.oohosp.com Dinner daily $$$ The gumbo at Parkmoor Drive-In **The Parkmoor Drive-In** A family-friendly restaurant that appeals to kids and adults alike is a rare specimen. Even more so, to get personal, when you are a restaurant critic, but your children are picky eaters. The Parkmoor Drive-In gets my professional and parental thumbs up, even when I succumb to my kids’ demand for sno-balls for dessert and await the inevitable sugar rush. Veteran restaurateur Frank Romano and his wife, Laura Burns, rebooted the classic Parkmoor Drive-In concept but have made the menu their own, from griddled burgers and onion rings to less obvious standouts, like the Turkey Club Melt with tender turkey smoked in house, guacamole and chipotle mayo. The Parkmoor has remained dialed in over the past year even as Romano and Burns have worked to debut the upscale Italian restaurant Madrina up the street. 220 West Lockwood Avenue, Webster Groves 314-938-5554;theparkmoor.com Lunch and dinner Tuesday-Sunday, brunch Saturday-Sunday (closed Monday) $$ A burnt ends sandwich at Pappy's Smokehouse **Pappy’s Smokehouse** You can easily imagine a St. Louis with a dozen locations of Pappy’s Smokehouse, if not more. The restaurant that sparked the area’s barbecue boom in earnest — and has now outlasted that boom — has kept itself relatively contained. There are only two locations, and the St. Peters spinoff of the Midtown original was a long time coming. I might as well count the larger Pappy’s Smokehouse “family” as one unit, adding Bogart’s Smokehouse in Soulard and Dalie’s Smokehouse in Valley Park, each a worthy, distinct barbecue joint in its own right. That’s still just four restaurants. John Matthews, who co-founded and operates Pappy’s, focuses on the barbecue, still among the area’s best 16 years later. The pork ribs themselves demand return visits, and while you’re there, you should order the pulled pork, turkey and tender burnt ends, too. 3106 Olive Street; 314-535-4340; 11 a.m.-4 p.m. Monday, Wednesday and Sunday, 11 a.m.-6 p.m. Thursday-Friday, 11 a.m.-7 p.m. Saturday (closes early if sold out, closed Tuesday) 5246 North Service Road, St. Peters; 636-244-5400; 11 a.m.-8 p.m. Wednesday-Saturday, 11 a.m.-6 p.m. Sunday (closes early if sold out, closed Monday-Tuesday) pappyssmokehouse.com $-$$ Shrimp diavolo at Paul Manno's Restaurant **Paul Manno’s Restaurant** A trip through the time portal from the unassuming shopping-plaza storefront of Paul Manno’s Restaurant into its perpetually packed Sinatra shrine of a dining room might not persuade you to dress up for dinner — some lost causes are truly gone forever — but you’ll feel compelled to go big even before you open the menu. Lamb chops drunk on oregano lead the main courses, and the only dish that might tempt you astray is the stonking bone-in veal chop smothered with melted fontina cheese. Paul Manno’s doesn’t stint on its (relatively) affordably priced dishes: chicken Parmigiana sprawls across your plate beneath a heart-shaped blanket of blistered mozzarella and Parmesan, and even a simple scampi appetizer sets two plump shrimp in a lemony, buttery sauce popping with capers. Paul Manno Jr., leading the restaurant his parents founded, runs a time machine to when restaurants put the diner’s pleasure first. 75 Forum Shopping Center, Chesterfield 314-878-1274;paulmannos.com Dinner Monday-Saturday (closed Sunday) $$$-$$$$ Pizzas bake in a wood-fired oven at Pie Hard Pizzeria in Waterloo. **Pie Hard Pizzeria** Pie Hard Pizzeria will convert the doubters. If you don’t believe in putting pineapple on pizza, try the Island here. Chef Michael Pastor inverts the classic sweet-savory formula by pickling the pineapple and candying the bacon. Jalapeño jolts the whole pie. Or, if you’re a buffalo-chicken pizz skeptic, as I tend to be, consider the Buffy Summers: a buffalo sauce with enough garlic kick to slay any vampires, tender chicken, that pickled pineapple again, blobs of fresh mozzarella and cooling buttermilk ranch. Pastor and his wife, Megan, converted their food truck into a brick-and-mortar storefront not much bigger than a food truck. So long as there is room for the wood-fired hearth, where Pastor blisters his tangy dough at not-quite-Neapolitan temperatures, Pie Hard will gather true believers. 122 West Mill Street, Waterloo 618-939-4273;piehardpizza.com Lunch and dinner Tuesday-Saturday, brunch Sunday (closed Monday) $-$$ Pint Size Bakery's Chocolate Creme Pie **Pint Size Bakery** St. Louis might never repeat last decade’s bakery supernova, when Pint Size Bakery and La Patisserie Chouquette opened within about a year of each other, followed a few years later by Nathaniel Reid Bakery. A new, post-pandemic appreciation for that period of time has brought me back to Pint Size, where Christy Augustin, Nancy Boehm and their team craft everyday indulgences both sweet and savory. If you love the oft-derided scone as much as I do, Pint-Size is the only place to be, and flavor combinations like mango-blueberry might tempt the scone-averse. Replace your greasy breakfast sandwich with Pint Size’s signature bacon-cheddar corn muffin or even the subtly sweet breakfast cookie. Augustin once described the Pint Size aesthetic to me as “punk-rock grandma.” A dozen years after the bakery opened, the music is sweeter than ever. 3133 Watson Road 314-645-7142;pintsizebakery.com 7 a.m.-2 p.m. Tuesday-Friday, 8 a.m.-2 p.m. Saturday (closed Sunday-Monday) $ Clockwise from top left: the Bonci pizza, the stracciatella pizza and the mushroom pizza at Pizzeria da Gloria **Pizzeria da Gloria** This year’s STL 100 welcomes Charlie Gitto’s, which boasts a dining room as buzzing as any in the area, but the Hill also needs new blood to thrive as a dining destination. The sushi restaurant Sado, a 2023 debut, is one example. Joe Kurowski set the template in late 2020 when he opened Pizzeria da Gloria. The combination of pizza and the Hill is a no-brainer, but Kurowski operates something different from both the old-school St. Louis Italian restaurant and the by-the-book Neapolitan pizzeria. Pizzeria da Gloria’s wood-fired oven blisters a crust that is lighter and more compact than a Neapolitan pie’s, but delicious in its own right even when minimally topped with pepperoni, sausage or just plain cheese (or even the marinara pizza, without cheese). Kurowski has already added one essential dish to the Hill’s canon, his Bonci pizza, with gossamer slices of eggplant and a potent garlic-chili oil. 2024 Marconi Avenue 314-833-3734;pizzeriadagloria.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$ The crab and porro cannoli is at Rated Test Kitchen **Rated Test Kitchen 🆕** Juwan Rice, the chef and owner of the new reservations-only tasting-menu restaurant Rated Test Kitchen downtown, was cooking professionally before he was old enough to drive or vote. Before he opened Rated, he had already founded his own catering company and appeared on Food Network’s “Guy’s Grocery Games.” He is now all of 22 years old. Rated would be wildly ambitious for a chef of any age, though. (That includes its cost: $175 per person as of now, which doesn’t include drinks.) The menu, which changes every few months, showcases a broad array of techniques and cuisines. When I visited, that included lamb dumplings, a savory cannoli with crab and leek and a riff on pho with duck. Rated is an impressive achievement, but for Rice, it is likely only the introduction. 313 North 11th Street 314-200-5866;rated-tk.com Dinner Friday-Saturday, brunch Sunday (closed Monday-Thursday) $$$$ Enchiladas Verdes at Sabroso Cocina Mexicana **Sabroso Cocina Mexicana** Sabroso Cocina Mexicana disproves the idea that the more expansive a restaurant’s menu is, the harder you should look for the couple of dishes the chef does well. Here, chef Miguel Pintor cooks everything brilliantly on a menu that ranges across Mexico. His signature, cochinita pibil, shines in multiple forms: a full plate of the citrusy slow-roasted pork, a street taco, a panucho (with a spread of refried beans atop a fried tortilla). Pintor’s tacos are an excellent bet no matter which filling you choose; if you can’t decide, go with carnitas and al pastor. Why, yes, you will find quesabirria here, too, though it shares space on the menu with the seldom-seen machete (an oversized quesadilla). Sabroso’s quirky location has prevented it from obtaining a liquor license, but Pintor and his wife and co-owner, Brandin Maddock, plan to open a second Sabroso, with liquor, in Maplewood. 11146 Old St. Charles Road, St. Ann 314-918-5037;stlsabroso.com Lunch and dinner daily $-$$ Fried jalapeño and cheddar bologna sandwich at Salt + Smoke. **Salt + Smoke** The Salt + Smoke empire keeps growing. Even the permanent closure of its Central West End location after a 2022 fire (and its Oh Hey! Barbecue spinoff at Schnucks) can’t slow down this barbecue restaurant, which added an Ellisville storefront in March and plans to expand to the beyond-bustling Interstate 55-South Lindbergh Boulevard interchange later this year. Throughout its growth founder Tom Schmidt and pitmaster and co-owner Haley Riley have maintained a focus on barbecue. Salt + Smoke was one of the first area restaurants to nail Texas-style brisket, and it remains a must-order here, alongside such other signatures as the wings, ribs and jalapeño-cheddar bologna. A less obvious key to Salt + Smoke’s success? The non-barbecue offerings, like the burger, the fries and (forgive this aging restaurant critic) a tasty kale salad. 6525 Delmar Boulevard, University City; 314-727-0200 5625 Hampton Avenue; 314-727-0200 501 South Main Street, St. Charles; 314-727-0200 501 Clark Avenue; 314-727-0200 1386 Clarkson-Clayton Shopping Center, Ellisville; 314-727-0200 saltandsmokebbq.com Lunch and dinner daily $-$$ Brisket platter at Shorty's Smokehouse **Shorty’s Smokehouse** On the other side of the St. Louis barbecue boom, you once again must put in the miles to find the region’s truly great smoked meat. Consider Shorty’s Smokehouse in downtown Waterloo — not a short drive from the Missouri side of the Mississippi River or from a lot of places in the Metro East, either. Owners Anthony Hassler and Brandon Bauza repay the effort with the best Texas-style brisket in the region, smoked over hickory wood and, if you get to the restaurant in time, sliced to your order at the counter. If you are not in time, as I was on my most recent visit, you might have to settle for chopped brisket, which is merely exceptionally tender and tasty rather than life-altering. Shorty’s isn’t just a destination for brisket, with pork ribs, pulled pork and turkey (yes, even turkey) all worth the drive. 121 South Main Street, Waterloo 618-939-7665;shortyssmokehouse.com Noon-2 p.m. Monday, noon-8 p.m. Wednesday-Saturday, noon-6 p.m. out Sunday (closes early if sold out, closed Tuesday) $-$$ Kimchi jjigae, a Korean soup with tofu, pork, spicy kimchi and rice, at Sides of Seoul. **Sides of Seoul** Four years after the pandemic forced restaurants to pivot temporarily, the Overland Korean restaurant Sides of Seoul is no less appealing for sticking with its changes. The counter-service restaurant ditched its dine-in tables and operates as carryout-only, with additional retail sales of its kimchi and eponymous side dishes (spicy and sweet dried squid, marinated perilla leaves and many more banchan). And while you might no longer visit Sides of Seoul with family or friends, you’ll want to order enough dishes to feed a crowd, from snacks like kimbop to soups (kimchi jjigae or my favorite, the ox-bone broth seolleongtang) to individual meal boxes with beef bulgogi or spicy pork. My new Sides of Seoul obsession is its tteokbokki, bite-size, chewy rice cakes in a very spicy sauce gooey with melted cheese. 10084 Page Avenue, Overland 314-942-8940 Lunch and dinner Monday-Saturday (closes at 3 p.m. Thursday, closed Sunday) $ Seafood gumbo at Sister Cities Cajun **Sister Cities Cajun** “Authentic” is an adjective I try to avoid with restaurants. I’ll just say that Sister Cities chef Travis Parfait hails from Dulac, Louisiana, about 75 miles southwest of New Orleans on the Gulf Coast, and his and partner Pamela Parfait’s restaurant has been an STL 100 mainstay from its original location in Dutchtown to its current home in Marine Villa. You can draw your own conclusion — or you can just visit Sister Cities and order the seafood gumbo (“Terrebonne Parish’s best,” the menu boasts, and I can’t argue) by itself or smothering smoked chicken thighs (the Dirty Chick). Before relocating, the Parfaits called their restaurant Sister Cities Cajun and BBQ, and while they shortened the name, thankfully they did not drop their unique spin on smoked meats, including those aforementioned chicken thighs, loinback ribs and the signature dry-rubbed chicken wings. 3550 South Broadway 314-405-0447;sistercitiescajun.com Lunch and dinner Thursday-Saturday, counter service noon-6 p.m. Sunday-Monday (closed Tuesday-Wednesday) $-$$ A Spanish tortilla and greens, garnished with red pepper romesco and shaved aged gouda at Songbird **Songbird** Songbird boasts the best breakfast sandwich in St. Louis, the Combo: a fried egg, applewood-smoked bacon and aged white cheddar cheese with honey and sea salt on toasted sourdough. Songbird could make this claim before it opened its brick-and-mortar location a few years ago in Forest Park Southeast — before it was named Songbird, even — as the sandwich had been drawing long lines at the Tower Grove Farmers Market. What you might know, however, is that Songbird also makes the second-best breakfast sandwich in St. Louis, and it’s a photo finish with the Combo. The Sprouted Grain English Muffin Sandwich brackets fluffy omelet-style local eggs, a sausage patty made from Buttonwood Farm chicken, pickled red onion and a subtly brilliant brown-butter aioli between an English muffin made in house by baker Bryan Russo. The only solution? Order one sandwich for breakfast; come back to Songbird for lunch for the other. 4476 Chouteau Avenue 314-781-4344;songbirdstl.com 8 a.m.-2 p.m. daily (closed Tuesday) $ A banh mi dac biet and cheese fries at Spot House Restaurant & Bar in Florissant **Spot House Restaurant & Bar 🆕** Where else but Spot House Restaurant & Bar in Florissant can you pair a banh mi dac biet, the ultimate version of the Vietnamese cold-cut sandwich that adds an egg to its standard pickled-vegetable garnishes, with cheese fries? I guess I’ll answer that question in next year’s STL 100. If there are other winning combinations of Vietnamese cuisine and American bar-and-grill grub at Spot House, they might wait even longer because I’m still working through its Vietnamese dishes. I’m several years late to arrive here, and I tried the restaurant after a knowledgeable friend insisted I do so. Listed as “Homemade Favorites” on the restaurant’s main menu, these include banh mi, spring rolls and excellent, full-bodied bowls of pho with beef or chicken. Spot House regulars know to search among the list of specials that might include fantastic soups like bun rieu (pork and crab with vermicelli noodles) and bun bo Hue. 2 Mullanphy Gardens Shopping Center, Florissant 314-755-1500;facebook.com/spothousebar Lunch and dinner daily (closed Tuesday) $-$$ A Funfetti Queen cone at Sugarwitch. **Sugarwitch 🆕** At Sugarwitch, married duo Sophie Mendelson and Martha Bass have transformed the ice cream sandwich from a lackluster confection of ice milk and spongy cookies into an obsession-forming dessert with limitless potential. The core menu of ‘witches is appealing enough: vanilla ice cream with rainbow sprinkles and a salted brownie (the Ursula) or a sophisticated miso-brown sugar ice cream and a blondie with chocolate chips (the Tara). But Sugarwitch devotees know to check often for seasonal specials, like this winter’s better-than-breakfast combo of malted maple-French toast ice cream and chocolate-graham toffee with cinnamon-sugar breadcrumbs. Mendelson and Bass have also transformed Sugarwitch itself. After launching in St. Louis from a vintage Airstream trailer, they moved into the former Carondelet Bakery in deep south city. Sugarwitch is now a full-fledged ice cream parlor with pints to go, waffle “tacos” and other novelties, as well as a small bakery. 7726 Virginia Avenue 573-234-0042;sugarwitchic.com 3-9 p.m. Thursday-Friday, 1-9 p.m. Saturday, 1-7 p.m. Sunday (closed Monday-Wednesday) $ SweetArt Sweet Burger with kale salad **SweetArt** Trendspotters should have reserved a table at SweetArt. Reine Keis’ bakery and cafe was vegan before that was cool, and it was a chef-owned artisan bakery a few years before fellow STL 100 honorees Pint Size Bakery, La Patisserie Chouquette and Nathaniel Reid Bakery debuted. While other vegetarian and vegan burgers have entered and departed the cycle of buzz, Keis’ signature Sweet Burger has maintained its warmly spiced appeal. SweetArt has evolved over its 15 years, as any successful restaurant must. “Plant-based” is the popular descriptor now, and Keis introduced her own line of retail dessert mixes, Love + Magic. But the lesson to take from SweetArt now is that Keis does not waver from her ideals. The desserts might be elegant (a pistachio-rosewater cookie), surprisingly energizing (lemon cupcakes) or showstopping (the giant cinnamon roll), but they are always spectacular — and 100% vegan. 2203 South 39th Street 314-771-4278;sweetartstl.com 10 a.m.-6 p.m. Wednesday-Thursday, 10 a.m.-8:30 p.m. Friday-Saturday, brunch 10:30 a.m.-3:30 p.m. Sunday $ Quesabirria tacos at Tacos La Jefa **Tacos La Jefa** The birria phenomenon of a few years back is now an expectation that every Mexican restaurant will offer quesabirria tacos with a side of consommé for dipping. Which isn’t a bad thing. OK birria is still pretty good, and I’ve enjoyed a few attempts at fusion dishes like birria pizza and birria ramen. Still, three years after I first tried the birria at Tacos La Jefa, no one else has matched the complex spicing of its braised beef, and the silky, sticky body of its consommé might as well be from another reality altogether. Since the late Heriberta Amescua debuted Tacos La Jefa in the Dutchtown food incubator Urban Eats — after she had already developed a following for her backyard pop-ups — her family has expanded the restaurant’s menu without losing focus on the dish that it does better than everyone else. Urban Eats, 3301 Meramec Street facebook.com/tacoslajefaSTL 10 a.m.-4 p.m. Tuesday and Thursday-Friday, 11 a.m.-5 p.m. Saturday, 10 a.m.-3 p.m. Sunday (closed Monday and Wednesday) $ Korean crab boil from Tiny Chef **Tiny Chef** On your first few visits to Tiny Chef, you marvel at its scope: How does chef Melanie Meyer produce such consistently excellent food from her small kitchen behind a walk-up window in the pinball bar Silver Ballroom in Bevo Mill? After a while, though, you marvel instead at how Meyer has turned this limited space into a space of constant evolution. Her core menu of Korean tacos and bibimbap is appealing enough, but regulars know to look for weekly specials, from soothing, umami-laden soups to fiery Nuclear Noodles. A dish this March brought a deeply personal touch to chili crisp, which featured Korean chiles from Meyer’s biological mother in South Korea. With earthy heat and the added tingly zip of Sichuan peppercorn (and a generous topping of Pecorino-Romano cheese), it was an exceptional sauce for udon noodles and Meyer’s delightfully chewy tteokbokki (Korean rice cakes). The Silver Ballroom, 4701 Morganford Road 314-832-9223;facebook.com/tinychefstl;instagram.com/tinychefstl Dinner Monday and Friday-Sunday (closed Tuesday-Thursday) $ A roasted pork sandwich at Union Loafers **Union Loafers** Bagel Union, the bagel shop that Union Loafers owners Sean Netzer and Ted Wilson opened last year in Webster Groves, drew a line down the block for a preview pop-up before its official debut. Credit the anticipation partly to St. Louis’ hunger for good bagels from anywhere, but primarily to the reputation Union Loafers has built since 2015 for shaping dough into incredible whole loaves and the unique pizza crust that anchors the Botanical Heights restaurant’s dinner menu. A smart sandwich shop (like, say, fellow STL 100 honoree Pastaria Deli & Wine) will import Union Loafers’ hoagie rolls, which are crusty and chewy, but not so crusty and chewy they overwhelm the rest of the sandwich. Or you can skip the middle step and order one of Union Loafers’ lunch sandwiches, like tender roast beef with Gruyère, pickled peppers and the tangy, aioli-like Bistro sauce. 1629 Tower Grove Avenue 314-833-6111;unionloafers.com Dinner Tuesday-Saturday, lunch Tuesday-Saturday (closed Monday) $-$$ From left: roasted beef bone marrow mushrooms with pork belly, braised lamb shank with cheddar grits and pan-roasted king klip with beet at Veritas **Veritas** Mathis Stitt is a silent mad scientist. Even though you can watch Stitt cooking in Veritas’ open kitchen — even though you can read each dish’s improbably expansive list of ingredients on the Ellisville restaurant’s menu — you never really know what he is up to until the food arrives at your table. Recently, he reinvigorated two trends, Nashville hot chicken and chicken and waffles, by substituting Calabrian chiles for cayenne heat and showering the whole shebang with arugula, rosemary honey and lime crema. This was just an appetizer. For the main course, he employed roux-rich gumbo as a sauce for an outrageously bronzed piece of monkfish and used mussels, shrimp and hen-of-the-woods mushrooms as garnish. Like Veritas itself, which Stitt and his parents Stephanie and David Stitt run as a restaurant, wine shop and specialty grocery, the food here defies description. It just works. 15860 Fountain Plaza, Ellisville 636-227-6800;veritasgateway.com Dinner Wednesday-Saturday, brunch Saturday-Sunday (closed Monday-Tuesday, retail hours vary) $$$ A beef shawarma wrap at West Bank Street Eats **West Bank Street Eats 🆕** Update:West Bank Street Eats has closed. A new restaurant occupies its space. West Bank Street Eats, which debuted at the end of 2022 in O’Fallon, Illinois, is a counter-service shawarma restaurant with the most exciting open kitchen on either side of the Mississippi River. The shawarma itself — beef or chicken, each best in class in the metro area, though if you must choose only one, go with the charry, juicy beef — spins alluringly on vertical spits behind the counter. When you order a wrap, garnished as you like with such options as pickles, garlicky toum sauce and a fiery jalapeño-based salsa verde, your flatbread is cooked to order from fresh dough right in front of you. West Bank’s hummus, falafel and frozen mint lemonade are also worthy orders, if less theatrically displayed. 1407 West Highway 50, Suite 104, O’Fallon, Illinois 618-589-3003;instagram.com/westbankstreeteats Lunch and dinner daily $ Duck-fat truffle fries at Westchester in Chesterfield **Westchester** Two-year-old Westchester offers just about everything you could want from an upscale, locally owned restaurant circa 2024 — and more than a few things you won’t find anywhere else these days. Though tucked into a Chesterfield shopping plaza, Westchester feels like a neighborhood spot, suitable for an impromptu date night or drinks and dinner at the bar. Matthew Glickert, the chef and a co-owner, cooks with a clear point of view that favors local produce and foregrounds diners’ pleasure. An appetizer of roasted carrots sprinkled with queso fresco and pistachios and drizzled with hot honey is ready for an Instagram close-up, but too delicious to wait to eat. Glickert nods to global influences (the Korean-inspired smoked and fried pork belly), but he also nails that comfort zone of steaks, chops and old-school onion soup. 127 Chesterfield Towne Center, Chesterfield 636-778-0635;westchesterstl.com Dinner Tuesday-Saturday (closed Sunday-Monday) $$$-$$$$ After obsessing over making the 'perfect bagel' at home, Scott Lefton felt inspired to sell his New York-style bagels to the St. Louis community. With his brother-in-law Doug Goldenburg, they are making the 'bagel dream' happen. Video by Allie Schallert,aschallert@post-dispatch.com **Satisfy your cravings** With our weekly newsletter packed with the latest in everything food. Restaurant critic Author twitter Author email {{description}} Email notifications are only sent once a day, and only if there are new matching items. **Related to this story** **Top 10 things to do in St. Louis this week: Great Taste, Chain of Rocks Park and Theo Von** There's comedy galore this week with Mike Epps, Tim Meadows and Theo Von in town. Plus, the Chain of Rocks Park is opening. What are your plan… **7 St. Louis chefs and bakers named James Beard Award semifinalists** Two newcomers are on the list, which also includes 2015 award-winner Gerard Craft. An acorn doughnut filled with potato mousse at Bulrush Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Bulrush chef Rob Connoley is shown on March 9, 2023, in his highly acclaimed restaurant. Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Turnip tacos at Vicia Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Takiawase, a red snapper stew with squid, at Nobu's in University City Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The pork chop at Little Fox Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Pide (left) and cevapi at Balkan Treat Box Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Supper featuring Midwestern Prime Rib, Coconut Creamed Spinach and Mala Broccoli with a Mohaattan cocktail at the Mainlander Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The sashimi masu at Sado Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Scallops in a white mole sauce are surrounded counterclockwise by the blue crab tostada, dulce de calabaza, tostada de calabaza, kaaxil sikil and beef tongue taco from El Molino del Sureste. Post-Dispatch, Vanessa Abbitt Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Lamb Ribs at Indo Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The rib chop at the Crossing Allie Schallert, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Mushroom soup is poured table side at Root Food + Wine in Augusta December 2021. Colter Peterson Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Herb sorbet with lemon milk crumb from the Lucky Accomplice Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Cavatelli at Sidney Street Café Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A wagyu beef Tavern Burger with Prairie Breeze cheddar at Wright's Tavern Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Ceviche Classico at Jalea Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Cavolo pizza at Noto Italian Restaurant in St. Peters Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A full rack of ribs with turkey and candied bacon at Beast Craft BBQ Co. Jerry Naunheim Jr. Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Garlic Chives Gnocchi, a vegetarian dish featuring wood ear & oyster mushrooms, crispy chickpeas, sweet peas, Malaysian coconut curry. David Carson, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Whole-roasted Romanesco at Olive + Oak Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Shoyu with pork shoulder chasyu, scallions, menma, yori, a soft-boiled egg and shoyu ramen in an aromatic rendered fatback at Menya Rui Photo by Allie Schallert, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A sushi platter for two by Taberu Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Mar i muntanya, Catalan-style roasted chicken with lobster, at Bar Moro in Clayton David Carson, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Pistachio ravioliat Pastaria Vanessa Abbitt, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Bucatini alla'Amatriciana at Charlie Gitto's on the Hill Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The spaghetti alla chitarra at Acero Allie Schallert, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Grilled Marcho Farms lamb loin chops with mushroom chutney and potato gratin at Annie Gunn's Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A double cheeseburger and fries topped with Style sauce at Jack Nolen's in Soulard Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Patacones rellenos, plantain patties topped with shrimp, at Asador del Sur in Maplewood Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Maizel McPhee, 2, of Richmond Heights peers into the bagel case at Bagel Union in Webster Groves. Christian Gooden | Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Pork steak with compressed red cabbage, German potato salad and Carolina mustard barbecue sauce at the Bellwether Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The OG breakfast sandwich at the Biscuit Joint Vanessa Abbitt Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Steak tartare with steamed egg yolk, crispy shallots, smoked bone marrow vinaigrette, salt and vinegar potato chips at Bistro La Floraison David Carson, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Chicken biryani, with sides of raita and naan, at Black Salt in Chesterfield Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Mike's Spicy Beef N' Cheddar at Blues City Deli Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A pulled beef sandwich and potato salad at Bolyard's Meat & Provisions Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Brioche avocado toast at Bowood by Niche Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Roasted chicken with shiitake mushrooms and chicken jus at Brasserie by Niche Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Sweet-and-sour pork at Cate Zone Chinese Cafe Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Gaeng som at Chao Baan Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Jerk chicken at Chez Ali Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Chongqing-style fried chicken at ChiliSpot Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Khao soi with chicken at Chiang Mai Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Whole chickens turn on the rotisserie at Chicken Scratch at the City Foundry Food Hall Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A cook prepares a dosa on the grill at the Curry Club Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A vermicelli bowl with steak at DD Mau Vietnamese Eatery in Webster Groves Photo by Daniel Shular, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Porchetta Louie sandwich with fries at Dressel's Public House Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Torta carnitas at El Toluco Taqueria & Grocery Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Ozark Forest Roasted Mushroom Salad at Farmhaus Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Kamayan Box from the Fattened Caf Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Chicken gangjeong at Fire Chicken Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A double cheeseburger with house-cut fries at Fleur STL Christine Tannous, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Supreme pizza at Fordo's Killer Pizza Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The hot salami sandwich from Gioia's Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Kebab plates at Golden Chicken Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A fried bologna sandwich from Grace Meat + Three Courtesy of Grace Meat + Three Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The When Pigs Fly at the Gramophone Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Cuban sandwich at Havana's Cuisine Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The spinach pita at J's Pitaria Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Coppa pizza at Katie's Pizza & Pasta Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Goat biryani at Khanna's Desi Vibes in Chesterfield Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The dining room at Kreis' Steakhouse & Bar in Frontenac Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Macarons at La Patisserie Chouquette Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The octopus at Le Ono Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Lox o’ Love bagel at Lefty’s Bagels in Chesterfield Christine Tannous, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Grilled whole tilapia marinated with sauteed bell peppers and onions, jollof rice and plantains at Levels Nigerian Cuisine Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Dumplings with beef filling at Lona's Lil Eats Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Ahi tuna and foie gras crostini at Madrina Vanessa Abbitt, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Stir-fried lamb at Mai Lee Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Arrachera Calavera at Malinche Mexican Culinary Experience Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A jibarito at Mayo Ketchup Sid Hastings Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The Sambava, a chocolate, vanilla and hazelnut cake at Nathaniel Reid Bakery J.B. Forbes Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The rib plate at O'B Que's Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The \"OG\" Pepperoni pizza at O+O Pizza Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The gumbo at Parkmoor Drive-In Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A burnt ends sandwich at Pappy's Smokehouse Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Shrimp diavolo at Paul Manno's Restaurant Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Pizzas bake in a wood-fired oven at Pie Hard Pizzeria in Waterloo. Photo by Hillary Levin, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Pint Size Bakery's Chocolate Creme Pie Christy Augustin Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Clockwise from top left: the Bonci pizza, the stracciatella pizza and the mushroom pizza at Pizzeria da Gloria Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The crab and porro cannoli is at Rated Test Kitchen Vanessa Abbitt, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Enchiladas Verdes at Sabroso Cocina Mexicana Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Fried jalapeño and cheddar bologna sandwich at Salt + Smoke. Christian Gooden, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Brisket platter at Shorty's Smokehouse Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Kimchi jjigae, a Korean soup with tofu, pork, spicy kimchi and rice, at Sides of Seoul. Sid Hastings Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Seafood gumbo at Sister Cities Cajun Laurie Skrivan, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A Spanish tortilla and greens, garnished with red pepper romesco and shaved aged gouda at Songbird Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A banh mi dac biet and cheese fries at Spot House Restaurant & Bar in Florissant Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save SweetArt Sweet Burger with kale salad Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Quesabirria tacos at Tacos La Jefa Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Korean crab boil from Tiny Chef Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A roasted pork sandwich at Union Loafers Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save From left: roasted beef bone marrow mushrooms with pork belly, braised lamb shank with cheddar grits and pan-roasted king klip with beet at Veritas Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A beef shawarma wrap at West Bank Street Eats Christine Tannous, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Duck-fat truffle fries at Westchester in Chesterfield Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Listed alphabetically Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save An open-faced Kentucky Hot Brown Sandwich featuring house smoked turkey, bacon, fried green tomato, and cheese sauce on sourdough bread David Carson, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Three scoops of Clementine's ice scream, Buttermilk Black Berry, Kick Ass Chocolate and Gooey Butter Cake David Carson, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Jerk chicken with cilantro-coconut rice, black beans and passion fruit boba at Cleveland-Heath Photo by Ian Froeb, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A pizza cooks in the oven at 1929 Pizza & Wine. Allie Schallert, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save A Funfetti Queen cone at Sugarwitch. Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Grilled Spanish Octopus, Potato, Chickpeas, Soppressata, Calabrian from Louie in Clayton. Robert Cohen, Post-Dispatch Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Facebook Twitter Bluesky LinkedIn YouTube TikTok Pinterest Instagram Feast Magazine Ladue News STL High School Sports STL Pinch Hits Apps Archives Calendar Chats Comics & games Contests E-edition Forums Newsletters Our events Press releases Online Features Submit an event Get Healthy Advertise with us Autos Classifieds Contact us Homes Jobs Site help Subscriber services Work here Shopping Notifications Settings Get up-to-the-minute news sent straight to your device."}