{"id": 2216, "name": "The New Criterion", "domain": "newcriterion.com", "bias": "right-center", "credibility": "n/a", "reporting": "mostly-factual", "questionable": null, "url": "https://newcriterion.com/multimedia/heather-mac-donald-receives-the-new-criterions-2025-edmund-burke-award/", "title": "Heather Mac Donald Receives The New Criterions 2025 Edmund Burke Award", "content": "Current Issue Archive Dispatch TNC+ Events Subscribe Donate Gala Current Issue Archive Dispatch TNC+ Events Subscribe Donate Gala **Podcasts, videos, films, lectures,Circle exclusives & more.** **Heather Mac Donald receives The New Criterion’s 2025 Edmund Burke Award** Watch the 2025 Edmund Burke Award recipient, Heather Mac Donald, give remarks on “The clash within civilizations” atThe New Criterion’s annual gala.Read her remarksin the June issue. To view this exclusive video,become a memberofThe New Criterion’s Supporters Circle. For login details, please email[email protected]. **Subscriptions** Log In Subscribe Reader Services **Explore** Current issue Dispatch Archive TNC+ Newsletters Bookstore **Support us** Donate Gift subscription Join our Circle Become a Friend Galliard Society RSS feeds **Learn more** About Contact us Hilton Kramer Fellowship Poetry submissions Advertise Privacy policy ©2025, ALL RIGHTS RESERVED The New Criterionis published by The Foundation for Cultural Review, a501(c)(3)non-profit. Site Created byBeck&Stone Log In Subscribe Reader Services Current Issue Archive Dispatch TNC+ Subscribe Gift Subscription Donate Culture Art Poetry Music Theater Books Facebook X Instagram YouTube Soundcloud About Us Bookstore Reader Services Newsletters Subscribe Advertise Gift Subscription Donate Join Our Circle Become a Friend Galliard Society Hilton Kramer Fellowship Poetry Submissions RSS Feed Contact Us COPYRIGHT © 1982-2025ALL RIGHTS RESERVED A site byBeck&Stone **Sign into your account** Lost your password? **Become a subscriber** Enjoy unlimited access. Current subscribers mayregisterfor online access."}