{"id": 1080, "name": "Batesville Panolian", "domain": "panolian.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://panolian.com/2025/06/04/sardis-lake-fd-dedicates-engine-the-late-cam-coker-honored-for-service/", "title": "Sardis Lake Fd Dedicates Engine The Late Cam Coker Honored For Service", "content": "Home E-Edition News Sports Opinion Obituaries Panola People Crime Records Classifieds Public Notices Special Sections Home NewsEmail Newsletter Sign-up Email Newsletter Sign-up Email Newsletter Sign-up Sports Opinion Obituaries Panola People Crime Records Classifieds Public Notices E-Edition Special SectionsContests Contests Contests **Sardis Lake FD dedicates engine – The late Cam Coker honored for service** Published 9:25 am Wednesday, June 4, 2025 ByStaff reports Members of the Sardis Lake Volunteer Department recently held a solemn ceremony to dedicate a new fire engine truck to the memory of their beloved captain, the late Cam Coker. The following was read at the dedication, a testament to Coker and his loyal service through the fire department: “While words feel small compared to the legacy Cam left behind, we stand together in honor of a man whose spirit still guides this department. **Email newsletter signup** **Sign up for our daily email newsletter** Get the latest news sent to your inbox Cam served as captain of the Sardis Lake Fire Department with unwavering commitment, integrity, and compassion. He was a true leader – always the first to answer the call, to lend a helping hand or a listening ear, and to lift the spirits of those around him. Cam led not just with authority, but with heart, exemplifying what it means to be part of a family that runs toward danger when others run away. Though Cam was taken from us suddenly in 2015, his presence is felt in every corner of this department, in every act of courage and kindness, and in the strong brotherhood he cultivated. Today, as we dedicate Engine 5, we honor Cam’s legacy. This engine will carry his name and spirit on every call, reminding us and our community of the dedication, bravery, and love he gave so freely. May Engine 5 serve as a symbol of Cam’s unwavering devotion to his family, his fellow firefighters, and to the Sardis Lake community. May we carry forward his example every time answer the call.” **You Might Like** **Best ideas for removing old tree stumps** **Best ideas for removing old tree stumps** **New Heights student in flight academy – B’ville aviation program paying dividends** **New Heights student in flight academy – B’ville aviation program paying dividends** **Mayor Ferrell wins second term in close race** **Mayor Ferrell wins second term in close race** **Restaurant Inspections** **Restaurant Inspections** Friends2Follow **Friends2Follow** **Friends2Follow** Home News Sports Opinion Obituaries Classifieds Small Business Contests E-Edition Email Newsletter Sign-up Submit a News Tip Submit a Photo Engagement Announcement Wedding Announcement Public Notices About Us"}