{"id": 680, "name": "Influence Watch", "domain": "influencewatch.org", "bias": "right", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.influencewatch.org/non-profit/institute-for-political-innovation-ipi/", "title": "Institute For Political Innovation Ipi", "content": "About Us Report an Error Suggest a New Entry Listen to the weekly IW Podcast Subscribe to Our Newsletter Educational Guide Hubs People Non-profits For-profits Labor Unions Other Groups Political Parties/527 Government Agencies Movements Legislation Follow Us **InfluenceWatch** About Us Report an Error Suggest a New Entry Listen to the weekly IW Podcast Subscribe to Our Newsletter Educational Guide Hubs People Non-profits For-profits Labor Unions Other Groups Political Parties/527 Government Agencies Movements Legislation FOLLOW US **Institute for Political Innovation (IPI)** political-innovation.org/ Chicago, IL 84-5104658 501(c)(3) Revenue: $3,168,294Expenses: $2,284,357Assets: $1,653,159 Voter Advocacy Group 2021 Katherine Gehl Revenue: $2,001,573 Expenses: $2,334,965 Total Assets: $1,252,093.6 **Contact InfluenceWatch with suggested edits or tips for additional profiles.** Institute for Political Innovation Inc. (IPI) is a voter advocacy organization that promotes the implementation of ranked choice voting, the elimination of party-primary nomination elections, and the establishment of the Legislative Machinery Innovation Commission that would overhaul the current design of the legislative branch of the United States.12 Founded in 2021,3the IPI claims that the American political system suffers from “toxic levels of unhealthy competition”4due to citizens not liking their voting choices and politicians not being incentivized to solve problems.4 IPI’s founder and chair is Katherine Gehl, the former president and CEO of food manufacturing company Gehl Foods, which she sold in 2015.5 **Activities** The Institute for Political Innovation (IPI) claims that the American political system suffers from “toxic levels of unhealthy competition”4due to citizens not liking their voting choices and politicians not being incentivized to solve problems. As a solution, IPI proposes a collective “re-engineering” of U.S. elections and lawmaking system through “Final-Five Voting” and “Zero-Based Rule Making.”4 **Final-Five Voting** Final-Five Voting would replace party-primary elections with a universal ballot including all primary candidates. All voters would be allowed to vote in the new primaries. It would also introduce ranked choice voting, where voters would rank candidates in order of most to least preferred. The victor would be decided by a tabulation of which candidate received a majority of the voters. It is called “Final-Five” because the final ballots for the general election would have five different candidates to choose from, rather than two.1 **Zero-Based Rule Making** Zero-based rule making intends to replace “the bloated and outdated rules, practices, and norms of lawmaking” with a “modern approach” that would redesign the legislative branch at the local, state, and federal levels. It intends to remove many of the unwritten rules and norms in the House and Senate. It would start each budget period at “zero,” analyze the needs and costs of each function and allocate the budget accordingly. It would also create the Legislative Machinery Innovation Commission, an “independent and nonpartisan” entity that would redesign the current legislative branch of the United States. It would base its new design on the goal of making representatives “more accountable and responsive to our demands.”2 **Finances** According to its 2023 990 form, the Institute for Political Innovation (IPI) reported a revenue of $2,001,573, expenses of $2,334,965, and total assets of $1,252,093.6 According to its 2022 990 form, the IPI reported a revenue of $3,168,294, expenses of $2,284,357, and total assets of $1,653,159.7 According to its 2021 990 form, the IPI listed its total revenue at $4,208,073, total expenses at $3,802,404, and total assets at $417,684.8That same year it received grants from several non-profits including the Christian Community Foundation of Memphis and the Mid-South Inc.9and theSchwab Charitable Fund.10The IPI also appears to have a sister 501(c)(4) organization, the IPI Action Fund, which is listed under the same address as IPI.11In 2021, the IPI Action Fund received a $500,000 grant from activist non-profit funding organizationPatriot Republicfor the purpose of “structural reform.”12 **Leadership** Katherine Gehl is the founder and chairman of the Institute for Political Innovation (IPI). She is the author ofThe Politics Industrywhich she wrote withHarvardBusiness School professor Michael E. Porter. She founded the Institute to advocate for the implementation of many of the ideas put forward in the book.135Gehl has spoken at events hosted by theCato Institute, theR Street Institute, and theAmerican Enterprise Institute (AEI)where she discussed topics such as voting reform through ranked-choice voting (RCV) and multi-party elections.141516 Katherine is the former president and CEO of Gehl Foods, a Wisconsin-based food manufacturing company. In 2014, the company reported $250 million in sales.17She sold the company in 2015 and turned to political advocacy. She previously sat on the boards ofUnited America,Business for America, andNew America. She was previously the honorary co-chair of theNational Association of Nonpartisan Reformers(NANR). In 2018, Katherine co-foundedDemocracy Found, an initiative that advocates for the implementation of Final-Five Voting in Wisconsin.5 Sylvie Doppelt is the executive director of IPI as of 2024. Before joining the organization, Doppelt served as the Senior Account Executive at healthcare startup NowPow and worked for community health group Maimonides Medical Center.18 “Final-Five Voting.” The Institute for Political Innovation. Accessed February 12, 2023.https://political-innovation.org/final-five-voting/. “Zero-Based Rule Making.” The Institute for Political Innovation. Accessed February 12, 2023.https://political-innovation.org/zero-basedrulemaking/. IRS Determination Letter: INSTITUTE FOR POLITICAL INNOVATION INC. 2021. Accessed June 9, 2023. The Institute for Political Innovation. Accessed February 23, 2023.https://political-innovation.org/ “Katherine Gehl.” The Institute for Political Innovation. Accessed February 12, 2023.https://political-innovation.org/staff/katherine-gehl/. Return of Organization Exempt from Income Tax (Form 990). Institute for Political Innovation Inc. 2023. Part I.https://projects.propublica.org/nonprofits/organizations/845104658/202433209349304983/full Return of Organization Exempt from Income Tax (Form 990). Institute for Political Innovation Inc. 2022. Part I.https://projects.propublica.org/nonprofits/organizations/845104658/202303199349312605/full Return of Organization Exempt from Income Tax (Form 990). Institute for Political Innovation Inc. 2021. Part I.https://projects.propublica.org/nonprofits/organizations/845104658/202223199349311462/full Return of Organization Exempt from Income Tax (Form 990). Christian Community Foundation of Memphis and the Mid-South Inc. 2021. Schedule I.https://projects.propublica.org/nonprofits/organizations/621752885/202330589349301073/IRS990ScheduleI Return of Organization Exempt from Income Tax (Form 990). Schwab Charitable Fund. Schedule I.https://projects.propublica.org/nonprofits/organizations/311640316/202330939349300403/IRS990ScheduleI Return of Organization Exempt from Income Tax (Form 990). Institute for Political Innovation Inc. Schedule R.https://projects.propublica.org/nonprofits/organizations/845104658/202223199349311462/IRS990ScheduleR Return of Organization Exempt from Income Tax (Form 990). Patriot Republic. Schedule I.https://projects.propublica.org/nonprofits/organizations/831589303/202212759349300006/IRS990ScheduleI “Katherine Gehl.” Institute for Political Innovation, Accessed June 11, 2025.https://political-innovation.org/staff/katherine-gehl/ “The Politics Industry: How Political Innovation Can Break Partisan Gridlock and Save Our Democracy.” Cato.org, 2020.https://www.cato.org/events/politics-industry-how-political-innovation-can-break-partisan-gridlock-save-our-democracy. Bydlak, Jonathan. “Event: Exploring Electoral Innovation: Righting Electoral Dysfunction with Healthy Competition.” R Street Institute, April 21, 2021.https://www.rstreet.org/commentary/event-exploring-electoral-innovation-righting-electoral-dysfunction-with-healthy-competition/. What is final five voting? A Q&A with Katherine Gehl | American Enterprise Institute – AEI, September 1, 2021.https://www.aei.org/politics-and-public-opinion/election-qa-katherine-gehl-explains-final-five-voting/. Gehl Foods acquired by Wind Point Partners. BusinessWire, March 15, 2015. Accessed February 12, 2023.https://www.businesswire.com/news/home/20150327005095/en/Gehl-Foods-acquired-by-Wind-Point-Partners. “Sylvie Doppelt.” Institute for Political Innovation, Accessed December 12, 2024.https://political-innovation.org/staff/sylvie-doppelt/ Accounting Period:December - November Tax Exemption Received:December 1, 2021 https://political-innovation.org/ Copyright 2025 InfluenceWatch. All Rights Reserved."}