{"id": 894, "name": "Men's Health Magazine", "domain": "menshealth.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.menshealth.com/about/a29134632/about-mens-health/", "title": "About Mens Health", "content": "About Men's Health My Bookmarks MVP Exclusives Shop Health Fitness Workouts Weight Loss Entertainment Sex and Relationships Life Technology and Gear Style Nutrition Grooming Men's Health Awards Video Newsletter Follow Promotions Subscribe Other Editions Fitness Health Gear Grooming Training Lab Nutrition About Meet the Editors of Men's Health **Meet the Editors of Men's Health** With 25 print editions in 35 countries and more than 21 million readers across its social and digital platforms,Men’s Healthis the world’s largest men’s magazine brand, and the number one source of information for and about men. It’s the brand for active, successful, professional men who want greater control over their physical, mental, and emotional lives. We give men the tools they need to make their lives better through in-depth and expert-backed reporting, covering everything from fashion and grooming to health, nutrition, fitness, weight loss, as well as cutting-edge gear, the latest in entertainment, science, and more. Every month, our editors and reporters seek the advice of the most trusted, experienced, and academically affiliated authorities in health, fitness, weight loss, relationships, and more. We also keep an eye out for the latest new research in the world’s most credible, peer-reviewed academic journals, and distill it for our readers in a way that’s practical, accessible, and easy to understand. Furthermore, every story in the print edition is subjected to a rigorous fact-checking process, in which a team of researchers thoroughly vets all factual claims for accuracy. Since it launched in 1986,Men’s Healthhas been nominated for many of the publishing industry’s top honors, including 17 National Magazine Awards in the categories of personal service and general excellence. In 2017, Ad AgenamedMen’s Healthone of its Magazines of the Year. Men's Healtheditors, reporters, and licensed experts give men the tools they need to make their lives better through in-depth, service-minded journalism. From deeply-reported features to daily coverage of trends in the worlds of health and wellness, our experienced staff covers fitness, nutrition, style, grooming, technology & gear, entertainment, and more. Richard Dorment is the editor in chief ofMen’s Health, where he oversees all editorial content of the world’s largest men’s magazine across its print, web, social, and video platforms. Before joiningMen’s Healthin April 2018, he was an editor atWired(where he focused on editing features on technology, science, culture, and business) as well asEsquire, where he spent nine years editing and writing features on culture, politics, fashion, and lifestyle. He lives in New York with his wife and three children, and he does not have six-pack abs. Ben Court is an Executive Editor atMen’s Health. He has more than a decade of experience writing and editing stories about peak performance, as it relates to health, nutrition, fitness, fatherhood, weight loss, happiness, and sex and relationships. He’s a recovering soccer player and triathlete, and still enjoys yoga, cycling, running, swimming, lifting, grilling, and napping. He grew up in Kenya and currently lives in New Jersey with his wife and two kids. Kengo Tsutsumi is an executive editor atMen’s Health, focusing on digital. Previously, he worked in various roles at investigative nonprofit ProPublica and news startup Mic. He spends his time thinking about the best ways to get people quality information. He lives in Brooklyn with his three-legged dog, Frankie. Ebenezer Samuel, C.S.C.S., is the fitness director forMen's Health. He's a veteran trainer who's worked with a variety of clients, including parents, high-performing execs, and pro athletes like Terrell Owens and Bart Scott. He's created numerous video workout programs forMen's Health, including the best-sellingNew Rules of Muscle, and is a sought-after speaker who's been on numerous podcasts and spoken before the National Strength and Conditioning Association. He delivers regular workouts showcasing cutting-edge techniques on his Instagram, @ebenezersamuel23. Nojan Aminosharei is the Entertainment Director ofMen’s Healthand the Special Projects Editor ofHarper’s Bazaar. He was previously the Entertainment Director of Hearst Digital Media, and before that a Senior Editor atGQ. Raised in Vancouver, Canada, Nojan graduated from NYU with a master’s degree in magazine journalism. The late Elaine Stritch once told him, “What the f$*! kind of name is Nojan? I’m 89 years old, I don’t have time for that shit.” Rachel Epstein is the deputy editor atMen's Health. Prior to joining the brand, she held roles atMarie Claire,where she focused on writing, editing, and conceptualizingop-eds,interviews,ambitious feature packages, andhigh-profile series, as well as Coveteur, where she oversaw the site's daily editorial operations. She lives in New York City. Paul Kita is the James Beard Award-winning Food & Nutrition Editor atMen’s Health. He’s written two cookbooks:A Man, A Pan, A Plan(2017) andGuy Gourmet: Great Chefs’ Amazing Meals for a Lean & Healthy Body(2013). Paul has appeared on the Travel Channel andFox & Friends, as well as numerous national radio and broadcast stations. Marty Munson is the Health Director forMen’s Healthand has more than a decade of experience writing and editing health content for publications includingMarie Claire, Prevention, Real Simple, Triathlete, andO, the Oprah magazine. She’s a triathlon coach (USAT), a swim coach (USMS), and a marathon swimmer. Brett Williams is a Senior Editor atMen’s Health. He's a former pro football player and tech reporter who splits his workout time between strength and conditioning training, martial arts, and running. You can find his work elsewhere at Mashable, Thrillist, and other outlets. Evan Romano is the Culture Editor forMen’s Health. He previously worked atEsquire,Rolling Stone, andBrooklyn Magazine, and has written forThe New York Times,Vanity Fair, VICE, and MTV News. Evan is obsessed with weird movies, random TV shows, and can probably tell you anything you’d ever want to know about that actor in that movie. Cori Ritchey, NASM-CPT is an Associate Health & Fitness Editor atMen's Healthand a certified personal trainer and group fitness instructor. You can find more of her work in HealthCentral, Livestrong,Self, and others. Cesar Bustamante Jr. is a social media editor atMen’s Health. He’s a journalist and audience specialist who has a penchant for data crunching, storytelling, and strategy development. Prior to joiningMH, he worked at New York Daily News, City University of New York, and Crain’s New York Business. Someone once told him that he “exude(s) geeky competence” and has been adding that in his bios ever since. Jamie Prokell is the creative director forMen’s Health, where he oversees the visual direction for the print, web, social, and video platforms for the brand. He worked previously atMore Magazine,Esquire,New York Magazine, andMen’s Vogue. When he is not working he loves talking about sneakers, coffee, music, running. He can be found any given weekend in Northern New Jersey training for his next race or scouring the Internet for his next pair of sneakers. Matt Ryan is the Senior Art Director atMen’s Health, where he designs and produces visuals for the print and digital products. He previously worked for Simon & Schuster,Food Network Magazine, and Time Inc. Books. Taryn Colbert is the Digital Designer atMen’s Health. She graduated from SVA in 2021 with a BFA in Design and has previously worked with Business Insider, The Cut, andNew York Magazine’s print and digital design teams. Leanne Mattern is the Design Associate atMen’s Health, focusing on print and digital stories and content forMH’s social media. She has a BFA in Design from the School of Visual Arts. Jason is the Visual Editor atMen’s Health. He has many years of experience as a photo editor and photographer and lives in New York City. Alix Campbell is the Chief Visual Content Director at Hearst Magazines. She and her team create the visual content for the various Hearst brands, includingMen’s Health. Alix was born and raised in Park Slope, Brooklyn, where she still lives with her husband, daughter and two mini labradoodles, Jelly and Cooper. Sally Berman has worked as a photography editor since 2001. She directed, produced, and edited for music publications including XXL, Billboard, RESPECT, and Mass Appeal. She’s edited photography for book titles including DECODED by Jay Z, Beastie Boys Book, Le Freak by Nile Rodgers, The Sun & The Moon & The Rolling Stones, amongst others. Sally currently is a Visual Director at Hearst Publications and lives in Brooklyn with her husband and 2 children. Allison Chin is the Deputy Visual Director ofMen’s HealthandOprah Daily. She’s part of the team responsible for all the photos and photo shoots at the magazine. When not on set or at her desk, she enjoys a barre class and yoga. She’s also worked atHouse Beautiful,Good Housekeeping, and Prevention. Kristen Mulvihill is a Senior Visual Editor atMen’s Healthcreating content for several sections, including life, food, and health. She enjoys collaborating with photographers, stylists, and editors. Drawing, yoga, time with her family are her favorite pursuits. She lives in NYC. Ted Stafford is the Fashion Director ofMen’s Health. He oversees all style and fashion content for the brand, and also styles their fashion stories. His active lifestyle informs his passion for translating great designs into real-life style, a favorite part of his job. Prior to joiningMen’s Healthhe worked atGQmagazine and Calvin Klein. AsMen's Health's Deputy Editor, Commerce, Christian Gollayan oversees all shopping content onmenshealth.com. He relocated back to New York by way of Portland, where he was the Associate Managing Editor atTheManual.com. Christian's work has also been featured inInStyle,Food & Wine, theNew York Post, and Tatler Asia. Ryan Brower is the senior gear and commerce editor atMen’s Health, where he tests the best products in outdoor gear and tech. He has written about the outdoors for nearly two decades and was previously the managing editor of content performance atGear Patrol. He’s a Certified Beer Server and holds a third-degree black belt. He lives on the water in New Jersey with his wife and their dog. Joseph Cheatham is the Style and Commerce Editor atMen’s Health, where he covers fashion and grooming. Previously, he was an editor atSPYand has contributed stories forTravel & Leisure. Outside of writing, he enjoys spending time by the ocean, traveling, and trying out new restaurants. Charles Thorp is the Fitness and Commerce Editor atMen’s Health, where he shares the best product recommendations in gym equipment, recovery tools, supplements, and more. Following an early life in athletics, Charles became a NASM-certified trainer and began writing programs alongside the most respected coaches in the world. Since entering the world of fitness content, Charles has had the opportunity to learn from and train alongside high performance individuals from the NFL, UFC, NBA, Formula 1, CrossFit, US Olympics, and Navy SEALs. When he’s not writing about training programs or gear, he can be seen at the gym or in the wild, putting them to the test. Sean Zucker is the grooming commerce editor atMen’s Health. He brings more than half a decade of experience covering health, wellness, and lifestyle. When Sean’s not writing about hair products, you can find him running for exercise, or toward the nearest food truck. Imani Granger is the Assistant Fashion Market Editor who covers all things fashion behind the scenes. Janna Ojeda is the assistant managing editor atMen's Health. Marli Higa is the copy chief forMen’s Health,Women’s Health, and Oprah Daily, where she oversees all copy for the teams’ print and digital platforms. Before joiningWomen’s Healthin 2011, she was copy chief for the iconic design titlesI.D.andPrintand the fashion and culture brand Visionaire. She began her publishing career contributing toSelfandShapewhile also working as an AAIS sprints and hurdles coach for 14 years. Originally from Hawaii, and then a New Yorker for more than two decades, Marli now lives upstate in Millbrook, where she enjoys engaging the senior population in community-based and spiritual wellness programs and taking long rides and runs on the rail trails of Dutchess County. Connor Sears is an assistant copy editor forMen’s HealthandEsquire. He’s worked as a magazine copy editor for the past eight years in Raleigh and New York City. David Fairhurst has worked as a copy editor and fact-checker since 2002 and is currently the associate copy editor forMen’s Health,Women’s Health, and Oprah Daily. Jennifer Messimer has been the research chief of theMen’s Healthprint magazine since 2015, ensuring everything you read expert-reviewed, timely, and is factchecked with the most rigorous standards. She started her factchecking career atPrevention Magazine, and has also served as the research chief atWomen’s Health. She enjoys Excel spreadsheets, French pastries, watching old movies, hiking in Colorado, and historic house tours. Judy DeYoung is an assistant research editor atMen’s Health. She previously worked as the research editor forShapemagazine, and as a reporter/researcher forVanity Fair. Before her magazine publishing career, she spent a decade studying ballet and modern dance in Providence, RI and NYC. Milo Bryant, C.S.C.S., is a veteran trainer and the owner of MILO-LIMITLESS FITNESS, an outdoor gym in Del Mar, Calif. He’s also the author of Unstoppable After 40, a Men’s Health product, and is a noted speaker who’s presented to Olympic committees and fitness governing bodies. He’s an expert in training children and the founder of the Coalition for Launching Active Youth (C.L.A.Y.), a fitness program focused on children. Michael Easter is theNew York Timesbestselling author of the booksScarcity BrainandThe Comfort Crisis. Philip Ellis is Sex & Relationships Editor atMen's Health, and the author of two novels:Love & Other Scams(2023) andWe Could Be Heroes(2024). Garrett Munce is grooming editor forEsquireandMen's Healthwhere he covers all things grooming. His work has also appeared inGQ, Town & Country,New York Magazine,The Wall Street Journal,and more. He is the author of the bookSelf-Care For Men. Zachary Zaneis a Brooklyn-based columnist, sex expert, and activist whose work focuses on sexuality, culture, and the LGBTQ community. He is the author ofBoyslut: A Memoir and Manifestoand co-author ofMen’s Health: Best. Sex. Ever.He writes “Sexplain It,” the sex and relationship advice column atMen’s Health, and “Navigating Non-Monogamy,” the polyamorous relationship column atCosmopolitan. He is editor-in-chief of theBOYSLUT Zine, which publishes nonfiction erotica from kinksters across the globe. His work has been featured inNew York Times, Rolling Stone,Washington Post,Playboy, and more. Dorenna Newton is the Executive Producer forMen’s HealthandEsquirewhere she oversees all content for the brands. The creator of shows likeGym & FridgeandExplain This, she also writes and directs films and comedy series. Previously she was Executive Producer atGQmagazine where she launched their video brand. She got her start as a creative director at Cartoon Network in London where she created and directed the BAFTA winning seriesSkatoony. Elyssa Aquino is a Senior Shooter & Editor on the video team. She has produced for magazines likeMen’s Health,Esquire, andOprah Magazine. Elyssa loves strange documentaries, scripted TV shows, and really trashy reality television. Kyle Orozovich is the Senior Video Editor forMen’s Health. He had an extensive career in late-night television, having worked atSaturday Night Livefor 13 years in the Cue Card departmentandthe Film Unit as an Assistant Editor, along with theLate Show with David Letterman, andThe Tonight Show starring Jimmy Fallon. He also previously worked on several reality shows, ranging fromRehab Addicton HGTV toComic Book Menon AMC. Janie Booth is an Associate Producer atMen’s Health. She has worked as a video producer for over five years. She is passionate about all things television, pop culture and fitness. Abigail Greene is the Executive Managing Editor ofMen’s Health. She also currently works atOprah DailyandEsquire, and previously worked atCosmopolitanandSesame Street Parents. She thinks about going to Pilates all the time and one day will. Carol Luz is the Director of Editorial Business forMen’s Health,Esquire,ELLE, andHarper’s BAZAAR. She keeps the lights on and the water running. On a personal note, she loves painting dogs doing human things, Ancient Aliens, and any of theReal Housewivesshows. Kate Remulla is the Editorial Business Manager forMen’s Health,Oprah Daily,andTown & Country, where she oversees reporting, contracts, and contributors. At home in New Jersey, she enjoys spending time with her husband and daughter, thanks to whom she’s currently rediscovering the joy of rollercoasters and roller skating. **Reporting Guidelines** Men's Healthasks all editors and writers to follow strict reporting protocols to ensure the accuracy of all information reported in the magazine and on site. Studies must be reviewed before being cited in stories, and all factual information must be attributed to a reliable source. Editors rely on interviews with expert sources to substantiate all articles, and each story is reviewed and fact-checked by at least two editors before being published. Articles are then regularly reviewed and updated to include the newest information available on the topic. **Generative AI Policy** While we are big believers in technology that helps us innovate and makes our work better, all editorial content produced byMen's Healthis human-generated by the editors shown above. We never use AI to report or write or fact-check, although it may be used for research purposes. We’ll continue to monitor the development and uses of these tools across the industry. **Editorial Independence** Men's Healthreceives support from advertisers. However, all content is produced independently. Any content produced in conjunction with an advertiser, or paid for by an advertiser, is clearly marked as such on the site. **Affiliate Links** Men's Healthparticipates in affiliate marketing programs—meaning that purchases made by readers who visit our site and then go to retailers and products recommended by our editors may result in paid commissions. The products we feature are always chosen by editors based on brand standards. **About Hearst Magazines Digital Media** Hearst Magazines Digital Media, a unit of Hearst Magazines, is home to a powerful portfolio of brands, from iconic industry-leading fashion and lifestyle properties to some of the fastest-growing voices in food and commerce. In addition toMen's Health, Hearst owns several other global leaders in health and wellness, includingPrevention,Women's Health,Runner's World, andBicycling.Learn more aboutHearst,Hearst Magazines, andHearst Magazines Digital Media. **About** Customer Service Customer Service Your Privacy Choices Your Privacy Choices The Scars of Uvalde The Scars of Uvalde Watch Killer Mike And Ruth Discuss Nas On 'Ozark' Watch Killer Mike And Ruth Discuss Nas On 'Ozark' Harry Potter Star on Scene He Was Difficult About Harry Potter Star on Scene He Was Difficult About Falcon/Winter Soldier Sets Up Weird MCU Future Falcon/Winter Soldier Sets Up Weird MCU Future Tyla's Piano Test Article Tyla's Piano Test Article The Men's Health Advisory Board The Men's Health Advisory Board A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazines, Inc. All Rights Reserved."}