{"id": 1573, "name": "WFMZ - Allentown News", "domain": "wfmz.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wfmz.com/station/support-for-wfmz-and-zeam/article_5851dc66-4835-11ee-bfda-530ffa8b2f0c.html#tncms-source=Top-Navigation-Station-Zeam-Support", "title": "Support For Wfmz And Zeam", "content": "82°Allentown, PA(18103)TodayMostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. .TonightMostly clear.Updated: June 11, 2025 @ 5:58 pmFull Forecast Allentown, PA(18103)TodayMostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. .TonightMostly clear.Updated: June 11, 2025 @ 5:58 pm Mostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. . Mostly clear. Updated: June 11, 2025 @ 5:58 pm Full Forecast Allentown, PA(18103)TodayMostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. .TonightMostly clear.Updated: June 11, 2025 @ 5:58 pm Mostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. . Mostly clear. Updated: June 11, 2025 @ 5:58 pm Mostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. . Mostly clear. Updated: June 11, 2025 @ 5:58 pm Full Forecast Facebook Twitter YouTube Instagram Email iOS App Android App Watch Now Watch Live Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch ■ NewsAlerts & Free AppsLehigh Valley ▶Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh CountyNorthampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt AreaBerks ▶Reading AreaNorthern Berks CountySouthern Berks CountyEastern Berks CountyWestern Berks CountyRegional ▶Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill CountySoutheastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester CountyWestern New Jersey ▶Hunterdon CountyWarren CountyPennsylvaniaInside Local GovernmentSpotlight PAObituariesSchoolsUS and WorldSend Us A News Tip69 News at SunriseEspanol ▶NoticiasDeportesEntretenimientoComunidadSu TierraTiempoGood NewsRecalls / Missing Persons Alerts & Free Apps Lehigh Valley ▶Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh CountyNorthampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt Area Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh County Allentown Area Bethlehem Area Northern Lehigh County Southern Lehigh County Western Lehigh County Northampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt Area Bethlehem Area Easton Area Nazareth Area Slate Belt Area Berks ▶Reading AreaNorthern Berks CountySouthern Berks CountyEastern Berks CountyWestern Berks County Reading Area Northern Berks County Southern Berks County Eastern Berks County Western Berks County Regional ▶Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill CountySoutheastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester CountyWestern New Jersey ▶Hunterdon CountyWarren CountyPennsylvania Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill County Carbon County Monroe County Schuylkill County Southeastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester County Upper Bucks County Central Bucks County Upper Montgomery County Northern Chester County Western New Jersey ▶Hunterdon CountyWarren County Hunterdon County Warren County Pennsylvania Inside Local Government Spotlight PA Obituaries Schools US and World Send Us A News Tip 69 News at Sunrise Espanol ▶NoticiasDeportesEntretenimientoComunidadSu TierraTiempo Noticias Deportes Entretenimiento Comunidad Su Tierra Tiempo Good News Recalls / Missing Persons Alerts & Free Apps Lehigh Valley ▶Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh CountyNorthampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt Area Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh County Allentown Area Bethlehem Area Northern Lehigh County Southern Lehigh County Western Lehigh County Northampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt Area Bethlehem Area Easton Area Nazareth Area Slate Belt Area Lehigh County ▶Allentown AreaBethlehem AreaNorthern Lehigh CountySouthern Lehigh CountyWestern Lehigh County Allentown Area Bethlehem Area Northern Lehigh County Southern Lehigh County Western Lehigh County Allentown Area Bethlehem Area Northern Lehigh County Southern Lehigh County Western Lehigh County Northampton County ▶Bethlehem AreaEaston AreaNazareth AreaSlate Belt Area Bethlehem Area Easton Area Nazareth Area Slate Belt Area Bethlehem Area Easton Area Nazareth Area Slate Belt Area Berks ▶Reading AreaNorthern Berks CountySouthern Berks CountyEastern Berks CountyWestern Berks County Reading Area Northern Berks County Southern Berks County Eastern Berks County Western Berks County Reading Area Northern Berks County Southern Berks County Eastern Berks County Western Berks County Regional ▶Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill CountySoutheastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester CountyWestern New Jersey ▶Hunterdon CountyWarren CountyPennsylvania Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill County Carbon County Monroe County Schuylkill County Southeastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester County Upper Bucks County Central Bucks County Upper Montgomery County Northern Chester County Western New Jersey ▶Hunterdon CountyWarren County Hunterdon County Warren County Pennsylvania Poconos and Coal Region ▶Carbon CountyMonroe CountySchuylkill County Carbon County Monroe County Schuylkill County Carbon County Monroe County Schuylkill County Southeastern PA ▶Upper Bucks CountyCentral Bucks CountyUpper Montgomery CountyNorthern Chester County Upper Bucks County Central Bucks County Upper Montgomery County Northern Chester County Upper Bucks County Central Bucks County Upper Montgomery County Northern Chester County Western New Jersey ▶Hunterdon CountyWarren County Hunterdon County Warren County Hunterdon County Warren County Pennsylvania Inside Local Government Spotlight PA Obituaries Schools US and World Send Us A News Tip 69 News at Sunrise Espanol ▶NoticiasDeportesEntretenimientoComunidadSu TierraTiempo Noticias Deportes Entretenimiento Comunidad Su Tierra Tiempo Noticias Deportes Entretenimiento Comunidad Su Tierra Tiempo Good News Recalls / Missing Persons WeatherForecastHour by HourLocal RadarRadar - CurrentRadar - LightningSchool and Business Closings69News Weather ChannelPocono CamerasStream and River LevelsSend your weather report Forecast Hour by Hour Local RadarRadar - CurrentRadar - Lightning Radar - Current Radar - Lightning School and Business Closings 69News Weather Channel Pocono Cameras Stream and River Levels Send your weather report Forecast Hour by Hour Local RadarRadar - CurrentRadar - Lightning Radar - Current Radar - Lightning Radar - Current Radar - Lightning School and Business Closings 69News Weather Channel Pocono Cameras Stream and River Levels Send your weather report TrafficLive Streaming CamerasCameras and AlertsLehigh Valley TrafficBerks TrafficI-78 CorridorUS-22 CorridorPump PricesWeekly Roadwork Live Streaming Cameras Cameras and Alerts Lehigh Valley Traffic Berks Traffic I-78 Corridor US-22 Corridor Pump Prices Weekly Roadwork Live Streaming Cameras Cameras and Alerts Lehigh Valley Traffic Berks Traffic I-78 Corridor US-22 Corridor Pump Prices Weekly Roadwork Sports / HealthLocal ScoreboardMLB Scores and MatchupsCollege SportsThe Big TicketHealth Beat and Life LessonsSt. Luke's - Talk with your Doctor Local Scoreboard MLB Scores and Matchups College Sports The Big Ticket Health Beat and Life Lessons St. Luke's - Talk with your Doctor Local Scoreboard MLB Scores and Matchups College Sports The Big Ticket Health Beat and Life Lessons St. Luke's - Talk with your Doctor EntertainmentThings to DoMusic MondayFreddy AwardsGamesProgram ScheduleSunrise Trivia - Vote now! Things to Do Music Monday Freddy Awards Games Program Schedule Sunrise Trivia - Vote now! Things to Do Music Monday Freddy Awards Games Program Schedule Sunrise Trivia - Vote now! FeaturesEat, Sip, ShopFood and RecipesMr. FoodThings to DoWhat the Tech?Life Lessons & Health BeatHistory's HeadlinesThink TankFreddy AwardsTalk With Your DoctorSpecial ProgramsWhere The Heck Is...?2025 Philadelphia Mummers Parade Eat, Sip, Shop Food and Recipes Mr. Food Things to Do What the Tech? Life Lessons & Health Beat History's Headlines Think Tank Freddy Awards Talk With Your Doctor Special Programs Where The Heck Is...? 2025 Philadelphia Mummers Parade Eat, Sip, Shop Food and Recipes Mr. Food Things to Do What the Tech? Life Lessons & Health Beat History's Headlines Think Tank Freddy Awards Talk With Your Doctor Special Programs Where The Heck Is...? 2025 Philadelphia Mummers Parade CommunityCommunity CalendarCommunity ConnectionAdopt Lehigh Valley KidsShare Your Photo or VideoShare Your Birthday PhotosFurry FriendsEmployment Community Calendar Community Connection Adopt Lehigh Valley Kids Share Your Photo or Video Share Your Birthday Photos Furry Friends Employment Community Calendar Community Connection Adopt Lehigh Valley Kids Share Your Photo or Video Share Your Birthday Photos Furry Friends Employment BusinessBusiness NewsLocal StocksBusiness MattersCommunity Connection Business News Local Stocks Business Matters Community Connection Business News Local Stocks Business Matters Community Connection GamesSunrise Trivia - Vote now!Hot GamesDaily GamesCard GamesLogic PuzzlesMore PuzzlesArcadeRacing GamesSportsMatch GamesOther Sunrise Trivia - Vote now! Hot Games Daily Games Card Games Logic Puzzles More Puzzles Arcade Racing Games Sports Match Games Other Sunrise Trivia - Vote now! Hot Games Daily Games Card Games Logic Puzzles More Puzzles Arcade Racing Games Sports Match Games Other Obits AboutHow to Watch UsSupport for WFMZ+ & ZeamContact UsSend Us A News TipMobile and Free AppsMeet The TeamEmploymentProgram Schedules ▶WFMZ-TV 69.1 ScheduleWFMZ-TV 69.3 - MeTV ScheduleWDPN-TV 2.4 - H&I ScheduleWDPN-TV 2.5 - Retro TVNewslettersInternshipsAbout WFMZ-TVWFMZ-TV 40th AnniversaryFCC Public Inspection File How to Watch Us Support for WFMZ+ & Zeam Contact Us Send Us A News Tip Mobile and Free Apps Meet The Team Employment Program Schedules ▶WFMZ-TV 69.1 ScheduleWFMZ-TV 69.3 - MeTV ScheduleWDPN-TV 2.4 - H&I ScheduleWDPN-TV 2.5 - Retro TV WFMZ-TV 69.1 Schedule WFMZ-TV 69.3 - MeTV Schedule WDPN-TV 2.4 - H&I Schedule WDPN-TV 2.5 - Retro TV Newsletters Internships About WFMZ-TV WFMZ-TV 40th Anniversary FCC Public Inspection File How to Watch Us Support for WFMZ+ & Zeam Contact Us Send Us A News Tip Mobile and Free Apps Meet The Team Employment Program Schedules ▶WFMZ-TV 69.1 ScheduleWFMZ-TV 69.3 - MeTV ScheduleWDPN-TV 2.4 - H&I ScheduleWDPN-TV 2.5 - Retro TV WFMZ-TV 69.1 Schedule WFMZ-TV 69.3 - MeTV Schedule WDPN-TV 2.4 - H&I Schedule WDPN-TV 2.5 - Retro TV WFMZ-TV 69.1 Schedule WFMZ-TV 69.3 - MeTV Schedule WDPN-TV 2.4 - H&I Schedule WDPN-TV 2.5 - Retro TV Newsletters Internships About WFMZ-TV WFMZ-TV 40th Anniversary FCC Public Inspection File Facebook Twitter WhatsApp LinkedIn SMS Email **Support for WFMZ+ and Zeam** Sep 18, 2024 Sep 18, 2024 Facebook Twitter WhatsApp LinkedIn SMS Email Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Facebook Twitter WhatsApp LinkedIn SMS Email Print Copy article link Save Facebook Twitter YouTube Instagram Email Humidity:41% Cloud Coverage:12% Wind:11 mph UV Index:0 Low Sunrise:05:30:52 AM Sunset:08:32:41 PM **Today** Mostly sunny and seasonably warm with low humidity; some high-altitude haze is possible. **Tonight** Mostly clear. **Tomorrow** Sunshine mixing with clouds; even warmer with a rise in humidity later in the day. Mostly dry, but there is a slight chance for a Poconos thundershower in the later afternoon. **More from the Newsroom** Annual water balloon fight marks last day of school for Parkland School District Lehigh County man wanted on charges of rape and sexual assault caught in West Virginia 'People are concerned': Local residents share videos of ICE detainment in Southside Bethlehem Man rescued from water at Jordan Park in critical condition DEP issues Code Orange air alert for southeastern Pa Thursday What the Tech? A Father's Day gift that keeps on spinning Flag Day duty: Local veterans prepare to retire 20k American flags Historic Chester County theater gets $100k grant for wall preservation project Police incident in W. Rockhill Twp. prompts large law enforcement response County of Berks South Campus closed until further notice, after Legionella bacteria found in water system More from the Newsroom » **Email Newsletter Sign-Up** Get Breaking News, Headlines and Weather delivered directly to your inbox. Success!An email has been sent towith a link to confirm list signup. Error!There was an error processing your request. Breaking news alerts from 69News. Your source for important local government and business events delivered Tue to Sat Your daily headlines and complete forecast from 69 News meteorologists delivered every morning around 6am The latest headlines plus find out what's coming up tonight on 69News. Delivered weekday afternoons Home News Traffic Sports / Health Entertainment Features Community Business Games About Us Calendar Mobile and Free Apps WFMZ+ Streaming Email Alerts Text Alerts Search Weather Stormcenter - Worship Application Stormcenter - School / Business Application Employment Internships FCC Public File EEO Report Closed Captioning Problems Hotline:610.841.4982 Lehigh Valley News Tip line:610.791.1111 Berks News Tip line:610.372.6969 Facebook Twitter YouTube Instagram Email iOS App Android App OTT Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: Notifications Settings Get up-to-the-minute news sent straight to your device."}