{"id": 856, "name": "KIFI - Idaho Falls News", "domain": "localnews8.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://localnews8.com/news/national-world/cnn-world/2025/06/11/trump-tells-netanyahu-to-end-gaza-war-and-stop-iran-threats-source-says-as-us-ramps-up-pressure-on-israel/", "title": "Trump Tells Netanyahu To End Gaza War And Stop Iran Threats Source Says As Us Ramps Up Pressure On Israel", "content": "Home NewsIdaho Falls NewsRexburg NewsPocatello NewsIdahoWyomingUtahCrime TrackerUS/WorldCommunity All-StarsScam AlertsPocatello Police ShootingVallow-Daybell Coverage Idaho Falls News Rexburg News Pocatello News Idaho Wyoming Utah Crime Tracker US/World Community All-Stars Scam Alerts Pocatello Police Shooting Vallow-Daybell Coverage Idaho Falls News Rexburg News Pocatello News Idaho Wyoming Utah Crime Tracker US/World Community All-Stars Scam Alerts Pocatello Police Shooting Vallow-Daybell Coverage WeatherAlertsFirst Alert RadarLocal Forecast8-Day ForecastsRoad ConditionsSki ReportSky Cams Alerts First Alert Radar Local Forecast 8-Day Forecasts Road Conditions Ski Report Sky Cams Alerts First Alert Radar Local Forecast 8-Day Forecasts Road Conditions Ski Report Sky Cams SportsAthlete of the WeekTop Plays of the WeekHigh School AthleticsEast Idaho Game NightBoise State AthleticsIdaho State AthleticsBYU Athletics Athlete of the Week Top Plays of the Week High School Athletics East Idaho Game Night Boise State Athletics Idaho State Athletics BYU Athletics Athlete of the Week Top Plays of the Week High School Athletics East Idaho Game Night Boise State Athletics Idaho State Athletics BYU Athletics PoliticsElection ResultsIdaho Politics Election Results Idaho Politics Election Results Idaho Politics Obituaries Videos and LivestreamsLocal News 8 Newscast LivestreamLivestream EventsMust See Videos Local News 8 Newscast Livestream Livestream Events Must See Videos Local News 8 Newscast Livestream Livestream Events Must See Videos LifeBusiness BeatCommunity All-StarsEnergizing Conversations with INLEntertainmentEventsGas PricesHouse & HomeQuestion of the DayYellowstone Teton Territory Travel and TourismYour Money Business Beat Community All-Stars Energizing Conversations with INL Entertainment Events Gas Prices House & Home Question of the Day Yellowstone Teton Territory Travel and Tourism Your Money Business Beat Community All-Stars Energizing Conversations with INL Entertainment Events Gas Prices House & Home Question of the Day Yellowstone Teton Territory Travel and Tourism Your Money Events PlayContestsContest Rules Contests Contest Rules Contests Contest Rules ShareSubmit Tips, Pics and Video Submit Tips, Pics and Video Submit Tips, Pics and Video TV Listings Meet the Team About UsContact UsAdvertise With UsDownload Our AppsClosed CaptioningFCC Public File KIFIFCC Public File KIDKFCC Public File K34NC-DJobs and InternshipsTelemundo East IdahoTranslator Information Contact Us Advertise With Us Download Our Apps Closed Captioning FCC Public File KIFI FCC Public File KIDK FCC Public File K34NC-D Jobs and Internships Telemundo East Idaho Translator Information Contact Us Advertise With Us Download Our Apps Closed Captioning FCC Public File KIFI FCC Public File KIDK FCC Public File K34NC-D Jobs and Internships Telemundo East Idaho Translator Information News Weather Sports Obits Events Play Share **Video Forecast** **Areas of thunderstorms for Wednesday evening; clearing out for Thursday with a low risk of storms** **Top Stories** **Rollover car crash slows traffic north of Ucon** **5th W in Rexburg to close Wednesday for road and sidewalk project** **Turned in by Uber Driver: Texas woman arrested after dragging officer in attempted Idaho bank robbery** **Update on Train Derailment: No immediate timeline for full cleanup, Intersection remains closed** **National ALS support organization hosting fundraiser walk in Pocatello Saturday** **Trump tells Netanyahu to end Gaza war and stop Iran threats, source says, as US ramps up pressure on Israel** By Eugenia Yosef and Oren Liebermann, CNN Jerusalem (CNN) —US President Donald Trump told Israeli Prime Minister Benjamin Netanyahu to end the war in Gaza and stop talk of an attack on Iran, according to a source familiar with the conversation. The two leaders spoke on the phone on Monday. Trump later said the call went “very well, very smooth.” The call for Israel to change course comes as Washington pushes for a nuclear deal with Iran and engages in indirect talks with Hamas over a ceasefire in Gaza. CNN has reached out to the White House for comment. Netanyahu convened his top ministers Tuesday night after there was “some progress” in negotiations toward a ceasefire deal, according to his office. The purpose of the meeting was to give updates on the negotiations and discuss next steps. Earlier in the day, Israeli Foreign Minister Gideon Sa’ar said there had been recent progress in ceasefire talks that also aim to bring back hostages held in Gaza. “Israel is serious in its will to secure a hostage deal. There has recently been certain progress,” Sa’ar told a news conference in Jerusalem, adding that “in light of past experience, I don’t want to overstate it at this point.” On Thursday, Hamas said it remains open to the ceasefire deal proposed by US envoy Steve Witkoff, but said it requires stronger guarantees against Israeli attacks. In a televised speech on Thursday, Khalil Al-Hayya, a high-ranking official in the militant group, said Hamas has not rejected Witkoff’s proposal but has submitted amendments with stronger security guarantees. Hamas wants any deal to include a permanent end to the war in Gaza and a withdrawal of Israeli forces. Growing rift **Growing rift** **Growing rift** Trump and Netanyahu appear increasingly at odds over the war in Gaza as the conflict passes the 20-month mark. Netanyahu has made clear that his war goals include the complete disarmament and removal of Hamas, while Trump has pushed for an end to the war. It’s one of several major issues in the region where a growing rift is emerging between the US and Israel. In recent weeks, the Trump administration bypassed Israel on a trip to the Middle East, reached a ceasefire deal with the Iran-backed Houthis in Yemen that failed to halt their ballistic missile attacks at Israel, and lifted sanctions on Syria – even as Israel warns against legitimizing a regime run by former jihadists. Meanwhile, Trump said his administration is “trying to make a deal so that there’s no destruction and death” in Iran. The sixth round of talks between the US and Iran is slated to start in the coming days. During their call, Trump asked Netanyahu to stop talking about an attack on Iran, the source familiar with the conversation said, and halt the leaks and reports about plans and preparations for an Israeli attack on Iran’s nuclear facilities. Netanyahu has repeatedly pushed for a military option to stop Iran’s nuclear program. In the conversation with Trump, Netanyahu told Trump that Iran is just trying to buy time and isn’t serious about negotiations, the source said. CNN reported last month that Israel waspreparing for a possible strikeon Iran’s nuclear facilities. The Trump administration has also been trying to expand the Abraham Accords, the landmark series of agreements from Trump’s first term that saw Israel normalize relations with the United Arab Emirates, Bahrain and Morocco. But Saudi Arabia – whose agreement to such a deal would be the ultimate prize – has repeatedly made clear that it will not normalize relations with Israel without concrete steps towards recognition of a Palestinian state and a plan to implement the two-state solution. US Ambassador to Israel Mike Huckabee said this week that a two-state solution is no longer a goal of US policy, as it had been for decades of both Republican and Democrat administrations. “Unless there are some significant things that happen that change the culture, there’s no room for it,” Huckabeetold Bloomberg News in an interviewin Jerusalem. He said it won’t happen “in our lifetime.” Huckabee has previously advocated for Israeli settlements in the occupied West Bank and once said that “there’s really no such thing as a Palestinian.” Earlier in the war, Trump laid out vague plans for a “Gaza Riviera” that envisioned US control of the coastal enclave and the displacement of large parts of the Palestinian population living there. The-CNN-Wire™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved. Jump to comments ↓ **CNN Newsource** **Related Articles** **Israel recovers bodies of two dead hostages from Gaza in military operation** **Police seek answers as Austria mourns victims of one of the worst shootings in its history** **Rare Labubu sells for more than $150,000 at auction** **Gunman opens fire in Austrian school, killing 10 and throwing country into shock** KIFI Local News 8 is committed to providing a forum for civil and constructive conversation. Please keep your comments respectful and relevant. You can review our Community Guidelines byclicking here If you would like to share a story idea, please submit ithere. EEO Report|Terms of Use|Privacy Policy|Community Guidelines|About Us|KIFI-TV FCC Public File|FCC Applications| Do Not Sell My Personal Information **Subscribe to Our Email Newsletters** Daily News UpdateBreaking News AlertDaily Weather ForecastSevere Weather AlertContests and Promotions **Download Our Apps** Accessibility Tools Increase TextIncrease Text Decrease TextDecrease Text GrayscaleGrayscale High ContrastHigh Contrast Negative ContrastNegative Contrast Light BackgroundLight Background Links UnderlineLinks Underline Readable FontReadable Font ResetReset"}