{"id": 555, "name": "Frontiers in Environmental Science", "domain": "frontiersin.org/journals/environmental-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/environmental-science/articles/10.3389/fenvs.2025.1608475/full", "title": "Environmental Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Atmosphere and Climate Big Data, AI, and the Environment Biogeochemical Dynamics Drylands Ecosystem Restoration Environmental Citizen Science Environmental Economics and Management Environmental Informatics and Remote Sensing Environmental Policy and Governance Environmental Systems Engineering Freshwater Science Interdisciplinary Climate Studies Land Use Dynamics Social-Ecological Urban Systems Soil Processes Toxicology, Pollution and the Environment Water and Wastewater Management Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Atmosphere and Climate Big Data, AI, and the Environment Biogeochemical Dynamics Drylands Ecosystem Restoration Environmental Citizen Science Environmental Economics and Management Environmental Informatics and Remote Sensing Environmental Policy and Governance Environmental Systems Engineering Freshwater Science Interdisciplinary Climate Studies Land Use Dynamics Social-Ecological Urban Systems Soil Processes Toxicology, Pollution and the Environment Water and Wastewater Management Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Atmosphere and Climate Big Data, AI, and the Environment Biogeochemical Dynamics Drylands Ecosystem Restoration Environmental Citizen Science Environmental Economics and Management Environmental Informatics and Remote Sensing Environmental Policy and Governance Environmental Systems Engineering Freshwater Science Interdisciplinary Climate Studies Land Use Dynamics Social-Ecological Urban Systems Soil Processes Toxicology, Pollution and the Environment Water and Wastewater Management Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Environ. Sci. Sec. Environmental Economics and Management Volume 13 - 2025 |doi: 10.3389/fenvs.2025.1608475 **Can green financial policy drive urban carbon unlocking efficiency? A causal inference approach based on double machine learning** 1Fuzhou Institute of Technology, Fuzhou, China 2School of Economics and Management, Fuzhou University, Fuzhou, Fujian Province, China The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here The establishment of green finance reform and innovation pilot zones (GFRIPZ) is a crucial initiative in China's advancement of green finance development. Whether this policy can effectively enhance carbon unlocking efficiency (CUE) constitutes a significant research question. Utilizing panel data from 267 Chinese cities spanning 2011 to 2022 and treating the GFRIPZ policy as a quasi-natural experiment, this study employs a double machine learning (DML) model to empirically investigate the impact of green finance policy on urban carbon unlocking efficiency. The results show that: (1) GFRIPZ significantly enhances CUE, and this conclusion remains valid after undergoing a series of robustness checks. (2) Mechanism validation reveal that GFRIPZ enhances CUE through three pathways: optimizing industrial structure, reducing energy intensity, and strengthening public environmental concern. (3) Heterogeneity analysis indicates that the carbon unlocking effects of GFRIPZ are more pronounced in eastern regions, large cities, non-resource-based cities, cities with higher internet development levels, and cities with advanced financial development. Concurrently, the applicability of GFRIPZ also benefits from regional institutional contexts such as public data openness, carbon emissions trading, and green resource endowment.(4) Spatial spillover effects demonstrate that GFRIPZ significantly enhances CUE in surrounding areas. This research not only provides a novel analytical framework for regional carbon unlocking pathways but also offers policy recommendations for enhancing green finance systems and overcoming carbon lock-in dilemmas. Keywords:Double machine learning, green finance policy, carbon unlocking efficiency, Mechanism validation, thereby significantly overlooking the importance of Received:09 Apr 2025;Accepted:09 Jun 2025. Copyright:© 2025Tang and Zhou. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Qihao Zhou, School of Economics and Management, Fuzhou University, Fuzhou, 350108, Fujian Province, China Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}