{"id": 953, "name": "KNTV - NBC Bay Area", "domain": "nbcbayarea.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nbcbayarea.com/news/local/bay-area-proud/day-care-teacher-aids-4-year-olds-quest-to-meet-1000-dogs-before-he-goes-to-kindergarten/3875873/", "title": "Day Care Teacher Aids 4 Year Olds Quest To Meet 1000 Dogs Before He Goes To Kindergarten", "content": "**Day care teacher aids 4-year-old's quest to meet 1,000 dogs before he goes to kindergarten** Whoever gave Pleasure Point in Santa Cruz its name knew what they were talking about. From clifftop ocean views to one of the area's most popular surf breaks, people can find their pleasure here in a variety of ways. For 4-year-old Quinn Drake, however, his pleasure comes in just one form – although many different breeds. Watch NBC Bay Area News free wherever you are \"What's your doggie's name?\" Quinn asked as he approached dog owner after dog owner. It's all part of a quest Quinn started a couple of years ago. \"To meet a thousand dogs before I start kindergarten,\" Quinn said. The mission began during daily walks with his father, Aaron, around their Santa Cruz neighborhood. **Bay Area Proud** **Cutest class of the semester: Teacher instructs students in raising guide dog puppies** **Two Bay Area women making great strides improving health of women globally** \"He would ask every single dog owner, 'What's your doggie's name? What's your doggie's name?'\" Aaron said. \"My dad said, 'Let's make this into a challenge,'\" Quinn said. Get a weekly recap of the latest San Francisco Bay Area housing news with the Housing Deconstructed newsletter. The goal of meeting 1,000 dogs before kindergarten might have remained just that, a goal, if not for the help of another important person in Quinn's life: his day care teacher, Jessica Alaimo. After hearing about Quinn's quest, Jessica was all in. \"I thought I need to step up here,\" Jessica said. Jessica is the type of teacher who, at the end of the school day, doesn't clock out on caring about her kids. \"I have a hard time not being invested,\" Jessica said. \"I love what they do. I love what they bring, and I want to be a part of it.\" So, Jessica took it upon herself to go out on weekends with Quinn. They set up at Pleasure Point – a popular dog-walking spot – with a handmade sign, plenty of treats, and a notebook to record the name of each dog they meet. Then, Jessica sits back and watches Quinn make friend after friend, both of the four-legged and two-legged variety. \"The joy that Quinn brings to people – he's so just vibrant and so genuine,\" Jessica said. \"It's sweet to see his joy, and it's sweet to see the joy he's definitely bringing to the people.\" Together, Quinn and Jessica are right on target to reach his milestone of 1,000 by the time he reaches the milestone of kindergarten. It's an early lesson in perseverance, for sure, but for Quinn, there is something else he, and the rest of us, can take away from the experience: no matter how big your dreams in life are, there are people who care about you who will help make them happen. **Trending Stories** GoogleGoogle offers buyouts to employees across the company, including Search Protests‘No Kings' protests planned for Saturday across the Bay Area ImmigrationICE activity in Bay Area: Several people detained by agents in SF and Concord San Jose1 dead, 1 injured in San Jose suspected DUI crash OaklandCar set on fire, business burglarized in Oakland **Weather Forecast** Facebook Instagram TikTok Submit Tips for Investigations Newsletters Connect With Us Our News Standards NBC Sports Bay Area Xfinity: Internet, TV, streaming, more KNTV Public Inspection File KNTV Accessibility KNTV Employment Information Send Feedback FCC Applications Terms of Service Privacy Policy Your Privacy Choices Advertise with us CA Notice Ad Choices Facebook Instagram TikTok"}