{"id": 1206, "name": "Ruidoso News", "domain": "ruidosonews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ruidosonews.com/to-commemorate-the-death-of-george-floyd-the-doj-shut-down-police-reform/", "title": "To Commemorate The Death Of George Floyd The Doj Shut Down Police Reform", "content": "Home News Sports Horse Racing Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a Classified Submit a Classified Submit a Classified LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Contact Us Login Subscribe Home News Sports Horse Racing Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a Classified Submit a Classified Submit a Classified LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Subscribe **To commemorate the death of George Floyd, the DOJ shut down police reform** May 29, 2025 Free,Opinion Mary Sanchez Mary Sanchez Mary Sanchez Here’s how the federal government honored the fifth anniversary of the tortured death of George Floyd: It stomped on his memory by gutting the very programs that could help police departments avoid such brutal and racially polarizing deaths. The Department of Justice announced on May 21 that it would cancel consent decrees with multiple policing agencies across the nation. These are court-monitored plans whereby departments agree to work on specific steps to improve on patterns and practices of discriminatory behavior, based on evidence of police misconduct that far exceeds the actions of one officer. Consent decrees attempt to rectify problems that are ingrained, like attitudes and policies. One of the canceled programs was between the DOJ and the Minneapolis Police Department after the investigation that followed Floyd’s death. The other was with the Louisville Police Department, prompted by the death of Breonna Taylor who was shot and killed in 2020 during a drug raid where police broke her door down, looking for another target. The government will also be halting many on-going, deep-dive investigations, the sort of efforts that have helped untold numbers of law enforcement through increased training, funding and building stronger relationships with the community. In total, nearly two dozen cities have lost these crucial efforts of government help and oversight, managed through the DOJ’s Civil Rights division. Understandably, few, if any, police departments welcome consent decrees. No one likes the government looking under the hood, overseeing and advising. Police unions in particular have praised the move by Trump’s DOJ to reign in the investigations. A fair criticism is that consent decrees can drag on for years and they are expensive. But the department is not doing law enforcement any favors by this move. Admittedly, it might seem counter-intuitive to make that point. Politicians and plenty of headline-seeking media personalities preach of a vast gulf between those who chant Black Lives Matter and those who sing the praises of Blue Lives. Lost is the truth that Black and Latino communities, especially low-income people, depend on police for safety as much, if not often more, than wealthier neighborhoods where crime is less prevalent. People in low-income communities just want to be treated fairly, and with respect. Here’s another overlooked factor: Good, conscientious people exist in every policing system that has drawn the DOJ’s oversight. A great example is Ferguson, MO. Michael Brown’s shooting death in 2014 at the hands of a now former Ferguson officer ignited mass protests. The reasons were far more complicated than Brown’s death, or even the fact that his body remained in the street for hours after the shooting, a huge sign of disrespect for his community. A DOJ report released a year later noted that the “investigation has shown that distrust of the Ferguson Police Department is longstanding and largely attributable to Ferguson’s approach to law enforcement.” The report drilled into the practice of using police to drive revenue for the city through fines. There was a relentless push for officers to bring in revenue. There were even competitions among them to see who could write the most citations. The need for probable cause was often ignored in traffic stops and officers developed creatively unconstitutional methods to get around the need for warrants signed by a judge. But the report took pains to note those who tried to rectify this unfair treatment – like a city council member who argued for a community service option for those who couldn’t pay their fines: “In August 2013, for example, one City Councilmember wrote to the City Manager, the Mayor, and other City officials lamenting the lack of a community service option and noted the benefits of such a program, including that it would “keep those people that simply don’t have the money to pay their fines from constantly being arrested and going to jail, only to be released and do it all over again.” Solutions-minded officers were also cited. Some argued that it would be far more productive to let citizens use meager funds to fix a broken taillight, rather than fine them for it. Others tried to press commanders, the chief of police, and the mayor, to acknowledge when directives drove unfair practices or neglected underlying causes for crime. The report chronicled how those voices were silenced. The saying is that culture eats, like a snack, people who try to function as agents of change in rigid systems. Numerous DOJ reports echo the adage, citing instance after instance. Ingrained attitudes and processes are difficult to shake, even when people agree on the negative outcomes of those processes. In short, change is hard. Which is one reason that consent decrees have long been a tool, not a perfect one, but one way to help police organizations shift. The Trump DOJ, in what it paints as a benevolent act to policing, is running from that responsibility. The department is failing the communities that law enforcement is sworn to protect, along with the many change-minded officers who could use some backup. (Readers can reach Mary Sanchez at msanchezcolumn@gmail.com and follow her on Twitter @msanchezcolumn.) **Other News** June 5, 2025 June 5, 2025 June 5, 2025 Home Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025El Rito Media, LLC. All rights reserved."}