{"id": 1857, "name": "WWTN - 99.7 FM - Nashville", "domain": "997wtn.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.997wtn.com/news/ice-chief-to-newsmax-fiery-rhetoric-on-immigration-crackdown-only-inflames-matters/", "title": "Ice Chief To Newsmax Fiery Rhetoric On Immigration Crackdown Only Inflames Matters", "content": "ShowsNashville’s Morning News with Dan MandisChris HandChad BensonMatt MurphyMark LevinSuperTalk News TeamWeather Center Nashville’s Morning News with Dan Mandis Chris Hand Chad Benson Matt Murphy Mark Levin SuperTalk News Team Weather Center Nashville’s Morning News with Dan Mandis Chris Hand Chad Benson Matt Murphy Mark Levin SuperTalk News Team Weather Center Podcasts Events ContestsLocal Contest Rules Archive Local Contest Rules Archive Local Contest Rules Archive Sweet Deals Advertise With Us **ICE Chief to Newsmax: Fiery Rhetoric on Immigration Crackdown Only Inflames Matters** Todd Lyons, acting director of Immigration and Customs Enforcement, told Newsmax on Wednesday that politicians who favor sanctuary policies are only inflaming the situation when they encourage law enforcement not to work with federal authorities on arresting illegal immigrants. “It’s not right for elected officials, whether you are pro-immigration or anti-immigration, to get this fiery rhetoric that puts law enforcement in danger,” Lyons told “American Agenda.” “And not only does it endanger my officers and agents and every person in uniform, but even the community. … Because these sanctuary jurisdictions won’t work with us, we have to go into the community.” Riots in Los Angeles have been ongoing since Friday when ICE agents arrested more than 100 illegal aliens. For more than 45 years, Los Angeles has maintained a policy where local police do not arrest illegal immigrants or act to determine a person’s immigration status. Democrat Los Angeles Mayor Karen Bass has characterized ICE’s lawful actions as sowing “terror in our communities” and disrupting “basic principles of safety in our city.” She told KNBC-TV on Friday that “we are going to fight for all Angelenos whether they have papers or not.” “After the first night [in Los Angeles], when we actually listed the individuals that were arrested, when you have known suspected terrorist gang members, drug dealers, and yet people still want to advocate to allow these individuals to stay in our community and stay in the country,” Lyons said. “The political rhetoric just puts none of us at ease, and it makes none of us safe. You would not expect this from elected officials.” Some politicians, such as Rep. Pramila Jayapal, D-Wash., have insinuated that ICE agents were indiscriminately snatching people off the streets without due process. Lyons said that is far from the truth. “President Trump ended catch and release, and [ICE] agents and officers are now allowed to do their sworn law enforcement mission,” Lyons said. “And like any other local police department, state trooper, we can’t walk away from someone that’s committing a crime.” He added, “If your status is no longer valid, if your visa is no longer valid, it’s been revoked or a judge has lawfully ordered you deported from the United States, we are not just going to walk away from you and give you a second bite at the apple.” “You have already had your due process rights. If you haven’t, you will go in front of a judge again and have your chance to appeal it. But we’re not going to walk away from an immigration violation anymore.” Lyons also shot back at politicians who have described the riots in Los Angeles as peaceful with protesters simply exercising their First Amendment rights. “What you saw is pure anarchy and lawlessness,” Lyons said. “Being on the ground here in Los Angeles and actually seeing it firsthand and watching my officers and agents get assaulted from Friday night all the way through until LAPD got control of the city.” “It’s been a real violent situation, and this all stemmed from ICE doing its duty, law enforcement duty, serving a criminal immigration warrant. … It was an actual federal law enforcement critical criminal warrant signed by a judge that we were executing that led to this. And you can just see how quickly this filed out of control.” GET TODAY : is the fastest-growing cable news channel in America with more than 30 million people watching! Reuters Institute reports is one of the top news brands in the U.S. You need to watch today. Get it with great shows from Rob Schmitt,Greta Van Susteren, Greg Kelly,Carl Higbie,Rob Finnerty – and many more! Find the channel on your cable system – Sign up forand get , our streaming channeland our military channelWorld at War. Find hundreds of shows, movies and specials. Even get Jon Voight’s special series and President Trump’s comedy programs and much more! Watchon your smartphone or home TV app. Watch anytime, anywhere! Start your now: © 2025 Newsmax. All rights reserved. There is no custom code to display. **Free Apps** **Super Talk 99.7 Links** Privacy Policy Terms of Service Advertise With Us General Contest Rules Station Information FCC Public File Cumulus Careers Cumulus Media Corporate FCC Applications EEO Public File Report **More Links** Shows Contests SuperTalk 99.7 WTN Events News **Connect** Podcasts Download the 99.7 WTN App Here! Listen Live with Alexa Become a SuperTalk VIP Facebook Twitter Instagram Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}