{"id": 88, "name": "WQPR - NPR - Muscle Shoals", "domain": "apr.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.apr.org/news/2025-06-07/courts-clear-the-way-for-college-athletes-to-be-paid-will-the-state-of-alabama-challenge-it", "title": "Courts Clear The Way For College Athletes To Be Paid Will The State Of Alabama Challenge It", "content": "NewsLatest APR NewsStoryCorps SelmaAPR ReportsArts & LifeBusiness & EducationPolitics & GovernmentScience & HealthLatest APR NewsStoryCorps SelmaAPR ReportsArts & LifeBusiness & EducationPolitics & GovernmentScience & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health MusicAll Classical HD 3 Music ProgramsAll Things AcousticBama BluegrassClassical Music with David DuffGetting Sentimental Over YouSomething Old, Something NewThe CroonersAll Classical HD 3 Music ProgramsAll Things AcousticBama BluegrassClassical Music with David DuffGetting Sentimental Over YouSomething Old, Something NewThe Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners ScheduleDaily ScheduleWeekly ScheduleAll Programs on APRHoliday Program ScheduleDaily ScheduleWeekly ScheduleAll Programs on APRHoliday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule EventsEvents CalendarSubmission GuidelinesEvents CalendarSubmission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Support APRPledge NowEmployer Matching ContributionLearn MoreMonthly MembershipsDonate Your CarDonate Real EstateUnderwriting & Business SupportCurrent UnderwritersPlanned GivingDonate StockPledge NowEmployer Matching ContributionLearn MoreMonthly MembershipsDonate Your CarDonate Real EstateUnderwriting & Business SupportCurrent UnderwritersPlanned GivingDonate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock About UsWho Are We?How to use Smart SpeakersFunding FAQsPeopleBoard of TrusteesCPB Annual Financial ReportsFinancial StatementsFCC Public Inspection FilesEEO ReportsContact UsCPB Local Content and Service ReportsFCC ApplicationsWho Are We?How to use Smart SpeakersFunding FAQsPeopleBoard of TrusteesCPB Annual Financial ReportsFinancial StatementsFCC Public Inspection FilesEEO ReportsContact UsCPB Local Content and Service ReportsFCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Coverage Map On AirNow PlayingAPR News & Classics On AirNow PlayingUA-Info/Xponential Radio On AirNow PlayingClassical Music NewsLatest APR NewsStoryCorps SelmaAPR ReportsArts & LifeBusiness & EducationPolitics & GovernmentScience & HealthLatest APR NewsStoryCorps SelmaAPR ReportsArts & LifeBusiness & EducationPolitics & GovernmentScience & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health Latest APR News StoryCorps Selma APR Reports Arts & Life Business & Education Politics & Government Science & Health MusicAll Classical HD 3 Music ProgramsAll Things AcousticBama BluegrassClassical Music with David DuffGetting Sentimental Over YouSomething Old, Something NewThe CroonersAll Classical HD 3 Music ProgramsAll Things AcousticBama BluegrassClassical Music with David DuffGetting Sentimental Over YouSomething Old, Something NewThe Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners All Classical HD 3 Music Programs All Things Acoustic Bama Bluegrass Classical Music with David Duff Getting Sentimental Over You Something Old, Something New The Crooners ScheduleDaily ScheduleWeekly ScheduleAll Programs on APRHoliday Program ScheduleDaily ScheduleWeekly ScheduleAll Programs on APRHoliday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule Daily Schedule Weekly Schedule All Programs on APR Holiday Program Schedule EventsEvents CalendarSubmission GuidelinesEvents CalendarSubmission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Events Calendar Submission Guidelines Support APRPledge NowEmployer Matching ContributionLearn MoreMonthly MembershipsDonate Your CarDonate Real EstateUnderwriting & Business SupportCurrent UnderwritersPlanned GivingDonate StockPledge NowEmployer Matching ContributionLearn MoreMonthly MembershipsDonate Your CarDonate Real EstateUnderwriting & Business SupportCurrent UnderwritersPlanned GivingDonate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock Pledge Now Employer Matching Contribution Learn More Monthly Memberships Donate Your Car Donate Real Estate Underwriting & Business Support Current Underwriters Planned Giving Donate Stock About UsWho Are We?How to use Smart SpeakersFunding FAQsPeopleBoard of TrusteesCPB Annual Financial ReportsFinancial StatementsFCC Public Inspection FilesEEO ReportsContact UsCPB Local Content and Service ReportsFCC ApplicationsWho Are We?How to use Smart SpeakersFunding FAQsPeopleBoard of TrusteesCPB Annual Financial ReportsFinancial StatementsFCC Public Inspection FilesEEO ReportsContact UsCPB Local Content and Service ReportsFCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Who Are We? How to use Smart Speakers Funding FAQs People Board of Trustees CPB Annual Financial Reports Financial Statements FCC Public Inspection Files EEO Reports Contact Us CPB Local Content and Service Reports FCC Applications Coverage Map **Courts clear the way for college athletes to be paid. Will the State of Alabama challenge it?** Facebook Twitter LinkedIn Email A federal judge just signed off on arguably the biggest change in the history of college sports Friday, clearing the way for schools to begin paying their athletes millions as soon as next month as the multibillion-dollar industry shreds the last vestiges of the amateur model that defined it for more than a century. One answered question is whether the state of Alabama will challenge it. Though this deal brings some uniformity to the rules, states still have separate laws regarding how NIL can be doled out, which could lead to legal challenges. Baker has been consistent in pushing for federal legislation that would put college sports under one rulebook and, if he has his way, provide some form of antitrust protection to prevent the new model from being disrupted again. Nearly five years after Arizona State swimmer Grant House sued the NCAA and its five biggest conferences to lift restrictions on revenue sharing, U.S. Judge Claudia Wilken approved the final proposal that had been hung up on roster limits, just one of many changes ahead amid concerns that thousands of walk-on athletes will lose their chance to play college sports. The sweeping terms of the so-called House settlement include approval for each school to share up to $20.5 million with athletes over the next year and $2.7 billion that will be paid over the next decade to thousands of former players who were barred from that revenue for years. One of the lead plaintiff attorneys, Steve Berman, called Friday’s news “a fantastic win for hundreds of thousands of college athletes.” The agreement brings a seismic shift to hundreds of schools that were forced to reckon with the reality that their players are the ones producing the billions in TV and other revenue, mostly through football and basketball, that keep this machine humming. The scope of the changes — some have already begun — is difficult to overstate. The professionalization of college athletics will be seen in the high-stakes and expensive recruitment of stars on their way to the NFL and NBA, and they will be felt by athletes whose schools have decided to pare their programs. The agreement will resonate in nearly every one of the NCAA’s 1,100 member schools boasting nearly 500,000 athletes. NCAA President Charlie Baker said the deal “opens a pathway to begin stabilizing college sports.” Wilken’s ruling comes 11 years after she dealt the first significant blow to the NCAA ideal of amateurism. Then, she ruled in favor of former UCLA basketball player Ed O’Bannon and others seeking a way to earn money from the use of their name, image and likeness, or NIL. That’s a term that is now as common in college sports as “March Madness” or “Roll Tide.” Wilken granted preliminary approval to the settlement last October. That sent colleges scurrying to determine not only how they were going to afford the payments, but how to regulate an industry that also allows players to cut deals with third parties so long as they are deemed compliant by a newly formed enforcement group that will be run by auditors at Deloitte. The agreement takes a big chunk of oversight away from the NCAA and puts it in the hands of the four biggest conferences. The ACC, Big Ten, Big 12 and SEC hold most of the power and decision-making heft, especially when it comes to the College Footbvall Playoff, which is the most significant financial driver in the industry and is not under the NCAA umbrella like the March Madness tournaments are. The deal looked ready to go, but Wilken put a halt to it this spring after listening to a number of players who had lost their spots because of newly imposed roster limits being placed on teams. The limits were part of a trade-off that allowed the schools to offer scholarships to everyone on the roster, instead of only a fraction, as has been the case for decades. Schools started cutting walk-ons in anticipation of the deal being approved. Wilken asked for a solution and, after weeks, the parties decided to let anyone cut from a roster — now termed a “Designated Student-Athlete” —return to their old schoolor play for a new one without counting against the new limit. Wilken ultimately agreed, going point-by-point through the objectors’ arguments to explain why they didn’t hold up. The main point pushed by the parties was that those roster spots were never guaranteed in the first place. “The modifications provide Designated Student-Athletes with what they had prior to the roster limits provisions being implemented, which was the opportunity to be on a roster at the discretion of a Division I school,” Wilken wrote. Her decision, however, took nearly a month to write, leaving the schools and conferences in limbo — unsure if the plans they’d been making for months, really years, would go into play. “It remains to be seen how this will impact the future of inter-collegiate athletics — but as we continue to evolve, Carolina remains committed to providing outstanding experiences and broad-based programming to student-athletes,” North Carolina athletic director Bubba Cunningham said. The list of winners and losers is long and, in some cases, hard to tease out. A rough guide of winners would include football and basketball stars at the biggest schools, which will devote much of their bankroll to signing and retaining them. For instance, Michigan quarterback Bryce Underwood’s NIL deal is reportedly worth between $10.5 million and $12 million. Losers, despite Wilken’s ruling, figure to be at least some of the walk-ons and partial scholarship athletes whose spots are gone. Also in limbo are the Olympic sports many college athletes play and that serve as the main pipeline for a U.S. team that has won the most medals at every Olympics since the downfall of the Soviet Union. All this is a price worth paying, according to the attorneys who crafted the settlement and argue they delivered exactly what they were asked for: an attempt to put more money in the pockets of the players whose sweat and toil keep people watching from the start of football season through March Madness and the College World Series in June. Facebook Twitter LinkedIn Email instagram youtube facebook Resources >About APRContact UsCareers About APR Contact Us Careers About APR Contact Us Careers APR Mobile App >Apple devicesAndroid devices Apple devices Android devices Apple devices Android devices"}