{"id": 134, "name": "BillMoyers.com", "domain": "billmoyers.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://billmoyers.com/spotlight/today-with-heather-cox-richardson/", "title": "Today With Heather Cox Richardson", "content": "Home Podcast Latest Stories Watch Video Essays Books Career Timeline Contact Us Video Shows Essays Books Podcasts BILLMOYERS.COM is taking a break. Explore the archive. Letters From an AmericanMarch 30, 2021April 7, 2021|Heather Cox RichardsonIt feels like the banking under the Republican Party from the Trump years is starting to erode.Continue reading It feels like the banking under the Republican Party from the Trump years is starting to erode.Continue reading It feels like the banking under the Republican Party from the Trump years is starting to erode.Continue reading Letters From an AmericanSilencing Black Voters, AgainMarch 29, 2021|Heather Cox RichardsonToday, Republicans talk about “election integrity,” but their end game is the same as that of the former Confederates after the war: to keep Black and Brown Americans away from the polls to make sure the government does not spend tax dollars on public services.Continue reading Today, Republicans talk about “election integrity,” but their end game is the same as that of the former Confederates after the war: to keep Black and Brown Americans away from the polls to make sure the government does not spend tax dollars on public services.Continue reading Today, Republicans talk about “election integrity,” but their end game is the same as that of the former Confederates after the war: to keep Black and Brown Americans away from the polls to make sure the government does not spend tax dollars on public services.Continue reading Letters From an AmericanThe Southern SystemMarch 27, 2021|Heather Cox RichardsonGeorgia's new voter suppression law has deep roots. Letters From an AmericanVoting Rights IS DemocracyMarch 26, 2021|Heather Cox RichardsonThis is the only story from today because it is the only story historians will note from this era: Did Americans defend their democracy or did they fall to oligarchy? Letters From an American\"He wants us to make it WILD\"March 25, 2021|Heather Cox RichardsonThe former president not only inspired his supporters to fight for him; he urged them to send money to defend his election in the courts.Continue reading The former president not only inspired his supporters to fight for him; he urged them to send money to defend his election in the courts.Continue reading The former president not only inspired his supporters to fight for him; he urged them to send money to defend his election in the courts.Continue reading Letters From an AmericanWill There Be a Real Discussion on Gun Control?March 24, 2021|Heather Cox RichardsonThe unfettered right to own and carry weapons has come to symbolize the Republican Party’s ideology of individual liberty. Lawmakers and activists have not been able to overcome Republican insistence on gun rights despite the mass shootings occurring with a greater frequency.Continue reading The unfettered right to own and carry weapons has come to symbolize the Republican Party’s ideology of individual liberty. Lawmakers and activists have not been able to overcome Republican insistence on gun rights despite the mass shootings occurring with a greater frequency.Continue reading The unfettered right to own and carry weapons has come to symbolize the Republican Party’s ideology of individual liberty. Lawmakers and activists have not been able to overcome Republican insistence on gun rights despite the mass shootings occurring with a greater frequency.Continue reading Letters From an AmericanCourt ChallengeMarch 23, 2021|Heather Cox RichardsonAs the Biden administration sets out to regulate business to level the playing field in the United States between workers and employers, address inequality, and combat climate change, Republicans are turning to the courts to stop him.Continue reading As the Biden administration sets out to regulate business to level the playing field in the United States between workers and employers, address inequality, and combat climate change, Republicans are turning to the courts to stop him.Continue reading As the Biden administration sets out to regulate business to level the playing field in the United States between workers and employers, address inequality, and combat climate change, Republicans are turning to the courts to stop him.Continue reading Letters From an AmericanThe Lie That SmoldersMarch 20, 2021|Heather Cox RichardsonWhile 87% of Democrats think what Trump did was wrong and that he should have been convicted of inciting the insurrection, 66% of people who believe that Trump won the election say that the riot at the Capitol is getting too much attention.Continue reading While 87% of Democrats think what Trump did was wrong and that he should have been convicted of inciting the insurrection, 66% of people who believe that Trump won the election say that the riot at the Capitol is getting too much attention.Continue reading While 87% of Democrats think what Trump did was wrong and that he should have been convicted of inciting the insurrection, 66% of people who believe that Trump won the election say that the riot at the Capitol is getting too much attention.Continue reading Letters From an AmericanCalling COVID \"China Flu\" Can Indeed Make It DeadlyMarch 19, 2021|Heather Cox RichardsonTrump's shifting relationship with China. Letters From an AmericanGOP Clinging to Their January 6th LieMarch 18, 2021|Heather Cox RichardsonThe events of January 6 left several people, including three police officers, dead, and more than 100 law enforcement officers wounded. Hundreds of people have been charged with crimes.Continue reading The events of January 6 left several people, including three police officers, dead, and more than 100 law enforcement officers wounded. Hundreds of people have been charged with crimes.Continue reading The events of January 6 left several people, including three police officers, dead, and more than 100 law enforcement officers wounded. Hundreds of people have been charged with crimes.Continue reading A Poet a Day Bill Moyers On Democracy Podcast Crossing the Aisle Democracy For Sale Earth at Risk Faith and Reason Insurrection Timeline Lessons Unlearned Letters From an American: Heather Cox Richardson Listening to America News for the 99% Poets in Performance Prison, Inc. Racism in America Secrets and Lies She Votes The 1% Court The Fight to Vote The Pandemic Timeline Trump-Russia-Ukraine Timeline US Postal Service Under Threat Working For Change World of Ideas **Subscribe to Our Newsletters** Home Posts Timeline Video Get Involved About © 2025 Doctoroff Media Group LLC Terms of Service|Privacy Policy"}