{"id": 375, "name": "The Durango Herald", "domain": "durangoherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.durangoherald.com/articles/alcaraz-produces-another-major-comeback-to-win-french-open-final-in-five-set-thriller-against-sinner/", "title": "Alcaraz Produces Another Major Comeback To Win French Open Final In Five Set Thriller Against Sinner", "content": "Log In Subscribe eEditions Homepage NewsLocal & RegionCommunityColumnistsBayfield & IgnacioEducationNation & World Local & Region Community Columnists Bayfield & Ignacio Education Nation & World Local & Region Community Columnists Bayfield & Ignacio Education Nation & World LifestyleHealthTravelFood Health Travel Food Health Travel Food New Mexico Sports Outdoors Business Arts & EntertainmentMusicFilm, TV & StreamingPerforming ArtsVisual ArtsBooks Music Film, TV & Streaming Performing Arts Visual Arts Books Music Film, TV & Streaming Performing Arts Visual Arts Books Fun & GamesComicsPuzzlesHoroscopes Comics Puzzles Horoscopes Comics Puzzles Horoscopes OpinionEditorialsLetters to the EditorOpinion Columns Editorials Letters to the Editor Opinion Columns Editorials Letters to the Editor Opinion Columns Videos & PhotosVideosPhotos Videos Photos Videos Photos Obituaries Events Calendar Jobs Classifieds Dining Real Estate Public Notices SUBSCRIBE TODAY! Blotter Most Popular Events Calendar eEditions Obituaries Jobs Classifieds Real Estate Opinion **Alcaraz produces another major comeback to win French Open final in five-set thriller against Sinner** PARIS (AP) — Bad starts in Grand Slam finals are nothing new for Carlos Alcaraz, and each time it's happened he has won the tournament anyway. But not in such dramatic style as Sunday'sFrench Openfinal, when the Spaniard rallied from two sets down and saved three match points to beat top-ranked Jannik Sinner 4-6, 6-7 (4), 6-4, 7-6 (3), 7-6 (10-2) for his fifth major title in as many finals. It was Alcaraz's second straight French Open title with a comeback, after trailing 2-1 in sets to Alexander Zverev inlast year’s final, and a third major title from behind, following his five-set win against Novak Djokovic in the2023 Wimbledon final. “When the situations are against you, then you have to keep fighting. It's a Grand Slam final, it's no time to be tired, no time to give up,” Alcaraz said. “Do I enjoy that? The real champions are made in those situations.\" In producing one of the greatest comebacks in the history of the clay-court tournament on Sunday, he emulated Djokovic’s feat from the2021 finalat Roland-Garros — when the now 24-time major winner fought back from two sets down to beat Stefanos Tsitsipas. “Today it was all about the belief in myself,” Alcaraz said. He became just the ninth player to rally from two sets down and win a Grand Slam final in the Open Era, which began in 1968. The first was Bjorn Borg in 1974 against Manuel Orantes at the French Open, where Ivan Lendl and Andre Agassi achieved the same feat. Rafael Nadal also did so, at the Australian Open, and Sinner too. It was the first time that Sinner had lost a Grand Slam final, but the fifth time in succession he has now lost to Alcaraz, who clinched the 20th title of his career at the age of 22. Unending drama It was also the longest-ever French Open final — 5 hours, 29 minutes — in the Open Era. It wasso tightthat Sinner won 193 points, Alcaraz 192. It might not have been close to those numbers. For after 3 hours, 43 minutes, Sinner had his first match point. But with just over five hours since the match began, Alcaraz served for the title at 5-4 up. The drama was still not over. Sinner made a remarkable retrieve from yet another superb Alcaraz drop shot. At the very limit he could stretch to, Sinner glided the ball over the net, with the ball landing with the softness of an autumn leaf and out of Alcaraz’s reach to make it 15-40. When Sinner won the game to make it 5-5, it was his turn to milk the applause and he was two points away from victory in the 12th game, with Alcaraz on serve and at 15-30 and at deuce. But Alcaraz made a staggering cross-court backhand to make it 6-6 and force a tiebreaker, with the crowd going wild when Alcaraz’s cross-court winner made it 4-0. “Just amazing the support you have given me today,” Alcaraz said. “During the whole tournament.” Little sleep for Sinner Alcaraz won the match with a superb forehand pass down the line, fell onto his back to celebrate, then rushed over to dance and hug the team members in his box. “I'm very happy for you, and you deserve it, so congrats,” the 23-year-old Sinner told Alcaraz. ”It’s an amazing trophy, so I won't sleep tonight very well, but it's okay.\" Nightmare ninth Sinner may have nightmares about the ninth game of the fourth set. Serving to stay in the match at 5-3 down, Alcaraz trailed 0-40 to give Sinner three match points. On the second match point, and with Alcaraz on second serve, he hit a hurried backhand which landed just out. He then hit a forehand into the net for another unforced error, making it deuce. The crowd chanted “Carlos, Carlos,” and roared when Alcaraz hit an ace, then gave him a standing ovation when his audacious forehand down the line went in — to win that game — and again when he broke Sinner’s serve to level at 5-5. “That’s what the real champions have done in their whole careers. Not being afraid,” Alcaraz said. “That’s why I had my best tennis in crucial moments.” Sinner's sportsmanship Despite having just lost a chance to win another major, Sinner showed great sportsmanship to give Alcaraz the point for a 30-0 lead in the 11th game. Alcaraz's forehand landed at the back of the court and, as the chair umpire prepared to come down and inspect the mark, Sinner told her to go back because he saw the ball was in. The crowd applauded him politely, but the noise level erupted when Alcaraz won the fourth-set tiebreaker to level the match. By now, the fans had what they wanted — an Alcaraz comeback — and fans showed their unbridled delight when he won points with astounding drop shots from deep or leapt to bang cross-court forehand winners. Alcaraz hit 70 winners, compared to 53 for Sinner, who might have been feeling like it was a case of déjà vu. Alcaraz beat Sinner in the French Open semifinals last year, coming back from2-1 downin sets. He beat Sinner last month in theItalian Open final— the tournament where Sinner returned from hisdoping ban. Alcaraz now owns a 22-1 record on clay this year. Celebrities watch a classic final On a warm day with a light breeze caressing Court Philippe-Chatrier, big names turned out. Dustin Hoffman and Natalie Portman, movie director Spike Lee, singer Pharrell Williams, Formula 1 driver George Russell and world rugby star Antoine Dupont watched what promised to be a tight contest. Sinner seemed on the way to victory, but No. 2-ranked Alcaraz fought back. After clinching the third set with a volley at the net, he stood in the middle of the court, shaking his fist in celebration. One of the greatest finals in French Open history was just getting started. —- AP Sports Writer Samuel Petrequin contributed. ___ AP tennis:https://apnews.com/hub/tennis **RecentLocal News** Choose from several print and digital subscription packages Sign up for our daily email newsletter or to receive breaking news delivered to your inbox: © 2025 Durango Herald |Ballantine Communications, Inc.All Rights Reserved. |Terms of Use|Privacy Policy We use cookies to improve your experience on our site. By using our site, you consent to ourpolicies **Account info** Name: Screen name: Email:"}