{"id": 588, "name": "Gay City News", "domain": "gaycitynews.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jobs.gaycitynews.com/2025/05/12/administrative-bookeeping-assistant-for-park-slope-gowanus-climate-action-company/", "title": "Administrative Bookeeping Assistant For Park Slope Gowanus Climate Action Company", "content": "List Your Job Find a JobAll JobsAdmin & OfficeFinanceHealthcareLegalRestaurant & HospitalitySales & MarketingTechnology All Jobs Admin & Office Finance Healthcare Legal Restaurant & Hospitality Sales & Marketing Technology All Jobs Admin & Office Finance Healthcare Legal Restaurant & Hospitality Sales & Marketing Technology Our NetworkamNYBronx TimesBrooklyn PaperCaribbean LifeDan’s PapersGay City NewsLong Island PressNoticiaPoliticsNYQNS amNY Bronx Times Brooklyn Paper Caribbean Life Dan’s Papers Gay City News Long Island Press Noticia PoliticsNY QNS amNY Bronx Times Brooklyn Paper Caribbean Life Dan’s Papers Gay City News Long Island Press Noticia PoliticsNY QNS Contact Us List Your Job Find a JobAll JobsAdmin & OfficeFinanceHealthcareLegalRestaurant & HospitalitySales & MarketingTechnology All Jobs Admin & Office Finance Healthcare Legal Restaurant & Hospitality Sales & Marketing Technology All Jobs Admin & Office Finance Healthcare Legal Restaurant & Hospitality Sales & Marketing Technology Our NetworkamNYBronx TimesBrooklyn PaperCaribbean LifeDan’s PapersGay City NewsLong Island PressNoticiaPoliticsNYQNS amNY Bronx Times Brooklyn Paper Caribbean Life Dan’s Papers Gay City News Long Island Press Noticia PoliticsNY QNS amNY Bronx Times Brooklyn Paper Caribbean Life Dan’s Papers Gay City News Long Island Press Noticia PoliticsNY QNS Contact Us Search Jobs:AllSales & MarketingTechnologyLegalAdmin & OfficeFinanceHealthcareRestaurant & Hospitality Find a Job Our Network amNY Bronx Times Brooklyn Paper Caribbean Life Dan’s Papers Gay City News Long Island Press Noticia PoliticsNY QNS List Your Job Contact Us **Administrative/Bookeeping Assistant for Park Slope/ Gowanus climate action company** Bookkeeping& Administrative Assistant(Part-Time) Location:Brooklyn Office, GreenMaxCapital GroupWorking Hours:(9:00 AM – 2:00 PM) Type:(Hybrid – 3 days/week in office) **AboutGreenMax Capital Group** GreenMax Capital Group is a premier fund management and advisory firmdedicated to advancing sustainable development across emerging markets. Since1994, we have been at the forefront of catalyzing investment inclimate-positive infrastructure, renewable energy, and financial inclusion,with a proven track record in 80+ countries across five continents. Our mission is to accelerate the just energy transition by unlockingcapital for high-impact projects in energy, transport, agriculture, industry,and WASH (water, sanitation, and hygiene). We work with project developers,investors, financial institutions, governments, and donor agencies to designand implement market-transforming initiatives that drive economic growth,climate resilience, and social equity. From our roots as a consultancy, we have evolved into a leadingtransaction advisory and fund management firm, combining deep technicalexpertise with hands-on investment experience. With seven registered entitiesacross Ireland (HQ), the U.S., Poland, Kenya, and Chile, and a global presenceacross offices in Africa (Nairobi, Kinshasa, Lome, Lagos, Cotonou), Europe(Warsaw, Zagreb), and Latin America (Santiago), GreenMax is uniquely positionedto bridge financing gaps in the world’s most critical emerging markets. Thoughheavily focused today on Sub-Saharan Africa, we seek to expand our activitiesin the other regions where we work as well. **Position Summary:[1]** If ClimateChange and a Just Energy Transition for the planet are high on your list ofglobal priorities, this could be your dream job—right in our Park Slope-Gowanusneighborhood. GreenMax is seeking a detail-oriented and organized Bookkeepingand Administrative Assistant to support its Brooklyn office operations. This is an ideal opportunity for a parent returningto the workforce, offering a manageable part-time schedule with the possibilityof expanding to full-time (it’s not guaranteed and will be based on businessneeds and performance).The positioninvolves handling general administrative tasks, financial management support,and office coordination. You’ll handle financial, administrative, and officemanagement tasks, ensuring smooth operations in our Brooklyn office. If youhave experience in bookkeeping, banking relations, and office coordination,we’d love to hear from you! **** **Key Responsibilities:** Office Management: ○Manage incomingmail at the Brooklyn office and ensure timely distribution to the relevant teammembers. ○Oversee officesupply inventory and coordinate replenishment when necessary. ○Maintainlandlord-tenant relationships and handle office lease-related matters. Financial & Accounting Support: ○Support the financeteam in general accounting and financial management. ○Prepare invoices,timesheets, and CEA contracts. ○Assist withbookkeeping, invoicing, timesheets, and contract preparation. ○Manage US bankingand credit card relations, including reconciliation and transaction monitoring. ○Support month-endclosing and financial reporting as needed. ○Oversee US healthinsurance documentation and compliance. Administrative Support: ○Perform generaladministrative tasks as required. ○Maintain organizedrecords for easy retrieval and audit purposes. ○Assist withbookkeeping and financial documentation. ○Handle ad hocadministrative tasks to support smooth office operations. **Qualifications &Requirements:** ●Proven experienceas an Administrative Assistant or in a similar role. ●Strong bookkeepingand financial management skills. ●Comfortable workingwith numbers and managing basic financial transactions. ●Proficiency inMicrosoft Excel and general computer literacy. ●Excellentorganizational and multitasking abilities. ●Effectivecommunication skills; fluency in English is required. ●Knowledge ofFrench, Spanish, or Portuguese is an added advantage, but not a requirement. ●Well-educated witha background in administration or finance. **Application Process:** Interested candidates should email their resumeand a brief cover letter outlining their relevant experience and interest inthe role toemwai@greenmaxcap.comwith the subject line:“Application:Bookkeeping & Admin Assistant”. Applications will be reviewed on a rolling basis. We appreciate allsubmissions, but will only contact shortlisted candidates. **Salary or Hourly Rate** **Apply now:** **About the Author** **Related Jobs** MSecretary Customer ServiceRepresentative **Featured Jobs** New York LifeFinancialProfessional MMDG Design + Construction LLCSection 3ConstructionJobOpportunity SSusquehanna Printing CompanySales Account Manager MMDG Design & Construction LLCM/WBE JobOpportunity HHouse of Nails By NattyWaxer/ lash tech HHouse of Nails by NattyReceptionist/Salon Assistant **Post a job** Get started **Stories from Around NYC** **Tribeca Film Festival rolls out more than two dozenqueer movies** **Protesters arrested for occupying Maersk building in Midtown for warin Gaza** **Invested in NYC: Citizens Bank’s Vision for Business and Community with RebeccaO’Connell** **Sunny’s Bar in Red Hook defies odds, recognized for inspiring disastercomeback** Home Add a Job Contact Us Networking Events © 2025 Schneps Media Privacy Policy Terms of Use Sections Add a Job Contact Us Events Gay City News"}