{"id": 1387, "name": "The Jakarta Post", "domain": "thejakartapost.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://weekender.thejakartapost.com/prosperity-and-progress/2025/06/05/not-just-a-fix-local-coffee-chains-are-brewing-a-cultural-movement.html", "title": "Not Just A Fix Local Coffee Chains Are Brewing A Cultural Movement.html", "content": "The Jakarta Post Affiliate OrganizationsTenggara StrategicsB/NDL StudiosMagdalene Tenggara Strategics B/NDL Studios Magdalene Tenggara Strategics B/NDL Studios Magdalene **Sections** The Weekend Digest Home The Neighborhood Arts Culture and Entertainment Away We Go Conversations **Latest** **Sections** Prosperity and Progress Home Consumer Insights Innovation Center Living Spaces Market Pulse Wealth Work it Right **Latest** **Sections** Life Home Family Matters Fiction Legacy Luxury Pawrenting Style Table Setting Weekend Five What We're watching **Latest** **Culture and Entertainment** **Culture and Entertainment** **Culture and Entertainment** **Culture and Entertainment** Can't find what you're looking for? **Sections** The Weekend Digest Home The Neighborhood Arts Culture and Entertainment Away We Go Conversations **Latest** **Sections** Prosperity and Progress Home Consumer Insights Innovation Center Living Spaces Market Pulse Wealth Work it Right **Latest** **Sections** Life Home Wellness Family Matters Fiction Legacy Luxury Pawrenting Style Table Setting Weekend Five What We're watching **Latest** Features The Weekend DigestThe Weekend Digest HomeThe NeighborhoodArtsCulture and EntertainmentAway We GoConversations The Weekend Digest Home The Neighborhood Arts Culture and Entertainment Away We Go Conversations The Weekend Digest Home The Neighborhood Arts Culture and Entertainment Away We Go Conversations Prosperity and ProgressProsperity and Progress HomeConsumer InsightsInnovation CenterLiving SpacesMarket PulseWealthWork it Right Prosperity and Progress Home Consumer Insights Innovation Center Living Spaces Market Pulse Wealth Work it Right Prosperity and Progress Home Consumer Insights Innovation Center Living Spaces Market Pulse Wealth Work it Right LifeLife HomeWellnessFamily MattersFictionIn FrameLegacyLuxuryPawrentingStyleTable SettingWeekend FiveWhat We're readingWhat We're listeningWhat We're watching Life Home Wellness Family Matters Fiction In Frame Legacy Luxury Pawrenting Style Table Setting Weekend Five What We're reading What We're listening What We're watching Life Home Wellness Family Matters Fiction In Frame Legacy Luxury Pawrenting Style Table Setting Weekend Five What We're reading What We're listening What We're watching E-Post Newsletter **Share This Article** **Change Size** Prosperity And Progress Consumer Insights **Share This Article** **Change Size** A second coffee wave has been sweeping Indonesia. This time, it’s proudly local, hyper-convenient and surprisingly sweet. That was evident at the Asia edition of World of Coffee 2025, which ran from May 15 to 17 at the Jakarta International Convention Center. As I inched my way across the packed room, sales attendants whirled around, handing out cups of coffee like they were sample packets of tissues. World of Coffee, organized by the trade group Specialty Coffee Association (SCA), is one of the industry’s most important global events, and the Jakarta event marked the first time it was hosted in a coffee-producing nation. Its arrival in Indonesia can only mean one thing: The local coffee industry isn’t just staying relevant, it’s booming. Take a look around Jakarta, and you’ll see proof everywhere. Local brands like Kopi Kenangan, Janji Jiwa and Tuku have expanded at breakneck speed, popping up in malls, at street corners and even on wheels. Kopi Kenangan alone has over 800 outlets nationwide, while Janji Jiwa opened 700 stores in 50 cities in just 18 months after the brand’s launch, earning a place in the Indonesian Museum of World Records (MURI) in 2019 for fastest growth. Hot on its heels came Tomoro Coffee, which opened some 600 locations within two years of its 2022 launch. **The Weekender** **Coming to you every other Friday** **Thank you!** **For signing up to our newsletter.** What is fueling this sudden growth? To try and find out why, we ran an informal survey involving 114 respondents. Of these, 70 percent told us they preferred local coffeehouse chains over global giants like Starbucks and Harlan & Holden. The top reasons? Affordability, convenience and local pride. But that’s not the full story. All day, every day Coffee isn’t just a beverage in Indonesia. It’s a daily rhythm, a productivity ritual and increasingly, a cultural statement. While wellness trends like matcha and kombucha have tried to nudge their way in, coffee continues to evolve and endure. How much people are willing to pay for their daily caffeine fix: Rp 20,000 - Rp 50,000 per serving In our survey, 77 percent of respondents said coffee was an essential part of their day. While 39 respondents cited habit, 38 said they simply couldn’t function without it. For many though, it’s about more than just a jolt of energy; it’s also about comfort, convenience and accessibility. And that’s where local brands are winning. Most respondents said they drank one cup a day, spending between Rp 20,000 (US$1.22) and Rp 50,000 per cup. Local chains hit that sweet price spot, giving them an advantage over international chains that tend to charge more than Rp 50,000 for a single serving. Place and space The way people consume coffee varies as much as the drinks. Some grab a cup to go, others linger through work meetings or social catch-ups. And increasingly, they are choosing places based on not just the menu but also mood. . (Photo courtesy of Expat. Roasters/.) “In Jakarta, people drink coffee all day, but they’re choosing the location and ambiance as much as they are choosing the coffee,” says Shae Macnamara, founder of Expat Roasters. “At lunch, it’s more about sitting down, not so much in the afternoon. Then in the evening, street cafés become more popular.” 70% of 114 respondents prefer local coffee shops to foreign brands. One respondent says he sticks to a coffee shop near his house in Bintaro, Tangerang, simply because “the baristas are nicer”. Others choose their coffee venue to match whatever activity they’re doing, whether to chill with friends or to work, from neither an office nor home. “Any café will always have the same menu, like an Americano or a latte. For me, the contributing factor is the café’s vibe,” says another. The point is, coffee now follows people’s lifestyles, not the other way around. It seems that local chains, with their lean setups and mobile models, are simply adapting faster. Innovation by the cup Tuku, Fore and Kopi Kenangan are crowd favorites among our respondents, as these offer budget-friendly drinks in strategic locations. But newer players are redefining what a café looks like. Jago Coffee, for instance, takes coffee to the streets, literally. Modeled after old-schooljamu(herbal medicine) carts, Jago’s mobile coffee bars bring the café to the customer. “This allows us to be freer in building more [sales points],” says Yoshua Tanu, the man behind Jago and its fancier sibling, Common Grounds. “I can turn four stores into 20 outlets without increasing the price.” Janji Jiwa has followed suit, launching its own “coffee on wheels” program to reach neighborhoods and public spaces. “If you want to provide great quality products with good affordability, you have to know how to beat this notion of location, location, location,” Yoshua explains. The art ofes kopi susu While tastes vary, certain drinks dominate the market. Chief among them is the belovedes kopi susu, a creamy, sweet iced coffee made with Robusta beans and condensed milk. It is approachable, affordable and perfectly attuned to the Indonesian palate. Giving it a run for its money iskopi gula aren(coffee with palm sugar), served hot or cold. Both stand in contrast tocaffé latte, made from espresso and steamed milk, which traces its roots to Italy. At the same time, Macnamara has observed a clear generational divide. “The older crowd is still drinking long blacks, cappuccinos and Americanos, but the younger generation is really excited by iced coffees and thees kopi susumovement,” he says. And the trend is catching on. More than 40 percent of respondents to our survey say beans and flavor matter to them, even if they’re not coffee connoisseurs. Homegrown beans The local café boom isn’t just about retail; it’s also about identity. “These days, especially in Jakarta, people understand that local brands also mean great brands,” says Mikael Jasin, 2024 World Barista Champion and chief innovation officer at Fore Coffee. “COVID-19 made people realize that they need to support local businesses.” Indonesia is the world’s ninth-largest coffee exporter, raking in $1.1 billion in 2023. But increasingly, domestic drinkers are valuing what’s grown at home. In our survey, 39 percent of respondents said they’re willing to pay more for locally sourced beans, while more than half said sustainability and ethical sourcing influenced their buying decisions. . (Photo courtesy of So So Good Coffee Company/.) “Some of the best coffee in the world is right here at our doorstep,” says Macnamara. “We've got single origins from Flores, amazing fruit flavors from Sumatra and sweet ones from Kintamani.” Jago Coffee, for example, works directly with farmers, some of who have been partnering with Yoshua for over a decade. “For the Indonesian coffee culture to change this much, the level of education and advancement of both coffee players and customers has changed a lot in the past 10 years,” he says. In today’s Indonesia, coffee is about more than flavor or function. It’s about authenticity, accessibility and local connections. Whether you’re drinkinges kopi susufrom a cart in South Jakarta or settling into a full-Wi-Fi café for a work sprint, one thing is clear: The future of coffee here isn’t imported, it’s homegrown. **Beyond billions: Building a legacy with family offices** **Beyond billions: Building a legacy with family offices** **Related Article** **The Gen Z shift: From booze to brews** **The Gen Z shift: From booze to brews** **Not just a fix: Local coffee chains are brewing a cultural movement** **Not just a fix: Local coffee chains are brewing a cultural movement** **Beyond billions: Building a legacy with family offices** **Beyond billions: Building a legacy with family offices** **The silver generation is rising** **The silver generation is rising** **Beyond bloodlines: Surviving the third-generation curse** **Beyond bloodlines: Surviving the third-generation curse** **Trendy tabletop: Board game cafés are your next favorite third space** **Trendy tabletop: Board game cafés are your next favorite third space** **The Weekend Digest** The Neighborhood Arts Culture and Entertainment Away We Go Conversations **Prosperity and Progress** Consumer Insights Innovation Center Living Spaces Market Pulse Wealth Work it Right **Life** Wellness Family Matters Fiction Legacy Luxury Pawrenting Style Table Setting Weekend Five What We're watching About Cyber Media Guidelines Contact Advertise Paper Subscription Privacy Policy Discussion Guideline Term of Use"}