{"id": 17, "name": "WPVI - Philadelphia - Action News", "domain": "6abc.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://6abc.com/post/amber-alert-nola-dinkins-homicide-investigation-underway-police-say-mother-gave-false-abduction-report-newark-delaware/16718734/", "title": "Amber Alert Nola Dinkins Homicide Investigation Underway Police Say Mother Gave False Abduction Report Newark Delaware", "content": "homicide investigation **Body found in Maryland amid search for missing 3-year-old girl at center of Amber Alert in Delaware** NEWARK, Del. (WPVI) --A body has been found in Maryland amid the search for a missing 3-year-old girl following an Amber Alert in Delaware. Maryland state police say the body of a child was found around 1:45 p.m. Wednesday in Cecil County. It's not yet known if the body is that of Nola Dinkins. Police say they are awaiting positive identification. There was no immediate word on the child's cause of death. Police say autopsy results are pending. Dinkins was reported missing on Tuesday night but the alert was canceled late Wednesday morning. Nola's mother, Darrian Randle, is facing charges for filing a false police report. Randle, a resident of Newark, is being held on $1 million cash bail. Chopper 6 was over Perryville Community Park in Perryville, Maryland on Wednesday afternoon where a police investigation connected to this case is underway. In a news conference earlier Wednesday, a Delaware State Police spokesperson said Randle gave police false statements about the girl's disappearance. Police say Randle told them that Nola was taken by a man at gunpoint along the 500 block of Gender Road around 7:16 p.m. Tuesday in Newark, Delaware. Randle allegedly told police that Nola was upset, so she pulled over to the side of the road. That's when, police say, Randle allegedly told them the little girl was abducted by a man with a gun. Anyone with information is asked to contact the Maryland State Police North East Barracks at (410) 996-7800 or 911. **Related Topics** DELAWARE NEW CASTLE COUNTY NEWARK (DELAWARE) NEWARK MARYLAND HOMICIDE INVESTIGATION AMBER ALERT MISSING GIRL ABDUCTION KIDNAPPING FALSE REPORT **Homicide Investigation** **2 dead in separate overnight shootings in Philly: police** **2 dead in separate overnight shootings in Philly: police** **Son-in-law charged in Palmer Twp. double homicide** **Son-in-law charged in Palmer Twp. double homicide** **2 teenagers found dead in remote area near Phoenix, officials say** **2 teenagers found dead in remote area near Phoenix, officials say** **Karen Read retrial underway in killing of her police officer boyfriend** **Karen Read retrial underway in killing of her police officer boyfriend** **Top Stories** **Man who fled to Mexico with teen in 2018 now charged with raping child** 14 minutes ago **Man who fled to Mexico with teen in 2018 now charged with raping child** 14 minutes ago **Multiple fires at same Levittown home investigated as arson** 10 minutes ago **Multiple fires at same Levittown home investigated as arson** 10 minutes ago **What you need to know ahead of Philadelphia 'No Kings Protest'** **What you need to know ahead of Philadelphia 'No Kings Protest'** **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Inmate mistakenly released recaptured 'in less than 24 hours'** **Inmate mistakenly released recaptured 'in less than 24 hours'** **Philadelphia protest: 15 arrested in Center City, 2 officers injured** **Philadelphia protest: 15 arrested in Center City, 2 officers injured** **AccuWeather: Turning hot and more humid tomorrow** 29 minutes ago **AccuWeather: Turning hot and more humid tomorrow** 29 minutes ago"}