{"id": 785, "name": "KSTK - NPR - Wrangell", "domain": "kstk.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kstk.org/2025/06/04/qa-tribal-administrator-esther-aaltseen-reese-will-soon-leave-wrangell-cooperative-association-she-reflects-on-her-work-before-moving-on-with-tlingit-and-haida/", "title": "Qa Tribal Administrator Esther Aaltseen Reese Will Soon Leave Wrangell Cooperative Association She Reflects On Her Work Before Moving On With Tlingit And Haida", "content": "NewsLocal NewsSoutheast NewsAlaska NewsNational News Local News Southeast News Alaska News National News Local News Southeast News Alaska News National News AboutAbout Stikine River RadioMission & DiversityBoard of DirectorsKSTK StaffPublic Media Code of IntegrityCommunity Advisory BoardOn Air Commentary PolicyCommenting GuidelinesFinancial InformationLocal Content and ServicesAnnual EEO About Stikine River Radio Mission & Diversity Board of Directors KSTK Staff Public Media Code of Integrity Community Advisory Board On Air Commentary Policy Commenting Guidelines Financial Information Local Content and Services Annual EEO About Stikine River Radio Mission & Diversity Board of Directors KSTK Staff Public Media Code of Integrity Community Advisory Board On Air Commentary Policy Commenting Guidelines Financial Information Local Content and Services Annual EEO ContributeBecome a MemberMembership FAQUnderwriting & SponsorshipGet Involved! Become a Member Membership FAQ Underwriting & Sponsorship Get Involved! Become a Member Membership FAQ Underwriting & Sponsorship Get Involved! Program Schedule Contact Us Employment Events Select Page **Q&A: Tribal Administrator Esther Aaltséen Reese will soon leave Wrangell Cooperative Association; she reflects on her work before moving on with Tlingit and Haida** Posted by Colette Czarnecki |Jun 4, 2025 Esther Aaltséen Reese has been with the Wrangell Cooperative Association for the past 13 years. But now that’s about to change. Reese is leaving her role as tribal administrator. She’ll be moving to Juneau to serve as the Chief Operating Officer for the Tlingit and Haida Regional Housing Authority. She said she will end her current position and start her new one in mid-June. KSTK’s Colette Czarnecki talked with Reese about her life – as it was and what’s to come. The author lightly edited the interviews for brevity and clarity. It’s this entire mix of emotions. I am feeling very proud of all of the work that the WCA staff and council and I have done over the past years. I’ve lived in Wrangell for 22 years now, and I’ve been with the tribe for 13. But in the mix of that is excitement, because I’m going to be working in something that studies have shown as the most needed sector in Alaska, which is housing. Also really honored to have the opportunity to have the president and CEO of the Regional Housing Authority as a mentor, and that’s Jackie Pata. I oversee all of the departments within the tribe. So Transportation, Earth Branch, Tourism, and we’ve got a whole bunch of different departments and a bunch of different projects. This position is a multifaceted one that requires a lot of different skills. You sort of do a little bit of everything. You’re serving as the liaison between the tribal council and the local clans. We’re one of the few tribes that actually work hand in hand with our clans. And that’s a really important part of the job. The first thing, actually, that comes to mind is looking at a problem and figuring out how to creatively come up with a solution. Not only have it be impactful for Wrangell, but have it be impactful across the state and across the nation. There had been a lot of historic things that have happened in the last year. We were able to change some of the ways the federal government helps people when there are natural disasters. Because of our work through FEMA, our traditional subsistence foods are now covered. We created a precedent throughout the whole nation. And food security is so important. When you’re a small tribe, you have to be creative. I worked as a financial advisor and a business manager for First Union Securities. I specialized in financial planning for women, which was important to me, because at the time, it was sort of a something that wasn’t well understood by the demographic that I was working with and to just see them light up and get excited about something that they felt was intimidating, was really meaningful. I worked for the state as a retirement and benefits specialist, and then worked in a family business with salmon restoration. And then started with the tribe, first as a transportation planner. When I came back to Wrangell from living on the East Coast, I really realized that our people have such a rich tradition, and there’s so much that’s needed. how can we revitalize our culture, how can we save our languages and our stories? How can we teach our children and how can we do that in a way that’s meaningful and impactful, so that we can literally show the whole world what it means to live in balance and to have reciprocity and walk gently on the earth? And that, to me, was just really inspiring. If I can end my life having even helped a little bit with that, I will feel like it’s a life well lived. So the Tlingit and Haida Regional Housing Authority is the tribally designated housing authority for Southeast Alaska, and they manage funding for housing for all of our tribal citizens. I have so many ideas to do with that, but it’s basically like the vice president position. The Housing Authority does so much. They are growing. They’re developing. They have mastered the model that we’re doing here in Wrangell where you use multiple funding sources to really reach your ultimate goals. They’ve saved people so much money with tax preparation. They have financial literacy classes so I can, once again, do my financial planning for women. I have so many near and dear memories. I mean, I’ll probably start crying if I talk about too many of them. One that comes to mind is the carving shed was built 10 years ago for totem carving and to see that first huge log being rolled into that carving shed, and seeing it being used for the purpose for which it was built, and seeing our first totem project here in 37 years, we’ll have our first totem raising in 38 years in July, and to realize that I was able to be here and be a part of that history. It’s been an honor to be here to work with everybody within the whole community, the Forest Service, the city, all of the wonderful partnerships that we’ve put into place, they’re just memories I’ll take with me for the rest of my life. So yeah, gunalchéesh for the honor. It’s been absolutely wonderful. Share: Local Zone Forecast Marine Weather Lincoln Rock Stikine River Gauge Tsunami Center City of Wrangell Nolan Center Theater Wrangell Salvation Army Food Pantry Wrangell Housing Assistance Wrangell Cooperative Association FB Alaska COVID Information Hub Wrangell Cooperative Association © 2016 Wragell Radio Group"}