{"id": 13, "name": "KMTV - Omaha News", "domain": "3newsnow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.3newsnow.com/news/local-news/in-your-neighborhood/today-in-your-neighborhood/today-in-your-neighborhood-free-way-to-combat-the-summer-slide-for-students-plus-army-tank-gets-a-facelift", "title": "Today In Your Neighborhood Free Way To Combat The Summer Slide For Students Plus Army Tank Gets A Facelift", "content": "Menu NewsLocalIn Your NeighborhoodPoliticsNationalEducationSkytracker 3Submit News Tips Local In Your Neighborhood Politics National Education Skytracker 3 Submit News Tips Local In Your Neighborhood Politics National Education Skytracker 3 Submit News Tips In Your Neighborhood Today In Your Neighborhood WeatherDaily ForecastRadarHourly Forecast7-Day ForecastWeather CamsClosings and DelaysWeather AlertsWeather Blog Daily Forecast Radar Hourly Forecast 7-Day Forecast Weather Cams Closings and Delays Weather Alerts Weather Blog Daily Forecast Radar Hourly Forecast 7-Day Forecast Weather Cams Closings and Delays Weather Alerts Weather Blog SportsCollege World SeriesBoys High School BasketballGirls High School BasketballCreighton BasketballCreighton VolleyballNebraska BasketballNebraska FootballNebraska VolleyballUNO SportsSports College World Series Boys High School Basketball Girls High School Basketball Creighton Basketball Creighton Volleyball Nebraska Basketball Nebraska Football Nebraska Volleyball UNO Sports Sports College World Series Boys High School Basketball Girls High School Basketball Creighton Basketball Creighton Volleyball Nebraska Basketball Nebraska Football Nebraska Volleyball UNO Sports Sports Traffic Morning Lift Positively the Heartland Mission: Service Omaha Extra EntertainmentTV Listings TV Listings TV Listings SpotlightBusiness Spotlight Business Spotlight Business Spotlight MarketplaceHome ProsYour Health MattersContestsHalloween Home Pros Your Health Matters Contests Halloween Home Pros Your Health Matters Contests Halloween Pet photo submissions About UsContact UsStaffJobsTV Listings Contact Us Staff Jobs TV Listings Contact Us Staff Jobs TV Listings Sign In Newsletters Sign Out Manage Emails Apps Careers Search In Your Neighborhood Central Omaha Northwest Omaha North Omaha South Omaha West Omaha Northeast Nebraska Lincoln Papillion/LaVista/Ralston/Bellevue Gretna Southwest Iowa Council Bluffs **Actions** Facebook Tweet Email **Today in your neighborhood: Free way to combat the summer slide for students, Plus Army tank gets a facelift** OMAHA, Neb. (KMTV) — Good Thursday morning, neighbors! About half of our neighborhoods will see light rain this afternoon and evening. Those that stay dry will be in the mid 70s. Thechance for rain continuesinto the weekend.Let's check out the latest news from your neighborhood. NEIGHBORHOOD CHECK-IN Ralston neighbors expresstraffic safety concernsat the city council meeting Tuesday night. On the list, drunk driving, speeding and people running stop signs. Plus, Omaha Public Schools startssummer library reading programto help combat the summer slide. These stories and more in today's Neighborhood Check-In. IN CASE YOU MISSED IT Omaha's new wheelchair basketball program is tipping off:Nebraska Adaptive Sports and CHI Health Immanuel have partnered with Omaha Parks and Rec to start a new free program where anyone of any skill level can come and learn how to play. Watch thestory here. Mission Service:Members of the American Legion Post 32 cleaned up and repainted the display tank the organization received in November. Members say they are excited to have neighbors come out to see the new look. Download our apps today for all of our latest coverage. Get the latest news and weather delivered straight to your inbox. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **More News In Your Neighborhood** **More News In Your Neighborhood** News Sports Weather Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Public File Contact FCC Application Accessibility Statement Scripps Media Trust Center Closed Captioning Contact 3NewsNow 3newsnow/?hl=en 3NewsNowOmaha"}