{"id": 2032, "name": "Legal Reader", "domain": "legalreader.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.legalreader.com/shumaker-announces-service-line-leaders-and-launches-immigration-and-technology-data-privacy-cybersecurity-ai-service-lines/", "title": "Shumaker Announces Service Line Leaders And Launches Immigration And Technology Data Privacy Cybersecurity Ai Service Lines", "content": "RSS Feed Find us onFacebook Follow us onTwitter Home Business Health & Medicine Lawsuits & Litigation News & Politics Science Positive News Crimes **Shumaker Announces Service Line Leaders and Launches Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines** Share on Facebook Tweet this Story **The addition of the Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines reflects Shumaker’s proactive, client-centric approach.** The addition of the Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines reflects Shumaker’s proactive, client-centric approach. The addition of the Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines reflects Shumaker’s proactive, client-centric approach. TOLEDO, OH —Shumaker is pleased to announce the appointment of new Service Line Leaders in conjunction with the launch of two strategic additions to its legal offerings: the Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines. These developments underscore Shumaker’s ongoing commitment to anticipating client needs and delivering innovative legal solutions in today’s global and digital landscape. Newly appointed Service Line Leaders include: Maria del Carmen Ramos, Partner and Immigration National Service Line Leader Olivia Johnson, Partner and Immigration Regional Service Line Leader Jade Davis, Partner and Technology, Data Privacy, Cybersecurity & AI National Service Line Leader Brian Focht, Senior Counsel and Technology, Data Privacy, Cybersecurity & AI Regional Service Line Leader “As the legal landscape continues to evolve, we’re proud to expand our services in key growth areas and appoint experienced leaders to guide these efforts,” said Jennifer Compton, Managing Partner and Chair of the Management Committee at Shumaker. “Maria, Olivia, Jade, and Brian bring deep knowledge and vision to their respective areas, and their leadership will ensure our clients receive forward-thinking, results-driven counsel.” The addition of the Immigration and Technology, Data Privacy, Cybersecurity & AI Service Lines reflects Shumaker’s proactive, client-centric approach. These practice areas address some of the most pressing legal challenges businesses face today—from cross-border workforce mobility and compliance to data protection, digital risk, and artificial intelligence governance. With a strong foundation of collaboration and strategic insight, Shumaker continues to expand its capabilities to support clients navigating complex regulatory environments, technological disruption, and global opportunities. ABOUT SHUMAKER Moving forward with confidence. Shumaker’s team of 300+ attorneys and advisors work together to help move your business forward with confidence. **Join the conversation!** **Trending** Call for submissions for Volume 3 Issue 1 by Legal Research & Analysis Call for submissions for Volume 3 Issue 1 by Legal Research & Analysis Call for Submissions for Volume 3 Issue 1 by Trends in Intellectual Property Research Call for Submissions for Volume 3 Issue 1 by Trends in Intellectual Property Research Blog vs YouTube Over Other Websites: How to Choose Blog vs YouTube Over Other Websites: How to Choose Investigation Reveals Goodyear’s Dunlop D402 Tires Have Caused Dozens of Motorcycle Accidents Investigation Reveals Goodyear’s Dunlop D402 Tires Have Caused Dozens of Motorcycle Accidents Behind the Story of Ghostbed vs. Purple Mattress Lawsuit Behind the Story of Ghostbed vs. Purple Mattress Lawsuit How Green Are Those New Cassava Bags? How Green Are Those New Cassava Bags? Hutchins’ Family Will Likely File a Wrongful Death Lawsuit Hutchins’ Family Will Likely File a Wrongful Death Lawsuit **About Press Release** This post is an authorized copy of a press release and was not written by LegalReader. **Post navigation** **About Legal Reader** Legal Reader is devoted to protecting consumers. We take pride in exposing the hypocrisy of corporations, other organizations, and individuals whose actions put innocent people in harm’s way. We are unapologetic in our dedication to informing the public and unafraid to call out those who are more focused on profits than people’s safety."}