{"id": 103, "name": "Astronomy Magazine", "domain": "astronomy.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.astronomy.com/whats-launching-this-week/axiom-4-makes-history-while-spacex-starlink-launches-dominate-the-week/", "title": "Axiom 4 Makes History While Spacex Starlink Launches Dominate The Week", "content": "Introducing the all-new Astronomy.com Forum! Become a part of our Community!>> Visit Now Login/Register Logout Shop Subscribe News ScienceSolar SystemExoplanetsStarsMilky WayGalaxiesExotic ObjectsCosmology Solar System Exoplanets Stars Milky Way Galaxies Exotic Objects Cosmology Solar System Exoplanets Stars Milky Way Galaxies Exotic Objects Cosmology ObservingIn The SkyUpcoming EventsThe SunThe MoonPlanetsDeep-Sky ObjectsObserving BasicsTelescopes and EquipmentAstrophotographyGear GuideThis Week in Astronomy In The Sky Upcoming Events The Sun The Moon Planets Deep-Sky Objects Observing Basics Telescopes and Equipment Astrophotography Gear Guide This Week in Astronomy In The Sky Upcoming Events The Sun The Moon Planets Deep-Sky Objects Observing Basics Telescopes and Equipment Astrophotography Gear Guide This Week in Astronomy Space ExplorationWhat’s Launching This WeekHuman SpaceflightRobotic Spaceflight What’s Launching This Week Human Spaceflight Robotic Spaceflight What’s Launching This Week Human Spaceflight Robotic Spaceflight The Magazine Ask Astro Universe, Discovered News ScienceSolar SystemExoplanetsStarsMilky WayGalaxiesExotic ObjectsCosmology Solar System Exoplanets Stars Milky Way Galaxies Exotic Objects Cosmology Solar System Exoplanets Stars Milky Way Galaxies Exotic Objects Cosmology ObservingIn The SkyUpcoming EventsThe SunThe MoonPlanetsDeep-Sky ObjectsObserving BasicsTelescopes and EquipmentAstrophotographyGear GuideThis Week in Astronomy In The Sky Upcoming Events The Sun The Moon Planets Deep-Sky Objects Observing Basics Telescopes and Equipment Astrophotography Gear Guide This Week in Astronomy In The Sky Upcoming Events The Sun The Moon Planets Deep-Sky Objects Observing Basics Telescopes and Equipment Astrophotography Gear Guide This Week in Astronomy Space ExplorationWhat’s Launching This WeekHuman SpaceflightRobotic Spaceflight What’s Launching This Week Human Spaceflight Robotic Spaceflight What’s Launching This Week Human Spaceflight Robotic Spaceflight The Magazine Ask Astro Universe, Discovered Login/Register Logout Shop Subscribe **Axiom 4 makes history while SpaceX Starlink launches dominate the week** **Mission Highlight: Axiom 4 — A historic multinational endeavor** The Axiom Mission 4 (Ax-4), launching on June 11 at 8:00 a.m. EDT from Kennedy Space Center, will carry crew members from India, Poland, and Hungary—representing each nation’s first mission to the International Space Station. The historic flight will be commanded by NASA veteran Peggy Whitson and marks a significant milestone in commercial spaceflight.Watch the launch live. The mission will be piloted by Shubhanshu Shukla, who will become India’s second national astronaut to reach space since 1984. Speaking toBBC, Shukla reflected on the emotional weight of the moment, saying, “As I go into space, I carry not just instruments and equipment, I carry hopes and dreams of a billion hearts.” Also on board isSławosz Uznański, a European Space Agency project astronaut and Poland’s second astronaut since 1978, andTibor Kapu, Hungary’s second national astronaut since 1980. The mission will be commanded by NASA veteranPeggy Whitson, who adds to herstanding recordfor the longest cumulative time in space by an American astronaut. This marks her second commercial human spaceflight mission. What sets Ax-4 apart is its ambitious research agenda, featuring around 60 scientific studies representing 31 countries, including the U.S., India, Poland, Hungary, Saudi Arabia, Brazil, Nigeria, the UAE, and nations across Europe. It marks the most extensive research portfolio of any Axiom Space mission to date, spanning human health, Earth observation, and biological and material sciences, demonstrating the growing global investment in microgravity research. Among the highlights is also a newpartnershipbetween NASA and the Indian Space Research Organisation (ISRO), which is collaborating on several investigations aboard the Ax-4 mission. These include experiments on muscle regeneration, the growth of sprouts and edible microalgae, the survival of tiny aquatic organisms, and how humans interact with electronic displays in space. According toAxiom Space, “The Ax-4 mission stands as a beacon of opportunity for India, Poland, and Hungary, each poised to leverage this mission to advance their national space programs.” The mission underscores how commercial spaceflight is creating new avenues for countries to participate in the space economy and contribute to humanity’s understanding of living and working in space. **Other missions this week** Starlink Group 12-24will lift off on a Falcon 9 Block 5 on June 10 at 9:03 A.M. EDT from Cape Canaveral. The mission will deliver more Starlink satellites to orbit, likely including a mix of Direct-to-Cell and standard v2-mini satellites for SpaceX’s expanding internet service. The Mountain God Guardsmission will use Rocket Lab’s Electron vehicle on June 11 at 11:15 A.M. EDT from Launch Complex 1 in New Zealand. This launch will carry an iQPS synthetic aperture radar satellite, part of iQPS’ planned 36-satellite constellation capable of monitoring specific points on Earth every 10 minutes, even through clouds and adverse weather. Starlink Group 15-6launches on a Falcon 9 Block 5 on June 12 at 9:46 P.M. EDT from Vandenberg Space Force Base. This mission will deploy another batch of Starlink v2-mini satellites to further expand SpaceX’s internet constellation. Project Kuiper (KA-02)will utilize United Launch Alliance’s Atlas V 551 rocket on June 13 at 2:29 A.M. EDT from Cape Canaveral. This mission will deploy Amazon’s second prototype Kuiper broadband satellite, part of a planned 3,236-satellite constellation that will provide internet access from low Earth orbit. China Aerospace Science and Technology Corporation (CASC)is set to launch a Long March 2D rocket on June 13 at 3:55 A.M. EDT from Jiuquan Satellite Launch Center in China. This mission will carry an unspecified payload to low Earth orbit. Starlink Group 12-26rounds out the week with another Falcon 9 Block 5 launch on June 13 at 7:45 P.M. EDT from Cape Canaveral. This mission will deploy additional Starlink v2-mini satellites to continue building out SpaceX’s global internet service. **Looking ahead** Looking ahead to the week of June 16–22, several launches are on the horizon. On June 16, a United Launch Alliance Atlas V 551 will carry a national security payload from Cape Canaveral, and SpaceX is slated to launch Starlink Group 15-9 on a Falcon 9 from Vandenberg SFB, continuing the expansion of its low Earth orbit internet network. On June 18, Russia is expected to launch an Angara A5 rocket from Plesetsk Cosmodrome carrying a classified military payload. Rounding out the week on June 21, SpaceX’s latest small satellite rideshare mission, Transporter-14, will lift off from Vandenberg to Sun-synchronous orbit. Get newsletters, updates and special offers via email from Astronomy.com! \"*\" indicates required fields Astronomy leads the astronomy hobby as the most popular magazine of its kind in the world. Get information about subscriptions, digital editions, renewals, advertising and much, much more. Count me in **FREE DOWNLOAD** Facebook LinkedIn YouTube Instagram Twitter About Us Contact Us Subscribe Customer Service Advertising Terms of Use Privacy Policy @ 2024 Firecrown Media. All Rights Reserved. **Login** Why Sign In? Subscribers can access their digital magazine issues, and registered users can participate in our Community forums and galleries."}