{"id": 1976, "name": "Frontiers in Biomaterials Science", "domain": "frontiersin.org/journals/biomaterials-science", "bias": "pro-science", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/biomaterials-science/articles/10.3389/fbiom.2025.1500758/full", "title": "Biomaterials Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Bio-interactions and Bio-compatibility Bioinspired and Complex Materials Biomaterials Manufacturing and Technology Biomaterials Science for Regenerative Therapies Delivery Systems and Controlled Release Imaging and Diagnostics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Bio-interactions and Bio-compatibility Bioinspired and Complex Materials Biomaterials Manufacturing and Technology Biomaterials Science for Regenerative Therapies Delivery Systems and Controlled Release Imaging and Diagnostics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Bio-interactions and Bio-compatibility Bioinspired and Complex Materials Biomaterials Manufacturing and Technology Biomaterials Science for Regenerative Therapies Delivery Systems and Controlled Release Imaging and Diagnostics Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office MINI REVIEW article Front. Biomater. Sci., 24 February 2025 Sec. Delivery Systems and Controlled Release Volume 4 - 2025 |https://doi.org/10.3389/fbiom.2025.1500758 **The cutting-edge applications and properties of carbon nanotubes in diagnosis and treatment of lung cancer: a review** 1Stem Cell and Regenerative Medicine Group, National Institute of Genetic Engineering and Biotechnology, Tehran, Iran 2Department of Surgery and Radiology, Faculty of Veterinary Medicine, University of Tehran, Tehran, Iran 3Department of Biology, Faculty of Basic sciences, University of Tehran, Tehran, Alborz, Iran Lung cancer, a predominant source of cancer-related mortality, poses considerable obstacles for conventional therapies. Carbon nanotubes, an innovative category of nanomaterials, have surfaced as prospective agents for cancer treatment owing to their distinctive characteristics. This article examines the potential of carbon nanotubes (CNTs) in the treatment of lung cancer, emphasizing their roles in targeted drug delivery, photothermal and photodynamic therapy, and gene therapy. The high surface area, electrical conductivity, and biocompatibility of CNTs render them optimal for the delivery of anticancer medications, thereby augmenting their efficacy and minimizing side effects. Furthermore, CNTs can be employed in photothermal and photodynamic therapy, facilitating cell death via heat production or oxidative stress. Furthermore, carbon nanotubes can effectively transport genetic material for gene therapy, providing a focused method for lung cancer treatment. Despite limitations like as clinical translation, carbon nanotubes exhibit significant potential as novel instruments for enhancing lung cancer therapy outcomes. **1 Introduction** Lung cancer is one of the most aggressive and widespread cancers globally, accounting for 2.2 million new cases and 1.8 million deaths in 2020. It remains the leading cause of cancer-related mortality among men and second leading cause among women, following breast cancer (Peng et al., 2008). Lung cancer has a high rate of metastases and is resistant to traditional treatments, making early detection and treatment difficult despite continuous attempts. It is classified into small cell and non-small cell types, is traditionally treated with chemotherapy, radiation, and medications, though these methods often harm healthy tissues and have limited effectiveness due to issues such as poor drug stability and resistance. Moreover, these conventional therapies frequently do not effectively target malignant cells, resulting in inadequate therapeutic results and heightened toxicity to healthy cells. However, recent advancements in nano-drug delivery systems have shown promise in overcoming these obstacles. Nanoparticle-based therapies, especially those employing CNTs, provide enhanced precision and reduced side effects through more localized treatment. The use of nanocarriers in cancer treatment has significantly increased in recent years, offering more targeted and efficient therapeutic options (Chatterjee et al., 2013). CNTs represent an emerging category of nanomaterials characterized by distinctive chemical, physical, and biological properties. Structurally, CNTs are carbon allotropes with a cylindrical form. In addition to their unique morphology, CNTs exhibit remarkable electronic and thermal conductivity. These properties make them highly suitable for a wide range of applications across various disciplines, including electronics, chemistry, optics, and biomedicine (Brock, 2015). Furthermore, CNTs have exhibited the capacity to traverse biological barriers, including cell membranes, which presents a considerable benefit in drug administration. In the medical field, carbon nanotubes have several. Important applications, including their use in the delivery of molecules such as genes, drugs, and enzymes. Additionally, due to their excellent electrical conductivity, CNTs contribute to advancements in tissue engineering and regenerative medicine. Their biocompatibility and capacity for functionalization with specific ligands further augment their capability to preferentially target cancer cells, while minimizing off-target effects. They also exhibit antioxidant properties and are effective in targeted thermal therapies, further enhancing their potential in medical treatments (Brock, 2015). Moreover, the unique optical characteristics of carbon nanotubes, including their capacity to absorb and transform light into heat, enable them very effective in photothermal therapy, wherein regulated heating can trigger the elimination of cancer cells. This review aims to highlight key features of CNTs that make them suitable for cancer treatment especially lung cancer, focusing on their application in photodynamic and photothermal therapies, as well as their effectiveness in targeted drug and gene delivery. This article will also address the potential of CNT-based therapies to address existing treatment limitations, thereby providing more effective and personalized options for lung cancer patients. **2 Overview of carbon nanotubes** **2.1 Definition and types** The main structure of carbon nanotubes is made up of carbon atoms arranged in a hexagonal honeycomb pattern. This special arrangement leads to outstanding physical and chemical properties (Chatterjee et al., 2013;Crowley et al., 2013). CNTs are categorized into two types: single-walled nanotubes (SWCNTs) and multi-walled nanotubes (MWCNTs), each characterized by distinct dimensions (Chatterjee et al., 2013;Alunni-Fabbroni and Sandri, 2010;Sardarabadi et al., 2021). The lengths of carbon nanotubes can extend to the micrometer scale, while their diameters typically vary, with single-walled CNTs measuring around 1–2 nm and multi-walled CNTs ranging from 2 to 100 nm (Sardarabadi et al., 2021). CNTs exhibit remarkable properties, such as high biocompatibility, excellent thermal and electrical conductivity, and a large surface area. In this section, we will focus on discussing some of these key attributes (Chatterjee et al., 2013). Due to their delocalized π-electron system, carbon nanotubes exhibit high electrical conductivity (∼106–107 S/m), enabling efficient charge transport (Yung et al., 2022;VanderLaan et al., 2014) This makes CNTs suitable for electrical stimulation in tissue engineering. They promote cell proliferation and stem cell differentiation, particularly in neurite and cardiomyocyte systems (Sun et al., 2018;Freidin et al., 2015;Leiter et al., 2023). A new rectangular patch antenna incorporating multi-walled carbon nanotubes has been designed and developed to aid in the early detection of COVID-19-affected lungs. Thanks to their high conductivity, each nanotube uniquely reflects electromagnetic waves, contributing to an increased bandwidth (Sheikhpour et al., 2020). Numerous studies have demonstrated the biocompatibility of carbon nanotubes in bothin vivoandin vitroenvironments. In recent years, CNT composites have gained increasing popularity, with biocompatibility assays consistently showing their high biocompatibility (Saliev, 2019;Parande Shirvan et al., 2024). The following table provides a summary of some key studies on the biocompatibility of CNTs and their composites (Figure 1). Figure 1. Carbon nanotubes overview. MWCNT chitin MTT assay CNTs also have demonstrated a large surface area, making them highly suitable for the development of new generations of anticancer systems (Parande Shirvan et al., 2024;Gupta et al., 2019). CNT’s high surface area makes it an excellent choice for modifications and adaptations for specific applications like biosensing technologies and cancer therapies (Brock, 2015) (Table 1). Table 1. Summary of some key studies on the biocompatibility of CNTs and their composites. **3 Carbon nanotubes properties** Unprocessed CNTs are unable to dissolve in water due to the very hydrophobic nature of their surfaces. One approach to resolving this issue is to functionalize CNTs. The introduction of certain functional groups onto the walls of CNT is made possible through the process of chemical synthesis (Burnstine-Townley et al., 2020). This process results in the formation of functionalized carbon nanotubes (f-CNT), which can be utilized in a wide range of applications. Functionalization of substances can be accomplished through two distinct methods: covalent bonding, which involves the formation of chemical bonds, and noncovalent bonding, which involves physioadsorption (Nekounam et al., 2021;Mostafavi et al., 2022). The covalent attachment of polymer chains to CNTs creates robust chemical interactions between the molecules and the nanotubes. The many covalent processes applicable to graft molecules are categorized based on their distinct features (Shar et al., 2023). For instance, grafting from processes entail the incorporation of preexisting polymer chains, whereas grafting to reactions involve the polymerization of monomers initiated from surface-derived initiators on CNTs. Both methods involve interacting with the CNT surface for functionalization. The surfaces of virgin, prefunctionalized, or oxidized CNTs can facilitate the formation of covalent connections with molecules or polymer chains (Hasan et al., 2022). Most drug delivery techniques documented in the literature depend on noncovalent interactions between molecules and CNTs. An alternative to covalent functionalization is the application of amphiphilic surfactant molecules or polymers to cover CNTs, facilitating noncovalent functionalization. For best performance in biological applications, a noncovalently functionalized CNT must demonstrate clearly defined properties (Aoki and Saito, 2020). A method to accomplish this involves covering carbon nanotubes with amphiphilic compounds, yielding micelle-like structures. CNTs, comprising SWCNTs and MWCNTs, demonstrate exceptional mechanical qualities, with Young’s modulus values attaining up to 2.8e3.6 TPa for SWCNTs and 1.7e2.4 TPa for MWCNTs (Dias and Mfouo-Tynga, 2020;Meran et al., 2018). These materials have remarkable strength along their axial axis, with MWCNTs displaying a tensile strength of 63 GPa, substantially surpassing high carbon steel’s 1.2 GPa (Huang et al., 2019). Carbon nanotubes have exceptionally high elastic moduli, roughly 1 TPa, in contrast to around 70 GPa for aluminum (Wu et al., 2017). Their specific strength, at 48,462 kN m/kg, significantly exceeds that of high carbon steel (154 kN m/kg), due to their low solid density of 1.3–1.4 gm/cm³ (Bhattacharya et al., 2023). Furthermore, findings from transverse electron microscopy (TEM) reveal that two adjacent nanotubes can be altered by van der Waals forces, demonstrating their malleability and resilience (Figure 2). Figure 2. The TEM picture of SPIO-MWCNTs coated with polymer is on the left. Comparingin vivoMRI scans of the livers of mice before and after SPIO-MWCNT injection (white arrows denote tumors) with those of the internal control group (water, top right). Used with authorization fromBianco et al. (2005). CNTs possess remarkable thermal properties, with individual MWCNTs exhibiting thermal conductivity of 3000 W/K at ambient temperature, exceeding that of graphite (Bhattacharya et al., 2023). SWCNTs have notable thermal conductivity, exceeding 200 W/m K. Measurements of low-temperature specific heat and thermal conductivity offer clear proof of the one-dimensional quantization of the phonon band structure in carbon nanotubes, further emphasizing their distinctive thermal properties. The configuration of carbon atoms in CNTs creates a hexagonal lattice, with each carbon atom covalently connected to three adjacent carbon atoms through sp2molecular orbitals (Bhattacharya et al., 2023). This configuration results in one valence electron being free, which becomes delocalized among all atoms, influencing the electrical properties of CNTs (Bhattacharya et al., 2023). SWCNTs can demonstrate metallic properties, with resistivities varying from 0.34 to 1.0 × 10⁴ Ω cm. Carbon nanotubes can exhibit either conductive or semiconductive properties based on their chirality. In the medical domain, CNTs are especially advantageous owing to their diminutive size, elevated surface area to volume ratio, and ability for functionalization, facilitating diverse new uses (Prato et al., 2008). **4 Mechanisms of action** **4.1 Targeted drug delivery** CNTs exhibit unique physicochemical and biological characteristics, coupled with a considerable ability for surface modification, making them promising candidates for drug delivery systems. SWNTs and MWNTs can infiltrate cells via endocytosis or by directly embedding into the cell membrane. In addition to their capacity to permeate cell membranes, their stability, customizable structures, and significant drug-loading potential have led to extensive research on their use as nanocarriers for the treatment of critical diseases like cancer (Table 2)(Sahoo et al., 2011;Basheer et al., 2020). It was observed that anticancer drugs are encapsulated within the inner hollow core of multi-walled carbon nanotubes using an inert, nonaqueous platinum (IV) complex through hydrophobic-hydrophobic interactions. Upon undergoing chemical reduction, the anticancer drug is converted into its cytotoxic and hydrophilic form, allowing it to be released from the transporter The needle-like morphology of carbon nanotubes provides a substantial specific surface area, rendering them suitable for the adsorption or conjugation of many therapeutic substances due to their diminutive size and elevated aspect ratios. The needle-like morphology of CNTs facilitates their internalization into target cells (Tuncel et al., 2011). Consequently, carbon nanotubes exhibit significant potential as nanocarriers for the delivery of proteins, DNA, and pharmaceuticals. The administration of anticancer agents using CNT-based nanocarriers has been thoroughly investigated, while vesicle-based carriers such as liposomes have mitigated other disorders beyond cancer. Chemotherapy, with other cancer treatments such as radiation and surgery, has historically been the gold standard. Regrettably, side effects from treatment diminish the potential for effective therapy, and the nonspecificity of medications may result in resistance. To diminish the probability of unwanted effects and enhance therapeutic efficacy, innovative strategies for targeting tumors with anticancer medicines are urgently needed. Topoisomerase inhibitors, platinum (Pt)-based agents, and antimicrotubule drugs are frequently administered through CNTs as anticancer therapies (Basheer et al., 2020). Table 2. Examples of drug delivery using carbon nanotubes. **4.2 Photothermal and photodynamic therapy** Photodynamic therapy (PDT) is a light-activated treatment that employs photosensitizing molecules (PSs), specific wavelengths of light, and molecular oxygen (O₂) to induce cytotoxic effects through oxidative reactions, effectively targeting solid tumor cancer cells (Parande Shirvan et al., 2024). Hyperthermia, or photothermal therapy, is a straightforward cancer treatment method in which the irradiation of near-infrared (NIR) light raises the local temperature of tumors, disrupting cancer cells. Internalized nanoparticles (NPs) at tumor sites can be activated by laser irradiation to generate localized heat in the range of 40°C–45°C, effectively destroying cancer cells. Notable examples of NPs include single-walled carbon nanotubes and MWNTs (Jahromi and Setoodeh, 2020;Tang et al., 2021). A study demonstrated that the photothermal effect of single-walled carbon nanotubes (CNTs), when used in conjunction with doxorubicin, effectively targets and eliminates breast cancer cells (Lourie and Wagner, 1998). Also there is a research about Photothermal therapy of melanoma tumor using multiwalled carbon nanotubes (Jahromi and Setoodeh, 2020). **4.3 Gene therapy** CNT-based delivery systems are being studied for their potential to transport genetic materials with low immunogenicity. Their favorable length-to-diameter ratio and modification capabilities allow for the efficient delivery and release of various genetic materials. Investigations into functionalized CNTs (fCNTs) for creating CNTs/DNA complexes have shown promising results, demonstrating successful internalization as proof of concept (Yu et al., 2000). This table presents examples of drug delivery using CNTs. **5 Recent innovations in lung cancer applications** **5.1 Diagnostic tools** In addition to the conventional imaging methods previously discussed, CNTs can be included into advanced diagnostic instruments (Figure 3). They can be functionalized with specific antibodies or aptamers to directly target cancer cells. This focused strategy can enhance the sensitivity and specificity of diagnostic tests, resulting in earlier diagnosis and more precise staging of lung cancer. CNTs have demonstrated potential in lung cancer detection by recognizing alterations in volatile organic compounds (VOCs) seen in respiratory samples (Yu et al., 2005). Research has shown that individuals with lung cancer display increased concentrations of diverse volatile organic compounds, encompassing polar vapors such as water, methanol, isopropanol, ethanol, acetone, 2-butanone, and propanol, alongside nonpolar vapors including chloroform, benzene, o-xylene, n-decane, 1-hexene, toluene, styrene, n-propane, cyclohexane, 1,2,4-trimethylbenzene, and isoprene (Liu et al., 2015). Figure 3.(A)A picture of the mouse tumor’s location as seen using an optical microscope;(B–D)from left to right, NIR-II fluorescent time course imaging 12, 24, and 48 h after injection, revealing distinct accumulation of SWCNTs in the tumor. All near. Reused with permission fromEbbesen et al. (1996). The diagnosis and profiling of lung cancer pose considerable obstacles, especially in the early stages when tumors are tiny and hard to distinguish from benign nodules (Chen et al., 2017). Individuals with lung cancer frequently possess comorbidities that elevate the risks linked to invasive interventions such as biopsies (Paul et al., 2023). Furthermore, tracking disease progression, recurrence, or the emergence of secondary tumors might be challenging. Circulating tumor cells (CTCs) provide a non-invasive method for evaluating lung cancer, as Organ Functionalization CNT type Reference Lung ammonium PEI/PA they may be readily identified and tracked during treatment and disease advancement (Zare et al., 2021). Contrary to cell-free nucleic acid profiles, CTCs do not rely on specific mutations. CNTs can successfully isolate and analyze CTCs. Due to their remarkable mechanical strength and extensive surface area, these rare cancer cells can be effectively collected (Sobhani et al., 2017). Researchers can improve the selectivity of CTC capture and separate just cancer cells by functionalizing CNTs with specific markers. This process enables the cells to maintain viability for further genomic profiling, encompassing the analysis of their mutational landscape, drug sensitivity, and metastatic capacity. This data can facilitate treatment decisions, monitor disease development, and enable early relapse diagnosis. Owing to these attributes, CNTs represent a viable material for personalized cancer therapy, disease surveillance, and early diagnosis. Yung et al. established a CNT platform for capturing CTC from whole blood specimens. The technology was evaluated on a cohort of lung cancer patients and shown a high accuracy in detecting CTCs, even in early-stage disease. Their approach exhibited elevated sensitivity, specificity, and positive predictive value, indicating its potential utility for the early detection and monitoring of lung cancer (Jeyamohan et al., 2013). Despite the exciting promise of liquid biopsies, existing technologies continue to need help with detection sensitivity and throughput. The limited presence of circulating tumor markers in the bloodstream impedes their identification, necessitating highthroughput methodologies to address these issues and fully exploit the advantages of liquid biopsies (Caoduro et al., 2017). **5.2 Therapeutic tools** Carbon nanotubes can function as effective drug transporters, transporting anticancer medicines directly to neoplastic cells. This precise administration can improve treatment effectiveness while reducing adverse effects on healthy tissues. Moreover, CNTs can elicit apoptosis (programmed cell death) in neoplastic cells, an essential mechanism for oncological therapy. Single-wall carbon nanotubes (SWCNTs) have emerged as effective carriers for drug administration in cancer therapy, attributed to their distinctive qualities such as elevated surface area, biocompatibility, and capacity to traverse cell membranes. This has resulted in comprehensive study on employing SWCNTs for the delivery of diverse lung cancer therapeutics (Singh et al., 2020). This is a summary of significant studies investigating the application of SWCNTs in conjunction with other lung cancer therapeutics: Paclitaxel: SWCNTs have been integrated with paclitaxel to augment its efficacy against lung cancer cells. Alterations such as chitosan and hyaluronic acid have been employed to enhance biocompatibility and selectively target specific cell types (Antaris et al., 2013). SWCNTs have enabled the administration of TRAIL, a protein that triggers death in cancer cells, resulting in enhanced tumor elimination (Yang et al., 2008). Doxorubicin: SWCNTs have been utilized for the delivery of doxorubicin, a commonly employed chemotherapy agent, improving its targeting and therapeutic effectiveness (Yu et al., 2016). Curcumin: Curcumin, a natural substance possessing anti-cancer effects, has been integrated with SWCNTs to enhance its delivery and efficacy against lung cancer cells (Zakaria et al., 2015). Survivin siRNA: SWCNTs have been employed to transport survivin siRNA, a gene silencing agent, to diminish survivin expression and trigger apoptosis in lung cancer cells. Gemcitabine: SWCNTs have demonstrated potential as carriers for gemcitabine, a chemotherapeutic agent frequently utilized in lung cancer treatments (Al Faraj et al., 2016). Inhibition of telomerase: Multi-walled carbon nanotubes (MWCNTs) have been integrated with graphene oxide to obstruct telomerase, an enzyme linked to the longevity of cancer cells (Palaci et al., 2005). Modified MWCNTs containing ethylene glycol and antibodies have been employed to target drugresistant lung cancer cells. SiRNA delivery: MWCNTs have been utilized to transport siRNA molecules aimed at specific genes implicated in the genesis and progression of lung cancer. Alternative pharmaceuticals: Multi-walled carbon nanotubes have been utilized to provide a range of lung cancer therapeutics, such as methotrexate, cisplatin, betulinic acid, docetaxel, etoposide, and IRGD peptide (Singh et al., 2018;Cao et al., 2019). Improved medication delivery: SWCNTs and MWCNTs can augment the delivery of pharmaceuticals to lung cancer cells, enhancing their effectiveness. Targeted therapy: Alterations to SWCNTs and MWCNTs enable the precise delivery of pharmaceuticals to certain cancer cell types. Decreased toxicity: By safeguarding pharmaceuticals from degradation and enhancing their dispersion, SWCNTs and MWCNTs may potentially mitigate negative effects. **6 Future perspective** It appears that artificial intelligence (AI) and machine learning (ML) have significant potential to contribute to advancements in the CNT usage, particularly in cancer treatment. As a result, we are witnessing a growing trend in the development and application of these technologies in oncology (Lodhi et al., 2013). Carbon nanotubes (CNTs) require functionalization and surface chemistry modification to enhance their biocompatibility, reduce toxicity, and improve their physical properties. For future clinical and biomedical uses, thoroughin vivoandin vitroassessments are necessary. Despite their potential, CNTs face challenges such as low solubility in both aqueous and organic solvents. Covalent functionalization has shown improved pharmacokinetics and biodistribution, which are crucial for medical applications. The toxicity of CNTs is influenced by factors like nanotube type, administration method, dosage, and the targeted tissues, but can be reduced through eco-friendly functionalization and synthesis methods. Evaluating biodistribution, toxicology, and biosafety is key for advancing CNT-based systems in medical contexts (Cirillo et al., 2019). Also There are several challenges that hinder the clinical application of CNT-based therapies. Key among them is the lack of comprehensive safety studies in humans, as mostin vivotests have been conducted over short periods in animal models. Long-term safety assessments are needed to confirm their suitability for clinical use. Additionally, many functionalization methods of CNTs are complex, making large-scale, reproducible production difficult. Despite these obstacles, CNTs hold significant promise for cancer treatment and diagnosis, and with advances in technology, more thorough preclinical studies will help explore their clinical potential (Singh and Kumar, 2022). In our opinion, the prospects of CNTs in cancer therapy are fascinating, owing to their distinctive attributes, including elevated surface area and biocompatibility. Functionalizing CNTs for targeted medicine delivery could improve treatment accuracy while reducing negative effects. Moreover, their optical characteristics may enhance real-time tumor imaging, therefore supporting tailored therapy strategies. However, it is imperative to tackle issues such as potential toxicity and guarantee safe biodegradability. As research advances, CNTs may transform cancer treatment, facilitating the development of more effective and personalized therapeutic approaches. **7 Conclusion** Carbon nanotubes have emerged as viable alternatives for lung cancer therapy owing to their distinctive characteristics and adaptability. Their capacity to administer pharmaceuticals, induce cellular apoptosis via photothermal and photodynamic therapies, and convey genetic material presents novel strategies to surmount the constraints of conventional treatments. Despite the necessity to address issues like biocompatibility and clinical translation, the prospective advantages of CNTs in lung cancer therapy justify additional research and development. Ongoing discoveries in nanotechnology suggest that carbon nanotubes may significantly enhance outcomes for lung cancer patients. **Author contributions** SA: Writing–original draft. FK: Writing–original draft. Nk: Writing–original draft. **Funding** The author(s) declare that no financial support was received for the research, authorship, and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Al Faraj, A., Shaik, A. S., Halwani, R., and Alfuraih, A. (2016). Magnetic targeting and delivery of drug-loaded SWCNTs theranostic nanoprobes to lung metastasis in breast cancer animal model: noninvasive monitoring using magnetic resonance imaging.Mol. Imaging Biol.18 (3), 315–324. doi:10.1007/s11307-015-0902-0 PubMed Abstract|CrossRef Full Text|Google Scholar Alunni-Fabbroni, M., and Sandri, M. T. (2010). Circulating tumour cells in clinical practice: methods of detection and possible characterization.Methods50 (4), 289–297. doi:10.1016/j.ymeth.2010.01.027 PubMed Abstract|CrossRef Full Text|Google Scholar Antaris, A. L., Robinson, J. T., Yaghi, O. K., Hong, G., Diao, S., Luong, R., et al. (2013). Ultra-low doses of chirality sorted (6, 5) carbon nanotubes for simultaneous tumor imaging and photothermal therapy.ACS Nano7 (4), 3644–3652. doi:10.1021/nn4006472 PubMed Abstract|CrossRef Full Text|Google Scholar Aoki, K., and Saito, N. (2020). Biocompatibility and carcinogenicity of carbon nanotubes as biomaterials.Nanomaterials10 (2), 264. doi:10.3390/nano10020264 PubMed Abstract|CrossRef Full Text|Google Scholar Basheer, B. V., George, J. J., Siengchin, S., and Parameswaranpillai, J. (2020). Polymer grafted carbon nanotubes—synthesis, properties, and applications: a review.Nano-Structures and Nano-Objects22, 100429. doi:10.1016/j.nanoso.2020.100429 CrossRef Full Text|Google Scholar Bhattacharya, D., Mukhopadhyay, M., Shivam, K., Tripathy, S., Patra, R., and Pramanik, A. (2023). Recent developments in photodynamic therapy and its application against multidrug resistant cancers.Biomed. Mater.18, 062005. doi:10.1088/1748-605x/ad02d4 PubMed Abstract|CrossRef Full Text|Google Scholar Bianco, A., Kostarelos, K., Partidos, C. D., and Prato, M. (2005). Biomedical applications of functionalised carbon nanotubes.Chem. Commun.(5), 571–577. doi:10.1039/b410943k PubMed Abstract|CrossRef Full Text|Google Scholar Brock, G. (2015). Liquid biopsy for cancer screening, patient stratification and monitoring.Transl. Cancer Res.4 (3). Google Scholar Burnstine-Townley, A., Eshel, Y., and Amdursky, N. (2020). Conductive scaffolds for cardiac and neuronal tissue engineering: governing factors and mechanisms.Adv. Funct. Mater.30 (18). doi:10.1002/adfm.201901369 CrossRef Full Text|Google Scholar Cao, Y., Huang, H. Y., Chen, L. Q., Du, H. H., Cui, J. H., Zhang, L. W., et al. (2019). Enhanced lysosomal escape of pH-responsive polyethylenimine–betaine functionalized carbon nanotube for the codelivery of survivin small interfering RNA and doxorubicin.ACS Appl. Mater. and interfaces11 (10), 9763–9776. doi:10.1021/acsami.8b20810 PubMed Abstract|CrossRef Full Text|Google Scholar Caoduro, C., Hervouet, E., Girard-Thernier, C., Gharbi, T., Boulahdour, H., Delage-Mourroux, R., et al. (2017). Carbon nanotubes as gene carriers: focus on internalization pathways related to functionalization and properties.Acta Biomater.49, 36–44. doi:10.1016/j.actbio.2016.11.013 PubMed Abstract|CrossRef Full Text|Google Scholar Chatterjee, S., Castro, M., and Feller, J.-F. (2013). An e-nose made of carbon nanotube based quantum resistive sensors for the detection of eighteen polar/nonpolar VOC biomarkers of lung cancer.J. Mater. Chem. B1 (36), 4563–4575. doi:10.1039/c3tb20819b PubMed Abstract|CrossRef Full Text|Google Scholar Chen, Z., Zhang, A., Wang, X., Zhu, J., Fan, Y., Yu, H., et al. (2017). The advances of carbon nanotubes in cancer diagnostics and therapeutics.J. Nanomater.2017 (1), 1–13. doi:10.1155/2017/3418932 CrossRef Full Text|Google Scholar Cirillo, G., Vittorio, O., Kunhardt, D., Valli, E., Voli, F., Farfalla, A., et al. (2019). Combining carbon nanotubes and chitosan for the vectorization of methotrexate to lung cancer cells.Materials12 (18), 2889. doi:10.3390/ma12182889 PubMed Abstract|CrossRef Full Text|Google Scholar Crowley, E., Di Nicolantonio, F., Loupakis, F., and Bardelli, A. (2013). Liquid biopsy: monitoring cancer-genetics in the blood.Nat. Rev. Clin. Oncol.10 (8), 472–484. doi:10.1038/nrclinonc.2013.110 PubMed Abstract|CrossRef Full Text|Google Scholar Dias, L. D., and Mfouo-Tynga, I. S. (2020). Learning from nature: bioinspired chlorin-based photosensitizers immobilized on carbon materials for combined photodynamic and photothermal therapy.Biomimetics5 (4), 53. doi:10.3390/biomimetics5040053 PubMed Abstract|CrossRef Full Text|Google Scholar Ebbesen, T., Lezec, H. J., Hiura, H., Bennett, J. W., Ghaemi, H. F., and Thio, T. (1996). Electrical conductivity of individual carbon nanotubes.Nature382 (6586), 54–56. doi:10.1038/382054a0 CrossRef Full Text|Google Scholar Freidin, M. B., Freydina, D. V., Leung, M., Montero Fernandez, A., Nicholson, A. G., and Lim, E. (2015). Circulating tumor DNA outperforms circulating tumor cells for KRAS mutation detection in thoracic malignancies.Clin. Chem.61 (10), 1299–1304. doi:10.1373/clinchem.2015.242453 PubMed Abstract|CrossRef Full Text|Google Scholar Gupta, N., Gupta, S. M., and Sharma, S. (2019). Carbon nanotubes: synthesis, properties and engineering applications.Carbon Lett.29, 419–447. doi:10.1007/s42823-019-00068-2 CrossRef Full Text|Google Scholar Hasan, R. R., Saleque, A. M., Anwar, A. B., Rahman, M. A., and Tsang, Y. H. (2022). Multiwalled carbon nanotube-based on-body patch antenna for detecting COVID-19-affected lungs.ACS omega7 (32), 28265–28274. doi:10.1021/acsomega.2c02550 PubMed Abstract|CrossRef Full Text|Google Scholar Huang, B., Vyas, C., Roberts, I., Poutrel, Q. A., Chiang, W. H., Blaker, J. J., et al. (2019). Fabrication and characterisation of 3D printed MWCNT composite porous scaffolds for bone regeneration.Mater. Sci. Eng. C98, 266–278. doi:10.1016/j.msec.2018.12.100 PubMed Abstract|CrossRef Full Text|Google Scholar Jahromi, H. S., and Setoodeh, A. (2020). Longitudinal, transverse, and torsional free vibrational and mechanical behavior of silicon nanotubes using an atomistic model.Mater. Res.23 (2), e20200075. doi:10.1590/1980-5373-mr-2020-0075 CrossRef Full Text|Google Scholar Jeyamohan, P., Hasumura, T., Nagaoka, Y., Yoshida, H., Maekawa, T., and Jeymohan, P. (2013). Accelerated killing of cancer cells using a multifunctional single-walled carbon nanotube-based system for targeted drug delivery in combination with photothermal therapy.Int. J. Nanomedicine8, 2653–2667. doi:10.2147/ijn.s46054 PubMed Abstract|CrossRef Full Text|Google Scholar Leiter, A., Veluswamy, R. R., and Wisnivesky, J. P. (2023). The global burden of lung cancer: current status and future trends.Nat. Rev. Clin. Oncol.20 (9), 624–639. doi:10.1038/s41571-023-00798-3 PubMed Abstract|CrossRef Full Text|Google Scholar Liu, Y., Muir, B. W., Waddington, L. J., Hinton, T. M., Moffat, B. A., Hao, X., et al. (2015). Colloidally stabilized magnetic carbon nanotubes providing MRI contrast in mouse liver tumors.Biomacromolecules16 (3), 790–797. doi:10.1021/bm501706x PubMed Abstract|CrossRef Full Text|Google Scholar Lodhi, N., Mehra, N. K., and Jain, N. K. (2013). Development and characterization of dexamethasone mesylate anchored on multi walled carbon nanotubes.J. drug Target.21 (1), 67–76. doi:10.3109/1061186x.2012.729213 PubMed Abstract|CrossRef Full Text|Google Scholar Lourie, O., and Wagner, H. D. (1998). Evaluation of Young's modulus of carbon nanotubes by microRaman spectroscopy.J. Mater. Res.13 (9), 2418–2422. doi:10.1557/jmr.1998.0336 CrossRef Full Text|Google Scholar Meran, M., Akkus, P. D., Kurkcuoglu, O., Baysak, E., Hizal, G., Haciosmanoglu, E., et al. (2018). Noncovalent pyrene-polyethylene glycol coatings of carbon nanotubes achievein vitrobiocompatibility.Langmuir34 (40), 12071–12082. doi:10.1021/acs.langmuir.8b00971 PubMed Abstract|CrossRef Full Text|Google Scholar Mostafavi, E., Iravani, S., Rajender, S. V., Khatamief, M., and Rahbarizadeh, F. (2022). Eco-friendly synthesis of carbon nanotubes and their cancer theranostic applications.Materials Advances. 3(12): p. 4765–4782. 57. Google Scholar Nekounam, H., Gholizadeh, S., Allahyari, Z., Samadian, H., Nazeri, N., Shokrgozar, M. A., et al. (2021). Electroconductive scaffolds for tissue regeneration: current opportunities, pitfalls, and potential solutions.Mater. Res. Bull.134, 111083. doi:10.1016/j.materresbull.2020.111083 CrossRef Full Text|Google Scholar Palaci, I., Fedrigo, S., Brune, H., Klinke, C., Chen, M., and Riedo, E. (2005). Radial elasticity of multiwalled carbon nanotubes.Phys. Rev. Lett.94 (17), 175502. doi:10.1103/physrevlett.94.175502 PubMed Abstract|CrossRef Full Text|Google Scholar Parande Shirvan, S., Yaghfoori, S., Mahmoudi, A., Naddaf, S. R., Molawi, G., Ahmadi, A., et al. (2024). Prevalence of helminths infection in wild rodents of Northwestern Iran.Archives Razi Inst.79 (1), 120–128. doi:10.32592/ARI.2024.79.1.120 PubMed Abstract|CrossRef Full Text|Google Scholar Paul, S., Mukherjee, S., and Banerjee, P. (2023). Recent advancement in nanomaterial-encapsulated drug delivery vehicles for combating cancer, COVID-19, and HIV-like chronic diseases.Mater. Adv.4 (9), 2042–2061. doi:10.1039/d2ma01075e CrossRef Full Text|Google Scholar Peng, G., Trock, E., and Haick, H. (2008). Detecting simulated patterns of lung cancer biomarkers by random network of single-walled carbon nanotubes coated with nonpolymeric organic materials.Nano Lett.8 (11), 3631–3635. doi:10.1021/nl801577u PubMed Abstract|CrossRef Full Text|Google Scholar Prato, M., Kostarelos, K., and Bianco, A. (2008). Functionalized carbon nanotubes in drug design and discovery.Accounts Chem. Res.41 (1), 60–68. doi:10.1021/ar700089b PubMed Abstract|CrossRef Full Text|Google Scholar Sahoo, N. G., Cheng, H. K. F., Bao, H., Pan, Y., and Chan, S. H. (2011). Covalent functionalization of carbon nanotubes for ultimate interfacial adhesion to liquid crystalline polymer.Soft Matter7 (19), 9505–9514. doi:10.1039/c1sm05360d CrossRef Full Text|Google Scholar Saleemi, M. A., Hosseini Fouladi, M., Yong, P. V. C., Chinna, K., Palanisamy, N. K., and Wong, E. H. (2020). Toxicity of carbon nanotubes: molecular mechanisms, signaling cascades, and remedies in biomedical applications.Chem. Res. Toxicol.34 (1), 24–46. doi:10.1021/acs.chemrestox.0c00172 PubMed Abstract|CrossRef Full Text|Google Scholar Saliev, T. (2019). The advances in biomedical applications of carbon nanotubes.C5 (2), 29. doi:10.3390/c5020029 CrossRef Full Text|Google Scholar Sardarabadi, P., Kojabad, A. A., Jafari, D., and Liu, C. H. (2021). Liquid biopsy-based biosensors for MRD detection and treatment monitoring in Non-Small Cell Lung Cancer (NSCLC).Biosensors11 (10), 394. doi:10.3390/bios11100394 PubMed Abstract|CrossRef Full Text|Google Scholar Shar, A., Shar, A., and Joung, D. (2023). Carbon nanotube nanocomposite scaffolds: advances in fabrication and applications for tissue regeneration and cancer therapy.Front. Bioeng. Biotechnol.11, 1299166. doi:10.3389/fbioe.2023.1299166 PubMed Abstract|CrossRef Full Text|Google Scholar Sheikhpour, M., Naghinejad, M., Kasaeian, A., Lohrasbi, A., Shahraeini, S. S., and Zomorodbakhsh, S. (2020). The applications of carbon nanotubes in the diagnosis and treatment of lung cancer: a critical review.Int. J. nanomedicine15, 7063–7078. doi:10.2147/ijn.s263238 PubMed Abstract|CrossRef Full Text|Google Scholar Singh, A., Hua Hsu, M., Gupta, N., Khanra, P., Kumar, P., Prakash Verma, V., et al. (2020). Derivatized carbon nanotubes for gene therapy in mammalian and plant cells.ChemPlusChem85 (3), 466–475. doi:10.1002/cplu.201900678 PubMed Abstract|CrossRef Full Text|Google Scholar Singh, N., Sachdev, A., and Gopinath, P. (2018). Polysaccharide functionalized single walled carbon nanotubes as nanocarriers for delivery of curcumin in lung cancer cells.J. Nanosci. Nanotechnol.18 (3), 1534–1541. doi:10.1166/jnn.2018.14222 PubMed Abstract|CrossRef Full Text|Google Scholar Singh, R., and Kumar, S. (2022). Cancer targeting and diagnosis: recent trends with carbon nanotubes.Nanomater. (Basel)12 (13), 2283. doi:10.3390/nano12132283 PubMed Abstract|CrossRef Full Text|Google Scholar Sobhani, Z., Behnam, M. A., Emami, F., Dehghanian, A., and Jamhiri, I. (2017). Photothermal therapy of melanoma tumor using multiwalled carbon nanotubes.Int. J. Nanomedicine12, 4509–4517. doi:10.2147/ijn.s134661 PubMed Abstract|CrossRef Full Text|Google Scholar Solorio-Rodriguez, S. A., Williams, A., Poulsen, S. S., Knudsen, K. B., Jensen, K. A., Clausen, P. A., et al. (2023). Single-walled vs. multi-walled carbon nanotubes: influence of physico-chemical properties on toxicogenomics responses in mouse lungs.Nanomaterials13 (6), 1059. doi:10.3390/nano13061059 PubMed Abstract|CrossRef Full Text|Google Scholar Sun, Y., Haglund, T. A., Rogers, A. J., Ghanim, A. F., and Sethu, P. (2018). Review: microfluidics technologies for blood-based cancer liquid biopsies.Anal. Chim. acta1012, 10–29. doi:10.1016/j.aca.2017.12.050 PubMed Abstract|CrossRef Full Text|Google Scholar Tang, L., Xiao, Q., Mei, Y., He, S., Zhang, Z., Wang, R., et al. (2021). Insights on functionalized carbon nanotubes for cancer theranostics.J. Nanobiotechnology19 (1), 423. doi:10.1186/s12951-021-01174-y PubMed Abstract|CrossRef Full Text|Google Scholar Tuncel, D. (2011). Non-covalent interactions between carbon nanotubes and conjugated polymers.Nanoscale3 (9), 3545–3554. doi:10.1039/c1nr10338e PubMed Abstract|CrossRef Full Text|Google Scholar VanderLaan, P. A., Yamaguchi, N., Folch, E., Boucher, D. H., Kent, M. S., Gangadharan, S. P., et al. (2014). Success and failure rates of tumor genotyping techniques in routine pathological samples with non-small-cell lung cancer.Lung Cancer84 (1), 39–44. doi:10.1016/j.lungcan.2014.01.013 PubMed Abstract|CrossRef Full Text|Google Scholar Wang, Y., and Weng, G. J. (2018). Electrical conductivity of carbon nanotube-and graphene-based nanocomposites.Micromechanics nanomechanics Compos. solids, 123–156. doi:10.1007/978-3-319-52794-9_4 CrossRef Full Text|Google Scholar Wu, S., Duan, B., Lu, A., Wang, Y., Ye, Q., and Zhang, L. (2017). Biocompatible chitin/carbon nanotubes composite hydrogels as neuronal growth substrates.Carbohydr. Polym.174, 830–840. doi:10.1016/j.carbpol.2017.06.101 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, S.-T., Wang, X., Jia, G., Gu, Y., Wang, T., Nie, H., et al. (2008). Long-term accumulation and low toxicity of single-walled carbon nanotubes in intravenously exposed mice.Toxicol. Lett.181 (3), 182–189. doi:10.1016/j.toxlet.2008.07.020 PubMed Abstract|CrossRef Full Text|Google Scholar Yu, B., Tan, L., Zheng, R., Tan, H., and Zheng, L. (2016). Targeted delivery and controlled release of Paclitaxel for the treatment of lung cancer using single-walled carbon nanotubes.Mater. Sci. Eng. C68, 579–584. doi:10.1016/j.msec.2016.06.025 PubMed Abstract|CrossRef Full Text|Google Scholar Yu, C., Shi, L., Yao, Z., Li, D., and Majumdar, A. (2005). Thermal conductance and thermopower of an individual single-wall carbon nanotube.Nano Lett.5 (9), 1842–1846. doi:10.1021/nl051044e PubMed Abstract|CrossRef Full Text|Google Scholar Yu, M.-F., Lourie, O., Dyer, M. J., Moloni, K., Kelly, T. F., and Ruoff, R. S. (2000). Strength and breaking mechanism of multiwalled carbon nanotubes under tensile load.Science287 (5453), 637–640. doi:10.1126/science.287.5453.637 PubMed Abstract|CrossRef Full Text|Google Scholar Yung, R.C.-W., Tyree, C., Colbert, A., Krishna, G., Mehta, R., Moja, J., et al. (2022). Abstract 2233: pilot study of liquid biopsy of lung cancer circulating tumor cells (CTC) captured by a novel carbon nano-tube (CNT) differential adhesion platform.Cancer Res.82 (12_Suppl. ment), 2233. doi:10.1158/1538-7445.am2022-2233 CrossRef Full Text|Google Scholar Zakaria, A. B., Picaud, F., Rattier, T., Pudlo, M., Saviot, L., Chassagnon, R., et al. (2015). Nanovectorization of TRAIL with single wall carbon nanotubes enhances tumor cell killing.Nano Lett.15 (2), 891–895. doi:10.1021/nl503565t PubMed Abstract|CrossRef Full Text|Google Scholar Zare, H., Ahmadi, S., Ghasemi, A., Ghanbari, M., Rabiee, N., Bagherzadeh, M., et al. (2021). Carbon nanotubes: smart drug/gene delivery carriers.Int. J. Nanomedicine16, 1681–1706. doi:10.2147/ijn.s299448 PubMed Abstract|CrossRef Full Text|Google Scholar Keywords:carbon, lung, cancer, treatment, carbon nanotubes Citation:Abdollahi Boraei SB, Kamalinejad F and Kiaei N (2025) The cutting-edge applications and properties of carbon nanotubes in diagnosis and treatment of lung cancer: a review.Front. Biomater. Sci.4:1500758. doi: 10.3389/fbiom.2025.1500758 Received:23 September 2024;Accepted:27 January 2025;Published:24 February 2025. Edited by: Reviewed by: Copyright© 2025 Abdollahi Boraei, Kamalinejad and Kiaei. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Seyyed Behnam Abdollahi Boraei,YmUuYWJkb2xsYWhpQHV0LmFjLmly Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Overview of carbon nanotubes 3 Carbon nanotubes properties 4 Mechanisms of action 5 Recent innovations in lung cancer applications 6 Future perspective 7 Conclusion Author contributions Funding Conflict of interest Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}