{"id": 1624, "name": "WTVR - Richmond News", "domain": "wtvr.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wtvr.com/us-news/crime/jury-convicts-harvey-weinstein-of-top-charge-in-the-retrial-of-his-landmark-metoo-sex-crimes-case", "title": "Jury Convicts Harvey Weinstein Of Top Charge In The Retrial Of His Landmark Metoo Sex Crimes Case", "content": "Menu Giving You A VoiceContact CBS 6 TeamShelby BrownLaura FrenchMelissa Hipolit Contact CBS 6 Team Shelby Brown Laura French Melissa Hipolit Contact CBS 6 Team Shelby Brown Laura French Melissa Hipolit Your Voice, Your Story Your Voice, Your CommunityCBS 6 CommunityAntoinette's EventsBuilding Better MindsBattle of the BrainsPaws for PetsCommunity Advisory Council CBS 6 Community Antoinette's Events Building Better Minds Battle of the Brains Paws for Pets Community Advisory Council CBS 6 Community Antoinette's Events Building Better Minds Battle of the Brains Paws for Pets Community Advisory Council NewsLocalYour Voice, Your StoryNationalInternationalScripps News GroupVirginia PoliticsNational PoliticsCrime and JusticeConsumerDon't Waste Your MoneyEntertainmentWeather NewsWatch Live NewscastsWatch VideosWTVR CBS 6 News TeamContact WTVR CBS 6 News Local Your Voice, Your Story National International Scripps News Group Virginia Politics National Politics Crime and Justice Consumer Don't Waste Your Money Entertainment Weather News Watch Live Newscasts Watch Videos WTVR CBS 6 News Team Contact WTVR CBS 6 News Local Your Voice, Your Story National International Scripps News Group Virginia Politics National Politics Crime and Justice Consumer Don't Waste Your Money Entertainment Weather News Watch Live Newscasts Watch Videos WTVR CBS 6 News Team Contact WTVR CBS 6 News Scripps News Group WeatherForecastInteractive RadarWeather AlertsMap CenterSkytracker CamsSchool Closings & DelaysInteractive Hurricane TrackerWeather NewsMeteorologists Forecast Interactive Radar Weather Alerts Map Center Skytracker Cams School Closings & Delays Interactive Hurricane Tracker Weather News Meteorologists Forecast Interactive Radar Weather Alerts Map Center Skytracker Cams School Closings & Delays Interactive Hurricane Tracker Weather News Meteorologists TrafficGas Prices Gas Prices Gas Prices HealthBuddy Check 6 Buddy Check 6 Buddy Check 6 SportsFinal Score FridayRVA Sports Awards Final Score Friday RVA Sports Awards Final Score Friday RVA Sports Awards Eat It, VirginiaFood and Drink NewsScott WiseRobey Martin Food and Drink News Scott Wise Robey Martin Food and Drink News Scott Wise Robey Martin Virginia This MorningRecipesVirginia This Morning on FacebookVirginia This Morning on Instagram Recipes Virginia This Morning on Facebook Virginia This Morning on Instagram Recipes Virginia This Morning on Facebook Virginia This Morning on Instagram Contests TV Listings About UsContact WTVR CBS 6Staff Email DirectoryMeet the WTVR CBS 6 News TeamWTVR 75th AnniversaryJobs at WTVRInternships at WTVR CBS 6WTVR CBS 6 Speaker Request FormAdvertise on CBS 6 and WTVR.comClosed Captioning InfoPublic FileEEO ReportsTV Listings Contact WTVR CBS 6 Staff Email Directory Meet the WTVR CBS 6 News Team WTVR 75th Anniversary Jobs at WTVR Internships at WTVR CBS 6 WTVR CBS 6 Speaker Request Form Advertise on CBS 6 and WTVR.com Closed Captioning Info Public File EEO Reports TV Listings Contact WTVR CBS 6 Staff Email Directory Meet the WTVR CBS 6 News Team WTVR 75th Anniversary Jobs at WTVR Internships at WTVR CBS 6 WTVR CBS 6 Speaker Request Form Advertise on CBS 6 and WTVR.com Closed Captioning Info Public File EEO Reports TV Listings Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Local Your Voice, Your Story National Politics Virginia Politics Entertainment Offbeat Sports Weather **Actions** Facebook Tweet Email **Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case** Former movie mogul Harvey Weinstein was convicted Wednesday of one of the top charges in his sex crimes retrial but acquitted of another, and jurors were as yet unable to reach a verdict on a third charge. The split verdict meted out a measure of vindication to his accusers and prosecutors — but also to Weinstein — after the landmark case was thrown into limbo. Weinstein's initial conviction five years ago seemed to cement the downfall of one of Hollywood's most powerful men in a pivotal moment for the #MeToo movement. But that conviction was overturned last year, and the case was sent back for retrial in the same Manhattan courthouse. This time, a majority-female jury convicted the former studio boss of forcibly subjecting one to a criminal sex act in 2006. But jurors acquitted Weinstein of another criminal sex act charge from 2006. And jurors were to continue deliberating on a charge that he raped another woman in 2013. Under New York law, the third-degree rape charge carries a lesser penalty than the first-degree criminal sex act offense. Weinstein, 73, denies sexually assaulting or raping anyone. Jury deliberations had teetered Wednesday as the foreperson again requested to speak to the judge about \"a situation\" he found troubling. The man — who complained Monday that other jurors were pushing people to change their minds and talking about information beyond the charges — was being questioned in private, at his request. While the jury was in court to hear the answer to an earlier request to re-hear the text of a rape law, the foreperson signaled to Judge Curtis Farber that he wanted to talk. \"He said words to the effect of 'I can't go back in there with the other jurors,'\" Farber explained later. The foreperson was sent to wait in a separate room, where he penned a note saying, \"I need to talk to you about a situation.\" When briefly brought into court, the foreperson said he wanted to speak in private. He, the judge, prosecutors and Weinstein's lawyers then went behind closed doors. The discussion was closed to the press and public, but Farber later said the foreperson had expressed that he didn't want to change his position — whatever it may be — and was being bullied. \"He did indicate that at least one other juror made comments to the effect of 'I'll meet you outside one day,' and there's yelling and screaming,\" the judge said. Weinstein lawyer Arthur Aidala characterized the foreperson's concerns more severely, saying that the man had said he was concerned for his safety after his fellow panelist talked about meeting him outside and added, \"you don't know me.\" \"I don't think the court is protecting this juror. Period,\" Aidala said, going on to ask for a mistrial. Prosecutor Matthew Colangelo, however, said the foreperson hadn't seemed afraid or apprehensive, just \"stubborn.\" \"He said he'd made up his mind, he didn't want to change it, and people were pressuring him to change it. That's what jury deliberations involve,\" the prosecutor said. The episode was the latest sign of strain among the jurors. On Friday, one of them asked to be excused because he felt another member of the group was being treated unfairly. Weinstein's lawyers asked unsuccessfully for a mistrial then, and again after the foreperson expressed his concerns Monday. The jury kept deliberating and went through Tuesday without sending any more messages about interpersonal tensions. The seven female and five male jurors started their fifth day of deliberations Wednesday by re-hearing accuser Jessica Mann's testimony that he raped her in a Manhattan hotel room in 2013. The group wrapped up Tuesday's deliberations by asking to revisit that testimony. Some jurors appeared to take fresh notes Wednesday, while others sat impassively as court stenographers read aloud the requested parts of Mann's days-long testimony. The jury had already reheard some of the passages last week. Weinstein, 73, pleaded not guilty to raping Mann and to forcing oral sex on two other women, Mimi Haley and Kaja Sokola. The Oscar-winning producer and former Hollywood powerbroker maintains that he never sexually assaulted or raped anyone, and his lawyers portrayed his accusers as opportunists who accepted his advances because they wanted a leg up in the entertainment world. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News Weather Traffic Giving You A Voice TV Listings About & Contact Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Terms of Use EEO FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact CBS6News cbs6 cbs6"}