{"id": 675, "name": "WBST - NPR - Muncie", "domain": "indianapublicradio.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://indianapublicradio.org/news/2025/02/p-o-p-shop-opens-near-site-of-2023-party-shooting-this-was-a-pit-where-didnt-nobody-wanted-to-hang-out-anymore/", "title": "P O P Shop Opens Near Site Of 2023 Party Shooting This Was A Pit Where Didnt Nobody Wanted To Hang Out Anymore", "content": "**** News Schedule Community Support About Contact A listener-supported serviceof Ball State University NPR BlueNotes Cardinal Compass Facing Project Owsley Moment Pop of Culture Noticias en Español **P.O.P Shop opens near site of 2023 party shooting: ‘This was a pit where didn’t nobody wanted to hang out anymore’** A new black-owned business is up and running on Willard and Hackley street, providing affordable “fair-priced” food and snacks to the community. But the story behind this convenience store makes it more than just a place you can enjoy your favorite treats. Where there was once tragedy, now stands a small business giving opportunities to youth in the community. In July of 2023, there was a mass shooting in the area of South Hackley and Willard St. resulting in many injuries and one death. Owner of P.O.P Shop, Paris, Powell, was a victim of the shooting and still carries this traumatic experience as he runs his new shop. Read More: ‘Shaken by violence’: Muncie gives update on weekend shooting that killed one, injured 18 “I left here traumatized, and I use that word very strongly. Especially for the body of experiences that I’ve had in my life, I still wasn’t traumatized for the fact of fear or anything like that, but traumatized by being powerless to do anything about that particular night,” Powell said. After returning to his home in Florida, Powell didn’t see much progress in the area where the shooting occurred. Powell then decided to take matters into his own hands. “That’s a big thing in our culture and our community, is that we bury so much pain, and we bury so much trauma that it becomes- we basically become immune to it. And indifferent to it to a fact that we think we can do nothing about it,” said Powell. The P.O.P Shop’s acronym stands for Purpose Over Profit, and administers this by employing teenagers to work during after-school hours. Nakita Reed, Powell’s fiancé, has been alongside him through this journey, helping paint the shop and working around the store. “He started from the bottom. I mean this was a pit where didn’t nobody wanted to hang out anymore. So he turned it into a positive environment for kids to improve themselves, grow,” Nakita said. Powell had no history in business, so he took a semester of Ball State’s Impact X class to help formulate his shop. Learning more about the intersection of entrepreneurship and community, Powell said he found this class helpful to the structure of his business. Powell plans to have an official grand opening in the Spring, and pushing towards making a Purpose Over Profit. Contact Kahmara Munn with comments atKahmara.munn@bsu.edu. **More from IPR** Community News Support Check out these other great events in our area!Jun126:30 am| Yorktown Civic GreenOpen Mic Night at Yorktown Civic GreenArt/Culture | Concert/TheatreJun129:00 am| MinnetristaCamp Minnetrista: Culinary SkillsEducational | FoodJun1212:00 pm| MinnetristaBob Ross Kids Painting WorkshopArt/Culture | EducationalSee more atDestination Muncie **** Check out these other great events in our area! Jun126:30 am| Yorktown Civic GreenOpen Mic Night at Yorktown Civic GreenArt/Culture | Concert/Theatre Jun129:00 am| MinnetristaCamp Minnetrista: Culinary SkillsEducational | Food Jun1212:00 pm| MinnetristaBob Ross Kids Painting WorkshopArt/Culture | Educational **** Check out these other great events in our area! Jun126:30 am| Yorktown Civic GreenOpen Mic Night at Yorktown Civic GreenArt/Culture | Concert/Theatre Jun129:00 am| MinnetristaCamp Minnetrista: Culinary SkillsEducational | Food Jun1212:00 pm| MinnetristaBob Ross Kids Painting WorkshopArt/Culture | Educational **IPR News Topics** Agriculture Arts and Culture Ball State Business Community Crime Economy Education Entertainment Environment Faith and Religion Family Issues Government Health Law Local News Military NewsLink Indiana Politics Science Sports Statewide News Technology The Daily News Transportation Weather Listen Live ScheduleBlueNotesCardinal CompassThe Facing ProjectThe Owsley MomentPop of Culture BlueNotes Cardinal Compass The Facing Project The Owsley Moment Pop of Culture BlueNotes Cardinal Compass The Facing Project The Owsley Moment Pop of Culture CommunityArts CalendarPSAs Arts Calendar PSAs Arts Calendar PSAs SupportMembershipBusiness SupportLeadership CirclePlanned GivingIRA Charitable RolloverVehicle Donation Membership Business Support Leadership Circle Planned Giving IRA Charitable Rollover Vehicle Donation Membership Business Support Leadership Circle Planned Giving IRA Charitable Rollover Vehicle Donation AboutCPB ComplianceEEO InformationFCC Public FileJob OpportunitiesPublic Media Accelerator (PMX)StaffStation HistoryStudio Tour CPB Compliance EEO Information FCC Public File Job Opportunities Public Media Accelerator (PMX) Staff Station History Studio Tour CPB Compliance EEO Information FCC Public File Job Opportunities Public Media Accelerator (PMX) Staff Station History Studio Tour ConnectAddressFacebookBall State Public Media AppInstagramTwitter Address Facebook Ball State Public Media App Instagram Twitter Address Facebook Ball State Public Media App Instagram Twitter **NOW PLAYING** **Indiana Public Radio** Live on92.1 FMMuncie |90.9 FMMarion |91.1 FMHagerstown / New Castle"}