{"id": 1280, "name": "The Spectator (uk)", "domain": "spectator.co.uk", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.spectator.co.uk/article/snp-plotters-should-think-twice-before-moving-against-john-swinney/", "title": "Snp Plotters Should Think Twice Before Moving Against John Swinney", "content": "Home Writers Newsletters Podcasts Briefings Events Club Archive Shop Coffee HousePoliticsEconomyWorldCultureLifeMagazine Coffee House Politics Economy World Culture Life Magazine Coffee House Politics Economy World Culture Life Magazine HomeWritersNewslettersPodcastsBriefingsEventsClubArchiveShop Home Writers Newsletters Podcasts Briefings Events Club Archive Shop Home Writers Newsletters Podcasts Briefings Events Club Archive Shop Coffee HousePoliticsSocietyWorldDataEconomyScotland Politics Society World Data Economy Scotland Politics Society World Data Economy Scotland CultureArtsBooksExhibitionsFilmMusicRadio & podcastsTelevisionStage Arts Books Exhibitions Film Music Radio & podcasts Television Stage Arts Books Exhibitions Film Music Radio & podcasts Television Stage LifeCultureWhat to watchWine & foodTravelPropertySportStyleHealth Culture What to watch Wine & food Travel Property Sport Style Health Culture What to watch Wine & food Travel Property Sport Style Health MagazineThe WeekFeaturesColumnistsBooksArtsLifeCartoonsPuzzles & games The Week Features Columnists Books Arts Life Cartoons Puzzles & games The Week Features Columnists Books Arts Life Cartoons Puzzles & games This week's issue07 Jun 2025 Coffee House Politics Economy World Culture Life Magazine Coffee HousePoliticsEconomyWorldCultureLifeMagazine Coffee House Politics Economy World Culture Life Magazine Coffee House Politics Economy World Culture Life Magazine HomeWritersNewslettersPodcastsBriefingsEventsClubArchiveShop Home Writers Newsletters Podcasts Briefings Events Club Archive Shop Home Writers Newsletters Podcasts Briefings Events Club Archive Shop Coffee HousePoliticsSocietyWorldDataEconomyScotland Politics Society World Data Economy Scotland Politics Society World Data Economy Scotland CultureArtsBooksExhibitionsFilmMusicRadio & podcastsTelevisionStage Arts Books Exhibitions Film Music Radio & podcasts Television Stage Arts Books Exhibitions Film Music Radio & podcasts Television Stage LifeCultureWhat to watchWine & foodTravelPropertySportStyleHealth Culture What to watch Wine & food Travel Property Sport Style Health Culture What to watch Wine & food Travel Property Sport Style Health MagazineThe WeekFeaturesColumnistsBooksArtsLifeCartoonsPuzzles & games The Week Features Columnists Books Arts Life Cartoons Puzzles & games The Week Features Columnists Books Arts Life Cartoons Puzzles & games This week's issue07 Jun 2025 Coffee House **SNP plotters should think twice before moving against John Swinney** 11 June 2025, 11:11am TextsettingsText sizeSmallMediumLargeLine SpacingCompactNormalSpacious Small Medium Large Compact Normal Spacious Small Medium Large Compact Normal Spacious Comments ShareShareStephen DaisleySNP plotters should think twice before moving against John SwinneyCopy linkCopiedLinkedinMessengerEmail **Share** Stephen Daisley **SNP plotters should think twice before moving against John Swinney** Linkedin Messenger Email **Share** Stephen Daisley **SNP plotters should think twice before moving against John Swinney** Linkedin Messenger Email For those who feel Scottish politics has become a little dull of late, fear not: a rebel faction within the SNP is plotting to make things very interesting again. Today’s GlasgowHeraldbrings the news of a secret summit of top SNP insiders at which plans to remove incumbent party leader (and Holyrood first minister) John Swinney were discussed. The paper says 25 ‘senior’ figures gathered on Monday to consider the boss’s future after the SNP’s surprise defeat in last week’s by-election in Hamilton, Larkhall and Stonehouse, a seat they had held uninterrupted since 2011. ‘The Presbyterian schoolmaster might fly in Perthshire, but in the rest of Scotland it just does not land’ The conspirators arereportedlyfrustrated by Swinney’s moderation on domestic policy and his failure to ramp up efforts to take Scotland out of the United Kingdom. They are said to be giving Swinney two weeks to present a new independence strategy or face a leadership challenge before the year is out. Some of their language is incendiary. An unnamed plotter describes the party’s situation as being ‘like Groundhog Day’, referring to Swinney’s previous, less than successful turn in the leader’s chair between 2000 and 2004. The conspirator charged Swinney with having ‘no energy, no fire, no boldness, no long-term vision’ and said that, when it came to making the case for independence, he had ‘failed on probation’. In an especially cutting remark, the Swinney critic said: ‘The Presbyterian schoolmaster might fly in Perthshire, but in the rest of Scotland it just does not land.’ This is bracing language considering Swinney has been credited with stabilising the SNP’s political fortunes after the chaotic 14-month reign of Humza Yousaf and re-establishing a stout polling lead over Scottish Labour. What he has not done is restart efforts to achieve independence, largely stalled since the 2022 Supreme Court ruling that the Scottish parliament cannot lawfully legislate for an independence referendum without Westminster’s consent. The next generation, who came of age politically during the 2014 referendum, are impatient for a fresh constitutional fight and for their own turn at the top of the party. There are those eager to see Stephen Flynn become SNP leader, though none quite so eager as Stephen Flynn himself, and the party’s most senior figure at Westminster will be standing for Holyrood next year. SNP gradualists will greet talk of ousting Swinney with horror. Undoubtedly, he handled Hamilton poorly, but he has been a stabilising force and has carefully navigated the party out of the identity politics cul-de-sac. SNP ministers are at last able to go a day, sometimes two, without talking about gender. Besides, felling Swinney before next spring’s Scottish parliament elections would involve giving the party its forth leader – and Scotland its fourth first minister – in a single parliamentary term. The Nationalists made plenty of noise about the Tories’ ever-changing leaders during the last Parliament. They could expect to be reminded of their own words if they chuck Swinney for someone else. Whatever becomes of this anti-Swinney plot, all factions of the party will remain bound by a political paradox they would rather not confront: that the voters want the SNP but not the thing the SNP wants. Comments ShareShareStephen DaisleySNP plotters should think twice before moving against John SwinneyCopy linkCopiedLinkedinMessengerEmail **Share** Stephen Daisley **SNP plotters should think twice before moving against John Swinney** Linkedin Messenger Email **Share** Stephen Daisley **SNP plotters should think twice before moving against John Swinney** Linkedin Messenger Email Topicsin this article Politics Scotland **Read next** Trending **Will the L.A. immigration riots reach Europe?** Also inPolitics **Britain doesn’t need more affordable housing** Also byStephen Daisley **How has the media wronged Nadiya Hussain?** Latest **Only proper welfare reform can bring true ‘national renewal’** **Most popular** Owen PolleyWhat caused the Ballymena riots? **What caused the Ballymena riots?** **What caused the Ballymena riots?** G.V. ChappellWhen did we become so boring? **When did we become so boring?** **When did we become so boring?** Madeline GrantThe spending review was 45 minutes I will never get back **The spending review was 45 minutes I will never get back** **The spending review was 45 minutes I will never get back** Mark GaleottiNo, Nato: Brits had not ‘better learn to speak Russian’ **No, Nato: Brits had not ‘better learn to speak Russian’** **No, Nato: Brits had not ‘better learn to speak Russian’** Andrew TettenbornDavid Lammy has scored a win against pro-Gaza civil servants **David Lammy has scored a win against pro-Gaza civil servants** **David Lammy has scored a win against pro-Gaza civil servants** **Comments** Comment section temporarily unavailable for maintenance. Contact & FAQs Advertise with us Sponsor an event Submit a story About The Spectator Privacy policy Terms and conditions Tax strategy Jobs and vacancies Sitemap Spectator Australia Apollo Magazine The Spectator shop Spectator archive The Spectator Club Subscribe today Sign up to our newsletters"}