{"id": 1563, "name": "We Got This Covered", "domain": "wegotthiscovered.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://wegotthiscovered.com/celebrities/prince-harry-is-low-down-on-prince-william-and-kate-middletons-list-of-priorities-as-the-couple-are-pressured-to-take-on-more-royal-duties/#comments", "title": "Prince Harry Is Low Down On Prince William And Kate Middletons List Of Priorities As The Couple Are Pressured To Take On More Royal Duties", "content": "News Movies TV Celebrities Marvel Netflix They Said What?! MarvelExpand MarvelSecret InvasionLokiThe MarvelsDeadpool 3 Secret Invasion Loki The Marvels Deadpool 3 Secret Invasion Loki The Marvels Deadpool 3 StreamingExpand StreamingNetflixDisney PlusApple TV PlusMaxHulu Netflix Disney Plus Apple TV Plus Max Hulu Netflix Disney Plus Apple TV Plus Max Hulu CelebritiesExpand CelebritiesDwayne JohnsonBrie LarsonJames GunnRyan Reynolds Dwayne Johnson Brie Larson James Gunn Ryan Reynolds Dwayne Johnson Brie Larson James Gunn Ryan Reynolds FandomsExpand FandomsOne PieceThe WitcherDCStar Wars One Piece The Witcher DC Star Wars One Piece The Witcher DC Star Wars Anime They Said What?! About & Advertising Affiliate Policy Privacy Policy Terms Contact **Prince Harry is ‘low down’ on Prince William and Kate Middleton’s ‘list of priorities’ as the couple are pressured to take on more royal duties** Published: Jun 11, 2025 01:42 pm At this point it feels like beating a dead horse when we sayPrince WilliamandHarryaren’t going to be mending the rift between them anytime soon. But it turns out William might not be entirely against the idea, he andKate Middletonare just going to be very busy as they take on more royal responsibilities. According to theScottish Daily Express,royal insiders have claimed that palace staff are growing increasingly irritated with William and Kate’s insistence on doing everything their own way. The couple may well be the most popular of all the royals, but behind palace walls they are being criticized for shirking their royal duties. **Prince William and Kate are under pressure to do more** The royal couple are apparently seen as work-shy by staffers — an opinion which wasshared by many even before Kate’s cancer scareback in 2024. In recent months Kate and William haveput family ahead of royal dutieswhich has earned them both praise and criticism. While putting family first is certainly admirable, the future King and Queen are expected to do much more for the monarchy than they are currently doing. Telegraph associate editor Camilla Tominey claims that aides have expressed concern that they “may be spending too much time with their immediate family instead of supporting the ‘Firm’.” She goes on to say that the Prince and Princess of Wales are “under growing pressure to up their workload.” While they have been upping their workload both are still lagging behind many other members of the royal family. William has attended many royal events but in some caseshis father has had to practically force him to go. He’s also received criticism for still finding the time to pursue personal endeavours. **This means reconciliation with Harry is unlikely** Surprisingly Tominey claims that William has cooled down on the subject of his brother. Harry recently spoke of reuniting with his family in the U.K. but sources suggestedWilliam and Kate were unable to move past his betrayal. She claims that the heir to the throne has had a change in attitude but that doesn’t mean he and the Duke of Sussex will be meeting in person anytime soon. With all the pressure on Kate and William to take on more work, reuniting with Harry is reportedly “low down their list of priorities.” It seems the anger has subsided, but as you can imagine, they aren’t exactly jumping to welcome Harry back with open arms. Unfortunately for Harry, William and Kate are content to just “let sleeping dogs lie.” With all the extra work they are likely going to be taking on the Duke will no doubt be put on the backburner. Friends insist there is still “no way back” for him. About & Advertising Corrections Policy Ownership Policy Fact Checking Policy Terms Ethics Policy Privacy Policy Affiliate Policy Contact Dot Esports Pro Game Guides Twinfinite Gamepur Attack Of The Fanboy Prima Games Siliconera The Escapist We Got This Covered Destructoid Gamer Journalist GameSkinny Operation Sports PC Invasion The Mary Sue Touch, Tap, Play Upcomer FruityBlox Bloxinformer"}