{"id": 923, "name": "Montana Free Press", "domain": "montanafreepress.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://montanafreepress.org/2025/01/03/remembering-wolf-reintroduction-on-the-30th-anniversary-of-one-of-the-20th-centurys-most-controversial-acts-of-ecosystem-management/", "title": "Remembering Wolf Reintroduction On The 30th Anniversary Of One Of The 20th Centurys Most Controversial Acts Of Ecosystem Management", "content": "**News you can trust — By Montanans, for Montanans** Start your day with the latest in-depth, independent reporting from across our state delivered directly to your inbox. Newsletters ♥ Donate Sign In NEWSOpen dropdown menuAgricultureArts and CultureEducationEnergyEnvironmentGovernmentIndigenous AffairsMTFP LocalHealthPolitics Agriculture Arts and Culture Education Energy Environment Government Indigenous Affairs MTFP Local Health Politics Agriculture Arts and Culture Education Energy Environment Government Indigenous Affairs MTFP Local Health Politics ProjectsOpen dropdown menu2025 Capitol TrackerMontana InsightsThe Session Podcast 2025 Capitol Tracker Montana Insights The Session Podcast 2025 Capitol Tracker Montana Insights The Session Podcast NEWSLETTERSOpen dropdown menuMT LowdownCapitolizedGreat Falls This WeekHelena This WeekMissoula This WeekWide Open Table MT Lowdown Capitolized Great Falls This Week Helena This Week Missoula This Week Wide Open Table MT Lowdown Capitolized Great Falls This Week Helena This Week Missoula This Week Wide Open Table EVENTS ABOUTOpen dropdown menuAbout MTFPAwards and HonorsSupport MTFPDonor TransparencyPublish our StoriesContactJobsBest PracticesPrivacy Policy About MTFP Awards and Honors Support MTFP Donor Transparency Publish our Stories Contact Jobs Best Practices Privacy Policy About MTFP Awards and Honors Support MTFP Donor Transparency Publish our Stories Contact Jobs Best Practices Privacy Policy DONATE MY ACCOUNT SHOP Newsletters ♥ Donate Sign In NEWSOpen dropdown menuAgricultureArts and CultureEducationEnergyEnvironmentGovernmentIndigenous AffairsMTFP LocalHealthPolitics Agriculture Arts and Culture Education Energy Environment Government Indigenous Affairs MTFP Local Health Politics Agriculture Arts and Culture Education Energy Environment Government Indigenous Affairs MTFP Local Health Politics ProjectsOpen dropdown menu2025 Capitol TrackerMontana InsightsThe Session Podcast 2025 Capitol Tracker Montana Insights The Session Podcast 2025 Capitol Tracker Montana Insights The Session Podcast NEWSLETTERSOpen dropdown menuMT LowdownCapitolizedGreat Falls This WeekHelena This WeekMissoula This WeekWide Open Table MT Lowdown Capitolized Great Falls This Week Helena This Week Missoula This Week Wide Open Table MT Lowdown Capitolized Great Falls This Week Helena This Week Missoula This Week Wide Open Table EVENTS ABOUTOpen dropdown menuAbout MTFPAwards and HonorsSupport MTFPDonor TransparencyPublish our StoriesContactJobsBest PracticesPrivacy Policy About MTFP Awards and Honors Support MTFP Donor Transparency Publish our Stories Contact Jobs Best Practices Privacy Policy About MTFP Awards and Honors Support MTFP Donor Transparency Publish our Stories Contact Jobs Best Practices Privacy Policy DONATE MY ACCOUNT SHOP Montana Free Press Montana's independent nonprofit news source. **The Year of the Wolves** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email Thank you for being a member of Montana Free Press.This quality reporting was made possible due in part to your contribution. Thank you for supporting in-depth journalism in Montana. By the 1930s, the Greater Yellowstone Ecosystem’s wolves had been systematically hunted and trapped out of existence. In their absence, it didn’t take long for humankind to rethink the wisdom of eradicating the ecosystem’s apex canine predator. Aldo Leopold, a visionary conservationist, thought of reversing course as early as 1944. “Why, in the necessary process of extirpating wolves from livestock ranges of Wyoming and Montana, were not some of the uninjured animals used to restock Yellowstone?” the icon of the environmental movement wrote in the Journal of Forestry. Leopold didn’t live to see that vision fulfilled, not even close. It took a full half-century before wolves returned to the world’s first national park. Canis lupusmay have found their own way back eventually — natural reoccupation was likely, some experts believed, though how soon was uncertain. The federal government didn’t want to wait to find out. By the 1990s, public interest in a reintroduction of the federally protected animals met the necessary political will. Then, 30 years ago this month, amid global fanfare, federal biologists turned 14 adult wolves — wild animals captured and transplanted from the Canadian Rockies — loose in Yellowstone National Park. To commemorate the anniversary, WyoFile and Montana Free Press are sharing the stories of wolf reintroduction to Yellowstone National Park and central Idaho’s wilderness complex — and what that effort has meant to Northern Rockies communities wary of wolves’ return. Emotions around the issue ran hot in 1995 — both among those who revere the large canines and those who revile them — and they haven’t cooled much since. Drawing from interviews conducted by WyoFile and MTFP, the Jackson Hole News’ archives and biologist Doug Smith’s 2020 book “Yellowstone Wolves,” we’ve woven together the story of the exceptionally controversial, yet successful, restoration of wolves to the Northern Rockies in the words of the activists, bureaucrats, biologists and politicians who were there. The memories and viewpoints presented have been organized and edited for brevity and clarity. In 1988, Congress charged federal wildlife managers with studying a reintroduction of wolves, which were added to the endangered species list in 1974. A 592-page report, “Wolves for Yellowstone?,” arrived in Congress two years later. Funding for another extensive study that would actually OK moving wolves — an environmental impact statement — came two years later, in 1992. In the ensuing two years, federal officials held 130 public meetings and analyzed 180,000 comments. By 1994, the plan was decided: Establish a “nonessential, experimental” population of wolves in Yellowstone and central Idaho. Marc Racicot served as governor of Montana from 1993 until 2001. Prior to that, he was the state’s attorney general. A former chair of the Republican National Committee and current advisory board member of the Mansfield Center at the University of Montana, Racicot remains active in political issues from his home in Helena. There was resistance on the side of those who opposed reintroduction, and there was enthusiasm on the other side. You don’t have to be a rocket scientist to figure out that it was a very difficult series of questions with a very small margin for error. It actually was quite pitched — there was an intensity to it. But those days were different than they are now, and even though it was frank, and candid, and to the point, it was also constructive. Renee Askins, founder of the Wolf Fund, was a crucial advocate for the reintroduction of wolves to Yellowstone National Park. Outside magazine wrote that Askins was “to wolves what Jane Goodall was to chimpanzees.” Interior Secretary Bruce Babbitt called her the “den mother” of reintroduction. She lives in Jackson Hole, Wyoming. The purpose of the Wolf Fund was the reintroduction of wolves to Yellowstone and essentially the coordination of both private and governmental entities and agencies. Our regional and local [advocacy] efforts were vital, but it was creating the national momentum and interest that would essentially give cover to [Bruce Babbitt] the head of Interior [and] the head of the Park Service, William Penn Mott. He made this personal, he made it his goal for his tenure as director of the National Park Service to achieve that. It wouldn’t have happened without the tacit approval of people like [Wyoming Sen. Al] Simpson. MARC RACICOT:Efforts were made to try and contribute in good faith to a holistic discussion of the issue and come to a conclusion that was not based on anything other than strong factual evidence. The backdrop for the discussion was a strong position of opposition by the agricultural communities across the state. Jim Magagna, of Sweetwater County, serves as the executive vice president of the Wyoming Stock Growers Association and has been lobbying on behalf of livestock interests in Wyoming for 49 years. He’s a lifelong sheep rancher, attorney by training and former Wyoming Office of State Lands and Investments director. There was certainly strong opposition in the ranching community and in all of the states, particularly in Wyoming. I do know that the Wyoming Farm Bureau took the initiative and filed litigation designed to stop the introduction from taking place. There was litigation filed on the other side by some of the environmental groups. Suzanne Asha Stone, of Boise, has advocated for wolves her entire adult life. After working with the Wolf Recovery Foundation, she co-founded the Wood River Wolf Project and went on to lead the International Wildlife Coexistence Network. In ’95 I was on the ground in Idaho, part of the field team to help support their arrival in the state. There were signs around town saying, “Kill all the wolves and all people who bring them here.” So it was a very tense period. Renee [Askins] was my role model. She was just a force of nature, and she was so wonderful. I remember going to some of the early meetings where she presideding. I just thought, “Gosh, when I grow up, I want to be her.” RENEE ASKINS:I spoke everywhere from Dubois, Cody, Gardiner, Livingston — the whole focus of the Wolf Fund was the Yellowstone ecosystem. My role was not to go into these communities and tell them or try to convince them, but really to listen to them and their concerns. Then try to respond to those concerns. I was very interested in what the questions were, what the fears were. Translating the environmental impact statement into a workable plan took months of intense organizing in 1994. Worried that the homing instinct of relocated wolves could foil the plan if they were sourced from too close, the reintroduction team looked to Canada. They secured permissions to capture wolves from two distinct populations — one in Alberta, another in British Columbia — to boost genetic diversity. The November before reintroduction, American biologists went north and worked with the Canadians to collar wolves in the donor population, greasing the skids for capturing their packmates the coming winter. Steve Fritts has been called the “architect of the wolf reintroduction.” At the U.S. Fish and Wildlife Service, he wore two main hats during the reintroduction era: wolf recovery coordinator and later chief scientist. He lives on the Colorado Front Range. There’s never been a successful introduction of wolves to the wild before, and so we were confronted with a whole lot of questions. I was responsible for coming up with answers to at least the major ones: Where to obtain the wolves? How to capture them? How to hold them in captivity? How to transport them? How to release them? It was my responsibility to make sure all this was based on the best science that we could come up with, although there was an awful lot of uncertainty in the entire thing. We made some of the best guesses that we could, based upon the information out there and the experiences that I’d had with translocating wolves in Minnesota. Through the published literature and my own experience, we came up with a basic framework with the whole thing. It was going to be a soft release of, ideally, family groups in Yellowstone, and a hard release of sub-adult wolves in Idaho. Mike Phillips is a wildlife biologist who led Yellowstone National Park’s gray wolf recovery program from 1994 to 1997, when he left the Park Service to found the Turner Endangered Species Fund. A former Montana state lawmaker with a particular interest in climate change and biodiversity, Phillips lives in Bozeman, Montana. Here’s the best way to look at it, a soft release is conducted when there’s no human stimulation present. When the animal in question gets to make its own decision: You’re not around, and it can run off and do whatever it wants. In a hard release, we’re right there. We’re shaking it out of a box, and it’s responding as much, probably, to us as anything. STEVE FRITTS:In four out of seven cases, we had to put together adult breeding wolves from different packs because out in the field we couldn’t capture the breeding male and the breeding female from the same pack. We had to adapt. And we knew all along we’d have to adapt — you can plan and plan and plan and plan — but sometimes you just have to adapt on the fly. That’s what we did. It worked out pretty well. We weren’t sure they were going to pair bond and breed, but they did, in most cases. On Jan. 10, 1995, a 20-person capture crew based out of Alberta’s Switzer Provincial Park started working to capture the first wolves bound for the states. Aerial crews darted 28 wolves from what they believed were 11 different packs during the operation, and Canadian trappers managed to nab more — many of which were collared and returned to the wild to monitor the donor wolf population. By month’s end, 14 wolves had been flown into Montana headed for Yellowstone and another 15 had been flown down to Idaho. Mark Bruscino retired from a 29-year career with the Wyoming Game & Fish Department in 2013. He had risen through the ranks, starting as a warden, to become the state’s large carnivore supervisor. Bruscino lives in Cody. I was on the capture crew that went to Hinton, Alberta in 1995 to catch the original wolves. The local people in Alberta … they thought we were loco. ‘What’s all the controversy about? Wolves are just wolves, they’re just wildlife. You deal with them, you manage them.’ STEVE FRITTS:The capture operations that I was a part of were just as intense and hectic as could be. I had my hands dirty, too. I think I put the radio collars on every single wolf that was brought to the U.S. STEVE FRITTS:In Alberta, we finally got enough wolves for the first shipment to Yellowstone and Idaho. We loaded those boxes of wolves on the Sherpa [airplane], and I watched very intently as that thing taxied down the runway and finally got off the ground and took off and disappeared from sight heading toward the United States. I thought, man, this is a great moment right here, one I’m going to remember until the day I die. “The local people in Alberta … they thought we were loco. ‘What’s all the controversy about? Wolves are just wolves, they’re just wildlife. You deal with them, you manage them.’” SUZANNE ASHA STONE:One of the first wolves we caught was this absolutely beautiful male wolf. Just stunning. Green eyes. He was just amazing. He was the only one that really didn’t want to be there. He acted so differently than all the rest of them. It’s not that he was aggressive. He was just so desperate to not be captive. When he got to Montana, one of the biologists was opening his cage to put a block of ice in and got bitten on the thumb by this wolf. And they killed him. Yes, what we were doing was important in terms of bringing wolves back. But it wasn’t just the population that matters. It’s the individual wolves that matter as well. With the first eight Yellowstone-bound wolves on U.S. soil, the Wyoming Farm Bureau Federation obtained an injunction from the 10th Circuit Court of Appeals blocking their release. The animals were being trucked between Great Falls and Gardiner, Montana when the ruling came in from appellate judges, who made it clear the wolves were not to leave their crates. Lacking better options, Yellowstone officials decided to move the wolves into acclimation pens near Crystal Creek, albeit while still in their shipping crates. Because of the stay and a winter storm, the four wolves headed into Idaho were stuck in their crates for nearly 90 hours. RENEE ASKINS:Mollie [Beattie] and I came up with the phrase, “Turning crates into coffins.” It was certainly a dicey time. There was a lot of apprehension about the impact on these individual animals. A memorable moment was the kids coming out from the Gardiner school. There was a lot of controversy. There were a number of teachers and administrators that did not want the kids participating, and the kids just took things into their own hands. They got their coats, and their mittens, and their hats, and they filed out there and applauded. It was just so cool to have the actual trailer with wolves in it coming through the gate and the kids cheering. Doug Smith led the wolf program in Yellowstone National Park for 29 years until his retirement in 2023. As a biologist, he’s been working with wolves for even longer, studying wolves in Michigan’s Isle Royale National Park before coming west. Smith lives in Bozeman, Montana. People would run over to horse trailers. Horse trailers! It wasn’t like there were bars that you could see through. They were in crates inside a horse trailer. People would be running up to the horse trailer and having their picture taken next to it, because there’s wolves inside. It’s a picture of them next to a horse trailer. Wolves have a tremendous presence. It was almost like that charismatic person who walks into a room at a party and everybody changes. That’s what it was like bringing them back into Yellowstone. MIKE PHILLIPS:We held a press conference [in Yellowstone National Park] right after the wolves had been placed in the pen to appeal to the judges’ sense of humanity. I suppose at some point, keeping those wolves in the shipping crates was a bit cruel — they were in a very secure pen. And I said during the press conference, “We simply want to let them out of their shipping crates into the pen. This is really bullshit. If [the court] wants to prevent the release, [it] has weeks yet to render that decision.” John Potter is an artist and illustrator whose paintings of wildlife and the natural world have been exhibited throughout the United States and abroad. He maintains a studio in Red Lodge, Montana, and recently finished illustrating the first of four children’s books written by Rick McIntyre, a former National Park Service ranger who has been chronicling Yellowstone’s wolves for four decades. I think the Park Service understood the relationship between Natives and wolves, and that’s why they wanted us to include ceremony for welcoming and adoption.Scott [Frazier] and I had been doing a lot of ceremonial work together at that time. As I recall, he had a conversation with the park superintendent and historian. Scott then approached me about coming to help him by doing songs. Scott Frazier is the CEO of Project Indigenous, where he works to incorporate Native American perspectives into natural resource management, with a particular interest in buffalo and water issues. An enrolled Crow tribal member, Frazier has a master’s degree in tribal protocol and communication. Frazier lives in Bridger, Montana. [National Park Service Historian Tom] Tankersley, he said, “OK, I’ll call you two weeks before [they’re brought into the park].” He called me on the two weeks. Then he said, “I’ll call you within four days.” And then it went down to 24 hours. It was really spooky. That was the hardest part: You know you’re going to do something really wonderful for animals, and you have to wait and be quiet. Tankersley called me and said, ‘OK, we’re going to do it, but they’re stuck. We’re going to bring you guys down, because they could be released any minute from Great Falls.’ So we went. [My then-wife] Marsha drove. And, God, it was so cold and the roads were so terrible. I mean, they were just terrible — wind blowing the snow. It was a miracle we made it out there. We got out to Crystal Bench in the middle of the night. You could hear coyotes, you could hear things moving around. JOHN POTTER:They told us that the wolves’ journey from Canada was held up in Great Falls because of the injunction filed by the [Wyoming Farm Bureau Federation]. We went ahead and did our ceremony anyway, and then when we were done, another [Park Service] ranger pulls up and says, “The injunction has been lifted. They’re coming.” After the verdict changed, the still-crated wolves were freed in the Crystal Creek pen just after midnight on Friday, Jan. 13, 1995. The first four Idaho wolves were freed immediately. Waves of wolves continued to come down from Canada for the remainder of the month, with 14 translocated to Yellowstone and 15 to central Idaho by February. The soft-released Yellowstone wolves would stay in their acclimation pens throughout the winter. MIKE PHILLIPS:The thing that actually prompted Doug [Smith] and I to let them go [from the holding pens] was the weight of water. So let’s imagine you and I have got, what would it have been, 14 gray wolves at remote settings in Yellowstone Park in captivity that we have to tend. We’ve got to feed them because they can’t get their own food. We know that in the wild, they do pretty well on five to seven pounds of food per wolf per day, but let’s bump that up a bit. Let’s target 10 pounds per wolf per day. OK, that’s 70 pounds of food each wolf a week. That’s a lot of meat. And you got three different locations, 14 animals, 140 pounds of food a day, that’s 980 pounds a week. So we were zookeepers. We were husbanding the wolves. That’s fine. We collected a bunch of carcasses, and it wasn’t that big a deal. But as winter gave way to spring, bleeding into March, now temperatures are warming and the snow in the pen was melting. Now we had to start hauling water in addition to the meat. Water weighs eight pounds a gallon. That’s a shitload of water. And I finally said to Doug, “Dude, we gotta let these guys go. Hauling all of this water is going to break our backs. This is too much.” And of course, as the snow melts, you lose the ability to use the sled pulled by mules to get the food up there. It becomes a logistical challenge that we can’t meet. That was a tremendous impact on my thinking about when to let them go.And then there were all these people nipping at my heels, “Come on Mike, come on Mike, come on Mike.” And so it was like day 82 or day 83 that we finally let them go. Ed Bangs wrote the environmental impact statement for wolf reintroduction and led the U.S. Fish and Wildlife Service’s gray wolf recovery program. He retired in May of 2011, shortly after Congress delisted wolves. As a retirement gift, U.S. Sen. Jon Tester of Montana gave Bangs the delisting bill, which he keeps in the basement of his home in Helena. In Yellowstone [in January 1995], the secretary of interior and the director of Fish and Wildlife Service and all the bigwigs and members of the media are there drinking champagne and celebrating the wolves and all that kind of stuff. And me and wolf recovery team volunteer John Weaver were in Missoula, Montana, sleeping in an airport hangar with a bunch of wolves in crates [bound for Idaho], putting ice into [the crates] to keep them alive. We were waiting to put them in the wild of central Idaho. The idea was to fly them into the wilderness with helicopters and turn them loose on some landing strips we could legally use. But the court case kept them in the pen three days longer, and the weather prohibited them from being released for another couple of days. Finally, we ended up doing a road release in Corn Creek, a tributary of the Salmon River, in January of 1995. Mike Jimenez was the project leader for Nez Perce Tribe of Idaho’s wolf reintroduction program. He continued to work on wolf issues post-reintroduction, eventually serving as the management and science coordinator for the U.S. Fish and Wildlife Service’s Northern Rockies region. He retired in 2016 and lives near Polson, Montana. Myself and Ed Bangs took off and got halfway there in a helicopter. But it was like a whiteout, so we had to fly back into Missoula. The way we decided to do it, then, was to take them in the back of a pickup truck. We actually drove them down to the edge of where we were going to release them. This was in the wintertime and the Forest Service helped us out by plowing a dirt road so we could get them back in there a ways toward the wilderness area. It was this very “What do you do to get these animals out in the midst of pretty foul weather’ operation.” It was a little precarious. ED BANGS:It was a horror show. There was this raging river nearby and steep mountains and an icy road. It was just a complete messed-up thing. But we had to get them out of the cages — they’d been in there way too long. “It was a horror show. There was this raging river nearby and steep mountains and an icy road. It was just a complete messed-up thing. But we had to get them out of the cages — they’d been in there way too long.” SUZANNE ASHA STONE:Multiple times we took wolves in by snowmobile. We tried to really get them as deep as we could back in there [by the wilderness area], because we wanted to make sure they weren’t going to pop back out and come close to a town. We went in at midnight with the wolves in a convoy of snowmobiles. The reason we went in at night is because there were lots of threats, even from the local police. We weren’t sure how safe we were going to be. The first year, we had armed government agents with us. ED BANGS:The wolves did fine. That’s mainly wolves — that isn’t because we did anything really great. They’re just really tough animals. MARK BRUSCINO:No one really knew how to pull this whole thing off. The soft release in Yellowstone and the hard release in Idaho were experimental, more or less. And both worked. I would say it went incredibly well. In 1996, Republicans gained control of both chambers of Congress for the first time in 40 years. Legislators quickly eliminated the appropriation earmarked for wolf reintroduction (the first year’s work cost $750,000). Wolf advocacy groups fundraised to help fill the gap, enabling a capture operation in Fort John, British Columbia, in January 1996. That year, 17 wolves in four waves went to Yellowstone, while 20 were flown down to Idaho. Although initially a 3-to-5-year plan, wolf reintroduction only needed two years. Each of the wolves brought in from Canada was fitted with a radio collar to track its movements and reduce the likelihood of conflicts developing as they moved into areas with more people. Ten pups from a Northwest Montana pack that got into trouble with livestock were released in Yellowstone later in 1996, but that was the end of wolf-reintroduction efforts. SUZANNE ASHA STONE:In ’96 I was actually on the ground up in British Columbia. We had had all the funding for the ’96 reintroduction pulled just a month or two before we were supposed to be on the ground doing the second year of capture. I went to my board — we were a small group — and begged them to let me use the list that we had. They gave me about 2,000 names. I sent out a front-and-back 1-page letter to those folks, just begging. A week or so later, we went to the post office, and the postmaster met me with a box that was just full of checks and letters and support. We were able to replace all of that funding. It was over $100,000. We were also able to get people to donate their time. SCOTT FRAZIER:I started to sour on the project. What happened to the wolves that we first brought in? One of them was shot right off — it was tragic. The Lamar Valley just turned into this paparazzi overnight. That wasn’t what I wanted. I wanted the wolves to have their privacy and be wolves. I didn’t want them collared. I just wanted them let go. I told Tankersley, “I think what I want to do is adopt these wolves and give them a family here.” So then we went and did a ceremony for that. I had gone to see my grandma. She was 101 or 102 at the time. I told her, “They’re bringing these wolves in from Canada, and they’re going to let them go. I want to adopt them, but I’m going to have to make a feed.” So she reached over and she pulled out a pack of crackers, and she said, “Feed them these.” That’s all she had. So I took them, and I offered those crackers. I put them on the rock up there, and I adopted them. JOHN POTTER:For the one in ’96, we actually got to be there when they were bringing wolves in and released into the acclimation pens up on Crystal Creek, Crystal Bench. And of course, all kinds of press was there. The first year we were able to avoid all the press, and the next year we couldn’t. So we were there doing our ceremony, and I was singing as wolves were being brought into the pens. All of the wolves that they released basically bolted as far away from the human beings as possible — went to the other end of the pen. But after we stepped out, the last one [stayed close] and just threw his head back and howled while we were singing. I still get goosebumps, even thinking about it. That was the most incredible moment for me. And I thought, “OK, they’re here. They’re here.” DOUG SMITH:As [monitoring] started, I was the main person flying. They were all collared. Everybody’s freaking out. “What are they going to do? Are they going to leave the park?” It was a lot of flying. I wanted to turn it into a research project. They’re like, ‘No, no, no. We want to make sure they’re not in some rancher’s backyard.’ Both Yellowstone’s and Idaho’s wolves thrived. They hit recovery goals — more than 300 wolves and 30 breeding pairs for three consecutive years — by 2002. Eventually, the Northern Rockies’ 2,000-plus wolves seeded still-growing populations in Oregon, Washington and California. The reintroduction states, meanwhile, took authority over the delisted species and began implementing their own management strategies. Congressstepped in to removeMontana’s and Idaho’s wolves from federal jurisdiction in 2011. Wyoming, which sought to manage wolves as non-regulated predators in much of the state, took longer to gain control as a result of litigation, but has beenmanaging its wolvesuninterrupted since 2017. MARK BRUSCINO:I don’t think anyone understood how quick it was going to happen, how quickly they were going to establish themselves and start reproducing. Everyone anticipated there was probably going to be higher mortality. Dispersers just taking off and never being seen again. In both cases, they pretty much settled right in and started doing what wolves do. JIM MAGAGNA:I certainly felt very worried about [reintroduction], to be honest. Defenders of Wildlife established a program to reimburse ranchers for losses of livestock to wolves. About four or five years after the reintroduction, as I recall it, there was a pack of wolves [that] moved down into my ranch. So I experienced that loss. Over a period of two years, I lost 61 head of sheep to wolves. Then Fish and Wildlife came in and removed that pack. ED BANGS:We had a pretty good idea they’d grow about 22% per year. We guesstimated that we’d have illegal killing, maybe 10% per year, and that we’d have to remove problem wolves that attacked livestock or did things we didn’t like, about 10% per year. All of those things came pretty close to being on track. DOUG SMITH:The most beneficial aspect of wolf recovery has been to humans, because it is a sensation. It’s millions of dollars a year in economic activity, of people coming here to see wolves. The latest figure was $82 million. I’m loathe to use economics to justify wildlife — so I’m not — but what I’m saying is they mean a lot to people. This has been a grand slam home run in terms of visitor enjoyment. MIKE PHILLIPS:The most significant consequence of the wolf restoration project in Yellowstone was its capacity to give rise to beautiful work elsewhere. It was of significance to the Mexican wolf recovery program in the southwest, the world’s most significant private effort ever to use private land and private assets to restore populations of imperiled species as redress for the extinction crisis. The Yellowstone project had fundamental bearing on the first-ever exercise of direct democracy to establish a lawful mandate to restore gray wolves in western Colorado, the archstone in an effort to restore a metapopulation of wolves that extends unbroken from the high Arctic to the Mexican border. The park matters because it’s a great birthing ground of ideas that get scattered to the seven winds and find roots somewhere else. That’s the significance of gray wolves in Yellowstone. JOHN POTTER:Having wolves back on the landscape for us, metaphorically, has helped a renaissance of our own. [It’s helped us] find our own home ground, our own center, again. And if you look at what’s been happening among Native people ever since the mid-’90s, early [2000s], there’s been this resurgence of Native people in movies, in theater, Native authors, Native poets. Native people have kind of come out of their shells. When I first heard that the wolves are coming back to Yellowstone, I just felt bigger, like I was growing inside. Biologically, the reintroduction of wolves to the American Rockies was an unmitigated success. But 30 years on, management of the controversial canines remains fraught — arguably more so than in the reintroduction era. Aprivately funded compensation program, reminiscent of the bounties that decimated wolf populations, has proliferated in Montana and Idaho, which have alsoexpandedthe number of wolves individual hunters and trappers can kill and the methods by which they can kill them. Concerns about population declines associated with those lawsspurredanultimately unsuccessfulpetition by environmentalists to relist wolves in 2021. In Wyoming, meanwhile, the anything-goes policies in the predator zone, where wolves have no protections, continue to produceugly outcomes, including theinfamous 2024 incidentof a Sublette County man torturing an adolescent wolf helegally wounded with a snowmobile. JIM MAGAGNA:The wolf reintroduction has been a success for those [for] whom that was the goal, and they’ve had the pleasures to come with that. And while we strongly opposed it till the last moment, we’ve developed tools — both in terms of how we manage wolves and in terms of how we manage and protect our livestock — to make it generally workable for us. At some cost, but workable. So I think we’re in that happy medium right now. I hate to see people, frankly on either side of that equation, pushing for significant change. DOUG SMITH:We’re at this really kind of nasty point in our cultural divide. You can’t even get running wolves over with snow machines banned in Wyoming. Come on, guys. And I’m not saying I’m anti-wolf hunting. I’m pro-livestock control, pro having a season on wolves. But I’m anti running them over with snowmachines, and Wyoming can’t even do that. STEVE FRITTS:One thing that remains the same is the fact that so many people just hate them. There’s so much disdain and vitriol about the animal. With all the persecution of wolves in Idaho and Montana, it almost seems like we’ve returned to the 1800s or early 1900s right now. That really disappoints me. MARK BRUSCINO:I think there’s room for wolves in northwest Wyoming. There’s not room for wolves everywhere in the modern world, but there’s certainly room for some wolves. I think they’ve showed us where they can live successfully and where they can’t, and that’s kind of what we got. SUZANNE ASHA STONE:I wish we would have stopped [reintroduction], given what has happened to Idaho wolves. Idaho is the worst place in the world to be a wolf. We have bounties on even pups in the den. They’re being killed 365 days of the year. They’re using aerial gunning, snaring, trapping. This wasn’t what we envisioned when we brought wolves back. MIKE JIMENEZ:If there’s anything I would do differently, I wish I had the age and the wisdom of somebody that had been doing it for decades and decades. Then you realize you’re probably not going to change people’s opinions. People that like wolves really like wolves, and people that don’t like wolves really don’t like wolves. And they’re both legitimate perspectives, but it took a while to kind of come to grips with that. And when you can do that, you can find places where wolves fit, and you can help people out when there are conflicts. **LATEST STORIES** **Missoula recognizes Pride flag as an official city flag in response to new state law** The Missoula City Council recognized the LGBTQ Pride flag as an official flag of the city in response to a new state law restricting the display of the flag on government property, including in public schools. **‘Slap in the face’: Federal cuts halt Indian boarding school digitization effort** An effort to digitize and make publicly available Indian boarding school records was halted when the Trump administration implemented mass layoffs and slashed funding for the National Endowment for the Humanities. Without funding, about 75,000 pages of boarding school records sit in online storage systems that cannot be accessed. Tribal leaders say the cuts disrupt… **A different kind of filling station** Rolling up to a gas station with food in mind is usually a recipe for highly processed, quick-calorie, overpriced junk food. But patrons of an Exxon station in Kalispell can fill up on some of the tastiest handmade Mexican food in Big Sky Country. **REPORT AN ERROR** **BEST PRACTICES** **ABOUT MTFP** **Amanda EggertEnvironmental Reporter** x Amanda Eggert studied print journalism at the University of Montana. Prior to becoming a full-time journalist, Amanda spent four years working with the Forest Service as a wildland firefighter. After leaving the Forest Service in 2014, Amanda worked for Outside magazine as an editorial fellow before joining Outlaw Partners’ staff to lead coverage for Explore Big Sky newspaper and contribute writing and editing to Explore Yellowstone and Mountain Outlaw magazines. Prior to joining Montana Free Press’ staff in 2021 Amanda was a freelance writer, researcher and interviewer. In addition to writing...More by Amanda Eggert **Mike Koshmrl, WyoFile** Mike Koshmrl reports on Wyoming's wildlife and natural resources. Prior to joining WyoFile, he spent nearly a decade covering the Greater Yellowstone Ecosystem’s wild places and creatures for the Jackson Hole News&Guide. Find him on Twitter at @Koshywrites, or reach him directly at mike@wyofile.comMore by Mike Koshmrl, WyoFile **Newsletters** Capitolized MT Lowdown Helena This Week Great Falls This Week Missoula This Week Wide Open Table **About** About MTFP Jobs Publish our Stories Contact Us **Join** SUBSCRIBE DONATE **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. Montana Free Press Privacy Policy. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}