{"id": 1798, "name": "RINF", "domain": "rinf.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://rinf.com/alt-news/newswire/prison-planet-com-labour-mp-who-said-isis-bride-should-come-back-to-uk-wants-to-ban-president-trump-from-state-visit/", "title": "Prison Planet Com Labour Mp Who Said Isis Bride Should Come Back To Uk Wants To Ban President Trump From State Visit", "content": "Home RINF Reports Breaking News Video Site Topics Home RINF ReportsPoisoned for Profit: We Are Not the Agrochemical Industry’s Guinea PigsFrom Mad Cow Disease to Agrochemicals: Time to Put Public Need…The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…Life Expectancy Falters in the UK: Slow Death but Fast Profits… Poisoned for Profit: We Are Not the Agrochemical Industry’s Guinea PigsFrom Mad Cow Disease to Agrochemicals: Time to Put Public Need…The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…Life Expectancy Falters in the UK: Slow Death but Fast Profits… **Poisoned for Profit: We Are Not the Agrochemical Industry’s Guinea Pigs** **From Mad Cow Disease to Agrochemicals: Time to Put Public Need…** **The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4** **From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…** **Life Expectancy Falters in the UK: Slow Death but Fast Profits…** Poisoned for Profit: We Are Not the Agrochemical Industry’s Guinea PigsFrom Mad Cow Disease to Agrochemicals: Time to Put Public Need…The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…Life Expectancy Falters in the UK: Slow Death but Fast Profits… **Poisoned for Profit: We Are Not the Agrochemical Industry’s Guinea Pigs** **From Mad Cow Disease to Agrochemicals: Time to Put Public Need…** **The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4** **From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…** **Life Expectancy Falters in the UK: Slow Death but Fast Profits…** **Poisoned for Profit: We Are Not the Agrochemical Industry’s Guinea Pigs** **From Mad Cow Disease to Agrochemicals: Time to Put Public Need…** **The Terrorists with US- Cyber Privateers commit Domestic Terrorism 4** **From the Green Revolution to GMOs: Toxic Agriculture Is the Problem…** **Life Expectancy Falters in the UK: Slow Death but Fast Profits…** **Prison Planet.com » Labour MP Who Said ISIS Bride Should “Come Back” to UK Wants to Ban President Trump From State Visit** Same people who welcome returning ISIS jihadists want to block leader of UK’s number one ally from entering the country Paul Joseph WatsonPrisonPlanet.comApril 23, 2019 Left-wing Labour MP Rupa Huq, who said that ISIS bride Shamima Begum should “come back” to the UK, is now calling for President Donald Trump to be banned from entering the country on a state visit because of “racism”. During aradio interviewin February, Huq said Begum, who had her citizenship revoked, had suffered “trial by media” and should have been allowed to return to the UK from Syria. This despite the fact that Begum literally stitched bombs into suicide vests to ensure they exploded when taken off during her time alongside ISIS jihadists in Syria. Begum was also a member of the “hisba” enforcement group, which handed out brutal punishments to those found flouting ISIS laws on how to dress and behave. She also pointed an automatic weapon at women in Syria for “wearing brightly colored shoes”. She also said during interviews that seeing decapitated heads in trash cans didn’t faze her because the victims were “enemies of Islam”. A d v e r t i s e m e n t While Huq is happy to see Begum return to the UK, she doesn’t want the leader of the free world and the UK’s number one ally to enter the country. Huq is one of several Labour MPs who have put their name to aparliamentary motionthat “calls on the Prime Minister and the Government to rescind the advice to offer a full state visit to President Trump.” The reasons given include Trump not believing in man-made climate change, him being mean to London Mayor Sadiq Khan and general accusations of “racism” and “misogynism”. Huq also said that Trump’s visit would not be “conducive to good race relations in this country” and said granting him a parliamentary address would also send out “all the wrong messages”. Maybe… Read more"}