{"id": 1409, "name": "The Moderate Voice", "domain": "themoderatevoice.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://themoderatevoice.com/trump-orders-marines-to-los-angeles-as-protests-escalate-over-immigration-raids-demonstrating-the-presidents-power-to-deploy-troops-on-us-soil/#respond", "title": "Trump Orders Marines To Los Angeles As Protests Escalate Over Immigration Raids Demonstrating The Presidents Power To Deploy Troops On Us Soil", "content": "Skip to main content Skip to secondary menu Skip to primary sidebar Home Mission Statement Commenter Rules Privacy Policy Contact Us Account Access The Moderate Voice An Internet hub with domestic and international news, analysis, original reporting, and popular features from the left, center, indies, centrists, moderates, and right Facebook Twitter Politics Society Arts & Entertainment Media Inspiration and Living Economy International Movie Reviews **Trump orders Marines to Los Angeles as protests escalate over immigration raids, demonstrating the president’s power to deploy troops on US soil** **Is Donald Trump’s Deployment of National Guard in Los Angeles a “Dress Rehearsal” for What’s to Come?** **What a Difference Four Years Make** **Trump-Musk Bitter Breakup Isn’t Over Yet: Bigger Fireworks in the Offing?** **D-Day Girls Revisited** **“The Intern in Charge”: Meet the 22-Year-Old Trump’s Team Picked to Lead Terrorism Prevention** **Autocrats don’t act like Hitler or Stalin anymore – instead of governing with violence, they use manipulation** **The totalitarian toddler’s wet dream** **Dealing With the Debt** **My Brother’s Light** **Like many populist leaders, Trump accuses judges of being illegitimate obstacles to safety and democracy** **Trump Administration Knew Vast Majority of Venezuelans Sent to Salvadoran Prison Had Not Been Convicted of U.S. Crimes** **The sad defenders of Old Joe’s delusional hubris** **ELON MUSK IS GETTING OUT OF DOGE** **The “Invasion” Invention: The Far Right’s Long Legal Battle to Make Immigrants the Enemy** **Europeans are concerned that the US will withdraw support from NATO. They are right to worry – Americans should, too** **Trump orders Marines to Los Angeles as protests escalate over immigration raids, demonstrating the president’s power to deploy troops on US soil** June 10, 2025byGuest VoiceLeave a Comment National Guard members watch protests in Los Angeles on June 9, 2025.Luke Johnson/Los Angeles Times via Getty ImagesWilliam C. Banks,Syracuse University President Donald Trump ordered a contingent ofabout 700 Marinesto Los Angeles on June 9, 2025, in response to what Secretary of Defense Pete Hegsethdescribed as“increased threats to federal law enforcement officers and federal buildings.” This dramatic escalation of the military presence in Los Angeles followed Trump’sJune 7 order to send about 2,000 National Guard troops into the city. Both measures wereTrump’s responseto what he called “numerous incidents of violence and disorder” by those protesting his administration’s actions rounding up and deporting immigrants in the Los Angeles area. State and local officials decried Trump’s actions, with California Gov. Gavin Newsom calling the move “purposefully inflammatory,” as well as “an illegal act.” California sued the Trump administration on June 9to block its deploymentof National Guard members. Other critics of Trump’s actions said the scale and character of the protestsdid not warrantsuch extreme measures. Amy Lieberman, a politics and society editor at The Conversation U.S., spoke withWilliam C. Banks, a scholar of the role of the military in domestic affairs, to understand the extent of a president’s power to send American troops to Los Angeles. Can American troops be used inside the country? They can, but it is an extraordinary exercise of authority to use troops domestically. It has rarely been done in the U.S. as a way of responding to a civil disturbance. Congress has delegated that authority of deploying American troops domestically to the president in limited circumstances. Otherwise, the only authority is exercised by governors, who have control of the National Guard. Why was American law set up this way? The U.S. was founded in response to heavy-handed English use of the military by King George to interfere with the civil liberties and rights of the colonists in the lead-up to the American Revolution. So, when the founders created the U.S. Constitution, they were very careful to insert roadblocks that would make it difficult for the government to use troops to carry out its own programs. The country’s framers also understood there might be occasions when it would be necessary to use the military domestically. They did a couple of things to control the exercise of military authority. One was to ensure that the commander in chief of the military was a civilian. Second, they gave the authority to call up the National Guard, what was known as the “militia” in those days, to Congress, not to the president, in order to create a separation of powers. Under what circumstances can the president deploy troops to an American city? Under theInsurrection Act, which was signed into law in 1807, a president can deploy troops during what is called an insurrection, simply meaning when all hell breaks loose. The president can decide that it is “impracticable,” according to the Insurrection Act, to enforce the laws of the U.S. in a given city, and he may call forth the military or the National Guard to help restore law and order. In order to invoke the Insurrection Act, the president first has to make a proclamation to those he calls the insurrectionists to cease and desist. Unless the alleged insurrectionists immediately do what the president says, the president then has the authority to deploy forces. Trump has repeatedlycalled the protestersin Los Angeles “insurrectionists,” but has also walked those remarks back and hasn’t made any kind of formal proclamation yet. When Trump ordered California’s National Guard members to deploy to Los Angeles on June 7, he did so on a narrow statutory authority to protect federal buildings, properties and personnel that were trying to enforce immigration laws. What is the Posse Comitatus Act and how does it apply to the current situation in Los Angeles? Congress passed thePosse Comitatus Act in 1878. This act’s name derives from anarcane Latin termthat means “the power of the county.” This law establishes a legal presumption in the U.S. that the military, if it is deployed domestically, should not engage in law enforcement. This act is an important part of American law. It means that the military and National Guard are trained on this principle that they are not to engage in domestic law enforcement activities. Those are reserved for police, sheriffs and marshals. Invoking the Insurrection Act is the principal exception to this law. So the Insurrection Act allows the military to act as law enforcement officials? That’s right. By invoking the Insurrection Act the military could act as cops and have the right to arrest, investigate and detain civilians, with only the Constitution as a check on its power. This is not a situation that California National Guard members have trained for. They are trained to fight actual wildfires, but this is something entirely different. Are there any legal roadblocks that could curb the president’s authority to send U.S. troops to Los Angeles? The short answer to this question is no. Can state governors or other elected officials prevent U.S. troops from being sent to their cities? In many ways that is the main question right now. California’s governor, Gavin Newsom, has said that thestate doen’t needthese military forces. Newsom’s June 9lawsuit against the Trumpadministration argues that the authority over the National Guard is reserved for states, “unless the State requests or consents to federal control.” That has not happened in this case. William C. Banks, Professor Emeritus of Public Administration and International Affairs,Syracuse University This article is republished fromThe Conversationunder a Creative Commons license. Read theoriginal article. Filed Under:Cities,Featured,Insurrecton,Law,Military,Politics,ProtestsTagged With:California,Constitution,Donald Trump,Gavin Newsom,Immigration,immigration law,Immigration Policy,insurrection,Law,Los Angeles,Military,military action,Military ethics,National Guard,Pete Hegseth,Politics,Posse Comitatus Act,troops,Trump 2.0,Trump administration **Primary Sidebar** **Click below to donate to The Moderate Voice** **Search The Moderate Voice** **The TMV Feed** Subscribe in a reader **Archives** **Categories** **Most Commented Posts (7 or so days)** **Popular Post Categories** Copyright 1998 - 2024 The Moderate Voice.Genesis Framework·WordPress·Log in"}