{"id": 1694, "name": "Corey's Digs", "domain": "coreysdigs.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.coreysdigs.com/u-s/exclusive-seamus-bruner-provides-comprehensive-roadmap-to-biden-family-corruption-and-documents-how-vp-joe-biden-compromised-u-s-national-security-while-biden-family-profited-from-deals-with-america/", "title": "Exclusive Seamus Bruner Provides Comprehensive Roadmap To Biden Family Corruption And Documents How Vp Joe Biden Compromised U S National Security While Biden Family Profited From Deals With America", "content": "REPORTSTHE SOLUTION SERIESSOLUTIONSU.S.GLOBALFOOD SUPPLY CHAINFINANCIALREAL ESTATEHEALTH & SCIENCEEDUCATION SYSTEMLAW & ORDERTECHNOLOGYTRAFFICKINGCONSCIOUSNESSLEARN HOW TO…OPINION THE SOLUTION SERIES SOLUTIONS U.S. GLOBAL FOOD SUPPLY CHAIN FINANCIAL REAL ESTATE HEALTH & SCIENCE EDUCATION SYSTEM LAW & ORDER TECHNOLOGY TRAFFICKING CONSCIOUSNESS LEARN HOW TO… OPINION THE SOLUTION SERIES SOLUTIONS U.S. GLOBAL FOOD SUPPLY CHAIN FINANCIAL REAL ESTATE HEALTH & SCIENCE EDUCATION SYSTEM LAW & ORDER TECHNOLOGY TRAFFICKING CONSCIOUSNESS LEARN HOW TO… OPINION SHOPPING CLUB FREEDOM FOR DIGGERS FILE DRAWER RUN BACKGROUNDS SWAG ABOUT CONTACT REPORTSTHE SOLUTION SERIESSOLUTIONSU.S.GLOBALFOOD SUPPLY CHAINFINANCIALREAL ESTATEHEALTH & SCIENCEEDUCATION SYSTEMLAW & ORDERTECHNOLOGYTRAFFICKINGCONSCIOUSNESSLEARN HOW TO…OPINION THE SOLUTION SERIES SOLUTIONS U.S. GLOBAL FOOD SUPPLY CHAIN FINANCIAL REAL ESTATE HEALTH & SCIENCE EDUCATION SYSTEM LAW & ORDER TECHNOLOGY TRAFFICKING CONSCIOUSNESS LEARN HOW TO… OPINION THE SOLUTION SERIES SOLUTIONS U.S. GLOBAL FOOD SUPPLY CHAIN FINANCIAL REAL ESTATE HEALTH & SCIENCE EDUCATION SYSTEM LAW & ORDER TECHNOLOGY TRAFFICKING CONSCIOUSNESS LEARN HOW TO… OPINION SHOPPING CLUB FREEDOM FOR DIGGERS FILE DRAWER RUN BACKGROUNDS SWAG ABOUT CONTACT **EXCLUSIVE: Seamus Bruner Provides Comprehensive Roadmap to Biden Family Corruption and Documents How VP Joe Biden Compromised U.S. National Security While Biden Family Profited from Deals with America’s Enemies** By Seamus Bruner **Executive Summary of Seamus Bruner’s revelations below:** This report is a one stop shop for all Biden Inc. email revelations. This roadmap to Biden corruption is full of information you won’t find in a single article anywhere else and contains brand new emails provided EXCLUSIVELY to Corey’s Digs Documents Reveal New Details Proving Biden Inc’s Cozy Ties with Chinese Communist Party Leadership Via Chinese Billionaires New messages show Joe Biden son’s expletive-laced rant that his lucrative Ukrainian pay was in jeopardy after father left office. Biden: “I was fighting for the only income I have left” Insider Documents Reveal How Hunter Biden Associates Helped Chinese Military Contractor Acquire Michigan Dual-Use Manufacturer Under a Secret Project the Chinese Code Named “Project Hanson” Biden Defector’s Emails Reveal Hunter’s Associates Viewed Direct ‘Pipeline’ to Obama-Biden Administration as ‘Currency’ ‘This is China, Inc.’: Emails Reveal Hunter Biden’s Associates Helped Communist-Aligned Chinese Elites Secure White House Meetings This comprehensive report is available in pdf format for download and print inThe Bookshop. Thanks to three brave Americans, we now know that Joe Biden has long misled the public about his involvement with his family’sforeign business entanglementswhile he served as vice president. At considerable personal risk, former Biden family business partnersTony Bobulinskiand Bevan Cooney, and computer shop owner John Paul Mac Isaac, have come forward with tens of thousands of primary-source documents — internal corporate records, emails, and text messages — detailing years of business dealings that centered on trading on the Biden name. This material suggests that, despite Joe Biden’s insistence that he knew nothing about his family’s business deals, he was well aware of his son Hunter Biden’s business ventures in China, Ukraine, Kazakhstan, and elsewhere. These new troves constitute hard evidence of Biden family corruption, and confirm our reporting dating back to my close friend and colleague Peter Schweizer’s 2018 book “Secret Empires.” In 2018, when Schweizer first broke the foreign influence scandals that have now engulfed the former vice president, it seemed apparent that China and Ukraine were not paying Biden’s family members for their expertise, they were buying access to the vice president of the United States. This was never a scandal solely about Hunter or Joe’s brothers, James and Frank. It was, and has always been, a Joe Biden scandal. For nearly three years, Biden and his surrogates have responded to the scandal with an increasingly unconvincing series of denials — including another from the former vice president in his last debate with President Trump. In response to “Secret Empires,” one ofJoe Biden’s aides said“we aren’t going to engage on a politically motivated hit pieces …” Team Biden did not bother to respond to specific allegations that the Biden family vacuumed up millions, in the exact locales where Biden was President Barack Obama’s policy “point man.” When the issue re-emerged during the campaign, Team Biden continued to call it a “conspiracy theory” but this time, Joe Biden firmly put himself on record. “I have never discussed with my son or my brother or anyone else anything having to do with their businesses — period,” he told reporters in August 2019. “I never talk with my son or my brother or anyone else in the distant family about their business interests, period.” He repeated similar blanket denials on numerous occasions. These denials all proved to be untruthful. Period. We now know that Joe Bidenmet directlywith his son’s Chinese business partner, Jonathan Li, in a Chinese hotel lobby on a fateful trip in 2013 (a trip that allowed Hunter to spend hours with his father, the vice president, on a transoceanic flight to Beijing aboard Air Force Two). Ten days later, Hunter landed an unprecedented $1 billion private equity deal, bankrolled by the Chinese government. But this was not the only meeting Joe Biden had with Biden family business partners. As the New York Post reported, emails on Hunter Biden’s hard drive reveal that on April 16, 2015, Joe Biden met with a high-level official of a controversial Ukrainian energy company, Burisma, which had put Hunter on its board. And arecently unearthed photoshows that Vice President Bidenmet with Hunter’s Kazakh business associatein Washington, DC. After first dismissing the gathering scandal as a “conspiracy theory,” the Biden team shifted to the position that Joe had never talked with his family about their business dealings, then shifted again to the position that he’d never met with his family’s business partners. Now, with the latest document revelations, Joe Biden unveiled his latest defense in the recent debate: “I have not taken a single penny from any country whatsoever, ever.” Team Biden points to Joe and Jill Biden’s tax returns as evidence that Joe did nothing improper. It is worth noting that the family members upon whom foreign entities showered money are not required to disclose their finances. We now know the Biden paydays were anything but conspiracy theories. Hunter was getting roughly$1 million per yearfrom Burisma.Treasury Department alertsreveal that Russian oligarch Elena Baturina wired $3.5 million to Biden’s interests. New text messages reveal that China Energy Company Ltd (CEFC)apparently paid$5 million to the Biden family.Another emailindicates Hunter demanded a $10 million-per-year “fee” from one of his Chinese business partners. There is no more doubt. The New York Postbroke newslast week that Joe Biden himself may have benefited from his son’s dealings. The Post quoted a cryptic message from one of Hunter’s partners, saying that “10 [percent] held by H for the big guy?” The recipient of that message, Tony Bobulinski,says“there is no question” that “H” stands for Hunter and the “big guy” is Joe Biden. We gain further insight into the operations of Biden Inc. in emails provided to us by Bevan Cooney, a former business associate of Hunter Biden. Cooney, who is currently in prison for his role in the Indian Bond Scheme that is sending Hunter Biden business partner Devon Archer also to jail, shared 26,000 emails that show what Hunter’s role was in their business ventures. The Biden name was considered “currency” for their foreign business ventures, and was a “direct … pipeline” to the Obama-Biden administration. Deals involving Hunter benefited from the “Biden lift,” the help that the name would provide in overseas dealings. What might the Bidens’ foreign benefactors have expected in return for all this largesse? We can’t say. But some may see a correlation between that foreign money and Joe Biden’s policy posture toward the sources of that money. Consider the case of the Penn Biden Center, a DC think tank named after Joe Biden. According to the center, its mission is to “Address Threats to the Liberal International Order.” The center analyzes the threats of “Russia” and “climate change” in detail. But China — the largest violator of basic human rights on the planet — does not make the list. Why? Perhaps we now know why. The following information—a roadmap to Biden corruption—is based on a comprehensive analysis of multiple batches of Biden-related files and correspondences that Biden’s associates, including Tony Bobulinski and Bevan Cooney, provided to my colleagues and me, exclusively. **The Bobulinski Files** Biden partner warned Bobulinski “don’t mention Joe” and the Bidens are “paranoid” about putting anything in writing Bobulinski says the Biden family is totally “compromised by China” New emails from Bobulinski suggest Joe Biden (aka “the big guy”) was given a 10% stake in a Chinese venture but Hunter Biden held the shares and cloaked Joe Biden’s involvement Bobulinski’s files are still being analyzed but thus far they provide the best evidence that Vice President Joe Biden was involved in the Biden family’s foreign dealings and thereby compromised U.S. national security Bobulinski messages reveal Hunter was willing to help the Chinese with “everything”—indicates he is willing to facilitate Chinese takeovers of any and all U.S. industries except weapons and defense companies (and even this extremely low bar proved to be false as demonstrated the below-mentioned Henniges deal) In mid-October, a man named Tony Bobulinski contacted several investigative journalists claiming to be a close business partner of the Biden family. He provided enough text messages and emails to back up his assertions and authenticate his relationship with Biden Inc. Bobulinski wished to remain anonymous but was persuaded that, unless he came forward and went public, no one would believe that explosive details he could provide were authenticate. Simply put, Bidengate—which continues to unfold day by day—could not be and would not be based on anonymous sources. Bobulinski was connected to the Wall Street Journal who assured him that they would tell his story. But after a week of delays, slow-walking, and inaction, Bobulinski realized that the Wall Street Journal could not be trusted to release his story in a timely fashion. He thus authorized numerous journalists to comb through thousands of his Biden-related files—corporate documents and correspondences, for the most part. This week Bobulinskiappeared onFOX News’ Tucker Carlson Tonight to unpack his earth-shattering revelations. One of the largest bombshells that Bobulinski has released to date is the assertion that Joe Biden held apersonal10 percent stake in at least one of his son’s Chinese ventures. Another message reveals Bobulinski was warned not to “mention” Joe in writing because the Bidens are “paranoid.” This text alone explains why Joe Biden’s name does not appear in more correspondences and perhaps why Biden associates frequently used nicknames for one another. Here are the latest revelations based on my reporting on the Bobulinski files: New messages show Joe Biden son’s expletive-laced rant that his lucrative Ukrainian pay was in jeopardy after father left office. Biden: “I was fighting for the only income I have left.” Co-authored by John Solomon atJust the News: “After his father left office as vice president, Hunter Biden lamented to a business partner in spring 2017 that his lucrative and controversial relationship with the Ukrainian gas company Burisma Holdings was in danger of falling apart. “I was fighting for the only income I have left right now from Burisma,” Hunter Biden wrote in a series of terse, f-bomb-laden text messages in June 2017 to Tony Bobulinski, the chief executive officer of a China-related venture the Biden family was creating at the time. The messages were contained in dump of communications that Bobulinski, now a whistleblower to the Senate and FBI, made public in the last week. They were independently verified by Just the News with one of the recipients and provide fresh evidence that Hunter Biden’s business fortunes appeared in many ways tied to his father’s proximity to power. Since 2014, Hunter Biden’s work as a board member for Burisma and its owner Mykola “Nikolais” Zlochevsky has generated controversy, in part because the Ukrainian gas firm was under corruption investigation at the same time then-Vice President Biden oversaw U.S. anti-corruption policy in Ukraine. Records obtained by the FBI show that Rosemont Seneca Bohai — a U.S. firm tied to Hunter Biden and his longtime business partner and fellow Burisma board member Devon Archer — received regular monthly payments totaling $166,666 from Burisma starting in 2014 and continuing into 2016. A Senate report last month concluded Hunter Biden and his partner received at least $4 million in payments from the Ukraine gas company. Obama-Biden era State Department officials testified earlier this year that the Bidens created the appearance of a conflict of interest that undercut U.S. efforts to fight endemic corruption in the former Soviet republic of Ukraine. Hunter Biden acknowledged in an interview he did not have much experience in Ukraine or the gas industry and may have landed the job in part because of his famous name. The newly released Bobulinski text messages, along with documents obtained by Just the News under the Freedom of Information Act, add a new twist to the long-running saga. They indicate Hunter Biden’s work with Burisma — and possibly part of his compensation — may have been tied to a gas deal in neighboring Kazakhstan that was struck in 2014 shortly after the vice president’s son was added to Burisma’s board. By spring 2017, Hunter Biden was worried that his Burisma income was in jeopardy and linked that income to his “position” in the Kazakh deal, according to the text messages and separate interviews. The text message exchanges on June 4-5, 2017 came as an agitated Hunter Biden described to Bobulinski why he had not been more attentive to matters in a separate China deal the two were involved with. “F[expletive] you Tony, I wasn’t asleep and those guys work for the Ukrainians and they think I haven’t left my room in 3 days,” Hunter Biden texted. “I was on Nikolais boat arguing about my position in their Kazakh deal and it was heated.” “I couldn’t call because I was fighting for the only income I have left right now from Burisma. It was a very heated and very tense and extremely unavoidable meeting negotiation that had a lot more at stake than me meeting you to say I’m not sending that letter to the Chairman under any circumstances,” Hunter Biden added in the texts. Lawyers for Hunter Biden and Archer, and a spokesman for the Biden campaign did not immediately respond to requests for comment. Two days prior to the texts, on June 2, 2017, Zlochevsky attended the annual Burisma-sponsoredEnergy Security for the Futureevent in Monaco. Also inattendancewere the Atlantic Council’s John Herbst, Burisma advisor Vadim Pozharskyi and Burisma board member and former president of Poland Alexander Kwasniewski, along with multiple current and former Ukrainian (and other foreign government) officials. Herbst, a former U.S. ambassador to Ukraine, had contacts in 2016 with the U.S. embassyin Kiev about efforts to end the corruption allegations against Burisma, documents previously obtained by Just the News show. The corruption cases in Ukraine were formally closed just days before Joe Biden left office, and U.S. officials feared two separate bribes had been paid by Burisma during the effort to get the cases shut down. Hunter Biden was not publicly listed as having attended the June 2017 event, but he hadattendedthe forum in the past. His text message to Bobulinski suggested he had been meeting with Zlochevsky on the sidelines. In December 2014, Burismaentered into an agreementwith Kazakhstan’s national oil and gas company Kazmunaigaz. According to apress release, this made Burisma the “first company in Ukraine, to develop oil & gas resources in the Republic of Kazakhstan together with the national oil & gas company.” The deal wassignedin Astana, Kazakhstan, where a delegation of Burisma executives led by Zlochevsky met with Kazakh officials. Upon announcement of the deal, Zlochevskystated: “It is a recognition that today Burisma Holdings has unique both onshore and offshore equipment for exploration, drilling and seismic data, which has no analogues in the post-Soviet space. At the beginning of 2015, we are planning to invest in joint projects on the territory of the Republic of Kazakhstan.” On the trip to Astana, Zlochevsky brought with him Archer, Hunter Biden’s longtime business partner, and Vadim Pozharskyi. Archer is a longtime friend of the Biden family and joined the board of Burisma around the same time Hunter Biden did in spring 2014. Hunter Biden and Archer were involved in several business ventures together. Pozharsky is a longtime associate of Zlochevsky and was at the time an advisor to Burisma. Pozharskyi recentlymade headlineswhen an email surfaced publicly suggesting he had secured an off-the-books meeting in April 2015 with Vice President Biden arranged by Hunter Biden. The revelation appeared to conflict with Joe Biden’s insistence that he “never discussed” his son’s business dealings. The Burisma delegation met with Kazakh Prime Minister Karim Massimov and Kazakh Foreign Minister Yerlan Idrisov. In June 2014, Kazakh dictator Nursultan Nazarbayev haddesignatedKarim Masimov to be his primary delegate to Ukraine, with the goal of forming friendly relations with the fledgling Poroshenko regime. Notably, Breitbart News recentlyrevealedan undated photo showing Joe Biden had dinner with his son Hunter and Massimov and a Kazakh businessman named Kenes Rakishev. Senate Homeland Security committee chairman Ron Johnson last monthidentifiedRahkishev as the foreign national behind a $142,300 payment that was sent to Archer in 2014 around the time of a key visit by Joe Biden to the region. Devon Archer received $142,300 from Kenges Rakishev of Kazakhstan, purportedly for a car, the same day Vice President Joe Biden appeared with Ukrainian Prime Minister Arseny Yasenyuk and addressed Ukrainian legislators in Kiev regarding Russia’s actions in Crimea,” Johnson’s committee wrote in a report released last month. Less than a year after Archer’s visit to Kazakhstan with Burisma, he was honored as a distinguished guest at a Sept. 27, 2015 “Captains of Industry” banquet hosted by Kazakh leader Nazarbayev on the sidelines of the United Nations General Assembly (UNGA) meeting in New York. State Departmentmemosobtained via FOIA by Just the News reveal that members of then-Secretary of State John Kerry’s team pulled strings to approve a last-minute request for Undersecretary Catherine Novelli to attend Nazarbayev’s banquet with Archer. “I know the time for UNGA meeting proposals is passed. An additional event has come up. Below, I have a preview draft below and confirmed guest list supplied by the Kazakhstanis,” wrote the Kazakhstan desk officer to another State Department official on Sept. 3, 2015. One week later, the Kazakh desk officer followed up to see if approval had been granted. A separate email on Sept. 10, 2015showsthe expedited request was approved and Undersecretary Novelli would “represent the USG at a dinner hosted by Kazakhstan’s President Nazarbayev.” Hunter Biden ended his relationship with Burisma in 2019 as his father, Joe Biden, began his presidential campaign. Co-authored with Ivan atthe Epoch Times: “Hunter Bidenand an energy tycoon with extensive ties to the Chinese Communist Party (CCP) had a cozy relationship, according to text messages disclosed to Senate investigators byTony Bobulinski, one of Biden’s former business partners. In text messages sent to Bobulinski on Oct. 14, 2017, Biden wrote that he and Ye Jianming, the founder of multibillion-dollar Chinese energy conglomerate CEFC China Energy, had a “solid” relationship. Biden said he was the first guest at Ye’s new apartment and that the billionaire cooked lunch for him. “I’ve been talking to the Chairman on a regular basis. I was his first guest in his new apartment/ he cooked me lunch himself and we ate in the kitchen together,” Biden wrote, according totext message screenshotsobtained by The Epoch Times. Biden added that Ye “has me helping him on a number of his personal issues” including for “staff visas and some more sensitive things.” The close relationship between the pair began as early as 2015, according to areportby the Republicans on the Senate Homeland Security Committee. The text messages raise significant questions considering the extensive ties between the communist regime and both Ye and his company. While on paper a private enterprise, CEFC had a rare contract to store part of China’s strategic oil reserves, received financing from a regime-owned bank, and hired a number of former top officials from state-owned energy companies, according to Reuters. The company also had more layers of Communist Party committees than many private Chinese companies. The text message from Biden, the son of Democratic presidential nomineeJoe Biden, was in response to a question from Bobulinski, who had at that point spent months trying to figure out why Ye had not yet wired $10 million to SinoHawk LLC, the U.S. joint venture incorporated by Ye, Hunter Biden, James Biden, Bobulinski, and two more partners, James Gilliar and Rob Walker. SinoHawk LLC was created through a web of corporate entities, according to corporate records (pdf) obtained by The Epoch Times. Hudson West IV, a limited liability corporation controlled by Ye, owned half of SinoHawk. Hunter Biden and his partners owned the other half through Oneida Holdings LLC, which they in turn owned through five more corporate entities, one for each partner, the corporate documents (pdf) show. According to Bobulinski, the “Sino” in SinoHawk stood for China, while “Hawk” was picked because it was the favorite animal of Beau Biden, Joe Biden’s deceased son. The emails, text messages, and documents reviewed for this article were produced by Bobulinski to the media and later to the Senate Homeland Security Committee. Sen. Ron Johnson (R-Wisc.), the committee chairman, told The Epoch Times last week that the committee’s ongoing review has found nothing to put the authenticity of the documents in doubt. “What I can say about all of those sources, we’re continuing to do our due diligence to verify and authenticate the genuineness of those emails,” Johnsonsaid. “And to date, we have found nothing that disputes them. All we’ve found is verification, validation of their authenticity.” At least one of the emails in the batch provided by Bobulinski matches word-for-word the emails purportedly obtained from a laptop belonging to Hunter Biden and published by The New York Post. Bobulinski reportedly turned in three of his smartphones to the FBI on Oct. 23. Ye’s underlings in China and the United States kept on telling Bobulinski that the wire was coming while putting up baffling roadblocks, likeaskingBobulinski what the goals of the joint venture were despite signing off on corporate paperwork which listed the mission of the enterprise. Throughout the process, Bobulinski could not get in direct contact with Ye and had to deal instead with his lieutenants. “So u 1000% [didn’t] reach out to Chairman Ye or Director Zang and create parallel noise?” Bobulinski wrote to Hunter Biden on Oct. 14, 2017. “I didn’t [think] so but just trying to manage chaos.” Biden responded by talking of his close relationship and regular talks with Ye, including that Ye engaged Biden as his attorney in the United States. Biden also curiously distanced himself from the acquisition deals in Oman and Luxemburg for which SinoHawk was ostensibly created. “Anyway, he and I are solid so when and if you or James feel like I’m capable of telling him about your Oman and Luxembourg or The Russian guys deal just let me know. We have a standing once a week call as I am also his personal counsel (we signed an attorney client engagement letter) in the US,” Biden wrote. “I assumed you lost interest as we haven’t spoken for so long. Are any deals that you said were closing—,” Biden wrote. Bobulinski’s responses suggest he was baffled by the response, considering the amount of effort he and other partners expended to get in touch with Ye to secure the promised $10 million in funding for SinoHawk. “About ‘my deals’ they apparently are our deals not my deals,” Bobulinski wrote. “Not much for games, they were supposed to fund 10 MM USD, which they never did, and am assuming u know that.” Ye never wired the money to SinoHawk, but Bobulinski would later learn from the Homeland Security Committee report that Hunter and James Biden received money from Ye via another channel. According to confidential documents obtained by the Senate Homeland Security Committee, on Aug. 4, 2017, more than two months before the Biden-Bobulinski text exchange, CEFC Infrastructure Investment (US) LLC, a subsidiary of Ye’s company, sent Hunter Biden’s law firm, Owasco, a payment for $100,000. Four days later, CEFC Infrastructure Investment wired $5 million to the bank account for Hudson West III, another entity controlled by Ye. On the same day the money arrived, Hudson West III started sending frequent payments to Hunter Biden’s firm. “These payments, which were described as consulting fees, reached $4,790,375.25 in just over a year,” the Senate report stated. A month later, on Sept. 8, 2017, Hunter Biden and Gongwen Dong, Ye’s U.S. operative, applied for a credit line. Hunter Biden, James Biden, and James Biden’s wife, Sara Biden, were authorized users for the credit cards linked to the accounts. They subsequently used the credit cards to buy more than $100,000 in luxury items including airline tickets and multiple items at Apple Inc. stores. When Bobulinski learned two years later about the money that flowed to the Bidens, he reached out to James Biden. “Hope you and family are well, safe and healthy. You can imagine my shock when reading the report yesterday put out by the Senate committee. The fact that you and HB were lying to Rob, James and I while accepting $5 MM from Cefc is infuriating,” Bobulinski wrote, using Hunter Biden’s initials. “And so disappointing based on the years of work that James, Rob and team invested to get things done,” Bobulinski added. Further hints about Ye and Biden’s intentions for SinoHawk are revealed in anemailfrom one of Ye’s lieutenants to Bobulinski. On July 26, 2017, Zhao Runlong wrote about the $5 million of working capital intended for SinoHawk as money “lent to BD family.” “This $5 million loan to BD family is interest-free. But if the 5 M is used up, should CEFC keep lending more to the family?” Zhao wrote, using “BD” as shorthand for “Biden.” A review of nearly 1,800 pages of emails and more than 600 messages Bobulinski handed over to Congress suggests that Bobulinski’s insistence on running SinoHawk by the book may have resulted in Hunter Biden abandoning his partners and accepting money from Ye via another route. Bobulinski summed up the events prior to the last presidential debate on Oct. 22, telling reporters that Hunter Biden wanted to use SinoHawk as a personal “piggy bank” before Bobulinski intervened. President Donald Trump invited Bobulinski as a guest to the debate because the emails and texts Bobulinski handed over to Senate investigators can be viewed as damaging to Joe Biden. Joe Biden’s name does not come up in any of the corporate documents used to set up SinoHawk. At the time the company was formed, he was no longer in the White House. The texts and emails show that Gilliar brought Bobulinski into the deal to work full-time as the CEO of SinoHawk. Hunter Biden began to voice concerns about the direction of the company in mid-May, 2017, less than two weeks before the paperwork incorporating SinoHawk was signed. On May 13, 2017, Gilliar sent anemailto Biden, Bobulinski, and Walker about proposed “remuneration packages” and an equity breakdown between the five partners. Under the proposal, Hunter Biden would receive an $850,000 salary and a 20 percent stake in Oneida Holdings, which in turn owned half of the joint venture with Ye’s company. The equity breakdown also included a 10 percent stake, which was to be held by Hunter Biden “for the big guy.” Bobulinski told reporters on Oct. 22 that the “big guy” was Joe Biden. Hunter Biden reacted to the proposal by pointing out that he would need more than $850,000 because after alimony and taxes he would be left with only $100,000 for himself. “I have been the only one asked to give up all other active commercial interests- no consulting fees no promoting another business no continuing to work on existing projects etc…so I have to admit I do expect that if I can’t keep my toe in other things I will need a hell of a lot more than 850 p/y on a monthly basis,” Bidenwrote. On the same day, Bobulinski wrote a text message to Gilliar: “We need to manage Hunter as every discussion makes me feel like he thinks things are going to be his personal piggybank.” On May 16, 2017, Bobulinski responded to Hunter and partners by pointing out that the company would need an operating budget in order to make a profit. “We should all discuss so you are covered but you also have to be conscious of the moving parts and operating budgets and we have to pay a team of people who will be working 100 hours a week so we generate enough profits so we are distributing $10s of MM out to the owners,” Bobulinskiwrote. “I will be circulating the Terms for Oneida later today. In that I have included an [additional] payment to you and I as sitting on the board of SinoHawk. We can all discuss.” In the following days, the money discussion escalated into a standoff about the ultimate control of the company. Bobulinski, who was taking on the CEO role, did not want to have his decisions overruled by the Bidens, who controlled half the company with the combined stakes. Hunter Biden pushed back hard, arguing that Ye went in for the deal solely due to the Biden family name. “They are both coming to be MY partner to be partners with the Bidens,” Biden wrote in a group chat on May 17. The next day, in a text message sent directly to Bobulinski, Biden outlined his case for getting full control of the company. “Tony please stop the ‘[you’re] making me nervous’ bull [expletive]. Come on man we both want the same thing. We want to make certain we have as much control over our own fates as possible. I don’t blame you for wanting that – it doesn’t ‘make me nervous’ it is what it is. Just happens that in this instance only one player holds the trump card and that’s me,” Bidenwrote. “May not be fair but it’s the reality because I’m the only one putting an entire family legacy on the line/ and if you think it’s reasonable that I turn the keys over to someone that I’ve spent less than 12 hours with than that makes me nervous. So I’m asking you to do us all a favor and find a different way to alleviate your worries,” Biden added. The argument then spilled out again into thegroup chat, with Biden making the case for why he should have more control of the company. At one point, Biden appeared to threaten to break Bobulinski’s jaw, to which Bobulinski responded with an invitation to a fight. The argument exposed that Bobulinski didn’t want to end up being a figurehead CEO to cover for the Biden family’s involvement without any control over the company. “And to add to it, if you are so worried about your family, you wouldn’t be doing this because as u said, all of your dad’s lawyers and any lawyer would advise you and Jim not to touch this with a 100 foot pole,” Bobulinski wrote. “So if you are willing to take risk so be it, I am willing to stand by your side and take risk as well but there has to be balance in governance and the board.” While Joe Biden’s name does not appear in any of the corporate records disclosed by Bobulinski, the Biden family name was nonetheless one of the key offerings to Ye from Hunter Biden and his partners. An April 25, 2017, business proposal (pdf) prepared by the partners for CEFC, features a photo of Joe Biden with Columbian President Juan Manuel Santos. The proposal touts Joe Biden’s relationship with Santos as a “strong one throughout the Obama administration.” A section dedicated to potential CEFC investments in Oman noted that Hunter Biden’s “family & friends” could be used to endorse Ye and CEFC and solicit a special exemption from the leader of Oman to establish a “CEFC vehicle” that is uniquely [sanctioned] by His Highness to omit the required local partner element.” In a June 1, 2017,letterto Ye, Hunter Biden, after sending wishes from “my family and I,” wrote “I hope you are very happy with the progresses [sic] that has been made in Oman, this in my opinion cements our common belief, that by combining our connects and skills, we will create new opportunities in third geographies and economies, as well as the benefits for our two great countries.” SinoHawk never got off the ground, but Hunter Biden and Gilliar appear to have been providing the same services for Ye in a less formal fashion since as early as February 2016. In anemailto CEFC sent on March 13, 2017, Gilliar referenced “several strategy documents that [were] prepared earlier in our relationship” including a proposal for the CEFC acquisition of Westinghouse Electric Corporation in the United States. The Westinghouse proposal (pdf) attached to that email was dated Feb. 22, 2016. CEFC China Energy was China’s largest privately-held oil company before it was caught in Beijing’s crosshairs in 2018. The oil conglomerate made billions of dollars in Russia, Europe, and parts of Africa, while Ye fostered ties with high-level Chinese Communist Party (CCP) officials. Ye has been missing since early 2018 after he was placed under investigation by the Chinese regime for “suspected economic crimes” and detained. A state-owned enterprise took control of CEFC in March 2019, and, according to Chinese media Caixin, the firm declared bankruptcy early this year. Hunter Biden, James Biden, Gilliar, Walker, Bobulinski, and the Joe Biden campaign did not respond to requests for comment. **The Cooney Files** In early October 2020, a man named Bevan Cooney contacted investigative journalist Matthew Tyrmand via his attorney and asked Tyrmand if he knew anyone who would be interested in accessing a private gmail inbox that contained a treasure trove of emails and attachments that would help elucidate the burgeoning Biden foreign influence scandal. Cooney provided written authorization for us to access and publish his emails. Tyrmand immediately thought of Peter Schweizer and the team (including me) that blew the Biden-China, Biden-Ukraine, and other Biden-corruption stories wide open in 2018, again in 2019, and again in 2020. Schweizer, Tyrmand, and I got Cooney’s credentials and immediately set to work digging through Cooney’s emails. It soon became clear that Cooney was definitively a Biden associate but somewhat of a fringe player and did not usually communicate directly with Biden family members (more often with Hunter’s best friend and frequent business partner Devon Archer). Despite the fact that Cooney did not communicate with the Biden’s often, his emails are still immensely valuable as Cooney, Archer and another Biden associate name Jason Galanis talked very openly about how they could “leverage Hunter more” and use his direct “pipeline” to the Obama-Biden administration as a form of “currency.” Bruner provides never-before-seen emails to Corey’s Digs that reveal: Biden associates were aware that they should not invoke the Biden name. They often used code names and obscure references and inside jokes. Biden associates coordinated meetings for their business partners with Obama-Biden administration officials. Devon Archer talks candidly about securing new business with oligarchs and even the sovereign wealth fund of KazakhstanArcher: we could “literally be handed the keys to the sovereign wealth castle….I’m going full Kazakh!” One Biden associate used sexual innuendo to convey how excited he was at the prospect of landing a deal with the infamous billionaire Russian oligarch Elena Baturina In September 2015, the Obama-Biden administrationapproved the saleof a strategically sensitive Michigan manufacturer, Henniges Automotive, to a firm connected to Joe Biden’s son, Hunter, and a Chinese military contractor that was on an American watch list because of its close ties to the People’s Liberation Army. Hunter Biden’s equity fund, backed by the Communist Chinese government, and the Chinese contractor, Aviation Industry Corporation (AVIC), needed special approval for the deal from the Committee of Foreign Investment in the U.S. (CFIUS) because Henniges produced technology with potential military use. AVIC entities have been sanctioned by the United States onfive separate occasionssince 1993 and the addition to thewatch list–a major red flag—occurred less than a year-and-a-half before they co-purchased Henniges with the Biden-led Chinese joint venture known as Bohai Harvest RST (BHR). The fact that CFIUS approved the deal is alarming given that Henniges ownsnumerous facilities in the United Statesthat are now controlled by a Chinese military front company. Internal BHR documents show exactly how the Chinese military contractor was able to disguise its ownership via shell corporations and formed a joint-venture with the son of the vice president to facilitate the Chinese takeover of an American dual-use technology supplier. Additional documents suggest that Hunter Biden’s Chinese-backed venture funneled money to an entity controlled by Vanessa Kerry, the daughter of then-Secretary of State John Kerry, just one month before CFIUS approved the takeover. At the time, Secretary Kerry played a lead role on the Obama-Biden CFIUS committee. When news of the AVIC takeover of Michigan-based manufacturer Henniges Automotive hit the wire, Biden’s associates celebrated, calling the transaction a “proof of concept” for future Chinese acquisitions. “Congratulations!!!! Proof of concept again,” read the subject line of Devon Archer’s email on September 15, 2015. “This is great. Let’s get a letter out to Ambassador Baucus ASAP Archie (an apparent Archer nickname),” Bevan Cooney replied. Cooney is a former Biden associate who is now incarcerated for a separate venture—the tribal bond scheme—involving Biden’s business partners. Cooney has provided investigative journalists Peter Schweizer and Matthew Tyrmand with access to his emails with written authorization. Cooney’s emails (and their attachments) reveal how Hunter Biden’s BHR viewed the Henniges acquisition—which they code named “Project Hanson”—as a major coup and a model for future BHR “cross-border” investments. Moments after the deal closed, Archer set to work drafting a letter to U.S. Ambassador to China Max Baucus (who happened to be alongtime friendof the Biden family). Archer’s letter was an invitation to Ambassador Baucus to attend a banquet celebration for the deal with esteemed guest including BHR’s communist state-owned “strategic partners” and investors: I am writing to invite you to a cross-border banquet to celebrate our acquisition of Henniges Automotive. We consummated the transaction earlier this month, in conjunction with our strategic partner, AVIC, for $600 million. I have also attached a news article about the transaction.This milestone marks our first U.S.-based acquisition. Our strategic partners, including AVIC and Sinopec, will be in attendance, as will our investors, including the Bank of China and China Development Bank. We hope to discuss the opportunities and challenges of cross-border investments for Chinese companies in today’s macro environment. A member of our team has also extended an invitation to your economics advisor – Jonathan Fritz – to speak at the seminar. The strategic partners and investors that Archer listed—particularly Sinopec, the Bank of China, and the China Development Bank—are all State-owned entities and therefore arms of the Chinese Communist Party whose executives/officials, along with BHR, clearly wanted to celebrate the Henniges coup. Indeed, Hunter Biden’s Chinese business partners were pleased. Oneinternal BHR documentstates in both English and Mandarin Chinese: “We are incredibly proud of the perseverance, dedication and ingenuity of the Project Hanson team who collectively brought to life the first-born of BHR’s cross-border investment platform, the first of many to come.” Roger Robinson, a former senior director for international economic affairs on President Ronald Reagan’s National Security Council,claimsthat “the U.S. government has known for years that AVIC has been helping China’s military and aiding U.S. enemies and as such was sanctioned in the past.” AVIC’s well-known and long-established ties to the Chinese military-industrial complex makes the Obama-Biden administration’s approval “all the more curious.” “This is anything but a benign Chinese enterprise,” said Robinson. But BHR and AVIC’s Project Hanson helped obfuscate and ameliorate the AVIC connections by creating a complex ownership structure. One internal BHR document reveals precisely how the Chinese military front company was able to disguise its true ownership in a byzantine off-shore structure, presumably obfuscating the fact that the Chinese military was taking over U.S. company whose technology is on the restricted Commerce Control List (“Target” refers to U.S. military supplier Henniges Automotive): Another internal BHR document contains a shocking revelation: Devon Archer facilitated Chinese “support” for an entity called Seed Global Health. Seed Global Health wasco-foundedand controlled by the daughter of Secretary John Kerry. According to BHR’s December 2015 internal document: “A special shout out to our director and shareholder, Devon Archer, for his involvement with the Seed Global Health non-profit foundation, which works to send medical staff and resources globally to countries in need. BHR will continue to support this and other worthy causes.” It appears that BHR is referring to afundraiser hosted by Devon Archerfor Secretary Kerry’s daughter and her Seed Global Health organization that occurred on August 16, 2015—less than one month before Kerry’s State Department and the rest of the Obama-Biden CFIUS agencies approved Henniges takeover. The politically connected Seed Global Health has previouslycome under fire for receiving more than $9 millionin State Department funds without bids or competition and, in 2018, an executive at Seed Global Healthwas charged by federal prosecutorsfor violating federal conflict of interest laws and illegal lobbying. As Schweizer and I broke onBreitbart, Hunter Biden’s business associates spoke candidly in emails about Hunter Biden’s role in the business, particularly as it related to foreign ventures, apparently viewing the Biden name as a form of “currency,” and bragging that they had a “direct…pipeline” to the Obama-Biden Administration. In another email, Hunter Biden’s associates touted Hunter’s access to the White House and contrasted his willingness to “take on risk” with that of Chris Heinz—then-Secretary of State John Kerry’s stepson and a close friend of Biden and Archer—who was uncomfortable with some of their potential partnerships. In October 2013, Hunter Biden’s associates (including Devon Archer)discussedwhich one of their corporate vehicles would be appropriate for a new deal they were working on. Archer noted their need to use a “Rosemont Seneca SPV” (also known as a special purpose vehicle) because Rosemont Capital was too close to the Heinz family and because using an SPV could “bring Hunter into the mix.” Archer explained his desire “to leverage Hunter more” in a way that didn’t involve Heinz, who Archer called “much more risk averse.” Another benefit of the Rosemont Seneca SPV was, per an October 5 email from Hunter Biden and Devon Archer’s business associate Bevan Cooney to Archer, it “would be good to put some honey in Hunter’s pocket.” That same day Archer responded: “Agreed. I also have more autonomy with that company as I own it with Hunter and he’s willing to take on risk… Hunter will work if we need him too [sic] as well.” Five days later, Biden’s business associate Jason Galanis confirmed to Archer that he had changed the corporate references in the proposal to include a Hunter Biden-controlled firm. Archer replied, clearly pleased. “Perfect. Let’s just keep to that. We get the Biden lift and stay out of Heinz panties.” Archer had noted he would use Rosemont Seneca Partners instead of Rosemont Capital, in which Heinz held a stake. Hunter Biden and Devon Archer’s Rosemont Seneca Partners would play a pivotal role in their future deals. Forexample, in December 2013, Rosemont Seneca Partners finalized a deal with the Chinese government-backed investment vehicle, Bohai Harvest, to form Bohai Harvest RST, a new firm in which Hunter Biden wouldmaintain a 10% equity stakeand whose funds wouldgrow to at least $1.5 billion. Soon after that deal (and after Biden and Archer joined the board of Ukraine’s Burisma Holdings), Heinz made moves to sever his formal business ties with Archer and Biden in May 2014. Just hours after Burisma’s announcement that Biden and Archer had joined the board, Heinzemailed top aidesfor his step-father and then-Secretary of State John Kerry, alerting them to the potentially compromising arrangement. “Apparently Devon and Hunter both joined the board of Burisma and a press release went out today,” Heinz said. “I can’t speak why they decided to, but there was no investment by our firm in their company.” But Heinz’s concerns apparently did not deter Biden and his associates from continuing to leverage the Biden family name to pursue questionable business arrangements. In an email on November 4, 2014, Biden’s business associate Jason Galanis discussed a draft pitch that he was preparing for possible investors. Galanis explained that the presentation would cover boilerplate issues like investor protections. But Galanis also sought to emphasize their connections to the White House, specifically Vice President Joe Biden: “I wanted to focus on the ‘other currency’ we are bringing to the table…direct administration pipeline.” Galanis also mentioned dropping Joe Biden’s connections in their pitch when dealing with union pension funds. Galanis wrote, “maybe we should also remind of HB’s dad’s union relationships to justify the ask??” In a March 2015, draft investor pitch, Biden’s associates wrote about the need to “leverage Hunter Biden Taft Hartley network.” Taft Hartley is the law governing union pension funds, and Joe Biden has a long-established history of close relationships with union bosses, which Hunter Biden and Joe’s brother James Biden havereportedly sought to capitalize onin the past. The presentation noted that the team “led by Archer and Biden” would create “unprecedented opportunity for a firm at our scale,” and referenced tapping finances from Chinese officials. In December 2013, as has been widely reported, Biden and Archer secured a $1 billion private equity deal financed by the Chinese government. Biden and his associates wanted to go back for even more Chinese money. In the March 2015, draft investor pitch, Biden’s associates outlined the plan to leverage family clout for more foreign cash. In a section outlining where investments would come from, Biden’s associates described capital flowing from “China>USA” and “Former CCP [Chinese Communist Party]>USA.” And the presentation also proposed more cross-border business deals involving “China SOE [State Owned Enterprises]” and “Former CCP Energy.” The above quotes are taken directly from a trove of 26,000 emails and attachments from Hunter Biden and Devon Archer’s business associate Bevan Cooney. These emails—provided to Schweizer from Cooney via journalist Matthew Tyrmand—are completely separate from the emails released by the New York Post (purportedly derived from a backup of Hunter Biden’s laptop hard drive). Cooney is currently serving time in federal prison for his role in the tribal bond scheme that also resulted in the conviction of Devon Archer on conspiracy and securities fraud charges. Archer currently awaits sentencing for that conviction. The Newly obtained emails from a Hunter Biden business partner lay out in detail how the Vice President’s son and his colleagues used their access to the Obama-Biden administration to arrange private meetings for potential foreign clients and investors at the highest levels in the White House. These never-before-revealed emails outline how a delegation of Chinese investors and Communist Party officials managed to secure a private, off-the-books meeting with then-Vice President Joe Biden. In a 2011 email, Hunter Biden’s business associates also discussed developing relations with what one called “China Inc.” as part of a “new push on soft diplomacy for the Chinese.” These emails are completely unconnected to the Hunter Biden emails being released by theNew York Post. These and more explosive never-before-revealed emails were provided to Schweizer by Bevan Cooney, a one-time Hunter Biden and Devon Archer business associate. Cooney is currently in prison serving a sentence for his involvement in a 2016 bond fraud investment scheme. In 2019, Cooney reached out to Schweizer after becoming familiar with the revelations in his 2018 book Secret Empires. Cooney explained that he believes he was the “fall guy” for the fraud scheme and that Archer and Hunter Biden had avoided responsibility. Archer, who was also convicted in the case, saw a federal judge vacate his conviction. But an appellate court overturned the lower court judge’s ruling,reinstatingArcher’s conviction in the case. Archer, Hunter Biden’s longtime business partner, awaits sentencing. Cooney, their associate who is currently serving a prison sentence on his conviction in the matter, later reestablished contact with Schweizer through investigative journalist Matthew Tyrmand. From prison, Cooney provided Schweizer with written authorization, his email account name, and password to his Gmail account to retrieve these emails. He authorized, in writing, the publication of these emails— notable because it is the first time a close associate has publicly confirmed Hunter’s trading on his father’s influence. The emails offer a unique window into just how the Biden universe conducted business during the Obama-Biden Administration. These associates sought to trade on Hunter Biden’s relationship with, and access to, his father and the Obama-Biden White House in order to generate business. For instance, on November 5, 2011, one of Archer’s business contacts forwarded himan emailteasing an opportunity to gain “potentially outstanding new clients” by helping to arrange White House meetings for a group of Chinese executives and government officials. The group was the China Entrepreneur Club (CEC) and the delegation included Chinese billionaires, Chinese Communist Party loyalists, and at least one “respected diplomat” from Beijing. Despite its benign name, CEC has been called “a second foreign ministry” for the People’s Republic of China—a communist government that closely controls most businesses in its country. CEC was established in 2006 by a group of businessmen and Chinese government diplomats. CEC’s leadership boasts numerous senior members of the Chinese Communist Party, includingWang Zhongyu(“vice chairman of the 10th CPPCC National Committee and deputy secretary of the Party group”),Ma Weihua(director of multiple Chinese Communist Party offices), andJiang Xipei(member of the Chinese Communist Party and representative of the 16th National Congress), among others. “I know it is political season and people are hesitant but a group like this does not come along every day,” an intermediary named Mohamed A. Khashoggi wrote on behalf of the CEC to an associate of Hunter Biden and Devon Archer. “A tour of the white house and a meeting with a member of the chief of staff’s office and John Kerry would be great,” Khashoggi said before including what should have been a major red flag: “Not sure if one has to be registered to do this.” Presumably, Khashoggi meant a registered lobbyist under the Foreign Agents Registration Act (FARA). Khashoggi believed the trip presented “a soft diplomacy play that could be very effective” and would give Hunter Biden’s business partners “good access to [the Chinese] for any deal in the future.” Indeed, the email boasted of CEC’s wealthy membership:CEC’s current membership includes 50 preeminent figures such as: Liu Chuanzhi, Chairman of the CEC, Legend Holdings and Lenovo Group; Wu Jinglian, Zhang Weiying, and Zhou Qiren, China’s esteemed economists; Wu Jianmin, respected diplomat; Long Yongtu, representative of China’s globalization; Wang Shi (Vanke); Ma Weihua (China Merchants Bank); Jack Ma (Alibaba Group); Guo Guangchang (Fosun Group); Wang Jianlin, (Wanda Group); Niu Gensheng (LAONIU Foundation); Li Shufu (Geely); Li Dongsheng (TCL Corporation); Feng Lun (Vantone) and etc. The gross income of the CEC members’ companies allegedly “totaled more than RMB 1.5 trillion, together accounting for roughly 4% of China’s GDP.” The overture to Hunter Biden’s associates described the Chinese CEC members variously as “industrial elites,” “highly influential,” and among “the most important private sector individuals in China today.” Before contacting Hunter Biden’s associates, the CEC had been trying to get meetings with top Obama-Biden administration officials to no avail. “From the DC side as you will see below they [CEC] have written letters to several members of the administration and others and have so far not had a strong reaction.” “This is China Inc,” wrote Khashoggi in the email, referring to the delegation of Chinese billionaires. “Biggest priority for the CEC group is to see the White House, and have a senior US politician, or senior member of Obama’s administration, give them a tour… If your friend in DC can help, we would be extremely grateful,” Khashoggi emphasized. Hunter Biden and Devon Archer apparently delivered for the Chinese Communist Party-connected industrial elites within ten days . The original Oct. 19, 2011, email from Khashoggi was sent to Gary Fears — a controversial political fundraiser with a checkered history who was caught up in a riverboat casino scandal in the mid-1990s — who forwarded it on to Archer a couple weeks later on Nov. 5, 2011. Time was short, as Khashoggi’s original email noted that the Chinese delegation would be in DC on Nov. 14, 2011. Fears told Archer to “reach out” to Khashoggi about the request regarding getting the Chinese businesspersons and officials into the Obama White House, adding it would be “perfect for” Archer to also “attend” with them and then “get guys for the potash deal.” The same day Fears sent Khashoggi’s message to him, Archer took the email from Fears and sent to Khashoggi a business proposal for a potash mine deal he had lined up. Six days after the initial overture, Archer received a followup email asking how a meeting with CEC’s representative went. The email closed with “Do me a favor and ask Hunter [Biden] to call me — I’ve tried reaching him a couple of times.” Archer responded, “Hunter is traveling in the UAE for the week with royalty so probably next week before he will be back in pocket…. The meeting with [CEC representative] was good. Seems like there is a lot to do together down the line. Probably not a fit for the current Potash private placement but he’s a good strategic relationship as the mine develops. Definitely have a drink with Mohammed and let him know how impressed I was with his whole deal.” One minute later, Archer sent a follow-up email, “Couldn’t confirm this with Hunter on the line but we got him his meeting at the WH Monday for the Chinese folks.” On the day of the meeting, November 14, 2011, Cooney emailed Fears to confirm that Archer “got the Chinese guys all taken care of in DC.” The Obama-Biden Administration archives reveal that this Chinese delegation did indeed visit the White House on November 14, 2011, and enjoyed high-level access. The delegation included approximately thirty members, according to White Housevisitor logs. But those records also obscure perhaps the most important item for the Chinese delegation: a meeting with Vice President Joe Biden himself. The visitor logs list Jeff Zients, the deputy director of Obama’s Office of Management and Budget (OMB), as the host of the CEC delegation. Obama hadtaskedZients with restructuring and ultimately consolidating the various export-import agencies under the Commerce Department—an effort in which the Chinese delegation would have a keen interest. Atrip itineraryposted by the CEC also confirms the delegation met with Obama’s then-recently-confirmed Commerce Secretary John Bryson. Curiously, the Obama-Biden visitor logs do not mention any meeting with Vice President Joe Biden. But the Vice President’s off-the-books meeting was revealed by one of the core founders of the CEC. Inan obscure documentlisting the CEC members’ biographies, CEC Secretary General Maggie Cheng alleges that she facilitated the CEC delegation meetings in Washington in 2011 and boasts of the Washington establishment figures that CEC met with. The first name she dropped was that of Vice President Joe Biden. The relationships established during that visit may have benefited Hunter Biden and Devon Archer down the road. Two years later, they famously helped to form the Chinese government funded Bohai Harvest RST (BHR) investment fund. One of BHR’s firstmajor portfolio investmentswas a ride-sharing company like Uber called Didi Dache—now called Didi Chuxing Technology Co. That company is closely connected toLiu Chuanzhi, the chairman of theChina Entrepreneur Club(CEC) and the founder of Legend Holdings—the parent company of Lenovo, one of the world’s largest computer companies. Liu is a former Chinese Communist Party delegate and was a leader of the 2011 CEC delegation to the White House. His daughter was the President of Didi. Liu has long beeninvolved in CCP politics, including serving as a representative to the 9th, 10th, and 11th sessions of the National People’s Congress of the PRC and as a representative to the 16th and 17th National Congress of the Chinese Communist Party. Liu was the Vice Chairman of the 8th and 9th Executive Committee of All-China Federation of Industry and Commerce (ACFIC), an organization known to beaffiliated with the Chinese United Front. **Senate Homeland Security Committee Revealed That Biden’s Apparent Conflicts of Interests Posed National Security Risk** Senators Grassley and Johnson’s joint-committee report provides a detailed roadmap to the Bidens’ connections to hostile foreign governments and individuals, including convicted criminals. The main characters that enriched the Bidens are reportedly from Russia, Ukraine, Kazakhstan, and China. To read the full senate joint-committee report on the Biden’s potential conflicts of interest,Click Here. Executive Summary of Senate Report on Biden Family Corruption: In early 2015 former Deputy Chief of Mission at the U.S. Embassy in Kyiv, Ukraine,George Kent raised concerns to officials in Vice President Joe Biden’s office about the perception of a conflict of interest with respect to Hunter Biden’s role on Burisma’s board.Kent’s concerns went unaddressed and in September 2016, he emphasized in an email to his colleagues, “Furthermore, thepresence of Hunter Biden on the Burisma board was very awkward for all U.S. officials pushing an anticorruption agenda in Ukraine.” In October 2015, senior State Department official Amos Hochstein raised concerns with Vice President Biden, as well as with Hunter Biden, thatHunter Biden’s position on Burisma’s board enabled Russian disinformation efforts and risked undermining U.S. policy in Ukraine. Hunter Biden was serving on Burisma’s board (supposedly consulting on corporate governance and transparency) when Burisma ownerMykola Zlochevsky allegedly paid a $7 million bribe to officials serving under Ukraine’s prosecutor general, Vitaly Yarema, to “shut the case against Zlochevsky.” George Kent testified that this bribe occurred in December 2014 (seven months after Hunter Biden joined Burisma’s board), and, after learning about it, he and the resident legal adviser reported this allegation to the FBI. In addition to the over four million dollars paid by Burisma to Hunter Biden and his business partner, Devon Archer, for membership on the board,Hunter, his family, and Archer received millions of dollars from foreign nationals with questionable backgrounds. Devon Archer received $142,300 from Kenges Rakishev of Kazakhstan, purportedly for a car, the same day Vice President Joe Biden appeared with Ukrainian Prime Minister Arsemy Yasenyukand addressed Ukrainian legislators in Kyiv regarding Russia’s actions in Crimea. Hunter Biden received a $3.5 million wire transfer from Elena Baturina. Ms. Baturina is Russia’s richest female oligarch and the wife (widow) of the former mayor of Moscow. Hunter Biden had business associations with Ye Jianming, Gongwen Dong, and other Chinese nationals linked to the Communist government and People’s Liberation Army. Those associations resulted in millions of dollars in questionable transactions. Hunter Biden opened a bank account with Gongwen Dong that financed a $100,000 global spending spree with James Biden and Sara Biden. Hunter Biden also moved millions of dollars from his law firm to James Biden’s and Sara Biden’s firm. Upon being questioned about the transaction, Sara Biden refused to provide supporting documentationand information to more clearly explain the activity. The bank subsequently closed the account. Hunter Biden paid nonresident women who were nationals of Russia or other Eastern European countries and who appear to be linked to an “Eastern European prostitution or human trafficking ring.” Indeed, Obama-Biden-era State Department officials (including Marie Yovanovitch and George—the star witnesses during Trump’s impeachment hoax) were well aware that Vice President Joe Biden’s proximity to the corrupt Ukrainian gas Burisma (via Biden’s son) created a terrible perception of a conflict of interest. Yovanovitch even acknowledged that Biden’s name was mentioned in connection to an alleged “bribe” scheme. In addition to cataloguing the numerous examples of Biden’s conflicts of interest and the threats that those conflicts posed to U.S. national security, Senator Johnson’s and Senator Grassley’s Homeland Security report exposed a gallery of rogues—a cast of shady foreign characters—ingratiating themselves to the Obama-Biden White House through financial deals made with the Biden family. To read the full article on JustTheNews.com,Click Here. Senate Committee on Homeland Security and Governmental Affairs and the Senate Committee on Finance released their highly anticipated report on Hunter Biden’s extensive dealings with China, Russia, and Ukraine while his father Joe Biden served as vice president. The joint report reveals that Hunter Biden received taxpayer-funded accommodations including transportation aboard Air Force Two and Secret Service security details while he traveled to make business deals with Chinese, Russian, and Ukrainian entities. According to the report, Hunter Biden received Secret Service protection on trips to multiple foreign locations, including Moscow, Beijing, Shanghai, Taipei, Hong Kong, and dozens of other cities. The joint committee investigation into the Bidens’ potential conflicts of interest “began in August 2019, with Finance Committee Chairman Grassley’s letter to the Department of the Treasury regarding potential conflicts of interest with respect to Obama administration policy relating to the Henniges transaction,” a controversial deal linked to the Bidens. The Senate report provides a detailed roadmap, exposing the Bidens’ connections to hostile foreign governments and individuals, including convicted criminals. Quoted material below is from the joint committee report (except the quotes appearing within the report itself). The main characters reportedly enriching the Bidens are from Russia, Ukraine, Kazakhstan, and China: Vice President Joe Bidenadmiring People’s Liberation Army (PLA) withChinese Communist leader Xu Jinping. Meanwhile, Hunter Biden bagged millions while he helped the Chinese takeover American companies with sensitive military applications Ye Jianmingis a Chinese national with close ties to the Chinese Communist Party (CCP) and the Chinese military, also known as the People’s Liberation Army (PLA). He is the founder of China Energy Fund Committee and CEFC China Energy Co. Ltd. Ye allegedly wired massive sums of money through CEFC and related entities resulting in “millions of dollars in cash flow” benefitting the Biden family. Multiple transactions between Ye Jianming’s enterprise and Hunter Biden were flagged by the U.S. Treasury Department for “potential criminal financial activity,” and in February 2018 Ye Jianming was reportedly under investigation in China for “suspected economic crimes.” According to the report: “Ye Jianming is a Chinese businessman and a frequent figure in Hunter Biden’s financial dealings in China. Based on public reports that were available in 2015, when his contact with Biden began to ramp up, Ye was a founder of CEFC China Energy Co. Ltd (CEFC) and served as chairman of the board for its subsidiary, the China Energy Fund Committee (CE Fund). CEFC had a reported income estimated at $33.4 billion, according to 2013 figures that were available at the time. Although CEFC reportedly remained a private company until state-owned enterprises assumed control of it in 2018, reporting in 2017 indicated that it received financing from the China Development Bank, ‘hired a number of former top officials from state-owned energy companies’ and had ‘layers of Communist Party committees across its subsidiaries — more than at many private Chinese companies.…’ In addition to the Communist government, Ye also had reported connections and affiliations to the People’s Liberation Army (PLA). For example, from 2003 to 2005, Ye reportedly served as deputy secretary general of the China Association for International Friendly Contacts (CAIFC), which is the public name for the PLA General Political Department’s International Liaison Department. Additionally, in 2014, under Ye’s leadership, CE Fund had co-organized events with the China Huayi Broadcasting Corporation (CHBC), a company incorporated by the PLA General Political Department. The CEO of CHBC, Wang Shu, was commander of the PLA General Political Department base ‘at the forefront of applied psychological operations and propaganda directed against Taiwan,’ which was managed by a training center that was funded by a subsidiary of CEFC….Wang reportedly attended the 2014 CE Fund and CHBC event along with Xu Jialu, a man who was associated with the PLA’s CAIFC as well as CE Fund and China’s Confucius Institutes. Huasheng served as executive director of CE Fund’s China Institute of Culture Limited (CIOC), ‘a nationally supported organization in charge of “promoting Chinese culture.”‘ Accordingly, Ye and his associates had robust relationships with China’s military units, some of which were involved in matters in direct opposition to U.S. policy in the region.” GongWen Dongis a Chinese national with deep ties to the Chinese communist regime and the Chinese military. GongWen Dong “was Ye Jianming’s associate and reportedly executed transactions for his companies.” As Ye Jianming’s associate, GongWen Dong helped funnel millions of dollars to Hunter Biden and even facilitated a six-figure “global spending spree” for Hunter Biden and Joe Biden’s brother James Biden and James’ wife Sara Biden. According to the report: “On 09/08/2017, Hunter Biden and GongWen Dong applied online to Cathay Bank and opened a line of credit under the business name Hudson West III, LLC. The cards were collateralized by transferring $99,000.00 from a Cathay Bank account to the Hudson West III business account where the funds were held until the cards were closed. The authorized users of these credit cards include Hunter Biden, James Biden and Sara Biden and each used the cards around the world to purchase $101,291 worth of extravagant items to include airline tickets, multiple purchases at Apple Stores and pharmacies, as well as hotels and restaurants.” Patrick Hois a Chinese national and close associate of Ye Jianming. He was also a reported client of Hunter Biden, personally, and was co-represented by Hunter Biden’s former law firm Boies Schiller Flexner. Ho was convicted by the U.S. Justice Department for money laundering, conspiracy, and violating the Foreign Corrupt Practices Act (which deals with international bribery schemes). Patrick Ho was convicted in 2019 on money laundering, conspiracy, and FCPA charges after the U.S. Department of Justice charged him in November 2017. Hunter Biden was paid massive sums to counsel Ho even as Joe Biden was preparing to run for President. According to the report: “In November 2017, Ye Jianming’s associate and Hunter Biden’s reported client, Patrick Ho, was arrested and charged with violations of the Foreign Corrupt Practices Act, international money laundering, and conspiracy to commit both. The first call that he reportedly made was to James Biden, who reportedly referred him to Hunter Biden. Ho was convicted in March 2019 on charges of money laundering, conspiracy, and violations of the Foreign Corrupt Practices Act and was sentenced to three years in U.S. prison for his role in a multimillion-dollar scheme to bribe officials in Chad and Uganda in exchange for business advantages for CEFC, Ye’s company. Department of Justice documents describe Ye as Patrick Ho’s boss and, again, note that Ye’s company supplied funding to the China Energy Fund Committee. Ho worked as the secretary-general of the committee during the period when he was carrying out his illegal schemes.” Elena Baturinais a billionaire Russian oligarch and the widow of the former mayor of Moscow. Baturina, who is reportedly close to Putin, has received hundreds of millions of dollars in illicit money through corruption schemes, according to the report. In February 2014, the Russian oligarch wired $3.5 million to a Delaware-based entity co-founded by Hunter Biden called Rosemont Seneca Thornton LLC. According to the report: “Hunter Biden and his associate, [Devon] Archer, had a financial relationship with Russian businesswoman Elena Baturina. Baturina is the former wife of the late Yuri Luzhkov, who was the mayor of Moscow and was fired in 2010 by then-Russian president Dmitry Medvedev over corruption allegations. Baturina became Russia’s only female billionaire when her plastics company, Inteko, received a series of Moscow municipal contracts while her husband was mayor. According to reporting, ‘Luzhkov used his position as mayor to approve over 20 real estate projects that were built by a Baturina-owned construction company and ultimately generated multibillion-ruble profits for his family.’ In addition, a Russian investigation led to a criminal case against the former head of the Bank of Moscow, Andrey Borodin, who ‘allegedly used money from the Moscow City Budget to lend money to shell companies, which ultimately transferred $443 million to Baturina.’” Kenges Rakishevis a businessman and the son-in-law of a prominent Kazakh politician who has close ties to longtime Kazakh dictator, President Nursultan Nazarbayev. Rakishev is the sole shareholder of a company called Novatus Holding, which wired $143,300 to Rosemont Seneca Bohai (an entity controlled by Hunter Biden and Devon Archer). At the time of the transfer, Rakishev’s father-in-law was the mayor of Kazakhstan’s capital city, Astana. Kenges Rakishevis the son-in-law of a prominent Kazakh politician with close ties to longtime Kazakh dictator Nazarbayev According to the report: “At the time of Vice President Biden’s visit to Kyiv, there were divided opinions in Kazakhstan over Russia’s annexation of Crimea and the international situation had produced tension in the region generally. Nazarbayev’s government reportedly shifted positions over time, and Nazarbayev reportedly made some statements supportive of Russia’s actions. Given Rakishev’s close connection to political leadership in Kazakhstan, the tense political situation, Hunter Biden’s longstanding relationship with Archer and involvement in transactions with Rosemont Seneca Bohai, and the fact that the payment was timed perfectly with Vice President Biden’s visit to Kyiv to discuss U.S. sanctions against Russia for the invasion of Crimea, the April 22, 2014 payment from Rakishev to Rosemont Seneca Bohai raises serious questions. It is unclear why a foreign company, Novatus Holding, would purchase a $142,300 car for Rosemont Seneca Bohai when the company does not deal in vehicles.” Vice President Bidenmaking deals withUkrainian President PoroshenkowhileHunter Bidentook in millions from a corrupt Ukrainian gas company. Mykola Zlochevskyis the Ukrainian oligarch who founded Burisma. Zlochevsky has been accused of criminal activity amounting to massive corruption in multiple countries including Ukraine and the United Kingdom. Zlochevsky allegedly sought favor with the United States via the vice president by funneling money to Biden family associates — primarily Hunter Biden and Devon Archer. According to the report: “Hunter Biden was serving on Burisma’s board (supposedly consulting on corporate governance and transparency) when Zlochevsky allegedly paid a $7 million bribe to officials serving under Ukraine’s prosecutor general, Vitaly Yarema, to ‘shut the case against Zlochevsky.’ [U.S. diplomat George] Kent testified that this bribe occurred in December 2014 (seven months after Hunter joined Burisma’s board), and, after learning about it, he and the Resident Legal Advisor reported this allegation to the FBI.” Devon ArcherHunter Biden’s Russian, Ukrainian, and Chinese business partners were not the only ones with criminal allegations against them. Hunter Biden’s close friend and business partner Devon Archer was indicted for a massive fraud scheme (though Archer himself beat the charges). Devon Archer was implicated in a massive Native American tribal bond scheme (the native Americans were allegedly scammed by Archer and his associates” According to the report: “In May 2016, Hunter Biden’s business partner, Archer, and five others were arrested and criminally charged in a scheme to defraud investors and a tribal entity of millions of dollars. Starting Jan. 25, 2016, Burisma began sending regular payments for Biden to his Washington law firm, Owasco PC (Owasco). Owasco was incorporated on Jan. 19, 2006, lists an agent address in Washington, and lists its executing officer and governor as Robert Hunter Biden. Payments from Burisma to Owasco continued throughout most of 2016 and ceased eight days after Donald Trump defeated Hillary Clinton in the Nov. 8, 2016 presidential election. Between Jan. 25, 2016, and Nov. 16, 2016, Burisma sent nine wires totaling $752,054.99 to Owasco with each of the nine transactions listing ‘Owasco, PC/Robert Biden’ as the recipient. Of the nine, two payments were for $83,333.33, five were for $83,333 one was for $84,992.33, and one was for $83,731.291 The records acquired by the Committees show the last documented payment was made on Nov. 16, 2016. Biden continued to serve on Burisma’s board of directors until April 2019.” The joint-committee report states that the Senate committees experienced delays, including due to instances of “obstructive behavior,” and that the transactions detailed within the report “raise criminal concerns.” The Biden campaign issued a statement before the report was released accusing Senator Johnson of pushing “a long-disproven hardcore right-wing conspiracy theory” and trying “to subsidize a foreign attack against the sovereignty of our elections with taxpayer dollars,” referring to the foreign sources that Johnson and Grassley’s report cited. However, the Biden campaign has not has not yet addressed the numerous allegations contained in the report that are based on non-partisan financial records called Suspicious Activity Reports (SARs) issued by the U.S. Treasury Department’s Financial Crimes Enforcement Network (FinCEN). Regarding his work in China and Ukraine, Hunter Biden has previously admitted to “poor judgement” but denied any “ethical lapse.” After the Senate report was released, Hunter Biden’s daughter, Naomi Biden, posted a series of tweets defending her father: “Here’s a thread on my dad, Hunter Biden — free of charge to the taxpayers and free of the corrosive influence of power-at-all-costs politics. The truth of a man filled with love, integrity, and human struggles.” Spokespersons for Devon Archer and James Biden have not yet responded to requests for comment. The Biden campaign has also not responded to a request for comment on these and many other stories. Seamus Bruner is the author of “Fallout: Nuclear Bribes, Russian Spies, and the Washington Lies that Enriched the Clinton and Biden Dynasties.”Bruner has worked with New York Times bestselling author Peter Schweizer since 2011 providing research and support for Schweizer’s #1 New York Times bestsellers like “Profiles in Corruption: Abuse of Power by America’s Progressive Elite.” Corey Lynn is an investigative journalist, co-host of the weekly Dig It! podcast, and co-host of The Solution Series. Follow her atcoreysdigs.com, onTwitter,Gab,Truth,Rumble, andTelegram. Support her work by becoming aPatron, making adonationor buying aBook. **You May Also Like** **5 Comments** Tom LaMarOctober 30, 2020 at 8:27 pmReplyThanks for the amazing amount of information that will take quite some time to go through ! I consider Biden to be the ‘quick death’ for America “choice”/intelligence test…whereas Trump is old school abuses by wall street since the civil war, but hopefully the ‘wiggle room’ they give him can do some real good to save the country for many of us….the shut down culled the herd quite enough ! **Tom LaMar** Thanks for the amazing amount of information that will take quite some time to go through ! I consider Biden to be the ‘quick death’ for America “choice”/intelligence test…whereas Trump is old school abuses by wall street since the civil war, but hopefully the ‘wiggle room’ they give him can do some real good to save the country for many of us….the shut down culled the herd quite enough ! **Tom LaMar** Thanks for the amazing amount of information that will take quite some time to go through ! I consider Biden to be the ‘quick death’ for America “choice”/intelligence test…whereas Trump is old school abuses by wall street since the civil war, but hopefully the ‘wiggle room’ they give him can do some real good to save the country for many of us….the shut down culled the herd quite enough ! peteNovember 2, 2020 at 9:50 amReplyYou missed one – The Penn-Biden Center at Penn U took in $70 million in anon. donations from China;https://justthenews.com/accountability/watchdogs/watchdog-group-claims-university-biden-center-have-received-millionshttps://thehill.com/homenews/house/500749-gop-lawmaker-wants-probe-of-upenns-biden-center-for-diplomacy-and-public **pete** You missed one – The Penn-Biden Center at Penn U took in $70 million in anon. donations from China; https://justthenews.com/accountability/watchdogs/watchdog-group-claims-university-biden-center-have-received-millions https://thehill.com/homenews/house/500749-gop-lawmaker-wants-probe-of-upenns-biden-center-for-diplomacy-and-public **pete** You missed one – The Penn-Biden Center at Penn U took in $70 million in anon. donations from China; https://justthenews.com/accountability/watchdogs/watchdog-group-claims-university-biden-center-have-received-millions https://thehill.com/homenews/house/500749-gop-lawmaker-wants-probe-of-upenns-biden-center-for-diplomacy-and-public Arnold ZiffelNovember 2, 2020 at 8:55 pmReplyObama in 2014 appointed Joe Biden as the point man for the Trans-Pacific Trade agreement to counter China. Around that time is when Hunter got in bed with China. Thanks that make you go Hmmm…https://ballotpedia.org/Joe_Biden_possible_presidential_campaign,_2016/International_trade **Arnold Ziffel** Obama in 2014 appointed Joe Biden as the point man for the Trans-Pacific Trade agreement to counter China. Around that time is when Hunter got in bed with China. Thanks that make you go Hmmm… https://ballotpedia.org/Joe_Biden_possible_presidential_campaign,_2016/International_trade **Arnold Ziffel** Obama in 2014 appointed Joe Biden as the point man for the Trans-Pacific Trade agreement to counter China. Around that time is when Hunter got in bed with China. Thanks that make you go Hmmm… https://ballotpedia.org/Joe_Biden_possible_presidential_campaign,_2016/International_trade Bob RossJanuary 25, 2021 at 11:36 pmReplyThis is Pulitzer material. Superb. **Bob Ross** This is Pulitzer material. Superb. **Bob Ross** This is Pulitzer material. Superb. JudyFebruary 12, 2022 at 3:27 amReplyHow can I view the emails on Hunter’s laptop. I’m looking for a correspondence between him & someone else. I saw it when the emails were first publiched on line. How can I find it again? Is there a place where all of his emails are posted again? Thanks! **Judy** How can I view the emails on Hunter’s laptop. I’m looking for a correspondence between him & someone else. I saw it when the emails were first publiched on line. How can I find it again? Is there a place where all of his emails are posted again? Thanks! **Judy** How can I view the emails on Hunter’s laptop. I’m looking for a correspondence between him & someone else. I saw it when the emails were first publiched on line. How can I find it again? Is there a place where all of his emails are posted again? Thanks! **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Name* Email* Website Notify me via e-mail if anyone answers my comment. Comment Δ **Support Corey’s Digs** **Get notified when a new article is published** **Translator Menu** **Archives** **Recent Posts** Corey’s Digs Library Catalog: Volume 13 This is How I Navigate What the States Can Do: Building the Legal and Financial Infrastructure for Financial Freedom Soul Over Mind – Mind Over Matter The Art of False Defeat in The Housing Market Who Really Owns The U.S. Housing Market? The Complete Roadmap Rogue Food Conference DFW Texas November 8th and 9th!"}