{"id": 78, "name": "AM New York", "domain": "amny.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.amny.com/law/op-ed-does-an-occupant-of-a-car-have-a-reduced-expectation-of-privacy-from-unreasonable-searches-by-the-police/", "title": "Op Ed Does An Occupant Of A Car Have A Reduced Expectation Of Privacy From Unreasonable Searches By The Police", "content": "Tackle the city, with our help. Manage your settings. NewsAllBy NeighborhoodBusinessCoronavirusPolice & FireEat & DrinkEducationEntertainmentFinanceLawOpinionPoliticsReal EstateSportsTransit All By Neighborhood Business Coronavirus Police & Fire Eat & Drink Education Entertainment Finance Law Opinion Politics Real Estate Sports Transit All By Neighborhood Business Coronavirus Police & Fire Eat & Drink Education Entertainment Finance Law Opinion Politics Real Estate Sports Transit Things to DoAllNYC EventsEvents inManhattanEvents inBrooklynEvents inQueensEvents inThe BronxEvents onStaten IslandThings to do with kidsPost an EventEntertainment GuidesBusiness EventsWebinars AllNYC Events Events inManhattan Events inBrooklyn Events inQueens Events inThe Bronx Events onStaten Island Things to do with kids Post an Event Entertainment Guides Business Events Webinars AllNYC Events Events inManhattan Events inBrooklyn Events inQueens Events inThe Bronx Events onStaten Island Things to do with kids Post an Event Entertainment Guides Business Events Webinars BoroughsManhattanBrooklynThe BronxQueensStaten Island Manhattan Brooklyn The Bronx Queens Staten Island Manhattan Brooklyn The Bronx Queens Staten Island SportsAllMetsYankeesGiantsJetsKnicksNetsIslandersRangersSoccerTennisOlympicsSports Newsletter All Mets Yankees Giants Jets Knicks Nets Islanders Rangers Soccer Tennis Olympics Sports Newsletter All Mets Yankees Giants Jets Knicks Nets Islanders Rangers Soccer Tennis Olympics Sports Newsletter Contact Us More from amNYamNY ShopsHome ProsJobsGamesDigital EditionsPodcastsBrand ContentCBD & Cannabis Directory sponsored by CBD Kratom amNY Shops Home Pros Jobs Games Digital Editions Podcasts Brand Content CBD & Cannabis Directory sponsored by CBD Kratom amNY Shops Home Pros Jobs Games Digital Editions Podcasts Brand Content CBD & Cannabis Directory sponsored by CBD Kratom Tackle the city, with our help. Manage your settings. NewsAllBy NeighborhoodBusinessCoronavirusPolice & FireEat & DrinkEducationEntertainmentFinanceLawOpinionPoliticsReal EstateSportsTransit All By Neighborhood Business Coronavirus Police & Fire Eat & Drink Education Entertainment Finance Law Opinion Politics Real Estate Sports Transit All By Neighborhood Business Coronavirus Police & Fire Eat & Drink Education Entertainment Finance Law Opinion Politics Real Estate Sports Transit Things to DoAllNYC EventsEvents inManhattanEvents inBrooklynEvents inQueensEvents inThe BronxEvents onStaten IslandThings to do with kidsPost an EventEntertainment GuidesBusiness EventsWebinars AllNYC Events Events inManhattan Events inBrooklyn Events inQueens Events inThe Bronx Events onStaten Island Things to do with kids Post an Event Entertainment Guides Business Events Webinars AllNYC Events Events inManhattan Events inBrooklyn Events inQueens Events inThe Bronx Events onStaten Island Things to do with kids Post an Event Entertainment Guides Business Events Webinars BoroughsManhattanBrooklynThe BronxQueensStaten Island Manhattan Brooklyn The Bronx Queens Staten Island Manhattan Brooklyn The Bronx Queens Staten Island SportsAllMetsYankeesGiantsJetsKnicksNetsIslandersRangersSoccerTennisOlympicsSports Newsletter All Mets Yankees Giants Jets Knicks Nets Islanders Rangers Soccer Tennis Olympics Sports Newsletter All Mets Yankees Giants Jets Knicks Nets Islanders Rangers Soccer Tennis Olympics Sports Newsletter Contact Us More from amNYamNY ShopsHome ProsJobsGamesDigital EditionsPodcastsBrand ContentCBD & Cannabis Directory sponsored by CBD Kratom amNY Shops Home Pros Jobs Games Digital Editions Podcasts Brand Content CBD & Cannabis Directory sponsored by CBD Kratom amNY Shops Home Pros Jobs Games Digital Editions Podcasts Brand Content CBD & Cannabis Directory sponsored by CBD Kratom Search: News All By Neighborhood Business Coronavirus Police & Fire Eat & Drink Education Entertainment Finance Law Opinion Politics Real Estate Sports Transit Things to Do Events inManhattan Events inBrooklyn Events inQueens Events inThe Bronx Events onStaten Island Things to do with kids Post an Event Entertainment Guides Business Events Webinars Boroughs Manhattan Brooklyn The Bronx Queens Staten Island Sports Mets Yankees Giants Jets Knicks Nets Islanders Rangers Soccer Tennis Olympics Sports Newsletter More from amNY amNY Shops Home Pros Jobs Games Digital Editions Podcasts Brand Content CBD & Cannabis Directory sponsored by CBD Kratom Contact Us **Op-Ed | Does an Occupant of a Car Have a Reduced Expectation of Privacy from Unreasonable Searches by the Police?** The United States and New York State constitutions prohibit only unreasonable searches. Absent a few exceptions, warrantless searches “areperseunreasonable.”Arizona v. Gant, 129 S.Ct. 1710, 1716 (2009). Regarding the reasonableness of warrantless vehicle searches, New York State jurisprudence closely tracks that of the United States Supreme Court. The inherent mobility of any sort of vehicle, be it “ship, motor boat, wagon or automobile” has, “practically since the beginning of the [federal] Government,” been sufficient to render a warrantless search of such vehicle for contraband reasonable, so long as there is probable cause to believe that the vehicle in question is in fact carrying contraband.Carroll v. United States, 267 U.S. 132, 150, 153-54 (1925). **Get amNY in your inbox!** Indeed, given the long history of a vehicle exception to the warrant requirement, individuals have “always . . . been on notice that movable vessels may be stopped and searched” without a warrant.United States v. Ross, 456 U.S. 798, 806 n.8 (1982). In the 85 years sinceCarrollwas decided, the courts have also held that the reduced expectation of privacy in one’s automobile, as compared with one’s home or office, provides further and arguably even greater support for the reasonableness of a warrantless vehicle search upon probable cause than the original justification of inherent mobility. The increased visibility of items in the passenger compartment of an automobile obviously engenders a diminished expectation of privacy in those items; they are, as a practical matter, exposed to public view. Probable causeUnder the vehicle exception to the search warrant requirement, a vehicle may be searched where there is probable cause to believe that it contains contraband, evidence of a crime, a weapon, or, in a search connected with an arrest, a “means of escape.” Nothing beyond probable cause is necessary; specifically, no additional showing of exigency is required. In cases implicating the warrant exception where the vehicle search is accompanied by an arrest, there must be a “nexus” between the arrest and the searchProbable cause to search the vehicle may be established in numerous ways. The owner of the car may admit, after arrest at another location, that his automobile contains evidence and contraband. A passenger who has already been removed from the car may state that the passenger left contraband in the vehicle. A confidential informant’s tip that a known drug dealer will have drugs in his car can furnish probable cause to search the vehicle.Observations of the defendant’s actions “outside the limited time frame” surrounding the arrest itself may at least help to establish probable cause for a search. Next, so long as there is probable cause to search a “lawfully stopped vehicle,” that search may encompass “every part of the vehicle and its contents that may conceal the object of the search.” Officers may, for example, engage in a warrantless search of a car’s trunk, bags inside the trunk, and closed containers inside the bags. They may also search the car’s glove box, and any hidden compartments within the vehicle.Circuit Holds a Search is Not a “Search”Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied.The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.”If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant.The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure.Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer.Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. Under the vehicle exception to the search warrant requirement, a vehicle may be searched where there is probable cause to believe that it contains contraband, evidence of a crime, a weapon, or, in a search connected with an arrest, a “means of escape.” Nothing beyond probable cause is necessary; specifically, no additional showing of exigency is required. In cases implicating the warrant exception where the vehicle search is accompanied by an arrest, there must be a “nexus” between the arrest and the search Probable cause to search the vehicle may be established in numerous ways. The owner of the car may admit, after arrest at another location, that his automobile contains evidence and contraband. A passenger who has already been removed from the car may state that the passenger left contraband in the vehicle. A confidential informant’s tip that a known drug dealer will have drugs in his car can furnish probable cause to search the vehicle. Observations of the defendant’s actions “outside the limited time frame” surrounding the arrest itself may at least help to establish probable cause for a search. Next, so long as there is probable cause to search a “lawfully stopped vehicle,” that search may encompass “every part of the vehicle and its contents that may conceal the object of the search.” Officers may, for example, engage in a warrantless search of a car’s trunk, bags inside the trunk, and closed containers inside the bags. They may also search the car’s glove box, and any hidden compartments within the vehicle. Circuit Holds a Search is Not a “Search”Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied.The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.”If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant.The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure.Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer.Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied. The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.” If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant. The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure. Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer. Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. Under the vehicle exception to the search warrant requirement, a vehicle may be searched where there is probable cause to believe that it contains contraband, evidence of a crime, a weapon, or, in a search connected with an arrest, a “means of escape.” Nothing beyond probable cause is necessary; specifically, no additional showing of exigency is required. In cases implicating the warrant exception where the vehicle search is accompanied by an arrest, there must be a “nexus” between the arrest and the search Probable cause to search the vehicle may be established in numerous ways. The owner of the car may admit, after arrest at another location, that his automobile contains evidence and contraband. A passenger who has already been removed from the car may state that the passenger left contraband in the vehicle. A confidential informant’s tip that a known drug dealer will have drugs in his car can furnish probable cause to search the vehicle. Observations of the defendant’s actions “outside the limited time frame” surrounding the arrest itself may at least help to establish probable cause for a search. Next, so long as there is probable cause to search a “lawfully stopped vehicle,” that search may encompass “every part of the vehicle and its contents that may conceal the object of the search.” Officers may, for example, engage in a warrantless search of a car’s trunk, bags inside the trunk, and closed containers inside the bags. They may also search the car’s glove box, and any hidden compartments within the vehicle. Circuit Holds a Search is Not a “Search”Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied.The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.”If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant.The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure.Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer.Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied. The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.” If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant. The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure. Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer. Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. Now, per the Federal Second Circuit’s ruling earlier this year inUnited States v. Poller, police may use a smartphone’s camera application to look inside a car with tinted windows without getting a warrant. InPoller, officers in Waterbury, Connecticut, observed an individual possibly dealing drugs from his car. After he left the car, they approached and tried to open a door, but it was locked. And the windows were tinted. But one officer then took out his iPhone and turned on the camera app and pointed the phone’s lens at the car, enabling him to see through the tinted windows, and discovering what looked like two guns inside. A second officer did the same. A third officer then cupped his hands around his eyes and looked through the windshield. The officers towed the car and got a warrant to search it, recovering guns and drugs. The defendant moved to suppress, but his motion was denied. The second circuit affirmed the decision at the suppression hearing, holding “the officers did not violate Poller’s reasonable expectation of privacy by using iPhone cameras to observe the car’s interior through its tinted windows, and therefore did not conduct a ‘search’ within the meaning of the Fourth Amendment.” If this decision seems wrong to you, rest assured you’re not alone. InKyllo v. United States, 533 U.S. 27 (2001), the Supreme Court held the “use of a thermal-imaging device aimed at a private home from a public street to detect relative amounts of heat within the home constitutes a ‘search’ within the meaning of the Fourth Amendment.” That sounds awfully like what the Waterbury police did here, using technology to pierce a barrier and discover what normal observation couldn’t. However the Circuit decided that a person has a much greater expectation of privacy in one’s home than in one’s automobile. Be careful out there on the road, as the right to privacy in your car is different than the rights extended to you in your home and, as of now, police in certain jurisdictions may use smartphones to search inside a window-tinted car without a warrant. The analysis of any car stop and subsequent search is always case specific. Judge Barry Kamins (Ret.), a partner at Aidala, Bertuna & Kamins, is an expert in this field and a phenomenal resource, and is the author ofNew York Search & Seizure. Arthur L. Aidala, Esq is the managing partner of Aidala, Bertuna and Kamins. He is a former Kings County Assistant District Attorney and is the host of the “Arthur Aidala Power Hour” weekdays at 6pm on AM970 The Answer. Michael Jaccarino is a partner at Aidala, Bertuna & Kamins. He is a proven trial lawyer and a defender of the accused. **About the Author** **More inLaw** Legal Aid Society condemns ICE raids at NYCimmigrationcourts Op-Ed|Endless Fines & Tolls for the NYC Bus Industry ‘Arbitrary cruelty’: Lander slams ICE court housedetentions,observesimmigrationhearings Graduating law school students enter career at uncertain moment **Things to do in NYC** Post an Event **Wildlife Wonders by Gillie and MarcNorth Oculus Plaza at the World Trade Center** **Perceptions of SentienceUnited Nations** **Poster House Spring 2025 Exhibition: Fallout: Atoms for War & PeacePoster House** **Poster House Spring 2025 Capsule Exhibition: From the Bronx to the Battery: The Subway SunPoster House** **Van Gogh’s FlowersNew York Botanical Garden** **Nature’s Persistence: Recent Work by Shelley HavenDerfner Judaica Museum** **Speakeasy, Die Softly: Immersive Murder Mystery Dinner Theater at Carmine’sCarmine’s Italian Restaurant – Times Square** **Smooth Voice ProjectionsRipley Grier Studios** View All Events… **Jobs in New York** House of Nails by NattyReceptionist/ Salon Assistant MDG Design & Construction LLCM/WBE Job Opportunity New York LifeFinancial Professional **Home Pros** Find a pro **Latest News** Protesters arrested for occupying Maersk building in Midtown for war in Gaza ‘Daylighting’savings time in NYC: DOT to redesignintersectionsto limit vehicle parking and improve cyclist safety Cuomo warns: Trump would send federal troops to NYC; mayoral candidate urges protesters to remain peaceful Queens high school students take top prize in NYC Minecraft Battle of the Boroughs Ranked-choicevoting: A refresher on how the system works ahead of the June 24 primary in NYC **Tackle the city, with our help.** **** **Sports** Kevin Durant trade rumors:Conflictingreports have Knicks on fringe ofsweepstakes NYCFC meets Atlanta looking to get back on track Knicks’ head coach search hitting continuous roadblocks 2025 FIFA Club World Cup preview: Schedule, team by team breakdown for USA-hosted spectacle Jeff McNeil’s simplistic approach sparking turnaround **Entertainment** Sunny’s Bar in Brooklyn defies odds, recognized for inspiring disaster comeback Brooklyn Army Terminal unveils summer seriescelebratingculture and community Continent Brooklyn: A culinary landmark of Caribbean culture andhospitalityin New York Brew at the Zoo returns with beer, music, and wildlife fun Bed-Stuy teacher wins Tony Award for Excellence in Theatre Education **Crime** Protesters arrested for occupying Maersk building in Midtown for war in Gaza Legal team for alleged crypto torturers in Soho say victim was ‘having the time of his life’ Dead toddler found near Whitestone Bridge believed to be missing Bronx boy, police sources say Police releasesurveillanceimages of Queens home invaders who posed as Amazon workers and stole small fortune ICE raid protests: Over 80 arrested in Lower Manhattan as backlash over Trump crackdown continues **Things to do in NYC** **Things to do in NYC** **Home Pros** **Home Pros** **More from around NYC** **Three-way fight for Council District 14 heating up inBronx primary** **Little Caesars to celebrate new Jamaica location with free pizza giveawaySaturday** **Sunny’s Bar in Red Hook defies odds, recognized for inspiring disastercomeback** **Tribeca Film Festival rolls out more than two dozenqueer movies** Contact Us Jobs Home Pros Advertise Newsletter © amNY 2025 Schneps Media Privacy Policy Terms of Use Sections News Things to Do Sports Contact"}