{"id": 1993, "name": "Hurriyet", "domain": "hurriyet.com.tr", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://bigpara.hurriyet.com.tr/ekonomi-haberleri/galeri-esnafa-erken-emeklilik-son-durum-2025-bag-kur-prim-gun-sayisi-dustu-mu-bagkur-7200-gune-dusecek-mi-bag-kur-7200-kimleri_ID1613089/", "title": "Galeri Esnafa Erken Emeklilik Son Durum 2025 Bag Kur Prim Gun Sayisi Dustu Mu Bagkur 7200 Gune Dusecek Mi Bag Kur 7200 Kimleri_id1613089", "content": "BORSACANLI BORSAGÜNÜN ÖZETİENDEKSLERHİSSELERİMHİSSE FİYATLARIHİSSE SENETLERİGEÇMİŞ KAPANIŞLAREN ÇOK TIKLANAN HİSSELEREN ÇOK ARTAN/AZALANLARYATIRIM ARAÇLARININ GETİRİLERİDÜNYA BORSALARI CANLI BORSA GÜNÜN ÖZETİ ENDEKSLER HİSSELERİM HİSSE FİYATLARI HİSSE SENETLERİ GEÇMİŞ KAPANIŞLAR EN ÇOK TIKLANAN HİSSELER EN ÇOK ARTAN/AZALANLAR YATIRIM ARAÇLARININ GETİRİLERİ DÜNYA BORSALARI CANLI BORSA GÜNÜN ÖZETİ ENDEKSLER HİSSELERİM HİSSE FİYATLARI HİSSE SENETLERİ GEÇMİŞ KAPANIŞLAR EN ÇOK TIKLANAN HİSSELER EN ÇOK ARTAN/AZALANLAR YATIRIM ARAÇLARININ GETİRİLERİ DÜNYA BORSALARI DÖVİZDÖVİZ KURUDOLARDOLAR ENDEKSİEUROİNGİLİZ STERLİNİKANADA DOLARIAVUSTRALYA DOLARIİSVİÇRE FRANGIİSVEÇ KRONUNORVEÇ KRONUDANİMARKA KRONUJAPON YENİSUUDİ ARABİSTAN RİYALİPARİTELERMERKEZ BANKASI VERİLERİ DÖVİZ KURU DOLAR DOLAR ENDEKSİ EURO İNGİLİZ STERLİNİ KANADA DOLARI AVUSTRALYA DOLARI İSVİÇRE FRANGI İSVEÇ KRONU NORVEÇ KRONU DANİMARKA KRONU JAPON YENİ SUUDİ ARABİSTAN RİYALİ PARİTELER MERKEZ BANKASI VERİLERİ DÖVİZ KURU DOLAR DOLAR ENDEKSİ EURO İNGİLİZ STERLİNİ KANADA DOLARI AVUSTRALYA DOLARI İSVİÇRE FRANGI İSVEÇ KRONU NORVEÇ KRONU DANİMARKA KRONU JAPON YENİ SUUDİ ARABİSTAN RİYALİ PARİTELER MERKEZ BANKASI VERİLERİ ALTINALTIN FİYATLARIÇEYREK ALTINYARIM ALTINCUMHURİYET ALTINI22 AYAR BİLEZİKGRAM ALTINALTIN (ONS)ALTIN ($/KG)ALTIN (EURO/KG) ALTIN FİYATLARI ÇEYREK ALTIN YARIM ALTIN CUMHURİYET ALTINI 22 AYAR BİLEZİK GRAM ALTIN ALTIN (ONS) ALTIN ($/KG) ALTIN (EURO/KG) ALTIN FİYATLARI ÇEYREK ALTIN YARIM ALTIN CUMHURİYET ALTINI 22 AYAR BİLEZİK GRAM ALTIN ALTIN (ONS) ALTIN ($/KG) ALTIN (EURO/KG) FAİZLERFAİZ HABERLERİKREDİ FAİZ ORANLARITAHVİL BONO REPOBANKA ŞUBELERİMEVDUAT FAİZ GETİRİLERİ FAİZ HABERLERİ KREDİ FAİZ ORANLARI TAHVİL BONO REPO BANKA ŞUBELERİ MEVDUAT FAİZ GETİRİLERİ FAİZ HABERLERİ KREDİ FAİZ ORANLARI TAHVİL BONO REPO BANKA ŞUBELERİ MEVDUAT FAİZ GETİRİLERİ VİOP&VARANTİŞ VARANTVARANT/VİOP HABERLERİCANLI VARANT VERİLERİİŞ YATIRIM VİOP İŞ VARANT VARANT/VİOP HABERLERİ CANLI VARANT VERİLERİ İŞ YATIRIM VİOP İŞ VARANT VARANT/VİOP HABERLERİ CANLI VARANT VERİLERİ İŞ YATIRIM VİOP HABERLERBORSA HABERLERİDÖVİZ HABERLERİALTIN HABERLERİEKONOMİ HABERLERİPİYASA HABERLERİPOLİTİKA HABERLERİTEKNOLOJİ HABERLERİKOBİ HABERLERİKAP HABERLERİYATIRIM SÖZLÜĞÜHİSSE YORUMLARIHABER YORUMLARIEN ÇOK OKUNANLARARACI KURUM GÖRÜŞLERİENFLASYON VERİLERİPİYASA TAKVİMİVİDEOLARBİGPARA YAZARLARI BORSA HABERLERİ DÖVİZ HABERLERİ ALTIN HABERLERİ EKONOMİ HABERLERİ PİYASA HABERLERİ POLİTİKA HABERLERİ TEKNOLOJİ HABERLERİ KOBİ HABERLERİ KAP HABERLERİ YATIRIM SÖZLÜĞÜ HİSSE YORUMLARI HABER YORUMLARI EN ÇOK OKUNANLAR ARACI KURUM GÖRÜŞLERİ ENFLASYON VERİLERİ PİYASA TAKVİMİ VİDEOLAR BİGPARA YAZARLARI BORSA HABERLERİ DÖVİZ HABERLERİ ALTIN HABERLERİ EKONOMİ HABERLERİ PİYASA HABERLERİ POLİTİKA HABERLERİ TEKNOLOJİ HABERLERİ KOBİ HABERLERİ KAP HABERLERİ YATIRIM SÖZLÜĞÜ HİSSE YORUMLARI HABER YORUMLARI EN ÇOK OKUNANLAR ARACI KURUM GÖRÜŞLERİ ENFLASYON VERİLERİ PİYASA TAKVİMİ VİDEOLAR BİGPARA YAZARLARI ANALİZOTOMATİK AL-SATAĞIRLIKLI ORTALAMA ANALİZİDİP ZİRVE ANALİZLERİİŞLEM HACMİ ANALİZLERİSEKTÖR TAKİPPERFORMANS ANALİZİYATIRIM SİMİLATÖRÜSEANS RAPORUOTOMATİK TEKNİK YORUMLARTEKNİK GRAFİKTEKNİK SİNYAL LİSTESİTEKNİK ANALİZ MODÜLÜARTAN AZALAN ENDEKSİMALİ TABLOLARORAN ANALİZLERİYATIRIM ORTAKLIKLARI ANALİZLERİ OTOMATİK AL-SAT AĞIRLIKLI ORTALAMA ANALİZİ DİP ZİRVE ANALİZLERİ İŞLEM HACMİ ANALİZLERİ SEKTÖR TAKİP PERFORMANS ANALİZİ YATIRIM SİMİLATÖRÜ SEANS RAPORU OTOMATİK TEKNİK YORUMLAR TEKNİK GRAFİK TEKNİK SİNYAL LİSTESİ TEKNİK ANALİZ MODÜLÜ ARTAN AZALAN ENDEKSİ MALİ TABLOLAR ORAN ANALİZLERİ YATIRIM ORTAKLIKLARI ANALİZLERİ OTOMATİK AL-SAT AĞIRLIKLI ORTALAMA ANALİZİ DİP ZİRVE ANALİZLERİ İŞLEM HACMİ ANALİZLERİ SEKTÖR TAKİP PERFORMANS ANALİZİ YATIRIM SİMİLATÖRÜ SEANS RAPORU OTOMATİK TEKNİK YORUMLAR TEKNİK GRAFİK TEKNİK SİNYAL LİSTESİ TEKNİK ANALİZ MODÜLÜ ARTAN AZALAN ENDEKSİ MALİ TABLOLAR ORAN ANALİZLERİ YATIRIM ORTAKLIKLARI ANALİZLERİ BES KOBİŞİRKET HABERLERİBANKACILIK HABERLERİGİRİŞİM HABERLERİTEŞVİK HABERLERİSEKTÖR HABERLERİDÜNYA EMTİA BORSALARI ŞİRKET HABERLERİ BANKACILIK HABERLERİ GİRİŞİM HABERLERİ TEŞVİK HABERLERİ SEKTÖR HABERLERİ DÜNYA EMTİA BORSALARI ŞİRKET HABERLERİ BANKACILIK HABERLERİ GİRİŞİM HABERLERİ TEŞVİK HABERLERİ SEKTÖR HABERLERİ DÜNYA EMTİA BORSALARI KRİPTO PARALARKRİPTO PARA PİYASALARIBİTCOİNETHEREUMBİTCOİN CASHSTELLARLİTECOİNBİNANCE COİNTETHERCARDANOPOLKADOTUNİSWAPCHAİNLİNKWRAPPED BİTCOİNTHETA TOKENRİPPLEDOGECOİNBİTCOİN HABERLERİ KRİPTO PARA PİYASALARI BİTCOİN ETHEREUM BİTCOİN CASH STELLAR LİTECOİN BİNANCE COİN TETHER CARDANO POLKADOT UNİSWAP CHAİNLİNK WRAPPED BİTCOİN THETA TOKEN RİPPLE DOGECOİN BİTCOİN HABERLERİ KRİPTO PARA PİYASALARI BİTCOİN ETHEREUM BİTCOİN CASH STELLAR LİTECOİN BİNANCE COİN TETHER CARDANO POLKADOT UNİSWAP CHAİNLİNK WRAPPED BİTCOİN THETA TOKEN RİPPLE DOGECOİN BİTCOİN HABERLERİ **ESNAFA ERKEN EMEKLİLİK 2025 SON GELİŞMELER || Bağ-Kur prim gün sayısı düştü mü, bağkur 7200 güne düşecek mi? BAĞ-KUR 7200 kimleri kapsıyor?** Güncelleme Tarihi:Haziran 11, 2025 17:56 **Çalışma ve Sosyal Güvenlik Bakanlığı, Bağ-Kur’luların prim gün sayısının düşürülmesi için çalışmalar devam ederken, BAĞ-KUR 7200 kimleri kapsıyor, esnafa erken emeklilik son dakika gelişmeleri merak ediliyor. Uzun zamandır gündemde olan bu talep, mevcut durumda 9000 gün olan prim gün sayısının SSK’lılarla eşitlenmesi yoluyla esnafa erken emeklilik imkanı sağlamayı amaçlıyor. Peki, Bağ-Kur prim gün sayısı düştü mü, bağkur 7200 güne düşecek mi? BAĞ-KUR 7200 kimleri kapsıyor? İşte, Bağ-Kur 7200 prim gün sayısı son durum...** Esnafa erken emeklilik düzenlemesi, Türkiye Büyük Millet Meclisi’nde (TBMM) sunulacak olan torba yasa teklifinde değerlendirilecek. Teklifin kabul edilmesi halinde, yasal olarak yürürlüğe girecek ve esnafın emeklilik şartlarını hafifletecek. Esnaflar ise Eyt BAĞ-KUR 7200 gün resmi gazetede yayımlandı mı? sorusunun yanıtını sabırsızlıkla bekliyor. Peki, Esnafa erken emeklilik son durum 2025|| Bağ-Kur prim gün sayısı düştü mü, bağkur 7200 güne düşecek mi? BAĞ-KUR 7200 kimleri kapsıyor? İşte, Hürriyet.com.tr yazarı Noyan Doğan'ın konuyla ilgili yazısından detaylar... Esnafa erken emeklilik düzenlemesi, Türkiye Büyük Millet Meclisi’nde (TBMM) sunulacak olan torba yasa teklifinde değerlendirilecek. Teklifin kabul edilmesi halinde, yasal olarak yürürlüğe girecek ve esnafın emeklilik şartlarını hafifletecek. Esnaflar ise Eyt BAĞ-KUR 7200 gün resmi gazetede yayımlandı mı? sorusunun yanıtını sabırsızlıkla bekliyor. Peki, Esnafa erken emeklilik son durum 2025|| Bağ-Kur prim gün sayısı düştü mü, bağkur 7200 güne düşecek mi? BAĞ-KUR 7200 kimleri kapsıyor? İşte, Hürriyet.com.tr yazarı Noyan Doğan'ın konuyla ilgili yazısından detaylar... Esnafa erken emeklilik düzenlemesi, Türkiye Büyük Millet Meclisi’nde (TBMM) sunulacak olan torba yasa teklifinde değerlendirilecek. Teklifin kabul edilmesi halinde, yasal olarak yürürlüğe girecek ve esnafın emeklilik şartlarını hafifletecek. Esnaflar ise Eyt BAĞ-KUR 7200 gün resmi gazetede yayımlandı mı? sorusunun yanıtını sabırsızlıkla bekliyor. Peki, Esnafa erken emeklilik son durum 2025|| Bağ-Kur prim gün sayısı düştü mü, bağkur 7200 güne düşecek mi? BAĞ-KUR 7200 kimleri kapsıyor? İşte, Hürriyet.com.tr yazarı Noyan Doğan'ın konuyla ilgili yazısından detaylar... **Bağkur 7200 güne düşecek mi?** Bir süredir Bağ-Kur’luların prim gün sayısının SSK’lılarla eşit hale getirilmesi yani; 9 bin günden, 7 bin 200 güne düşürülmesi gündemde. Çalışma ve Sosyal Güvenlik Bakanlığı bu konuda çalışmalarını sürdürüyor, hatta çalışmalar tamamlandı bile diyebiliriz. Bağ-Kur’luların prim gün sayısının düşürülmesi için ise yasal düzenleme gerekiyor. Bir süredir Bağ-Kur’luların prim gün sayısının SSK’lılarla eşit hale getirilmesi yani; 9 bin günden, 7 bin 200 güne düşürülmesi gündemde. Çalışma ve Sosyal Güvenlik Bakanlığı bu konuda çalışmalarını sürdürüyor, hatta çalışmalar tamamlandı bile diyebiliriz. Bağ-Kur’luların prim gün sayısının düşürülmesi için ise yasal düzenleme gerekiyor. Bir süredir Bağ-Kur’luların prim gün sayısının SSK’lılarla eşit hale getirilmesi yani; 9 bin günden, 7 bin 200 güne düşürülmesi gündemde. Çalışma ve Sosyal Güvenlik Bakanlığı bu konuda çalışmalarını sürdürüyor, hatta çalışmalar tamamlandı bile diyebiliriz. Bağ-Kur’luların prim gün sayısının düşürülmesi için ise yasal düzenleme gerekiyor. **BAKMADAN GEÇME!** **BAĞ-KUR 7200 kimleri kapsıyor?** Yapılacak yeni düzenleme ile Bağ-Kur’luların prim gün sayısı 9 bin günden, 7 bin 200 güne düşecek. Yaş şartı ise değişmeyecek. Yani, 7 bin 200 prim gün sayısını tamamlayan Bağ-Kur’lular; kadın ise 58, erkek ise 60 yaşında emekli olacaklar. Düzenleme ile Bağ-Kur’luların emeklilik için gerekli prim gün sayısı ile SSK’lı çalışanların prim gün sayıları eşitlenecek. Böylece Bağ-Kur’lular, düzenleme sonrası bin 800 gün (5 yıl) daha az prim ödeyip emekliliğe hak kazanacaklar. Yapılacak yeni düzenleme ile Bağ-Kur’luların prim gün sayısı 9 bin günden, 7 bin 200 güne düşecek. Yaş şartı ise değişmeyecek. Yani, 7 bin 200 prim gün sayısını tamamlayan Bağ-Kur’lular; kadın ise 58, erkek ise 60 yaşında emekli olacaklar. Düzenleme ile Bağ-Kur’luların emeklilik için gerekli prim gün sayısı ile SSK’lı çalışanların prim gün sayıları eşitlenecek. Böylece Bağ-Kur’lular, düzenleme sonrası bin 800 gün (5 yıl) daha az prim ödeyip emekliliğe hak kazanacaklar. Yapılacak yeni düzenleme ile Bağ-Kur’luların prim gün sayısı 9 bin günden, 7 bin 200 güne düşecek. Yaş şartı ise değişmeyecek. Yani, 7 bin 200 prim gün sayısını tamamlayan Bağ-Kur’lular; kadın ise 58, erkek ise 60 yaşında emekli olacaklar. Düzenleme ile Bağ-Kur’luların emeklilik için gerekli prim gün sayısı ile SSK’lı çalışanların prim gün sayıları eşitlenecek. Böylece Bağ-Kur’lular, düzenleme sonrası bin 800 gün (5 yıl) daha az prim ödeyip emekliliğe hak kazanacaklar. Tüm Bağ-Kur’lular yeni düzenlemeden yararlanamayacak. Esnaf ve sanatkâr dediğimiz; berber, bakkal, çiftçi gibi küçük esnaf yararlanacak. Bu kesimin de sayısı 1 milyonu biraz geçiyor. Kimlerin bu düzenlemeden yararlanacağı konusu henüz net değil ama bilindiği kadarıyla 10-15 arası kişi çalıştıran küçük esnafın prim ödeme gün sayısının 7 bin 200’e çekilerek, erken emekli olma hakkı tanınacağı yönünde. Bağ-Kur statüsünde sayılan isteğe bağlı sigortalılar ise bu düzenlemeden yararlanamayacak. Tüm Bağ-Kur’lular yeni düzenlemeden yararlanamayacak. Esnaf ve sanatkâr dediğimiz; berber, bakkal, çiftçi gibi küçük esnaf yararlanacak. Bu kesimin de sayısı 1 milyonu biraz geçiyor. Kimlerin bu düzenlemeden yararlanacağı konusu henüz net değil ama bilindiği kadarıyla 10-15 arası kişi çalıştıran küçük esnafın prim ödeme gün sayısının 7 bin 200’e çekilerek, erken emekli olma hakkı tanınacağı yönünde. Bağ-Kur statüsünde sayılan isteğe bağlı sigortalılar ise bu düzenlemeden yararlanamayacak. Tüm Bağ-Kur’lular yeni düzenlemeden yararlanamayacak. Esnaf ve sanatkâr dediğimiz; berber, bakkal, çiftçi gibi küçük esnaf yararlanacak. Bu kesimin de sayısı 1 milyonu biraz geçiyor. Kimlerin bu düzenlemeden yararlanacağı konusu henüz net değil ama bilindiği kadarıyla 10-15 arası kişi çalıştıran küçük esnafın prim ödeme gün sayısının 7 bin 200’e çekilerek, erken emekli olma hakkı tanınacağı yönünde. Bağ-Kur statüsünde sayılan isteğe bağlı sigortalılar ise bu düzenlemeden yararlanamayacak. **BAKMADAN GEÇME!** Piyasa verileri Foreks Bilgi İletişim Hizmetleri A.Ş. tarafından sağlanmaktadır. Üye girişi yapılan Canlı Borsa sayfaları haricinde Hisse senedi verileri 15 dk gecikmelidir. Tahvil-Bono-Repo özet verileri her durumda 15 dk gecikmelidir."}