{"id": 1831, "name": "USA In Front", "domain": "usainfront.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://usainfront.com/sportnew-football/jose-mourinho-tipped-for-surprise-premier-league/", "title": "Jose Mourinho Tipped For Surprise Premier League", "content": "**ทางเข้า UFABET สมัคร เว็บแทงบอลออนไลน์ ยูฟ่าเบท ที่ได้มาตรฐานระดับโลก เว็บ UFABET มือถือ ที่ดีที่สุดในประเทศไทย แทงบอลออนไลน์ คาสิโน บาคาร่า สล๊อต.** Home สมัคร ufabet Sport & Game **Jose Mourinho tipped for surprise Premier League** **Browse By** **Archives** April 2025 February 2025 December 2024 August 2024 May 2024 February 2024 December 2023 September 2023 June 2023 November 2022 **Calendar** Jose Mourinhotippe for surprise Premier League job: ‘You never know!’ **Jose Mourinho has tippe for a sensational return to the Premier League ‘in a couple of years’.** Mourinho has manage three Premier League clubsเล่นบาคาร่า UFABET เว็บตรง ค่าคอมสูง– Chelsea, Manchester United and Tottenham – and is currently at Turkish giants Fenerbahce. The 62-year-old enjoye a huge amount of success across two spells at Stamford Bridge, winning three league titles, three League Cups and the FA Cup at Chelsea. Mourinho lifte the Europa League and League Cup at Manchester United and claime finishing second with the Red Devils was one of his greatest achievements given the club’s struggles either side of his tenure. The Portuguese’s last stint in England was at Tottenham but Spurs largely struggle under Mourinho before he was sacke in April 2021. Since that axing, Mourinho has had spells at Italian side Roma and Turkish club Fenerbahce, but ex-England defender Glen Johnson says his Premier League story could yet have one last chapter. ‘I would like to see Jose Mourinho back in the Premier League at some stage, because he’s one of the biggest characters in football, and that’s what we want to see,’ Johnson told. ‘I don’t know where he’ll go. You know, he’s not going to go back to Chelsea. He’s done Tottenham, he’s done Man United. Arsenal isn’t going to be available, Man City isn’t going to be available for a while, I would imagine. ‘So, I just don’t know. But maybe that’s a possible option for him; maybe City in a couple of years… you never know. ‘It’ll all come down to the desire of Mourinho though, and how much he wants to be back in the Premier League. **‘But we all know him, though; he’s not going to go somewhere to not win, so he’s only going to go to one of the top two or three teams.’** Mourinho’s former Barcelona rival Pep Guardiola has in charge of Manchester City since 2016 and was expecte to step down at the end of the current season. But Man City gave Guardiola a new one-year contract extension in November, a move that is looking increasingly questionable given the team’s alarming drop-off. City have gone from winning four Premier League titles in a row to facing a huge fight just to qualify for the Champions League. Johnson worke with ex-Real Madrid boss Mourinho at Chelsea and admits he ‘knew nothing’ about the manager when he first arrive in west London in 2004. ‘I knew nothing about Jose when he arrive at Chelsea. Literally, zero,’ he adde. ‘All I knew was that Porto had just won the Champions League… obviously I’d watche them in the semis and in the final, like everybody, but that’s all I’d seen of him. ‘And, at the time, to be honest, I don’t think many of the players did. And also, we were all a bit on the back foot wondering why Claudio Ranieri had sacke. ‘You know, he was a very hard manager, but a very good manager, and we’d just finishe second in the Premier League! ‘Listen, the club obviously made the right decision, because we went on to win the league in Mourinho’s first season, it just felt really harsh on Ranieri at the time, if I’m being honest.’ Mourinho’s Fenerbahce are currently second in the Turkish top-flight, seven points behind unbeaten Galatasaray with a game in hand. Fener were knocke out of the Europa League earlier this week by Scottish giants Rangers. **Archives** April 2025 February 2025 December 2024 August 2024 May 2024 February 2024 December 2023 September 2023 June 2023 November 2022 **Categories** Health Sport & Game Sportnew & Football ufabet ยูฟ่าเบท บาคาร่า"}