{"id": 52, "name": "Amandla", "domain": "aidc.org.za/amandla-media", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://aidc.org.za/amandla-media/multimedia/educational-videos-talks/", "title": "Educational Videos Talks", "content": "About UsEditorial CollectiveAdvisory BoardEditorial PolicyWriting for AmandlaPublished by AIDC Editorial Collective Advisory Board Editorial Policy Writing for Amandla Published by AIDC Editorial Collective Advisory Board Editorial Policy Writing for Amandla Published by AIDC SubscribeHow to subscribeSubscriptions rates How to subscribe Subscriptions rates How to subscribe Subscriptions rates Amandla MagazineCurrent IssueSneak peak Current Issue Sneak peak Current Issue Sneak peak Back issues Special FeaturesCorruptionDecolonisationLandMineral Energy ComplexMonopoly CapitalRace and ClassState captureStudent MovementTrade Union MovementSAFTU Corruption Decolonisation Land Mineral Energy Complex Monopoly Capital Race and Class State capture Student Movement Trade Union MovementSAFTU SAFTU Corruption Decolonisation Land Mineral Energy Complex Monopoly Capital Race and Class State capture Student Movement Trade Union MovementSAFTU SAFTU SAFTU MultimediaDocumentaries and VideosPodcastsAmandla InterviewsNo to housing racism! [Amandla! Interview]Free Fee Education is Possible in South Africa Documentaries and Videos PodcastsAmandla InterviewsNo to housing racism! [Amandla! Interview]Free Fee Education is Possible in South Africa Amandla InterviewsNo to housing racism! [Amandla! Interview] No to housing racism! [Amandla! Interview] Free Fee Education is Possible in South Africa Documentaries and Videos PodcastsAmandla InterviewsNo to housing racism! [Amandla! Interview]Free Fee Education is Possible in South Africa Amandla InterviewsNo to housing racism! [Amandla! Interview] No to housing racism! [Amandla! Interview] Free Fee Education is Possible in South Africa Amandla InterviewsNo to housing racism! [Amandla! Interview] No to housing racism! [Amandla! Interview] No to housing racism! [Amandla! Interview] Free Fee Education is Possible in South Africa Amandla ForumsThe Crisis of Labour & The NUMSA Moment – Dinga Sikwebu at the Crisis of PoliticsThe NGOisation of politics – Mercia Andrews at the Conference on the Crisis of PoliticsGang Town – Don PinnockDecolonising Psychology – Wahbie LongABSA saga, CIEX Report and more – Terry Crawford-BrowneSA Food systems – Tracy LedgerCape Towns Water Crisis – Dr Kevin WinterRenewable Energy: Where are the Jobs? – A critique of the government´s socio-economic programme.Whither ANC – Jeremy Cronin [Audio recording]Whither ANC Debate – Mbuyiseni Ndlozi [Audio recording]Whither ANC Debate – Tony Ehrenreich [Audio recording]Whither ANC Debate – Noor Nieftagodien [Audio recording]Capital Crimes: Illicit financial flows, tax evasion and transfer pricingThoughts from the left – what causes mental illness and how to treat itWellbeing Economy – Beyond GDP growthDemocracy and Revolution – the Legacy of the Russian Revolution by John MolyneuxRussian Revolution – Still relevant or anachronistic? Vivek ChibberExtracting Profit and the New Scramble for Africa [Book Launch]Solidarity Against Mining in AfricaCan Ramaphosa Deliver?BRICS: Liberators or Agents of Imperialism The Crisis of Labour & The NUMSA Moment – Dinga Sikwebu at the Crisis of Politics The NGOisation of politics – Mercia Andrews at the Conference on the Crisis of Politics Gang Town – Don Pinnock Decolonising Psychology – Wahbie Long ABSA saga, CIEX Report and more – Terry Crawford-Browne SA Food systems – Tracy Ledger Cape Towns Water Crisis – Dr Kevin Winter Renewable Energy: Where are the Jobs? – A critique of the government´s socio-economic programme. Whither ANC – Jeremy Cronin [Audio recording] Whither ANC Debate – Mbuyiseni Ndlozi [Audio recording] Whither ANC Debate – Tony Ehrenreich [Audio recording] Whither ANC Debate – Noor Nieftagodien [Audio recording] Capital Crimes: Illicit financial flows, tax evasion and transfer pricing Thoughts from the left – what causes mental illness and how to treat it Wellbeing Economy – Beyond GDP growth Democracy and Revolution – the Legacy of the Russian Revolution by John Molyneux Russian Revolution – Still relevant or anachronistic? Vivek Chibber Extracting Profit and the New Scramble for Africa [Book Launch] Solidarity Against Mining in Africa Can Ramaphosa Deliver? BRICS: Liberators or Agents of Imperialism The Crisis of Labour & The NUMSA Moment – Dinga Sikwebu at the Crisis of Politics The NGOisation of politics – Mercia Andrews at the Conference on the Crisis of Politics Gang Town – Don Pinnock Decolonising Psychology – Wahbie Long ABSA saga, CIEX Report and more – Terry Crawford-Browne SA Food systems – Tracy Ledger Cape Towns Water Crisis – Dr Kevin Winter Renewable Energy: Where are the Jobs? – A critique of the government´s socio-economic programme. Whither ANC – Jeremy Cronin [Audio recording] Whither ANC Debate – Mbuyiseni Ndlozi [Audio recording] Whither ANC Debate – Tony Ehrenreich [Audio recording] Whither ANC Debate – Noor Nieftagodien [Audio recording] Capital Crimes: Illicit financial flows, tax evasion and transfer pricing Thoughts from the left – what causes mental illness and how to treat it Wellbeing Economy – Beyond GDP growth Democracy and Revolution – the Legacy of the Russian Revolution by John Molyneux Russian Revolution – Still relevant or anachronistic? Vivek Chibber Extracting Profit and the New Scramble for Africa [Book Launch] Solidarity Against Mining in Africa Can Ramaphosa Deliver? BRICS: Liberators or Agents of Imperialism Forums Donate Contact us **Podcasts** The AIDC publishes a number of audio offerings, chief among these is our podcast series titledVoices of the Streets. Audio Recordings of the Amandla Forum’s can be found on a wide range of platforms for your convenience. These are listed below: Apple Podcasts Spotify Google Podcasts Breaker PocketCasts RadioPublic For our Archive of pre-2019 podcasts please visit ourMixcloudpage **Amandla 75** **Amandla! on Facebook** **About** Over the years AIDC has played a leading role in various civil society responses to ongoing inequality including facilitating the launch and building of the South African Jubilee 2000 debt cancellation campaign, and the Right to Work Campaign. **Subscribe** Enter your details below to subscribe to the AIDC Newsletter. Email* Δ **Contact** 129 Rochester RoadObservatory, Cape Town Email:info@aidc.org.za\u0003Phone: +27 21 4475770\u0003Fax: +27 21 4475884 © 2025 AIDC. All Rights Reserved.Sitemap Home About us Contact Us"}