{"id": 477, "name": "KTTV - Fox 11 - Los Angeles", "domain": "foxla.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.foxla.com/news/fox-news-sunday-with-shannon-bream-how-and-when-to-watch-on-fox-11", "title": "Fox News Sunday With Shannon Bream How And When To Watch On Fox 11", "content": "Live News Good Day LA FOX LOCAL Contests Newsletters More Local News California News Police Chases National News Entertainment Consumer Recalls Politics FOX News Sunday Forecast Traffic Radar Air Quality Map Earthquakes Earthquake Preparedness Severe Weather Wildfires FOX Weather Guests Meet the Team Entertainment Local News Back-to-school Seen on TV Links Vote on our poll Rams Chargers Lakers Clippers Dodgers Angels Wildcats Kings Ducks LA Football Club Angel City Football Club Galaxy Sparks FOX 11 Originals The Issue Is: In Depth Wednesday's Child True Crime Files Lost Angeles: City of Homeless Community Champions When Magic Shocked the World Destination Education Get Inspired Rising Up Investigations Culture Conversations Remembering Kobe KTTV70 Stream FOX 11 on FOX LOCAL Newscasts & Replays Apps Live webcams from around SoCal Facebook Instagram TikTok YouTube Twitter/X How to stream Download our apps! Podcasts Daily Fast5 Newsletters California Politics The Issue Is: Donald Trump Joe Biden Gavin Newsom Kamala Harris Battleground Economy Small Business Personal Finance San Francisco News - KTVU FOX 2 Phoenix News - FOX 10 Phoenix Seattle News - FOX 13 Seattle Contests Meet the FOX 11 Team TV Schedule FOX Shows Jobs at FOX 11 Advertising FCC Public File FCC Applications Public Service Announcements ATSC FOX 11 Plus Contact Us **FOX News Sunday with Shannon Bream: How and when to watch on FOX 11** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 11 starting at 7 a.m. on Sundays. Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 11 from 7 a.m. to 8 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 11 starting at 7 a.m. on Sundays. **Stream FOX 11 LA on FOX LOCAL** **Trending** **Subscribe to our YouTube channel** **Local News** **Arrest caught on video: Feds corner car in Boyle Heights** **Title 32 National Guard: Major General details LA mission duties** **LA anti-ICE protest: Federal charges announced in Molotov cocktail case** **Latest Videos** **Video shows federal agents detaining man in Boyle Heights** **The stars of Deep Cover talk and do improv with FOX 11's Amanda Salas** **LA mayor, other leaders speak on anti-ICE protests** Local News California News Police Chases National News Entertainment Consumer Recalls Politics FOX News Sunday Forecast Traffic Radar Air Quality Map Earthquakes Earthquake Preparedness Severe Weather Wildfires FOX Weather Guests Meet the Team Entertainment Local News Back-to-school Seen on TV Links Vote on our poll Rams Chargers Lakers Clippers Dodgers Angels Wildcats Kings Ducks LA Football Club Angel City Football Club Galaxy Sparks FOX 11 Originals The Issue Is: In Depth Wednesday's Child True Crime Files Lost Angeles: City of Homeless Community Champions When Magic Shocked the World Destination Education Get Inspired Rising Up Investigations Culture Conversations Remembering Kobe KTTV70 Stream FOX 11 on FOX LOCAL Newscasts & Replays Apps Live webcams from around SoCal Facebook Instagram TikTok YouTube Twitter/X How to stream Download our apps! Podcasts Daily Fast5 Newsletters California Politics The Issue Is: Donald Trump Joe Biden Gavin Newsom Kamala Harris Battleground Economy Small Business Personal Finance San Francisco News - KTVU FOX 2 Phoenix News - FOX 10 Phoenix Seattle News - FOX 13 Seattle Contests Meet the FOX 11 Team TV Schedule FOX Shows Jobs at FOX 11 Advertising FCC Public File FCC Applications Public Service Announcements ATSC FOX 11 Plus Contact Us facebook twitter instagram youtube email About Us New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Rescan your TV Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}