{"id": 1424, "name": "Real News Network", "domain": "therealnews.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://therealnews.com/a-hopkins-professor-says-americas-descent-into-authoritarianism-may-have-started-with-policing-in-blue-cities-if-thats-true-were-in-big-trouble", "title": "A Hopkins Professor Says Americas Descent Into Authoritarianism May Have Started With Policing In Blue Cities If Thats True Were In Big Trouble", "content": "Newsletter Donate Latest Shows & Podcasts About Freddie Gray & the Baltimore Uprising: 10 Years Later Israel’s War on Palestine Stories of Resistance Under the Shadow Killer Water Youtube Bluesky Instagram Twitter Facebook Mastodon Telegram RSS Feed About The Real News Network Our Team Latest News In the Media Donate Ways to Give Jobs Press Releases Ethics Policy Work with us as a freelancer **Sections** Climate Crisis Economy and Inequality Movements and Politics: International Movements and Politics: US Prisons and Policing Racial Justice Baltimore **Shows, Podcasts, & Series** Stories of Resistance The Marc Steiner Show Rattling The Bars Solidarity Without Exception Police Accountability Report Tax Broke Edge of Sports with Dave Zirin Baltimore’s Crime Numbers Game Under the Shadow Workers of the World Working People **Follow Us** X Instagram Facebook YouTube Follow us on Mastodon **Trending Posts** ‘Deadly Exchange’: US sends hundreds of law enforcement to Israel to learn ‘worst practices’ from IDF US empire is dying, and it’s more dangerous than ever 'A Declaration of War': Trump Sends National Guard to LA Over Anti-ICE Protests Trans inmates face rape and death with Trump’s Executive Order $20 million to learn how to talk to men? Why the Democrats will keep losing ‘We're holding those dead babies with our hands’: Doctors returning from Gaza beg humanity to stop the carnage Trump cuts leave VA hospital nurses and veteran patients in a crisis Toronto just caved to Zionist attacks on the right to protest Israel's seizure of Gaza Freedom Flotilla called a 'blatant act of international piracy' Los Angeles Resistance: Standing Against ICE About The Real News Network Our Team Latest News In the Media Donate Ways to Give Jobs Press Releases Ethics Policy Work with us as a freelancer **Sections** Climate Crisis Economy and Inequality Movements and Politics: International Movements and Politics: US Prisons and Policing Racial Justice Baltimore **Shows, Podcasts, & Series** Stories of Resistance The Marc Steiner Show Rattling The Bars Solidarity Without Exception Police Accountability Report Tax Broke Edge of Sports with Dave Zirin Baltimore’s Crime Numbers Game Under the Shadow Workers of the World Working People **Follow Us** X Instagram Facebook YouTube Follow us on Mastodon **Trending Posts** ‘Deadly Exchange’: US sends hundreds of law enforcement to Israel to learn ‘worst practices’ from IDF US empire is dying, and it’s more dangerous than ever 'A Declaration of War': Trump Sends National Guard to LA Over Anti-ICE Protests Trans inmates face rape and death with Trump’s Executive Order $20 million to learn how to talk to men? Why the Democrats will keep losing ‘We're holding those dead babies with our hands’: Doctors returning from Gaza beg humanity to stop the carnage Trump cuts leave VA hospital nurses and veteran patients in a crisis Toronto just caved to Zionist attacks on the right to protest Israel's seizure of Gaza Freedom Flotilla called a 'blatant act of international piracy' Los Angeles Resistance: Standing Against ICE Freddie Gray & the Baltimore Uprising: 10 Years Later Israel’s War on Palestine Stories of Resistance Under the Shadow Killer Water Youtube Bluesky Instagram Twitter Facebook Mastodon Telegram RSS Feed The Real News Network Latest Shows & Podcasts About Newsletter Donate Blank (needed for hamburger alignment) Freddie Gray & the Baltimore Uprising: 10 Years Later Israel’s War on Palestine Stories of Resistance Under the Shadow Killer Water **A Hopkins professor says America’s descent into authoritarianism may have started with policing in blue cities. If that’s true, we’re in big trouble.** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Anyone who witnessed or was affected by Baltimore’s failed experiment with zero-tolerance policing during the aughts remembers the unrelenting chaos it created. As reporters working for a newspaper, we witnessed the onslaught of so-called quality of life arrests as a fast-moving crisis that seemed to accelerate with each illegal charge. The policy was driven by the idea that even the most minor infraction, like drinking a beer on a stoop, was worthy of detainment in the pursuit of stopping more violent crimes. However, it soon spiraled out of control to roughly 100,000 arrests per year between 2000 and 2006. It led to bizarre examples of over-policing,like Gerard Mungo, the seven-year-old boy arrested for sitting on an electric dirt bike, or theincarceration of attendees of an entire cookout over a noise complaint. But aside from the individual horror stories of people who ended up in jail without committing a crime, there was something else just as shocking: all of the suffering occurred in a blue city, with little if any political opposition or pushback from the Democratic establishment. Get the truth that fuels action directly into your inbox. Sign up for The Real News. Join the movement. Don’t wait—Subscribe now! If you’re skeptical, don’t be. Post 9-11 Democrats wanted to look tough. And they were looking for a political superstar to replace former President Bill Clinton. Then-Mayor Martin O’Malley fit the bill. He was a rising political star who the local Democratic establishment believed would eventually ascend to the presidency. Throughout his tenure, he oversaw this policy of mass arrests, hoping the ensuing drop in crime would bolster his future candidacy. Predictably, his presidential aspirations fizzled under the weight of the 2015 uprisings after the death of Freddie Gray in police custody,and crime didn’t go down. This is where you come in. We’re a nonprofit newsroom because the kind of truth-telling journalism we do simply can’t happen under corporate ownership. We shine a bright light on the dark corners of power and report the facts that other media won’t touch.What makes this possible?Supporters like you. These are dangerous times, and we have a lot of urgent work ahead of us. But we can’t do it without your support. But the results were undeniably horrific: tens of thousands of people placed in cuffs without committing a crime. An authoritarian policy embraced by a Democratic establishment that seemed to have few qualms with allowing police to create untenable conditions within predominantly African-American neighborhoods. During the zero tolerance heyday, prosecutors were so overwhelmed by the onslaught of detentions thatthey invented a previously unheard-of legal terminology to address it: ‘abated by arrest.’ It was a legal classification intended to reckon with the fact that there was no legal basis for charging thousands of people police were putting into handcuffs. In other words, the arrest was illegal; prosecutors just invented a way to make it seem less so. Zero tolerance was, in some sections of Baltimore, worse than authoritarianism—it led to a reconfiguration of the Constitution. The city’s Central Booking facility, constructed in the ’90s with the expectation it would process around 40,000 arrests annually, was so overwhelmed that many detainees would be given what was known as a ‘walk through,’ which entailed simply walking in and out of the facility in a long serpentine line guided by corrections personnel. This overcrowding was exacerbated by the jump-out boys, who would arrive in predominantly Black neighborhoods to lead people, whose only crime was living in an area police deemed suitable for mass illegal incarceration, into the back of vans. The point was, and is, that zero tolerance was, in some sections of Baltimore, worse than authoritarianism—it led to a reconfiguration of the Constitution. People would be illegally detained and then disappear into the Central Booking facility for months without due process. Many victims we interviewed were often released without charging documents, unable to describe or otherwise recount the crime that had landed them in jail. Baltimore was essentially non-constitutional—a bastion of notably unlawful law enforcement. All of this backstory is a prelude to the astonishing and terrifying argument made recently by prominent Johns Hopkins professor of Political Science and Africana Studies Lester Spence. Spence is one of a handful of innovative political scientists who examine national politics through the prism of urban governance. He is the author ofKnocking the Hustle: Against the Neoliberal Turn in Black Politics. In it he argues that cities, once bastions of progressive policymaking, have become laboratories for neoliberalism. But Spence has taken this idea one step further by making an argument that makes the Trump administration’s current unconstitutional actions even more terrifying. During an interview for the TRNN documentary ‘Freddie Gray: A Decade of Struggle,’ Spence linked the wildly unconstitutional policing that precipitated the uprising to the anti-democratic impulses from the Trump administration that are infiltrating the country’s institutions. “To the extent that if you looked at a map of the country and you looked and you layered density and then voted on that map, what you’d see is the most Democratic places are the densest places, and all the rest is red,” Spence explained. “Now, if you layer onto those values about democracy, should everybody be able to get a right to vote? Should people accept the results of elections? But then, should people have a right to healthcare? Should people have a right to solid education? Should people have a right to a living wage? All those attitudes are concentrated in metropolitan areas. If you constrain the ability of those spaces to articulate those values and policy, then you constrain the ability to state on one hand… and then the nation-state on the other to actually fight for those values,” he said. “So the sort of authoritarianism comes out of the policing and the lack of opportunity and the dysfunction of democracy.” There are obvious connections that Spence is making here. Illegal arrests have been proven to diminish political participation. Specious criminal charges literally erode the type of citizenship that a democracy depends on. The easy-to-construct narrative that Democrats can’t and will not impose order and don’t know how to do so has simply made right-wing talking points more salient and appealing. It estranges, isolates, and otherwise marginalizes entire swathes of a community. Affected residents subsequently cannot access public housing, student loans, or even admission to higher education. All of these factors conclusively diminish the strength and vibrancy of our citizenry, and, as Spence suggests, mute the constituency most likely to advocate for progressive policies. But Spence’s idea has even more profound implications if you delve deeper into the history of policing in blue cities like Baltimore. To understand its true significance, just consider a less direct force undermining democracy which is precipitated by Democrats’ commitment to aggressive law enforcement. It starts with the conservative narrative of the failed city. The so-called failed “Dem-run city” is shorthand for broader attacks on Democratic competence. It boils broader ideas of liberal excesses into simple narratives: The chaotic blue communities are beset by criminals and immigrants. The lawlessness and moral bankruptcy of cities that have run amok. All of it espoused by Republican candidates and right-leaning news media outlets as probable cause to run Democrats out of Washington. The Rupert Murdoch-ownedNew York Postpublished daily stories on crime and dysfunction in San Francisco. Similarly, in our own hometown, right-wing Sinclair Broadcasting has touted a ‘City in Crisis’ series that again equates crime to failed Democratic policies and the mayhem they supposedly engender. All of this, manufactured or true, creates a perception that Democrats are wildly incompetent. That perception gains traction, according to Spence’s idea, because—in some cases—it’s accurate. That’s because cities under Democratic administrations have invested billions in the ostensibly flawed idea that policing was a key to reducing crime. Just like with zero tolerance in Baltimore, many Democratic mayors and elected officials not just allowed but touted aggressive and illegal policing as a proficient means to an end. That commitment to a flawed policy has not only led to failure, but has given Republicans plenty of fodder to justify the Trump administration’s authoritarian rule. The easy-to-construct narrative that Democrats can’t and will not impose order and don’t know how to do so has simply made right-wing talking points more salient and appealing. Baltimore’s recent drop in homicides suggests that all this spending overlooked what appears to be the most effective solution: investment in community-based programs. The irony is, as Spence points out, that blue cities like Baltimore invested massive sums in policing for decades with meager results. Defunding the police has hardly been the problem. Here in Baltimore, for example, public safety spending has outpaced education spending for decades. Nevertheless, Baltimore’s recent drop in homicides suggests that all this spending overlooked what appears to be the most effective solution: investment in community-based programs. Dayvon Love, public policy director for the Baltimore-based think tank Leaders of Beautiful Struggle, made this point in the same documentary. The Baltimore Police Department, he noted, has been grappling with a historic number of vacancies,fluctuating somewhere between 500 and 1,000 officers. However, even with fewer officers to patrol the streets, violent crime and homicides have dropped significantly. In 2024 homicides dropped to 201, a 20% decrease from the year prior. This year, nonfatal shootings and homicides have continued to fall another 20% to a record low. Some have attributed this to a broader national trend towards lower homicide rates. But, as Mayor Brandon Scott recently pointed out, Baltimore has always bucked fluctuations in homicides and violent crime. Instead, Scott attributes the drop to the city’s commitment to community-based programs like the Gun Violence Reduction Strategy, which uses a coordinated community-based approach to persuade high-risk residents to get a job rather than commit a crime. The city, with the help of the state of Maryland, has also made historic investments in Safe Streets, a violence interruption program in which former felons mediate disputes before they turn violent. All of this points to the fact that Democrats’ past use of aggressive policing has been a boon for Republicans because it was not just the wrong solution, but a prescription for electoral failure as well. Whether or not the Republican depiction of this policy has been fair, the fact remains that Democrats across the country have invested countless billions into authoritarian policing with little impact on crime, and as a result have paved the way for an authoritarian national movement. If these two trends continue, as Spence suggested is possible, then we are in big trouble. Just consider the findings of the Justice Department report that was released after its 2016 investigation into the Baltimore Police Department in the wake of the death of Freddie Gray in police custody. It found that, among other abuses, police arrested one man 44 times. It also revealed that several extremely poor and mostly African-American neighborhoods were targeted with mass arrests to the point that a person could be detained for simply walking in an area where they did not live. If that sounds scary, consider the fact that the editor of the paper I worked for was arrested after we publishedthe overtime earnings of all the officers on the force during the zero-tolerance era. Police contriveda crime to effectuate the arrest, accusing him of pointing a shotgun at his neighbors. The case fell apart after his lawyers pointed out that all of this occurred in the privacy of his home and that the aggrieved neighbor had only witnessed the infraction through a shut window. However, that did not stop a cadre of heavily armed officers from dragging him into the same Central Booking facility as the other victims of the city’s mass arrest movement. Even more troubling were the sheer numbers of arrests effectuated by a relatively small number of officers. At its peak, BPD had roughly 3,000 sworn cops—and the number of people they managed to arrest was thousands of times greater. Imagine if the vast federal bureaucracy embarked on a similar program of nationwide detentions. That program is, actually, already happening. The Trump administration has enlisted the FBI and IRS to help arrest immigrants, a task usually outside their respective purviews. The point is, we have witnessed how over-policing changes the contours of government, and if this same mentality pervades the federal institutions and agencies, it will be more terrifying than it’s already been. Spence’s insight should be heeded as not just a cautionary tale, but a call to action. Baltimore has made positive changes to commit resources towards a community based approach to crime intervention. The question is, will it be enough? **Meeting the Moment: Defending Independent Journalism** Friends, I don’t need to tell you that we’re in the middle of a world-historical crisis. In fact, we are standing now at the point of convergence of multiple crises, and we need to act accordingly. The only way out is through, and the only way through is together. “If we fight, I can’t promise we’ll win, but if we don’t fight, I can promise we’ll lose.” Change isn’t going to be handed to us from the elite power brokers and donors controlling the political parties that got us here, and it sure won’t come from the same oligarchs and zealots pillaging and plundering our societies, our democratic institutions, our economy, and our planet.If we expect to see a future that’s still worth living in, then poor, working-class, and oppressed people across the global underclass will need to fight for it. And TRNN will be there on the front lines of the fight with cameras and microphones. Continuing our longstanding commitment to making media that empowers people and movements to make change, TRNN is responding to these societal crises by expanding our coverage with a slate of new and returning programs that uplift the voices and struggles of working people around the world, challenge power, and amplify resistance to exploitation, injustice, and domination. FromRattling the Bars,Police Accountability Report,TheMarc Steiner Show,Inequality Watch, andWorking PeopletoSolidarity Without Exception,Stories of Resistance,Edge of Sports, and more, we are launching groundbreaking new series while reviving and elevating the storytelling formats of fan-favorite shows to engage and activate more people around the world, pierce the algorithmic noise and misinformation, and cut through the corporate media silence. This isn’t just about expanding our content—it’s about deepening our commitment to using our resources and talents as journalists and media makers to serve, inform, connect, and empower people at a time when the fate of our society and our planet hangs on the people’s willingness and ability to fight for them. We’re levelling up to meet the moment, telling the stories that corporate media won’t touch and amplifying the voices of those fighting for justice. Between the techno-fascist, oligarchic takeover of America’s government, the rise of far-right authoritarian governments around the globe, intensifying climate chaos, war, imperialist invasions, attacks on democratic rights, and unsustainable levels of inequality, I can’t tell you I know how all of this will end. I don’t know what will happen in the next 4, 8, or 50 years because that story has yet to be written by people of conscience and our actions.What happens next depends on what we all do now. But I know where we’ll end up if we do nothing. As the old adage goes, “If we fight, I can’t promise we’ll win, but if we don’t fight, I can promise we’ll lose.” Maximillian Alvarez, Editor-in-Chief But we can’t do it without you. Independent journalism like ours doesn’t get funding from billionaires, corporate advertisers, or political parties.We rely on people like you—people who believe in the power of media to inform, mobilize, and challenge those in power. If you believe in a future where journalism serves the people—not the elite—then we need your support today. Even more ways to give... **Related** Republish This Story Republish our articles for free, online or in print, under a Creative Commons license. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. **A Hopkins professor says America’s descent into authoritarianism may have started with policing in blue cities. If that’s true, we’re in big trouble.** by Stephen Janis and Taya Graham, The Real News NetworkMay 12, 2025 **Stephen JanisHost and Producer** Host & ProducerStephen Janis is an award winning investigative reporter turned documentary filmmaker. His first feature film,The Friendliest Townwas distributed by Gravitas Ventures and won an award of distinction from The Impact Doc Film Festival, and a humanitarian award from The Indie Film Fest. He is the co-host and creator ofThe Police Accountability Reporton The Real News Network, which has received more than 10,000,000 views on YouTube. His work as a reporter has been featured on a variety of national shows including the Netflix reboot ofUnsolved Mysteries, Dead of Nighton Investigation Discovery Channel,Relentlesson NBC, andSins of the Cityon TV One. He has co-authored several books on policing, corruption, and the root causes of violence includingWhy Do We Kill: The Pathology of Murder in BaltimoreandYou Can’t Stop Murder: Truths about Policing in Baltimore and Beyond. He is also the co-host of the true crime podcastLand of the Unsolved. Prior to joining The Real News, Janis won three Capital Emmys for investigative series working as an investigative producer for WBFF. Follow him onTwitter. **Taya GrahamHost and Producer** Host & ProducerTaya Graham is an award-winning investigative reporter who has covered U.S. politics, local government, and the criminal justice system. She is the host of TRNN's \"Police Accountability Report,\" and producer and co-creator of the award-winning podcast \"Truth and Reconciliation\" on Baltimore's NPR affiliate WYPR. She has written extensively for a variety of publications including the Afro American Newspaper, the oldest black-owned publication in the country, and was a frequent contributor to Morgan State Radio at a historic HBCU. She has also produced two documentaries, including the feature-length film \"The Friendliest Town.\" Although her reporting focuses on the criminal justice system and government accountability, she has provided on the ground coverage of presidential primaries and elections as well as local and state campaigns. Follow her onTwitter. Youtube Bluesky Instagram Twitter Facebook Mastodon Telegram RSS Feed **TRNN** About The Real News Network Our Team Latest News In the Media Donate Ways to Give Jobs Press Releases Ethics Policy Work with us as a freelancer **Sections** Climate Crisis Economy and Inequality Movements and Politics: International Movements and Politics: US Prisons and Policing Racial Justice Baltimore **Shows & Series** Stories of Resistance The Marc Steiner Show Rattling The Bars Solidarity Without Exception Police Accountability Report Tax Broke Edge of Sports with Dave Zirin Baltimore’s Crime Numbers Game Under the Shadow Workers of the World Working People **Contact Us** Use SecureDrop, an anonymity tool for journalists and whistleblowers.SecureDrop is an anonymity tool for journalists and whistleblowers. You can use our SecureDrop installation to anonymously submit documents to The Real News, and our journalists can use SecureDrop to securely communicate with anonymous contacts.To protect your anonymity when using SecureDrop, it is essential that you do not use a network or device that can easily be traced back to your real identity. Instead, use public wifi networks and devices you control.Do NOT access SecureDrop on your employer’s network.Do NOT access SecureDrop using your employer’s hardware.Do NOT access SecureDrop on your home network.DO access SecureDrop on a network not associated with you, like the wifi at a library or cafe.Once you are connected to a public network at a cafe or library, download and install the desktop version ofTor Browser.Launch Tor Browser. Visit our organization’s unique SecureDrop URL at http://isomzhlu2hqz2ll6t3c7mt67j3mvad2omzptk6cnc2ce2fzdabjjmnid.onion/. Follow the instructions you find on our source page to send us materials and messages.When you make your first submission, you will receive a unique codename. Memorize it. If you write it down, be sure to destroy the copy as soon as you’ve committed it to memory. Use your codename to sign back in to our source page, check for responses from our journalists, and upload additional materials.No tool can absolutely guarantee your security or anonymity. The best way to protect your privacy and anonymity as a source is to adhere to best practices.You can use a separate computer you’ve designated specifically to handle the submission process. Or, you can use an alternate operating system like Tails, which boots from a USB stick and erases your activity at the end of every session.A file contains valuablemetadataabout its source — when it was created and downloaded, what machine was involved, the machine’s owner, etc. You can scrub metadata from some files prior to submission using the Metadata Anonymization Toolkit featured in Tails.Your online behavior can be extremely revealing. Regularly monitoring our publication’s social media or website can potentially flag you as a source. Take great care to think about what your online behavior might reveal, and consider using Tor Browser to mitigate such monitoring.Our organization retains strict access control over our SecureDrop project. A select few journalists within our organization will have access to SecureDrop submissions. We control the servers that store your submissions, so no third party has direct access to the metadata or content of what you send us.Do not discuss leaking or whistleblowing, even with trusted contacts.Send us physical mail.Sending us physical mail is also an option that can preserve your anonymity, especially if you use a public mailbox:Maximilian Alvarez, Editor in ChiefThe Real News Network231 Holliday St.Baltimore, MD 21202 SecureDrop is an anonymity tool for journalists and whistleblowers. You can use our SecureDrop installation to anonymously submit documents to The Real News, and our journalists can use SecureDrop to securely communicate with anonymous contacts. To protect your anonymity when using SecureDrop, it is essential that you do not use a network or device that can easily be traced back to your real identity. Instead, use public wifi networks and devices you control. Do NOT access SecureDrop on your employer’s network.Do NOT access SecureDrop using your employer’s hardware.Do NOT access SecureDrop on your home network.DO access SecureDrop on a network not associated with you, like the wifi at a library or cafe. Once you are connected to a public network at a cafe or library, download and install the desktop version ofTor Browser. Launch Tor Browser. Visit our organization’s unique SecureDrop URL at http://isomzhlu2hqz2ll6t3c7mt67j3mvad2omzptk6cnc2ce2fzdabjjmnid.onion/. Follow the instructions you find on our source page to send us materials and messages. When you make your first submission, you will receive a unique codename. Memorize it. If you write it down, be sure to destroy the copy as soon as you’ve committed it to memory. Use your codename to sign back in to our source page, check for responses from our journalists, and upload additional materials. No tool can absolutely guarantee your security or anonymity. The best way to protect your privacy and anonymity as a source is to adhere to best practices. You can use a separate computer you’ve designated specifically to handle the submission process. Or, you can use an alternate operating system like Tails, which boots from a USB stick and erases your activity at the end of every session. A file contains valuablemetadataabout its source — when it was created and downloaded, what machine was involved, the machine’s owner, etc. You can scrub metadata from some files prior to submission using the Metadata Anonymization Toolkit featured in Tails. Your online behavior can be extremely revealing. Regularly monitoring our publication’s social media or website can potentially flag you as a source. Take great care to think about what your online behavior might reveal, and consider using Tor Browser to mitigate such monitoring. Our organization retains strict access control over our SecureDrop project. A select few journalists within our organization will have access to SecureDrop submissions. We control the servers that store your submissions, so no third party has direct access to the metadata or content of what you send us. Do not discuss leaking or whistleblowing, even with trusted contacts. Sending us physical mail is also an option that can preserve your anonymity, especially if you use a public mailbox: Maximilian Alvarez, Editor in ChiefThe Real News Network231 Holliday St.Baltimore, MD 21202 SecureDrop is an anonymity tool for journalists and whistleblowers. You can use our SecureDrop installation to anonymously submit documents to The Real News, and our journalists can use SecureDrop to securely communicate with anonymous contacts. To protect your anonymity when using SecureDrop, it is essential that you do not use a network or device that can easily be traced back to your real identity. Instead, use public wifi networks and devices you control. Do NOT access SecureDrop on your employer’s network.Do NOT access SecureDrop using your employer’s hardware.Do NOT access SecureDrop on your home network.DO access SecureDrop on a network not associated with you, like the wifi at a library or cafe. Once you are connected to a public network at a cafe or library, download and install the desktop version ofTor Browser. Launch Tor Browser. Visit our organization’s unique SecureDrop URL at http://isomzhlu2hqz2ll6t3c7mt67j3mvad2omzptk6cnc2ce2fzdabjjmnid.onion/. Follow the instructions you find on our source page to send us materials and messages. When you make your first submission, you will receive a unique codename. Memorize it. If you write it down, be sure to destroy the copy as soon as you’ve committed it to memory. Use your codename to sign back in to our source page, check for responses from our journalists, and upload additional materials. No tool can absolutely guarantee your security or anonymity. The best way to protect your privacy and anonymity as a source is to adhere to best practices. You can use a separate computer you’ve designated specifically to handle the submission process. Or, you can use an alternate operating system like Tails, which boots from a USB stick and erases your activity at the end of every session. A file contains valuablemetadataabout its source — when it was created and downloaded, what machine was involved, the machine’s owner, etc. You can scrub metadata from some files prior to submission using the Metadata Anonymization Toolkit featured in Tails. Your online behavior can be extremely revealing. Regularly monitoring our publication’s social media or website can potentially flag you as a source. Take great care to think about what your online behavior might reveal, and consider using Tor Browser to mitigate such monitoring. Our organization retains strict access control over our SecureDrop project. A select few journalists within our organization will have access to SecureDrop submissions. We control the servers that store your submissions, so no third party has direct access to the metadata or content of what you send us. Do not discuss leaking or whistleblowing, even with trusted contacts. Sending us physical mail is also an option that can preserve your anonymity, especially if you use a public mailbox: Maximilian Alvarez, Editor in ChiefThe Real News Network231 Holliday St.Baltimore, MD 21202 To enhance your experience, we use cookies and similar technologies to optimize how our site works for you. By agreeing, you help us understand your preferences and provide tailored features. If you choose not to accept, some parts of the site might not function as smoothly."}