{"id": 1335, "name": "TechCrunch", "domain": "techcrunch.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://techcrunch.com/storyline/sxsw-2025-live-coverage-health-tips-from-bryan-johnson-concerns-about-elon-musk-and-what-its-like-to-actually-ride-a-waymo-uber-on-the-conferences-final-day/", "title": "Sxsw 2025 Live Coverage Health Tips From Bryan Johnson Concerns About Elon Musk And What Its Like To Actually Ride A Waymo Uber On The Conferences Final Day", "content": "Latest Startups Venture Apple Security AI Apps Events Podcasts Newsletters **Topics** Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture **More from TechCrunch** Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us **SXSW 2025 live coverage: Health tips from Bryan Johnson, concerns about Elon Musk, and what it’s like to actually ride a Waymo Uber on the conference’s final day** 36 Stories Kirsten Korosec March 7, 2025 – March 14, 2025 TechCrunch will be on the ground at SXSW 2025 — the annual tech, music, comedy, and film conference that kicked off Friday in Austin — in search of the zeitgeist of this AI-centric era. The tech portion of the annual event kicked off Friday and will run through March 13.The conference begins with several tracks that fall squarely in TechCrunch’s area of interest, including the creator economy, culture, startups, health and medtech, and energy. Mar 14, 2025Kirsten KorosecFrom AI and ‘mundus sine caesaribus’ to Rivian and Koe WetzelFolks, it’s time to hit the dusty trail and leave Austin and SXSW 2025 behind. The official conference ended Thursday evening and the music festival, which lasts another two nights, took over. We marked the end of the conference with some tacos and Billboard’s The Stage at SXSW with headliner Koe Wetzel.Tech had a lighter footprint at the conference this year, particularly in the exhibition hall. But we still found lots of founders, some investors, interesting onstage interviews, and Bluesky Jay Graber’s cheeky wardrobe choice that called for“A world without Caesars.”Not to mention lots of robotaxis.On the transportation beat,Rivian,Uber, and Waymomade the biggest splash. But AI was the real star, at least in terms of stage time. AI popped up in every conversation — on stage and off — from sports and entertainment to enterprise, social media, and urban development. The messaging fell squarely in thecautious optimism campwith a few folks likeSignal President Meredith Whittakerandauthor Kasley Killamissuing sterner warnings of the risks from AI.See y’all next year.Updated 3 months ago Kirsten Korosec **From AI and ‘mundus sine caesaribus’ to Rivian and Koe Wetzel** Folks, it’s time to hit the dusty trail and leave Austin and SXSW 2025 behind. The official conference ended Thursday evening and the music festival, which lasts another two nights, took over. We marked the end of the conference with some tacos and Billboard’s The Stage at SXSW with headliner Koe Wetzel. Tech had a lighter footprint at the conference this year, particularly in the exhibition hall. But we still found lots of founders, some investors, interesting onstage interviews, and Bluesky Jay Graber’s cheeky wardrobe choice that called for“A world without Caesars.” Not to mention lots of robotaxis. On the transportation beat,Rivian,Uber, and Waymomade the biggest splash. But AI was the real star, at least in terms of stage time. AI popped up in every conversation — on stage and off — from sports and entertainment to enterprise, social media, and urban development. The messaging fell squarely in thecautious optimism campwith a few folks likeSignal President Meredith Whittakerandauthor Kasley Killamissuing sterner warnings of the risks from AI. See y’all next year. Kirsten Korosec **From AI and ‘mundus sine caesaribus’ to Rivian and Koe Wetzel** Folks, it’s time to hit the dusty trail and leave Austin and SXSW 2025 behind. The official conference ended Thursday evening and the music festival, which lasts another two nights, took over. We marked the end of the conference with some tacos and Billboard’s The Stage at SXSW with headliner Koe Wetzel. Tech had a lighter footprint at the conference this year, particularly in the exhibition hall. But we still found lots of founders, some investors, interesting onstage interviews, and Bluesky Jay Graber’s cheeky wardrobe choice that called for“A world without Caesars.” Not to mention lots of robotaxis. On the transportation beat,Rivian,Uber, and Waymomade the biggest splash. But AI was the real star, at least in terms of stage time. AI popped up in every conversation — on stage and off — from sports and entertainment to enterprise, social media, and urban development. The messaging fell squarely in thecautious optimism campwith a few folks likeSignal President Meredith Whittakerandauthor Kasley Killamissuing sterner warnings of the risks from AI. See y’all next year. Mar 14, 2025Rebecca BellanTesting Tern AI’s low-cost GPS alternativeAt SXSW, Tern AIdemonstrated exclusivelyfor TechCrunch that its low-cost alternative to GPS could “derive a position from nothing” — “No triangulation, no satellites, no Wi-Fi, nothing.”All Tern’s intelligent system uses is a cocktail of cached map information and a vehicle’s existing sensor data.“Your GPS cannot initialize position without that triangulation process, and so we think it’s a rather important innovation to be able to determine position organically within the vehicle,” Brett Harrison, co-founder and president, told TechCrunch. “[Tern] turns all these vehicles that you see into creators and originators of position information instead of consumers of it.”Our most critical systems, from aviation to disaster response to precision farming, rely on GPS. Foreign adversaries have already demonstrated that they can spoof GPS signals, which could have catastrophic impacts both on the economy and national security. Which makes finding alternatives all the more important.Read more about Tern AI’s mission and my demo with the Austin-based startup’s tech!Updated 3 months ago Rebecca Bellan **Testing Tern AI’s low-cost GPS alternative** At SXSW, Tern AIdemonstrated exclusivelyfor TechCrunch that its low-cost alternative to GPS could “derive a position from nothing” — “No triangulation, no satellites, no Wi-Fi, nothing.” All Tern’s intelligent system uses is a cocktail of cached map information and a vehicle’s existing sensor data. “Your GPS cannot initialize position without that triangulation process, and so we think it’s a rather important innovation to be able to determine position organically within the vehicle,” Brett Harrison, co-founder and president, told TechCrunch. “[Tern] turns all these vehicles that you see into creators and originators of position information instead of consumers of it.” Our most critical systems, from aviation to disaster response to precision farming, rely on GPS. Foreign adversaries have already demonstrated that they can spoof GPS signals, which could have catastrophic impacts both on the economy and national security. Which makes finding alternatives all the more important. Read more about Tern AI’s mission and my demo with the Austin-based startup’s tech! Rebecca Bellan **Testing Tern AI’s low-cost GPS alternative** At SXSW, Tern AIdemonstrated exclusivelyfor TechCrunch that its low-cost alternative to GPS could “derive a position from nothing” — “No triangulation, no satellites, no Wi-Fi, nothing.” All Tern’s intelligent system uses is a cocktail of cached map information and a vehicle’s existing sensor data. “Your GPS cannot initialize position without that triangulation process, and so we think it’s a rather important innovation to be able to determine position organically within the vehicle,” Brett Harrison, co-founder and president, told TechCrunch. “[Tern] turns all these vehicles that you see into creators and originators of position information instead of consumers of it.” Our most critical systems, from aviation to disaster response to precision farming, rely on GPS. Foreign adversaries have already demonstrated that they can spoof GPS signals, which could have catastrophic impacts both on the economy and national security. Which makes finding alternatives all the more important. Read more about Tern AI’s mission and my demo with the Austin-based startup’s tech! Mar 13, 2025Rebecca BellanBryan Johnson wants to start ‘foodome sequencing’In the same way that genome sequencing determines the genetic makeup of an organism, Bryan Johnson — the investor and founder behind theDon’t Diemovement — wants to start “foodome” sequencing.“We’re going to sequence the U.S. ‘foodome,’ which means test 20% of foods that constitute 80% of the American diet based on stuff we eat everyday,” Johnson said Thursday at SXSW.Johnson is the founder and former CEO of Kernel, a brain monitoring device company, founder of OS Fund, and founder and former CEO of e-commerce company Braintree.“I want to be real with you, it’s just very, very hard to buy clean food,” he said, noting that most foods from grocery stores, even the organic brands, could have toxins in them from the way the food was processed.His goal is to test all of the food and create a public database where people can donate money to have certain foods and brands tested for toxins like heavy metals or microplastics, and then use the results to hold brands accountable for unsafe food practices.Updated 3 months ago Rebecca Bellan **Bryan Johnson wants to start ‘foodome sequencing’** In the same way that genome sequencing determines the genetic makeup of an organism, Bryan Johnson — the investor and founder behind theDon’t Diemovement — wants to start “foodome” sequencing. “We’re going to sequence the U.S. ‘foodome,’ which means test 20% of foods that constitute 80% of the American diet based on stuff we eat everyday,” Johnson said Thursday at SXSW. Johnson is the founder and former CEO of Kernel, a brain monitoring device company, founder of OS Fund, and founder and former CEO of e-commerce company Braintree. “I want to be real with you, it’s just very, very hard to buy clean food,” he said, noting that most foods from grocery stores, even the organic brands, could have toxins in them from the way the food was processed. His goal is to test all of the food and create a public database where people can donate money to have certain foods and brands tested for toxins like heavy metals or microplastics, and then use the results to hold brands accountable for unsafe food practices. Rebecca Bellan **Bryan Johnson wants to start ‘foodome sequencing’** In the same way that genome sequencing determines the genetic makeup of an organism, Bryan Johnson — the investor and founder behind theDon’t Diemovement — wants to start “foodome” sequencing. “We’re going to sequence the U.S. ‘foodome,’ which means test 20% of foods that constitute 80% of the American diet based on stuff we eat everyday,” Johnson said Thursday at SXSW. Johnson is the founder and former CEO of Kernel, a brain monitoring device company, founder of OS Fund, and founder and former CEO of e-commerce company Braintree. “I want to be real with you, it’s just very, very hard to buy clean food,” he said, noting that most foods from grocery stores, even the organic brands, could have toxins in them from the way the food was processed. His goal is to test all of the food and create a public database where people can donate money to have certain foods and brands tested for toxins like heavy metals or microplastics, and then use the results to hold brands accountable for unsafe food practices. Mar 13, 2025Kirsten KorosecWhat we discovered when we finally matched with a Waymo robotaxiImage Credits:Kirsten KorosecTheWaymo on Uber robotaxi servicelaunched in Austin a week before SXSW and it’s been a challenge actually matching with one. In Phoenix, San Francisco, and Los Angeles, consumers use the Waymo One app to hail a ride. And it’s always a robotaxi.Here in Austin, consumers use the Uber app and sometimes they’re matched with a robotaxi. Usually they get a human driver. Waymo helped TechCrunch coordinate a robotaxi ride. And that was fine and all, but we wanted an experience that was less orchestrated.We got lucky Thursday morning and were matched. The drive itself was uneventful, although the route was longer than what Google Maps suggested (I always compare). Waymo told me that the vehicles were being routed around certain areas, which may explain the difference.We did notice some new stuff though. Namely, the user interface, which includes the two displays inside the vehicle that shows the robotaxi and its surroundings. Waymo confirmed the updates and noted that these occur continuously.Here’s what we spotted. The display now shows the turn signals, hazards, and brake lights of vehicles in front of, and around, the robotaxi. Waymo now colors pedestrians, cyclists, and parked vehicles differently and the display highlights the destination building as the rider arrives at their drop off point. Finally, the Waymo display shows stop signs and traffic cones.Updated 3 months ago Kirsten Korosec **What we discovered when we finally matched with a Waymo robotaxi** TheWaymo on Uber robotaxi servicelaunched in Austin a week before SXSW and it’s been a challenge actually matching with one. In Phoenix, San Francisco, and Los Angeles, consumers use the Waymo One app to hail a ride. And it’s always a robotaxi. Here in Austin, consumers use the Uber app and sometimes they’re matched with a robotaxi. Usually they get a human driver. Waymo helped TechCrunch coordinate a robotaxi ride. And that was fine and all, but we wanted an experience that was less orchestrated. We got lucky Thursday morning and were matched. The drive itself was uneventful, although the route was longer than what Google Maps suggested (I always compare). Waymo told me that the vehicles were being routed around certain areas, which may explain the difference. We did notice some new stuff though. Namely, the user interface, which includes the two displays inside the vehicle that shows the robotaxi and its surroundings. Waymo confirmed the updates and noted that these occur continuously. Here’s what we spotted. The display now shows the turn signals, hazards, and brake lights of vehicles in front of, and around, the robotaxi. Waymo now colors pedestrians, cyclists, and parked vehicles differently and the display highlights the destination building as the rider arrives at their drop off point. Finally, the Waymo display shows stop signs and traffic cones. Kirsten Korosec **What we discovered when we finally matched with a Waymo robotaxi** TheWaymo on Uber robotaxi servicelaunched in Austin a week before SXSW and it’s been a challenge actually matching with one. In Phoenix, San Francisco, and Los Angeles, consumers use the Waymo One app to hail a ride. And it’s always a robotaxi. Here in Austin, consumers use the Uber app and sometimes they’re matched with a robotaxi. Usually they get a human driver. Waymo helped TechCrunch coordinate a robotaxi ride. And that was fine and all, but we wanted an experience that was less orchestrated. We got lucky Thursday morning and were matched. The drive itself was uneventful, although the route was longer than what Google Maps suggested (I always compare). Waymo told me that the vehicles were being routed around certain areas, which may explain the difference. We did notice some new stuff though. Namely, the user interface, which includes the two displays inside the vehicle that shows the robotaxi and its surroundings. Waymo confirmed the updates and noted that these occur continuously. Here’s what we spotted. The display now shows the turn signals, hazards, and brake lights of vehicles in front of, and around, the robotaxi. Waymo now colors pedestrians, cyclists, and parked vehicles differently and the display highlights the destination building as the rider arrives at their drop off point. Finally, the Waymo display shows stop signs and traffic cones. Mar 13, 2025Rebecca BellanThe most SXSW film goes to: ‘The Rivals of Amziah King’Kirsten and I turned our tech brains off for a couple of hours to treat ourselves to a film, and I gotta say, “The Rivals of Amziah King” is THE PERFECT SXSW film. The movie, which is the first film Matthew McConaughey has been in in six years, has a healthy dose of Southern charm, strong themes of honor culture, heartwarming comedy, and a constant current of live bluegrass music that is so soulful, it’ll challenge anyone who claims they don’t like country.It also received astanding ovation at the premiere. And, welp, that doesn’t happen every day.I almost don’t want to tell you anything else about this film. I went in blind, and I was enthralled by every unexpected plot turn and camera angles. All you need to know is, everyone in that theater laughed, cried, jumped, and tapped their feet to the music. I have a newfound respect for both bees and the humble mandolin.Updated 3 months ago Rebecca Bellan **The most SXSW film goes to: ‘The Rivals of Amziah King’** Kirsten and I turned our tech brains off for a couple of hours to treat ourselves to a film, and I gotta say, “The Rivals of Amziah King” is THE PERFECT SXSW film. The movie, which is the first film Matthew McConaughey has been in in six years, has a healthy dose of Southern charm, strong themes of honor culture, heartwarming comedy, and a constant current of live bluegrass music that is so soulful, it’ll challenge anyone who claims they don’t like country.It also received astanding ovation at the premiere. And, welp, that doesn’t happen every day. I almost don’t want to tell you anything else about this film. I went in blind, and I was enthralled by every unexpected plot turn and camera angles. All you need to know is, everyone in that theater laughed, cried, jumped, and tapped their feet to the music. I have a newfound respect for both bees and the humble mandolin. Rebecca Bellan **The most SXSW film goes to: ‘The Rivals of Amziah King’** Kirsten and I turned our tech brains off for a couple of hours to treat ourselves to a film, and I gotta say, “The Rivals of Amziah King” is THE PERFECT SXSW film. The movie, which is the first film Matthew McConaughey has been in in six years, has a healthy dose of Southern charm, strong themes of honor culture, heartwarming comedy, and a constant current of live bluegrass music that is so soulful, it’ll challenge anyone who claims they don’t like country.It also received astanding ovation at the premiere. And, welp, that doesn’t happen every day. I almost don’t want to tell you anything else about this film. I went in blind, and I was enthralled by every unexpected plot turn and camera angles. All you need to know is, everyone in that theater laughed, cried, jumped, and tapped their feet to the music. I have a newfound respect for both bees and the humble mandolin. Mar 13, 2025Kyle WiggersRumman Chowdhury is worried about Elon Musk’s role in the governmentThe former director of Twitter’s machine ethics teamhad some choice wordsabout Elon Musk and his Department of Government Efficiency onstage at SXSW on Thursday.“When your funding is frozen and you don’t know if you’re gonna be fired, and there’s this, like, absolutely unhinged person saying weird things on the internet constantly, you still have to do your job, right?” Chowdhury said. “The lights have to be kept on because Elon Musk is not the one keeping the lights on, even though he would like you to think that.”Chowdhury said she fears the brain drain resulting from the dramatic reductions and chaotic management style.Updated 3 months ago Kyle Wiggers **Rumman Chowdhury is worried about Elon Musk’s role in the government** The former director of Twitter’s machine ethics teamhad some choice wordsabout Elon Musk and his Department of Government Efficiency onstage at SXSW on Thursday. “When your funding is frozen and you don’t know if you’re gonna be fired, and there’s this, like, absolutely unhinged person saying weird things on the internet constantly, you still have to do your job, right?” Chowdhury said. “The lights have to be kept on because Elon Musk is not the one keeping the lights on, even though he would like you to think that.” Chowdhury said she fears the brain drain resulting from the dramatic reductions and chaotic management style. Kyle Wiggers **Rumman Chowdhury is worried about Elon Musk’s role in the government** The former director of Twitter’s machine ethics teamhad some choice wordsabout Elon Musk and his Department of Government Efficiency onstage at SXSW on Thursday. “When your funding is frozen and you don’t know if you’re gonna be fired, and there’s this, like, absolutely unhinged person saying weird things on the internet constantly, you still have to do your job, right?” Chowdhury said. “The lights have to be kept on because Elon Musk is not the one keeping the lights on, even though he would like you to think that.” Chowdhury said she fears the brain drain resulting from the dramatic reductions and chaotic management style. Mar 13, 2025Kirsten KorosecIt’s the last day of the SXSW conference .. cue the musicWe’re here for the final day of the SXSW conference, which means the tech talks will end and the music goes to 11. We will bid adieu by tonight, but first let’s catch up on a bit of tech.The exhibition hall within the Austin Convention Center was light on tech. Really,reallylight on tech.In years past, the hall was brimming with startups. This year, I found them in the installations and activations outside of the convention center, including Midwest House, Ireland House, and Funded House. Oh, and of course the parties too.Founders were out and about — and looking for funding. There were delegations of founders too, coming from Europe, Australia, and Brazil. Notably, I didn’t encounter much chatter of dual-use or defense startups. Although that might have been due to circumstances — SXSW tends to spread out.Quantum computing has been having a moment at SXSW with several talks on Wednesday and today. Plus, Marc Maron, the comedian whose podcast “WTF with Marc Maron,” receives over 80 million listeners per year,riffedon a lot of topics, including an earnest exclamation that the podcast will never get into video.And we managed to get matched with a Waymo robotaxi with the Uber app. Hooray. More on that in a moment.Updated 3 months ago Kirsten Korosec **It’s the last day of the SXSW conference .. cue the music** We’re here for the final day of the SXSW conference, which means the tech talks will end and the music goes to 11. We will bid adieu by tonight, but first let’s catch up on a bit of tech.The exhibition hall within the Austin Convention Center was light on tech. Really,reallylight on tech. In years past, the hall was brimming with startups. This year, I found them in the installations and activations outside of the convention center, including Midwest House, Ireland House, and Funded House. Oh, and of course the parties too. Founders were out and about — and looking for funding. There were delegations of founders too, coming from Europe, Australia, and Brazil. Notably, I didn’t encounter much chatter of dual-use or defense startups. Although that might have been due to circumstances — SXSW tends to spread out.Quantum computing has been having a moment at SXSW with several talks on Wednesday and today. Plus, Marc Maron, the comedian whose podcast “WTF with Marc Maron,” receives over 80 million listeners per year,riffedon a lot of topics, including an earnest exclamation that the podcast will never get into video.And we managed to get matched with a Waymo robotaxi with the Uber app. Hooray. More on that in a moment. Kirsten Korosec **It’s the last day of the SXSW conference .. cue the music** We’re here for the final day of the SXSW conference, which means the tech talks will end and the music goes to 11. We will bid adieu by tonight, but first let’s catch up on a bit of tech.The exhibition hall within the Austin Convention Center was light on tech. Really,reallylight on tech. In years past, the hall was brimming with startups. This year, I found them in the installations and activations outside of the convention center, including Midwest House, Ireland House, and Funded House. Oh, and of course the parties too. Founders were out and about — and looking for funding. There were delegations of founders too, coming from Europe, Australia, and Brazil. Notably, I didn’t encounter much chatter of dual-use or defense startups. Although that might have been due to circumstances — SXSW tends to spread out.Quantum computing has been having a moment at SXSW with several talks on Wednesday and today. Plus, Marc Maron, the comedian whose podcast “WTF with Marc Maron,” receives over 80 million listeners per year,riffedon a lot of topics, including an earnest exclamation that the podcast will never get into video.And we managed to get matched with a Waymo robotaxi with the Uber app. Hooray. More on that in a moment. Mar 12, 2025Rebecca BellanAI startup grants in San Jose open today!Remember thatSan Jose grant program for AI startupsI mentioned yesterday? Well, we’ve got some more details on that now.The city officially opened applications for grants to incentivize AI startups to move to downtown San Jose. There are three $50,000 grants on offer and another for $25,000 to AI companies at any stage that are looking to create a presence in the city. Bonus points if the startup focuses on civic problems for social good.“We have seen a growing narrative that the Bay Area is a tough place to do business,” San Jose mayor Matt Mahan told TechCrunch. “People are worried about the high cost of living, the lack of affordable housing, and have a lot of concern about whether or not they should start a company in the Bay Area, and we want to take on those concerns head-on.”Correction: This post has been updated to reflect the correct grant amountsUpdated 3 months ago Rebecca Bellan **AI startup grants in San Jose open today!** Remember thatSan Jose grant program for AI startupsI mentioned yesterday? Well, we’ve got some more details on that now. The city officially opened applications for grants to incentivize AI startups to move to downtown San Jose. There are three $50,000 grants on offer and another for $25,000 to AI companies at any stage that are looking to create a presence in the city. Bonus points if the startup focuses on civic problems for social good. “We have seen a growing narrative that the Bay Area is a tough place to do business,” San Jose mayor Matt Mahan told TechCrunch. “People are worried about the high cost of living, the lack of affordable housing, and have a lot of concern about whether or not they should start a company in the Bay Area, and we want to take on those concerns head-on.” Correction: This post has been updated to reflect the correct grant amounts Rebecca Bellan **AI startup grants in San Jose open today!** Remember thatSan Jose grant program for AI startupsI mentioned yesterday? Well, we’ve got some more details on that now. The city officially opened applications for grants to incentivize AI startups to move to downtown San Jose. There are three $50,000 grants on offer and another for $25,000 to AI companies at any stage that are looking to create a presence in the city. Bonus points if the startup focuses on civic problems for social good. “We have seen a growing narrative that the Bay Area is a tough place to do business,” San Jose mayor Matt Mahan told TechCrunch. “People are worried about the high cost of living, the lack of affordable housing, and have a lot of concern about whether or not they should start a company in the Bay Area, and we want to take on those concerns head-on.” Correction: This post has been updated to reflect the correct grant amounts Mar 12, 2025Sarah PerezCCR’s John Fogerty jokes about using ChatGPT to make a setlistSinger, songwriter, and leader of Creedence Clearwater Revival (CCR) John Fogerty is apparently keeping up with the times. Duringhis SXSW keynoteon Wednesday in Austin, Texas, the musician joked about using ChatGPT to determine which songs to play for his shows.In an interview conducted by Tom Morello (of Rage Against the Machine and Audioslave), Fogerty was asked how he decided on a setlist for a given evening, like his concert at SXSW the previous night.“I just go on ChatGPT or whatever,” Fogerty said, leading the audience to howl with laughter.He then added that “you learn a whole lot trying to be an entertainer,” and said he just wanted people to have fun at the concert. “I want them to join in. I want them to sing along.”The interview also touched on CCR history, music publishing rights, and the stories behind some of the band’s songs, among other things.At one point, Fogerty also pointed out how the medium we use to consume music defines how it’s presented.“Songs have always sort of been manifested by the medium that they’re on. I mean, the three-minute song or so was invented because of the 78 record. You just couldn’t put more stuff in there,” he said. Then the LP came along and CDs, which led to people having albums with far more songs, even 19- or 21-track albums.” (He said he didn’t think this was a great idea, for what it’s worth, adding that “after six or seven songs, put it on the next record!”)Today, the medium we use to consume music is streaming, which means that distribution is in some ways more democratic, Morello said, although there’s less of a funnel as thousands of new songs are released daily.CCR has over a billion streams, however, which Fogerty said was “magical and remarkable.”“If your song is streamed, especially to a great degree, it means that young people are listening to it, because that’s their media: streaming,” he said.Updated 3 months ago Sarah Perez **CCR’s John Fogerty jokes about using ChatGPT to make a setlist** Singer, songwriter, and leader of Creedence Clearwater Revival (CCR) John Fogerty is apparently keeping up with the times. Duringhis SXSW keynoteon Wednesday in Austin, Texas, the musician joked about using ChatGPT to determine which songs to play for his shows. In an interview conducted by Tom Morello (of Rage Against the Machine and Audioslave), Fogerty was asked how he decided on a setlist for a given evening, like his concert at SXSW the previous night. “I just go on ChatGPT or whatever,” Fogerty said, leading the audience to howl with laughter. He then added that “you learn a whole lot trying to be an entertainer,” and said he just wanted people to have fun at the concert. “I want them to join in. I want them to sing along.” The interview also touched on CCR history, music publishing rights, and the stories behind some of the band’s songs, among other things. At one point, Fogerty also pointed out how the medium we use to consume music defines how it’s presented. “Songs have always sort of been manifested by the medium that they’re on. I mean, the three-minute song or so was invented because of the 78 record. You just couldn’t put more stuff in there,” he said. Then the LP came along and CDs, which led to people having albums with far more songs, even 19- or 21-track albums.” (He said he didn’t think this was a great idea, for what it’s worth, adding that “after six or seven songs, put it on the next record!”) Today, the medium we use to consume music is streaming, which means that distribution is in some ways more democratic, Morello said, although there’s less of a funnel as thousands of new songs are released daily. CCR has over a billion streams, however, which Fogerty said was “magical and remarkable.” “If your song is streamed, especially to a great degree, it means that young people are listening to it, because that’s their media: streaming,” he said. Sarah Perez **CCR’s John Fogerty jokes about using ChatGPT to make a setlist** Singer, songwriter, and leader of Creedence Clearwater Revival (CCR) John Fogerty is apparently keeping up with the times. Duringhis SXSW keynoteon Wednesday in Austin, Texas, the musician joked about using ChatGPT to determine which songs to play for his shows. In an interview conducted by Tom Morello (of Rage Against the Machine and Audioslave), Fogerty was asked how he decided on a setlist for a given evening, like his concert at SXSW the previous night. “I just go on ChatGPT or whatever,” Fogerty said, leading the audience to howl with laughter. He then added that “you learn a whole lot trying to be an entertainer,” and said he just wanted people to have fun at the concert. “I want them to join in. I want them to sing along.” The interview also touched on CCR history, music publishing rights, and the stories behind some of the band’s songs, among other things. At one point, Fogerty also pointed out how the medium we use to consume music defines how it’s presented. “Songs have always sort of been manifested by the medium that they’re on. I mean, the three-minute song or so was invented because of the 78 record. You just couldn’t put more stuff in there,” he said. Then the LP came along and CDs, which led to people having albums with far more songs, even 19- or 21-track albums.” (He said he didn’t think this was a great idea, for what it’s worth, adding that “after six or seven songs, put it on the next record!”) Today, the medium we use to consume music is streaming, which means that distribution is in some ways more democratic, Morello said, although there’s less of a funnel as thousands of new songs are released daily. CCR has over a billion streams, however, which Fogerty said was “magical and remarkable.” “If your song is streamed, especially to a great degree, it means that young people are listening to it, because that’s their media: streaming,” he said. Mar 12, 2025Rebecca BellanYour living room on wheelsI just moderated my second panel at SXSW: Engineering Joyrides with Gretchen Effgen (director of global automotive partnerships at Google), Pankaj Kedia (VP of commercial partnerships at Dolby), and Alan Wexler (SVP of strategy and innovation at GM). It was a lively discussion about what in-car entertainment looks like today and what it’ll be in the future, as more cars develop autonomous capabilities.The talk followed some news from the three companies.GM a few days ago announcedthat its electric Cadillac OPTIQ and VISTIQ will feature Dolby Atmos immersive sound, available through Amazon Music. It’s the start of a larger rollout of Dolby’s system as a standard feature in certain 2025 and 2026 Cadillac models, and will be available across Cadillac’s entire 2026 EV lineup.The Optiq and other GM vehicles will also have Google built in, meaning they’ll come with Google features like Maps, Assistant, Play, and personalized suggestions.With the software-defined vehicle, cars have the potential to become your living room on wheels. But how will automakers balance cool tech offerings with distracting feature bloat? How much is improving our lives (like Dolby’s sound system), and how much is just frustrating (like everything controlled by a touchscreen)?This story was corrected to note that the immersive sound is available through Amazon Music.Updated 3 months ago Rebecca Bellan **Your living room on wheels** I just moderated my second panel at SXSW: Engineering Joyrides with Gretchen Effgen (director of global automotive partnerships at Google), Pankaj Kedia (VP of commercial partnerships at Dolby), and Alan Wexler (SVP of strategy and innovation at GM). It was a lively discussion about what in-car entertainment looks like today and what it’ll be in the future, as more cars develop autonomous capabilities. The talk followed some news from the three companies.GM a few days ago announcedthat its electric Cadillac OPTIQ and VISTIQ will feature Dolby Atmos immersive sound, available through Amazon Music. It’s the start of a larger rollout of Dolby’s system as a standard feature in certain 2025 and 2026 Cadillac models, and will be available across Cadillac’s entire 2026 EV lineup. The Optiq and other GM vehicles will also have Google built in, meaning they’ll come with Google features like Maps, Assistant, Play, and personalized suggestions. With the software-defined vehicle, cars have the potential to become your living room on wheels. But how will automakers balance cool tech offerings with distracting feature bloat? How much is improving our lives (like Dolby’s sound system), and how much is just frustrating (like everything controlled by a touchscreen)? This story was corrected to note that the immersive sound is available through Amazon Music. Rebecca Bellan **Your living room on wheels** I just moderated my second panel at SXSW: Engineering Joyrides with Gretchen Effgen (director of global automotive partnerships at Google), Pankaj Kedia (VP of commercial partnerships at Dolby), and Alan Wexler (SVP of strategy and innovation at GM). It was a lively discussion about what in-car entertainment looks like today and what it’ll be in the future, as more cars develop autonomous capabilities. The talk followed some news from the three companies.GM a few days ago announcedthat its electric Cadillac OPTIQ and VISTIQ will feature Dolby Atmos immersive sound, available through Amazon Music. It’s the start of a larger rollout of Dolby’s system as a standard feature in certain 2025 and 2026 Cadillac models, and will be available across Cadillac’s entire 2026 EV lineup. The Optiq and other GM vehicles will also have Google built in, meaning they’ll come with Google features like Maps, Assistant, Play, and personalized suggestions. With the software-defined vehicle, cars have the potential to become your living room on wheels. But how will automakers balance cool tech offerings with distracting feature bloat? How much is improving our lives (like Dolby’s sound system), and how much is just frustrating (like everything controlled by a touchscreen)? This story was corrected to note that the immersive sound is available through Amazon Music. Mar 12, 2025Sarah PerezCharina Chou, COO of Google Quantum AI, on the need for government investment in quantum computingCharina Chou, COO ofGoogle Quantum AI, argued for government investment in the quantum computing market, arguing that no company could develop the technology successfully on its own.“The transistor … was funded by U.S. government fundamental research investments in science,” Chou explained whilespeakingat the SXSW conference in Austin on Wednesday.“That is what has given rise even to a lot of the advances we have in quantum computing today — it’s all based on basic science … No one company is going to do this on their own. No one team can do it on their own. You’ve got to have a whole community of researchers. And government investment in this is critical,” she said.In addition, Chou pointed out that China is currently outspending the U.S. two to one on quantum research. Not only would that mean the U.S. could fall behind in critical areas, but there’s also the potential that quantum computing could break the encryption that today protects secure communications.“It’s important to note that that’s expected to take a computer that is one or two orders of magnitude more powerful than that would be required for chemistry materials, so it is farther down the road, but you can imagine that has massive national security implications,” Chou said. “And you would want the U.S. to have that capability.”Chou also talked about the broader potential for quantum computing, the types of problems it could solve, and other mysteries and misunderstandings about the technology.She pointed to possibilities like cancer drug testing, creating a mathematical model of a cell; breaking encryption; building better batteries and solar cells; helping solve the climate crises; optimizing anything from shipping routes to investments, fusion energy, more efficient energy use, and more.“If you took home just one message, it would be that quantum computers are capable of solving problems that are impossible for AI or supercomputers,” Chou said.Updated 3 months ago Sarah Perez **Charina Chou, COO of Google Quantum AI, on the need for government investment in quantum computing** Charina Chou, COO ofGoogle Quantum AI, argued for government investment in the quantum computing market, arguing that no company could develop the technology successfully on its own. “The transistor … was funded by U.S. government fundamental research investments in science,” Chou explained whilespeakingat the SXSW conference in Austin on Wednesday. “That is what has given rise even to a lot of the advances we have in quantum computing today — it’s all based on basic science … No one company is going to do this on their own. No one team can do it on their own. You’ve got to have a whole community of researchers. And government investment in this is critical,” she said. In addition, Chou pointed out that China is currently outspending the U.S. two to one on quantum research. Not only would that mean the U.S. could fall behind in critical areas, but there’s also the potential that quantum computing could break the encryption that today protects secure communications. “It’s important to note that that’s expected to take a computer that is one or two orders of magnitude more powerful than that would be required for chemistry materials, so it is farther down the road, but you can imagine that has massive national security implications,” Chou said. “And you would want the U.S. to have that capability.” Chou also talked about the broader potential for quantum computing, the types of problems it could solve, and other mysteries and misunderstandings about the technology. She pointed to possibilities like cancer drug testing, creating a mathematical model of a cell; breaking encryption; building better batteries and solar cells; helping solve the climate crises; optimizing anything from shipping routes to investments, fusion energy, more efficient energy use, and more. “If you took home just one message, it would be that quantum computers are capable of solving problems that are impossible for AI or supercomputers,” Chou said. Sarah Perez **Charina Chou, COO of Google Quantum AI, on the need for government investment in quantum computing** Charina Chou, COO ofGoogle Quantum AI, argued for government investment in the quantum computing market, arguing that no company could develop the technology successfully on its own. “The transistor … was funded by U.S. government fundamental research investments in science,” Chou explained whilespeakingat the SXSW conference in Austin on Wednesday. “That is what has given rise even to a lot of the advances we have in quantum computing today — it’s all based on basic science … No one company is going to do this on their own. No one team can do it on their own. You’ve got to have a whole community of researchers. And government investment in this is critical,” she said. In addition, Chou pointed out that China is currently outspending the U.S. two to one on quantum research. Not only would that mean the U.S. could fall behind in critical areas, but there’s also the potential that quantum computing could break the encryption that today protects secure communications. “It’s important to note that that’s expected to take a computer that is one or two orders of magnitude more powerful than that would be required for chemistry materials, so it is farther down the road, but you can imagine that has massive national security implications,” Chou said. “And you would want the U.S. to have that capability.” Chou also talked about the broader potential for quantum computing, the types of problems it could solve, and other mysteries and misunderstandings about the technology. She pointed to possibilities like cancer drug testing, creating a mathematical model of a cell; breaking encryption; building better batteries and solar cells; helping solve the climate crises; optimizing anything from shipping routes to investments, fusion energy, more efficient energy use, and more. “If you took home just one message, it would be that quantum computers are capable of solving problems that are impossible for AI or supercomputers,” Chou said. Mar 12, 2025Kirsten KorosecIreland’s Taoiseach Micheál Martin from SXSW to DCImage Credits:Kirsten KorosecIreland’sTaoiseach(prime minister) Micheál Martin made a splash at SXSW with an onstage interview and a visit toIreland House— an activation organized by Enterprise Ireland, IDA Ireland, the Department of Foreign Affairs, and the national agency for Irish film Fís Éireann.I happened to be at Ireland House and interviewing Enterprise Ireland’s new CEO Kevin Sherry, when the Taoiseach came to meet with startup founders and folks in the film industry.His SXSW stop is part of a whirlwind tour that includes a visit to the White House. This morning, the Taoiseach attended a St. Patrick’s Day breakfast at Vice President J.D. Vance’s residence and is expected to meet with President Trump.The tour comes at a critical time for Ireland, a small country of about 5 million people that ranks sixth globally for foreign direct investment in the United States.Taoiseach Martin spoke about the economic relationship between the U.S. and Ireland while onstage at SXSW; it’s a relationship that could be affected by the reciprocal trade tariffs that the Trump administration is directing toward the EU, of which Ireland is a member.The Taoiseach’s stopover at Ireland House focused on founders and film, not politics. And many of those founders are connected to Enterprise Ireland, a government agency that supports the development of Irish-owned companies into new markets, including the U.S. Enterprise Ireland is no slouch either. Sherry told me the agency has a fund that invests in between 150 and 180 early-stage startups each year.Updated 3 months ago Kirsten Korosec **Ireland’s Taoiseach Micheál Martin from SXSW to DC** Ireland’sTaoiseach(prime minister) Micheál Martin made a splash at SXSW with an onstage interview and a visit toIreland House— an activation organized by Enterprise Ireland, IDA Ireland, the Department of Foreign Affairs, and the national agency for Irish film Fís Éireann. I happened to be at Ireland House and interviewing Enterprise Ireland’s new CEO Kevin Sherry, when the Taoiseach came to meet with startup founders and folks in the film industry. His SXSW stop is part of a whirlwind tour that includes a visit to the White House. This morning, the Taoiseach attended a St. Patrick’s Day breakfast at Vice President J.D. Vance’s residence and is expected to meet with President Trump. The tour comes at a critical time for Ireland, a small country of about 5 million people that ranks sixth globally for foreign direct investment in the United States. Taoiseach Martin spoke about the economic relationship between the U.S. and Ireland while onstage at SXSW; it’s a relationship that could be affected by the reciprocal trade tariffs that the Trump administration is directing toward the EU, of which Ireland is a member. The Taoiseach’s stopover at Ireland House focused on founders and film, not politics. And many of those founders are connected to Enterprise Ireland, a government agency that supports the development of Irish-owned companies into new markets, including the U.S. Enterprise Ireland is no slouch either. Sherry told me the agency has a fund that invests in between 150 and 180 early-stage startups each year. Kirsten Korosec **Ireland’s Taoiseach Micheál Martin from SXSW to DC** Ireland’sTaoiseach(prime minister) Micheál Martin made a splash at SXSW with an onstage interview and a visit toIreland House— an activation organized by Enterprise Ireland, IDA Ireland, the Department of Foreign Affairs, and the national agency for Irish film Fís Éireann. I happened to be at Ireland House and interviewing Enterprise Ireland’s new CEO Kevin Sherry, when the Taoiseach came to meet with startup founders and folks in the film industry. His SXSW stop is part of a whirlwind tour that includes a visit to the White House. This morning, the Taoiseach attended a St. Patrick’s Day breakfast at Vice President J.D. Vance’s residence and is expected to meet with President Trump. The tour comes at a critical time for Ireland, a small country of about 5 million people that ranks sixth globally for foreign direct investment in the United States. Taoiseach Martin spoke about the economic relationship between the U.S. and Ireland while onstage at SXSW; it’s a relationship that could be affected by the reciprocal trade tariffs that the Trump administration is directing toward the EU, of which Ireland is a member. The Taoiseach’s stopover at Ireland House focused on founders and film, not politics. And many of those founders are connected to Enterprise Ireland, a government agency that supports the development of Irish-owned companies into new markets, including the U.S. Enterprise Ireland is no slouch either. Sherry told me the agency has a fund that invests in between 150 and 180 early-stage startups each year. Topics From seed to Series C and beyond—founders and VCs of all stages are heading to Boston. Be part of the conversation. Save $200+ now and tap into powerful takeaways, peer insights, and game-changing connections. **Most Popular** OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning modelKyle Wiggers **OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model** OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model Kyle Wiggers **OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model** OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model OpenAI releases o3-pro, a souped-up version of its o3 AI reasoning model Kyle Wiggers WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and moreLauren ForristalSarah Perez **WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and more** WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and more Lauren Forristal Sarah Perez **WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and more** WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and more WWDC 2025: Everything announced, including Liquid Glass, Apple Intelligence updates, and more Lauren Forristal Sarah Perez Major US grocery distributor warns of disruption after cyberattackZack Whittaker **Major US grocery distributor warns of disruption after cyberattack** Major US grocery distributor warns of disruption after cyberattack Zack Whittaker **Major US grocery distributor warns of disruption after cyberattack** Major US grocery distributor warns of disruption after cyberattack Major US grocery distributor warns of disruption after cyberattack Zack Whittaker Anthropic’s AI-generated blog dies an early deathKyle Wiggers **Anthropic’s AI-generated blog dies an early death** Anthropic’s AI-generated blog dies an early death Kyle Wiggers **Anthropic’s AI-generated blog dies an early death** Anthropic’s AI-generated blog dies an early death Anthropic’s AI-generated blog dies an early death Kyle Wiggers Superblocks CEO: How to find a unicorn idea by studying AI system promptsJulie Bort **Superblocks CEO: How to find a unicorn idea by studying AI system prompts** Superblocks CEO: How to find a unicorn idea by studying AI system prompts Julie Bort **Superblocks CEO: How to find a unicorn idea by studying AI system prompts** Superblocks CEO: How to find a unicorn idea by studying AI system prompts Superblocks CEO: How to find a unicorn idea by studying AI system prompts Julie Bort Jony Ive’s LoveFrom helped design Rivian’s first electric bikeKirsten KorosecSean O'Kane **Jony Ive’s LoveFrom helped design Rivian’s first electric bike** Jony Ive’s LoveFrom helped design Rivian’s first electric bike Kirsten Korosec Sean O'Kane **Jony Ive’s LoveFrom helped design Rivian’s first electric bike** Jony Ive’s LoveFrom helped design Rivian’s first electric bike Jony Ive’s LoveFrom helped design Rivian’s first electric bike Kirsten Korosec Sean O'Kane Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’Maxwell Zeff **Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’** Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’ Maxwell Zeff **Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’** Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’ Anthropic co-founder on cutting access to Windsurf: ‘It would be odd for us to sell Claude to OpenAI’ Maxwell Zeff X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Code of Conduct WWDC 2025 Whole Foods Snap AR Glasses Mistral Liquid Glass Tech Layoffs ChatGPT © 2025 TechCrunch Media LLC."}