{"id": 1902, "name": "C2C Journal", "domain": "c2cjournal.ca", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://c2cjournal.ca/2025/04/freedom-of-expression-should-win-every-time-in-conversation-with-freedom-convoy-trial-lawyer-lawrence-greenspon/", "title": "Freedom Of Expression Should Win Every Time In Conversation With Freedom Convoy Trial Lawyer Lawrence Greenspon", "content": "AboutOur StoryCurrent AuthorsAll AuthorsSubmissionsContact Us Our Story Current Authors All Authors Submissions Contact Us Our Story Current Authors All Authors Submissions Contact Us StoriesA Man for All Times: Reassessing John DiefenbakerJohn WeissenbergerRead NowAll StoriesNarrationsCanadaCanadian PoliticsInternationalPoliticsCulture & MediaBooksClimate & EnvironmentEconomyCurrent AuthorsAll AuthorsArchives by Year **A Man for All Times: Reassessing John Diefenbaker** All Stories Narrations Canada Canadian Politics International Politics Culture & Media Books Climate & Environment Economy Current Authors All Authors Archives by Year **A Man for All Times: Reassessing John Diefenbaker** All Stories Narrations Canada Canadian Politics International Politics Culture & Media Books Climate & Environment Economy Current Authors All Authors Archives by Year Global NewsstandAnywherecould become the next Pearl HarborRead NowNEWGlobal Warming “Hockey Stick” Inventor Gets a Just RewardHave You Tried Beating them until Morale Improves?Data-Driven Civic GovernanceTwo-Tier Keir and Con Carney: The Common ElementIf You Want Peace, Prepare for War“Kill the Boer”All Global Newsstand **Anywherecould become the next Pearl Harbor** **NEW** **Global Warming “Hockey Stick” Inventor Gets a Just Reward** **Have You Tried Beating them until Morale Improves?** **Data-Driven Civic Governance** **Two-Tier Keir and Con Carney: The Common Element** **If You Want Peace, Prepare for War** **“Kill the Boer”** All Global Newsstand **Anywherecould become the next Pearl Harbor** **NEW** **Global Warming “Hockey Stick” Inventor Gets a Just Reward** **Have You Tried Beating them until Morale Improves?** **Data-Driven Civic Governance** **Two-Tier Keir and Con Carney: The Common Element** **If You Want Peace, Prepare for War** **“Kill the Boer”** All Global Newsstand VideosHow Modern Warfare WorksWatch NowNEWWho is Wali?Dispatches from the Front: A Canadian Volunteer in UkraineHard Facts Puncture Inflated Anti-Fossil-Fuel FantasiesUnder the Gun in ArmeniaDivestment Won’t Stop Fossil Fuels – Nor Should ItThe Sticky Facts On Soda Taxes: Why They Don’t Work (And No One Likes Them)All Videos **How Modern Warfare Works** **NEW** **Who is Wali?** **Dispatches from the Front: A Canadian Volunteer in Ukraine** **Hard Facts Puncture Inflated Anti-Fossil-Fuel Fantasies** **Under the Gun in Armenia** **Divestment Won’t Stop Fossil Fuels – Nor Should It** **The Sticky Facts On Soda Taxes: Why They Don’t Work (And No One Likes Them)** All Videos **How Modern Warfare Works** **NEW** **Who is Wali?** **Dispatches from the Front: A Canadian Volunteer in Ukraine** **Hard Facts Puncture Inflated Anti-Fossil-Fuel Fantasies** **Under the Gun in Armenia** **Divestment Won’t Stop Fossil Fuels – Nor Should It** **The Sticky Facts On Soda Taxes: Why They Don’t Work (And No One Likes Them)** All Videos Authors on AirNEWThe Bathroom Debate: Peter Shawn Taylor on the Andrew Shultz ShowA Pandemic Caused by Science?Confronting the Post-Academic University: In Conversation with Mark MercerExtortion, Dependency and Media Welfare: The Liberals’ Bill C-18Better Make it a Double: New Anti-Drinking Guidelines Seek Abstinence Through FearAll Authors On AirNEWUntitled-1Former Canadian Army Colonel Lays Out a Path to Rebuilding the CAFRetired Colonel Gives BRUTALLY HONEST Assessment of Government Treatment of Canada’s Armed ForcesCarbon dioxide is NOT WARMING the planet, Jim Mason on True NorthDo the Indigenous ‘Land Back’ activists HATE Canada? True NorthToxic Masculinity on Counterpoint **NEW** **The Bathroom Debate: Peter Shawn Taylor on the Andrew Shultz Show** **A Pandemic Caused by Science?** **Confronting the Post-Academic University: In Conversation with Mark Mercer** **Extortion, Dependency and Media Welfare: The Liberals’ Bill C-18** **Better Make it a Double: New Anti-Drinking Guidelines Seek Abstinence Through Fear** All Authors On Air **NEW** **Former Canadian Army Colonel Lays Out a Path to Rebuilding the CAF** **Retired Colonel Gives BRUTALLY HONEST Assessment of Government Treatment of Canada’s Armed Forces** **Carbon dioxide is NOT WARMING the planet, Jim Mason on True North** **Do the Indigenous ‘Land Back’ activists HATE Canada? True North** **Toxic Masculinity on Counterpoint** **NEW** **The Bathroom Debate: Peter Shawn Taylor on the Andrew Shultz Show** **A Pandemic Caused by Science?** **Confronting the Post-Academic University: In Conversation with Mark Mercer** **Extortion, Dependency and Media Welfare: The Liberals’ Bill C-18** **Better Make it a Double: New Anti-Drinking Guidelines Seek Abstinence Through Fear** All Authors On Air **NEW** **Former Canadian Army Colonel Lays Out a Path to Rebuilding the CAF** **Retired Colonel Gives BRUTALLY HONEST Assessment of Government Treatment of Canada’s Armed Forces** **Carbon dioxide is NOT WARMING the planet, Jim Mason on True North** **Do the Indigenous ‘Land Back’ activists HATE Canada? True North** **Toxic Masculinity on Counterpoint** Home AboutOur StoryCurrent AuthorsAll AuthorsSubmissionsContact Our Story Current Authors All Authors Submissions Contact Our Story Current Authors All Authors Submissions Contact StoriesCanadianInternationalPoliticsCulture & MediaBooksClimate & EnvironmentEconomyAuthors Canadian International Politics Culture & Media Books Climate & Environment Economy Authors Canadian International Politics Culture & Media Books Climate & Environment Economy Authors Global Newsstand Videos Authors on Air Donate Subscribe Home AboutOur StoryCurrent AuthorsAll AuthorsSubmissionsContact Our Story Current Authors All Authors Submissions Contact Our Story Current Authors All Authors Submissions Contact StoriesCanadianInternationalPoliticsCulture & MediaBooksClimate & EnvironmentEconomyAuthors Canadian International Politics Culture & Media Books Climate & Environment Economy Authors Canadian International Politics Culture & Media Books Climate & Environment Economy Authors Global Newsstand Videos Authors on Air Donate Subscribe **“Freedom of Expression Should Win Every Time”: In Conversation with Freedom Convoy Trial Lawyer Lawrence Greenspon** **“Freedom of Expression Should Win Every Time”: In Conversation with Freedom Convoy Trial Lawyer Lawrence Greenspon** Law is an imperfect profession,” famed American lawyer Alan Dershowitz – defender of such notorious clients as Claus Von Bülow, Jeffrey Epstein, Harvey Weinstein and O.J. Simpson – wrote in his 2005 bookLetters to a Young Lawyer. “There is no perfect justice…But there is perfect injustice, and we know it when we see it.” Like Dershowitz, Lawrence Greenspon has spent a career fighting to ensure his clients are protected against injustice in all its forms, perfect or otherwise. Over the past 45 years Greenspon has become one of Canada’s best-known criminal defence lawyers in defending a long list of clients at risk of being crushed by Canada’s legal system, including terrorists, alleged wife-beaters, political fat-cats and assorted other scoundrels, outcasts and no-hopers. Dershowitz once said his “main criteria for taking a case is that nobody else will take it.” The same seems to apply to Greenspon. Most recently Greenspon has been front and centre defending Freedom Convoy co-organizer Tamara Lich – whose arrest in February 2022 amidst the Justin Trudeau government’s use of theEmergencies Actto put down the truckers’ protest and subsequent lengthy incarceration while awaiting bail elevated the petite grandmother into something like a national martyr for free speech – and whose criminal trial on six charges concluded earlier this month with a single guilty verdict for mischief. (Fellow convoy organizer and co-accused Chris Barber was convicted of two counts.) But unlike with many of his other clients,when Greenspon announced he was taking on her case in 2022, he was drawn not by what she was alleged tohavedone but by what shedidn’tdo. “Tamara Lich has no criminal record,” Greenspon said at the time he took the case. “She’s charged withCriminal Codecrimes that involve no violence, no weapons, or anything of that nature.” Even the judge who granted Lich bail noted that she’d lived a “pro-social life” up to the time of the convoy. (An insightful look at the many other peaceful convoy participants can be found in the recent bookThank You, Truckers! Canada’s Heroes & Those Who Helped Themby veteran journalist Donna Laframboise.) The case against Lich, Greenspon’s courtroom strategy and the manner in which the state has already punished her were covered in an earlier two-partC2Cseries, which can be readhereandhere. Born and raised in Montreal, Greenspon graduated from the University of Ottawa law school in 1980. Rare among his peers, Greenspon is certified as an expert by the Law Society of Ontario (LSO) in both criminal defence and civil litigation, a mark of his versatility and ambition. “I represent the little guy in personal injury and other actions against the insurance companies, banks, government or the police,” reads his official LSO profile. Now 70, he has appeared before the Supreme Court more than a dozen times. He is also deeply involved in correcting the errors of the court, both current and historical. In 2002, for example, he led an effort toexonerate James Patrick Whalen, who was executed in 1869 for the assassination of Father of Confederation Thomas D’Arcy McGee, in what was Canada’s last public hanging. The modern-day exoneration effort led to a symbolic reburial of Whelan, whose trial Greenspon calls “Canada’s first wrongful conviction.” In 2008, Greenspon gained national prominence for his energetic defence of Mohammad Momin Khawaja, the first person ever charged under Canada’s post-9/11Anti-Terrorism Act. Khawaja was working at the Department of Foreign Affairs when he was arrested in March 2004 and ultimately charged with seven counts related to terrorism. Early in the trial, it was established his Ottawa home was filled with weapons, ammunition, electronics, cash and books about terrorism. There was even a target punctured by pellets on a wall scarred by missed rounds. It was also revealed that Khawaja had travelled to Pakistan several times to learn bomb-building and other jihadi techniques. Among his offences was the construction of a detonator intended to be used in England in an Al Qaeda bomb plot that was broken up by Britain’s MI5 security service. The five men caught in Britain as part of this plot were jailed for life. In short, there was never any doubt about the evidence stacked against Khawaja. The Supreme Court ruled that “the facts underlying the offences were largely undisputed. Voluminous email correspondence attested in graphic detail to the appellant’s ideological commitment to violent ‘jihad’ and to his acts in Canada and elsewhere to further jihad-inspired terrorist activities.” Greenspon nonetheless tenaciously defended Khawaja on constitutional grounds, arguing that he had only become a focus for investigators because of his religion and political beliefs, and that the prosecutors single-mindedly intended to make an example of him, all the while ignoring his brother, who lived in the same house and also had terrorist material in his bedroom. Greenspon zeroed in on the legal definition of “terrorist activity”, arguing that theAnti-Terrorism Act’swording put free speech itself at risk. On this ground, he argued at the initial trial that the law’s controversial “motive clause” was unconstitutional. The requirement that the Crown had to verify terrorist behaviour was carried out for political, religious or ideological reasons, Greenspon claimed, encroached on Khawaja’s right to express political and religious views, and “will have a chilling effect” on the free-speech rights of anyone with controversial opinions. While the trial judge accepted this argument, it was rejected by the Ontario Court of Appeal as well as the Supreme Court of Canada; in the end, Khawaja received a life sentence. In 2018 Greenspon represented Joshua Boyle, who faced over a dozen criminal charges shortly after he and his family returned from Afghanistan. The alleged offences – including uttering threats, administering a noxious substance, assault and unlawful confinement – were against his wife, Caitlan Coleman. In 2012 Boyle and Coleman were travelling through Asia when they somehow ended up in war-ravaged Afghanistan and were kidnapped by the Taliban-connected Haqqani network. Coleman would later claim that, while in captivity, she was raped and had a miscarriage. She made the same allegations against Boyle after their release, including that he tied her up and subjected her to unwanted anal intercourse. Greenspon’s meticulous cross-examination of Coleman led Judge Peter Doody of the Ontario Superior Court of Justice to conclude, “I do not believe her, just as I do not believe Mr. Boyle.” All charges against Boyle were dismissed. Without the work of lawyers such as Greenspon, Charter rights can soon deteriorate into empty platitudes – as the federal government’s shocking treatment of the peaceful Freedom Convoy protesters revealed. Among Greenspon’s less tragic clients was Senator Mike Duffy, who in 2014 found himself charged in connection with an expense account scandal that eventually ensnared numerous other Senators for improper claims. Duffy was acquitted on all 31 charges and later hired Greenspon to sue the Senate and RCMP for nearly $8 million in an effort to recoup his lost salary. Based on the ancient rules of parliamentary privilege, however, the case failed in the Supreme Court, prompting Greenspon to quip, “The ruling effectively means the Senate is above the law.” Throughout his legal career, Greenspon has fought tirelessly for the constitutional rights of all his clients, regardless of public sympathy or apparent guilt. While such a stance is often unpopular, it offers a crucial bulwark against the state’s misuse of its authority in pursuing particular individuals, as well as the gradual erosion of the liberties promised to all Canadians by theCharter of Rights and Freedoms. Accordingly, every Canadian has a stake in ensuring the court system is held to account at all times, regardless of the apparent evidence, current political mood or public support. Without the work of lawyers such as Greenspon,Charterrights can soon deteriorate into empty platitudes – as the federal government’s shocking treatment of the peaceful Freedom Convoy protesters revealed. That included the unjustified imposition of theEmergencies Act, the freezing of donors’ bank accounts, the mass arrest of supporters and the marked reluctance to grant bail to those charged. As Greenspon pointed out numerous times during the Freedom Convoy trial, the conciliatory and always respectful Lich represents the very ideals of peaceful protest in Canada. And yet for the sole charge on which she was convicted, she still faces two years in a federal penitentiary – as Crown prosecutors last week announced they would be requesting. In contrast with his pit-bull demeanor inside the courtroom, outside it Greenspon cultivates an entirely different persona. Without his robes, he is a tireless campaigner for a wide variety of Ottawa charities. This includes being past chair of the Ottawa Jewish Community Centre as well as the United Way Community Services Cabinet. He has received numerous awards for his charitable endeavours, among them a Lifetime Achievement from Volunteer Ottawa and the Community Builder of the Year Award from the United Way in 2008. In 2014, at age 59, he stepped into the ring asa rookie boxerat a charitable event that raises money for cancer research. “I’ve never been punched in the face before,” he said after the bout, which he won. Most recently, Greenspon has supported the construction of theDave Smith Youth Treatment Centre, a residential program for youth suffering from addiction and other mental health problems located in Carp, on the outskirts of Ottawa. It’s an effort driven in part by his long friendship with the late Smith, a well-known Ottawa restaurateur. Much of his charitable work is done in tandem with his wife, marketing executive Angela Lariviere; they constitute a true power couple in a town where power is the main resource. Just days after the verdict was issued in the trial of Lich and Barber, Greenspon sat down withC2C’sLynne Cohen – who articled with Greenspon as a law student in the early 1990s – to talk about the Freedom Convoy trial, his lengthy legal and charitable career and the complicated morality of criminal defence law. C2C Journal: Let’s start with the Tamara Lich verdict, handed down in early April by Ontario Court Justice Heather Perkins-McVey. Was justice served? Lawrence Greenspon: Our focus in the trial was always to get an acquittal on all counts. On five of the six charges, four were not guilty and one charge was stayed. That’s a pretty good batting average. Obviously, we’re not happy about the one mischief verdict, but beyond that I can’t really comment because of a possible appeal, and the fact sentencing has not taken place yet. Once the sentence is imposed then we’ll consider the next step. C2C: What length of sentence are you expecting the Crown to seek? The maximum sentence for mischief is 10 years. LG: Nothing would surprise me with this Crown Attorney’s office. They asked for 10 years for Pat King. What did he get?Ninety days house arrest. From our perspective, that’s excellent.[Editor’s note: subsequent to the interview, it was revealed that the Crown intends to ask for asentence of two yearsfor both Lich and Barber, and also wants to seize and auction Barber’s famous truck, Big Red.] C2C: One unusual aspect of the Crown’s case against Lich was theCarter application, which could have ensnared her in a separate charge faced only by Chris Barber – counselling others to disobey a court order – even when it was clear she did nothing of the kind. Were you pleased that the judge dismissed the Carter application so early in her ruling? LG: We had concerns there because it was clear the Crown was trying to use the words of one defendant against the other. My colleague Eric Granger argued that aspect of the case, and I wouldn’t say we were worried, but we certainly were not very comfortable defending against it. Ultimately, however, the judge dismissed the application and clearly that was the right thing to do. C2C: At its core, what was Lich’s trial about? Freedom of expression? Civil disobedience? The ability of the state to seek retribution against anyone with whom it disagrees? LG: There was a bit of all that. From my perspective, and I believe in this very strongly, Canadians have a constitutionally protected right to freedom of expression and freedom of peaceful assembly. These are fundamental freedoms, and they’re supposed to be protected for all of us. Remember, our [Charter] starts off with the statement that all the rights and freedoms to be listed are subject to ‘such reasonable limits prescribed by law as can be demonstrably justified in a free and democratic society.’ Boom. It’s a hell of a way to begin. That’s what many lawyers refer to as the ‘Mack Truck Clause’. On the other side of the ledger, we were prepared to admit right off the bat that there were individuals who lived in downtown Ottawa who experienced some interference with their enjoyment of their property. We were prepared to admit to mischief in that regard. In fact, we said we would accept their victim impact statements without requiring any of them to testify. But when you put freedom of expression and freedom of peaceful assembly – both constitutionally protected in theCharter– on a scale against interference with somebody’s enjoyment of property, there’s no contest. Freedom of association and peaceful assembly, and freedom of expression – these should win every time. Otherwise, what’s the point of having freedom? Plus, there is no right to enjoyment of property in theCharter. C2C: Why is it so important to constantly fight for these things, if they are listed so clearly in theCharter? LG:Remember, our [Charter] starts off with the statement that all the rights and freedoms to be listed are subject to “such reasonable limits prescribed by law as can be demonstrably justified in a free and democratic society.” Boom. It’s a hell of a way to begin. That’s what many lawyers refer to as the “Mack Truck Clause”. Here is ourCharter of Rights, but, oh by the way, there’s more exclusions than there are inclusions. Compared to the United States’ Constitution we are weaklings. Their [Declaration of Independence] says, “We hold these truths to be self-evident.” C2C: Given the ordeal of her pre-trial treatment, hadn’t Lich already been punished for any transgressions she might have committed, regardless of the final verdict? LG: Look at the time she has already done in prison. A total of 49 days. For a mischief charge! That is more than sufficient. She’s already been penalized and suffered. That’ll be part of our submissions in the sentencing hearing. **How does famous criminal defense attorney Lawrence Greenspon think the Canadian Charter of Rights and Freedoms compares to the U.S. Constitution?** Canadian human rights litigator and criminal defense lawyer Lawrence Greenspon believes Canada’sCharter of Rights and Freedomsis much weaker than the United States Constitution at protecting individual rights. Section 1 of Canada’sCharter, which is part of the country’s constitution, states that all rights and freedoms are subject to “such reasonable limits prescribed by law as can be demonstrably justified in a free and democratic society.” Many human rights lawyers refer to that as the “Mack Truck Clause” because the exceptions and exclusions to fundamental rights are so large one could figuratively drive a truck through them. Compared to the U.S. Constitution, Greenspon says, “we are weaklings.” C2C: Let’s step back and explore the nature of being a defence attorney. Prior to being in the spotlight for the Lich trial, most Canadians probably remember you from the 2008 trial of Momin Khawaja, who was the first person charged under Canada’sAnti-Terrorism Act. At the time, there was little doubt about Khawaja’s guilt in planning a terrorist attack. Why did you take on his case? LG: Each time you take on a case, whether it’s high-profile or not, you come back to the fundamental point that everybody’s entitled to a defence. With Khawaja it was more than that. He was a very articulate guy. I remember going to prison to meet him for a first interview and listening to him tell his story. And the first thing that came across was that he was a very, very bright guy. When he finished speaking, I said, “Look, you need a lawyer who has three things. First thing you need is a lawyer who is very conversant with technology, the internet and computers and all that stuff. That is not me.” At that time, and I told him this, my secretary was downloading all of my emails and printing them off. I would then write a response and she would send it back by email. I was even downloading and printing the spam that was coming in because I didn’t know how to delete it. So, I said to him, “I’m not your techno-guy. I’m your techno-weenie.” The second thing I told him was that you need a lawyer who understands extreme Islam. I said, “I’m Jewish and I don’t have a clue about this stuff.” The third thing he needed was somebody who’s prepared to fight for him. “That’s the only one of the three things that I can actually give you,” I said. At that point, he told me, “Well, I would really like to hire you because what I’m looking for is number three.” So that’s how I came to be his lawyer. My view was that Canada’s new anti-terrorism provisions were way over-the-top and enacted as a kneejerk reaction to 9/11. Our terrorist provisions were even more severe than thePatriot Actin the U.S. So my defence of Khawaja included a constitutional challenge to theAnti-Terrorism Act. At trial, in front of Justice Doug Rutherford – whom most defence lawyers felt was a Crown-oriented judge – he accepted my argument. He agreed with my comments and sentenced my client to 10 years. Where we ran into trouble was at the Court of Appeal, where the judges upped Khawaja’s sentence to 25 years. Then the case went to the Supreme Court and they upheld the Court of Appeal’s ruling, including the constitutionality of the provisions. It was a fascinating case – the first case in Canada where the terrorist provisions were used. I told the synagogue members, somebody has to stand up for the person who finds themselves set against the entire machinery of the state. In this case it happens to be Khawaja. But what if the next guy is named Dreyfus? C2C: Setting aside the constitutional aspects of the case, how did it affect you personally? I have heard you speak about the Holocaust and other matters of Jewish identity and you can be very passionate about these topics. Yet here was an Islamic terrorist who at one point proposed a suicide bombing mission to Israel. How did you reconcile your personal feelings with the actions of your client? LG: I put it on the table right at the beginning. I said to him, “Listen, I don’t know the first thing about Islamist ideology. And I’m Jewish.” And he was more than happy to retain me. I don’t know if it’s any comfort or not, but Khawaja did not acceptanybodywho wasn’t an extremist Muslim. For him, it wasn’t just the Jews. It was everyone, Catholics, Protestants, Jews, Hindus. Even non-extremist Muslims. To Khawaja, we are all non-believers,kafirsis the term, and hated equally. But that said, my interest in his case was much more about a constitutional challenge to what I thought were overly broad anti-terrorism provisions. I was far less concerned about the fact that he didn’t like anybody who wasn’t like him. C2C: What was the reaction from within the Jewish community? LG: I was actually invited to a synagogue to speak about the case. I wouldn’t say they wanted me to justify what I was doing, but perhaps understand why I was representing Khawaja. I told them that as Jews, we should know better than anybody else the significance of the famous poem by [Nazi-era German Lutheran pastor] Martin Niemöller. He wrote, “First they came for the communists, and I didn’t speak out because I wasn’t a communist.” Then they came for the trade unionists etc., and in the end there was no one left to speak out. I told the synagogue members, somebody has to stand up for the person who finds themselves set against the entire machinery of the state. In this case it happens to be Khawaja. But what if the next guy is named Dreyfus? There has got to be somebody to stand up for that person and make sure the proper process is carried out before their liberty is taken away. I didn’t have a problem representing Khawaja. And the people at the synagogue were very understanding. At the end of the day, they understood why I was doing it. C2C: Khawaja is certainly not your only client who has lacked public sympathy. You’ve also defended Joshua Boyle, Mike Duffy and many others. Is there a common theme to the cases you choose to take on? LG:I’ve been at this for 45 years now, and so I have the luxury and the privilege of taking only the cases I want to take. I ask myself: do I believe in the cause? What’s at stake here? And can I make a difference? In the case of Mike Duffy, here was somebody whose reputation had been forever tarnished. And if you read the decision, it was a complete exoneration. It wasn’t, “Oh it wasn’t proven beyond a reasonable doubt.” No. The judge went so far as to say they had the wrong person in the box. It should have been somebody from the Prime Minister’s Office, or someone else from the Senate. Duffy’s presumption of innocence had been completely annihilated. I had no problem representing Mike. In fact, I feel proud to have represented Mike. Boyle was another case of a very, very smart guy in a crazy situation. I genuinely didn’t believe – nor did the judge ultimately – what the complainant was saying about him. The judge decided that he couldn’t believe either one, so he had to acquit. Whether someone is seen as a pariah, either in the criminal courts or, as in Duffy’s case, the court of public opinion, doesn’t bother me one way or the other. I’m far more interested in their case and their cause, rather than how they’re perceived by others. There are going to be fans, and there are going to be haters. We got our share of fan mail and hate mail in Tamara’s case, just as we did with Khawaja’s case. It comes with the territory. C2C: What motivated you to take on Tamara Lich as a client? LG: Tamara is such a delightful human being, a complete sweetheart. There, I was very interested in advancing the arguments of freedom of peaceful assembly. I was convinced that she was the perfect client to be part of this sort of human rights litigation. And she represented the cause very well. In the case of Khawaja, it wouldn’t have mattered who was charged with the first crime of terrorism under the new act. But in this case, it did matter. Everything she said was designed to make you love her. And she was not afraid. She believes in it and she lives it. I had no problems taking her on. And aside from being a wonderful person, she’s been a terrific client. As a child of a [Holocaust] survivor, I am very aware of the issues at stake with her case. It is something I grew up with. I remember when I was nine or 10 years old and I was marching with my stepfather and all these other survivors in Montreal in the Survivors of Nazi Oppression March. So, when you talk about the right of peaceful assembly, it hits very close to home. I do what I do largely because he taught me the importance of standing up for the individual and for people and groups of people against the power of the state and what happens when you don’t. There’s a reluctance on the part of criminal defence lawyers to do civil work, and there’s an understandable fear on the part of civil litigators to dabble in the criminal courts. But for me, the two just go together. C2C: You have a somewhat unusual practice in that you are certified by the Law Society of Ontario as an expert in both criminal and civil law.Your online profilesays you “represent the little guy in personal injury and other actions against the insurance companies, the banks, government, or the police. The other part of my practice is criminal defence.” Why specialize in these two very different areas of the law? LG: For me, working in criminal defence using theCharterand in the civil and federal courts using administrative law are both part of the same thing – advancing human rights. Criminal and civil court are just two different venues where we can challenge the powerful, challenge the system and challenge the government. There’s a reluctance on the part of criminal defence lawyers to do civil work, and there’s an understandable fear on the part of civil litigators to dabble in the criminal courts. But for me, the two just go together. My early heroes were American trial lawyers such as F. Lee Bailey, Melvin Belli and Clarence Darrow. They all did civil and criminal law. In fact, I got to meet Belli and Bailey in the early 1980s at a trial lawyers’ conference in Montreal. American trial lawyers have no problem combining plaintiff civil litigation with criminal defence. But here in Ontario, there’s only one other lawyer who is certified by the LSO in both, and he’s in Barrie. I think the headspace is very similar for both types of litigation. It’s the little guy against the system, whether it’s the Crown or the police or the insurance company or whatever. We take on a lot of civil cases against the police for false arrest, false imprisonment, breach of Charter rights and negligent investigation. You can assume the police will be well-funded by tax dollars and so they’re tough cases. But we take them on and we’ve had a fair bit of success over the years. We usually take those cases on a contingency basis, which means we put up all the disbursements as well as the legal fees. A lot of work goes into screening because we can carry them for two, three, four, maybe five years until the matter either gets settled or goes to civil trial. We do all kinds of criminal work, which these days is primarily sexual assaults, domestic assaults and drugs. Even impaired driving charges are a big part of our work. I’ll say it again: I really believe that everybody’s entitled to a good defence. It’s a constitutional right. It’s an ancient right. We do the best we can on behalf of people who are entitled to legal defence. **What did famous human rights litigator and criminal defense lawyer Lawrence Greenspon believe was at stake in the Tamara Lich Freedom Convoy trial?** Lawrence Greenspon says the trial of Freedom Convoy organizers Tamara Lich (whom Greenspon represented) and Chris Barber was principally about defending the constitutionally-protected rights to freedom of expression and peaceful assembly. Greenspon admits that some individuals living in downtown Ottawa experienced some interference with the enjoyment of their property during the Freedom Convoy protests on Parliament Hill in Ottawa in February 2022. But, he argues, in any contest between freedom of expression/peaceful assembly – both of which are explicitly protected by theCanadian Charter of Rights and Freedoms– and freedom from interference with enjoyment of property (a common-law right which is not mentioned in theCharter), the first two rights should win every time. C2C: Alan Dershowitz, the famous American trial lawyer and legal scholar, has a list of rules for what he calls “the Justice Game”. Rule I is, “Most criminal defendants are, in fact, guilty.” Rule II is, “All criminal defense lawyers, prosecutors and judges understand and believe Rule I.” Do you agree? LG: As soon as somebody finds out you’re a lawyer, or even a law student, the first question they’ll ask is, “How do you defend somebody who you know is guilty?” My response is always, “How do you know?” Most times, you don’t really know if the defendant is guilty, so I don’t agree with Dershowitz there. The accused will tell you one story. You’ll get another story in the disclosure. Another story from the police. Then another story comes out in the trial. In other words, most times you actually don’t know. If you truly do know, what you do is you end up pleading guilty and trying to get the best sentence possible. That’s called doing your job. The question people don’t ask is: “How does it feel when you’re defending somebody you believe isinnocent?” Those are the toughest cases. There was one I did in 1994 involving a young woman, D.H. She was 18 but looked about 14. She was a babysitter charged with manslaughter in the death of the child she was watching. You might remember the case, Lynne, as you were working for me at the time. She called 911 to say the baby was in crisis, and ended up being arrested. I spent a month reading everything ever written on Shaken Baby Syndrome. And then I defended her in a judge-alone trial and she was acquitted. If she had spent one minute in jail, it would’ve been a travesty of justice. The cases where I believe my client is innocent, that’s where the real pressure is. That’s when you lose sleep. **What is the latest Freedom Convoy update on Tamara Lich’s trial?** Freedom Convoy co-organizer Tamara Lich was found guilty on April 3, 2025 in the Ontario Court of Justice in Ottawa of one charge of mischief, and acquitted on four others (a sixth charge was stayed). The prosecution (called the “Crown” in Canada) is asking for a sentence of two years. This is a much greater punishment than is normal for a mischief conviction in Canada, and is just long enough so that Lich would have to serve her sentence in a federal penitentiary. Sentencing has not yet taken place, but Lich’s lawyer, Lawrence Greenspon, indicated that the verdict may be appealed. Greenspon also noted that Lich has already served 49 days in jail while awaiting bail before her trial, which he argues is more than enough punishment. C2C: I certainly do remember that case. In particular, I remember the look on her face when the judge read the verdict. Do you? LG: I remember that look as well, and I remember celebrating at the acquittal party back at her parents’ home afterwards. You’ve simply got to win cases like that. And I think the majority of the time defence lawyers are successful in getting an innocent client acquitted. I’ve worked with the Association in Defence of the Wrongly Convicted for a long time because I believe the conviction of an innocent person is the ultimate travesty of justice. I have a signed picture of Rubin “Hurricane” Carter on my wall. At one point, Rubin was staying in my house. But he was in the basement because the guest room upstairs was occupied by Joyce Milgaard[Editor’s note: the mother of David Milgaard, who was wrongfully convicted in 1970 for a rape-murder in Saskatchewan, serving 23 years in prison]who was lobbying Prime Minister Jean Chrétien to get compensation for her son. So, we were basically running a house for the wrongly convicted at that point. C2C: What aboutpro bonowork? Does a high-profile lawyer like yourself take on clients for free? LG: We do a lot ofpro bonowork. My office manager will tell you I do too much. This morning, in fact, I was on a long call representing a number of survivors of the October 7th massacre and their families. We have brought an application for judicial review to challenge the federal government’s decision to reinstate funding to the United Nations Relief and Works Agency for Palestine Refugees in the Middle East (UNRWA). The initial decision to stop the funding was made because a number of UNRWA employees took part in the massacre. Some UNRWA employees were actually members of Hamas. Our position is that thedecision to reinstate fundingis wrong. The money that’s been coming from Canada and other countries to UNRWA has been funnelled to Hamas and not to the people of Gaza who need it. So reinstating the funding is unreasonable. This whole case is being donepro bono. They want to bring leaders from the non-Jewish community to Israel. We have someone from the Vietnamese community, someone from the Chinese community, the Black community, the Italian community and so on. They want me to take them to Israel. I said, ‘I’m in!’ C2C: You are also well-known throughout Ottawa for your charitable work outside the courtroom. Why take on these sorts of challenges as well? LG: My dad was very involved in the community, the Jewish community and otherwise. I believe that getting involved in the community is personally beneficial. You actually get more by giving. Everybody talks about giving back and that kind of stuff, and that’s fine. But when you get involved in the community, first, you’re going to meet new people. Second, you are necessarily going to act outside your comfort zone. The creative box is much larger. It feels good to be working outside your profession. I’ve always felt that I get way more back by being involved in the community than what I give. And it’s a lot of fun. I’m sure I’ve done over a thousand charity auctions in the last 40 years. And I’ve enjoyed all of them. My wife Angela Lariviere and I used to do about 40 events a year pre-Covid. When Covid hit, all of a sudden there were no events. Now, we’re back up to doing about 10 or 12 a year. C2C: Any parallels between your legal efforts and charitable work? How do you pick the charities to get involved with? LG: They pick me. And once they pick me, I stick. I’ve been helping theSnowsuit Fundfor 25 years. With theDave Smith Youth Treatment Centre, Angela and I agreed to co-chair the campaign to raise the money to finish up the rebuild. It is done now, and it’s fabulous. It’s an incredible building. It can accommodate 15 young men and 15 young women. They are in-residence for three months and then the organization follows up with them for three months afterwards. It’s a fantastic place that is turning lives around. I’ve also been approached to get involved in leading a mission to Israel. The organizers want to bring leaders from the non-Jewish community to Israel. We have someone from the Vietnamese community, someone from the Chinese community, the Black community, the Italian community and so on. They want me to take them to Israel. I said, “I’m in!” C2C:You certainly have a very busy schedule. Thanks for spending this time withC2C Journal, and also for your commitment to protecting the fundamental freedoms of Canada’s vulnerable citizens. This interview was edited for length and clarity. Lynne Cohen is a non-practicing lawyer based in Ottawa. She has published four books, including the biographyLet Right Be Done: The Life and Times of Bill Simpson. Source of main image: Ashley Fraser Photography. **Love C2C Journal? Here's how you can help usgrow.** Subscribe Donate Like our Facebook Page Share a story **More for you** **Restoring Canada Special SeriesPart III: National Sovereignty in the Age of Mass Migration** For decades, Canada’s elites saw immigration as a kind of secular virtue, and any criticism of it as racist or xenophobic. But as Patrick Keeney writes in this provocative essay, that belief misunderstands what a nation truly is. The liberal globalist vision that drives blind faith in immigration sees people as bearers of rights and consumers of things, detached from place, history or culture. The conservative-communitarian tradition, Keeney explains, counters that love and obligation flowoutward, and that a nation is a moral community bound by shared history, culture and mutual obligations. To love one’s own is not a moral failing, Keeney argues, but a legitimate reflection of human affairs, one that Canada must rediscover if it is to regain its cohesion and build a future. **Standing Up for Urinals: Can They Survive the Gender-Neutral Washroom Craze?** The famous gender-neutral washroom in the 1990s TV showAlly McBealwas a plot device meant for comedic purpose. These days it’s no laughing matter. Across Canada, separate men’s and women’s rooms are being replaced with unisex facilities in the name of “inclusivity”. And that leaves no place for the wall-mounted urinal. With this unloved male-only waste management device facing possible extinction, Peter Shawn Taylor takes a closer look. His wide-ranging research lifts the lid on the urinal’s remarkable efficiency and many other advantages. Whether they can use it or not, everybody should be standing up for the urinal. **Restoring Canada Special SeriesPart II: Carney’s Energy Policy and the Fragile Canadian Economy** “Meet the new boss/Same as the old boss,”The Who’sPete Townshend wrote back in 1971. Words that today might well apply to Mark Carney. Canada’s new Liberal Prime Ministersayshe wants to make Canada a “conventional and clean energy superpower”, and suddenly seems to support new oil and natural gas pipelines. But Gwyn Morgan, who devoted years as a CEO to defending Canada’s oil and natural gas industry, doesn’t buy it. Carney, he notes, spent years abroad on an ever-more-strident net-zero quest, and recently said he’s keeping his predecessor’s oil and gas emissions cap in place. In this incisive critique, Morgan takes the measure of the new PM and finds that the prospects of restoring the Canadian economy have dimmed further. **A Man for All Times: Reassessing John Diefenbaker** **Restoring Canada Special SeriesPart III: National Sovereignty in the Age of Mass Migration** **Standing Up for Urinals: Can They Survive the Gender-Neutral Washroom Craze?** **More from this author** **Research to Ruin: The Worsening Spectre of Academic Fraud** Rather than breaking barriers to knowledge, these days universities seem more adept at breaking the norms of academic conduct. An apparently endless stream of cases involving data manipulation, plagiarism, retractions and other errors and deceptions by researchers ranging from obscure graduate students to world-famous scientific names is plaguing academia in Canada and around the world. But is this avalanche of academic malpractice – what one scientist bemoaned as “corrupt, incompetent, or scientifically meaningless research” – a sign of weakening standards? Or are we now just paying more attention? Examining several troubling examples and interviewing experts from the frontlines, Lynne Cohen probes the dark underbelly of academic fraud. **Mischief Trial of the Century: Inside the Crown’s Bogus, Punitive and Occasionally Hilarious Case Against the Freedom Convoy’s Tamara Lich and Chris Barber, Part II** More people are becoming painfully familiar with the expression “the process is the punishment” – a legal or regulatory matter of such cost, complexity, length and personal stress that, regardless of its formal outcome, the targeted person emerges damaged, sometimes irreparably. It is all-but impossible not to attach this label to the nearly three-year-long prosecution of Tamara Lich and Chris Barber, which has included a marathon 13-month-long trial, now awaiting its verdict. In Part II of this series, Lynne Cohen takes readers inside the Ottawa Courthouse – talking to the defendants, their lawyers and other experts – illuminating the Crown’s relentless pursuit of the Freedom Convoy organizers. (Part I can be read here.) **Mischief Trial of the Century: Inside the Crown’s Bogus, Punitive and Occasionally Hilarious Case Against the Freedom Convoy’s Tamara Lich and Chris Barber, Part I** In his judicial review of the Liberals’ response to the 2022 Freedom Convoy protest, Federal Court Justice Richard Mosley ruled that “there was no national emergency justifying the invocation of theEmergencies Actand the decision to do so was therefore unreasonable.” With Prime Minister Justin Trudeau’s draconian actions thus exposed as unnecessary and excessive – in other words, illegal and unconstitutional – what now awaits Tamara Lich and Chris Barber, who each face up to 10 years in jail for playing key roles in the protest? In the first of a two-part series, Lynne Cohen charts the lengthy and vindictive prosecution of the pair, from their first appearance in downtown Ottawa to their initial arrest and pre-trial treatment. **Research to Ruin: The Worsening Spectre of Academic Fraud** **Mischief Trial of the Century: Inside the Crown’s Bogus, Punitive and Occasionally Hilarious Case Against the Freedom Convoy’s Tamara Lich and Chris Barber, Part II** **Mischief Trial of the Century: Inside the Crown’s Bogus, Punitive and Occasionally Hilarious Case Against the Freedom Convoy’s Tamara Lich and Chris Barber, Part I** **90-Second Video Summary** **Reading Progress** **Share This Story by Lynne Cohen** **Donate** **Subscribe to the C2C WeeklyIt's Free!** Politics Culture and Media Book Review Website built byH&Co. About Submissions Contact Donate Subscribe Stories Global Newsstand Video Pressreader Audio"}