{"id": 1081, "name": "Parents Magazine", "domain": "parents.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.parents.com/a-third-of-children-will-be-overweight-by-2050-how-to-help-your-kids-without-body-shaming-11746616", "title": "A Third Of Children Will Be Overweight By 2050 How To Help Your Kids Without Body Shaming 11746616", "content": "SearchPlease fill out this field. Newsletters Sweepstakes Starting a FamilyStarting a FamilyTrying to ConceiveOvulationOvulation CalculatorInfertilityView All Trying to Conceive Ovulation Ovulation Calculator Infertility View All Trying to Conceive Ovulation Ovulation Calculator Infertility View All PregnancyPregnancyPregnancy Week-by-WeekBaby NamesDue Date CalculatorPregnancy Conditions & ComplicationsLabor & DeliveryView All Pregnancy Week-by-Week Baby Names Due Date Calculator Pregnancy Conditions & Complications Labor & Delivery View All Pregnancy Week-by-Week Baby Names Due Date Calculator Pregnancy Conditions & Complications Labor & Delivery View All Baby NamesBaby NamesTop Girl NamesTop Boy NamesTrending NamesGender-Neutral NamesNicknamesView All Top Girl Names Top Boy Names Trending Names Gender-Neutral Names Nicknames View All Top Girl Names Top Boy Names Trending Names Gender-Neutral Names Nicknames View All ParentingParentingBabiesToddlersBig KidsTweens & TeensHealth & SafetyView All Babies Toddlers Big Kids Tweens & Teens Health & Safety View All Babies Toddlers Big Kids Tweens & Teens Health & Safety View All Life With KidsLife With KidsTravelEntertainmentFoodFamiliaKindredView All Travel Entertainment Food Familia Kindred View All Travel Entertainment Food Familia Kindred View All What to BuyWhat to BuyToys & Gifts for Every Age and OccasionBaby & Toddler GearPregnancy GearClothes, Shoes & Accessories for the Whole FamilySleep and Nursery ItemsView All Toys & Gifts for Every Age and Occasion Baby & Toddler Gear Pregnancy Gear Clothes, Shoes & Accessories for the Whole Family Sleep and Nursery Items View All Toys & Gifts for Every Age and Occasion Baby & Toddler Gear Pregnancy Gear Clothes, Shoes & Accessories for the Whole Family Sleep and Nursery Items View All News About UsAbout UsEditorial GuidelinesExpert Review BoardRead More Editorial Guidelines Expert Review Board Read More Editorial Guidelines Expert Review Board Read More Newsletters Sweepstakes Starting a FamilyOvulationTrying to ConceiveAdoption & Foster CareFertilityView All Ovulation Trying to Conceive Adoption & Foster Care Fertility View All Ovulation Trying to Conceive Adoption & Foster Care Fertility View All PregnancyPregnancy Week-by-WeekBaby NamesDue Date CalculatorPregnancy Conditions & ComplicationsLabor & DeliveryView All Pregnancy Week-by-Week Baby Names Due Date Calculator Pregnancy Conditions & Complications Labor & Delivery View All Pregnancy Week-by-Week Baby Names Due Date Calculator Pregnancy Conditions & Complications Labor & Delivery View All Baby NamesTop Girl NamesTop Boy NamesTrending NamesGender-Neutral NamesNicknamesView All Top Girl Names Top Boy Names Trending Names Gender-Neutral Names Nicknames View All Top Girl Names Top Boy Names Trending Names Gender-Neutral Names Nicknames View All ParentingBabiesToddlersBig KidsTween & TeensHealth & SafetyView All Babies Toddlers Big Kids Tween & Teens Health & Safety View All Babies Toddlers Big Kids Tween & Teens Health & Safety View All Life With KidsTravelEntertainmentFoodFamiliaKindredView All Travel Entertainment Food Familia Kindred View All Travel Entertainment Food Familia Kindred View All What to BuyToys & GiftsCar SeatsStrollersPregnancy & PostpartumTech & GadgetsView All Toys & Gifts Car Seats Strollers Pregnancy & Postpartum Tech & Gadgets View All Toys & Gifts Car Seats Strollers Pregnancy & Postpartum Tech & Gadgets View All News Our Editorial Guidelines Parents Awards Expert Review Board 1The Best and Worst States for Working Dads in 2025, According to New Data 2Mom Sees 'No Point' in Making Her Kids Attend the Final Week of School 3Tween and Teen TikTok Skincare Routines May Do More Harm Than Good, Study Says 4This Movie Projector (And Screen) Costs Less Than Movie Tickets for a Family of 4—Before the Popcorn **A Third of Children Will Be Overweight by 2050—How to Help Your Kids Without Body Shaming** Parents should take a holistic, compassionate approach to the health of their children. What to Know About the Research Body Positive Approaches to Weight and Health Are Still Essential How to Address Healthy Lifestyle Choices With Kids Tips for Addressing Your Child’s Whole Body Health Parents/Getty Images Obesity can lead to health problems, but children need compassion, not body shaming. The language that we use to talk to kids about their weight can impact their mental health. You are your child's best role model for healthy living. All parents worry about their kids' physical health, and sometimes that means keeping a close (non-judgmental) eye on their weight. And now it might even more important to pay attention on what and how your child eats: A new study published inLancetprojects that by 2050, about a third of all children and teens will beobese or overweight. This is distressing news, given the health implications of these conditions for kids, such asincreased risk of diabetes, high blood pressure, anxiety, and depression.But it also raises concerns about body shame, and perpetuating harmful stereotypes about children who live in larger bodies. We connected with twobody-positive pediatriciansto help us understand this study, and to share some holistic, compassionate ways to address body weight and health with children. **What to Know About the Research** The research, published in a March, 2025 edition ofLancet, looked at 204 countries around the world, and their body weight statistics. The researchers found that overweight andobesity ratesin both adults and children over the past three decades—from 1990 to 2021—have more than doubled. Moreover, the study researchers projected that by 2050, about 60% of adults and 31% of kids and teens will be overweight or obese. As such, the study researchers call for urgent policy changes in governments and public health to support treatment for overweight and obese children, as well as preventative strategies. “The unprecedented global epidemic of overweight and obesity is a profound tragedy and a monumental societal failure,” lead study author,Professor Emmanuela Gakidou, said in a press release. “Governments and the public health community can use our country-specific estimates on the stage, timing, and speed of current and forecasted transitions in weight to identify priority populations experiencing the greatest burdens of obesity who require immediate intervention and treatment, and those that remain predominantly overweight and should be primarily targeted with prevention strategies,” the release continued. **Body Positive Approaches to Weight and Health Are Still Essential** WhileWendy Schofer, MD, a pediatrician and founder of Family in Focus, shares some of the same concerns with the authors of this study, she objects to some of the language used by the study researchers. “The research is projecting further increases in the prevalence of obesity for adults and children worldwide, and it is very strongly noted to be a societal shortcoming according to the lead author, Professor Gakidou,” says Dr. Schofer. However, Dr. Schofer says that the way we are framing obesity as a “tragedy”—as quoted from the press release—is harmful for those living in larger bodies. **Why the language used in the study matters** Dr. Schofer says that instead of focusing on a “tragedy” we are trying to avoid, we need to focus on what we are doing here and now and what changes we want to see to public health to make sure kids are healthy. What does that look like? “This starts in the home long before we see anything on a societal level,” she says. “In all societies, that is talking about focus onnutritious foods,safe spaces to playand explore, [and] learning and social activities that are creative and nourish the whole body.” Importantly, says Dr. Schofer, preventing these health problems means creatingpositive relationships to foodand our bodies, and an awareness of theimpact that our emotions can haveon our habits and behaviors. “This research needs to be framed as a call for cultural change for all members of a society, not just those of a certain age or body size,” she emphasizes. **Related Stories** **How to Address Healthy Lifestyle Choices With Kids** Weight issues shouldn’t be ignored, because they impact your child’s health now and in the future. Children with a BMI that falls in the overweight or obese category may have an increased risk of health conditions like type 2 diabetes, elevated cholesterol, sleep apnea, high blood pressure, and bone/joint issues according to the Academy of American Pediatrics (AAP). Treating obesity early decreases these risks. But focusing heavily on your child’s body size and unhealthy habits can induce body shame, and can increase their risk of developing adisordered eating pattern. And in fact, using BMI as a measure of health can bemisleading and outdated. That’s why taking a holistic, compassionate approach to dealing with these issues is crucial. “As a pediatrician, a father, and someone who was overweight as a child, I see the profound impact this research can have—but only if we approach it with compassion and perspective,” saysIlan Shapiro, MDat AltaMed Health Services, who oversees a childhood obesity program. “The key takeaway is this: childhood health is not just about calories in and out. It's about the full environment our kids grow up in—what they eat, where they play, how they sleep, their mental health, and yes, the examples they see at home, he explains. **Start with 'connection over correction'** Dr. Shapiro says that children don’t need lectures about eating or healthy lifestyle choices. That usually only increases shame. What they need isconnection over correction, he says. What might that look like? Here are some ways to connect, rather than correct, according to Dr. Shapiro: Instead of saying, “You need to eat healthier,” try saying, “Our bodies are amazing. Let’s find foods that make them feel strong and focused.” Focus on how food and habits feel, not how they look. For example, you might say, “Did that snack give you good energy or make you feel sleepy?” Use “we” language when possible. This might look like saying: “Let’s try drinking more water this week as a family.” Lastly, kids are little sponges, so setting positive examples whenever possible is essential. “Kids copy what they see, not just what they hear,” Dr. Shapiro says. “So the most powerful message is watching us choose movement, enjoy fruits and vegetables, and talk kindly about our own bodies.” **Tips for Addressing Your Child’s Whole Body Health** So what are some more tangible actions you can take to keep your child healthy? Here are tips from Dr. Shapiro: Make movement playful and a time to connect. Try family walks, dance parties, or make park time an opportunity for bonding. Cook together: Kids are more likely to tryhealthy foodsif they help prepare them. Make water and rest rituals part of your day. Consider special water bottles, bedtime stories, and no screens before bed to help everyone recharge. Joyful swaps: Instead of restricting foods, offer fun alternatives, such as frozen fruit pops, smoothie bowls, or yogurt with cinnamon and fruit. Most importantly, says Dr. Shapiro, make health a team effort. “If kids see us trying, laughing, failing, and trying again—they’ll know that wellness isn’t about perfection,” he advises. “It’s about consistency, curiosity, and care.” Finally, if you have any questions about your child’s health or body size, don’t hesitate to reach out to your pediatrician, preferably one who is body positive and affirming. If your child lives with body image issues or has signs of disordered eating, please reach out to a therapist or eating disorder specialist for help and support. Risk Factors and Complications of Childhood Obesity in a Lower-middle-income Country Urban Setting.Pediatrics.2022. Risk Factors and Complications of Childhood Obesity in a Lower-middle-income Country Urban Setting.Pediatrics.2022. Risk Factors and Complications of Childhood Obesity in a Lower-middle-income Country Urban Setting.Pediatrics.2022. Global, regional, and national prevalence of child and adolescent overweight and obesity, 1990–2021, with forecasts to 2050: a forecasting study for the Global Burden of Disease Study 2021.The Lancet.2025. Global, regional, and national prevalence of child and adolescent overweight and obesity, 1990–2021, with forecasts to 2050: a forecasting study for the Global Burden of Disease Study 2021.The Lancet.2025. Global, regional, and national prevalence of child and adolescent overweight and obesity, 1990–2021, with forecasts to 2050: a forecasting study for the Global Burden of Disease Study 2021.The Lancet.2025. More than half of adults and a third of children and adolescents predicted to have overweight or obesity by 2050. American Association for the Advancement of Science (AAAS). 2025. More than half of adults and a third of children and adolescents predicted to have overweight or obesity by 2050. American Association for the Advancement of Science (AAAS). 2025. More than half of adults and a third of children and adolescents predicted to have overweight or obesity by 2050. American Association for the Advancement of Science (AAAS). 2025. Childhood Obesity: A Complex Disease.American Academy of Pediatrics. 2023. Childhood Obesity: A Complex Disease.American Academy of Pediatrics. 2023. Childhood Obesity: A Complex Disease.American Academy of Pediatrics. 2023. Children eat more food when they prepare it themselves.Appetite.2019. Children eat more food when they prepare it themselves.Appetite.2019. Children eat more food when they prepare it themselves.Appetite.2019. News Studies **Related Articles** Starting a Family Pregnancy Baby Names Parenting Life With Kids Products & Gear News About Us Expert Review Board Editorial Guidelines Product Review Guidelines Careers Privacy Policy Contact Terms of Service Your Privacy Choices Advertise"}