{"id": 1844, "name": "Winter Watch", "domain": "winterwatch.net", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://www.winterwatch.net/2025/05/hidden-in-plain-sight-ag-merrick-garlands-nepotism-interest-in-chilling-dissent-toward-critical-race-theory-in-k-12-education/", "title": "Hidden In Plain Sight Ag Merrick Garlands Nepotism Interest In Chilling Dissent Toward Critical Race Theory In K 12 Education", "content": "[ June 11, 2025 ]LA Is the Frontline Playbook of a Destabilization CampaignAround the Web [ June 11, 2025 ]When the Family is Talking About PoliticsAround the Web [ June 11, 2025 ]64% of Israelis See no Need for Reporting on Gaza ConditionsAround the Web [ June 11, 2025 ]The Foundations Fund the Hack Abraham Flexner to ‘Standardize’ MedicineArticles by Russ Winter [ June 10, 2025 ]You’re one trick poniesAround the Web [ June 10, 2025 ]Gaza: Aid Trucks Lure the Starving and then Opened Fire on ThemAround the Web [ June 10, 2025 ]Aldous Huxley’s Philosophy and Schemes Involving Psychedelic DrugsArticles by Russ Winter [ June 9, 2025 ]1999 Flash Back: C-Span Chuck Hagel Hearing – Saturday Night LiveAround the Web [ June 9, 2025 ]Out the Back Door? Questioning the Death of Jeffrey EpsteinArticles by Russ Winter [ June 9, 2025 ]The New York City Mayoral Israel First Debate SituationAround the Web [ June 8, 2025 ]The National Enquirer: A Despicable Propaganda and Shakedown RacketArticles by Russ Winter [ June 8, 2025 ]Can We Have the Names of the 40 Beheaded Babies?Around the Web [ June 8, 2025 ]ICE Riots in LA Long Hot Summer Seem Non-Lethal– So FarAround the Web [ June 7, 2025 ]Husband boarded his flight and left without his wifeAround the Web [ June 7, 2025 ]Trump Claims He Was Responsible for Sabotaging Nord Stream IIAround the Web WritersArticles by Russ WinterArticles by Thomas MüllerArticles by Torchy BlaneGuest Posts Articles by Russ Winter Articles by Thomas Müller Articles by Torchy Blane Guest Posts Articles by Russ Winter Articles by Thomas Müller Articles by Torchy Blane Guest Posts NewsInternational NewsUS News International News US News International News US News Politics Crime Culture BusinessMedia Media Media Hidden History Videos Podcasts AboutPrivacy Policy Privacy Policy Privacy Policy **HIDDEN IN PLAIN SIGHT: AG Merrick Garland’s Nepotism Connection is Chilling Dissent Toward Critical Race Theory Peddlers in K-12 Education** May 31, 2025Russ WinterArticles by Russ Winter,Business,Culture,Politics,US News,Winter Watch Articles13 The understandable and predictable byproduct of the capture of education by Marxists and Jacobins are raucous school board meetings. In fact, school boards have never been a place for thin-skinned people. It’s an unrealistic expectation that parents would be passive as leftist groups ramrod controversial new agendas, such as Critical Race Theory (CRT), and authoritarians mandate masks and experimental jabs for children. Now, we learn the tyrants are attempting to create a chilling effect by bringing the FBI to bear on parents who speak out at school board meetings against the Marxist-authoritarian sistema. The National School Boards Association (NSBA) in a recent letter asked the Biden administration to classify protests against CRT as “a form of domestic terrorism” and recommended prosecution of parents under the “PATRIOT Act.” Classifying angry or mean-spirited communication as domestic terrorism, hate crime or malice is more than a stretch. It’s weasel language. They are creating a whole new class of bogus “crimes” to silence dissent against their objectionable policies. Once again, if actual violence or assaults occur, we’ve had laws on the books for eons to address it. But leave it to the discordians and Satanists to shift the goal posts. The US Office of the Attorney General issued a memorandum to the FBIinstructing them to initiate investigationsof any parent attending a local school board meeting who might be viewed as confrontational, intimidating or harassing. Meanwhile, illustrating the degree of capture, we learn U.S. Attorney Gen. Merrick Garland’s own family has a financial interest silencing opposition. His daughter, Rebecca Garland, is getting rich off of peddling CRT sludge to public schools. In 2018, Rebecca married Xan Tanner. Tanner is the current co-founder of a controversial education service company called Panorama Education. Panorama Education is the “social learning” resource material provider to school districts and teachers for Critical Race Theory. It peddles Social Emotional Learning (SEL), replete with buzzwords like “restorative justice.” After the George Floyd wag-the-dog incident, Panorama jumped on the bandwagon and declared, “We attack racism, discrimination and oppression and work towards justice, equality and opportunity.” A quarter of American students are enrolled in a district impacted by the tentacles of Panorama. More than 50 of the largest 100 school districts and state agencies in the country use Platform. In total, more than 1,500 school districts are among its customers. This is classic corrupto capture and practice. TechCrunchreports Panorama Education, which has built out a K-12 education software platform, has raised $60 million in a Series C round of funding led by General Atlantic. Total placed with the plutocracy to date is $100 million. Also with a stake in the CRT biz is the Chan Zuckerberg Initiative, an organization established and owned by Facebook founder Mark Zuckerberg and his wife, Priscilla Chan. Thinking well ahead, theZuckerberg’s foundation infused $4 million dollars into Panorama back in 2013. Also investing in Panorma is the plutocrat Pritzer family via their Tao Capital Partner entity. Not to be outdone, note the involvement of Owl Ventures in the investment rounds. Owl is a hedge fund exploiting education technology. And not surprisingly, plutocrats Bill and Melinda Gates were on board as early as 2015 as a funder of Owl. It seems to be a who’s who of the kleptocracy that foresaw CRT and the George Floyd BLM Revolution long ago. Whodathunk? Thus, it’s no small wonder that parents are being threatened with the label “domestic terrorist” for pushing back. Unknowingly, they’re pushing back on plutocrats who have enough influence to call on daddy Merrick Garland’s Department of “Justice,” which can bring heavy handed muscle to bear upon any local pleb standing up to the race industry. Classic George Carlin: “It’s one big club, and you ain’t in it.” Click to share on Gab (Opens in new window)Gab Tweet Click to email a link to a friend (Opens in new window)Email More Click to print (Opens in new window)Print **Like this:** Battle Against Degeneracy Brainwashing & Propaganda Cultural Marxism Race Industry **Related Articles** **UCLA Makes Students Pay Classmates to Promote ‘Social Justice’** **Chicago Police Union Head Calls on Members to Defy Vaccine Mandate** **Movement for Black Lives Backs Leaders Hit With Anti-Semitism Smears** StanoOctober 7, 2021 at 3:17 pmThank you for posting this RW. The more people who know about this the better. It wouldn’t surprise me if this outfit (“Panorama”) wrote the letter to Biden to get this started.Loading...Reply Thank you for posting this RW. The more people who know about this the better. It wouldn’t surprise me if this outfit (“Panorama”) wrote the letter to Biden to get this started. Thank you for posting this RW. The more people who know about this the better. It wouldn’t surprise me if this outfit (“Panorama”) wrote the letter to Biden to get this started. RickySOctober 7, 2021 at 4:58 pmThe picture in your article must have been photoshopped…https://twitter.com/ChoiceNewsNet/status/1439386961786163203/photo/1Loading...ReplyWinter WatchOctober 7, 2021 at 6:15 pmNo shit Sherlock. It is becoming a widely used meme.Loading...ReplySimple CitizenOctober 9, 2021 at 2:21 amCome back when you are ready to have a conversation, not an observation.Best,SCLoading...Reply The picture in your article must have been photoshopped…https://twitter.com/ChoiceNewsNet/status/1439386961786163203/photo/1 Winter WatchOctober 7, 2021 at 6:15 pmNo shit Sherlock. It is becoming a widely used meme.Loading...Reply No shit Sherlock. It is becoming a widely used meme. Simple CitizenOctober 9, 2021 at 2:21 amCome back when you are ready to have a conversation, not an observation.Best,SCLoading...Reply Come back when you are ready to have a conversation, not an observation. Best,SC The picture in your article must have been photoshopped…https://twitter.com/ChoiceNewsNet/status/1439386961786163203/photo/1 Winter WatchOctober 7, 2021 at 6:15 pmNo shit Sherlock. It is becoming a widely used meme.Loading...Reply No shit Sherlock. It is becoming a widely used meme. No shit Sherlock. It is becoming a widely used meme. Simple CitizenOctober 9, 2021 at 2:21 amCome back when you are ready to have a conversation, not an observation.Best,SCLoading...Reply Come back when you are ready to have a conversation, not an observation. Best,SC Come back when you are ready to have a conversation, not an observation. Best,SC somethinghappeninghereOctober 7, 2021 at 6:58 pmOne o’ these days parents who home school (esp. Christian hone school using A Beka or Alpha and Omega or some other Christian home school curriculum) will also be labled “terrorists” since they will refuse the CRT garbage….too bad Garland’s name isn’t also “garbage”…. Funny how it’s almost always upper class whites promoting this garbage, almost never blacks except for Cullors and Kendi and a few others.Loading...Reply One o’ these days parents who home school (esp. Christian hone school using A Beka or Alpha and Omega or some other Christian home school curriculum) will also be labled “terrorists” since they will refuse the CRT garbage….too bad Garland’s name isn’t also “garbage”…. Funny how it’s almost always upper class whites promoting this garbage, almost never blacks except for Cullors and Kendi and a few others. One o’ these days parents who home school (esp. Christian hone school using A Beka or Alpha and Omega or some other Christian home school curriculum) will also be labled “terrorists” since they will refuse the CRT garbage….too bad Garland’s name isn’t also “garbage”…. Funny how it’s almost always upper class whites promoting this garbage, almost never blacks except for Cullors and Kendi and a few others. ChoSimbaOneOctober 8, 2021 at 7:05 amGarland isn’t White, he is jewish.Loading...ReplySimple CitizenOctober 9, 2021 at 2:15 amSorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”?In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man.If you know something different, then I am open and hope to hear back.Many thanks.SCLoading...ReplySusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Garland isn’t White, he is jewish. Simple CitizenOctober 9, 2021 at 2:15 amSorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”?In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man.If you know something different, then I am open and hope to hear back.Many thanks.SCLoading...ReplySusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Sorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”? In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man. If you know something different, then I am open and hope to hear back. Many thanks. SC SusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply On the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.” Simple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Susan, Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying. Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared. So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so. All My Best,Simple Citizen Garland isn’t White, he is jewish. Simple CitizenOctober 9, 2021 at 2:15 amSorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”?In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man.If you know something different, then I am open and hope to hear back.Many thanks.SCLoading...ReplySusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Sorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”? In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man. If you know something different, then I am open and hope to hear back. Many thanks. SC SusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply On the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.” Simple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Susan, Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying. Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared. So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so. All My Best,Simple Citizen Sorry, so wait…is he an Ethiopian Jewish man? I am a bit lost on your comment. Is he wearign “WHITE FACE”? In my own (humble) observation he appears of European Jewish stock, which would make him appear as a “WHITE” man. If you know something different, then I am open and hope to hear back. Many thanks. SC SusanOctober 12, 2021 at 6:40 pmOn the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.”Loading...ReplySimple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply On the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.” Simple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Susan, Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying. Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared. So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so. All My Best,Simple Citizen On the distinction between Whites and jews, if you have a little time to spend, visithttps://age-of-treason.com/age-of-treason-radio/and read and/or listen to 30 minute podcasts by the excellent researcher Tanstaafl. See especially on this topic, Jews Versus Whites, in 3 parts. On the changing of names by jews to help them blend into White societies, see Jewish Crypsis–The Name Game.Also from one Israeli rapper jew’s perspective, search online for the lyrics to and video of the song, “I’m Not White, I’m Jewish.” Simple CitizenOctober 16, 2021 at 6:28 amSusan,Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying.Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared.So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so.All My Best,Simple CitizenLoading...Reply Susan, Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying. Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared. So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so. All My Best,Simple Citizen Susan, Sincere apologies for the late response; I am appreciative for you comment. And I will listen to the link for a better understanding of what you are saying. Still I find the idea of “non-white” Jewish folks a bit odd in its entirety. Yes, I know there are African Jewish folks and even some Asian. Yet, many Jewish folks are “white” by birth and then elect to define themselves as Jewish. Heck the Khazarians did this for an entire population because they were scared. So the fact that many in my / our government may deem themselves Jewish does not take away from basic appearance or genetics, even if they wished the situation to be so. All My Best,Simple Citizen WTFJuly 11, 2023 at 8:44 pmAfter visiting Bolshevik Russia in 1920, Bertrand Russell wrote to Lady Ottoline Morrell: “Bolshevism is a closed tyrannical bureaucracy, with a spy system more elaborate and terrible than the Tsar’s, and an aristocracy as insolent and unfeeling, composed of Americanized Jews. No vestige of liberty remains, in thought or speech or action.” (The Autobiography of Bertrand Russell, paperback ed. 354)Loading...Reply After visiting Bolshevik Russia in 1920, Bertrand Russell wrote to Lady Ottoline Morrell: “Bolshevism is a closed tyrannical bureaucracy, with a spy system more elaborate and terrible than the Tsar’s, and an aristocracy as insolent and unfeeling, composed of Americanized Jews. No vestige of liberty remains, in thought or speech or action.” (The Autobiography of Bertrand Russell, paperback ed. 354) After visiting Bolshevik Russia in 1920, Bertrand Russell wrote to Lady Ottoline Morrell: “Bolshevism is a closed tyrannical bureaucracy, with a spy system more elaborate and terrible than the Tsar’s, and an aristocracy as insolent and unfeeling, composed of Americanized Jews. No vestige of liberty remains, in thought or speech or action.” (The Autobiography of Bertrand Russell, paperback ed. 354) AmandaJuly 12, 2023 at 2:09 amfwiw- Garland was involved in the OKC bombing coverup. Darren Beattie has repeatedly tweeted about this:https://allpoetry.com/column/12637264-Merrick-Garland–Coconspirator-In-Coverup-Of-Oklahoma-City-Fedl-B-by-saiomI think Eric Holder was also involved in the OKC bombing coverup.So apparently, if you help the treasonous US govt cover up crimes against the citizens, you get straight tracked for AG. I think Holder also has banking connections.Loading...Reply fwiw- Garland was involved in the OKC bombing coverup. Darren Beattie has repeatedly tweeted about this:https://allpoetry.com/column/12637264-Merrick-Garland–Coconspirator-In-Coverup-Of-Oklahoma-City-Fedl-B-by-saiom I think Eric Holder was also involved in the OKC bombing coverup. So apparently, if you help the treasonous US govt cover up crimes against the citizens, you get straight tracked for AG. I think Holder also has banking connections. fwiw- Garland was involved in the OKC bombing coverup. Darren Beattie has repeatedly tweeted about this:https://allpoetry.com/column/12637264-Merrick-Garland–Coconspirator-In-Coverup-Of-Oklahoma-City-Fedl-B-by-saiom I think Eric Holder was also involved in the OKC bombing coverup. So apparently, if you help the treasonous US govt cover up crimes against the citizens, you get straight tracked for AG. I think Holder also has banking connections. yajabJuly 12, 2023 at 2:24 amI think Eric Holder was also involved in the OKC bombing coverup.Loading...Reply I think Eric Holder was also involved in the OKC bombing coverup. I think Eric Holder was also involved in the OKC bombing coverup. Eli WagnerJuly 12, 2023 at 10:58 amMerrick Garland another tribe member. His daughter has that face.Loading...Reply Merrick Garland another tribe member. His daughter has that face. Merrick Garland another tribe member. His daughter has that face. **Post a CommentCancel reply** This site uses Akismet to reduce spam.Learn how your comment data is processed. French Should Expose Government Not Islam Over Neo-Gladio ProvocationsJuly 30, 20160 French Should Expose Government Not Islam Over Neo-Gladio Provocations French Should Expose Government Not Islam Over Neo-Gladio Provocations Post Staged-Deception Evidence Widely Scrubbed from the Internet: What to do About itNovember 23, 202138 Post Staged-Deception Evidence Widely Scrubbed from the Internet: What to do About it Post Staged-Deception Evidence Widely Scrubbed from the Internet: What to do About it The Brabant Killers’ Reign of Terror in Belgium: Solved?March 7, 20253 The Brabant Killers’ Reign of Terror in Belgium: Solved? The Brabant Killers’ Reign of Terror in Belgium: Solved? 19 DECEMBER 2017: U.S. Lifts Moratorium on Funding Controversial, High-Risk Virus ResearchMarch 28, 20221 19 DECEMBER 2017: U.S. Lifts Moratorium on Funding Controversial, High-Risk Virus Research 19 DECEMBER 2017: U.S. Lifts Moratorium on Funding Controversial, High-Risk Virus Research Patton Assassinated to Suppress His Criticism of Post-War PolicySeptember 24, 202326 Patton Assassinated to Suppress His Criticism of Post-War Policy Patton Assassinated to Suppress His Criticism of Post-War Policy >> CLICK HERE TO VIEW MEME ARCHIVE Raw Deal with Fetzer, Hoquiam and WinterJune 5, 20250 Raw Deal with Fetzer, Hoquiam and Winter Raw Deal with Fetzer, Hoquiam and Winter Raw Deal with Fetzer, Hagopian and WinterMay 22, 20250 Raw Deal with Fetzer, Hagopian and Winter Raw Deal with Fetzer, Hagopian and Winter The Raw Deal “Fearsome Threesome” edition with Jim Fetzer, Joachim Hagopian and Russ Winter.May 15, 20252 The Raw Deal “Fearsome Threesome” edition with Jim Fetzer, Joachim Hagopian and Russ Winter. The Raw Deal “Fearsome Threesome” edition with Jim Fetzer, Joachim Hagopian and Russ Winter. Raw Deal: Fetzer, Hoquiam, WinterMay 8, 20252 Raw Deal: Fetzer, Hoquiam, Winter Raw Deal: Fetzer, Hoquiam, Winter The Friday FARcast — The Tariff Entanglement With Russ Winter and Robert PhoenixMay 3, 20250 The Friday FARcast — The Tariff Entanglement With Russ Winter and Robert Phoenix The Friday FARcast — The Tariff Entanglement With Russ Winter and Robert Phoenix Raw Deal “Fearsome Threesome” with Jim Fetzer, Russ Winter and Joachim HagopianMay 1, 20251 Raw Deal “Fearsome Threesome” with Jim Fetzer, Russ Winter and Joachim Hagopian Raw Deal “Fearsome Threesome” with Jim Fetzer, Russ Winter and Joachim Hagopian Russ Winterpublished 949 articles published 949 articles published 949 articles Thomas Müllerpublished 223 articles published 223 articles published 223 articles Torchy Blanepublished 166 articles published 166 articles published 166 articles Enter your email address to subscribe to Winter Watch and receive notifications of new posts by email. Email Address Subscribe Register Log in Entries feed Comments feed WordPress.org Copyright © 2025 | MH Magazine WordPress Theme byMH Themes **Discover more from Winter Watch** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}