{"id": 2198, "name": "Clickhole", "domain": "clickhole.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://clickhole.com/shots-fired-in-a-major-escalation-of-their-feud-elon-musk-is-attempting-to-severely-harm-trumps-reputation-by-revealing-evidence-that-trump-was-once-close-friends-with-elon-musk/", "title": "Shots Fired In A Major Escalation Of Their Feud Elon Musk Is Attempting To Severely Harm Trumps Reputation By Revealing Evidence That Trump Was Once Close Friends With Elon Musk", "content": "Latest News Pop Culture Lifestyle Quizzes ClickVentures Video KidHole Email Club Store News **Shots Fired: In A Major Escalation Of Their Feud, Elon Musk Is Attempting To Severely Harm Trump’s Reputation By Revealing Evidence That Trump Was Once Close Friends With Elon Musk** Well, just when it looked like things might have been calming down in the Trump-Musk feud, a new escalation has ensured that this nasty spat won’t be coming to a close any time soon: Elon Musk is attempting to severely harm Trump’s reputation by revealing evidence that Trump was once close friends with Elon Musk. Yikes! We knew these guys hated each other, but who knew they’d take it this far. In a series of posts to X, Musk wrote, “I didn’t want it to come to this, but the world needs to know just what kind of a man Donald Trump is. I’ve compiled all the evidence I could find proving Trump was once close friends with none other than ELON MUSK. This was NOT a ‘business relationship’ or a casual acquaintanceship. This man actually RESPECTED Elon Musk and considered him a CLOSE friend.” The shocking and undoubtedly damaging revelation by Musk was followed up with numerous screen caps of personal conversations between Trump and Musk, photos of them together in various venues, and clips from interviews, some of them quite recent, where Trump has praised Elon Musk, calling him “very smart” and “a great guy.” Elon followed the damning proof that Trump was once quite close to Elon Musk with another post stating, “How anyone can continue to trust this man after seeing what I just shared is beyond me. Trump’s past friendship with Elon Musk is inexcusable, and I don’t care who knows about it, even if revealing this causes his downfall.” Dang. Not only is Elon dropping the bombshell that Trump was once friends with Elon Musk, but he’s bringing receipts! Looks like “Teflon Don” may have finally found himself in a situation he can’t bounce back from. One thing’s for sure, Trump is going to be in full defensive meltdown mode when he responds to this, and it’s going to be interesting to see how he tries to explain it away. We didn’t know Elon had it in him to deliver a blow like this to Trump. This is simply as nasty as a public feud can get. Donald Trump Elon Musk Feuds Friendship Politics Trump-Must Feud Wow Heartwarming: When This Man Caught A Foul Ball At A Phillies Game, He Chewed It And Regurgitated It Into The Mouth Of A Young Fan Sitting Near HimHeartwarming: When This Man Caught A Foul Ball At A Phillies Game, He Chewed It And Regurgitated It Into The Mouth Of A Young Fan Sitting Near Him Awesome: Spotify Is Now Offering A Version Of ‘The Joe Rogan Experience’ With The Joe Rogan Parts Bleeped OutAwesome: Spotify Is Now Offering A Version Of ‘The Joe Rogan Experience’ With The Joe Rogan Parts Bleeped Out Personal Responsibility FTW! Shaquille O’Neal Just Announced That His Children Won’t Inherit Any Of His Basketballs So They Can Learn To Acquire Basketballs On Their OwnPersonal Responsibility FTW! Shaquille O’Neal Just Announced That His Children Won’t Inherit Any Of His Basketballs So They Can Learn To Acquire Basketballs On Their Own Yeah, Good Luck Pal: This GoFundMe Isn’t Really Offering Any Perks For Donors Outside Of Having The Guy Not Die Of CancerYeah, Good Luck Pal: This GoFundMe Isn’t Really Offering Any Perks For Donors Outside Of Having The Guy Not Die Of Cancer **Trending News** **Trending Lifestyle** About Masthead Advertising Contact Privacy Policy Cookie policy (EU) Impressum Cookie policy (UK) Do Not Sell My Personal Information Cookie policy (CA) Disclaimer"}