{"id": 1249, "name": "Northwest Herald", "domain": "shawlocal.com/northwest-herald", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.shawlocal.com/northwest-herald/opinion/letters-to-the-editor/", "title": "Letters To The Editor", "content": "Sign in Subscribe Print Subscriber? Activate Now Manage Your Account Contact Log out Northwest Herald(Opens in new window) Subscribe to the Northwest Herald(Opens in new window) Digital Account(Opens in new window) Print Account(Opens in new window) Readers Choice / Best Of The Fox U Pick 'Em(Opens in new window) Top Workplaces Contact Us(Opens in new window) Games and Puzzles(Opens in new window) Crossword and Sudoku(Opens in new window) eNewspaper(Opens in new window) Text Alerts(Opens in new window) News - McHenry CountyLocal News(Opens in new window)Cary(Opens in new window)Crystal Lake(Opens in new window)Harvard(Opens in new window)Huntley(Opens in new window)Johnsburg(Opens in new window)Lake in the Hills(Opens in new window)Marengo(Opens in new window)McHenry(Opens in new window)Woodstock(Opens in new window)Business(Opens in new window)Crime & Courts(Opens in new window)Education(Opens in new window)Election(Opens in new window)Government(Opens in new window)Police Reports(Opens in new window)StateNation & World Local News(Opens in new window) Cary(Opens in new window) Crystal Lake(Opens in new window) Harvard(Opens in new window) Huntley(Opens in new window) Johnsburg(Opens in new window) Lake in the Hills(Opens in new window) Marengo(Opens in new window) McHenry(Opens in new window) Woodstock(Opens in new window) Business(Opens in new window) Crime & Courts(Opens in new window) Education(Opens in new window) Election(Opens in new window) Government(Opens in new window) Police Reports(Opens in new window) State Nation & World Local News(Opens in new window) Cary(Opens in new window) Crystal Lake(Opens in new window) Harvard(Opens in new window) Huntley(Opens in new window) Johnsburg(Opens in new window) Lake in the Hills(Opens in new window) Marengo(Opens in new window) McHenry(Opens in new window) Woodstock(Opens in new window) Business(Opens in new window) Crime & Courts(Opens in new window) Education(Opens in new window) Election(Opens in new window) Government(Opens in new window) Police Reports(Opens in new window) State Nation & World Sports - McHenry CountyMcHenry County Prep SportsAlden-Hebron High School sports(Opens in new window)Cary-Grove High School sports(Opens in new window)Crystal Lake Central High School sports(Opens in new window)Crystal Lake South High School sports(Opens in new window)Dundee-Crown High School sports(Opens in new window)Hampshire High School sports(Opens in new window)Harvard High School sports(Opens in new window)Huntley High School sports(Opens in new window)Jacobs High School sports(Opens in new window)Johnsburg High School sports(Opens in new window)Marengo High School sports(Opens in new window)Marian Central Catholic sports(Opens in new window)McHenry High School sports(Opens in new window)Prairie Ridge High School sports(Opens in new window)Richmond-Burton High School sports(Opens in new window)Woodstock High School sports(Opens in new window)Woodstock North High School sports(Opens in new window)Friday Night DriveAlden-Hebron High School football(Opens in new window)Cary-Grove High School football(Opens in new window)Crystal Lake Central High School football(Opens in new window)Crystal Lake South High School football(Opens in new window)Dundee-Crown High School football(Opens in new window)Hampshire High School football(Opens in new window)Harvard High School football(Opens in new window)Huntley High School football(Opens in new window)Jacobs High School football(Opens in new window)Johnsburg High School football(Opens in new window)Marengo High School football(Opens in new window)Marian Central Catholic football(Opens in new window)McHenry High School football(Opens in new window)Prairie Ridge High School football(Opens in new window)Richmond-Burton High School football(Opens in new window)Woodstock High School football(Opens in new window)Woodstock North High School football(Opens in new window)Friday Night Drive podcast(Opens in new window)BearsBears NewsBears PodcastSports Betting Guide(Opens in new window) McHenry County Prep Sports Alden-Hebron High School sports(Opens in new window) Cary-Grove High School sports(Opens in new window) Crystal Lake Central High School sports(Opens in new window) Crystal Lake South High School sports(Opens in new window) Dundee-Crown High School sports(Opens in new window) Hampshire High School sports(Opens in new window) Harvard High School sports(Opens in new window) Huntley High School sports(Opens in new window) Jacobs High School sports(Opens in new window) Johnsburg High School sports(Opens in new window) Marengo High School sports(Opens in new window) Marian Central Catholic sports(Opens in new window) McHenry High School sports(Opens in new window) Prairie Ridge High School sports(Opens in new window) Richmond-Burton High School sports(Opens in new window) Woodstock High School sports(Opens in new window) Woodstock North High School sports(Opens in new window) Friday Night Drive Alden-Hebron High School football(Opens in new window) Cary-Grove High School football(Opens in new window) Crystal Lake Central High School football(Opens in new window) Crystal Lake South High School football(Opens in new window) Dundee-Crown High School football(Opens in new window) Hampshire High School football(Opens in new window) Harvard High School football(Opens in new window) Huntley High School football(Opens in new window) Jacobs High School football(Opens in new window) Johnsburg High School football(Opens in new window) Marengo High School football(Opens in new window) Marian Central Catholic football(Opens in new window) McHenry High School football(Opens in new window) Prairie Ridge High School football(Opens in new window) Richmond-Burton High School football(Opens in new window) Woodstock High School football(Opens in new window) Woodstock North High School football(Opens in new window) Friday Night Drive podcast(Opens in new window) Bears Bears News Bears Podcast Sports Betting Guide(Opens in new window) McHenry County Prep Sports Alden-Hebron High School sports(Opens in new window) Cary-Grove High School sports(Opens in new window) Crystal Lake Central High School sports(Opens in new window) Crystal Lake South High School sports(Opens in new window) Dundee-Crown High School sports(Opens in new window) Hampshire High School sports(Opens in new window) Harvard High School sports(Opens in new window) Huntley High School sports(Opens in new window) Jacobs High School sports(Opens in new window) Johnsburg High School sports(Opens in new window) Marengo High School sports(Opens in new window) Marian Central Catholic sports(Opens in new window) McHenry High School sports(Opens in new window) Prairie Ridge High School sports(Opens in new window) Richmond-Burton High School sports(Opens in new window) Woodstock High School sports(Opens in new window) Woodstock North High School sports(Opens in new window) Friday Night Drive Alden-Hebron High School football(Opens in new window) Cary-Grove High School football(Opens in new window) Crystal Lake Central High School football(Opens in new window) Crystal Lake South High School football(Opens in new window) Dundee-Crown High School football(Opens in new window) Hampshire High School football(Opens in new window) Harvard High School football(Opens in new window) Huntley High School football(Opens in new window) Jacobs High School football(Opens in new window) Johnsburg High School football(Opens in new window) Marengo High School football(Opens in new window) Marian Central Catholic football(Opens in new window) McHenry High School football(Opens in new window) Prairie Ridge High School football(Opens in new window) Richmond-Burton High School football(Opens in new window) Woodstock High School football(Opens in new window) Woodstock North High School football(Opens in new window) Friday Night Drive podcast(Opens in new window) Bears Bears News Bears Podcast Sports Betting Guide(Opens in new window) McHenry County OpinionColumns(Opens in new window)Letters to the Editor(Opens in new window)Local Editorials(Opens in new window) Columns(Opens in new window) Letters to the Editor(Opens in new window) Local Editorials(Opens in new window) Columns(Opens in new window) Letters to the Editor(Opens in new window) Local Editorials(Opens in new window) The Scene(Opens in new window) Photo Galleries(Opens in new window) A&E(Opens in new window) Thank You Teachers(Opens in new window) Thank You Veterans(Opens in new window) Thank You First Responders(Opens in new window) Starved Rock Country(Opens in new window) The First Hundred Miles(Opens in new window) Obituaries(Opens in new window) Sponsored(Opens in new window) Photo Store(Opens in new window) Jobs(Opens in new window) Wheels(Opens in new window) Real Estate(Opens in new window) Classified(Opens in new window) Local Events Photo Store(Opens in new window) Public Notices Today's Ads(Opens in new window) Shaw Media Marketing(Opens in new window) Deals(Opens in new window) Historical Archive(Opens in new window) Shaw Careers(Opens in new window) Privacy Policy **Letter: How government is supposed to work** \"The lead-line water service program offered by the city of Crystal Lake was perfect,\" Mike Frett of Crystal Lake wrote in a letter to the editor. **Letter: Not all Catholics rejoiced** \"With a new pope elected who is not conservative, I highly doubt there was much rejoicing in Catholic churches in McHenry County,\" Ronald Lovatt of Crystal Lake wrote in a letter to the editor. **Letter: A teacher’s fear** \"One of our greatest fears. Knowing all our hard work falls on deaf ears. Or maybe we believe that there will be one. A shining star who thinks learning is fun,\" Gina Bilinski of McHenry writes in a letter to the editor. **Letter: The rest of the story…** \"Now what I, and I’m sure other readers, would like to see is an article on what EXACTLY the schools did with the portion of the $5.6 million taxpayer money they’ve already used,\" Linda Yackle of Crystal Lake writes in a letter to the editor. **Letter: What’s wrong with this picture?** \"No one’s perfect, but people need to be as pleasant as possible while out in public and at the workplace,\" Travis Hafford of Lake in the Hills writes in a letter to the editor. **Letter: Mercyhealth celebrates its nurses during Nurses Week** \"Nurses are the backbone of our health care system, consistently going above and beyond to make a meaningful difference in the lives of our patients and their families,\" Kara Sankey of Mercyhealth writes in a letter to the editor. **Letter: Worried sister asks Congress not to cut Medicaid** \"My brother is one of 79 million Americans, one in five that rely on Medicaid. What will happen to all of these people if Medicaid is cut?\" Nora Fox Handler of Woodstock writes in a letter to the editor. **Letter: Thank you to Jamaican medical mission** \"I would just like to send a thank you to the medical mission to Jamaica,\" Patrick “Babe” Turner of Port Antonio, Jamaica, a Cary-Grove graduate, writes in a letter to the editor. **Letter: Elected officials should be fined, jailed for not stopping corruption** \"There is a need to elect more officials who have great integrity and honesty so that such a law could be passed that would help stop corruption,\" Norman Jones of Crystal Lake writes in a letter to the editor. **Letter: Prescriptions much more expensive** **Letter: Prescriptions much more expensive** \"Can anybody guess why these drugs went up so much in only three months??\" Chuck Berndt of McHenry writes in a letter to the editor. \"Can anybody guess why these drugs went up so much in only three months??\" Chuck Berndt of McHenry writes in a letter to the editor. **Letter: Too much traffic in small downtown district** **Letter: Too much traffic in small downtown district** \"Stuck behind [a delivery truck] waiting to get around, sometimes five minutes or so, makes a great Tums commercial,\" Nancy Fike of McHenry writes in a letter to the editor. \"Stuck behind [a delivery truck] waiting to get around, sometimes five minutes or so, makes a great Tums commercial,\" Nancy Fike of McHenry writes in a letter to the editor. **Letter: Long wait but great staff at Social Security** **Letter: Long wait but great staff at Social Security** \"After reading Terry Trobiani’s letter concerning the Social Security system, I felt I had to share my experience,\" Debra Gummerson of Crystal Lake writes in a letter to the editor. \"After reading Terry Trobiani’s letter concerning the Social Security system, I felt I had to share my experience,\" Debra Gummerson of Crystal Lake writes in a letter to the editor. **Letter: My first Trump protest** **Letter: My first Trump protest** \"It was a cool spring morning as I made my way to my first Trump protest in Algonquin. I had no idea how many would turn out,\" Randy Parmec of Algonquin writes in a letter to the editor. \"It was a cool spring morning as I made my way to my first Trump protest in Algonquin. I had no idea how many would turn out,\" Randy Parmec of Algonquin writes in a letter to the editor. **Letter: Carpentersville fire a reminder to check basement windows, exit routes** **Letter: Carpentersville fire a reminder to check basement windows, exit routes** \"In light of the recent fire deaths of three small brothers in Carpentersville, please check your safety exit windows and the grates covering the window wells,\" Julie Jette of Cary writes in a letter to the editor. \"In light of the recent fire deaths of three small brothers in Carpentersville, please check your safety exit windows and the grates covering the window wells,\" Julie Jette of Cary writes in a letter to the editor. **Letter: Civics lesson for newly elected officials** **Letter: Civics lesson for newly elected officials** \"Trustees should be a check on the bureaucracy – skeptics, not cheerleaders,\" Steve Willson of Huntley writes in a letter to the editor. \"Trustees should be a check on the bureaucracy – skeptics, not cheerleaders,\" Steve Willson of Huntley writes in a letter to the editor. **Letter: Ald. Vic Santi backs Bobbi Baehne as successor on McHenry City Council** **Letter: Ald. Vic Santi backs Bobbi Baehne as successor on McHenry City Council** \"I previously worked with Bobbi and admire her independent approach to issues with the City of McHenry,\" retiring Ward 1 Alderman Vic Santi writes in a letter to the editor. \"I previously worked with Bobbi and admire her independent approach to issues with the City of McHenry,\" retiring Ward 1 Alderman Vic Santi writes in a letter to the editor. **Letter: Give up TV news for Lent** **Letter: Give up TV news for Lent** \"I must clearly warn you this will be difficult, but well worth it,\" Daniel Malecki of Crystal Lake writes in a letter to the editor. \"I must clearly warn you this will be difficult, but well worth it,\" Daniel Malecki of Crystal Lake writes in a letter to the editor. **Letter: Social Security unreachable** **Letter: Social Security unreachable** \"I hope some of you out there aren’t in dire need of help with this office. I personally have called the office number 11 times,\" Terry Trobiani of Crystal Lake writes in a letter to the editor. \"I hope some of you out there aren’t in dire need of help with this office. I personally have called the office number 11 times,\" Terry Trobiani of Crystal Lake writes in a letter to the editor. **Letter: Choose wisely in Huntley District 158** **Letter: Choose wisely in Huntley District 158** \"The school board has control of the education of our youth and the majority of our property taxes. Learn about the candidates and choose wisely!\" Kimberly Skaja of Union writes in a letter to the editor. \"The school board has control of the education of our youth and the majority of our property taxes. Learn about the candidates and choose wisely!\" Kimberly Skaja of Union writes in a letter to the editor. **Letter: ‘The man you need for highway commissioner’** **Letter: ‘The man you need for highway commissioner’** \"If you live in Nunda, Mike Lesperance is the man you need for highway commissioner,\" Deb Naughton of McHenry writes in a letter to the editor. \"If you live in Nunda, Mike Lesperance is the man you need for highway commissioner,\" Deb Naughton of McHenry writes in a letter to the editor. **Letter: Vote Kownick for Cary mayor** **Letter: Vote Kownick for Cary mayor** \"It is my sincere hope that Mark [Kownick] will continue his work for as long as he is willing,\" Jack Schaffer of Cary writes in a letter to the editor. \"It is my sincere hope that Mark [Kownick] will continue his work for as long as he is willing,\" Jack Schaffer of Cary writes in a letter to the editor. **Letter: McClatchey readily available to listen to residents** **Letter: McClatchey readily available to listen to residents** \"Frank McClatchey is a livelong friend as we both grew up in McHenry. I know through many conversations that he would be the best choice for alderman of the 3rd Ward,\" Kent Thomas of McHenry writes in a letter to the editor. \"Frank McClatchey is a livelong friend as we both grew up in McHenry. I know through many conversations that he would be the best choice for alderman of the 3rd Ward,\" Kent Thomas of McHenry writes in a letter to the editor. **Letter: McClatchey puts needs of his constituents first** **Letter: McClatchey puts needs of his constituents first** \"I have known Frank McClatchey since we were kids growing up in McHenry,\" Lolly Meyer of McHenry writes in a letter to the editor. \"I have known Frank McClatchey since we were kids growing up in McHenry,\" Lolly Meyer of McHenry writes in a letter to the editor. **Letter: ‘Unwavering support’ for Devon Hubbard Tessmer** **Letter: ‘Unwavering support’ for Devon Hubbard Tessmer** \"As a lifelong resident of Crystal Lake, Devon is a proven leader with a deep commitment to our community and a prudent vision for strengthening our schools now and into the future,\" Michael K. Smith of Crystal Lake writes in a letter to the editor. \"As a lifelong resident of Crystal Lake, Devon is a proven leader with a deep commitment to our community and a prudent vision for strengthening our schools now and into the future,\" Michael K. Smith of Crystal Lake writes in a letter to the editor. **Recent Articles** **Woodstock Buffalo Wild Wings to open Friday** **Woodstock Buffalo Wild Wings to open Friday** **5 Things to Do: Pride Fest in Woodstock and a park picnic in Huntley** **5 Things to Do: Pride Fest in Woodstock and a park picnic in Huntley** **Silesia Flavors breaks ground in Huntley on 130,000-square-feet building** **Silesia Flavors breaks ground in Huntley on 130,000-square-feet building** **Woodstock Shakespeare Players to bring inventive mashup to square** **Woodstock Shakespeare Players to bring inventive mashup to square** **Oliver: Alzheimer’s Association offers tips to help all take charge of their brain health** **Oliver: Alzheimer’s Association offers tips to help all take charge of their brain health** Copyright © 2023 Shaw Local News Network Copyright © 2023 Shaw Local News Network"}