{"id": 2098, "name": "Philippine Star", "domain": "philstar.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.philstar.com/business/motoring/2025/05/19/2439516/toyota-gazoo-racing-philippines-pushing-limits-inclusive-thrilling-motorsports-filipinos", "title": "Toyota Gazoo Racing Philippines Pushing Limits Inclusive Thrilling Motorsports Filipinos", "content": "Philstar.comHOMEHeadlinesOpinionNationWorldBusinessSportsEntertainmentLifestyleOther Sections HOME Headlines Opinion Nation World Business Sports Entertainment Lifestyle Other Sections HOME Headlines Opinion Nation World Business Sports Entertainment Lifestyle Other Sections The Philippine Star Pilipino Star NgayonHOMEBansaMetroProbinsiyaOpinyonPalaroShowbizTrue ConfessionsDr. LoveLitra-talkKutobKomiks HOME Bansa Metro Probinsiya Opinyon Palaro Showbiz True Confessions Dr. Love Litra-talk Kutob Komiks HOME Bansa Metro Probinsiya Opinyon Palaro Showbiz True Confessions Dr. Love Litra-talk Kutob Komiks The FreemanHOMECebu NewsOpinionMetro CebuRegionCebu BusinessCebu SportsCebu LifestyleCebu Entertainment HOME Cebu News Opinion Metro Cebu Region Cebu Business Cebu Sports Cebu Lifestyle Cebu Entertainment HOME Cebu News Opinion Metro Cebu Region Cebu Business Cebu Sports Cebu Lifestyle Cebu Entertainment Pang-MasaHOMEPolice MetroPunto MoPang MoviesPM SportsPara ManaloPara Malibang HOME Police Metro Punto Mo Pang Movies PM Sports Para Manalo Para Malibang HOME Police Metro Punto Mo Pang Movies PM Sports Para Manalo Para Malibang BanatHOMEBalitaOpinyonKalingawanShowbizPalaroImong KapalaranPunsoy HOME Balita Opinyon Kalingawan Showbiz Palaro Imong Kapalaran Punsoy HOME Balita Opinyon Kalingawan Showbiz Palaro Imong Kapalaran Punsoy InteraksyonHOMETrends + SpotlightsPolitics + IssuesCelebritiesHobbies + InterestsRumor Cop HOME Trends + Spotlights Politics + Issues Celebrities Hobbies + Interests Rumor Cop HOME Trends + Spotlights Politics + Issues Celebrities Hobbies + Interests Rumor Cop CouponsHOMETop StoresOffers By CategoryLatest Posts HOME Top Stores Offers By Category Latest Posts HOME Top Stores Offers By Category Latest Posts CRYPTO CURRENTLY STOCK COMMENTARIES TECHNOLOGY BUSINESS AS USUAL BANKING REAL ESTATE AGRICULTURE TELECOMS BIZ MEMOS My Profile Sign Out navbusiness==HOME HEADLINES OPINION NATION WORLD BUSINESS SPORTS ENTERTAINMENT LIFESTYLE OTHER SECTIONS **Motoring** **Toyota Gazoo Racing Philippines: Pushing the limits for inclusive, thrilling motorsports for Filipinos** **2025 TGR season kicks off, marking a new chapter with fresh starts, exciting comebacks** CLARK, Philippines — Eleven years into its motorsports program, Toyota Motor Philippines (TMP) continues its mission to celebrate racing talent, car culture, and the Filipino spirit of challenge with TOYOTA GAZOO Racing (TGR). The recently concluded first race weekend of the TGR Philippine Cup, the mobility company’s premier racing series, shows that motorsports is alive more than ever in the country. What started with the locally made Vios OMR or one-make-race car has grown into a vibrant motorsports platform that brings together competition, community and accessibility among Filipino motoring fans. This year’s first TGR Philippine Cup race weekend, held at the Clark International Speedway last March 22, roared to life with thrilling battles on the track and an even bigger goal off it: to make motorsports something everyone can be part of—whether you're a seasoned driver, a rookie or simply a fan of speed. “It is my wish that more people can share the motorsport experience and the inspiration to always be pushing their limits for the better. We are all part of this mission by continuously innovating and providing opportunities for both aspiring and seasoned racers to showcase their skills,” shared Toyota Motor Philippines President Masando Hashimoto. “Our recent feats prove that our dedication to test and develop more capable and better cars is real. At TGR Philippines, we stay committed to growing an inclusive and exciting motorsports community where we can all come together and celebrate our love for cars and motorsports,” he added. **A starting line for everyone** Every racing journey has to start somewhere. For most racers in the TGR Philippine Cup, that “somewhere” is the TOYOTA GAZOO Racing Academy Philippines (TGRA)—a program built for aspiring racers who want to experience the thrill of the track for the very first time. Held at the Clark International Speedway, this year’s TGRA guided new racers through classroom and on-track sessions, turning nervous energy into confidence behind the wheel. Professional coaches taught students the ropes of racing and showed them how to apply them on the racetrack. But this season isn’t just about fresh starts—it’s also about comebacks. The newly introduced Legacy Class in the TGR Philippine Cup brought former Vios Cup racers back into the fold, adding a new layer of excitement as seasoned drivers returned to relive the thrill of competition and get another shot at glory. “Previously named the Vios Cup, the now TOYOTA GAZOO Racing Philippine Cup has been running for 11 years now, and we always target to make it even more thrilling, more exciting for racers, thrill-seekers and motorsports fans,” shared TMP AVP for Marketing Services Andy Ty. Beyond the track, Toyota ensured there was something for every kind of motorsport enthusiast. Spectators experienced heart-racing side activities, including drifting demonstrations and high-speed hot laps featuring the new GR Yaris and GR Supra. Fans also got to see up-close Toyota’s GR lineup and Lexus’ F SPORT lineup and enjoy sim and remote control racing. “With our motorsports program, we believe that seeing is believing—and experiencing it is another level entirely,” Ty said, adding, “We hope you can join us at our events to truly see and feel what it’s like to be on track and push your limits for better.” **Representation and the rise of new faces** Once seen as a niche or elite pursuit, motorsports is becoming more diverse and inclusive—thanks in large part to Toyota’s efforts. From celebrities and influencers to executives like TMP President Hashimoto himself, the TGR Philippine Cup is proof that the thrill of racing knows no bounds. This year’s grid also made room for a growing number of women racers like Arianne Bautista, Maila Alivia and Julia de los Angeles who raced shoulder to shoulder with veterans and newcomers alike, making a powerful statement that motorsports is for everyone. “Right now, in this season, we’re just three girls, and we’re really competing for our lives here. It’s a sign that anybody can do this sport, as long as you have the will and the skills, you can. This is genderless,” Bautista toldPhilstar.com. Also back on the grid, content creator and motoring enthusiast Reph Bangsil couldn’t hide his excitement about racing again in the TGR Philippine Cup. “I love everything about racing in the TGR Philippine Cup. I love the thrill, the adrenaline—every time I go out there, my heart beats so fast. It’s like you’re in a different dimension whenever you’re around the track. It really is the thrill of a lifetime,” he said in an interview. **Bringing the GR spirit to the Philippines** Toyota's journey in motorsports has been one of bold moves and continuous innovation, both globally and in the Philippines. It all began in 2007 when then-Vice President Akio Toyoda drove a second-hand Altezza through the grueling Nürburgring 24 Hours with a small team of mechanics. This race sparked the creation of Team GAZOO and marked the beginning of Toyota’s vision for performance: \"Roads build people, and people build cars.\" By 2009, Team GAZOO was already competing in global championships, solidifying its presence on the international motorsports stage. Fast forward to 2017, GAZOO Racing Company was established, expanding its reach to include the design and retailing of performance parts as well as reproducing components for Toyota’s iconic sports cars from the 1970s to 1980s. As we know it, the Vios Cup has evolved into the TGR Philippine Cup, aligning the Philippines’ premier racing series with Toyota's global GAZOO Racing brand and signaling a deeper commitment to motorsports excellence in the country. Reaching a new milestone this 2025 season, it introduced the all-new Club Race, providing a platform to GR performance cars such as the GR Supra, GR 86, and GR Yaris. Drivers can compete in their respective models, further taking the Philippine motorsports scene to new heights. In its 11 seasons, the TGR Philippine Cup has also cultivated racing talent and grown their love for the sport, both in sim racing and real-world competition. Drivers like Luis Moreno, who transitioned from virtual racing to the Novice Class after securing the championship at the 2024 TOYOTA GAZOO Racing GT Cup Philippines, and second place at the 2023 TOYOTA GAZOO Racing GT Cup Asia Finals, are proof of the program's success. Similarly, 2024 Novice Class champion Russel Reyes has advanced to the Sporting Class, showcasing the progression from sim racing to the racetrack. **The road ahead** By fostering inclusivity and ensuring the sport’s continuous evolution, TOYOTA GAZOO Racing Philippines is solidifying its pivotal role in shaping the future of motorsports in the country. With the first race weekend setting a high standard for the season, anticipation continues to build for the next two race weekends. Happening on May 24 and 25 in the South of Manila, Villar City, the second race weekend is promising even more intense rivalries, high-speed action and unforgettable moments—on the streets. Stay tuned as TOYOTA GAZOO Racing Philippines continues to push the limits of speed, skill and sportsmanship. Visithttps://www.toyota.com.ph/tgrphilippinesand follow TOYOTA GAZOO Racing Philippines onFacebook,Instagram,XandTikTokfor the latest updates.— JAP TOBIAS Editor’s Note:This #Brandspace story is created with Toyota. It is published by the Advertising Content Team that is independent of our Editorial newsroom. **Thousands join SM Cares’ coastal cleanup in celebration of World Oceans Day 2025** **Thousands join SM Cares’ coastal cleanup in celebration of World Oceans Day 2025** **Belo Medical Group recognized with Platinum Award for Profhilo Excellence at IBSA Neoasia 2025** **Belo Medical Group recognized with Platinum Award for Profhilo Excellence at IBSA Neoasia 2025** **Epson Philippines celebrates partnerships and progress at Fusion 16** **Epson Philippines celebrates partnerships and progress at Fusion 16** **Taft Properties' Symfoni Kamias hits high note with successful topping off ceremony** **Taft Properties' Symfoni Kamias hits high note with successful topping off ceremony** **HOPE launches Generation HOPE with Filipino brands to build classrooms for the next generation** **HOPE launches Generation HOPE with Filipino brands to build classrooms for the next generation** **Bora with the fam? Azalea Boracay lets you feel right at home, just steps from the white sands** **Bora with the fam? Azalea Boracay lets you feel right at home, just steps from the white sands** **Unpredictable weather? Here’s how we stayed in and played for hours with the vivo Y29** **Unpredictable weather? Here’s how we stayed in and played for hours with the vivo Y29** **What is the future of food? ‘Functional’ food, alternative proteins, exciting innovations at THAIFEX-Anuga Asia 2025** **What is the future of food? ‘Functional’ food, alternative proteins, exciting innovations at THAIFEX-Anuga Asia 2025** **Affordable, flexible plans to help Filipinos achieve their life goals** **Affordable, flexible plans to help Filipinos achieve their life goals** **SM Supermalls to hold Kalayaan Job Fairs on June 12** **SM Supermalls to hold Kalayaan Job Fairs on June 12** Latest **Toyota Motor Philippines introduces ‘rally-raised, road-ready' New GR Yaris** **Exploring the Philippines with Bridgestone’s Dueler All-Terrain A/T002** **Suzuki Philippines, Jimny Hub celebrate the spirit of adventure at Jimnyfest 2025** **The dates are here for Toyota Gazoo Racing Philippine Cup’s 11th season** **Subscribe and drive? How car leasing works via Toyota Kinto One** **House defers receipt of remanded impeach complaint** **Duterte petition to disqualify 2 ICC judges junked** **House defers acceptance of impeachment articles from Senate** **Demanding; remanded** **Sara Duterte's trial: House prosecution seeks clarification to Senate order** **House defers receipt of remanded impeach complaint** **Duterte petition to disqualify 2 ICC judges junked** **House defers acceptance of impeachment articles from Senate** **Demanding; remanded** **Sara Duterte's trial: House prosecution seeks clarification to Senate order** Philstar.com is one of the most vibrant, opinionated, discerning communities of readers on cyberspace. With your meaningful insights, help shape the stories that can shape the country. Sign up now! **Get Updated:** Signup for the News Round now"}