{"id": 198, "name": "Carolina Public Press", "domain": "carolinapublicpress.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://carolinapublicpress.org/69668/western-nc-forest-plan-under-pressure-from-storm-devastation-lawsuit-and-trump/", "title": "Western Nc Forest Plan Under Pressure From Storm Devastation Lawsuit And Trump", "content": "Politics & Government Health Economy Environment Crime & Justice En español About Newsletters Special Reports Donate CPP East Shop Events Facebook Twitter Instagram RSS About Newsletters Special Reports Donate CPP East Shop Events Facebook Twitter Instagram RSS Carolina Public Press Carolina Public Press provides in-depth, investigative reporting on issues affecting North Carolina in a nonprofit, nonpartisan setting. Politics & Government Health Economy Environment Crime & Justice En español **Western NC forest plan under pressure from storm devastation, lawsuit and Trump** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email **Before you go …** If you like what you are reading and believe in independent, nonprofit, nonpartisan journalism like ours—journalism the way it should be—please contribute to keep us going. Reporting like this isn’t free to produce and we cannot do this alone. Thank you! A decade in the making, the future of the forest plan to manage WesternNorth Carolina’snational forests is now hazy, threatened by a lawsuit, a presidential executive order accelerating timber production, and thescars of Hurricane Helene, which leveled thousands of acres of forest. Finalized in 2023, the forest plan sets out a strategy to restore the integrity of forests, ecosystems and watersheds within the Pisgah and Nantahala national forests, however, the agency executes specific actions on the project level. The agency analyzes and carries out each project it proposes, including logging projects, within the framework of the forest plan. The focus and scale of timber projects, however, are in flux. A new lawsuit filed by the Southern Environmental Law Center challenges the plan at the same time as a federal directive may force the Forest Service to accelerate logging across national forests, deepening concerns over environmental harm. The lawsuit filed on March 28 by the Southern Environmental Law Center on behalf of four environmental organizations alleges that Hurricane Helene exposed critical flaws in the Nantahala-Pisgah Forest Plan, which underestimates climate-driven storm impacts and promotes high levels of timber harvesting. “Our national forests are reeling from massive storm destruction, yet they’re still subject to a management plan that includes unrealistic timber targets,” saidDavid Reid, of the Sierra Club’s North Carolina Chapter, one of the litigants. “Failing to change the Plan would create additional threats to the natural beauty treasured by millions of visitors.” The suit is the third connected to one of the two Western NC national forests that the Virginia-based nonprofit legal organization has filed since early 2024. In February 2024, the SELC opposed a 15-acre timber sale in the Nantahala National Forest. The Forest Service announced it would not harvest the trees last June. And in April 2024, the SELC sued the Forest Service again, arguing that the forest plan aims to significantly increase timber production threatening sensitive areas andendangered bats. The ongoing legal action alleged the forest plan’s analysis was flawed and violated the Endangered Species Act by failing to study the plan’s impact on federally protected bats, endangering their survival and causing broader ecological consequences. “We’ve given the agency every possible opportunity to do the right thing and fix the plan, but the Forest Service has refused,” said attorneySam Evansof the SELC. Evans estimated that “somewhere between 10% and 20% of the forest has some meaningful level of damage” due to Helene. That amounts to 100,000 to 200,000 acres of impacted forest. “We simply can’t stand by and ignore the significant and long-lasting harm this plan will do to these remarkable forests and the communities that rely on them,” he said. The Forest Service did not comment on litigation regarding the Nantahala and Pisgah Forest Plan. By law, the agency has 60 days to respond to the allegations in the complaint. Meanwhile, the Trump Administration is pressuring the Forest Service to go in the opposite direction, logging more trees on millions of acres of national forest throughout the Western and Southeastern U.S. On April 3, the US Department of Agriculture secretaryBrooke Rollinsreleased an emergency order memo to address “declining forest health.” The directive aims to boost timber production by streamlining processes, enhancing efficiency and consistency, and proposing legislative changes to support sustainable forest management. The memo said the changes will streamline Forest Service project planning, decision making and implementation. The memo also instructs National Forest units to limit the number of project alternatives presented in an environmental assessment, potentially limiting or overlooking more environmentally sound alternatives. The directive seeks to increase timber production by 25%, which represents a tall order for an agency that recently experienced staffing cuts, Evans said. “You don’t (increase timber production) by that level by being careful and making sure that you’re not harming rare species, closing important recreational areas or protecting scenery,” Evans said. “You do it by taking procedural shortcuts to put logs on trucks with the bare minimum of resources.” The SELC is currently examining the presidential directive and considering its response. **Related** Republish This Story This work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License. You may republish our stories for free, online or in print. Simply copy and paste the article contents from the box below. Note, some images and interactive features may not be included here. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. **Western NC forest plan under pressure from storm devastation, lawsuit and Trump** by Jack Igelman, Carolina Public PressApril 8, 2025 **Jack Igelman** Jack Igelman is a contributing reporter with Carolina Public Press. Contact him atjack@igelman.com. **Latest News** **** **Trains rolling again in Western NC. Rail repairs after Helene continue.** **Looting and fraud that didn’t happen. Warnings seem to have stopped many crooks after Helene.** **Hunger already an issue in post-Helene Western NC. Signs it could get much worse.** **Changing of the guard. New and outgoing NC elections directors offer opposing perspectives.** **Rebuild with resilience. Listening to NC people along flood-prone streams, yields insights, solutions, hope.** **Support investigative journalism in North Carolina** With the support of readers like you, we provide thoughtfully researched articles for a more informed and connected community. This is your chance to support credible, community-based, public-service journalism. Please join us! Facebook Twitter Instagram RSS Republish Our Content Carolina Public Press: The Next 10 Years Careers, Freelancing & Internships Staff & Contributors Annual Report 2021 Editorial & Privacy Policies Sign Up For Free Speakers Bureau **Contact Us** (828) 774-5290 news@carolinapublicpress.org EIN: 46-0801080 **Carolina Public Press Mission** Carolina Public Press is an independent nonprofit news organization dedicated to nonpartisan, in-depth and investigative news built upon the facts and context North Carolinians need to know. Our award-winning, breakthrough journalism dismantles barriers and shines a light on the critical overlooked and under-reported issues facing our state’s more than 11 million residents.Your support funds important public-interest journalism."}