{"id": 484, "name": "Daily Freeman-Journal", "domain": "freemanjournal.net", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.freemanjournal.net/news/local-news/2025/06/ryan-melton-says-he-will-prioritize-rural-revitalization-anti-corruption-efforts-public-health/", "title": "Ryan Melton Says He Will Prioritize Rural Revitalization Anti Corruption Efforts Public Health", "content": "NewsLocal NewsBusiness BriefsNews of RecordIowa NewsNational NewsInternational News Local News Business Briefs News of Record Iowa News National News International News Local News Business Briefs News of Record Iowa News National News International News SportsLocal SportsWebster City LynxIowa SportsNational Sports Local Sports Webster City Lynx Iowa Sports National Sports Local Sports Webster City Lynx Iowa Sports National Sports OpinionLocal ColumnsEditorialsLetters to Editor Local Columns Editorials Letters to Editor Local Columns Editorials Letters to Editor LifeLifestyle BriefsWeddings and EngagementsBirthdays and AnniversariesBirths Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries Births Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries Births ObituariesView ObituariesPlace Obit View Obituaries Place Obit View Obituaries Place Obit Classifieds Jobs Garage Sales Contact InformationContact UsSubmit NewsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Legal NoticesView a NoticePlace Notice View a Notice Place Notice View a Notice Place Notice News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Ryan Melton says he will prioritize rural revitalization, anti-corruption efforts, public health** **** Jun 10, 2025 Ryan Melton is again challenging U.S. Rep. Randy Feenstra for his seat in Iowa’s 4th Congressional District. Melton, of Webster City, has been a vocal critic of incumbent Feenstra’s support for carbon capture pipelines and his taking of tens of thousands of dollars from pipeline advocates, according to a media release from Melton’s campaign. “Our district deserves a representative who listens to its constituents and acts in their best interests. Right now, we have a representative in Randy Feenstra who relies mostly on out-of-state corporate PAC money, which has rendered him unable to represent his constituents because he’s beholden to the billionaires,” Melton said. He vows to continue his rejection of any corporate PAC money in order to speak truth to power without hesitation, and to remain an independent thinker not reliant on oligarchs, D.C. consultants or party talking points in order to put the people first, his media release states. “From tackling Iowa’s rising cancer rates and decline in water quality, to opposing the abuse of eminent domain for carbon capture pipelines, to challenging the status quo economically that has left so many of us in the 4th behind, I’m committed to bringing real change to our communities that for far too long have been neglected by our representatives in Congress.” Melton was the Democratic nominee in both 2022 and 2024. In a media release, he said he is launching his 2026 campaign after improving his performance in 33 of the district’s 36 counties while remaining steady in the other three in 2024. The challenger has also been openly critical of Feenstrat in “his avoidance of public pre-announced town halls, the fact he isn’t writing bills that become law, his unwillingness to call President (Donald) Trump out on his trade war actions that close off our farmers’ market access and threaten the closure of our small businesses or the budget he supports that would cut Medicaid and SNAP benefits, and his rejection of federal community improvement earmark money that we sorely need.” He added, “While Congressional Republicans in Iowa’s other three districts have brought back millions of dollars to their communities via the federal community improvement program, Feenstra leaves federal tax dollars that come out of our checks on the table while our infrastructure crumbles and our towns shrink from lack of funding.” Melton holds a Bachelor’s degree in history and political science from Iowa State University and a Master’s degree in U.S. History from the University of Kansas. He and his wife, Laura, have two sons, Lincoln and Nigel. **Newsletter** **Local News** **Local News** **Webster County Roads foreman pulls man from burning semi following accident** **Webster County Roads foreman pulls man from burning semi following accident** **Ryan Melton says he will prioritize rural revitalization, anti-corruption efforts, public health** **Ryan Melton says he will prioritize rural revitalization, anti-corruption efforts, public health** **Volunteers are encouraged to help with clean-up day on Saturday** **Volunteers are encouraged to help with clean-up day on Saturday** The City of Webster City is encouraging community members to volunteer to help with the clean-up event on June 14 ... **Iowa egg supplier denies allegations of human trafficking** **Iowa egg supplier denies allegations of human trafficking** An Iowa industrial egg supplier is denying allegations that it engaged in human trafficking or threatened immigrant ... **Passionate gardener** **Passionate gardener** **Wilson Brewer Park Foundation Board will meet Wednesday** **Wilson Brewer Park Foundation Board will meet Wednesday** The Wilson Brewer Park Foundation Board will meet Wednesday, June 11, in the basement of the Wilson Brewer Park ... MOST READ **STEEP CLIMB** **STEEP CLIMB** **Lynx can’t slow down Algona** **Lynx can’t slow down Algona** **Title for Rampage in Ankeny** **Title for Rampage in Ankeny** **Gary Gourley** **Gary Gourley** **Newsletter** **Starting at $3.46/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsBusiness BriefsIowa NewsObituaries Local News Business Briefs Iowa News Obituaries Local News Business Briefs Iowa News Obituaries SportsLocal SportsWebster City LynxIowa SportsNational Sports Local Sports Webster City Lynx Iowa Sports National Sports Local Sports Webster City Lynx Iowa Sports National Sports OpinionLocal ColumnsEditorialsLetters to Editor Local Columns Editorials Letters to Editor Local Columns Editorials Letters to Editor LifeLifestyle BriefsWeddings and EngagementsBirthdays and AnniversariesBirths Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries Births Lifestyle Briefs Weddings and Engagements Birthdays and Anniversaries Births ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Ogden Newspapers of Iowa, LLC | https://www.freemanjournal.net | P.O. Box 490, Webster City, IA 50595 |"}