{"id": 1289, "name": "Utah Standard-Examiner", "domain": "standard.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.standard.net/top-headlines/2025/jun/11/police-arrest-more-than-20-people-on-first-night-of-curfew-aimed-at-protests-in-downtown-los-angeles/", "title": "Police Arrest More Than 20 People On First Night Of Curfew Aimed At Protests In Downtown Los Angeles", "content": "NewsLocal NewsBusinessEducationEnvironmentGovernmentMilitaryNational News Local News Business Education Environment Government Military National News Local News Business Education Environment Government Military National News LifestyleFaithFoodHealthHome And FamilyRecreationTxWestern Wasatch Faith Food Health Home And Family Recreation Tx Western Wasatch Faith Food Health Home And Family Recreation Tx Western Wasatch OpinionBeyond BarsCartoonsGuest CommentaryLettersNational CommentaryOur ViewStandard Deviations Beyond Bars Cartoons Guest Commentary Letters National Commentary Our View Standard Deviations Beyond Bars Cartoons Guest Commentary Letters National Commentary Our View Standard Deviations SportsHigh School SportsOgden RaptorsWeber StateNational Sports High School Sports Ogden Raptors Weber State National Sports High School Sports Ogden Raptors Weber State National Sports Police FireCourts Courts Courts AnnouncementsAnniversariesBirthdaysMemoriamsObituariesWeddings Anniversaries Birthdays Memoriams Obituaries Weddings Anniversaries Birthdays Memoriams Obituaries Weddings EntertainmentArtsMovies TvMusicTheater Arts Movies Tv Music Theater Arts Movies Tv Music Theater Today’s Paper Manage Your Subscription Deals ContactContact UsSubmit NewsStatement of ValuesFacebookLinkedInTwitterYouTubePrivacy PolicyTerms of Use Contact Us Submit News Statement of Values Facebook LinkedIn Twitter YouTube Privacy Policy Terms of Use Contact Us Submit News Statement of Values Facebook LinkedIn Twitter YouTube Privacy Policy Terms of Use Jobs Public NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice News Lifestyle Opinion Sports Obituaries Place Notice Today’s Paper Submit News **Police arrest more than 20 people on first night of curfew aimed at protests in downtown Los Angeles** **** Damian Dovarganes, Associated PressProtesters gather to denounce ICE, U.S. Immigration and Customs Enforcement, operations Tuesday, June 10, 2025, in Los Angeles. Damian Dovarganes, Associated Press Damian Dovarganes, Associated Press LOS ANGELES — Police arrested more than 20 people, mostly on curfew violations, on the first night of restrictions in downtown Los Angeles and used crowd-control projectiles to break up hundreds of protesters demonstrating againstPresident Donald Trump’s immigration crackdown, officials said Wednesday. But there werefewer clashesbetween police and demonstrators than on previous nights, and by daybreak the downtown streets were bustling with residents walking dogs and commuters clutching coffee cups. Officials said the curfew was necessary to stop vandalism and theft by agitators looking to cause trouble after five days of protests, which have mostly been concentrated downtown. The curfew covers a 1-square-mile (2.5-square-kilometer) section that includes an area where protests have occurred since Friday in the sprawling city of 4 million. The city of Los Angeles encompasses roughly 500 square miles (1,295 square kilometers). Some 2,000 National Guard soldiers are in the city, and about half of them have been protecting federal buildings and agents, said Army Maj. Gen. Scott Sherman, head of Task Force 51, which is overseeing the deployment of National Guard and Marines to Los Angeles. About 700 Marines will soon join the Guard troops, but they are still undergoing training and will not be mobilized Wednesday, Sherman said. Another 2,000 Guard troops should be on the streets by Thursday, he said. Democratic Gov. Gavin Newsom hasaccused Trump of drawing a “military dragnet”across the nation’s second-largest city with his escalating use of the National Guard, which Trump activated, along with the Marines, over the objections of city and state leaders. Newsom asked a court to put an emergency stop to the military helping federal immigration agents. The assistance includes some guardsmen now standing protectively around agents as they carry out arrests. The governor said the military presence would only heighten tensions and civil unrest. A judge set a hearing for Thursday, giving the administration several days to continue its activities. The change moves the military closer to engaging in law enforcement actions such as deportations, asTrump has promisedas part of hisimmigration crackdown. The Guard has the authority to temporarily detain people who attack officers, but any arrests would be made by law enforcement. The president posted on the Truth Social platform that the city “would be burning to the ground” if he had not sent in the military. Demonstrations have spreadto other cities nationwide, including Dallas and Austin in Texas, and Chicago and New York, where thousands rallied and multiple arrests were made. New York City police said they took 86 people into custody during protests in lower Manhattan from Tuesday evening into Wednesday morning. Police Commissioner Jessica Tisch said the vast majority of demonstrators were peaceful. In Texas, where police in Austin used chemical irritants to disperse several hundred demonstrators Monday, Republican Gov. Greg Abbott’s office said Texas National Guard troops were “on standby” in areas where demonstrations are planned. Guard members were sent to San Antonio, but Police Chief William McManus said he had not been told how many troops were deployed or their role ahead of planned protests Wednesday night and Saturday. Los Angeles Mayor Karen Bass declared a local emergency and said the 8 p.m.-to-6 a.m. curfew is expected to last several days. “We reached a tipping point” after 23 businesses were looted, Bass said Tuesday. The curfew doesn’t apply to residents who live in the designated area, people who are homeless, credentialed media or public safety and emergency officials, Police Chief Jim McDonnell said. He said “unlawful and dangerous behavior” had been escalating since Saturday and that the curfew was needed to protect lives and property. Trump left open the possibility of invoking the Insurrection Act, which authorizes the president to deploy military forces inside the U.S. to suppress rebellion or domestic violence or to enforce the law in certain situations. It’s one of the most extreme emergency powers available to a U.S. president. “If there’s an insurrection, I would certainly invoke it. We’ll see,” he said from the Oval Office. Later the president called protesters “animals” and “a foreign enemy” ina speech at Fort Bragg. Trumphas described Los Angeles in dire terms that Bass and Newsom say arenowhere close to the truth. In a public address Tuesday evening, Newsom called Trump’s actions the start of an “assault” on democracy. “California may be first, but it clearly will not end here. Other states are next,” he said. Newsom warned people against inciting violence, but he urged them to stand up to the president’s actions. The protests began Friday after federal immigration raids arrested dozens of workers in Los Angeles. Protesters blocked a major freeway and set cars on fire over the weekend, andpolice respondedwith tear gas, rubber bullets and flash-bang grenades. Thousands of people have peacefully rallied outside City Hall and hundreds more protested outside a federal complex that includes a detention center where some immigrants are being held following workplace raids. Despite the protests, immigration enforcement activity has continued throughout the county, with city leaders and community groups reporting U.S. Immigration and Customs Enforcement present at libraries, car washes and Home Depots. School graduations in Los Angeles have increased security over fears of ICE action, and some have offered parents the option to watch on Zoom. Los Angeles police made 197 arrests on Tuesday, including 67 who were occupying a freeway, according to the city’s chief. The majority of arrests since the protests began have been for failing to disperse, while a few others were for assault with a deadly weapon, looting, vandalism and attempted murder for tossing a Molotov cocktail. At least seven police officers have been injured. ___ Baldor and Copp reported from Washington, D.C. Associated Press writers Dorany Pineda and Christopher Weber in Los Angeles, Amy Taxin in Orange County, California, John Seewer in Toledo, Ohio, Jim Vertuno in Austin, Texas, Hallie Golden in Seattle, and Greg Bull in Seal Beach, California, contributed to this report. **Newsletter** **** **** **Starting at $4.32/week.** **Subscribe Today** **Subscribe Today** Contact Us Privacy Policy Terms of Use Facebook Twitter Jobs Copyright © 2025 Ogden Newspapers of Utah, LLC | www.standard.net | 332 Standard Way, Ogden, UT 84404"}