{"id": 77, "name": "Danville Advocate-Messenger", "domain": "amnews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://amnews.com/2025/04/18/childrens-choir-and-centre-singers-to-celebrate-young-voices-through-poetry-and-song/", "title": "Childrens Choir And Centre Singers To Celebrate Young Voices Through Poetry And Song", "content": "Home News Sports Obituaries Features Opinion Public Records Contests Services Classifieds Calendar Home News Sports Obituaries Features Opinion Public Records Contests ServicesAbout UsPoliciesSubmit a News TipSubmit a Sports StorySubmit a PhotoLetters to EditorPay Subscription About Us Policies Submit a News Tip Submit a Sports Story Submit a Photo Letters to Editor Pay Subscription About Us Policies Submit a News Tip Submit a Sports Story Submit a Photo Letters to Editor Pay Subscription Classifieds Calendar E-Edition **Children’s Choir and Centre Singers to celebrate young voices through poetry and song** Published 2:16 pm Friday, April 18, 2025 Byjoselylabarrere A heartwarming collaboration between the Danville Children’s Choir and Centre College’s Centre Singers will come to life later this month in a concert celebrating the voices—and words—of young people. “Forever: A Musical Celebration of Young Poets”will take place at 7 p.m. Sunday, April 27, at the Presbyterian Church of Danville, 500 W. Main St. A reception will follow. Admission is free and open to the public. The idea for the concert began with a simple conversation between Patti, director of the Danville Children’s Choir, and Sam Scheibe, a visiting professor at Centre College. Scheibe, who once sang in a children’s choir in New Jersey, introduced Patti to a choral piece calledForever Songs, which was inspired by the poetry of a young girl named Ava Muhr. That spark turned into a full-fledged concert collaboration between the college’s women’s ensemble and the local children’s choir. **Email newsletter signup** “We just started talking about what kinds of things we could do together,” Patti said. “It was really special that the pieces we’re performing were written by young people—a fourth grader and a college student—which matches the age groups of our choirs.” The concert will feature two primary works:Snow Angel, with text and music by Sarah Quartel when she was a sophomore in college, andForever Songs, with music by Joel Krott and text by Ava Muhr, written when she was in fourth grade. Beyond the music, the event will also highlight original poetry from local students. Through connections with Jane Dewey, Danville Schools’ fine arts coordinator, winners of the Frank X Walker Poetry Contest will read their poems live during the concert. Additionally, Patti partnered with Kate Snyder of Plaid Elephant Books, who had been working on a “Poet-Tree” project at her bookstore. Selected young poets from that initiative will also be invited to share their work during the event. To deepen the connection between music and language, the choirs held a joint poetry workshop earlier this week. A student Scheibe knew led the session, encouraging participants to explore their emotions through poetry—no rhyming required. “One of the prompts was simply, ‘Poetry is…’ and the responses were just beautiful,” Patti said. “One wrote, ‘Poetry is the crunching of leaves under my feet in fall,’ and another said, ‘Poetry is my grandmother’s hug.’ It was really moving.” As a director, Patti said the experience of preparing for the concert has been deeply rewarding. “I usually choose our repertoire myself, but this time I had the opportunity to work with music chosen by someone else—and it was refreshing,” she said. “But mostly, I just love the kids. They’re so creative and full of surprises, and they all come together around their shared love of music. It’s a beautiful thing.” The concert promises an inspiring evening of music, poetry and community—and a testament to the powerful, expressive voices of young people. **Featured Local Savings** **You Might Like** **City honors women for decades of community impact** **City honors women for decades of community impact** **BOYLE COUNTY FAIR ANNOUNCES 2025 DATES** **BOYLE COUNTY FAIR ANNOUNCES 2025 DATES** **Pioneer Playhouse opens 76th season with Sherlock Holmes mystery** **Pioneer Playhouse opens 76th season with Sherlock Holmes mystery** **Carol’s Bridal and Prom to close after 40 plus years** **Carol’s Bridal and Prom to close after 40 plus years** Upcoming Events **Upcoming Events** **Upcoming Events** Home News Sports Obituaries Opinion Public Records Contests Classifieds Small Business E-Edition Subscriptions Submit a News Tip Submit a Photo Submit a Sports Story Letters to Editor About Us"}