{"id": 2015, "name": "Just Facts Daily", "domain": "justfactsdaily.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.justfactsdaily.com/the-constitution-does-not-grant-birthright-citizenship-to-the-children-of-illegal-immigrants", "title": "The Constitution Does Not Grant Birthright Citizenship To The Children Of Illegal Immigrants", "content": "No, Biden Didn’t Deport More Illegal Immigrants Than Trump Misinformation About the Arrest of Judge Hannah Dugan Overlooked Treasury Report Supports Musk’s Warning About Federal Deficits Sinking the U.S. Media Perpetuates Fraud at the Root of “Black Lives Matter” Plaza 50 Examples of Fake News in 2024 **Just Facts Daily** About Notification Syndication Email Signup Donate **The Constitution Does Not Grant Birthright Citizenship to the Children of Illegal Immigrants** By James D. AgrestiDecember 16, 2024 Overview Dozens of media outlets are reporting in unison that Donald Trump cannot stop the U.S. government from awarding birthright citizenship to the children of illegal immigrants. They claim this is the case because the 14th Amendment of the U.S. Constitution requires it. In reality, the legislative history of the 14th Amendment is clear that it only grants birthright citizenship to the children of people who are legally and permanently living in the United States. This does not apply to the children of illegal immigrants, temporary residents, visitors, or tourists. The children of such foreigners are currently granted U.S. citizenship and its benefits under a misinterpretation of the Constitution. Although such citizenship could be conferred through legislation, no such law exists. A Supreme Court ruling in 1898 presents mixed messages about this issue, but it is factually flawed on multiple levels and could justifiably be superseded by the current Supreme Court. The Historical Background In 1866, shortly after the Civil Warendedand slavery wasabolished, a bloc of Congressmen called the “Radical Republicans” passed acivil rights lawto ensure that African Americans had the “full and equal benefit of all laws and proceedings for the security of person and property, as is enjoyed by white citizens….” This law applied to former slaves but not to foreigners, and thus, it stated that: all persons born in the United States and not subject to any foreign power, excluding Indians not taxed, are hereby declared to be citizens of the United States…. To guarantee that the Civil Rights Act of 1866 was constitutional, the Radical Republicansfought forand secured passage of the14th Amendmentto the U.S. Constitution in 1868. The amendment mimics the act and states: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. The sentence above is known as the “birthright citizenship” clause of the Constitution. Under the current prevailing interpretation of it, children born in the U.S. to illegal immigrants, temporary residents, visitors, and touristsautomaticallybecome U.S. citizens and: are eligible for all state and federal welfare benefits, such as food stamps, housing, home energy, childcare, and health insurance. can vote in U.S. elections. sometimes serve as shields to prevent their parents from being deported. can sponsor their relatives to become legal permanent residents and U.S. citizens. In 2009, Pew Researchestimatedthat 73% of the children of unauthorized immigrants were U.S. citizens. The Current Debate During arecent episodeof NBC’sMeet the Press, moderator Kristen Welker asked President-elect Donald Trump if he planned to keep his promise to end birthright citizenship on his first day in office, and Trump replied, “Yeah. Absolutely.” Welker then challenged Trump by stating, “The 14th Amendment, though, says that, quote, ‘All persons born in the United States are citizens.’ Can you get around the 14th Amendment with an executive action?” Welker’s assertion is materially false because it omits the operative words “subject to the jurisdiction thereof” from the 14th Amendment: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens…. The debate about birthright citizenship hinges upon the words that Welker excluded, but instead of correcting her, several media outlets parroted her falsehood, like theBBC,CNN, andNBC News. While posting a screenshot of the misleading NBC article, Hillary Clintonwrote on X, “Birthright citizenship is enshrined in the Constitution. Trump may want to read it.” Yet, neither she nor NBC quoted the Constitution. Dozensof other media outlets reported on the exchange between Trump and Welker while mentioning the phrase “subject to the jurisdiction” but claiming that it includes illegal immigrants. This includes,for example, theNew York Times, theWashington Post,USA Today,PolitiFact, andCBS News. The common thread among all of them is that they ignore the pivotal facts of the issue. The Determinative Facts On May 30, 1866, Republican SenatorJacob Howardof Michiganintroducedthe 14th Amendment in the U.S. Senate and defined the phrase “subject to the jurisdiction” by stating: This will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the Government of the United States, but will include every other class of persons. Some scholars, like Tufts University professor Daniel W. Drezner,arguethat the words “foreigners,” “aliens,” “ambassadors” and “foreign ministers” are merely “synonyms to describe the same category of individuals, namely the children of foreign officials.” Drezner’s claim is transparently false because the meanings of the words “foreigner” and “alien” include illegal immigrants, while “ambassador” and “foreign minister” do not. Moreover, the differences between the first two words and the last two are so great that a total of 198 synonyms provided by Power Thesaurus for “foreigner” and “alien” don’t include “ambassador” or “foreign minister.” The converse is also true. Furthermore, the senators debated the meaning of the phrase “subject to the jurisdiction” after Howard introduced the amendment, and Howardfurther explainedthat: the word “jurisdiction,” as here employed, ought to be construed as to imply a full and complete jurisdiction on the part of the United States, coextensive in all respects with the constitutional power of the United States, whether exercised by Congress, by the executive, or by the judicial department; that is to say, the same jurisdiction in extent and quality as applies to every citizen of the United States now. Certainly, gentlemen cannot contend that an Indian belonging to a tribe, although born within the limits of a State, is subject to this full and complete jurisdiction. As ratified, the birthright citizenship clause of the14th Amendmentcontains the exact wordsproposed by Howard. Hence, there can be little doubt that it means exactly what he said it means. Drezner quotesother snippetsfrom the U.S. Senate debate as if they determine the meaning of the birthright citizenship clause, but thefull recordof the discussion reveals that they were just a part of the typical back-and-forth that occurs in such debates. By cherry-picking quotes from this dialogue, one can make any variety of claims about what it means. In the end, the definitive authority on this issue is Jacob Howard, who proposed and clarified the words that became a part of the U.S. Constitution. Notably, the 14th Amendment doesn’t prohibit federal legislators from granting citizenship to people not included in its birthright citizenship clause. This occurred in 1924 when Congress passed and PresidentCalvin Coolidgesigned alawthatawardedU.S. citizenship to all “non-citizen Indians born within the territorial limits of the United States.” Conversely, no such legislation has been passed for the children of illegal immigrants or tourists. Supreme Court Precedent In 1873, a baby namedWong Kim Arkwas born in the city of San Francisco to Chinese immigrants who were legally living in the U.S. and had “established and enjoyed a permanent domicile and residence therein” but were not U.S. citizens. When Ark was about 21 years old, he took a trip to China but was denied reentry to the U.S. because laws enacted in1882 and 1888prohibited Chinese laborers from entering the U.S., and customs officials decided that Ark wasn’t a U.S. citizen because his parents were not. Ark sued, and the case went to the Supreme Court, where Ark won. In a6–2 decisionissued in 1898, the majority declared that the 14th amendment grants citizenship to “all children here born of resident aliens” with limited exceptions like diplomats, occupying enemy forces, and members of Indian tribes. Conflictingly, however, themajorityalso wrote that the 14th Amendment’s phrase “subject to the jurisdiction thereof” only applies to people who “are permitted by the United States to reside here.” This plainly excludes unauthorized immigrants and tourists who don’t live in the U.S. Another flaw in the ruling is that themajorityassumes the 14th Amendment “must be interpreted in the light” of “English common law” that preceded the birth of the United States. Since “English common law” linked “English nationality” to “birth within the allegiance” of “the king,” the majority claimed that the 14th Amendment “affirms the ancient and fundamental rule of citizenship by birth within the territory, in the allegiance and under the protection of the country….” Beyond the fact that the 14th Amendment was enacted92 yearsafter the birth of the United States, thedissenting justicescriticized the majority for imposing on the U.S. Constitution “feudal” and “regal” doctrines that the founders of the U.S. had overthrown. The notion that people are the “subjects” of a monarch, wrote the minority, “never had any basis in the United States.” Another weakness in the majority’s ruling is their claim that the phrase “subject to the jurisdiction” means the same as “within the jurisdiction.” This is called into question by the first paragraph of the14th Amendment, which uses those phrases for different purposes (italics added): “All persons born or naturalized in the United States, andsubject to the jurisdictionthereof, are citizens of the United States….” “nor shall any State … deny to any personwithin its jurisdictionthe equal protection of the laws.” It’s a stretch to assume that the authors of 14th Amendment used those distinctive terms to mean the same thing, especially since one of the authorsexplicitly statedthat the phrase “subject to the jurisdiction”: “will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers….” doesn’t include “an Indian belonging to a tribe.” “ought to be construed as to imply a full and complete jurisdiction on the part of the United States, the same jurisdiction in extent and quality as applies to every citizen of the United States now.” Given the forgoing facts, the current Supreme Court may set aside the conflictingdictaof the Court’s 1898 ruling inWong Kim Ark, who was the child of legal immigrants—not illegal immigrants or tourists. Summary Based on a faulty interpretation of the 14th Amendment, the federal government is awarding citizenship to the children of nearly everyone who gives birth in the United States. As a result, the children are entitled to receive welfare, vote when they become older, and obtain other benefits of U.S. citizenship. This includes the children of illegal immigrants, temporary residents, and even foreigners who vacation in the U.S. The legislative history of the 14th Amendment reveals that the birthright citizenship clause was enacted primarily to protect the civil rights of African Americans. Contrary to shallow claims from the media and certain scholars, it doesn’t grant citizenship to the children of anyone who is not legally and permanently living in the United States. ←Previous Article View Comments Next Article→ **No, Biden Didn’t Deport More Illegal Immigrants Than Trump** **Misinformation About the Arrest of Judge Hannah Dugan** **Overlooked Treasury Report Supports Musk’s Warning About Federal Deficits Sinking the U.S.** Jim SheffieldDecember 16, 2024 at 12:05 PMPermalinkAre there any current cases in the court system that may work its way to the Supreme Court? Can an Executive Order somehow be constructed that would precipitate such a challenge? And would a successful defense of the true meaning of the 14th render previously rendered citizenships moot? I sure don’t have an answer.Reply Are there any current cases in the court system that may work its way to the Supreme Court? Can an Executive Order somehow be constructed that would precipitate such a challenge? And would a successful defense of the true meaning of the 14th render previously rendered citizenships moot? I sure don’t have an answer. Are there any current cases in the court system that may work its way to the Supreme Court? Can an Executive Order somehow be constructed that would precipitate such a challenge? And would a successful defense of the true meaning of the 14th render previously rendered citizenships moot? I sure don’t have an answer. Pelosi GaloreDecember 17, 2024 at 10:32 AMPermalinkNice article and well thought-out. Of course the elephant in the room is the reason the 13th, 14th, and 15th Amendments exist is purely and solely to address the civil rights of freed slaves. Democrats, still butt-hurt from losing their slaves via the 13th Amendment conspired to deny freed slaves basic civil rights denied to them when they were property (i.e. slaves). To address that the 14th Amendment was quickly passed and ratified. Still feeling bad about the whole thing Democrats tried denying freed slaves the vote, hence the 15th Amendment. Keeping this in mind at all times when discussing “birthright citizenship” is crucial to making correct rulings.The next question is what to do about those who are (falsely) claiming US citizenship via this misinterpretation of the 14th Amendment. I propose they all be required to take a short (4 hour) lecture on US history and how our government is supposed to work, and then all stand and take the Oath of Citizenship.Reply Nice article and well thought-out. Of course the elephant in the room is the reason the 13th, 14th, and 15th Amendments exist is purely and solely to address the civil rights of freed slaves. Democrats, still butt-hurt from losing their slaves via the 13th Amendment conspired to deny freed slaves basic civil rights denied to them when they were property (i.e. slaves). To address that the 14th Amendment was quickly passed and ratified. Still feeling bad about the whole thing Democrats tried denying freed slaves the vote, hence the 15th Amendment. Keeping this in mind at all times when discussing “birthright citizenship” is crucial to making correct rulings. The next question is what to do about those who are (falsely) claiming US citizenship via this misinterpretation of the 14th Amendment. I propose they all be required to take a short (4 hour) lecture on US history and how our government is supposed to work, and then all stand and take the Oath of Citizenship. Nice article and well thought-out. Of course the elephant in the room is the reason the 13th, 14th, and 15th Amendments exist is purely and solely to address the civil rights of freed slaves. Democrats, still butt-hurt from losing their slaves via the 13th Amendment conspired to deny freed slaves basic civil rights denied to them when they were property (i.e. slaves). To address that the 14th Amendment was quickly passed and ratified. Still feeling bad about the whole thing Democrats tried denying freed slaves the vote, hence the 15th Amendment. Keeping this in mind at all times when discussing “birthright citizenship” is crucial to making correct rulings. The next question is what to do about those who are (falsely) claiming US citizenship via this misinterpretation of the 14th Amendment. I propose they all be required to take a short (4 hour) lecture on US history and how our government is supposed to work, and then all stand and take the Oath of Citizenship. Amber DeLeonFebruary 7, 2025 at 10:36 AMPermalinkIt is a well-thought-out article, I agree with that. And I understand the intent of the amendment was to guarantee citizenship of the children of freed slaves. However, I think the case can still be made that any child who does not benefit from specific protections (such as those on Native American reservations, children of foreign diplomats who have diplomatic immunity, etc.) is subject to the jurisdiction of the state in which they reside — they are required to follow the laws therein. Thus, yes, they are subject to the jurisdiction, and thus, according to section 1 of the 14th amendment, laws cannot be created that would deny them this protection.Based on the verbiage of the explanations by Jacob Howard (“This will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the Government of the United States, but will include every other class of persons”), it does seem to me that the explanation of “foreigners, aliens, who belong to families of ambassadors or foreign ministers” is a single clarification of intent. He did not say it will not apply to “foreigners, aliens, OR people who belong to families of ambassadors.” He seems to be clarifying a specific group of foreigners to whom this law would not apply.Reply It is a well-thought-out article, I agree with that. And I understand the intent of the amendment was to guarantee citizenship of the children of freed slaves. However, I think the case can still be made that any child who does not benefit from specific protections (such as those on Native American reservations, children of foreign diplomats who have diplomatic immunity, etc.) is subject to the jurisdiction of the state in which they reside — they are required to follow the laws therein. Thus, yes, they are subject to the jurisdiction, and thus, according to section 1 of the 14th amendment, laws cannot be created that would deny them this protection. Based on the verbiage of the explanations by Jacob Howard (“This will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the Government of the United States, but will include every other class of persons”), it does seem to me that the explanation of “foreigners, aliens, who belong to families of ambassadors or foreign ministers” is a single clarification of intent. He did not say it will not apply to “foreigners, aliens, OR people who belong to families of ambassadors.” He seems to be clarifying a specific group of foreigners to whom this law would not apply. It is a well-thought-out article, I agree with that. And I understand the intent of the amendment was to guarantee citizenship of the children of freed slaves. However, I think the case can still be made that any child who does not benefit from specific protections (such as those on Native American reservations, children of foreign diplomats who have diplomatic immunity, etc.) is subject to the jurisdiction of the state in which they reside — they are required to follow the laws therein. Thus, yes, they are subject to the jurisdiction, and thus, according to section 1 of the 14th amendment, laws cannot be created that would deny them this protection. Based on the verbiage of the explanations by Jacob Howard (“This will not, of course, include persons born in the United States who are foreigners, aliens, who belong to the families of ambassadors or foreign ministers accredited to the Government of the United States, but will include every other class of persons”), it does seem to me that the explanation of “foreigners, aliens, who belong to families of ambassadors or foreign ministers” is a single clarification of intent. He did not say it will not apply to “foreigners, aliens, OR people who belong to families of ambassadors.” He seems to be clarifying a specific group of foreigners to whom this law would not apply. **Make a CommentCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ Email* Δ"}