{"id": 1373, "name": "The Fence Post", "domain": "thefencepost.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thefencepost.com/news/chinese-nationals-charged-with-conspiracy-smuggling-dangerous-biological-pathogen-into-the-us/", "title": "Chinese Nationals Charged With Conspiracy Smuggling Dangerous Biological Pathogen Into The Us", "content": "NewsState or RegionWyomingNebraskaKansasColoradoFarming & RanchingWestern HeritageEventsAg & PoliticsPeople in AgObituariesCelebrationsOpinionOur EditorReader SubmissionsBaxter BlackLee PittsMad Jack HanksMilo YieldMr. TruckRangeviewsSow’s EarIndustry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters State or RegionWyomingNebraskaKansasColorado Wyoming Nebraska Kansas Colorado Farming & Ranching Western Heritage Events Ag & Politics People in Ag Obituaries Celebrations OpinionOur EditorReader SubmissionsBaxter BlackLee PittsMad Jack HanksMilo YieldMr. TruckRangeviewsSow’s EarIndustry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Our Editor Reader Submissions Baxter Black Lee Pitts Mad Jack Hanks Milo Yield Mr. Truck Rangeviews Sow’s Ear Industry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Auctions Ag Event Calendar Production Sale Reports Market Reports Cavvy Savvy EntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Ag Event Calendar Recipes Art, Photos & Poetry Auction Calendar Feature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters State or RegionWyomingNebraskaKansasColorado Wyoming Nebraska Kansas Colorado Wyoming Nebraska Kansas Colorado Farming & Ranching Western Heritage Events Ag & Politics People in Ag Obituaries Celebrations OpinionOur EditorReader SubmissionsBaxter BlackLee PittsMad Jack HanksMilo YieldMr. TruckRangeviewsSow’s EarIndustry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Our Editor Reader Submissions Baxter Black Lee Pitts Mad Jack Hanks Milo Yield Mr. Truck Rangeviews Sow’s Ear Industry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Auctions Ag Event Calendar Production Sale Reports Market Reports Cavvy Savvy EntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Ag Event Calendar Recipes Art, Photos & Poetry Auction Calendar Feature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters Our Editor Reader Submissions Baxter Black Lee Pitts Mad Jack Hanks Milo Yield Mr. Truck Rangeviews Sow’s Ear Industry InfoAuctionsAg Event CalendarProduction Sale ReportsMarket ReportsCavvy SavvyEntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Auctions Ag Event Calendar Production Sale Reports Market Reports Cavvy Savvy EntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Ag Event Calendar Recipes Art, Photos & Poetry Auction Calendar Feature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters Auctions Ag Event Calendar Production Sale Reports Market Reports Cavvy Savvy EntertainmentAg Event CalendarRecipesArt, Photos & PoetryAuction CalendarFeature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Ag Event Calendar Recipes Art, Photos & Poetry Auction Calendar Feature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters Ag Event Calendar Recipes Art, Photos & Poetry Auction Calendar Feature MagazinesAgriCULTUREBreeder’s ConnectionHomelandForageOpen SeasonSummer EventsCountry ChristmasClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas ClassifiedsEmploymentRentalsReal EstateFarm & RanchService DirectoryAll ClassifiedsPlace an AdNewsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad Newsletters **News** State or Region Farming & Ranching Western Heritage Events Ag & Politics People in Ag Obituaries Celebrations **Opinion** Our Editor Reader Submissions Baxter Black Lee Pitts Mad Jack Hanks Milo Yield Mr. Truck Rangeviews Sow’s Ear **Industry Info** Auctions Ag Event Calendar Production Sale Reports Market Reports Cavvy Savvy **Entertainment** Ag Event Calendar Recipes Art, Photos & Poetry **Auction Calendar** **Feature Magazines** AgriCULTURE Breeder’s Connection Homeland Forage Open Season Summer Events Country Christmas **Classifieds** Employment Rentals Real Estate Farm & Ranch Service Directory All Classifieds Place an Ad **Newsletters** Subscribe About Us| Contact Us| Submissions| Advertise| Pick up a Copy| **Chinese Nationals charged with conspiracy, smuggling dangerous biological pathogen into the US** News|Jun 5, 2025 Yunqing Jian, 33, and Zunyong Liu, 34, citizens of the People’s Republic of China, were charged in a criminal complaint with conspiracy, smuggling goods into the United States, false statements, and visa fraud, announced United States Attorney Jerome F. Gorgon, Jr. Gorgon was joined in the announcement by Special Agent in Charge Cheyvoryea Gibson, Federal Bureau of Investigation, Detroit Division and Marty C. Raybon, Director of Field Operations, U.S. Customs and Border Protection. The FBI arrested Jian in connection with allegations related to Jian’s and Liu’s smuggling into America a fungus called Fusarium graminearum, which scientific literature classifies as a potential agroterrorism weapon. This noxious fungus causes “head blight,” a disease of wheat, barley, maize and rice, and is responsible for billions of dollars in economic losses worldwide each year. Fusarium graminearum’s toxins cause vomiting, liver damage and reproductive defects in humans and livestock. According to the complaint, Jian received Chinese government funding for her work on this pathogen in China. The complaint also alleges that Jian’s electronics contain information describing her membership in and loyalty to the Chinese Communist Party. It is further alleged that Jian’s boyfriend, Liu, works at a Chinese university where he conducts research on the same pathogen and that he first lied but then admitted to smuggling Fusarium graminearum into America — through the Detroit Metropolitan Airport — so that he could conduct research on it at the laboratory at the University of Michigan where his girlfriend, Jian, worked. United States Attorney Gorgon stated, “The alleged actions of these Chinese nationals — including a loyal member of the Chinese Communist Party — are of the gravest national security concerns. These two aliens have been charged with smuggling a fungus that has been described as a ‘potential agroterrorism weapon’ into the heartland of America, where they apparently intended to use a University of Michigan laboratory to further their scheme.” PROTECTING AMERICANS “The federal charges announced today against Yunqing Jian and Zunyong Liu, both residents of the People’s Republic of China, signify a crucial advancement in our efforts to safeguard our communities and uphold national security,” said Cheyvoryea Gibson, special agent in charge of the FBI Detroit Field Office. “These individuals exploited their access to laboratory facilities at a local university to engage in the smuggling of biological pathogens, an act that posed an imminent threat to public safety. Thanks to the exceptional investigative efforts of the FBI Detroit Counterintelligence Task Force, in close cooperation with U.S. Customs and Border Protection’s Office of Field Operations these dangerous activities have been effectively halted. The FBI remains resolutely committed to collaborating with our law enforcement partners to protect the residents of Michigan and defend the United States against such grave threats.” U.S. Custom and Border Protection, Director of Field Operations Marty C. Raybon stated, “Today’s criminal charges levied upon Yunqing Jian and Zunyong Liu are indicative of CBP’s critical role in protecting the American people from biological threats that could devastate our agricultural economy and cause harm to humans; especially when it involves a researcher from a major university attempting to clandestinely bring potentially harmful biological materials into the United States. This was a complex investigation involving CBP offices from across the country, alongside our federal partners. I’m grateful for their tireless efforts, ensuring our borders remain secure from all types of threats while safeguarding America’s national security interests.” Jian will be appearing this afternoon in federal court in Detroit for her initial appearance on the complaint. A complaint is only a charge and is not evidence of guilt. Trial cannot be held on felony charges in a complaint. When the investigation is completed, a determination will be made whether to seek a felony indictment. The FBI and CBP are investigating this case. Jun 10, 2025 Jun 9, 2025 Jun 8, 2025 Jun 8, 2025 Jun 8, 2025 Jun 8, 2025 Jun 6, 2025 Jun 5, 2025 Jun 1, 2025 Jun 9, 2025 **[placeholder]** REQUIREMENTS/DUTIES Feeding cattle, managing herd health, doctoring cattle as needed, equipment operation & maintenance, outbuilding and grounds maintenance.Fencing, haying, processing… REQUIREMENTS/DUTIES Feeding cattle, managing herd health, doctoring cattle as needed, equipment operation & maintenance, outbuilding and grounds maintenance.Fencing, haying, processing… **Daily Newsletter** Sign up for daily and breaking news headlines. Manage Subscriptions TueH: 88°L: 58° WedH: 86°L: 61° ThuH: 87°L: 61° FriH: 84°L: 61° SatH: 89°L: 59° Home Trending Sections Jobs Classifieds Livestock & Animals Grain Grass Farm & Ranch Equipment Merchandise Autos Real Estate Recreation Service Directory Pets Announcements Garage Sales Contact Us Submissions E-Paper Newsletters Advertise Archives RSS Fence Post on Facebook Fence Post on Twitter Website Feedback Place a Classified Ad Cookie List Do not sell my personal information Tri-State Livestock News Cavvy Savvy Fair Cattle Markets Farmer & Rancher Exchange About Us| Terms of Use| Privacy Policy| Terms and Conditions| Careers| ©2005 - 2025 Swift Communications, Inc."}