{"id": 470, "name": "WFTX - Fort Myers News", "domain": "fox4now.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox4now.com/news/local-news/glades-county/electric-buses-in-glades-county-can-help-power-communities-during-emergency-outages", "title": "Electric Buses In Glades County Can Help Power Communities During Emergency Outages", "content": "Menu NewsLocal NewsAffordable HousingCovering FloridaInvestigatesAs Seen on 4Viewer SubmissionNational NewsWorld NewsLifestyleSportsEntertainment Local News Affordable Housing Covering Florida Investigates As Seen on 4 Viewer Submission National News World News Lifestyle Sports Entertainment Local News Affordable Housing Covering Florida Investigates As Seen on 4 Viewer Submission National News World News Lifestyle Sports Entertainment WeatherHourly ForecastDaily ForecastHurricane CenterSevere Weather AlertsWeather RadarLive Cameras Hourly Forecast Daily Forecast Hurricane Center Severe Weather Alerts Weather Radar Live Cameras Hourly Forecast Daily Forecast Hurricane Center Severe Weather Alerts Weather Radar Live Cameras Video Immigration Action About UsStation HistoryFOX 4 News TeamStreaming AppsProgramming GuideContact UsAdvertise with UsWFTX ContestsSupport Station History FOX 4 News Team Streaming Apps Programming Guide Contact Us Advertise with Us WFTX Contests Support Station History FOX 4 News Team Streaming Apps Programming Guide Contact Us Advertise with Us WFTX Contests Support Traffic Local ExpertsHealth ExpertsHome ExpertsTrusted Advisors Health Experts Home Experts Trusted Advisors Health Experts Home Experts Trusted Advisors Fox 4 Plus 4 Things To Do This Weekend Florida Panthers FC Naples Florida Lottery Winning Numbers Social MediaFox4 FacebookFox4 TwitterFox4 YouTubeFox4 Instagram Fox4 Facebook Fox4 Twitter Fox4 YouTube Fox4 Instagram Fox4 Facebook Fox4 Twitter Fox4 YouTube Fox4 Instagram WFTX Contests Sign In Newsletters Sign Out Manage Emails Apps Careers Search Lee Collier Charlotte In Your Neighborhood Local News Videos **Actions** Facebook Tweet Email **Electric buses in Glades County can help power communities during emergency outages** GLADES COUNTY, Fla. — The Glades County School District just announced how its electric school bus fleet can provide backup power during hurricane season. Watch to hear what the district said about how the buses can help this hurricane season: Highland Electric Fleets, who makes the buses, says they can act as mobile generators, cooling stations, or even send energy back to the grid to power essential services like schools, shelters, and community centers during a power outage. The district says this emergency function could be key during hurricane season by giving communities a flexible tool if the power’s out. To show that in action, one bus was used to power a snow-cone machine for students at a community demonstration. Glades County Schools first put these 13 electric buses on the road in January, replacing more than half its aging diesel fleet. Since then, the district says the buses have brought air conditioned rides to students for the first time, lowered running costs, and reduced emissions. Now, they say they’re ready to help out the community if the lights go out. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** About Us **Local Coverage on Your Phone or Streaming TV. Watch Live and Free 24/7.** About Us **Local Coverage on Your Phone or Streaming TV. Watch Live and Free 24/7.** Weather Traffic News Money Entertainment Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Fox4FortMyers Fox4Now"}