{"id": 1152, "name": "Rappler", "domain": "rappler.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rappler.com/sports/volleyball/game-results-philippines-south-korea-hyundai-capital-skywalkers-alas-pilipinas-invitationals-june-11-2025/", "title": "Game Results Philippines South Korea Hyundai Capital Skywalkers Alas Pilipinas Invitationals June 11 2025", "content": "Sara Duterte Impeachment Latest news Rai chatbot Video BrandRap Philippine elections 2025 People Newsbreak Philippines Weather Rappler+ Exclusives Special coverages Sports World Voices Entertainment Business Life and Style Technology MovePH Science Environment Bulletin Board Subscribe to Newsletters Communities Movements RappLearn Topics About Rappler SEE ALL VIDEOS Hold The Line Video editorial Act One Basagan ng Trip Daily wRap Documentaries Duterte LIVE Live Jam videos Rappler Talk Reports & Vlogs Video explainers Watch NOW | Live SEE ALL BRANDRAP CommuniCart Get Ready With Me Announcements Beyond the Buy Data stories Detours Finance and Industries GoodRap Health, Beauty, and Wellness Home and Parenting Lifestyle and Entertainment Profiles and Advocacies Tech and Innovation Travel and Food SEE ALL NEWSBREAK In-depth Investigative Explainers Rappler IQ Fact Check Inside Track Newsbreak Podcasts and Videos Data and Documents SEE ALL PHILIPPINES Philippine News Metro Manila Luzon Visayas Mindanao Philippine elections Overseas Filipinos Special Coverage Rappler Talk Exclusive Content Exclusive Events SEE ALL SPORTS Boxing FIBA Football Gilas Pilipinas NCAA NBA PBA UAAP Volleyball SEE ALL WORLD Africa Asia Pacific Bahasa Indonesia Europe Global Affairs Latin America Middle East South & Central Asia US & Canada SEE ALL VOICES Editorials Newsletters Rappler Blogs Thought Leaders SEE ALL ENTERTAINMENT Celebrities Live Jam Movies Music Pageants Series Theater SEE ALL BUSINESS Consumer Issues Corporate Economy & Governance Infrastructure Industries Personal Finance Stocks & Banking SEE ALL LIFE AND STYLE Arts & Culture Astrology Food Health and Wellness Literature Relationships Style Travel SEE ALL TECHNOLOGY Apps Gadgets Gaming Innovations Internet Culture Reviews Social Media Tech Features SEE ALL MOVEPH Advocacies Agos Partners SEE ALL SCIENCE Discoveries & Inventions Earth & Space Life & Health Society & Culture SEE ALL ENVIRONMENT Climate Change Disasters in the Philippines Nature Pollution Advisories Campus Bulletin Board Contests and Awards Events Exam results Government job openings Scholarships Trainings and Workshops #FactsFirst PH #CourageON: No Lockdown on Rights #Atin Ang Pilipinas #Saysay Ng Kasaysayan #Make Manila Liveable Topic Directory Trending Sara Duterte impeachment United States NBA Finals #BrandRap PAGASA forecasts Alas Pilipinas House of Representatives k-pop PBA Philippine Cup Senate of the Philippines Donald Trump artificial intelligence Fact check - gov't services/laws US basketball SEE ALL OF ABOUT RAPPLER Team Policies Awards and recognition Special Projects News & updates Support Login Subscribe Now **King slayers: Espejo-led Alas downs Korea league champ in prolific Invitationals run** Already have Rappler+?Sign into listen to groundbreaking journalism. SUMMARY This is AI generated summarization, which may have errors. For context, always refer to the full article. KING SLAYER. Alas Pilipinas spiker Marck Espejo attempts an attack over the South Korea defense in the 2025 Alas Pilipinas Invitationals. PNVF MANILA, Philippines – Test event or no test event, Alas Pilipinas is taking its home court defense seriously ahead of the 2025 FIVB Men’s World Championships. Two days into the three-day Alas Pilipinas Invitationals, the Philippine men’s volleyball team took down another Asian powerhouse, dragging the Korean V-League champions Hyundai Capital Skywalkers to a four-set finish, 25-22, 22-25, 25-21, 25-20, at the Araneta Coliseum on Wednesday, June 11. Alas captain Marck Espejo pulled out the big guns in his entry to the starting lineup, tallying a game-high 20 points on 17 attacks, 2 aces, and 1 block as his team remained undefeated in the no-bearing, yet crucial showcase to flesh out the hosting kinks before the massive 32-nation world tilt in September. Fellow 2019 Southeast Asian Games silver medalists, the returning libero Jack Kalingking and young setter Owa Retamar, also showed off, with the former tallying 9 excellent receptions while the latter recording a game-high 3 blocks for a 4-point total. Up just 15-14 in the fourth set against a rallying Hyundai squad, Alas leaned on a pair of UAAP MVPs from Ateneo – reigning winner Ken Batas and five-time awardee Espejo — towards a 5-1 breakaway for a 20-15 lead, also helped up by two attack errors from the Korean side within the run. Not fully able to prevent errors stifling their comback attempt, the Skywalkers only got as near as 22-19 before Peng Taguibolos hammered an off-the-block kill, 23-19, followed by an Espejo backrow bomb for match point, 24-19. Soon Won Geun saved one match point, 24-20, but it was too late for another Korean rally as Lee Jae Hyun gifted the win off a service going wide. The stiff challenges don’t stop for the world championships host as Alas wraps up the test event on Philippine Independence Day Thursday, June 12, with a hopeful repeat conquest of the mighty Thailand national team, still at 7:30 pm at the same venue.– Rappler.com How does this make you feel? **author** **JR Isaga** **{{ item.sitename }}** **{{ item.title }}** **Alas Pilipinas makes quick work of Kiwis, sets sights on unbeaten Kazakhs in AVC** **Alas Pilipinas opens Invitationals with 4-set thriller win over champion Indonesia club** **Schedule, lineup, standings: Alas Pilipinas in 2025 AVC Women’s Volleyball Nations Cup** **Hanoi heartbreak: Alas suffers first loss in AVC Nations Cup as Iran sneaks in 5-set thriller** **Alas Pilipinas makes quick work of Kiwis, sets sights on unbeaten Kazakhs in AVC** **Alas Pilipinas opens Invitationals with 4-set thriller win over champion Indonesia club** **Schedule, lineup, standings: Alas Pilipinas in 2025 AVC Women’s Volleyball Nations Cup** **Hanoi heartbreak: Alas suffers first loss in AVC Nations Cup as Iran sneaks in 5-set thriller** **Alas Pilipinas makes quick work of Kiwis, sets sights on unbeaten Kazakhs in AVC** **Alas Pilipinas opens Invitationals with 4-set thriller win over champion Indonesia club** **Hanoi heartbreak: Alas suffers first loss in AVC Nations Cup as Iran sneaks in 5-set thriller** **Alas survives Solomon exit in comeback win vs Indonesia, climbs to 2-0** **BTS members Jungkook, Jimin discharged from South Korea military** **IN PHOTOS: BTS’ RM, V discharged from mandatory military service** **In first event since double Olympic gold coup, Carlos Yulo leads PH team in Asian meet** **South Korea’s new President Lee vows to revive democracy from ‘near demise’** follow us Crowdfunding Subscribe to Newsletters Founding board Rappler board of directors About Us Mission Statement Editorial standards and guidelines AI GUIDELINES The Team Topics directory Rai chatbot Contact Us Privacy Statement Terms of Use Community Guidelines NPC Registration NPC Privacy Seal Philippine elections Checking your Rappler+ subscription... Upgrade toRappler+for exclusive content and unlimited access. Why is it important to subscribe?Learn more You are subscribed toRappler+ ****"}