{"id": 579, "name": "Future of Life Institute", "domain": "futureoflife.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://futureoflife.org/podcast/understanding-ai-agents-time-horizons-sycophancy-and-future-risks-with-zvi-mowshowitz/", "title": "Understanding Ai Agents Time Horizons Sycophancy And Future Risks With Zvi Mowshowitz", "content": "Our mission Focus areasArtificial IntelligenceBiotechnologyNuclear Weapons Our workOur work overviewPolicy and ResearchFuturesOutreachGrantmakingFeatured projectsPerspectives of Traditional Religions on Positive AI FuturesFutures,Policy & ResearchRecommendations for the U.S. AI Action PlanPolicy & ResearchMultistakeholder Engagement for Safe and Prosperous AIOutreachDigital Media AcceleratorOutreachKeep The Future HumanOutreachFLI AI Safety Index 2024Policy & ResearchOur contentArticles, Podcasts, Newsletters, Resources, and more. About usAbout us overviewOur peopleCareersDonateFinancesContact us Take action LanguageEnglishSome translations are machine-generated.Contact usto report any issues, or to submit a new translation of our content. **Understanding AI Agents: Time Horizons, Sycophancy, and Future Risks (with Zvi Mowshowitz)** On this episode, Zvi Mowshowitz joins me to discuss sycophantic AIs, bottlenecks limiting autonomous AI agents, and the true utility of benchmarks in measuring progress. We then turn to time horizons of AI agents, the impact of automating scientific research, and constraints on scaling inference compute. Zvi also addresses humanity’s uncertain AI-driven future, the unique features setting AI apart from other technologies, and AI’s growing influence in financial trading.You can follow Zvi's excellent bloghere.Timestamps:00:00:00 Preview and introduction00:02:01 Sycophantic AIs00:07:28 Bottlenecks for AI agents00:21:26 Are benchmarks useful?00:32:39 AI agent time horizons00:44:18 Impact of automating research00:53:00 Limits to scaling inference compute01:02:51 Will the future go well for humanity?01:12:22 A good plan for safe AI01:26:03 What makes AI different?01:31:29 AI in trading On this episode, Zvi Mowshowitz joins me to discuss sycophantic AIs, bottlenecks limiting autonomous AI agents, and the true utility of benchmarks in measuring progress. We then turn to time horizons of AI agents, the impact of automating scientific research, and constraints on scaling inference compute. Zvi also addresses humanity’s uncertain AI-driven future, the unique features setting AI apart from other technologies, and AI’s growing influence in financial trading. You can follow Zvi's excellent bloghere. Timestamps: 00:00:00 Preview and introduction 00:02:01 Sycophantic AIs 00:07:28 Bottlenecks for AI agents 00:21:26 Are benchmarks useful? 00:32:39 AI agent time horizons 00:44:18 Impact of automating research 00:53:00 Limits to scaling inference compute 01:02:51 Will the future go well for humanity? 01:12:22 A good plan for safe AI 01:26:03 What makes AI different? 01:31:29 AI in trading On this episode, Zvi Mowshowitz joins me to discuss sycophantic AIs, bottlenecks limiting autonomous AI agents, and the true utility of benchmarks in measuring progress. We then turn to time horizons of AI agents, the impact of automating scientific research, and constraints on scaling inference compute. Zvi also addresses humanity’s uncertain AI-driven future, the unique features setting AI apart from other technologies, and AI’s growing influence in financial trading. You can follow Zvi's excellent bloghere. Timestamps: 00:00:00 Preview and introduction 00:02:01 Sycophantic AIs 00:07:28 Bottlenecks for AI agents 00:21:26 Are benchmarks useful? 00:32:39 AI agent time horizons 00:44:18 Impact of automating research 00:53:00 Limits to scaling inference compute 01:02:51 Will the future go well for humanity? 01:12:22 A good plan for safe AI 01:26:03 What makes AI different? 01:31:29 AI in trading **Related episodes** **Sign up for the Future of Life Institute newsletter** Artificial Intelligence Biotechnology Nuclear Weapons Policy Outreach Grantmaking Futures Articles Podcasts Newsletters Open letters Our people Our history Careers Donate Finances FAQs Contact us Privacy Policy Accessibility Media room Report a broken link Privacy Policy Accessibility Media room Report a broken link"}