{"id": 1666, "name": "American Policy Center", "domain": "americanpolicy.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://americanpolicy.org/2025/05/16/more-and-more-states-are-being-threatened-with-carbon-capture-pipelines-is-yours-one-if-not-dont-wait-dont-allow-it/", "title": "More And More States Are Being Threatened With Carbon Capture Pipelines Is Yours One If Not Dont Wait Dont Allow It", "content": "Home About Issues Media Speaking Contact Books Tools DonateJoin Us Home About Issues Media Speaking Contact Books Tools Donate **16 MayMore and more states are being threatened with Carbon Capture Pipelines. Is yours one? If not, don’t wait – don’t allow it.** A Pennsylvania reader contacted us; he had heard rumors about a carbon capture pipeline (CCS) project that was supposed to be coming to Pennsylvania, and he wanted to know where it would be. He had asked officials but was told that there aren’t any in the works right now. My digging came up with a report called “Potential Near-Term Candidate CCS Industrial Facilities in Pennsylvania” (with estimated capturable emissions & range of capture costs). But that information I received was vague – there were companies asking for information but not stating any interest to move forward. The best one gets is the official lines: “While there are no commercial CCS projects operating or under development in Pennsylvania,there are some laboratory and small pilot projects underway.” Right now, Pennsylvania should stop and be thankful that they don’t have oneand immediately take action to make certain one never even gets put on the table.The Number 1 tool to protect your property rights and keep carbon capture pipelines away is to deny the use of eminent domain. Those putting in the pipelines want your property even more than they want the pipeline – it is just the camel’s nose under the tent. We are just beginning to see the dangers of CCS. While we have been informing people for over thirty years that there is no Manmade Global Warming problem because a) the Earth isn’t warming, and b) the whole myth of global warming/climate change was dreamed up by a faction who want to control all aspects of life on earth. In the report on “Understanding carbon capture and storage prospects in Pennsylvania”, we are informed that, because the state ranked 4thin carbon emissions due to the Commonwealth’s robust fossil fuel-based energy generation and industrial economy, “Carbon capture and storageis critical to near-term decarbonization … .” “Carbon capture and storage is particularly important for decarbonizing hard-to-abate industries in Pennsylvania, including steel, cement, and petrochemical production. These sectors have few or no alternative decarbonization options due to inherent process emissions that occur during chemical reactions, such as the calcination of limestone to produce calcium oxide for cement or the ‘route for primary steel production.’” But Pennsylvania has some critical hurdles to face before jumping into latest fad for reaching Net Zero –“a target of completely negating the amount of greenhousegasesproduced by human activity, to be achieved by reducing emissions and implementing methods ofabsorbingcarbon dioxide from the atmosphere. Global net emissions of carbon dioxide will need to fall tonet zero by 2050.” While they potentially have enough capacity to sequester “the equivalent of all PA’s direct CO2 emissions, the study admits:However, these high-level estimates likely far exceed realistic commercial storage potential, as they do not factor in field-measured injectivity, which is the ease with which fluids like carbon dioxide can flow through geologic formations. To better understand and verify storage potential in Pennsylvania, a more detailed geologic assessment is necessary. This is accompanied by a table (Table 2) which provides a summary of “potential theoretical CO storage capacity in Pennsylvania’s saline aquifers. Note the wordspotentialandtheoretical.Those, in my opinion, are key words for this; they have mentioned that the area isn’t prime for carbon storage. The table even states: these formations are mostly characterized by very low permeability, which may make CO2injection at commercially viable rates challenging. Existing data is limited, and additional data will be required to determine the viability of these formations for commercial-scale storage at large facilities”. The bigger question here is “Why are states, why is anyone, still going to ways to mitigate CO2? The real science has long ago shown us that we cannot live without CO2, but that the plants and animals on this earth need it too. The answer is very simple –$$$$$$, and more importantly control – control of the entire world. AND we’ve know this from the very beginning. But no one wanted to listen – it was far more exciting to think that our world would end if we didn’t do everything we could toSTOP GLOBAL WARMING.Even Al Gore knew. But money and power are the ultimate aphrodisiacs. Numerous renown scientists spoke out against the hoax of manmade global warming. One of the first and foremost was S Fred Singer, who (to keep his resume short) was Professor emeritus of environmental science at the University of Virginia, founder and president of Science & Environmental Policy Project, and had been an early space researcher, first director of the U.S. National Weather Satellite Service. In fact hundreds of scientists spoke out against it – but the Left and its lackies, mainstream media and our federal government agencies held the power. Another aspect is the history of Global Warming. Even when the lies died in court, they stayed alive outside it. Remember “Exxon Knew”? It was a hot item. New York City sued Exxon Mobil, BP, and Shell oil companies for “misleading the public about their products, and their commitment to renewableenergy and fighting climate change”.Supreme Court Justice Anar Patel found no proof the oil companies and the defendant American Petroleum Institute conducted “greenwashing” campaigns, including statements about clean energy and alternative energy, to boost sales of fossil fuel products in the city”. The NY Post’s article was titled “New York AG’s office totally disgraced itself in the Exxon trial”, but the Left, counting on most people’s ignorance of the outcome, has continued to use“Exxon Knew” to attack fossil fuel companies and those who supported them. Today we are seeing a large portion of society with Eco-anxiety. Yes, really! It’s because the nonexistent man-made global warming hype has terrorized people for several decades. You don’t believe it’s been a lie? Would you believe a founder of Greenpeace? Dr. Patrick Moore admits it. He states,“One of my missions is to turn on its head that Carbon Dioxide is somehow dangerous, when, in fact, it is the most important nutrient for all life on earth and without this would be a dead planet. So, I say, not only is Carbon Dioxide good, it is essential”. So, I will ask, WHY WOULD PENNSYLVANIA OR ANY OTHER STATE WANT TO ALLOW CARBON CAPTURE PIPELINES IN THEIR STATE? The only reason I can dream up is kickbacks. Why would officials allow an extremely dangerous system to capture something that needs to be free-flowing in our atmosphere, put it under the ground (of which much of it was private property taken – with eminent domain if owners not willing togiveit away – and where it can be near the home of the “former owner”and possibly explode! Don’t believe me? Robert Powell sent me this video:WATCH HERE We are looking at Pennsylvania, but Tom DeWeese pointed out to me that Washington, Pennsylvania is rather close to both Wheeling, West Virginia and Marietta, Ohio. Thus, people in both of those states should be working with their fellow sane citizens in Pennsylvania to see that no Carbon gets captured for any reason near them. It is time to live with the truth, not lies. The truth isn’t used to steal our property. The truth will save billions of dollars, millions of eagles, whales and other endangered wildlife. And the truth will save human lives! How? By exposing the lies that cow farts and burps destroy Carbon Dioxide. We don’t need to eat bugs. By stopping the geoengineering that is destroying our atmosphere, our food crops, our water, and us. And think of all the money not being spent on poisonous chemicals that can be used to rebuild our treasury. And all the people who won’t have to have medical care for the poisons in their bodies. And all the money NOT spent on asinine Carbon Capture Pipelines, Solar and Wind farms. Let’s live our lives without lies that tear us apart because one faction believes the lies and wants to trash Teslas and ban meat. I, for one, can’t imagine living without bacon and steak. I can’t afford a Tesla but would love to have my old Sunbeam Tiger to enjoy on theTail of the Dragon. If we could succeed in removing this huge lie, everyone’s life would improve, and millions of people could regain their mental health instead of believing the sky will fall if we breath Oxygen. Kathleen Marquardt has been an advocate for property rights and freedom for decades. While not intending to be an activist, she has become a leader and an avid supporter of constitutional rights, promoter of civility, sound science, and reason. She is dedicated to exposing the fallacies of the radical environmental and animal rights movements. She has been featured in national publications including Fortune, People, the Washington Post, and Field and Stream, as well as television news programs such as Hard Copy, The McLaughlin Group, Geraldo, and many others. Today, she serves as Vice President of American Policy Center. Kathleen now writes and speaks on Agenda21/2030, and its threat to our culture and our system of representative government. **STAY INFORMED:SIGN UP FOR OUR UPDATES** Are You Prepared to Fight for Your Own Freedom?It’s time to put Earth Day to bed and get on taking care of God’s creationsCitizens Can Stop the CO2 Pipeline SteamrollerMore from APC **Are You Prepared to Fight for Your Own Freedom?** **It’s time to put Earth Day to bed and get on taking care of God’s creations** **Citizens Can Stop the CO2 Pipeline Steamroller** **Are You Prepared to Fight for Your Own Freedom?** **It’s time to put Earth Day to bed and get on taking care of God’s creations** **Citizens Can Stop the CO2 Pipeline Steamroller** Privacy Policy Media Contact Us FreedomPods Catching Fire News ****"}