{"id": 1515, "name": "Blasting News", "domain": "us.blastingnews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://us.blastingnews.com/news/tag/mixed-martial-arts/", "title": "Mixed Martial Arts", "content": "**Mixed Martial Arts** **Subscribe to this channel for the latest updates and all you need to know about mixed martial arts.** Welcome to the officialBlasting Newschannel for all things mixed martial arts related. Here you will find breaking news, interviews, videos, pictures, fight results, and more. **1.What is mixed martial arts?** The sport known as MMA became known with the start of the Ultimate Fighting Championship in November 1993. The concept was originally built to determine which martial arts style would come out on top. There were little to no rules, no time limits, or weight classes. Essentially you had two men enter a cage or a ring with \"no holds barred.\" A range of arts competed against one another. Boxing, wrestling, jiu-jitsu, judo, karate, and Muay Thai were some of the prominent styles incorporated. When you put them all together you have what is called \"mixed martial arts.\" After years of struggling to formulate a legitimacy, all while adapting and implementing rules, mixed martial arts started to become accepted. State athletic commissions began to oversee competition and the \"human cockfighting\" stigma began to dissipate and the sport became more mainstream. With the approval of the mixed martial arts bill in New York in 2016, the sports is now legalized in all 50 states. Today MMA is the fastest growing sport on the planet. There are hundreds of mixed martial arts promotions and thousands of MMA athletes globally. The UFC is the largest and most well-known MMA promotion of them all. The organization was sold fromZuffa LLC to WME-IMGin July 2016 for $4.2 billion, making it the largest sports franchise purchase in history. There are both amateur and professional levels in MMA. Aside from the varying weight classes, there are also different classes for men and women. The UFC currently has four women's divisions beginning at strawweight (115 pounds), flyweight (125 pounds), bantamweight (135 pounds), and featherweight (145 pounds). The men's division begins at flyweight and includes bantamweight and featherweight as well as lightweight (155 pounds), welterweight (185 pounds), middleweight (185 pounds), light heavyweight (205 pounds), and heavyweight (maximum of 265 pounds). **2.Money Sport** Depending on the promotion's visibility in the media, talent level and marketability of a fighter, the pay between one mixed martial artist and another can vary. Former UFC women's bantamweight champion Ronda Rousey is one of the highest paid athletes in combat sports, but none have topped the likes ofConor McGregorwho recently crossed over to competitive boxing to take on Floyd Mayweather Jr. From the amateur fighter to the highest level of talent, pay has and always will be inconsistent and sometimes erratic. Fighters often times create brands and or personas for themselves to help set up careers for when they are done fighting. Who follows the Mixed Martial Arts channel? Lawrence Lease 20/2/2019 Thomas Albano 7/12/2018 Thomas Albano 4/11/2018 Thomas Albano 26/10/2018 Thomas Albano 25/10/2018 Thomas Albano 7/10/2018 Thomas Albano 5/10/2018 Thomas Albano 30/9/2018 Mary Grace Petil 15/2/2018 Eric Kowal 6/10/2017 Eric Kowal 6/10/2017 Eric Kowal 5/10/2017 Eric Kowal 5/10/2017 Eric Kowal 4/10/2017 Eric Kowal 29/9/2017 Eric Kowal 21/9/2017 Jon Lindley Agustin 31/8/2017 Tonia Whitfield 10/7/2017 Eric Kowal 27/6/2017 Eric Kowal 23/6/2017 Tonia Whitfield 10/6/2017 Eric Kowal 26/5/2017 Eric Kowal 20/5/2017 Tresa Patterson 28/3/2017 Al Stover 6/3/2017 Blasting News United States> Mixed Martial Arts"}