{"id": 368, "name": "Dissent Magazine", "domain": "dissentmagazine.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dissentmagazine.org/blog/know-your-enemy-christopher-caldwells-case-against-civil-rights/", "title": "Know Your Enemy Christopher Caldwells Case Against Civil Rights", "content": "Login About Us Magazine Online Blog Podcasts Events Subscribe Store Donate Spring 2025 **Spring 2025** **Spring 2025** Subscribe Magazine Online Blog Podcasts Events Store Logout About Us Donate Contact Advertise Newsletter **Know Your Enemy: Christopher Caldwell’s Case Against Civil Rights** **Know Your Enemy: Christopher Caldwell’s Case Against Civil Rights** Matt and Sam discuss Christopher Caldwell’sThe Age of Entitlement: America Since the Sixties, a broadside against the 1964 Civil Rights Act. Know Your Enemyis a podcast about the American right co-hosted by Matthew Sitman and Sam Adler-Bell. Read more about ithere. You can subscribe to, rate, and review the show onApple PodcastsandStitcher, and receive bonus content by supporting the podcast onPatreon. Attentive listeners will notice that this episode is about a book but isn’t an author interview. That’s because it’s the first in a new occasional series of episodes that will be dedicated to books by conservative writers that we think are important—whether because a book articulates the right’s approach to an issue or problem in an especially revealing way, influenced or galvanized the conservative movement when it was published, or, with the benefit of hindsight, has proven to be prescient about where the right, and perhaps the country, were heading. Many of these books will be from decades past, but our first selection is more recent: Christopher Caldwell’s 2020 broadside against the 1964 Civil Rights Act and what it wrought,The Age of Entitlement: America Since the Sixties. Caldwell argues that the apparatus created by civil rights legislation and the federal courts in the 1960s amounted to a new, second constitution that displaced the one Americans had lived under since the founding, one that jettisoned traditional liberties like freedom of association and replaced democratic self-government with rule by bureaucrats, lawyers, and judges. Who has access to these new levers of power? Not the working-class whites who are neither a favored racial or ethnic minority—a person of color—nor a member of the progressive elite who preside over the new regime. Much ofThe Age of Entitlementis dedicated to tracing the effects of civil rights legislation when it comes to the causes that arose in its wake: feminism, immigrant rights, gay marriage, and more. But the book is equally a brutal examination of the legacy of the Baby Boom generation (and, by extension, Ronald Reagan, whose presidency they powered), that most “entitled” of generations, whom Caldwell deplores for wanting to have their cake and eat it too. Boomers, in Caldwell’s telling, refused to straightforwardly reject the second constitution and its distributional demands, while also insisting petulantly, again and again, on having their taxes cut. We explore these topics and more, and end with a discussion of where Caldwell leaves the reader—and where we’re at now, in light of the challenge he poses to both conservatives and the left. Sources: Christopher Caldwell,The Age of Entitlement: America Since the Sixties(2020) —Reflections on the Revolution In Europe: Immigration, Islam and the West(2009) Helen Andrews,The Law That Ate the Constitution,Claremont Review of Books(2020) Timothy Crimmins,America Since the Sixties: A History without Heroes,American Affairs(2020) Perry Anderson,Portents of Eurabia,The National(2009) Subscribe onPatreonto hear our bonus episodes! **Subscribe** **Subscribe** Sign up for theDissentnewsletter: About Contact Advertise Donate Subscribe Facebook Twitter Newsletter"}