{"id": 1609, "name": "WQOW - Eau Claire News", "domain": "wqow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wqow.com/weather/weather-news/safety/", "title": "Weather News", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Election Results Business and Economy Chippewa Valley Crime and Courts Wake Up Wisconsin Digging Deeper HSHS and Prevea Closure International National Politics Wisconsin You Ask, We Answer Entertainment Children's Health Mental Health Interactive Radar Alerts Closings and Delays Submit Closings Traffic Cameras Download the WQOW 18 Storm Track Weather App Weather & Climate News Pet Walking Forecast Prep Sports College Sports Pro Sports Sports Top 6 at 6 WIAA Sports Live Deals Photo Submissions Positively Chippewa Valley Contests Tools For Schools Community Calendar Jefferson Awards Birthdays Birthday Club Celebrate Local Multiplying Good Golf Outing On Demand Recipes Cars TV Apps YouTube The American Athlete TV Listings WQOW 18 News Livestream 18.1 ABC Network 18.4 Court TV 18.5 Justice Network Discover Wisconsin Sign up for Email Alerts Our Apps Meet the WQOW 18 News Team Advertise with WQOW Advertiser Services Find WQOW 18 News on Social Media Careers at WQOW 18 News Site searchSearch Site searchSearch Site searchSearch 75° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Eye on Eau Claire Weather Sports Community Video Watch Deals Contact Contests Contact Us: Meet the Team Submit a News Tip Download Our Apps: WQOW News App 18 Storm Track Weather App Education Prevention Safety Severe **Safety** **Severe Weather Awareness Week Day 5: Comparing watches vs. warnings, being storm ready and what to expect from the 18 Storm Track team** UpdatedApr 11, 2025 All this week (April 7-11) is Severe Weather Awareness in Wisconsin and each day, the 18 Storm Track team will be covering different topics re… **Severe Weather Awareness Week Day 4: Talking about tornadoes and where the best places are take shelter** UpdatedApr 10, 2025 All this week (April 7-11) is Severe Weather Awareness in Wisconsin and each day, the 18 Storm Track team will be covering different topics re… **Severe Weather Awareness Week Day 3: Creating a Severe Weather Safety Kit** UpdatedApr 9, 2025 All this week (April 7-11) is Severe Weather Awareness in Wisconsin and each day, the 18 Storm Track team will be covering different topics re… **Severe Weather Awareness Week Day 2: Severe thunderstorms and the different hazards they can produce** UpdatedApr 8, 2025 All this week (April 7-11) is Severe Weather Awareness in Wisconsin and each day, the 18 Storm Track team will be covering different topics re… **Severe Weather Awareness Week Day 1: Flooding Safety** UpdatedApr 7, 2025 This week (April 7-11) is Severe Weather Awareness in Wisconsin and each day, the 18 Storm Track team will be covering different topics relati… **NWS releases 2025 Skywarn Storm Spotter Training class schedule** UpdatedMar 7, 2025 The National Weather Service has announced the locations of classes for their severe weather Skywarn spotter training classes, which teach wha… **What to expect from Stormtracker 18 when severe weather threatens** UpdatedApr 18, 2024 All this Severe Weather Awareness Week, Stormtracker 18 has educated what different severe weather elements mean and brought different safety … **How tornadoes cause damage and why the interior room on lowest floor is safest storm shelter location** UpdatedMay 20, 2024 Thursday's Tornado and Severe Weather Awareness Week topic is all about tornadoes! Specifically, the Stormtracker 18 Weather Team wants to sho… **Creating your severe shelter safety kit: Severe Weather Awareness Week Day 3** UpdatedApr 18, 2024 Sirens may sound Thursday across Western Wisconsin at 1:45pm for the first of two tornado drills and mock warnings from the NWS today. The sec… **Why you should take severe thunderstorms just as seriously as tornadoes- Severe Weather Awareness Week Day 2** UpdatedApr 18, 2024 Tuesday, April 9 was day 2 of Tornado and Severe Weather Awareness week in Wisconsin. On Monday, your Stormtracker 18 Weather Team brought you… **Meet The Production Team** **18 Storm Track Weather Tools** **Eau Claire, WI** **Hourly Forecast** **Eau Claire, WI** Wind:S @ 6mph Precip:1% Chance Humidity:51% Wind Chill:74° Heat Index:74° UV Index:0 Low Visibility:9 mi Wind:S @ 6mph Precip:1% Chance Humidity:58% Wind Chill:70° Heat Index:70° UV Index:0 Low Visibility:10 mi Wind:S @ 7mph Precip:2% Chance Humidity:63% Wind Chill:68° Heat Index:68° UV Index:0 Low Visibility:10 mi Wind:S @ 7mph Precip:2% Chance Humidity:67% Wind Chill:67° Heat Index:67° UV Index:0 Low Visibility:10 mi Wind:SSW @ 7mph Precip:2% Chance Humidity:68% Wind Chill:66° Heat Index:66° UV Index:0 Low Visibility:10 mi Wind:SW @ 7mph Precip:1% Chance Humidity:69% Wind Chill:65° Heat Index:65° UV Index:0 Low Visibility:10 mi Wind:WSW @ 7mph Precip:1% Chance Humidity:72% Wind Chill:64° Heat Index:64° UV Index:0 Low Visibility:10 mi Wind:WSW @ 7mph Precip:3% Chance Humidity:75% Wind Chill:63° Heat Index:63° UV Index:0 Low Visibility:10 mi Wind:W @ 7mph Precip:4% Chance Humidity:77% Wind Chill:63° Heat Index:63° UV Index:0 Low Visibility:10 mi Wind:WNW @ 7mph Precip:5% Chance Humidity:80% Wind Chill:62° Heat Index:62° UV Index:0 Low Visibility:10 mi Wind:WNW @ 5mph Precip:6% Chance Humidity:83% Wind Chill:61° Heat Index:61° UV Index:0 Low Visibility:10 mi Wind:WNW @ 6mph Precip:5% Chance Humidity:79% Wind Chill:64° Heat Index:64° UV Index:0 Low Visibility:10 mi **7-day Forecast** **Eau Claire, WI** Chance of Precip:6% Sunrise:05:19:36 AM Sunset:08:51:45 PM Humidity:68% Wind:SW@7mph UV Index:0 Low A few passing clouds. Low near 60F. Winds SW at 5 to 10 mph. Chance of Precip:58% Sunrise:05:19:26 AM Sunset:08:52:18 PM Humidity:55% Wind:NW@8mph UV Index:5 Moderate Cloudy skies early, followed by partial clearing. Low around 55F. Winds light and variable. Chance of Precip:72% Sunrise:05:19:18 AM Sunset:08:52:48 PM Humidity:66% Wind:E@11mph UV Index:7 High Rain showers in the evening will evolve into a more steady rain overnight. Low 53F. Winds E at 10 to 15 mph. Chance of rain 80%. Rainfall near a half an inch. Chance of Precip:54% Sunrise:05:19:13 AM Sunset:08:53:17 PM Humidity:82% Wind:E@13mph UV Index:4 Moderate Cloudy with showers. Low 52F. Winds ENE at 10 to 15 mph. Chance of rain 40%. Chance of Precip:24% Sunrise:05:19:10 AM Sunset:08:53:44 PM Humidity:80% Wind:E@8mph UV Index:4 Moderate Partly to mostly cloudy. Low 54F. Winds E at 5 to 10 mph. Chance of Precip:24% Sunrise:05:19:09 AM Sunset:08:54:08 PM Humidity:71% Wind:ESE@7mph UV Index:8 Very High Cloudy with a few showers. Low around 60F. Winds light and variable. Chance of rain 30%. Chance of Precip:24% Sunrise:05:19:11 AM Sunset:08:54:31 PM Humidity:71% Wind:S@9mph UV Index:5 Moderate Variable clouds with scattered thunderstorms. Low 63F. Winds SSW at 5 to 10 mph. Chance of rain 50%. Facebook Twitter Instagram News Weather Sports Video Watch Community Contact Search Careers Closed Captioning FCC Applications FCC Public File EEO Report Advertiser Services Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}