{"id": 388, "name": "The Economist", "domain": "economist.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.economist.com/podcasts/2025/06/11/why-some-parents-now-want-girls-not-boys", "title": "Why Some Parents Now Want Girls Not Boys", "content": "Catch up on global daily news Dive into compelling long reads Tune into captivating conversations Watch engaging short films Gain insights from experts Curated news, direct to your inbox War in the Middle East War in Ukraine Climate change Geopolitics The world economy Artificial intelligence Trump approval tracker **Current topics** War in the Middle East War in Ukraine Climate change Geopolitics The world economy Artificial intelligence Trump approval tracker **World** The world this week China United States Europe Britain Middle East Africa Asia The Americas International **Business & economics** Finance & economics Business Big Mac index Economic & financial indicators **Opinion** Leaders Letters to the editor By Invitation **In depth** Science & technology Briefing Graphic detail Interactives The Economist explains Special reports Technology Quarterly Essay Schools brief **Culture & society** Culture The Economist reads Obituary Games **Weekly edition** This week Past editions **Our A-to-Zs** Economics American politics Military terms International relations Weekly edition The world in brief War in the Middle East War in Ukraine United States The world economy Business Artificial intelligence Archive 1945 Games **My Economist** Unlimited digital access to all reporting, podcasts, newsletters and events **SUBSCRIBER BENEFITS** Podcasts Newsletters Video Live virtual events The Economist app Espresso app Saved stories **SUBSCRIBER BENEFITS** Podcasts Newsletters Video Live virtual events The Economist app Espresso app Saved stories Account Log out Account Log out **Why some parents now want girls not boys** **Also on the daily podcast: Germany’s army expands and should you drink more coffee?** Your browser does not support the <audio> element. For centuries, male children were prized as heirs and breadwinners. Now thedesire to have boysis diminishing and some parents would rather have a girl. What Germany’s expandedarmed forcesmean for Europe. And if coffee can benefit your health,how many mugsshould you consume a day? Runtime: 23 min Listen on:Apple Podcasts|Spotify Listen to what matters most, from global politics and business to science and technology—Subscribe to Economist Podcasts+ For more information about how to access Economist Podcasts+, please visit ourFAQs pageor watchour videoexplaining how to link your account. **Transcript** **More from Podcasts** PodcastBabbage **An immune-system user’s guide—an interview with Daniel Davis** Our podcast on science and technology. This week: a myth-busting tour through immunology 37:34 PodcastEditor’s Picks **Africa’s architectural movement will benefit the world** A handpicked article read aloud from the latest issue of The Economist 07:30 PodcastDrum Tower **Xiaolu Guo on love, art and how the Chinese psyche has changed** Our weekly podcast on China. This week, a chat with the filmmaker and writer, most recently of “Call Me Ishmaelle”, a reimagining of “Moby Dick” 36:07 PodcastThe Intelligence **Apple has fallen behind on AI. Can it recover?** Also on the daily podcast: China-Russia relations and psychedelics pioneer Amanda Feilding 23:15 PodcastEditor’s Picks **A look at Germany’s new army** A handpicked article read aloud from the latest issue of The Economist 11:36 PodcastBoss Class **Meet the boss: Ilkka Paananen of Supercell** Why the “world’s least powerful CEO” prefers to delegate 36:00 LinkedIn Instagram Facebook X TikTok YouTube WhatsApp **The Economist** About Reuse our content Subscribe Economist Enterprise SecureDrop **The Economist Group** The Economist Group Economist Intelligence Economist Impact Economist Impact Events Economist Education Courses **Contact** Help and support Advertise Press centre **Careers** Working here Executive Jobs To enhance your experience and ensure our website runs smoothly, we use cookies and similar technologies. Terms of use Privacy Cookie Policy Accessibility Modern Slavery Statement Sitemap Your Data Rights Registered in England and Wales. No. 236383 | Registered office: The Adelphi, 1-11 John Adam Street, London, WC2N 6HT | VAT Reg No: GB 340 436 876 © The Economist Newspaper Limited2025"}