{"id": 1114, "name": "Popular Mechanics", "domain": "popularmechanics.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.popularmechanics.com/about/a40180523/pop-mech-pro-membership-news-benefits/", "title": "Pop Mech Pro Membership News Benefits", "content": "Pop Mech Pro Subscribe Home and DIY Power Tools Cars Technology Military Science Adventure Sci-Fi Airplanes Space Gifts Deals Visual Stories Promotions Shop Follow Get Our Newsletter My Bookmarks News Science Military Home Gear Reviews Pop Mech Pro About The Best New Science, Military, and DIY Stories From Pop Mech Pro **The Best New Science, Military, and DIY Stories From Pop Mech Pro** Here's a free look at the latest news and cool happenings from our membership program—and how to join now. Pop Mech Prois a premium membership program for people as curious about the world—and how to be more capable while living in it—as you are. Through Pop Mech Pro, we’ve expanded the ways we can reach you beyond simple stories in a magazine and on a website, offering more unique benefits to help you learn, make, discover, and commandeverything. When youbecome a Pop Mech Pro member, you’ll: Unlock all stories, project plans, guides, videos, and gadget reviews on PopularMechanics.com Get every print issue delivered straight to your mailbox Receive a weekly members-only newsletter with exclusive columns from editors and experts Get access tosix special digital issuesper year, with brand-new features you can’t read anywhere else Enjoy the opportunity to appear inPop Mech Save on gear from thePop Mechshop, including free shipping on every order Want to see what you’ll experience the minute youbecome a member? Here’s a regularly updated look at all the latest news and cool happenings from Pop Mech Pro. ➡ Scientists Say There’s an ‘Anti-Universe’ Running Backward in Time Here’s a story that’s making members’ heads spin: Scientists believethere could be an “anti-universe” somewhere out therethat looks like the mirror image of our own universe, reciprocating almost everything we do. This newly discovered “anti-universe” might run parallel to our own universe, but the researchers say it essentially spread out “backward” in time, prior to the Big Bang, in the same way our universe progressed “forward” in time. The model eliminates the need for something called “inflation,” a period of time in which the universe massively expanded in order to account for its size soon after birth. Instead, the matter could have naturally expanded over time in a less forceful way, which could simplify our explanation for what happened. If this sounds like wild and heady stuff, you’re absolutely right. But it could finally explain some of the most notorious unanswered questions in all of science, like this one: Justwhat the hell is dark matter?You’re going to want toread the whole anti-universe thing here. See you down the rabbit hole. **➡ Build Your Own DIY Smokeless Fire Pit** After evaluating a bunch of smokeless fire pits, test editor Brad Ford decided to make one himself. “Without taking anything away from the companies making fire pits,” he says, “they’re fairly simple once you understand how they work.” The result is thiseasy plan to build your own DIY smokeless fire pit, which members have been downloading in droves. Ford started with a 55-gallon drum, cut roughly in half horizontally, as the main body. Then, he slit one of those halves vertically down the side and squeezed it to a smaller diameter to fit inside the other half; this created the double-wall construction that makes these fire pits work. After adding a bottom, Ford created a cap that bridged the tops of the inner and outer walls. Finally, he cut holes around the base on the outside, in the bottom inside, and around the top edge inside. “It’s certainly not as pretty as those commercially available, but it works,” Ford says. “And there’s pride in building it by hand.” Here’swhat you’ll need to make your own fire pit, and the complete instructions for building it. **➡ Can You Solve the Burning Rope Riddle?** This simple puzzle recently appeared in amembers-only newsletter. Think you can crack it? You have two ropes coated in oil to help them burn. Each rope will take exactly one hour to burn all the way through. However, the ropes don’t burn at constant rates; there are spots where they burn a bit faster and spots where they burn a bit slower, but it always takes one hour to finish the job. With a lighter to ignite the ropes, how can you measure exactly 45 minutes? Click here to see the solution. **➡ The Secret to a Foolproof Trucker’s Hitch** Test editor Roy Berendsohn shared the 12 steps to mastering his time-tested modifiedtrucker’s hitch knotwith members. It’s fast to learn, easy to fashion, and quick to untie. “I’ve used it hundreds of times to secure everything in the bed of my truck, from a pile of groceries to lawnmowers,” he says. “And it’s very strong; I’ve never had a load come loose.” See how to rig the hitch to secure any load. **➡ Ask the Expert: The Near-Death Experience Doctor** For the first time,scientists recorded the brain waves of a dying person. The researchers noticed an 87-year-old man’s brain experienced higher-order cognitive functions immediately following cardiac arrest, possibly indicating active memory recall. We askedDr. Sam Parnia, an expert on near-death experiences, what this study reveals about our brain activity at death. Here’s an excerpt of what he told us in themember-exclusive story: Read more about near-death experiences here. **➡ AboutPop Mech Pro** For over 120 years,Popular Mechanicshas strived to be the definitive, evolving manual for understanding everything. We give you the knowledge you need to get the most out of life, whether that’s how to change a tire, build a farmhouse table, learn astrophotography, identify fighter jets, or hike the Appalachian Trail. But the way we talk to you—through reports on new discoveries, how-to plans for home projects, and in-depth gear reviews—has changed over time, which is why we launched our membership program,Pop Mech Pro, in 2020.Join today! **About** A Guide to Leather: Grains, Grades, and Quality A Guide to Leather: Grains, Grades, and Quality The Best Pull-On Work Boots I Recommend The Best Pull-On Work Boots I Recommend How to Maintain Your Generator How to Maintain Your Generator How to Lace Your Hiking Boots the Right Way How to Lace Your Hiking Boots the Right Way customer service customer service How to Pitch a Story to Popular Mechanics How to Pitch a Story to Popular Mechanics Cyber Monday Drone Deals of 2024: Up to 40% Off Cyber Monday Drone Deals of 2024: Up to 40% Off Best Black Friday Drone Deals of 2024 Best Black Friday Drone Deals of 2024 Sharpening 101: Hone Your Tools The Right Way Sharpening 101: Hone Your Tools The Right Way Our DIY Maestro: Roy Berendsohn Our DIY Maestro: Roy Berendsohn Sticker Removal 101 Sticker Removal 101 You'll Always Want These Screws In Your Workshop You'll Always Want These Screws In Your Workshop A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. All Rights Reserved."}