{"id": 1454, "name": "Time Magazine", "domain": "time.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://time.com/7291978/los-angeles-immigration-protests-trump-national-guard-deployed-newsom-backlash/", "title": "Los Angeles Immigration Protests Trump National Guard Deployed Newsom Backlash", "content": "ExploreClose **Trump Sparks Backlash as National Guard Arrives in L.A. on His Orders to Quell Immigration Protests: ‘Purposefully Inflammatory’** Politics Immigration Reporter Reporter Large-scale protests are taking place in the Los Angeles area against President DonaldTrump’s immigration policiesand raids conducted by the U.S. Immigration and Customs Enforcement (ICE). Amid reports of escalating violence and unrest, L.A. Mayor Karen Bass issued a stark warning. “Everyone has the right to peacefully protest, but let me be clear: Violence and destruction are unacceptable, and those responsible will be held accountable,”Bass saidon Saturday evening, emphasizing that L.A. personnel had “been in direct contact with officials in Washington, D.C.,” in an effort to “find the best path forward.” Advertisement Advertisement However, there has been conflict as to what the best course of action should be. In a move that prompted division,Trump ordered the California National Guardto quell the immigration protests, moving to deploy 2,000 soldiers to the Los Angeles area. “These radical left protests, by instigators and often paid troublemakers, will not be tolerated. Also, from now on, masks will not be allowed to be worn at protests. What do these people have to hide, and why?” Trump said viaTruth Social. On Sunday morning, around 8 a.m. local time, troops from California’s National Guard began to arrive in L.A. The U.S. Northern Command, a combatant command of the U.S. Department of Defense,confirmed that\"elements of the 79th Infantry Brigade Combat Team from the California National Guard have begun deploying to the Los Angeles area, with some already on the ground.\" Asecond update statedthat “79th IBCT has deployed approximately 300 soldiers to three separate locations in the greater Los Angeles area. They are conducting safety and protection of federal property and personnel.” CaliforniaGov. Gavin Newsom, a Democrat who has a long history of tension with the President, labelled Trump’s move to involve the National Guard as“purposefully inflammatory” and something that will only \"escalate tensions.\" “The federal government is taking over the California National Guard and deploying 2,000 soldiers in Los Angeles—not because there is a shortage of law enforcement, but because they want a spectacle,” Newsom saidon Saturday, urging Californians to “not give them one [a spectacle]” and to “speak out peacefully” rather than resorting to violence. Following the arrival of the National Guard in L.A. on Sunday morning, Newsomposted a video on social mediaof the troops. Doubling down on his disapproval, he said: “Trump is sending 2,000 National Guard troops into L.A. County—not to meet an unmet need, but to manufacture a crisis. He’s hoping for chaos so he can justify more crackdowns, more fear, more control.” Newsom again urged Californians to “never use violence” and “stay peaceful.” Newsom had previously accusedthe federal government of \"sowing chaos so they can have an excuse to escalate,\" countering that this \"is not the way any civilized country behaves.\" Read More:Trump Set to Ratchet Up His Immigration Crackdown During Next 100 Days Earlier on Sunday morning, Independent Sen. Bernie Sanders of Vermont strongly criticized Trump’s move. \"We have a President who is moving this country rapidly into authoritarianism,” Sanders said duringan appearance on CNN’sState of the Union.“My understanding is—the Governor of California, the Mayor of the city of Los Angeles, did not request the National Guard, but he thinks he has a right to do anything he wants. I would say, that to a large degree, the future of this country rests with a small number of Republicans in the House and Senate who know better.” However, Republican Sen. Markwayne Mullin of Oklahoma defended Trump’s decision to bypass the California Governor and deploy the National Guard to the Los Angeles area. \"I don't know why a Governor would want to try to protect illegal activity inside a state. And the President has made it very clear, if the Governor or the Mayor of a city isn't willing to protect the citizens of his state or the city, then the President will,”Mullin saidonState of the Union. Elsewhere, the ACLUcondemned Trump’s decision, calling it “akin to a declaration of war on all Californians.” “There is no rational reason to deploy the National Guard on Angelenos, who are rightfully outraged by the federal government’s attack on our communities and justly exercising their First Amendment right to protest the violent separation of our families,” the ACLU’s statement said. “We intend to file suit and hold this administration accountable and to protect our communities from further attacks.” Meanwhile, in an emailed statement to TIME, Lisa Sherman Luna, executive director of the Tennessee Immigrant and Refugee Rights Coalition, warned that the scenes in L.A. should concern every American. \"After ICE escalated their already rogue operations in Los Angeles, they are using the chaos and crisis that they themselves created to justify calling up the National Guard,\" said Luna. \"This Administration’s continued attempts to control and punish its political opponents, combined with its willingness to ignore court orders that it doesn’t agree with, and steamroll people's right to due process, should concern each and every American. Today it’s Los Angeles, but tomorrow it will be at your doorstep.\" Further showcasing the Trump Administration's stance, Defense Secretary Pete Hegsethposted a warning on Xlate on Saturday night, stating the Pentagon was ready to mobilize active-duty Marines at Camp Pendleton—a main West Coast base of the Marines. “They are on high alert,” Hegseth remarked. In response,Newsom said: “The Secretary of Defense is now threatening to deploy active-duty Marines on American soil against its own citizens. This is deranged behavior.” **When was the last time a President activated a state’s National Guard force without a request from the state's governor?** According to experts, Trump is the first President to deploy the National Guard without a request from the state Governor since 1965, when President Lyndon B. Johnson sent federal troops to Alabama to protect those partaking in a civil rights march from Selma to Montgomery, led by Martin Luther King Jr. Trump’s directive, though,was for the deployed troops to “perform those military protective activities that the Secretary of Defense determines are reasonably necessary to ensure the protection and safety of Federal personnel and property.” The National Guard has been deployed in Los Angeles before—including during the George Floyd protests of 2020at the request of Newsom and duringthe five-day 1992 rebellionsparked by the beating of Rodney King. In 1992, more than 10,000 National Guardsmen and 2,000 federal troops were deployed to quell the protests. But the key difference between that instance and what is currently taking place, is that in 1992 the then-Governor of California Pete Wilson and L.A. Mayor Tom Bradley had requested these troops be federalized by then-President George H.W. Bush. **What are the L.A. protests about?** The protests began on Friday after ICE agents conducted another round of operations in and around the city. The Department of Homeland Security (DHS)said in a statement on Saturdaythat ICE operations in L.A. this week have resulted in the arrest of 118 people. Overall, the DHS said: “ICE has arrested 2,000 aliens a day this week and these violent activists won’t deter enforcement operations.” All 15 city council members releaseda joint statementcondemning the raids and their impact on the community. “We condemn this in no uncertain terms: Los Angeles was built by immigrants and it thrives because of immigrants. We will not abide by fear tactics to support extreme political agendas that aim to stoke fear and spread discord in our city,” the statement read. “To every immigrant living in our city: we see you, we stand with you, and we will fight for you. Los Angeles will continue to be a place that values and dignifies every human being, no matter who they are or where they come from.” Speaking out further,Mayor Bass said: \"These tactics sow terror in our communities and disrupt basic principles of safety in our city… we will not stand for this.\" Read More:Legal Immigration Pathways Are Disappearing The Coalition for Humane Immigrants Rightshosted a press conferenceon Friday, organized by leaders of the L.A. Rapid Response Network. “To our immigrant community: We see you, we hear you, and we will not stop fighting for you,” the organization said in an online post. “We say no deportations. No to mass detentions. Families belong together. We belong here.” Protests in downtown Los Angeles and in the city of Paramount in Los Angeles County have garnered national attention as some protesters clashed with law enforcement—leading to multiple arrests. Speaking to theNew YorkTimes,Bilal A. 'Bill' Essayli, the interim U.S. Attorney for the Central District of California, said that over 100 people were arrested by federal law enforcement at protests on Friday, with at least 20 more arrests made during Saturday’s demonstrations. Some initial demonstrations appear to have been organized by immigrant rights groups, while others were impromptu protests that began at the site of some of the raid operations. Further protests are planned for Sunday. Daniel Kanstroom, a professor at Boston College Law School, says that this is an “incredibly dangerous” moment in America—and that L.A. represents just one juncture in the “tectonic problem” of immigration that has been festering for decades. Trump’s tactics, he says, have only worsened this crisis. “When you have agents apparently arbitrarily arresting people, pulling them off the street without showing a warrant, without explaining who they are, without being respectful, then this creates a sense of terror and fear in the community, and that tends to result, sooner or later, in a kind of resistance, which is what we're seeing develop,” says Kanstroom. The “unusual if not unprecedented” use of “emergency” is once again at play here by Trump, he adds. “He's calling everything as an emergency. So it's not at all surprising he would seek to take advantage of an emergency like this in order to crack down in even harsher ways.” **Must-Reads from TIME** L.A. Protests Intensify as Police Report ‘Mass Arrests’ Despite Curfew, While Trump Says City Is ‘Lucky’ He Got Involved Greg Abbott Orders National Guard to Deploy in Texas as Protests Spread Across U.S. Cities Veterans Condemn Trump’s ‘Misuse of Military Power’ Amid L.A. Protests Trump Suggests Arresting Gavin Newsom, Escalating Tensions Over ICE Raids Can the President Activate a State’s National Guard? Gavin Newsom Sues Trump Over National Guard Mobilization, Says President ‘Manufactured’ Crisis in California **Sections** Home Politics Health AI World Climate Ideas Entertainment Newsletters **More** Future of Work by Charter TIME 2030 The TIME Vault TIME For Kids TIME Futures TIME Edge TIME Studios Video **About Us** Our mission Contact the Editors Press Room Media Kit Reprints & Permissions Supplied Partner Content Masthead Careers Site Map Modern Slavery Statement **Your Subscriptions** Subscribe Access My Digital Magazine Manage My Subscription Global Help Center Supplied Partner Content Buy an issue Shop the Cover Store Give a Gift ©2025TIME USA, LLC. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of Service,Privacy Policy (Your Privacy Rights)andDo Not Sell or Share My Personal Information. TIME may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."}