{"id": 1036, "name": "National Security Archive", "domain": "nsarchive.gwu.edu", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://nsarchive.gwu.edu/briefing-book/india-and-pakistan-intelligence-nuclear-vault/2025-04-22/us-intelligence-south-asian", "title": "India And Pakistan Intelligence Nuclear Vault", "content": "**Main navigation** Main Menu▸ Home PublicationsPublicationsBooksCEU Press SeriesDNSA Publications Books CEU Press Series DNSA Publications Books CEU Press Series DNSA PostingsAll postingsArchive News AlertsBriefing BooksSourcebooksSpecial ExhibitsUnredacted (Blog) All postings Archive News Alerts Briefing Books Sourcebooks Special Exhibits Unredacted (Blog) All postings Archive News Alerts Briefing Books Sourcebooks Special Exhibits Unredacted (Blog) ProjectsAll ProjectsAble Archer 83 SourcebookAfghanistan-TalibanBrazilChileChinaClimate ChangeColombiaCubaCyber VaultGenocide DocumentationGuatemalaHuman RightsIndonesiaIntelligenceIran-U.S. RelationsIraqJapanKoreaMexicoNuclear VaultNunn-LugarOpenness in Russia and Eastern EuropeRussia ProgramsSouthern ConeTorture ArchiveVietnam All Projects Able Archer 83 Sourcebook Afghanistan-Taliban Brazil Chile China Climate Change Colombia Cuba Cyber Vault Genocide Documentation Guatemala Human Rights Indonesia Intelligence Iran-U.S. Relations Iraq Japan Korea Mexico Nuclear Vault Nunn-Lugar Openness in Russia and Eastern Europe Russia Programs Southern Cone Torture Archive Vietnam All Projects Able Archer 83 Sourcebook Afghanistan-Taliban Brazil Chile China Climate Change Colombia Cuba Cyber Vault Genocide Documentation Guatemala Human Rights Indonesia Intelligence Iran-U.S. Relations Iraq Japan Korea Mexico Nuclear Vault Nunn-Lugar Openness in Russia and Eastern Europe Russia Programs Southern Cone Torture Archive Vietnam Documents FOIAFOIAFOIA Legislative HistoryHow to File a FOIA RequestWhere to Submit a FOIA/MDR RequestMaking the FOIA Work for YouEffective FOIA Requesting for EveryoneFOIA Advisory Committee Oversight ReportsFOIA AuditsRosemary AwardsText of the FOIA FOIA FOIA Legislative History How to File a FOIA Request Where to Submit a FOIA/MDR Request Making the FOIA Work for You Effective FOIA Requesting for Everyone FOIA Advisory Committee Oversight Reports FOIA Audits Rosemary Awards Text of the FOIA FOIA FOIA Legislative History How to File a FOIA Request Where to Submit a FOIA/MDR Request Making the FOIA Work for You Effective FOIA Requesting for Everyone FOIA Advisory Committee Oversight Reports FOIA Audits Rosemary Awards Text of the FOIA DNSA Blog Русские Страницы AboutAbout the National Security ArchiveGovernanceFunders and SupportersStaff and FellowsArchive In the NewsTimeline: 1985-2025AwardsAccomplishmentsTestimonialsPoliciesAnnual ReportsLegal and FinancialJobs and InternshipsGuide for ResearchersContact About the National Security Archive Governance Funders and Supporters Staff and Fellows Archive In the News Timeline: 1985-2025 Awards Accomplishments Testimonials Policies Annual Reports Legal and Financial Jobs and Internships Guide for Researchers Contact About the National Security Archive Governance Funders and Supporters Staff and Fellows Archive In the News Timeline: 1985-2025 Awards Accomplishments Testimonials Policies Annual Reports Legal and Financial Jobs and Internships Guide for Researchers Contact **U.S. Intelligence on South Asian Conflict Scenarios** Possible Indian bombing attacks on Pakistan’s nuclear facilities, including the Karachi Nuclear Power Plant (KANUPP), figured in U.S. intelligence analysis of Indian preventive action against the Pakistani nuclear program. A study conducted by Lawrence Livermore Laboratory found that an attack blowing a hole in the reactor could release iodine 131 into the air at levels that could produce “heavy casualties” from thyroid cancer. (Photo from World Nuclear Industry Status Report, 21 October 2021) National Intelligence Estimate Found 20 Percent Chance of War Between India and Pakistan During 1990s “High” Risk that “Miscalculation” Could Lead to Nuclear Exchange, According to 1989 State Department Report 1981 Livermore Briefing Saw Potential for Radiation Danger from Attack on Pakistan’s Karachi Nuclear Power Plant Edited by William Burr For more information, contact:202-994-7000 ornsarchiv@gwu.edu NSC official Bruce Riedel takes notes during a conversation in 2000 at Camp David between President William Clinton and Israeli Prime Minister Ehud Barak (facing Clinton and seated next to the Israeli notetaker). A career CIA officer with previous assignments at the White House, Riedel had served as National Intelligence Officer for the Near East and South Asia, where he directed the final stages of work on the NIE on “India-Pakistan: Prospects for War in the 1990s.” (photo courtesy of Bruce Riedel). Map showing the Siachen Glacier region in Kashmir, an important “point of friction” between India and Pakistan. The “highest and bleakest battlefield in the world,” Siachen was an area where the two countries had not demarcated the Line of Control and were suspicious of the other’s intentions. (Map from Document 4, INR report on “India-Pakistan”) India’s Prime Minister Rajiv Gandhi (above) and Pakistan’s Prime Minister Benazir Bhutto developed good rapport during the late 1980s and early 1990s but were too weak domestically to tackle difficult issues such as nuclear weapons. Nevertheless, in 1988, they signed a “No Attack on Nuclear Facilities” agreement along with other Confidence Building Measures. Benazir Bhutto in Washington, D.C., in 1989. Bhutto lost a familiar top-level Indian interlocutor when Rajiv Gandhi was assassinated in 1991. Washington, D.C., April 22, 2025– Declassified U.S. intelligence reports from the 1980s and 90s show that, even while the possibility of war between India and Pakistan remained low, the U.S. believed there was a strong possibility that such a conflict could lead to the use of nuclear weapons. A 1989 State Department intelligence report published today for the first time, for example, found that, although a war between the two countries was unlikely, the risk was “high” that, through a “miscalculation or irrational response,” a “conventional war … might turn into a nuclear exchange.” By 1993, the U.S. intelligence community had grown more concerned about the possibility of a conflict in South Asia, assessing it at “about 1 in 5,” according to a 1993 National Intelligence Estimate (NIE) titled “India-Pakistan: Prospects for War in the 1990s” also published today for the first time by the National Security Archive. The CIA released much of the NIE’s contents in response to the Archive’s mandatory declassification review appeal. The 1993 NIE found that elements of the tense India-Pakistan relationship that increased risks of conflict were their nuclear rivalries, competing claims for Kashmir, and mutual suspicions of internal interference. Moreover, the coming to power of “extremist” parties in either India or Pakistan could raise the risk of conflict. By the early 1990s, right-wing Hindu political movements were on the rise in India and were associated with increasing communal violence. The possibility of an India-Pakistan conflict was also central to a declassified 1981 Special National Intelligence Estimate (SNIE) that is also published here today: “India’s Reaction to Nuclear Developments in Pakistan.” With Pakistan moving forward in its efforts to produce fissile material for nuclear weapons, U.S. intelligence evaluated the possibility of an Indian attack on Pakistan’s nuclear facilities should developments in that country threaten India’s security. According to the SNIE, India would probably take a “wait and see” approach before striking in Pakistan and make a decision “based on whether Pakistan produced nuclear weapons or stockpiled them.” Accompanying the SNIE is a chilling State Department memo, also published for the first time, on the expected radiological consequences of an Indian attack on the Karachi Nuclear Power Plant (KANUPP). The briefing by Lawrence Livermore Laboratory scientists emphasized the threat of dispersed iodine 131, which was one of the primary radiation dangers associated with the Chernobyl disaster five years later. Under the “extreme conditions” assumed by the scientists who developed the study, “Karachi residents would probably receive a 10 to 20 REM inhalation dose [of iodine 131] as far as 25 km down wind,” an amount “20 times as great as the serious escape of iodine during an accident at a UK reactor at Windscale in the 1960s.” Populous Karachi “could suffer heavy casualties” under such a scenario, according to the Livermore briefing. The 1989 report by the State Department’s Bureau of Intelligence and Research (INR) titled “India-Pakistan Relations: A Delicate Balance” provides perspective on the India-Pakistan rivalry. INR analysts found war to be “the most improbable of contingencies” because leaders on both sides wanted to avoid open conflict. Yet, “hostilities might break out by accident, or an even more unlikely possibility—be triggered by New Delhi’s efforts to take out all of Pakistan’s nuclear weapons facilities in coordinated surgical strikes.” Creating potential for conflict were “suspicions and prejudices” on both sides and “points of friction,” such as rival claims for Kashmir and the “mutual charges of interference”—namely, that each was providing arms and assistance to “separatist extremists” in the other country. There was “risk” that conventional conflict could escalate into a “nuclear exchange,” the INR report found. By the time U.S. intelligence officials had begun to prepare the 1993 NIE, U.S. intelligence officials saw the possibility of India-Pakistan war as greater than “improbable.” Like INR, the intelligence analysts found that the leaders of both countries wanted to avoid war, but that “flashpoints” such as Kashmir, “internal meddling,” terrorist incidents, and “communal incidents” could ignite crises and confrontations, possibly leading to the use of nuclear weapons. Also increasing the risk of conflict was the possibility that extremist parties could come to power, the Bhartiya Janata Party (BJP) (Indian People’s Party) in India and radical Islamists in Pakistan. Yet even if war “was not on the horizon,” the chance of war could increase through “miscalculations,” including intelligence failures that could trigger a “premature attack.” The analysts envisioned circumstances that could cause an “escalating confrontation,” including “protracted surges of violence in Kashmir,” a “large scale military exercise in border areas,” or a “spectacular terrorist outrage” that one side could attribute to the other. The greatest miscalculation of all could involve “the breakdown of nuclear deterrence during a crisis,” especially if military leaders on either side developed “hair-trigger responses that ensure crisis escalation.” Since the 1990s, India-Pakistan relations have remained tense. Alert to therisksof conflict between two nuclear armed states, social and natural scientists have studied the possible consequences of a nuclear war between India and Pakistan. According to one scenario described in a 2019 study prepared by climate scientists and nuclear experts, 50 million people could be killed, and the consequences for the global climate could be devastating: the detonations could have effects that would lower temperatures and damage food production. One of the major conclusions of the study was that “any of the India-Pakistan nuclear cases we posit clearly would cause large reductions in agriculture and food shortages” that could lead to “famine for millions or billions of people.” **Perspectives** The rivalry and tensions discussed in the intelligence estimates and analyses has been a theme in India-Pakistan relations since the 1970s. When Pakistan lost the 1971 war with India, it redoubled President Zulfikar Ali Bhutto’s interest in a nuclear weapons program even if it meant that his country would have to “eat grass” to pay for it. In May 1974, India’s longstanding investment in dual-use nuclear capabilities yielded a “Peaceful Nuclear Explosion,” which in turn motivated Bhutto further to develop nuclear capabilities that he insisted were for “peaceful” purposes. By the late 1970s, Pakistan was acquiring agas centrifugecomplex for producing highly enriched uranium. India had not taken steps to weaponize its nuclear capabilities but it was developing advanced delivery systems.[1] During 1979 and 1980, U.S. intelligence was learning more about Pakistan’s secret program to produce fissile material for nuclear weapons, in part by using purloined gas centrifuge technology. That development amplified concern in Washington about nuclear proliferation and the implications for stability in South Asia. India was monitoring the Pakistan nuclear situation even more closely because of the potential threat it posed during the years ahead. By 1981, with Pakistani nuclear capabilities moving ahead, U.S. government officials wondered whether those developments would motivate preventive action by India and a new crisis. With Indian leaders opposed to producing nuclear weapons, they may have seen the prospect of a nuclear-armed Pakistan as an intolerable threat, making preventive action worth thinking about. Such concerns led to the commissioning of a national intelligence estimate assessing possible Indian moves, resulting in Special National Intelligence Estimate (SNIE) 31/31-81, “India’s Reaction to Nuclear Developments in Pakistan.” In the fall of 1981, Lawrence Livermore’s Special Projects Division analyzed the radiological damage and casualties that could result from an Indian strike against Pakistan’s nuclear reactor near Karachi. (Document 2) Their analysis foreshadowed the radiation dangers caused by the dispersal of iodine 131 that occurred from the 1986Chernobyldisaster and the likely damage that would occur today if Ukraine’s Zaporizhzhia nuclear power plant experienced severe damage. The scenario of radiation casualties made some Indian strategists see a preventive attack as highly dangerous because a Pakistani counterattack on India’s nuclear installations could cause similar harm. (Document 3) During the years that followed, the possibility of Indian preventive action remained a concern to the Reagan administration because Pakistan was continuing its nuclear weapons program. Washington wanted to avoid a crisis with Islamabad over nuclear issues because of Pakistan’s covert assistance in Afghanistan, yet, by 1986, the administration had lodged 25 demarches to General Zia. To encourage India-Pakistan détente, the U.S. wanted to encourage both countries to adopt “military confidence building measures” [CBMs] that could help them avoid or at least mitigate future crises. In part to encourage movement on that end and India-Pakistan détente more broadly, Secretary of Defense CasparWeinbergertraveled to the region in the fall of 1986. A few years later, a lengthy State Department intelligence report from the summer of 1989 provided perspective on the India-Pakistan rivalry. INR analysts found war to be “the most improbable of contingencies,” with leaders on both sides wanting to avoid open conflict. But leaders could do little to improve the hostile relationship between their countries because “suspicions and prejudices … form the bedrock of each country’s world view and security policy.” Adding to potential for conflict were “points of friction,” such as rival claims for Kashmir and the “mutual charges of interference” that each country is providing arms and assistance to “separatist extremists” in the other, for example, alleged Pakistani support for Sikhs. Yet “hostilities might break out by accident, or, an even more unlikely possibility, be triggered by New Delhi’s efforts to take out all of Pakistan’s nuclear weapons facilities in coordinated surgical strikes.” Four years later, the intelligence community prepared a national intelligence estimate on “India-Pakistan: Prospects for War in the 1990s.” Far from seeing war as unlikely, the analysts reckoned a one in five chance of conflict. Like INR analysts in 1989, the authors of the NIE saw “flashpoints” that could precipitate open conflict, such as the Kashmir problem, “communal violence,” and support for separatist extremists. Moreover, the rise of a rightwing Hindu party in India, the Bhartiya Janata Party (BJP) (Indian People’s Party) had changed calculations about the risk of war. If the BJP came to power, or if radical Islamists formed a government in Pakistan, the prospects for conflict could increase. What exactly triggered the preparation of the 1993 NIE remains unknown, but the context for it is clear enough: both countries had made strides in their nuclear programs, with Pakistan probably further than India; both sides were supporting militants and separatists in border areas such as Kashmir; anti-Muslim violence in India had led to thousands of deaths; and crises in 1987 and 1990 had generated fear of nuclear conflict. In the United States, a new president, William J. Clinton, was strongly interested in India, in part because he saw it as an emerging world power and a multi-ethnic democracy like the United States. That interest may have prompted him to request the views of the intelligence community on what contingencies, including the possibility of South Asian conflict, might lay on the horizon. The NIE’s estimate of low odds for war during the 1990s proved correct. Yet Clinton’s second secretary of defense, William Perry, saw war as a “real possibility” and tried to promote moderation by encouraging Indian and Pakistani military leaders to hold talks. By the end of the decade, India and Pakistan came close to war. In early 1998, the BJP came to power and on 11 May 1998 tested three nuclear weapons. Pakistan followed suit, which settled any doubts about the nuclear status of both countries, making any potential conflict even more dangerous. In May 1999, Pakistani military forces moved past the Line of Control (LoC) in Kashmir and seized positions in the Kargil area that Indian forces had vacated during the winter. Expecting a weak response from India or even negotiations over the seized territories, Pakistani military leaders did not predict the Indian counteroffensive that occurred in June. While worried about the possibility of escalation, the Clinton administration sided with India and demanded that Pakistan pull back its forces completely and without any conditions. On 4 July 1999, at the height of the crisis, Pakistani Prime Minister Nawaz Sharif met with Clinton at the White House, who demanded that he announce a withdrawal of Pakistani forces to behind the LoC; otherwise, the United States would blame Pakistan not only for starting a war but also for assisting Osama bin Laden. Having received intelligence that Pakistan might be readying nuclear forces, Clinton emphasized the grave risks of the situation. According to Bruce Riedel, who took notes on the conversation, “Sharif very reluctantly agreed to withdraw.”[2] In the months that followed, during 1999-2000, the intelligence establishment prepared a new NIE on the risks of conflict in South Asia. In his account of the period, Riedel wrote that the NIE found that the chances of India-Pakistan war in the next few years had risen to 50-50.[3] **The Documents** Document 1 MDR release to National Security Archive During 1979 and 1980, U.S. intelligence was learning more about Pakistan’s secret program to produce fissile material for nuclear weapons, in part by using purloined gas centrifuge technology. That development amplified concern in Washington about nuclear proliferation and the implications for stability in South Asia. Necessarily India was monitoring the Pakistan nuclear situation even more closely because the potential threat it posed during the years ahead. By 1981, with Pakistani nuclear capabilities moving ahead, U.S. government officials wondered whether Pakistan’s nuclear activities would motivate preventive action by India. Evidently, that concern led to the commissioning of a national intelligence estimate assessing possible Indian reactions. The National Intelligence Council hadapproveda proposal for an intelligence estimate on the topic in the spring of 1981, although it had been under discussion for some months. By November 1981, the result was Special National Intelligence Estimate (SNIE) 31/31-81, “India’s Reaction to Nuclear Developments in Pakistan.” The version of the SNIE published here was the result of a mandatory declassification review request by the National Security Archive. When the document appeared on the CIA’s FOIA website around 2015, it received much attention in the Indian mass media under dramatic headlines, for example, “Indira Gandhi planned attack on Pakistan’s nuclear facilities,” (India Today,1 September 2015). In fact, no such claim appears in the estimate (although Document 3, below, indicates the preparation of contingency plans). The SNIE’s exposition consisted largely of “ifs” and possibilities, although it drew on some factual reporting on internal discussions in Indira Ghandi’s government. India had staged a “peaceful nuclear explosion” in 1974 but it had not made decisions to produce nuclear weapons, much less stockpile them. Thus, a Pakistan armed with nuclear weapons could pose a significant security threat. The estimate pointed to recent detailed internal recommendations circulating within the government for “exercising the nuclear weapons option,” but analysts added that “we do not know whether the Prime Minister favors that course.” With all the uncertainties, the estimate found that India would probably take a “wait and see” approach “based on whether Pakistan produced nuclear weapons or stockpiled them, which would then lead New Delhi to face a choice of accepting the high probability of a nuclear arms race or destroying Pakistan’s nuclear facilities.” If the Indian government was determined to uphold its non-weapons status, it would have to decide whether the threat of a nuclear-armed Pakistan was severe enough to make it necessary to destroy that country’s nuclear facilities. Yet, such action could risk Chinese intervention on behalf of Pakistan. Thus, a “final Indian decision is likely to depend critically on political and strategic circumstances prevailing at that time.” The report closes with an annex on how Indian leaders might think about the development of a small nuclear arsenal, both the pros and the cons. On the positive side was to need to improve the military balance with China and to encourage the “superpowers to accord India greater respect.” On the negative side was that India did not yet have “unsafeguarded” stocks of plutonium, and the fact that a weapons stockpile would add to military expenditures, especially when considering the costs of delivery systems and “hidden costs,” such as for early warning systems. Document 2 National Archives, Department of State Records, Record Group 59, Files of Lucy Benson, Deputy Secretary of State for Security Assistance, Science, and Technology, 1980-1981, box 9, Pakistan (N.P. 1981) Readers of SNIE 31/31-81 of 8 September 1981 (See Document 1) may have wondered, if India did attack one of Pakistan’s nuclear facilities, what would be the effects? That led to the commissioning by the Energy Department and the State Department’s Political-Military Affairs Division of a study on the radiological effects of an attack on the Karachi Nuclear Power Plan (KANUPP). Lawrence Livermore Laboratory’s Special Projects Division (later known as the “Z” Division), which specialized in nuclear proliferation topics, conducted the study, and Alden F. “Jerry”Mullinswas its project leader and gave a briefing to State Department officials. According to Mullins, the “most lethal consequences would occur only if the fuel in KANUPP’s core melted down,” the “worst-case scenario,” where a 2,000-pound bomb blew a “one square meter hole in the thick concrete and steel containment shell,” with one-sixth of the total iodine inventory of 800,000 curies of I-131 escaping through the hole. “Under these extreme conditions, Karachi residents would probably receive a 10 to 20REM[Roentgen Equivalent Man] inhalation dose as far as 25 km down wind,” which would be “20 times as great as the serious escape of iodine during an accident at a UK reactor atWindscalein the 1960s.” Under the worst-case circumstances, Karachi “could suffer heavy casualties”: “The worst result of iodine inhalation is latent thyroid cancer, which may take 15 to 30 years to develop.” With about ten percent of thyroid cancers being fatal, Mullins saw a “70% probability that there will be 10 additional latent thyroid cancers in Karachi as a result of the attack; a 60% chance there will be 100 cancers; a 50% chance there will be 200; a 30% chance there will be 1,000; and a 10% chance there will be 20,000.” The impact of iodine releases was predictable, but Mullin saw other potentially grave consequences: the release of other radioisotopes, “prompt radiation” effects (such as gamma radiation), and the impact of blast and heat in the immediate vicinity. The study noted that, if an attack did occur, Pakistan could put before the world its “worst-case projections” of total casualties. “The final figure could be a huge one,” with significant “political and propaganda impact.” For its part, India could develop damage estimates that “would probably be higher than Livermore,” which could “dissuade the Indians from hitting KANUPP and, along with other factors, might encourage them to go after softer targets.” Not mentioned was the recent Israeli attack on Iraq’s nuclear reactor, which produced widespread condemnation and could have influenced the thinking of India’s leaders to the extent that they were considering a preventive attack of this sort. International law may have also had an impact on Indian policymakers. Article 56 of the 1949 Geneva Convention’s AdditionalProtocol I(1977) proscribed attacks on installations such as “dykes, dams, and nuclear electrical generating stations” that contain “dangerous forces,” which could put “civilians at risk from the release of radioactive material.” India (as well as Pakistan) was not a signatory to the Protocol, but the restriction nevertheless stood.[4]Another complication was that the KANUPP reactor was under IAEA safeguards, and an attack would have incensed the Agency by casting doubt on the efficacy of its work. Document 3 CIA FOIA collection, under declassification review through MDR request Six years later, no preventive Indian attack on Pakistani nuclear facilities had occurred. Yet, the Reagan administration saw a continuedriskand the possibility that such a strike could ignite a war. According to this CIA report on decision-making on the Indian nuclear program, intelligence analysts believed that India had contingency plans for such an attack, which some Indian strategists saw as highly dangerous because the “inevitable Pakistani retaliatory attack on Indian nuclear facilities would spread radioactive contamination over large portions of India.” Other U.S. intelligence analysts argued that India’s drive for “regional hegemony” could prompt preventive attacks on Pakistani facilities, such as the Kahuta enrichment plant, whose destruction would minimize radiological dangers. Other U.S. intelligence analysts then saw the probability of Indian action as “low,” not only because of “traditional indecisiveness and caution” but also because Prime Minister Rajiv Gandhi had said “publicly that such a move would not ensure the eradication of fissile material and components.” Moreover, a preventive Indian strike would “almost certainly begin a war between India and Pakistan.” In December 1985, Gandhi and Pakistan’s dictator General Muhammad Zia-ul-Haq met in India, where they reached anunderstandingnot to attack each other’s nuclear facilities. According to this CIA report, “We speculate that [the agreement] may have been prompted, at least in part, by US importunings in late 1985 that the nuclear issue be resolved between India and Pakistan,” although other intelligence experts believed that it was something that Gandhi had been seeking on his own, even though it was “congruent with U.S. interests.” Whatever the sources of the Gandhi-Zia understanding were, it remained informal until December 1988.[5]By then, India and Pakistan had gone through the 1987 Brass Tacks crisis, instigated by Indian military exercises, which had raised fears of war and renewed concern among Pakistani leaders about the possibility of an Indian attack on their nuclear facilities. For his part, Gandhi wanted to find ways to reduce nuclear risks. Those interests and concerns provided context for the signing of the December 1988 Non-Attack Agreement when Gandhi traveled to Pakistan for meetings with Prime Minister Benazir Bhutto.[6] Document 4 MDR request to Department of State This 1989 report by State Department intelligence treated an Indian preventive attack on Pakistan’s nuclear complex as “increasingly unlikely,” not least because the “optimum time” for such action had passed. INR analysts downplayed the possibility of military action or war in general because “neither India nor Pakistan want to fight a fourth war.” With the military balance decisively in India’s favor, Pakistan “would have little chance of winning” and India would “suffer considerable costs” and have “to decide how to deal with a defeated Pakistan.” The leaders of both countries, Prime Minister Benazir Bhutto of Pakistan and Prime Minister Rajiv Gandhi of India, had met several times and developed a “personal rapport,” but they could do little to improve the hostile relationship between their countries. Both were in weak positions politically in countries where “suspicions and prejudices … form the bedrock of each country’s world view and security policy.” Adding to the potential for hostilities were “points of friction,” such as rival claims for Kashmir, including the Siachen Glacier, “the highest and bleakest battlefield in the world.” Also adding to friction were “mutual charges of interference”: that each country was providing arms and assistance to “separatist extremists” in the other, for example, alleged Pakistani support for Sikhs. INR analysts saw some areas of improvement, such as the confidence building agreements, notably the 1988 Nuclear Nonattack Pledge. Although Gandhi’s critics saw this as and other steps that he had supported as an example of his “being ‘soft’ on Pakistan,” INR’s analysts suggested that it could “improve regional security somewhat by strengthening, legitimizing, and publicizing the commitment of the political leaders on each side not to resort to preemptive strikes as a means of dealing with their neighbor’s nuclear program.” Yet, it “could encourage further procrastination in confronting” the dangers of the nuclear problem. A detailed account of the military situation between the two countries demonstrated India’s superiority in terms of troops, equipment, and supplies, with the buildup expected to continue. The “capabilities gap” made Pakistan’s situation even worse. Acknowledging that India faced a “potential threat from China,” INR experts noted that “Indian forces are still primarily oriented toward Pakistan.” In that context, Pakistan treated its “covert nuclear program as the ultimate defense against India.” Along with Kashmir and the claims about internal interference, the nuclear programs of each country were the “most serious” bilateral problem. Neither country had produced nuclear weapons, but the only “restraints” to doing so were “political not technical.” For example, Pakistan could test a device “within a few weeks of a decision to proceed.” Having not made decisions to produce nuclear weapons, India “now faces the prospect of a nuclear-armed Pakistan without having its own nuclear deterrent in place.” If “mounting evidence [demonstrated] that Pakistan has crossed or is about to cross the nuclear weapons threshold,” such as testing a device, Indian leaders would have to make decisions to produce their own nuclear weapons. As “unlikely” as the prospect of India-Pakistan conflict was, there was a “high” risk that through a “miscalculation or irrational response,” a “conventional war … might tum into a nuclear exchange.” Such an outcome could draw the superpowers into the situation. INR even included an Annex with detailed scenarios for three situations, 1) Indian preventive action against Pakistan’s nuclear complex, 2) India initiating a conventional attack, or 3) Pakistan initiates a conventional attack. In all three scenarios, Pakistan “sues for peace” only a few weeks after war breaks out. In 1990, months after INR prepared this estimate, a major crisis broke out. Triggered by military exercises and instability in Kashmir, the region was on edge with growing fear of a nuclear confrontation. U.S. diplomats, with Deputy National Security Adviser Robert Gates undertaking a special mission, worked to help defuse tensions. U.S. influence was probably not decisive but it may have helped.[7] The late MaryShoemaker, a Foreign Service Officer with rich experience in South Asian issues overseas and at the State Department, prepared this report when she worked at INR’s South Asia desk. In 1962 when she became married, Departmental regulations forbade her from taking an overseas assignment, and she resigned from the Foreign Service. When the State Department lost an anti-discrimination lawsuit, she restarted her Foreign Service career. Future member of CongressRush Holtalso contributed to the report. Document 5 MDR request to CIA, released under appeal, final appeal pending at ISCAP Four years after INR prepared its report, the U.S. intelligence community conducted a major estimate of the India-Pakistan situation and prospects for conflict which considered developments since 1989. Against the backdrop of the 1990 crisis, significant violence by Hindu nationalists against Muslims in late 1992 and early 1993, growing nuclear capabilities on both sides, and a new U.S. president, William J. Clinton, who was greatly interested in India, the U.S. intelligence community prepared a National Intelligence Estimate on “India-Pakistan: Prospects for War in the 1990s.” According to the title page, the NIE was “prepared under the auspices” of Bruce Riedel, National Intelligence Officer for Near East/South Asia. A former CIA intelligence analyst, Riedel worked on the NSC staff during the George H.W. Bush administration and the first months of the Clinton administration and during 1993 rejoined the CIA to become the NIO. After working on the NSC staff, Reidel rejoined the CIA. According to Reidel’s recollections, he worked on the NIE at the end of a process begun under his predecessor, Ellen Laipson.[8] Who requested this NIE, whether it was from the White House or the State Department or senior CIA officials, remains to be learned. The editor approached former CIA and State Department officials who were in government during the period, but they did not recall or would not discuss the matter or did not respond to queries. Despite the numerous excisions in this NIE, major points come through. Looking at the probability of war between India and Pakistan during the years ahead, the drafters of this NIE found that there were relatively low odds: 20 percent. Like INR, the intelligence analysts found that the leaders of both countries wanted to avoid war, but that points of tension – “flashpoints” – notably Kashmir, “internal meddling,” and “communal incidents” could ignite crises and confrontations possibly involving the use of nuclear weapons. Yet even if war “was not on the horizon,” like INR, the analysts believed that the chances of war could increase through “miscalculations,” including intelligence failures that could trigger a “premature attack.” The analysts envisioned circumstances that could cause an “escalating confrontation,” including “protracted surges of violence in Kashmir,” “large scale military exercise in border areas,” or a “spectacular terrorist outrage” that one side could attribute to the other. The greatest miscalculation of all could involve “the breakdown of nuclear deterrence during a crisis,” especially if military leaders on either side developed “hair-trigger responses that ensure crisis escalation.” The estimate included discussion of the possible contribution of Confidence Building Measures, such as the agreements not to attack nuclear facilities, and to provide advance notification of maneuvers, exercises, and troop movements, but did not take much stock in them because they “might prove irrelevant in a fast-moving crisis.” Moreover, verification for any of the agreements was “spotty.” Nevertheless, the U.S. had offered to help verify CBMs, and the analysts suggested that the hotline agreement could have the “best chance of success.” For the most part, the analysts did not see “external factors,” such as hostile powers on their borders that constituted a dangerous threat environment for either India or Pakistan. But they postulated circumstances that could raise the chances of war. One was a change in the military balance in India’s favor to the point where Islamabad could feel “even more threatened by India’s growing military edge,” which could have such destabilizing consequences as Pakistan’s “open” deployment of nuclear weapons. A change in the military balance in combination with the rise of an “extremist” government could raise the risk of war, although “extremists” holding state power in either country was “unlikely” during the 1990s. In Pakistan, it would take the form of an “Islamist” government and in India, an election that brought the Hindu-led right-wing Bhartiya Janata Party (BJP) [Indian People’s Party] to power. A “radical” BJP regime could “blunder into conflict with Pakistan” but also “polarize” Indian society by causing “more communal violence that would damage relations with Pakistan.” The NIE includes a photograph, with an excised caption, of the mob led by activists from the BJP and related groups that destroyed the Babri Masjid mosque inAyodhyaon December 6, 1992. An Islamist regime in Pakistan, triggered by an economic crisis “and/or a military dictator joining with militants,” could add to instability by “champion[ing] the cause of India’s Muslims” but also by “promot[ing] the liberation of Kashmir by openly arming and training anti-Indian militants.” The NIE also includes a discussion of the implications of the India-Pakistan competition for the United States, with both countries seeking U.S. aid to support their positions but also reduce the danger of “inadvertent war.” This section is heavily excised as are the discussions of nuclear proliferation and of the possibility of greater levels of U.S. efforts at “peacebuilding.” Also fully excised is “Annex A,” describing Indian and Pakistani nuclear capabilities. **Notes** [1]. Feroz Hassan Khan,Eating Grass: The Making of the Pakistani Bomb (Stanford: Stanford University Press, 2012); Jayita Sarkar,Ploughshares and Swords: India’s Nuclear Program in the Global Cold War(Ithaca: Cornell University Press, 2022) [2]. Bruce Riedel,Avoiding Armageddon: America, India, and Pakistan to the Brink and Back(Washington, D.C., Brookings Institution Press, 2013), 133-134. For a detailed account of the Kargil Crisis, see P.R. Chari, Pervaiz Iqbal Cheema, and Stephen Philip Cohen,Four Crises and a Peace Process: American Engagement in South Asia(Washington, D.C.: Brookings Institution Press, 2007), 118-148. [3]. Riedel,Avoiding Armageddon, 135. [4]. For discussion of the relevance of international law to attacks on nuclear facilities, see Ludovica Castelli and Olamide Samuel, “Justifying Attacks on Nuclear Facilities,”The Nonproliferation Review30 (2023): 83-105. [5]. For the Brass Tacks crisis, see Chari et al.,Four Crises, 39-79. See also Bruce Riedel,Avoiding Armageddon, 101-102. [6]. Rabia Akhtar and Ruhee Neog, “Through the Sands of Time: The Enduring Legacy of the India-Pakistan Non-Attack Agreement,” RUSI/Stanley Center for Peace and Security, “Analysis and New Insights, July 2024. [7]. For the 1990 crisis, see Chari et al.,Four Crises and a Peace Process80-117, and Riedel,Avoiding Armageddon), 110-111. [8]. Telephone interview with Bruce Riedel, 3 March 2025. **In the News** **Related links** The U.S., Canada, and the Indian Nuclear Program, 1968-1974Dec 9, 2022 Pakistan’s Nuclear Program Posed “Acute Dilemma” for U.S. PolicyAug 30, 2021 The U.S. and the Pakistani Bomb, 1984-1985: General Zia, President Reagan, and Seymour HershOct 14, 2015 Pakistan's Illegal Nuclear Procurement Exposed in 1987Nov 22, 2013 New Documents Spotlight Reagan-era Tensions over Pakistani Nuclear ProgramApr 27, 2012 The Nixon Administration and the Indian Nuclear Program, 1972-1974Dec 5, 2011 Non-Papers and Demarches: U.S. and British Combined to Delay Pakistani Nuclear Weapons Program in 1978-1981, Declassified Documents ShowJul 27, 2011 The United States and Pakistan's Quest for the BombDec 21, 2010 National Security ArchiveSuite 700, Gelman LibraryThe George Washington University2130 H Street, NWWashington, D.C., 20037 Phone: 202/994-7000Fax: 202/994-7005Contact by email ​ support our work - donate The National Security Archive is committed to digital accessibility. If you experience a barrier that affects your ability to access content on this page, let us know via ourContact form Contents of this website (c) The National Security Archive, 1985-2025For educational or noncommercial use, contact the Archive using the form above for permission"}