{"id": 1365, "name": "Canadian Jewish News", "domain": "thecjn.ca", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thecjn.ca/news/chanting-from-the-river-to-the-sea-prompts-calgary-police-to-charge-a-palestinian-activist-with-hate-related-crime/", "title": "Chanting From The River To The Sea Prompts Calgary Police To Charge A Palestinian Activist With Hate Related Crime", "content": "News Culture Opinion Podcasts Magazine About Contact Newsletter Submissions Sitemap Donor Agreement Privacy Policy Terms of Use & Payment Policy The voice of Jewish Canada since 1960. NewsCanadaAtlanticQuebecOntarioWestCampusInternationalObituaries CanadaAtlanticQuebecOntarioWest Atlantic Quebec Ontario West Campus International Obituaries CanadaAtlanticQuebecOntarioWest Atlantic Quebec Ontario West Atlantic Quebec Ontario West Campus International Obituaries Culture OpinionPerspectivesLetters Perspectives Letters Perspectives Letters PodcastsNorth StarNot in HeavenThe Jewish AngleMenschwarmers North Star Not in Heaven The Jewish Angle Menschwarmers North Star Not in Heaven The Jewish Angle Menschwarmers Magazine NewsCanadaAtlanticQuebecOntarioWestCampusInternationalObituaries CanadaAtlanticQuebecOntarioWest Atlantic Quebec Ontario West Campus International Obituaries CanadaAtlanticQuebecOntarioWest Atlantic Quebec Ontario West Atlantic Quebec Ontario West Campus International Obituaries Culture OpinionPerspectivesLetters Perspectives Letters Perspectives Letters PodcastsNorth StarNot in HeavenThe Jewish AngleMenschwarmers North Star Not in Heaven The Jewish Angle Menschwarmers North Star Not in Heaven The Jewish Angle Menschwarmers Magazine The voice of Jewish Canada since 1960. News Culture Opinion Podcasts Magazine About Contact Newsletter Submissions Sitemap Donor Agreement Privacy Policy Terms of Use & Payment Policy News,West **‘From the River to the Sea’ chant prompts Calgary police to charge a Palestinian activist with a hate-related crime** Ellin Bessner November 8, 2023 In what might be a precedent-setting case in Canada stemming from the current street protests over the Israel-Hamas war, Calgary police have charged a pro-Palestinian activist who was heard leading a crowd to chant “From the River to the Sea.” In a statementissued Nov. 7, Calgary police said they had charged a 32-year-old Calgary man with “causing a disturbance” following his arrest two days earlier after a pro-Palestinian rally outside Calgary’s city hall building. However, officers have also tacked on a hate-motivated component to the charge, after consulting with their force’s hate crimes coordinator. According to police, the incident happened Nov. 5 when a large group of about 1,000 protesters–both pro-Israel and pro-Palestinian–each held their weekly competing demonstrations on Macleod Trail S.E. Calgary police have regularly advised protest leaders what they can and cannot do or say at these recurring events, including some wording on signs or breaking hate speech laws or blocking roads. “Through amplification and a public address system, [the accused] acknowledged this conversation with police. He then proceeded to repeatedly use an anti-Semitic phrase while encouraging the crowd to follow along,” the police news release said. Calgary’s Wesam Cooley, also known as Wesam Khaled, is scheduled to appear in court again on Dec. 19. Cooley was released on bail and barred from attending any further protests. The use of the phrase “From the River to the Sea, Palestine will be free” has been interpreted of late by the Jewish community as advocating for the dismantling of the Jewish state, in order to create a homeland for Palestinians. The Jewish Federation of Calgary thanked the city police for taking swift action after the weekend protest against a person “who was publicly inciting hate”, according to a statement posted on the Jewish organization’s Facebook page on Nov. 7. “This arrest will hopefully set a precedent not only in Calgary but in other cities,” the group added. Calgary police have made multiple arrests in connection with local protests since Oct. 7, the start of the current Israel-Hamas war. They have detained people for a variety of reasons including breach of peace, uttering threats, assault and also assault with a weapon, following “incidents of violence”. However, it isn’t clear whether anyone was actually charged in connection with these other arrests. The Nov. 5 charge against Cooley is the first targeting someone for hate-motivated reasons against the Jewish community. [Ed note: On Nov 8, Calgary police also announced they’ve laid a new hate-motivated charge, against a 25-year old Calgary man, for making threatening online social media posts targeting the local Jewish community. Mohamad Ghandour faces three counts of uttering threats. He will next appear in court Dec. 6, 2023.] Supporters of Cooley, a well-known Palestinian activist, are calling for the charges to be dropped, deny any hate-crime was committed, and accuse Calgary police of bowing to pressure from those trying to silence legitimate protest and to demonize Palestinian voices. “We must underscore that his arrest occurred as an ambush rather than an arrest for an observable offence,” said the Calgary branch of the group Justice for Palestinians, ina media release. “To our knowledge, there are no legislation or bylaws criminalizing protest speech calling for justice and liberation of an oppressed population undergoing a genocide by a belligerent oppressor state.” The anti-Israel group Canadians for Peace and Justice in the Middle East (CJPME) also condemned the charge and called it “spurious”. “We are appalled at the shocking overreach of the Alberta government in carrying out this arrest, which is an example of anti-Palestinian racism,” said Thomas Woodley, president of CJPME, in a release. For their part, the Calgary police say they are only enforcing the law, not clamping down on activism from anyone. “We will continue to police behaviours, not beliefs,” the police department’s news release said. In Canada, a conviction for the crime of “disturbing the peace” carries a maximum penalty of up to 6 months in jail or a $5,000 fine, or both, and a criminal record. However, when prosecutors add the hate-motivated tag to a summary charge, it gives a judge wider leeway to impose higher penalties during sentencing, according to legal experts. It’s not the first time Cooley has come to public attention in Calgary for supporting the use of extreme language toward Jews in Israel. A decade ago, while he was the president of the University of Calgary’s campus club known as Solidarity for Palestinian Human Rights, he came to the defence of a previous club leader whose Facebook posts drew complaints from a local pro-Israel group. In 2014, Cooley told theNational Postat the time that the violent posts describing a “bloody” kaffiyeh of a Palestinian martyr were misinterpreted, because they had been written as “fiction” and “poetry.” Canadian police have now laid hate-motivated charges against 13 people related to the current Middle East situation: Calgary police charged a25-year-old manon Nov. 7 with three counts of uttering threats in connection with a series of online social media posts targeting the Jewish community in Calgary. Mohamad Ghandour will appear in court again on Dec. 6. Calgary police have charged a32-year-old manwith disturbing the peace, in connection with a Nov. 5 pro-Palestinian protest rally in the city. Wesam Cooley, also known as Wesam Khaled, was arrested on Sunday after the rally. He is set to be in court again Dec. 19. Ottawa policecharged a 29-year-old manon Saturday Nov. 4 after death threats and anti-Zionist slogans were directed at Rabbi Idan Scher, of Congregation Machzikei Hadas, during a telephone call on Friday Nov. 3. Police did not identify the suspect. Toronto policecharged a 32-year-old manon Monday Nov. 6 after an assault in connection with someone trying to put up posters of missing Israeli hostages along Yonge Street in North York. The accused, Omar Elkhodary, will appear back in court Jan. 9, 2024. Toronto police chargeda 36-year-old Toronto manwith assault with a weapon, after a pro-Palestinian protester wearing a keffiyeh on his arm was pepper-sprayed near a street demonstration on Sunday Nov. 5 in the city’s Yorkville area. Brandon Stier is set to be in court again Jan. 5, 2024. Toronto police charged a40-year-old womanwith assault, after being caught ripping down Israeli hostage posters by a bystander. The victim was slightly hurt, after the suspect allegedly asked her whether she was Jewish. Selina Mew-Siew Chan will be back in court on Dec. 19. Toronto policecharged three suspectsin connection with uttering death threats towards students at TanenbaumCHAT high school on Oct. 12. Enes Boydak, 20, and two teenagers who cannot be named because they are under age, each face four charges. Ottawa policecharged three suspectswith mischief after antisemitic and other offensive graffiti was spray painted on a downtown garage on Oct. 29. Police were not naming the trio as two are under age. Kingston police charged an18-year-old driverwith dangerous operation of a vehicle after a truck nearly hit a crowd of pro-Israel demonstrators during a rally on Oct. 17. The suspect, a Kingston man, was not named. Police were looking for any victims who might have been injured when the truck accelerated into the crowd. **Author** Ellin BessnerEllin is a journalist and author who has worked for CTV News, CBC News, The Canadian Press and JazzFM. She authored the bookDouble Threat: Canadian Jews, the Military and WWII(2019) and contributed toNorthern Lights: A Canadian Jewish History(2020). Currently a resident of Richmond Hill, Ont., she is a fan of Outlander, gardening, birdwatching and the Toronto Maple Leafs. Contact her at[email protected].View all posts Ellin is a journalist and author who has worked for CTV News, CBC News, The Canadian Press and JazzFM. She authored the bookDouble Threat: Canadian Jews, the Military and WWII(2019) and contributed toNorthern Lights: A Canadian Jewish History(2020). Currently a resident of Richmond Hill, Ont., she is a fan of Outlander, gardening, birdwatching and the Toronto Maple Leafs. Contact her at[email protected]. Ellin is a journalist and author who has worked for CTV News, CBC News, The Canadian Press and JazzFM. She authored the bookDouble Threat: Canadian Jews, the Military and WWII(2019) and contributed toNorthern Lights: A Canadian Jewish History(2020). Currently a resident of Richmond Hill, Ont., she is a fan of Outlander, gardening, birdwatching and the Toronto Maple Leafs. Contact her at[email protected]. Tags:Calgary,hate crimes **Support Our Mission: Make a Difference!** The Canadian Jewish News is now a Registered Journalism Organization (RJO) as defined by the Canada Revenue Agency.To help support the valuable work we’re doing, we’re asking forindividual monthly donations of at least $10. In exchange, you’ll receive tax receipts, a thank-you gift of our quarterly magazine delivered to your door, and our gratitude for helping continue our mission. If you have any questions about the donating process, please write to[email protected]. **Related Stories** **Trending** **National Holocaust Monument in Ottawa vandalized overnight; police hate crime unit investigating** **Ottawa school trustee Nili Kaplan-Myrth resigns over ‘profound dysfunction’ in tackling antisemitism** **Bodies of Canadian hostage Judi Weinstein and her husband Gadi recovered from Gaza** **Multiple people injured in Boulder, Colorado, attack on demonstration for Israeli hostages** **Israel upgrades its security warning on travel to Canada, cautions Jews to remain vigilant** **Jewish conversions are still rising in Canada. Why? The answer might surprise you** **How to speak to your kids about antisemitism, Gaza and the Washington murders** **With ‘The Rehearsal’, Nathan Fielder cements his legacy as uniquely 21st-century observational comic** News Culture Opinion Podcasts Magazine About Contact Newsletter Submissions About Contact Newsletter Submissions Sitemap Donor Agreement Privacy Policy Terms of Use & Payment Policy Sitemap Donor Agreement Privacy Policy Terms of Use & Payment Policy Copyright 2025 The Canadian Jewish News. All rights reserved. **Support the Media that Speaks to You** Jewish Canadians deserve more than social media rumours, adversarial action alerts, and reporting with biases that are often undisclosed. The Canadian Jewish News proudly offers independent national coverage on issues that matter, sparking conversations that bridge generations. It’s an outlet you can count on—but we’re also counting on you. Please support Jewish journalism that’s creative, innovative, and dedicated to breaking new ground to serve your community, while building on media traditions of the past 65 years. As a Registered Journalism Organization, contributions of any size are eligible for a charitable tax receipt."}