{"id": 1209, "name": "San Antonio Report", "domain": "sanantonioreport.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://sanantonioreport.org/listen-how-salsas-volunteer-lawyers-seek-justice-for-san-antonio-residents-in-need-bigcitysmalltown/", "title": "Listen How Salsas Volunteer Lawyers Seek Justice For San Antonio Residents In Need Bigcitysmalltown", "content": "Newsletters Donate Government Business Education Environment Health Arts Tech Social Issues Live Like a Local AboutOpen dropdown menuOur StaffBoard of DirectorsEthics PolicyPolicies and Forms Our Staff Board of Directors Ethics Policy Policies and Forms Our Staff Board of Directors Ethics Policy Policies and Forms Submissions MembershipOpen dropdown menuIndividual MembershipOpen dropdown menuMeet Our Individual MembersBusiness MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Individual MembershipOpen dropdown menuMeet Our Individual Members Meet Our Individual Members Business MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Individual MembershipOpen dropdown menuMeet Our Individual Members Meet Our Individual Members Meet Our Individual Members Business MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Events Advertise Work With Us SeriesLive Like a LocalMap:The TrailistseriesWhere I LiveWhere I WorkGet Outta Town Live Like a Local Map:The Trailistseries Where I Live Where I Work Get Outta Town Live Like a Local Map:The Trailistseries Where I Live Where I Work Get Outta Town Civics GuidesLocal Gov 101Elections 2025Gobierno Local 101 Local Gov 101Elections 2025 Elections 2025 Gobierno Local 101 Local Gov 101Elections 2025 Elections 2025 Elections 2025 Gobierno Local 101 MoreCommentarySponsoredIn Memoriam Commentary Sponsored In Memoriam Commentary Sponsored In Memoriam SeriesLive Like a LocalMap:The TrailistseriesWhere I LiveWhere I WorkGet Outta Town Live Like a Local Map:The Trailistseries Where I Live Where I Work Get Outta Town Live Like a Local Map:The Trailistseries Where I Live Where I Work Get Outta Town Civics GuidesLocal Gov 101Elections 2025Gobierno Local 101 Local Gov 101Elections 2025 Elections 2025 Gobierno Local 101 Local Gov 101Elections 2025 Elections 2025 Elections 2025 Gobierno Local 101 MoreCommentarySponsoredIn Memoriam Commentary Sponsored In Memoriam Commentary Sponsored In Memoriam AboutOpen dropdown menuOur StaffBoard of DirectorsEthics PolicyPolicies and Forms Our Staff Board of Directors Ethics Policy Policies and Forms Our Staff Board of Directors Ethics Policy Policies and Forms Submissions MembershipOpen dropdown menuIndividual MembershipOpen dropdown menuMeet Our Individual MembersBusiness MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Individual MembershipOpen dropdown menuMeet Our Individual Members Meet Our Individual Members Business MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Individual MembershipOpen dropdown menuMeet Our Individual Members Meet Our Individual Members Meet Our Individual Members Business MembershipOpen dropdown menuMeet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Meet Our Business Members & Supporting Foundations Events Advertise Work With Us San Antonio Report Nonprofit journalism for an informed community Newsletters Donate Government Business Education Environment Health Arts Tech Social Issues Live Like a Local **Listen: How SALSA’s volunteer lawyers seek justice for San Antonio residents in need** **Share this:** Click to email a link to a friend (Opens in new window)Email Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit The attorney volunteers who serve with San Antonio Legal Services Association (SALSA) have impacted the local community by guiding low-income or at-risk clients through a pandemic, potential eviction and family estate issues, according to outgoing CEO Sarah Dingivan and SALSA board member Gregory Zlotnick. On the newest episode of thebigcitysmalltownpodcast, host Robert Rivard talks withDingivan, who recently departed the nonprofit after eight years, and Zlotnick, a faculty member at St. Mary’s University School of Law. **Never miss San Antonio Report's biggest stories.** Sign up forThe Recap, a newsletter rundown of the most important news, delivered every Monday and Thursday. Δ Dingivan recalled the association’s origins, which date back more than 20 years ago when then-Judge Karen Pozza and Justice Phylis Speedlin saw a need to offer pro bono services to individuals of limited means or people who find themselves vulnerable due to overwhelming circumstances. According to a 2022 study commissioned by the Legal Services Corporation, 92% of civil legal issues experienced by low-income Americans receive little to any adequate help from a legal professional. A group called the Community Justice Program, a forerunner of SALSA, initially had ties to the San Antonio Bar Association, whose members voted in 2019 to formally make SALSA independent. Dingivan said she and her colleagues were preparing a kickoff event for March 2020 to officially recognize SALSA as an independent organization. That is when, as she put it, “the world changed” with the emergence of COVID-19 and the resulting public health emergency. The volunteer attorneys and their support staff pivoted because of business closures, layoffs, evictions, foreclosures, and other personal emergencies that many residents faced at the height of the pandemic. “We immediately began building projects and programs that were responsive to the unique legal needs that were cropping up during the pandemic,” Dingivan said. Initiatives that SALSA launched during the pandemic remain, including a small estate help desk, which provides free legal aid for low-income individuals at the Bexar County Courthouse every other Thursday afternoon. Dingivan said a volunteer lawyer can help a client, who is distraught over their personal loss, and who might be uneducated about how the legal system may address their estate questions. “Obviously, the people who are encountering (the probate court) are in the middle of a grieving process, and are entering it at a disadvantage, and the ability to navigate the complexity of that process without a lawyer is really hard,” she added. Dingivan said the COVID-19 outbreak prompted SALSA’s volunteers and staff to innovate on how to serve their clients during the pandemic, especially those who have little to no internet access, and clients who were unable to reach government offices to personally discuss matters regarding their benefits. “We were balancing a need to change the way we were delivering services with a need to make sure we were not affirmatively blocking people from access because of technological and language barriers that exist when you’re creating remote opportunities for engagement,” she said. Zlotnick said the pandemic exacerbated many residents’ efforts to acquire or maintainaffordable, stable housing, but those struggles have lessened thanks in part to the city’s Strategic Housing Implementation Plan (SHIP) and voters’ passage of the city’s 2022 affordable housing bond. Zlotnick said he hopes the city will continue efforts toward expanding affordable housing under a new mayor and City Council. He added that SALSA continues to aid renters and homeowners who may face eviction or foreclosure. “It really benefits all San Antonians to make those long-term investments,” he added. Dingivan said, in order to make SALSA even more effective, the nonprofit can increasecommunity partnerships, such as the one it has with Morgan’s Multi-Assistance Center, a community center that serves individuals with various disabilities and special needs.“(Morgan’s MAC members) have specific civic legal needs,” Dingivan said, adding that its members often have questions about guardianship or accessing benefits. Dingivan also hopes SALSA will grow the number of volunteer attorneys, which numbers between 300-500 yearly. Zlotnick said, while teaching law at St. Mary’s University, he reminds law students of the positives of volunteering to help individuals who are enduring socioeconomic struggles. “It really is an opportunity to engage on some of those expressions and address thosesymptoms, and try to alleviate not just the momentary stresses that clients present themselves with at (Morgan’s) MAC or at eviction court,” Zlotnick said. Dingivan said many SALSA volunteer attorneys, at first, never expect to make a positivedifference in the life of a client in need of free legal civil assistance. “The feedback we get is that, ‘I had no idea my skills could impact somebody this way.’ That’s really the call to action for our lawyers in town,” she added. **Before you go...** We have a small favor to ask. Our work is powered by readers like you. You're an essential part of keeping San Antonians informed and empowered, and we need your help to make an even bigger impact in our community. If you value independent local news, will you support our newsroom by becoming a San Antonio Report member? **Edmond Ortiz** Edmond Ortiz, a lifelong San Antonian, is a freelance reporter/editor who has worked with the San Antonio Express-News and Prime Time Newspapers.More by Edmond Ortiz The San Antonio Report is a member-supported, nonprofit news organization. **Newsletter Signup** This field is hidden when viewing the formNameFirstLast Email* Privacy Policy Terms of Service Permissions and Copyright"}