{"id": 235, "name": "Wilkes-Barre Citizens' Voice", "domain": "citizensvoice.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.citizensvoice.com/2025/06/09/election-board-certifies-primary-results-doesnt-add-write-in-votes-for-freeland-council-candidate/", "title": "Election Board Certifies Primary Results Doesnt Add Write In Votes For Freeland Council Candidate", "content": "e-Edition e-Edition Submission Forms NewsNewsNation/WorldLocal weatherAmazing KidsElectionHealthFrom the ArchivesScholastic SuperstarsTrafficValley Santa News Nation/World Local weather Amazing Kids Election Health From the Archives Scholastic Superstars Traffic Valley Santa News Nation/World Local weather Amazing Kids Election Health From the Archives Scholastic Superstars Traffic Valley Santa OpinionOpinionEditorialsLetters To The Editor Opinion Editorials Letters To The Editor Opinion Editorials Letters To The Editor ObituariesObituariesPlace an Obituary Obituaries Place an Obituary Obituaries Place an Obituary Business SportsSportsAthlete of the WeekLittle LeaguePenn StatePenguinsRail RidersVarsity VoiceVarsity 570Wildlife Sports Athlete of the Week Little League Penn State Penguins Rail Riders Varsity Voice Varsity 570 Wildlife Sports Athlete of the Week Little League Penn State Penguins Rail Riders Varsity Voice Varsity 570 Wildlife Things to doThings to doContestsCommunityPeopleOut and About PhotosComicsPuzzlesSchoolsHot ShotCalendar Things to do Contests Community People Out and About Photos Comics Puzzles Schools Hot Shot Calendar Things to do Contests Community People Out and About Photos Comics Puzzles Schools Hot Shot Calendar Blogs and PodcastsEmpty BottlesHealth and Fitness ForumIn FocusIn MotionInSitesLiquidMommy MentionsPenn State InsiderPenn Stated PodcastPet WiseQuillsSoundsTrail MixVarsity VoiceTake 2 Movie Blog Empty Bottles Health and Fitness Forum In Focus In Motion InSites Liquid Mommy Mentions Penn State Insider Penn Stated Podcast Pet Wise Quills Sounds Trail Mix Varsity Voice Take 2 Movie Blog Empty Bottles Health and Fitness Forum In Focus In Motion InSites Liquid Mommy Mentions Penn State Insider Penn Stated Podcast Pet Wise Quills Sounds Trail Mix Varsity Voice Take 2 Movie Blog Pittston Progress About UsAbout UsAdvertiseSubmission FormsPlace an adBecome a CarrierDigital ArchivesStaff About Us Advertise Submission Forms Place an ad Become a Carrier Digital Archives Staff About Us Advertise Submission Forms Place an ad Become a Carrier Digital Archives Staff FacebookThe Citizens VoiceCV SportsPittston Progress The Citizens Voice CV Sports Pittston Progress The Citizens Voice CV Sports Pittston Progress ClassifiedClassifiedReal EstateCars and VehiclesJobsPublic Notices Classified Real Estate Cars and Vehicles Jobs Public Notices Classified Real Estate Cars and Vehicles Jobs Public Notices Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint e-Edition Special Sections Subscribe Login Logout Sign up for email newsletters to submit an obituary Please emailobits@citizensvoice.comor call 570-230-4917. Please include your name, mailing address, and phone number along with the copy and photo. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Login Sign up for email newsletters Subscribe Login e-Edition e-Edition News Obituaries Opinion Business Sports Things to do Newsletters Comics Submission Forms **Election board certifies primary results, doesn’t add write-in votes for Freeland Council candidate** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X WILKES-BARRE — The Luzerne County Board of Elections certified the May 20 primary election results on Monday and didn’t add write-in votes with various name spellings for Freeland Council candidate Matthew Krone. Krone asked the board to delay the vote to certify and add the various spellings of his name in the Democratic primary for Freeland Council. Election board Solicitor Gene Molino said the board couldn’t delay the certification vote and couldn’t add the various spelling under state law. Molino told Krone he had to file a court petition to add the various spellings. Krone was on the Republican ballot for Freeland Council and failed to win a nomination by finishing fourth. The top three candidates won Republican nominations. According to the election results posted on the county website, 5 write-in votes were for “Mathew Krone,” 6 were for “Matthew Krone,” and 5 were for “Matt Krone.” Krone said he needs 10 write-in votes to secure a Democratic nomination and appear on the November general election ballot. Only one Democrat was on the primary ballot for Freeland Council. Also at Monday’s meeting, Controller Walter Griffith asked the election bureau if they could post campaign finance reports on the bureau website in a more timely manner. Griffith and former boar member Audrey Serniak told the board they were impressed with the new process for adjudicating mail ballots with deficiencies and provisional ballots. The new process involves an election staff canvassing board that conducts ballot reviews to speed up the adjudication process, and the election board still voted to accept or reject ballots. A provisional ballot is issued at polling locations when there’s a problem verifying the status of a registered voter or if a voter was issued an absentee or mail ballot and the ballot and outer return envelope was not surrendered at the polling place to be spoiled. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** American Red Cross buys former Norm’s Pizza property for $1.1MAmerican Red Cross buys former Norm’s Pizza property for $1.1M **American Red Cross buys former Norm’s Pizza property for $1.1M** **American Red Cross buys former Norm’s Pizza property for $1.1M** ICE arrests 4 migrants working in ExeterICE arrests 4 migrants working in Exeter **ICE arrests 4 migrants working in Exeter** **ICE arrests 4 migrants working in Exeter** Luzerne County Sports Hall of Fame induction ceremonyLuzerne County Sports Hall of Fame induction ceremony **Luzerne County Sports Hall of Fame induction ceremony** **Luzerne County Sports Hall of Fame induction ceremony** Wyoming man charged with robbing teenWyoming man charged with robbing teen **Wyoming man charged with robbing teen** **Wyoming man charged with robbing teen** 3 teens charged in Facebook Marketplace robbery3 teens charged in Facebook Marketplace robbery **3 teens charged in Facebook Marketplace robbery** **3 teens charged in Facebook Marketplace robbery** Anti-DEI group targets Geisinger College of Health Sciences over programAnti-DEI group targets Geisinger College of Health Sciences over program **Anti-DEI group targets Geisinger College of Health Sciences over program** **Anti-DEI group targets Geisinger College of Health Sciences over program** Luzerne County Court NotesLuzerne County Court Notes **Luzerne County Court Notes** **Luzerne County Court Notes** $20 billion Amazon data center investment in Pennsylvania includes one in Salem Twp.$20 billion Amazon data center investment in Pennsylvania includes one in Salem Twp. **$20 billion Amazon data center investment in Pennsylvania includes one in Salem Twp.** **$20 billion Amazon data center investment in Pennsylvania includes one in Salem Twp.** Region mourns death of local legend Ace BrognaRegion mourns death of local legend Ace Brogna **Region mourns death of local legend Ace Brogna** **Region mourns death of local legend Ace Brogna** Police: Alleged killer’s cellphone pinged at crime scenePolice: Alleged killer’s cellphone pinged at crime scene **Police: Alleged killer’s cellphone pinged at crime scene** **Police: Alleged killer’s cellphone pinged at crime scene** **More in Local News** Authority negotiating sale of land for new hotel **Authority negotiating sale of land for new hotel** **Authority negotiating sale of land for new hotel** Land bank OKs sale of Downtown Wilkes-Barre lot for educational garden **Land bank OKs sale of Downtown Wilkes-Barre lot for educational garden** **Land bank OKs sale of Downtown Wilkes-Barre lot for educational garden** King’s College to launch new campus projects **King’s College to launch new campus projects** **King’s College to launch new campus projects** County council holds off expanding tax breaks for vets **County council holds off expanding tax breaks for vets** **County council holds off expanding tax breaks for vets** 2025 June 9 Site LinksSubscribeNewsletters and AlertsArchivesSubmission Forms Subscribe Newsletters and Alerts Archives Submission Forms Subscribe Newsletters and Alerts Archives Submission Forms Our CompaniesThe Times-TribuneStandard-SpeakerRepublican HeraldAccess NEPA.comGreater Pittston ProgressWyoming County Examiner The Times-Tribune Standard-Speaker Republican Herald Access NEPA.com Greater Pittston Progress Wyoming County Examiner The Times-Tribune Standard-Speaker Republican Herald Access NEPA.com Greater Pittston Progress Wyoming County Examiner citizensvoice.com75 N. Washington St.Wilkes-Barre, PA 18701Phone: (570) 821-2000 75 N. Washington St. Wilkes-Barre, PA 18701 Phone: (570) 821-2000 75 N. Washington St. Wilkes-Barre, PA 18701 Phone: (570) 821-2000 Contact usPrivacy PolicyQuestions or CommentsiPhone App FAQAndroid App FAQ Privacy Policy Questions or Comments iPhone App FAQ Android App FAQ Privacy Policy Questions or Comments iPhone App FAQ Android App FAQ Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}