{"id": 648, "name": "History Today", "domain": "historytoday.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.historytoday.com/archive/missing-pieces/renaissance-florences-missing-bronzes", "title": "Renaissance Florences Missing Bronzes", "content": "**User menu logged out** Subscribe Sign in SubscriptionOffers Give a Gift **Main menu** Home The Magazine Subscribe Buy the Current Issue Explore the Digital Archive Institutions Reviews Sign in **Mini header menu** Search Magazine Latest Subscribe Subscribe **Renaissance Florence’s Missing Bronzes** The controversial outcome of a sculpture competition between Filippo Brunelleschi and Lorenzo Ghiberti changed the urban fabric of Renaissance Florence – or so the story goes. It was the greatest contest in the history of art – and arguably the most mysterious too. The year was 1401 and in Florence, the ‘home’ of the Renaissance, uncertainty reigned. Still reeling from an outbreak of plague the previous year, the city had been sucked into a damaging war with Milan. As fears of invasion mounted, a feverish religiosity took hold. Attention focused on the baptistery. A large, octagonal building opposite the cathedral, it had long been a focus for civic life, both in triumph and adversity. A little over 70 years before, the sculptor Andrea Pisano had cast a set of bronze doors for the southern portal. Now, in Florence’s hour of peril, it was high time that an equally, if not more, dazzling pair should be cast for the north side – a testament to the city’s faith, an offering for its deliverance, and an assertion of its defiance. Naturally, the Arte di Calimala – the powerful cloth guild responsible for the baptistery – wanted the best artist for the job. The earliest account of their deliberations is found in a biography by Antonio Manetti, a leading humanist and architect. According to Manetti, there were two candidates, ‘both Florentines’. The first was Lorenzo Ghiberti. Then in his early twenties, he had broad training and was keen to make a name for himself. The other was Filippo Brunelleschi – a prouder, some might say more idealistic, personality. **A battle in bronze** To decide between them, the Arte di Calimala announced a competition. Each artist had a year to cast a bronze panel in the shape of a quatrefoil, illustrating the story of the sacrifice of Isaac, in whatever manner they pleased. A jury of 34 experts, headed by wealthy banker Giovanni di Bicci de’ Medici, would then adjudicate between them. The results were striking. According to Manetti, when experts saw Ghiberti’s entry, they were impressed. They doubted whether anyone, even the Greek sculptor Polyclitus, could have done better. But when they saw Brunelleschi’s, they were ‘amazed’. Unlike Ghiberti’s sparer, more ‘classicising’ composition, his panel was breathtakingly vivid, crowded with life and figures, all vying for attention. Everyone marvelled at its ‘novelty’ and ‘bellissima invenzione’. The jury couldn’t choose. As Manetti explained, they eventually decided that, since the project was very large, and the entries were both ‘very beautiful’, it should be declared a tie: the two artists should work on the doors together. For Manetti, this was an outrage. In his view, Brunelleschi should have won. The only reason he didn’t, Manetti claimed, was that Ghiberti cheated. While Brunelleschi had been working away at his panel in secret, Ghiberti had got nervous. Fearful of Brunelleschi’s talent, he had crept around, quizzing the committee about what they were looking for and tailoring his entry as necessary. And it worked better than he had any right to expect. Brunelleschi was appalled. Too high-minded, or too stubborn, to accept so undignified a compromise, he withdrew from the contest and went off to Rome in a huff. The effect of this on Ghiberti’s career was seismic. Now solely responsible for the baptistery doors, he was catapulted to the forefront of Florentine sculpture. He worked at them steadily for the next 20 years; and when they were completed, he was immediately commissioned to undertake another, even more imposing set for the eastern portal. Commonly known as the ‘Gates of Paradise’, they became one of the defining monuments of the Florentine Renaissance. For Brunelleschi, the result was even more decisive. In Manetti’s telling, it was his failure to win the competition outright which persuaded him to turn his back on a promising career in sculpture and to pursue architecture instead. In this sense, it was the making of him. After studying ancient ruins in Rome, he returned to Florence and embarked on a series of buildings which were to change the character of Renaissance architecture forever. These culminated in the dome of Florence Cathedral, the commission for which he won in a competition against several others, including his old rival Ghiberti. The largest unsupported dome built since antiquity, it dominates the city even today – towering far above the diminutive baptistery below. **Missing panels** Manetti’s account is certainly plausible. Although he was too young to have witnessed the competition himself, he was old enough to learn about it first-hand. He was a contemporary of both Brunelleschi and Ghiberti. He saw their entries himself (now preserved in the Palazzo del Bargello). And he provided a compelling explanation for why Brunelleschi so suddenly changed his professional direction – so compelling, in fact, that it became the basis of almost all later biographies, including Giorgio Vasari’s influentialVita(1550, 1568). Manetti’s account isn’t all it’s cracked up to be, though. Like most Renaissance biographers, he wasn’t bothered about truth so much as verisimilitude. He wasn’t interested in getting every detail right; he just needed to weave a lively story that seemed believable enough. The information he had wasn’t up to much, either. Writing in the mid-1480s – almost a century after the competition – he had little to go on other than the panels themselves. He knew that there had been a contest, that Ghiberti had won, and that Brunelleschi had subsequently gone on to become an architect. But he knew little beyond that. What Manetti did not mention – and may not have known – is that Brunelleschi and Ghiberti had not been the only competitors. There had been five others. According to Vasari, they were Donatello, Jacopo della Quercia, Simone da Colle, Francesco di Valdambrino, and Niccolò Aretino. By Manetti’s day, however, their involvement was not well known. As Manetti had rightly noted, each competitor was asked to create a bronze panel. Bronze was expensive, though; it would have been unfair to expect them to pay for it themselves, especially when there was no guarantee of winning. The Arte di Calimala therefore provided them with as much bronze as they needed – on the condition that, when the competition was over, all the panels would be returned and melted down for resale, so that some of the cost could be recouped. Things didn’t quite work out that way, of course. Ghiberti’s panel was spared – it had to be. At first, it was intended to be included in the baptistery doors. Then the plan changed, and the decorative scheme was switched from the Old Testament to the New Testament. It was set aside for a future set of doors for the eastern portal. When that project came around, more than 20 years later, Ghiberti’s own vision had shifted so radically that it was essentially useless. By then, however, he was so famous that it was worth keeping for its own sake. Why Brunelleschi’s panel survived is more of a puzzle. In 1401-02 he was virtually unknown, with barely a handful of works to his name. Nor, despite his family’s relative affluence, was he so prominent that he could have persuaded the Arte di Calimala to bend the rules. According to an intriguing new book by the American art historian Marvin Trachtenberg, one possibility is that Brunelleschi and his family may simply have reimbursed the guild for the bronze. But if this was the case, why go to the expense of keeping a panel, when it must have reminded him of his loss – and when he was turning his back on sculpture anyway? Whatever the case, the five other panels were destroyed. This hid their involvement from posterity. Either Manetti didn’t know they had ever existed, or – if he did – he was confident that his readers wouldn’t, and that he could safely pass over them in silence. Either way, his version of the story doesn’t fit all the facts. But if the competition wasn’t a head-to-head struggle between two artists, as he claimed, that means that his explanation for why Ghiberti won and Brunelleschi lost is probably wide of the mark too. **Keep it simple** So why did Ghiberti win? Ironically, it may have been precisely for the same reason that Manetti thought he should have lost. After all, the jury weren’t looking for a panel that could be viewed in isolation: they wanted something that could be easily understood alongside 27 other scenes on a pair of enormous doors. Brunelleschi’s panel might have been much less impressive than Manetti made it seem. As Trachtenberg argues, it was ‘full of difficult detail’. There were so many figures crowded into the space that it took ‘time and effort’ to understand what was going on. Set into the doors, it just wouldn’t have worked. Ghiberti’s panel, by contrast, had an appealing simplicity. Unlike Brunelleschi, who had treated his panel like a relief, with figures flattened into the scene, Ghiberti had shown his characters in full, rounded form, as if they were bursting out of the surface. This meant that they could be seen – and appreciated – more easily from the side, when the doors were open. We do not know what the other five panels looked like, but given these considerations, it seems possible that, despite Brunelleschi’s vibrancy and ‘invenzione’, he may not have been a serious contender at all. But if so, this leaves us with another problem. If Brunelleschi did not leave Florence in a huff after the competition, why did he make the change from sculpture to architecture? Did he go to Rome at all? Although he is known to have travelled there later in his career, there is no hard evidence to support this claim either. Many scholars have suspected that it, too, may just have been an invention, designed to ‘smooth out’ Manetti’s narrative. If Brunelleschi didn’t go to Rome, where did he learn the rudiments of classical architecture? Where did the great dome of Florence Cathedral come from if not from the baptistery below? Alexander Leeis a fellow in the Centre for the Study of the Renaissance at the University of Warwick. **Related Articles** **Popular articles** **Recently published** **Most read** Cannibal Crusaders ‘Miracles and Wonder’ by Elaine Pagels review Renaissance Florence’s Missing Bronzes ‘Hitler’s Deserters’ by Douglas Carl Peifer review ‘The Alienation Effect’ by Owen Hatherley review **Footer menu** About Masthead Contact Jobs Advertising RSS feeds Submit an Article Back Issues Binders Cookie policy Awards Students Privacy policy Terms of Use X Instagram Bluesky Facebook © Copyright 2025 History Today Ltd. Company no. 1556332."}