{"id": 2057, "name": "NDTV", "domain": "ndtv.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.ndtv.com/india-news/india-canada-news-khalistani-terrorist-hardeep-singh-nijjar-were-very-serious-aboutjustin-trudeau-on-ties-with-india-amid-row-4433840#pfrom=home-ndtv_", "title": "India Canada News Khalistani Terrorist Hardeep Singh Nijjar Were Very Serious Aboutjustin Trudeau On Ties With India Amid Row 4433840#pfrom=home Ndtv_", "content": "NDTV World Profit हिंदी MOVIES IPL 2025 FOOD LIFESTYLE HEALTH TECH Games SHOPPING APPS Rajasthan MPCG Marathi Live TV Latest IndiaIndiaAll India NewsIndia GlobalDiasporaSouthLatestAxiom-4 Launch Delays Unusual? Astrophysicist Neil deGrasse Tyson ExplainsCongress Expels Digvijaya Singh's Brother For Remarks On Rahul GandhiArmy Jawan On Leave Beaten To Death In Rajasthan, 2 Detained: Cops'Red Alert' Issued As Heatwave Grips Delhi, Rain Expected After June 135 Injured After Mob Clashes With Cops Near Kolkata, BJP Seeks Central Forces All India News India Global Diaspora South Axiom-4 Launch Delays Unusual? Astrophysicist Neil deGrasse Tyson Explains Congress Expels Digvijaya Singh's Brother For Remarks On Rahul Gandhi Army Jawan On Leave Beaten To Death In Rajasthan, 2 Detained: Cops 'Red Alert' Issued As Heatwave Grips Delhi, Rain Expected After June 13 5 Injured After Mob Clashes With Cops Near Kolkata, BJP Seeks Central Forces All India News India Global Diaspora South Axiom-4 Launch Delays Unusual? Astrophysicist Neil deGrasse Tyson Explains Congress Expels Digvijaya Singh's Brother For Remarks On Rahul Gandhi Army Jawan On Leave Beaten To Death In Rajasthan, 2 Detained: Cops 'Red Alert' Issued As Heatwave Grips Delhi, Rain Expected After June 13 5 Injured After Mob Clashes With Cops Near Kolkata, BJP Seeks Central Forces World Videos Opinion CitiesMetrosBengaluruChennaiDelhiMumbaiOther CitiesAhmedabadAllahabadAmritsarBhopalBhubaneshwarChandigarhGhaziabadGoaGurgaonGuwahatiHyderabadJaipurKanpurKolkataLucknowNoidaPatnaPuneSrinagarThiruvananthapuram Bengaluru Chennai Delhi Mumbai Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Bengaluru Chennai Delhi Mumbai Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Auto Web Stories EducationEducationExamsSchoolCampusStudy AbroadWeb StoriesLatestNICL AO Recruitment 2025: Notification Released For 266 Posts, Check DetailsUPSC CSE Prelims Result 2025 Announced: What's Next?UPSC Prelims Result 2025 Declared, 14,161 Candidates Shortlisted For MainsHow To Get Into Google Summer Of Code: Selected Student Shares Simple 5-Step JourneySBI Clerk Mains Result 2025 Released, Here's How To Check Exams School Campus Study Abroad Web Stories NICL AO Recruitment 2025: Notification Released For 266 Posts, Check Details UPSC CSE Prelims Result 2025 Announced: What's Next? UPSC Prelims Result 2025 Declared, 14,161 Candidates Shortlisted For Mains How To Get Into Google Summer Of Code: Selected Student Shares Simple 5-Step Journey SBI Clerk Mains Result 2025 Released, Here's How To Check Exams School Campus Study Abroad Web Stories NICL AO Recruitment 2025: Notification Released For 266 Posts, Check Details UPSC CSE Prelims Result 2025 Announced: What's Next? UPSC Prelims Result 2025 Declared, 14,161 Candidates Shortlisted For Mains How To Get Into Google Summer Of Code: Selected Student Shares Simple 5-Step Journey SBI Clerk Mains Result 2025 Released, Here's How To Check PodcastAutoLifestyleEntertainmentOffbeatWeb StoriesScienceTrendsPhotosFeaturePeopleTV ScheduleIndia@AI Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Committed To Closer Ties With India, Says Justin Trudeau Amid Row **Committed To Closer Ties With India, Says Justin Trudeau Amid Row** **Committed To Closer Ties With India, Says Justin Trudeau Amid Row** In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu **In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu** **In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu** Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body **Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body** **Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body** \"They Can Speak For...\": US On India's Response On Canada's Allegations **\"They Can Speak For...\": US On India's Response On Canada's Allegations** **\"They Can Speak For...\": US On India's Response On Canada's Allegations** Change Font SizeAA Focus on Story choose your destinationHindiMarathiMPCGRajasthan Hindi Marathi MPCG Rajasthan Hindi Marathi MPCG Rajasthan News UpdatesLive TVIndiaLatestVideoPodcastProfitMovies Live TV India Latest Video Podcast Profit Movies Live TV India Latest Video Podcast Profit Movies News UpdatesCricketCitiesNotificationsOpinionWeb StoriesTrends Cricket Cities Notifications Opinion Web Stories Trends Cricket Cities Notifications Opinion Web Stories Trends FeaturedFeatureOffbeatSciencePeopleSouthEducationTechFoodSportsHealthLifestylePhotosTV ScheduleToolboxFollow Us OnFacebookTwitterInstagramLinkedInYouTube Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Toolbox Follow Us OnFacebookTwitterInstagramLinkedInYouTube Facebook Twitter Instagram LinkedIn YouTube Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Toolbox Follow Us OnFacebookTwitterInstagramLinkedInYouTube Facebook Twitter Instagram LinkedIn YouTube Facebook Twitter Instagram LinkedIn YouTube **Committed To \"Closer Ties\" With India, Says Justin Trudeau Amid Row** **Pointing to the increasing influence of India worldwide, Trudeau said that it is \"extremely important\" that Canada and its allies continue to engage with India.** Asian News International India News Sep 29, 2023 11:12 am ISTPublished OnSep 29, 2023 06:52 am ISTLast Updated OnSep 29, 2023 11:12 am IST Published OnSep 29, 2023 06:52 am IST Last Updated OnSep 29, 2023 11:12 am IST Published OnSep 29, 2023 06:52 am IST Last Updated OnSep 29, 2023 11:12 am IST Twitter WhatsApp Facebook Reddit Email India has outrightly rejected Trudeau's allegations. Canadian Prime Minister Justin Trudeau said that Canada is still committed to building closer ties with India, despite \"credible allegations\" of the Indian government's involvement in the killing of Khalistani terrorist Hardeep Singh Nijjar, Canada-based National Post reported. Pointing to the increasing influence of India worldwide, Trudeau said that it is \"extremely important\" that Canada and its allies continue to engage with India. Speaking at a press conference in Montreal on Thursday, Trudeau said that he thinks it is \"extremely important\" that Canada and its allies continue to engage \"constructively and seriously\" with India given its growing importance on the world stage. \"India is a growing economic power and important geopolitical player. And as we presented with our Indo-Pacific strategy, just last year, we're very serious about building closer ties with India,\" he told reporters. \"At the same time, obviously, as a rule of law country, we need to emphasize that India needs to work with Canada to ensure that we get the full facts of this matter,\" National Post quoted Trudeau as saying. Trudeau said he got assurances from the US that Secretary of State Antony Blinken would be raising the allegations made publicly about India's role in Nijjar's murder during a meeting with his Indian counterpart S Jaishankar in Washington DC on Thursday. \"The Americans have been with us in speaking to the Indian government about how important it is that they be involved in following up on the credible allegations that agents of the Indian government killed a Canadian citizen on Canadian soil,\" National Post quoted Trudeau as saying. \"This is something that all democratic countries, all countries that respect the rule of law need to take seriously. We are moving forward in a thoughtful, responsible way anchored in the rule of law with all of our partners including in our approach to the Government of India,\" he added. Trudeau told the Canadian House of Commons on September 18 that Canadian security agencies had been actively pursuing \"credible allegations of a potential link\" between agents of the Government of India and the killing of Nijjar. Trudeau then urged the Indian government to cooperate with Canada \"to get to the bottom of this matter.\" However, India has outrightly rejected the allegations, calling them 'absurd' and 'motivated'. Notably, Trudeau has yet to provide any public evidence to support the claim about the slaying of Hardeep Singh Nijjar. Trudeau's remarks led to the further worsening of already strained ties between the countries. India has suspended its visa services in Canada, following Canadian Prime Minister Trudeau's allegations of Indian involvement in the killing. Amid strained ties, India issued an advisory for its citizens and those who are travelling to Canada to exercise \"utmost caution in view of growing anti-India activities and politically-condoned hate crimes and criminal violence\" in the country. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) TrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworld **Related News** \"Proud\" Justin Trudeau Reacts To Son's New Music Video, Clip Viral 10 Years Of Justin Trudeau: How Canada's Former Prime Minister Fell Justin Trudeau Was Missing During Canada Elections. How It Helped Liberals **Trending News** Mangalsutra Helped Crack Honeymoon Murder: Senior Cop To NDTV Exotic Wedding, Villa, 3 Buildings: Telangana Engineer Booked For Corruption Gangster Goldy Brar Was Asked Why He Killed Sidhu Moose Wala. His Response Pak, Troubled By Thoughts Of A Deterrent For BrahMos, Looks Beyond China \"Will Marry Raja Raghuvanshi But...\": Sonam's Threat To Mother Before Wedding Latest News PNR Status Education News Business News Sports News MP Chhattisgarh News NDTV Profit Auto News AI News Meghalaya Murder Case Axiom 4 Mission Anti-Terror Outreach LA Protests Honeymoon Murder Case India-US Trade Deal About Us Advertise EPG Services Channels Disclaimer Feedback Investors Redressals Privacy Policy Terms & Conditions Partner Content Archives News Hindi Business Movies Cricket Food Tech Education Health Lifestyle MPCG Rajasthan Marathi choose your destinationHindiMarathiMPCGRajasthan Hindi Marathi MPCG Rajasthan Hindi Marathi MPCG Rajasthan News UpdatesLive TVIndiaLatestVideoPodcastProfitMoviesCricketCities Live TV India Latest Video Podcast Profit Movies Cricket Cities Live TV India Latest Video Podcast Profit Movies Cricket Cities FeaturedNotificationsOpinionWeb StoriesTrendsFeature Notifications Opinion Web Stories Trends Feature Notifications Opinion Web Stories Trends Feature More LinksOffbeatSciencePeopleSouthEducationTechFoodSportsHealthLifestylePhotosTV ScheduleToolbox Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Toolbox Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Toolbox Follow Us OnFacebookTwitterInstagramLinkedinYoutubeWhatsappThreadsSnapchat Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat"}