{"id": 1041, "name": "KNWO - NPR - Cottonwood", "domain": "nwpb.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nwpb.org/2025/05/23/caregiving-and-the-future-of-an-aging-population-a-radio-special-on-caregiving-hour-2/", "title": "Caregiving And The Future Of An Aging Population A Radio Special On Caregiving Hour 2", "content": "AboutContact UsCoverage AreaOur StaffWork With UsReport an OutageStation NewsLatest Station NewsConnect ArchivesOur StoriesDownload NWPB App Contact Us Coverage Area Our Staff Work With Us Report an Outage Station NewsLatest Station NewsConnect Archives Latest Station News Connect Archives Our Stories Download NWPB App Contact Us Coverage Area Our Staff Work With Us Report an Outage Station NewsLatest Station NewsConnect Archives Latest Station News Connect Archives Latest Station News Connect Archives Our Stories Download NWPB App TVSchedulesChannel GuideOnline SchedulesLocal ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam WarNWPB PassportPBSPBS KidsAll TV Programs SchedulesChannel GuideOnline Schedules Channel Guide Online Schedules Local ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War NWPB Passport PBS PBS Kids All TV Programs SchedulesChannel GuideOnline Schedules Channel Guide Online Schedules Channel Guide Online Schedules Local ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War NWPB Passport PBS PBS Kids All TV Programs RadioSchedulesView SchedulePrint ScheduleListen LiveNPR NewsNPR News & Classical MusicKJEM: JazzClassical Music PlaylistJazz Music Playlist SchedulesView SchedulePrint Schedule View Schedule Print Schedule Listen LiveNPR NewsNPR News & Classical MusicKJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz Classical Music Playlist Jazz Music Playlist SchedulesView SchedulePrint Schedule View Schedule Print Schedule View Schedule Print Schedule Listen LiveNPR NewsNPR News & Classical MusicKJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz Classical Music Playlist Jazz Music Playlist NewsFire CoverageNorthwest NewsEn EspañolEnvironmentElections CoverageBusiness & EconomyMurrow NewsThe American BuffaloRemembering the Idaho Four Fire Coverage Northwest News En Español Environment Elections Coverage Business & Economy Murrow News The American Buffalo Remembering the Idaho Four Fire Coverage Northwest News En Español Environment Elections Coverage Business & Economy Murrow News The American Buffalo Remembering the Idaho Four Music & CultureMusic & CultureArtsPodcastsStoryCorps NWPast as ProloguePassing The BatonMusic MomentsPress A to Play Music & Culture Arts Podcasts StoryCorps NW Past as Prologue Passing The Baton Music Moments Press A to Play Music & Culture Arts Podcasts StoryCorps NW Past as Prologue Passing The Baton Music Moments Press A to Play EducationExplore TogetherAbout Explore TogetherExplore Together EventsExplore Together Resources Explore Together About Explore Together Explore Together Events Explore Together Resources Explore Together About Explore Together Explore Together Events Explore Together Resources EventsCommunity CalendarAdd an Event Community Calendar Add an Event Community Calendar Add an Event SupportSupport NWPBSustaining MembershipLeadership CircleVehicle DonationBusiness Support & Community SponsorIRA QCDGifts of Stock and Other AssetsEstate & Planned GiftsForms Support NWPB Sustaining Membership Leadership Circle Vehicle Donation Business Support & Community Sponsor IRA QCD Gifts of Stock and Other Assets Estate & Planned Gifts Forms Support NWPB Sustaining Membership Leadership Circle Vehicle Donation Business Support & Community Sponsor IRA QCD Gifts of Stock and Other Assets Estate & Planned Gifts Forms DonateRadioTelevision Radio Television Radio Television MyNWPBMyNWPB LoginMyNWPB Information MyNWPB Login MyNWPB Information MyNWPB Login MyNWPB Information Listen/StreamSmart Speaker FAQNPR & Classical MusicNPR NewsJazzNWPB/TV PBSPodcasts Smart Speaker FAQ NPR & Classical Music NPR News Jazz NWPB/TV PBS Podcasts Smart Speaker FAQ NPR & Classical Music NPR News Jazz NWPB/TV PBS Podcasts AboutContact UsCoverage AreaOur StaffWork With UsReport an OutageStation NewsLatest Station NewsConnect ArchivesOur StoriesDownload NWPB App Contact Us Coverage Area Our Staff Work With Us Report an Outage Station NewsLatest Station NewsConnect Archives Latest Station News Connect Archives Our Stories Download NWPB App Contact Us Coverage Area Our Staff Work With Us Report an Outage Station NewsLatest Station NewsConnect Archives Latest Station News Connect Archives Latest Station News Connect Archives Our Stories Download NWPB App TVSchedulesChannel GuideOnline SchedulesLocal ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam WarNWPB PassportPBSPBS KidsAll TV Programs SchedulesChannel GuideOnline Schedules Channel Guide Online Schedules Local ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War NWPB Passport PBS PBS Kids All TV Programs SchedulesChannel GuideOnline Schedules Channel Guide Online Schedules Channel Guide Online Schedules Local ProgramsAccess NWAmerican GraduateAsk Dr. UniverseOur Hanford HistoryOur Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War Access NW American Graduate Ask Dr. Universe Our Hanford History Our Neighbors’ Stories: Vietnam War NWPB Passport PBS PBS Kids All TV Programs RadioSchedulesView SchedulePrint ScheduleListen LiveNPR NewsNPR News & Classical MusicKJEM: JazzClassical Music PlaylistJazz Music Playlist SchedulesView SchedulePrint Schedule View Schedule Print Schedule Listen LiveNPR NewsNPR News & Classical MusicKJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz Classical Music Playlist Jazz Music Playlist SchedulesView SchedulePrint Schedule View Schedule Print Schedule View Schedule Print Schedule Listen LiveNPR NewsNPR News & Classical MusicKJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz NPR News NPR News & Classical Music KJEM: Jazz Classical Music Playlist Jazz Music Playlist NewsFire CoverageNorthwest NewsEn EspañolEnvironmentElections CoverageBusiness & EconomyMurrow NewsThe American BuffaloRemembering the Idaho Four Fire Coverage Northwest News En Español Environment Elections Coverage Business & Economy Murrow News The American Buffalo Remembering the Idaho Four Fire Coverage Northwest News En Español Environment Elections Coverage Business & Economy Murrow News The American Buffalo Remembering the Idaho Four Music & CultureMusic & CultureArtsPodcastsStoryCorps NWPast as ProloguePassing The BatonMusic MomentsPress A to Play Music & Culture Arts Podcasts StoryCorps NW Past as Prologue Passing The Baton Music Moments Press A to Play Music & Culture Arts Podcasts StoryCorps NW Past as Prologue Passing The Baton Music Moments Press A to Play EducationExplore TogetherAbout Explore TogetherExplore Together EventsExplore Together Resources Explore Together About Explore Together Explore Together Events Explore Together Resources Explore Together About Explore Together Explore Together Events Explore Together Resources EventsCommunity CalendarAdd an Event Community Calendar Add an Event Community Calendar Add an Event SupportSupport NWPBSustaining MembershipLeadership CircleVehicle DonationBusiness Support & Community SponsorIRA QCDGifts of Stock and Other AssetsEstate & Planned GiftsForms Support NWPB Sustaining Membership Leadership Circle Vehicle Donation Business Support & Community Sponsor IRA QCD Gifts of Stock and Other Assets Estate & Planned Gifts Forms Support NWPB Sustaining Membership Leadership Circle Vehicle Donation Business Support & Community Sponsor IRA QCD Gifts of Stock and Other Assets Estate & Planned Gifts Forms DonateRadioTelevision Radio Television Radio Television MyNWPBMyNWPB LoginMyNWPB Information MyNWPB Login MyNWPB Information MyNWPB Login MyNWPB Information Listen/StreamSmart Speaker FAQNPR & Classical MusicNPR NewsJazzNWPB/TV PBSPodcasts Smart Speaker FAQ NPR & Classical Music NPR News Jazz NWPB/TV PBS Podcasts Smart Speaker FAQ NPR & Classical Music NPR News Jazz NWPB/TV PBS Podcasts **Caregiving and the Future of an Aging Population: A Radio Special on Caregiving Hour 2** TRT: 59:40 In this hour, we look at the future of aging—and why we need to act now.As America’s population grows older, many communities may not be ready to meet the needs of seniors. What can individuals and local organizations do to prepare? We speak withMark Havens, executive director ofInterlinkin Lewiston, a nonprofit helping seniors and people with disabilities stay independent and in their homes. From transportation to home safety upgrades, Interlink’s work—and its recent research into the Lewiston-Clarkston area—offers insight into what the rest of the country may soon face. Also in this episode: Rachel Sunexplores howline dancinghelps older adults stay active and socially connected. Phineas Popereports on the rise ofpickleballas a fun and healthy way to age well. Sue Anderson, associate professor at the University of Idaho, shares how we can shift the narrative around aging and better support caregivers and families. Caregiving, Premiering June 24 on PBS **Transcript of “Caregiving and the Future of an Aging Population”** From the campus of Washington State University in Pullman, this is an NWPB Special on Caregiving. I’m Sueann Ramella. This two part series is inspired by the upcoming PBS documentary from executive producer Bradley Cooper calledCaregivingand in it Cooper shares how he rarely considered caregiving until his father’s cancer diagnosis. Here’s clip. Like most people, I didn’t even think about caregiving until my father was diagnosed with cancer. My dad was somebody who I idolized. I used to dress up like him when I was a kid in kindergarten and get made fun of ’cause I wanted to wear like a suit and a tie. And then to go from that to giving him a bath is, is a, is quite a, traumatic thing. Everyone has a care story. Caring for our families is the most important and invisible work that we will ever do. Do you think we look alike? There you go. Doesn’t matter who you are, where you live, what you do, where you come from. You need care. How you feeling this morning? You good? And we have this invisible army who are essentially holding us all up as families and therefore holding the entire economy up. I have reintroduced a credit for caring. Bill Fit is for those that are caring for their loved ones. We are trapped in a caregiving crisis within an economic crisis within a healthcare crisis. Now we have a once in a generation opportunity to support all of our families and our caregivers too. It really is up to us. All of us can help raise the banner for caregivers. That’s why I’m excited to partner with WETA and produce this documentary together. With your help, we can make a difference. Ramella: And what you just heard was a clip from the upcoming PBS documentary calledCaregivingby executive producer Bradley Cooper, which starts streaming May 27th and will be on TV June 24th on PBS channels. We had a chance to speak with leaders in the caregiving world. Yesterday’s conversation focused on resources and experiences of caregivers. We learned that many people don’t identify as caregivers because they are simply taking care of their family and friends. But without self-identifying as a caregiver, they may be missing out on some resources to help them better care for themselves so they in turn can care for their family and friends. You can listen to hour 1 at nwpb.org. Today’s conversation is about our aging population and how there may not be enough help for them if we don’t plan now, and what can individuals and communities do? We spoke with Mark Havens, the executive director of Interlink in Lewiston. Interlink is a nonprofit organization with a mission to help senior citizens and people with disabilities remain independent and in their own home. They transport clients and do safety modifications in homes. Interlink also did research into the census of the Lewiston and Clarkson population. Mark Havens has a lot to share about what they discovered and how the Lewis Clark Valley can be a harbinger for the rest of the nation. Mark: Yes. Interlink started the population project, which later became the aging project three years ago in 2022 when the census data from the 2020 census became available, and by digging into the data for both Nez Perce County, Idaho and Asotin County, Washington where Lewiston and Clarkston are, we found out that that metropolitan area is the oldest population, urban population center, in the entire Pacific Northwest as measured by median age and percent of the population over age 65. By those measures, we match Florida. We are the Florida of the northwest. Ramella: And when you discovered this in the data, what are some thoughts that came to mind? Mark: We did this at the direction of our board of directors, and when we shared the information with them, they said, we are not going to be large enough as an organization to serve the needs of such a ballooning population. Because this is mainly baby boomers retiring. And that’s gonna continue for another decade. Uh, so they directed me to take the data to the public and initiate a community conversation on what are we going to do. So Interlink hosted nine community forums. We called them Senior Summits, between April of 2022 and May of 2024 last year, about every three months. We like the rest of the country, have the baby boomers retiring in vast numbers. That’s been predicted for 30 years or more. Started with people born in 1946 who turned 65 in 2011, and it’s going to continue to the end of this decade and probably a few more years, for this bubble known as the Baby Boomers all passing over age 65. But in addition to that Lewiston and Clarkston have been discovered as a great retirement, mecca because of our low cost of living, low crime rate, beautiful weather, medical facilities and recreational activities. So, hundreds and hundreds of retirees are moving into the Lewis Clark Valley every year, but they don’t bring their families. So these are senior citizens who don’t necessarily have children or relatives or even friends living around them when they need help. Ramella: Many people look forward to an active retirement, so they’re not thinking that they’ll age, slow down, or maybe become disabled. So they may not be thinking about support services, but there may not be enough help. Mark: That’s precisely true. People who have a spouse, have children who live locally, have friends, maybe belong to a faith community and know people there. Of course have financial resources. They don’t often need to reach out to the general public or the government for assistance. They have everything they need if they reach the age or infirmity for help. It’s people who don’t have those things. Don’t have a spouse, don’t have children, don’t have friends, don’t belong to a faith community. Maybe lack financial resources to hire those things. If they live alone we have labeled them ‘solo seniors.’ And so while there’s over 15,000 people in the Lewis Clark Valley over age 65, we estimate that about three to 5,000 of them, so from 20% to one third of them are solo seniors living alone, no family to assist them. It is true that many people don’t recognize their own decline or don’t think they will decline, and so they’re not making plans ahead for those stages of life. And so then when something happens, physical or mental developing, memory loss, or emotional developing depression, whatever it might be, they don’t have a plan in place. And we call those seniors in crisis. And when you asked who would they call, what would they do? Well, there is one thing that everyone knows, they dial 9-1-1, and we have heard from the fire departments and EMTs, emergency medical technicians from both communities – both states and counties – they are overwhelmed with phone calls. Predominantly from senior citizens who don’t have life-threatening issues and don’t need to be transported to the hospital. They just need someone to come and lift them off the floor if they fall or get them unstuck, get them out of their recliner. If they can’t get out of a recliner or move something heavy for them, or just things that neighbors help neighbors with, and they have no one to call except 9-1-1. Now this is an issue for all of us. Those kind of calls are reaching the point of almost 50%. Keep in mind when you yourself may have a life-threatening condition and you need EMT and an ambulance, they may be out helping an older person for a task that is not life threatening and not an emergency. That is why this is a community problem. Ramella: What can community leaders and organizations do about this? Mark: During our community meetings at which over a hundred people participated, both nonprofits for-profits and people from government, we were talking, we would examine the data. And then talk about the implications of the data and how do we prepare for it. The discussion table focused on senior health came back with a report and this was just our third community forum, and they said, our valley cannot grow out of this. We will never be able to hire enough caregivers, hire enough EMTs, have enough beds in assisted living nursing homes and hospitals for this burgeoning number. We have to focus on prevention, which means we have to focus on senior health. The goal needs to be, and our group adopted this as a goal, to keep as many senior citizens as possible as healthy as possible as long as possible so they won’t overtax the system – the healthcare infrastructure system, and ultimately Medicare, Medicaid. You know the financial system, which underpins all of this. And so we’ve been doing a lot of work and study how to keep senior citizens healthy which is an antidote to caregiving. If future senior citizens were to consume healthcare and and caregiving resources at the same rate as current senior citizens, it will bankrupt the system. We will not have enough workers and it will cost too much money. So that’s what that study table came to. That conclusion of there really is no other choice if you want your community to remain vibrant and not overtax your healthcare system which would affect every one of every age. So there’s no way to hire or build our way out of this. Well, wages in the Lewis Clark Valley aren’t necessarily the the highest around, but they have been going up for nurses and caregivers because they need to match Spokane. Some agencies say they even match Seattle wages, but the feeling was you can’t grow your way out of it. One way would be to look overseas for foreign nurses and caregivers. Our valley doesn’t have a great history in bringing in foreign workers as much as other places do, but I think we’re going to have to do that. Family members are going to maybe have to play a more active role than they did before. But now I’m back to the question. What of those who don’t have family members who will be helping them? Ramella: You mention couples come and retire without bringing their families to a new area, but maybe one of the spouses dies and then you are left with a solo senior. Why aren’t people bringing their families? Mark: It’s the same reason people move to Florida from the Northeast or the New York area. They wanna go in their retirement where they enjoy the weather and they enjoy the activities and to be around other senior citizens. But they’re not necessarily thinking ahead. Their family will visit them, and Florida has the infrastructure for senior citizens. So it’s already built up. Um, anticipating this no part of the Northwest does because we’re one of the younger parts, the, the four states in the northwest we’re one of the younger parts of the entire country. But the Lewis Clark Valley is an island of senior citizens in an ocean of younger people. So this infrastructure or this strategy of keeping older people healthy needs to be introduced here first. Interlink has this goal to keep seniors healthy. How are you going about that? We’ve developed a second plan called the Senior Health Initiative, or we’re actually calling it the Gold Plan. The Gold Plan identifying activities and programs that are either in place or should be put in place to keep senior citizens healthy in what are called the seven pillars of health. And people in healthcare know what these are. So it’s not only physical health. The seven pillars are physical health, mental health, social health, because people with friends and social contacts live longer and are healthier. Spiritual health, intellectual health, which is different than mental health, keeping your mind active and your intellect. Financial health, which is very important, especially helping seniors avoid scams, financial scams, and environmental health, which is your surroundings both inside your home. Because many seniors are living in unsafe homes with a lot of stairs and no railings, but also in your community. And we ask seniors in my organization, we will ask them, what can the community do to be safer? And more welcoming to senior citizens when you’re out and about. We all know about wheelchair ramps, at curb cuts, excuse me, curb cuts, at intersections. But there’s so many other ways that a community can be senior friendly, starting with how much strength does it take to open the door to the pharmacy or to a beauty parlor. Thos just can’t be opened by someone with limited strength. Ramella: Oh, Mark, I didn’t even think about that. Mark: So those are the seven pillars of health, and we have identified activities under all of them that our community could introduce and many we already have. We just need to expand them. Another reason for this burgeoning. elderly population and concern about caregiving is because this generation, the Baby Boomer generation that is aging, had fewer children than the generations before that those people may remember taking care of their elderly parents who passed on, but they probably had numerous brothers and sisters to help them. This generation, the Baby Boomers, who are moving into senior retirement may have had only one or two children, and those children may live far away, not necessarily locally. So right off the bat, you have fewer children to help. Even if they wanted to help, they may not live locally or they’re overwhelmed because there may be only one of them and only child or two of them. So that’s another reason for the caregiver crisis in this country. I think the focus on senior health is going to have to become a national priority, but of course, we are seeking grants for the Lewis Clark Valley to be a laboratory to try to experiment with some of these initiatives because people of that age, and I will be one of them soon, they’re going to be there whether we like it or not. It’s to our benefit to help people help themselves stay healthy. So that’s important. The other things are technology, adaptive equipment, robotics may assist, some retirees at home. There are such things called a smart home with technologies that will alert people if you fall on the floor or, help you in the kitchen, things like that. Quite frankly, we need to look to Japan and Korea, South Korea, whose population is far more elderly than us and they have a much more challenging, future before them. And what are they doing to face it? We can learn a lot from other countries. Ramella: You are listening to an NWPB special on caregiving. I’m Sueann Ramella. Staying active is one of the pillars of health that Mark mentioned. You’ll hear more from Mark from Interlink in a moment. First, NWPB’s Phineas Pope has a story about one popular activity to help everyone be active. Pickleball. Phineas Pope Report: Pickleball on a Thursday morning at the Hamilton Indoor Recreation Center in Moscow, Idaho. Pickle ballers are playing doubles. Jim Craig is one of the players. He says he thinks people are drawn to the sport because all you have to do is show up and play. Unlike some other sports that require more planning, he puts it this way. We’re a bunch of old people. We all get together. We play, we get tired. We go sit in the stands and we rest, and we tell each other all our medical problems. He says, that’s not quite a joke. Heather Nelson got into the sport after trying it out at a friend’s birthday party. She says it’s one of the ways she likes to stay active, usually playing three times a week for a few hours. It’s fun, it’s social, you know, and there’s something about the, you know, the PPO that’s kinda like at a pop rocks or something like that. Nelson said, if you’re interested, find someone to teach you the basic rules of the game, which are not that hard. And even if you come as a complete novice to the Moscow Rec Center, there’s typically a beginner’s court set up. It’s can be addictive. So, you know, that’s good. In a good way. Yeah, in a good way. That’s a good way. Sherry LaFave was another pickle baller on the court. She said, coming from tennis, it was a little hard to understand the scoring. If you’re thinking pickleball is just like tennis. LaFave says it’s a lot easier than tennis. It’s just less running and the racket’s not as heavy. The ball’s easier to hit, you know, the little waffle ball. So it’s nice and light. And while may be easier than tennis studies have shown that pickleball can have positive effects on mental health and of course physical health. It’s good exercise. Yeah. Yeah. I’ve got my. Stepper here going. So it’s a good 5,000 steps. I usually play a couple hours and lava’s advice if you’re still on the fence about pickleball, it’s always intimidating to learn a new sport, but I mean, you gotta start somewhere, right? Everyone, everyone starts the same. Everyone’s a beginner at one point in their life, so you just gotta go for it. In Moscow. I’m Phineas Pope. Ramella: That was NWPB’s Phineas Pope, you’re listening to a special on Caregiving, and our guest is Mark Havens from Interlink in Lewiston and Clarkston says, keeping seniors healthy for as long as possible could help lessen the burden on the caregiving industry, or at least postpone your need for caregiving services. Here’s Mark, again, speaking on the pickleball piece. Mark: I think when talking about physical activities it’s important for a community to divide ideas and activities into categories, and then provide a some of each. So what you have there with pickleball is a group activity, not a solo activity and a competitive activity, right? People win the game, and some people are very competitive and some people are not competitive. So the analogy would be the difference if playing cards, the difference between solitaire, playing solitaire by yourself. Non-competitive and playing bridge or pinnacle with other people and you are competitive. It depends on the individual and there should be something for everyone for the individual. For many years in the Lewis Clark Valley, we hosted the Idaho Senior Olympics, so you had Olympic level competition again. For the competitive, running weightlifting, a number of different things, obviously that had to stop with COVID-19. So that activity stopped, and the nonprofit organization that used to put it on and host it has chosen not to revive it, someone else could. It takes a lot of work, but it was also a fundraising event. So it raised money. But once again, I think you need to speak to senior citizens of both genders and every age. Are you competitive? Do you want to try your skill against somebody else, or would you rather engage in an activity that is not competitive but is social, or buy a dog and walk the dog. That’s exercise. Ramella: Now NWPB’s Rachel Sun has another activity to report on – line dancing. Rachel Sun Report: At the Sixth Street Senior Center in Clarkston, Pam Moore is teaching a dance class, step back and rock and do a right shuffle, left pivot. As she moves. She talks through each step while her class stands at attention watching swivel, stomp tap and swivel. And More says she first began instructing line dancing classes about 10 years ago. I love music and I’ve always enjoyed dancing, and I don’t sing well, so this is a wonderful way for me to get to enjoy music and get exercise, and I just love it. Longtime line dancers, like 84-year-old Maya Rodriguez, pick up the steps quickly, but she says she wasn’t always as good as she is now we are showing the young ones that you can do it even if you’re 80. If you had asked me three years ago or when I started, I would not have been able to do it either. Rodriguez says she likes the camaraderie, the dancing helps keep her mind and body active. I am Rachel Sun in Clarkston. Ramella: That was NWPB’s Rachel’s Sun reporting on line dancing. Let’s return to our guest Mark Havens from Interlink. Ramella: So, there’s another story about being active this time of social one. Do you see these types of activities for seniors or others that are easily accessible recreation in the Lewis Clark Valley? Mark: Yes, all of that. And we need a lot more. The problem is that the number and percentage of senior citizens retirees taking advantage of these programs is very low. We need to. Courage more and to have more opportunities on different days, different times On the subject of dancing. Many people find walking boring. They don’t wanna walk. So if you don’t wanna walk, you should dance. The trifecta of dancing once again to use that horse racing term is square dancing, and we used to have a lot of square-dancing groups in the valley, and we have fewer now, but square-dancing involves physical activity, mental stimulation and learning because you have to learn the steps and trace the patterns on the floor. And socializing because you are so doing it with a large group of people, not just a single partner, but a large group of people. Now, line dancing is a great idea because you remove the partner element of it and. Okay, let’s just face it. At a certain age, there’s not enough men for every woman. Women live longer, and so they can’t always count on a dance partner line dancing is ideal. You talked about rugged individualism. We at Interlink are just starting to recognize this issue that many seniors may be resistant to some of these initiatives. They don’t think they need help, or they don’t want to do exercises or do do these other activities to improve their health because they simply don’t want people telling them what to do. They don’t want their keys taken away. They feel that they’ve reached a stage of life that no one can tell them what to do. So how do you overcome that mindset, which may be all across the country? But it might be more prevalent in the Pacific Northwest where people pride themselves on being individuals. We’re going to work on sending this message about senior health, that you do it for yourself and you do it for your family, and you do it for your community, and you do it for your country. It is an act of patriotism to maintain your health, whether it’s to take yoga classes or Tai Chi classes or make sure you’re getting adequate nutrition. It is an act of patriotism to do that, so you don’t become a burden to your family, to your community, and to Medicare. So that’s one thing because that age group has a strong sense of patriotism, strong sense of loyalty to the country. If we can make them understand you’re doing it for more than just yourself. The second very important thing is to do things in community, to do things in groups. I hear messages over and over and over again that walking is the best exercise, which it is, and everyone should walk more, but especially senior citizens. You need to walk more, walk a little bit every day. I heard the statistic recently, walking 15 minutes a day as a senior citizen in your sixties and seventies is likely to add three and a half years to your life. That’s phenomenal. But nobody likes to walk alone. Most people don’t. Maybe you’re an introvert, maybe you’re walking your dog, but most people don’t like to walk alone. So we’re exploring the idea of not just setting up teams of people because again, maybe these people don’t have friends. But setting up walking clubs. Walking clubs with a team leader who will design courses for people of about equal abilities to walk and talk. So this is being done in large cities. Why can’t it be done in places like Lewiston and Clarkston and other places here in the northwest? It actually is the trifecta of health. It is physical, it is mental, and it is social. To get people walking in groups. Heck, you could even name your team and have t-shirts. But I think we have to recognize that we can’t just lecture senior citizens to exercise or do other things individually unless we’re prepared to create teams so they can do it communally, which is more motivational and more enjoyable for all of us. The documentary on caregiving that Bradley Cooper produced… I’m not sure if he uses the word crisis, but if it’s not a crisis now, it soon will be. There’s massively growing numbers of senior citizens and the percentage who will require caregiving because on top of everything else that I’ve told you, Sueann, people are living longer. So the longer you live, the more likely you will need caregiving. I will give you those statistics. The statistics are on average…before death, 42% of men will require caregiving. Sometimes even in a facility. 58% of women will require caregiving also, possibly in a facility, and that is because women live longer than men. So those are, those are the numbers, but the sheer quantity of people in those percentages is going to get larger and larger and larger. There aren’t enough people going into the caregiving professions due to low pay or low prestige. And according to that documentary, if a lot of burden falls on family members, do people, predominantly women, want to leave their careers in their forties and fifties when they’re may be at the peak of their earning potential to care for an elderly relative? That would be a huge loss to our economy and our society, and that’s why I would consider it a crisis. The ripple effects of a rapidly aging population needing care from a decreasing labor force, size of labor force creates a top heavy scenario as is already happening in Japan and Korea and some other countries, including in Europe. And this needs to be resolved before it becomes a crisis through many of the ideas that I’ve already expressed. Ramella: This is a special on caregiving. I’m Sueann Ramella with Northwest Public Broadcasting. Let me reintroduce our guest. Mark Havens Executive Director from Interlink in Lewiston, an organization that assists seniors and the disabled live independently in their homes. They provide transportation services and help build accessibility structures like wheelchair ramps for homes. To overview what Mark has said so far, the Lewiston Clarkston area is like the Florida of the Northwest, but without the infrastructure to sustain the retirees that are moving to the area care services like hospitals, retirement homes, and organizations like his will not be able to meet the caregiving demands of an aging Baby Boomer population. And that is why Interlink has an additional goal to keep seniors as healthy for as long as possible so they can delay their caregiving needs and that everyone will eventually need some level of care. Another important thing everyone can do is to prepare for their death. Mark: It’s really important for people to plan ahead for their later years in life in every way possible when they might need help. And then also if the medical problems really start to compound, and most people know about things like living wills, advanced directives, naming people as power of attorney when they can’t make their own decisions. And I would place all those in end of life. The end of life. And so many Americans, we don’t wanna talk about that. We don’t wanna talk about death. The elderly people don’t wanna talk about it. Their middle-aged children don’t wanna talk about it. Although you’d be surprised at the number of elderly people who will talk about it. So I think the entryway into those conversations and that planning are things that don’t necessarily point toward death, just point toward assistance. So what sort of housing are you living in or is your mother or father living in, is it safe? Is it well maintained? The day will come when they can’t mow the lawn themselves. They can’t keep up with yard work. Maybe they can’t keep up with home maintenance, the roof or painting. Who’s going to step in and help? Is that a plan that children or neighbors or friends can plan for? What about meal preparation? So many seniors don’t get adequate nutrition, and that’s why there’s a lot of senior meal programs, but they may not know that they’re not getting nutrition, or they may decide they’re tired of cooking. So you may want to explore what are the senior meal options in your community. Driving is a huge one. At some point, everyone needs to give up the keys to a vehicle. I have those statistics – according to AARP the average age that Americans quit driving is age 85, and they also say that’s about seven years later than they should be. So let’s assume that we need to have people stop driving sometime between their late seventies and their mid eighties. What’s the alternative? I think the reason that so many senior citizens continue to drive here in the Pacific Northwest is because public transportation options are so limited or non-existent, especially in rural areas. So that’s an area for public policy. Take your pick. Do you want elderly, unsafe drivers on our city streets and at highways, or do we wanna provide alternatives? And so organizations like Interlink are able to pick up the slack as well as. City transit and dial aide services and other kinds of services, but talk to your aging parents about driving and when they might quit driving and what the alternatives are before something bad happens. Ramella: And what about the person giving the care? How can we help them? Mark: It’s important to have a care plan for the caregiver so that they have breaks and they don’t burn out. First of all, there is an old cliche regarding caregiving. Everybody falls into one of four categories. You either have been a caregiver, are currently a caregiver, will be a caregiver in the future, or will be someone in need of caregiving. And some people fall into more than one of those categories. The important thing to remember, and I learned this when I worked at the Alzheimer’s Association some years ago, 40% of caregivers pre-deceased the person that they are providing care for. Now, that’s usually a spouse. A spouse caring for another spouse who has physical or memory challenges, but they will predecease that spouse possibly due to overwork. You need to have a plan B. What would happen in that case and who would become the new caregiver, but also take care of your own health? And one of the greatest needs that communities all over need is an adult daycare program or day health program. That’s not only beneficial for the elderly person who needs supervision, but it’s beneficial to the caregiver who needs a few hours of break, to run errands or go get a massage and look after themselves. Here in Pullman, you have a wonderful program called Circles of Caring Adult Day Health. It’s the only one in this entire area. We don’t have one in Lewiston, Clarkston, but I can highly recommend them and we need those adult day health programs. They don’t have to operate 24 hours a day or even seven days a week, even a few days a week, just a few days a week could make a big difference to the families that have a care partner and a person receiving care. And there are government funds available to pay for those kind of programs. Ramella: Speaking of federal funding, how is interlink funded? Mark: Interlink is funded by a combination of some government funds, some foundation funds, competitive grants that we write for, and corporate and individual donations. So it really is a big mix of funding sources and we appreciate all of them. Regarding the government funds, they are not currently at risk. That could all always change, of course, but one of the benefits of having such a large group of the population moving into retirement is they exert a lot of political clout. And it’s no secret that AARP is the largest lobbying organization and nonprofit organization in the country. Senior citizens also vote at much higher rates than younger people. So any elected official would really need to think twice about going after programs that benefit senior citizens because of the potential political effect. Likewise, senior citizens might want to really question elected officials and candidates on this issue because. It is absolutely guaranteed that if certain kinds of money disappeared, those programs will disappear. There are not alternative sources of funds to keep such programs alive. Governmental funding to a certain degree is important for all of those programs, and it’s something we need to be vigilant about. You know, I can’t quote you a percentage of our budget because it, it changes, as things arise. So just two weeks ago we got our contract for government funding to extend transportation services to the rural parts of Nez Perce County, Lapwai, and some unincorporated areas that even don’t have a name to provide transportation to bring people in those areas into the city for medical appointments and other needs. And those are people who don’t drive, and we haven’t been able to afford to extend services so far outside city limits. But that’s a grant of about $127,000. That’s good for 18 months, a year and a half of this service. We’re thrilled to have it, and we would not have started such a program without such government funding. So government, local, state and national have a huge role to play and it is to their benefit to support seniors and to keep them healthy, which will keep Medicare healthy. Ramella: Mark Havens of interlink, thank you for speaking with us. Do you have any final thoughts to share with people moving into our area or throughout? Mark: People aren’t getting connected to their community if they’re not joining a church, a temple, a synagogue. If they’re not joining athletic groups, if they’re not meeting their neighbors, they’re not joining line dancing social groups. Then who’s going to help them? It’s not unrealistic to think, that’s why they call 9-1-1. That’s why they turned to the government for programs. But we don’t have the programs that people from larger and wealthier areas have because those services are provided by families and friends, which the moving in retirees don’t have. And that is the scenario that all of us as a community are going to have to figure out how to address both government, non-profit and for-profit. How do we help these people? We can’t just say move back home. There’s been a lot of studies about the difficulty and challenges of people in their older years to make friends – shyness, existing seniors belong to cliques and clubs and are suspicious of outsiders, or maybe physical health needs or monetary limitations. Not everyone can join the country club, but it does take a certain personality to reach out and conquer your shyness and not be an introvert and meet other people. And like with pickleball. Invite people to join you. All of us have activities that we could make new friends if we just invited people, and churches should be doing more evangelizing and social clubs and activity groups should be doing more outreach to invite people come and come with a friend. And recognize that this age group is not all connected to Facebook and social media or even use the internet at all. You are not going to reach them. You’ll reach a part portion of them, and 20 years from now, you might reach all of them, but currently you need to rely on more traditional media of radio and newspaper and television to reach these individuals. Ramella: We were speaking with Mark Havens of Interlink that serves the Lewiston and Clarkston Valley. All this talk about caregiving and an aging population may make some listeners think that they’re off the hook, but younger folks, not yet in retirement, there’s news for you too. University of Idaho Associate Professor and Associate Director of Program Development, Sue Anderson says no matter your age, you need to make health bank deposits for your future self. Sue Anderson: I think we’re all kind of familiar with the idea of banking and our bodies and our health really are the most important bank that we have. So everything that we do when we’re younger. Just decisions we make about how we live. Do we stay active? Are we still moving? What is our diet like? What are we doing in our lifestyles that fills our bank of health? Ramella: The month of May is older Americans month, and this year’s theme is Flip the Script on Aging, focusing on transforming how society perceives talks about and approaches aging. It encourages individuals and communities to challenge stereotypes and dispel misconceptions. Dr. Anderson encourages everyone to realize that growing older is not a guarantee. Sue Anderson: Aging is not guaranteed. It’s really a blessing. Every candle that you put on your birthday cake is really a blessing. You’ve made it another year. Don’t be afraid to age, but look forward and be as healthy as I can. That’s really the paradigm shift. You know, the other thing that I see in the culture right now, it’s this ‘Hey, Boomer’ mentality. It’s a negative viewpoint of older people. Really older people have a lot to offer. There’s a lot of experience, these negative social context of aging. It hurts the older people and I think it younger people miss out on a lot of learning and love that they could experience. Ramella: Dr. Anderson helped design a master’s degree in gerontology at the U of I, and why seek this type of degree? Sue Anderson: So this master’s degree was designed for everyone. To really kind of enhance their profession with a focus on gerontology. The older population is growing. It’s a ripe industry for service types of needs. Anyone who’s got any kind of entrepreneurial aspirations, this master’s degree would be a perfect fit for them. I think a lot of people think that getting a degree in gerontology is really for healthcare providers, but then even engineering students because you know, older people sometimes needed adaptive devices or they need adaptations in their home where they live, and they said all of that would need an engineer. Ramella: No matter your age or the age of your loved ones, it’s important to begin the conversation about how to care for you as you age, but how to start that conversation. Dr. Anderson has this advice. Sue Anderson: Take a deep breath, honestly. Look at those candles on your cake and know that something’s going to happen at some point. I encourage everyone to have an advanced directive and have a healthcare power of attorney and have really frank conversations. None of us wants to develop dementia or Alzheimer’s or heart disease, but we know that if we’re blessed to live long enough, this may happen and it’s better that your family knows ahead of time what your wishes are. Ramella: And Dr. Anderson offers this encouragement to those who are caregivers. Dr. Anderson: Caregiving is a 24-7 job and there are so many emotions involved with caregiving and there’s so much uncertainty along the the path of, am I doing the right thing, is what I’m seeing, what’s really happening? And I think the biggest thing I can say for caregivers is to be kind to yourself. My own mom, you know, I carried the guilt of getting rid of her stuff and putting her in a nursing home, you know? And it’s that being kind to yourself and realizing life isn’t always easy, but when you make a decision that really is for the best of the person, forgive yourself. Get help. Don’t be afraid to reach out. There are a lot of agencies that will help. Never feel like you’re alone. Ramella: That was University of Idaho Associate Professor Sue Anderson. Before we end this special on caregiving, a shout out to you if you are caring for your family and friends, or if you are a paid caregiver helping your community members. Visiting Angels is an organization that gives out the caregiver of the Year award and Marty Lusby in the Tri-Cities. Is a semi-finalist for the award. NWPB’s Phineas Pope talked with Lusby about her experience. Pope: What keeps you passionate about this work day after day? Lusby: I love caregiving. I love to do what I do, and it’s just awesome to be recognized for something that I love to do. So when you get up to go to work every morning and it’s caregiving, it’s great. Um, I get to bring the world. To people who are maybe a shut in. Um, I, you know, sometimes we have people that can’t see very well and we read to them, or believe it or not, some of us sing to them, not me, because I’m not a good singer, but some of them do. Pope: Can you tell me about your first experience as a caregiver? What drew you to this? Lusby: Originally when my kids got older and they left home, I needed something to do and it was either gonna be caregiving or childcare. Well, I’ve done childcare for many, many years, so I was like, let, lemme go see what’s going on with caregiving. And so I started with my very first client and she was a, she was just such a charm and my first job was to just go in and visit with her. She was lonely as a lot of elderly people get, you know, they become home bound and they become lonely. She was just lonely and we just had a great time. We’d go, go and just visit and I’d make her her breakfast because she was unable to do that and her family was busy, so I’d make her breakfast and, it just became something that I was real comfortable with. It’s something that I enjoyed and it’s like, what the heck? I stayed with it. Phineas: How did caring for your own family members growing up shape your approach to what you’re doing now? Lusby: My grandparents raised me, and so a lot of it was at that time I was very young and I actually learned how to give an insulin shot as an 8-year-old. So it was a lot of things and then a lot of it was they couldn’t hear well. So they’re always saying, stand up, speak to me, look at me. And so that’s one of the things that, you know, when I go to a lot of clients’ houses, you know, you gotta make sure that they’re hearing you, make sure that they’re seeing you so that they know where you are. And yeah, my grandparents were older of course, and it help me do this honey and help me do that. And so you kind of learn, I guess when you’re really young and you’re taking care of someone, you kind of learn those little things. Pope: Can you talk about what sort of challenges you’re facing right now, either you individually in your work or visiting angels? Lusby: Largely, sometimes the hard part about caregiving too is, you know, a lot of times we’re with people that are really ill and they pass away and it hurts. I mean, as a caregiver it hurts because especially if you’ve been with them for a while. And you know about them, and then you get to know their families and it’s just, yeah, it, that’s the biggest challenge in caregiving for me is when I have to let go. Pope: How do you deal with that? Lusby: Our company gives us a lot of support, a lot of grief support, you know, and that’s just something great. And I think that, you know, it’s a good thing to have. Sometimes it helps to just stand back and not have a client for a couple weeks or a couple months or however long it takes, and then get back in there because when you’re not there, you miss it. So you know, you need to get back there so that you can have that feeling again, I guess I should say. Phineas: Why do you think you enjoy this work? Lusby: It’s rewarding. I get to help people help themselves. Pope: Well, when you say it’s rewarding, does anything in particular come to mind? Lusby: One time I had a lady and she had several different caregivers, and so when I would come in, I go, oh, look, it’s me again. Aren’t you lucky? And she looked at me, she goes, oh yes, I am lucky it’s you. She goes, I like it when you’re here because you help me with everything that I need to do. And you don’t even ask dumb questions, so, so yeah. Um, when you get to know your clients, you kind of know what they, how they want things, and it’s like, oh yeah. It’s quite rewarding when you know you can be that person. And then again, when the family say, oh, thank you so much, what, you know, with the help that you’ve done for my mom or my dad, or whatever, and I’ve had several of those. Pope: I’ve read that you make flower bouquets and bring homemade meals. Lusby: Yes. Pope: What inspires you to go the extra mile? Lusby: Well, isn’t it just something everybody does? I don’t know, maybe it’s not something everybody does. It just puts a smile on their face, when I can say, oh look, I made this for dinner last night and it was so good. I had to bring you some. It’s like, oh, okay. This is great. And sometimes it’s like, yeah, that was good. And, go through recipes with them and it just opens up a whole conversation to what I can bake for them or what I can cook for them. And the flour arrangements are awesome. I had a lady that could no longer get out of bed and she had beautiful flowers outside and she said, oh, I can’t see my flowers anymore. I wanna see my flowers. So I went outside and picked her this big bouquet and I was with her every Monday. So every Monday morning when I came in, I would bring her a fresh flowers from her own garden and it just made her feel so great. Pope: What do you wish people knew about caregiving? Lusby: I wish they knew how much their caregivers really love their clients. I think that a lot of people think caregiving is cold. You know, just go in there, get the job done, and, and get out. You know, oh, all, all mom needs is someone to come and help her shower. Well, it’s more than that because you give them a shower, you give them, like for instance, I will give warm towels out of the dryer instead of just s towel. Warm towels are the dryer, and I help them, you know, to get dressed and lotion their legs or a lot of times they can’t reach their back to wash their back. And it’s all those little things that we do. So, it isn’t just here’s your pills, goodbye. Or, you know, throw a meal in front of you. We sit and visit with ’em when they eat their meal. There’s a lot that caregivers do, I think that some people don’t really recognize unless they’re there to see it. It’s not just a job. No, it’s not just a job at all. You really care about these people when, when you’re with a client, your caregivers actually become part of the family. It’s like, oh yeah, I was here. And then, you know, every now and then while we’re at work, we’re caring for their parents or whatever. They’ll call and say, oh, how’s mom doing today? And then you’re able to say, oh, your mom’s doing really well and you know, this is the challenges we had this day. Or, you know, a lot of times how did the appointment go? So we say, oh yeah, your mom got to her appointment on time and everything was fine. And you know, or everything wasn’t fine. But hopefully everything was fine. Pope: And you are a semi-finalist for the National Caregiver of the Year award? Lusby: I am. How exciting. It’s exciting. Pope: What does that mean to you? Lusby: It means a lot. It means it, it shows me that people appreciate what I do, and I feel like, I’m being rewarded for something that I love to do. Shouldn’t everybody feel that way though? We all wanna be rewarded for something that we absolutely love to do. Ramella: That was Phineas Pope talking with Marty Lusby, a caregiver in the Tri-Cities who’s a semifinalist for the Visiting Angel’s 2025 Caregiver of the Year award. This has been a special on caregiving inspired by the PBS documentary from executive producer Bradley Cooper called Caregiving. The conversation continues with a screening of the documentary at the Lewiston Library on May 29th at five 30, followed by a panel discussion on caregiving resources and needs. That’s Thursday, May 29th at the Lewiston Library RSVP at nwpb.org. Special thanks to Rachel’s Sun and Phineas Pope for contributing to this special and a big thanks to the members of NWPB for making this program possible. I’m Sueann Ramella. **Did You Enjoy This Story?** **Did You Enjoy This Story?** **Recent Posts** Popular casual eatery in Tacoma closesJune 11, 2025 June 11, 2025 June 11, 2025 Fewer hands as agencies prep for North Idaho fire seasonJune 11, 2025 June 11, 2025 June 11, 2025 City of Sunnyside appoints new interim city managerJune 10, 2025 June 10, 2025 June 10, 2025 New grants could help overburdened communities in Washington clean up the airJune 10, 2025 June 10, 2025 June 10, 2025 Congress holds moment of silence for the Decker sistersJune 6, 2025 June 6, 2025 June 6, 2025 Sunnyside city manager placed on paid leave pending investigationJune 6, 2025 June 6, 2025 June 6, 2025 Northwest Public BroadcastingWatch OnlineListen OnlineDownload KTNW ScheduleDownload KWSU SchedulePublic Inspection FilesFCC Applications About UsContact InformationJobsPublic DocumentsWho We AreCoverage Area Support UsPledge TodayLeadership CircleVehicle DonationEstate PlanningBusiness Support & Community Sponsor A community service of the Edward R. Murrow College of Communication at Washington State University.PO Box 642530 | Pullman, WA 99164E-Mail:[email protected]|Phone:1-800-842-8991 |Fax:1-509-335-3772 Editorial Policy|Privacy Policy|Terms of Use"}