{"id": 779, "name": "KRTV - Great Falls News", "domain": "krtv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.krtv.com/science-and-tech/animals-and-insects/man-gored-by-bison-at-yellowstone-national-park-second-incident-this-year", "title": "Man Gored By Bison At Yellowstone National Park Second Incident This Year", "content": "Menu Obituaries Great Falls News Montana & Regional News Crashes/Accidents Crime & Court Military Matters Montana Politics KRTV News Team Mug Shots policy Moving Forward About UsKRTV News TeamKRTV JobsKRTV AppsClosed CaptioningMoving Forward KRTV News Team KRTV Jobs KRTV Apps Closed Captioning Moving Forward KRTV News Team KRTV Jobs KRTV Apps Closed Captioning Moving Forward WeatherToday's ForecastMontana AG Network WeatherInteractive RadarRadar MapsDaily ForecastHourly ForecastWeather Cameras Today's Forecast Montana AG Network Weather Interactive Radar Radar Maps Daily Forecast Hourly Forecast Weather Cameras Today's Forecast Montana AG Network Weather Interactive Radar Radar Maps Daily Forecast Hourly Forecast Weather Cameras Sports CommunityContestsOpen House DirectoryHoliday Gift Guide Contests Open House Directory Holiday Gift Guide Contests Open House Directory Holiday Gift Guide VideosKRTV ProgrammingMTN ChannelWatch Grit TVWatch Ion Television KRTV Programming MTN Channel Watch Grit TV Watch Ion Television KRTV Programming MTN Channel Watch Grit TV Watch Ion Television Open House Directory Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Montana Sports Montana Politics Montana Ag National/World Contests Indian Country MMIP Special Olympics MTN CHANNEL POSITIVELY MONTANA EVENTS CALENDAR OBITUARIES **Actions** Facebook Tweet Email **Man gored by bison at Yellowstone National Park, second incident this year** A 30-year-old man from New Jersey was gored by a bison at Yellowstone National Park on June 10, according to National Park Officials. This is the second goring incident this year. The man was among a group of visitors at the park that approached the animal too closely, officials said. The incident happened around 9:45 a.m. in the Upper Geyser Basin at Old Faithful. Officials said the man was treated by local medics and his injuries were not life-threatening. The incident is still under investigation. RELATED STORY |Invasive Asian needle ants with potentially deadly sting spreading across multiple states Another individual, a 47-year-old Florida man, was gored by a bison on May 4 in the Lake Village area of the park. His injuries were also minor. On May 4, 2025, a 47-year-old man from Cape Coral, Florida, was injured by a bison in Yellowstone National Park. Officials said there were two reported goring incidents in 2024 and one in 2023. National Park Service officials said bison are territorial and have injured more people in Yellowstone than any other animal. \"They are unpredictable and can run three times faster than humans,\" officials said. Visitors are supposed to stay more than 25 yards away from all large animals — including bison, elk, bighorn sheep, deer, moose, and coyotes — and at least 100 yards away from bears, wolves and cougars. Report a typo **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News Weather Community Sports Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact krtv3 krtv KRTV"}