{"id": 2223, "name": "Sports Pickle", "domain": "sportspickle.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://sportspickle.com/college-basketball/kevin-stallings-caught-fbi-offering-100000-anyone-attend-pitt-basketball-game.html", "title": "Kevin Stallings Caught Fbi Offering 100000 Anyone Attend Pitt Basketball Game.html", "content": "Sports Pickle Home The Comeback News Opinion SPtv SportsNFLCFBNBA NFL CFB NBA NFL CFB NBA Betting OddsNFL OddsNBA OddsMLB OddsNCAA Football OddsNCAA Basketball Odds NFL Odds NBA Odds MLB Odds NCAA Football Odds NCAA Basketball Odds NFL Odds NBA Odds MLB Odds NCAA Football Odds NCAA Basketball Odds Contact UsPrivacy Policy Privacy Policy Privacy Policy Home The Comeback News Opinion SPtv SportsNFLCFBNBA NFL CFB NBA NFL CFB NBA Betting OddsNFL OddsNBA OddsMLB OddsNCAA Football OddsNCAA Basketball Odds NFL Odds NBA Odds MLB Odds NCAA Football Odds NCAA Basketball Odds NFL Odds NBA Odds MLB Odds NCAA Football Odds NCAA Basketball Odds Contact UsPrivacy Policy Privacy Policy Privacy Policy Link to TwitterLink to Twitter Link to FacebookLink to Facebook Link to InstagramLink to Instagram Link to RSSLink to RSS **Kevin Stallings caught by FBI offering $100,000 to anyone who would attend a Pitt basketball game** **** (SP) – According to multiple reports, Pitt basketball head coach Kevin Stallings was recorded on federal wiretaps offering numerous people large sums of money if they would attend a single Pitt basketball game. Sources say the FBI began investigating Stallings over reports that he was stealing more than a million dollars a year from the University of Pittsburgh and, in the process of that investigation, uncovered the coach’s attempted bribes. “He asked random passersby in the street, former Pitt season ticket holders, even his secretary and the school’s athletics director to simply attend a Pitt basketball game and stay for the entire thing in exchange for $100,000 in cash” said a person with knowledge of the investigation. “Yet they all turned him down.” It is not clear yet if the FBI will charge Stalling with a crime for his actions, only that FBI agents found his behavior “pretty hilarious.” ”He’s kind of a national laughingstock,” said one FBI source. “Putting him in jail isn’t necessary. He’s been disgraced enough already.” **Also see …Report: NCAA considering death penalty for NCAA** **Related Content** **Recent Posts** **NFL Division Winner Odds for 2024 Season** The Kansas City Chiefs and San Francisco 49ers remain the red-hot favorites to win the Super Bowl in... **Home Run Heroes: Celebrating St. Louis Baseball Legends** St Louis is one of the few American cities to produce a lineage of legendary baseball players who... **Carabao Cup setup for an all star final** There’s plenty to look forward to in England’s other cup competition, the Carabao Cup. Following the qualification of... **Report: Players Tribune ghostwriters funneling athletes to their favorite teams** (SP) – According to a source inside the Players’ Tribune, the Derek Jeter-owned website that claims to provide... **The 4 best quarterbacks in the NFL according to statistical achievement** Since the NFL came to be nearly a hundred years ago, it has gone on to be the... **4 Crazy Long Contracts In Soccer** 📝 | Agreement with @slbenfica_en over the transfer of @JoaoFelix70. 🇵🇹 The Portuguese forward has signed a seven-year... **Sidebar** **Popular Posts** **Recent Posts** **NFL Division Winner Odds for 2024 Season** The Kansas City Chiefs and San Francisco 49ers remain the red-hot favorites to win the Super Bowl in... **Home Run Heroes: Celebrating St. Louis Baseball Legends** St Louis is one of the few American cities to produce a lineage of legendary baseball players who... **Carabao Cup setup for an all star final** There’s plenty to look forward to in England’s other cup competition, the Carabao Cup. Following the qualification of... **Report: Players Tribune ghostwriters funneling athletes to their favorite teams** (SP) – According to a source inside the Players’ Tribune, the Derek Jeter-owned website that claims to provide... **The 4 best quarterbacks in the NFL according to statistical achievement** Since the NFL came to be nearly a hundred years ago, it has gone on to be the... **4 Crazy Long Contracts In Soccer** 📝 | Agreement with @slbenfica_en over the transfer of @JoaoFelix70. 🇵🇹 The Portuguese forward has signed a seven-year... **Footer** Legal Disclaimer Privacy Policy Disclaimer Link to TwitterLink to Twitter Link to FacebookLink to Facebook Link to InstagramLink to Instagram Link to RSSLink to RSS www.SportsPickle.com is a sports fan web site and is in no way affiliated with any professional sports team, league, or its Properties. This site is for informational and entertainment purposes only.Copyright © 2020 www.SportsPickle.com - All Rights Reserved - Trademarks used herein are property of their respective owners."}