{"id": 1047, "name": "Neue Zürcher Zeitung (NZZ)", "domain": "nzz.ch", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://bellevue.nzz.ch/stil-design/mode/kultige-tasche-original-birkin-bag-von-hermes-wird-sie-zum-rekordpreis-versteigert-ld.1888199", "title": "Kultige Tasche Original Birkin Bag Von Hermes Wird Sie Zum Rekordpreis Versteigert Ld.1888199", "content": "Home Stil & Design Kochen & Geniessen Beauty & Wellness Reisen & Entdecken Rezepte Experten Boutique Stil & Design **Stil & Design** **Stil & Design** Kochen & Geniessen Beauty & Wellness Reisen & Entdecken Rezepte Experten Boutique **Der Prototyp der Birkin Bag von Hermès wird versteigert – und weckt viele Erinnerungen** **Ramponiert, aber mit einzigartiger Geschichte: die Original-Birkin-Bag, die Hermès 1984 für Jane Birkin anfertigte.** Einzigartig an dieser Tasche sind nicht nur die Details, sondern auch ihre Geschichte. Wer an der Auktion der Original-Birkin-Bag mitbieten wird, darüber wird im Vorfeld bereits fleissig spekuliert. Und auf einmal ist eine ramponierte, schwarze Ledertasche in aller Munde. Was es mit ihr auf sich hat? Sie ist der erste Wurf jener Handtasche, die heute als eines der am meisten kopierten Luxusprodukte weltberühmt ist: der Birkin Bag von Hermès, benannt nach der britischen Schauspielerin und Sängerin Jane Birkin (1946–2023). Einem einfachen Weidenkorb und einer Zufallsbegegnung sei Dank, dass das für Jane Birkin vor vierzig Jahren gefertigte Modell nun hohe Wellen schlägt:Im Jahr 1984 trug die Schauspielerin und Sängerin noch einen grossen Weidenkorb mit sich, den sie in den späten 1960er Jahren in Portugal gekauft hatte – einfach, weil sie damalige Handtaschen zu klein fand. Als sie mit ihrer kleinen Tochter Charlotte in ein Flugzeug von Paris nach London stieg, fiel der Korbinhalt versehentlich auf Jean-Louis Dumas, den damaligen CEO von Hermès. Es folgte eine Diskussion über die Anforderungen an eine ideale Handtasche für Birkin. Dumas schenkte den Bedürfnissen des Stars ein offenes Ohr und liess daraufhin eine praktische, geräumige Handtasche anfertigen, die auf den geschäftigen Lebensstil der Schauspielerin und Sängerin zugeschnitten war. **Der innere Reissverschluss der Original-Birkin stammt noch von der Firma Éclair, anders als bei den Nachfolgemodellen mit Riri-Reissverschlüssen.** Einzigartig sind bei dieser Tasche nicht nur die Proportionen, sondern auch die Beschläge: Die Standfüsschen sind kleiner als jene, die Hermès später für die Birkin-Taschen verwendete. Und sie ist die einzige Birkin Bag mit einem nicht abnehmbaren Schulterriemen. **Die dünnen «Pontet»-Klammern befestigen die Riemen auf der Klappe und sind bei der Original-Birkin geschlossene Metallringe, während spätere Modelle offene Ringe aufweisen.** Das wohl für Jane Birkin typischste Detail: Ein Nagelknipser hängt an einer Kette am unteren Ende des Schulterriemens in ihrer Tasche – für ihren bekanntlich schnörkellosen Stil mit kurzen Fingernägeln. **Wird die Birkin Bag einen Rekordpreis erzielen?** Nun kommt der Prototyp als «the original Hermès Birkin Bag»bei Sotheby’s unter den Hammer. Ein Schätzpreis wird für diesen nicht angegeben. Eine vergleichbare Birkin Bag kostet je nach Lederart wohl ab etwa 10 000 Euro. Einen weit höheren Preis könnte die Original-Birkin erzielen. Dank ihrer Bedeutung als Ursprungsmodell einer Handtaschenikone – und dank ihrer prominenten Namensgeberin und Trägerin – hat dieses Modell gar das Potenzial, als teuerste Handtasche, die jemals auf einer Auktion verkauft wurde, in die Geschichte einzugehen. **** **In den 1990er Jahren wie auch in den 2010er Jahren: Jane Birkin trug ihre Hermès-Taschen stets prall gefüllt und in einer festen Umarmung.** Und das, obwohl sie sichtbare Gebrauchsspuren aufweist. Nebst der ausgebeulten Form sind auch Abnutzungsspuren an den Rändern zu sehen sowie Rückstände von runden Aufklebern, mit denen Jane Birkin ihre Luxushandtasche verschönerte. Im Laufe ihrer Beziehung zu Hermès bekam Jane Birkin übrigens fünf Birkin-Taschen geschenkt – das Ursprungsmodell und vier weitere –; und wann immer sie nach ihrer Birkin gefragt wurde, stellte sie sicher, dass sie angab, ob es sich um das Original handelte oder nicht. **Die Original-Birkin (rechts) weist die Breite und die Höhe einer «Birkin 35» und die Tiefe einer «Birkin 40» auf.** Jane Birkin bewahrte ihr Originalmodell fast zehn Jahre lang auf, bevor sie es am 5. Oktober 1994 bei einer Wohltätigkeitsauktion zugunsten einer führenden Aids-Hilfsorganisation in Frankreich versteigern liess. Anschliessend wurde es am 12. Mai 2000 bei Poulain-Le Fur versteigert und befindet sich seitdem in Privatbesitz. **Wird Kim Kardashian mitbieten? Oder Hermès selbst?** Wer in diese Tasche investiert, weiss um deren kulturellen Wert. Spekulationen, wer wohl unter den Höchstbietenden sein könnte, kursieren bereits: Kim Kardashian, die sich gerne mit geschichtsträchtigen Gegenständen umgibt, könnte mitbieten. **Die Original-Birkin ist die einzige Birkin Bag mit einem nicht abnehmbaren Schulterriemen.** Sie besitzt bereits Prinzessin Dianas Amethyst-Kreuzanhänger und persönliche Gegenstände von Michael Jackson oder schlüpfte in ein legendäres Kleid von Marilyn Monroe für die Met-Gala 2022. Gut möglich auch, dass die Marke Hermès selbst bei der Auktion mitbieten wird. «Heritage» – das Kulturerbe einer Marke – ist mittlerweile ein wichtiges Marketing-Tool: Bedeutende Archivstücke dienen nicht nur den Designteams als Inspiration, sondern auch als Anschauungsbeispiele, um die Kundschaft weiterzubilden und den langfristigen Wert zu stärken. Mit Leihgaben an Museen für Ausstellungen wird etwa auch das kulturelle Kapital erhöht und für Schlagzeilen gesorgt. Mit dem Rückkauf der ersten Birkin würde sich Hermès ein Stück der eigenen Mythologie zurückholen. **Ein Nagelknipser hing an einer Kette am unteren Ende des Schulterriemens in Jane Birkins Tasche, damit sie ihn leicht erreichen und regelmässig benutzen konnte.** Die Tasche ist längst zu einem Symbol für unaufdringlichen Luxus geworden. Das beweist das hohe Besucherinteresse, wann immer die originale Birkin besichtigt werden kann: Bereits im vergangenen Herbst stellte Sotheby’s das Modell in Paris aus, dann Anfang des Jahres in Hongkong. Noch bis am 12. Juni wird die Tasche in New York gezeigt, dann kommt sie zurück nach Paris, wo sie bei Sotheby’s in der Rue du Faubourg St-Honoré vom 3. bis 9. Juli öffentlich zu sehen sein wird. Gebote können bereits ab 26. Juni im Rahmen der «Fashion Icons»-Auktion abgegeben werden. Die Auktion läuft bis am 10. Juli – standesgemäss für diese Modeikone – dem letzten Tag der Haute-Couture-Woche. **Wir gratulierenDie begehrte Hermès Birkin Bag wird 40** **Wir gratulierenDie begehrte Hermès Birkin Bag wird 40** **NachrufZum Tod von Jane Birkin: Sie prägte den nonchalanten Stil wie keine andere** **NachrufZum Tod von Jane Birkin: Sie prägte den nonchalanten Stil wie keine andere** **Newsletter** Die besten Artikel aus «NZZ Bellevue», einmal pro Woche von der Redaktion für Sie zusammengestellt. **Meistgelesen** Schweizer KlassikerSimpel, aber nicht banal: So gelingt der perfekte KartoffelsalatVon Richard Kägi **Schweizer KlassikerSimpel, aber nicht banal: So gelingt der perfekte Kartoffelsalat** **Schweizer KlassikerSimpel, aber nicht banal: So gelingt der perfekte Kartoffelsalat** **Schweizer KlassikerSimpel, aber nicht banal: So gelingt der perfekte Kartoffelsalat** SommerinselnDiese Inseln im Mittelmeer sind weder zu gross noch zu überlaufenVon Claus Schweitzer **SommerinselnDiese Inseln im Mittelmeer sind weder zu gross noch zu überlaufen** **SommerinselnDiese Inseln im Mittelmeer sind weder zu gross noch zu überlaufen** **SommerinselnDiese Inseln im Mittelmeer sind weder zu gross noch zu überlaufen** Mit diesen fünf Weinen kann der Sommer kommenmit Peter Keller **Mit diesen fünf Weinen kann der Sommer kommen** **Mit diesen fünf Weinen kann der Sommer kommen** **Mit diesen fünf Weinen kann der Sommer kommen** HomestoryWenn die Kinder ausziehen: Eine Innenarchitektin verlieh dieser Dachterrassenwohnung am Zürichsee neuen GlanzVon Claudia Durian **HomestoryWenn die Kinder ausziehen: Eine Innenarchitektin verlieh dieser Dachterrassenwohnung am Zürichsee neuen Glanz** **HomestoryWenn die Kinder ausziehen: Eine Innenarchitektin verlieh dieser Dachterrassenwohnung am Zürichsee neuen Glanz** **HomestoryWenn die Kinder ausziehen: Eine Innenarchitektin verlieh dieser Dachterrassenwohnung am Zürichsee neuen Glanz** AufgefallenÄltere Models: Zeitenwende oder Modeerscheinung?Von Malena Ruder **AufgefallenÄltere Models: Zeitenwende oder Modeerscheinung?** **AufgefallenÄltere Models: Zeitenwende oder Modeerscheinung?** **AufgefallenÄltere Models: Zeitenwende oder Modeerscheinung?** Tipps der RedaktionWer in Zürich Ruhe sucht, findet sie noch: Unsere liebsten RückzugsorteVon Redaktion NZZ Bellevue **Tipps der RedaktionWer in Zürich Ruhe sucht, findet sie noch: Unsere liebsten Rückzugsorte** **Tipps der RedaktionWer in Zürich Ruhe sucht, findet sie noch: Unsere liebsten Rückzugsorte** **Tipps der RedaktionWer in Zürich Ruhe sucht, findet sie noch: Unsere liebsten Rückzugsorte** **Mehr zum Thema Handtaschen** **Mehr zum Thema Handtaschen** **Mehr zum Thema Handtaschen** **EmpfehlungenRobust, geräumig und schön anzusehen: die besten Bürotaschen für jeden Tag** **EmpfehlungenRobust, geräumig und schön anzusehen: die besten Bürotaschen für jeden Tag** **HintergrundVon Pferden und Foulards: Wie Hermès zum erfolgreichsten Luxusunternehmen der Welt wurde** **HintergrundVon Pferden und Foulards: Wie Hermès zum erfolgreichsten Luxusunternehmen der Welt wurde** **Stella McCartneys klassikerWohin man schaut, sieht man eine «Falabella». Ist das ein Comeback, oder war die Tasche nie weg?** **Stella McCartneys klassikerWohin man schaut, sieht man eine «Falabella». Ist das ein Comeback, oder war die Tasche nie weg?** **Model-showWo Augen lächeln und Handtaschen leben: Heidi Klum feiert die 20. Staffel von «GNTM»** **Model-showWo Augen lächeln und Handtaschen leben: Heidi Klum feiert die 20. Staffel von «GNTM»** **TaschentrendEast-West-Bags: Die neuen Taschen der Saison strecken sich ganz lang** **TaschentrendEast-West-Bags: Die neuen Taschen der Saison strecken sich ganz lang** Handtaschen Hermès **Mehr von Kim Dang** **Mehr von Kim Dang** **Mehr von Kim Dang** **Mode-NewsMaria Grazia Chiuri tritt als Kreativdirektorin bei Dior zurück – was machte ihr Schaffen dort aus?** **Mode-NewsMaria Grazia Chiuri tritt als Kreativdirektorin bei Dior zurück – was machte ihr Schaffen dort aus?** **Herrenmode15 Anbieter, die Massanzüge fertigen** **Herrenmode15 Anbieter, die Massanzüge fertigen** **LokaltippRestaurant Gallo in Genf: Mediterran inspirierte Bistroküche zu angemessenen Preisen** **LokaltippRestaurant Gallo in Genf: Mediterran inspirierte Bistroküche zu angemessenen Preisen** Newsletter abonnieren Häufige Fragen Impressum NZZ Abonnemente Themen Boutique Kontakt AGB und Datenschutz Werbung Sponsored Content Copyright © Neue Zürcher Zeitung AG. Alle Rechte vorbehalten. Eine Weiterverarbeitung, Wiederveröffentlichung oder dauerhafte Speicherung zu gewerblichen oder anderen Zwecken ohne vorherige ausdrückliche Erlaubnis von Neue Zürcher Zeitung ist nicht gestattet."}