{"id": 481, "name": "Freedom Alliance", "domain": "freedomalliance.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://freedomalliance.org/u-s-marine-corps-veteran-jeremy-lipker-honored-with-mortgage-free-home/", "title": "U S Marine Corps Veteran Jeremy Lipker Honored With Mortgage Free Home", "content": "Military Support ProgramsScholarship FundPresents For PatriotsGifts from Home Care PackagesCustomized WheelchairsHeroes to HomeownersDriven to ServeHome Repair Program (R.A.M.P.)Rehabilitation & Recovery Fund Scholarship Fund Presents For Patriots Gifts from Home Care Packages Customized Wheelchairs Heroes to Homeowners Driven to Serve Home Repair Program (R.A.M.P.) Rehabilitation & Recovery Fund Scholarship Fund Presents For Patriots Gifts from Home Care Packages Customized Wheelchairs Heroes to Homeowners Driven to Serve Home Repair Program (R.A.M.P.) Rehabilitation & Recovery Fund Adventures & ExperiencesOutdoor AdventuresOffshore ExperienceWar Heroes on WaterCouples RetreatsCaregiver RetreatsDefender of FreedomArmy-Navy Weekend Outdoor Adventures Offshore Experience War Heroes on Water Couples Retreats Caregiver Retreats Defender of Freedom Army-Navy Weekend Outdoor Adventures Offshore Experience War Heroes on Water Couples Retreats Caregiver Retreats Defender of Freedom Army-Navy Weekend Get InvolvedDonateHost A FundraiserNotes of AppreciationE-Mail Sign Up Donate Host A Fundraiser Notes of Appreciation E-Mail Sign Up Donate Host A Fundraiser Notes of Appreciation E-Mail Sign Up NewsPress ReleasesArticles & CommentaryBlog Press Releases Articles & Commentary Blog Press Releases Articles & Commentary Blog About UsWho We AreWho We ServeFrequently Asked QuestionsTransparencyContact Us Who We Are Who We Serve Frequently Asked Questions Transparency Contact Us Who We Are Who We Serve Frequently Asked Questions Transparency Contact Us Donate **U.S. Marine Corps Veteran Jeremy Lipker Honored with Mortgage-Free Home** Posted byJanet Shillingburg OnNovember 15, 2024 InBlog,Support Our Troops Share In a heartfelt recognition of his heroic service, U.S. Bank and Freedom Alliance proudly presented U.S. Marine Corps Corporal Jeremy Lipker with a mortgage-free home, providing vital support as he continues his rehabilitation from the physical and mental wounds of war. This transformative gift is part of U.S. Bankâ\u0080\u0099s Housing Opportunities after Military Engagement (H.O.M.E.) program, in partnership with Freedom Allianceâ\u0080\u0099s Heroes to Homeowners initiative. Jeremy, a Dayton, Ohio native, joined the Marine Corps in 2004 at the age of 22, inspired by the service of his grandfathers and a desire to make a difference post-9/11. After completing boot camp at Parris Island, he was stationed at Camp Lejeune, North Carolina, and deployed to Iraq in 2005. There, he faced constant danger, including exposure to IEDs and large explosions. During one particularly harrowing incident, an IED detonation knocked him unconscious, and later, a massive blast left his entire platoon combat ineffective. Despite these dangers, Jeremyâ\u0080\u0099s courage and resilience carried him through to his second deployment in Afghanistan with Marine Special Operations Command. However, the toll of combat left deep physical and emotional scars. Jeremy suffers from a Traumatic Brain Injury (TBI), Post-Traumatic Stress (PTS), and injuries to his neck, back, and shoulders. Since his return from active duty, Jeremy and his wife, Christina, have faced challenges adjusting to civilian life. They currently live in a small home with Christinaâ\u0080\u0099s mother, but this new mortgage-free home will provide them with the space and stability they need as Jeremy continues his recovery. Jeremy now works at the National Archives in Dayton, Ohio, and he and Christina are deeply grateful for the life-changing gift from U.S. Bank, Freedom Alliance, and Fischer Homes. Tom Kilgannon, President of Freedom Alliance, emphasized the significance of the gift, saying, “Jeremy bravely served our nation in battle, making significant sacrifices. Like many combat veterans, he faces ongoing challenges from physical and emotional wounds. This home will be a vital resource as he focuses on his recovery.” This home is the 22nd military family to receive a home through the Freedom Alliance and U.S. Bank partnership, with more than $7 million worth of homes donated since 2013. U.S. Bank, through its Proud to Serve initiative, continues to support veterans and military families, helping them transition to civilian life with resources and recognition for their service. Jeremy and Christina are excited to start fresh in their new home and look forward to a brighter future. As Jeremy expressed, â\u0080\u009cWe feel blessed and incredibly thankful for this gift, which will provide a new beginning for our family.â\u0080\u009d **Help us continue to make a difference in the lives of our veterans and their families bymaking an online donation, today.** **Related Posts** **Gold Star Students receive payment-free cars to recognize Military Appreciation Month** **From Fish Tales to Healing Trails** **Introducing Megan Kelley: 2025 Freedom Alliance Scholarship Ambassador** **A Memorable Presentation at the Alamo** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Scholarship Fund Presents For Patriots Student Outreach Gifts from Home Care Packages Customized Wheelchairs Heroes to Homeowners Driven to Serve Home Repair Program (R.A.M.P.) Rehabilitation & Recovery Fund 25 West Piccadilly StWinchester, VA 22601 P: 703.444.7940 Toll Free: 800.475.6620 E:[email protected] Military Support ProgramsScholarship FundPresents For PatriotsGifts from Home Care PackagesCustomized WheelchairsHeroes to HomeownersDriven to ServeHome Repair Program (R.A.M.P.)Rehabilitation & Recovery Fund Scholarship Fund Presents For Patriots Gifts from Home Care Packages Customized Wheelchairs Heroes to Homeowners Driven to Serve Home Repair Program (R.A.M.P.) Rehabilitation & Recovery Fund Scholarship Fund Presents For Patriots Gifts from Home Care Packages Customized Wheelchairs Heroes to Homeowners Driven to Serve Home Repair Program (R.A.M.P.) Rehabilitation & Recovery Fund Adventures & ExperiencesOutdoor AdventuresOffshore ExperienceWar Heroes on WaterCouples RetreatsCaregiver RetreatsDefender of FreedomArmy-Navy Weekend Outdoor Adventures Offshore Experience War Heroes on Water Couples Retreats Caregiver Retreats Defender of Freedom Army-Navy Weekend Outdoor Adventures Offshore Experience War Heroes on Water Couples Retreats Caregiver Retreats Defender of Freedom Army-Navy Weekend Get InvolvedDonateHost A FundraiserNotes of AppreciationE-Mail Sign Up Donate Host A Fundraiser Notes of Appreciation E-Mail Sign Up Donate Host A Fundraiser Notes of Appreciation E-Mail Sign Up NewsPress ReleasesArticles & CommentaryBlog Press Releases Articles & Commentary Blog Press Releases Articles & Commentary Blog About UsWho We AreWho We ServeFrequently Asked QuestionsTransparencyContact Us Who We Are Who We Serve Frequently Asked Questions Transparency Contact Us Who We Are Who We Serve Frequently Asked Questions Transparency Contact Us Donate"}