{"id": 2227, "name": "Takoma Torch", "domain": "takomatorch.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://takomatorch.com/index.php/2025/04/11/administrative-error-sends-moco-housing-permit-applications-to-salvadoran-prison-elrich-helpless-to-get-them-back/", "title": "Administrative Error Sends Moco Housing Permit Applications To Salvadoran Prison Elrich Helpless To Get Them Back", "content": "The Takoma Torch Home Nimbee Takoma Man Merch About Us Reviews **‘Administrative Error’ Sends MoCo Housing Permit Applications to Salvadoran Prison, Elrich ‘Helpless’ To Get Them Back** ROCKVILLE, MD – Montgomery County Executive Marc Elrich says he is “totally powerless” after hundreds of long-awaited housing permit applications were mistakenly rerouted to a maximum-security Salvadoran prison in what county officials are calling an “administrative error.” The permits, which included applications for gentle-density housing like duplexes, triplexes, and one very brave quadplex, were last seen being scanned and uploaded by a permitting office intern who accidentally selected “CECOT” (Terrorism Confinement Center) from a dropdown menu intended for “Department of Permitting Services.” “I was just following instructions from my supervisor,” said the permit technician, who is now on admistrative leave. “I was told to put the plans in the ‘extra long review process,’ so naturally I sent them to life in prison.” Within hours, the Salvadoran prison – notorious for housing violent criminals, political prisoners, and at least two for-profit developers – confirmed it had received the documents. By morning, architectural designs of ADUS were seen tattooed on the backs of inmates. Marc Elrich, who has long opposed increasing housing density in Montgomery County, expressed sorrow over the mix-up while also appearing remarkably chill about the overall outcome. “Yes, it’s unfortunate that the permits are now integrated into a prison gang economy,” said Elrich, “but we have to accept that these things happen. My hands are tied. And not just figuratively – these applications are now technically members of MS-13.” Asked why his office had not made an effort to retrieve the lost permits, Elrich sighed deeply. “Look, once an R-60 zoning variance gets a neck tattoo and joins a gang called ‘YIMBYs,’ it’s pretty much a wrap.” Back in the prison, one high-ranking inmate with a full-sleeve tattoo of the Takoma Metro Development said he now controls most of the affordable housing stock from inside his cell. “We run this market now,” he said. “Tell Marc Elrich if he wants these permits back, he’ll have to upzone.” **Share this story** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr Click to share on LinkedIn (Opens in new window)LinkedIn **Discover more from The Takoma Torch** Subscribe to get the latest posts sent to your email. Type your email… Subscribe **Related Articles** **Post navigation** **Help keep the Takoma Torch ad-free!** **Get FREE stocks!!** **Denchfield, LLC – General Contractor Serving MD VA DC since 1985** All written material on this site is the intellectual property of the Takoma Torch, and is only intended for people with a sense of humor. If you would like to submit a funny headline, please email it to takomatorch@gmail.com. If you have any complaints, please email dcra@dc.gov"}