{"id": 2147, "name": "The New American", "domain": "thenewamerican.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://thenewamerican.com/us/crime/illegal-charged-in-l-a-riot-bomb-attack-on-law-enforcement-more-than-100-illegal-alien-convicted-criminals-arrested/", "title": "Illegal Charged In L A Riot Bomb Attack On Law Enforcement More Than 100 Illegal Alien Convicted Criminals Arrested", "content": "Subscribe Shop Donate Account Login Insider Report Freedom Index Podcasts Digital Issues Conversations that Matter In The Spotlight Behind the Deep State Unrestricted Advertise Contact Contributors Staff Education Healthcare Crime Immigration Environment Oklahoma City Bombing Election Chaos Congress Constitution Foreign Policy Economy Markets Sectors Computers Energy Space Commentary Economic Commentary Book Reviews Movie Reviews American Principles Biography Faith and Morals Family History North America China Africa Asia Europe Middle East Australia/Pacific South America United Nations Insider Report Freedom Index Podcasts Digital Issues VideoConversations that MatterIn The SpotlightBehind the Deep StateUnrestricted Conversations that Matter In The Spotlight Behind the Deep State Unrestricted Conversations that Matter In The Spotlight Behind the Deep State Unrestricted About TNAAdvertiseContactContributorsStaff Advertise Contact Contributors Staff Advertise Contact Contributors Staff United StatesEducationHealthcareCrimeImmigrationEnvironmentOklahoma City Bombing Education Healthcare Crime Immigration Environment Oklahoma City Bombing Education Healthcare Crime Immigration Environment Oklahoma City Bombing PoliticsElection ChaosCongressConstitutionForeign Policy Election Chaos Congress Constitution Foreign Policy Election Chaos Congress Constitution Foreign Policy EconomicsEconomyMarketsSectors Economy Markets Sectors Economy Markets Sectors Science & TechnologyComputersEnergySpace Computers Energy Space Computers Energy Space OpinionCommentaryEconomic CommentaryBook ReviewsMovie ReviewsAmerican Principles Commentary Economic Commentary Book Reviews Movie Reviews American Principles Commentary Economic Commentary Book Reviews Movie Reviews American Principles CultureBiographyFaith and MoralsFamilyHistory Biography Faith and Morals Family History Biography Faith and Morals Family History World NewsNorth AmericaChinaAfricaAsiaEuropeMiddle EastAustralia/PacificSouth AmericaUnited Nations North America China Africa Asia Europe Middle East Australia/Pacific South America United Nations North America China Africa Asia Europe Middle East Australia/Pacific South America United Nations Copyright 2025 The New American Searching... Magazine Freedom Index Insider Report Video OKC Bombing Info Get Daily Headlines **Illegal Charged in L.A. Riot Bomb Attack on Law Enforcement; More Than 100 Illegal-alien Convicted Criminals Arrested** The Department of Homeland Security (DHS) has released more information about the rapists, murderers, and other illegal-alien thugs and goons arrested during anti-immigration enforcement riots Los Angeles.Included in the latest are the usual child molesters and drug dealers, along with the previously deported illegal alien who tossed a Molotov cocktail at law enforcement during the riot on June 7.DHS also leveled far-left Democratic California Governor Gavin Newsom and others for attempting to claim the riots are merely peaceful protests.And White House spokesman Karoline Leavitt reported that more than 300 illegals — more than 100 of whom are convicted criminals — have been arrested for rioting.On June 9, 2025, ICE agents in Los Angeles arrested Emiliano Garduno-Galvez—an illegal alien from Mexico—for attempted murder after he threw a Molotov cocktail at law enforcement during the Los Angeles riots.Garduno-Galvez had previously been deported. He has a previous…pic.twitter.com/kT4ZszQBSx— Homeland Security (@DHSgov)June 11, 2025Bomb ThrowersPerhaps the most significant arrests are those of illegal alien Emiliano Garduno Galvez, 23, and Wrackkie Quiogue, 27, who face 10 years for possession of an unregistered destructive device.On June 7, thefederal criminal complaint says, “Galvez lit and threw a Molotov cocktail over a wall where Los Angeles County Sheriff’s Department (LASD) deputies were engaging in crowd control activities then ran away.”On June 8, “Quiogue possessed a Molotov cocktail while holding a lighter during civil unrest near federal buildings in downtown Los Angeles’s Civic Center.”The criminal complaint says:Los Angeles Police Department officers saw Quiogue with the device and quickly arrested him. As Quiogue attempted to flee arrest, he threw the Molotov.Two other defendants are Christian Andres Garcia, 32, and Rene Luna, 43.“On June 9, Garcia threw objects at law enforcement personnel stationed outside a Homeland Security Investigations (HSI) office in Santa Ana,” thecomplaint alleges. “Luna allegedly threw water bottles and beer cans at officers during the same protest. Both defendants were arrested.”DHS reportedthat the previously deported Galvez, whose criminal record includes grand theft and drunk driving, has been charged with attempted murder.Other Thugs and Goons, All IllegalsOther illegals arrested in Los Angeles include the following cultural enrichers,DHS reported, here “to do the jobs Americans won’t do,” as the open-borders mantra says. Five are Mexicans:Previously deported Gerardo Antonio-Palacios, age undisclosed, homicide, burglary;Antonio Benitez-Ugarte, age undisclosed, drug trafficking;Alberto Morales-Mejia, age undisclosed, manufacturing amphetamine, previous arrests for fraud and possessing a weapon;Jesus Romero-Retana, 52, threatening crime with intent to terrorize and battery; andRaul Teran-Guillen, age undisclosed, arrests for human smuggling and money laundering.ICE Los Angeles arrested Jesus Romero-Retana, a 52-year-old illegal alien from Mexico and a criminal history including convictions for threatening crime with intent to terrorize and battery.pic.twitter.com/E0y5cWC1DU— Homeland Security (@DHSgov)June 11, 2025Two are Hondurans:Carlos Alberto Escobar-Flores, 43, grand theft; andJose Jimenez-Alvarado,48, theft.And two are Asians:Cambodian Mab Khleb, 53, child molester, battery, transporting and possessing controlled substances; andLaotian Sang Louangprasert, 66, child molester, domestic abuser.“Murderers, pedophiles, and drug traffickers,”McLaughlin said:These are the types of criminal illegal aliens that rioters are fighting to protect. How much longer will Governor Newsom and Mayor Karen Bass continue to prioritize these criminal illegal aliens over their own citizens?.@KimKardashian, which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the county?These are just a few of the convicted illegal criminals who have been picked up in the last 72 hours.https://t.co/bauJUKbulkpic.twitter.com/VAtpNwHmeD— Tricia McLaughlin (@TriciaOhio)June 11, 2025Answering the Big Lie“When we witness innocent, hardworking people being ripped from their families in inhumane ways, we have to speak up,” washed-up, worn-out celebrity Kim Kardashian wrote on X. “We have to do what’s right.”Asked McLaughlin over photos of those arrested, “Which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the [country]?”While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth.pic.twitter.com/yDJHSVaAo3— Homeland Security (@DHSgov)June 10, 2025DHS also answered those officials, such as Newsom and Bass, who claim the rioting in Los Angeles is “peaceful” or President Trump’s fault.“While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth,”McLaughlin wroteover photos and links to video on X of the rioting:Rioters are throwing rocks and Molotov cocktails at law enforcement, defacing public property, setting cars on fire, looting family businesses, assaulting law enforcement, and burning American flags. The violent targeting of law enforcement in Los Angeles by lawless rioters is despicable and California politicians must call for it to end.BREAKING: 330 illegal aliens were arrested for taking part in the LA riots.113 of them have prior criminal convictions.DEPORT DEORT DEPORTpic.twitter.com/ecRbSfyc6B— Libs of TikTok (@libsoftiktok)June 11, 2025Leavitt said at a White House presser:Since June 6th, there have been 330 illegal aliens that have been arrested as part of these riots in Los Angeles.113 of those illegal aliens had prior criminal convictions. … Overall — and this includes the arrest of American citizens — there’s been 157 people arrested for assault and obstruction-related charges, including the attempted murder of a police officer with a Molotov cocktail.So, who is funding these illegal aliens who are coming in with this very professional riot gear? It’s a question everyone in this room who cares about truth should be asking. And we encourage your help in trying to get to the bottom of that question.AsThe New Americanreportedyesterday, Fox 11 in the city reported that rioters were receiving tactical gear, including Bionic face masks, for battling police and federal agents.“We just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed,” anchorman Elex Michaelson reported.Like Leavitt, Michaelson asked who is providing the gear.#BREAKINGWe just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed.It certainly seems like gear you'd wear if you're preparing for conflict with police.Who is funding this?pic.twitter.com/2hZphafOsi— Elex Michaelson (@Elex_Michaelson)June 10, 2025The riots beganwhen so-called protesters interfered with the arrest of 40 illegals after federal agents served three criminal warrants in a case involving money laundering, tax evasion, and customs fraud. Included in the latest are the usual child molesters and drug dealers, along with the previously deported illegal alien who tossed a Molotov cocktail at law enforcement during the riot on June 7. DHS also leveled far-left Democratic California Governor Gavin Newsom and others for attempting to claim the riots are merely peaceful protests. And White House spokesman Karoline Leavitt reported that more than 300 illegals — more than 100 of whom are convicted criminals — have been arrested for rioting. On June 9, 2025, ICE agents in Los Angeles arrested Emiliano Garduno-Galvez—an illegal alien from Mexico—for attempted murder after he threw a Molotov cocktail at law enforcement during the Los Angeles riots.Garduno-Galvez had previously been deported. He has a previous…pic.twitter.com/kT4ZszQBSx **Bomb Throwers** Perhaps the most significant arrests are those of illegal alien Emiliano Garduno Galvez, 23, and Wrackkie Quiogue, 27, who face 10 years for possession of an unregistered destructive device. On June 7, thefederal criminal complaint says, “Galvez lit and threw a Molotov cocktail over a wall where Los Angeles County Sheriff’s Department (LASD) deputies were engaging in crowd control activities then ran away.” On June 8, “Quiogue possessed a Molotov cocktail while holding a lighter during civil unrest near federal buildings in downtown Los Angeles’s Civic Center.”The criminal complaint says: Los Angeles Police Department officers saw Quiogue with the device and quickly arrested him. As Quiogue attempted to flee arrest, he threw the Molotov. Two other defendants are Christian Andres Garcia, 32, and Rene Luna, 43. “On June 9, Garcia threw objects at law enforcement personnel stationed outside a Homeland Security Investigations (HSI) office in Santa Ana,” thecomplaint alleges. “Luna allegedly threw water bottles and beer cans at officers during the same protest. Both defendants were arrested.” DHS reportedthat the previously deported Galvez, whose criminal record includes grand theft and drunk driving, has been charged with attempted murder. **Other Thugs and Goons, All Illegals** Other illegals arrested in Los Angeles include the following cultural enrichers,DHS reported, here “to do the jobs Americans won’t do,” as the open-borders mantra says. Five are Mexicans: Previously deported Gerardo Antonio-Palacios, age undisclosed, homicide, burglary; Antonio Benitez-Ugarte, age undisclosed, drug trafficking; Alberto Morales-Mejia, age undisclosed, manufacturing amphetamine, previous arrests for fraud and possessing a weapon; Jesus Romero-Retana, 52, threatening crime with intent to terrorize and battery; and Raul Teran-Guillen, age undisclosed, arrests for human smuggling and money laundering. ICE Los Angeles arrested Jesus Romero-Retana, a 52-year-old illegal alien from Mexico and a criminal history including convictions for threatening crime with intent to terrorize and battery.pic.twitter.com/E0y5cWC1DU Two are Hondurans: Carlos Alberto Escobar-Flores, 43, grand theft; and Jose Jimenez-Alvarado,48, theft. And two are Asians: Cambodian Mab Khleb, 53, child molester, battery, transporting and possessing controlled substances; and Laotian Sang Louangprasert, 66, child molester, domestic abuser. “Murderers, pedophiles, and drug traffickers,”McLaughlin said: These are the types of criminal illegal aliens that rioters are fighting to protect. How much longer will Governor Newsom and Mayor Karen Bass continue to prioritize these criminal illegal aliens over their own citizens? .@KimKardashian, which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the county?These are just a few of the convicted illegal criminals who have been picked up in the last 72 hours.https://t.co/bauJUKbulkpic.twitter.com/VAtpNwHmeD **Answering the Big Lie** “When we witness innocent, hardworking people being ripped from their families in inhumane ways, we have to speak up,” washed-up, worn-out celebrity Kim Kardashian wrote on X. “We have to do what’s right.” Asked McLaughlin over photos of those arrested, “Which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the [country]?” While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth.pic.twitter.com/yDJHSVaAo3 DHS also answered those officials, such as Newsom and Bass, who claim the rioting in Los Angeles is “peaceful” or President Trump’s fault. “While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth,”McLaughlin wroteover photos and links to video on X of the rioting: Rioters are throwing rocks and Molotov cocktails at law enforcement, defacing public property, setting cars on fire, looting family businesses, assaulting law enforcement, and burning American flags. The violent targeting of law enforcement in Los Angeles by lawless rioters is despicable and California politicians must call for it to end. BREAKING: 330 illegal aliens were arrested for taking part in the LA riots.113 of them have prior criminal convictions.DEPORT DEORT DEPORTpic.twitter.com/ecRbSfyc6B Leavitt said at a White House presser: Since June 6th, there have been 330 illegal aliens that have been arrested as part of these riots in Los Angeles. 113 of those illegal aliens had prior criminal convictions. … Overall — and this includes the arrest of American citizens — there’s been 157 people arrested for assault and obstruction-related charges, including the attempted murder of a police officer with a Molotov cocktail. So, who is funding these illegal aliens who are coming in with this very professional riot gear? It’s a question everyone in this room who cares about truth should be asking. And we encourage your help in trying to get to the bottom of that question. AsThe New Americanreportedyesterday, Fox 11 in the city reported that rioters were receiving tactical gear, including Bionic face masks, for battling police and federal agents. “We just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed,” anchorman Elex Michaelson reported. Like Leavitt, Michaelson asked who is providing the gear. #BREAKINGWe just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed.It certainly seems like gear you'd wear if you're preparing for conflict with police.Who is funding this?pic.twitter.com/2hZphafOsi The riots beganwhen so-called protesters interfered with the arrest of 40 illegals after federal agents served three criminal warrants in a case involving money laundering, tax evasion, and customs fraud. Included in the latest are the usual child molesters and drug dealers, along with the previously deported illegal alien who tossed a Molotov cocktail at law enforcement during the riot on June 7. DHS also leveled far-left Democratic California Governor Gavin Newsom and others for attempting to claim the riots are merely peaceful protests. And White House spokesman Karoline Leavitt reported that more than 300 illegals — more than 100 of whom are convicted criminals — have been arrested for rioting. On June 9, 2025, ICE agents in Los Angeles arrested Emiliano Garduno-Galvez—an illegal alien from Mexico—for attempted murder after he threw a Molotov cocktail at law enforcement during the Los Angeles riots.Garduno-Galvez had previously been deported. He has a previous…pic.twitter.com/kT4ZszQBSx **Bomb Throwers** Perhaps the most significant arrests are those of illegal alien Emiliano Garduno Galvez, 23, and Wrackkie Quiogue, 27, who face 10 years for possession of an unregistered destructive device. On June 7, thefederal criminal complaint says, “Galvez lit and threw a Molotov cocktail over a wall where Los Angeles County Sheriff’s Department (LASD) deputies were engaging in crowd control activities then ran away.” On June 8, “Quiogue possessed a Molotov cocktail while holding a lighter during civil unrest near federal buildings in downtown Los Angeles’s Civic Center.”The criminal complaint says: Los Angeles Police Department officers saw Quiogue with the device and quickly arrested him. As Quiogue attempted to flee arrest, he threw the Molotov. Two other defendants are Christian Andres Garcia, 32, and Rene Luna, 43. “On June 9, Garcia threw objects at law enforcement personnel stationed outside a Homeland Security Investigations (HSI) office in Santa Ana,” thecomplaint alleges. “Luna allegedly threw water bottles and beer cans at officers during the same protest. Both defendants were arrested.” DHS reportedthat the previously deported Galvez, whose criminal record includes grand theft and drunk driving, has been charged with attempted murder. **Other Thugs and Goons, All Illegals** Other illegals arrested in Los Angeles include the following cultural enrichers,DHS reported, here “to do the jobs Americans won’t do,” as the open-borders mantra says. Five are Mexicans: Previously deported Gerardo Antonio-Palacios, age undisclosed, homicide, burglary; Antonio Benitez-Ugarte, age undisclosed, drug trafficking; Alberto Morales-Mejia, age undisclosed, manufacturing amphetamine, previous arrests for fraud and possessing a weapon; Jesus Romero-Retana, 52, threatening crime with intent to terrorize and battery; and Raul Teran-Guillen, age undisclosed, arrests for human smuggling and money laundering. ICE Los Angeles arrested Jesus Romero-Retana, a 52-year-old illegal alien from Mexico and a criminal history including convictions for threatening crime with intent to terrorize and battery.pic.twitter.com/E0y5cWC1DU Two are Hondurans: Carlos Alberto Escobar-Flores, 43, grand theft; and Jose Jimenez-Alvarado,48, theft. And two are Asians: Cambodian Mab Khleb, 53, child molester, battery, transporting and possessing controlled substances; and Laotian Sang Louangprasert, 66, child molester, domestic abuser. “Murderers, pedophiles, and drug traffickers,”McLaughlin said: These are the types of criminal illegal aliens that rioters are fighting to protect. How much longer will Governor Newsom and Mayor Karen Bass continue to prioritize these criminal illegal aliens over their own citizens? .@KimKardashian, which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the county?These are just a few of the convicted illegal criminals who have been picked up in the last 72 hours.https://t.co/bauJUKbulkpic.twitter.com/VAtpNwHmeD **Answering the Big Lie** “When we witness innocent, hardworking people being ripped from their families in inhumane ways, we have to speak up,” washed-up, worn-out celebrity Kim Kardashian wrote on X. “We have to do what’s right.” Asked McLaughlin over photos of those arrested, “Which one of these convicted child molesters, murderers, drug traffickers and rapists would you like to stay in the [country]?” While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth.pic.twitter.com/yDJHSVaAo3 DHS also answered those officials, such as Newsom and Bass, who claim the rioting in Los Angeles is “peaceful” or President Trump’s fault. “While the mainstream media and sanctuary politicians have lied point-blank to Americans that these riots in Los Angeles have not been violent, the American people can see with their own eyes the truth,”McLaughlin wroteover photos and links to video on X of the rioting: Rioters are throwing rocks and Molotov cocktails at law enforcement, defacing public property, setting cars on fire, looting family businesses, assaulting law enforcement, and burning American flags. The violent targeting of law enforcement in Los Angeles by lawless rioters is despicable and California politicians must call for it to end. BREAKING: 330 illegal aliens were arrested for taking part in the LA riots.113 of them have prior criminal convictions.DEPORT DEORT DEPORTpic.twitter.com/ecRbSfyc6B Leavitt said at a White House presser: Since June 6th, there have been 330 illegal aliens that have been arrested as part of these riots in Los Angeles. 113 of those illegal aliens had prior criminal convictions. … Overall — and this includes the arrest of American citizens — there’s been 157 people arrested for assault and obstruction-related charges, including the attempted murder of a police officer with a Molotov cocktail. So, who is funding these illegal aliens who are coming in with this very professional riot gear? It’s a question everyone in this room who cares about truth should be asking. And we encourage your help in trying to get to the bottom of that question. AsThe New Americanreportedyesterday, Fox 11 in the city reported that rioters were receiving tactical gear, including Bionic face masks, for battling police and federal agents. “We just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed,” anchorman Elex Michaelson reported. Like Leavitt, Michaelson asked who is providing the gear. #BREAKINGWe just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed.It certainly seems like gear you'd wear if you're preparing for conflict with police.Who is funding this?pic.twitter.com/2hZphafOsi The riots beganwhen so-called protesters interfered with the arrest of 40 illegals after federal agents served three criminal warrants in a case involving money laundering, tax evasion, and customs fraud. R. Cort Kirkwood is a long-time contributor to The New American and a former newspaper editor. **Ventura Deputy Mayor Calls ICE Enforcement in L.A. “Terrorism”; Bass Continues Lying About Cause of Riots** Far-left Democratic public officials continue to lie about the targeted enforcement operations by ICE and other agencies in Los Angeles. ... **A Just and Necessary Stand: The Southern Baptists’ Call to Overturn Obergefell** At long last, a spark of righteous defiance has ignited in the Southern Baptist Convention — a call to overturn Obergefell v. Hodges. ... **Feds Gave $79 Billion in Pandemic Relief to People With Stolen or Invalid Social Security Numbers** A pandemic-response committee concluded that at least $79 billion could have been saved had agencies verified applicants' identities. ... **Are You Prepared to Fight for Your Own Freedom?** **GOP Congresswoman Mistakes Sikh for Muslim; Her Critics Mistake U.S. for USSR Constitution** **COVID Response Disaster Based on Debunked Models, Explosive New Study Shows** **Schara v. Ascension Health: First Week Summary** Digital Magazine Video United States World News Opinion Must Read Timeless Articles Make Europe Great Again Climate Change Conference World Economic Forum Save Our Children: New American Special Report – 2nd edition SELF RELIANCE: Foundation of Freedom paperback bookazine THE GREAT RESET and Transhumanism paperback bookazine TRUMPWORLD paperback bookazine The John Birch Society The Freedom Index Stand Your Ground Studios Shop JBS Freedom Project Freedom Project Academy Law Enforcement Charitable Foundation Contact Subscribe Shop Advertise About Contributors Staff Careers Copyright © 2025 The New American"}