{"id": 1640, "name": "Xenia Gazette", "domain": "xeniagazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.xeniagazette.com/2025/06/07/updating-day-two-results-for-greene-county-athletes-at-ohsaa-track-and-field-championships-cedarville-lca-have-runners-make-podium/#respond", "title": "Updating Day Two Results For Greene County Athletes At Ohsaa Track And Field Championships Cedarville Lca Have Runners Make Podium", "content": "NewsArchivesSpecial SectionsSubmit News Tip Archives Special Sections Submit News Tip Archives Special Sections Submit News Tip 2024 Fair SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionColumnsEditorialsSubmit Letter To The Editor Latest Opinion Columns Editorials Submit Letter To The Editor Latest Opinion Columns Editorials Submit Letter To The Editor Life & CultureReligionSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit Wedding Religion Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Religion Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding ClassifiedsClassified AdsSubmit Your Classified AdJob Match OhioOhio Public Notices Classified Ads Submit Your Classified Ad Job Match Ohio Ohio Public Notices Classified Ads Submit Your Classified Ad Job Match Ohio Ohio Public Notices Businesses Connect with UsAbout UsContact UsDigital AdvertisingPrivacy Policy About Us Contact Us Digital Advertising Privacy Policy About Us Contact Us Digital Advertising Privacy Policy E Edition NewsArchivesSpecial SectionsSubmit News Tip Archives Special Sections Submit News Tip Archives Special Sections Submit News Tip 2024 Fair SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionColumnsEditorialsSubmit Letter To The Editor Latest Opinion Columns Editorials Submit Letter To The Editor Latest Opinion Columns Editorials Submit Letter To The Editor Life & CultureReligionSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit Wedding Religion Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Religion Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding ClassifiedsClassified AdsSubmit Your Classified AdJob Match OhioOhio Public Notices Classified Ads Submit Your Classified Ad Job Match Ohio Ohio Public Notices Classified Ads Submit Your Classified Ad Job Match Ohio Ohio Public Notices Businesses Connect with UsAbout UsContact UsDigital AdvertisingPrivacy Policy About Us Contact Us Digital Advertising Privacy Policy About Us Contact Us Digital Advertising Privacy Policy Notice Box Sports Top Stories **Beavercreek’s Brown wins state title at OHSAA Track and Field Championships — Carroll, Cedarville, Legacy Christian have runners make podium** Photos by Steven Wright | Greene County News Beavercreek sophomore Faith Brown crosses the finish line to win a state championship in the Division I girls 300 meter hurdles final during Saturday’s OHSAA Track and Field Championships at Jesse Owens Stadium in Columbus. Legacy Christian senior Caroline Hamilton (2) runs with the pack during the D-III girls 3200 meter run final. Hamilton finished seventh in the race. Cedarville sophomore Bradyn Long (1) clears the mark during the boys 300 meter hurdle finals. Long finished in eight place in the race. Beavercreek freshman Enora McEllroy (near) and senior Zoe Roll (far) compete in the girls seated 100 meter dash. McEllroy got third and Roll finished in fourth. Beavercreek junior Jackson Davis turns onto the front stretch during his fourth place run in the boys 1600 meters. Carroll senior Ruby Gross (8) pushed ahead on the final lap to place eighth in the girls 1600 meter run in the D-II competition. Beavercreek senior Jackson Davis hands off the baton to senior Gio Louprasong for the final leg of the boys 4 x 400 meter relay at the conclusion of the event. Along with Aiden Howard and Aaden Hildebrand, the team finished in eighth. Cedarville freshman Mandy Mark checks the field ahead of her during the girls 1600 meter run. Cedarville junior Ellie Mark (16) passes several other competitors during the final lap of the girls 3200 meter run. Cedarville senior Ryan Reed (8) makes his way down the final stretch running in the boys 800 meters. Legacy Christian senior Levi Thompson gets around the first corner at the start of the boys 1600 meter run. Carroll senior Andrew Janson attempted to defend his title from a year ago in the boys 800 meters. Beavercreek senior Mackenzie McClurkin goes through her wind up during an attempt in the girls shot put final. Beavercreek senior Isaiah-Michael Williams starts his second leaping attempt at 6-feet, 4-inches, in the boys high jump final. (Editor’s note: This story was updated multiple times throughout the day with results and photos from Saturday’s event.) COLUMBUS — Faith Brown of Beavercreek won an individual state title Saturday at the 2025 OHSAA State Track and Field Championships. Brown was triumphant, and dominant, in the Division I girls 300 meter hurdles final. She ran a final time of 41 seconds flat, setting a new meet record at Jesse Owens Stadium in Columbus in the process. She entered the race with the best time out of Friday’s prelim heats and wasted no time speeding ahead in Saturday’s final. Brown won by 1.13 seconds and was only .21 seconds off the state meet record. Six total local athletes reached the podium Saturday during day two of the OHSAA State Track and Field Championships. During the Division III competition, Cedarville’s Bradyn Long finished in eighth place in the boys 300 meter hurdles final with a time of 39.76. Legacy Christian’s Caroline Hamilton got seventh in the girls 3200 meter run running the race in 11:18.75. In D-II, Carroll’s Ruby Gross made a late push to secure a podium spot, finishing eighth in the girls 1600 meter run by running a time of 4:56.32. Beavercreek had multiple placers in D-I. Enora McEllroy got third in both the seated girls 400 and 100 meters, and Zoe Roll finished fourth in the seated girls 100 meter dash. Brown was also the runner-up in the girls 100 meter hurdles after taking third a year ago. Jackson Davis made a surge out of the final turn to pass three others and get fourth place in the boys 1600 meter run. He later joined Aaden Hildebrand, Aiden Howard, and Gio Louprasong for an eighth place run in the boys 4 x 400 meter relay to close the meet. Beavercreek finished in a tie for ninth place in the girls team competition. Check out our Tuesday print edition for more stories and podium photos from the event. Check out results from day one of the competition here. OHSAA STATE TRACK AND FIELD RESULTS Division — Event — Name — Finishing Time/Distance (Place) SATURDAY FINALS Division III Cedarville Girls — 1600m— Mandy Mark (Fr.) — 5:25.66 (9th) Boys — 300m Hurdles— Bradyn Long (So.) — 39.76 (8th) Boys — 800m — Ryan Reed (Sr.) — 1:59.79 (14th) Girls — 3200m — Ellie Mark (Jr.) — 11:26.96 (9th) Legacy Christian Boys — 1600m — Levi Thompson (Sr.) — 4:36.32 (15th) Girls — 3200m — Caroline Hamilton (Sr.) — 11:18.75 (7th) Division II Carroll Girls — 1600m — Ruby Gross (Sr.) — 4:56.64 (8th) Boys — 800m — Andrew Janson (Sr.) — 2:13.88 (16th) Division I Beavercreek Seated Girls — 400m — Enora McEllroy (Fr.) — 1:44.66 (3rd) Seated Girls — 100m — Enora McEllroy (Fr.) — 26.40 (3rd) Seated Girls — 100m — Zoe Roll (Sr.) — 28.70 (4th) Girls — Shot Put — Mackenzie McClurkin (Sr.) — 34’ 7.75” (18th) Boys — High Jump — Isaiah Michael-Williams (Sr.) — 6’ 4” (13th) Girls — 100m Hurdles — Faith Brown (So.) — 13.96 (2nd) Boys — 1600m — Jackson Davis (Jr.) — 4:13.81 (4th) Girls — 300m Hurdles — Faith Brown (So.) — 41.00 (1st) Boys — 800m — Jackson Davis (Jr.) — 1:58.82 (18th) Boys — 4 x 400m relay — Aaden Hildebrand, Aiden Howard, Jackson Davis, Gio Louprasong — 3:19.76 (8th) Contact Steven Wright at 937-502-4498 and follow on X (formerly Twitter) @Steven_Wright_. **Featured Local Savings** **Photos: Fairborn High School holds youth basketball camp** **Glen Helen Nature Preserve flooded, needs cleanup** **Brown wins title at state track and field; podium pictures and more local stories on Greene County athletes competing in Columbus**"}