{"id": 2050, "name": "Morocco World News", "domain": "moroccoworldnews.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.moroccoworldnews.com/2025/06/211668/amid-justice-ministrys-denial-of-cyberattack-jabaroot-claims-hack-of-moroccos-road-safety-agency/#respond", "title": "Amid Justice Ministrys Denial Of Cyberattack Jabaroot Claims Hack Of Moroccos Road Safety Agency", "content": "Prayer Times International Morocco Lifestyle Login Register Home Culture Politics Society Economy Opinion Education Western Sahara Sport Home Culture Politics Society Economy Opinion Education Western Sahara Sport Home>Headlines>Amid Justice Ministry’s Denial of Cyberattack, ‘Jabaroot’ Claims Hack of Morocco’s Road Safety Agency **Amid Justice Ministry’s Denial of Cyberattack, ‘Jabaroot’ Claims Hack of Morocco’s Road Safety Agency** **Reports circulating online suggest that the Algerian hacker group claimed responsibility for a new cyberattack against NARSA.** Amid Justice Ministry’s Denial of Cyberattack, ‘Jabaroot’ Claims Hack of Morocco’s Road Safety Agency Amid Justice Ministry’s Denial of Cyberattack, ‘Jabaroot’ Claims Hack of Morocco’s Road Safety Agency **Follow the latest news from Morocco World News** Rabat — The Ministry of Justice issued a statement today regarding alleged leaks of electronic data, noting that the allegations do not in any way pertain to the ministry’s information systems or database. The Ministry of Justicerespondedto the reports circulated on social networks and media platforms regarding the leaks, noting that the circulated information “does not in any way pertain to the Ministry of Justice’s information systems, nor is it related to its databases or secure digital services.” The ministry said that its information systems, including digital platforms for judicial and administrative services, are operating normally and securely. “They have not been subjected to any breaches or data leaks,” the ministry said, noting that it implements multi-layered protection protocols. It also urged citizens to obtain information related to its operations from official and authorized sources, and to avoid “giving credence to rumors or inaccurate news that could cause unnecessary confusion and concern.” **RelatedPosts** **Phantom Atlas Hackers Infiltrate Algérie Télécom Network in Cyber Retaliation** **Algeria’s Jabaroot Targets Justice Ministry in Latest Cyberattack on Moroccan Institutions** **Moroccan Authorities Warn of Unauthorised Use of Personal Data Following CNSS Leak** **Algerian Media Accuse Morocco of Hacking State-Owned Websites** The ministry also reiterates its commitment to ensuring the security and integrity of data and information related to the justice system and digital services, confirming its “continued efforts to strengthen cybersecurity measures and vigilance to confront all potential risks in this field.” Algerian hacker group “Jabaroot”claimedresponsibility for the new alleged cyberattack against the Moroccan ministry. This is acontinuationof Jabaroot’s hacking claims. Recent social media reports suggest that the group published a leaked dossier from Morocco’s road safety agency, NARSA. It remains to be seen whether the claim is authentic or another allegation that will be eventually denied by the agency in the coming hours. In the past few months, the group made similar announcements, claiming responsibility over cyberattacks targeting several other Moroccan databases, including the National Social Security Fund (CNSS) and the National Agency for Land Registry (ANCFCC). Sources from the land registry agency denied that its system was directly targeted, clarifying that the breach involved a notaries’ platform, Tawtik, which is managed independently. An authorized source from ANFCC said recently that no intrusion or data leak has been detected in its information system. Converging reports suggested that the Algerian hacking group may have access to data on the notaries’ platform by “exploiting vulnerabilities in inadequately protected computers.” **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Privacy Policy Agreement*I agree to theTerms & ConditionsandPrivacy Policy. Δ **USEFUL LINKS** About Privacy Policy Contact Careers Terms Of Use Cookies Policy **TOPICS** Mawazine 2025 Environment Politics Lifestyle Sports Technology Western Sahara **REGIONS** International Maghreb Middle East Americas Europe Africa **Welcome Back!** Login to your account below Remember Me **Create New Account!** Fill the forms bellow to register **Retrieve your password** Please enter your username or email address to reset your password. Login Sign Up Cart Home Culture Politics Society Economy Opinion Education Western Sahara Sport **Usefull Links** Prayer Times All Right Reserved © 2025 Morocco World News ."}