{"id": 41, "name": "Above the Law", "domain": "abovethelaw.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abovethelaw.com/2025/06/instead-of-wasting-millions-on-a-fake-display-of-military-strength-in-d-c-trump-should-fund-a-real-one-in-ukraine/", "title": "Instead Of Wasting Millions On A Fake Display Of Military Strength In D C Trump Should Fund A Real One In Ukraine", "content": "Newsletters Send Tips Biglaw Midsize Small Firms In-House Counsel Bonuses AI Legal Beat Legal Technology Podcasts The Jabot Newsletters Newsletters Send Tips Biglaw Midsize Small Firms Law Schools In-House Legal TechATL Tech Center 2025Practice ManagementDocument ManagementContract Lifecycle Management (CLM)Legal OperationsCustomer Relationship Management (CRM)Time Billing & PaymentsArtificial Intelligence ToolsLegal Tech Directory ATL Tech Center 2025 Practice Management Document Management Contract Lifecycle Management (CLM) Legal Operations Customer Relationship Management (CRM) Time Billing & Payments Artificial Intelligence Tools Legal Tech Directory ATL Tech Center 2025 Practice Management Document Management Contract Lifecycle Management (CLM) Legal Operations Customer Relationship Management (CRM) Time Billing & Payments Artificial Intelligence Tools Legal Tech Directory AI Career CenterJob BoardLaw School RankingsResource Library Job Board Law School Rankings Resource Library Job Board Law School Rankings Resource Library Money Appellate Court Blog Newsletters Send Tips **Featured:** LMA on ATL ILTA on ATL Sponsorships With Guaranteed ROI **Instead Of Wasting Millions On A Fake Display Of Military Strength In D.C., Trump Should Fund A Real One In Ukraine** Military parades on leaders' birthdays are far more common in weak foreign dictatorships than in strong western democracies. Share Options Share a link too this article Copy LinkCopy Link Email Facebook LinkedIn X It is one vainglorious outrage after another in this White House. If you write about some dumbfounding scandal in the morning, another is fairly likely to arise by the afternoon. That’s the idea, of course: President Trump is trying to wear everyone out, to overload us, to atomize our attention. So, let’s slow down for a moment … and focus. This weekend, instead of charging taxpayersmillions for yet another golf outing, Trump is instead charging taxpayers tens of millions to throw himself a military birthday parade. **Steno’s AI Tool Steps Ahead Of The Pack** Transcript Genius is a ‘very well-behaved’ partner. ThisSaturday, June 14, dozens of military aircraft, hundreds of armored vehicles, and thousands of U.S. troops will descend upon Washington, D.C., to take part in a parade. Sycophantic feds have been parroting the lie that the parade is to honor the 250th anniversary of the U.S. Army, though we all really know it is to stroke Donald Trump’s ego on his 79th birthday. There were no plans for such a military parade before Trump personally intervened weeks ago in the planning of the celebration of the Army’s 250th year. Like when Trump’s favorite former weekend Fox News hostrestored the name of “Fort Bragg” from “Fort Liberty”by finding some random brave soldier who happened to be named “Bragg” and then pretended it was a coincidence that he shared a last name with the camp’s former namesake, Confederate monster Braxton Bragg, the official fig leaf is fooling no one. The Army estimates this75-minutebirthday paradewill cost taxpayers $25 million to $45 million. Since the military quite famouslyspends way more than it thinks it is going toon almost everything, I wouldn’t put too much stock in that already vague estimate. Trumpassures us that the cost will be“[p]eanuts compared to the value of doing it,” much ashe assured us that“Mexico is paying for the wall” that Mexico did not actually pay one penny for. To be clear, there is no value to be gained by needlessly tearing up the streets of the nation’s capital as a bunch of 60-ton Abrams tanksthat get 0.6 mpgroll over them. **How Strong Is Your Firm’s Financial Visibility?** Discover how to gain more control over your firm’s finances and unlock smarter growth strategies—take a quick financial visibility quiz designed for law firms. I am far from the first to point out that military parades on leaders’ birthdays arefar more common in weak foreign dictatorshipsthan in strong western democracies. Strong nations have not found blocks of marching soldiers to be intimidating for quite a long time. Meanwhile, in Ukraine, where our allies are actually bravely fighting a brutal war in defense of democracy rather than putting on war-themed street theater, the Trump administration continues to jerk U.S. support. Most recently, Trump’s defense secretaryredirected 20,000 specialized anti-drone weaponsthat the U.S. had already promised Ukraine to the Middle East instead. Canada continues to step up to help fill the void created by the Trump administration. Instead of pointlessly driving military equipment around Ottawa, this June our neighbor to the north is sending$22 million worth of its Bison and Coyote armored vehiclesto Ukraine to be used against the Russian invaders. It is a drop in the bucket compared to the billions in aid Canada and other countries have already pledged to Ukraine, yet it’s a notable one considering how American taxpayers are spending a similar amount on armored vehicles this weekend. What do you think makes a nation look stronger on the global stage: showing the world it has plenty of advanced military equipment to spare when the time comes to assist an ally in desperate need, or using tens of millions to shatter the pavement of its own capital city so that its president can feel like a big shot on his birthday? President Theodore Roosevelt, a real patriot, a combat veteran, and deservedwinner of the Nobel Peace Prize, popularized and applied to his foreign policywhat he believed was a West African proverb: “Speak softly and carry a big stick.” Trump’s foreign policy, on the other hand, as exemplified by his birthday military parade, could be better characterized as, “Speak loudly but carry a limp dick.” Enjoy your parade, MAGA. Jonathan Wolf is a civil litigator and author ofYour Debt-Free JD(affiliate link). He has taught legal writing, written for a wide variety of publications, and made it both his business and his pleasure to be financially and scientifically literate. Any views he expresses are probably pure gold, but are nonetheless solely his own and should not be attributed to any organization with which he is affiliated. He wouldn’t want to share the credit anyway. He can be reached at[email protected]. **Topics** Breaking Government Donald Trump Government Jonathan Wolf **More from Above the Law** **French Tesla Owners Sue Car Company Because Elon Musk Is Dragging Their Reputation Through The Mud** **Lawyers Must Band Together In The Battle To Save The Rule Of Law** **An Arrest By Any Other Name Would Smell As Much A Violation Of The Posse Comitatus Act** **Fixing The Clerkship System** **From the Above the Law Network** **The Fifth-Year Dilemma: Do I Stay Or Do I Go (In-House)?** **Gen AI: Your Legal Research Assistant, Not Your Replacement** **A Law Firm Checklist For Successful Client Portals** **A Law Firm Checklist For Successful Transaction Management** **Billables Are Not The Same As Cash Flow. Here’s Why That’s Important.** Findings from the MyCase 2025 Legal Industry Report. **Recommended** **An Arrest By Any Other Name Would Smell As Much A Violation Of The Posse Comitatus Act** **Rep. Mikie Sherrill, Former Biglaw Associate And Federal Prosecutor, Wins NJ Democratic Primary For Governor** **In Axing mRNA Contract, Trump Delivers Another Blow To US Biosecurity, Former Officials Say** **Why Some Firms Are Leading The Market With Generative AI** A culture of innovation with strategic AI like Lexis+ AI is revolutionizing law firms by boosting efficiency and deepening client relationships. **Recent Jobs** **Why Better Billing Statements Can Improve Your Firm’s Finances—And Your Client Relationships** Outdated billing is costing law firms money. Discover how clear, modern billing practices boost profits, trust, and cash flow in 2025. About Newsletters **Our Sites** © 2025 Breaking Media, Inc. All rights reserved. Registration or use of this site constitutes acceptance of ourTerms of ServiceandPrivacy Policy."}