{"id": 793, "name": "KTVU Fox 2", "domain": "ktvu.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ktvu.com/news/high-stakes-sports-betting-in-california-an-in-depth-look-at-prop-26-and-27", "title": "High Stakes Sports Betting In California An In Depth Look At Prop 26 And 27", "content": "Live News Weather Sports FOX LOCAL Contests More Local National Crime 2024 Election Drought Wildfires Business Consumer Web Links West Coast Wrap FOX News Sunday Zip Trips Traffic Contests Recipes Weather Alerts Live Bay Area Weather Cameras Air Quality Map Wildfires Earthquakes Severe Weather Weather App FOX Weather San Francisco 49ers Golden State Warriors San Francisco Giants Oakland Roots Oakland Ballers San Jose Sharks USFL FIFA Women's World Cup The Athetics California EDD Homelessness Cost of California Powerless In Prison Unleashed Force: Power and Police Dogs California's Electric Revolution The Four High Stakes: Sports Betting in California Made in the Bay Powerless In Prison Sports Focus Talk of the Town This Is Me: Transgender Journeys Unleashed Force: Power and Police Dogs Voices For Change West Coast Wrap Zip Trips Brand Spotlight Personal Finance The Economy Small Business Los Angeles News - FOX 11 Phoenix News - FOX 10 Phoenix Seattle News - FOX 13 Seattle How To Stream KTVU Staff Jobs and Careers Contact KTVU FOX Shows and Programming KTVU's Schedule Live News Stream Schedule Mobile Apps Subscribe To KTVU's Newsletter FCC Public File FCC Applications **High Stakes: Sports Betting in California, an in-depth look at Prop 26 and 27** Share Copy Link Email Facebook Twitter LinkedIn Reddit California voters will decide if and how to legalize sports betting in the Golden State. They are faced with two propositions, which offer two different paths to legalization. Prop 26 would allow in-person sports betting at Tribal casinos and four horse race tracks around the state. Prop 27 would allow online and mobile sports betting for licensed tribes and companies like FanDuel and DraftKings. OAKLAND, Calif.-California voters will decide if and how to legalize sports betting in the Golden State. They are faced with two propositions, which offer two different paths to legalization. PROPOSITION 26: Prop 26 would allow in-person sports betting at Tribal casinos and four horse race tracks around the state The measure is supported by dozens of Native American tribes A 10% tax would be levied on bets at race tracks for the state to spend on things like schools, gambling enforcement and money for the general fund The Legislative Analyst’s Office estimates 26 could generate \"tens of millions\" of dollars each year in tax revenue PROPOSITION 27: Prop 27 would allow online and mobile sports betting for licensed tribes and companies like FanDuel and DraftKings. It is funded by those online gambling giants The measure is supported by three tribes The state would receive 10% of betting profits 85% of that would go towards housing and homelessness services The states estimates 27 could generate hundreds of millions in revenue each year The fight between the two measures has been contentious and expensive. Supporters and opponents of both 26 and 27 have spent more than $440 million, breaking a California record for campaign spending. SEE ALSO:What is on the ballot in California in 2022? Despite the big money spent, recent polls from thePublic Policy Institute of Californiashow voters are likely to reject both measures. In the latest Public Policy Institute of California survey, 34% of likely voters say they’ll vote \"yes\" on 26, 26% say \"yes\" on 27. Both, well below the majority needed to pass. Sonoma State political science professor David McCuan says voters were likely turned off by the dueling measures. \"All of them huge operators with huge players, with a nuclear arsenal of dollars, they go all in,\" said McCuan. \"Voters when they're faced with this kind of choice, they opt out, they say ‘no, a pox on all your houses,’ this is called counter initiatives.\" Ultimately, voters will have the final say and experts say regardless of what happens in the November election, there will be more efforts to bring legal sports gambling to California. We went in-depth on Prop 26 and 27 in our special\"High Stakes: Sports Betting in California.\" **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. **Most Watched** **Gov. Newsom says Trump's military deployment is illegal** **Hundreds attend Oakland vigil in solidarity with LA protestors** **LA curfew put in place for downtown following nighttime violence** **Trending** Local National Crime 2024 Election Drought Wildfires Business Consumer Web Links West Coast Wrap FOX News Sunday Zip Trips Traffic Contests Recipes Weather Alerts Live Bay Area Weather Cameras Air Quality Map Wildfires Earthquakes Severe Weather Weather App FOX Weather San Francisco 49ers Golden State Warriors San Francisco Giants Oakland Roots Oakland Ballers San Jose Sharks USFL FIFA Women's World Cup The Athetics California EDD Homelessness Cost of California Powerless In Prison Unleashed Force: Power and Police Dogs California's Electric Revolution The Four High Stakes: Sports Betting in California Made in the Bay Powerless In Prison Sports Focus Talk of the Town This Is Me: Transgender Journeys Unleashed Force: Power and Police Dogs Voices For Change West Coast Wrap Zip Trips Brand Spotlight Personal Finance The Economy Small Business Los Angeles News - FOX 11 Phoenix News - FOX 10 Phoenix Seattle News - FOX 13 Seattle How To Stream KTVU Staff Jobs and Careers Contact KTVU FOX Shows and Programming KTVU's Schedule Live News Stream Schedule Mobile Apps Subscribe To KTVU's Newsletter FCC Public File FCC Applications email youtube facebook instagram tik tok twitter New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs and Internships Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}