{"id": 1662, "name": "Alliance for Human Research Protection", "domain": "ahrp.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://ahrp.org/interview-dr-uwe-alschnermedicine-is-being-used-as-a-weapon-to-deprive-us-of-our-freedom/", "title": "Interview Dr Uwe Alschnermedicine Is Being Used As A Weapon To Deprive Us Of Our Freedom", "content": "Alliance for Human Research Protection Alliance for Human Research Protection Home AboutExpandBoard of DirectorsDistinguished Advisory BoardHonor Roll–Exemplary Professionals Board of Directors Distinguished Advisory Board Honor Roll–Exemplary Professionals Board of Directors Distinguished Advisory Board Honor Roll–Exemplary Professionals Video Support Contact Medical EthicsExpandFirst, do no HarmHuman RightsInformed ConsentNuremberg Code First, do no Harm Human Rights Informed Consent Nuremberg Code First, do no Harm Human Rights Informed Consent Nuremberg Code Eugenics / BioethicsExpandDiscriminationMedicalized RacismGene ModificationDepopulation Discrimination Medicalized Racism Gene Modification Depopulation Discrimination Medicalized Racism Gene Modification Depopulation Corrupted ScienceExpandScientismTechnocracyBias/FraudPropaganda – CensorshipClinical TrialsConcealed DataPublic-Private PartnershipsPharma Corrupt InfluencePublication Bias Scientism Technocracy Bias/Fraud Propaganda – Censorship Clinical Trials Concealed Data Public-Private Partnerships Pharma Corrupt Influence Publication Bias Scientism Technocracy Bias/Fraud Propaganda – Censorship Clinical Trials Concealed Data Public-Private Partnerships Pharma Corrupt Influence Publication Bias Medical AtrocitiesExpandOrgan HarvestingBioweapon ExperimentsTranshumanismCurrent Medical AtrocitiesJapanese AtrocitiesNazi AtrocitiesOperation PaperclipCIA Mind-ControlCIA TortureU.S. Radiation ExperimentsUnethical Experiments Organ Harvesting Bioweapon Experiments Transhumanism Current Medical Atrocities Japanese Atrocities Nazi Atrocities Operation Paperclip CIA Mind-Control CIA Torture U.S. Radiation Experiments Unethical Experiments Organ Harvesting Bioweapon Experiments Transhumanism Current Medical Atrocities Japanese Atrocities Nazi Atrocities Operation Paperclip CIA Mind-Control CIA Torture U.S. Radiation Experiments Unethical Experiments Current ControversiesExpandPandemic ControlGreat ResetDigital IdApartheid PoliciesCovid PandemicEpidemicsGovernment Overreach Pandemic Control Great Reset Digital Id Apartheid Policies Covid Pandemic Epidemics Government Overreach Pandemic Control Great Reset Digital Id Apartheid Policies Covid Pandemic Epidemics Government Overreach VaccinesExpandVaccine Profit EngineChild SacrificeVaccine MandatesVaccine RisksVaccine Safety Vaccine Profit Engine Child Sacrifice Vaccine Mandates Vaccine Risks Vaccine Safety Vaccine Profit Engine Child Sacrifice Vaccine Mandates Vaccine Risks Vaccine Safety **Interview Dr. Uwe AlschnerMedicine is Being Used as a Weapon to Deprive Us of Our Freedom** March 12, 2021 Part 1 Source:https://odysee.com/@klartext:d/verasharav1:a Part 2 Source:https://odysee.com/@klartext:d/vera-sharav-part2:2 **Post navigation** **Similar Posts** **Israeli Professor Ehud Qimron to Ministry of Health: “It’s Time to Admit Failure”** The following article by Prof. Ehud Qimron, MD, a professor of medicine at Tel Aviv University, appeared in the Israeli daily newspaper, Ha’aretz, on January 6, 2022 “The truth about the coronavirus policy is about to be revealed. When the destructive concepts collapse one by one, there is nothing left… Read MoreIsraeli Professor Ehud Qimron to Ministry of Health: “It’s Time to Admit Failure”Continue **BMJ & the Lancet Wedded to Merck CME Partnership** Why did the BMJ fail to disclose its partnership agreement with Merck, major vaccine manufacturer–13 vaccines, including the controversial MMR vaccine ? Read MoreBMJ & the Lancet Wedded to Merck CME PartnershipContinue **A Rising Tide of Medical Voices & Informed Citizens Denounce the Lies and Suppression of the Truth** A rising tide of medical voices denounce the lies about the virus and the suppression of the truth about the effectiveness of hydroxychloroquine in combination with zinc and azithromycin. Dr. Stella Immanuel dispels the public fear that has suspended reason. Her appeal is liberating;; it is based on solid clinical… Read MoreA Rising Tide of Medical Voices & Informed Citizens Denounce the Lies and Suppression of the TruthContinue **Why is this Doctor Under Siege for Practicing Good Medicine?** The extraordinary story of how patient access to COVID treatments was denied, eventually involving a witch hunt of physicians who dared to treat patients by Meryl Nass, MD.[Dr. Nass is a member of the Alliance for Human Research Protection Board of Directors.] First came the Chloroquine and Hydroxychloroquine suppression In… Read MoreWhy is this Doctor Under Siege for Practicing Good Medicine?Continue **Ghost-Managed Medicine: Big Pharma’s Invisible Hands** “Ghost managed research does not merely shape academic cultures and the knowledge they produce but makes them unnecessary except to provide authority…Ghost-managed “science” has been crafted to help sell drugs”. Ghost-Managed Medicine:Big Pharma’s Invisible Hands by Dr. Sergio Sismondo is a detailed study of how the pharmaceutical industry has taken… Read MoreGhost-Managed Medicine: Big Pharma’s Invisible HandsContinue **Urgent Action Required to Maintain Our Medical Freedom to Choose** FYI & Action History is repeating itself! Once again, a massive propaganda machine has fomented disease hysteria, preempting rational public health policy decisions. Last time around, coercive medical sterilizations were performed in the U.S.; their goal was to “cleanse the genetic pool of undesirables”. This time around, the objective is… Read MoreUrgent Action Required to Maintain Our Medical Freedom to ChooseContinue Contact Disclaimer Donate © 2025 Alliance for Human Research Protection Home AboutToggle child menuExpandBoard of DirectorsDistinguished Advisory BoardHonor Role-Exemplary Professionals Board of Directors Distinguished Advisory Board Honor Role-Exemplary Professionals Board of Directors Distinguished Advisory Board Honor Role-Exemplary Professionals Video Support Contact All ArticlesToggle child menuExpandMedical Research EthicsToggle child menuExpandFirst, do no HarmHuman RightsInformed ConsentNuremberg CodeEugenics / BioethicsToggle child menuExpandDiscriminationMedicalized RacismGene ModificationDepopulationCorrupted ScienceToggle child menuExpandScientismTechnocracyBias/FraudPropaganda — CensorshipClinical TrialsConcealed DataPublic-Private PartnershipsPharma Corrupt InfluencePublication BiasMedical AtrocitiesToggle child menuExpandOrgan HaverstingBioweapon ExperimentsTranshumanismCurrent Medical AtrocitiesJapanese Medical AtrocitiesNazi Medical AtrocitiesOperation PaperclipCIA Mind-ControlCIA TortureU.S. Radiation ExperimentsUnethical ExperimentsCurrent ControversiesToggle child menuExpandPandemic ControlGreat ResetDigital IDApartheid PoliciesCovid PandemicEpidemicsGovernment OverreachVaccine ControversiesToggle child menuExpandVaccine Profit EngineChild SacrificeVaccine mandatesVaccine RisksVaccine Safety Medical Research EthicsToggle child menuExpandFirst, do no HarmHuman RightsInformed ConsentNuremberg Code First, do no Harm Human Rights Informed Consent Nuremberg Code Eugenics / BioethicsToggle child menuExpandDiscriminationMedicalized RacismGene ModificationDepopulation Discrimination Medicalized Racism Gene Modification Depopulation Corrupted ScienceToggle child menuExpandScientismTechnocracyBias/FraudPropaganda — CensorshipClinical TrialsConcealed DataPublic-Private PartnershipsPharma Corrupt InfluencePublication Bias Scientism Technocracy Bias/Fraud Propaganda — Censorship Clinical Trials Concealed Data Public-Private Partnerships Pharma Corrupt Influence Publication Bias Medical AtrocitiesToggle child menuExpandOrgan HaverstingBioweapon ExperimentsTranshumanismCurrent Medical AtrocitiesJapanese Medical AtrocitiesNazi Medical AtrocitiesOperation PaperclipCIA Mind-ControlCIA TortureU.S. Radiation ExperimentsUnethical Experiments Organ Haversting Bioweapon Experiments Transhumanism Current Medical Atrocities Japanese Medical Atrocities Nazi Medical Atrocities Operation Paperclip CIA Mind-Control CIA Torture U.S. Radiation Experiments Unethical Experiments Current ControversiesToggle child menuExpandPandemic ControlGreat ResetDigital IDApartheid PoliciesCovid PandemicEpidemicsGovernment Overreach Pandemic Control Great Reset Digital ID Apartheid Policies Covid Pandemic Epidemics Government Overreach Vaccine ControversiesToggle child menuExpandVaccine Profit EngineChild SacrificeVaccine mandatesVaccine RisksVaccine Safety Vaccine Profit Engine Child Sacrifice Vaccine mandates Vaccine Risks Vaccine Safety Medical Research EthicsToggle child menuExpandFirst, do no HarmHuman RightsInformed ConsentNuremberg Code First, do no Harm Human Rights Informed Consent Nuremberg Code First, do no Harm Human Rights Informed Consent Nuremberg Code Eugenics / BioethicsToggle child menuExpandDiscriminationMedicalized RacismGene ModificationDepopulation Discrimination Medicalized Racism Gene Modification Depopulation Discrimination Medicalized Racism Gene Modification Depopulation Corrupted ScienceToggle child menuExpandScientismTechnocracyBias/FraudPropaganda — CensorshipClinical TrialsConcealed DataPublic-Private PartnershipsPharma Corrupt InfluencePublication Bias Scientism Technocracy Bias/Fraud Propaganda — Censorship Clinical Trials Concealed Data Public-Private Partnerships Pharma Corrupt Influence Publication Bias Scientism Technocracy Bias/Fraud Propaganda — Censorship Clinical Trials Concealed Data Public-Private Partnerships Pharma Corrupt Influence Publication Bias Medical AtrocitiesToggle child menuExpandOrgan HaverstingBioweapon ExperimentsTranshumanismCurrent Medical AtrocitiesJapanese Medical AtrocitiesNazi Medical AtrocitiesOperation PaperclipCIA Mind-ControlCIA TortureU.S. Radiation ExperimentsUnethical Experiments Organ Haversting Bioweapon Experiments Transhumanism Current Medical Atrocities Japanese Medical Atrocities Nazi Medical Atrocities Operation Paperclip CIA Mind-Control CIA Torture U.S. Radiation Experiments Unethical Experiments Organ Haversting Bioweapon Experiments Transhumanism Current Medical Atrocities Japanese Medical Atrocities Nazi Medical Atrocities Operation Paperclip CIA Mind-Control CIA Torture U.S. Radiation Experiments Unethical Experiments Current ControversiesToggle child menuExpandPandemic ControlGreat ResetDigital IDApartheid PoliciesCovid PandemicEpidemicsGovernment Overreach Pandemic Control Great Reset Digital ID Apartheid Policies Covid Pandemic Epidemics Government Overreach Pandemic Control Great Reset Digital ID Apartheid Policies Covid Pandemic Epidemics Government Overreach Vaccine ControversiesToggle child menuExpandVaccine Profit EngineChild SacrificeVaccine mandatesVaccine RisksVaccine Safety Vaccine Profit Engine Child Sacrifice Vaccine mandates Vaccine Risks Vaccine Safety Vaccine Profit Engine Child Sacrifice Vaccine mandates Vaccine Risks Vaccine Safety"}