{"id": 176, "name": "Butler County Times-Gazette", "domain": "butlercountytimesgazette.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.butlercountytimesgazette.com/2025/06/resource-center-to-open-for-butler-county-residents-affected-by-the-flood/", "title": "Resource Center To Open For Butler County Residents Affected By The Flood", "content": "Home NewsSurveys Surveys Surveys Sports Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary Conversations Video Reports ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Contact Us Subscribe Login Home NewsSurveys Surveys Surveys Sports Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary Conversations Video Reports ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Subscribe Login **Resource center to open for Butler County residents affected by the flood** June 10, 2025 Free,News Nikole Babbnbabb@cherryroad.com Following last week’s flooding events, county-wide agencies and resources have come together to open a Multi-Agency Resource Center, (MARC), in El Dorado this week. The MARC will be a central location for local and state agencies as well as human service organizations to answer resident’s questions and provide information they need to navigate disaster-related issues. Although the water lines have receded and rivers are back to near normal levels, those who were in the thick of the worst of the flooding levels could still be struggling. Some insurance companies won’t cover certain costs while some folk are left with nothing in their home due to water damage. “That’s what makes flooding hard too, in order to identify who needs help in order for the other members of the community to realize there are people who are still struggling,” said Butler County Emergency Management Director Keri Korthals. “With a tornado, once that storm rolls through you can just see the homes that are leveled and the debris everywhere. It’s just so much more evident that a disaster has happened, there are people are in impact and are in need.” Korthals said that while El Dorado residents took the heaviest hit the flood repercussions due to close vicinity of the river, Augusta city residents were fortunate to have the levee system in place. That doesn’t exclude rural residents outside of city limits from flood damage, though. Some residents were near rivers that have lost fence lines “We really had a two-pronged issue with these storms that came through,” said Korthals. “The day of the storms we had people experiencing very severe flash-flooding. So all those people subjected to that rapidly rising flash flooding but we also had those people who experienced river flooding.” She estimates that out all the areas the damage assessors from county and city officials have surveyed, 208 properties were reported to have damage. That number includes a small portion of businesses. The damage reported ranges from minor or cosmetic destruction to major damages. “When you have a flood, as long as the water’s up, you definitely have that perspective of how bad it is,” said Korthals. “But as soon as the water goes down, unless you’re looking closely for water and debris lines, it may appear that the community has returned to dry and normal again while you could have someone who’s basically lost the entire contents of their home.” The resource center will be open to all Butler County residents who have experienced issues due to the flooding that happened across the county. The MARC will open Tuesday, June 10 at 2pm and run through Thursday at the Butler County Community Building located at 200 N Griffith. The operating hours will be: Tuesday, June 10th from 2pm-8pm Wednesday, June 11th from 2pm-8pm Thursday morning, June 12th, from 9am-2pm Among the resources that will be present include local and state agencies, non-profits, faith-based organizations, disaster relief organizations, insurance advice, mental health support, clean-up efforts, recovery, and more. The Butler County Health Department will be available for resources in addition to offering free tetanus shots for those who would like one but missed the clinics on Friday. Residents attending the MARC only need to bring proof of address and identification. Resource center to open for Butler County residents affected by the flood Flood damage assessments underway; donate to those affected Equality El Dorado hosts successful grand opening Emergency shelters run a successful operation KDHE issues Blue-Green Algae watch for Santa Fe Lake A Minute with Madeline: Get Ready for the Butler County Fair! Immigrants detained in Leavenworth federal prison live in squalor without sunlight, letters claim Freya Study Club May meeting notes Kansas attorney general: State can legally negotiate gaming compact with Wyandotte Nation Augusta’s first hospital **Other News** June 9, 2025 June 9, 2025 June 9, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 Butler County Times-Gazette, aCherryRoad MediaNewspaper. All rights reserved."}