{"id": 2202, "name": "Daily Squib", "domain": "dailysquib.co.uk", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.dailysquib.co.uk/world/62120-white-flight-last-remaining-whites-in-britain-could-live-in-outer-hebrides.html/comment-page-1#comment-29716", "title": "62120 White Flight Last Remaining Whites In Britain Could Live In Outer Hebrides.html", "content": "Home World Entertainment Sci/Tech Business Sports Health Opinion Most Popular Satire LifestyleWin BettingGamesFinanceTradingCarsPropertyShoppingStyleTravel Win Betting Games Finance Trading Cars Property Shopping Style Travel Win Betting Games Finance Trading Cars Property Shopping Style Travel About Contact Advertising Cookies GDPR Home World Entertainment Sci/Tech Business Sports Health Opinion Most Popular Satire LifestyleWin BettingGamesFinanceTradingCarsPropertyShoppingStyleTravel Win Betting Games Finance Trading Cars Property Shopping Style Travel Win Betting Games Finance Trading Cars Property Shopping Style Travel **White Flight: Last Remaining Whites in Britain Could Live in Outer Hebrides** LONDON - England - The recent report that whites in Britain will be a minority soon exemplifies the phrase \"white flight\". Thereportthat white British people will be a minority in less than 40 years time was a no-brainer, you don’t need to do an expensive study to know that. A Leicester street where there isonly onewhite family left is a harrowing story about the massive influx from Asia and Africa and other third world zones. Britain, thanks to socialist policies, has become aThird World country. Nothing works any more, no one can get a doctor’s appointment and the tiny windy roads are car parks where no one even indicates on a turn or is insured. The schools are full of kids talking foreign languages, the buses and trains smell like body odour and curry, and the universities are full of lucrative foreign students, who, if they were not there, would cause each institution to go belly up. White flight is a very real phenomenon, and it has been happening ever since the mass unfettered influx into these tiny isles. Whites in Britain do not have a future any more. Can this tragic deletion of an entire race of people ever be reversed? Can white flight be stopped? Well, the only white people breeding are the benefits class of people. The educated middle and upper classes have all but stopped breeding, and even if there was a slight up tick it would not make much of a difference anyway. Because of Labour’s discriminatory anti-aspiration punitive tax schemes, most of the educated professionals, entrepreneurs and millionaires have alreadyleft the UK. The Labour government do not make things easier for the population because any form of aspiration or growth is quashed on the spot. What’s the point in making over £100,000 per annum when over 70% of that is removed and given to the feckless, fake asylum seekers, Big State pensions, or other useless profligate socialist schemes? There is absolutely no point in working hard in modern socialist Britain because you will never get anything for it. Everyone’s on the take now in Britain. The benefits paid to non-British people in the country every year is £12 billion alone. That’s a very small portion of the massive bills that mass immigration creates, with no benefit to the country’s economy. The country is being bled dry, and soon there will be nothing left. That’s how socialism works, they bleed everything dry until there’s only one penny left, and then everyone’s poor, but here’s the twist — everyone’s equal then. That’s the final insult and the purpose of socialism as a political doctrine — equality. Indeed, there is equality in poverty, one only has to look atVenezuelaor Cuba to see that, but of course high party officials there are the only ones who can afford a life of luxury whilst everyone else is piss poor. Britain has been cursed with socialism ever since the 19th century, and the ultimate goal, as Lenin very firmly stated about socialism, is that it becomes communism.“The goal of socialism is communism.”If you look at history, you can see that socialism always ends in three things: poverty, destruction, and communism. The Great British Empire was killed off by socialists, and even to this day Britain’s last bastions around the world are beingplundered and given awayat great cost by socialist prime ministers and their decolonisation crusades. Britain is now a Third World toilet. It is adumping groundfor the Third World, as they stream across the Channel from France, who are more than glad to have their navy escort the boats across the sea. There is no hope for Britain, simply because it has beendemoralisedand defeated from within by soviet political ideologies like socialism and wokism. Its illustrious history is now a faeces splattered stain upon the annals of a time of past greatness, sadly now there is nothing left but mediocre grey monotony in death, a bloated carcass moving with maggots. What do you do as an Englishman or woman when your entire identity is stripped from you, where you are made to feel ashamed of your ancestors, where your history is disavowed, where even the colour of your skin is now an anomaly in the country your forefathers existed for thousands of years? The Russians or Chinese do not need to invade Britain to defeat it, because it has been defeated by the socialists, the Marxists, the communists. In fact, the socialists will surrender immediately to their soviet brethren, the Maoist CCP and PLA if they ever land their boats at Dover. It would be a welcome moment of liberation for the British socialists. The conquerors of a nation now come inrubber dinghies. They do not have to fight at the Battle of Hastings, they simply paddle over and get a 4-star fucking hotel, benefits, free health care, free education and free housing. No wonder there is white flight when this sort of nonsense is allowed to go on. Socialism has afforded this insanity, because no one has to fight for anything any more, no one has to earn anything any more and ultimately without these elements of human achievement and aspiration one only gets poverty, mediocrity and a lazy useless pathetic death. Britain has no future, not under the socialism of Labour, the Conservatives, the Lib Dems, the Marxist Greens or dare we utter the words of the Reform Party who will not be able to change the embedded socialist structures that make up the entire governmental state system. When all the civil servants, the departments, the NHS, the schools, the universities, the unions, the military, the entire fucking structure is socialist, no other political ideology can function over that base. It is nigh on impossible, unless the entire structure, the entire house of cards is demolished from top to bottom and rebuilt brick by brick without socialism, Marxism and communism. Until then, it will be white flight to the Outer Hebrides for the remaining indigenous Brits, but even that place will eventually be overrun. Tags britain communism marxism mass migration socialism third world wokism **Top Secret Kremlin UK Invasion Plan Leaked** **London Celebrated as Crime City of the World** **Communist Gary Lineker to Go and Live in North Korea** stevescanJune 10, 2025 At 19:54Looks like the far leftist automatons have been attracted to this article 😀Reply Looks like the far leftist automatons have been attracted to this article 😀 Looks like the far leftist automatons have been attracted to this article 😀 AnonymousJune 10, 2025 At 18:26Stop spreading disinformation and utter utter LIES. Your madeup studies are a joke there was no such study saying white British ppl will be minorites that’s complete fake news. Whoever wrote this crap is a Nazi stormtrooper. FAKE NEWS DO NOT READ THIS RUBBISH!ReplyHEMMIEJune 11, 2025 At 17:01Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat.Reply Stop spreading disinformation and utter utter LIES. Your madeup studies are a joke there was no such study saying white British ppl will be minorites that’s complete fake news. Whoever wrote this crap is a Nazi stormtrooper. FAKE NEWS DO NOT READ THIS RUBBISH! HEMMIEJune 11, 2025 At 17:01Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat.Reply Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat. Stop spreading disinformation and utter utter LIES. Your madeup studies are a joke there was no such study saying white British ppl will be minorites that’s complete fake news. Whoever wrote this crap is a Nazi stormtrooper. FAKE NEWS DO NOT READ THIS RUBBISH! HEMMIEJune 11, 2025 At 17:01Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat.Reply Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat. Typical you did not bother to even read the article or research any of the links yourself before blurting out your outrage and insults. Look up the academic professor Matthew Goodwin who conducted the study. Next time try pausing before commenting and get your facts right because you look like a complete twat. Anya117ktJune 10, 2025 At 14:36White people are all scum anyway we won’t miss them ha ha ha!!!Reply White people are all scum anyway we won’t miss them ha ha ha!!! White people are all scum anyway we won’t miss them ha ha ha!!! To Hell With UJune 10, 2025 At 10:29You’ve got it all wrong in this racist article. There would not be an NHS without us socialists. Where would Britain be then? Because of socialism the UK is a great country that everyone in the world wants to come here. You disgust me. Fascist pig.Reply You’ve got it all wrong in this racist article. There would not be an NHS without us socialists. Where would Britain be then? Because of socialism the UK is a great country that everyone in the world wants to come here. You disgust me. Fascist pig. You’ve got it all wrong in this racist article. There would not be an NHS without us socialists. Where would Britain be then? Because of socialism the UK is a great country that everyone in the world wants to come here. You disgust me. Fascist pig. RobbieCJune 10, 2025 At 09:27One of the best pieces I’ve read for a long time. Lots of little nuances.Reply One of the best pieces I’ve read for a long time. Lots of little nuances. One of the best pieces I’ve read for a long time. Lots of little nuances. **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. **China and U.S. Reach Consensus in Trade Talks, Emphasising Cooperation** **At Least Mauritians Get Tax Cuts Thanks to Labour Chagos Surrender Deal** **Peaceful Looters Protest Against Mexican Deportations** **Vindictive Far-left Wokists Force Top Show Off Air on GB News** **BREAKING: Peaceful Protestors Now Shooting at Police in Los Angeles** **My Job Tax Policies Have Increased Unemployment by 4.6%** **US Forces Deploying LRAD Crowd Control Devices in LA Riots** **Experts: Trump Needs to Bring in Martial Law in California** **THE DAILY SQUIB ANTHOLOGY** The definitive book of Juvenalian satire and uncanny prophesies that somehow came true. This is an anthology encompassing 15 years of Squib satire on the internet compiled and compressed into one tiddly book. Buy the Book Now! China and U.S. Reach Consensus in Trade Talks, Emphasising Cooperation At Least Mauritians Get Tax Cuts Thanks to Labour Chagos Surrender Deal Peaceful Looters Protest Against Mexican Deportations Vindictive Far-left Wokists Force Top Show Off Air on GB News The King Has “Accidentally” Executed the Mayor of London HEMMIEonWhite Flight: Last Remaining Whites in Britain Could Live in Outer Hebrides drexonIslamic People Shocked as Sadiq Khan Now Wants to Legalise Cannabis Ali AghaeionIslamic People Shocked as Sadiq Khan Now Wants to Legalise Cannabis JaniceHarrowonThe King Has “Accidentally” Executed the Mayor of London rodrickemersononLA RIOTS AGAIN: The Purge On Los Angeles Continues Is the perpetual 'virtue signaller' Keir Starmer just pretending to be serious about increasing the UK's military capabilities or do you think he actually means to do something about it? He's pretending He's serious More bullshit and lies View Results Daily Squib Advertising About Contact Advertising Cookies GDPR **Breaking News** **China and U.S. Reach Consensus in Trade Talks, Emphasising Cooperation** **At Least Mauritians Get Tax Cuts Thanks to Labour Chagos Surrender Deal** **Peaceful Looters Protest Against Mexican Deportations** **Vindictive Far-left Wokists Force Top Show Off Air on GB News** Copyright ©Daily Squib 2024. The Daily Squib is a curious satirical parody newspaper offering breaking news, political satire, comedy, investigative journalism, opinion and celebrity news."}