{"id": 1536, "name": "The Vindicator", "domain": "vindy.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.vindy.com/news/latest-news/2025/06/south-koreas-new-president-lee-vows-to-pursue-talks-with-north-and-bolster-ties-with-us-and-japan/", "title": "South Koreas New President Lee Vows To Pursue Talks With North And Bolster Ties With Us And Japan", "content": "NewsLocal NewsCommunity NewsOhio NewsNational NewsInternational News Local News Community News Ohio News National News International News Local News Community News Ohio News National News International News Obituaries SportsLocal SportsHigh School SportsSports ColumnsYSU SportsOhio SportsNational Sports Local Sports High School Sports Sports Columns YSU Sports Ohio Sports National Sports Local Sports High School Sports Sports Columns YSU Sports Ohio Sports National Sports LifeLifestylesSocietyBurton ColePatty KimererTicket Lifestyles Society Burton Cole Patty Kimerer Ticket Lifestyles Society Burton Cole Patty Kimerer Ticket Classifieds OpinionLetters to the EditorEditorialsGuest columnistsBrenda J. Linert Letters to the Editor Editorials Guest columnists Brenda J. Linert Letters to the Editor Editorials Guest columnists Brenda J. Linert Contact UsContactAdvertiseSubmit NewsStatement of ValuesTerms of Service Contact Advertise Submit News Statement of Values Terms of Service Contact Advertise Submit News Statement of Values Terms of Service Public NoticesBrowse noticesPlace a notice Browse notices Place a notice Browse notices Place a notice News Sports Obituaries Opinion Life Classifieds Jobs Legal Notices SUBSCRIBE SUBSCRIBE June 04, 2025 | Today's Paper | Submit News | Subscribe Today | ... Today's Paper | Subscribe Today | ... **South Korea’s new President Lee vows to pursue talks with North and bolster ties with US and Japan** **** Jun 4, 2025 SEOUL, South Korea (AP) — South Korea’s new President Lee Jae-myung vowed today to restart dormant talks with North Korea and bolster a trilateral partnership with the U.S. and Japan, as he laid out key policy goals for his single, five-year term. Lee, who rose from childhood poverty to become South Korea’s leading liberal politician vowing to fight inequality and corruption, began his term earlier today, hours after winning a snap election that was triggered in April by the removal of then-President Yoon Suk Yeol over his ill-fated imposition of martial law late last year. In his inaugural address at the National Assembly, Lee said that his government will deal with North Korean nuclear threats and its potential military aggressions with “strong deterrence” based on the South Korea-U.S. military alliance. But he said he would “open a communication channel with North Korea and establish peace on the Korean Peninsula through talks and cooperation.” He said he’ll pursue pragmatic diplomacy with neighboring countries and boost trilateral Seoul-Washington-Tokyo cooperation. “Through pragmatic diplomacy based on national interests, we will turn the crisis posed by the major shift in global economic and security landscapes into an opportunity to maximize our national interests,” Lee said. SECURITY AND ECONOMIC CHALLENGES LIE AHEAD It was unclear whether Lee’s election would cause any major, immediate shift in South Korea’s foreign policy. Lee, previously accused by critics of tilting toward China and North Korea and away from the U.S. and Japan, has recently repeatedly stressed South Korea’s alliance with the U.S. as the foundation of its foreign policy and avoided any contentious remarks that would raise questions on his views on the U.S. and Japan. “We’ll have to now see if the pressures of office will cause Lee Jae-myung to govern from the center — at least when it comes to matters of national security and the alliance with the United States,” said Ankit Panda, an expert with the Carnegie Endowment for International Peace. “It’s hard to predict with absolute certainty how he will deal with the U.S., North Korea, Japan and China because he’s changed his position so much,” said Duyeon Kim, a senior analyst at the Washington-based Center for a New American Security. “We can expect tensions if his government doesn’t align with Washington’s approach to China and Japan.” The toughest external challenges awaiting Lee are U.S. President Donald Trump’s tariff policy and North Korea’s expanding military partnerships with Russia. But experts earlier said whoever becomes president can’t do much to secure major progress in South Korea’s favor on those issues. US, JAPAN AND CHINA REACT The U.S. and Japan said they congratulated Lee’s election and expressed their commitments to developing three-way cooperation. Japanese Prime Minister Shigeru Ishiba said he wants to hold summit talks with Lee “as early as possible,” saying he hopes to further promote bilateral ties, both public and commercial. The U.S. State Department said that Seoul and Washington share “an ironclad commitment” to the alliance. Chinese President Xi Jinping also sent a congratulatory message to Lee, saying that Beijing is willing to work with Seoul to advance their cooperative partnership for the benefit of the countries’ peoples, according to state broadcaster CCTV. It’s unclear how North Korea would react to Lee’s speech, as it has shunned any talks with South Korea and the U.S. since 2019. North Korea in recent years has supplied weapons and troops to support Russia’s war against Ukraine, and South Korea, the U.S. and their partners suspect Russia might in return transfer high-tech technologies to North Korea to help it perfect its nuclear weapons program. Russia’s Tass news agency said today that top Russian security official Sergei Shoigu has arrived in Pyongyang for a meeting with North Korean leader Kim Jong Un, in the latest sign of the countries’ booming exchanges. Lee has said he would support Trump’s moves to restart nuclear diplomacy with Kim Jong Un as part of efforts to engage with North Korea. North Korea hasn’t publicly responded to Trump’s outreach. “Lee and Trump would personally want to resume dialogue with Kim Jong Un. But North Korea has no incentive to talk to Washington or Seoul,” said Duyeon Kim, the analyst. “Pyongyang has Beijing and Moscow’s support both politically and economically, and can buy a lot of time to further perfect its nuclear weapons.” Later today, Lee nominated former Unification Minister Lee Jong-seok, a dove who favors greater rapprochement with North Korea, as his spy chief. The nomination is likely related to Lee Jae-myung’s hopes to reopen talks, as the National Intelligence Service previously played a behind-the-scene role to promote ties with North Korea, observers say. Lee Jae-myung also nominated his key political ally and veteran lawmaker Kim Min-seok as prime minister, the government’s No. 2 job. Lee is expected to nominate other top Cabinet members in coming days. SOUTH KOREA STILL FACES POLITICAL DIVIDE Lee called for unity to address the country’s stark political divide deepened after Yoon’s martial law debacle, saying that he will “answer the people’s solemn call to let hope bloom over deep and painful wounds.” Lee still promised a thorough investigation into the circumstances surrounding Yoon’s martial law imposition, describing it as a “rebellion that seized people’s sovereignty with arms.” Lee said revitalizing a slowing domestic economy would be his top priority and that his government would immediately launch an emergency task force to wage a “head-on battle” against the threats of recession. He also promised more aggressive government spending to help spur economic activity. South Korea’s central bank last week cut its key interest rate and sharply lowered its growth outlook for 2025 to 0.8%, as it moved to counter Trump’s tariff hikes and weak domestic demand worsened by recent political turmoil. Lee also reiterated his campaign vows to reduce inequality, saying that “the polarization fueled by inequality is now hindering further growth.” Lee’s term began immediately without the usual two-month transition period after the National Election Commission formally confirmed his election victory. Before his inauguration, Lee visited the national cemetery in Seoul to pay his respects to late Korean leaders, patriots and war dead who are buried there, and he had a telephone call with Joint Chiefs of Staff chairman Kim Myung-soo to call for military readiness against possible North Korean aggression. __ Associated Press writers Mari Yamaguchi in Tokyo and Simina Mistreanu in Taipei, Taiwan, contributed to this report. **Newsletter** **Latest News** **Latest News** **Wilders throws Dutch politics into turmoil with new elections now on the horizon** **Wilders throws Dutch politics into turmoil with new elections now on the horizon** THE HAGUE, Netherlands (AP) — Populist far-right lawmaker Geert Wilders plunged Dutch politics into turmoil ... **South Korea’s new President Lee vows to pursue talks with North and bolster ties with US and Japan** **South Korea’s new President Lee vows to pursue talks with North and bolster ties with US and Japan** SEOUL, South Korea (AP) — South Korea's new President Lee Jae-myung vowed today to restart dormant talks with ... **What we know about the shootings near Gaza aid distribution sites** **What we know about the shootings near Gaza aid distribution sites** TEL AVIV, Israel (AP) — Shootings have erupted nearly daily since last week in the Gaza Strip in the vicinity of ... **Canadian wildfire smoke causes ‘very unhealthy’ conditions in American Midwest and reaches Europe** **Canadian wildfire smoke causes ‘very unhealthy’ conditions in American Midwest and reaches Europe** MINNEAPOLIS (AP) — Smoke from Canadian wildfires carried another day of poor air quality south of the border to ... **Meta becomes the latest big tech company turning to nuclear power for its AI needs** **Meta becomes the latest big tech company turning to nuclear power for its AI needs** WASHINGTON (AP) — Meta has cut a 20-year deal to secure nuclear power to help meet surging demand for artificial ... **Russian rockets kill 3 in a Ukrainian city as Kyiv claims it damaged a key bridge** **Russian rockets kill 3 in a Ukrainian city as Kyiv claims it damaged a key bridge** KYIV, Ukraine (AP) — A Russian rocket attack targeted the northeastern Ukrainian city of Sumy today, killing at ... MOST READ **Seether, Daughtry tour coming to Covelli Centre** **Seether, Daughtry tour coming to Covelli Centre** **Russian rockets kill 3 in a Ukrainian city as Kyiv claims it damaged a key bridge** **Russian rockets kill 3 in a Ukrainian city as Kyiv claims it damaged a key bridge** **LaPolla deals up victory for Kennedy in regional** **LaPolla deals up victory for Kennedy in regional** **CDC accused of conspiracy in East Palestine derailment suit** **CDC accused of conspiracy in East Palestine derailment suit** **Holcomb’s long journey back from injury is almost over** **Holcomb’s long journey back from injury is almost over** **Canfield keeps it rolling: Cardinals top Hubbard in local regional semi** **Canfield keeps it rolling: Cardinals top Hubbard in local regional semi** **Starting at $3.23/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsCommunity News Local News Community News Local News Community News Obituaries Sports Contact Us Advertise Copyright © 2025 Eastern Ohio Newspapers, Inc. | https://www.vindy.com | 240 Franklin Street SE, Warren, OH 44482 | 330-841-1600 |Terms of Service"}