{"id": 2138, "name": "The EC Journal", "domain": "theecjournal.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://theecjournal.com/sportnews-and-football/ruben-amorim-very-fond-of-premier-league-attacker-wanted-by-arsenal-liverpool/", "title": "Ruben Amorim Very Fond Of Premier League Attacker Wanted By Arsenal Liverpool", "content": "**UFABET เว็บไซต์แทงบอลออนไลน์ พนันออนไลน์ ที่ดีที่สุด UFABET999** Home สมัคร ufabet Article **Ruben Amorim ‘very fond’ of Premier League attacker wanted by Arsenal & Liverpool** **Browse By** **Archives** May 2025 March 2025 January 2025 December 2024 September 2024 June 2024 April 2024 February 2024 November 2023 August 2023 May 2023 July 2022 **Calendar** Ruben Amorim ‘very fond’ of Premier League attacker wanted by Arsenal & Liverpool Antoine Semenyo on Man Utd transfer radar Bournemouth attacker shining under Andoni Iraola Asking price for Ghana internatonal is steep Semenyo has contributed 13 goals and assists in the Premier League thisทางเข้า UFABET สำหรับสมาชิกใหม่ สมัครวันนี้ รับโบนัสฟรีseason, operating on either flank. To help propel the Cherries into the top half of the table and potential European contention. The 25-year-old scored in Bournemouth’s 3-0 win at Old Trafford in December and will line up against the Red Devils once more before the season concludes. United’s interest in Semenyo has been established in recent weeks. Rivalling Arsenal and Liverpool both of whom are thought to have been tracking the Ghana international for a while. The Athletic’s David Ornstein made clear Amorim’s particular liking of Semenyo during an appearance on American broadcasterNBC Sports. But, as had already been established, Bournemouth won’t let Semenyo go cheap. “They would be looking to sell him for a fee in excess of what they got for Dominic Solanke which was £65m. There’s no release clause, they would want a club record,” Ornstein said. Semenyo has played in each of English football’s top four divisions. As well as non-league, starting out at Bristol City and proving himself during lower-level loans. It was his form for the Robins in the Championship that eventually prompted Bournemouth to pay £10m in January 2023. United aren’t just targeting a striker to make good on Amorim’s ambition of challenging for the Premier League title as soon as possible. Semenyo could be a good fit for one of the split ‘number ten’ roles that are a feature of the coach’s 3-4-2-1 system. With Wolves forward Matheus Cunha also identified for a similar purpose. Cunha is slightly older and more experienced. But comes with a £62.5m release clause in his contract and has openly declared his readiness for a bigger move. **Archives** May 2025 March 2025 January 2025 December 2024 September 2024 June 2024 April 2024 February 2024 November 2023 August 2023 May 2023 July 2022 **Categories** Article Beauty & Health Beauty and Health & Lifestyle Sport and Game Sportnews and Football **503** **Service Unavailable** The server is temporarily busy, try again later!"}