{"id": 360, "name": "Detik.com", "domain": "detik.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sport.detik.com/sepakbola/foto-sepakbola/d-7959514/5-tim-paling-rapuh-di-kualifikasi-piala-dunia-2026-afc-round-3-ada-indonesia", "title": "5 Tim Paling Rapuh Di Kualifikasi Piala Dunia 2026 Afc Round 3 Ada Indonesia", "content": "detikcom Terpopuler Live TV Kirim Tulisan detikPilkada detikNews detikFinance detikInet detikHot detikSport Sepakbola detikOto detikTravel detikFood detikHealth Wolipop DetikX 20Detik detikFoto detikEdu detikHikmah detikProperti detikPop detikJateng detikJatim detikJabar detikSulsel detikSumut detikBali detikSumbagsel detikJogja detikKalimantanNEW For Your BusinessNEW Pasang Mata adsmart detikEvent Trans Snow World Trans Studio Flying Over Indonesia berbuatbaik.id ziswafctarsa.id Signature Awards Bingkai.idNEW CNN Indonesia CNBC Indonesia Hai Bunda InsertLive Beautynesia Female Daily CXO Media Loading... Home Liga Inggris Liga Italia Liga Spanyol Liga Jerman Liga Indonesia UEFA Dunia Indeks detikSport Terpopuler Jadwal Pertandingan Klasemen Liga Hasil Pertandingan Man of The Match Gila Bola Foto Video Infografis Liga InggrisLiga ItaliaLiga SpanyolLiga JermanLiga IndonesiaLiverpoolArsenalManchester CityNewcastle UnitedChelseaAston VillaNottingham ForestBrighton & Hove AlbionBrentfordFulhamAFC BournemouthCrystal PalaceEvertonWolverhampton WanderersWest Ham UnitedManchester UnitedTottenham HotspurLeicester CityIpswich TownSouthampton Liverpool Arsenal Manchester City Newcastle United Chelsea Aston Villa Nottingham Forest Brighton & Hove Albion Brentford Fulham AFC Bournemouth Crystal Palace Everton Wolverhampton Wanderers West Ham United Manchester United Tottenham Hotspur Leicester City Ipswich Town Southampton Liverpool Arsenal Manchester City Newcastle United Chelsea Aston Villa Nottingham Forest Brighton & Hove Albion Brentford Fulham AFC Bournemouth Crystal Palace Everton Wolverhampton Wanderers West Ham United Manchester United Tottenham Hotspur Leicester City Ipswich Town Southampton **5 Tim Paling Rapuh di Kualifikasi Piala Dunia 2026 AFC Round 3, Ada Indonesia** Jakarta- Lima tim kebobolan 20 gol atau lebih di putaran ketiga Kualifikasi Piala Dunia 2026 zona Asia. Indonesia menjadi salah satunya. Qatar menjadi tim yang kebobolan paling banyak. Dalam 10 pertandingan di Grup A, Qatar kebobolan 24 gol. Meski demikian, Qatar tetap lolos ke putaran keempat. Foto: REUTERS/Ibraheem Al Omari Masih dari grup A, Korea Utara menjadi tim dengan kebobolan terbanyak kedua (21 gol). Korea Utara finis sebagai juru kunci Grup A. Foto: AFP/GIUSEPPE CACACE Di Grup B, ada Kuwait yang kemasukan 20 gol dalam 10 pertandingan. Kuwait terbenam di dasar klasemen setelah tidak pernah menang, imbang lima kali, dan kalah lima kali. Foto: NurPhoto via Getty Images/NurPhoto China kebobolan 20 gol dalam 10 pertandingan di Grup C. China pada akhirnya finis kelima dengan selisih gol -13. Foto: REUTERS/Ajeng Dinar Ulfiana Indonesia kemasukan 20 gol dalam 10 pertandingan di Grup C. Dari 20 gol itu, setengahnya dari dua laga melawan Jepang. Meski demikian, tim Garuda tetap lolos ke putaran keempat usai finis di posisi keempat. Foto: Getty Images/Kenta Harada **6 Tim Tersubur Kualifikasi Piala Dunia 2026 AFC Round 3: Jepang Nomor 1** **Calon Lawan Timnas Indonesia Jika Lolos Round 4 Kualifikasi Piala Dunia 2026** **Daftar 6 Tim Lolos ke Round 4 Kualifikasi Piala Dunia 2026 zona Asia** **Hitung-hitungan jika Timnas Indonesia ke Round 4 Kualifikasi Piala Dunia 2026** **Hasil Lengkap Indonesia di Kualifikasi Piala Dunia 2026 Zona Asia Round 3** **Prediksi Lawan Indonesia di Round 4 Kualifikasi Piala Dunia 2026** **Klasemen Kualifikasi Piala Dunia 2026 Zona Asia dan Jadwal Matchday 9** **Klasemen Kualifikasi Piala Dunia 2026 Zona Asia dan Jadwal Matchday 8** **Berita Terpopuler** **Huijsen Masa Bodoh dengan Status Bek Termahal Madrid** **Tuchel Ingin Latih Inggris di Euro 2028** **Maresca Sebut Sepakbola Italia Terlalu Lambat, Singgung PSG Vs Inter** **Van de Ven Masih Pertanyakan Keputusan Spurs Pecat Postecoglou** **Sporting Tak Mau Jual Murah Gyokeres** detikNews detikEdukasi detikFinance detikInet detikHot detikSport Sepakbola detikOto detikProperti detikTravel detikFood detikHealth Wolipop detikX 20Detik detikFoto detikHikmah detikPop berbuatbaik.id Pasang Mata Adsmart detikEvent Signature Awards Trans Snow World Trans Studio Bingkai.id Ziswafctarsa.id Flying Over Indonesia For Your Business Redaksi Pedoman Media Siber Karir Kotak Pos Media Partner Info Iklan Privacy Policy Disclaimer CNN Indonesia CNBC Indonesia Haibunda Insertlive Beautynesia Female Daily CXO Media"}