{"id": 1044, "name": "Ny Teknik", "domain": "nyteknik.se", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.nyteknik.se/debatt/sverige-maste-ta-kontroll-over-sin-digitala-framtid-vara-grannlander-har-redan-sett-riskerna/4360908", "title": "Sverige Maste Ta Kontroll Over Sin Digitala Framtid Vara Grannlander Har Redan Sett Riskerna", "content": "Prenumerera Logga in Min sida Prenumerera InnehållDebattElbilarEnergiFarkostFordonIndustriInnovationKarriärKrönikorNytt från Ny TeknikRymdenStartupTech Debatt Elbilar Energi Farkost Fordon Industri Innovation Karriär Krönikor Nytt från Ny Teknik Rymden Startup Tech Debatt Elbilar Energi Farkost Fordon Industri Innovation Karriär Krönikor Nytt från Ny Teknik Rymden Startup Tech Tema33-listanBusiness for UkraineIngenjörens valIngenjörsdagenNy Teknik EducationWeraÅrets CTOSvenska Mässan (sponsrad)SKF (sponsrad) 33-listan Business for Ukraine Ingenjörens val Ingenjörsdagen Ny Teknik Education Wera Årets CTO Svenska Mässan (sponsrad) SKF (sponsrad) 33-listan Business for Ukraine Ingenjörens val Ingenjörsdagen Ny Teknik Education Wera Årets CTO Svenska Mässan (sponsrad) SKF (sponsrad) TjänsterNyhetsbrevNyhetsappNy Teknik InsightPodcastSpelPlayE-tidningLediga jobb Nyhetsbrev Nyhetsapp Ny Teknik Insight Podcast Spel Play E-tidning Lediga jobb Nyhetsbrev Nyhetsapp Ny Teknik Insight Podcast Spel Play E-tidning Lediga jobb Ny Teknik GroupOm Ny TeknikAnnonseraPrenumereraFöretagsabonnemangKundtjänstPersonuppgifterCookiesRedaktionenFAQTipsa oss om nyheter!Ny Teknik EventsNy Teknik EducationOm Ny Teknik GroupTeknikhistoriaLag & AvtalArbetarskydd Om Ny Teknik Annonsera Prenumerera Företagsabonnemang Kundtjänst Personuppgifter Cookies Redaktionen FAQ Tipsa oss om nyheter! Ny Teknik Events Ny Teknik Education Om Ny Teknik Group Teknikhistoria Lag & Avtal Arbetarskydd Om Ny Teknik Annonsera Prenumerera Företagsabonnemang Kundtjänst Personuppgifter Cookies Redaktionen FAQ Tipsa oss om nyheter! Ny Teknik Events Ny Teknik Education Om Ny Teknik Group Teknikhistoria Lag & Avtal Arbetarskydd InnehållDebattElbilarEnergiFarkostFordonIndustriInnovationKarriärKrönikorNytt från Ny TeknikRymdenStartupTech Debatt Elbilar Energi Farkost Fordon Industri Innovation Karriär Krönikor Nytt från Ny Teknik Rymden Startup Tech Debatt Elbilar Energi Farkost Fordon Industri Innovation Karriär Krönikor Nytt från Ny Teknik Rymden Startup Tech Tema33-listanBusiness for UkraineIngenjörens valIngenjörsdagenNy Teknik EducationWeraÅrets CTOSvenska Mässan (sponsrad)SKF (sponsrad) 33-listan Business for Ukraine Ingenjörens val Ingenjörsdagen Ny Teknik Education Wera Årets CTO Svenska Mässan (sponsrad) SKF (sponsrad) 33-listan Business for Ukraine Ingenjörens val Ingenjörsdagen Ny Teknik Education Wera Årets CTO Svenska Mässan (sponsrad) SKF (sponsrad) TjänsterNyhetsbrevNyhetsappNy Teknik InsightPodcastSpelPlayE-tidningLediga jobb Nyhetsbrev Nyhetsapp Ny Teknik Insight Podcast Spel Play E-tidning Lediga jobb Nyhetsbrev Nyhetsapp Ny Teknik Insight Podcast Spel Play E-tidning Lediga jobb Ny Teknik GroupOm Ny TeknikAnnonseraPrenumereraFöretagsabonnemangKundtjänstPersonuppgifterCookiesRedaktionenFAQTipsa oss om nyheter!Ny Teknik EventsNy Teknik EducationOm Ny Teknik GroupTeknikhistoriaLag & AvtalArbetarskydd Om Ny Teknik Annonsera Prenumerera Företagsabonnemang Kundtjänst Personuppgifter Cookies Redaktionen FAQ Tipsa oss om nyheter! Ny Teknik Events Ny Teknik Education Om Ny Teknik Group Teknikhistoria Lag & Avtal Arbetarskydd Om Ny Teknik Annonsera Prenumerera Företagsabonnemang Kundtjänst Personuppgifter Cookies Redaktionen FAQ Tipsa oss om nyheter! Ny Teknik Events Ny Teknik Education Om Ny Teknik Group Teknikhistoria Lag & Avtal Arbetarskydd Tech Energi Elbilar Farkost Fordon Debatt Karriär Lediga jobb E-tidning Spel Podcast 33-listan Ingenjörsdagen DEBATT **”Sverige måste ta kontroll över sin digitala framtid – våra grannländer har redan sett riskerna”** **DEBATT. Norge och Danmark har redan insett riskerna med beroende av amerikanska molntjänster. Sverige kan inte stå passivt och hoppas att USA alltid kommer vara en pålitlig partner, skriver Johan Christenson, Iver.** Det här är en debattartikel. Åsikterna som framförs är skribentens egna. Föreställ dig att du en dag inte längre kan logga in på din bank, att sjukhus inte längre kan komma åt patientjournaler och att myndigheter inte kan kommunicera med sina medborgare. Föreställ dig att hela Sveriges kritiska infrastruktur – elnät, kollektivtrafik och försvarsorganisationer – plötsligt står utan digitalt stöd. Detta är inte en dystopisk framtidsvision, utan en högst reell risk om Donald Trump väljer att använda amerikanska molntjänster som ett politiskt vapen mot Europa. Vi ser redan konsekvenserna av Trumps protektionistiska och isolationistiska politik. Hoten om tullar slår hårt mot global handel och det råder osäkerhet om USA kommer stötta ett annat Natoland vid angrepp. Budskapet ”America first” har verkligen fått genomslag med den nygamla presidenten vid rodret. **Den svenska regeringen har prioriterat försvarssatsningar till historiska nivåer på grund av det akuta läget i Europa. Men varför ses inte digital infrastruktur som lika strategiskt viktig?** Vi har ett nytt geopolitiskt landskap där Europas säkerhet och ekonomiska framtid måste bygga på självständighet – och det måste börja med att vi har rådighet över vår digitala infrastruktur som ligger till grund för hela vårt samhälle. USA visade redan under Trumps förra mandatperiod att de är redo att använda digitala verktyg som geopolitisk påtryckning. Vi får därmed betrakta det som en realitet att amerikanska molntjänster kan stängas av för europeiska användare om det passar amerikanska intressen. Därför måste Europa släppa sitt beroende av Silicon Valley. I Sverige får vi nu återigen lära oss vikten av krisberedskap och vi ska ha mat och vatten för att klara oss själva 72 timmar. Men vad händer om vi plötsligt stängs av från våra digitala plattformar? Om vi inte längre har tillgång till molntjänster för bankverksamhet, sjukvård, kommunikation och försvar? Precis som vi har fysisk krisberedskap måste vi bygga upp en digital beredskap. Sverige och Europa behöver kunna stå på egna ben om vi utestängs från amerikanska molnleverantörer. Det handlar inte om ett hypotetiskt scenario – det är en realitet vi måste planera för. När den europeiska flygindustrin var hotad av amerikansk dominans på 70-talet gick Europa samman och skapade Airbus. Låt oss inspireras av det för att säkra vår digitala framtid. Vi behöver ett europeiskt Airbus-projekt för digital suveränitet – en långsiktig satsning där politiker och näringsliv går samman för att bygga europeiska molntjänster och digital infrastruktur som är oberoende av amerikanska företag. Eurostack är ett bra exempel på ett sådant initiativ. Genom att gå samman och skapa en europeisk molninfrastruktur kan vi minska vårt beroende av amerikanska plattformar. Den svenska regeringen har prioriterat försvarssatsningar till historiska nivåer på grund av det akuta läget i Europa. Men varför ses inte digital infrastruktur som lika strategiskt viktig? Om vi plötsligt förlorar tillgången till amerikanska molntjänster kan hela vår ekonomi och säkerhet hotas. Sverige måste driva på för att digital suveränitet ska prioriteras lika högt som traditionellt försvar och främja europeiska lösningar för digital infrastruktur. Varje krona som staten spenderar på digital infrastruktur måste främja europeisk teknik. Norge och Danmark har redan insett riskerna och rekommenderar myndigheter och företag att utveckla strategier för att minska sitt beroende av amerikanska molntjänster. Sverige kan inte stå passivt och hoppas att USA alltid kommer vara en pålitlig partner. Vi behöver bygga upp våra egna digitala plattformar som är konkurrenskraftiga, säkra och fria från politisk påverkan från Washington. Europa kan inte längre vänta. Vi har sett vad som hände med Airbus - när Europa gick samman kunde vi konkurrera med Boeing. Nu är det dags att göra samma sak för vår digitala framtid. Alternativet är att låta Trump och framtida amerikanska presidenter hålla hela Europas digitala infrastruktur i ett järngrepp. Det är ett vågspel vi inte har råd med.Johan Christenson, techentreprenör, grundare av Cleura och teknikchef på Iver DELTA I DEBATTEN **Vill du skriva en debattartikel eller en replik?** Kontakta Ny Tekniks debattsida pådebatt@nyteknik.se Tänk på detta: • Texten ska vara unik för Ny Teknik. • Texten ska vara max 4 000 tecken inklusive mellanslag. • Undvik förkortningar och utropstecken. • Peka ut och beskriv ett problem eller en lösning, samt hur du eller ni vill lösa problemet eller ta vara på möjligheten. • Var tydlig med vem du eller ni debatterar med och varför. • Bifoga gärna porträttbild och ange fotobyline. **Bryt med molnjättarna – här är tjänsterna som säkrar dina data** **Bryt med molnjättarna – här är tjänsterna som säkrar dina data** **Startupbolaget Sana Labs vill skapa svensk AI-explosion** **Startupbolaget Sana Labs vill skapa svensk AI-explosion** **Här är svenska it-bolagen som tar strid mot techjättarna** **Här är svenska it-bolagen som tar strid mot techjättarna** **Regeringen ger tillstånd till grafitgruva i Nunasvaara** Regeringen har gett grönt ljus för vad som beskrivs som en ”strategisk viktig grafitgruva i Nunasvaara”, enligt ett pressmeddelande. **Regeringen ger tillstånd till grafitgruva i Nunasvaara** Regeringen har gett grönt ljus för vad som beskrivs som en ”strategisk viktig grafitgruva i Nunasvaara”, enligt ett pressmeddelande. **Danmarks hastiga beslut: Skaffar luftförsvar för nära 9 miljarder** Danmark har inte haft något markbaserat luftförsvar på över 20 år. Nu används pengar från en accelerationsfond för att ett första luftförsvar operativt senast 2026. Leverantörer från tre länder har valts ut. **Danmarks hastiga beslut: Skaffar luftförsvar för nära 9 miljarder** Danmark har inte haft något markbaserat luftförsvar på över 20 år. Nu används pengar från en accelerationsfond för att ett första luftförsvar operativt senast 2026. Leverantörer från tre länder har valts ut. **Nvidia ska bygga industriellt AI-moln för europeiska tillverkare** Nvidia ska öppna fabrik i Tyskland med 10 000 GPU:er. **Nvidia ska bygga industriellt AI-moln för europeiska tillverkare** Nvidia ska öppna fabrik i Tyskland med 10 000 GPU:er. **Kluriga spel hos Ny Teknik – löser du någon av utmaningarna?** **Kluriga spel hos Ny Teknik – löser du någon av utmaningarna?** **Polestar expanderar till Frankrike** **Polestar expanderar till Frankrike** **Lediga jobb** Enhetschef till Främmande underrättelseverksamhet **Enhetschef till Främmande underrättelseverksamhet** **Enhetschef till Främmande underrättelseverksamhet** **Enhetschef till Främmande underrättelseverksamhet** Driftledare Underhåll till helautomatiserad återvinningsanläggning **Driftledare Underhåll till helautomatiserad återvinningsanläggning** **Driftledare Underhåll till helautomatiserad återvinningsanläggning** **Driftledare Underhåll till helautomatiserad återvinningsanläggning** Utredare PSA inom systemteknik **Utredare PSA inom systemteknik** **Utredare PSA inom systemteknik** **Utredare PSA inom systemteknik** Projektledare inom säkerhetsskydd **Projektledare inom säkerhetsskydd** **Projektledare inom säkerhetsskydd** **Projektledare inom säkerhetsskydd** Teknisk projektledare inom säkerhetsskydd **Teknisk projektledare inom säkerhetsskydd** **Teknisk projektledare inom säkerhetsskydd** **Teknisk projektledare inom säkerhetsskydd** Systemutvecklare med DevOps fokus till Göteborgsområdet **Systemutvecklare med DevOps fokus till Göteborgsområdet** **Systemutvecklare med DevOps fokus till Göteborgsområdet** **Systemutvecklare med DevOps fokus till Göteborgsområdet** Javautvecklare till Göteborgsområdet **Javautvecklare till Göteborgsområdet** **Javautvecklare till Göteborgsområdet** **Javautvecklare till Göteborgsområdet** Nätverkstrafikanalytiker med aktörsfokus **Nätverkstrafikanalytiker med aktörsfokus** **Nätverkstrafikanalytiker med aktörsfokus** **Nätverkstrafikanalytiker med aktörsfokus** Handläggare med inriktning övning, utbildning och samverkan **Handläggare med inriktning övning, utbildning och samverkan** **Handläggare med inriktning övning, utbildning och samverkan** **Handläggare med inriktning övning, utbildning och samverkan** Enhetschef för Datacenterinfrastruktur **Enhetschef för Datacenterinfrastruktur** **Enhetschef för Datacenterinfrastruktur** **Enhetschef för Datacenterinfrastruktur** **Slutrapporten om skredet i Stenungsund klar** **Slutrapporten om skredet i Stenungsund klar** **”Digitaliseringens skuggproblem: Bygga innan behovet uppstår”** **”Digitaliseringens skuggproblem: Bygga innan behovet uppstår”** **184 miljarder till ny brittisk kärnkraftanläggning** **184 miljarder till ny brittisk kärnkraftanläggning** **Ai-agent flög svenskt stridsflyg – ”Fanns inte en given utgång”** **Ai-agent flög svenskt stridsflyg – ”Fanns inte en given utgång”** **Teknikföretagen: Trög marknad för svenska teknikföretag** **Teknikföretagen: Trög marknad för svenska teknikföretag** **Stegra lär av Northvolts misstag: ”Ett projekt”** **Stegra lär av Northvolts misstag: ”Ett projekt”** **Trump vill skapa superdatabas – spionteknikbolag får nyckelroll** **Trump vill skapa superdatabas – spionteknikbolag får nyckelroll** **Föreningen kan spara 300 000 kronor om året – med V2G** **Föreningen kan spara 300 000 kronor om året – med V2G** **Scania vill köpa Northvolt Labs – ”Försöker bilda ett konsortium”** **Scania vill köpa Northvolt Labs – ”Försöker bilda ett konsortium”** **Hon leder Volvos krocklabb: ”Följer inte – sätter standard”** **Hon leder Volvos krocklabb: ”Följer inte – sätter standard”** **”Fusion kan bli kärnkraften som enar politiker – över blocken”** **”Fusion kan bli kärnkraften som enar politiker – över blocken”** **Lastbilsjättarna går ihop: ”Ska forma utfasningen av fossila bränslen”** **Lastbilsjättarna går ihop: ”Ska forma utfasningen av fossila bränslen”** **”Effektavgifter är inte ett problem – de ger oss chans att tänka nytt”** **”Effektavgifter är inte ett problem – de ger oss chans att tänka nytt”** **Svenska Lovable med 130 000 kunder jagar miljardkapital** **Svenska Lovable med 130 000 kunder jagar miljardkapital** **Italiensk teknik när SSAB ska ”högautomatisera” stålverk i Luleå** **Italiensk teknik när SSAB ska ”högautomatisera” stålverk i Luleå** **Zuckerberg samlar AI-experter i hemligt ”superintelligens-team”** **Zuckerberg samlar AI-experter i hemligt ”superintelligens-team”** **”Elbilar och ny laddinfrastruktur gör elsystemet mer motståndskraftigt”** **”Elbilar och ny laddinfrastruktur gör elsystemet mer motståndskraftigt”** **AI-rusch driver Qualcomm till miljardköp av brittisk rival** **AI-rusch driver Qualcomm till miljardköp av brittisk rival** **Först i Europa: Här ska LKAB framställa kritiska mineral** **Först i Europa: Här ska LKAB framställa kritiska mineral** **Europas billigaste elbil lanseras bredare – när kommer den till Sverige?** **Europas billigaste elbil lanseras bredare – när kommer den till Sverige?** **Teslas robotchef lämnar – autopilot-chefen tar över** **Teslas robotchef lämnar – autopilot-chefen tar över** **Jensen Huang: Storbritannien i ”guldlockscenario” för AI** **Jensen Huang: Storbritannien i ”guldlockscenario” för AI** **Kvantdatorjätte förvärvar brittisk startup för miljardbelopp** **Kvantdatorjätte förvärvar brittisk startup för miljardbelopp** **”Dags att bryta Bank ID:s monopol – Sverige behöver digital valfrihet”** **”Dags att bryta Bank ID:s monopol – Sverige behöver digital valfrihet”** **Microsoft lanserar första bärbara Xbox-konsolen: ”ROG Xbox Ally”** **Microsoft lanserar första bärbara Xbox-konsolen: ”ROG Xbox Ally”** **Meta kan göra rekordinvestering i AI-bolag** **Meta kan göra rekordinvestering i AI-bolag** **Här finns allt på plats för att utmana Kinas tokdominans** **Här finns allt på plats för att utmana Kinas tokdominans** **Amazons nya satsning: humanoida robotar ska leverera paketen** **Amazons nya satsning: humanoida robotar ska leverera paketen** **Migrationsverket löste kötiden – men ingenjörsbrist hotar** **Migrationsverket löste kötiden – men ingenjörsbrist hotar** **”Budget-elbilen levererar mer teknik än väntat för pengarna”** **”Budget-elbilen levererar mer teknik än väntat för pengarna”** **Elbilarna är billigare än någonsin – men är de mer tillgängliga för det?** **Elbilarna är billigare än någonsin – men är de mer tillgängliga för det?** **12 elbilar under 400 000 kr – här är de billigaste alternativen** **12 elbilar under 400 000 kr – här är de billigaste alternativen** **Källor: Brist på sällsynta jordartsmetaller tvingar Suzuki att stänga produktion** **Källor: Brist på sällsynta jordartsmetaller tvingar Suzuki att stänga produktion** **Solparksboomen och elnätet: Hur ska elsystemet klara omställningen?** **Solparksboomen och elnätet: Hur ska elsystemet klara omställningen?** **Eminem stämmer Meta på miljard – 150 000 dollar per låt och plattform** **Eminem stämmer Meta på miljard – 150 000 dollar per låt och plattform** **Nu kan din digitala sekreterare Chat GPT läsa allt du gömt i molnet** **Nu kan din digitala sekreterare Chat GPT läsa allt du gömt i molnet** **Kinesiska myndigheter griper in: Elbilspriskriget ska upphöra** **Kinesiska myndigheter griper in: Elbilspriskriget ska upphöra** **Epic Games-tvisten: Apple måste genomföra App Store-förändringar** **Epic Games-tvisten: Apple måste genomföra App Store-förändringar** **BAE Systems Hägglunds stororder – Nato köper hundratals stridsfordon** **BAE Systems Hägglunds stororder – Nato köper hundratals stridsfordon** **Volvos lanserar nytt bilbälte – 66 år efter trepunktsbältet: ”Tre pusselbitar”** **Volvos lanserar nytt bilbälte – 66 år efter trepunktsbältet: ”Tre pusselbitar”** **Trump stoppar nya visum för utländska studenter till Harvard** **Trump stoppar nya visum för utländska studenter till Harvard** **Uppstickare utmanar kinesisk dominans – med snabbladdande LFP-batteri** **Uppstickare utmanar kinesisk dominans – med snabbladdande LFP-batteri** **Ny Teknik** Ny Teknik rapporterar om ny teknik inom energi, elbilsutveckling, övrig fordonsindustri, tech och digitalisering, it och telekom, innovation, miljö, om startupbolag och nya entreprenörer, om industrins utveckling och om hur tekniken förändrar samhället.Tidningen Ny Teknik riktar sig till ingenjörer, it-specialister, teknikkonsulter, forskare, studenter, beslutsfattare och allmänt teknikintresserade. Ny Tekniks mål är att hålla läsare uppdaterade med de senaste och viktigaste från teknikvärlden i form av nyheter, reportage och fördjupningar. Ny Teknik finns som nyhetssajt, nyteknik.se, och som papperstidning.Första numret av Ny Teknik kom ut 26 oktober 1967. Tidningen är i dag en del av mediehuset Ny Teknik Group Sverige AB, ett fristående svenskt medieföretag. Övriga tidningar i mediehuset är Teknikhistoria, Arbetarskydd och Lag & Avtal. **HÅLL DIG UPPDATERAD MED VÅRT NYHETSBREV!** **BEVAKA NYHETER** FacebookInstagramTwitterLinkedinLinkedin JobbRSS **KONTO** Min sidaHar du en fråga om din prenumeration?Kontakta kundtjänstVanliga frågor **ANSVARIG UTGIVARE** Thomas Peterssohn Chefredaktör och ansvarig utgivareKontakta redaktionen **POSTADRESS** Ny TeknikNy Teknik GroupBox 6323102 35 Stockholm **TIPSA OM NYHETER** E-post08-796 66 00Läs mer här **ANNONSERA** ProduktannonseraPlatsannonsera"}