{"id": 1447, "name": "This Magazine", "domain": "this.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://this.org/2022/10/04/diversifying-canadas-oldest-journalism-school/", "title": "Diversifying Canadas Oldest Journalism School", "content": "Facebook Instagram Twitter Talk series Support This Subscribe today! **This Magazine** Progressive politics, ideas & culture **This Magazine** Progressive politics, ideas & culture **The cold, hard truth** **The cold, hard truth** **Movie monopoly** **Movie monopoly** **Vagina dialogues** **Vagina dialogues** **Housing handcuffs** **Housing handcuffs** Politics Arts Health Environment Education Indigenous 2SLGBTQ+ **Diversifying Canada’s oldest journalism school** **In 2020, journalism students and alumni called out systemic racism and demanded change. Is Carleton doing the work?** Meral Jamal In the summer of 2020, against the backdrop of a global pandemic, the world had its re-reckoning with racism, and so did the place where I studied, Carleton University’s School of Journalism and Communication. It began when George Floyd, a Black American, died on May 25 of that year after being pinned to the ground by a white police officer in Minneapolis. Floyd’s death propelled conversations about systemic and institutionalized racism around the world. At my school, these conversations led to “A Call to Action: Pushing for institutional change at Carleton University’s School of Journalism.” Published by BIPOC students and alumni, the letter documents specific instances of racism they had experienced at the school and outlines 30 calls to action. Chief among these calls was one to diversify faculty. In the first call to action, students and alumni said the school must hire more BIPOC faculty, specifically Black and Indigenous faculty, as well as collect and release demographic data, with a distinction between tenured and contract staff. Students and alumni said they created the calls to action, because, while consulted in the past through the school’s Equity and Inclusion committee, created in 2019, “serious steps toward reform have not been shared with us or made public.” “Hiring practices have also not reflected changes that the school has expressed interest in making,” they added. In one section of the letter, BIPOC students and alumni also anonymously shared anecdotal experiences within the program. It reflected the significance of having racialized faculty in the program, especially in permanent positions: for most racialized students and alumni, it was a matter of better education through greater representation. “Before joining Carleton’s journalism school, I asked a recently graduated white student about the racial makeup of the program’s faculty,” one of them recalled in the letter. “They asked me why on earth that mattered. This is why it matters.” Students and alumni also shared the harm some of them experienced at the hands of existing faculty in the program, much of which was white until the calls to action were released. “A professor shouted a religious slur at me in an attempt to make a joke,” one of them wrote in the letter. “Once, in a fourth-year Indigenous reporting class, the professor told me racism is simply not real and an excuse,” another shared. “If you thought you saw something as racism or a source said something was due to racism, you’re just not doing a good job as a journalist.” In the two years since the calls to action were released, the program has brought in almost a dozen sessional instructors of colour and three tenure-track faculty, including high-profile Black journalists Nana aba Duncan and Adrian Harewood. Tobin Ng, a Carleton journalism student entering their third year at the time, says the calls to action were created “out of that frustration.” They elaborated that there “was this desire to just create a really comprehensive document that would basically outline all the things that students had been calling for again and again. There’s the emotional labour of having to repeat [ourselves], and just demand the same things without seeing concrete results,” they said. Two years since they helped write the calls to action, Ng says the school’s response to the letter, especially through the steps it has taken to diversify faculty in the program, has finally made them hopeful. “I think that the hiring of new faculty is a step towards allowing for things that will last long beyond my time or the time of the students who are involved in this work right now.” Yet, much work remains. While the school has hired professors and instructors of colour, more change is needed to ensure that diverse faculty continue to join the program moving forward, and feel supported enough to stay and grow within it. Some steps the school is taking, in particular, involve rethinking the job of a journalism professor, creating opportunities for research and growth, and recognizing the contributions of both the students and alumni, as well as the new faculty of colour, through allyship and support. RETHINKING THE JOBNana aba Duncan was sharing the job posting for a new chair at Carleton’s journalism school when a colleague suggested she apply for it. Duncan, who had spent much of her career at the CBC and had been actively involved in various diversity efforts at the public broadcaster, was completing the William Southam Journalism Fellowship at the University of Toronto’s Massey College at the time. Her research at Massey involved looking at the experiences of leaders of colour. She was interested in this topic in part because she’d never had the opportunity to work under a Black or racialized leader, and because she was looking to take on a leadership role herself. “I was in this place of thinking about race and leadership and a move in my own career,” Duncan recalls. “I was [also] in this place of making a change and thinking about journalism in a way that could just be better for those of us who come from underrepresented communities or misrepresented communities.” After that nudge to apply for the Carty Chair in Diversity and Inclusion Studies, Duncan took a moment to pause. Then, she superimposed her personal mission “to help change the industry so that racialized journalists can feel like their perspectives and expertise are just as worthy and legitimate as the expertise and experiences of white journalists” onto the job posting from Carleton. “I realized [it all] aligns … so I applied.” The Carty Chair is the first of its kind at Carleton and across Canada. No other journalism program has a chair permanently committed to diversity and inclusion studies. Until the summer of 2020, Carleton’s journalism school didn’t either. Allan Thompson, a professor and now the program head, insists the school had made the decision to convert its permanent chair in business and financial journalism into one that focuses on diversity and inclusion even before the calls to action were released. The decision was part of other strategic steps the school was taking since 2019, when Atong Ater, a former student in the program, shared her experiences as a journalism student at Carleton in a personal essay published by the CBC that May. A job posting for the position from September 2019, however, continued to advertise the Carty Chair as one specifically geared toward business and financial journalism, as it had been in previous years. While unclear about when the decision to change the focus of the job was actually made, Thompson says the new direction for the Carty Chair as one geared toward equity and inclusion gave the school a unique opportunity to maneuver around challenges that come with the hiring process, such as budget constraints from the university and the ability to hire new permanent faculty only when existing full-time professors retire from their positions. It also meant the school would have a permanent member committed to spearheading equity, diversity, and inclusion, and that no budget cuts or hiring changes would affect this work. “[Endowed chairs] exist in perpetuity … and the Carty Chair had been empty for a couple of years because the occupant retired and the position hadn’t been filled,” Thompson says of the decision. “Strategically and ethically, I think it was a really wise choice to use that opportunity to create the first chair of its kind in a Canadian journalism school, where that person would have a priority to look at a whole range of equity, diversity, and inclusion issues in journalism,” he adds. “To conduct research, to create new courses, to be available to students and faculty as a resource and to be a champion, but also just to be another faculty member.” Outside of budget constraints though, Thompson says he recognizes other challenges exist when it comes to hiring diverse faculty too. Perhaps rethinking the job also means rethinking the job requirements, especially the fact you need to have a master’s degree in order to apply for a faculty position. “Are we missing out on some really good journalists out there who have solid careers behind them, who might be interested in teaching, but don’t have a master’s degree?” he says. The conversation, however, goes beyond the school’s decision-making capacity. It continues with the university, which is ultimately responsible for changing job requirements, Thompson adds. CREATING OPPORTUNITIES FOR GROWTHDuncan completed her first year as the Carty Chair this July, having designed a course on journalism and belonging and begun working on a podcasting course for the upcoming year. She says the big difference between her job now and those in the past is that at Carleton, Duncan is “simultaneously a professor and the person who cares about diversity.” At the CBC, where she was the founding co-chair for Diversify CBC, a resource group for employees of colour, Duncan remembers the work being unpaid and something she did after hours, often on top of everything else. “I was doing [diversity work] at the side of my desk while also being the host of the weekend morning show, while also having a three- and five-year-old at home,” she says. “The difference between my work here at Carleton and my work at CBC is that I had two sides to myself at CBC,” Duncan adds, “and as strange as it sounds, in this position [of the Carty Chair], I feel freer to express how much I care about inclusion and diversity.” The work has in no way been easy, especially with working during a pandemic—often remotely or online—working from home while being a mother, and especially working to implement change that can often be emotionally draining too. It has, however, also been immensely fulfilling. “What has been rewarding is how students have responded to my course,” Duncan says, recalling the last day of class for her course on journalism and belonging. Students in the course shared with her a Kudoboard they had made. In it, they wrote their experiences in the class, thanking her for giving them the space to talk about complex issues so openly. Knowing it was her course that made these students feel that sense of gratitude filled Duncan with gratitude herself. “I just want us to continue to be fearless and curious and to do the work with respect.” CBC journalist Adrian Harewood also joined Carleton’s journalism program following the calls to action released by students and alumni in 2020. An associate professor at Carleton, Harewood says the position has given him the opportunity and space to conduct research and create courses that illuminate Canada’s Black history. An example of this is a course that focuses specifically on the history of Black journalism in Canada. “I’m really enjoying the process of creating the course and of creating curriculum and of identifying figures and media outlets that might be unfamiliar to people,” Harewood says. “I’m also working on a longer-term project looking at the history of a very prominent Black newspaper in Canada calledContrastthat was active in the late 1960s and 1970s and really was part and parcel or a product of the civil rights movement.” Harewood’s parents wrote forContrast, and he says the research process has been interesting, given that one of the most important interviews for the project was with his 85-year-old father. These opportunities—to research and to build a more inclusive curriculum—are giving Harewood the chance to help reduce the disconnect “between the academy and the community.” He sees his work as a way to “get busy outside of our comfortable spaces.” “Carleton is not this rarefied place, which only exists for members of the social, economic, and political elite. It is an institution that we own, too,” Harewood says. “I see that as being part of my own job and practice of trying to make space for more people but also to harness the resources of the university and share those resources with the community that we’re a part of.” His goals are varied, but being part of the faculty at Carletonand having opportunities for research, has magnified them. “I want Carleton to be a leader when it comes to all aspects of journalism education,” Harewood says of his plans. “I want us to be a space where we are comfortable taking risks […] where we embrace discomfort.” Ultimately, Harewood says he wants the program “always to be ahead of the curve. Looking back always, and appreciating history, but also looking forward in a very kind of bold way.” A FAR-FROM-PERFECT PROCESSMany of the students and alumni who worked on releasing the calls to action in 2020 have also been working with the school to implement them. The process is far from perfect. Much like Duncan’s experience doing diversity and inclusion work at the CBC, students and alumni involved in addressing the calls to action are not paid for this labour, and many of them do it outside of their full-time jobs. “We’re all working reporters with many other responsibilities on top of this,” Olivia Rania Bowden, a reporter with theToronto Starand an alumnus from the program, says. “When we decided to [publish] these calls to action, we were like, where do we have a voice? And what can we push?” For Duncan, the work of diversifying the oldest journalism program in Canada has been a rigorous process on the faculty level too. Whether through diversifying the curriculum and the courses, the guest speakers who engage with students, or the research projects she takes on, Duncan says the work of pushing for equity and inclusion both within the classroom and outside of it is “emotionally draining and sometimes, there are the surprise moments of harm.” An example of this, Duncan says, is when in some situations, she has heard a person say something racist or offensive or ignorant “and you either don’t know what to say, or you have to do the calculus.” For Duncan, the calculus involves deciding “whether or not I’m going to say something. And then if I decided I am going to say something, what am I going to say? And that calculus also includes: how is this person going to take it? How is my relationship going to change with this person?” According to Duncan, institutions like Carleton need to recognize “there is a burden that they don’t understand and it’s a burden they don’t know. Just as in the same way if my position was held by an Indigenous journalist or a person who went through a lot of trauma as a young person or a trans professor—there’s going to be a burden that they have that I wouldn’t know.” The nature of the work, according to both the students and alumni involved, as well as the faculty, requires recognition from the school that goes beyond engaging with them. “What really bothers me is when [the school has] made changes, they don’t credit us publicly,” says Bowden. “I know they’ve said they were thinking about this or working on [certain changes] prior to our calls, but the thing is we did it really quickly and really well around our extremely demanding jobs because we don’t have a choice but to make it happen. As people of colour, we don’t have a choice.” It also means recognizing the push for equity, diversity, and inclusion may have begun with students and alumni of colour, but that white students and faculty within the program are equally responsible for solutions and change moving forward. “Feeling bad or guilty is useful only as much as it is a natural feeling, and if it propels you to action, then that’s good,” says Duncan. “But I think allyship also means not performing your sadness or your guilt about the fact that systemic racism exists. And knowing that the performance of those feelings—it comes across as looking for absolution from BIPOC students or faculty. As we always say, it’s really about doing the work,” she adds. “Do the work with your colleagues, maybe with your other fellow white students, do the work within yourself.” THE CHALLENGES THAT REMAINWhile Carleton’s journalism program has taken steps to address the calls to action released in 2020, especially when it comes to diversifying faculty and sessional instructors within the program, leaders at the university continue to remain white. The Racialized Leaders Leading Canadian Universities research published inEducational Management Administration & Leadership Journallast year found that “universities in Canada are overwhelmingly top-down institutions.” “Even with an executive-level diversity advocate, there can be issues with diversity at the organizational level,” the research says. “Scholars have warned that these positions have the potential for tokenism, ‘whereby Chief Diversity Officers [and similar positions] may be seen as the face of diversity, but lack the formidable authority and support to create real and lasting change.’” Data from 2020 used in the research shows that 80 percent of Carleton University’s leadership is white, with 60 percent of leadership positions being held by white men, and another 20 percent held by white women. There are no Black or Indigenous men or women in leadership roles at the university. Mohamed Elmi, the acting executive director at Toronto Metropolitan University’s Diversity Institute and a co-author of the paper, says barriers at three levels—societal, organizational, and individual—determine how many people of colour seek leadership positions in academia. One of the biggest barriers, however, is that longer career trajectories within post-secondary institutions mean those leadership positions are much slower to change. “Even though from the outside, they [post-secondary institutions] are viewed as progressive, they are relatively bureaucratic and very slow,” Elmi says. At the same time, Elmi says the responsibility for better diversity and inclusion within the university must not fall on leaders alone. Instead, organizations and individuals that support a university, whether through funding or strategic partnerships, must also call on institutions to address diversity. “You don’t want to put the onus on the individuals, especially in a system that is not responsive,” he says. A BLUEPRINT FOR THE FUTUREMore than two years since the calls to action were first published by students and alumni, Carleton’s journalism school has taken significant steps to address the first: hiring diverse faculty. At the same time, conversations about other calls to action listed in the document are still taking place between the journalism school at Carleton and the university at large. Among these is the call to collect race-based student data and abolish unpaid internships. It is unclear how the diversity of Carleton as a university—or lack thereof—is affecting these conversations. Thompson does say they are ongoing. For students and alumni involved, the unmet calls to action remain front and centre. For Bowden, it’s important the school now goes from addressing the calls to action to defining its mission over the next couple years. It’s a way of ensuring accountability, especially since she feels “a lot of these issues in the industry, I think can be tackled by j-schools.” “I’m happy to see [changes] but I don’t want blog posts on our website being like, ‘Oh, we randomly did this and we randomly did this,’” Bowden says. “I want to see that in six months, [the school has] committed to [particular changes], and are they going to happen? And if it doesn’t, somebody is going to face consequences for that.” “That’s how any planning is done,” she says, adding, “When I do see it, that’s when I’m going to feel more confident about this process.” For Ng, who graduated just this summer, the changes that Carleton’s journalism program has made so far, as well as the ones they hope the school commits to making in the future, could ensure that equity, diversity, and inclusion initiatives implemented in the classroom have a positive impact on newsrooms across the country as well. “I think that conversations about accountability and transparency, and bringing that respect and care to our reporting, is something that can start at journalism schools and should continue to flow into the industry,” they say. “[It all] links back to journalism school because I think this is the place where a lot of journalists are shaped and where we first begin to understand journalistic values and the history of our role as reporters.” Topics: Education Media Race **Read more of THIS** The People Do Good Stuff Issue Game Theory #4: Dismal graduation rate for black NCAA players is the real March Madness The 7 private members' bills that shouldn't die in parliament, but probably will Lacking representation **We need you!** Independent journalism like this needs your support. Make your tax-deductible donation today! **Comments** **Subscribe to THIS** This Magazine’s award-winning independent journalism relies on the direct support of readers just like you. Subscribe toThis Magazinetoday. You'll save money, enjoy the convenience of home delivery and help us continue to deliver Canada's best progressive magazine of politics, arts and culture. Everybody wins! **Donate to This** Our donors have helpedThis Magazinestay in the truth-telling and muckracking business for over 50 years. Your tax-deductible donation means our writers can focus on original reporting and in-depth analysis, not corporate ass-kissing and breakneck 24-hour news cycles. Donate today and help us publish for the next 50 years. **About THIS** About Contact Newsletter Contribute Advertise"}