{"id": 2044, "name": "Mail & Guardian", "domain": "mg.co.za", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://mg.co.za/press-releases/2025-06-11-mbda-appoints-seasoned-town-planning-professional-zinhle-thwala-zulu-to-spearhead-catalytic-programmes-urban-revitalisation/", "title": "2025 06 11 Mbda Appoints Seasoned Town Planning Professional Zinhle Thwala Zulu To Spearhead Catalytic Programmes Urban Revitalisation", "content": "Login Register Login Register LOGIN NewsAfricaBusinessEditorialEducationHealthMotoringNationalSci-techSportWorld Africa Business Editorial Education Health Motoring National Sci-tech Sport World Africa Business Editorial Education Health Motoring National Sci-tech Sport World Thought Leader Politics Green Guardian Friday FeaturesButhelezi, the King’s HandCabinet Report Cards 2023Cabinet Report Cards 2012-2021The Fiscal Cliff Buthelezi, the King’s Hand Cabinet Report Cards 2023 Cabinet Report Cards 2012-2021 The Fiscal Cliff Buthelezi, the King’s Hand Cabinet Report Cards 2023 Cabinet Report Cards 2012-2021 The Fiscal Cliff Research WorldSubmissionsPapers Submissions Papers Submissions Papers 200 Young South Africans Events200 Young South AfricansGreening The FuturePower Of Women2024 EditionCritical Thinking ForumYouth SummitWebinars 200 Young South Africans Greening The Future Power Of Women2024 Edition 2024 Edition Critical Thinking Forum Youth Summit Webinars 200 Young South Africans Greening The Future Power Of Women2024 Edition 2024 Edition 2024 Edition Critical Thinking Forum Youth Summit Webinars More..PartnersPodcastsCrosswordDigital EditionsRegisterWhatsApp ChannelLoginLost Password Partners Podcasts Crossword Digital Editions Register WhatsApp Channel Login Lost Password Partners Podcasts Crossword Digital Editions Register WhatsApp Channel Login Lost Password **MBDA appoints seasoned town planning professional Zinhle Thwala-Zulu to spearhead catalytic programmes, urban revitalisation** A city’s transformation takes vision, leadership, skills and the requisite experience to progress. It is for this reason that the Mandela Bay Development Agency, an entity of the Nelson Mandela Bay Municipality, is pleased to announce the appointment of Zinhle Thwala-Zulu to the key position of Executive Manager: Operations. The role oversees all MBDA project planning, preparation, implementation and total precinct management, also referred to as urban area management. Thwala-Zulu stepped into the role held, until recently, by Debbie Hendricks, who served in this key position from 2019. Thwala-Zulu is now at the helm of the portfolio that drives the long-term planning and implementation of catalytic projects within Nelson Mandela Bay. “Zinhle is taking on a critical role within the agency,” says MBDA CEO, Anele Qaba. “She will lead the responsibility of aligning urban renewal projects with the agency’s strategic objectives and ensure that every initiative contributes to the city’s broader development goals within the MBDA’s mandate.” Thwala-Zulu has held several senior public and private sector roles over the course of her career, including serving as General Manager: Planning & Sustainable Development at the Mtubatuba Municipality in KwaZulu-Natal, and as Senior Town Planner within the Western Cape’s Knysna Municipality. She has led major urban projects and overseen the implementation of policy, land use applications and infrastructure planning. She holds a BTech in Town & Regional Planning, a Post-graduate Diploma in Local Economic Development, and is currently working towards a Master’s degree in Town and Regional Planning at the University of Pretoria. Qaba is confident in the new appointment: “I am excited with Zinhle’s depth and breadth of experience to provide leadership in driving the MBDA’s mission, to contribute to the inclusive and equitable development of Nelson Mandela Bay as a world-class city to live in, and a destination of choice. The MBDA’s core mandate is to achieve social, spatial and economic transformation in Nelson Mandela Bay.” “She brings to the position her expertise in municipal governance, infrastructure development and spatial planning, and is very well-placed to drive long-term impact and bring a fresh momentum to both current and future initiatives of the MBDA.” As Executive Manager: Operations, Thwala-Zulu will work closely with all stakeholders and partners to build and promote inclusive economic growth in Nelson Mandela Bay. “I am excited to have the opportunity to guide and shape the MBDA’s transformative initiatives,” she says. “I look forward to supporting and leading initiatives that bring long-term positive results and make a meaningful impact in Nelson Mandela Bay. We have all the plans, now we need to deliver.” **Latest News** Maimane: ‘Whether you and I accept it or not our relations with the US are crucial’ Motsoaledi’s big HIV treatment jump: Is it true? MBDA appoints seasoned town planning professional Zinhle Thwala-Zulu to spearhead catalytic programmes, urban revitalisation How the state plans to shield SA’s coast from climate change Tender times: Navigating the public procurement landscape Held hostage by grief: What Straw gets right (and wrong) Digital ID is not digital colonialism – it’s an investment in Africa’s future Fake medicines: South Africa’s silent epidemic The hidden economy of rage bait on social media has a human cost **Editors Pick** **How Africa should adapt to climate change** **How Africa should adapt to climate change** **NWU honours Prof Christa Rautenbach with the Chancellor’s Medal** **NWU honours Prof Christa Rautenbach with the Chancellor’s Medal** **NWU Council appoints Prof Hennie Goede as registrar** **NWU Council appoints Prof Hennie Goede as registrar** **MAIL & GUARDIAN** **MAIL & GUARDIAN** **ABOUT** AboutContactAdvertise **SUBSCRIPTIONS** SubscribeNewsletters **FOLLOW** WhatsApp ChannelTwitterFacebookYouTubeInstagramLinkedInTikTokThreads **FLAGSHIP EVENTS** 200 Young South AfricansPower Of WomenGreening The Future **LEGAL & CORRECTIONS** Privacy PolicyCookie PolicyEthics & Social Media Policy **RESOURCES** Mail & Guardian CareersProperty for sale © 2025 The Mail & Guardian. All rights reserved. Login Register"}