{"id": 424, "name": "Entertainment Weekly", "domain": "ew.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ew.com/jimmy-kimmel-calls-out-smartless-pals-for-not-congratulating-him-becoming-grandfather-11752486", "title": "Jimmy Kimmel Calls Out Smartless Pals For Not Congratulating Him Becoming Grandfather 11752486", "content": "SearchPlease fill out this field. Newsletters Sweepstakes TVTVTV ReviewsTV ReunionsTV RecapsComedyCrimeDramaFamilyHorrorRealitySci-FiThriller TV Reviews TV Reunions TV Recaps Comedy Crime Drama Family Horror Reality Sci-Fi Thriller TV Reviews TV Reunions TV Recaps Comedy Crime Drama Family Horror Reality Sci-Fi Thriller MoviesMoviesMovie ReviewsTrailersFilm FestivalsMovie ReunionsMovie Previews Movie Reviews Trailers Film Festivals Movie Reunions Movie Previews Movie Reviews Trailers Film Festivals Movie Reunions Movie Previews MusicMusicMusic ReviewsMusic Festivals Music Reviews Music Festivals Music Reviews Music Festivals What To WatchWhat To WatchTV ReviewsMovie Reviews TV Reviews Movie Reviews TV Reviews Movie Reviews BingeBingeEW's Binge Podcast EpisodesThe ChallengeThe Golden BachelorThe Masked SingerRuPaul's Drag RaceSurvivorVirgin RiverThe VoiceYellowstone EW's Binge Podcast Episodes The Challenge The Golden Bachelor The Masked Singer RuPaul's Drag Race Survivor Virgin River The Voice Yellowstone EW's Binge Podcast Episodes The Challenge The Golden Bachelor The Masked Singer RuPaul's Drag Race Survivor Virgin River The Voice Yellowstone Celebrity The AwardistThe AwardistThe Awardist Podcast EpisodesGolden GlobesGrammysEmmysSAG AwardsTony AwardsOscars The Awardist Podcast Episodes Golden Globes Grammys Emmys SAG Awards Tony Awards Oscars The Awardist Podcast Episodes Golden Globes Grammys Emmys SAG Awards Tony Awards Oscars BooksBooksBook ReviewsAuthor Interviews Book Reviews Author Interviews Book Reviews Author Interviews Summer TV Preview Newsletters Sweepstakes TVTV ReviewsTV ReunionsTV RecapsComedyCrimeDramaFamilyHorrorRealitySci-FiThriller TV Reviews TV Reunions TV Recaps Comedy Crime Drama Family Horror Reality Sci-Fi Thriller TV Reviews TV Reunions TV Recaps Comedy Crime Drama Family Horror Reality Sci-Fi Thriller MoviesMovie ReviewsTrailersFilm FestivalsMovie ReunionsMovie Previews Movie Reviews Trailers Film Festivals Movie Reunions Movie Previews Movie Reviews Trailers Film Festivals Movie Reunions Movie Previews MusicMusic ReviewsMusic Festivals Music Reviews Music Festivals Music Reviews Music Festivals What To WatchTV ReviewsMovie Reviews TV Reviews Movie Reviews TV Reviews Movie Reviews BingeThe Last of UsOutlanderAmerica's Got TalentThe Handmaid's TaleRuPaul's Drag RaceSaturday Night LiveSurvivorVirgin RiverThe Voice The Last of Us Outlander America's Got Talent The Handmaid's Tale RuPaul's Drag Race Saturday Night Live Survivor Virgin River The Voice The Last of Us Outlander America's Got Talent The Handmaid's Tale RuPaul's Drag Race Saturday Night Live Survivor Virgin River The Voice Celebrity The AwardistThe Awardist Podcast EpisodesGolden GlobesGrammysEmmysSAG AwardsTony AwardsOscars The Awardist Podcast Episodes Golden Globes Grammys Emmys SAG Awards Tony Awards Oscars The Awardist Podcast Episodes Golden Globes Grammys Emmys SAG Awards Tony Awards Oscars BooksBook ReviewsAuthor Interviews Book Reviews Author Interviews Book Reviews Author Interviews Summer TV Preview Top Stories Meet the 'Bachelor in Paradise' season 10 cast 'Big Bang Theory' spinoff will include 'lots of CGI' Nathan Fillion teases HBO 'Lanterns' debut 'Days of Our Lives' shot funeral for Drake Hogestyn's character while actor was dying **Jimmy Kimmel calls out famous pals for not congratulating him on becoming a grandfather: 'A little text would be nice'** The late-night host confronted Will Arnett, Jason Bateman, and Sean Hayes on air for not acknowledging his family's big news. Emlyn Travis is a news writer atEntertainment Weeklywith over five years of experience covering the latest in entertainment. A proud Kingston University alum, Emlyn has written about music, fandom, film, television, and awards for multiple outlets including MTV News,Teen Vogue, Bustle, BuzzFeed,Paper Magazine, Dazed, and NME. She joined EW in August 2022. ABC Jimmy Kimmelhas a bone to pick withWill Arnett,Jason Bateman, andSean Hayes. When the threeSmartlesspodcasters visited their pal's late-night show Tuesday, Kimmel called them out for all failing to congratulate him onrecently becoming a grandfather. \"Honestly, three of my closest friends,\" Kimmel groused to the audience as Bateman laughed. \"No acknowledgement that my daughter had a child. None whatsoever.\" Arnett immediately fessed up to the faux pas, replying, \"I know, I know.\" ABC Bateman, however, tried his best to wriggle out of the situation. \"Did you register somewhere?\" he asked, to which Kimmel replied, \"No, we didn't register! I don't want gifts! You know, just like a little text would be nice.\" When Bateman floated the idea that Kimmel's daughter might have wanted a gift, the host quickly turned the idea back on him. \"Yeah, maybe she would,\" Kimmel agreed. \"By the way, [Bateman's] daughter just graduated high school — guess who's getting a gift? Your daughter. From me.\" Unwilling to admit defeat, Bateman challenged Kimmel to name his eldest daughter. \"Franny is her name. What do you mean what's her name?\" Kimmel remarked, seemingly outraged. Bateman teased back, \"I didn't know!\" Arnett confirmed to the audience that they'd really messed up. \"So, by the way, this is true,\" he said. \"We are all legitimately good friends and none of us did anything for you for being a grandparent.\" \"That's how close we are!\" Bateman quipped. Last month, Kimmel confirmed that he missed just his second show in his 22-year tenure asLivehost in order to be there for his eldest daughter, Katie Kimmel, as she welcomed her first child, a baby girl named Patti Joan. \"Katie and her husband, Will, had a baby girl right at the time we shoot our show last night,\" Kimmel said in his monologue the next day. \"So I decided to be there instead of here.\" Sign up forEntertainment Weekly's free daily newsletterto get breaking news, exclusive first looks, recaps, reviews, interviews with your favorite stars, and more. The host added that he'd been reflecting on the teachings of his own grandfathers since joining the club, noting that they educated him how to shoplift, shoot dentures out of one's mouth, and perform haircuts using a cigarette lighter. \"It is kind of scary though to bring a child into this world and to say like, 'Okay, you're in this now at least until the year 2100. Good luck!'\" Kimmel said. \"I mean, these kids have to worry about the climate going on fire, MAGA, AI. You know what we had to worry about? The most dangerous scenarios the future held when I was a kid, honestly: quicksand, the Bermuda Triangle, and killer bees.\" Watch Kimmel grill his pals in the clip above. TV Settings Sign Out **Related Articles** **Follow Us** TV Movies Music What To Watch Binge Celebrity The Awardist Books Theater About Us Terms of Service Subscribe Advertise Careers Privacy Policy Your Privacy Choices"}