{"id": 1389, "name": "The Newton Kansan", "domain": "thekansan.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thekansan.com/planned-ice-detention-center-temporarily-blocked-from-opening-in-leavenworth-kansas/", "title": "Planned Ice Detention Center Temporarily Blocked From Opening In Leavenworth Kansas", "content": "Home News Sports EntertainmentPhoto Gallery Photo Gallery Photo Gallery Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Conversations Login Contact Us Subscribe Login Home News Sports EntertainmentPhoto Gallery Photo Gallery Photo Gallery Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Conversations Subscribe Login **Planned ICE detention center temporarily blocked from opening in Leavenworth, Kansas** June 11, 2025 News Login Sign Up Now Sunflower Summer builds more than memories Amish Cook: Doesn’t it look like a dream come true? Revoking China Student Visas Accelerates U.S. Science Decline Letter to the editorProud Kansas heritage Community mental health town hall planned June 30 in Newton Teen Mental Health Planned ICE detention center temporarily blocked from opening in Leavenworth, Kansas Wichita Southeast High probe shows possible grade tampering; principal replaced Wind Surge opens series with win over Hooks Award finalists named **Other News** June 11, 2025 June 11, 2025 June 6, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 The Kansan, aCherryRoad MediaNewspaper. All rights reserved."}