{"id": 1366, "name": "The Cut", "domain": "thecut.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thecut.com/article/call-her-alex-hulu-doc-review-alex-cooper-biggest-moments.html", "title": "Call Her Alex Hulu Doc Review Alex Cooper Biggest Moments.html", "content": "Intelligencer The Cut Vulture The Strategist Curbed Grub Street MagazineSubscribe to the MagazineGive a Gift SubscriptionBuy Back IssuesCurrent Issue ContentsNew YorkShop Subscribe Sign In AccountProfileSaved for laterSign Out Style Self Culture Power Style Fashion Beauty Parties & Red Carpet Fashion Shows Cathy Horyn The Cut Shop Self Health & Wellness Life After Roe Parenting Sex & Relationships Astrology Sports Culture Books Television Movies Music Celebrity Power Politics Work Money Crime Rebecca Traister Latest Stories Podcast About Us NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed Style Fashion Beauty Parties & Red Carpet Fashion Shows Cathy Horyn The Cut Shop Self Health & Wellness Life After Roe Parenting Sex & Relationships Astrology Sports Culture Books Television Movies Music Celebrity Power Politics Work Money Crime Rebecca Traister Latest Stories Podcast About Us NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed Things you buy through our links may earnVox Mediaa commission **What Does Call Her Daddy’s Alex Cooper Reveal inCall Her Alex?** Save this article to read it later. Find this story in your account’s‘Saved for Later’section. Today, Hulu is premieringCall Her Alex, a two-part documentary about the rise ofCall Her Daddy’s Alex Cooper, directed by Ry Russo-Young. The doc traces Cooper’s origin story as a bullied middle-schooler making home videos in her suburban basement;her complicated history as a Division 1 soccer player at Boston University; the launch ofCall Her Daddyin 2018, the fallout with her original co-host, Sofia Franklyn; and what it’s like making today’s less-sexual,celebrity-driven, and highly lucrative version of the podcast. A post shared by Hulu (@hulu) Call Her Alexis an interesting, if somewhat limited, look at the woman behind the $125 million podcast deal. There are a few glimpses into her off-mic personality: Her husband, Matt Kaplan, a film producer who is incredibly involved in the CHD business, reveals she does not pop her pimples. Cooper herself says she identifies as a “zillennial” (she was born in 1994; I’d say that’s fair). She also offers up tons of footage from her home-video days that shows the now-very-blonde star was born with red hair (and was bullied for it, she says). More revealing is the fact that her parents, Bryan and Laurie Cooper, steadfastly supported her career, even at the beginning, when she was recording particularly graphic episodes like the infamous“Gluck Gluck 9000.”Both appear throughout the documentary and insist they always encouraged their daughter, despite some shaming from other family members and friends in their community. Cooper’s most serious disclosure, however, comes at the end of part one. She accuses the now-retired Boston University women’s soccer coach, Nancy Feldman, ofsexually harassingher throughout her three years on the team (Cooper quit after her junior year when the administration, she says, refused to do anything about the harassment). She says Feldman took a special interest in her and often attempted to isolate her from her teammates and ask her about her sex life. “It was this psychotic game of, ‘You want to play? Tell me about your sex life,’” she says. Cooper is less forthcoming about the breakdown of her relationship with Franklyn, her former co-host who leftCall Her Daddyduring a contract dispute with Barstool Sports in 2020. Cooper admits she and Franklyn were roommates but had only known each other for a few months when they started recording the podcast together. “It was the classic, ‘You think you see something online and people genuinely believe you’re like sisters, but our relationship was so awful,’” she says. But she leaves it there. The Daddy Gang, as Cooper’s fans are known, will probably most appreciate the previously unseen footage from herweddingto Kaplan that comes at the end of part two. Cooper and Kaplan cry as they say their vows (both prewritten in little white books). “You’re the best man I’ve ever met,” Cooper tells her husband. “You inspire me every day. You’re the most passionate about the people you love. Fiercely loyal, it’s almost scary at times. And the way you love me is indescribable.” But this is not a reality show. The doc does show some moments of Cooper and Kaplan relaxing in hotel rooms and in their palatial L.A. home, but there are no arguments or even stress, really: Kaplan mixes Cooper a martini, the two cuddle with their dogs. If fans want to see an unfiltered Cooper, they may be better off listening to old podcast episodes. **Stay in touch.** By submitting your email, you agree to ourTermsandPrivacy Noticeand to receive email correspondence from us. **Related** Alex Cooper Says She Was Sexually Harassed by Her Soccer Coach **Tags:** alex cooper call her daddy celebrity culture documentaries More Things you buy through our links may earnVox Mediaa commission **The Cut Shop** 29 Best Sneakers for Women in Every Single Style I’m on the Hunt for the Best Sunscreens Without a White Cast 31 Best Luxury Candles That Double As Great Gifts **Most Viewed Stories** Aaron Rodgers Is Married Now Your Daily Horoscope by Madame Clairevoyant: June 11, 2025 What Does Call Her Daddy’s Alex Cooper Reveal inCall Her Alex? ‘Can I Ask About Salary Before a Job Interview?’ Dakota Johnson Is ‘Always Psyched’ to Film Sex Scenes Aaron Rodgers Is Married Now What Does Call Her Daddy’s Alex Cooper Reveal inCall Her Alex? The Transformative Power of Texting Nudes to 250 People Your Daily Horoscope by Madame Clairevoyant: June 11, 2025 My Secret Pelvic-Organ Prolapse **Most Popular** Aaron Rodgers Is Married Now Your Daily Horoscope by Madame Clairevoyant: June 11, 2025 What Does Call Her Daddy’s Alex Cooper Reveal inCall Her Alex? ‘Can I Ask About Salary Before a Job Interview?’ Dakota Johnson Is ‘Always Psyched’ to Film Sex Scenes Aaron Rodgers Is Married Now What Does Call Her Daddy’s Alex Cooper Reveal inCall Her Alex? The Transformative Power of Texting Nudes to 250 People Your Daily Horoscope by Madame Clairevoyant: June 11, 2025 Scooter Braun Didn’t Think Taylor Swift Would Be That Mad **The Latest** **** **** **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **** **** * please try a longer search **** Have an Account? Style Self Culture Power About The Cut About New York Magazine Newsletters Help Contact Press Media Kit We’re Hiring Privacy Terms Ad Choices Do Not Sell My Info Accessibility Do not sell or share my personal data"}