{"id": 201, "name": "KFMB - San Diego News", "domain": "cbs8.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cbs8.com/article/entertainment/television/programs/san-diego-living/show-dad-how-much-you-appreciate-him/509-a7682dbf-bcea-4bcc-9c06-0a9d0b3357c8", "title": "Show Dad How Much You Appreciate Him", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalFeaturesNear MeHealthCrimeNation WorldPoliticsInvestigationsCommunityEntertainmentLatest News StoriesPoway mother scores dream umpiring role at major female baseball event in WilliamsportHELP Button | Links mentioned on CBS 8 Back Local Features Near Me Health Crime Nation World Politics Investigations Community Entertainment Poway mother scores dream umpiring role at major female baseball event in Williamsport HELP Button | Links mentioned on CBS 8 Back Local Features Near Me Health Crime Nation World Politics Investigations Community Entertainment Poway mother scores dream umpiring role at major female baseball event in Williamsport HELP Button | Links mentioned on CBS 8 WeatherBackForecastRadar10-DayHourlyGas PricesTrafficLatest Weather StoriesCBS 8 News Weather Quiz ContestCBS 8's Weather School | Nominate your classroom for a visit from a meteorologist Back Forecast Radar 10-Day Hourly Gas Prices Traffic CBS 8 News Weather Quiz Contest CBS 8's Weather School | Nominate your classroom for a visit from a meteorologist Back Forecast Radar 10-Day Hourly Gas Prices Traffic CBS 8 News Weather Quiz Contest CBS 8's Weather School | Nominate your classroom for a visit from a meteorologist SportsBackHigh School SportsSan Diego Padres / MLBSDSU Aztecs / CollegeSan Diego WaveSan Diego FCLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawCarlsbad's Ron Capps gets Funny Car victory in Bristol, Hot Wheels tribute Back High School Sports San Diego Padres / MLB SDSU Aztecs / College San Diego Wave San Diego FC Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Carlsbad's Ron Capps gets Funny Car victory in Bristol, Hot Wheels tribute Back High School Sports San Diego Padres / MLB SDSU Aztecs / College San Diego Wave San Diego FC Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Carlsbad's Ron Capps gets Funny Car victory in Bristol, Hot Wheels tribute SearchSearch:Search Advertise With Us Help Button Working For You Mornings Throwback Community Recipes Traffic FOUR Contests San Diego Living TV Listings YouTube Instagram Facebook **Show Dad How Much You Appreciate Him** **** To stream CBS 8 on your phone, you need the CBS 8 app. **** **Download the CBS 8 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video SAN DIEGO — With Father’s Day just around the corner, it’s the perfect time to show Dad how much we appreciate him. And what better way to do that than with food? Patricia Bannan, Registered Dietitian and Author of From Burnout to Balance, joins our Laura Cavanaugh with some tasty summertime recipes packed with superfoods to help Dad, and the special men in our lives, feel their best. We know Dads love pistachios. Whether Dad loves the In-Shell or No Shell, he’ll love the bold flavor options from Wonderful Pistachios, like Smoky Barbecue, Sea Salt & Vinegar, Chilli Roasted and their newest flavor Dill Pickle. Pistachios offer 6 grams of complete proteinand3 grams of fiber per serving, making them a smart snack with staying power. Bannan created an irresistible Dill Pickle Pistachio Snack Board filled with Wonderful Pistachios. They pair perfectly with cheeses, crackers, veggies, salami, spicy mustard and grapes. And it’s a great board that your kids can help build as well. Learn more atwww.wonderfulpistachios.com Since heart disease remains the leading cause of death for men in the U.S., why not celebrate Dad with a dish that’s not only delicious but also supports heart health? Whether Dad’s a meat lover or not, Bannan says he’ll love Heart Healthy Chorizo Spiced Lentil and Avocado Tacos. They’re full of plant-based goodness—featuring lentils and walnuts for protein and fiber, plus avocados two ways: in a citrus-forward crema and avocado slices on top. Avocados are virtually the only fruit that provides heart-healthy monounsaturated fats, which may help lower bad (LDL) cholesterol while supporting good (HDL) levels. A recent study in the Journal of the American Heart Association found that adults with larger waistlines who ate one avocado daily improved their diet quality, sleep and LDL cholesterol levels You can get this recipe atwww.LoveOneToday.com. For fun drinks to pair with your meal, raise a glass to Dad with a refreshing Pomegranate Ginger Mojito Mocktail. Bannan combined POM Wonderful juice with ginger beer, fresh lime and mint leaves for a bright, tangy twist. If you want to give it a little kick, just add a splash of rum. POM Wonderful 100% Pomegranate Juice is a tasty way to fuel your body with antioxidants. Each 8-ounce bottle contains the juice of two whole pomegranates and nothing else—no added sugar, fillers, or preservatives. You can enjoy it on its own, or mix up this fun mocktail—it’s perfect for a Father’s Day brunch or backyard BBQ. For more healthy ideas, recipes and life tips, visitwww.patriciabannan.com Sponsored by: Wonderful Pistachios, Avocados – Love One Today, POM Wonderful **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}