{"id": 56, "name": "Atlanta Journal-Constitution", "domain": "ajc.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ajc.com/politics/2025/06/a-big-election-with-a-tiny-turnout-few-voters-show-up-for-georgia-psc-primary/", "title": "A Big Election With A Tiny Turnout Few Voters Show Up For Georgia Psc Primary", "content": "ePaper Newsletters AJC Events Help Center **Politics** **Politics** Politically Georgia The First 100 Days Legislature Legislative Navigator Quick LinksePaperNewslettersAJC EventsHelp Center ePaper Newsletters AJC Events Help Center ePaper Newsletters AJC Events Help Center PoliticsPolitically GeorgiaThe First 100 DaysLegislatureLegislative NavigatorThe Trump InvestigationsElectionsPatricia MurphyJamie Dupree Politically Georgia The First 100 Days Legislature Legislative Navigator The Trump Investigations Elections Patricia Murphy Jamie Dupree Politically Georgia The First 100 Days Legislature Legislative Navigator The Trump Investigations Elections Patricia Murphy Jamie Dupree NewsMetro AtlantaGeorgia NewsNational & World NewsBlack History MonthEducationInspire AtlantaPartner ContentTrafficWeather Metro Atlanta Georgia News National & World News Black History Month Education Inspire Atlanta Partner Content Traffic Weather Metro Atlanta Georgia News National & World News Black History Month Education Inspire Atlanta Partner Content Traffic Weather BusinessGeorgia CompaniesGrowth & DevelopmentJobsClimateEntertainment IndustryTechAtlanta AirportAJC Her+Story Georgia Companies Growth & Development Jobs Climate Entertainment Industry Tech Atlanta Airport AJC Her+Story Georgia Companies Growth & Development Jobs Climate Entertainment Industry Tech Atlanta Airport AJC Her+Story SportsBravesUGAFalconsGeorgia TechUnitedHawksDreamHigh School SportsState Sports ReportAJC Super 11 Braves UGA Falcons Georgia Tech United Hawks Dream High School Sports State Sports Report AJC Super 11 Braves UGA Falcons Georgia Tech United Hawks Dream High School Sports State Sports Report AJC Super 11 LifestyleArts & EntertainmentFood & DiningDining GuidesWellnessThings to DoAccess AtlantaAJC Peachtree Road Race Arts & Entertainment Food & Dining Dining Guides Wellness Things to Do Access Atlanta AJC Peachtree Road Race Arts & Entertainment Food & Dining Dining Guides Wellness Things to Do Access Atlanta AJC Peachtree Road Race UATLNewsEntertainmentFoodFashion404wardThe LineUp News Entertainment Food Fashion 404ward The LineUp News Entertainment Food Fashion 404ward The LineUp OpinionReaders WriteAJC ColumnistsMike LuckovichGet SchooledReal Life with Nedra RhoneTorpy at LargeContact the AJC Editorial Board Readers Write AJC Columnists Mike Luckovich Get Schooled Real Life with Nedra Rhone Torpy at Large Contact the AJC Editorial Board Readers Write AJC Columnists Mike Luckovich Get Schooled Real Life with Nedra Rhone Torpy at Large Contact the AJC Editorial Board InvestigationsData JournalismDangerous Dwellings: An AJC investigationUnprotected: Senior CareBreakdown Data Journalism Dangerous Dwellings: An AJC investigation Unprotected: Senior Care Breakdown Data Journalism Dangerous Dwellings: An AJC investigation Unprotected: Senior Care Breakdown PodcastsBreakdownPolitically Georgia Breakdown Politically Georgia Breakdown Politically Georgia MoreDaily SavingsClassifiedsJobsObituariesPolitically Georgia NewsletterPhoto GalleriesPulseVideos Daily Savings Classifieds Jobs Obituaries Politically Georgia Newsletter Photo Galleries Pulse Videos Daily Savings Classifieds Jobs Obituaries Politically Georgia Newsletter Photo Galleries Pulse Videos AboutHelp CenterAbout the Atlanta Journal-ConstitutionNewsroom Ethics CodeCareersArchive Help Center About the Atlanta Journal-Constitution Newsroom Ethics Code Careers Archive Help Center About the Atlanta Journal-Constitution Newsroom Ethics Code Careers Archive Contact UsContact UsSend a News TipAdvertiseAJC Newsroom Contact Us Send a News Tip Advertise AJC Newsroom Contact Us Send a News Tip Advertise AJC Newsroom Our ProductsePaperNewslettersAll AJC PodcastsAJC EventsDownload iOS AppDownload Android App ePaper Newsletters All AJC Podcasts AJC Events Download iOS App Download Android App ePaper Newsletters All AJC Podcasts AJC Events Download iOS App Download Android App SubscriptionDigital SubscriptionPrint SubscriptionManage SubscriptionGroup SubscriptionsSubscription TermsNIE/Newspapers in Education Digital Subscription Print Subscription Manage Subscription Group Subscriptions Subscription Terms NIE/Newspapers in Education Digital Subscription Print Subscription Manage Subscription Group Subscriptions Subscription Terms NIE/Newspapers in Education **A big election with a tiny turnout: Few voters show up for Georgia PSC primary** Credit: arvin.temkar@ajc.com Credit: arvin.temkar@ajc.com Turnout is so low in Georgia’s rescheduled, off-year, summertime elections for Public Service Commission that several counties are considering closing polling places if there’s a runoff. Voters are showing little interest in a primary election that could have tremendous impact on their wallets: The PSCsets the power and gas ratesthat monopoly utility companies can charge. About half a percent of registered voters had voted in nearly two and a half weeks of early voting so far. That’s about 45,000 ballots cast out of 8.4 million registered voters through Tuesday. Election Day is next Tuesday, June 17. “It’s one of the lowest turnouts we’ve ever had,” said Janis Judge, assistant elections director for Cherokee County. “I don’t think there’s a lot of information out there. I don’t hear about it on the news that often. And the cost to the county is a fortune this election.” She estimated the budget for the election is over $50,000. Without another major race on the ballot, such as president or governor, and relatively muted campaigns among the eight candidates, voters aren’t motivated to participate, election officials said. The result could be fewer precincts if a runoff is required next month, which is very possible in the four-candidate Democratic primary for one of thetwo PSC seats on the ballot. Georgia law calls for runoffs when no candidate receives a majority of votes. If turnout fails to exceed 1% in the partisan primary, counties are considering ararely used state lawthat allows them to only open one precinct in a runoff, said Travis Doss, president of the Georgia Association of Voter Registration and Election Officials. “There’s definitely interest out there to do this as a cost-saving measure,” said Doss, executive director for Richmond County elections. “Unfortunately, as important as the PSC is, it’s a little-known office, and it’s not one that drives people to the polls.” So far, Cherokee and Floyd counties are two Republican-majority counties that could reduce voting locations in a runoff. Others could follow if their turnout remains below 1% after Election Day. Credit: arvin.temkar@ajc.com Credit: arvin.temkar@ajc.com In Doss’ county, the runoff could cost taxpayers about $160,000 for poll workers and staff overtime, but turnout is likely to exceed the 1% threshold that would allow polls to close. Floyd County Elections Director Akyn Beck said she could save at least $25,000 in taxpayer money if the number of voting locations drops to one for a potential runoff. “It’s disappointing because we put in the same amount of preparation, and we see such low voter involvement,” Beck said. “A lot of people don’t even know what these commissioners actually do for their constituents.” The timing of the election — held in June rather than in an even-numbered year with other statewide races — wasset by the Georgia General Assemblyafter lawsuits led to thecancellation of previous PSC electionssince 2022. A federal judgeruled three years agothat electing PSC candidates statewide rather than by districts violated the Voting Rights Act, resulting in almost all-white representation on the PSC during its 146-year history. But then an appeals courtoverturned his decision, allowing lawmakers to reschedule the elections. Credit: Miguel Martinez/AJC Credit: Miguel Martinez/AJC Helen Butler, a voting rights advocate, said fewer polling places in a July runoff would further curtail turnout. “I understand the costs involved, but voters should have access. In a runoff, it’s critical that voters choose the person that’s going to make the best decisions,” said Butler, executive director for the Georgia Coalition for the People’s Agenda, a civil rights organization. Turnout was much higher in last year’s presidential election, whennearly 5.3 million voters participated, with 71% of them casting their ballots during three weeks of in-person early voting. For this election, even early voting sites with relatively higher turnout, such as the Cobb County elections office, seemed like ghost towns, with just a handful of voters per hour. Dennis Flanagan, a retired IT worker from Marietta, said he hopes voters start paying more attention. “It’s very important. The utilities have been running roughshod over the citizens of Georgia,” Flanagan said. “I just cast my vote and hope it counts. I wish we had better education about these issues.” After the primary and a potential runoff, the winning candidates from the Republican and Democratic parties will meet in the general election in November. **How to vote for Public Service Commission** All registered voters in Georgia are eligible to vote in both Public Service Commission races on the ballot. Find your registration information, voting locations and sample ballots through the state’s My Voter Page atmvp.sos.ga.gov. Early voting lasts from May 27 to June 13. Election Day for the partisan primaries is June 17, followed by runoffs, if necessary, July 15. The general election will be held Nov. 4. This story has been updated to include the most recent voter turnout figures. About the Author Mark Niesse covers Georgia government for The Atlanta Journal-Constitution and is considered an expert on elections and voting. Before joining the AJC, he worked for The Associated Press in Atlanta, Honolulu and Montgomery, Alabama. He also reported for The Daily Report and The Santiago Times in Chile. Keep Reading Credit: AP Credit: AP **Georgia Public Service Commission races focus on high power bills** **Georgia Public Service Commission races focus on high power bills** **Who is running for Georgia Public Service Commission?** **Who is running for Georgia Public Service Commission?** Party primaries for Georgia's Public Service Commission are scheduled for June 17. **Georgia Public Service Commission fails to deliver transparent oversight** **Georgia Public Service Commission fails to deliver transparent oversight** As voters elect new commissioners on the Georgia Public Service Commission in 2025, they should choose candidates who have ratepayers' interests at heart. The Latest Credit: TNS Credit: TNS **Kemp embraces Trump’s ‘beautiful’ budget — and its brutal trade-offs for Georgia** **Kemp embraces Trump’s ‘beautiful’ budget — and its brutal trade-offs for Georgia** **The latest on mail delays in Georgia** **The latest on mail delays in Georgia** **Who is running for Georgia Public Service Commission?** **Who is running for Georgia Public Service Commission?** Featured Credit: arvin.temkar@ajc.com Credit: arvin.temkar@ajc.com **‘We are not California or New York,’ Georgia AG warns amid protests** **‘We are not California or New York,’ Georgia AG warns amid protests** **A big election with a tiny turnout: Few voters show up for Georgia PSC primary** **A big election with a tiny turnout: Few voters show up for Georgia PSC primary** Turnout in Georgia's statewide elections for the Public Service Commission is so low that several counties might close polling places for the runoffs. **30 years later, teenage girl found dead behind Atlanta home is identified** **30 years later, teenage girl found dead behind Atlanta home is identified** In 1995, children made a horrific discovery behind a southwest Atlanta home: A girl had been buried in a shallow grave. She has now been identified thanks to a Texas DNA lab."}