{"id": 2033, "name": "Liberal America", "domain": "liberalamerica.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://liberalamerica.org/2023/06/11/the-rise-of-right-wing-hate-groups-reminds-us-what-mark-twain-said-about-historys-tendency-to-rhyme/", "title": "The Rise Of Right Wing Hate Groups Reminds Us What Mark Twain Said About Historys Tendency To Rhyme", "content": "News Politics Wellness EditorialsTiffany Willis ClarkJoe ClarkA Southern Pastor Tiffany Willis Clark Joe Clark A Southern Pastor Tiffany Willis Clark Joe Clark A Southern Pastor About SHOP News Politics Wellness EditorialsTiffany Willis ClarkJoe ClarkA Southern Pastor Tiffany Willis Clark Joe Clark A Southern Pastor Tiffany Willis Clark Joe Clark A Southern Pastor About SHOP Pulse African-American Pulse The Issues Discrimination Domestic Violence History Racism **The Rise of Right-Wing Hate Groups Reminds Us What Mark Twain Said About History’s Tendency to Rhyme** **Mark Twain supposedlysaid, “History doesn’t repeat itself, but it often rhymes.”** Those of us old enough and paying enough attention to appreciate the interesting times in which we live have been hearing a lot of rhymes the past few years. But one rhyme we wish we would never hear again pertains to the rise of hate groups that have become more emboldened and conspicuous since the twice-impeached, twiceindicted, former slumlord host ofCelebrity Apprentice,aka “the former guy,” was elevated to the nation’s highest office. “The former guy” may be gone, but the repulsive, rapacious rot he exposed is very much present. Unfortunately, it’s spreading. Last month, the University of Maryland’s National Consortium for the Study of Terrorism and Responses to Terrorism (START) reported that70%of individuals committing terrorist acts in Americaact aloneor within “isolated cliques” of three to four people. Senior researcher Michael Jensenexplained: These individuals might be lone actors, but they’re not lonely actors. They are embedded in these online ecosystems where they are exchanging ideas with each other all day every day. The database Profiles of Individual Radicalization in the United States (PIRUS) project Jensen heads states90% of terrorist cases are domestic. 95% are from far-right groups like white supremacists,Proud Boys, anti-immigrant, and anti-government groups. Naturally there will be those who dismiss the correlation between Don Trump’s ascendency and the increase in hate groups (particularly among those still inexplicably loyal to him). But prior to 2016, Jensen and his teamrecorded around 150 people a year“committing crimes inspired by extremist ideology”. Since then the number hasspiked to about 300 to 350 cases per year— not including the January 6, 2021 violent attempted coup against the government. Jensensaid: Before the internet and before social media, how an individual was likely to radicalize is that it was going to be through a face-to-face relationship that they had in the physical world. So they had a cousin that was involved in a skinhead gang and they recruited them, or there was a group active in their neighborhood and they saw a flyer and took an interest in it. It was a much more labor-intensive process to get people involved. Southern Poverty Law Centerintelligence project director Susan Corkeadded: Currently, the level of mobilization, coordination and sustained focus of the far right’s anti-LGBTQ+, particularly anti-trans, [prejudice] is much worse. The past year saw unprecedented violence against transgender and gender-nonconforming people, and the most frequent victims were women of color, especially black transgender women. Hate groups are nothing at all new in America. Even during the 1930s, as Adolf Hitler and Benito Mussolini’s brutal fascism was steamrolling across Europe, there wasburgeoning Nazi admiration right here at home. In 1935, eight days after the Nuremberg Laws — “Reich Citizenship Law,” the “Law on the Protection of German Blood and German Honor,” and the “Reich Flag Law” — were passed during a special session of the Reichstag,disqualifying Jews as Reich citizens with political rights, prohibiting marriage or sex between racial Germans and Jews, and any Jews’ display of national colors or the new national flag (swastika),45 Nazi lawyers sailed to New York as guests of the Association of National Socialist German Jurists. When they arrived, none other thanthe New York City Bar Association was there to welcome themwith a reception. Their objective? Acquire “special insight into the workings of American legal and economic life through study and lectures”. Yale Law School professor James Q. Whitman’s bookHitler’s American Modeldocuments howNazi officials found inspiration and foundation in the racism imbued within American legal system. He documents how “the Nuremberg Laws themselves reflect direct American influence.” Four years later, seven months before Hitler officially kicked off World War Two with his invasion of Poland, the German American Bund hosted a “Pro-American Rally” at New York’s Madison Square Garden held on George Washington’s birthday that featured a 30-foot-tall banner of Washington sandwiched between American flags and swastikas. Boasting70 local chapters, the German American Bund hosted parades, ran bookstores andyouth summer campsat which boys and girls ranging fromages eight to 18 displayed the Nazi flag, dressed in Nazi uniforms, and engaged in paramilitary drills. Fast forward to today, nearly a century later. Last month, theWhite Housemade history when it launched thefirst national strategyto combatrising anti-Semitism. The officialpress releaseon May 28 states: We have seen a brick thrown through window of a Jewish-owned business in Manhattan, a swastika carved into the door of a synagogue in Salt Lake City, families threatened outside a restaurant in Los Angeles, and museums in Florida and Alaska, dedicated to celebrating Jewish life and culture and remembering the Holocaust, vandalized with anti-Jewish messages. As Attorney General Garland announced yesterday, the Department of Justice will be deploying all of the tools at its disposal to combat hate crimes. In recent days, we have seen that no community is immune. We must all stand together to silence these terrible and terrifying echoes of the worst chapters in world history, and pledge to give hate no safe harbor. One of the reasons this is happening is due to ignorance. As the years since the Holocaust tick away, and its survivors die, its memory becomes more distant. When that happens, the likelihood of history repeating itself — or “rhyming,” as Twain said — becomes greater. The Anti-Defamation League reported three years ago that 85% of Americans believe at least one anti-Semitic stereotype. Domestic policy adviser Susan Riceexplained: A study found that more than three in five American millennials and Generation Z didn’t know that six million Jews were murdered in the Holocaust. This is simply unacceptable. Part of President Biden’s plan to push back against this involvesincreasing awareness and understanding of antisemitism and Jewish American heritage. Riceexplainedthe United States Holocaust Memorial Museum is going to begin the first US-based Holocaust education research center, and urged increased school-based education about antisemitism. Homeland Security Adviser Dr.Liz Sherwood-Randall addedthe administration is calling on “10 separate calls to tech companies to establish a zero-tolerance policy for hate speech on their platforms to ensure that their algorithms do not pass along hate speech and extreme content to users, and to listen more closely to Jewish groups to better understand how antisemitism manifests itself on their platforms.” Shestated: The president has also called on Congress to remove the special immunity for online platforms and to impose stronger transparency requirements in order to ensure that tech companies are removing content that violates their terms of service. More broadly, pillar three focuses on countering antisemitic discrimination in all sectors of American society. For example, the Department of Education today issued a letter reminding schools of their obligations to address discrimination. According to Southern Poverty Law Center (SPLC), in a report titled “The Year in Hate and Extremism” for 2021,hate groupmembershipdropped for the third straight year. But there’s a caveat. A reason for the decline is because those attracted to extremist beliefs, rhetoric, and organizing typically found in hate groups arefinding a home within today’s republican party. Former SPLC intelligence director, now with the Global Project Against Hate and Extremism,Heidi Beirich, explainedthe spread of “accelerationist” beliefsas the most troubling aspect. Beirich notesthat while paramilitary groups like the Oath Keepers andProud Boyshad significant roles in the Jan. 6, 2021 insurrection, the “prosecutions of those involved in the insurrection has [sic] failed to shut down these groups, as has the participation of active-duty military and veterans failed to inspire serious measures to weed out extremists and prevent troops from being radicalized.” Republican officeholders like Reps.Marjorie Taylor Green,Paul Gosar, andLauren Boeberthave stoked this radicalization along with multipleright-wing punditspushing white nationalist and other far-right conspiracy theories. Another example is the racist so-called“Great Replacement” theorythat claims (mostly Jewish) liberals aim to “replace” white people with people of color, something disgraced formerFoxso-called “news” celebrity Tucker Carlson spewed on his show almost nightly. A contradictory claim one hears often on the right now is that“leftists” and “antifa”were the ones responsible for the Jan. 6 attempted coup that yet somehow still involved “patriots” seeking to defend the nation from a communist takeover. This is not our grandfathers’ republican party. It is being filled with Donald Trump wannabes whose positions differ little from those of autocrats the world over. Even as the republican party morphed decades ago into the party of billionaires, corporate tax cuts, and jingoism, the racism clouding its policies and rhetoric was veiled. Then 2016 came along and we watched as a Fifth Avenue playboy insisted Barack Obama’s presidency was illegitimate,called Mexicans “rapists” and “drug dealers,” demanded a“total and complete shutdown” of Muslims entering the United States, claimed there were “fine people on both sides” of the “Unite the Right” rally in Charlottesville, Va. at whichcivil rights activist Heather Heyer was run over, about whom former Ku Klux Klan grand wizard David Duke tweeted “Thank God for Trump!” “The former guy” ripped the dog whistle away from republicans and replaced it with a PA system. While Donald Trump may be out of the White House, there are those anxious to replace him, and they are infiltrating the republican party at all levels —school boards,secretaries of state, and elected state and federal offices. While we should take solace in knowing the number of white supremacist hate groups is declining, “the devil,” as the saying goes, “is in the details.” History may not resemble its antecedents exactly, but, as Mark Twain said, it sure sounds lately like it’s rhyming. Featured image: AI-generated via Midjourney TAGS Anti-Semitism Republican Party right wing hate groups **Lauren Boebert Gets Taken To School After She Gets Mad About Pronouns Again** **Separation of Church and State: Founding Fathers Quote Proves U.S. Isn’t a ‘Christian’ Nation** **Republican-led States Race to Abort Roe Vs. Wade** About Privacy Policy Terms Of Use Contact We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off insettings. Privacy Overview Strictly Necessary Cookies This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."}