{"id": 75, "name": "Americus Times-Recorder", "domain": "americustimesrecorder.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://americustimesrecorder.com/2025/06/10/james-magazine-names-influential-georgians-including-agricultural-commissioner-tyler-harper-and-rep-patty-stinson/", "title": "James Magazine Names Influential Georgians Including Agricultural Commissioner Tyler Harper And Rep Patty Stinson", "content": "Home E-Edition News Sports Obituaries Opinion Lifestyles Religion Classifieds Public Notices Home News Sports Opinion Obits Lifestyles Religion Classifieds Submit Public Notices E-Edition **James Magazine names influential Georgians including Agricultural Commissioner Tyler Harper and Rep. Patty Stinson** Published 9:06 pm Tuesday, June 10, 2025 By Rep. Patty Marie Stinson. The Hank Aaron Terrace at The Battery Atlanta’s Truist Park was the venue on the evening of May 27th for the annual James Magazine “Influential Georgians” reception. Approximately 100 attendees– ranging from various state and local elected officials to prominent business, political, judicial and cultural leaders– were welcomed by James CEO/Publisher Phil Kent. Kent presented the James “2025 Georgian of the Year Award” to Georgia Department of Agriculture Commissioner Tyler Harper, who he called “a highly respected manager with an outstanding work ethic who oversees Georgia’s No. 1 industry. He ensures Georgia’s food supply chain stays intact and that our food supply is safe.” Lt. Gov. Burt Jones assisted in presenting Harper his award, recalling their friendship and service together in the state Senate and calling him “highly qualified and particularly deserving of the high honor to be named James Magazine’s Georgian of the Year.” Three “2025 Exceptional State Lawmaker of the Year” awards were also bestowed by Kent. One recipient was state Sen. Greg Dolezal, R-Cumming, elected in 2018 and who he praised for “his work serving on a wide range of important committees including chair of the Senate Transportation Committee.” Kent emphasized that Dolezal is known for exceptional constituent service, typified by having recently helped keep several state parks open after a sudden announcement by the U.S. Army Corps of Engineers that they would be closed. The second honoree was state Rep. Patty Stinson, D-Butler, who Kent noted served on the Taylor County Commission before winning a House District 139 seat, which she represented from 2013 to 2023, and who now represents House District 150. “This well-respected lawmaker has worked across party lines to craft policy issues ranging from tax relief to education to healthcare,” Kent said. A special guest— former longtime Rep. Calvin Smyre, D-Columbus– assisted in presenting Stinson her award. Rep. Stinson has served in the Georgia House of Representatives for 13 years. Serving as Vice-Chair of State Planning & Community Affairs, Agriculture & Consumer Affairs, Appropriations, Health, Higher Education, Rural Development, Special Committee on Resource Management, and Vice-Chair of the Subcommittee of Sales Tax for the Ways and Means Committee. Stinson states “I am deeply honored to receive this recognition from James Magazine, a highly respected statewide publication that has been a cornerstone of excellence for decades. It is truly humbling to be acknowledged by such a distinguished magazine, and I sincerely appreciate this honor.” **You Might Like** **Americus man sentenced to prison for illegally possessing firearms** **Americus man sentenced to prison for illegally possessing firearms** **City Manager contract renewal vote** **City Manager contract renewal vote** **Americus resident sentenced for leading bank fraud and ID theft scheme** **Americus resident sentenced for leading bank fraud and ID theft scheme** **The Americus City Council hears further finance updates** **The Americus City Council hears further finance updates** Home News Sports Opinion Obits Lifestyles Religion Classifieds Small Business E-Edition Subscribe Submit a Classified Ad Submit a Letter to the Editor Submit a News Tip Submit an Event Submit a Child’s Birthday Submit an Engagement Announcement Submit a Photo About Us Terms of Use"}