{"id": 123, "name": "Beavercreek News-Current", "domain": "beavercreeknewscurrent.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.beavercreeknewscurrent.com/2025/06/10/brown-wins-title-at-state-track-and-field-podium-pictures-and-more-local-stories-on-greene-county-athletes-competing-in-columbus/#respond", "title": "Brown Wins Title At State Track And Field Podium Pictures And More Local Stories On Greene County Athletes Competing In Columbus", "content": "Click here - to use the wp menu builder E-Edition NewsLates tNewsSpecial SectionsSubmit News Tip Lates tNews Special Sections Submit News Tip Lates tNews Special Sections Submit News Tip 2024 Fair SportsLatest SportsSubmit Sports NewsSubmit Scores Latest Sports Submit Sports News Submit Scores Latest Sports Submit Sports News Submit Scores Obituaries OpinionLatest OpinionColumnsEditorialsLetter To The Editor Latest Opinion Columns Editorials Letter To The Editor Latest Opinion Columns Editorials Letter To The Editor Life & CultureReligionSubmit EngagementSubmit WeddingSubmit AnniversarySubmit BirthdaySubmit Birth Religion Submit Engagement Submit Wedding Submit Anniversary Submit Birthday Submit Birth Religion Submit Engagement Submit Wedding Submit Anniversary Submit Birthday Submit Birth ClassifiedsJob Match OhioOhio Public Notices Job Match Ohio Ohio Public Notices Job Match Ohio Ohio Public Notices Businesses Connect with UsAbout UsContact UsAdvertisePrivacy Policy About Us Contact Us Advertise Privacy Policy About Us Contact Us Advertise Privacy Policy Sports **Brown wins title at state track and field; podium pictures and more local stories on Greene County athletes competing in Columbus** Steven Wright | Greene County News Beavercreek sophomore Faith Brown stands atop the podium after winning the state title in the D-I girls 300 meter hurdles. Brown was a double-podium finisher, getting second in the D-I girls 100 meter hurdles. COLUMBUS — Four Greene County schools sent athletes to the 2025 OHSAA State Track and Field Championships. Returning to Jesse Owens Memorial Stadium in Columbus on Friday and Saturday, the county produced one state champion, Faith Brown of Beavercreek, and 13 podium finishes at this year’s event. Beavercreek Faith Brown ended her freshman year with a promising look into the future. She finished third in the 100 meter hurdles, happy with her performance that she felt afterward was complicated to run from the stress of going through the process for the first time at state and learning how to handle the nerves. This year on Saturday, Brown only displayed confidence in her second go and was rewarded in the process. Brown won the state championship in Division I for the girls 300 meter hurdles. Her time of 41 seconds flat set a new record for the meet at Jesse Owens Memorial Stadium. “It just feels nice,” Brown said. “I mean, I’m more ready to be done, but I’m really glad that I finished strong.” The run came a little less than a hour after Brown ran to a runner-up finish in the 100 meter hurdles. She went into it with the second fastest time from Friday’s prelims and said she really had wanted to win that race too, but it did give her a bit of extra motivation to take into her second run of the day. “I just hit one hurdle and fell back a little bit,” she said of the 100 meter race.” But I’m definitely not disappointed. I’m proud of myself knowing that I was going to be seeded first in the 300 and I’m excited that I won.” Brown said she felt the guidance she received from her coaches on how to take care of herself in between races to properly rest and get warmed up again was invaluable to the successful day she had. “I was just really relying on my coaches to help me push through the races and get the right mindset I needed today,” she said. Brown will have a bit of off time before she plans to compete at nationals in August. She said in the future she wants to push herself to best 40 seconds in the 300. She would set a new state record if she meets her goals. She wasn’t the only qualifier from Beavercreek pulling double duty on Saturday. Jackson Davis on the boys side ended up with three runs to close out the meet. Davis qualified in both the 1600 and 800 meter runs, but ended up in the 4 x 400 meter relay as well. He began the day in the 1600 getting fourth place with a time of 4:13.81, passing a group of three other competitors in the final corner to improve his standing. “I knew it was going to set up fast after we came through in 63 (seconds) and then 67 the first two laps,” he said. “I was getting ready for my last lap and I just knew with like 200 left I’d be able to go and I was letting people just go by me knowing I had a kick for the last 200 and I fell like I really executed it.” He said he felt as if he left all of his best effort to pushing at the end of that run and was not going to be as concerned with what followed in the 800. The motivation of finishing lower in the standings in that race last year at state, as well as getting past an injury during the indoor championships, was at the front of his mindset. But he learned after his 1600 run that an injury to a teammate was possibly going to have him substitute in the relay at the end of the night as well. “I just figured out this morning what I really wanted to do, and that was with the double and mainly focus on the 1600 and that’s what I did,” Davis said. “I kind of walked off thinking if I’m going to have the 800 later, I wanted a good mindset for the 16 and I left it all out there.” He said the turnaround for the 800 ended up being shorter, only allowing for a short warm-up run before needed to get back on the track. He ended up staying near the back of the pack for most of the race as he conserved energy for a final run later. Davis did end up in the 4 x 400 relay where he ran the third leg of the race. Subbing in for Kelvin Keyes, he joined Aaden Hildebrand, Aiden Howard and Gio Louprasong to together run eighth in the final race of the meet. A busy day overall, but Davis managed himself well to be there for his teammates when he was needed while also meeting his goals in the process. Cedarville Disappointment stemming from his performance at regionals had to quickly be forgotten for Bradyn Long at state. Long didn’t initially qualify for state after finishing in fifth at the Piqua regional meet, but he got a chance to make the most of an additional opportunity after getting in as an alternate. “I was kind of disappointed with my time because I didn’t get top four,” Long said. “But my coach told me that people have bad race before he then he told me I was in and get to go to state and it just felt so good.” On Friday in the preliminaries of the boys 300 meter hurdles, he ran the fifth fastest time in his heat and had to wait out the results of the second set of runners to see if he would advance. His time held up and got him into Saturday’s final. In that race he ran a time 39.76 to finish in eighth place and get the final spot on the podium. Long called it a “blessed” moment to get a chance not only get his chance in Columbus, but then to make the most of it by getting a medal. “Just the experience overall will be good for the future,” he said. “Now I know almost the kind of pressure of state and I can handled that better in the future as a junior and senior. … The Lord blessed me with this opportunity and it feels great.” On the girls side, Ellie Mark said her favorite part of her runs are when she can see the finish line. It lets her know to leave everything she has remaining in the tank out and provides a better feeling when she crosses the line. She did just that on Saturday by matching her personal best time in the girls 3200 meter, something she said she hasn’t been coming close to matching since setting it last year. “I’ve been a little mentally challenge throughout the whole season,” she said. “Today there’s like nothing riding on because I was seeded low and it’s just my race to have fun. I’m overwhelmed with joy. I’m so grateful I was able to get out there and just put together a race that I had fun in.” She finished just one spot off the podium after being near the bottom of the standings in the same event a year ago. This time, she got to come to state with her sister, Mandy, who is a freshman. Ellie said the dynamic was unique, but felt the competitive nature between them while running separate races helped push one another to do well for the other. “That made the whole race season so much fun,” she said. “What I didn’t have in the times this year, I definitely had in fellowship. I’m really proud of her, she knocked down a school record and as a freshman made state and got ninth. I’m so proud of her.” Legacy Christian It was an emotional finish for Caroline Hamilton to her senior year and high school career. She had the second fastest qualifying time in the girls 3200 meters in D-III, but the race didn’t go her way. Hamilton had shown a strong progression from the start of her freshman year, with the yearly results displaying her gains. She began this year by winning the cross country state championship in Division III after a strong finish in the closing stretch. That wasn’t the first time she made that type of move as just months earlier at last year’s state track and field championships competing in the 1600 meters, she moved forward on the final lap to get up to eighth and get a podium place. Back at state for a final time and now running in the 3200 meters, Hamilton again had some of her closest competitors she has been running alongside for a final race. As the lead runner changed during the race, she remained within striking distance for most of her run. However, on the final lap the reserves of several runners behind her kicked in and began to get by her until she crossed the finish line in seventh place. After stepping off the podium and making her return to the team camp, she let out a few tears of emotion after meeting those close to her on the way. Saturday likely didn’t go the way Hamilton would have hoped, but she is going out being able to be called a champion. Levi Thompson in the boys competition got back to state for a second straight year. He was part of the 4 x 800 relay team that got a podium finish last year, but this time he qualified as an individual. He finished 15th in his 1600 meters run. Carroll Carroll’s defending state champion in the boys 800 meters, Andrew Janson, was able to qualify again and try to win a second in a row. His race was choatic with a pair of runners going down early in the run after jostling for position, and another tripped up at the finish line. Janson was near the back of the pack for much of the run and finished in 16th. Ruby Gross in the girls 1600 meters had an excellent closing stretch to make the podium. Back at state for the fourth straight year, she was able to run as an individual again after only being part of a relay team a year ago. Gross was in the middle of the pack during the middle laps and found herself off the podium until a charge on the fourth lap saw her and two others break away from the remainder of the field. The others in her small group appeared to have just more in the tank down the final stretch, but Gross had already done enough to secure a medal. On Friday, Gross was part of the 4 x 800 relay team getting fourth place. Along with Anna Thurman, Makayla McLoughlin, and Alyssa Fast, the girls ran the race in 9:32.78 to set a new school record in the event. OHSAA STATE TRACK AND FIELD RESULTS Division — Event — Name — Finishing Time/Distance (Place) FRIDAY PRELIMS AND FINALS Division III Cedarville Boys — 4 x 800m relay finals — Josh Duncan, Archer Holston, Will Mossing, Ryan Reed — 8:04.17 (5th) Girls — 300m Hurdles prelims — Mia Burr — 49.18 (9th in Heat 1/17th) Boys — 300m Hurdles prelims — Bradyn Long — 39.53 (5th in Heat 1/7th) Division II Carroll Girls — High Jump finals — Miryam Brandon — no clearance (t12th) Girls — 4 x 800m relay finals — Anna Thurman, Makayla McLoughlin, Alyssa Fast, Ruby Gross — 9:32.78 (4th) Boys — 4 x 800m relay final — Finn Rollins, Andrew Dirks, Connor Kramer, Andrew Janson — 8:12.11 (11th) Boys — 4 x 400m relay prelims — David Gervais, Finn Rollins, Hayden Holbrook, Emilio Dessert — 3:28.84 (7th in Heat 1/15th) Division I Beavercreek Boys — 4 x 800m relay finals — Aiden Allen, Jackson Davis, Brody Graley, Xander Edem — 8:02.26 (17th) Girls — 100m Hurdles prelims — Faith Brown — 13.91 (1st in Heat 2/2nd) Girls — 300m Hurdles prelims — Faith Brown — 42.40 (1st in Heat 1/1st) Girls — 4 x 400m relay prelims — Maya Cook, Aysiah Sims, Emma Driver, Faith Brown — 3:58.95 (8th in Heat 2/15th) Boys — 4 x 400m relay prelims — Gio Louprasong, Aiden Howard, Aaden Hildebrand, Kelvin Keyes — 3:18.20 (2nd in Heat 2/3rd) Seated girls — Shot put finals — Zoe Roll — 12’ 8” (4th) Seated girls — Shot put finals — Enora McEllroy — 11’ 5” (6th) SATURDAY FINALS Division III Cedarville Girls — 1600m— Mandy Mark (Fr.) — 5:25.66 (9th) Boys — 300m Hurdles— Bradyn Long (So.) — 39.76 (8th) Boys — 800m — Ryan Reed (Sr.) — 1:59.79 (14th) Girls — 3200m — Ellie Mark (Jr.) — 11:26.96 (9th) Legacy Christian Boys — 1600m — Levi Thompson (Sr.) — 4:36.32 (15th) Girls — 3200m — Caroline Hamilton (Sr.) — 11:18.75 (7th) Division II Carroll Girls — 1600m — Ruby Gross (Sr.) — 4:56.64 (8th) Boys — 800m — Andrew Janson (Sr.) — 2:13.88 (16th) Division I Beavercreek Seated Girls — 400m — Enora McEllroy (Fr.) — 1:44.66 (3rd) Seated Girls — 100m — Enora McEllroy (Fr.) — 26.40 (3rd) Seated Girls — 100m — Zoe Roll (Sr.) — 28.70 (4th) Girls — Shot Put — Mackenzie McClurkin (Sr.) — 34’ 7.75” (18th) Boys — High Jump — Isaiah Michael-Williams (Sr.) — 6’ 4” (13th) Girls — 100m Hurdles — Faith Brown (So.) — 13.96 (2nd) Boys — 1600m — Jackson Davis (Jr.) — 4:13.81 (4th) Girls — 300m Hurdles — Faith Brown (So.) — 41.00 (1st) Boys — 800m — Jackson Davis (Jr.) — 1:58.82 (18th) Boys — 4 x 400m relay — Aaden Hildebrand, Aiden Howard, Jackson Davis, Gio Louprasong — 3:19.76 (8th) Contact Steven Wright at 937-502-4498 and follow on X (formerly Twitter) @Steven_Wright_. **Featured Local Savings** **Photos: Fairborn High School holds youth basketball camp** **Kil-Kare events to be broadcast by GCSN; Scouts scores — Sports Digest: June 10, 2025** **Beavercreek’s Brown wins state title at OHSAA Track and Field Championships — Carroll, Cedarville, Legacy Christian have runners make podium**"}