{"id": 1240, "name": "Shame Project", "domain": "shameproject.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://shameproject.com/shame-blog/malcolm-gladwell-running-cover-enablers-serial-child-molester-jerry-sandusky/", "title": "Malcolm Gladwell Running Cover Enablers Serial Child Molester Jerry Sandusky", "content": "**S.H.A.M.E. Project** Home Profiles Reports Blog Tips About Donate RSS **Why is Malcolm Gladwell running cover for the enablers of serial child molester Jerry Sandusky?** NSFWCORP recently publishedan articlein which I explore the weird, sleazy public relations blitz designed to whitewash the role that top Penn State officials played in covering up the crimes of Jerry Sandusky. It was an impressive campaign, and included the likes ofNew Yorkerstaff writer Malcolm Gladwell. Was Gladwell an unwitting victim, roped in by Penn State's multi-million dollar propaganda push? Or was this just another one ofhis usual PR jobs? Read the article onNSFWCORP.comto find out... FROM:YASHA LEVINEDATE: DEC 13TH, 2012 RUNNING COVER FOR THE ENABLERS OF SERIAL CHILD MOLESTERS SANTA MONICA, CA: The saga of Penn State pedophile Jerry Sandusky came to end this past summer, when a jury found him guilty of molesting 10 boys over a period of 14 years and a judge sentenced him to serve out the rest of his life behind bars. Or so it seemed… Before Sandusky had even been transferred to his new digs at the Greene supermax state correctional facility, a well-greased public relations campaign popped up on the scene defending the people and the university that had hushed up the retired Penn State football coach’s monstrous crimes and enabled him to keep molesting boys for more than a decade. The PR offensive was truly impressive. It involved a phalanx of high profile lawyers, top dollar crisis management professionals, media consultants, astroturf groups and even ateabagger filmmaker—all them pushing similar story lines that kept the blame focused on Sandusky and exonerated Penn State’s bureaucracy from any wrongdoing. Why would anyone want to protect a bunch of sleazy serial child molester enablers? The answer is simple: money. Continue the article at NSFWCORP >> Want to know more?Read Malcolm Gladwell's SHAMEprofile, then check thein-depth report. *** Yasha Levine is a co-founderof the S.H.A.M.E. Project. Read his book:The Corruption of Malcolm Gladwell. Click the cover, buy the book! Share this:TwitterFacebook Twitter Facebook Twitter Facebook **S.H.A.M.E. MAILING LIST** **Support S.H.A.M.E.** Want to pitch in?Support us now, and help strike fear into the hearts of corporate trolls.Contribute usingPayPalorWePay… **Buy S.H.A.M.E. Books** **Latest Profiles** Radley Balko Radley Balko Charles Murray Charles Murray Megan McArdle Megan McArdle Adam Davidson Adam Davidson **Latest Profiles** Radley Balko Radley Balko **Latest Posts** Wall Street Journal Issues Epic Correction On Radley Balko’s Error-Riddled Reporting Malcolm Gladwell’s “David & Goliath” Asks Us To Pity the Rich Radley Balko: Anatomy of a “Stand Your Ground” Shill **Support S.H.A.M.E.** Want to pitch in?Support us now, and help strike fear into the hearts of corporate trolls.Contribute usingPayPalorWePay… S.H.A.M.E. Project© 2012 - 2014"}