{"id": 966, "name": "Neues Deutschland", "domain": "nd-aktuell.de", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.nd-aktuell.de/artikel/1191728.big-beautiful-bill-gesetz-us-steuerreform-der-grosse-diebstahl-der-eliten.html", "title": "1191728.big Beautiful Bill Gesetz Us Steuerreform Der Grosse Diebstahl Der Eliten.html", "content": "Suche Jetzt spenden! Genoss*in werden AktuellMeinungPolitik & ÖkonomieHauptstadtregionFeuilletonSportDie WochePodcastsNewsletter Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Die Woche Podcasts Newsletter Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Die Woche Podcasts Newsletter Die WochePolitik & ÖkonomieKunst & KritikMikroskopBegegnungenMetropoleSportReise Politik & Ökonomie Kunst & Kritik Mikroskop Begegnungen Metropole Sport Reise Politik & Ökonomie Kunst & Kritik Mikroskop Begegnungen Metropole Sport Reise Podcasts Newsletternd.Kompaktnd.Die WocheMuckefuck nd.Kompakt nd.Die Woche Muckefuck nd.Kompakt nd.Die Woche Muckefuck RatgeberGesund lebenReise Gesund leben Reise Gesund leben Reise CommuneAlles aus Commune Alles aus Commune Alles aus Commune Termine nd.ReisenAlle Reisen Alle Reisen Alle Reisen Abond.Digitalnd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAGBsAbo kündigen nd.Digital nd.Digital + nd.DieWoche nd.DieWoche nd.Print Abo-Service AGBs Abo kündigen nd.Digital nd.Digital + nd.DieWoche nd.DieWoche nd.Print Abo-Service AGBs Abo kündigen Genossenschaft mein ndMeinungPolitik & ÖkonomieHauptstadtregionFeuilletonSportDie WochePodcastsNewsletter Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Die Woche Podcasts Newsletter Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Die Woche Podcasts Newsletter Jetzt spenden! Genossenschaft Abo mein nd Suchausdruck* Suchausdruck* Suchausdruck* Suche Jetzt spenden! Genoss*in werden AktuellMeinungPolitik & ÖkonomieHauptstadtregionFeuilletonSport Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Meinung Politik & Ökonomie Hauptstadtregion Feuilleton Sport Die WochePolitik & ÖkonomieKunst & KritikMikroskopBegegnungenMetropoleSportReise Politik & Ökonomie Kunst & Kritik Mikroskop Begegnungen Metropole Sport Reise Politik & Ökonomie Kunst & Kritik Mikroskop Begegnungen Metropole Sport Reise Podcasts Newsletter RatgeberGesund lebenReise Gesund leben Reise Gesund leben Reise Commune Termine nd.Reisen Abonnierennd.Digitalnd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.Digitalnd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.DieWochend.PrintAbo-ServiceAbo kündigen nd.PrintAbo-ServiceAbo kündigen Abo-ServiceAbo kündigen Abo kündigen nd.Digitalnd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.DieWochend.PrintAbo-ServiceAbo kündigen nd.PrintAbo-ServiceAbo kündigen Abo-ServiceAbo kündigen Abo kündigen nd.Digital + nd.DieWochend.DieWochend.PrintAbo-ServiceAbo kündigen nd.DieWochend.PrintAbo-ServiceAbo kündigen nd.PrintAbo-ServiceAbo kündigen Abo-ServiceAbo kündigen Abo kündigen nd.DieWochend.PrintAbo-ServiceAbo kündigen nd.PrintAbo-ServiceAbo kündigen Abo-ServiceAbo kündigen Abo kündigen nd.PrintAbo-ServiceAbo kündigen Abo-ServiceAbo kündigen Abo kündigen Abo-ServiceAbo kündigen Abo kündigen Abo kündigen GenossenschaftÜber unsKontaktAnzeigenJobangeboteImpressumDatenschutz Über unsKontaktAnzeigenJobangeboteImpressumDatenschutz KontaktAnzeigenJobangeboteImpressumDatenschutz AnzeigenJobangeboteImpressumDatenschutz JobangeboteImpressumDatenschutz ImpressumDatenschutz Datenschutz Über unsKontaktAnzeigenJobangeboteImpressumDatenschutz KontaktAnzeigenJobangeboteImpressumDatenschutz AnzeigenJobangeboteImpressumDatenschutz JobangeboteImpressumDatenschutz ImpressumDatenschutz Datenschutz KontaktAnzeigenJobangeboteImpressumDatenschutz AnzeigenJobangeboteImpressumDatenschutz JobangeboteImpressumDatenschutz ImpressumDatenschutz Datenschutz AnzeigenJobangeboteImpressumDatenschutz JobangeboteImpressumDatenschutz ImpressumDatenschutz Datenschutz JobangeboteImpressumDatenschutz ImpressumDatenschutz Datenschutz ImpressumDatenschutz Datenschutz Datenschutz mein nd Politik US-Steuerreform **»Big Beautiful Bill«-Gesetz: Der große Diebstahl der Eliten** **Mehr Geld für Milliardäre, dafür weniger Essenshilfen für Millionen: Das »Big Beautiful Bill«-Gesetz von Donald Trump ist alles andere als wunderbar** Oliver Kern 10.06.2025, 12:17 Uhr Lesedauer: 8 Min. Gabe Vasquez hat es auf den Punkt gebracht. »Kindern das Essen wegzunehmen und gleichzeitig Milliardären Steuererleichterungen zu gewähren, ist einfach falsch«, sagte der Abgeordnete der Demokratischen Partei aus dem US-Bundesstaat New Mexico vor zwei Wochen in einem Unterausschuss des Repräsentantenhauses. Etwa 42 Millionen Amerikaner, die zu wenig haben, um täglich ihre Ernährung zu sichern, erhalten Lebensmittelmarken über das Hilfsprogramm Snap (Supplemental Nutrition Assistance Program). Ihnen stehen Kürzungen von 290 Milliarden Dollar über die kommenden zehn Jahre bevor, sollte das neue Steuergesetz derRepublikanervom Kongress verabschiedet und von PräsidentDonald Trumpunterschrieben werden. Und das ist nur ein Weg von vielen, auf denen die Konservativen die größte Einkommensverschiebung von Arm zu Reich vorantreiben. Natürlich nennen sie das Gesetz nicht so. In unverkennbarer Trump-Manier wurde das Vorhaben »One Big Beautiful Bill« getauft. Groß ist es tatsächlich. Schön jedoch nur für die allerwenigsten. Sozialverbände haben errechnet, dass Snap-Leistungen schon jetzt durchschnittlich nur sechs Dollar pro Person und Tag betragen. Wenn ein Haushalt gar kein Einkommen hat, erhöht sich der Betrag auch nur auf knapp neun Dollar. Gabe Vasquez drückte es so aus: »Bei uns bekommt man für sechs Dollar nur eine halbe Packung Tortillas und eine Dose Pintobohnen. Das ist alles: Frühstück, Mittag und Abendessen. Könnten Sie selbst von sechs Dollar am Tag leben? Wahrscheinlich nicht«, sagte er in Richtung seiner republikanischen Kollegen. »Doch wenn Sie nicht bereit sind, mit sechs Dollar am Tag auszukommen, dann erwarten Sie nicht, dass die Kinder in meinem Wahlkreis das tun.« Dort sei jede vierte Familie auf die Hilfen angewiesen. Die Kürzungen träfen zusätzlich auch Lebensmittelläden. Die Snap-Leistungen würden in ärmeren Gegenden schon mal 80 Prozent ihrer Umsätze ausmachen. Wird hier gekürzt, gehen die Läden pleite, Angestellte werden nicht mehr bezahlt, regionalen Erzeugern gingen die Abnehmer aus. »Trotzdem schlagen Sie vor, 300 Milliarden Dollar den arbeitenden,hungernden Familienzu entziehen. Das ist keine Reform. Das ist einfach Diebstahl«, so Vasquez. Im Repräsentantenhaus hat er die Republikaner damit nicht überzeugen können. Mit 215 zu 214 Stimmen wurde der Gesetzentwurf, der auch die Zahlungen fürMedicaidum fast 700 Milliarden Dollar reduzieren soll, denkbar knapp angenommen. Er wird nun in der zweiten Parlamentskammer weiter verhandelt. Medicaid ist die Gesundheitsversicherung für Bürger mit geringem Einkommen. Darüber sind gut 71 Millionen US-Amerikaner versichert. Die Trump-Regierung hat ein riesiges Gesetzespaket ins Parlament eingebracht, dem die erste Kammer – das Repräsentantenhaus – bereits zugestimmt hat. Die zweite Kammer, der Senat, hat noch nicht abgestimmt.Der Entwurf sieht vor, die Militärausgaben um 150 Milliarden Dollar zu erhöhen und zusätzlich 175 Milliarden für die Durchsetzung der Einwanderungsgesetze bereitzustellen.Um mehrere Hundert Milliarden Dollar gekürzt werden sollen staatliche Leistungen, etwa für Lebensmittelhilfen und Medicaid, dem Krankenversicherungsprogramm für Menschen mit niedrigem Einkommen.Die meisten befristeten Steuersenkungen aus Trumps erster Amtszeit sollen dauerhaft gelten. Die Staatsverschuldung würde unter dem Strich enorm steigen.nd Seit vergangenem Freitag ist die konservative Senatorin Joni Ernst zum Gesicht der staatlich organisierten Grausamkeit geworden. Bei einer Bürgerversammlung wurde sie zu den Kürzungen bei Medicaid befragt. Als ein Zwischenrufer warnte: »Menschen werden deswegen sterben!«, antwortete Ernst in kaum zu überbietender Arroganz: »Nun, wir sterben doch alle irgendwann.« Die Senatorin steht im Herbst 2026 im Bundesstaat Iowa wieder zur Wahl. Dann wird sich zeigen, ob ihr derlei Aussagen schaden. Dass die Republikaner wissen, wie unpopulär das Gesetz ist, zeigt sich indes daran, dass viele der Kürzungen erst zwei Monate nach dieser Zwischenwahl Ende 2026 in Kraft treten sollen. Spätestens dann aber wird die mehr als 200 Jahre alte Losung aus der Französischen Revolution »Friede den Hütten! Krieg den Palästen!« von den Palastbewohnern umgekehrt. Den Hütten wird der Krieg erklärt – getarnt als Maßnahmen gegen angeblich grassierende Verschwendung und Missbrauch: »Wir rühren nichts an. Wir wollen nur keine Verschwendung, keinen Betrug und keinen Missbrauch«, so Trump. Das überparteiliche Congressional Budget Office (CBO) hat derweil prognostiziert, das Gesetz würde bis zum Jahr 2034 dazu führen, dass insgesamt 11 Millionen Amerikaner auf verschiedenen Wegen ihre Krankenversicherung verlieren. Eigentlich sind es sogar mehr. Einige dürften jedoch anderweitig private Versicherungen finden, beispielsweise über ihren Arbeitsplatz oder den Affordable Care Act, besser bekannt alsObamacare, dann aber zu höheren Preisen. Selbst die Republikaner behaupten nicht, dass es elf Millionen Betrüger des Medicaid-Systems gibt. Vielmehr rechnen sie damit, dass auch Berechtigte ihre Bezüge einbüßen werden. So soll sowohl für Lebensmittelhilfen als auch für Medicaid eine Arbeitspflicht für Menschen im Alter zwischen 19 und 64 Jahren gesetzlich verankert werden. Wer nicht mindestens 80 Stunden im Monat arbeitet, zur Schule geht oder an einer Ausbildung teilnimmt, dem droht der Komplettverlust der Sozialleistungen. Ausgenommen sind Eltern kleiner Kinder, schwangere Frauen sowie chronisch Kranke. Wie verheerend solche Vorgaben sind, mussten die Bürger in Arkansas erfahren, dem ersten Bundesstaat, der 2018 ähnliche Arbeitspflichten eingeführt hatte, bis sie gerichtlich gestoppt wurden. Mehr als 18 000 Bürger verloren damals in nur wenigen Monaten ihre Medicaid-Versicherung, weil sie die Arbeitspflichten nicht verstanden hatten, der Staat sie nie über die Änderungen informiert hatte oder Online-Meldeportale bewusst kompliziert gehalten wurden, wie Studien später feststellten. Das Argument der Befürworter, dass die Verpflichtung Versicherte dazu bewegen würde, eine Arbeit zu finden und bei höherem Gehalt irgendwann aus der gesetzlichen Versicherung auszusteigen, bewahrheitete sich in Arkansas nicht. Der Analyse des CBO zufolge würden allein aufgrund der Arbeitspflicht schätzungsweise fast 8 Millionen Medicaid-Empfänger ihre Versicherung verlieren. Die Kürzungen dürften letztlich auch dazu führen, dass Kliniken pleitegehen, etwa, weil dann Pflegekosten nicht mehr von einer Versicherung übernommen werden. »Kliniken, die bereits mit geringen Margen operieren, können solche Verluste nicht verkraften, ohne ihr Leistungsangebot zu reduzieren oder ihre Türen ganz zu schließen«, warnte Bruce Siegel, CEO der Krankenhausvertretung America’s Essential Hospitals. Das drohende Kliniksterben würde besonders im ländlichen Raum ausgerechnet die Wählerbasis der Republikaner hart treffen. »Das ist keine Reform. Das ist einfach Diebstahl.« Die Demokraten, die seit der Wahlschlappe im vergangenen Herbst auf allen politischen Bundesebenen in der Minderheit sind, sind gezwungen, wenigstens den bereits unpopulären Status quo zu verteidigen, den sie mitzuverantworten haben, waren sie doch in zwölf der letzten 16 Jahre an der Macht. Auf ein größeres Projekt – etwa einer staatlichen Krankenversicherung für alle – hat sich die Partei noch immer nicht einigen können. Dass das Staatsdefizit durch steigende Sozialversicherungsleistungen an dieBabyboomer-Generationimmer größer wird, haben sie ignoriert. Ebenso das Problem, dass mehr als 40 Millionen Amerikaner zu wenig Geld haben, um genug Essen zu kaufen. Nun läuft ein Viertel davon Gefahr, selbst die letzte Ernährungshilfe zu verlieren, darunter vier Millionen Kinder. Wie bei Medicaid müssen auch beim Snap-Programm die Bundesstaaten entscheiden, wie sie mit dem Verlust von Bundesmitteln umgehen. Einige könnten versuchen, die Teilnehmerzahl zu begrenzen, andere das Programm ganz beenden. In dieser Woche hat der Senat seine Arbeit am Gesetz aufgenommen. Es wird sicher marginale Änderungen geben, über die dann auch die erste Kammer noch einmal abstimmen muss. Stoppen können dieDemokratendas Vorhaben nicht. Die Republikaner können sich sogar drei Abweichler im Senat leisten. Bislang sind es noch ein paar mehr, was aber für die Ärmsten im Land nicht unbedingt positiv ist. Schließlich plädieren Senatoren wie Rand Paul oder Ron Johnson für noch mehr Kürzungen, da sie eine Anhebung der Schuldengrenze ablehnen, ohne die der bisherige Entwurf nicht funktioniert, sonst ginge dem Bund bei all den Steuerkürzungen schon im August das Geld aus. Das Gesetz würde »die Schulden explodieren lassen«, wetterte Rand Paul. Gegen die Steuererleichterungen für Reiche oder die Kürzungen bei Lebensmittelhilfen habe er aber nichts. Sie gehen ihm eher noch nicht weit genug. Mit Paul und Johnson hat Präsident Trump schon telefoniert, um auszuloten, wie er ihnen entgegenkommen kann. Auch Josh Hawley hat er bereits versprochen, dass es angeblich »keine Kürzungen bei Medicaid-Leistungen« geben werde, wie der Senator aus Missouri berichtete. Er fürchtet den Image-Schaden, sollten tatsächlich Kliniken schließen. Doch genau das ist der eingeschlagene Weg, denn knapp 800 Milliarden Dollar sollen bei Medicaid eingespart werden. Das geht nur, wenn etwa acht Prozent weniger Menschen versichert sind oder die Leistungen für alle gekürzt werden. So oder so sinken letztlich die Einnahmen der Krankenhäuser. Die Steuersenkungen hatte Trump bereits 2017 in seiner ersten Amtszeit durchgesetzt. Wenn der Kongress nicht handelt, laufen die Erleichterungen aber im September aus. Ein Drittel der Steuergeschenke, die nun dauerhaft gelten sollen, entfällt auf die oberen fünf Prozent, die gut eine halbe Million Dollar oder mehr im Jahr verdienen. Diejenigen mit weniger als 35 000 Dollar werden nach dem neuen Gesetzespaket zwar auch entlastet, denn geplant ist auch die Abschaffung von Steuern auf Trinkgeld und Überstunden. Doch unterm Strich zahlt diese Gruppe wegen der Kürzungen bei Medicaid und Lebensmittelmarken drauf, im Schnitt 820 Dollar pro Jahr. Hinzukommt, dass die Erleichterungen für die Reichen permanent sein sollen, während sie für Geringverdiener nur vier Jahre gelten sollen – bis zum Ende von Trumps Amtszeit. Die Erbschaftssteuer soll künftig erst ab einem Vermögen von 30 Millionen Dollar greifen. Der Organisation Americans for Tax Fairness zufolge verschenkt der Staat damit mehr als 200 Milliarden Dollar. Zur Erinnerung: Die Lebensmittelhilfen sollen zugleich um 290 Milliarden gekürzt werden. Klarer können Prioritäten kaum gesetzt werden. **Wir stehen zum Verkauf. Aber nur an unsere Leser*innen.** Die »nd.Genossenschaft« gehört denen, die sie lesen und schreiben. Sie sichern mit ihrem Beitrag, dass unser Journalismus für alle zugänglich bleibt – ganz ohne Medienkonzern, Milliardär oder Paywall. Dank Ihrer Unterstützung können wir: → unabhängig und kritisch berichten→ übersehene Themen in den Fokus rücken→ marginalisierten Stimmen eine Plattform geben→ Falschinformationen etwas entgegensetzen→ linke Debatten anstoßen und weiterentwickeln Mit »Freiwillig zahlen« oder einemGenossenschaftsanteilmachen Sie den Unterschied. Sie helfen, diese Zeitung am Leben zu halten. Damit nd.bleibt. Leser*innenbrief schreiben Donald Trump Krankenhaus Kriminalität Reichtum Steuerpolitik Versicherung 10.06.2025»Big Beautiful Bill«-Gesetz: Der große Diebstahl der Eliten 04.06.2025Musk vs. Trump: Vorsicht vor falschen Freunden! 30.05.2025Leon Draisaitls nächster Anlauf zur Traumerfüllung @_oliverkern RSS 05.06.2025/ Stephan KaufmannSchulden der USA: Weltmacht auf KreditDie Steuesenkungspläne von US-Präsident Donald Trump bedeuten Billionen Dollar neue Schulden. Eurpoa wittert eine »Chance« für den Euro. 04.06.2025/ Sarah Yolanda KossMafiöse MillionäreSarah Yolanda Koss hält Ausschau nach organisierter Kriminalität 04.06.2025/ Oliver KernMusk vs. Trump: Vorsicht vor falschen Freunden!Elon Musk darf auch nach seiner Kritik an Donald Trumps Steuergesetz nun kein Liebling der Linken in den USA werden Beim Duell zwischen dem Präsidenten und dem Gouverneur steht Kalifornien im Visier der Maga-Bewegung Beim Duell zwischen dem Präsidenten und dem Gouverneur steht Kalifornien im Visier der Maga-Bewegung Polens Opposition fordert dennoch einen sofortigen Rücktritt des Ministerpräsidenten und Neuwahlen Polens Opposition fordert dennoch einen sofortigen Rücktritt des Ministerpräsidenten und Neuwahlen Katholiken im Süden wollen nach dem Regierungswechsel in Seoul den Austausch mit dem Norden voranbringen Katholiken im Süden wollen nach dem Regierungswechsel in Seoul den Austausch mit dem Norden voranbringen Der US-Präsident versucht seit Tag eins, seine Macht auszuweiten – jetzt auch in Los Angeles Der US-Präsident versucht seit Tag eins, seine Macht auszuweiten – jetzt auch in Los Angeles Argentiniens Oberstes Gericht bestätigt Verurteilung von Ex-Präsidentin Cristina Kirchner Argentiniens Oberstes Gericht bestätigt Verurteilung von Ex-Präsidentin Cristina Kirchner Joachim Volz wehrt sich gegen das katholische Arbeitsrecht, um medizinisch notwendige Abtreibungen durchführen zu können. Joachim Volz wehrt sich gegen das katholische Arbeitsrecht, um medizinisch notwendige Abtreibungen durchführen zu können. Ein »Manifest« sorgt für Unruhe im politischen Berlin: Prominente Sozialdemokraten fordern eine sofortige Kehrtwende in der Außenpolitik Ein »Manifest« sorgt für Unruhe im politischen Berlin: Prominente Sozialdemokraten fordern eine sofortige Kehrtwende in der Außenpolitik CDU- und andere Lokalpolitiker unterstützen Streichung von Geldern für Demokratieprojekt in Kahla CDU- und andere Lokalpolitiker unterstützen Streichung von Geldern für Demokratieprojekt in Kahla Tägliche NewsFür Political AnimalsMitnd.DIGITALhaben Sie genossenschaftlich produzierten Journalismus immer griffbereit. Lesen Sie linke Perspektiven auf das politische Geschehen: zu jeder Zeit, von überall, in Ihrer Hand. Wöchentliche News und HintergründeFür Genuss-Leser*innenMitnd.DIE WOCHEbekommen Sie linke Analysen, sorgfältig recherchierte Reportagen und aufschlussreiche Interviews direkt nach Hause. Gönnen Sie sich die Ruhe von bedrucktem Papier. Montag bis Freitag um 5 UhrFür Frühaufsteher*innenDenMUCKEFUCKgibt’s bei uns zum Frühstück: Unser Newsletter bringt Ihnen wochentäglich alles, was Berlin bewegt: Debatten, Schlagzeilen, Straßenaktionen und Kulturtipps – ungefiltert, auch auf Telegram. Abo Abo kündigen PDF|Epub Neue App: nd.Digital Newsletter Freiwillig zahlen Die Redaktion Gastautor*innen Genossenschaft Kontakt Jobangebote Anzeigen Mediadaten Impressum Datenschutz AGB Archiv Schlagwörter Termine nd.Reisen Die Zukunft RSS-Feeds Impressum Datenschutz AGB Hinweis zum Datenschutz: Wir setzen für unsere Zugriffsstatistiken das Programm Matomo ein. Besuche und Aktionen auf dieser Webseite werden statistisch erfasst und ausschließlich anonymisiert gespeichert. © Redaktion nd - Journalismus von links. Realisation:WARENFORM. Hosting:SINMA."}