{"id": 647, "name": "Harvard International Review", "domain": "hir.harvard.edu", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://hir.harvard.edu/ethics-standards-and-corrections", "title": "Ethics Standards And Corrections", "content": "US Europe Asia Middle East & Africa Americas Oceania Archives Log In Subscribe **Ethics, Standards, and Corrections** TheHarvard International Reviewrequires all articles undergo a rigorous editing and fact-checking process. Our primary goal is to accurately and fairly cover international affairs. **Ethics** The HIR prides itself in upholding core journalistic principles of integrity and accountability. As such, we expect all HIR members to abide by these rules and principles as a condition of membership. Writers may not have financial or personal conflicts of interest regarding a story they seek to cover. All information must be attributable. Anonymous sources are permitted, and anonymity must be respected where requested or else the information cannot be used. Interviews require informed consent from the interviewee. HIR commercial activities, such as advertisements, are entirely separate from HIR newsroom decisions. The HIR does not permit sponsored content. The HIR avoids any behavior that generates a conflict of interest for the organization that affects our ability to fairly and accurately cover a story. The HIR actively strives for fair and accurate coverage. Biases, rumors, and distortions are not welcome at the HIR. Plagiarism and lack of respect for copyrights is unacceptable. The HIR does not accept any gifts offered to the HIR or its members exclusively as it represents a conflict of interest. The HIR is not a vehicle for obscenity, vulgarity, hateful speech, or propaganda. Any deviation from this principle means that the reproduction of a slur, for example, was journalistically necessary. Quotations and information must not be taken out of context. Citations are necessary to provide the necessary background for the reader to generate an informed opinion. Victims' privacy must be preserved in instances of crimes against minors, sexual violence, or other extreme abuse. Deviations are due to the victims' name already being public knowledge or the express and informed consent of the victim to have their real name used. **Standards** Pieces written by HIR staff undergo a five step editing process with fact checking in each round. Pieces are required to cite a multitude of sources in order to meet publication criteria. HIR staff pieces are non-editorial and reflect an academic perspective on relevant international affairs. Articles, such as interviews, that include opinion are always explicitly delineated as such. Guest writers undergo a four step editing process with fact checking in each round. Guest pieces always reflect the views of the author. **Corrections** The HIR encourages readers to submit complaints about errors in articles. The HIR Editorial Staff will review complaints and issue corrections as appropriate. Please submit your correction complaints tocorrections@hir.harvard.eduwith the article link, the error in question, and the proposed correction. Staff writers are expected to notify the appropriate editor immediately should they realize a correction is warranted. Sections US Europe Asia Middle East & Africa Americas Oceania Archives Topics About the HIR"}