{"id": 2163, "name": "Uncommon Ground Media", "domain": "uncommongroundmedia.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "high", "questionable": null, "url": "https://uncommongroundmedia.com/mubarak-balas-sentencing-tolerant-pluralism-and-the-imperative-of-islamic-reformation-in-northern-nigeria/", "title": "Mubarak Balas Sentencing Tolerant Pluralism And The Imperative Of Islamic Reformation In Northern Nigeria", "content": "Help keep Uncommon Ground Media running by donating below. All News Opinion Interviews Reviews Cartoons About Contact **Mubarak Bala’s Sentencing: Tolerant Pluralism and the Imperative of Islamic Reformation in Northern Nigeria** The conviction of Nigerian Humanist Mubarak Bala after a judicial process marked by irregularities jolted the civilized world. People of conscience had hoped that human rights would prevail; that after some dark nights of denial and disappearance, some light would shine at the end of the tunnel untwisting extremist imaginaries that had viciously beclouded and gripped the minds of Islamic theocrats in the region. Incidentally this hope was misplaced and terribly dashed. Mubarak Bala was handed down an outrageous sentence, short of a death penalty, that is unprecedented in the history of secular court trials in Nigeria. Following Bala`s sentencing, the darkness fiercely thickened culminating in the brutal murder of a christian woman, Deborah Samuel, also accused of blasphemy in Sokoto, in Northern Nigeria. Unlike Ms Samuel, Bala has been a marked man since he renounced Islam in 2014. He defied a tradition which says that a person born into the Islamic religion cannot renounce the faith. Bala left Islam and managed to escape from a mental hospital where he was sedated and medicated at the instance of his family against apostasy and unbelief. Bala has been on the watchlist of jihadists because his exercise of freedom of religion and from religion, his assertion of freedom of expression posed a mortal threat to their power base. He became a pariah in Kano, where he was born. Kano is a city that is notorious for religious bloodletting and for attacking and extrajudicially killing alleged blasphemers. Mubarak Bala, like Socrates of Athens, was accused of impiety and corruption of young Muslims because he was encouraging young Muslims to think and speak freely about Islam and its teachings. Bala became the rallying point for freethinking, rationalist, secularist, skeptical and atheist youths. But Islamists could not countenance this disruptive development, this sweeping wave of social awakening and enlightenment. They moved to stop, silence, resist and neutralize him and his cause. The Islamists hounded Bala out of Kano, where the parents lived. They could not allow him to physically meet with people of like mind. They monitored and censored his posts on social media, to ensure that his comments did not violate their faith sensibilities. But even for the most commonsensical posts, Bala was accused and abused. Bala was maligned. Bala was indicted for offending the religious sentiments of Muslims. He was threatened and harassed online and offline by Islamists including Muslim state police and army officers. On April 28 2020, the police arrested Mubarak Bala in Kaduna following a petition by some Islamist lawyers. They complained that he made posts on Facebook that insulted the prophet of Islam. In the petition, the lawyers enjoined the police to prosecute Bala to avoid a breakdown of law and order in the region. The petition was a covert warning to the police that if they did not arrest Bala, he would suffer the same fate as Deborah Samuel, and a Christian pastor, Shuaibu Yohana, who was murdered for blasphemy in September 2021. The police took Bala to Kano where the petition was lodged. They disappeared him for several months. During this period they denied him visits by family members and his lawyers. In April this year, a Muslim judge, in an attempt to placate Islamists convicted Bala. No muslim leader condemned the dubious trial and sentencing of Bala. The muslim community largely saw Bala’s conviction as a well deserved punishment, as justice served not denied. The sentencing of Mubarak Bala shames us all, Muslims and non-Muslims alike. It is an indictment on our collective conscience, and casts a huge shadow over the quest for African renaissance and enlightenment. African enlightenment makes no sense if Africans cannot freely question ideas or criticize religious claims without fear of being attacked, killed or imprisoned. The conviction of Bala underscores the urgency of Islamic reformation, and intellectual awakening of Muslim youths from their religious slumber. It confirms the widespread notion that Islam as practiced in Northern Nigeria is intolerant, and thrives on coercion and intimidation. The religion of Islam does not stand for peace – as many Muslims claim – because the imprisonment of Mubarak Bala for making posts that were critical of the prophet of Islam and other horrific treatment of alleged blasphemers constitute acts of war against Bala and other non-Muslims. In Northern Nigeria, Muslims have prosecuted violent campaigns against Christians and also against Muslims who belong to other traditions. They are ready to murder anyone who is believed to have insulted their prophet and religion. If by any stretch of religious imagination, peace applies to Islam as practiced in northern Nigeria, it is peace in the graveyard of the rights and liberties of Muslim minorities as well as non-Muslims. And this situation must change. Muslims should realize that it is in the interest of their religion and the Ummah to shun extremism and tolerate supposed blasphemous statements wherever they are in the majority because Muslims could easily be accused, attacked or indicted for blasphemy in places where they are in the minority. Muslims should know that a person’s religious sense is another’s religious nonsense; that Muhammad is only a prophet for Muslims, and a prophet of Islam. Muslims should not expect people who profess other religions and beliefs to respect and revere their prophet Muhammad. There are millions of Nigerians who do not recognise Muhammad as a prophet or as a messenger from God. In many places across Nigeria and the world, muslims are in the minority and Islam is a minority religion and a fringe faith. In such places, Muslims could be accused of blasphemy for reciting the Shahada, which is a fundamental article of faith in Islam. In non-Muslim societies, the Shahada is seen as insulting, provocative and disparaging of other gods and prophets. And if non-Muslims tolerate this article of faith that disparages their faiths and beliefs, why shouldn’t Muslims tolerate views and expressions of non-Muslims that are critical or supposedly disparaging of the Islamic faith or prophet. With the way Muslims react to supposed blasphemies, Christians could accuse Muslims of blasphemy for declaring that God (Allah) has no son, and that Jesus is not the son of God but the son of a wo/man. If Muslims want to be tolerated when they disparage Christianity, the Christian son of God and other deities, they should learn to tolerate those who hold views that supposedly insult Islam including those that defame the prophet, or desecrate the Quran. Muslims should learn to live in harmony with non-Muslims or non-believers who regard Muhammad as a non-prophet, a terrorist, a pedophile, rapist, war criminal or a con artist. After all, those who hold these views are infidels according to the teachings of Islam and these notions are consistent with their state of unbelief. The way that Islam is practiced in Northern Nigeria must change, as vividly demonstrated in the sentencing of Mubarak Bala and in other reactions to blasphemy allegations in the region. The mainstay of Islam is radicalism, intolerance and bigotry. Islamic religion is practiced in a way that young Muslims who value their religion more than human life have become the face of the religion in the region. And this is unfortunate. Islam in Northern Nigeria needs to be reformed and be transformed. Muslims need to embrace and mainstream tolerant pluralism and humanity. Otherwise there will be no peace in the country. Leo is a blogger, human-rights advocate and a Humanist from Nigeria. **Related Articles** Witch Hunting from Salem to San Jose: Dorothy Good and Arely Proctor Tauya Chinama on Pluralism and Tolerance in Zimbabwe Condemning Abubaker Deghayes but Supporting Mubarak Bala is not Hypocrisy **Article Discussion** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name Email Website **Latest Posts** Witch Hunting from Salem to San Jose: Dorothy Good and Arely Proctor Tauya Chinama on Pluralism and Tolerance in Zimbabwe Dr. Marty Shoemaker: The UK Link to Canadian Humanist Chaplaincy **Latest Comments** Suzanne IngletononMartine Rothblatt: A Founding Father of the Transgender EmpireIt began with Rene Descartes and was called the Age of Enlightenment-Another Patriarchal mirror of truth. It began with Rene Descartes and was called the Age of Enlightenment-Another Patriarchal mirror of truth. It began with Rene Descartes and was called the Age of Enlightenment-Another Patriarchal mirror of truth. Stella PerrettonThe Bravest Women in Britain – Speakers CornerYou can see Hatun regularly on YouTube. They film her ongoing confrontations with Muslim men at Speakers Corner (wearing her… You can see Hatun regularly on YouTube. They film her ongoing confrontations with Muslim men at Speakers Corner (wearing her… You can see Hatun regularly on YouTube. They film her ongoing confrontations with Muslim men at Speakers Corner (wearing her… Bill SandersononThe Bravest Women in Britain – Speakers CornerIt's good to be reminded of this courageous woman Stella, and would that the police had acted more alertly when… It's good to be reminded of this courageous woman Stella, and would that the police had acted more alertly when… It's good to be reminded of this courageous woman Stella, and would that the police had acted more alertly when… The homepage of Uncommon Ground Media. Access a variety of articles from our subsites here. All UK Europe Africa North America World News, commentary and original content brought to you by people who refuse to be cancelled. All News Opinion Interviews Reviews Cartoons Take a deep dive into the human condition with these thoughtfully written and carefully curated articles. All Economics History Philosophy Politics Science © Uncommon Ground Media 2025|Privacy Policy|Website byPerlemedia"}