{"id": 257, "name": "Cochrane", "domain": "cochrane.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://links.cochrane.org/website-terms-and-conditions", "title": "Website Terms And Conditions", "content": "Contact us Cochrane Engage Training Cochrane Library Cochrane.org My Account **CochraneCommunity** **Website Terms and Conditions** **Breadcrumb** Home Organizational info Resources Policies Website Terms and Conditions This website(“our site”)is operated byThe Cochrane Collaboration (\"We\", “Us”, “Cochrane”) a company limited by guarantee (company number 03044323) and registered charity (charity number 1045921) incorporated and registered in England and Wales with its registered office at 11-13 Cavendish Square, London, W1G 0AN, United Kingdom. Our site includes all websites which use the ‘cochrane.org’ domain name. The following terms and conditions (“Terms”) apply to the use of our site and to all materials and information associated with our site (“Materials”). Please note that other Cochrane services and Cochrane websites may be governed by additional terms and/or privacy information. To contact us about these Terms, please email support@cochrane.org or telephone our customer service line on +44 207 183 7503 **General Terms** 1.1. By using our site, you confirm that you accept these Terms and that you agree to comply with them. If you do not agree to these Terms, you must not use our site. 1.2. You are also responsible for ensuring that all persons who access our site through your internet connection are aware of these Terms and that they comply with them. 1.3. There are additional terms that shall apply to the use of our site: 1.3.1. Our Privacy Policy is availablehere, which sets out how we may use your personal information. 1.3.2. Our Cookie Policy is availablehere, which sets out information about the cookies on our site. 1.4. We amend these Terms from time to time. Every time you wish to use our site, please check these Terms to ensure you understand the terms that apply at that time. These Terms were most recently updated on 7th August 2024. Access to our site is permitted on a temporary basis and we reserve the right to suspend, withdraw, discontinue, restrict the availability of all or any part of our site for business and operational reasons or change all or any part of our site without notice. We will not be liable to you if for any reason our site is unavailable at any time or for any period. 3.1. We are the owner or the licensee of all intellectual property rights in our site, and in the Materials published on it. All such rights are reserved. 3.2. You acquire no proprietary interest in the Materials except as expressly permitted by these Terms, and you may not use the Materials in any way that infringes the intellectual property rights in them. 3.3. Our status (and that of any identified contributors) as the authors of content on our site must always be acknowledged (except where the content is user-generated). 3.4. You must not modify the paper or digital copies of any Materials you have printed off or downloaded in any way, and you must not use any illustrations, photographs, video or audio sequences or any graphics separately from any accompanying text. 3.5. You must not use any part of the content on our site for Commercial Purposes without obtaining a licence to do so from us or our licensors. 3.6. For the purposes of clause 3.5, “Commercial Purposes” includes: 3.6.1. Copying or downloading our site content or linking to our site for further redistribution, sale or licensing, for a fee; 3.6.2. Including any content from our site in other work that is then made available for sale or licensing, for a fee; 3.6.3. Copying, downloading or posting any content from our site or service that incorporates advertising with such content; 3.6.4. Using our site content for promotional or advertising purposes, whether direct or indirect where for a fee or otherwise; or 3.6.5. Using our site content for the purposes of monetary gain by means of sale, resale, license, loan, hire, transfer or any other form of commercial exploitation. 3.7. If you print off, copy, download, share or repost any part of our site in breach of these Terms, your right to use our site will cease immediately and you must, at our option, return or destroy any copies of the Materials you have made (except that you are permitted to print off a copy of these Terms). We may transfer our rights and obligations under these Terms to another organisation. We will always tell you in writing if this happens and we will ensure that the transfer will not affect your rights under these Terms. 5.1. For the purpose of this clause, “Artificial Intelligence (AI) systems or models” is defined as ‘systems or models that display intelligent behaviour by analysing their environment and taking actions, with some degree of autonomy, to achieve specific goals’. 5.2. You shall not conduct, facilitate, authorise or permit any text or data mining or web scraping in relation to our site or any services provided via, or in relation to, our site for any purpose, including the development, training, fine-tuning or validation of AI systems or models. This includes using (or permitting, authorising or attempting the use of): 5.2.1. any \"robot\", \"bot\", \"spider\", \"scraper\" or other automated device, program, tool, algorithm, code, process or methodology to access, obtain, copy, monitor or republish any portion of the site or any data, content, information or services accessed via the same; and/or 5.2.2. any automated analytical technique aimed at analysing text and data in digital form to generate information or develop, train, fine tune or validate AI systems or models which includes but is not limited to patterns, trends and correlations. 5.3. The provisions in this clause should be treated as an express reservation of our rights in this regard, including for the purposes of Article 4(3) of Digital Copyright Directive ((EU) 2019/790). 5.4. You shall not use, and we do not consent to the use of, our site, or any data published by, or contained in, or accessible via, our site or any services provided via, or in relation to, our site for the purposes of developing, training, fine-tuning or validating any AI system or model. 5.5. This clause shall not apply insofar as (but only to the extent that) we are unable to exclude or limit text or data mining or web scraping activity by contract under the laws which are applicable to us. 5.6. You must not misuse our site by knowingly introducing viruses, trojans, worms, logic bombs or other material that is malicious or technologically harmful, or otherwise harmfully interacting with our site or any part of it. 5.7. You must not attempt to gain unauthorised access to our site, the server on which our site is stored or any server, computer or database connected to our site or any other equipment or network connected with our site. 5.8. You must not interfere with, damage or disrupt any software used in the provision of our site or any equipment or network or software owned or used by any third party on which this site relies in any way. 5.9. You must not attack our site via a denial-of-service attack or a distributed denial-of-service attack. By breaching clauses 5.6 to 5.9, you would commit a criminal offence under the Computer Misuse Act 1990. We will report any such breach to the relevant law enforcement authorities, and we will co-operate with those authorities by disclosing your identity to them. In the event of such a breach, your right to use our site will cease immediately. 6.1. You may link to our site, provided you do so in a way that is fair and legal and does not damage our reputation or take advantage of it. 6.2. You must not establish a link in such a way as to suggest any form of association, approval or endorsement on our part where none exists. 6.3. We reserve the right in our absolute discretion to prohibit any link from another site to our site without notice. 6.4. If you wish to link to or make any use of our site other than that set out above, please contact support@cochrane.org. 6.5. Where our site contains links to other sites and resources provided by third parties, these links are provided for your information only. Such links should not be interpreted as approval by us of those linked websites or information you may obtain from them. We will not be liable for any loss or damage that may arise from your use of them. 7.1. Our site is provided on an “as is” and “as available” basis and to the fullest extent permissible by law we do not guarantee that our website will meet particular requirements, or be available, accessible, uninterrupted, timely, secure, or operate without error, or that it will be free from viruses, trojans, worms, logic bombs or other material that is malicious or technologically harmful. 7.2. You are responsible for configuring your information technology, computer programs and platform to access our site. You should use your own virus protection software. 7.3. Whether you are a consumer or a business user: 7.3.1. We do not exclude or limit in any way our liability to you where it would be unlawful to do so. This includes liability for death or personal injury caused by our negligence or the negligence of our employees, agents or subcontractors and for fraud or fraudulent misrepresentation. 7.3.2. Different limitations and exclusions of liability will apply to liability arising as a result of the supply of any products to you, which will be set out in the relevant terms for those products. 7.4. If you are a business user: 7.4.1. We exclude all implied conditions, warranties, representations or other terms that may apply to our site or any content on it. 7.4.2. We will not be liable to you for any loss or damage, whether in contract, tort (including negligence), breach of statutory duty, or otherwise, even if foreseeable, arising under or in connection with: 7.4.2.1. use of, or inability to use, our site; or 7.4.2.2. use of or reliance on any content displayed on our site. 7.4.3. In particular, we will not be liable for: 7.4.3.1. loss of profits, sales, business, or revenue; 7.4.3.2. business interruption; 7.4.3.3. loss of anticipated savings; 7.4.3.4. loss of business opportunity, goodwill or reputation; or 7.4.3.5. any indirect or consequential loss or damage. 7.5. If you are a consumer user: 7.5.1. We only provide our site for domestic and private use. You agree not to use our site for any commercial or business purposes, and we have no liability to you for any loss of profit, loss of business, business interruption, or loss of business opportunity. 7.5.2. If defective digital content that we have supplied damages a device or digital content belonging to you and this is caused by our failure to use reasonable care and skill, we will either repair the damage or pay you compensation. [However, we will not be liable for damage that you could have avoided by following our advice to apply an update offered to you free of charge or for damage that was caused by you failing to correctly follow installation instructions or to have in place the minimum system requirements advised by us. 8.1. These Terms and any dispute or claim arising out of or in connection with them or their subject matter or formation (including non-contractual disputes or claims) shall be governed by and construed in accordance with the law of England and Wales. 8.2. The courts of England and Wales shall have exclusive jurisdiction to settle any dispute or claim arising out of or in connection with these Terms or their subject matter or formation (including non-contractual disputes or claims). However, if you are a consumer user, you will benefit from any mandatory provisions of the law of the country in which you are resident. The Cochrane mark and the forest plot mark are registered trademarks of Cochrane. People Plans ResourcesResources for GroupsSupport from CETAdvocacyPoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and ConditionsResearch Integrity Resources for Groups Support from CET Advocacy PoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions Research Integrity Resources for Groups Support from CET Advocacy PoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions Research Integrity Review development Organizational infoPeoplePlansResourcesResources for GroupsSupport from CETAdvocacyPoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and ConditionsResearch Integrity People Plans ResourcesResources for GroupsSupport from CETAdvocacyPoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and ConditionsResearch Integrity Resources for Groups Support from CET Advocacy PoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions Research Integrity People Plans ResourcesResources for GroupsSupport from CETAdvocacyPoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and ConditionsResearch Integrity Resources for Groups Support from CET Advocacy PoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions Research Integrity Resources for Groups Support from CET Advocacy PoliciesCDSR: editorial policiesOur policies and positionsConflict of Interest PolicyOrganizational position statementsFor all Members and SupportersFor Cochrane GroupsCharity Governance CodeWebsite Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions CDSR: editorial policies Our policies and positions Conflict of Interest Policy Organizational position statements For all Members and Supporters For Cochrane Groups Charity Governance Code Website Terms and Conditions Research Integrity Help News and events About CochraneCochrane.orgWho we areGet involvedPatient and Public NetworkPartnersColloquiumIn the news Cochrane.org Who we are Get involved Patient and Public Network Partners Colloquium In the news Cochrane.org Who we are Get involved Patient and Public Network Partners Colloquium In the news PublicationsCochrane LibraryCochrane Reviews (CDSR)Trials (CENTRAL)Cochrane Clinical AnswersCochrane Evidence Synthesis and Methods Cochrane LibraryCochrane Reviews (CDSR)Trials (CENTRAL)Cochrane Clinical Answers Cochrane Reviews (CDSR) Trials (CENTRAL) Cochrane Clinical Answers Cochrane Evidence Synthesis and Methods Cochrane LibraryCochrane Reviews (CDSR)Trials (CENTRAL)Cochrane Clinical Answers Cochrane Reviews (CDSR) Trials (CENTRAL) Cochrane Clinical Answers Cochrane Reviews (CDSR) Trials (CENTRAL) Cochrane Clinical Answers Cochrane Evidence Synthesis and Methods CommunityCommunityCochrane AccountTrainingSupportMethodsSoftwareJobs and opportunities Community Cochrane Account Training Support Methods Software Jobs and opportunities Community Cochrane Account Training Support Methods Software Jobs and opportunities Contact usGeneral enquiriesCochrane Library supportCochrane GroupsMedia General enquiries Cochrane Library support Cochrane Groups Media General enquiries Cochrane Library support Cochrane Groups Media"}