{"id": 1094, "name": "Pew Research", "domain": "pewresearch.org", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.pewresearch.org/short-reads/2025/05/06/americans-see-a-role-for-the-federal-government-in-many-domains-but-some-large-partisan-divisions-persist/", "title": "Americans See A Role For The Federal Government In Many Domains But Some Large Partisan Divisions Persist", "content": "Numbers, Facts and Trends Shaping Your World Newsletters Press My Account Donate Contacted By Us? Read our research on: LGBTQ Attitudes & Experiences Immigration Economic Conditions Research TopicsTopicsPolitics & PolicyInternational AffairsImmigration & MigrationRace & EthnicityReligionAge & GenerationsGender & LGBTQFamily & RelationshipsEconomy & WorkScienceInternet & TechnologyNews Habits & MediaMethodological ResearchFull Topic ListRegions & CountriesAsia & the PacificEurope & RussiaLatin AmericaMiddle East & North AfricaNorth AmericaSub-Saharan AfricaMultiple Regions / WorldwideFormatsFeatureFact SheetVideoData Essay Full Topic List Full Topic List Publications Our Methods Short Reads Tools & Datasets Experts About Us Research TopicsPublicationsShort ReadsTools & DatasetsAbout Pew Research CenterNewslettersPressMy AccountContacted By Us? Research Topics Publications Short Reads Tools & Datasets About Pew Research Center Newsletters Press My Account Contacted By Us? Research Topics Publications Short Reads Tools & Datasets About Pew Research Center Newsletters Press My Account Contacted By Us? SearchRead Our Research On:LGBTQ Attitudes & ExperiencesImmigrationEconomic Conditions Read Our Research On: LGBTQ Attitudes & Experiences Immigration Economic Conditions Read Our Research On: LGBTQ Attitudes & Experiences Immigration Economic Conditions Short Reads | X Facebook Threads LinkedIn WhatsApp **Americans see a role for the federal government in many domains, but some large partisan divisions persist** Majorities of Americans say the federal government has a responsibility to provide a wide array of support and services for the country – but there is more consensus about some domains than others. Nearly all Americans say the federal government has a responsibility to provide a strong military and secure the nation’s borders. These are seen as government responsibilities by overwhelming majorities in both parties: 97% of Republicans and Republican-leaning independents say each is the federal government’s responsibility, as do about nine-in-ten Democrats and Democratic leaners. Large majorities in both partisan coalitions also say the government has a responsibility to provide clean air and water, reliable energy sources, and national parks and wilderness areas.About nine-in-ten or more Democrats say the government has a responsibility to provide each of these, compared with roughly eight-in-ten Republicans in each case. Pew Research Center conducted this study to understand how Americans view the scope of the federal government’s responsibilities. For more than three decades, the Center has regularly conducted surveys exploring Americans’ attitudes about government. For this analysis, we surveyed 3,589 adults from April 7 to April 13, 2025. Everyone who took part in this survey is a member of the Center’s American Trends Panel (ATP), a group of people recruited through national, random sampling of residential addresses who have agreed to take surveys regularly. This kind of recruitment gives nearly all U.S. adults a chance of selection. Interviews were conducted either online or by telephone with a live interviewer. The survey is weighted to be representative of the U.S. adult population by gender, race, ethnicity, partisan affiliation, education and other factors.Read more about the ATP’s methodology. Here are thequestions used for this analysis, thetoplineand the surveymethodology. Related:5 facts about Americans’ views of government Republicans and Democrats continue to be far apart when it comes to whether the federal government has a responsibility to provide health insurance for all Americans. Nine-in-ten Democrats say it does, while half as many Republicans (45%) say this. Democrats are also 30 percentage points more likely than Republicans to say the government is responsible for providing an adequate standard of living to all Americans: 82% of Democrats and 52% of Republicans say this. And Democrats are 31 points more likely than Republicans to say the government has a responsibility to provide all Americans with adequate income in retirement (81% vs. 50%). Nine-in-ten Democrats say the federal government has a responsibility to provide high-quality K-12 education for all Americans, compared with a narrower 57% majority of Republicans. There also are sharp differences in views of the government’s role in higher education. Nearly six-in-ten Democrats (58%) say the federal government has a responsibility to provide a college education to all. A far smaller share of Republicans (22%) say this. Six-in-ten Democrats say the government has a responsibility to provide access to high-speed internet for all Americans. Republicans (31%) are about half as likely to say this. Views on several of these items have shifted over the past four years, with the most pronounced changes coming among Republicans. Overall, the share of Americans who say the government is responsible for providing an adequate standard of living for all Americans is 11 percentage points higher than in April 2021 (67% now, 56% then). Both Republicans and Democrats have become more likely to say this. Around half of Republicans (52%) hold this view today, up 20 points from 2021, while 82% of Democrats say the same, up 6 points. Republicans and Democrats are also both 10 points more likely than in 2021 to say the government is responsible for providing adequate income in retirement. When it comes to providing health insurance, nearly seven-in-ten Americans (68%) see this as a government responsibility, up modestly from 64% in 2021. Republicans are 12 points more likely to say this than they were previously. Republicans are also 7 points more likely to say access to high-speed internet is a government responsibility. Overall, Americans are about as likely to say this as they were in 2021. By contrast, Americans have become 5 pointslesslikely to say high-quality K-12 education is a responsibility of the federal government. A smaller majority of Republicans now say this compared with four years ago (57% today vs. 64% then). Americans who see a more limited role for the federal government are particularly likely to support the Trump administration’s recent cuts to departments and agencies. Those who see more responsibilities for government largely disapprove of these cuts, according to the same survey. We asked the same set of respondents about seven of the 11 items included in the survey. 78% of those who say the government has responsibility inthree or fewer of the seven itemsasked about support the administration’s cuts to federal departments and agencies. By comparison, just 17% of those who say the federal government has a responsibility inall seven areasapprove of the administration’s reductions to federal departments and agencies, while 83% disapprove. This relationship partially reflects partisanship: Republicans are farless likelythan Democrats to say the federal government has a responsibility in several of the domains included in the survey and farmore likelytoapprove of the Trump administration’s cuts. However, the pattern holds even after taking partisanship into account. For example, Republicans who say the government has a responsibility in three or fewer of seven areas are 46 percentage points more likely to approve of the administration’s cuts than Republicans who say the government has a responsibility in the maximum of seven areas (91% vs. 45%). Similarly, disapproval is more widespread among Democrats who see more responsibilities for the government. We asked the same set of respondents about seven of the 11 items included in the survey (Form 1 half sample). We then counted the number of items, out of seven, that each respondent said were responsibilities of the federal government. This table shows the share of Americans, as well as of Republicans and Democrats, who identified zero through seven items as government responsibilities. The share of Americans who say they prefer a bigger government that provides more services has modestly ticked up since the Center last asked this question a year ago. Roughly half of adults (51%) now say they prefer a bigger government with more services, while 47% prefer a smaller government and fewer services. In April 2024, 48% said they preferred a bigger government, while 49% said they preferred a smaller government. The public has been closely divided on this question for several years now, going back to the beginning of Donald Trump’s first term as president. Current partisan differences are about as wide as they have ever been: 75% of Republicans prefer a smaller government, while 24% prefer a bigger government. 79% of Democrats prefer a bigger government, and 20% prefer a smaller government. Note: Here are thequestions used for this analysis, thetoplineand the surveymethodology. Topics Federal Government Government Spending & the Deficit Government Spending & the Deficit Partisanship & Issues Political Issues X Facebook Threads LinkedIn WhatsApp Andrew Danilleris a research associate focusing on politics at Pew Research Center. **Related** **5 facts about Americans’ views of government** **Confidence in federal civil servants remains far lower among Republicans than Democrats** **What the data says about federal workers** **Four-in-ten U.S. drug arrests in 2018 were for marijuana offenses – mostly possession** **Most Border Wall Opponents, Supporters Say Shutdown Concessions Are Unacceptable** **TOPICS** Federal Government Government Spending & the Deficit Government Spending & the Deficit Partisanship & Issues Political Issues **Most Popular** 901 E St. NW, Suite 300Washington, DC 20004USA(+1) 202-419-4300 | Main(+1) 202-857-8562 | Fax(+1) 202-419-4372 |Media Inquiries **Research Topics** **Follow Us** Email Newsletters Instagram Facebook X YouTube RSS Feed LinkedIn Bluesky ABOUT PEW RESEARCH CENTERPew Research Center is a nonpartisan, nonadvocacy fact tank that informs the public about the issues, attitudes and trends shaping the world. It does not take policy positions. The Center conducts public opinion polling, demographic research, computational social science research and other data-driven research. Pew Research Center is a subsidiary ofThe Pew Charitable Trusts, its primary funder. © 2025 Pew Research Center About Terms & Conditions Privacy Policy Cookie Settings Feedback Careers Contact Us"}