{"id": 1876, "name": "American Oversight", "domain": "americanoversight.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://americanoversight.org/american-oversight-files-suit-launches-broad-investigation-into-trump-administrations-militarized-response-to-immigration-protests/", "title": "American Oversight Files Suit Launches Broad Investigation Into Trump Administrations Militarized Response To Immigration Protests", "content": "American Oversight Contribute Our WorkOur LatestFeatured DocumentsInvestigations & TopicsLitigationResourcesRequests & Records ArchiveAO in the News Our Latest Featured Documents Investigations & Topics Litigation Resources Requests & Records Archive AO in the News Our Latest Featured Documents Investigations & Topics Litigation Resources Requests & Records Archive AO in the News American OversightAbout UsPartnerships & CoalitionsCareersContactContributeNewsletter About Us Partnerships & Coalitions Careers Contact Contribute Newsletter About Us Partnerships & Coalitions Careers Contact Contribute Newsletter **American Oversight Files Suit, Launches Broad Investigation into Trump Administration’s Militarized Response to Immigration Protests** The organization anticipated Trump's use of federal troops to silence dissent, having requested records months in advance of the protests in Los Angeles. Today, amid President Trump’s use of militarized forces to silence dissent — this time over his immigration policies in Los Angeles — nonprofit watchdog American Oversightfiled suitagainst the administration for failing to release records regarding the military’s involvement in immigration enforcement. In anticipation of the administration’s eventual use of the military in service of its mass deportation goals and to quash opposition to Trump’s political agenda, the group filed Freedom of Information Act (FOIA) requests for these documents in April. In addition to the lawsuit, American Oversight also launched a sweeping investigation into the administration’s deployment of the National Guard and U.S. Marine Corps in Los Angeles. The militarized response, which came over the explicit objections of California officials, has raised serious legal and constitutional concerns — including potential violations of the Posse Comitatus Act. “Deploying the military to quash protests over the administration’s inhumane and legally dubious immigration policies — especially over the objection of elected state leaders — is a dangerous, though unfortunately predictable, escalation by the Trump administration. The military should never be used as a political weapon, full stop,”said American Oversight Executive Director Chioma Chukwu. “If left unchecked, this abuse of power under thin legal pretense can be readily replicated across other states in the future. We won’t stop until the administration provides a full legal justification for its actions. Americans have a right to know who authorized it, what rationale was offered, and not just whether the government crossed a line — but by how much that line has been obliterated.” Thelawsuit filedtoday in the U.S. District Court for the District of Columbia targets the U.S. Department of Homeland Security and U.S. Immigration and Customs Enforcement (ICE) for failing to release communications, legal directives, and agreements tied to military involvement in immigration enforcement as required under FOIA. In launching its investigation, American Oversight filed nearly three dozen expedited FOIA and California Public Records Act requests with federal, state, and local agencies, including the U.S. Departments of Justice, Defense, and Homeland Security; ICE; the U.S. Northern Command; the National Guard Bureau; the California Military Department; and the U.S. Marine Corps. The investigation seeks communications regarding the deployment and related protests, formal directives and policies regarding the use of military force for protest response, and any meeting records and internal dissent communications. The effort focuses on determining whether the federal government acted lawfully and transparently — or inappropriately escalated federal force to chill dissent against Trump’s immigration policies. **Litigation** **American Oversight v. DHS and ICE — Militarized Immigration Enforcement** **American Oversight v. DHS and ICE — Militarized Immigration Enforcement** X Facebook Email © 2024 Copyright American Oversight.Privacy Policy"}