{"id": 1074, "name": "Outlook India", "domain": "outlookindia.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.outlookindia.com/announcements/news-media-wire/21-masterpieces-by-mf-husain-to-be-auctioned-under-the-auspices-of-the-honourable-mumbai-court-a-landmark-event-for-the-global-art-market", "title": "21 Masterpieces By Mf Husain To Be Auctioned Under The Auspices Of The Honourable Mumbai Court A Landmark Event For The Global Art Market", "content": "facebook Instagram Twitter Youtube BUSINESS MONEY TRAVELLER LUXE HINDI EATS Get magazine delivered to your doorstep Get latest issue delivered instantly Only in Delhi-NCR, Mumbai, Bengaluru & Pune Get magazine delivered to your doorstep Get latest issue delivered instantly Only in Delhi-NCR, Mumbai, Bengaluru & Pune National International Magazine Weekender BusinessMarketsNewsCorporateEconomy & PolicyPodcastMagazineStartupPlanet Markets News Corporate Economy & Policy Podcast Magazine Startup Planet Markets News Corporate Economy & Policy Podcast Magazine Startup Planet Money SportsIPL 2025CricketFootballFormula 1MotoGPTennisBadmintonHockeyMMA IPL 2025 Cricket Football Formula 1 MotoGP Tennis Badminton Hockey MMA IPL 2025 Cricket Football Formula 1 MotoGP Tennis Badminton Hockey MMA WTC Final Entertainment Travel OthersLuxeCulture & SocietyBooksWeb StoriesBrand StudioAstrologyN.E.W.S.NexaPostHub4BusinessTourism SpotlightHealthcare SpotlightEntertainment SpotlightOLB Spotlight Initiatives Luxe Culture & Society Books Web Stories Brand Studio Astrology N.E.W.S. NexaPost Hub4Business Tourism Spotlight Healthcare Spotlight Entertainment Spotlight OLB Spotlight Initiatives Luxe Culture & Society Books Web Stories Brand Studio Astrology N.E.W.S. NexaPost Hub4Business Tourism Spotlight Healthcare Spotlight Entertainment Spotlight OLB Spotlight Initiatives Outlook Hindi Outlook Hindi Outlook Hindi National International Magazine Weekender BusinessMarketsNewsCorporateEconomy & PolicyPodcastMagazineStartupPlanet Markets News Corporate Economy & Policy Podcast Magazine Startup Planet Markets News Corporate Economy & Policy Podcast Magazine Startup Planet Money SportsIPL 2025CricketBadmintonFootballTennisHockeyMotorsportMMA IPL 2025 Cricket Badminton Football Tennis Hockey Motorsport MMA IPL 2025 Cricket Badminton Football Tennis Hockey Motorsport MMA Entertainment Travel OthersEducationAstrologyWeb StoriesXHUBHub4BusinessTourism SpotlightHealthcare SpotlightEntertainment SpotlightOLB Spotlight Initiatives Education Astrology Web Stories XHUB Hub4Business Tourism Spotlight Healthcare Spotlight Entertainment Spotlight OLB Spotlight Initiatives Education Astrology Web Stories XHUB Hub4Business Tourism Spotlight Healthcare Spotlight Entertainment Spotlight OLB Spotlight Initiatives About Us Contact Us Copyright & Disclaimer News Media Wire **21 Masterpieces By M.F. Husain To Be Auctioned Under The Auspices Of The Honourable Mumbai Court: A Landmark Event For The Global Art Market** **A landmark auction of 21 rare M.F. Husain paintings, supervised by the Mumbai High Court, will be held on June 12, 2025, at Pundole’s Art Gallery. This court-directed sale ties to NAFED’s Rs 235 crore recovery case involving the Swarup Group. Explore this extraordinary opportunity to acquire masterpieces by the 'Picasso of India'.** In a significant development poised to captivate the international art community, a collection of 21 seminal paintings by the iconic artist M.F. Husain is slated for public auction under the direct supervision of the Honourable Mumbai High Court. This highly anticipated sale is meticulously structured around comprehensive valuation reports dated April 28, 2017, and May 2, 2024, meticulously prepared and submitted by Mr. Dadiba Pundole of the esteemed Pundole's Art Gallery and Auction House, acting under explicit court directives. This judicial oversight stems from a long-standing and complex financial matter. Over a decade ago, between April and August 2004, the National Agricultural Cooperative Marketing Federation of India (NAFED) had extended a substantial sum of Rs 235 crore to the Swarup Group for the export of iron ore. Crucially, this significant financial transaction was undertaken without the customary provision of collateral, a detail that has been a subject of ongoing scrutiny and has now intersected with the disposition of these invaluable artworks. M.F. Husain, universally revered as the \"Picasso of India,\" left an indelible and profound impact on the global art landscape through his distinctive style, characterized by vibrant palettes and deeply evocative narratives. The impending auction of these rare and significant works is expected to generate intense interest from a diverse array of collectors, institutions, and art enthusiasts worldwide, a testament to Husain's unparalleled stature and the enduring scarcity of his original creations. The meticulous valuation reports, diligently compiled by Mr. Pundole, provide a detailed and authoritative assessment of each painting's intrinsic and market worth. This exhaustive process underscores the Mumbai Court's unwavering commitment to upholding principles of transparency, fairness, and due diligence in the liquidation of these highly valuable assets. The comprehensive nature of these valuations aims to ensure that the auction accurately reflects the true market value of these artistic treasures. This upcoming auction is widely anticipated to be a landmark event, not only for its substantial financial implications but equally for its profound cultural resonance. It presents a truly unique and extraordinary opportunity for discerning art connoisseurs to acquire authenticated pieces from one of India's most celebrated and globally recognized artists. Furthermore, this event prominently highlights the pivotal role of the judicial system in overseeing and facilitating high-profile transactions involving assets of significant cultural and financial value. Art collectors, gallerists, and enthusiasts are keenly awaiting the auction date of 12th June 2025, which promises to mark a historic occasion in the Indian and global art markets. The successful sale of these 21 masterpieces will undoubtedly contribute to the continued appreciation and reinforcement of M.F. Husain's towering legacy, while simultaneously reaffirming the enduring value and global appeal of his artistic oeuvre. Auction will be held at Pundoles Art Gallery, Hamilton House, Fort, Mumbai. Interested parties are encouraged to visit pundoles website for official announcements for this momentous sale. NAFED in recent times has pepped up its efforts to recover its legitimate dues through due process of law and bring defaulters to justice. This would also send a signal to other defaulters to come forward to settle their outstanding dues with NAFED quickly. For more details:https://auctions.pundoles.com/ Painting Mumbai Art Mumbai High Court M.F. Hussain Previous Story3S Travel Network Flags Off Its Largest Group Tour Yet: 146 IEM Students Embark On A Memorable Journey To Sydney Next StoryThe Moral Irony Of Urban Consumer Behaviour **Advertisement** 3S Travel Network Flags Off Its Largest Group Tour Yet: 146 IEM Students Embark On A Memorable Journey To Sydney The Moral Irony Of Urban Consumer Behaviour Cherry Blossoms In Crisis ClimateNXT 2025: India’s Premier World Environment Day Summit To Tackle Plastic Pollution And Accelerate Climate Innovation **Advertisement** Watch | Unbroken and Unfazed: The Success Stories of Blind Cricketers Watch | Unbroken and Unfazed: The Success Stories of Blind Cricketers Watch | Unbroken and Unfazed: The Success Stories of Blind Cricketers WATCH | Life in Punjab's border villages under drones and conflict's shadow WATCH | Life in Punjab's border villages under drones and conflict's shadow WATCH | Life in Punjab's border villages under drones and conflict's shadow WATCH | Salt Wounds Of India-Pak Border: Gujarat Since Partition WATCH | Salt Wounds Of India-Pak Border: Gujarat Since Partition WATCH | Salt Wounds Of India-Pak Border: Gujarat Since Partition Watch | Kutch's Fishermen Struggle Amidst Border Uncertainty Watch | Kutch's Fishermen Struggle Amidst Border Uncertainty Watch | Kutch's Fishermen Struggle Amidst Border Uncertainty **Advertisement** **Advertisement** South Africa Vs Australia, ICC WTC Final 2025: Kagiso Rabada, Oz Seamers Dominate On Day 1 South Africa Vs Australia, ICC WTC Final 2025: Kagiso Rabada, Oz Seamers Dominate On Day 1 South Africa Vs Australia, ICC WTC Final 2025: Kagiso Rabada, Oz Seamers Dominate On Day 1 In Photos: LA Burns As Protests Against Trump's Immigration Crackdown Intensifies In Photos: LA Burns As Protests Against Trump's Immigration Crackdown Intensifies In Photos: LA Burns As Protests Against Trump's Immigration Crackdown Intensifies Day In Pics: June 11, 2025 Day In Pics: June 11, 2025 Day In Pics: June 11, 2025 Brazil 1-0 Paraguay, FIFA World Cup 2026 CONMEBOL Qualifiers: Vinicius Goal Secures WC Berth For Selecao Brazil 1-0 Paraguay, FIFA World Cup 2026 CONMEBOL Qualifiers: Vinicius Goal Secures WC Berth For Selecao Brazil 1-0 Paraguay, FIFA World Cup 2026 CONMEBOL Qualifiers: Vinicius Goal Secures WC Berth For Selecao **Advertisement** Virat Kohli Test Retirement: Ravi Shastri Would've Made Him Captain 'Straightaway After Australia' Bengaluru Stampede: BCCI Apex Council To Discuss Guidelines For IPL Victory Celebrations - Report ICC T20I Men's Rankings: Tilak Varma Rises To Third; Adil Rashid Moves To Second Amongst Bowlers India's Tour Of England Tests 2025: Morne Morkel Wants Nitish Kumar Reddy To Bowl More Overs WTC Final, AUS Vs SA: Australia Top Day 1 As Seamers Run The Show At Lord's - Data Debrief Cristiano Ronaldo Scores 138th International Goal As Portugal Fight Back Against Spain In Nations League Final FIFA 2026 World Cup Qualifiers: Italy Sack Luciano Spalletti Ahead Of Moldova Match Belgium Vs Wales, FIFA World Cup 2026 European Qualifiers: WAL Boss Bellamy Unfazed By BEL's Stature Kylian Mbappe Has No Issue With France Critics After 50th International Goal Club World Cup Has Faced Pushback In Europe But FIFA Is Banking On Its Big Bet Queen's Club: Emma Raducanu, Katie Boulter Knocked Out Of Women's Doubles Stuttgart Open 2025 Wrap: Rohan Bopanna Only Indian In Fray; Yuki Bhambri, Sriram Balaji Exit Queen's Club Championship: Emma Raducanu Overcomes Nerves To Reach Second Round Can Carlos Alcaraz And Jannik Sinner Beat Peak Nadal At Roland-Garros? John McEnroe Believes They Can Sumit Nagal Vs Geoffrey Blancaneaux, ATP Challenger Lyon: Indian Suffers Another First-Round Loss Indonesia Open 2025: Satwik-Chirag Cruise Into Quarters, Sindhu Bows Out PV Sindhu Vs P Chochuwong Live Streaming, Indonesia Open 2025: When, Where To Watch Round Of 16 Match Indonesia Open Round 1: Sindhu, Satwik-Chirag Win; Sen, Prannoy Bow Out Satwik-Chirag On Semifinal Finish At Singapore Open: 'Best Is Yet To Come' Singapore Open: Satwik-Chirag Falter At Semifinal With Close Defeat To Chia-Soh Gross Domestic Problems In India Space X Says Axiom-4 Mission Delayed Due To Liquid Oxygen Leak; ISRO Chairman Hails Decision Pahalgam: The Cinematic Silence Of Moral Ambiguities Two Journalists Arrested Over Allegations Of Extortion And Blackmailing Fresh Demand For Compensation For Indus Water Treaty Losses In Jammu And Kashmir Watch | Can Met Gala Truly Celebrate Black Style Without Reckoning With Fashion's Past? Met Gala Through The Years: A Visual History Of Fashion’s Biggest Night Met Gala 2025: From Priyanka Chopra To Isha Ambani - A Look Back At Indian Celebrities' Most Iconic Red Carpet Moments 10 Iconic Met Gala Looks Through The Years Met Gala 2025: When And Where To Watch Fashion's Biggest Night In India; Indian Celebrities Gracing Red Carpet And Their Looks US-China Deals: America To Get Rare Minerals, Magnets; Admissions At US Colleges, Universities For China | Details Elon Musk Says, 'Went Too Far' With Posts About President Donald Trump Trump Says ‘Protestors At Army Parade Will Be Met With Very Big Force’ US Embassy Says 'No Right To Visit US' Amid Indian Student Handcuffing Row LA Protests: 700 Active-Duty Marines, Additional 2,000 National Guards Deployed; California To Sue Trump | Top Points Space X Says Axiom-4 Mission Delayed Due To Liquid Oxygen Leak; ISRO Chairman Hails Decision 10 Best Beer Brands In The World Russian Drone Attacks Hit Kyiv, Kharkiv Leaving Families Grieving U.S. And China Agree Upon A Trade Framework Elon Musk Says, 'Went Too Far' With Posts About President Donald Trump Trump Says ‘Protestors At Army Parade Will Be Met With Very Big Force’ Gross Domestic Problems In India Elite Bench, Marginalised Talent: Casteism In Indian Cricket Scripting The Pitch: Bollywood's Fervent Affair With Cricket Enrique Iglesias Mumbai Concert Details: When And Where To Book Tickets Sports News, June 11 Highlights: South Africa Meet Australia In WTC Final; India Face Argentina In FIH Pro League Daily Horoscope for June 10, 2025: Big Changes Ahead for Aries, Virgo, and Scorpio LA Protests: 700 Active-Duty Marines, Additional 2,000 National Guards Deployed; California To Sue Trump | Top Points **Group Publications** About Us Contact Us Copyright & Disclaimer Compliance Copyright © 2025 Outlook Publishing India Pvt Ltd. Copyright © 2025 Outlook Publishing India Pvt Ltd. All pages of the Website are subject to our terms and conditions and privacy policy. You must not reproduce, duplicate, copy, sell, resell or exploit any material on the Website for any commercial purposes."}