{"id": 1122, "name": "Glenwood Springs Post Independent", "domain": "postindependent.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.postindependent.com/news/noticias-en-espanol/una-mujer-de-phoenix-y-otras-dos-personas-arrestadas-en-una-incautacion-de-fentanilo-que-decomiso-2-6-millones-en-la-interestatal-70-cerca-de-parachute/", "title": "Una Mujer De Phoenix Y Otras Dos Personas Arrestadas En Una Incautacion De Fentanilo Que Decomiso 2 6 Millones En La Interestatal 70 Cerca De Parachute", "content": "NewsLocalNoticias en EspañolCommunityCrimeRoads & WeatherBusinessElectionEducationHealthMarijuanaThe Longevity Project 2023OpinionColumnsLetter To The EditorSubmit Letter to the EditorSportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Local Noticias en Español Community Crime Roads & Weather Business Election Education Health Marijuana The Longevity Project 2023 OpinionColumnsLetter To The EditorSubmit Letter to the EditorSportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Columns Letter To The Editor Submit Letter to the Editor SportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Outdoors Preps EntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Current Contests Calendar Magazines Photos AnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Local Noticias en Español Community Crime Roads & Weather Business Election Education Health Marijuana The Longevity Project 2023 OpinionColumnsLetter To The EditorSubmit Letter to the EditorSportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Columns Letter To The Editor Submit Letter to the Editor SportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Outdoors Preps EntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Current Contests Calendar Magazines Photos AnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Columns Letter To The Editor Submit Letter to the Editor SportsOutdoorsPrepsEntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Outdoors Preps EntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Current Contests Calendar Magazines Photos AnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Outdoors Preps EntertainmentCurrent ContestsCalendarMagazinesPhotosAnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Current Contests Calendar Magazines Photos AnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Current Contests Calendar Magazines Photos AnnouncementsObituariesCelebrationsRifleClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Obituaries Celebrations Rifle ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace an adLegalsPlace Legal AdsSearch Legal AdsMagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad LegalsPlace Legal AdsSearch Legal Ads Place Legal Ads Search Legal Ads Place Legal Ads Search Legal Ads MagazinesColorado HunterCyclingDestinationGlenwood SpringsLocals’ ChoiceMenuMidValley HolidaysRoaring Fork Valley HeartbeatStreet and Trail MapWolvesNewsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map Wolves Newsletters **News** Local Noticias en Español Community Crime Roads & Weather Business Election Education Health Marijuana The Longevity Project 2023 **Opinion** Columns Letter To The Editor Submit Letter to the Editor **Sports** Outdoors Preps **Entertainment** Current Contests Calendar Magazines **Photos** **Announcements** Obituaries Celebrations **Rifle** **Classifieds** Jobs Rentals Real Estate Autos Service Directory All Classifieds Place an ad Legals **Magazines** Colorado Hunter Cycling Destination Glenwood Springs Locals’ Choice Menu MidValley Holidays Roaring Fork Valley Heartbeat Street and Trail Map **Wolves** **Newsletters** Donate Sign In Register Profile Newsletters Interests Bookmarks Reading History Logout E-Edition| Submissions| Contact Us| Advertise| **Una mujer de Phoenix y otras dos personas arrestadas en una incautación de fentanilo que decomisó $2.6 millones en la Interestatal 70 cerca de Parachute** Noticias en Español|Sep 22, 2024 Una mujer de Phoenix y dos cómplices fueron arrestados después de una incautación de drogas en la Interestatal 70 cerca de Parachute el miércoles, según un comunicado de prensa de la Oficina del Sheriff del Condado de Garfield. Los agentes del Sheriff del Condado de Garfield y los miembros del Grupo de Trabajo de Respuesta y Cumplimiento de Problemas Especiales (SPEAR, por sus siglas en inglés) detuvieron a un vehículo por una infracción de tránsito. Durante la parada, los agentes encontraron casi 60 libras de pastillas de OxyContin presuntamente falsificadas. Se cree que las pastillas contienen fentanilo y tienen un valor estimado en la calle de $2.6 millones. Los investigadores dijeron que esto suma alrededor de 222,360 pastillas. Leslie López-Rojas, de 20 años, de Phoenix, fue arrestada por múltiples cargos, incluida la importación de una sustancia controlada de la Lista II a Colorado, que es un delito grave de drogas de clase 1. Otras dos personas también fueron detenidas. El grupo de trabajo SPEAR, con sede en el condado de Garfield, trabajó con la Administración para el Control de Drogas (DEA), el Departamento de Policía de Rifles y la Autoridad de Comunicaciones de Emergencia del condado de Garfield durante la operación. Se insta a cualquier persona que tenga información sobre este caso u otra actividad delictiva a que se comunique con SPEAR al 970-945-0453 o a las autoridades locales. La investigación está en curso. May 26, 2025 May 26, 2025 May 26, 2025 May 18, 2025 May 18, 2025 Jun 1, 2025 Jun 4, 2025 Jun 3, 2025 Jun 3, 2025 Jun 5, 2025 **Support Local Journalism** **Support Local Journalism** Readers around Glenwood Springs and Garfield County make the Post Independent’s work possible. Your financial contribution supports our efforts to deliver quality, locally relevant journalism. Now more than ever, your support is critical to help us keep our community informed about the evolving coronavirus pandemic and the impact it is having locally. Every contribution, however large or small, will make a difference. Each donation will be used exclusively for the development and creation of increased news coverage. Assistant Project Coordinator - Argento Marble LLC - Carbondale, Colorado Argento Marble is seeking an Assistant Project Coordinator at our… Assistant Project Coordinator - Argento Marble LLC - Carbondale, Colorado Argento Marble is seeking an Assistant Project Coordinator at our… NOW HIRING: Food & Beverage Attendant III starting @ $20.00/hour Grill Cook II starting @ 20.00/hour Grill Cook I starting… NOW HIRING: Food & Beverage Attendant III starting @ $20.00/hour Grill Cook II starting @ 20.00/hour Grill Cook I starting… JOIN TEAM CMC: Elevating the Vitality of Our Beautiful Rocky Mountain Region! FULL-TIME OPENINGS: SPRING VALLEY - Residence Life ... JOIN TEAM CMC: Elevating the Vitality of Our Beautiful Rocky Mountain Region! FULL-TIME OPENINGS: SPRING VALLEY - Residence Life ... Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… We are an earn while you learn nonprofit electrical apprenticeship program. The training center is located in Glenwood Springs, CO.… We are an earn while you learn nonprofit electrical apprenticeship program. The training center is located in Glenwood Springs, CO.… Long-time year-round owners of 50-acre private horse ranch in Missouri Heights seek to hire an experienced live-out full-time OR part-time… Long-time year-round owners of 50-acre private horse ranch in Missouri Heights seek to hire an experienced live-out full-time OR part-time… How does $48,000.00 per year sound to you? No college degree required, no formal training or education required. Clean MVR… How does $48,000.00 per year sound to you? No college degree required, no formal training or education required. Clean MVR… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Executive Housekeeper Job Details Job Location: Snowmass Club - Snowmass Village, CO Position Type Full Time Salary Range $90000.00 -… Executive Housekeeper Job Details Job Location: Snowmass Club - Snowmass Village, CO Position Type Full Time Salary Range $90000.00 -… Transportation Coordinator Garfield County School District No. 16 We are hiring! Transportation Coordinator , School Bus Drivers , and much… Transportation Coordinator Garfield County School District No. 16 We are hiring! Transportation Coordinator , School Bus Drivers , and much… **Daily Newsletter** Sign up for daily and breaking news headlines.Manage Subscriptions A wolf from the Copper Creek pack connected to multiple instances of livestock depredation was killed recently. What do you think? It's sad but it was necessary. The wolf shouldn't have been killed but instead trapped once again and moved elsewhere in Colorado. Neither Colorado Parks and Wildlife nor the wolf should have been put in that position. Wolf reintroduction is failing. I have no opinion. View Results Home Trending Sections Jobs Classifieds Autos Real Estate Rentals Service Directory Pets Merchandise Legals Place Legal Ad Search Legal Ads Farm & Ranch Recreation Announcements News Contact Us Become a Carrier Submissions Submit an Obituary Archives Newsletters Commercial Print Sales RSS AP News Post Independent E-Edition Citizen Telegram E-Edition Cookie List Do not sell my personal information Aspen-Snowmass Breckenridge-Summit County Craig-Moffat County Lake Tahoe - California Steamboat Springs-Routt County Vail-Eagle Valley Winter Park-Granby-Grand County Printing Press Jobs About Us| Terms of Use| Privacy Policy| Terms and Conditions| Comment Policy| Careers| ©2005 - 2025 Swift Communications, Inc."}