{"id": 378, "name": "EarthJustice", "domain": "earthjustice.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://earthjustice.org/article/budget-reconciliation-congress", "title": "Budget Reconciliation Congress", "content": "The new Trump administration is threatening everything we’ve fought so hard to protect – clean air, fresh water, and a healthy environment for all. But we won’t stop. In courtrooms across the country, we are fighting back.Join us. Donate by June 30, and your gift will be matched. Your gift matched $2:$1.Choose an amount to give: Your donation is tax-deductible. Earthjustice is a 501(c)3 nonprofit. More ways to give Your 1st year of monthly gifts matched$3:$1.Choose an amount to give: Your donation is tax-deductible. Earthjustice is a 501(c)3 nonprofit. More ways to give Samuel Corum / Bloomberg Creative / Getty Images About UsAbout EarthjusticeOfficesFinancialsYour Donation at WorkCareer OpportunitiesCommitment To Justice About Earthjustice Offices Financials Your Donation at Work Career Opportunities Commitment To Justice About Earthjustice Offices Financials Your Donation at Work Career Opportunities Commitment To Justice Our WorkHow We WorkOur ProgramsOur ClientsOur StoriesVictoriesPress RoomEn Español How We Work Our Programs Our Clients Our Stories Victories Press Room En Español How We Work Our Programs Our Clients Our Stories Victories Press Room En Español Take ActionAction CenterAction AlertsThe Action Tip GuideMake a Tribute GiftManage Monthly GiftOther Ways To Give Action Center Action Alerts The Action Tip Guide Make a Tribute Gift Manage Monthly Gift Other Ways To Give Action Center Action Alerts The Action Tip Guide Make a Tribute Gift Manage Monthly Gift Other Ways To Give Donate Search We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change.Because the earth needs a good lawyer. We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change. Because the earth needs a good lawyer. We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change. Because the earth needs a good lawyer. About UsAbout EarthjusticeOfficesFinancialsYour Donation at WorkCareer OpportunitiesCommitment To Justice About Earthjustice Offices Financials Your Donation at Work Career Opportunities Commitment To Justice About Earthjustice Offices Financials Your Donation at Work Career Opportunities Commitment To Justice Our WorkHow We WorkOur ProgramsOur ClientsOur StoriesVictoriesPress RoomEn Español How We Work Our Programs Our Clients Our Stories Victories Press Room En Español How We Work Our Programs Our Clients Our Stories Victories Press Room En Español Take ActionAction CenterAction AlertsThe Action Tip GuideMake a Tribute GiftManage Monthly GiftOther Ways To Give Action Center Action Alerts The Action Tip Guide Make a Tribute Gift Manage Monthly Gift Other Ways To Give Action Center Action Alerts The Action Tip Guide Make a Tribute Gift Manage Monthly Gift Other Ways To Give Donate Search We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change.Because the earth needs a good lawyer. We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change. Because the earth needs a good lawyer. We take on many of the biggest environmental and health challenges of our time and stick with them.The law makes change. Because the earth needs a good lawyer. The 47th Administration Our Lawsuits Executive Orders Budget Bill Attacks on Agencies **Congress’s Big, Bad Budget Bill is a Dream for Polluters and Billionaires** Together, we can fight back to protect our families. ByEarthjustice/Policy and Legislation Team **What you should know** Congressional Republicans are using a process calledbudget reconciliationto ram through more of the Trump administration’s agenda. Budget reconciliation is a tool that Congress can use to fast-track federal bills related to spending. It requires a simple majority vote in both Houses of Congress, meaning that Republicans do not need a single Democratic vote to pass the bill into law. This time, Republicans have drafted a bill that sells our public lands and oceans to the lowest bidder, exploits our natural resources, and cuts environmental justice funding and clean energy tax credits to pay for handouts to polluting industries and tax breaks for billionaires. What you can do:Ask your elected officials to side with the American people over billionaires and polluting industries. We need members of Congress to actively and publicly oppose the reconciliation bill. We cannot accept the ways it would increase energy prices, sacrifice our public lands and oceans, allow polluting industries to evade accountability in the courts, and cut critical investments in public health and environmental programs. Members of the House Energy and Commerce Committee are seen during the 24th hour of a markup on a budget reconciliation bill on Capitol Hill May 14, 2025 in Washington D.C. (Francis Chung / POLITICO via AP Images) **What is budget reconciliation?** In a nutshell, the law affords Congress a process calledbudget reconciliationto fast-track federal spending and saving changes. Reconciliation is how Congress passed the 2022 Inflation Reduction Act, a $369 billion climate solutions package that made America a leader in clean energy technology. The Inflation Reduction Act also provided tax breaks for middle-class and low-income households that made home energy improvements. Federal budget proposals typically need 60 votes in the Senate, which means that either party needs support from the other to pass their budget package. But budget reconciliation only requires a simple majority, or 51 votes — and Republicans control 53 Senate seats. Instead of using their power to address real issues, they’re trying to undo the progress made under the Inflation Reduction Act. They’re also pushing through a free pass for billionaire polluters to harm the environment and the American people without consequences. A fossil fuel drilling site on Alaska’s North Slope. (Marc Morrison / Cavan Images / Getty Images) **This bill will harm our families, our public lands and oceans, and our planet** Republicans have run roughshod over budget reconciliation guidelines: they’re including substantive policy changes in a process that is strictly intended for federal fiscal policy. Among Republicans’ “budget” priorities for the 2025 reconciliation process: Mandating offshore oil-and-gas drilling, including in sensitive ocean ecosystems and endangered species habitat like the Gulf of Mexico and Alaska’s Arctic Requiring federal agencies to open additional hundreds of thousands of acres to oil, gas, and coal leasing, as well as logging and mining Removing checks and balances that have helped us protect public lands for generations by prohibitinganyonefrom challenging wealthy polluters in court. Instead, big polluters will simply be able to pay their way out of being held accountable for damaging OUR public lands. Cutting popular, job-creating clean energy tax credits, funding for environmental justice programs, and grants that allow coastal communities to build resilience against natural disasters Iron workers construct the framework for a 4.7 million-square-foot Panasonic EV battery plant near DeSoto, Kansas in 2023. Panasonic could earn as much as $6.8 billion in federal tax incentives from the Inflation Reduction Act for the facility, which is expected to be the largest battery factory in the world. (Charlie Riedel / AP) **Less money for local jobs and community investments…** Once again, Trump and his congressional enablers aren’t shy about targeting programs that have been good for Americans of all political stripes. By repealing the Inflation Reduction Act’s environmental justice investments and clean energy tax credits,members of Congress would take away hundreds of billions of dollars in investments from their communities. Their own districts and states would lose hundreds of thousands of jobs, and hardworking people would pay more for energy bills and environmental harm. The Inflation Reduction Act is a proven, bipartisan winner that hasalready created over 400,000 jobsacross 48 states and Puerto Rico. It’shelped clean energy jobs to grow at double the rate of overall job growthnationwide. All told, the Inflation Reduction Act is expected to have over $3.8 trillion in economic benefits while providing Americans with affordable, reliable clean energy — if Republicans don’t gut it first. An offshore oil platform being towed into the Gulf of Mexico from a shipyard near Corpus Christi, Texas. (Marc Morrison / Cavan Images / Getty Images) **…even MORE handouts for polluting industries…** Congressional Republicans will take a wrecking ball to green jobs, clean energy, and social safety nets like Medicaid, while finding plenty of funds to provide tax windfalls to billionaires and sweetheart deals to industries that pollute our lands, our waters, and our bodies. They’re hungry to expand drilling ineveryregion of the country, onshore and offshore, by using budget reconciliation to mandate auctions of public lands and waters in the Gulf of Mexico, the Arctic National Wildlife Refuge, Alaska’s Cook Inlet, vast habitats in Western states, and much, much more. They’re prioritizing this giveaway even though record production levels have alreadypushed the limits of how fast companies can drill. For once, oil and gas executives are the ones saying “enough” — they already have excessive leases on our public lands. In the Gulf of Mexico, oil and gas corporations are producing on just 20% of the 12 million acres they lease offshore; in Alaska, none of them showed up to bid on ANWR leases offered by the Biden administration in January 2025. **….and even MORE destructive powers to the Trump administration.** This bill isn’t just about billionaires and polluters; it transfers an inordinate amount of power to the Trump administration, insulating its actions from the courts and giving it power to target anyone who disagrees. Remember the part about giving wealthy polluters a free pass from their day in court? Buried in the legislative text are provisions that would create a “pay-to-pollute” scheme where sponsors of major dirty projects can pay a fee for an expedited environmental review that’s shielded from court scrutiny. These provisions would give the Trump administration authority to ram through polluting projects while tying the hands of everyday people and communities who would otherwise challenge the impacts to their health, our ecosystems, and our planet. Willie Dodson, the coal impacts program manager at Appalachian Voices, installs an air monitor on a house in Wilson Creek, Kentucky in 2023 as part of an initiative called the Upper South and Appalachia Citizen Air Monitoring Project that received funding from the Inflation Reduction Act. (Michael Swensen for Earthjustice) **Tell Congress to fight for you, not polluters** As energy, health care, and food costs rise for people across the country, House and Senate Republicans have responded by asking people to do more with less. Meanwhile, they’re doubling down on providing massive handouts and tax breaks to polluting industries, huge corporations, and the nation’s wealthiest people. If passed, this plan would sacrifice your public lands and take more from your family’s wallet to line the pockets of billionaires and polluters. Of course, the Trump administration won’t stop here. They’ll continue shredding our social safety nets. The “savings” won’t reach you or me; that money gets funneled back to people who’ve always been able to afford their groceries and medications — people who’ve never worried about whether their water is safe to drink, or if their air is bad for their lungs. Members of Congress need to hear that Americans are watching the federal budget process to see who fights for the public good. Earthjustice strongly opposes budget reconciliation provisions that include any of the following: Opening the Arctic and other cherished public lands and ocean to oil and gas drilling, coal leasing, mining, and logging Creating loopholes that allow polluters to “pay to pollute” and evade accountability by circumventing bedrock environmental laws, like the National Environmental Policy Act and Endangered Species Act Defunding Inflation Reduction Act grants that are actively lowering energy costs and cleaning up pollution in communities heavily burdened by environmental injustices and climate change Effectively repealing the Inflation Reduction Act’s clean energy tax credits even though they’re driving hundreds of billions of dollars in investment and hundreds of thousands of jobs into communities across the country Building the border wall through sensitive habitats and communities between the U.S. and Mexico Attacking environmental health and Medicaid Tell your congressional representatives that it’s time to stand up for the people who elected them by protecting our health, our public lands, and our social safety nets. Policy and Legislation Team Established in 1989, Earthjustice's Policy & Legislation team works with champions in Congress to craft legislation that supports and extends our legal gains. We’ve received your feedback — thank you! “The National Environmental Policy Act is an environmental law, but it is also a tool to fight for worker safety, immigrant rights, and human rights.” **The Stories to read on Air and Water** Two Attacks on Clean Air by the Trump Administration Mining Makes No Sense to the Southwest Alaska Tribes Challenging the Donlin Gold Mine Take ActionTell Congress to fight for you, not polluters and billionaires **What you need to know this week** 5 Special Places That Trump’s Megabill Would Sell Out — to Pay for Billionaire Tax Breaks The Trump Administration Forces Power Plants to Continue Burning Fossil Fuels Washington Regulators Must Hold Utilities Accountable in the Clean Energy Transition **About** Who We Are En Español Commitment To Justice Sustainability at Earthjustice Annual Reports Victories Career Opportunities Privacy Policy Contact Request for Legal Assistance **Get Involved** Donate Action Center Email & Text Alerts Renew Your Support Become a Justice Partner Legacy Gift Planning Earthjustice Store Supporter FAQ **Member Center** Manage Your Monthly Gift Manage Your Email Subscriptions Manage Your Postal Mail Subscriptions Update Your Contact Information View Your Donation History **The Law Makes Change** Stay informed on how we hold accountable those who break our environmental laws. © 2025 Earthjustice.We respect your privacy. Earthjustice is a 501(c)3 nonprofit. Your contribution is tax-deductible. EIN 94-1730465."}