{"id": 190, "name": "Cape Coral Breeze", "domain": "capecoralbreeze.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.capecoralbreeze.com/opinion/letters-to-the-editor-guest-opinions/2025/06/05/guest-commentary-jeannine-joy-leads-united-way-of-lee-hendry-and-glades-to-new-heights/", "title": "Guest Commentary Jeannine Joy Leads United Way Of Lee Hendry And Glades To New Heights", "content": "E-Edition Submit News News Business Viewpoints Obituaries Fishing / Sports Community Jobs Place Notice NewsCape NewsBreaking NewsBusinessYour CommunityFlorida NewsNational News Cape News Breaking News Business Your Community Florida News National News Cape News Breaking News Business Your Community Florida News National News Fishing / SportsLocal SportsSports ColumnsFlorida SportsNational Sports Local Sports Sports Columns Florida Sports National Sports Local Sports Sports Columns Florida Sports National Sports Obituaries ViewpointsLetters To The EditorEditorialsLocal Columns Letters To The Editor Editorials Local Columns Letters To The Editor Editorials Local Columns LifeLocal LifestylesClubs & OrganizationsEngagements Local Lifestyles Clubs & Organizations Engagements Local Lifestyles Clubs & Organizations Engagements Cape HistoryCape Coral’s 50th AnniversaryCape Coral’s 40th AnniversaryCape Coral’s 45th Anniversary Cape Coral’s 50th Anniversary Cape Coral’s 40th Anniversary Cape Coral’s 45th Anniversary Cape Coral’s 50th Anniversary Cape Coral’s 40th Anniversary Cape Coral’s 45th Anniversary Hurricane Guide ContactContact UsSubmit NewsSingle Copy LocationsStatement of ValuesTerms of Service Contact Us Submit News Single Copy Locations Statement of Values Terms of Service Contact Us Submit News Single Copy Locations Statement of Values Terms of Service Store Classifieds Public NoticesBrowse noticesPlace a notice Browse notices Place a notice Browse notices Place a notice E-Editions Yellow Pages **Guest Commentary | Jeannine Joy leads United Way of Lee, Hendry, and Glades to new heights** **President and CEO has been with organization for 30 years** For the past 30 years, theUnited Way of Lee, Hendry, and Gladeshas evolved, shifted and responded to numerous hurricanes, economic ups and downs, a pandemic and other outside forces.Three decades ago, the nonprofit had just five employees and an annual campaign goal of $2 million. Today, the organization has 80-plus employees whose work is augmented by more than 1,000 volunteers, and the annual campaign goal is a whopping $11.3 million.TheUnited Wayof today looks nothing like it did in 1995.There has been one constant, though – Jeannine Joy.Since joining the organization 30 years ago, Jeannine’s efforts to work with partners in the community to realize a shared vision for change and to build solutions that continue to improve lives has been second to none.When Jeannine started atUnited Way, she was a campaign associate and served as vice president of resource development and marketing. In June 2019, she was named president and CEO, giving her just nine months at the helm before COVID-19 presented her with an incredibly challenging task – improving the quality of life for everyone when our lives were turned upside down. And then there were hurricanes Ian, Helene and Milton.She brings stability during times of turbulence. She leads successful fundraising initiatives that result in allocation of dollars and resources to 90 Partner Agencies and over 260 programs and initiatives.Recognizing the impact of rising health care costs, Jeannine helped rescue the WeCare Program and brought it in-house, partnering with local providers to donate millions of dollars of specialty medical care and services to hundreds of local patients who could not otherwise afford treatments.Jeannine’s beliefs are based on collaborations and partnerships with stakeholders and nonprofits to improve the quality of life for ALL people in the local community.This philosophy was highly visible in perhaps one of her most exceptional efforts at United Way back in 2020. Jeannine was instrumental in bringing Lee County’s first United Way Community Partnership School to realization at Franklin Park Elementary through a collaboration between the University of Central Florida, Florida Gulf Coast University, Lee Health and The School District of Lee County. In fall 2021 a second United Way Community Partnership School was started at Fort Myers Middle Academy, followed by a third school in early 2023 at Colonial Elementary. These United Way Community Partnership Schools have been influential in helping children get the resources they need to further enhance their education.Also in 2020, Jeannine and her team championed the United Way School Resource Center with The School District of Lee County to provide clothing, hygiene essentials and school supplies. The School Resource Center was significant in helping families during the pandemic in 2020 and after Hurricane Ian in 2022. Now five years later, the program is funded by the United Way Campaigns, generous sponsors and various grants. It has given out over 351,000 items worth more than $9.2 million.Initiatives and programs such as these have made Jeannine a highly respected member ofUnited Way of Lee, Hendry, and Gladesfor the past 30 years. Her efforts have helped countless members of the Southwest Florida region, and for that, we are all thankful. Congratulations on 30 years of outstanding service to the community, Jeannine! We look forward to many more.Matt Humphreys is Chair of the Board of Directors for United Way of Lee, Hendry, and Glades. For more information, please visitUnitedWayLee.orgor call 239-433-2000.To reach MATT HUMPHREYS, please email For the past 30 years, theUnited Way of Lee, Hendry, and Gladeshas evolved, shifted and responded to numerous hurricanes, economic ups and downs, a pandemic and other outside forces. Three decades ago, the nonprofit had just five employees and an annual campaign goal of $2 million. Today, the organization has 80-plus employees whose work is augmented by more than 1,000 volunteers, and the annual campaign goal is a whopping $11.3 million. TheUnited Wayof today looks nothing like it did in 1995. There has been one constant, though – Jeannine Joy. Since joining the organization 30 years ago, Jeannine’s efforts to work with partners in the community to realize a shared vision for change and to build solutions that continue to improve lives has been second to none. When Jeannine started atUnited Way, she was a campaign associate and served as vice president of resource development and marketing. In June 2019, she was named president and CEO, giving her just nine months at the helm before COVID-19 presented her with an incredibly challenging task – improving the quality of life for everyone when our lives were turned upside down. And then there were hurricanes Ian, Helene and Milton. She brings stability during times of turbulence. She leads successful fundraising initiatives that result in allocation of dollars and resources to 90 Partner Agencies and over 260 programs and initiatives. Recognizing the impact of rising health care costs, Jeannine helped rescue the WeCare Program and brought it in-house, partnering with local providers to donate millions of dollars of specialty medical care and services to hundreds of local patients who could not otherwise afford treatments. Jeannine’s beliefs are based on collaborations and partnerships with stakeholders and nonprofits to improve the quality of life for ALL people in the local community. This philosophy was highly visible in perhaps one of her most exceptional efforts at United Way back in 2020. Jeannine was instrumental in bringing Lee County’s first United Way Community Partnership School to realization at Franklin Park Elementary through a collaboration between the University of Central Florida, Florida Gulf Coast University, Lee Health and The School District of Lee County. In fall 2021 a second United Way Community Partnership School was started at Fort Myers Middle Academy, followed by a third school in early 2023 at Colonial Elementary. These United Way Community Partnership Schools have been influential in helping children get the resources they need to further enhance their education. Also in 2020, Jeannine and her team championed the United Way School Resource Center with The School District of Lee County to provide clothing, hygiene essentials and school supplies. The School Resource Center was significant in helping families during the pandemic in 2020 and after Hurricane Ian in 2022. Now five years later, the program is funded by the United Way Campaigns, generous sponsors and various grants. It has given out over 351,000 items worth more than $9.2 million. Initiatives and programs such as these have made Jeannine a highly respected member ofUnited Way of Lee, Hendry, and Gladesfor the past 30 years. Her efforts have helped countless members of the Southwest Florida region, and for that, we are all thankful. Congratulations on 30 years of outstanding service to the community, Jeannine! We look forward to many more. Matt Humphreys is Chair of the Board of Directors for United Way of Lee, Hendry, and Glades. For more information, please visitUnitedWayLee.orgor call 239-433-2000. To reach MATT HUMPHREYS, please email For the past 30 years, theUnited Way of Lee, Hendry, and Gladeshas evolved, shifted and responded to numerous hurricanes, economic ups and downs, a pandemic and other outside forces. Three decades ago, the nonprofit had just five employees and an annual campaign goal of $2 million. Today, the organization has 80-plus employees whose work is augmented by more than 1,000 volunteers, and the annual campaign goal is a whopping $11.3 million. TheUnited Wayof today looks nothing like it did in 1995. There has been one constant, though – Jeannine Joy. Since joining the organization 30 years ago, Jeannine’s efforts to work with partners in the community to realize a shared vision for change and to build solutions that continue to improve lives has been second to none. When Jeannine started atUnited Way, she was a campaign associate and served as vice president of resource development and marketing. In June 2019, she was named president and CEO, giving her just nine months at the helm before COVID-19 presented her with an incredibly challenging task – improving the quality of life for everyone when our lives were turned upside down. And then there were hurricanes Ian, Helene and Milton. She brings stability during times of turbulence. She leads successful fundraising initiatives that result in allocation of dollars and resources to 90 Partner Agencies and over 260 programs and initiatives. Recognizing the impact of rising health care costs, Jeannine helped rescue the WeCare Program and brought it in-house, partnering with local providers to donate millions of dollars of specialty medical care and services to hundreds of local patients who could not otherwise afford treatments. Jeannine’s beliefs are based on collaborations and partnerships with stakeholders and nonprofits to improve the quality of life for ALL people in the local community. This philosophy was highly visible in perhaps one of her most exceptional efforts at United Way back in 2020. Jeannine was instrumental in bringing Lee County’s first United Way Community Partnership School to realization at Franklin Park Elementary through a collaboration between the University of Central Florida, Florida Gulf Coast University, Lee Health and The School District of Lee County. In fall 2021 a second United Way Community Partnership School was started at Fort Myers Middle Academy, followed by a third school in early 2023 at Colonial Elementary. These United Way Community Partnership Schools have been influential in helping children get the resources they need to further enhance their education. Also in 2020, Jeannine and her team championed the United Way School Resource Center with The School District of Lee County to provide clothing, hygiene essentials and school supplies. The School Resource Center was significant in helping families during the pandemic in 2020 and after Hurricane Ian in 2022. Now five years later, the program is funded by the United Way Campaigns, generous sponsors and various grants. It has given out over 351,000 items worth more than $9.2 million. Initiatives and programs such as these have made Jeannine a highly respected member ofUnited Way of Lee, Hendry, and Gladesfor the past 30 years. Her efforts have helped countless members of the Southwest Florida region, and for that, we are all thankful. Congratulations on 30 years of outstanding service to the community, Jeannine! We look forward to many more. Matt Humphreys is Chair of the Board of Directors for United Way of Lee, Hendry, and Glades. For more information, please visitUnitedWayLee.orgor call 239-433-2000. To reach MATT HUMPHREYS, please email **ARTICLETags** Copyright © Cape Coral Breeze|Contact|Terms of Use|Privacy Policy"}