{"id": 279, "name": "CounterCurrents.org", "domain": "countercurrents.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://countercurrents.org/2025/05/guha-a-village-under-siege-dispute-over-a-dargah-a-communal-cauldron-muslim-minority-facing-socio-economic-boycott-by-hindutva-forces-civil-society-intervention-required/", "title": "Guha A Village Under Siege Dispute Over A Dargah A Communal Cauldron Muslim Minority Facing Socio Economic Boycott By Hindutva Forces Civil Society Intervention Required", "content": "Fair Use Disclaimer Privacy Policy Contact Subscription News Letter Submission Policy About Fair Use Disclaimer Privacy Policy Contact Subscription News Letter Submission Policy About Palestine India World Human Rights Arts/Literature Imperialism Climate Change Counter Solutions More…Annihilate CasteBook ReviewCommunal HarmonyCOVID Response WatchEditor’s PicksEnvironmental ProtectionGlobalisationLife/PhilosophyPatriarchyResource CrisisSouth Asia Annihilate Caste Book Review Communal Harmony COVID Response Watch Editor’s Picks Environmental Protection Globalisation Life/Philosophy Patriarchy Resource Crisis South Asia Annihilate Caste Book Review Communal Harmony COVID Response Watch Editor’s Picks Environmental Protection Globalisation Life/Philosophy Patriarchy Resource Crisis South Asia Palestine India World Human Rights Arts/Literature Imperialism Climate Change Counter Solutions More…Annihilate CasteBook ReviewCommunal HarmonyCOVID Response WatchEditor’s PicksEnvironmental ProtectionGlobalisationLife/PhilosophyPatriarchyResource CrisisSouth Asia Annihilate Caste Book Review Communal Harmony COVID Response Watch Editor’s Picks Environmental Protection Globalisation Life/Philosophy Patriarchy Resource Crisis South Asia Annihilate Caste Book Review Communal Harmony COVID Response Watch Editor’s Picks Environmental Protection Globalisation Life/Philosophy Patriarchy Resource Crisis South Asia **Guha, a Village under Siege, Dispute over a Dargah, a Communal Cauldron, Muslim Minority facing Socio-Economic Boycott by Hindutva forces – Civil Society Intervention Required!** **Share:** Guha, is a small village near Ahmednagar in Maharashtra. It’s now caught in the grip of Hindutva mobilization, where another Dargah has now been a target of attack over the last 2 years. A SHORT HISTORY Unknown to most in Maharashtra and the rest of the country, the Hazrat Ramzan Shah Baba or the Kanobha Ramzan Shah Baba Dargah, a centre of unity, a symbol of the best traditions of the Sufi and Nath traditions, a syncretic culture developed over centuries of coexistence, is now facing a major communal fascist onslaught led by various Hindutva organisations. Figure 1 The idol of Kanifnath Baba placed right within the sanctum sanctorum of the dargah. Behind the idol is the Mazhar of Kanobha Ramzan Shah Baba. The controversy surrounds a mystic called Kanobha, who was from the Nath sect in the 13thcentury. Under the influence of the Sufis, he later converted to Islam. His followers then erected a dargah in his memory, and both his Muslim & Hindu followers came to the dargah to offer their devotion. The Nath Panth actually comes from a rich syncretic tradition of both Hinduism & Islam, and thus it is ironic that today the memory of Kanobha is being used to divide the two communities. It was our friend Alauddin Sheikh who comes from this very village, a social activist, a progressive Muslim reformist, with roots in the Rashtriya Seva Dal, who spoke to us about the dire need for a secular intervention as the situation was grim and deteriorating. Then a team led by Tushar Gandhi & other members and associates of our organisation – Hum Bharat Ke Log (HBKL), went to Guha village to study the situation and decide upon a strategy of intervention. The delegation comprising of journalists and social activists included, Medha Kulkarni, Irfan Engineer, Sharad Kadam, Narendra Dumbre, Maqbool Sheikh, Razia Sheikh, Sadhna Vairale, Ajay Gaikwad, and this writer. Thus, it was on the 22 April 2025, that we visited this village and we were shocked at the intensity of the multipronged attack on the Muslim community who constitute a minority in this village, with around 400, in a population of approximately 4000. Figure 2 Kanobha Ramzaan Shah Baba Dargah, Guha On speaking to the members and families that live on the land adjoining the dargah, this is what we learnt. The ‘Sanad’ or the chain of transmission or authority to the dargah goes all the way back to 1260 CE, that’s over 800 years, and they produced the documents for the same. The dargah has been at this same spot for over 500 years at the minimum, or more. Thus, the Sanad clearly establishes the lineage of the Muslim Mujawar families who are the caretakers of the dargah and its land. The legal status was again reestablished in the British Gazette records of 1854. THE HINDUTVA COMMUNAL MOBILISATION In this case, the land attached to the dargah is 10 acres, which clearly is part of the problem at hand. The plot includes 10-12 houses where the families live, a kabrastan where they bury their dead, and a field of 6 acres where they grow their crops. They also grow the tamarind trees around their houses. Today, nor can they work in their fields, nor pick the tamarind from the trees. Attached to the main dargah were also two other dargahs, though far more smaller in size, one located at the periphery and the other in the very centre of the village. It was 15 years ago that when certain Hindutva organisations laid claim to Kanobha as a Hindu deity and placed an idol in the dargah at the periphery. The Muslim community decided to ignore the provocation and in a way surrendered that dargah to avoid friction. Then it was around another 5 years ago, that the other small dargah too was taken over, this time at the very centre of the villager, located behind the Prerna Credit Cooperative Society. This shocked the Muslim community and they rightly realised that the Hindutva storm troopers would now come for the main dargah. They then decided to register their dargah with the Aurangabad Waqf Board (Maharashtra) so as to strengthen their legal case. In was in December 2023 that the Hindu Jan Akhrosh Morcha (HJAM) began to perform bhajan’s at the dargah currently under siege. This led to an altercation, leading to a riot & the police intervened and filed FIR’s under various sections of the IPC against members of both the communities, though only those from the Muslim community were arrested. This lead to a perceptible rise in the communal temperature. Then the HJAM called for a rally on December 28, 2023. The police asked the Muslims to stay indoors. It was during this period that members of the HJAM placed an idol of Kanifnath (who was a much later figure) within the Dargah, right in front of the burial place of Kanobha Ramzan Shah Baba. They later said that the idol “appeared” miraculously. More worryingly, these events all occurred in the very presence of the police. The police also destroyed the CCTV footage that would prove their culpability in the entire sordid episode. The members of the HJAM also placed saffron flags all over the dargah, a donation box and put up loudspeakers and hold aartis twice a day, with the sound system blaring way beyond the decibels permitted. This is being done to harass and spread panic and fear amongst the ordinary folk who inhabit the vicinity, with the women and children the most affected and they were clearly traumatised. THE SOCIO-ECONOMIC BOYCOTT OF THE MUSLIM COMMUNITY & IT’S IMAPCT Then the Hindutva organisations called for an economic & social boycott of the Muslim population of Guha village. The agenda is to make life a living hell for the families and force them to leave the village, forced to abandon their homes, their shops, their fields and other properties. Today, we were told that no Hindu customer purchases from a Muslim shop. A Hindu cannot invite a Muslim friend for a family function, as there is a fine of Rs. 2000/- that will be imposed on him. A young Muslim said that he was at his wits end as there is no customer that comes to his Xerox shop anymore. An old vocal Muslim lady asked as till when were they to bear this daily inhuman treatment. Another old man complained that the local barber refused to cut his hair and thus he has to travel outside the village for the same. The Muslim families are forbidden from farming on the 6 acres of land attached to the dargah. They can’t even break the Neem leaves or the tamarind. This, they are told by the local authorities is part of the status quo order, but this reading is way off the mark. SOCIO-ECONOMIC BOYCOTT, VIOLATION OF ACT OF 2016 The social & economic boycott is in total violation of a law passed by CM Narendra Fadvanis during his previous BJP government. A progressive law referred to as that “Maharashtra Protection of People from Social Boycott (Prevention, Prohibition & Redressal) Act 2016 was enacted to end the menace of social boycott practiced by extra-judicial institutions like caste and community panchayats, or rather kangaroo courts. The Act considers social boycott as a crime and a person could face three years in prison and a fine of one lakh rupees. Here, in the case of Guha village, there is no written document calling for the socio-economic boycott of the Muslim community, as the Hindutva leaders have spread it by word of mouth and local pressure. Though there is video evidence of an extremist Hindu leader calling for the same. Therefore we demand that legal action be undertaken against all such perpetrators. We also call for the immediate end to the boycott of the Muslim community and the state should fulfill its constitutional and legal responsibilities. THE VIOLATION OF THE STATUS QUO AS PER ORDER OF THE WAQF TRIBUNAL The status quo order by the Waqf Tribunal applies to the shrine and not to the fields and the Neem trees, as that would be in total violation of the Right to Livelihood, as an integral part of the Right to Life as guaranteed by Article 21 of the Indian Constitution. In fact, as far as the dargah is concerned, the Hindutva organisations are totally in violation of the status quo order, as they are not permitted to perform aarti & other religious activities till the court finally decides on the matter that – is this a Muslim Dargah dedicated to Kanobha Ramzan Shah Baba, or a Hindu Mandir dedicated to Kanifnath. BREAKDOWN OF HARMONY & CIVIL SOCIETY INTERVENTION Whilst the Dargah or Mandir matter are an issue of serious concern, but what is truly worrying is also the total breakdown of the communal harmony and the social relations in this village. All of the Muslims we interacted with spoke about their age old friendships and family-like ties, participation during each other’s festivals and both in times of sorrow and happiness. Today, a young Muslim said that, even though they go to a common village school, the children of the two communities do not interact – cannot for fear of the social boycott. During our short visit, we were unable to meet the leaders of members of the Hindutva organisations, even though we did try to reach out. We met the Tehsildar of Raore, Namdeo Patil, who assured us of relief within his discretionary powers, one of which was to tone down the daily harassment. Who also said that he would soon organise a meeting with the stake holders from both the communities, where we too would be present. We are aware that there are members of the Hindu community in Guha village, who do not approve of the current situation, but they are under way too much pressure to come out publicly at this point in time, but it will happen in due course. As part of the future course of action, we have decided to: Establish the, “Guha Village Shanti aur Ekta Samiti” (Guha Village Peace and Unity Committee). Reach out to the Hindu community and help bridge the recent divide with their Muslim compatriots. Bringing the two communities closer and back together is of utmost importance. The dialogue from thereon can help heal the wounds and end the socio-economic boycott and bring the village back together. As for the Dargah/Mandir matter, in all fairness, the status of the Dargah needs to be restored to its original position. Or then the other option is to leave it for the courts to decide as per the law and constitution of our land. The local Dargah committee has taken to legal recourse and has the requisite documents to prove their case. At the same time, prominent human rights lawyers committed to fighting the case of the oppressed need to be engaged into the struggle. Already 8-10 families have left the village due to the boycott.In order to resist the economic boycott, it’s imperative that other forms of skill sets and employment are imparted to the Muslim community, so that they can tide through this stormy period. It’s clear that the attack on Guha village is multipronged and part of a national strategy of the Hindutva organisations. In this case it is to take over the dargah, the land and other properties attached to it. The attack compounded with the socio-economic boycott, is meant to harass and compel Muslim families to leave the village for other towns and cities. This thus requires the role of the various civil society organisations that must unite, coordinate and intervene in this matter – intervene before it’s too late. We thus need to build “Guha Village Support Groups” in Ahmednagar, Pune, Aurangabad, Nasik, with Mumbai, already having taken the initiative. We will be also presenting a memorandum to be sent to all the secular political parties and will be meeting them as well in this regard. The Muslim community in Guha village has been valiantly conducting a Satyagraha for the last 510 days – against all odds. It’s time that all those organisations committed to secular democratic values, the constitutional values of justice and equality now enter the fray. We must carry on believing in the inner goodness of the ordinary people of India, and strive to unite the people against hatred and violence and for unity and peace. The people of Guha village beckon us…….. Feroze Mithiborwalais a social activist **Share:** **Support Countercurrents** Countercurrents is answerable only to our readers. Support honest journalism because we have no PLANET B.Become a Patron atPatreon **Join Our Newsletter** GET COUNTERCURRENTS DAILY NEWSLETTER STRAIGHT TO YOUR INBOX **Join our WhatsApp and Telegram Channels** Get CounterCurrents updates on our WhatsApp and Telegram Channels **Feroze Mithiborwala** **Related Posts** **Now communal polarization for business : Even Sharbat is divided between Hindus and Muslims!** bySanjay Parate13/04/2025 Everyone knows about Ramdev's Sanghi leanings. Everyone knows that there is a corporate sitting inside his saffron robe. Ramdev is both an example of the Sangh-BJP's Hindutva and corporate alliance… **When will festivals stop being used for communal polarization?** byDr Suresh Khairnar01/04/2025 People of almost all religions of the world have been living in our country for thousands of years. And various festivals of all those religions have been celebrated for joy.… **The US-EU-NATO War on Russia, Using Ukraine as an instrument to balkanise Russia has failed** byFeroze Mithiborwala03/03/2025 We are witnessing the very end of the so-called Ruled Based Order, or rather the end of the Non-Rules Based Disorder. The Empire of Chaos and Wars is now facing… **Indian Politics: Towards communal consensus?** byDr Prem Singh07/02/2025 While outrightly opposing the hard-line Hindutva of the RSS/BJP, scholars of the secular camp refer to the soft Hindutva of secular parties, as if the use of soft Hindutva to… **After Gaza & Beirut, no one is safe anymore from Israeli-US Electronic Terrorism!** byFeroze Mithiborwala19/09/2024 They called us 'Conspiracy Theorists' when we said that Governments do infiltrate our phones, TVs & Laptops, spy on us & do far worse. Now in Lebanon, Israel has infiltrated… **Kanwar Yatra: Naming for mainstreaming identity based discrimination** byT Navin27/07/2024 Recently directives were passed to display names, addresses and mobile numbers of owners and staff in the Kanwar Yatra route in Uttar Pradesh and Uttarakhand. Kanwar yatra is an annual… **Join Our Newsletter** Get the latest CounterCurrents updates straight to your inbox. **Annual Subscription** Join Countercurrents Annual Fund Raising Campaign and help us **Latest News** 31 Starving People Killed in GHF Aid Distribution Point In GazabyCountercurrents Collective11/06/2025 byCountercurrents Collective byCountercurrents Collective 700 concerned citizens from India write to UK Government conveying concerns regarding Madleen activists and the ongoing genocide in PalestinebyConcerned Citizens11/06/2025 byConcerned Citizens byConcerned Citizens Israel Guilty of Extermination in Gaza, UN Report FindsbyQuds News Network11/06/2025 byQuds News Network byQuds News Network LA Protests Signal Public’s Readiness to Rebel Against Anti-Immigrant FascismbyChris Newman11/06/2025 byChris Newman byChris Newman Israel recruits local gangs and foreign mercenaries, turning aid distribution centres into mass slaughterhousebyEuro-Med Human Rights Monitor11/06/2025 byEuro-Med Human Rights Monitor byEuro-Med Human Rights Monitor Who Will Defend Our Oceans—the Last Global Commons?bySushma Raman and John Hocevar11/06/2025 bySushma Raman and John Hocevar bySushma Raman and John Hocevar This Is How Trump Kills US Democracy—With US Marines in the StreetbyThom Hartmann11/06/2025 byThom Hartmann byThom Hartmann The Last Days of GazabyChris Hedges11/06/2025 byChris Hedges byChris Hedges Women’s Struggle for Realizing Right to EmploymentbyBharat Dogra11/06/2025 byBharat Dogra byBharat Dogra Global Inaction on Gaza Genocide & Climate Genocide As Catastrophic Plus 2C LoomsbyDr Gideon Polya11/06/2025 byDr Gideon Polya byDr Gideon Polya When Media Tell Us Who ‘Won’ a Latin American Election, Start to Ask QuestionsbyJohn Perry11/06/2025 byJohn Perry byJohn Perry Freedom of Movement and Global Apartheid – The United States and IsraelbyAviva Chomsky11/06/2025 byAviva Chomsky byAviva Chomsky Extrajudicial Killings in Balochistan Demand Global AttentionbyAshish Singh11/06/2025 byAshish Singh byAshish Singh Demolition drives near the Chandola Lake areabyBhargav Oza11/06/2025 byBhargav Oza byBhargav Oza The Hood;A ReviewbyShafi Ahmad11/06/2025 byShafi Ahmad byShafi Ahmad Palestine Resistance in action in BrusselsbyRima Najjar10/06/2025 byRima Najjar byRima Najjar Catching Israel Out: Gaza and the Madleen “Selfie” ProtestbyDr Binoy Kampmark10/06/2025 byDr Binoy Kampmark byDr Binoy Kampmark 20 Starved Civilians Killed at ‘Aid Point’ as Massacres Continue in Israeli-US GHF OperationsbyQuds News Network10/06/2025 byQuds News Network byQuds News Network Withdraw Prohibitory Order and Stop all Repressive Measures – Stop Land Acquisition Process for Sijimali Bauxite ProjectbyConcerned Citizens10/06/2025 byConcerned Citizens byConcerned Citizens “Mass Death Traps and Human Slaughterhouses”: A Timeline of Israeli Attacks on Starving Civilians at US-Backed GHF Aid Sites in GazabyQuds News Network10/06/2025 byQuds News Network byQuds News Network American imperialism plays up the “Tibet card”, with Dalai Lama as its pawn, and harps on his “re-incarnation in free world”byRamakrishnan10/06/2025 byRamakrishnan byRamakrishnan Rituals of CapitalismbyBhabani Shankar Nayak10/06/2025 byBhabani Shankar Nayak byBhabani Shankar Nayak Why June 1 Attack on Russian Bombers has Raised Short and Long Term Concerns Regarding Dangerous Escalation of Serious RisksbyBharat Dogra10/06/2025 byBharat Dogra byBharat Dogra Military Training for Children! Why there is Not Much Scrutiny about this Latest Move by the Maharashtra GovernmentbySubhash Gatade10/06/2025 bySubhash Gatade bySubhash Gatade The Quiet Violence of LanguagebyDisha09/06/2025 byDisha byDisha The Resistance That Is RisingbyMichael Albert09/06/2025 byMichael Albert byMichael Albert Unabated Deaths of Manual Scavengers Demand Justice, Not SilencebyDalit Adivasi Shakti Adhikar Manch (DASAM)09/06/2025 byDalit Adivasi Shakti Adhikar Manch (DASAM) byDalit Adivasi Shakti Adhikar Manch (DASAM) Government should implement Buds Act 2019 in JharkhandbyVijay Singh09/06/2025 byVijay Singh byVijay Singh BJP’s moral decline in Mumbai led to suburban train deathsbyVidyadhar Date09/06/2025 byVidyadhar Date byVidyadhar Date Concerned with growing threat of nuclear threat, the WHO to review health impacts of nuclear warbyDr Arun Mitra09/06/2025 byDr Arun Mitra byDr Arun Mitra StarLink is likely to pose a serious security risk Preferably defer its operations in India Institute an independent judicial enquirybyE A S Sarma09/06/2025 byE A S Sarma byE A S Sarma Israeli Forces Seize Gaza-Bound Madleen Ship, Kidnap Activists On BoardbyQuds News Network09/06/2025 byQuds News Network byQuds News Network Appeal to Rashtrapati ji on advising the Parliament on Impeachment of Justice Shekhar Kumar Yadav to maintain the public credibility of our judicial systembyProf Jagdeep Chhokar and Dr E A S Sarma09/06/2025 byProf Jagdeep Chhokar and Dr E A S Sarma byProf Jagdeep Chhokar and Dr E A S Sarma Meet Gaza’s Youngest Fisherwoman, Madelene Kolab, Who Inspired a Humanitarian VoyagebyQuds News Network09/06/2025 byQuds News Network byQuds News Network How Should We Respond to Trump’s National Guard Deployment Against the People of LA?byRobert Reich09/06/2025 byRobert Reich byRobert Reich The Time Has Come to Establish the International Arctic Ocean SanctuarybyRick Steiner09/06/2025 byRick Steiner byRick Steiner Nuclear Winter or Climate-Change Summer, What a Choice!byNorman Solomon09/06/2025 byNorman Solomon byNorman Solomon Tesla Takedown Alive and Well, Just Ask ElonbyPhil Pasquini09/06/2025 byPhil Pasquini byPhil Pasquini Faltering Negotiations Point to the Need for a Wider, Stronger Paradigm for PeacebyBharat Dogra09/06/2025 byBharat Dogra byBharat Dogra Baloch Students Vanishing Under Drones of Silence-The Quiet Genocide of Baloch StudentsbyAshish Singh09/06/2025 byAshish Singh byAshish Singh **Editor’s Picks** Recipes for Revolution, Protein for Power, Meat for ChangebyCountercurrents Collective04/04/2025 byCountercurrents Collective byCountercurrents Collective The Plot Against AmericabyMike Brock21/02/2025 byMike Brock byMike Brock The Fuhrer Is HerebyBinu Mathew31/01/2025 byBinu Mathew byBinu Mathew **Tag** **Archives** June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 November 2015 Copyright © Countercurrents"}