{"id": 443, "name": "Feminist Frequency", "domain": "feministfrequency.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://feministfrequency.com/video/the-best-little-whorehouse-in-texas-featuring-tara-giancaspro-ffr-259/", "title": "The Best Little Whorehouse In Texas Featuring Tara Giancaspro Ffr 259", "content": "Facebook Twitter Tumblr Youtube Instagram Twitch Feminist Frequency Conversations with pop culture Videos Podcasts News Resources About **THE BEST LITTLE WHOREHOUSE IN TEXAS featuring TARA GIANCASPRO | FFR 259** Writer and musician Tara Giancaspro joins Kat and A.C. for a rootin’ tootin’ rip-roarin’ review of Colin Higgins’ 1982 movie musical THE BEST LITTLE WHOREHOUSE IN TEXAS. We get lost in the fun and charm of the music, dancing, and wigs! We delight in the beauty of Dolly Parton and Burt Reynolds! And we get caught up in a discussion of whether a movie like this could be made today, with its light-hearted treatment of sex workers being unfairly persecuted. Plus, an unhinged installment of the “what’s wrong with me” game returns, as we decide which famous men we’d let watch our drinks. Discussed in this episode:– Feminist Frequency Radio’s 2020 episode about 9 TO 5: https://feministfrequency.com/video/9-to-5-starring-dolly-parton-skewered-workplace-sexism-in-1980-how-does-it-hold-up-today-ffr-133– DC-based harm reduction organization HIPS: https://www.hips.orgFind Tara:– twitter.com/sweatylamarr– taragiancaspro.substack.com– sweatylamarrmusic.bandcamp.comFind Kat:– twitter.com/kat_ex_machina– letterboxd.com/katexmachinaFind AC:– instagram.com/aclamberty– letterboxd.com/aclambertyFind Us:– Join our Patreon: patreon.com/femfreq– Our Website: feministfrequency.com– Subscribe to FFR on Apple Podcasts: https://apple.co/2t4wu4I– Twitter: twitter.com/femfreq– Instagram: instagram.com/femfreq– NEW: Letterboxd: letterboxd.com/femfreq Anita Sarkeesian Executive Director and Buffy the Vampire Slayer Enthusiast VideoTropes vs Women in Video GamesOrdinary WomenThe FREQ ShowGood Tips for Hard TimesVideo Reviews Tropes vs Women in Video Games Ordinary Women The FREQ Show Good Tips for Hard Times Video Reviews Tropes vs Women in Video Games Ordinary Women The FREQ Show Good Tips for Hard Times Video Reviews NewsAnnouncementsFREQ NewsletterReviewsEvents Announcements FREQ Newsletter Reviews Events Announcements FREQ Newsletter Reviews Events ResourcesFeminism 101Recommended MediaDownloadable GuidesSpeak Up & Stay Safe(r)Crash Override Feminism 101 Recommended Media Downloadable Guides Speak Up & Stay Safe(r) Crash Override Feminism 101 Recommended Media Downloadable Guides Speak Up & Stay Safe(r) Crash Override AboutTeamPressContact Team Press Contact Team Press Contact Social Facebook Twitter Tumblr YouTube Instagram Twitch"}