{"id": 2200, "name": "Cracked", "domain": "cracked.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.cracked.com/article_46936_abbott-elementary-star-chris-perfetti-says-the-its-always-sunny-in-philadelphia-crossover-episode-is-obviously-the-r-rated-version.html", "title": "Article_46936_abbott Elementary Star Chris Perfetti Says The Its Always Sunny In Philadelphia Crossover Episode Is Obviously The R Rated Version.html", "content": "Trivia & Jokes Movies & TV Science & History Videos Newsletter My Account Search Trivia & Jokes Movies & TV Science & History Videos Newsletter **Miley Cyrus Says A Dirty Birthday Joke Got Her Fired From Adam Sandler's 'Hotel Transylvania'** **35 of the Funniest Tweets from Wednesday, June 11, 2025** **Glenn Howerton Ranks the Side Projects of the ‘It’s Always Sunny in Philadelphia’ Cast** **38 Random Bits of Trivia About Novels, Poems and Basically Anything Else That Someone Wrote and Printed** **Here’s How Adam Sandler Got Revenge on NBC After Getting Fired From ‘SNL’** **‘Abbott Elementary’ Star Chris Perfetti Says the ‘It’s Always Sunny in Philadelphia’ Crossover Episode Is ‘Obviously the R-Rated Version’** When the Paddy’s Pub Gang spent a week “volunteering” at Willard R. Abbott Elementary School, their antics weren’t all as kid-friendly as the first book Charlie Kelly ever read. On Wednesday, July 9th,It’s Always Sunny in Philadelphiawill return from its longest-ever hiatus with a Season 17 premiere that will feature the cast ofAbbott Elementaryin the much-anticipated, TV-MA conclusion to the crosstown crossover. Back in January, theAbbott Elementarymid-season premiere “Volunteers” first merged the two Philadelphian sitcom universes, and fans of both shows were pleasantly surprised by how The Gang managed to reign in their degeneracy just enough to appeal to ABC audiences without losing their edge. Well, whenIt’s Always Sunny in Philadelphiagets their turn with the crossover, no broadcast TV shushers will be able to censor the depravity that The Gang will unleash on the poor public school staffers. One such teacher,Abbott ElementarystarChris Perfetti,who plays Jacob Hill on the feel-good critical darling, recently spoke toColliderabout the crossover and promised that theAlways Sunnypremiere is “obviously the R-rated version of what happened.” **Don't Miss** **Here’s Why You’ve Never Seen the Original Open of ‘I Love Lucy’** **21 Movies That Turned Actors Into One-Hit Wonders** **15 Simplistic Myths About Exercise, Debunked** God willing, someone’s gonna hang dong. In “Volunteers,” Perfetti’s Jacob takes Charlie Kelly under his wing and quickly realizes that, despite his claims to the contrary, the Paddy’s Pub janitor is an adult illiterate. Jacob and his fellow teachers band together to help Charlie reach a kindergarten-level of reading comprehension before his court-ordered community service concludes. The school even honors Charlie with a graduation ceremony as he joins the hallowed ranks of children’s book readers. “I’m always surprised by how much pathos our show can hold. It’s obviously first and foremost a comedy, but I just really loved that moment,” Perfetti said of Charlie’s achievement in language studies. “I thought that because we were jamming with those guys that we were really going to milk as much comedy out of the episode as we could, but we still managed to make it moving and meaningful. I love that.” As for howIt's Always Sunny in Philadelphiawill re-tell the events of that fateful week from The Gang’s perspective, Perfetti can’t wait for us to see what’s in store. “That was such a gorgeous opportunity to show sides of these characters that we don’t get to show on ABC or on network TV,” Perfetti said of the freedom thatAlways Sunnyafforded theAbbottcast. “So I’m just thrilled about it. I love all of them so much, I’m such a big fan of the show that they’ve made and who they are individually. It was a dream come true.” Depending onwhat Dennis was doingwhile he was avoiding the diegetic camera crew, that dream may end up being a nightmare. **Tags:** News **Must Read** **Here’s What the Lucille Ball and Desi Arnaz Biopic Got Wrong, According to Their Daughter** **30 Wild Secrets People Have Been Keeping for Very A Long Time** **‘Sopranos’ Star Says Ellen DeGeneres Was ‘An A**hole From Way Back When’** **Did John Mulaney Lie About This Classic ‘SNL’ Moment?** **Bryan Cranston Wore the Creator of ‘Malcolm in the Middle’ Down Until He Agreed to Write a Reboot** **22 Unlikely Roles Where Actors Far Exceeded Expectations** **VIRAL ON CRACKED** **Mary Ann Didn’t Learn the Professor’s Secret Until the ‘Gilligan’s Island’ Star’s Funeral** **30 Wild Secrets People Have Been Keeping for Very A Long Time** **21 Movies That Turned Actors Into One-Hit Wonders** **25 Funny Stories About Office Suck-Ups** **29 Jokes and Quotes for the Joke and Quote Enthusiast** **A WEEKLYNEWSLETTER OFJOKES + TRIVIA**"}