{"id": 1133, "name": "Press Watch", "domain": "presswatchers.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://presswatchers.org/2025/02/the-white-house-press-corps-needs-to-prove-its-value-if-it-wants-people-to-care-about-its-fate/", "title": "The White House Press Corps Needs To Prove Its Value If It Wants People To Care About Its Fate", "content": "About this site Archives202420232022202120202019 2024 2023 2022 2021 2020 2019 2024 2023 2022 2021 2020 2019 TopicsFox News Is Not NewsDemocracy in DangerThe Biden PresidencyRewrite DeskObjectivityNew York TimesWashington PostFalse EquivalenceCampaign CoverageCovering RaceAnonymous SourcesTrump and the CoronavirusHorse-Race JournalismFighting DisinformationAdvocacy Fox News Is Not News Democracy in Danger The Biden Presidency Rewrite Desk Objectivity New York Times Washington Post False Equivalence Campaign Coverage Covering Race Anonymous Sources Trump and the Coronavirus Horse-Race Journalism Fighting Disinformation Advocacy Fox News Is Not News Democracy in Danger The Biden Presidency Rewrite Desk Objectivity New York Times Washington Post False Equivalence Campaign Coverage Covering Race Anonymous Sources Trump and the Coronavirus Horse-Race Journalism Fighting Disinformation Advocacy Donate/Contact About this site Archives202420232022202120202019 2024 2023 2022 2021 2020 2019 2024 2023 2022 2021 2020 2019 TopicsFox News Is Not NewsDemocracy in DangerThe Biden PresidencyRewrite DeskObjectivityNew York TimesWashington PostFalse EquivalenceCampaign CoverageCovering RaceAnonymous SourcesTrump and the CoronavirusHorse-Race JournalismFighting DisinformationAdvocacy Fox News Is Not News Democracy in Danger The Biden Presidency Rewrite Desk Objectivity New York Times Washington Post False Equivalence Campaign Coverage Covering Race Anonymous Sources Trump and the Coronavirus Horse-Race Journalism Fighting Disinformation Advocacy Fox News Is Not News Democracy in Danger The Biden Presidency Rewrite Desk Objectivity New York Times Washington Post False Equivalence Campaign Coverage Covering Race Anonymous Sources Trump and the Coronavirus Horse-Race Journalism Fighting Disinformation Advocacy Donate/Contact **The White House press corps needs to prove its value if it wants people to care about its fate** The White House press corps is justifiably outraged by Donald Trump’s decision to start picking which reporters are allowed to follow him around and ask him questions. In a free country, presidents should not get to choose who covers them. But if members of the traditional, independent White House press corps want the public to share their outrage, they need to do a much better job of proving their value. And in this administration, the value of an independent press corps to the public is simple: Journalists are the only people with access to Trump who can conceivably confront him about his lies. **Some Background** The press “pool” is the small group of journalists who have access to the president when space is limited – for instance in the Oval Office, or at cabinet meetings, or on Air Force One. This is particularly significant with Trump, because those are the places where he tends to be particularly loquacious. Historically, the pool has been overseen by the independent White House Correspondents Association (WHCA), and comprised of the wire services (AP, Reuters and Bloomberg) along with a rotating cast of reporters and photographers from reputable, non-partisan news organizations. The first shock to the system came two weeks ago, when the White Housebanned the Associated Pressfrom limited press availabilities, as punishment for the AP’sdecisionto continue calling the Gulf of Mexico by its true name, rather than the one Trump made up. But now Trump’s staff has seized control of the pool entirely from the WHCA. “Moving forward, the White House press pool will be determined by the White House press team,” White House press secretary Karoline Leavittannounced on Tuesday. “Legacy media outlets who have been here for years will still participate in the pool, but new voices are going to be welcomed in as well.” On Wednesday, for instance, the White House added right-wing platforms Newsmax and Blaze Media to the pool, while striking Reuters, the Associated Press, and HuffPost from the WHCA’s list. As New York Times reporter Peter Baker wrote onTwitter: “The message is clear. Given that the White House has already kicked one news organization out of the pool because of coverage it does not like, it is making certain everyone else knows that the rest of us can be barred too if the president does not like our questions or stories.” **What the Pool Needs to Do** Rather than succumb to the threats, members of the press corps should take them as a dare. They should redevote themselves to their mission. And that mission is, in part, to disrupt Trump’s bubble. All presidents operate in a bubble, but none as much as Trump. In his second term, he is entirely surrounded by sycophants and lickspittles, with no pushback of any kind no matter how unhinged he gets. The only exception to that rule is the press pool. That gives it an enormous responsibility to inject reality into a system that otherwise rejects it. So far, its members have largely failed to do that. Listen to Trump’s press availabilities and most of the questions the press corps asks are invitations for him to free-associate, without any follow-up when he lies. But when someone lies all the time, like Trump does, there is no value in asking him questions that simply encourage him to lie more. So the press corps needs to rise to the occasion and confront his lies with the truth. That means asking questions like: You recently said that Ukraine “should never have started” the war with Russia. How can you possibly say that? It’s a fact that Russia invaded Ukraine, not the other way around. Why do you insist that foreign nations pay tariffs when it’s simply not true? That’s not how tariffs work. Domestic importers pay the tariffs – and typically pass along the added costs to American consumers. Do you not understand that? Why do you repeatedly state that the U.S. ranks dead last — 40th out of 40 countries — in international education rankings. There is no ranking that says any such thing. You are just making that up. Why do you claim that 300,000 Americans die annually from fentanyl overdoses, when the actual number is closer to 60,000? You are just making that number up. Why do you say we’re the only country that allows mail-in voting, when that’s simply not true? There are at least 34 other countries that allow it, too. Why do you pretend otherwise? You continue to assert that the 2020 election that you lost was rigged. There are mountains of evidence to the contrary, and zero evidence to support your claim. You must know this by now. Why should the American public believe anything you say when you continue to lie about this? Sadly, just as there is no end to his lying, there is no end to these questions. And the press corps should also ask tough questions about what he is actually doing. Here are just a few off the top of my head: How does the wholesale firing of probationary employees make any sense at all? What does it accomplish? It seems cruel and shortsighted. It doesn’t save much money. What’s the point? How can you possibly justify cancelling programs that serve millions of people with H.I.V., or control malaria, or help wipe out polio? What do you say to veterans who are being fired on orders of Elon Musk? What purpose is served by firing National Park and National Forest workers? Do you really think there are too many? How can you possibly consider dramatically reducing the workforce at the Social Security Administration? Won’t that inevitably result in massive delays in claims processing? Through funding freezes and mass firings you have severely undermined the nation’s ability to detect, contain, and respond to emerging infectious diseases. Do you realize how severe the consequences of that might be? You are gutting offices that enforce civil rights and antidiscrimination laws. Are you basically saying it’s OK to discriminate against people based on such things as disability and race? If not, who will enforce those rules now? So far, your administration is deporting undocumented immigrants at a slower rate than Biden did in his last year in office, largely because ICE is focusing on those with criminal records. Are you planning to order ICE to start conducting indiscriminate raids and sweeps in order to increase the numbers? Is that morally justifiable? Look, access is overrated — especially when all that access gets you is lies. The best journalism about the White House doesn’t come from what officials tell you publicly, but from what reporters dig up that those officials don’t want you to know. Nevertheless, it’s important for someone to stand up and confront Trump’s endless lies. And the only people who can do that are the members of the press pool. **Journalists are aiding and abetting Trump’s incitement in LA** **Mainstream media inches closer to addressing Trump’s racism** **The truth about Donald Trump rarely makes it into the news** **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. Journalists are aiding and abetting Trump’s incitement in LA Mainstream media inches closer to addressing Trump’s racism The truth about Donald Trump rarely makes it into the news We need a way to aggregate what Donald Trump is doing to this country Trump’s ludicrous tattoo tirade ought to raise a lot of questions The pushback Trump should have gotten from Time The Trump regime should be covered as a criminal enterprise Mainstream media falls for Trump’s insane ‘reciprocal’ tariff talk Media ignores a big way to slow Trump: Flipping 3 House Republicans Press coverage of Trump’s tariffs understates the insanity The White House press corps needs to prove its value if it wants people to care about its fate How the White House press corps should respond to the banning of the Associated Press Journalists are aiding and abetting Trump’s incitement in LA Mainstream media inches closer to addressing Trump’s racism The truth about Donald Trump rarely makes it into the news We need a way to aggregate what Donald Trump is doing to this country Trump’s ludicrous tattoo tirade ought to raise a lot of questions The pushback Trump should have gotten from Time The Trump regime should be covered as a criminal enterprise Mainstream media falls for Trump’s insane ‘reciprocal’ tariff talk Media ignores a big way to slow Trump: Flipping 3 House Republicans Press coverage of Trump’s tariffs understates the insanity The White House press corps needs to prove its value if it wants people to care about its fate How the White House press corps should respond to the banning of the Associated Press"}