{"id": 631, "name": "Health Feedback", "domain": "healthfeedback.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://healthfeedback.org/evaluation/washington-times-article-by-robert-malone-and-peter-navarro-relies-on-inaccurate-and-unsubstantiated-claims-about-virus-evolution-vaccine-immunity-and-covid-19-vaccine-safety/", "title": "Washington Times Article By Robert Malone And Peter Navarro Relies On Inaccurate And Unsubstantiated Claims About Virus Evolution Vaccine Immunity And Covid 19 Vaccine Safety", "content": "Article Reviews Claim Reviews Insights Support us **.** **Washington Times article by Robert Malone and Peter Navarro relies on inaccurate and unsubstantiated claims about virus evolution, vaccine immunity, and COVID-19 vaccine safety** Analysis of \"Biden team’s misguided and deadly COVID-19 vaccine strategy\"Published inWashington Times, byPeter Navarro,Robert Maloneon5 Aug. 2021 Three scientists analyzed the article and estimate its overall scientific credibility to be low.more about the credibility ratingA majority of reviewers tagged the article as:Biased,Flawed reasoning,Inaccurate,Misleading. SCIENTISTS’ FEEDBACKSUMMARY:ThisWashington Timesopinion piece, published on 5 August 2021, made multiple claims about the evolution of virus variants, immune escape, as well as COVID-19 vaccine safety. Authored by Robert Malone, a scientist who formerly worked at the Salk Institute in the field of molecular biology, and Peter Navarro, an economist who served as the Director of the White House National Trade Council during the Trump administration, the opinion piece received more than 12,000 engagements on Facebook, including more than 4,800 shares, according to CrowdTangle, a social media analytics tool. The article also received some user engagements on Twitter and Reddit.Malone and Navarro claimed that universal vaccination was based on four “flawed assumptions”, namely that: 1) universal vaccination can eradicate the virus, 2) the COVID-19 vaccines are highly effective, 3) the COVID-19 vaccines are safe and 4) vaccine-mediated immunity is durable.The key argument made by Malone and Navarro as to the imprudence of a universal vaccination strategy—in fact pursued by many other countries besides the U.S., despite the article’s headline—is that this would create an evolutionary “arms race”, leading to the accelerated generation of vaccine-resistant variants.[Editor’s note: Navarro went on to repeat the same claims ina Newsmax articlepublished in November 2021.]Experts who reviewed the opinion piece found it to be inaccurate and misleading. They explained that Malone and Navarro’s assertions of “flawed assumptions” about universal vaccination were themselves wrong.[See scientists’ full comments.]Angéline Rouers, an immunologist and research fellow at the Infectious Diseases Labs of the Agency for Science, Technology and Research in Singapore, told Health Feedback that the argument by Malone and Navrro isn’t grounded in scientific evidence. It is not widespread vaccination that promotes mutations and leads to “exposure to more and more risk”, she said. “On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates, not because of vaccination but because it is a virus, and every virus in the world can mutate.”Emma Hodcroft, a postdoctoral researcher at the University of Bern and co-developer ofNextstrain, a project which tracks the evolution of viruses including SARS-CoV-2, highlighted the fallacy of the argument.“Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can,” she explained. “It’s not just vaccine immunity which provides this selection pressure: immunity from infection does as well.”Indeed, of thefour existing variants of concernto date, all four emerged in 2020, long before the start of public vaccination campaigns. In particular, the Delta variant, which has been making headlines around the world, was first detected in October 2020. This observation demonstrates that halting vaccination efforts won’t stop the emergence of virus variants—after all, variants are entirely capable of emerging in the absence of vaccination.In addition, Malone and Navarro misleadingly cited the risk of side effects from the COVID-19 vaccines as a reason why universal vaccination wasn’t optimal.Dale Fisher, a professor of medicine at the National University of Singapore who specializes in infectious diseases, refuted this notion. “It is very clear that the risks of vaccination are much lower than the risks of COVID-19,” he said. “The article’s discussion surrounding virologists’ fears, unreferenced or substantiated, likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely.”Fisher also found Malone and Navarro’s claim regarding the “decided lack of durability” of vaccine-mediated immunity to be unsubstantiated. Similarly, Rouers also pointed out that the article failed to provide any evidence or sources to support any of its claims. She found the article’s suggestion that the “far more optimal strategy is to vaccinate only the most vulnerable” to be “nonsense”.Some of those athigh risk from COVID-19, like people with weakened immune systems, such as cancer patients and organ transplant recipients, “cannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them (i.e.herd immunity),” she said.All three reviewers agreed that variants with immune escape abilities would always remain a possibility, with or without vaccines. “No matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure,” Hodcroft said.Scientists are well aware of this possibility and the dangers this poses, and measures are in place to mitigate the harm this can cause. Fisher citedgenetic surveillance effortsas a top priority globally to observe for the emergence of escape mutants, which future versions of COVID-19 vaccines may need to cater for.But even if the evolution of immune escape remains a concern with or without vaccines, how we choose to confront this problem will lead to significantly different outcomes for public health and the virus’ ability to outsmart the immune system, Hodcroft pointed out.There’s no doubt that high population immunity can be achieved through infection, but this goes hand in hand with needless suffering and death that vaccination would prevent. It would also offer the virus much more opportunities to acquire mutations.On the other hand, vaccination gives us an edge in the game, by reducing transmission rates while achieving a high level of population immunity. By reducing transmission and in turn infection, we deprive the virus of opportunities to acquire new mutations that make it more dangerous or transmissible.You can read the originalWashington Timesarticle here.SCIENTISTS’ OVERALL FEEDBACK:Emma Hodcroft, Postdoctoral Researcher, University of Basel:I will comment primarily on the claims about evolution and mutation in the context of vaccination or widespread infection. I’m not a medical doctor, and so even though their claims about vaccine harms and drugs like ivermectin and hydroxychloroquine aren’t consistent with the published literature and reports by governments, I will not comment on this.Viruses are some of the fastest-evolving pathogens we know, which is part of what makes them so tricky. For instance, the human immunodeficiency virus (HIV) evolves so quickly that our immune systems can’t keep up with “recognizing” it. That’s part of why it’s a chronic—and if untreated, fatal—disease.For most human viruses we encounter, however, the outcome is much less grim. Our bodies learn to recognise it, which protects us from infection and/or serious outcomes when we meet it again in the future. However, for many viruses this is a dance we participate in for the rest of our lives—though we learn to recognise what infects us, the virus will change, and we may not recognise it as well next time. In some cases, we may remain protected for the rest of our non-frail lives from serious outcomes, but not from infection itself, with or without mild symptoms.Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes.We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does (“ever more powerful vaccines will have to be developed”), that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently.But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape.Thus no matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure, whether through most of the population being infected eventually—and with more transmissible variants like Delta as well as reopening, we can see this future clearly in the huge waves in areas with low vaccination rates—through vaccine-mediated immunity, or through a combination of both.What’s key is that there’s a huge difference in how you reach these two goals. The risks of vaccination are incredibly low, particularly for the mRNA vaccines, and means we can keep the transmission rates of the virus low *while* getting high population immunity. On the other hand, we know that SARS-CoV-2 has very real risks for many people in our population. Even for age groups where the risk is relatively low, if you infect millions of people, you will see bad outcomes. Allowing the entire population to be infected—even excluding the most vulnerable—will cause a lot of hospitalizations, deaths, and suffering along the way, which is entirely preventable through vaccination.Finally, population-level immunity achieved through infection requires, by definition, high levels of virus transmission. This provides the most opportunity for the virus to find itself in people with the imperfect immunity where immune-avoiding mutations could be selected. On the other hand, vaccine-mediated immunity could be achieved with zero virus circulating. While that extreme may not be realistic, we can achieve it while keeping virus levels very low, minimizing the chance that the virus has to have these mutations selected for.While it’s true that except for eliminating SARS-CoV-2 entirely, we cannot entirely stop the virus from developing escape mutations, we can make this much harder. Even when vaccine-mediated immunity is imperfect, evidence suggests it makes it harder to be infected and harder to transmit—these are opportunities we take away from the virus. Further, it may be that those who may be vaccinated & infected may be able to eliminate the virus faster from the body, or have fewer viruses circulating while infected—all of which remove more opportunities for dangerous mutation.In short, there is no future in which we won’t have to potentially face mutations that escape immunity to some degree. However, the future that is much less risky is reached by minimizing the chance of these mutations and minimizing the risk by which we achieve population-level immunity, and that’s through vaccination.Finally, to address this quote: “The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.” In fact, there is no clear historical tendency. Is HIV less fatal? Influenza?The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host.Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%.Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected).Exposure at different ages also makes a difference. As we see with SARS-CoV-2, young children seem at relatively little risk. If everyone was exposed as a child (as they are to many, many other viruses, like influenza and seasonal coronaviruses), the virus may be inconsequential for almost the rest of their lives (old age seems to make people more vulnerable to respiratory viruses). But this is through early exposure and immunity (and possibly repeated exposure), not through the virus becoming less virulent.Dale Fisher, Professor (Department of Medicine), National University of Singapore:This article has inaccuracies throughout with a clear view to push an anti-vaccine agenda. The picture depicting a skull with eyes and nose made of coronaviruses in the shape of the U.S. is sensationalist. The opening line calls it Biden’s strategy. It was also Trump’s and is the strategy of every country and the WHO.Flawed assumption #1 in the article is wrong. No one believes the virus will be eradicated. It’s also not about herd immunity. It’s about turning this into a mild illness and reducing transmission.Flawed assumption #2 stemming from the first: No one believes it’s perfect. We know transmission continues. Everything else is true and this is built into the strategies.Flawed assumption #3: Again, no one denies the risk of side effects. Indeed the scientific community and national authorities globally have been clear in discussing thrombotic, cardiomyopathic, and anaphylactic risks. It is very clear that the risks of vaccination are much lower than the risks of COVID-19. The article’s discussion surrounding virologists’ fears (unreferenced or substantiated) likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely.Flawed assumption #4: There is no good evidence yet that the lack of durability exists. If it is true, we may find that some vaccines are more durable than others and even future generations of vaccines could be better. No one is saying we don’t have more to learn and that R&D has stopped. It is true however that boosters may be necessary.It is theoretically possible that variants could escape vaccine-related immunity, but all the variants of concern to date have shown increased transmissibility, and in some cases, immune escape in the absence of vaccines. The rest of the conjecture is just that: conjecture. Genetic surveillance has a high priority globally to observe for the emergence of escape mutants, and yes, future versions of the vaccine may need to cater for these. Malone and Navarro’s list of “numerous other useful treatments” is not consistent with the findings of most clinical trials and is not standard practice.Angéline Rouers, Senior Research Fellow, A*STAR Infectious Diseases Labs:The article does not mention any source to support the claims. The only reference at the end is the fact that one author was the “discoverer of the mRNA vaccine” (which isan exaggerated claim) and that the other served in the White House as the Defense Production Act Policy Coordinator during the Trump administration. Neither of these statements offer support for the scientific claims they make in the article. To clarify the main claims and put the things at the right place:About assumption 1 in the article: There is a confusion about the relationship between vaccination and mutations. The massive vaccination of the population doesn’t promote mutations and lead to “exposure to more and more risk”. On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates not because of vaccination but because it is a virus, and every virus in the world can mutate.Some of the mutations make the virus stronger and sometimes more transmissible. Some vaccines may become useless against certain variants but for now—even if it is demonstrated that there is a reduction in neutralizing activity against the variants—vaccines are still effective. But if not enough people are vaccinated, the variants will continue to emerge. The massive immunisation—through vaccination—will stop the variant race, not elicit it!About assumption 2 in the article: All vaccines come with side effects. There is always the risk-benefit balance to take into account. In the context of COVID-19 vaccines, the eventual side effects observed remain very rare and don’t reach an abnormal rate that justifies halting their use. Adverse events such as the disruption of women’s menstrual cycle have been rarely observed, and up until now, not shown to be causally linked to vaccination. However, when these observations are made, scientists are encouraged to investigate more in detail to rule out all possible links.It is true that certain kinds of vaccines can lead to unexpected reactions depending on the medical history of the individual. That’s why this history or current health condition of the subject, such as pregnancy, is always taken into account when deciding which vaccine to give. Allergic reactions are recognized as a possible side effect, but people are closely monitored for this reaction after vaccination.About assumption 3 in the article: Vaccination of the most vulnerable only sounds like a nonsense strategy. Some of themcannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them. That’s the principle of herd immunity.ANNOTATIONSThe statements quoted below are from the article; comments are from the reviewers (and are lightly edited for clarity).“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get, the less durable the vaccines will become, ever more powerful vaccines will have to be developed, and individuals will be exposed to more and more risk.”Emma Hodcroft, Postdoctoral Researcher, University of Basel:Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes. We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does, that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently.But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape.“The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.“Emma Hodcroft, Postdoctoral Researcher, University of Basel:In fact, there is no clear historical tendency. Is HIV less fatal? Influenza?The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host.Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%.Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected). **SCIENTISTS’ FEEDBACK** ThisWashington Timesopinion piece, published on 5 August 2021, made multiple claims about the evolution of virus variants, immune escape, as well as COVID-19 vaccine safety. Authored by Robert Malone, a scientist who formerly worked at the Salk Institute in the field of molecular biology, and Peter Navarro, an economist who served as the Director of the White House National Trade Council during the Trump administration, the opinion piece received more than 12,000 engagements on Facebook, including more than 4,800 shares, according to CrowdTangle, a social media analytics tool. The article also received some user engagements on Twitter and Reddit. Malone and Navarro claimed that universal vaccination was based on four “flawed assumptions”, namely that: 1) universal vaccination can eradicate the virus, 2) the COVID-19 vaccines are highly effective, 3) the COVID-19 vaccines are safe and 4) vaccine-mediated immunity is durable. The key argument made by Malone and Navarro as to the imprudence of a universal vaccination strategy—in fact pursued by many other countries besides the U.S., despite the article’s headline—is that this would create an evolutionary “arms race”, leading to the accelerated generation of vaccine-resistant variants.[Editor’s note: Navarro went on to repeat the same claims ina Newsmax articlepublished in November 2021.] Experts who reviewed the opinion piece found it to be inaccurate and misleading. They explained that Malone and Navarro’s assertions of “flawed assumptions” about universal vaccination were themselves wrong.[See scientists’ full comments.] Angéline Rouers, an immunologist and research fellow at the Infectious Diseases Labs of the Agency for Science, Technology and Research in Singapore, told Health Feedback that the argument by Malone and Navrro isn’t grounded in scientific evidence. It is not widespread vaccination that promotes mutations and leads to “exposure to more and more risk”, she said. “On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates, not because of vaccination but because it is a virus, and every virus in the world can mutate.” Emma Hodcroft, a postdoctoral researcher at the University of Bern and co-developer ofNextstrain, a project which tracks the evolution of viruses including SARS-CoV-2, highlighted the fallacy of the argument. “Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can,” she explained. “It’s not just vaccine immunity which provides this selection pressure: immunity from infection does as well.” Indeed, of thefour existing variants of concernto date, all four emerged in 2020, long before the start of public vaccination campaigns. In particular, the Delta variant, which has been making headlines around the world, was first detected in October 2020. This observation demonstrates that halting vaccination efforts won’t stop the emergence of virus variants—after all, variants are entirely capable of emerging in the absence of vaccination. In addition, Malone and Navarro misleadingly cited the risk of side effects from the COVID-19 vaccines as a reason why universal vaccination wasn’t optimal.Dale Fisher, a professor of medicine at the National University of Singapore who specializes in infectious diseases, refuted this notion. “It is very clear that the risks of vaccination are much lower than the risks of COVID-19,” he said. “The article’s discussion surrounding virologists’ fears, unreferenced or substantiated, likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely.” Fisher also found Malone and Navarro’s claim regarding the “decided lack of durability” of vaccine-mediated immunity to be unsubstantiated. Similarly, Rouers also pointed out that the article failed to provide any evidence or sources to support any of its claims. She found the article’s suggestion that the “far more optimal strategy is to vaccinate only the most vulnerable” to be “nonsense”. Some of those athigh risk from COVID-19, like people with weakened immune systems, such as cancer patients and organ transplant recipients, “cannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them (i.e.herd immunity),” she said. All three reviewers agreed that variants with immune escape abilities would always remain a possibility, with or without vaccines. “No matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure,” Hodcroft said. Scientists are well aware of this possibility and the dangers this poses, and measures are in place to mitigate the harm this can cause. Fisher citedgenetic surveillance effortsas a top priority globally to observe for the emergence of escape mutants, which future versions of COVID-19 vaccines may need to cater for. But even if the evolution of immune escape remains a concern with or without vaccines, how we choose to confront this problem will lead to significantly different outcomes for public health and the virus’ ability to outsmart the immune system, Hodcroft pointed out. There’s no doubt that high population immunity can be achieved through infection, but this goes hand in hand with needless suffering and death that vaccination would prevent. It would also offer the virus much more opportunities to acquire mutations. On the other hand, vaccination gives us an edge in the game, by reducing transmission rates while achieving a high level of population immunity. By reducing transmission and in turn infection, we deprive the virus of opportunities to acquire new mutations that make it more dangerous or transmissible. You can read the originalWashington Timesarticle here. Emma Hodcroft, Postdoctoral Researcher, University of Basel:I will comment primarily on the claims about evolution and mutation in the context of vaccination or widespread infection. I’m not a medical doctor, and so even though their claims about vaccine harms and drugs like ivermectin and hydroxychloroquine aren’t consistent with the published literature and reports by governments, I will not comment on this. Viruses are some of the fastest-evolving pathogens we know, which is part of what makes them so tricky. For instance, the human immunodeficiency virus (HIV) evolves so quickly that our immune systems can’t keep up with “recognizing” it. That’s part of why it’s a chronic—and if untreated, fatal—disease. For most human viruses we encounter, however, the outcome is much less grim. Our bodies learn to recognise it, which protects us from infection and/or serious outcomes when we meet it again in the future. However, for many viruses this is a dance we participate in for the rest of our lives—though we learn to recognise what infects us, the virus will change, and we may not recognise it as well next time. In some cases, we may remain protected for the rest of our non-frail lives from serious outcomes, but not from infection itself, with or without mild symptoms. Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes. We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does (“ever more powerful vaccines will have to be developed”), that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently. But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape. Thus no matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure, whether through most of the population being infected eventually—and with more transmissible variants like Delta as well as reopening, we can see this future clearly in the huge waves in areas with low vaccination rates—through vaccine-mediated immunity, or through a combination of both. What’s key is that there’s a huge difference in how you reach these two goals. The risks of vaccination are incredibly low, particularly for the mRNA vaccines, and means we can keep the transmission rates of the virus low *while* getting high population immunity. On the other hand, we know that SARS-CoV-2 has very real risks for many people in our population. Even for age groups where the risk is relatively low, if you infect millions of people, you will see bad outcomes. Allowing the entire population to be infected—even excluding the most vulnerable—will cause a lot of hospitalizations, deaths, and suffering along the way, which is entirely preventable through vaccination. Finally, population-level immunity achieved through infection requires, by definition, high levels of virus transmission. This provides the most opportunity for the virus to find itself in people with the imperfect immunity where immune-avoiding mutations could be selected. On the other hand, vaccine-mediated immunity could be achieved with zero virus circulating. While that extreme may not be realistic, we can achieve it while keeping virus levels very low, minimizing the chance that the virus has to have these mutations selected for. While it’s true that except for eliminating SARS-CoV-2 entirely, we cannot entirely stop the virus from developing escape mutations, we can make this much harder. Even when vaccine-mediated immunity is imperfect, evidence suggests it makes it harder to be infected and harder to transmit—these are opportunities we take away from the virus. Further, it may be that those who may be vaccinated & infected may be able to eliminate the virus faster from the body, or have fewer viruses circulating while infected—all of which remove more opportunities for dangerous mutation. In short, there is no future in which we won’t have to potentially face mutations that escape immunity to some degree. However, the future that is much less risky is reached by minimizing the chance of these mutations and minimizing the risk by which we achieve population-level immunity, and that’s through vaccination. Finally, to address this quote: “The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.” In fact, there is no clear historical tendency. Is HIV less fatal? Influenza? The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host. Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%. Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected). Exposure at different ages also makes a difference. As we see with SARS-CoV-2, young children seem at relatively little risk. If everyone was exposed as a child (as they are to many, many other viruses, like influenza and seasonal coronaviruses), the virus may be inconsequential for almost the rest of their lives (old age seems to make people more vulnerable to respiratory viruses). But this is through early exposure and immunity (and possibly repeated exposure), not through the virus becoming less virulent. Dale Fisher, Professor (Department of Medicine), National University of Singapore:This article has inaccuracies throughout with a clear view to push an anti-vaccine agenda. The picture depicting a skull with eyes and nose made of coronaviruses in the shape of the U.S. is sensationalist. The opening line calls it Biden’s strategy. It was also Trump’s and is the strategy of every country and the WHO. Flawed assumption #1 in the article is wrong. No one believes the virus will be eradicated. It’s also not about herd immunity. It’s about turning this into a mild illness and reducing transmission. Flawed assumption #2 stemming from the first: No one believes it’s perfect. We know transmission continues. Everything else is true and this is built into the strategies. Flawed assumption #3: Again, no one denies the risk of side effects. Indeed the scientific community and national authorities globally have been clear in discussing thrombotic, cardiomyopathic, and anaphylactic risks. It is very clear that the risks of vaccination are much lower than the risks of COVID-19. The article’s discussion surrounding virologists’ fears (unreferenced or substantiated) likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely. Flawed assumption #4: There is no good evidence yet that the lack of durability exists. If it is true, we may find that some vaccines are more durable than others and even future generations of vaccines could be better. No one is saying we don’t have more to learn and that R&D has stopped. It is true however that boosters may be necessary. It is theoretically possible that variants could escape vaccine-related immunity, but all the variants of concern to date have shown increased transmissibility, and in some cases, immune escape in the absence of vaccines. The rest of the conjecture is just that: conjecture. Genetic surveillance has a high priority globally to observe for the emergence of escape mutants, and yes, future versions of the vaccine may need to cater for these. Malone and Navarro’s list of “numerous other useful treatments” is not consistent with the findings of most clinical trials and is not standard practice. Angéline Rouers, Senior Research Fellow, A*STAR Infectious Diseases Labs:The article does not mention any source to support the claims. The only reference at the end is the fact that one author was the “discoverer of the mRNA vaccine” (which isan exaggerated claim) and that the other served in the White House as the Defense Production Act Policy Coordinator during the Trump administration. Neither of these statements offer support for the scientific claims they make in the article. To clarify the main claims and put the things at the right place: About assumption 1 in the article: There is a confusion about the relationship between vaccination and mutations. The massive vaccination of the population doesn’t promote mutations and lead to “exposure to more and more risk”. On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates not because of vaccination but because it is a virus, and every virus in the world can mutate. Some of the mutations make the virus stronger and sometimes more transmissible. Some vaccines may become useless against certain variants but for now—even if it is demonstrated that there is a reduction in neutralizing activity against the variants—vaccines are still effective. But if not enough people are vaccinated, the variants will continue to emerge. The massive immunisation—through vaccination—will stop the variant race, not elicit it! About assumption 2 in the article: All vaccines come with side effects. There is always the risk-benefit balance to take into account. In the context of COVID-19 vaccines, the eventual side effects observed remain very rare and don’t reach an abnormal rate that justifies halting their use. Adverse events such as the disruption of women’s menstrual cycle have been rarely observed, and up until now, not shown to be causally linked to vaccination. However, when these observations are made, scientists are encouraged to investigate more in detail to rule out all possible links. It is true that certain kinds of vaccines can lead to unexpected reactions depending on the medical history of the individual. That’s why this history or current health condition of the subject, such as pregnancy, is always taken into account when deciding which vaccine to give. Allergic reactions are recognized as a possible side effect, but people are closely monitored for this reaction after vaccination. About assumption 3 in the article: Vaccination of the most vulnerable only sounds like a nonsense strategy. Some of themcannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them. That’s the principle of herd immunity. **ANNOTATIONS** “The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get, the less durable the vaccines will become, ever more powerful vaccines will have to be developed, and individuals will be exposed to more and more risk.” Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes. We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does, that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently. But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape. “The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.“ In fact, there is no clear historical tendency. Is HIV less fatal? Influenza? The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host. Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%. Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected). **SCIENTISTS’ FEEDBACK** ThisWashington Timesopinion piece, published on 5 August 2021, made multiple claims about the evolution of virus variants, immune escape, as well as COVID-19 vaccine safety. Authored by Robert Malone, a scientist who formerly worked at the Salk Institute in the field of molecular biology, and Peter Navarro, an economist who served as the Director of the White House National Trade Council during the Trump administration, the opinion piece received more than 12,000 engagements on Facebook, including more than 4,800 shares, according to CrowdTangle, a social media analytics tool. The article also received some user engagements on Twitter and Reddit. Malone and Navarro claimed that universal vaccination was based on four “flawed assumptions”, namely that: 1) universal vaccination can eradicate the virus, 2) the COVID-19 vaccines are highly effective, 3) the COVID-19 vaccines are safe and 4) vaccine-mediated immunity is durable. The key argument made by Malone and Navarro as to the imprudence of a universal vaccination strategy—in fact pursued by many other countries besides the U.S., despite the article’s headline—is that this would create an evolutionary “arms race”, leading to the accelerated generation of vaccine-resistant variants.[Editor’s note: Navarro went on to repeat the same claims ina Newsmax articlepublished in November 2021.] Experts who reviewed the opinion piece found it to be inaccurate and misleading. They explained that Malone and Navarro’s assertions of “flawed assumptions” about universal vaccination were themselves wrong.[See scientists’ full comments.] Angéline Rouers, an immunologist and research fellow at the Infectious Diseases Labs of the Agency for Science, Technology and Research in Singapore, told Health Feedback that the argument by Malone and Navrro isn’t grounded in scientific evidence. It is not widespread vaccination that promotes mutations and leads to “exposure to more and more risk”, she said. “On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates, not because of vaccination but because it is a virus, and every virus in the world can mutate.” Emma Hodcroft, a postdoctoral researcher at the University of Bern and co-developer ofNextstrain, a project which tracks the evolution of viruses including SARS-CoV-2, highlighted the fallacy of the argument. “Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can,” she explained. “It’s not just vaccine immunity which provides this selection pressure: immunity from infection does as well.” Indeed, of thefour existing variants of concernto date, all four emerged in 2020, long before the start of public vaccination campaigns. In particular, the Delta variant, which has been making headlines around the world, was first detected in October 2020. This observation demonstrates that halting vaccination efforts won’t stop the emergence of virus variants—after all, variants are entirely capable of emerging in the absence of vaccination. In addition, Malone and Navarro misleadingly cited the risk of side effects from the COVID-19 vaccines as a reason why universal vaccination wasn’t optimal.Dale Fisher, a professor of medicine at the National University of Singapore who specializes in infectious diseases, refuted this notion. “It is very clear that the risks of vaccination are much lower than the risks of COVID-19,” he said. “The article’s discussion surrounding virologists’ fears, unreferenced or substantiated, likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely.” Fisher also found Malone and Navarro’s claim regarding the “decided lack of durability” of vaccine-mediated immunity to be unsubstantiated. Similarly, Rouers also pointed out that the article failed to provide any evidence or sources to support any of its claims. She found the article’s suggestion that the “far more optimal strategy is to vaccinate only the most vulnerable” to be “nonsense”. Some of those athigh risk from COVID-19, like people with weakened immune systems, such as cancer patients and organ transplant recipients, “cannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them (i.e.herd immunity),” she said. All three reviewers agreed that variants with immune escape abilities would always remain a possibility, with or without vaccines. “No matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure,” Hodcroft said. Scientists are well aware of this possibility and the dangers this poses, and measures are in place to mitigate the harm this can cause. Fisher citedgenetic surveillance effortsas a top priority globally to observe for the emergence of escape mutants, which future versions of COVID-19 vaccines may need to cater for. But even if the evolution of immune escape remains a concern with or without vaccines, how we choose to confront this problem will lead to significantly different outcomes for public health and the virus’ ability to outsmart the immune system, Hodcroft pointed out. There’s no doubt that high population immunity can be achieved through infection, but this goes hand in hand with needless suffering and death that vaccination would prevent. It would also offer the virus much more opportunities to acquire mutations. On the other hand, vaccination gives us an edge in the game, by reducing transmission rates while achieving a high level of population immunity. By reducing transmission and in turn infection, we deprive the virus of opportunities to acquire new mutations that make it more dangerous or transmissible. You can read the originalWashington Timesarticle here. Emma Hodcroft, Postdoctoral Researcher, University of Basel:I will comment primarily on the claims about evolution and mutation in the context of vaccination or widespread infection. I’m not a medical doctor, and so even though their claims about vaccine harms and drugs like ivermectin and hydroxychloroquine aren’t consistent with the published literature and reports by governments, I will not comment on this. Viruses are some of the fastest-evolving pathogens we know, which is part of what makes them so tricky. For instance, the human immunodeficiency virus (HIV) evolves so quickly that our immune systems can’t keep up with “recognizing” it. That’s part of why it’s a chronic—and if untreated, fatal—disease. For most human viruses we encounter, however, the outcome is much less grim. Our bodies learn to recognise it, which protects us from infection and/or serious outcomes when we meet it again in the future. However, for many viruses this is a dance we participate in for the rest of our lives—though we learn to recognise what infects us, the virus will change, and we may not recognise it as well next time. In some cases, we may remain protected for the rest of our non-frail lives from serious outcomes, but not from infection itself, with or without mild symptoms. Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes. We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does (“ever more powerful vaccines will have to be developed”), that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently. But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape. Thus no matter what action we take, we have a future where we will have to deal with a virus responding to immune pressure, whether through most of the population being infected eventually—and with more transmissible variants like Delta as well as reopening, we can see this future clearly in the huge waves in areas with low vaccination rates—through vaccine-mediated immunity, or through a combination of both. What’s key is that there’s a huge difference in how you reach these two goals. The risks of vaccination are incredibly low, particularly for the mRNA vaccines, and means we can keep the transmission rates of the virus low *while* getting high population immunity. On the other hand, we know that SARS-CoV-2 has very real risks for many people in our population. Even for age groups where the risk is relatively low, if you infect millions of people, you will see bad outcomes. Allowing the entire population to be infected—even excluding the most vulnerable—will cause a lot of hospitalizations, deaths, and suffering along the way, which is entirely preventable through vaccination. Finally, population-level immunity achieved through infection requires, by definition, high levels of virus transmission. This provides the most opportunity for the virus to find itself in people with the imperfect immunity where immune-avoiding mutations could be selected. On the other hand, vaccine-mediated immunity could be achieved with zero virus circulating. While that extreme may not be realistic, we can achieve it while keeping virus levels very low, minimizing the chance that the virus has to have these mutations selected for. While it’s true that except for eliminating SARS-CoV-2 entirely, we cannot entirely stop the virus from developing escape mutations, we can make this much harder. Even when vaccine-mediated immunity is imperfect, evidence suggests it makes it harder to be infected and harder to transmit—these are opportunities we take away from the virus. Further, it may be that those who may be vaccinated & infected may be able to eliminate the virus faster from the body, or have fewer viruses circulating while infected—all of which remove more opportunities for dangerous mutation. In short, there is no future in which we won’t have to potentially face mutations that escape immunity to some degree. However, the future that is much less risky is reached by minimizing the chance of these mutations and minimizing the risk by which we achieve population-level immunity, and that’s through vaccination. Finally, to address this quote: “The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.” In fact, there is no clear historical tendency. Is HIV less fatal? Influenza? The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host. Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%. Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected). Exposure at different ages also makes a difference. As we see with SARS-CoV-2, young children seem at relatively little risk. If everyone was exposed as a child (as they are to many, many other viruses, like influenza and seasonal coronaviruses), the virus may be inconsequential for almost the rest of their lives (old age seems to make people more vulnerable to respiratory viruses). But this is through early exposure and immunity (and possibly repeated exposure), not through the virus becoming less virulent. Dale Fisher, Professor (Department of Medicine), National University of Singapore:This article has inaccuracies throughout with a clear view to push an anti-vaccine agenda. The picture depicting a skull with eyes and nose made of coronaviruses in the shape of the U.S. is sensationalist. The opening line calls it Biden’s strategy. It was also Trump’s and is the strategy of every country and the WHO. Flawed assumption #1 in the article is wrong. No one believes the virus will be eradicated. It’s also not about herd immunity. It’s about turning this into a mild illness and reducing transmission. Flawed assumption #2 stemming from the first: No one believes it’s perfect. We know transmission continues. Everything else is true and this is built into the strategies. Flawed assumption #3: Again, no one denies the risk of side effects. Indeed the scientific community and national authorities globally have been clear in discussing thrombotic, cardiomyopathic, and anaphylactic risks. It is very clear that the risks of vaccination are much lower than the risks of COVID-19. The article’s discussion surrounding virologists’ fears (unreferenced or substantiated) likewise is unhelpful fear-mongering when already many long-term effects of the disease itself are emerging and much more likely. Flawed assumption #4: There is no good evidence yet that the lack of durability exists. If it is true, we may find that some vaccines are more durable than others and even future generations of vaccines could be better. No one is saying we don’t have more to learn and that R&D has stopped. It is true however that boosters may be necessary. It is theoretically possible that variants could escape vaccine-related immunity, but all the variants of concern to date have shown increased transmissibility, and in some cases, immune escape in the absence of vaccines. The rest of the conjecture is just that: conjecture. Genetic surveillance has a high priority globally to observe for the emergence of escape mutants, and yes, future versions of the vaccine may need to cater for these. Malone and Navarro’s list of “numerous other useful treatments” is not consistent with the findings of most clinical trials and is not standard practice. Angéline Rouers, Senior Research Fellow, A*STAR Infectious Diseases Labs:The article does not mention any source to support the claims. The only reference at the end is the fact that one author was the “discoverer of the mRNA vaccine” (which isan exaggerated claim) and that the other served in the White House as the Defense Production Act Policy Coordinator during the Trump administration. Neither of these statements offer support for the scientific claims they make in the article. To clarify the main claims and put the things at the right place: About assumption 1 in the article: There is a confusion about the relationship between vaccination and mutations. The massive vaccination of the population doesn’t promote mutations and lead to “exposure to more and more risk”. On the contrary, the rapid vaccination of as many people as possible is crucial to stop the variants. The virus mutates not because of vaccination but because it is a virus, and every virus in the world can mutate. Some of the mutations make the virus stronger and sometimes more transmissible. Some vaccines may become useless against certain variants but for now—even if it is demonstrated that there is a reduction in neutralizing activity against the variants—vaccines are still effective. But if not enough people are vaccinated, the variants will continue to emerge. The massive immunisation—through vaccination—will stop the variant race, not elicit it! About assumption 2 in the article: All vaccines come with side effects. There is always the risk-benefit balance to take into account. In the context of COVID-19 vaccines, the eventual side effects observed remain very rare and don’t reach an abnormal rate that justifies halting their use. Adverse events such as the disruption of women’s menstrual cycle have been rarely observed, and up until now, not shown to be causally linked to vaccination. However, when these observations are made, scientists are encouraged to investigate more in detail to rule out all possible links. It is true that certain kinds of vaccines can lead to unexpected reactions depending on the medical history of the individual. That’s why this history or current health condition of the subject, such as pregnancy, is always taken into account when deciding which vaccine to give. Allergic reactions are recognized as a possible side effect, but people are closely monitored for this reaction after vaccination. About assumption 3 in the article: Vaccination of the most vulnerable only sounds like a nonsense strategy. Some of themcannot receive the full benefits of vaccinationdue to their medical history and will rely on indirect protection through the vaccination of others around them. That’s the principle of herd immunity. **ANNOTATIONS** “The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get, the less durable the vaccines will become, ever more powerful vaccines will have to be developed, and individuals will be exposed to more and more risk.” Any type of immunity present in the population will provide a selection pressure for the virus to get around this immunity, if it can. In many cases however, and particularly for viruses like coronaviruses, evidence suggests that this escape is usually not complete, particularly over shorter time periods. This means that even if you get infected, you benefit from “imperfect immunity” by being protected against severe outcomes. We see this reflected in what we have learned from SARS-CoV-2 vaccination data. This means that even when viruses have selection pressure on them from population immunity, it is not correct to assume, as the article does, that just because we may see some level of immune escape, this means that booster vaccines will be needed forever, or beyond the most vulnerable, or very frequently. But most importantly, it’s not only vaccine immunity which provides this selection pressure: immunity from infection does as well, despite the impression given by the article (“The more people you vaccinate, the greater the number of vaccine-resistant mutations you are likely to get”). In fact, it is hypothesized that some of the variants we have already seen, with some apparent immune escape like Gamma, arose in places where previous infection levels (and thus infection-mediated immunity) were high, and thus this may have put pressure for immune escape. “The clear historical tendency for viruses crossing over from one species to another is to evolve in a way that makes them both more infectious and less pathogenic over time.“ In fact, there is no clear historical tendency. Is HIV less fatal? Influenza? The base fallacy here is that any virus that kills some hosts sometimes is under strong selection never to kill at all, when actually the selection is at the far end, which the authors illustrate that they recognize: “A virus can’t efficiently spread if, like with Ebola, it quickly kills its hosts.”—if it killsbeforeit transmits. But if the virus transmits before it kills, it does not much care what happens to the host. Particularly, as is the case with SARS-CoV-2, when transmission has many opportunities (SARS-CoV-2 is respiratory, whereas Ebola spreads through fluids), death takes weeks (plenty of time to transmit), and occurs in a relatively (from the virus’ point of view) small number of infections. Even in cases where viruses may be under selection to become less deadly (which does not seem obvious for SARS-CoV-2), “less deadly” does not equal “not deadly”—they may simply evolve to kill you after four weeks instead of four days, for example, or kill 15% rather than 30%. Further, a lot of the “attenuation” we may observe for viruses over time, for those where we estimate they jumped into humans relatively recently, is likely due instead to immunity. A virus that is very dangerous at the first exposure is likely less dangerous once the entire population has some level of immunity, which in the past would have been after everyone had been infected). CoronavirusCOVID-19Vaccine Published on: 15 Aug 2021 | Editor:Flora Teoh Health Feedback is a non-partisan, non-profit organization dedicated to science education. Our reviews are crowdsourced directly from a community of scientists with relevant expertise. We strive to explain whether and why information is or is not consistent with the science and to help readers know which news to trust.Pleaseget in touchif you have any comment or think there is an important claim or article that would need to be reviewed. **Stay informed** Get email news updates:Follow us: **Method** See how we rate articles **Reviewers** **Editor** **Support our work** We depend on your support to operate. Help us create a more trustworthy Internet! Donate **health feedback** Reviewers Community standards Apply to become a reviewer About Our method to evaluate articles Our method to evaluate claims Contact us"}