{"id": 1338, "name": "TechSpot", "domain": "techspot.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.techspot.com/community/topics/dropbox-ceo-slams-return-to-office-mandates-compares-them-to-outdated-malls-and-theaters.292790/", "title": "Dropbox Ceo Slams Return To Office Mandates Compares Them To Outdated Malls And Theaters.292790", "content": "User loginUser iconLogin SearchA search icon TrendingNvidia RTX 5070 TiRyzen 9800X3D vs 7800X3DAI TransformersRadeon 9070 XTX870 MotherboardsChip Binning Nvidia RTX 5070 Ti Ryzen 9800X3D vs 7800X3D AI Transformers Radeon 9070 XT X870 Motherboards Chip Binning Nvidia RTX 5070 Ti Ryzen 9800X3D vs 7800X3D AI Transformers Radeon 9070 XT X870 Motherboards Chip Binning FeaturesTech CultureMust ReadsHardwareSoftwareGamingExplainersTips & Tricks Tech Culture Must Reads Hardware Software Gaming Explainers Tips & Tricks Tech Culture Must Reads Hardware Software Gaming Explainers Tips & Tricks ReviewsOutstandingPC Buying GuideCPUGraphics CardsLaptopsStorageMonitorsMore Reviews Outstanding PC Buying Guide CPU Graphics Cards Laptops Storage Monitors More Reviews Outstanding PC Buying Guide CPU Graphics Cards Laptops Storage Monitors More Reviews DownloadsLatest UpdatesSoftware EssentialsPopular AppsSoftware We RecommendDevice Drivers Latest Updates Software Essentials Popular Apps Software We Recommend Device Drivers Latest Updates Software Essentials Popular Apps Software We Recommend Device Drivers The BestBest GPUsBest MonitorsBest PC GamesBest SSDsBest iPadBest KeyboardsBest Mouse Best GPUs Best Monitors Best PC Games Best SSDs Best iPad Best Keyboards Best Mouse Best GPUs Best Monitors Best PC Games Best SSDs Best iPad Best Keyboards Best Mouse Product Finder ForumsJoin TechSpot EliteNew PostsLatest Comments Join TechSpot Elite New Posts Latest Comments Join TechSpot Elite New Posts Latest Comments Forums Community TechSpot News Discussion Today's Posts **Dropbox CEO slams return-to-office mandates, compares them to outdated malls and theaters** Thread startermidian182 Start dateSaturday at 9:31 AM 1 2 Saturday at 9:31 AM #1 Speaking on an episode of Fortune's \"Leadership Next\" podcast, Houston said what most people have long thought: that returning to the office is a waste of time and money when employees can do exactly the same tasks at home. \"We can be a lot less dumb than forcing people back into a car three days a week or whatever, to literally be back on the same Zoom meeting they would have been at home,\" he said. \"There's a better way to do this.\" Dropbox remains one of the few companies that has continued to embrace a \"virtual first\" approach following the end of the lockdowns. Asreportedby Business Insider, Dropbox introduced a 90/10 rule in 2021, where employees work from home for about 90% of the year and attend a small number of off-site events the remaining 10%. \"Forcing people back to the office is probably gonna be like trying to force people back into malls and movie theaters,\" Houston said. \"Nothing wrong with the movie theater, but it's just a different world now.\" The Dropbox CEO has spoken out in favor of remote work before. In 2023, he called it \"the keys that unlock this whole future of work.\" \"You need a different social contract and to let go of control. But if you trust people and treat them like adults, they'll behave like adults. Trust over surveillance,\" he said at the time. Few modern work-life issues have proved as controversial as the RTO mandates. It's no secret that the vast majority of people are happier working in their own home. A recent study found thatfewer than halfof UK workers would agree to a full-time return-to-office (RTO) mandate, with women and parents the most likely to refuse. We've also seen employees willing tosacrifice up to 15%of their wages in exchange for a more flexible work life. But apart from the few exceptions like Houston, most executives care little about employees' wishes and are against remote work, claiming that productivity and collaboration improve when in an office. Companiessuch as EAare telling all employees to return to their work locations at least three days per week, while the likes of Amazon and Dell are telling workers who live close(ish) to an office to return full-time or leave the company. A recent study claimed that the most productive staffwork in shorter burstsand take longer breaks: 75 minutes of work followed by 33 minutes of rest time. It also suggests that in-office and hybrid work actually encourage a healthier work-life balance than fully remote models. Permalink to story: Dropbox CEO slams return-to-office mandates, compares them to outdated malls and theaters Saturday at 11:30 AM #2 Saturday at 11:37 AM #3 Saturday at 11:42 AM #4 Saturday at 2:28 PM #5 Saturday at 2:41 PM #6 Saturday at 2:54 PM #7 Saturday at 3:05 PM #8 Saturday at 3:34 PM #9 Saturday at 4:52 PM #10 Saturday at 6:48 PM #11 Saturday at 7:11 PM #12 Saturday at 7:38 PM #13 Saturday at 7:45 PM #14 Saturday at 8:04 PM #15 Saturday at 9:28 PM #16 Saturday at 9:36 PM #17 Saturday at 10:55 PM #18 Saturday at 11:18 PM #19 Saturday at 11:21 PM #20 Saturday at 11:27 PM #21 **Fully Remote? It Could Be 10% to 20% Less Productive** **The remote work revolution is crashing into a cold reality: Research is finding workers are less productive at home** Sunday at 12:19 AM #22 Sunday at 12:26 AM #23 **Fully Remote? It Could Be 10% to 20% Less Productive** **The remote work revolution is crashing into a cold reality: Research is finding workers are less productive at home** **The State of Remote Work: 2025 Statistics - Neat** **Surprising Working From Home Productivity Statistics (2025)** Sunday at 9:15 AM #24 Sunday at 10:53 AM #25 1 2 **Similar threads** midian182 May 28, 2025 TechSpot News Discussion midian182 May 15, 2025 TechSpot News Discussion midian182 Apr 25, 2025 TechSpot News Discussion **Latest posts** Amazon to invest $20 billion in AI data centers across PennsylvaniaNumberNine repliedA moment ago NumberNine replied A moment ago NumberNine replied A moment ago SNvidia Arm chip surfaces with strong Geekbench scores, could rival top Intel and AMD laptop CPUsSRB replied2 minutes ago SRB replied 2 minutes ago SRB replied 2 minutes ago How a little-known tax change sparked a tech layoff surgebclaymiles replied5 minutes ago bclaymiles replied 5 minutes ago bclaymiles replied 5 minutes ago SMeta invests $14.8 billion in Scale AI to accelerate superintelligence ambitionsSkye Jacobs replied12 minutes ago Skye Jacobs replied 12 minutes ago Skye Jacobs replied 12 minutes ago AVolvo launches world's first seatbelt that adapts to every body in real timeAu Contraire replied56 minutes ago Au Contraire replied 56 minutes ago Au Contraire replied 56 minutes ago Amazon customer buys RTX 5090, receives rice, pasta, and mystery GPU insteadGTvon repliedToday at 3:29 PM GTvon replied Today at 3:29 PM GTvon replied Today at 3:29 PM HChatGPT gets crushed at chess by a 1 MHz Atari 2600HardReset repliedToday at 3:12 PM HardReset replied Today at 3:12 PM HardReset replied Today at 3:12 PM JYouTube shuts down ad-blocker loophole, tightens restrictionsJohnGoogle repliedToday at 3:12 PM JohnGoogle replied Today at 3:12 PM JohnGoogle replied Today at 3:12 PM Ask a QuestionSee Recent PostsTechSpot is dedicated tocomputer enthusiasts and power users.Ask a question and give support.Join the community here, it only takes a minute. Tech News Features Reviews Downloads The Best Product Finder News Archive Web Tools AMD Ryzen 9800X3D vs Ryzen 7800X3D Nvidia RTX 5070 Ti Review Best PC Games (You Should Be Playing) AMD X870/X870E Motherboard Roundup The OLED Burn-In Test AI Transformers Explained The Best Gaming Monitors AMD Radeon 9070 XT Review VMware Download Free Cinebench R23 Minecraft Download PS3 Firmware WhatsApp Beta Popcorn Time Play Store Download Tiny 11 AboutEthics StatementTerms of UsePrivacy Policy TECHSPOT : Tech Enthusiasts, Power Users, Gamers TechSpot is a registered trademark and may not be used by third parties without express written permission. TechSpot is represented byFuture PLC. Learn aboutadvertising opportunities. © 1998 - 2025 TechSpot, Inc. All Rights Reserved."}