{"id": 1969, "name": "Foreign Policy Journal", "domain": "foreignpolicyjournal.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.foreignpolicyjournal.com/2019/11/16/un-praises-maldives-bill-outlawing-informed-consent-for-pharmaceuticals/", "title": "Un Praises Maldives Bill Outlawing Informed Consent For Pharmaceuticals", "content": "About Home FeaturesNews & AnalysisEssaysViewpoints News & Analysis Essays Viewpoints News & Analysis Essays Viewpoints RegionsAfricaAmericasAsia PacificEuropeMiddle East Africa Americas Asia Pacific Europe Middle East Africa Americas Asia Pacific Europe Middle East TopicsPoliticsEconomyReviewsCultureScience & Health Politics Economy Reviews Culture Science & Health Politics Economy Reviews Culture Science & Health Select Page **UN Praises Maldives Bill Outlawing Informed Consent for Pharmaceuticals** ByJeremy R. Hammond|Nov 16, 2019|News & Analysis,Asia Pacific,Featured,Politics,US|4| The United Nations Children’s Fund has dangerously praised the Maldives legislature for passing a bill that fundamentally violates human rights. The parliament of the Republic of Maldives on November 14 passed abilleffectively outlawing the exercise of the right to informed consent, one of the most fundamental ethics in medicine. If ratified, according to multiple Maldives online news sources, the new law would make it illegal for parents to decline certain pharmaceutical products for their children. Concerningly, the United Nations Children’s Fund (UNICEF) has praised the Maldives legislature for passing the bill, which has been promoted as bringing the country into closer compliance with the UN Convention on the Rights of the Child (CRC). The authoritarian bill is being euphemistically called the “Child Rights Protection Bill”. The implicit underlying concept is that children have a “right” to receive certain pharmaceutical products and so parents cannot be allowed to choose for their children not to receive those risk-carrying products. This framework overlooks the fact that children do not have enough knowledge and understanding to be able to do their own risk-benefit analysis, which is why such decisions must be made for them bytheir parentsuntil they reach such age as to be able to reasonably make their own choice. **** **** **** Of course, children won’t be given the choice, either, if news reports are accurate and the bill is ratified into law. Government bureaucrats will be the ones making that decision on children’s behalf, despite having none of the specialized knowledge of the individual child that is possessed by the child’s parents working in consultation with the child’s doctor—knowledge required to be able to conduct the necessary risk-benefit analysis for that individual. UNICEF is apparently unconcerned with world governments systematically violating the right to informed consent of their citizens. The propagandistic language of children’s rights being used to push this authoritarian agenda serves to mask how the Maldives government is itself claiming to have a “right” to force risk-carrying pharmaceutical products on children against the will of their parents. In effect, the government will be subjecting every child member of the population to a mass uncontrolled experiment without their informed consent. In atweetimmediately following its passage, UNICEF described the bill as a “celebration-worthy milestone for the Maldives, as we mark the 30th anniversary of the #CRC.” The passage of the two important bills for children – The Child Rights Protection Bill, and the Juvenile Justice Bill is a key and celebration-worthy milestone for the Maldives, as we mark the 30th anniversary of the#CRC.https://t.co/luMkJSiOzR — UNICEF Maldives (@UNICEFMaldives)November 14, 2019 TheSun Online, a Maldives media outlet,reportedthat the bill passed unanimously and “would make it mandatory for parents to vaccinate children and outlaw the option of rejecting vaccinations by the parents.” The report self-contradictorily added that “The new legislature on child rights protection is designed to remedy the inconsistencies between the current Child Rights Protection Act—enacted in 1991—and the United Nations Convention on the Rights of the Child.” That report was alsopublishedin short form byOne Online, another Maldives news site. TheMaldives Independentsimilarlyreportedthat the parliament had “passed with unanimous consent a new child protection law with provisions to make vaccination mandatory”. Under the law, parents “would not be legally allowed to deny vaccinating their children”. The euphemistic language being used to describe the government’s agenda to forcibly vaccinate children is that they have a “right to care”. This aspect of the bill is being passed under cover of other provisions intended to bring the country closer in line with the protections under international law for the rights of the child, such as by prohibiting child marriage and criminalizing failure to report child abuse. While enacting protections for children from some forms of child abuse, however, the government itself would be committing child abuse systematically on a massive scale by forcing upon children risk-carrying pharmaceutical products that can and do cause permanent injury or even death to some children. “Once ratified,” theMaldives Independentadded, “the new law will replace the 1991 child protection law and bring the domestic legal framework in line with the UN Convention on the Rights of the Child.” But that is not true. On the contrary, the outlawing of informed consent is a gross violation of fundamental human rights and is inconsistent with international law. **The Inviolable Right to Informed Consent** TheConvention on the Rights of the Childrecognizes that “the equal and inalienable rights of all members of the human family is the foundation of freedom, justice and peace in the world”. Its aim is to “promote social progress and better standards of life in larger freedom”. The Convention acknowledges the child’s right to “be cared for by his or her parents.” States are obligated to “respect the rights and duties of the parents”, which certainly includes making decisions affecting the child’s health. The Convention explicitly recognizes that “primary responsibility for the upbringing and development of the child” belongs not to the state but the parents. The role of the state, instead, is merely to “render appropriate assistance to parents”, not to make decisions affecting the child on their behalf and without respect for their parental rights. The cheerleading from UNICEF also comes despite the fact that the right to informed consent has been explicitly recognized under international conventions and treaties as one of the most fundamental ethics in medicine—an inviolable human right that no government may legislate away. In the wake of World War II and revelations about the Nazis’ medical experimentation upon unwilling human subjects, the very first medical ethic recognized under theNuremberg Codeis that “The voluntary consent of the human subject is absolutely essential.” The use of “force, fraud, deceit, duress, overreaching, or other ulterior form of constraint or coercion” is absolutely prohibited as violating the individual’s right “to exercise free power of choice”. Additionally, the subject of any medical intervention “should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision.” The 1966United Nations Covenant on Civil and Political Rightssimilarly states that “no one shall be subjected without his free consent to medical or scientific experimentation.” The updated 2002 edition of theInternational Ethical Guidelines for Biomedical Research Involving Human Subjects, the guidelines of which are promulgated by the World Health Organization (WHO), explicitly recognizes that the individual subjected to medical intervention must be “capable of giving informed consent”. If the individual isn’t capable of making that choice, the intervention requires “the permission of a legally authorized representative”—which in the case of children means the parents. The 2005Universal Declaration on Bioethics and Human Rightsstates that “Any preventive, diagnostic and therapeutic medical intervention is only to be carried out with the prior, free and informed consent of the person concerned, based on adequate information.” In no case should decisions by authorities “substitute for an individual’s informed consent.” The Convention on the Rights of the Child also says that state parties are responsible, without prejudice to the rights of parents, to take appropriate measures to “diminish infant and child mortality”. The Maldives bill would also violate that clause of the CRC, too, if scientific studies are any indication. **The DTP Vaccine’s Negative Effect on Childhood Mortality** Although the popular belief—and the message conveyed by government health officials—is that all vaccines are “safe and effective”, the truth is that there is an egregious lack of properly designed safety studies for these pharmaceutical products. One illustrative example is the diphtheria, tetanus, and whole cell pertussis (DTP) vaccine, which isroutinely administeredto children in the Maldives. The DTP vaccine was never studied for its effect on childhood mortality in clinical trials. Government policy makers always justassumedthat by reducing incidence of the target diseases it would reduce childhood mortality. But that’s not what the scientific evidence tells us. On the contrary, the best scientific evidence to date strongly indicates that the DTP vaccineincreasesthe risk of death. Numerous studies have found it to be associated with a significantlyincreasedrate of childhood mortality. The authors of astudyinto the DTP vaccine’s effect on childhood mortality published in the journalEBioMedicinein 2017 summarized the situation bluntly: “All currently available evidence suggests that DTP vaccine may kill more children from other causes than it saves from diphtheria, tetanus or pertussis. Though a vaccine protects children against the target disease it may simultaneously increase susceptibility to unrelated infection.” The key finding of that study was that “DTP was associated with 5-fold higher mortality than being unvaccinated.” The authors further commented that, “Unfortunately, DTP is the most widely used vaccine, and the proportion who receives DTP is used globally as an indicator of the performance of national vaccination programs.” “It should be of concern”, the researchers also remarked, “that the effect of routine vaccinations on all-cause mortality was not tested in randomized trials.” The term in the literature used to describe such unintended consequences of vaccination is “non-specific effects”. Anotherstudypublished inFrontiers in Public Healthsimilarly pointed out that “All studies of the introduction of DTP have found increased overall mortality.” The association is particularly strong for girls. The best studies show “four to five times higher mortality” for DTP-vaccinated children. Anexpert reviewof the available studies published in June 2019 by theVaccine Science Foundationexpressed the concern that “it is impossible to predict what happens in terms of susceptibility to infections in general, of all types, when the immune system is being stimulated through vaccination”. Concern was also expressed that the WHO had attempted to dismiss the studies and acted in a manner “inconsistent and biased towards positive effects of vaccines. When a result pleases the WHO, it can be accepted, but not when a result does not please the WHO.” Conflicts of interest within the WHO is another area of concern. Of the fourteen experts tasked by the WHO to examine the evidence with respect to the DTP vaccine’s effect on mortality, eight “had relevant conflicts of interest in relation to companies producing vaccines”. Three “even had ties to GlaxoSmithKline”, one of the manufacturers of DTP vaccines. While the WHO chose not to see any conflicts of interest, “research has overwhelmingly demonstrated that people become influenced when they have financial ties to drug companies, even when these ties are not directly related to the drugs or vaccines in question.” The review observed the commonsense principle that “expert committees that give advice on immunization programs should not be involved with their re-assessment when research has demonstrated that a vaccine might increase total mortality.” Additionally, “no one should be allowed to have financial conflicts of interest in relation to the pharmaceutical industry.” However, “This is not the case for WHO committees.” The review further observed: It is the duty of a manufacturer of a drug or vaccine to demonstrate in randomized trials that it works and has a positive benefit to harm balance. This has not been done for the DTP vaccine. Not a single randomized trial has been carried out, but the vaccine is nonetheless on the market. This has created the odd situation that the burden of proof has been reversed. The WHO recommends the use of the vaccine and seems to require very convincing evidence that it increases mortality before any action will possibly be taken. Given the widespread use of the vaccine around world, the “need for randomized trials” is “an urgent ethical imperative.” In conclusion, “the best available evidence . . . tells us that it is likely that the DTP vaccine increases total mortality in low-income countries”, and therefore “no one should be offered this vaccine without full informed consent that includes information that the vaccine is likely to increase total mortality.” The Maldives government is engaging in science denialism by ignoring that sound and medically ethical recommendation. **More Vaccines Doesn’t Equal Better Health** It’s also worth pointing out that although the United States has themost highly vaccinatedchildhood population in the world and spends more per capita on health care for children, it also consistentlyranks lastamong developed countries for its rate ofinfant mortality. Far from the highly vaccinated US population being healthy, as a 2013reportfrom the National Research Council and Institute of Medicine noted, “Americans die sooner and experience more illness than residents in many other countries.” Astudypublished in 2011 estimated that at least 43 percent of the childhood population—32 million children—suffered from at least one chronic health condition. According to areportpublished in 2013 by Save the Children, “In the industrialized world, the United States has by far the most first-day deaths. . . . An estimated 11,300 newborn babies die each year in the United States on the day they are born. This is 50 percent more first-day deaths than all other industrialized countries combined.” Relevantly, the CDC also recommends that the hepatitis B (HepB) vaccine be routinely administered to all newborn babies in the USon the first day of their livesregardless of the fact that most infants arenot at significant riskfrom this virus, which is mostly transmitted through sex or intravenous injections, and the fact that routine screening is done to determine whether the mother is a carrier. This places the majority of children at unnecessary risk of harm from the vaccine, which, like many other vaccines used in children, contains aluminum, a known neurotoxin thataccumulates in the brain. While human studies haven’t been done to determine the neurotoxicological effects of the HepB vaccine on infants, rodentstudieshavefoundthat the vaccine causesneurodevelopmental harm. The HepB vaccine isamong thosethat would be forced upon children against their parents’ will­ if the Maldives bill is ratified. Another is the live oral polio vaccine (OPV), whichnow causes more cases of paralysisthan the wild virus. It would be superfluous to provide other examples. **A Dangerous Precedent** All vaccines carry the risk of serious harm or even death. Furthermore, certain children are at greater risk of being harmed by vaccines, and these children are placed on the sacrificial altar in the name of “public health” when vaccines are universally mandated. For example, the US government hasacknowledgedthat vaccines can cause brain damage manifesting as symptoms of autism in children with mitochondrial disorders. The US government has also granted legal immunity to manufacturers of vaccines recommended for routine use in children by the US Centers for Disease Control and Prevention (CDC). The parent agency of the CDC, the Department of Health and Human Services, administers a Vaccine Injury Compensation Program that effectivelyshifts the financial burden for vaccine injuriesaway from the pharmaceutical industry and onto the taxpaying consumers. To obtain licensure by the US Food and Drug Administration (FDA), vaccine manufacturers are not required to conduct long-term, randomized, placebo-controlled studies comparing health outcomes between an experimental group who receive the vaccine and a control group who are instead given an inert placebo. Since the pharmaceutical companies aren’t required to, they don’t. Government policymakers in the US and countries all over the world are essentially subjecting their entire populations to amass uncontrolled experimentwithout individuals’ informed consent. What government officials in the Maldives evidently hope to do is to take this one step further and ensure that informed parents who judge that the potential benefits of a given vaccine would not outweigh the potential harms arenotallowed to choose for their child tonotbe experimented upon. For an agency of the United Nations to endorse a government policy that so egregiously violates the right to informed consent sets a worrying precedent encouraging a trend of increasing totalitarianism that threatens both public health and fundamental human rights. Share: Rate: Tags:CDC,FDA,Government,Health,Human Rights,Liberty,Maldives,Science,UN,UNICEF,Vaccines,WHO **About the Author** **Jeremy R. Hammond** The government perpetually lies to the public about important issues. The mainstream media dutifully serve to manufacture consent for criminal policies. I free people's minds by exposing state propaganda intended to keep them in servitude to the politically and financially powerful. My writings empower readers with the knowledge to see through the deceptions and fight for a better future, for ourselves, our children, and future generations of humanity. I'm an independent political analyst, journalist, publisher and editor ofForeign Policy Journal, and author of severalbooks. I'm also a writing coach who helps bloggers and journalists communicate their ideas more effectively to make a greater positive impact. Stay updated with my work by signing up for my free newsletter atJeremyRHammond.com. To learn more about my writing coaching program,click here. **4 Comments** samuraion November 19, 2019 at 9:08 amThank you for the informed article. This is worse than a dangerous precedent. This is medical tyranny. No good can come from this. Many people, beginning with innocent children, will continue to be harmed as they are every day, especially in the USA. Thank you for the informed article. This is worse than a dangerous precedent. This is medical tyranny. No good can come from this. Many people, beginning with innocent children, will continue to be harmed as they are every day, especially in the USA. Thank you for the informed article. This is worse than a dangerous precedent. This is medical tyranny. No good can come from this. Many people, beginning with innocent children, will continue to be harmed as they are every day, especially in the USA. Stas Novikovon November 24, 2019 at 4:56 pmYou are an idiot as far as the vaccines go – the polio reference particularly idiotic since anyone who read it would understand just how stupid you are – yes, polio vaccine caused paralysis in 21 chilldren vs only 6 cases of polio virus last year. What’s missing is this: in 1988, there were over 350,000 cases of polio in the world. In 2018 – only 6. Do you see the difference between the numbers 350,000 and 6? That difference is the vaccine !Unless you can come up or know a better way to do this kind of change, just shut up and stop talking !Jeremy R. Hammondon November 29, 2019 at 5:43 pmYou are an idiot…It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true.What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. You are an idiot as far as the vaccines go – the polio reference particularly idiotic since anyone who read it would understand just how stupid you are – yes, polio vaccine caused paralysis in 21 chilldren vs only 6 cases of polio virus last year. What’s missing is this: in 1988, there were over 350,000 cases of polio in the world. In 2018 – only 6. Do you see the difference between the numbers 350,000 and 6? That difference is the vaccine !Unless you can come up or know a better way to do this kind of change, just shut up and stop talking ! Jeremy R. Hammondon November 29, 2019 at 5:43 pmYou are an idiot…It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true.What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. You are an idiot… It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true. What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. You are an idiot as far as the vaccines go – the polio reference particularly idiotic since anyone who read it would understand just how stupid you are – yes, polio vaccine caused paralysis in 21 chilldren vs only 6 cases of polio virus last year. What’s missing is this: in 1988, there were over 350,000 cases of polio in the world. In 2018 – only 6. Do you see the difference between the numbers 350,000 and 6? That difference is the vaccine !Unless you can come up or know a better way to do this kind of change, just shut up and stop talking ! Jeremy R. Hammondon November 29, 2019 at 5:43 pmYou are an idiot…It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true.What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. You are an idiot… It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true. What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. You are an idiot… It’s instructive that you feel it necessary to resort to a personal insult (a violation of the terms of use of this site) in lieu of identifying even one thing I wrote in the article that isn’t true. What’s dangerously idiotic is advocating state violation of individuals’ right to informed consent. James Sheaon December 1, 2019 at 9:49 pm….. in a matter somewhat related to this topic, … I wonder if anyone has heard any info on the anti-vax author Jennifer Jaynes, who recently died by gunfire, …… ?, ….. it seems any info on this is being blocked orcovered up, … ? ….. in a matter somewhat related to this topic, … I wonder if anyone has heard any info on the anti-vax author Jennifer Jaynes, who recently died by gunfire, …… ?, ….. it seems any info on this is being blocked orcovered up, … ? ….. in a matter somewhat related to this topic, … I wonder if anyone has heard any info on the anti-vax author Jennifer Jaynes, who recently died by gunfire, …… ?, ….. it seems any info on this is being blocked orcovered up, … ? © 2016 Foreign Policy Journal About Privacy Policy Terms of Use"}