{"id": 1358, "name": "Breakthrough Institute", "domain": "thebreakthrough.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thebreakthrough.org/issues/food-agriculture-environment/trump-has-an-opportunity-to-modernize-agricultural-biotechnology-regulations", "title": "Trump Has An Opportunity To Modernize Agricultural Biotechnology Regulations", "content": "Climate & Energy Food & Agriculture EcomodernismAn Ecomodernist Manifesto - EnglishUn Manifiesto Ecomodernista - EspañolUn Manifeste Èco-moderniste - FrançaisIl Manifesto Degli Ecomodernisti - ItalianoEin Ökomodernes Manifest - Deutsch生态现代主义宣言 - JIǍNHUÀZÌ現代的環境主義宣言 - JapaneseManifesto Ya Ikolojia Ya Kisasa - KiswahiliSebuah Manifesto Ecomodernist - Bahasa IndonesiaEtt Ekomdernistiskt Manifest - SvenskaEen Ecomodernistisch Manifest - NederlandsManifest Ekomodernistyczny - Język Polski An Ecomodernist Manifesto - English Un Manifiesto Ecomodernista - Español Un Manifeste Èco-moderniste - Français Il Manifesto Degli Ecomodernisti - Italiano Ein Ökomodernes Manifest - Deutsch 生态现代主义宣言 - JIǍNHUÀZÌ 現代的環境主義宣言 - Japanese Manifesto Ya Ikolojia Ya Kisasa - Kiswahili Sebuah Manifesto Ecomodernist - Bahasa Indonesia Ett Ekomdernistiskt Manifest - Svenska Een Ecomodernistisch Manifest - Nederlands Manifest Ekomodernistyczny - Język Polski An Ecomodernist Manifesto - English Un Manifiesto Ecomodernista - Español Un Manifeste Èco-moderniste - Français Il Manifesto Degli Ecomodernisti - Italiano Ein Ökomodernes Manifest - Deutsch 生态现代主义宣言 - JIǍNHUÀZÌ 現代的環境主義宣言 - Japanese Manifesto Ya Ikolojia Ya Kisasa - Kiswahili Sebuah Manifesto Ecomodernist - Bahasa Indonesia Ett Ekomdernistiskt Manifest - Svenska Een Ecomodernistisch Manifest - Nederlands Manifest Ekomodernistyczny - Język Polski Blog Careers AboutOur StaffOur BoardOur Funders Our Staff Our Board Our Funders Our Staff Our Board Our Funders Press Events JournalNo. 20 / Spring 2024 - Breakthrough Journal Moves to SubstackNo. 19 / Summer 2023 - Ten Words You Can't Say About Climate ChangeNo. 18 / Fall 2022 - The New Nuclear ExplosionNo. 17 / Summer 2022 - Produce ProblemsNo. 16 / Spring 2022 - Climate Geopolitics No. 20 / Spring 2024 - Breakthrough Journal Moves to Substack No. 19 / Summer 2023 - Ten Words You Can't Say About Climate Change No. 18 / Fall 2022 - The New Nuclear Explosion No. 17 / Summer 2022 - Produce Problems No. 16 / Spring 2022 - Climate Geopolitics No. 20 / Spring 2024 - Breakthrough Journal Moves to Substack No. 19 / Summer 2023 - Ten Words You Can't Say About Climate Change No. 18 / Fall 2022 - The New Nuclear Explosion No. 17 / Summer 2022 - Produce Problems No. 16 / Spring 2022 - Climate Geopolitics Newsletter **Trump Has an Opportunity to Modernize Agricultural Biotechnology Regulations** **The U.S. Needs A Truly Product- and Risk-Based Biotechnology Framework** ShareShare via TwitterShare via FacebookShare via Email Share via Twitter Share via Facebook Share via Email Share via Twitter Share via Facebook Share via Email In late 2024, the result of a decades-long process to update U.S. biotechnology regulation was undone when a judge ordered the U.S. Department of Agriculture to scrap its newly updated rule. The updated regulations, commonly referred to as the SECURE rule, were finalized in 2020—the first comprehensive revision of USDA’s regulations for genetically engineered organisms since they were established in 1987. Shortly after, a group of anti-GMO nonprofits and activists filed alawsuitagainst USDA alleging that the SECURE rule violated the Plant Protection Act. A judge for the Northern California District Court sided with the plaintiffs on this claim and vacated the rule. Since the court decision, USDA has returned to using a decades-oldframeworkfor regulating genetically engineered organisms. These legacy regulations unnecessarily limit innovation in agriculture, relying on an outdated understanding of genetic engineering to subject products to years of regulatory review. This delays commercialization of products that make agriculture more productive and resilient while using less land, fertilizer, and pesticides. The Trump administration and USDA must seize the opportunity to rewrite agricultural biotechnology regulations to ease the path to market for innovative technologies that can help maintain American agricultural competitiveness, increase farmer incomes, and keep the United States as a leader in biotechnology. **The Benefits of Agricultural Biotechnology** Agricultural biotechnology, including genetic modification and gene editing, is fundamental to agricultural productivity growth, the economic health of U.S. farmers, and the future of agriculture. Genetically engineered crops with resistance to insect pests have been around since the 90s, reducing farmers’ spending on pesticides and increasing crop yields andfarmer incomeper hectare. Genetically modified insect resistant maize and cotton and herbicide tolerant canola and maize were responsible for between $30-111 of growth in average net farm income per hectare in the U.S. from 1996 to 2020. Insect resistant and herbicide tolerant crops are the most widely grown genetically engineered crops in the US. Yet, other genetically modified products have significant benefits:disease resistant papayasaved the Hawaiian papaya industry, low lignin alfalfa is more digestible for livestock thus increasing yields, and potatoesresistantto the disease that caused the Irish potato faminereduce fungicide use. Gene editing has created heat resistant cattle, making beef production more productive and resilient to climate change. Most recently, the US approved gene edited pigs resistant to porcine reproductive and respiratory syndrome (PRRS), which could save up to$1.2 billionin the US every year. Gene editing can also makemicrobes that help crops get nitrogen from the air, reducing farmers’ reliance on expensive fertilizers and greenhouse gas emissions from synthetic fertilizer production. Biotechnology advances have also enabled farmers to grow more food, feed, and fiber on less land using fewer resources. Genetic improvement—including through biotechnology—accounted for approximatelyhalfof the19–32%yield increase of U.S. corn, soybeans, and wheat from 2000 to 2022. Due to biotechnology’s contributions to increasing agricultural productivity, supporting a robust biotechnology industry is critical to keep food prices low, ensure food security without the need for more imports, and to maintain global agricultural competitiveness. In order to compete with countries like Brazil, the U.S. must continue advancing technologically to increase yields and decrease costs of production. From 2015 to 2019, for example, thecostof producing one ton of corn in Brazil was just $90 compared to $155 in the U.S. Given the extent of benefits stemming from agricultural biotechnology, the USDA’s regulatory framework must take a scientifically-sound view of risk and not unnecessarily delay key innovations. **USDA should create new biotechnology regulations that are truly product- and risk-based** Given the limitations of the SECURE rule and legacy regulations alike, USDA should take this opportunity to move past decades of overly restrictive biotechnology regulations. USDA must instead build a biotechnology regulatory system that identifies products for review based on high-risk traits regardless of how they were made. Such a “red flag” system would start from a presumption of no premarket regulation for most new crop varieties, regardless of how they were created, and only pull products in for review if they have any potentially risky traits from a list of “red flags.” Red flag traits could include plants modified to produce anactive pharmaceuticalor compounds for industrial use that have a “documented likelihood to cause significant harm to humans and the environment.” In practice, developers would assess whether their products have any traits from the red flag list and whether to submit to USDA for regulatory status review. Developers with a product that doesn’t have any traits from the red flag list could choose to go through a voluntary confirmation of exemption process if they need documentation from USDA to show to stakeholders in the supply chain or importers in other countries. To ensure the red flag system still provides sufficient flexibility for USDA, under limited circumstances USDA should have authority to bring a product in for premarket review that is not on the red flag list. A red flag system at USDA should be technology agnostic andinclude oversight of conventionally-bred plants. True product-based regulation would subject all new plant varieties to pre-market review—not just those created using genetic engineering—meaning that some conventionally-bred plants could be newly subject to premarket regulation for plant pest risk that were not previously assessed by USDA before commercialization. With a list of risky traits determining which products go through review, USDA’s premarket regulation of plant pest risk would focus on the actual risks of products. Experience with conventionally-bred and genetically engineered crops to date provides enoughevidenceto exempt whole categories of low-risk traits. Other U.S. regulations for genetic engineering, plant pests, and noxious weeds provide examples of red flag-like systems to determine which products should go through premarket review. USDA APHIS Plant Protection and Quarantine uses alist of regulated plant peststhat they continually update, with the additional provision that under some circumstances they may need to take action against pests that are not currently listed. APHIS’ noxious weed regulations at 7 CFR Part 360 apply to organisms on alist of regulated noxious weeds, and anyone canpetition to addor remove a taxon from the list. FDA’sguidancefor gene edited plants lists types of modifications for which they recommend developers consult them, for example “modifications to endogenous genes that create significant homology to a known allergen.” Further, USDA should not attribute risk to the number of genetic modifications made in a product. A 2016 National Academies of Sciences, Engineering, and Medicinereportnotes that “the size and extent of the genetic transformation has relatively little relevance to the extent of the change in the plant and consequently to the risk that it poses to the environment or to food safety.” This is in stark contrast to USDA’s new November 2024exemption categories, which defined low-risk products as products with less than 12 genetic modifications. **The Trump administration is at a fork in the road** The first Trump administration was committed to progress on agricultural biotechnology, including setting out anExecutive Orderon Modernizing the Regulatory Framework for Agricultural Biotechnology Products. While the second Trump administration seems once again focused onregulatory streamlining efforts, its attitude toward biotechnology broadly is more uncertain. President Trump recentlyrescindedBiden’sExecutive Order on Advancing Biotechnology and Biomanufacturing Innovation, calling these initiatives “radical” and “under the guise of environmental policy.” This administration should double down on its commitment to advancing biotechnology in agriculture by pursuing new product- and risk- based regulations for agricultural products. Agency-wideworkforce reductionscouldjeopardizethe administration’s ability to implement new regulatory streamlining efforts. Therefore, the White House, USDA, and Congress will need to prioritize adequate staffing and resources at APHIS in order to both keep up with an existing application pipeline and develop new regulations. Ultimately, new product- and risk-based USDA premarket regulation for genetically engineered organisms would incentivize innovation while also minimizing negative impacts on trade, product segregation, and public perception. USDA must take the opportunity presented by the current reversion to the legacy regulations to draft a new rule that improves upon both the legacy regulations and the SECURE rule to better match premarket review with the actual risks of new products. The short-term use of agency capacity to create a new product- and risk-based rule would efficiently focus resources for premarket reviews and provide more certainty for all stakeholders as technologies continue to advance. Rulemaking is a resource-intensive process that could take several years. It is therefore important for USDA to create product- and risk-based regulations now that will remain relevant for new technologies and not necessitate further rulemaking in the near term. **Emma Kovak** Emma Kovak is a senior Food and Agriculture Analyst at Breakthrough. **Emma Kovak** Emma Kovak is a senior Food and Agriculture Analyst at Breakthrough. Stay up to date **The Breakthrough Weekly** Sign up to get our newsletter in your inbox every Tuesday."}