{"id": 664, "name": "Kiel Institute for the World Economy", "domain": "ifw-kiel.de", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ifw-kiel.de/experts/jens-boysen-hogrefe/", "title": "Jens Boysen Hogrefe", "content": "Go to main content. Go to search. For Media TopicsWar against UkraineOverview PageUkraine Support TrackerInternational TradeOverview PageKiel Trade and Tariffs MonitorKiel Trade IndicatorEconomic OutlookAfricaChinaClimate and EnergyTension within the European UnionEconomic Policy in GermanyAll Topics War against UkraineOverview PageUkraine Support Tracker Overview Page Ukraine Support Tracker International TradeOverview PageKiel Trade and Tariffs MonitorKiel Trade Indicator Overview Page Kiel Trade and Tariffs Monitor Kiel Trade Indicator Economic Outlook Africa China Climate and Energy Tension within the European Union Economic Policy in Germany All Topics War against UkraineOverview PageUkraine Support Tracker Overview Page Ukraine Support Tracker Overview Page Ukraine Support Tracker International TradeOverview PageKiel Trade and Tariffs MonitorKiel Trade Indicator Overview Page Kiel Trade and Tariffs Monitor Kiel Trade Indicator Overview Page Kiel Trade and Tariffs Monitor Kiel Trade Indicator Economic Outlook Africa China Climate and Energy Tension within the European Union Economic Policy in Germany All Topics Experts Publications Data Hub InstituteAbout the Kiel InstituteOverview PageOrganizationHistoryKiel Institute in BerlinClub of Economic SciencePartners & NetworksHow to become a supporting memberResearch CentersOverview PageMacroeconomicsInternational FinanceTradeInternational DevelopmentGlobal TransformationInitiativesOverview PageAfrica InitiativeChina InitiativeKiel Geoeconomics InitiativeKiel Centre for GlobalizationCareerOverview PageJob VacanciesEqual OpportunityAdvanced Studies ProgramOverview PageStructure of our PhD programWhy choose our program?Outstanding professorsHow to applyTeam & ContactEventsOverview PageAll EventsInternational Business Cycle ForumConferencesPrizes and AwardsSeminars & WorkshopsIndividual ASP coursesGlobal China ConversationsBerlin Events About the Kiel InstituteOverview PageOrganizationHistoryKiel Institute in BerlinClub of Economic SciencePartners & NetworksHow to become a supporting member Overview Page Organization History Kiel Institute in Berlin Club of Economic Science Partners & Networks How to become a supporting member Research CentersOverview PageMacroeconomicsInternational FinanceTradeInternational DevelopmentGlobal Transformation Overview Page Macroeconomics International Finance Trade International Development Global Transformation InitiativesOverview PageAfrica InitiativeChina InitiativeKiel Geoeconomics InitiativeKiel Centre for Globalization Overview Page Africa Initiative China Initiative Kiel Geoeconomics Initiative Kiel Centre for Globalization CareerOverview PageJob VacanciesEqual Opportunity Overview Page Job Vacancies Equal Opportunity Advanced Studies ProgramOverview PageStructure of our PhD programWhy choose our program?Outstanding professorsHow to applyTeam & Contact Overview Page Structure of our PhD program Why choose our program? Outstanding professors How to apply Team & Contact EventsOverview PageAll EventsInternational Business Cycle ForumConferencesPrizes and AwardsSeminars & WorkshopsIndividual ASP coursesGlobal China ConversationsBerlin Events Overview Page All Events International Business Cycle Forum Conferences Prizes and Awards Seminars & Workshops Individual ASP courses Global China Conversations Berlin Events About the Kiel InstituteOverview PageOrganizationHistoryKiel Institute in BerlinClub of Economic SciencePartners & NetworksHow to become a supporting member Overview Page Organization History Kiel Institute in Berlin Club of Economic Science Partners & Networks How to become a supporting member Overview Page Organization History Kiel Institute in Berlin Club of Economic Science Partners & Networks How to become a supporting member Research CentersOverview PageMacroeconomicsInternational FinanceTradeInternational DevelopmentGlobal Transformation Overview Page Macroeconomics International Finance Trade International Development Global Transformation Overview Page Macroeconomics International Finance Trade International Development Global Transformation InitiativesOverview PageAfrica InitiativeChina InitiativeKiel Geoeconomics InitiativeKiel Centre for Globalization Overview Page Africa Initiative China Initiative Kiel Geoeconomics Initiative Kiel Centre for Globalization Overview Page Africa Initiative China Initiative Kiel Geoeconomics Initiative Kiel Centre for Globalization CareerOverview PageJob VacanciesEqual Opportunity Overview Page Job Vacancies Equal Opportunity Overview Page Job Vacancies Equal Opportunity Advanced Studies ProgramOverview PageStructure of our PhD programWhy choose our program?Outstanding professorsHow to applyTeam & Contact Overview Page Structure of our PhD program Why choose our program? Outstanding professors How to apply Team & Contact Overview Page Structure of our PhD program Why choose our program? Outstanding professors How to apply Team & Contact EventsOverview PageAll EventsInternational Business Cycle ForumConferencesPrizes and AwardsSeminars & WorkshopsIndividual ASP coursesGlobal China ConversationsBerlin Events Overview Page All Events International Business Cycle Forum Conferences Prizes and Awards Seminars & Workshops Individual ASP courses Global China Conversations Berlin Events Overview Page All Events International Business Cycle Forum Conferences Prizes and Awards Seminars & Workshops Individual ASP courses Global China Conversations Berlin Events For Media Twitter linkedin Bluesky Facebook youtube Kiel Institute Experts **Prof. Dr. Jens Boysen-Hogrefe** Topics: Business Cycle, Fiscal Policy & National Budgets, Tax Policy **Information** **Contact** @HogrefeJens **Main research interests** Forecasting Business Cycles Public Finance Jens Boysen-Hogrefe joined the Kiel Institute in 2008. Since 2011 he is member of the Working Party on Tax Revenue Estimates. He has worked on several consultancy projects in the field of business cycle research, forecasting and economic policy. He is also adjunct professor at the CAU Kiel. He teaches forecasting methods and econometrics. Journal ArticleIs the supermultiplier currently nil? - A replication study of Deleidi and Mazzucato (2021)Research Policy04/2025Boysen-Hogrefe, J. Journal Article **Is the supermultiplier currently nil? - A replication study of Deleidi and Mazzucato (2021)** Boysen-Hogrefe, J. Journal Article **Is the supermultiplier currently nil? - A replication study of Deleidi and Mazzucato (2021)** Boysen-Hogrefe, J. Journal Article **Is the supermultiplier currently nil? - A replication study of Deleidi and Mazzucato (2021)** Boysen-Hogrefe, J. Journal ArticlePost-processing for Bayesian analysis of reduced rank regression models with orthonormality restrictionsAStA Advances in Statistical Analysis01/2024Aßmann, C., Boysen-Hogrefe, … Journal Article **Post-processing for Bayesian analysis of reduced rank regression models with orthonormality restrictions** Aßmann, C., Boysen-Hogrefe, … Journal Article **Post-processing for Bayesian analysis of reduced rank regression models with orthonormality restrictions** Aßmann, C., Boysen-Hogrefe, … Journal Article **Post-processing for Bayesian analysis of reduced rank regression models with orthonormality restrictions** Aßmann, C., Boysen-Hogrefe, … Working PaperIs the supermultiplier nil? - A Replication Study of Deleidi and Mazzucato (2021)Kiel Working Paper05/2023DownloadBoysen-Hogrefe, J. Working Paper Boysen-Hogrefe, J. Working Paper Boysen-Hogrefe, J. Journal ArticleThe Impact of Forecast Errors on Fiscal Planning and Debt AccumulationJahrbücher für Nationalökonomie und Statistik03/2022Ademmer, M., Boysen-Hogrefe, … Journal Article **The Impact of Forecast Errors on Fiscal Planning and Debt Accumulation** Ademmer, M., Boysen-Hogrefe, … Journal Article **The Impact of Forecast Errors on Fiscal Planning and Debt Accumulation** Ademmer, M., Boysen-Hogrefe, … Journal Article **The Impact of Forecast Errors on Fiscal Planning and Debt Accumulation** Ademmer, M., Boysen-Hogrefe, … Policy ArticleWelcher Länderschlüssel passt? – Zur Aufteilung des Fiskalpakets auf die LänderKiel Policy Brief04/2025DownloadBoysen-Hogrefe, Jens Policy Article Boysen-Hogrefe, Jens Policy Article Boysen-Hogrefe, Jens Economic OutlookGerman Economy in Spring 2025: Fiscal policy turns up the heatKieler Konjunkturberichte03/2025DownloadBoysen-Hogrefe, J., Groll, … Economic Outlook Boysen-Hogrefe, J., Groll, … Economic Outlook Boysen-Hogrefe, J., Groll, … Economic OutlookGerman Forecast in Winter 2024: No Recovery in SightKieler Konjunkturbericht12/2024DownloadBoysen-Hogrefe, J., Groll, … Economic Outlook Boysen-Hogrefe, J., Groll, … Economic Outlook Boysen-Hogrefe, J., Groll, … Economic OutlookGerman Economy in Summer 2024: Recovery gets off to a slow startKieler Konjunkturberichte06/2024DownloadBeckmann, J., Boysen-Hogrefe, … Economic Outlook Beckmann, J., Boysen-Hogrefe, … Economic Outlook Beckmann, J., Boysen-Hogrefe, … © sarawuth - Fotolia.comProjectBig data in macroeconomicsThe purpose of the report is to provide a systematic overview of the relevant data related to Big Data and their potential for macroeconomic analysis (in particular business cycle monitoring and forecasting). In this context, both the possibilities and the challenges that may arise due to data availability, data quality, methodological requirements or the manageability of the data will be discussed in detail. Project **Big data in macroeconomics** The purpose of the report is to provide a systematic overview of the relevant data related to Big Data and their potential for macroeconomic analysis (in particular business cycle monitoring and forecasting). In this context, both the possibilities and the challenges that may arise due to data availability, data quality, methodological requirements or the manageability of the data will be discussed in detail. Project **Big data in macroeconomics** The purpose of the report is to provide a systematic overview of the relevant data related to Big Data and their potential for macroeconomic analysis (in particular business cycle monitoring and forecasting). In this context, both the possibilities and the challenges that may arise due to data availability, data quality, methodological requirements or the manageability of the data will be discussed in detail. Project **Big data in macroeconomics** The purpose of the report is to provide a systematic overview of the relevant data related to Big Data and their potential for macroeconomic analysis (in particular business cycle monitoring and forecasting). In this context, both the possibilities and the challenges that may arise due to data availability, data quality, methodological requirements or the manageability of the data will be discussed in detail. ProjectJoint Economic ForecastEmbedded in a comprehensive outlook for the world economy, the Joint Economic Forecast („Gemeinschaftsdiagnose“, GD) prepares in-debth analyses and forecasts for the German economy (detailed 2-year horizon and 5-year medium term projections including potential output estimations). These forecasts are input for the projections of the Federal Government in Germany. The forecasting exercise is carried out jointly by a group of economic research institutes. Based on the diagnostic results and taking into account important issues in the public debate on economic issues the institutes also come up with policy recommendations. Project **Joint Economic Forecast** Embedded in a comprehensive outlook for the world economy, the Joint Economic Forecast („Gemeinschaftsdiagnose“, GD) prepares in-debth analyses and forecasts for the German economy (detailed 2-year horizon and 5-year medium term projections including potential output estimations). These forecasts are input for the projections of the Federal Government in Germany. The forecasting exercise is carried out jointly by a group of economic research institutes. Based on the diagnostic results and taking into account important issues in the public debate on economic issues the institutes also come up with policy recommendations. Project **Joint Economic Forecast** Embedded in a comprehensive outlook for the world economy, the Joint Economic Forecast („Gemeinschaftsdiagnose“, GD) prepares in-debth analyses and forecasts for the German economy (detailed 2-year horizon and 5-year medium term projections including potential output estimations). These forecasts are input for the projections of the Federal Government in Germany. The forecasting exercise is carried out jointly by a group of economic research institutes. Based on the diagnostic results and taking into account important issues in the public debate on economic issues the institutes also come up with policy recommendations. Project **Joint Economic Forecast** Embedded in a comprehensive outlook for the world economy, the Joint Economic Forecast („Gemeinschaftsdiagnose“, GD) prepares in-debth analyses and forecasts for the German economy (detailed 2-year horizon and 5-year medium term projections including potential output estimations). These forecasts are input for the projections of the Federal Government in Germany. The forecasting exercise is carried out jointly by a group of economic research institutes. Based on the diagnostic results and taking into account important issues in the public debate on economic issues the institutes also come up with policy recommendations. © European Union 2018 - Source : EPProjectScientific advisory services to the European Parliament's Committee on Economic and Monetary Affairs supporting the Monetary Dialogue with the European Central BankSince March 2015 the Kiel Institute for the World Economy advises the European Parliament on issues related to monetary and economic policy. In particular the Kiel Institute prepares surveys on current issues of currency and monetary policies in the Euro Area in order to brace the European Parliament for regular discussions with the European Central Bank (EZB). Project **Scientific advisory services to the European Parliament's Committee on Economic and Monetary Affairs supporting the Monetary Dialogue with the European Central Bank** Since March 2015 the Kiel Institute for the World Economy advises the European Parliament on issues related to monetary and economic policy. In particular the Kiel Institute prepares surveys on current issues of currency and monetary policies in the Euro Area in order to brace the European Parliament for regular discussions with the European Central Bank (EZB). Project **Scientific advisory services to the European Parliament's Committee on Economic and Monetary Affairs supporting the Monetary Dialogue with the European Central Bank** Since March 2015 the Kiel Institute for the World Economy advises the European Parliament on issues related to monetary and economic policy. In particular the Kiel Institute prepares surveys on current issues of currency and monetary policies in the Euro Area in order to brace the European Parliament for regular discussions with the European Central Bank (EZB). Project **Scientific advisory services to the European Parliament's Committee on Economic and Monetary Affairs supporting the Monetary Dialogue with the European Central Bank** Since March 2015 the Kiel Institute for the World Economy advises the European Parliament on issues related to monetary and economic policy. In particular the Kiel Institute prepares surveys on current issues of currency and monetary policies in the Euro Area in order to brace the European Parliament for regular discussions with the European Central Bank (EZB). **Past Events** Icon/Placeholder/EVT-PageCreated with Sketch.Research SeminarGood Scientific Practice — E. Bode, J. Boysen-Hogrefe, C. Schweickhardt21.06.2022 Research Seminar **Good Scientific Practice — E. Bode, J. Boysen-Hogrefe, C. Schweickhardt** Research Seminar **Good Scientific Practice — E. Bode, J. Boysen-Hogrefe, C. Schweickhardt** Research Seminar **Good Scientific Practice — E. Bode, J. Boysen-Hogrefe, C. Schweickhardt** Icon/Placeholder/EVT-PageCreated with Sketch.Advanced Studies ProgramTime series forecasting: With an application to GDP - Jens Boysen-Hogrefe23.11.2020 Advanced Studies Program **Time series forecasting: With an application to GDP - Jens Boysen-Hogrefe** Advanced Studies Program **Time series forecasting: With an application to GDP - Jens Boysen-Hogrefe** Advanced Studies Program **Time series forecasting: With an application to GDP - Jens Boysen-Hogrefe** **Research Center** © shironosov/ istock.comResearch GroupBusiness Cycles and Growth Research Group **Business Cycles and Growth** Research Group **Business Cycles and Growth** Research Group **Business Cycles and Growth** © stock.adobe.com / PremreuthaiResearch CenterMacroeconomics Research Center **Macroeconomics** Research Center **Macroeconomics** Research Center **Macroeconomics** **Connect** Experts Job Vacancies Media **Our Topics** Subject dossiers compile selected publications and articles by our experts on current economic policy topics as well as related projects and events. Overview Subject Dossiers **Overview** About the Kiel Institute Research Centers Publications Events Twitter linkedin Bluesky Facebook youtube Legal Notice Privacy eAccessibility Cookie Settings **About Cookies** This site uses cookies for basic functionality and to improve content by analyzing anonymous user data. You can withdraw your consent at any time. For more information, please see ourPrivacy StatementandLegal Notice. **Mandatory** These cookies are needed for a smooth operation of our website. PurposeSaves your consent to using cookies. Lifetime1 year TypeHTML ProviderWebsite PurposeAssigns your browser to a session on the server. Lifetimesession TypeHTTP ProviderWebsite **streaming** PurposeIs used to connect to YouTube and to display videos. Lifetimenone TypeCookies, Local Storage, JavaScript ProviderYoutube, LLC, 901 Cherry Ave., San Bruno, CA 94066, USA und Google LLC, 901 Cherry Ave. San Bruno, CA 94066, USA; **Statistics**"}