{"id": 1559, "name": "WOI-DT - Des Moines News", "domain": "weareiowa.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.weareiowa.com/article/entertainment/television/programs/iowa-live/it-makes-all-the-difference-in-the-world-walk-through-your-new-home-or-business-before-you-build-at-walk-your-plans-des-moines-paid-content/524-3a529918-b9a5-419d-ab14-b3f903f9579b", "title": "It Makes All The Difference In The World Walk Through Your New Home Or Business Before You Build At Walk Your Plans Des Moines Paid Content", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocal NewsNear MeLocal PoliticsNation WorldArtist SpotlightHeartwarmingEntertainmentLatest News StoriesDes Moines man dies from injuries sustained in apartment fire TuesdayMan dies from injuries sustained in apartment fire near Merle Hay MallMan dies from injuries in apartment fire near Merle Hay Mall, authorities sayOne hurt, children rescued in apartment fire in Des Moines Tuesday Back Local News Near Me Local Politics Nation World Artist Spotlight Heartwarming Entertainment Des Moines man dies from injuries sustained in apartment fire TuesdayMan dies from injuries sustained in apartment fire near Merle Hay MallMan dies from injuries in apartment fire near Merle Hay Mall, authorities say One hurt, children rescued in apartment fire in Des Moines Tuesday Back Local News Near Me Local Politics Nation World Artist Spotlight Heartwarming Entertainment Des Moines man dies from injuries sustained in apartment fire TuesdayMan dies from injuries sustained in apartment fire near Merle Hay MallMan dies from injuries in apartment fire near Merle Hay Mall, authorities say One hurt, children rescued in apartment fire in Des Moines Tuesday WeatherBackToday's ForecastClosings and DelaysInteractive RadarWeather ImagesWeather LabWeather Lab ExperienceLatest Weather StoriesWEATHER IMPACT FORECAST: Severe storms possible tonightTropical Storm Barbara becomes a hurricane Back Today's Forecast Closings and Delays Interactive Radar Weather Images Weather Lab Weather Lab Experience WEATHER IMPACT FORECAST: Severe storms possible tonight Tropical Storm Barbara becomes a hurricane Back Today's Forecast Closings and Delays Interactive Radar Weather Images Weather Lab Weather Lab Experience WEATHER IMPACT FORECAST: Severe storms possible tonight Tropical Storm Barbara becomes a hurricane SportsBackFriday Night BlitzLocal SportsIowa State CyclonesIowa HawkeyesIndiana FeverLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawThe Pacers are in the NBA Finals. The Fever have Caitlin Clark. In Indy, basketball is booming Back Friday Night Blitz Local Sports Iowa State Cyclones Iowa Hawkeyes Indiana Fever Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law The Pacers are in the NBA Finals. The Fever have Caitlin Clark. In Indy, basketball is booming Back Friday Night Blitz Local Sports Iowa State Cyclones Iowa Hawkeyes Indiana Fever Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law The Pacers are in the NBA Finals. The Fever have Caitlin Clark. In Indy, basketball is booming SearchSearch:Search Advertise With Us Today's Forecast WeAreIowa+ Iowa Live Good Morning Iowa Indiana Fever Meet The Team Contact Us Gas Prices Local Politics Weather Lab Experience Contests TV Schedule Signal Rescan Positive News **\"It makes all the difference in the world!\" Walk through your new home or business BEFORE you build at Walk Your Plans Des Moines | Paid Content** **** To stream WeAreIowa on your phone, you need the WeAreIowa app. **** **Download the WeAreIowa app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Walk Your Plans Des Moines(WYP), an immersive projection studio for builders to experience life-size floor plans, is the first of its kind in the state of Iowa. The company offers a new way for architects, builders, designers, and landscape professionals to present 2-D plan drawings to their respective clients. WYP Des Moines utilizes state-of-the-art laser projection systems to provide unique interactive capabilities between building plans and the end user. The Grimes location is the first in Iowa. “Pre-construction in Iowa will never be the same,” said James Machamer, Iowa Native and Co-Owner of Walk Your Plans Des Moines. “As someone who has worked in and around the construction industry, I firmly believe this will drastically change any pre-construction process.” WYP Des Moines encourages anyone in the pre-construction phase of a project to plan with confidence and build with precision. Commercial and custom home builders can experience their floor plans to make changes before construction and reduce costly change orders. The new facility empowers stakeholders to experience plans in a new collaborative way. Walk Your Plans Des Moines is an expansive 7,000-square-foot facility. The space includes an office area featuring a welcoming lobby, a comfortable seating lounge, and a fully outfitted conference room. The remaining space is dedicated to our cutting-edge design studio, where clients can walk through their plans using our immersive projection system to visualize and perfect their floor plans before construction. The space will also be used for private events. James and Lorie Machamer are now open. James, a retired Navy Veteran with significant residential and commercial construction experience, pairs perfectly with Lorie’s dynamic background in sales leadership and operations. The company has already built a healthy roster of industry partners in the Iowa homebuilding, commercial construction, architecture, interior design, and home renovation sectors. WYP Des Moines will have several open houses and ribbon cuttings in June, with the firstopen house June 13th, 4-6 pm. **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}