{"id": 623, "name": "Harlan Enterprise", "domain": "harlanenterprise.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://harlanenterprise.net/2025/05/27/lady-dragons-break-down-another-barrier-with-regional-tourney-win/", "title": "Lady Dragons Break Down Another Barrier With Regional Tourney Win", "content": "Home E-Edition News Sports Opinion Obituaries Features Classifieds Public Notices Contests Calendar Services Home News Sports Opinion Obituaries Features Classifieds Public Notices Contests Calendar ServicesAbout UsPoliciesNews TipSubmit PhotoEngagement AnnouncementWedding AnnouncementAnniversary AnnouncementLetter to EditorSubmit an ObituaryPay Subscription About Us Policies News Tip Submit Photo Engagement Announcement Wedding Announcement Anniversary Announcement Letter to Editor Submit an Obituary Pay Subscription About Us Policies News Tip Submit Photo Engagement Announcement Wedding Announcement Anniversary Announcement Letter to Editor Submit an Obituary Pay Subscription E-Edition **Harlan breaks down another barrier with regional victory** Published 9:37 am Tuesday, May 27, 2025 ByJohn Henson By John HensonSports Writer CORBIN — Another win is yet another first for the Harlan Lady Dragons, who have made a habit of breaking down barriers in their high school careers.Harlan won back-to-back 52nd District titles for the first time with a win last week over Harlan County. The Lady Dragons earned their first 13th Region Tournament win (at least going back to available KHSAA records through 2001) with a 6-2 victory over Knox Central on Monday at Corbin.“When coach (David Overbay) and I got here four years ago, that’s what we’ve been working toward – the region and be able to come down here and compete. We’ve come close the last two years,” Harlan assistant coach Scott Lisenbee said. “We had never been two years in a row, and now it’s three, so we finally broke through. We’re happy for these girls, but as we like to say we aren’t done.”Senior first baseman Abbi Fields led the 18-8 Lady Dragons with two-run homer in the second inning and an RBI single in the fourth inning. Addison Jackson had a double and single. Ella Farley and Ella Lisenbee added two singles each. Jordyn Smith, Jalynn Wynn and Addison Campbell contributed one single each.“Abbi was big tonight with that shot that I think is still going,” said Lisenbee. “She kept us off balance at times with the changeup, but we did enough to win.”Smith was in control in the circle as she gave up two runs on five hits with six strikeouts and no walks. The Lady Dragons were also solid defensively with only one error.“I’m super proud of Jordyn. The way she has progressed from last year to this year is amazing,” Lisenbee said.Harlan ran itself out of scoring in the first inning despite hits from Farley and Smith as both were cut down on the bases.Jackson opened the second with a single and trotted home on Fields’ blast to left-center. Wynn and Campbell followed with one-out singles, then Gracie Hensley walked to load the bases. Farley drove in a run with a line drive into center that turned into a fielder’s choice when Hensley was forced out at second.Lisenbee singled to open the third and came home on Jackson’s double. Ava Nunez pushed the Harlan lead to 5-0 with a sacrifice fly.Knox’s Jayme Swafford tripled in the fourth inning and scored on Hannah Milton’s hit.Harlan got the run back in the bottom of the inning as Smith walked, moved to second on Lisenbee’s hit and scored on a single by Fields.Aubrey Jones singled for Knox in the seventh inning and scored the game’s last run on a hit by Emily Jordan.Harlan will play Jackson County in the regional semifinals on Tuesday at 8 p.m. as the Lady Dragons seek another first by advancing to a regional championship game for the first time.———Knox Central 000 100 1 — 2 6. 3Harlan 032 100 x — 6 11.1Castle and Melton; Smith and Jackson. WP — Smith (17-8). LP — Castle. HR — Fields (3). **Email newsletter signup** **You Might Like** **Star of Stars — HC’s Huff thrives in Kentucky-Indiana series** **Star of Stars — HC’s Huff thrives in Kentucky-Indiana series** **Harlan County Entrepreneur Don Parsons passes away** **Harlan County Entrepreneur Don Parsons passes away** **Black Bears win summer scrimmage at Whitley County** **Black Bears win summer scrimmage at Whitley County** **Newest Cat grew up a fan** **Newest Cat grew up a fan** Home News Sports Obituaries Opinion Contests Classifieds Small Business E-Edition Subscriptions News Tip Submit Photo Submit Sports Story Letter to Editor Public Notices About Us Terms of Use"}