{"id": 1271, "name": "SOFREP", "domain": "sofrep.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sofrep.com/sofrep-radio/episode-719-frontline-stories-untold-histories-melissa-ziobro-director-of-public-history-monmouth-university/", "title": "Episode 719 Frontline Stories Untold Histories Melissa Ziobro Director Of Public History Monmouth University", "content": "THANK YOU FOR SUPPORTING VETERAN JOURNALISM - JOIN SOFREP →Support Veteran Journalism → JOIN NOWLogin News Videos Podcast Book Club Get Published Speakers Store Advertise Expert Analysis Military Defense Tech Entertainment SOF Units Navy Army Marines Space Force Military History Community Forums Community Chat Free E-Books Videos Podcast Books New Arrivals Gear Kits Apparel See Companies Latest NewsLatest NewsMilitary NewsExpert AnalysisEntertainmentVeteran Culture Latest News Military News Expert Analysis Entertainment Veteran Culture Latest News Military News Expert Analysis Entertainment Veteran Culture Members Only Podcast Book Club Get Published Videos Military Ranks SOF Units Gear Reviews Speakers Advertise Store Login Work with us Help & Feedback Submit an Article shop **Frontline Stories & Untold Histories: Melissa Ziobro Director of Public History Monmouth University** **Frontline Stories & Untold Histories: Melissa Ziobro Director of Public History Monmouth University** Melissa Ziobro began her career as a civilian historian, archivist, and curator for the US Army in 2004 prior to returning to her alma mater, Monmouth University, to teach full-time. She has taught over a dozen different courses, including Intro to Public History; Oral History; Museums and Archives Management Basics; NJ History; and the Vietnam War. In August of 2023, she became curator of the University’s Bruce Springsteen Archives & Center for American Music, after having worked with the Center for many years in her faculty role (to include curating the Center’s first traveling exhibit, Springsteen: His Hometown, with the Monmouth County Historical Association in 2019). Her most recent publications include Fort Monmouth: The US Army’s House of Magic (2024) and The Battlin’ Bastards of Bravo: Bravo Company, 1/506th, 101st Airborne, in Vietnam and Beyond (2025). As someone who’s seen what happens when the truth is distorted, I know how unfair it feels when those who’ve sacrificed the most lose their voice. At SOFREP, our veteran journalists, who once fought for freedom, now fight to bring you unfiltered, real-world intel. But without your support, we risk losing this vital source of truth. By subscribing, you’re not just leveling the playing field—you’re standing with those who’ve already given so much, ensuring they continue to serve by delivering stories that matter. Every subscription means we can hire more veterans and keep their hard-earned knowledge in the fight. Don’t let their voices be silenced. Please consider subscribing now. One team, one fight,Brandon Webb former Navy SEAL, Bestselling Author and Editor-in-Chief **COMMENTS** There areon this article. You must become asubscriberorloginto view or post comments on this article. How to Annihilate a U.S. Air Base with a $100 Drone: A SEAL TEAM Red Cell Fever Dream How to Annihilate a U.S. Air Base with a $100 Drone: A SEAL TEAM Red Cell Fever Dream Geo Hand: Enlisted vs Officers in Delta Force – A Double Standard? Geo Hand: Enlisted vs Officers in Delta Force – A Double Standard? Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting Quiet Skies No More: Trump Axes TSA’s $200 Million Covert Surveillance Spectacle Quiet Skies No More: Trump Axes TSA’s $200 Million Covert Surveillance Spectacle Jerry9·Douglas made some great aircraft . I used to charter DC-3’S up until the 80’s . The best thing a...SOFREP Pic of The Day: An A-1 Skyraider Over Vietnam · 5 hours ago Jerry9· SOFREP Pic of The Day: An A-1 Skyraider Over Vietnam · 5 hours ago Jerry9· Jerry9· SOFREP Pic of The Day: An A-1 Skyraider Over Vietnam · 5 hours ago Jerry9·back in the day when smoking was a thing on flights it was cool , no need these days as you can not...Quiet Skies No More: Trump Axes TSA’s $200 Million Covert Surveillance Spectacle · 5 hours ago Jerry9· Quiet Skies No More: Trump Axes TSA’s $200 Million Covert Surveillance Spectacle · 5 hours ago Jerry9· Jerry9· Quiet Skies No More: Trump Axes TSA’s $200 Million Covert Surveillance Spectacle · 5 hours ago Cameron Curtis·This looks to happen. U.S. Naval Forces Command in Bahrain — home to the 5th Fleet and CENTCOM —...Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 7 hours ago Cameron Curtis· Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 7 hours ago Cameron Curtis· Cameron Curtis· Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 7 hours ago Michael P.·Ken - Wow! Well said.What’s in a Name? The USNS Harvey Milk and the Case for Depoliticizing U.S. Warships · 8 hours ago Michael P.· What’s in a Name? The USNS Harvey Milk and the Case for Depoliticizing U.S. Warships · 8 hours ago Michael P.· Michael P.· What’s in a Name? The USNS Harvey Milk and the Case for Depoliticizing U.S. Warships · 8 hours ago Cameron Curtis·The march to an Iran war: Brett, this troubles me. Personally, I’d give them the 3.5% enrichment o...Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 10 hours ago Cameron Curtis· Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 10 hours ago Cameron Curtis· Cameron Curtis· Evening Brief: Lawmakers Grill Defense Secretary Hegseth Over Troop Deployment, Gunman Kills 10 in Austria’s Deadliest School Shooting · 10 hours ago Brandon WebbEditor-in-Chief, Former Navy SEAL Brandon Webb Brandon Webb Brandon Webb Guy D. McCardleManaging Editor, Former US Army Guy D. McCardle Guy D. McCardle Guy D. McCardle George E. Hand IVContributor, Former Delta Force George E. Hand IV George E. Hand IV George E. Hand IV General Don BolducContributor, Former US Army General General Don Bolduc General Don Bolduc General Don Bolduc Dr. Bob AdamsContributor, Former US Navy SEAL Dr. Bob Adams Dr. Bob Adams Dr. Bob Adams **Join SOFREP Team Room for Insider Access and Analysis** Your Subscription Supports our Veteran Staff **LATEST FROM LOADOUT ROOM** **VETERAN-FRIENDLY COMPANIES** **Barrett Firearms** Barrett is the world leader in long-range, large-caliber, precision rifle design and manufacturing. Barrett products are used by civilians, sport shooters, law enforcement agencies, the United States military, and more than 75 State Department-approved countries around the world. [email protected] 615-896-2938 Visit Website PO Box 1077 MURFREESBORO, Tennessee 37133 United States **Scrubba Wash Bag** Our ultra-portable washing machine makes your journey easier. This convenient, pocket-sized travel companion allows you to travel lighter while helping you save money, time and water. [email protected] Visit Website **Pyramyd Air** Our roots in shooting sports started off back in 1996 with our founder and CEO, Josh Ungier. His love of airguns took hold of our company from day one and we became the first e-commerce retailer dedicated to airguns, optics, ammo, and accessories. Over the next 25 years, customers turned to us for our unmatched product selection, great advice, education, and continued support of the sport and airgun industry. [email protected] 888-262-4867 Visit Website 5135 Naiman Parkway Solon, OH 44139 **RecPak** RecPak is a meal replacement for the outdoors that saves you weight, space and time in the most challenging environments, just add water. [email protected] Visit Website P.O. Box 378 Red Hook, New York 12571 United States **US Military Ranks** **US ARMY RANKS** **US ARMY RANKS** **US MARINE CORPS RANKS** **US MARINE CORPS RANKS** **US AIR FORCE RANKS** **US AIR FORCE RANKS** **US SPACE FORCE RANKS** **US SPACE FORCE RANKS** **US NAVY RANKS** **US NAVY RANKS** **US COAST GUARD RANKS** **US COAST GUARD RANKS** Members Only News Media Book Club Get Published Press Access SOFREP 300 Store Sign-In About Terms of Use Privacy Policy Contact © 2025 Military Content Group. All Rights Reserved."}