{"id": 691, "name": "The Intergovernmental Panel on Climate Change (IPCC)", "domain": "ipcc.ch", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ipcc.ch/report/2019-refinement-to-the-2006-ipcc-guidelines-for-national-greenhouse-gas-inventories/", "title": "2019 Refinement To The 2006 Ipcc Guidelines For National Greenhouse Gas Inventories", "content": "About Data Documentation Focal Points Portal Bureau Portal Library Links Help عربي 简体中文 Français Русский Español Reports Synthesis Report Working Groups Activities News Calendar 2027 IPCC Methodology Report on Inventories for Short-lived Climate Forcers Special Report on Climate Change and Cities Global Warming of 1.5°C Climate Change and Land 2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories The Ocean and Cryosphere in a Changing Climate AR6 Synthesis Report: Climate Change 2023 AR6 Climate Change 2022: Impacts, Adaptation and Vulnerability AR6 Climate Change 2022: Mitigation of Climate Change AR6 Climate Change 2021: The Physical Science Basis AR5 Synthesis Report: Climate Change 2014 AR5 Climate Change 2013: The Physical Science Basis AR5 Climate Change 2014: Impacts, Adaptation, and Vulnerability AR5 Climate Change 2014: Mitigation of Climate Change About Reports Resources Activities News Co-Chairs Vice Chairs TSU Staff Contact About Reports Activities News Co-Chairs Vice-Chairs TSU Staff Contact About Reports Activities News Co-Chairs Vice-Chairs TSU Staff Contact About Methodology Reports Activities IPCC Inventory software Emission Factor Database TFI Governance TFB Co-Chairs TFB Members TSU Staff Contact **2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories** **2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories** Report **Report** The2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventorieswas adopted and accepted during the 49th Session of the IPCC in May 2019. It was prepared by the Task Force on National Greenhouse Gas Inventories (TFI) in accordance with the decision taken at the 44th Session of IPCC in Bangkok, Thailand, in October 2016. The2019 Refinementwas considered in May 2019 during the IPCC’s 49th Session (Kyoto, Japan) and adopted/accepted on 12 May 2019 (Decision – IPCC-XLIX-9 – Adoption and Acceptance of 2019 refinement). Approved outline The final volumes are available on theTFI website 2019 Refinement fact sheet **Supporting material for the 2019 Refinement** **Background information on the development of the 2019 Refinement** The 26th Meeting of Task Force Bureau (TFB) (28 – 29 August 2014, Ottawa) concluded that: The2006 IPCC Guidelines for National Greenhouse Gas Inventories (2006 IPCC Guidelines)provide a technically sound methodological basis of national greenhouse gas inventories, and therefore fundamental revision is unnecessary. To maintain the scientific validity of the2006 IPCC Guidelines, certain refinements may be required, taking into account scientific and other technical advances that have matured sufficiently since 2006. Following these conclusions by the TFB and approval by the IPCC at its 40th Session, the TFI started a technical assessment of IPCC Inventory Guidelines through an on-line questionnaire survey and four expert meetings in 2015 and 2016. The Co-Chairs’ summaries of these four meetings can be found below in the Supporting Documents section. The technical assessment revealed that there has been abundant new scientific and empirical knowledge published since 2006 which the IPCC should take into account, particularly with respect to data for emissions factor development for some categories and gases. Consequently, the necessity and usefulness of refining the current methodological guidance (e.g. updating default emission factors) has been recognized by TFB. Such refinement will help all UNFCCC Parties use good practice inventory methodologies based on up-to-date scientific knowledge. Based on thedecision of the IPCC at its 43rd session in April 2016, a Scoping Meeting was held to prepare an outline of the Methodology Report to refine the2006 IPCC Guidelines. The conclusions of this Scoping Meeting were submitted to the IPCC for consideration at its 44th Session. At this session, IPCC decided(Decision IPCC/XLIV-5)to prepare a Methodology Report with the following title and format: The format should beone single Methodology Reportcomprising an Overview Chapter and five volumes following the format of the2006 IPCC Guidelines for National Greenhouse Gas Inventories (2006 IPCC Guidelines). The title of the Methodology Report should be“2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories”. The decision also included a Draft Table of Contents (TOC) and“Terms of Reference for the production of a Methodology Report to refine the 2006 IPCC Guidelines for National Greenhouse Gas Inventories”(TOR). The overall aim is to provide an updated and sound scientific basis for supporting the preparation and continuous improvement of national GHG inventories. The2019 Refinementwas not to revise the2006 IPCC Guidelines, but update, supplement and/or elaborate the2006 IPCC Guidelineswhere gaps or out-of-date science have been identified. It will not replace the2006 IPCC Guidelines. It should be used in conjunction with the2006 IPCC Guidelines. From the 328 nominations received from governments, observer organizations and Bureau members, 190 experts were selected as Authors and Review Editors by the TFB in accordance with the Principles Governing IPCC Work. The authors started drafting the2019 Refinementat the First Lead Author Meeting in June 2017 in Bilbao, Spain. The final draft was considered by the IPCC for adoption/acceptance at its 49th Plenary Session in May 2019. **Timeline** * As to peer-reviewed papers, those accepted by the journals by 25 June 2018, even if not yet published, can be used in the 2019 Refinement. As to non-peer-reviewed documents, those made publicly available by 25 June 2018 can be used. The Intergovernmental Panel on Climate Change (IPCC) is active socially – choose your network: There are many ways to be involved and participate in the IPCC world. Learn more About Copyright Disclaimer Privacy Policy **Reports** 2027 IPCC Methodology Report on Inventories for Short-lived Climate Forcers Special Report on Climate Change and Cities Global Warming of 1.5°C Climate Change and Land 2019 Refinement to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories The Ocean and Cryosphere in a Changing Climate AR6 Synthesis Report: Climate Change 2023 AR6 Climate Change 2022: Impacts, Adaptation and Vulnerability AR6 Climate Change 2022: Mitigation of Climate Change AR6 Climate Change 2021: The Physical Science Basis AR5 Synthesis Report: Climate Change 2014 AR5 Climate Change 2013: The Physical Science Basis AR5 Climate Change 2014: Impacts, Adaptation, and Vulnerability AR5 Climate Change 2014: Mitigation of Climate Change **Working Groups** About Reports Resources Activities News Co-Chairs Vice Chairs TSU Staff Contact About Reports Activities News Co-Chairs Vice-Chairs TSU Staff Contact About Reports Activities News Co-Chairs Vice-Chairs TSU Staff Contact About Methodology Reports Activities IPCC Inventory software Emission Factor Database TFI Governance TFB Co-Chairs TFB Members TSU Staff Contact **Activities** The Technical Support Unit of the IPCC Task Force on National Greenhouse Gas Inventories (TFI TSU) wishes to recruit for … With great sadness, the Intergovernmental Panel on Climate Change (IPCC) has learned of the death of Dr Mannava V.K. Sivakumar, … GENEVA, Mar 24 – Over 100 experts from more than 40 countries are meeting in Bilbao, Spain this week for …"}