{"id": 1578, "name": "WHDH - Boston News", "domain": "whdh.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://whdh.com/news/law-enforcement-expert-lack-of-communication-between-agencies-amid-la-protests-is-opportunity-for-disaster/", "title": "Law Enforcement Expert Lack Of Communication Between Agencies Amid La Protests Is Opportunity For Disaster", "content": "NewsLocalRegionalOn Air Live StreamBreaking News Live StreamUS & World7 InvestigatesPoliticsEntertainmentMust SeeArea TrafficSolve It 77News Team7News on Social Media Local Regional On Air Live Stream Breaking News Live Stream US & World 7 Investigates Politics Entertainment Must See Area Traffic Solve It 7 7News Team 7News on Social Media Local Regional On Air Live Stream Breaking News Live Stream US & World 7 Investigates Politics Entertainment Must See Area Traffic Solve It 7 7News Team 7News on Social Media Weather7 Day ForecastVideo ForecastInteractive RadarWeather BlogWatches and Warnings 7 Day Forecast Video Forecast Interactive Radar Weather Blog Watches and Warnings 7 Day Forecast Video Forecast Interactive Radar Weather Blog Watches and Warnings ClosingsStorm Closings & DelaysHow to register your school/organization for closings and delays Storm Closings & Delays How to register your school/organization for closings and delays Storm Closings & Delays How to register your school/organization for closings and delays SportsAll sportsRed SoxPatriotsBruinsCeltics All sports Red Sox Patriots Bruins Celtics All sports Red Sox Patriots Bruins Celtics …CW56Channel 7 FoundationCommunity CalendarReal Estate UpdateInternshipsEmployment OpportunitiesAdvertise With UsContact UsNews TipsMobile AppsWHDH TV ListingsCW56 TV Listing CW56 Channel 7 Foundation Community Calendar Real Estate Update Internships Employment Opportunities Advertise With Us Contact Us News Tips Mobile Apps WHDH TV Listings CW56 TV Listing CW56 Channel 7 Foundation Community Calendar Real Estate Update Internships Employment Opportunities Advertise With Us Contact Us News Tips Mobile Apps WHDH TV Listings CW56 TV Listing **Law enforcement expert: Lack of communication between agencies amid LA protests is ‘opportunity for disaster’** Withtensions rising amid protests in Los Angeles, some experts say bringing in National Guard troops could make the situation worse. 7News law enforcement expert Todd McGhee says local and regional law enforcement agencies already know how to communicate with each other and that the National Guard would best be served taking its cues from California officials to keep the response coordinated. In such a heightened situation, McGhee says that a lack of communication between agencies can create a dangerous situation. “Typically, when you have outside resources into a municipality, that is a coordinated response from the level of the governor’s office. It appears that White House had deployed these troops as an unwelcomed resource. This could be problematic on the ground, because you don’t have proper coordination. Anytime you have an incident like this, there’s always Incident Command to allow the responding agencies to coordinate,” McGhee said. “Whenever you have any type of conflicting objective, that’s an opportunity for a disaster. So, hopefully cooler heads will prevail, allow Governor [Gavin] Newsom to make those decisions moving forward, and allow different agencies at municipal, state, and county level to be able to coordinate and work together and to be able to bring some type of quell to the rioting that’s happening,” he continued. McGhee says people have a right to assemble, as long as it is done safely. (Copyright (c) 2024 Sunbeam Television. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.) **Trending** 7WEATHER: Another warm one ‘It’s brutal’: Community mourns loss of Bedford, NH teenager Elon Musk backs off from feud with Trump, saying he regrets social media posts that ‘went too far’ Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case Trump says US gets rare earth minerals from China in trade deal, tariffs on Chinese goods go to 55% Liberty Hotel facing complaint over treatment of 2 women in bathroom WHDH TV 7NEWS WLVI TV CW56Sunbeam Television Corp7 Bulfinch PlaceBoston, MA 02114News Tips: (800) 280-TIPSTell Hank: (855) 247-HANK Join us Mobile Apps News Tips WHDH TV Listings CW56 TV Listing Community Calendar Channel 7 Foundation Advertise With Us Contact Us Internships Employment Opportunities Privacy Policy Terms of Service Children’s Programming Closed Captioning Concerns EEO Public File WHDH FCC Public File WLVI FCC Public File All content © Copyright 2000 - 2025 WHDH-TV. WHDH broadcast educational and informational programming for children, and file quarterly reports with the FCC detailing the station's outreach to children. The public may view the reports by going toWHDH.comand clicking on \"FCC Public File\", or by visiting the FCC's website atFCC.org. For more information on this site, please read ourPrivacy Policy, andTerms of Service."}