{"id": 181, "name": "CalWatchdog.com", "domain": "calwatchdog.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://calwatchdog.com/2019/11/25/gov-newsom-suspends-new-fracking-permits-in-latest-attempt-to-reduce-greenhouse-gas-emissions/", "title": "Gov Newsom Suspends New Fracking Permits In Latest Attempt To Reduce Greenhouse Gas Emissions", "content": "About CalWatchdog Donate Contact Us Home Breaking NewsRecent PostsConfusion abounds as California’s online privacy law kicks inCalifornia cities struggle with implications of homeless rulingProspects of PG&E Takeover in 2020Are tech firms favored on concealed weapon permits in Santa Clara County?New round of DMV ‘motor voter’ errors reportedUniversity of California looks likely to drop SAT, ACT requirement Recent PostsConfusion abounds as California’s online privacy law kicks inCalifornia cities struggle with implications of homeless rulingProspects of PG&E Takeover in 2020Are tech firms favored on concealed weapon permits in Santa Clara County?New round of DMV ‘motor voter’ errors reportedUniversity of California looks likely to drop SAT, ACT requirement Confusion abounds as California’s online privacy law kicks in California cities struggle with implications of homeless ruling Prospects of PG&E Takeover in 2020 Are tech firms favored on concealed weapon permits in Santa Clara County? New round of DMV ‘motor voter’ errors reported University of California looks likely to drop SAT, ACT requirement Recent PostsConfusion abounds as California’s online privacy law kicks inCalifornia cities struggle with implications of homeless rulingProspects of PG&E Takeover in 2020Are tech firms favored on concealed weapon permits in Santa Clara County?New round of DMV ‘motor voter’ errors reportedUniversity of California looks likely to drop SAT, ACT requirement Confusion abounds as California’s online privacy law kicks in California cities struggle with implications of homeless ruling Prospects of PG&E Takeover in 2020 Are tech firms favored on concealed weapon permits in Santa Clara County? New round of DMV ‘motor voter’ errors reported University of California looks likely to drop SAT, ACT requirement Confusion abounds as California’s online privacy law kicks in California cities struggle with implications of homeless ruling Prospects of PG&E Takeover in 2020 Are tech firms favored on concealed weapon permits in Santa Clara County? New round of DMV ‘motor voter’ errors reported University of California looks likely to drop SAT, ACT requirement InvestigationsIn-Depth InvestigationsNew report alleges work abuses by Apple’s Chinese suppliersWomen poised for modest gains in legislative racesWhat initiatives are on the November ballot?How much taxpayers lose in special electionsCritics demand accountability for education-funding tax prior to extension vote24 years of Caltrans well-drilling ignored laws; risked groundwater contamination In-Depth InvestigationsNew report alleges work abuses by Apple’s Chinese suppliersWomen poised for modest gains in legislative racesWhat initiatives are on the November ballot?How much taxpayers lose in special electionsCritics demand accountability for education-funding tax prior to extension vote24 years of Caltrans well-drilling ignored laws; risked groundwater contamination New report alleges work abuses by Apple’s Chinese suppliers Women poised for modest gains in legislative races What initiatives are on the November ballot? How much taxpayers lose in special elections Critics demand accountability for education-funding tax prior to extension vote 24 years of Caltrans well-drilling ignored laws; risked groundwater contamination In-Depth InvestigationsNew report alleges work abuses by Apple’s Chinese suppliersWomen poised for modest gains in legislative racesWhat initiatives are on the November ballot?How much taxpayers lose in special electionsCritics demand accountability for education-funding tax prior to extension vote24 years of Caltrans well-drilling ignored laws; risked groundwater contamination New report alleges work abuses by Apple’s Chinese suppliers Women poised for modest gains in legislative races What initiatives are on the November ballot? How much taxpayers lose in special elections Critics demand accountability for education-funding tax prior to extension vote 24 years of Caltrans well-drilling ignored laws; risked groundwater contamination New report alleges work abuses by Apple’s Chinese suppliers Women poised for modest gains in legislative races What initiatives are on the November ballot? How much taxpayers lose in special elections Critics demand accountability for education-funding tax prior to extension vote 24 years of Caltrans well-drilling ignored laws; risked groundwater contamination BlogRecent PostsCBD 101 – Everything You Need to Know About CBDFull-Spectrum CBD or CBD Isolate?All About CBD & THCCBD Infused CoffeeFrequently Asked Question About CBD SalvesSteps for Identifying Good Quality CBD ProductsPolitics and ElectionsTom Steyer impeachment push sets him up for Feinstein challengeEric Garcetti – like Kamala Harris – may have White House on mindCalifornia Democrats brace for intra-party battle after Kevin de León announces bid to unseat FeinsteinAfter Feinstein announces run for re-election, progressives push for a primary challengerOfficials wrestle with ways to boost California’s voter turnoutWith move to ‘Super Tuesday,’ California looks to increase influence on presidential primaryRights and LibertiesCA Legislature may restore internet privacy rights rolled back by WashingtonNew criminal justice reform focus: Harsh bail lawsGun sales spike before California law hitsBail reform tops criminal-justice efforts in next legislative sessionGov. Jerry Brown signs host of significant legislationMixed reviews for Gov. Brown on actor age database law Recent PostsCBD 101 – Everything You Need to Know About CBDFull-Spectrum CBD or CBD Isolate?All About CBD & THCCBD Infused CoffeeFrequently Asked Question About CBD SalvesSteps for Identifying Good Quality CBD Products CBD 101 – Everything You Need to Know About CBD Full-Spectrum CBD or CBD Isolate? All About CBD & THC CBD Infused Coffee Frequently Asked Question About CBD Salves Steps for Identifying Good Quality CBD Products Politics and ElectionsTom Steyer impeachment push sets him up for Feinstein challengeEric Garcetti – like Kamala Harris – may have White House on mindCalifornia Democrats brace for intra-party battle after Kevin de León announces bid to unseat FeinsteinAfter Feinstein announces run for re-election, progressives push for a primary challengerOfficials wrestle with ways to boost California’s voter turnoutWith move to ‘Super Tuesday,’ California looks to increase influence on presidential primary Tom Steyer impeachment push sets him up for Feinstein challenge Eric Garcetti – like Kamala Harris – may have White House on mind California Democrats brace for intra-party battle after Kevin de León announces bid to unseat Feinstein After Feinstein announces run for re-election, progressives push for a primary challenger Officials wrestle with ways to boost California’s voter turnout With move to ‘Super Tuesday,’ California looks to increase influence on presidential primary Rights and LibertiesCA Legislature may restore internet privacy rights rolled back by WashingtonNew criminal justice reform focus: Harsh bail lawsGun sales spike before California law hitsBail reform tops criminal-justice efforts in next legislative sessionGov. Jerry Brown signs host of significant legislationMixed reviews for Gov. Brown on actor age database law CA Legislature may restore internet privacy rights rolled back by Washington New criminal justice reform focus: Harsh bail laws Gun sales spike before California law hits Bail reform tops criminal-justice efforts in next legislative session Gov. Jerry Brown signs host of significant legislation Mixed reviews for Gov. Brown on actor age database law Recent PostsCBD 101 – Everything You Need to Know About CBDFull-Spectrum CBD or CBD Isolate?All About CBD & THCCBD Infused CoffeeFrequently Asked Question About CBD SalvesSteps for Identifying Good Quality CBD Products CBD 101 – Everything You Need to Know About CBD Full-Spectrum CBD or CBD Isolate? All About CBD & THC CBD Infused Coffee Frequently Asked Question About CBD Salves Steps for Identifying Good Quality CBD Products CBD 101 – Everything You Need to Know About CBD Full-Spectrum CBD or CBD Isolate? All About CBD & THC CBD Infused Coffee Frequently Asked Question About CBD Salves Steps for Identifying Good Quality CBD Products Politics and ElectionsTom Steyer impeachment push sets him up for Feinstein challengeEric Garcetti – like Kamala Harris – may have White House on mindCalifornia Democrats brace for intra-party battle after Kevin de León announces bid to unseat FeinsteinAfter Feinstein announces run for re-election, progressives push for a primary challengerOfficials wrestle with ways to boost California’s voter turnoutWith move to ‘Super Tuesday,’ California looks to increase influence on presidential primary Tom Steyer impeachment push sets him up for Feinstein challenge Eric Garcetti – like Kamala Harris – may have White House on mind California Democrats brace for intra-party battle after Kevin de León announces bid to unseat Feinstein After Feinstein announces run for re-election, progressives push for a primary challenger Officials wrestle with ways to boost California’s voter turnout With move to ‘Super Tuesday,’ California looks to increase influence on presidential primary Tom Steyer impeachment push sets him up for Feinstein challenge Eric Garcetti – like Kamala Harris – may have White House on mind California Democrats brace for intra-party battle after Kevin de León announces bid to unseat Feinstein After Feinstein announces run for re-election, progressives push for a primary challenger Officials wrestle with ways to boost California’s voter turnout With move to ‘Super Tuesday,’ California looks to increase influence on presidential primary Rights and LibertiesCA Legislature may restore internet privacy rights rolled back by WashingtonNew criminal justice reform focus: Harsh bail lawsGun sales spike before California law hitsBail reform tops criminal-justice efforts in next legislative sessionGov. Jerry Brown signs host of significant legislationMixed reviews for Gov. Brown on actor age database law CA Legislature may restore internet privacy rights rolled back by Washington New criminal justice reform focus: Harsh bail laws Gun sales spike before California law hits Bail reform tops criminal-justice efforts in next legislative session Gov. Jerry Brown signs host of significant legislation Mixed reviews for Gov. Brown on actor age database law CA Legislature may restore internet privacy rights rolled back by Washington New criminal justice reform focus: Harsh bail laws Gun sales spike before California law hits Bail reform tops criminal-justice efforts in next legislative session Gov. Jerry Brown signs host of significant legislation Mixed reviews for Gov. Brown on actor age database law VideoVideoVIDEO: Republicans can be environmentalists, tooVIDEO: How Republicans can maintain relevance in CaliforniaVIDEO: The effective use of police body cameras in San DiegoVIDEO: San Diego mayor discusses drought alleviationVIDEO: San Diego mayor discusses whether the Chargers will stay or goVideo: 2016 Showdown: Scott Walker vs. Jeb Bush VideoVIDEO: Republicans can be environmentalists, tooVIDEO: How Republicans can maintain relevance in CaliforniaVIDEO: The effective use of police body cameras in San DiegoVIDEO: San Diego mayor discusses drought alleviationVIDEO: San Diego mayor discusses whether the Chargers will stay or goVideo: 2016 Showdown: Scott Walker vs. Jeb Bush VIDEO: Republicans can be environmentalists, too VIDEO: How Republicans can maintain relevance in California VIDEO: The effective use of police body cameras in San Diego VIDEO: San Diego mayor discusses drought alleviation VIDEO: San Diego mayor discusses whether the Chargers will stay or go Video: 2016 Showdown: Scott Walker vs. Jeb Bush VideoVIDEO: Republicans can be environmentalists, tooVIDEO: How Republicans can maintain relevance in CaliforniaVIDEO: The effective use of police body cameras in San DiegoVIDEO: San Diego mayor discusses drought alleviationVIDEO: San Diego mayor discusses whether the Chargers will stay or goVideo: 2016 Showdown: Scott Walker vs. Jeb Bush VIDEO: Republicans can be environmentalists, too VIDEO: How Republicans can maintain relevance in California VIDEO: The effective use of police body cameras in San Diego VIDEO: San Diego mayor discusses drought alleviation VIDEO: San Diego mayor discusses whether the Chargers will stay or go Video: 2016 Showdown: Scott Walker vs. Jeb Bush VIDEO: Republicans can be environmentalists, too VIDEO: How Republicans can maintain relevance in California VIDEO: The effective use of police body cameras in San Diego VIDEO: San Diego mayor discusses drought alleviation VIDEO: San Diego mayor discusses whether the Chargers will stay or go Video: 2016 Showdown: Scott Walker vs. Jeb Bush **Gov. Newsom suspends new fracking permits in latest attempt to reduce greenhouse gas emissions** Gov. Gavin Newsom has announced an immediate suspension of permits allowing new hydraulic fracturing and steam-injected oil drilling – thelatestin a series of moves in the past week underscoring California’s determination to be seen as a leader in climate change efforts. “These are necessary steps to strengthen oversight of oil and gas extraction as we phase out our dependence on fossil fuels and focus on clean energy sources,” Newsom said in a statement released by his office. While Newsom’s predecessor, Jerry Brown, also used his job to promote the Golden State as a leader in the effort to reduce the greenhouse gas emissions believed to be a primary cause of global warming, he opposed a fracking moratorium. Brown’s aides noted the economic benefits of being the third-largest oil-producing state – home to 72,000 wells and 350,000-plus good-paying oil-related jobs. Brown may also have been intrigued by disputed reports in 2013 that the Golden State was sitting onmassive oil reserveslarger than those of Saudi Arabia. Catherine Reheis-Boyd, president of the Western States Petroleum Association, pushed back hard at Newsom’s assertion that California had no choice but to crack down on unsafe drilling practices. “Multiple state agencies already validate our protection of health, safety and the environment during production,” she said in a statement. Reheis-Boyd joined several Republican officials in warning of severe economic consequences of what they depicted as an end to new oil drilling. But the obstacles Newsom plans to add to gas and oil exploration don’t stop with a ban on the two extraction techniques. The Los Angeles Timesreportedthat he “plans to study the possible adoption of buffer zones around oil wells in or near residential neighborhoods, schools, hospitals and other facilities that could be exposed to hazardous fumes” – a move with the potential to sharply add to regulatory burdens of owners of the wells. Other moves that Newsom has announced in the last week include: The state willno longer purchasegas-powered sedans. Law-enforcement agencies are exempted. The state will only buy vehicles from automakers that agreed to follow California’s vehicle-emission rules rather than the weaker rules backed by the Trump administration. So far, Ford, Honda, Volkswagen and BMW have sided with California. General Motors, Toyota, Nissan, Mazda, Subaru, Hyundai, Kia and Fiat Chrysler last month said they would follow the weaker federal standards. The Newsom administration has formally asked the California Public Utilities Commission to permanently close the Aliso Canyon natural gas storage facility in Porter Ranch as soon as feasible. The facility has been the target of intense protests by its neighbors and environmentalists since a2015 disasterresulted in among the largest releases of methane gas in world history – an immense leak that took nearly four months to stop and forced the evacuation of nearly 3,000 households. Environmental groups hailed Newsom’s series of moves – especially what they depicted as the beginning of the end of fracking in the state. But the governor’s announcement left open the possibility that new fracking permits could be – if independent experts from the Lawrence Livermore National Laboratory attested to their safety. That’s not necessarily a long shot. Even as greens spent years depicting hydraulic fracturing as dangerous and destructive, several Cabinet members in the Obama administration said it was akin to other heavy industries – mostly safe if properly regulated. In 2015, U.S. Interior Secretary Sally Jewelltold KQED, the Northern California PBS channel, that local moratoriums on fracking approved by several cities in the state were the “wrong way to go.” “There is a lot of misinformation about fracking,” she said. “I think that localized efforts or statewide efforts in many cases don’t understand the science behind it and I think there needs to be more science.” But Newsom said he didn’t agree with this benign view of fracking while campaigning for governor in 2018 and promised a crackdown if elected. **Chris Reed** Chris Reed is a regular contributor to Cal Watchdog. Reed is an editorial writer for U-T San Diego. Before joining the U-T in July 2005, he was the opinion-page columns editor and wrote the featured weekly Unspin column for The Orange County Register. Reed was on the national board of the Association of Opinion Page Editors from 2003-2005. From 2000 to 2005, Reed made more than 100 appearances as a featured news analyst on Los Angeles-area National Public Radio affiliate KPCC-FM. From 1990 to 1998, Reed was an editor, metro columnist and film critic at the Inland Valley Daily Bulletin in Ontario. Reed has a political science degree from the University of Hawaii (Hilo campus), where he edited the student newspaper, the Vulcan News, his senior year. He is on Twitter: @chrisreed99. **Related Articles** **2nd Amendment groups fight CA gun-control laws in court** As fast as California lawmakers can write new gun-control laws, Second Amendment groups are challenging them in court. buy definition essay **Pro-marijuana push begins in earnest** As election day nears, California’s likely vote on recreational pot has drawn policymakers, politicians and law enforcement into an uncertain **Initiative targets cap-and-trade** March 5, 2010 By KATY GRIMES California’s version of “cap-and-trade” is under attack – again. But this time, it’s in **Recent News** CBD 101 – Everything You Need to Know About CBDAugust 11, 2020 Full-Spectrum CBD or CBD Isolate?August 10, 2020 All About CBD & THCAugust 4, 2020 CBD Infused CoffeeAugust 3, 2020 Frequently Asked Question About CBD SalvesJuly 21, 2020 Steps for Identifying Good Quality CBD ProductsJuly 20, 2020 Don’t Like the Taste of CBD? Here Are Other Ways to ConsumeJuly 14, 2020 All About Extracting CBD With CO2 ExtractionJuly 13, 2020 CBD 101 – Everything You Need to Know About CBDJuly 7, 2020 Best CBD Topicals For Effective Pain ReliefJuly 6, 2020 **Top Posts** Sen. Diane Feinstein's husband wins CA rail contract Gov. Newsom suspends new fracking permits in latest attempt to reduce greenhouse gas emissions Confusion abounds as California's online privacy law kicks in The Math Scam Gov. Brown calls CBS reporter 'thug' CBD Infused Coffee CBD 101 - Everything You Need to Know About CBD **Latest Comments** I truly appreciate your technique of writing a blog. I ... Very nice post. I just stumbled upon your blog and ... Reading your article has greatly helped me, and I agree ... Reading your article has greatly helped me, and I agree ... There is definately a lot to find out about this ... **Loading, Please Wait!**"}