{"id": 217, "name": "Chicago Sun-Times", "domain": "chicago.suntimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://chicago.suntimes.com/sports-media/2025/06/05/chicago-sports-network-comcast-agreement-white-sox-bulls-blackhawks-standard-media-marquee-sports-network-nbc-nba", "title": "Chicago Sports Network Comcast Agreement White Sox Bulls Blackhawks Standard Media Marquee Sports Network Nbc Nba", "content": "Why are we asking for donations?Why are we asking for donations?This site is free thanks to our community of supporters. Voluntary donations from readers like you keep our news accessible for everyone.Donation Options **Why are we asking for donations?** **Why are we asking for donations?** Search NewsChicagoCrimeEducationIllinoisEn EspañolThe WatchdogsMoneyImmigrationHealthTransportationEnvironmentArchitecture Chicago Crime Education Illinois En Español The Watchdogs Money Immigration Health Transportation Environment Architecture Chicago Crime Education Illinois En Español The Watchdogs Money Immigration Health Transportation Environment Architecture SportsBearsHigh School SportsCubsWhite SoxBullsBlackhawksSkyOutdoorsCollege SportsSports Media Bears High School Sports Cubs White Sox Bulls Blackhawks Sky Outdoors College Sports Sports Media Bears High School Sports Cubs White Sox Bulls Blackhawks Sky Outdoors College Sports Sports Media PoliticsCity HallSpringfieldWashingtonFran Spielman ShowAt the TableWho’s My Alderperson? City Hall Springfield Washington Fran Spielman Show At the Table Who’s My Alderperson? City Hall Springfield Washington Fran Spielman Show At the Table Who’s My Alderperson? CommentaryColumnistsLetters to the EditorOther ViewsHow to SubmitChicago’s Next Voices Columnists Letters to the Editor Other Views How to Submit Chicago’s Next Voices Columnists Letters to the Editor Other Views How to Submit Chicago’s Next Voices Life & CultureHoroscopesDear AbbyMurals and MosaicsThings To DoMovies and TVWellTheater and StagesMusicTaste Horoscopes Dear Abby Murals and Mosaics Things To Do Movies and TV Well Theater and Stages Music Taste Horoscopes Dear Abby Murals and Mosaics Things To Do Movies and TV Well Theater and Stages Music Taste ObituariesView Death NoticesPlace a Death Notice View Death Notices Place a Death Notice View Death Notices Place a Death Notice MoreGet the AppNewsletter SubscriptionsAbout the Sun-TimesNewspaper ArchivesPhoto ArchivesCareers & InternshipsAdvertise With UsContact UsEventsRight to be ForgottenPress RoomOur Impact Get the App Newsletter Subscriptions About the Sun-Times Newspaper Archives Photo Archives Careers & Internships Advertise With Us Contact Us Events Right to be Forgotten Press Room Our Impact Get the App Newsletter Subscriptions About the Sun-Times Newspaper Archives Photo Archives Careers & Internships Advertise With Us Contact Us Events Right to be Forgotten Press Room Our Impact Today’s Paper Home DeliverySubscribeCancel Subscription Subscribe Cancel Subscription Subscribe Cancel Subscription ClassifiedsDeath NoticesPlace a Death NoticeClassified AdsPlace Classified AdJob OpeningsPost Job OpeningSmall Business AdsPlace a Small Business AdLegal NoticesPost a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Today’s Paper Home DeliverySubscribeCancel Subscription Subscribe Cancel Subscription Subscribe Cancel Subscription ClassifiedsDeath NoticesPlace a Death NoticeClassified AdsPlace Classified AdJob OpeningsPost Job OpeningSmall Business AdsPlace a Small Business AdLegal NoticesPost a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Search NewsChicagoCrimeEducationIllinoisEn EspañolThe WatchdogsMoneyImmigrationHealthTransportationEnvironmentArchitecture Chicago Crime Education Illinois En Español The Watchdogs Money Immigration Health Transportation Environment Architecture Chicago Crime Education Illinois En Español The Watchdogs Money Immigration Health Transportation Environment Architecture SportsBearsHigh School SportsCubsWhite SoxBullsBlackhawksSkyOutdoorsCollege SportsSports Media Bears High School Sports Cubs White Sox Bulls Blackhawks Sky Outdoors College Sports Sports Media Bears High School Sports Cubs White Sox Bulls Blackhawks Sky Outdoors College Sports Sports Media PoliticsCity HallSpringfieldWashingtonFran Spielman ShowAt the TableWho’s My Alderperson? City Hall Springfield Washington Fran Spielman Show At the Table Who’s My Alderperson? City Hall Springfield Washington Fran Spielman Show At the Table Who’s My Alderperson? CommentaryColumnistsLetters to the EditorOther ViewsHow to SubmitChicago’s Next Voices Columnists Letters to the Editor Other Views How to Submit Chicago’s Next Voices Columnists Letters to the Editor Other Views How to Submit Chicago’s Next Voices Life & CultureHoroscopesDear AbbyMurals and MosaicsThings To DoMovies and TVWellTheater and StagesMusicTaste Horoscopes Dear Abby Murals and Mosaics Things To Do Movies and TV Well Theater and Stages Music Taste Horoscopes Dear Abby Murals and Mosaics Things To Do Movies and TV Well Theater and Stages Music Taste ObituariesView Death NoticesPlace a Death Notice View Death Notices Place a Death Notice View Death Notices Place a Death Notice MoreGet the AppNewsletter SubscriptionsAbout the Sun-TimesNewspaper ArchivesPhoto ArchivesCareers & InternshipsAdvertise With UsContact UsEventsRight to be ForgottenPress RoomOur Impact Get the App Newsletter Subscriptions About the Sun-Times Newspaper Archives Photo Archives Careers & Internships Advertise With Us Contact Us Events Right to be Forgotten Press Room Our Impact Get the App Newsletter Subscriptions About the Sun-Times Newspaper Archives Photo Archives Careers & Internships Advertise With Us Contact Us Events Right to be Forgotten Press Room Our Impact Today’s Paper Home DeliverySubscribeCancel Subscription Subscribe Cancel Subscription Subscribe Cancel Subscription ClassifiedsDeath NoticesPlace a Death NoticeClassified AdsPlace Classified AdJob OpeningsPost Job OpeningSmall Business AdsPlace a Small Business AdLegal NoticesPost a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Death Notices Place a Death Notice Classified Ads Place Classified Ad Job Openings Post Job Opening Small Business Ads Place a Small Business Ad Legal Notices Post a Legal Notice Search **What led to Chicago Sports Network-Comcast deal? Here are four possibilities** **What made Comcast, the dominant TV provider in the area, agree to end its blackout of CHSN after more than eight months? It certainly wasn’t the teams’ play.** SHARE COPY LINK Share Twitter Facebook Email Reddit Flipboard Our long regional nightmare is over. Chicago Sports Network isexpected to launch on Comcast cable Friday, likely in time for the Royals-White Sox game, the Sun-Times has learned. That will allow about 1 million Xfinity customers in the area to watch the rest of the Sox’ season and not miss another entire Bulls and Blackhawks season. After fighting to launch on the Popular programming tier, Comcast’s middle tier of channels, CHSN will appear on the Ultimate tier, which costs an additional $20 per month. Customers had been receiving a monthly credit of $8.85 to offset the loss of NBC Sports Chicago, the teams’ former home, which went off the air Sept. 30. So what made Comcast, the dominant TV provider in the area, agree to end its blackout of CHSN after more than eight months? It certainly wasn’t the teams’ play. They haven’t done the network any favors bylosing as often as they have. That’s no way to create leverage. CHSN knew its path to wide distribution would be bumpy, especially with Comcast, which has been moving regional sports networks across the country to its highest programming tier. Industry insiders speculated on four possible reasons the sides reached an agreement. **CHSN lowered asking price** Programmers charge distributors a monthly fee per subscriber to carry a channel, and the distributor passes the cost to consumers. This reason seems unlikely because CHSN couldn’t have been asking for too much, given the state of RSNs and that of its teams. Such information is normally locked down by non-disclosure agreements. **CHSN agreed to be tiered** CHSN staffers knew that if Comcast was going to carry the network, it would end up on the Ultimate tier. Standard Media, which is partnering with the teams to handle distribution, fought that fate, but to no avail. Though CHSN won’t have the reach it would on a lower tier, it’ll make more ad revenue on Comcast than it does over the air on the WJYS subchannels. Interestingly, the Cubs’ Marquee Sports Network is expected to remain on the Popular tier through the season and move to the Ultimate tier before next season. Marquee essentially has been grandfathered in, and certainly theCubs’ on-field successhas helped. **Comcast lost subscribers** Is it possible that enough Sox fans made enough of a stink to get Comcast’s attention? That information is hard to get, and the company seems to be more focused on bolstering its internet service than appeasing Sox fans anyway. **CHSN agreed to reduce over-the-air access** This would go against part of the network’s business plan, which has been to expand its footprint within the teams’ TV territory to sell advertising. OTA distribution was never meant to replace the distribution CHSN couldn’t achieve. It was more of an act of goodwill with customers until the network met its goals. But Comcast didn’t see it that way, questioning why it should pay for a channel that was free to all. It was the No. 1 sticking point in negotiations, which led some to believe that CHSN agreed to reduce the number of games available over the air to grant Comcast some exclusivity in the market. The answer could be all, none or some of the above. One reason that isn’t behind the detente is NBC’s upcoming deal with the NBA. The theory was that Comcast, which owns NBC, would want to promote games that will air on the network and streaming service Peacock during Bulls games on CHSN. If that were the case, sources said, Comcast would wait until the NBA season to settle the dispute and not pay to carry CHSN for the next four months. Comcast and NBC are not one and the same. Comcast owns NBCUniversal, which owns and operates NBC. CHSN has been dealing with Comcast cable’s programming division, whose goals often don’t align with NBC’s. Whatever the case, the nightmare is over, and the games are about to return. Of course, considering the teams, that opens the possibility of many other nightmares. SHARE COPY LINK Share Twitter Facebook Email Reddit Flipboard Get the Paper−Today’s PaperGet Home DeliveryCancel Home DeliveryBack Issues & Photo ReprintsNewspaper ArchivesPhoto Archives Today’s Paper Get Home Delivery Cancel Home Delivery Back Issues & Photo Reprints Newspaper Archives Photo Archives Today’s Paper Get Home Delivery Cancel Home Delivery Back Issues & Photo Reprints Newspaper Archives Photo Archives Get in Touch−Advertise With UsMedia KitAbout the Sun-TimesContact UsCareers & InternshipsLetters & Op-EdsEventsPress Room Advertise With Us Media Kit About the Sun-Times Contact Us Careers & Internships Letters & Op-Eds Events Press Room Advertise With Us Media Kit About the Sun-Times Contact Us Careers & Internships Letters & Op-Eds Events Press Room Support Our Work−Become a MemberDonate Your CarGift MatchingPublic Media is a Public GoodOur Impact Become a Member Donate Your Car Gift Matching Public Media is a Public Good Our Impact Become a Member Donate Your Car Gift Matching Public Media is a Public Good Our Impact Manage My Account−Free NewslettersDigital MembersHome Delivery SubscribersTV Weekly CustomersActivate Digital Access Free Newsletters Digital Members Home Delivery Subscribers TV Weekly Customers Activate Digital Access Free Newsletters Digital Members Home Delivery Subscribers TV Weekly Customers Activate Digital Access Mobile Apps−Learn MoreiOS DownloadAndroid DownloadFrequently Asked Questions Learn More iOS Download Android Download Frequently Asked Questions Learn More iOS Download Android Download Frequently Asked Questions © 2025 Chicago Sun-Times Media, Inc. Terms of Use•Privacy Notice•Cookie Policy•Terms of Sale"}