{"id": 496, "name": "Frontiers in Animal Science", "domain": "frontiersin.org/journals/animal-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/animal-science/articles/10.3389/fanim.2025.1566483/full", "title": "Animal Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Animal Breeding and Genetics Animal Nutrition Animal Physiology and Management Animal Welfare and Policy Precision Livestock Farming Product Quality Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Animal Breeding and Genetics Animal Nutrition Animal Physiology and Management Animal Welfare and Policy Precision Livestock Farming Product Quality Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Animal Breeding and Genetics Animal Nutrition Animal Physiology and Management Animal Welfare and Policy Precision Livestock Farming Product Quality Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Anim. Sci. Sec. Precision Livestock Farming Volume 6 - 2025 |doi: 10.3389/fanim.2025.1566483 **Evaluating the economic viability of growing winter hybrid rye to feed and bed organic pigs** 1Department of Animal Science, University of Minnesota Twin Cities, St. Paul, United States 2West Central Research and Outreach Center, University of Minnesota, Morris, Minnesota, United States 3Department of Applied Economics, University of Minnesota Twin Cities, St. Paul, United States 4Department of Soil, Water, and Climate, University of Minnesota Twin Cities, St. Paul, United States 5Department of Agronomy and Plant Genetics, University of Minnesota Twin Cities, St. Paul, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here The high production cost is one of the biggest challenges to the sustainability of organic pig production. Growing winter hybrid rye to feed and bed organic pigs might be a strategy to reduce production costs. In this study, we evaluated the economic viability of integrating rye into an organic swine production system. Winter hybrid rye was grown organically over two years, yielding an average of 5,430 kg/ha of grain and 3,135 kg/ha of straw. Replacing 50% of corn with rye grain in feed and using rye straw as bedding materials did not negatively impact growth performance of organic growing-finishing pigs. This replacement resulted in $14/pig savings on feed and bedding and increased net return for a swine enterprise (swine savings) by $6/pig, compared with feeding corn soybean meal diets and bedding with wheat straw. Sensitivity analysis was conducted to evaluate how crop net returns may vary with changes in market prices, yield, and production costs of a rye crop. Results indicate that for farmers to be profitable by growing rye as a cash crop, the minimal price of rye grain needs to be $0.24/kg at a yield of around 5,000 kg/ha with production costs of $1,642/ha. Growing rye to feed and bed organic pigs can offset crop net returns, resulting in $319 to $666/ha of crop net returns and swine savings for the combined crop and swine enterprise. These results suggest that integrating hybrid rye into organic swine production is economically viable under the circumstances described in this study and can benefit both crop and pig farmers. Keywords:Costs and returns, Organic Agriculture, pigs, Rye, sensitivity analysis Received:02 Apr 2025;Accepted:10 Jun 2025. Copyright:© 2025Li, Kavanagh, Lazarus, Lima, Hilbrands, Wilson, Garcia y Garcia, Tallaksen and Johnston. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Yuzhi Z. Li, Department of Animal Science, University of Minnesota Twin Cities, St. Paul, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}