{"id": 1237, "name": "Fitchburg Sentinel & Enterprise", "domain": "sentinelandenterprise.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sentinelandenterprise.com/2025/05/30/absurd-market-basket-executives-refute-allegations-that-led-to-ousting-of-ceo-arthur-t-demoulas/", "title": "Absurd Market Basket Executives Refute Allegations That Led To Ousting Of Ceo Arthur T Demoulas", "content": "E-Edition E-Edition NewsNewsLatest HeadlinesLocal NewsCrime and Public SafetyPoliticsBusinessBest ReviewsContact UsHealthPurchase PhotosNational NewsWorld News News Latest Headlines Local News Crime and Public Safety Politics Business Best Reviews Contact Us Health Purchase Photos National News World News News Latest Headlines Local News Crime and Public Safety Politics Business Best Reviews Contact Us Health Purchase Photos National News World News SportsSportsHigh School SportsNew England PatriotsBoston CelticsBoston Red SoxBoston BruinsGolf Sports High School Sports New England Patriots Boston Celtics Boston Red Sox Boston Bruins Golf Sports High School Sports New England Patriots Boston Celtics Boston Red Sox Boston Bruins Golf EntertainmentEntertainmentComicsPuzzlesEventsFun and GamesSpecial SectionsContests Entertainment Comics Puzzles Events Fun and Games Special Sections Contests Entertainment Comics Puzzles Events Fun and Games Special Sections Contests LifestyleLifestyleWeekenderDear AnnieDream RetrieverAsk the PsychicHopeful ThinkingCommunity ConversationsParent Forward Lifestyle Weekender Dear Annie Dream Retriever Ask the Psychic Hopeful Thinking Community Conversations Parent Forward Lifestyle Weekender Dear Annie Dream Retriever Ask the Psychic Hopeful Thinking Community Conversations Parent Forward ObituariesObituariesNews ObituariesPlace an ObituaryMemoriams Form Obituaries News Obituaries Place an Obituary Memoriams Form Obituaries News Obituaries Place an Obituary Memoriams Form OpinionOpinionEditorialsLetters to the EditorSubmit a Letter Opinion Editorials Letters to the Editor Submit a Letter Opinion Editorials Letters to the Editor Submit a Letter Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Login Sign up for email newsletters Subscribe Login E-Edition E-Edition Latest Headlines Local Crime Politics Business Contact Us Purchase Photos Trending: Customers react to Market Basket CEO being placed on paid leave ‘A light that shined so bright’: Loved ones mourn young Pepperell mother Market Basket Editorial: Guards say DOC suit settlement doesn’t fit their safety issues McKay second graders pen to Poland **‘Absurd’: Market Basket executives refute allegations that led to ousting of CEO Arthur T. Demoulas** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Two longtime Market Basket executives who were placed on paid administrative leave by the grocery chain’s board of directors alongside CEO Arthur T. Demoulas called the board’s allegations that they were planning a work stoppage “absurd.” Joe Schmidt, director of operations, and Tom Gordon, the top grocery supervisor, on Friday addressed the board’ssurprising move to oust Demoulasfrom his position atop the eastern New England grocery chain and place “several other employees” on paid leave amid an investigation into allegations of wrongdoing. “It’s preposterous,” Schmidt said outside a Reading Market Basket. “From my understanding, the insinuation is that he was trying to create some type of work stoppage due to a disagreement with the board of directors. That’s just absurd. Nobody would do that.” Schmidt spoke not only to Demoulas specifically, saying that he would never doing what he’s being accused of, but also to himself, saying that he’s a loyal employee who would never try to hurt the business he works for. “I take major exception to it,” Schmidt said of being accused of wrongdoing. “I’m an honorable person. I try hard every day. I’m not perfect, but I’ve done, I think, my share in the business over my 39 years.” He said the board has “trumped up this allegation of inappropriate conduct,” so that they can oust Demoulas from his position of CEO and president, and “remove individuals that are in support of him.” Schmidt, as director of operations, said he reports directly to Demoulas, along with Demoulas’ son and daughter. He and Gordon said they were informed by the board this past Wednesday that they were being placed on paid administrative leave. On Wednesday, the three-member executive committee of the Market Basket board of directors announced Demoulas, along with “several other employees” were placed on leave amid “credible allegations that Mr. Demoulas began to plan a disruption of the business and operations of Market Basket with a work stoppage.” “The executive committee believes that [Arthur T. Demoulas] and others have taken these steps as improper retaliation for the board’s directives requiring the CEO to work with the board regarding the most basic corporate oversight and to provide the board access to key employees,” said the board’s statement. “Mr. Demoulas has also resisted an appropriate succession plan for Market Basket, asserting that he has the unilateral right to appoint his children to succeed him without any consideration of the view of the board or the majority owners of Market Basket.” The move is reminiscent of the summer of 2014, when Arthur T. Demoulas and his cousin Arthur S. Demoulas engaged in a battle over control of the company, with thousands of Market Basket employees walking off the job for six weeks in support of “Artie T.” Arthur T. Demoulas and his three sisters prevailed in that fight, at the end buying out Arthur S. Demoulas’ share of the company for $1.6 billion. His sisters are now opposing Arthur T. Demoulas, according to a Wednesday statement from spokesperson Justine Griffin. “Today, Mr. Arthur T. Demoulas was ousted from his position as president and CEO of Market Basket by his three sisters and their three appointed board members — Jay Hachigian, Steven Collins, and Michael Keyes. His daughter, Madeline, and son, Telemachus, and several other Market Basket executives were also placed on leave,” Griffin’s statement said. “Under Mr. Demoulas’ leadership in December of 2024, the company paid off $1.6 billion in debt that financed the purchase of the company in 2014. The company is currently operating at its peak performance and the notion that this board is going to conduct an investigation is a farcical cover for a hostile takeover.” Schmidt and Gordon said Friday that any protests or employee walkouts in support of Arthur T. Demoulas this time around would be up to the customers, and not them. They said there’s been rumblings of such potential activity that’s making the rounds on social media. In Wednesday’s statement from the board, Market Basket officials warned of the effects of a work stoppage at a grocery chain “at a time of great economic uncertainty for many households.” The 2014 employee walkout was accompanied by Market Basket’s customer base noticeably boycotting the stores. Sales fell more than 90% over a six-week boycott. Both executives who spoke with reporters on Friday said they anticipate being fired, but are hopeful that Demoulas will ultimately be reinstated to his “rightful position” as Market Basket’s president and CEO. In 2014, “when Arthur was out, the volume of the company tanked, and when he came back, we came right back,” Gordon, a 50-year employee, said. Schmidt added that the board is operating in a “Wall Street” kind of way, where “people are expendable and cast aside,” and is overstepping its authority. “One of the problems is the board has severe overreach right now, in trying to take on day-to-day responsibilities of the company,” Schmidt said. “That’s really not, in my opinion, the responsibility of the board of directors. They’re there to be supportive of management and to make sure the company’s on track.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** FHS alum, NASA geologist visits with ROTC studentsFHS alum, NASA geologist visits with ROTC students **FHS alum, NASA geologist visits with ROTC students** **FHS alum, NASA geologist visits with ROTC students** Strong spring for Fitchburg middle schoolsStrong spring for Fitchburg middle schools **Strong spring for Fitchburg middle schools** **Strong spring for Fitchburg middle schools** Football notebook: Blue Devils have a shot at titleFootball notebook: Blue Devils have a shot at title **Football notebook: Blue Devils have a shot at title** **Football notebook: Blue Devils have a shot at title** Paying homage to a cycling legendPaying homage to a cycling legend **Paying homage to a cycling legend** **Paying homage to a cycling legend** Leominster student’s book drive lifts young cancer patientsLeominster student's book drive lifts young cancer patients **Leominster student’s book drive lifts young cancer patients** **Leominster student’s book drive lifts young cancer patients** ‘A celebration of the community’'A celebration of the community' **‘A celebration of the community’** **‘A celebration of the community’** Lunenburg man accused of exposing himself to joggersLunenburg man accused of exposing himself to joggers **Lunenburg man accused of exposing himself to joggers** **Lunenburg man accused of exposing himself to joggers** Firefighters rescue 4 by ladder in 3-alarm fire on Mechanic St.Firefighters rescue 4 by ladder in 3-alarm fire on Mechanic St. **Firefighters rescue 4 by ladder in 3-alarm fire on Mechanic St.** **Firefighters rescue 4 by ladder in 3-alarm fire on Mechanic St.** Massachusetts State Police arrest chase suspect in backyard pool: MSPMassachusetts State Police arrest chase suspect in backyard pool: MSP **Massachusetts State Police arrest chase suspect in backyard pool: MSP** **Massachusetts State Police arrest chase suspect in backyard pool: MSP** Judge sends the wrong messageJudge sends the wrong message **Judge sends the wrong message** **Judge sends the wrong message** **More in Local News** SUBSCRIBER ONLYMassachusetts girls flag football soars to new heights **SUBSCRIBER ONLY** **Massachusetts girls flag football soars to new heights** **SUBSCRIBER ONLY** **Massachusetts girls flag football soars to new heights** Leominster student’s book drive lifts young cancer patients **Leominster student’s book drive lifts young cancer patients** **Leominster student’s book drive lifts young cancer patients** ‘Act up’ at Stratton Players ‘Fun Family Improv’ night **‘Act up’ at Stratton Players ‘Fun Family Improv’ night** **‘Act up’ at Stratton Players ‘Fun Family Improv’ night** Family Recipe Box: Strawberry fields forever in Fitchburg **Family Recipe Box: Strawberry fields forever in Fitchburg** **Family Recipe Box: Strawberry fields forever in Fitchburg** 2025 May 30 Subscribee-EditionSign Up For NewslettersMobile Apps e-Edition Sign Up For Newsletters Mobile Apps e-Edition Sign Up For Newsletters Mobile Apps Contact UsPurchase PhotosContestsWork for UsPrivacy PolicyAccessibilitySitemap Purchase Photos Contests Work for Us Privacy Policy Accessibility Sitemap Purchase Photos Contests Work for Us Privacy Policy Accessibility Sitemap ClassifiedsPublic NoticesHomesJobsLocal Guide Public Notices Homes Jobs Local Guide Public Notices Homes Jobs Local Guide MNG Network AdvertisingToday’s Print AdsSpecial SectionsAdtaxi Solutions Today’s Print Ads Special Sections Adtaxi Solutions Today’s Print Ads Special Sections Adtaxi Solutions Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Informatio Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}