{"id": 398, "name": "Egberto Willies", "domain": "egbertowillies.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://egbertowillies.com/2025/05/31/as-a-growing-social-movement-and-self-care-practice-death-literacy-is-fostering-positive-conversations-about-the-end/", "title": "As A Growing Social Movement And Self Care Practice Death Literacy Is Fostering Positive Conversations About The End", "content": "EgbertoWillies.com Political involvement should be a requirement for citizenship HomeHomepageLoginAbout UsBioResearchBallotPediaBureau of Labor StatisticsCallMyCongressLegiScanOpenSecrets.orgTexas Legislature OnlineUS Dept; Of Health & Human ServicesUS Dept. of LaborVoteSmartContact UsDisclaimerPrivacy Policy Homepage Login About Us Bio ResearchBallotPediaBureau of Labor StatisticsCallMyCongressLegiScanOpenSecrets.orgTexas Legislature OnlineUS Dept; Of Health & Human ServicesUS Dept. of LaborVoteSmart BallotPedia Bureau of Labor Statistics CallMyCongress LegiScan OpenSecrets.org Texas Legislature Online US Dept; Of Health & Human Services US Dept. of Labor VoteSmart Contact Us Disclaimer Privacy Policy Homepage Login About Us Bio ResearchBallotPediaBureau of Labor StatisticsCallMyCongressLegiScanOpenSecrets.orgTexas Legislature OnlineUS Dept; Of Health & Human ServicesUS Dept. of LaborVoteSmart BallotPedia Bureau of Labor Statistics CallMyCongress LegiScan OpenSecrets.org Texas Legislature Online US Dept; Of Health & Human Services US Dept. of Labor VoteSmart BallotPedia Bureau of Labor Statistics CallMyCongress LegiScan OpenSecrets.org Texas Legislature Online US Dept; Of Health & Human Services US Dept. of Labor VoteSmart Contact Us Disclaimer Privacy Policy ShowsLive TVMove to Amend ReportsPolitics Done Right Live TV Move to Amend Reports Politics Done Right Live TV Move to Amend Reports Politics Done Right Books ArticlesAlterNetCNN iReportsCommonDreamsDailyKosMediumOpEdNewsSubstack AlterNet CNN iReports CommonDreams DailyKos Medium OpEdNews Substack AlterNet CNN iReports CommonDreams DailyKos Medium OpEdNews Substack ActivismBattleground TexasCoffee PartyMove To AmendOccupyMovement Battleground Texas Coffee Party Move To Amend OccupyMovement Battleground Texas Coffee Party Move To Amend OccupyMovement SocialBlueSkyFacebookInstagramPinterestTumblrTwitterYouTube BlueSky Facebook Instagram Pinterest Tumblr Twitter YouTube BlueSky Facebook Instagram Pinterest Tumblr Twitter YouTube SectionsEnvironmentFood And CookingHealthLocal NewsOdd NewsPeople Making A DifferencePoliticalReviewsBook ReviewsBooks I RecommendProduct ReviewsSportsSubstack Notes Environment Food And Cooking Health Local News Odd News People Making A Difference Political ReviewsBook ReviewsBooks I RecommendProduct Reviews Book Reviews Books I Recommend Product Reviews Sports Substack Notes Environment Food And Cooking Health Local News Odd News People Making A Difference Political ReviewsBook ReviewsBooks I RecommendProduct Reviews Book Reviews Books I Recommend Product Reviews Book Reviews Books I Recommend Product Reviews Sports Substack Notes Donate Store **As a Growing Social Movement and Self-Care Practice, Death Literacy Is Fostering Positive Conversations About the End** May 31, 2025ByIndependent Media InstituteLeave a Comment As global populations transition into what has been called the “longevity society,” caring for the aging and dying has prompted the emergence of an unusual self-care movement promising improved quality of life as it anticipates death. Since itsdevelopment and introduction, death literacy awareness has seen a steady organic rise, ­primarily due to the efforts of early adopters advocating for a “new public health perspective” that enhances end-of-life awareness and care. “[D]eath literacy is defined as the knowledge and skills that make it possible to understand and act upon the end-of-life and death care options,” according to a 2024articlein the journal Palliative Care and Social Practice, and its four foundational pillars: knowledge, skills, experiential learning, and social action. Although experts and people attest to the benefits of early introductory conversations about end-of-life, industrialized societies like the United States lost touch withend-of-life rituals and home funeralsin the early 1900s. As a result, what was once a natural relationship with the ending of life evolved. The dying were consigned to hospitals and then transferred to funeral homes. Such distancing from dying led to denial, avoidance, and fear of the process. Origins: Defining Death Literacy A chance meeting in 2010 between clinical psychologistKerrie Noonanand playwrightPeta Murrayled to the formation ofThe GroundSwell Project(TGP), an end-of-life educational initiative. Employing community-driven strategies to build awareness and momentum, TGP went on to launchDying To Know Day(2013), an annual grassroots event encouraging open conversations about death and dying across Australia. By 2021,Provedamerged with TGP, integratingD2KDayinto its portfolio of community resources. While casually researching nonmedical end-of-life educational resources late one night in 2015, I discovered this Australian grassroots organization using the term “death literacy” to describe their mission. As a branding professional, I immediately recognized the power of this term as a positive change agent. Upon receiving permission from TGP’s co-founders to introduce and represent the death literacy movement in North America, Bevival organized its first national grassrootsD2KDusacampaign in August 2016. By then, Noonan had become a founding member of theCaring at End of Liferesearch team at Western Sydney University and part of the pioneering research team that coined the term “death literacy” and developed theDeath Literacy Indexin 2019. A Culture Change Moment The lure of transformation typically attracts early adopters who, in turn, inspire change through collaboration. To evangelize death literacy’s mission, the movement attracted support from a wide range ofcritical stakeholders and change agents—creators, educators,entrepreneurs, academics, social scientists, and health care practitioners. Mindful of creativity’s role in laying a foundation for culture change, these advocates took it upon themselves to foster public awareness with a cautious message about the economic and emotional consequences of living longer and dying slower. In the ensuing years, the death literacy awareness movement spawned many mission-driven organizations that endeavor tonormalize dying, death, and griefas inevitable human experiences. Examples includeReimagine,End Well, my organization,Bevival, and influential individuals such asDr. Ira Byock,Katy Butler,Frank Ostaseski, and many others. Collectively, we are helping to dimensionalize the term “death literacy.” Setting the Stage: America’s Aging Demographics The2014 U.S. Census reportpointed to an unprecedented population shift in America—an inflection point that announced the future of America’s obsession with youth and consumerism belonged to three consecutive aging populations: primarily boomers, closely followed by Gen X and millennials. “Between 2012 and 2050, the United States will experience considerable growth in its older population. … In 2050, the population aged 65 and over is projected to be 83.7 million, almost double its estimated population of 43.1 million in 2012,”statedthe report. This unprecedented “silver tsunami,” with its uniquemacroeconomy,has led marketers to influence a wide range of consumer goods and services tailored to America’s aging population. Popular magazines such asTime,AARP, and theNew York Timesbegan addressing our nation’s emerging death consciousness. While some offered practical advice, such as the demise of social security and the rising cost of health care, others inspired readers with bucket lists and lifestyle stories highlighting the West Coast’s youthful “Death Positive Movement.” Death With Dignity Congruent with the movement promoting death literacy education, an important parallel initiative supporting the legalization ofMedical Aid In Dying(MAID) has become legal in 11 states and Washington, D.C. Theright to dieconversation has been slowly making its way through individual state legislations spearheaded byCompassion & Choices,Death with Dignity,NHPCO, andEnd of Life Choices. As of 2025,states where legislation is under considerationinclude Delaware, Massachusetts, Michigan, North Carolina, Pennsylvania, and Virginia. Peak 65 The U.S. Census named 2024 as the start of “Peak 65,” a period that will last through 2027. Around 4.1 million Americans are expected to turn 65 each year from 2024 to 2027 (approximately 11,000 a day). By 2030, all baby boomers will be 65 or older. Implications of “Peak 65” include: Long-term care: According to a2002 Health Services Research study, the trickle-down economics of aging will impact younger generations, who may need to become caretakers for their aging loved ones. “The real challenges of caring for the elderly in 2030 will involve: 1) making sure society develops payment and insurance systems for long-term care that work better than existing ones, 2) taking advantage of advances in medicine and behavioral health to keep the elderly as healthy and active as possible, 3) changing the way society organizes community services so that care is more accessible, and 4) altering the cultural view of aging to make sure all ages are integrated into the fabric of community life.” Labor gap: Retirement will cause amassive reduction in talent, leaving employers to lose expertise, and they may struggle to replace retiring workers. Retirement: It’s a well-known fact that many boomers are entering an underfunded retirement and will face challenges withdwindling finances. It is impossible to overstate how critical widespread death literacy adoption is for our society. As the demand for public-facing initiatives supporting end-of-life preparedness accelerates, ratification within professional environments validates the evolutionary arc of social transformation. By building proficient narrativelong before the end, entire populations will be better served before, during, and after the passing of loved ones. AUTHOR BIO:Caren Martineau is the CEO and founder ofBevival, a death literacy content brand and movement dedicated to promoting death literacy. Find her online here atcarenmartineau.com. This article was produced byEarth | Food | Life, a project of the Independent Media Institute. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to share on WhatsApp (Opens in new window)WhatsApp Click to email a link to a friend (Opens in new window)Email Click to share on Mastodon (Opens in new window)Mastodon Click to share on Nextdoor (Opens in new window)Nextdoor Click to share on Telegram (Opens in new window)Telegram **Like this:** Viewers are encouraged tosubscribe and join the conversationfor more insightful commentary and to support progressive messages. Together, we can populate the internet with progressive messages that represent the true aspirations of most Americans. **Support Our Politics Done Right Store** Filed Under:ColumnistsTagged With:activism,North America/United States of America,Oceania/Australia,Opinion,Science **Leave a ReplyCancel reply** This site uses Akismet to reduce spam.Learn how your comment data is processed. Facebook X YouTube Instagram Pinterest Tumblr LinkedIn **Support Independent Media** RSS - Posts **** **** ****"}