{"id": 2040, "name": "Minnesota Citizens Concerned for Life", "domain": "mccl.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.mccl.org/post/abortions-increase-again-as-extreme-policies-in-minnesota-have-grave-effect", "title": "Abortions Increase Again As Extreme Policies In Minnesota Have Grave Effect", "content": "ResourcesSubscribeNews ReleasesMCCL NewsBlogThe Case for LifeEducational MaterialsDisplay + Promo MaterialsSigns + Billboards Resources Subscribe News Releases MCCL News Blog The Case for Life Educational Materials Display + Promo Materials Signs + Billboards Resources Resources Subscribe News Releases MCCL News Blog The Case for Life Educational Materials Display + Promo Materials Signs + Billboards LegislationMN's Extreme PolicySign Pro-Life PetitionLegislative Accountability RatingsContact LawmakersWho Are They Leaving Out?TV Ad: Way Out ThereLegislative Successes Legislation MN's Extreme Policy Sign Pro-Life Petition Legislative Accountability Ratings Contact Lawmakers Who Are They Leaving Out? TV Ad: Way Out There Legislative Successes Legislation Legislation MN's Extreme Policy Sign Pro-Life Petition Legislative Accountability Ratings Contact Lawmakers Who Are They Leaving Out? TV Ad: Way Out There Legislative Successes Events + ProgramsLife Leadership CampMarch for LifeChoose Life DriveLegislative DinnerStudent Day at the CapitolSpeaker's BureauBooths + DisplaysEssay + Oratory ContestsMother's DayFather's DayCenter for a Pro-Life MinnesotaHispanos Por La VidaMinnesotans Against Assisted SuicideGlobal Outreach Events + Programs Life Leadership Camp March for Life Choose Life Drive Legislative Dinner Student Day at the Capitol Speaker's Bureau Booths + Displays Essay + Oratory Contests Mother's Day Father's Day Center for a Pro-Life Minnesota Hispanos Por La Vida Minnesotans Against Assisted Suicide Global Outreach Events + Programs Events + Programs Life Leadership Camp March for Life Choose Life Drive Legislative Dinner Student Day at the Capitol Speaker's Bureau Booths + Displays Essay + Oratory Contests Mother's Day Father's Day Center for a Pro-Life Minnesota Hispanos Por La Vida Minnesotans Against Assisted Suicide Global Outreach About MCCLOverviewVolunteerEmploymentContact MCCLGet InvolvedPrivacy Policy About MCCL Overview Volunteer Employment Contact MCCL Get Involved Privacy Policy About MCCL About MCCL Overview Volunteer Employment Contact MCCL Get Involved Privacy Policy DonateDonate NowDonation OptionsMonthly GivingMCCL FundsOther Ways to GiveTributes + MemorialsHow Your Donation Is Used Donate Donate Now Donation Options Monthly Giving MCCL Funds Other Ways to Give Tributes + Memorials How Your Donation Is Used Donate Donate Donate Now Donation Options Monthly Giving MCCL Funds Other Ways to Give Tributes + Memorials How Your Donation Is Used Pregnancy HelpPregnancy Care CentersAdditional Pregnancy ServicesPost-Abortion SupportSafe Place for Newborns Pregnancy Help Pregnancy Care Centers Additional Pregnancy Services Post-Abortion Support Safe Place for Newborns Pregnancy Help Pregnancy Help Pregnancy Care Centers Additional Pregnancy Services Post-Abortion Support Safe Place for Newborns All Posts News Releases Abortion Assisted Suicide Case for Life State Legislation Abortion Industry Op-Eds and Letters Abortion Arguments Minnesota Elections International Judiciary Bioethics Federal Legislation Euthanasia Events Infanticide Prenatal Development MCCL **Abortions increase again as extreme policies in Minnesota have grave effect** MCCL Dec 31, 2024 2 min read December 31, 2024 | Press Release MINNEAPOLIS — Abortions in Minnesota increased 16 percent to a 20-year high of 14,124 in 2023, according to areport released todayby the Minnesota Department of Health (MDH). Lawmakers that year enshrined into state statute a policy of abortion-up-to-birth and repealed numerous longstanding abortion-related laws, including laws ensuring informed consent for women and providing practical assistance for those who do not want to have abortions. “We are now seeing the real-life consequences of DFL extremism,”said MCCL Co-Executive Director Cathy Blaeser.“DFL lawmakers and Gov. Walz have sought to make Minnesota a land of truly unlimited abortion—at the expense of women and children. This is not what Minnesotans want to be known for. We want to be a state where both moms and babies receive love and support and where no one is left out.” The large increase follows a 20 percent rise the previous year, defying a long-term downward trajectory that had seen abortions drop 48 percent from 1980 to 2015. The 2023 total is the highest since 2003. The abortion rate among Minnesota residents rose to 10.1 (abortions per 1,000 women of reproductive age), a 9 percent increase over 2022 and a 20 percent jump since 2021. In 2023, lawmakers changed parts of Minnesota’s abortion reporting law, delaying the release date of the annual MDH report to Dec. 31 and repealing certain reporting requirements. As a result, the new report does not include post-operative abortion complications or the reasons behind abortion. Nor does it report cases of infants who survive abortion and the care they receive. Lawmakers in 2023 had alsorepealed a lawrequiring that reasonable and medically appropriate measures be taken to save the lives of such infants. “Previous MDH reports show that, in most years, some babies in Minnesota survive abortion and are born alive,”said Blaeser.“But because of the actions of DFL lawmakers and Gov. Walz, there is no longer a requirement to provide born-alive infants with care that could save their lives. And no longer will the public even know about these cases and about whether babies are cared for or left to die.” Today’s report shows that 2,980 abortions were performed on non-Minnesota residents, a 48 percent increase that reflects Minnesota’s status as an outlier on abortion policy in the region (and, indeed, the world). Chemical (drug-induced) abortions made up 65 percent of the overall total; 768 dilation and evacuation (dismemberment) abortion procedures were performed. 300 abortions took place at 20 weeks or later, a slight increase; the latest was performed at 29 weeks. A total of 94 complications were reported at the time of the abortion procedure, including cervical laceration and hemorrhage. (Post-operative complications are no longer reported.) In addition to repealing born-alive infants' right to lifesaving care and removing parts of the abortion reporting law, lawmakers in 2023 repealed numerous other abortion-related laws, including the Woman’s Right to Know informed consent law and the Positive Alternatives Act, which provided grants for programs that assist pregnant women and new mothers. Lawmakers also enacted the PRO Act to create a fundamental right to abortion, without limits at any stage of pregnancy. News Releases Abortion State Legislation **Recent Posts** Copyright © 2025 MCCL. All rights reserved."}