{"id": 490, "name": "Frontiers in Aging Neuroscience", "domain": "frontiersin.org/journals/aging-neuroscience", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/aging-neuroscience/articles/10.3389/fnagi.2025.1599773/full", "title": "Aging Neuroscience", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aging Neuroscience Archive Alzheimer's Disease and Related Dementias Cellular and Molecular Mechanisms of Brain-aging Neurocognitive Aging and Behavior Neuroinflammation and Neuropathy Parkinson’s Disease and Aging-related Movement Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aging Neuroscience Archive Alzheimer's Disease and Related Dementias Cellular and Molecular Mechanisms of Brain-aging Neurocognitive Aging and Behavior Neuroinflammation and Neuropathy Parkinson’s Disease and Aging-related Movement Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Aging Neuroscience Archive Alzheimer's Disease and Related Dementias Cellular and Molecular Mechanisms of Brain-aging Neurocognitive Aging and Behavior Neuroinflammation and Neuropathy Parkinson’s Disease and Aging-related Movement Disorders Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Aging Neurosci. Sec. Neurocognitive Aging and Behavior Volume 17 - 2025 |doi: 10.3389/fnagi.2025.1599773 **Necroptosis in Vascular Cognitive Impairment: Mechanisms and Therapeutic Potential** 1Department of Pathology, Jiujiang University affiliated Hospital, Jiujiang, Hebei Province, China 2Department of Neurology, Jiujiang University Affiliated Hospital, Jiujiang, Jiangxi Province, China 3Jiujiang University Affiliated Hospital, Jiujiang, China The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Cerebral ischemia and hypoxia play key roles in the occurrence and development of vascular cognitive impairment (VCI). However, the pathophysiology of VCI remains unclear. Necroptosis is a non-cysteine-dependent form of cell death mediated by serine/threonine kinases receptor-interacting protein kinase-1 and -3 and mixed lineage kinase domain-like protein. A search of PubMed and Web of Science was conducted using terms related to VCI and necroptosis. Necroptosis is important in neuroinflammation, neuronal loss, blood-brain barrier dysfunction, and demyelination.Cerebral ischemia activates the necroptotic pathway, and necroptosis inhibitors have a significant inhibitory effect on brain injury. This review focuses on the pathogenesis of VCI and clarifies the core regulatory mechanism of necroptosis in vascular dementia, which lays a scientific foundation for cognitive impairment prevention and treatment by targeting necroptosis in VCI. Keywords:SW: Writing -original draft, investigation, Software, visualization, Writing -review & editing. LC: Funding acquisition, Writing -original draft, Writing -review & editing. CS: Data curation, Writing -review & editing. LW: Data curation Received:25 Mar 2025;Accepted:10 Jun 2025. Copyright:© 2025Wei, chen, shen, li, teng, wang and zhang. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:xiaorong zhang, Jiujiang University Affiliated Hospital, Jiujiang, China Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}