{"id": 65, "name": "Alt News", "domain": "altnews.in", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.altnews.in/bangladesh-4-of-a-muslim-family-found-dead-in-brahmanbaria-footage-falsely-viral-as-killing-of-hindus-by-jihadists/", "title": "Bangladesh 4 Of A Muslim Family Found Dead In Brahmanbaria Footage Falsely Viral As Killing Of Hindus By Jihadists", "content": "Follow us: Facebook Twitter Instagram YouTube RSS More Home DONATE ऑल्ट न्यूज़ हिंदी वेबसाइट AboutEditorial PolicyAlt News Policy on Hate SpeechMethodology for fact checkingSourcing of informationPrivacy PolicyTransparency of fundingEditorial TeamDirectorsCorrection policy Editorial Policy Alt News Policy on Hate Speech Methodology for fact checking Sourcing of information Privacy Policy Transparency of funding Editorial Team Directors Correction policy Editorial Policy Alt News Policy on Hate Speech Methodology for fact checking Sourcing of information Privacy Policy Transparency of funding Editorial Team Directors Correction policy ContactSubscribe via Email Subscribe via Email Subscribe via Email More Menu SearchSearch for: **Bangladesh: 4 of a Muslim family found dead in Brahmanbaria; footage falsely viral as killing of Hindus by ‘Jihadists’** Share Tweet Pin it Share Email More Trigger Warning: Suicide We have not embedded the actual video in question in view of its graphic nature. A 28-second video is viral on social media which shows distressing footage of four dead bodies in a room, including those of two children. All the bodies have nooses around their neck and two of them are still hanging. Against the backdrop of the unprecedented crisis in Bangladesh, where several reports ofattacks against minoritieshave surfaced, this video is being shared with the claim that Islamic extremists murdered the Hindu family in an act of religious hate crime. X-verified user Salwan Momika (@Salwan_Momika1) posted this viral video with the claim that ‘Islamic jihadists’ in Bangladesh had killed the Hindu family. He also added a hashtag with the phrase ‘Save Bangladeshi Hindus’. (Archive) He further urged the Indian government to intervene and save Hindus from ‘genocide’ by Muslims in Bangladesh. At the time of this article being written, the post has managed to gather around 8.8 Lakh views, and more than 12,000 re-shares. X user @Sharabh_Vishnu_ also posted the viral clip, along with the claim that the Hindu family had been murdered by Islamic extremists. (Archive) Such claims are alsoviral on Facebook, with various users alleging that four members of a Hindu family had been killed by Muslims in Bangladesh. This slideshow requires JavaScript. We ran arelevant Bengali keyword searchon Google, which led us toa news articleby Bangladeshi dailyDainik Ittefakdated July 28, 2024. The report states that all four members of a family had died by hanging at Bijoypara in the Nabinagar upazila of Brahmanbaria, Bangladesh. It adds that the hanged bodies were discovered by neighbours, who reported it to the police, around 10:30 am on July 28. The deceased were identified as Sohag Miya, Jannatul Begum, and their two children, Fariya and Fahima. Anothernews articlereports that neighbours speculated that it was a case of suicide, since Sohag Miya, a small businessman, had possibly run into heavy debts. However, a report in Bengali dailyKaaler Kanthoquotes local police officer Mohammad Sakhawat as saying that circumstantial evidence and the way the bodies were found suggested that Sohag might have killed his wife and children over a family dispute and then committed suicide. We ran a relevant keyword search on YouTube, and came acrossthis videofrom July 28, which reports on the same incident of the four hanged members of the same family in Bangladesh. None of the reports mentioned a communal angle to the alleged crime. To sum up, the viral footage is from an incident in Brahmanbaria, Bangladesh from July 28 in which four members of a Muslim family were found dead in their house. The video is being shared with the false claim that a Hindu family was murdered by Muslims in Bangladesh. Prantik Ali is an intern at Alt News. Donate Now **Related** **Post navigation** **Read Next** **2022 video of Patna High Court judge reprimanding cop linked to Sharmishta Panoli case** Days after social media influencer Sharmishta Panoli was arrested over a controversial post, a clip… **‘Ya Allah. This was a fighter jet!!!!’: Pak X user’s tweet could be first ‘report’ on Operation Sindoor** Gone are the times when people waited for a news bulletin on TV or the… **2006 image from Odisha linked to recent anti-naxal operation in Chhattisgarh** The central government, along with the administration in Chhattisgarh, has intensified its crackdown against Naxalism… **Man filming chat with Canadian cop in viral video is not Indian** After reports emerged that an Indian blogger was detained in Turkey for performing obscene acts,… **Old video of police brutality from UP viral again. Action was taken against cops in 2017** A video depicting police brutality has surfaced on social media. In the video, two cops… **Follow Alt News** 486K 215K **Latest Videos** **Instagram** **Alt News Hindi** **Alt News**"}