{"id": 800, "name": "KXLF - Butte news", "domain": "kxlf.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kxlf.com/science-and-tech/animals-and-insects/invasive-asian-needle-ants-with-potentially-deadly-sting-spreading-across-multiple-states", "title": "Invasive Asian Needle Ants With Potentially Deadly Sting Spreading Across Multiple States", "content": "Menu NewsLocal NewsMontana NewsMontana Ag NetworkCrime and CourtsPoliticsOutdoorsWildfire WatchThis Week in Fish and Wildlife Local News Montana News Montana Ag Network Crime and Courts Politics Outdoors Wildfire Watch This Week in Fish and Wildlife Local News Montana News Montana Ag Network Crime and Courts Politics Outdoors Wildfire Watch This Week in Fish and Wildlife WeatherDaily ForecastHourly ForecastInteractive RadarWeather Cameras Daily Forecast Hourly Forecast Interactive Radar Weather Cameras Daily Forecast Hourly Forecast Interactive Radar Weather Cameras MTN Investigates Sports CommunityMayfair 2024ContestsMiddle Schooler of the MonthUnder the Big Sky Mayfair 2024 Contests Middle Schooler of the Month Under the Big Sky Mayfair 2024 Contests Middle Schooler of the Month Under the Big Sky VideosPhoto GalleriesOn KXLF Photo Galleries On KXLF Photo Galleries On KXLF About UsClosed CaptioningJobsContact UsAdvertise with KXLFKXLF News TeamKXLF Apps Closed Captioning Jobs Contact Us Advertise with KXLF KXLF News Team KXLF Apps Closed Captioning Jobs Contact Us Advertise with KXLF KXLF News Team KXLF Apps Sign In Newsletters Sign Out Manage Emails Apps Careers Search News Weather Sports Positively Montana Indian Country Montana Politics Montana Ag Network Find MTN Contests **Actions** Facebook Tweet Email **Invasive Asian needle ants with potentially deadly sting spreading across multiple states** Asian needle ants that carry a potentially fatal sting have spread across multiple states, with experts warning people to be cautious when spending time outdoors. The invasive species has been found in more than a dozen states from Washington to Florida, but is expanding more rapidly in the southeastern United States. Entomologists at the University of Georgiaare tracking these ants and have warned that their stings could be deadly. RELATED STORY |3 rodeo horses killed by a swarm of bees in Central Texas People who have strong reactions to stings from insects like bees, wasps or yellowjackets should be especially careful, experts said. If you suffer from anaphylaxis, you should be especially vigilant and carry an EpiPen. The insect has been in the U.S. since at least the 1930s, but only recently has started to disrupt local ecosystems by competing with other ant species that are important to the ecology of that area. RELATED STORY |'Flying' venomous Joro spiders spotted for the first time in this state The Asian needle ants are tiny — about a fifth of an inch long — and are dark brown or black with lighter orange-brown on their antennae and legs. They can be difficult to notice because, unlike fire ants, for example, they don't build mounds or establish foraging trails. These ants prefer to hide under logs, stones and in leaf litter — anywhere with high moisture. Researchers said you should contact a professional exterminator if you think you have spotted these ants in or around your home. This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News Weather Community Sports Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact kxlf4 kxlftv kxlf"}