{"id": 897, "name": "San Jose Mercury News", "domain": "mercurynews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mercurynews.com/2025/06/11/4-men-charged-on-suspicion-of-having-destructive-devices-assaulting-officers-during-anti-ice-protests-2/", "title": "4 Men Charged On Suspicion Of Having Destructive Devices Assaulting Officers During Anti Ice Protests 2", "content": "Today's e-Edition Today's e-Edition NewsNewsLatest HeadlinesCrime and Public SafetyCalifornia NewsNational NewsWorld NewsPoliticsEducationEnvironmentScienceHealthTransportationWeather News Latest Headlines Crime and Public Safety California News National News World News Politics Education Environment Science Health Transportation Weather News Latest Headlines Crime and Public Safety California News National News World News Politics Education Environment Science Health Transportation Weather LocalBay AreaSan JoseSanta Clara CountyPeninsulaSan Mateo CountyAlameda CountySanta Cruz CountySal Pizarro Bay Area San Jose Santa Clara County Peninsula San Mateo County Alameda County Santa Cruz County Sal Pizarro Bay Area San Jose Santa Clara County Peninsula San Mateo County Alameda County Santa Cruz County Sal Pizarro ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnistsLetters to the EditorCommentaryCartoonsElection Endorsements Opinion Editorials Opinion Columnists Letters to the Editor Commentary Cartoons Election Endorsements Opinion Editorials Opinion Columnists Letters to the Editor Commentary Cartoons Election Endorsements SportsSportsSan Francisco 49ersSan Francisco GiantsGolden State WarriorsRaidersAthleticsSan Jose SharksSan Jose EarthquakesBay FCCollege SportsWilner HotlineHigh School SportsOther SportsSports ColumnistsSports BlogsGolden State Valkyries Sports San Francisco 49ers San Francisco Giants Golden State Warriors Raiders Athletics San Jose Sharks San Jose Earthquakes Bay FC College Sports Wilner Hotline High School Sports Other Sports Sports Columnists Sports Blogs Golden State Valkyries Sports San Francisco 49ers San Francisco Giants Golden State Warriors Raiders Athletics San Jose Sharks San Jose Earthquakes Bay FC College Sports Wilner Hotline High School Sports Other Sports Sports Columnists Sports Blogs Golden State Valkyries Things To DoEntertainmentThings To DoRestaurants, Food and DrinkCelebritiesTV StreamingMoviesMusicTheaterLifestyleCannabisAdviceTravelPets and AnimalsComicsPuzzles and GamesHoroscopesEvent Calendar Entertainment Things To Do Restaurants, Food and Drink Celebrities TV Streaming Movies Music Theater Lifestyle Cannabis Advice Travel Pets and Animals Comics Puzzles and Games Horoscopes Event Calendar Entertainment Things To Do Restaurants, Food and Drink Celebrities TV Streaming Movies Music Theater Lifestyle Cannabis Advice Travel Pets and Animals Comics Puzzles and Games Horoscopes Event Calendar BusinessBusinessHousingEconomyTechnologyBest ReviewsSiliconValley.com Business Housing Economy Technology Best Reviews SiliconValley.com Business Housing Economy Technology Best Reviews SiliconValley.com MarketplaceBranded ContentPartner ContentBayArea.com Branded Content Partner Content BayArea.com Branded Content Partner Content BayArea.com Real Estate Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Advertise Log In Logout Get Morning Report and other email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Subscribe Log In Get Morning Report and other email newsletters Subscribe Log In Today's e-Edition Today's e-Edition Latest News Crime Politics Environment Science Education Health Transportation California Nation Trending: Another hotel defaults Pay-for-performance Clara Adams’ disqualification San Mateo sheriff scandal 3Below events Finding the missing **4 California men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Two Los Angeles County men face federal charges for possessing Molotov cocktails during anti-immigration-enforcement protests in Los Angeles and Paramount, while two Orange County men face charges of assaulting a federal officer during a rally in Santa Ana, authorities said Wednesday, June 11. RELATED:Hundreds gather in San Jose, Oakland and San Francisco to protest ICE Emiliano Garduno Galvez, 23, of Paramount and Wrackkie Quiogue, 27, of Long Beach each face one charge of possession of an unregistered destructive device, federal authorities said. The defendants face a sentence of up to 10 years in federal prison if convicted. **Related Articles** Text of Gov. Newsom’s speech about Trump’s actions Gov. Newsom urges Americans to ‘not give in to’ President Trump in livecast San Mateo County approves $1.75 million for immigration legal help despite call for more Walters: Trump-Newsom clash over L.A. protests feeds their political interests Feldman: Trump’s National Guard deployment to L.A. is a threat to democracy Galvez was accused of lighting a Molotov cocktail during a Saturday, June 7, protest in Paramount and tossing it over a wall where Los Angeles County sheriff’s deputies were attempting to control a crowd, then running away, said Ciaran McEvoy, a spokesman for the U.S. Attorney’s Office. The following day, Quiogue was accused of possessing a Molotov cocktail while holding a lighter near federal buildings in downtown Los Angeles. Quiogue was spotted by police with the device and arrested, but not before throwing the device while attempting to flee, McEvoy said. Quiogue was ordered to remain detained after his initial court appearance Tuesday, while Galvez was expected to make his first court appearance in the coming days. In Orange County, Christian Andres Garcia, 32, of Anaheim and Rene Luna, 43, of Orange each face a charge of misdemeanor assault on a federal officer stemming from a Monday protest in Santa Ana. Both men face up to one year in federal prison if convicted, McEvoy said. Garcia was accused of throwing objects at law enforcement stationed outside a Homeland Security Investigations office, while Luna allegedly threw water bottles and beer cans at officers elsewhere during the same protest, McEvoy said. Both men were arrested Monday night, June 9, and were expected to make their initial court appearances in the coming days, the spokesman said. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Report an error Policies and Standards Contact Us **RevContent Feed** **Most Popular** Dear Abby: I noticed something odd in the baby photos. Should I tell the mom?Dear Abby: I noticed something odd in the baby photos. Should I tell the mom? **Dear Abby: I noticed something odd in the baby photos. Should I tell the mom?** **Dear Abby: I noticed something odd in the baby photos. Should I tell the mom?** Miss Manners: I refuse to yield my Father’s Day rights to my selfish son-in-lawMiss Manners: I refuse to yield my Father's Day rights to my selfish son-in-law **Miss Manners: I refuse to yield my Father’s Day rights to my selfish son-in-law** **Miss Manners: I refuse to yield my Father’s Day rights to my selfish son-in-law** Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s responseAsking Eric: I sent a text about my excellent son, and I was stunned by his uncle's response **Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s response** **Asking Eric: I sent a text about my excellent son, and I was stunned by his uncle’s response** Harriette Cole: What did she mean by her comment about my birthday party?Harriette Cole: What did she mean by her comment about my birthday party? **Harriette Cole: What did she mean by her comment about my birthday party?** **Harriette Cole: What did she mean by her comment about my birthday party?** Why California runner’s disqualification at state championships touched a national nerveWhy California runner's disqualification at state championships touched a national nerve **Why California runner’s disqualification at state championships touched a national nerve** **Why California runner’s disqualification at state championships touched a national nerve** Harriette Cole: I see the boyfriend’s secret home as a huge red flagHarriette Cole: I see the boyfriend's secret home as a huge red flag **Harriette Cole: I see the boyfriend’s secret home as a huge red flag** **Harriette Cole: I see the boyfriend’s secret home as a huge red flag** Mystery woman has agreed to marry Aaron RodgersMystery woman has agreed to marry Aaron Rodgers **Mystery woman has agreed to marry Aaron Rodgers** **Mystery woman has agreed to marry Aaron Rodgers** Asking Eric: It’s not in my nature to ghost but, boy, is she boringAsking Eric: It's not in my nature to ghost but, boy, is she boring **Asking Eric: It’s not in my nature to ghost but, boy, is she boring** **Asking Eric: It’s not in my nature to ghost but, boy, is she boring** Asking Eric: My son begged us not to bring up our grievance to his touchy in-lawsAsking Eric: My son begged us not to bring up our grievance to his touchy in-laws **Asking Eric: My son begged us not to bring up our grievance to his touchy in-laws** **Asking Eric: My son begged us not to bring up our grievance to his touchy in-laws** Miss Manners: The wedding dinner is for couples only, but I can’t invite a dead manMiss Manners: The wedding dinner is for couples only, but I can't invite a dead man **Miss Manners: The wedding dinner is for couples only, but I can’t invite a dead man** **Miss Manners: The wedding dinner is for couples only, but I can’t invite a dead man** **More in Crime and Public Safety** Frequently targeted Oakland convenience store robbed three times in one day **Frequently targeted Oakland convenience store robbed three times in one day** **Frequently targeted Oakland convenience store robbed three times in one day** Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case **Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case** **Jury convicts Harvey Weinstein of top charge in the retrial of his landmark #MeToo sex crimes case** Former Caltrain director sentenced to 120 days in jail for building secret train station apartment **Former Caltrain director sentenced to 120 days in jail for building secret train station apartment** **Former Caltrain director sentenced to 120 days in jail for building secret train station apartment** Mary Lou Retton apologizes for DUI arrest, enters no contest plea **Mary Lou Retton apologizes for DUI arrest, enters no contest plea** **Mary Lou Retton apologizes for DUI arrest, enters no contest plea** 2025 June 11 News AlertsEmail NewslettersToday’s e-EditionMobile AppsSite Map Email Newsletters Today’s e-Edition Mobile Apps Site Map Email Newsletters Today’s e-Edition Mobile Apps Site Map MarketplacePlace an ObituaryPlace a Real Estate AdLottery Place an Obituary Place a Real Estate Ad Lottery Place an Obituary Place a Real Estate Ad Lottery Contact UsDigital Access FAQJoin our TeamSpecial SectionsSponsor a GroupGet Sponsored AccessPrivacy PolicyAccessibility Digital Access FAQ Join our Team Special Sections Sponsor a Group Get Sponsored Access Privacy Policy Accessibility Digital Access FAQ Join our Team Special Sections Sponsor a Group Get Sponsored Access Privacy Policy Accessibility Advertise With UsNetwork AdvertisingDaily AdsPlace a Legal NoticePublic NoticesMonster.com Network Advertising Daily Ads Place a Legal Notice Public Notices Monster.com Network Advertising Daily Ads Place a Legal Notice Public Notices Monster.com SubscribeMember ServicesManage SubscriptionsThe Mercury News StoreArchive SearchReprints Member Services Manage Subscriptions The Mercury News Store Archive Search Reprints Member Services Manage Subscriptions The Mercury News Store Archive Search Reprints Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}