{"id": 508, "name": "Frontiers in Behavioral Neuroscience", "domain": "frontiersin.org/journals/behavioral-neuroscience", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/behavioral-neuroscience/articles/10.3389/fnbeh.2025.1553501/full", "title": "Behavioral Neuroscience", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavioral Endocrinology Behavioral Neuroscience Archive Emotion Regulation and Processing Individual and Social Behaviors Learning and Memory Motivation and Reward Pathological Conditions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Behavioral Endocrinology Behavioral Neuroscience Archive Emotion Regulation and Processing Individual and Social Behaviors Learning and Memory Motivation and Reward Pathological Conditions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Behavioral Endocrinology Behavioral Neuroscience Archive Emotion Regulation and Processing Individual and Social Behaviors Learning and Memory Motivation and Reward Pathological Conditions Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Behav. Neurosci. Sec. Behavioral Endocrinology Volume 19 - 2025 |doi: 10.3389/fnbeh.2025.1553501 This article is part of the Research TopicAnimal Models of Anxiety and Depression: Exploring the Underlying Mechanisms of Sex Differences - Volume IIView all articles **Chronic 17beta-estradiol treatment improves negative valence, anhedonic profile, and social interactions in ovariectomized, middle-aged female rats** Department of Psychology, Arizona State University, Tempe, Arizona, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Women experience depression at nearly twofold higher rates than men, with middle-age during the menopausal transition being particularly vulnerable. Preclinical studies commonly focus on young adult or aged subjects and/or rely upon a few behavioral tasks. Given the highly variable and heterogenous nature of depression, the current study implemented a behavioral battery to assess whether estradiol (E2, endogenously expressed in women and rats) would improve depressive measures using the Research Domain Criteria (RDoC) for negative valence, anhedonia, sociability, and anxiety in early middle-aged, ovariectomized (OVX) female rats. F344-cdf rats were OVX and injected daily with E2 (3µg/ml, or oil). Behavioral testing began after 14 days of injections, which continued throughout the study. E2 improved the depressive profile when using a composite metric for negative valence (immobility on the forced swim task, FST), anhedonia (duration to initiate grooming following sucrose splash and latency to initiate grooming with sucrose), sociability (time interacting toward a novel conspecific), and novelty-induced anxiety (time spent investigating marbles). Interestingly, FST immobility significantly and positively correlated with sucrose preference to show they were opposingly related: higher immobility on FST corresponded to more sucrose ingested. Also, time spent in a chamber with a novel conspecific was less informative than time directed at the conspecific. Other tasks, such as the marble bury test showed some hoarding behavior. These nuances revealed difficulties in assessing behaviors within and across studies, but overall showed that E2 improved the depressive-like syndrome (DLS) in middle-aged females based upon the RDoC. Keywords:Estrogen improves negative valence, anhedonia and sociability in middle-age Depression, Anxiety, estrogen, sociability, Forced swim test (FST), Sucrose preference Received:30 Dec 2024;Accepted:09 Jun 2025. Copyright:© 2025Conrad, Peay, Slodkova, Kim, Donnay, Acuña and Whittaker. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Cheryl D Conrad, Department of Psychology, Arizona State University, Tempe, 85281, Arizona, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}