{"id": 1468, "name": "Marshalltown Times-Republican", "domain": "timesrepublican.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.timesrepublican.com/news/money-markets/2025/06/apple-unveils-software-redesign-while-reeling-from-ai-missteps-tech-upheaval-and-trumps-trade-war/", "title": "Apple Unveils Software Redesign While Reeling From Ai Missteps Tech Upheaval And Trumps Trade War", "content": "NewsTodays NewsDaily RecordEntertainmentMoney & MarketsIowa NewsNational NewsOutdoors Today Todays News Daily Record Entertainment Money & Markets Iowa News National News Outdoors Today Todays News Daily Record Entertainment Money & Markets Iowa News National News Outdoors Today SportsLocal SportsHigh School FootballIowa SportsNational Sports Local Sports High School Football Iowa Sports National Sports Local Sports High School Football Iowa Sports National Sports OpinionAnother ViewColumnistsOur ViewYour View Another View Columnists Our View Your View Another View Columnists Our View Your View ObituariesView ObituariesPlace Obit View Obituaries Place Obit View Obituaries Place Obit Classifieds Jobs Garage Sales Contact InformationContact UsSubmit NewsSubscribeWhere to Buy the T-RT-R Plus LocationsAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Subscribe Where to Buy the T-R T-R Plus Locations Advertise Statement of Values Terms of Service Contact Us Submit News Subscribe Where to Buy the T-R T-R Plus Locations Advertise Statement of Values Terms of Service Public NoticesView a NoticePlace Notice View a Notice Place Notice View a Notice Place Notice News Sports Opinion Obituaries Classifieds Garage Sales Jobs Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Apple unveils software redesign while reeling from AI missteps, tech upheaval and Trump’s trade war** **** Jun 10, 2025 the associated press CUPERTINO, Calif. — After stumbling out of the starting gate in Big Tech’s pivotal race to capitalize on artificial intelligence, Apple tried to regain its footing Monday during an annual developers conference that focused mostly on incremental advances and cosmetic changes in its technology. The presummer rite, which attracted thousands of developers from nearly 60 countries to Apple’s Silicon Valley headquarters, was more subdued than the feverish anticipation that surrounded the event during the previous two years. Apple highlighted plans for more AI tools designed to simplify people’s lives and make its products even more intuitive while also providing an early glimpse at the biggest redesign of its iPhone software in a decade. In doing so, Apple executives refrained from issuing bold promises of breakthroughs that punctuated recent conferences, prompting CFRA analyst Angelo Zino to deride the event as a “dud” in a research note. In 2023, Apple unveiled a mixed-reality headset that has been little more than a niche product, and last year WWDC trumpeted its first major foray into the AI craze with an array of new features highlighted by the promise of a smarter and more versatile version of its virtual assistant, Siri — a goal that has hasn’t been achieved yet. “This work needed more time to reach our high-quality bar,” Craig Federighi, Apple’s top software executive, said Monday at the outset of the conference. The company didn’t provide a precise timetable for the Siri’s AI upgrade to be finished but indicated it won’t happen until next year, at the earliest. “The silence surrounding Siri was deafening,” said Forrester Research analyst Dipanjan Chatterjee said. “No amount of text corrections or cute emojis can fill the yawning void of an intuitive, interactive AI experience that we know Siri will be capable of when ready. We just don’t know when that will happen. The end of the Siri runway is coming up fast, and Apple needs to lift off.” The showcase unfolded amid nagging questions about whether Apple has lost some of the mystique and innovative drive that turned it into a tech trendsetter during its nearly 50-year history. Instead of making a big splash as it did with the Vision Pro headset and its AI suite, Apple took a mostly low-key approach that emphasized its effort to spruce up the look of its software with a new design called “Liquid Glass” while also unveiling a new hub for its video games and new features like a “Workout Buddy” to help manage physical fitness. Apple executives promised to make its software more compatible with the increasingly sophisticated computer chips that have been powering its products while also making it easier to toggle between the iPhone, iPad, and Mac. “Our product experience has become even more seamless and enjoyable,” Apple CEO Tim Cook told the crowd as the 90-minute showcase wrapped up. IDC analyst Francisco Jeronimo said Apple seemed to be largely using Monday’s conference to demonstrate the company still has a blueprint for success in AI, even if it’s going to take longer to realize the vision that was presented a year ago. “This year’s event was not about disruptive innovation, but rather careful calibration, platform refinement and developer enablement –positioning itself for future moves rather than unveiling game-changing technologies,” Jeronimo said. Besides redesigning its software. Apple will switch to a method that automakers have used to telegraph their latest car models by linking them to the year after they first arrive at dealerships. That means the next version of the iPhone operating system due out this autumn will be known as iOS 26 instead of iOS 19 — as it would be under the previous naming approach that has been used since the device’s 2007 debut. The iOS 26 upgrade is expected to be released in September around the same time Apple traditionally rolls out the next iPhone models. In an early sign that AI wasn’t going to be a focal point of this year’s conference, Apple opened the proceedings with a short video clip featuring Federighi speeding around a track in a Formula 1 race car. Although it was meant to promote the June 27 release of the Apple film, “F1” starring Brad Pitt, the segment could also be viewed as an unintentional analogy to the company’s attempt to catch up to the rest of the pack in AI technology. While some of the new AI tricks compatible with the latest iPhones began rolling out late last year as part of free software updates, the delays in a souped-up Siri became so glaring that the chastened company stopped promoting it in its marketing campaigns earlier this year. While Apple has been struggling to make AI that meets its standards, the gap separating it from other tech powerhouses is widening. Google keeps packing more AI into its Pixel smartphone lineup while introducing more of the technology into its search engine to dramatically change the way it works. Samsung, Apple’s biggest smartphone rival, is also leaning heavily into AI. Meanwhile, ChatGPT recently struck a deal that will bring former Apple design guru Jony Ive into the fold to work on a new device expected to compete against the iPhone. Besides grappling with innovation challenges, Apple also faces regulatory threats that could siphon away billions of dollars in revenue that help finance its research and development. A federal judge is currently weighing whether proposed countermeasures to Google’s illegal monopoly in search should include a ban on long-running deals worth $20 billion annually to Apple while another federal judge recently banned the company from collecting commissions on in-app transactions processed outside its once-exclusive payment system. On top of all that, Apple has been caught in the crosshairs of President Donald Trump’s trade war with China, a key manufacturing hub for the Cupertino, California, company. Cook successfully persuaded Trump to exempt the iPhone from tariffs during the president’s first administration, but he has had less success during Trump’s second term, which seems more determined to prod Apple to make its products in the U.S. The multidimensional gauntlet facing Apple is spooking investors, causing the company’s stock price to plunge by 20% so far this year — a decline that has erased about $750 billion in shareholder wealth. **Newsletter** **Money & Markets** **Money & Markets** **Apple unveils software redesign while reeling from AI missteps, tech upheaval and Trump’s trade war** **Apple unveils software redesign while reeling from AI missteps, tech upheaval and Trump’s trade war** the associated press CUPERTINO, Calif. — After stumbling out of the starting gate in Big Tech’s pivotal race ... **Stop making cents: US Mint moves forward with plans to kill the penny** **Stop making cents: US Mint moves forward with plans to kill the penny** **Trump keeps 10% tariffs on UK but cuts taxes on British autos, steel and aluminum with trade deal** **Trump keeps 10% tariffs on UK but cuts taxes on British autos, steel and aluminum with trade deal** WASHINGTON — President Donald Trump agreed Thursday to cut tariffs on U.K. autos, steel and aluminum in a planned ... **Federal Reserve leaves key rate unchanged as it sees risk of higher prices and higher unemployment** **Federal Reserve leaves key rate unchanged as it sees risk of higher prices and higher unemployment** **Trump limits tariffs on most nations for 90 days, raises taxes on Chinese imports** **Trump limits tariffs on most nations for 90 days, raises taxes on Chinese imports** **Trump threatens more tariffs on China as global markets shudder over how much pain economy can take** **Trump threatens more tariffs on China as global markets shudder over how much pain economy can take** WASHINGTON — Undeterred by a panicked stock market, President Donald Trump threatened additional tariffs on China ... MOST READ **Longtime K9 trainer/handler Melinda Ruopp retires from Marshall County Sheriff’s Office** **Longtime K9 trainer/handler Melinda Ruopp retires from Marshall County Sheriff’s Office** **Gerald \"Jerry\" Gade** **Gerald \"Jerry\" Gade** **Mary Baker** **Mary Baker** **QPS Employment Group celebrates new space with ribbon cutting** **QPS Employment Group celebrates new space with ribbon cutting** **Rev. Dr. Christopher J. Daniel** **Rev. Dr. Christopher J. Daniel** **Vera \"Claudine\" Hofert** **Vera \"Claudine\" Hofert** **Newsletter** **Starting at $4.38/week.** **Subscribe Today** **Subscribe Today** NewsTodays NewsEntertainmentObituaries Todays News Entertainment Obituaries Todays News Entertainment Obituaries SportsLocal SportsHigh School FootballIowa SportsNational Sports Local Sports High School Football Iowa Sports National Sports Local Sports High School Football Iowa Sports National Sports OpinionAnother ViewColumnistsOur ViewYour View Another View Columnists Our View Your View Another View Columnists Our View Your View LifeEngagementsBirthdays and AnniversariesClub News Engagements Birthdays and Anniversaries Club News Engagements Birthdays and Anniversaries Club News ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Marshalltown Newspaper, LLC | https://www.timesrepublican.com | 135 West Main Street, Marshalltown, IA 50158 | 641-753-6611"}