{"id": 1595, "name": "WKYC - Cleveland News", "domain": "wkyc.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wkyc.com/article/life/food/20-best-ice-cream-spots-cleveland-akron-northeast-ohio-2025-mitchells-east-coast-custard-honey-hut-taggarts-stricklands-fairport-harbor-creamery/95-bf368da1-a2ab-45ff-9bde-e6ec65a60ec9", "title": "20 Best Ice Cream Spots Cleveland Akron Northeast Ohio 2025 Mitchells East Coast Custard Honey Hut Taggarts Stricklands Fairport Harbor Creamery", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalInvestigationsNear MeHealthMoneyNation WorldPoliticsEntertainmentVERIFYFeaturesLatest News StoriesScott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nearsOhio Gov. Mike DeWine addresses using National Guard to aid in mass deportations Back Local Investigations Near Me Health Money Nation World Politics Entertainment VERIFY Features Scott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nears Ohio Gov. Mike DeWine addresses using National Guard to aid in mass deportations Back Local Investigations Near Me Health Money Nation World Politics Entertainment VERIFY Features Scott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nears Ohio Gov. Mike DeWine addresses using National Guard to aid in mass deportations WeatherBackForecastRadarClosings & Delays10-DayTrafficEarth & SpaceEnvironmentLatest Weather StoriesFORECAST | Rain returns to Cleveland this weekendNational Weather Service confirms EF1 tornado touched down in Holmes County on Monday Back Forecast Radar Closings & Delays 10-Day Traffic Earth & Space Environment FORECAST | Rain returns to Cleveland this weekend National Weather Service confirms EF1 tornado touched down in Holmes County on Monday Back Forecast Radar Closings & Delays 10-Day Traffic Earth & Space Environment FORECAST | Rain returns to Cleveland this weekend National Weather Service confirms EF1 tornado touched down in Holmes County on Monday SportsBackHigh School SportsCleveland BrownsCleveland GuardiansCleveland CavaliersOSUOlympicsLocked On Podcast NetworkLatest StoriesScott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nearsNCAA announces new rule changes for men's and women's basketball Back High School Sports Cleveland Browns Cleveland Guardians Cleveland Cavaliers OSU Olympics Locked On Podcast Network Scott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nears NCAA announces new rule changes for men's and women's basketball Back High School Sports Cleveland Browns Cleveland Guardians Cleveland Cavaliers OSU Olympics Locked On Podcast Network Scott Taylor out as president of International Soap Box Derby one month before world championships in AkronInternational Soap Box Derby says President and CEO Scott Taylor is no longer with organizationMonth before All-American Soap Box Derby in Akron, organization President and CEO Scott Taylor is outLeadership change announced Akron's 87th annual All-American Soap Box Derby nears NCAA announces new rule changes for men's and women's basketball SearchSearch:Search Advertise With Us Cleveland Akron Mission Possible Education Station Lakeside Today TV listings Contests A Turning Point LeBron James Family Foundation GO-HIO Pets Go! 4:30-7 a.m. 3News at 4 3News at 5 3News at 6 3News at 7 What's Next: 11 p.m. Front Row Friday **20 iconic ice cream shops in Northeast Ohio you need to try in 2025** CLEVELAND — Craving the best ice cream inNortheast Ohio? Look no further! 3News has rounded up 20 must-visit ice cream spots across the region, from local favorites in Cleveland to hidden gems in Akron and beyond. Whether you're in the mood for creamy custards, indulgent sundaes or unique handmade flavors, these iconic spots promise a sweet experience for all. Get ready to explore the top places to satisfy your ice cream cravings. **Dairy King** 6484 Brecksville Road, Independence This old-school, family-run ice cream stand is a hidden gem near the Towpath Trail. Known for its generous portions, Dairy King serves up soft-serve, sundaes, and milkshakes. **East Coast Custard** Locations: Parma Heights, Painesville, Mentor, Lyndhurst and Fairview East Coast Custard has a long history in Northeast Ohio, first opening in Parma Heights in 1985. The shop has over 100 custard flavors that all vary based on location and constantly change. Their locations also offer vegan custard made with oat milk. **Falls Ice Cream** 8094 Columbia Road, Olmsted Falls Falls Ice Cream, located at Grand Pacific Junction in Historic Olmsted Falls, serves a variety of ice cream flavors in a nostalgic setting. **Fairport Harbor Creamery** 202 High St, Fairport Harbor https://fairportharborcreamery.com/current-flavor-options Fairport Harbor Creamery, founded by Brian and Karen Volzer, offers house-made ice cream, boozy ice cream and baked goods, focusing on creative flavors, quality ingredients and a welcoming lakeside experience. **Honey Hut** Locations: Brecksville, Old Brooklyn, Parma and Solon https://gohoneyhut.com/ Since 1974, Honey Hut has been offering special flavors of ice cream. With 13 regular flavors and special flavors rotating each week, there is always something new to try at Honey Hut. **Jeni's Splendid Ice Creams** 67 North Main Street, Chagrin Falls https://jenis.com Grab a delicious scoop and walk down to Chagrin Falls Waterfall for a scenic ice cream experience by the water, **Kamm's Corners Ice Cream Co.** 3764 Rocky River Drive, Cleveland https://www.kammscornersicecream.com/ Kamm's Corners Ice Cream is known for creating premium homemade ice cream flavors at family-affordable prices. They also make custom ice cream cakes that can be ordered ahead of time. **King Kone** Locations: Chardon and Perry https://www.king-kone.com/ King Kone has a flavor for everyone, with over 30 Hershey's hard-serve flavors as well as rich, creamy soft-serve flavors. **K Cream Korner** 1207 W Erie Ave, Lorain K Cream Korner, located in Lorain, offers a wide variety of ice cream flavors, making it a popular destination for both locals and visitors. **Jerry's Dari-Pride** 30136 Euclid Avenue Wickliffe Jerry's Dairy Pride, situated in Wickliffe, is a well-loved ice cream shop offering a diverse selection of flavors, making it a go-to destination. **Mason's Creamery** 4401 Bridge Avenue, Cleveland https://www.masonscreamery.com/ Mason's Creamery is known for its ice cream in the summer and ramen in the winter, both made using the best ingredients they can source. The shop offers classic flavors as well as unique flavors that are the signature of Mason's Creamery. The creamery also offers egg waffle bowls or even a macaroon ice cream sandwich! **Mickey's Ice Cream & Hot Dogs** 14 E. Spaulding Street, Willoughby https://mickeysdtw.com/ Serving locally sourced ice cream since 2022, Mickey’s offers a variety of hard and soft-serve flavors, milkshakes, sundaes, and cobblestones. They also serve jumbo hot dogs and crêpes daily. Located in Downtown Willoughby, it's a great spot for a sweet treat or a quick bite. **Mitchell's Ice Cream** Locations: Rocky River, Ohio City, Beachwood, Strongsville, Solon, Van Aken, Westlake, Avon and Uptown https://www.mitchellshomemade.com/ Mitchell's Ice Cream is a Cleveland staple that creates each batch of ice cream in their kitchen in Ohio City. Mitchell's offers many delicious flavors, ranging from fruity combinations to a chocolate lover's dream. **Mount Granita Italian Ice** Mount Granita Italian Ice Mount Granita Italian Ice 2204 Murray Hill Road, Cleveland https://www.mountgranita.com/ Perhaps you're not in the mood for ice cream, but you're still seeking a refreshing treat. Mount Granita Italian Ice in Little Italy and features handmade Italian ice with fresh fruit, cane sugar and no artificial flavoring. **Pav's Creamery** Locations in Green, Portage Lakes, North Canton, Cuyahoga Falls and Bath https://www.pavscreamery.com/locations/ **Rosati's Frozen Custard** Locations in Northfield and Brunswick https://rosatisfrozencustard.com/ Rosati's Frozen Custard offers rich, creamy frozen custard made fresh all day, featuring a rotating selection of unique special flavors crafted with premium local ingredients. **Skoops Ice Cream** 438 5th St NE, Barberton http://www.skoopsicecream.com/ Customers at Skoops can enjoy a homemade custard that uses three main ingredients: milk, cream and egg yolks. In addition to the traditional chocolate, twist, or vanilla custard, they offer a weekly specialty flavor of homemade custard. Skoops is also known for its super-premium ice cream, which is made with elevated levels of butter fats, giving you a rich, creamy texture and taste unlike anywhere else. **Strickland's Frozen Custard** Locations: Akron, Streetsboro, Fairlawn and Cuyahoga Falls https://www.mystricklands.com/ Founded in 1936, Strickland's Frozen Custard is known for serving up two special flavors each day. **Taggarts Ice Cream** 1401 Fulton Road NW, Canton http://www.taggartsicecream.com/ The ice cream parlor in Canton has been around since 1926 and features ice cream parfaits, sundaes, twisters and ice cream cookie sandwiches. **Toft’s Dairy & Ice Cream Parlor** 3717 Venice Road, Sandusky 3717 Venice Road, Sandusky 3717 Venice Road, Sandusky https://toftdairy.com/ https://toftdairy.com/ https://toftdairy.com/ Since 1900, Toft's has been creating \"one quality\" products through fresh milk and real cream from their family farms to create a unique creamy taste. **** To stream WKYC on your phone, you need the WKYC app. **** **Download the WKYC app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}