{"id": 668, "name": "Institute for Middle East Understanding", "domain": "imeu.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://imeu.org/topic/category/what-every-new-member-of-congress-needs-to-know-about-palestine-israel-poli", "title": "What Every New Member Of Congress Needs To Know About Palestine Israel Poli", "content": "Home About Contact Donate twitter facebook instagram rss **IMEUInstitute for Middle East Understanding** News & Analysis StoriesTestimoniesPalestinian ProfilesPalestinian-American ProfilesPhoto EssaysVideo Stories Testimonies Palestinian Profiles Palestinian-American Profiles Photo Essays Video Stories Testimonies Palestinian Profiles Palestinian-American Profiles Photo Essays Video Stories TopicsNakba & RefugeesSettlementsActivismPalestinian Citizens of IsraelPalestinian ChristiansU.S. RoleWest BankGazaJerusalem Nakba & Refugees Settlements Activism Palestinian Citizens of Israel Palestinian Christians U.S. Role West Bank Gaza Jerusalem Nakba & Refugees Settlements Activism Palestinian Citizens of Israel Palestinian Christians U.S. Role West Bank Gaza Jerusalem CultureFilmLiteratureArtMusicCuisineSports Film Literature Art Music Cuisine Sports Film Literature Art Music Cuisine Sports ResourcesPodcastWhat Congress Needs to Know about Palestine/IsraelCongressional BriefingsPolicy BackgrounderPolicy AnalysisFact SheetsExpert SourcesQ&AsPhotosVideosInfographicsMapsRecommended ReportsHistorical DocumentsPress BriefingsPalestine 101 Podcast What Congress Needs to Know about Palestine/Israel Congressional Briefings Policy Backgrounder Policy Analysis Fact Sheets Expert Sources Q&As Photos Videos Infographics Maps Recommended Reports Historical Documents Press Briefings Palestine 101 Podcast What Congress Needs to Know about Palestine/Israel Congressional Briefings Policy Backgrounder Policy Analysis Fact Sheets Expert Sources Q&As Photos Videos Infographics Maps Recommended Reports Historical Documents Press Briefings Palestine 101 Israeli Settlements | IMEU Policy Backgrounder Israeli Settlements | IMEU Policy Backgrounder Israeli Settlements | IMEU Policy Backgrounder Israeli Settlements | IMEU Policy Backgrounder The Nakba and Palestine Refugees | IMEU Questions and Answers The Nakba and Palestine Refugees | IMEU Questions and Answers The Nakba and Palestine Refugees | IMEU Questions and Answers The Nakba and Palestine Refugees | IMEU Questions and Answers The Gaza Strip | IMEU Policy Backgrounder The Gaza Strip | IMEU Policy Backgrounder The Gaza Strip | IMEU Policy Backgrounder The Gaza Strip | IMEU Policy Backgrounder Explainer: The Anti-Defamation League Explainer: The Anti-Defamation League Explainer: The Anti-Defamation League Explainer: The Anti-Defamation League 3 Questions for an Expert: The ICC Arrest Warrants for Netanyahu & Gallant 3 Questions for an Expert: The ICC Arrest Warrants for Netanyahu & Gallant 3 Questions for an Expert: The ICC Arrest Warrants for Netanyahu & Gallant 3 Questions for an Expert: The ICC Arrest Warrants for Netanyahu & Gallant Resources for Trauma-Informed Reporting Resources for Trauma-Informed Reporting Resources for Trauma-Informed Reporting Resources for Trauma-Informed Reporting **What Congress Needs to Know about Palestine/Israel** **FAQ #2: What Is US Policy Toward the Palestinian People and Israel?** **FAQ #2: What Is US Policy Toward the Palestinian People and Israel?** **FAQ #1: The Palestinian People & Israel: Where Are We & How Did We Get Here?** Palestine/Israel will be one of the most important foreign policy questions Members of Congress will grapple with. **FAQ #1: The Palestinian People & Israel: Where Are We & How Did We Get Here?** Palestine/Israel will be one of the most important foreign policy questions Members of Congress will grapple with. The Institute for Middle East Understanding (IMEU)is a non-profit organization that offers journalists facts, analysis, experts, and digital resources about Palestine and Palestinians. .(JavaScript must be enabled to view this email address) (714) 251-6016 2913 El Camino Real #436 Tustin, CA 92782 twitter facebook instagram rss Privacy Policy Terms of Use © Institute for Middle East Understanding https://imeu.org/topic/category/what-every-new-member-of-congress-needs-to-know-about-palestine-israel-poli/Printed 6/11/25 - 6:03:49© 2025 IMEU"}