{"id": 1910, "name": "Capital Research Center", "domain": "capitalresearch.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://capitalresearch.org/article/report-when-charities-betray-america-how-pro-palestinian-protest-groups-promote-anti-americanism/", "title": "Report When Charities Betray America How Pro Palestinian Protest Groups Promote Anti Americanism", "content": "About Archive Podcast Donate Labor WatchRepublicans and the Teamsters, a Bad Relationship PhilanthropyA Conversation with the U.K.’s Jason Reed (Part 1 of 2) PhilanthropyA Conversation with the U.K.’s Jason Reed (Part 2 of 2) PodcastInfluenceWatch Podcast #367: Explaining Basically Governmental Organizations to Congress **REPORT: When Charities Betray America: How “Pro-Palestinian” Protest Groups Promote Anti-Americanism** Share on Twitter Share on Facebook Print this Page Astudyof the online rhetoric from major “pro-Palestinian” groups and activists in the United States before and after the Hamas attack on Israel on October 7, 2023, concludes that the activists’ protests have morphed into an anti-American and anti-police movement with sharply radicalizing rhetoric that advocates terrorism and sedition on U.S. soil. An analysis of thousands of social media posts by 496 of the most active “pro-Palestinian” groups and activists, many of them connected to “charities” and nonprofits, found a 3,000 percent surge in calls for violence and a 186 percent increase in the use of anti-American and anti-police keywords and phrases since the Hamas-led terrorist attacks on October 7, 2023. The broadening of the “pro-Palestinian” movement’s agenda to include siding with Western adversaries in conflicts around the world and advocating for defunding the police indicates the movement has become a permanent presence. It will not fade when issues surrounding Israelis and Palestinians lose prominence. Read the full reporthere. **Read Next** **Newsletter Signup** Follow Us on Twitter Follow Us on Facebook Follow Us on YouTube Follow Us on Instagram Capital Research Center (CRC) was established in 1984 to promote a better understanding of charity and philanthropy. We support the principles of individual liberty, a free market economy and limited constitutional government: These are the cornerstones of American society. About Archive Magazine Tags Podcast Donate Newsletter Home About Archive Tags Magazine Climate Dollars Dangerous Documentaries Podcast Newsletter Donate Follow Us on Twitter Follow Us on Facebook Follow Us on YouTube Follow Us on Instagram"}