{"id": 1909, "name": "Canadian Dimension", "domain": "canadiandimension.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://canadiandimension.com/articles/view/albertan-independence-against-indigenous-sovereignty-elijah-harper-danielle-smith-and-bill-54", "title": "Albertan Independence Against Indigenous Sovereignty Elijah Harper Danielle Smith And Bill 54", "content": "Canadian Politics Economic Crisis Environment Europe Housing Indigenous Politics Labour Middle East Media Policing War Zones Africa Canada-USA Canadian Business Human Rights Culture Education Asia Feminism Food and Agriculture Globalization COVID-19 Latin America and the Caribbean Occupy Movement Quebec Queer Reviews Science and Technology Social Movements Socialism Sports USA Politics More Articles Columnists Videos Reviews Collections Cartoons The CD Archive Past Issues About Donate Submissions Advertise Advertisement **Albertan independence against Indigenous sovereignty: Elijah Harper, Danielle Smith, and Bill 54** **The movements of the United Conservative Party make it plain that the country is moving towards a national unity crisis** Nolan Long/ May 9, 2025 / 6 min read Canadian PoliticsIndigenous Politics Photo by Aaron Holmes/Flickr Following the election of Liberal Prime Minister Mark Carney on April 28, the Legislative Assembly of Alberta proposed Bill 54, which would amend theCitizen Initiative Act, lowering the threshold number of signatures required to trigger a provincial referendum on constitutional issues (such as secession from the Canadian Confederation). Whiledenyingclaims that she is a separatist, Premier Danielle Smith’s legislation has been criticized as “flirting” with secession. Indeed, Smith hadsaidjust a month ago that if the federal Liberals were re-elected and did not concede to provincial demands, Canada would experience a “national unity crisis.” On May 7, shestatedthat she would “respect the outcome of a referendum on separation.” Now that Carney has received a new mandate from the Canadian electorate, and with Bill 54 on the table, many are concerned about a potential Albertan independence referendum in the near future. Many have taken to social media, claiming that Premier Smith is in for a rude awakening concerning Indigenous sovereignty in Alberta. Some have argued that the premier’s move to separate (if indeed it is such a move) will be blocked by an Elijah Harper-like figure. Such claims are dangerous for two reasons. First, they mythologize and misremember history, as the Meech Lake Accord that Manitoba MLA Elijah Harper had a role in blocking is not comparable to the current Alberta independence movement. Second, such claims demonstrate a gross misunderstanding of the provincial legislation in question, which nullifies the left’s ability to organize against it. **Elijah Harper and the Meech Lake Accord** The Constitution of Canada was ‘patriated’ in 1982 without the consent of Québec Premier René Lévesque. After battling provincial opposition for many years, Prime Minister Pierre Trudeau finally came to an agreement with the English Canadian premiers, excluding Québec from the deal. This did not sit well with Quebecers, and is the cause of much discontent even today. Progressive-Conservative leader Brian Mulroney won the 1984 federal election partly on the promise to bring Québec into the constitutional fold with “honour and dignity.” This campaign promise turned into the Meech Lake Accord. The Meech Lake package was a series of proposed constitutional amendments that would allow Québec to sign onto the new Canadian constitution. While the amendments were agreed to in principle by all the premiers in 1987, things eventually fell apart. The premiers were given three years to ratify the agreed-upon amendments in their provincial legislative assemblies. This long timeframe resulted in changes in governments, which meant the withdrawal of support from provinces such as Newfoundland and Labrador. What matters most for our present discussion is the position of an Indigenous Manitoba MLA, Elijah Harper. Harper was able to block the Meech Lake Accord from being debated in the Manitoba legislature, therefore contributing to the defeat of the proposed constitutional amendments. Harper has been, sometimes rightly, sometimes wrongly, mythologized in the pantheon of Canadian political figures. To be clear, he did not single-handedly stop the Meech Lake amendments from passing. Even if the Manitoba legislature had ratified the deal, the holdout of Newfoundland and Labrador would have still resulted in its failure. However, Harper’s de facto veto of the amendments being debated and passed in the Manitoba legislature constituted a strong Indigenous voice fighting against the Canadian government’s neglect. In the debates over the 1982 constitution, Indigenous nations were excluded.For Harper, it was not right that constitutional amendments should accommodate Québec’s concerns while continuing to ignore those of the original inhabitants of the land. The memory of Elijah Harper’s message remains strong. Canadians remember him as an advocate of Indigenous title and rights, even in the face of the total apathy of the Canadian state. But Canadians also misremember Harper. Raising his name in the contemporary debate over the Albertan independence movement is misleading. Harper did not block a Québec independence vote; rather, he stymied a set of constitutional amendments designed to keep Québecwithin Canada. The two situations are very different and therefore not at all comparable. To misremember what Harper accomplished is not merely a matter of historical inaccuracy. This distortion of fact also has the potential to impede our ability to oppose the Albertan independence movement today. If we do not have a proper understanding of what drives this movement, we cannot properly dispute it. **Dangerous legislative moves** TheCitizen Initiative Actwas passed by the Legislative Assembly of Alberta in 2021 under Jason Kenney’s government. The act allows citizens to propose constitutional amendments to the provincial legislature after collecting the signatures of 20 percent of eligible voters (and the support of 20 percent of voters in at least two-thirds of Alberta’s provincial constituencies). If this amount of signatures is gathered, the petitioner can bring the initiative before the chief electoral officer, who would then refer it to a committee of the legislative assembly. The committee can either support the initiative itself, or a referendum can be held on the issue. The act sets quite a high bar for initiatives to reach the level of public referendum. On April 29, however, the Albertan government tabled changes to theCitizen Initiative Act. Bill 54proposesto lower the number of signatures required to 10 percent, while extending the duration of the collection period, therefore making it easier to accomplish. Such amendments are clearly a move designed to increase the likelihood of a referendum on secession. TheCitizen Initiative Actoutlines that if the petition meets the set requirements, a referendum will proceed on the basis of theReferendum Act. TheReferendum Act“requires a referendum before the legislative assembly can vote on any resolution authorizing an amendment to the Constitution of Canada.” This should make it clear that the conditions surrounding the Albertan independence movement are not comparable with those of the Meech Lake Accord and Elijah Harper. In the context of an Albertan secession referendum, there can be no Indigenous blockage because the amendment will be enacted not primarily by the provincial legislature but by the provincial populace. Albertan independence will silence Indigenous opposition and trample over Indigenous sovereignty just as the Canadian state has done in the past, but it will do so under the guise of democracy and popular referendum. **Albertan independence and Indigenous opposition** The chances of a successful bid for Albertan independence are certainly very low. Angus Reid suggests that only a quarter of the province’s electorate would support independence in a referendum. This is even lower than support for separation in Québec, whichcurrently sitsat about 36 percent (up from a recent low of 29 percent). But while the odds of Alberta separating are low, the odds of a referendum on secession are clearly increasing. The movements of the United Conservative Party make it plain that the country is moving towards a national unity crisis, even while Canadians mightfeelmore united than ever in the face of Trump’s ‘tariff war.’ None of this is to say that Indigenous nations do not have a part to play in opposing Albertan separation. On the contrary, they have the most imperative role. While separation cannot be blocked by a single person like Elijah Harper, it can and will be stopped by unified Indigenous action. Already, Indigenous groups and leaders have spoken up about the irresponsibility and illegality of Premier Smith’s actions. The Federation of Sovereign Indigenous Nations has argued that Smith’s moves ignore “the nation-to-nation treaties signed between First Nations and the Crown.” Alberta is made up of treaty lands, making secession a matter of Indigenous affairs, which is, constitutionally speaking, out of scope for the provincial government. On April 30, Chiefs Sheldon Sunshine and Billy-Joe Tuccaro sent Smith a cease-and-desist letter, ordering her to stop her separation threats. In theirletter, they highlighted that treaties cannot be undone or altered by a mere referendum, which would ignore the sovereignty of Indigenous nations in Alberta. Sturgeon Lake Cree Nation ain’t having the separatists rhetoric from Smith or her ilk…#abpoli#ableg#cdnpolipic.twitter.com/sS8VAq1aJJ It is imperative for socialists to ally with Indigenous peoples and oppose Albertan independence, as separation would constitute an enormous setback for Indigenous rights imaginable in the region. Even as Canada continues to renege on its historic and contemporary promises to Indigenous peoples, an ultraconservative independent Alberta would certainly be far worse for Indigenous groups (and other marginalized groups, such as immigrants and trans people) in the province. The treaties that Canada has ratified must be respected, as must the sovereignty of the original inhabitants of these lands. Self-determination remains the basic criterion for assessing Indigenous rights in Canada; whereas Alberta is now attempting to fundamentally eliminate Indigenous self-determination through separation, socialists have anideological dutyto defend it, as Elijah Harper did many years ago. Nolan Long is an undergraduate student in political studies at the University of Saskatchewan. **We Need Your Help** More than 75% of our operating budget comes to us in the form of donations from our readers. These donations help to pay our bills, and honorariums for some of our writers, photographers and graphic artists. Our supporters are part of everything we do. Advertisement **Popular Stories** Mark Carney is no wartime homebuilder One day, everyone will have always been against this What we really mean when we talk about solving the housing crisis Ontario’s costly nuclear folly Who can be a fascist? Let’s look to Mussolini’s Italy, then let’s look to Israel Advertisement Advertisement **Related Reading** Indigenous PoliticsIs reconciliation a peaceful process?Tamara Starblanket/ December 14, 2019 / 4 min read **Is reconciliation a peaceful process?** Tamara Starblanket/ December 14, 2019 / 4 min read **Is reconciliation a peaceful process?** Tamara Starblanket/ December 14, 2019 / 4 min read Indigenous PoliticsDecolonizing the zombie apocalypse: An interview with Jeff Barnaby about his new film ‘Blood Quantum’Sean Carleton/ April 26, 2020 / 5 min read **Decolonizing the zombie apocalypse: An interview with Jeff Barnaby about his new film ‘Blood Quantum’** Sean Carleton/ April 26, 2020 / 5 min read **Decolonizing the zombie apocalypse: An interview with Jeff Barnaby about his new film ‘Blood Quantum’** Sean Carleton/ April 26, 2020 / 5 min read ReviewsConfronting medical colonialismReview bySusan Rosenthal/ February 3, 2021 / 5 min read **Confronting medical colonialism** Review bySusan Rosenthal/ February 3, 2021 / 5 min read **Confronting medical colonialism** Review bySusan Rosenthal/ February 3, 2021 / 5 min read Canadian PoliticsCancelling Canada Day is a move towards truth, justice and reconciliationPam Palmater/ June 29, 2021 / 7 min read **Cancelling Canada Day is a move towards truth, justice and reconciliation** Pam Palmater/ June 29, 2021 / 7 min read **Cancelling Canada Day is a move towards truth, justice and reconciliation** Pam Palmater/ June 29, 2021 / 7 min read Canadian PoliticsUnderstanding the RCMP’s role in residential schoolingSean Carleton/ May 25, 2023 / 5 min read **Understanding the RCMP’s role in residential schooling** Sean Carleton/ May 25, 2023 / 5 min read **Understanding the RCMP’s role in residential schooling** Sean Carleton/ May 25, 2023 / 5 min read EnvironmentIndigenous nations lead opposition to pipeline developmentEditorial/ September 10, 2016 / 3 min read **Indigenous nations lead opposition to pipeline development** Editorial/ September 10, 2016 / 3 min read **Indigenous nations lead opposition to pipeline development** Editorial/ September 10, 2016 / 3 min read **Support CD Today** More than 75% of our operating budget comes to us in the form of donations from our readers. These donations help to pay our bills, and honorariums for some of our writers, photographers and graphic artists. Our supporters are part of everything we do. **Never Miss A Story** Sign up for our email newsletter and get our news and analysis delivered on the regular. About Donate CD Archive Submissions Advertise Contact Us Founded in 1963, Canadian Dimension is a forum for debate on important issues facing the Canadian Left today, and a source for analysis of national and regional politics, labour, economics, world affairs and art. We acknowledge the financial support of the Government of Canada. All content ©1963–2025 Canadian Dimension |Top of page"}