{"id": 384, "name": "The European Council on Foreign Relations (ECFR)", "domain": "ecfr.eu", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ecfr.eu/publication/the-interest-of-values-the-eus-democracy-promotion-in-the-western-balkans-and-the-eastern-neighbourhood/", "title": "The Interest Of Values The Eus Democracy Promotion In The Western Balkans And The Eastern Neighbourhood", "content": "Sign up forECFR’snewsletters,updates,and mailingsand dive into the most pressing foreign policy issues with insights from our experts,programmes,and offices: I consent to receiving the selected ECFR newsletters and to the analysis of open & click rates. I can revoke my consent later by clicking on the link at the end of every newsletter or by writing to[email protected]. More information on how we process personal data can be foundhere. ECFR home Berlin London Madrid Paris Rome Sofia Warsaw Washington LinkedIn Bluesky Twitter Instagram YouTube Podcasts RSS feeds ProgrammesAfricaAfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperationAsiaAsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific regionEuropean PowerEuropean PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereigntyMiddle East and North AfricaMiddle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkeyUnited StatesNewUnited StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relationsWider EuropeWider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement AfricaAfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperation AfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperation **Africa** The Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel. **Highlights from Africa** Sudan African Union Sahel EU-Africa cooperation AsiaAsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific region AsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific region **Asia** The Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan. **Highlights from Asia** China India Japan Indo-Pacific region European PowerEuropean PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereignty European PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereignty **European Power** The European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine. **Highlights from European Power** Charting the Long War Climate EU enlargement European cohesion European sovereignty Middle East and North AfricaMiddle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkey Middle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkey **Middle East and North Africa** The Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition. **Highlights from Middle East and North Africa** Israel-Palestine The Gulf North Africa Migration Turkey United StatesNewUnited StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relations United StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relations **United States** The US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them. **Highlights from United States** US foreign policy US domestic politics Transatlantic relations Wider EuropeWider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement Wider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement **Wider Europe** The Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine. **Highlights from Wider Europe** Russia Ukraine Belarus Western Balkans EU enlargement AfricaAfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperation AfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperation **Africa** The Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel. **Highlights from Africa** Sudan African Union Sahel EU-Africa cooperation AfricaThe Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel.Highlights from AfricaSudanAfrican UnionSahelEU-Africa cooperation **Africa** The Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel. **Highlights from Africa** Sudan African Union Sahel EU-Africa cooperation **Africa** The Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel. **Africa** The Africa programme analyses the geopolitics of the Africa-Europe relationship. In particular, the programme delves into relations between the African Union and the European Union to find creative foreign policy tools and strategies. It also focuses on two regions that are particularly relevant for Europe: the Horn of Africa and the Sahel. **Highlights from Africa** Sudan African Union Sahel EU-Africa cooperation AsiaAsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific region AsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific region **Asia** The Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan. **Highlights from Asia** China India Japan Indo-Pacific region AsiaThe Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan.Highlights from AsiaChinaIndiaJapanIndo-Pacific region **Asia** The Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan. **Highlights from Asia** China India Japan Indo-Pacific region **Asia** The Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan. **Asia** The Asia programme seeks to help Europe recalibrate its relationship with China and its Asian partners. The programme analyses China’s domestic situation, its role in the region, and its increasing global influence. It also places a renewed emphasis on fostering Europe’s relationships with the Indo-Pacific, especially India and Japan. **Highlights from Asia** China India Japan Indo-Pacific region European PowerEuropean PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereignty European PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereignty **European Power** The European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine. **Highlights from European Power** Charting the Long War Climate EU enlargement European cohesion European sovereignty European PowerThe European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine.Highlights from European PowerCharting the Long WarClimateEU enlargementEuropean cohesionEuropean sovereignty **European Power** The European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine. **Highlights from European Power** Charting the Long War Climate EU enlargement European cohesion European sovereignty **European Power** The European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine. **European Power** The European Power programme is focused on helping Europeans develop sustainable policy solutions to the issues affecting the European Union’s capacity to act with unity on the global scene. This includes analysing the path forward for enlargement, the energy transition, and European support for Ukraine. **Highlights from European Power** Charting the Long War Climate EU enlargement European cohesion European sovereignty Middle East and North AfricaMiddle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkey Middle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkey **Middle East and North Africa** The Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition. **Highlights from Middle East and North Africa** Israel-Palestine The Gulf North Africa Migration Turkey Middle East and North AfricaThe Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition.Highlights from Middle East and North AfricaIsrael-PalestineThe GulfNorth AfricaMigrationTurkey **Middle East and North Africa** The Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition. **Highlights from Middle East and North Africa** Israel-Palestine The Gulf North Africa Migration Turkey **Middle East and North Africa** The Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition. **Middle East and North Africa** The Middle East and North Africa programme seeks to support a coherent European agenda in pursuit of regional interests. The programme works with European and regional governments, local voices, and civil society to advance channels of dialogue as well as providing direct policy prescriptions to secure conflict de-escalation, regional stabilisation, and democratic transition. **Highlights from Middle East and North Africa** Israel-Palestine The Gulf North Africa Migration Turkey United StatesNewUnited StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relations United StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relations **United States** The US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them. **Highlights from United States** US foreign policy US domestic politics Transatlantic relations United StatesThe US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them.Highlights from United StatesUS foreign policyUS domestic politicsTransatlantic relations **United States** The US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them. **Highlights from United States** US foreign policy US domestic politics Transatlantic relations **United States** The US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them. **United States** The US programme helps Europeans create policy responses to developments in US domestic politics and foreign policy. The programme seeks to strengthen transatlantic relations by exploring the obstacles to a more balanced partnership and developing ideas to overcome them. **Highlights from United States** US foreign policy US domestic politics Transatlantic relations Wider EuropeWider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement Wider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement **Wider Europe** The Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine. **Highlights from Wider Europe** Russia Ukraine Belarus Western Balkans EU enlargement Wider EuropeThe Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine.Highlights from Wider EuropeRussiaUkraineBelarusWestern BalkansEU enlargement **Wider Europe** The Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine. **Highlights from Wider Europe** Russia Ukraine Belarus Western Balkans EU enlargement **Wider Europe** The Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine. **Wider Europe** The Wider Europe programme aims to help the European Union defend its interests and values in the Western Balkans, Turkey, Russia, and eastern Europe, as well as the South Caucasus and central Asia. The programme also supports EU decision-makers work on a unified and coherent policy to address the challenges resulting from Russia’s full scale-invasion of Ukraine. **Highlights from Wider Europe** Russia Ukraine Belarus Western Balkans EU enlargement AnalysisPolicy BriefsPolicy AlertsCommentariesSpecialsPodcasts Policy Briefs Policy Alerts Commentaries Specials Podcasts Policy Briefs Policy Alerts Commentaries Specials Podcasts TopicsGeoeconomicsEuropean security initiativeClimate and EnergyMigration Geoeconomics European security initiative Climate and Energy Migration Geoeconomics European security initiative Climate and Energy Migration Events Experts AboutAbout ECFRContact usCouncilJobsLeadershipStaffSupport us About ECFR Contact us Council Jobs Leadership Staff Support us About ECFR Contact us Council Jobs Leadership Staff Support us OfficesBerlinLondonMadridParisRomeSofiaWarsawWashington Berlin London Madrid Paris Rome Sofia Warsaw Washington Berlin London Madrid Paris Rome Sofia Warsaw Washington Search Wider Europe **The interest of values: The EU’s democracy promotion in the Western Balkans and the eastern neighbourhood** Policy Brief 31 July 2024 ListenPauseStop Print **Share** LinkedIn Bluesky Tweet Instagram WhatsApp **Table of contents** **Summary** Russia’s all-out invasion of Ukraine brought a new geopolitical urgency to EU enlargement. The EU now faces the task of balancing that urgency with the need to help aspiring members in the Western Balkans and the eastern neighbourhood transform into genuine liberal democracies. Indeed, the EU’s imperative to ensure it remains a community of resilient democracies means democracy promotion in candidate countries is a key geopolitical interest for the bloc. The policies and instruments the EU has deployed in pursuit of democracy promotion in its neighbourhood – primarily the enlargement policy and eastern neighbourhood policy – hold several important lessons for the post-2022 round of enlargement. The EU will need to apply its conditionality more consistently and predictably. It should also approach cooperation with ‘hybrid’ regimes in both regions in a more principled way, by supporting civil society and non-state initiatives to bring about change ‘from below’. But democracy promotion starts at home – and the EU will need to address its own rule of law crises to prevent systemic competition between autocracies and democracies reaching further into the bloc, potentially hollowing it out from within. **Introduction** On 24 February 2022, Russia’s full-scale invasion of Ukraine spectacularly hammered the final nail into the coffin of the post-cold war era. The return of a large-scale conventional war to Europe buried three main assumptions thathad guidedthe European Union’s policymaking in its eastern and south-eastern neighbourhoods since the early 1990s. The first of these was that cooperation alone could ensure security and stability on the European continent. The second was that such cooperation would be fostered by the inevitable – if not linear – transition of former “people’s democracies” to genuine liberal democracies. Finally, the invasion finished off the idea that the EU’s cooperation with these states should focus mainly on encouraging and accompanying them on that path towards stable, resilient democracies: they also needed protection from and stronger defences against foreign malign influence and aggression. Since the 1990s, the EU had underpinned its engagement in the Western Balkans and the eastern neighbourhood with the premise that these three ideas were interrelated: democratisation would turn these countries into cooperative partners that, in turn, contributed to Europe’s stability and security. The EU thereforedeployedvarious policies and instruments to promote and hasten its neighbours’ democratic transitions. This democracy promotion is a key element of the EU’senlargement policy, which has itself been central to the way the bloc conceives of its relationships with its neighbours. Prior to 2022, the EU tackled democracy promotion in Western Balkans states mainly in the framework of that enlargement policy (even though not all of them enjoyed formal candidate status). In eastern Europe, on the other hand, the bloc did not initially envisage EU membership for the countries in question. It therefore pursued greater alignment with EU norms and values through itseastern partnership policy– at least in part to avoid confrontation with Russia. The full-scale invasion of Ukraine superseded that division, with the EU granting candidate status toMoldovaandUkrainein June 2022 and then toGeorgiain December 2023. These decisions were a signal of the EU’s commitment to the security of the eastern neighbourhood. But they also brought enlargement in general firmly back onto the EU’s agenda after years of stagnation and fatigue. The implication is that all these countries will eventually become EU member states and should therefore comply with theCopenhagen criteria– the set of rules and standards that aim to ensure the EU remains a community of liberal democracies. The EU’s renewed vigour for enlargement means its efforts to promote democracy in both the Western Balkans and the eastern neighbourhood are now exceptional cases: compared to the EU’s foreign policy engagement with other parts of the world, but also compared to how other international organisations such as the United Nations pursue democracy promotion in these regions. Other organisations promote democracybasedpurely on values, without being affected themselves by the nature of the political regimes in the countries they work with. But the EU’s goal within its enlargement policy is to transform and prepare countries to join a political and economic union that shares and defends common values, benefiting both the EU and the candidate countries. Enlargement is therefore a transformative process both for the candidate countries and for the EU; the consolidation of democracy and rule of law in the candidate countries before they join helps to ensure that the EU will remain a community of democracies. In this paper, we examine the EU’s efforts to promote democracy in three countries in the Western Balkans (Albania, Bosnia and Herzegovina, and Serbia) and three in eastern Europe (Georgia, Moldova, and Ukraine). We first take a closer look at the shift in the EU’s engagement with its neighbours in response to Russia’s war against Ukraine. This underlines that democracy promotion is a key geopolitical interest for the EU – and not just a matter of values. We then map a variety of policies and instruments that the EU has used to promote democracy in the two regions since the early 2000s. Finally, we set out some lessons the EU can learn from its previous efforts at democracy promotion in the Western Balkans and eastern neighbourhood and how it can begin to build on these to achieve its geopolitical goals. In selecting these policies, we adopted a broad definition of democracy asoutlinedby researchers Morten Bøås, Mathilde TE Giske, and Kari Osland. Accordingly, democracy encompasses not only a high-quality, free, and fair multi-party electoral process but also respect for human rights and key elements of good governance, such as the rule of law and accountability. A well-functioning democracy creates conditions for trust from societies to state institutions, and gains legitimacy by providing physical and economic safety and creating conditions for economic growth and a promising future for citizens. But the EU’s efforts may not have always contributed favourably to this outcome. The bloc’s instruments and policies become part of the political economies of its partner countries and contribute to shaping them, by creating opportunities and constraints for decision-makers and other political actors. This could, in turn, result in unexpected and sometimes adverse effects. **Russia’s war and the return of enlargement** The return of enlargement touches on two issues of fundamental importance to the EU’s identity: its role and self-definition as a geopolitical actor and its transformative power as a promoter of democracy and rule of law. Geopolitics undoubtedly lies at the heart of the bloc’s rediscovered enthusiasm for enlargement. As early as 2019, European Commission president Ursula von der Leyen haddescribedthe commission’s mandate as “geopolitical”, recognising the changing international environment as a defining issue for the EU’s identity. Russia’s 2022 invasion then demonstrated that, as long as countries in the Western Balkans and eastern neighbourhood were not integrated with the EU, they would remain vulnerable to foreign interference or even outright aggression. This led the EU and its member states to shift their perspective on enlargement. The bloc’s earlier focus on the economic, demographic, and political challenges of integrating new members had resulted in 20 years of ‘enlargement stasis’. This was consistent with the EU’s preoccupation with internal dynamics following a series of crises, from the 2008 financial turmoil, through Brexit, to the covid-19 pandemic. The stagnation also reflected a lack of pressure from member states on the EU to integrate the Western Balkans and from the EU on the Western Balkans states to undertake the necessary reforms. But the full-scale invasion of Ukraine introduced a new notion of geopolitical urgency. Enlargement thus shifted from a policy that aimed to integrate candidate countries into a common space of freedom and shared values to one that focused on protecting them (and the EU) against foreign interference and aggression. While the EU’s geopolitical maturity remains more a matter of aspiration than reality, the other identity question at stake – the bloc’s role as democracy promoter – is part of its DNA. The EU was conceived as a beacon of democratic values; enlargement has traditionally been the bloc’s most powerful instrument to extend the reach of those values beyond its borders. It is through leading by example and exporting its fundamental norms that the EU has expanded its influence and contributed to democratic reforms in its neighbourhood. As long as external powers did not actively and massively contest the EU’s standards on democracy and rule of law, this approach could even have served as a substitute for the bloc’s geopolitical orientation. Clearly, previous rounds of EU enlargement were also motivated by geopolitics: a stable and secure Europe has always been anobjectiveof enlargement policy. But, until Russia’s full-scale invasion of Ukraine, the EU’s focus on norms and values helped it ignore uncomfortable geopolitical realities even once they became quite apparent (for instance, with Russia’s illegal annexation of Crimea in 2014). This all changed with the EU’s decision to grant Ukraine and Moldova candidate status in June 2022, driven more by security considerations than progress on democratic reforms. The pace at which the EU took subsequent stepsraised eyebrows(for instance, the European Council’s decision to open accession negotiations in December 2023 and their launch in June 2024), most notably in the Western Balkans. Moreover, some commentators have expressedconcernsthat the EU could sacrifice its identity as a democracy promoter on the altar of its geopolitical ambitions. But European leaders and EU policymakers have repeatedly stressed that their geopolitical motivations will in no way undermine the bloc’s democracy and rule of law credentials. At the October 2023 European Council summit in Granada, von der Leyenmade clearit was the progress countries made in aligning their laws with EU rules and standards that should dictate the pace of membership, not an arbitrary deadline. The European Commission’s November 2023 enlargement package balanced geopolitics with aclear commitmentalso to ensuring accession was based on merit. Theconclusionsof the December 2023 EU summit reiterated how “aspiring members need to step up their reform efforts, notably in the area of rule of law, in line with the merit-based nature of the accession process and with the assistance of the EU”. **Combining geopolitics and democracy promotion** Indeed, for the EU to succeed as a larger community of democracies, it will need to approach its ‘aspiring geopolitical player’ and ‘democracy promoter’ identities as more – not less – intertwined. The reasons for this are manifold. Firstly, rule of law and democratic standards can helpincreasesocial resilience against foreign influence. A lack of democracy and rule of law opens up vulnerabilities that external actors can exploit. This is often the case in “hybrid regimes” – political systems in which rule of law is lacking and state institutions are dysfunctional or inefficient due to corruption and a high level of political clientelism. In these systems civil society is often weak and media freedom limited, all of which increases the societies’ vulnerability to malign foreign influences such as disinformation and propaganda. Secondly, the assumption that autocratic or hybrid regimes are guarantors of long-term stability often proves to be wrong.SerbiaandGeorgiaillustrate this, as both countries are experiencing significant democratic backsliding and domestic tensions. Power competition between democracies and autocracies also makes hybrid regimesmore vulnerableto Chinese and Russian influence than democracies, which contradicts European interests. Moreover, the still-powerful democraticaspirationsof civil society in countries such as Georgia do not bode well for ‘authoritarian stability’: social unrest that undermines the legitimacy of authoritarian leaders creates conditions for unpredictability, and not long-term engagement with the EU. Thirdly, the EU has experienced its own crises of democracy and rule of law – in particular inHungary and Poland. This demonstrates the pitfalls of democratic backsliding and the risks that poses to the bloc’s internal order. If enlargement is a geopolitical tool that aims to increase the EU’s resilience, its leaders will need to pay even more attention to the quality of democratic standards in prospective member states to avoid a destabilisation of the bloc from within. Democracy promotion in the Western Balkans and eastern neighbourhood is therefore a key geopolitical interest for the EU. **Democracy promotion in the Western Balkans and eastern neighbourhood** The EU’s policies in the Western Balkans and eastern neighbourhoodare designedto promote and defend the EU’s fundamental principles, such as peace and security, and respect for rights and freedoms. As one EU official we interviewed for this paper pointed out, the democracy-related priorities within the bloc’s multiple policies and initiatives focus on supporting free elections; the effectiveness of parliaments in ensuring checks and balances and political plurality; and supporting civil society, including organisations, media, and independent investigative journalists.[1] In the Western Balkans, thekey policiesare the EU’s stabilisation and association process (SAP), which established a framework for cooperation between the EU and the countries in the Western Balkans as early as 1999, and then enlargement policy since 2004. In Georgia, Moldova, and Ukraine, the key policies are theeastern partnership(EaP), introduced in 2009 as part of the European neighbourhood policy (ENP) which paved the way for association agreements (AAs) that offered closer integration with the EU but not future membership. Within these policies, the EU has placed increasing emphasis on rule of law in its efforts at democracy promotion. This is particularly the case within the enlargement framework since 2020, when the EU adopted itsrevised enlargement methodology. This methodology introduced benchmarks and grouped negotiating chapters into clusters, elevating the “Fundamentals – Rule of Law” to become the most important cluster for negotiating with a candidate country. The aim was to ensure candidate countries had the cornerstones in place upon which they could build and strengthen reforms in other areas. But internal developments within the EU also influenced its change of emphasis, such as the rise ofilliberal governancein Austria as early as 1999, and later in Hungary and Poland, which threatened the EU’s core values and its overall functioning. In both regions, the EU has employed a dual approach to democracy promotion. This strategy includes providing direct support for government institutions to implement reforms alongside support for civil society and independent media. Within its overall financial assistance for democracy, the EU has usually prioritised the former type of support and focused its efforts on rule of law over human rights and fundamental freedoms (seeannexe I). This emphasis on rule of law is also visible in the allocation of funding at the project level. Projects related to rule of law tend to have budgets that range from €6 to €34m per country and implementation periods of more than three years. Projects that target civil society enjoy less funding – with budgets of under €2m and implementation periods between 2-4 years (seeannexe II). This disparity is largely because investments in the rule of law require the strengthening of existing institutions or the establishment of new ones, as well as investments in administrative capacities. But it also reflects the EU’s greater emphasis on governance and institution building. In terms of assistance for civil society organisations that defend human rights and fundamental freedoms, the EU works through theEuropean Instrument for Democracy and Human Rightsand theEuropean Endowment for Democracy. It has alsoextendedparticipation in programmes such as Horizon 2020, Creative Europe, Erasmus+, Customs 2020, Europe for Citizens, TAIEX and Twinning to countries in both regions. According to some EU officials, participation in educational and cultural programmes such as these can indirectly contribute to democracy. This is due to an awareness-raising effect among participants of exposure to the benefits of a well-functioning democracy and EU membership.[2] While the EU’s priorities for strengthening democracy have remained consistent across both regions, the intensity and nature of the EU’s engagement were shaped by distinct objectives prior to Russia’s 2022 invasion of Ukraine. **Western Balkans** From the early 2000s the EU’s goal in the Western Balkans was integration, and democracy promotion was closely tied to the accession process. This meant that the EU’s leverage to promote democracy and induce concrete change was strong in the Western Balkans, as countries were subject to a demanding process in which their progress towards EU accession depended on fulfilment of the Copenhagen criteria. This first of these conditionsrequirescountries to have “stable institutions that guarantee democracy, the rule of law, human rights and respect for and protection of minorities”. But even with this most powerful incentive – the prospect of EU membership – the EU has struggled to significantly enhance democratic practices in the Western Balkans. The legacy of wars following the violent dissolution of Yugoslavia in the 1990sprompteda decade of EU engagement with the Western Balkans that prioritised conflict prevention and stability. During the wars and in the immediate aftermath, the EU emphasised humanitarian relief and aid for refugees and displaced persons. It also undertook post-conflict political mediation in Bosnia (Dayton talks), Kosovo (Status talks), and Macedonia (Ohrid agreement) and helped secure Montenegro’s peacefulindependencefrom Serbia in 2006. Since Kosovo’s declaration of independence, the EUhas ledas a facilitator of the Kosovo-Serbia dialogue on the normalisation of relations. The bloc also supported peacebuilding efforts in the region by deploying civilian and military missions under the European security and defence policy – a forerunner of thecommon security and defence policy. As the Western Balkans began to achieve conditions conducive to peace, the EU deepened its political engagement in the region. This widened the bloc’s engagement to include policies aimed at supporting democratisation and encouraging economic development. For instance, initiatives such as the stability pact for south-eastern Europe – which preceded theRegional Cooperation Council– paved the way for progress on cooperation among Western Balkans states, including on trade liberalisation and facilitation. This culminated with the Western Balkans’membershipof the Central European Free Trade Agreement in 2006. However, the EU’s breakthrough policy in the region was thestabilisation and association processwithin which it concluded stabilisation and association agreements (SAAs) with Western Balkans countries. This established a framework for an institutional partnership between the EU and Western Balkans countries, opening the way towards EU membership. This prospect of future EU membership was confirmed at the Thessaloniki summit in 2003. From this point forward the EU’s main policy for the Western Balkans became enlargement policy, and all its instruments and programmes focused on supporting countries in their accession path. The enlargement policy for the Western Balkans builds upon the SAP, which emphasised stability as a central aspect of its regional engagement. This emphasis was also evident in the EU’s priorities for the SAP’s financial instruments: community assistance for reconstruction, development, and stabilisation and theinstrument for pre-accession assistance. In the early phase of the EU’s engagement, these instruments largely focused on creating the conditions for cooperation among Western Balkans states, overcoming the legacies of war, improving neighbourly relations, and fostering economic development. The tendency for the EU to prioritise stability through regional cooperation and promote democratisation through stability is also reflected in its framework agreements with SAP countries. The first clue is in the name: stabilisation and association agreements – instead of simply ‘association agreements’. Secondly, while democracy and rule of law feature as central principles in these agreements, Western Balkans countries have been subject to additional political conditionality that went beyond Copenhagen criteria. That is, the EU hasestablishedgood neighbourly relations and regional cooperation as preconditions for countries to deepen their relationship with the EU and advance in their accession process. **Eastern neighbourhood** In the eastern neighbourhood before 2022, the EU’s primary aim was greater political and economic rapprochement. This meant its democracy promotion focused on good governance and alignment with the bloc’s values. Until Russia’s all-out invasion of Ukraine, there was no consensus among EU member states that Georgia, Moldova, and Ukraine would one day join the bloc. While some member states were wary of confrontation with Russia in the region, the primary reason for this was reservations about enlargement more broadly. After the Soviet Union dissolved in 1991, the EU’s engagement with Georgia, Moldova, and Ukraine was initially modest. The blocfocused ontechnical assistance and post-conflict rehabilitation rather than political dialogue or EU association. In the late 1990s, the EU began to formalise its relationships with Georgia, Moldova, and Ukraine through partnership and cooperation agreements. These agreements focused on promoting harmonious economic relations between the EU and its neighbours. But the EU’s ‘big bang’ enlargement in 2004 incorporated ten new countries from central Europe and the Baltic states, bringing Georgia, Moldova, and Ukraine geographically closer to the EU. This prompted the EU to establish the ENP in 2003 and form partnerships with countries in the eastern and southern neighbourhoods. The aim was to prevent new dividing lines emerging between the enlarged EU and its neighbours. To deepen and strengthen ties with the eastern neighbourhood, the EU launched the EaP within its ENP in 2009. The bloc aimed this policy at Armenia, Azerbaijan, Belarus, Georgia, Moldova, and Ukraine, with the objective of promoting economic integration and political association with the EU, as well as cooperation among the six countries. The EaPemphasisedrule of law, human rights, and democracy as the basis for partnership with the EU. Within the EaP framework, the bloc also offered closer association without EU membership to willing partners by introducing AAs. Within these agreements the EU placed an even stronger focus on adherence to democratic values,stipulatingthat negotiations for AAs would commence only upon sufficient progress in democracy, rule of law, and human rights. Georgia, Moldova, and Ukraine signed AAs with the EU in 2014. The AAs were an ambitious move from the EU, which at the time was pursuing a rather cautious rapprochement with countries to the east. According to the EU officials we interviewed for this paper, concluding the agreements was far from an easy task.[3]This was the case especially for Ukraine, whose leadership at the time of the negotiations was closely connected to Russia and less inclined to undertake democratic reforms and associate more closely with the EU. Following significant pressure from Russia to join its Eurasian integration project (including the Eurasian Customs Union and Single Economic Space), Ukraine’s then-president Viktor Yanukovychpostponedthe signing of the AA with the EU, triggering Ukraine’s “Euromaidan” protests or the “Revolution of dignity”. The final negotiated agreement forUkrainewas less ambitious thanGeorgia’sandMoldova’s, reflecting Yanukovych’s resistance and Russian pressure. Despite that difference, the agreements – alongside Russia’s aggressive policies – contributed toconsolidatingpro-European sentiment in Moldova and Ukraine. These sentimentsintensifiedin Ukraine with Russia’s illegal annexation of Crimea and the war that started in the Donbas region shortly thereafter. The EU also facilitated alignment with EU values through additional policies that served as incentives, such as visa-free travelagreementsbetween the EU and Moldova in 2014, and Georgia and Ukraine in 2017. The EU’s foreign policy chief, Josep Borrell,notedin a 2021 speech to the European Parliament that “our reinforced cooperation with our Eastern Partners and support to democracy remain on top of the European Union’s interest. We cannot be an island of democracy in a world of autocracies.” This demonstrates the EU’s clear ambition prior to Russia’s all-out invasion to nurture closer cooperation with its neighbours to the east. But, as discussed, it was only after February 2022 that the three countries became formal candidates. **Lessons for the future** The EU’s democracy promotion is not a standalone, linear policy but a component of bigger policies guided by the EU’s changing priorities and complex regional contexts. Between 2007 and 2022, internal challenges such as the financial crisis, the rise of the far right, the migration crisis, Brexit, and the covid-19 pandemic shifted the EU’s focus away from enlargement and engagement with its neighbours. Both regions subsequently experienced a stagnation in reforms. But the EU’s renewed commitment to enlargement since 2022 could revitalise democracy promotion and strengthen the EU’s geopolitical position in its neighbourhood. Its previous efforts offer several lessons in this regard. **Aim for clarity and consistency in conditionality** The EU accession process should drive candidate countries’ transformations into stable democracies. But the EUlimitsits transformative power if it does not apply the conditionality principle in a consistent way. Georgia and Serbia, for example, have experienced state capture, widespread corruption, and democratic backsliding in recent years. But both countries have nevertheless managed to advance their EU integration status. The EUopeneda new cluster of negotiations with Serbia in 2021; Georgia was granted candidate status in 2023. In addition, the EUhas appliedconditionality beyond the Copenhagen criteria in the Western Balkans countries from the very start of the process. This aligned with the EU’s priorities for the region, which initially focused on ensuring post-war stability, fostering good neighbourly relations, and encouraging regional cooperation. Indeed, the EU designed the integration process for the Western Balkans to help its partners resolve lingering issues stemming from the legacy of the wars – for example, by including conditions such as cooperation with international tribunals for war crimes and later the resolution of issues between Kosovo and Serbia. But this complicated the enlargement process, likely slowing down progress on democratic reforms for some countries in the region. The bloc has also imposed extra conditionality on some Western Balkans candidates due to bilateral disputes with existing EU member states, which shifted the emphasis away from democratic reforms and made the process less predictable for candidate countries. Conditionality related to the EU’s democracy promotion in Georgia, Moldova, and Ukraine followed a ‘more-for-more’ principle. Since EU membership was not on the cards for the three countries until 2022,the ideawas that progress on democratisation – for instance, a deeper commitment to human rights and rule of law – would lead to a deeper partnership with the EU. It was on this principle that the EU signed AAs and deep and comprehensive free trade area agreements with Georgia, Moldova, and Ukraine to accompany the visa liberalisation agreements. However, the three countries may not have made much progress on reforms at the time the AAs were signed, which again suggests some inconsistency in the EU’s prior approach to conditionality. The EU’s revised enlargement methodologygroupsnegotiating chapters into clusters and places rule of law and fundamental reforms at the core of the enlargement process. It also attaches clearer conditionality and benchmarks to the process, with the aim of making it more predictable. Negotiations on “Cluster 1 – Fundamentals” open first and close last. This means that progress under that clusterdeterminesthe overall pace of negotiations for a candidate country. This is promising, but it remains to be seen how effectively the EU will apply conditionality in the post 2022 enlargement process. The effectiveness will depend also on the credibility of the enlargement offer to partner countries, as without a genuine perspective for membership the EU has less leverage to apply conditionality. The EU could also make greater use of financial assistance as an incentive to accelerate democratic reforms or to reverse backsliding. The EUreducedits financial assistance for Moldova from€101m in 2014to€90m in 2015and in 2018frozea €100m aid package for the country in response to elections that did not comply with democratic practices. While this approach did not lead to immediate progress on democracy, it sent the right message to leaders in the region about the EU’s ‘red lines’ in the framework of its cooperation with partners. The EU has now begun to adopt a more ‘stick-based’ approach in Georgia in response to the passing of a controversial law thatbrandsWestern-backed media outlets and NGOs as “foreign agents”. The EU hassuspendedGeorgia’s EU accession process and its support from the European Peace Facility, totalling €30m for 2024. According to one EU official, part of Georgia’s financial assistance within the current action plan will be redirected to civil society and NGOs.[4] In the Western Balkans, the EU has previously applied measures that included the freezing of financial assistance for specific situations that are linked to actions that represent a security threat, such as therestrictive measuresagainst Republika Srpska in Bosnia and Herzegovina in 2011 and inKosovoin 2023. The 2024 reform and growth facility for the Western Balkans for the first timemakesthe region’s access to funds dependent on progress on reforms. In the next round of enlargement, the EU should more systematically apply conditionality to the financial assistance it provides for candidate countries. This should include what it provides for Western Balkans candidate countries through the IPA; and for Georgia, Moldova, and Ukraine through theneighbourhood, development and international cooperationinstrument. For example, the EU could introduce a simpler standardised process to freeze funds if democratic backsliding takes place in candidate countries. As the war continues in Ukraine and security issues unfold once again in the Western Balkans, it is in the EU’s interest to balance political and geopolitical considerations with the application of the conditionality principle. How the EU navigates this will be decisive for the credibility of the enlargement process as a whole and alter its potential to transform hybrid regimes into stable democratic states. **Address the regional context and the absence of leadership** The effectiveness of the EU’s democracy promotion in the Western Balkans and eastern neighbourhood depends on political will and unity in both the EU and candidate countries, a secure and peaceful regional context, and a low level of hybridity in the states in question. In neither of the regions in question have these favourable conditions been present at the same time, and the likelihood that they will be in the next few years remains slim. The period from 2014 to 2022 was marked by a lack of political will in the EU to pursue enlargement. But, without the prospect of enlargement, the EU lost its most effective tool for promoting democracy in the Western Balkans. This lack of momentum indirectly contributed to the consolidation of hybrid regimes as the poor engagement prolonged the status quo. It also generated significant enlargement fatigue in the candidate countries among leaders and public. In the eastern neighbourhood, EU democracy promotion policies had to compete against Russiantoolsof influence, including economic and political pressure, strategic corruption, and disinformation. This led the EU to adopt a cautious approach to the EaP, avoiding confrontation with Russia in order not to expose its partners to additional Russian pressure. The EU alsowaivedits democracy promotion ambitions for countries of its eastern neighbourhood that were neither democracies nor willing to cooperate with the EU on this issue, for instance, Belarus and Azerbaijan. Before 2022, civil society in Georgia, Moldova, and Ukraine was theprimary driving forcefor closer relations with the EU. The EU’s increased support for civil society, particularly since 2014,consolidatedpro-EU sentiments and enhanced the capacity of civil society organisations to press their governments for reforms. For instance, the election of Moldova’s pro-EU president Maia Sandu was largely a result of citizens demanding more democracy and less corruption, as well as seeking greater alignment with the EU and the West. This kind of pressure was significant in enabling Moldova and Ukraine to achieve a sufficient level of readiness to begin the EU accession process in 2022. By offering the EU membership perspective to these countries, the EU has empowered itself as an actor in the region, with stronger leverage to help transform these countries into stable democracies. As discussed, however, the bloc’s success will be subject to coherent application of conditionality. The post-2022 reality in the eastern neighbourhood is favourable in terms of the political will for democratic reforms – both within the EU and in Moldova and Ukraine. But, despite theirconsiderable progressover the past two years, Russia’s war still hinders the governments of Moldova and Ukraine in their efforts to implement the reforms. This is particularly the case for Ukraine, but Russia also periodically targets Moldova with hybrid actions. The EU will need to increase its technical and financial assistance to Moldova’s and Ukraine’s governments to increase their administrative capacities and continue with the implementation of democratic reforms. Georgia, on the other hand, once a frontrunner in democratisation, has experienced a drastic reversal over the past three years. As one EU official noted, “Everything happened so fast that we were unprepared to deal with it.”[5]Georgia’s situation exemplifies how quickly democratic progress can be lost, especially in countries where oligarchs and corrupt officials wield significant influence. **Enhance support for civil society and socialisation programmes** Democracy promotion in some countries in the Western Balkans and eastern neighbourhood is hindered by the vested interests of authoritarian regimes and oligarchic systems. Civil society organisations havecriticisedthe EU’s approach of engaging with authoritarian and corrupt leaders in the Western Balkans. In the eastern neighbourhood, the EU’s approach to cooperation with Belarus and Azerbaijan has alsocome under fire. And Georgian civil society is now increasing pressure on the EUto rethinkits cooperation with the current government. In the past, the EU has redirected some of its support for civil societies in these regions in certain situations – for instance, followingMoldova’scompromised local elections in 2018 andBelarus’srigged election in 2020. The EU should build on this and adopt a more principled approach to authoritarian or corrupt leaders in these regions, leaning towards engagement with civil society organisations. Perhaps even more importantly, extending participation in EU programmes such as Horizon 2020 and Erasmus+ to Western Balkans states and Georgia, Moldova, and Ukraine allows people, especially younger generations, to experience democracy with their own eyes. This helps build horizontal trust across national boundaries. Increased funding through the European Instrument for Democracy and Human Rights and independent organisations such as the European Endowment for Democracy have allowed for rapid and flexible funding of pro-democracy projects in the two regions. The EU’s re-engagement since 2022 will require it to build on this in pursuit of enlargement, stability, and economic development. The bloc’s strategy cannot rely solely on cooperation with governments. Instead, the EU will need to make substantial investments at the societal level, focusing on empowering civil society, fostering media freedom, and promoting grassroots democratic initiatives. These efforts are essential to apply pressure on governments and drive meaningful change. **Promote democracy at home** Over the past decade, the EU has experienced its own internal rule of law crisis that is far from over. This has significantly altered the bloc’s politics and its policies. When Hungary’s prime minister Viktor Orban started an illiberal overhaul of the country’s political system in 2012, EU institutions wereunwillingto make use of treaty provisions that would have allowed them to intervene. With Hungary being a relatively small country, EU leaders did not view it as a major threat for the EU as a whole. It was the breakdown of the rule of law-based system in Poland after 2015 that really sounded the alarm. But even then, the EU’s reaction was slow and for several years remained ineffective. Neither therule of law dialoguethe European Commission initiated with Poland in January 2016 northe Article 7 procedurethat it opened with the country in December 2017 (with the involvement of other EU member states) produced any results. By April 2018, Poland had largely completed an overhaul of its judicial system that abolished the separation of powers. Only then did the EU’s dispute with Poland over the rule of law produce a significant breakthrough: the Court of Justice of the European Uniondeclareditself competent to deal with complaints about “systemic” violation of the rule of law in EU member states. The same year, the European Commissiondecidedto use the infringement procedure against Poland’s judiciary reform. Although the EU institutions acted in line with EU treaties, the decisions had a truly revolutionary character that provide a new framework for protection of rule of law within the bloc. The crises in Hungary and Poland, as well as the EU’s experience in dealing with Bulgaria and Romania which joined the EU without fully complying with the ‘fundamentals’, sensitised EU institutions and national governments to the risks related to democratic backsliding. This included the damage they did to trust among leaders in the Western Balkans and the eastern neighbourhood regarding the legitimacy of the EU’s enlargement mechanism. For several EU member states, the confrontation with populist regimes in Poland and Hungary led to theconclusionthat rule of law conditionality needs to be strengthened before new members can join the bloc and that its role as an instrument of the EU enlargement policy should be more straightforward. The revised enlargement methodology adopted in 2020 and the 2023growth planfor the Western Balkans reflect this assumption. The EU has placed more emphasis on strengthening reforms in candidate countries as well as on the rule of law conditionality of the EU funds they receive. These new provisions in the enlargement policy mirror solutions adopted within the bloc: payments from the EU’sRecovery and Resilience Facilityare strongly linked to reforms within member states. A newregulationthat the European Commission adopted in 2021 made it possible to withhold payments from the EU budget for countries in which rule of law standards do not provide sufficient protection against fraud. The EU’s crisis experience thusimplies that“the more the systemic competition between democracies and authoritarian regimes extends into the EU, the better protected the fundamental principles of the EU must be.” **Develop more specific evaluation criteria** The European Commission (in collaboration with the EU delegations) monitors and assesses whether countries have made advances on deep and sustainable democracy through its annual progress reports. These progress reports are structured according to the chapters of the EU acquis for the accession countries, and more loosely around different priority areas for non-accession partners. For both sets of countries, the European Commission conducts a review of the progress made on the areas identified in the overarching framework agreements, although the review is more in-depth for accession candidates. In doing so, the EU often uses data from various external organisations (such as the OSCE or Council of Europe). In addition to reports prepared by the European Commission, the European Court of Auditors also prepares occasional reports on the success of the EU’s external democracy promotion efforts. But the EU needs more uniform, clear-cut criteria to assess the level of progress made on democracy promotion. Up until now, the bloc mainly checks progress against action priorities identified in previous progress reports. But the EU does not sufficiently measure the effects of the actions countries have taken. This makes it difficult to assess the degree to which EU policies have not only been implemented, but also achieved results. **Conclusion** EU enlargement’s new chapter is playing out in a challenging environment, marked by systemic competition between democracies and authoritarian regimes. The EU’s democracy promotion in the Western Balkans and the eastern neighbourhood will also continue to be challenged by internal developments in the bloc, the regional context, and external interference. In light of Russia’s invasion of Ukraine, it has only become more urgent for the EU to defend democracy and the EU’s core values both within the EU and in its immediate neighbourhood. The ultimate goal of the EU’s approach should remain focused on helping its neighbours build resilient democracies, thereby reducing the ability of foreign malign actors, including Russia, to exploit vulnerabilities both within these regions and in the EU itself. But so far, the EU’s democracy promotion has been limited by the hybrid nature of the political systems in the regions in question. The EU’s priorities in the support it provides to the countries in the two regions compounds this limitation. While the EU supports democracy at the societal level through various programmes and projects aimed at improving conditions for civil society and media, a bottom-up approach to democracy promotion that centres on trust building is not a priority in its engagement strategy. Instead, it privileges cooperation with political leaders and state institutions, and relies heavily on a ‘carrot and stick’ approach to bring about change. The EU officials we spoke to for this paper tended to defend the EU’s approach in the Western Balkans over the past two decades and reject the criticism that the EU has valued stability in the candidate countries over their democratisation.[6]But before 2022, the EU’s policies seem to have had a relatively modest effect on democratisation in those countries and in the eastern neighbourhood. The European Commission’s progress reports – despite their flaws – reveal ups and downs but overall confirm only unsatisfactory improvement in most countries. Of course, there are many factors at play that influence a country’s democratic process – and the EU’s policies and instruments certainly do not act alone to produce this lack of results. But if the EU is to remain a community of democracies, it will need to make better use of its instruments and policies designed to promote and defend democratic principles. This means the EU’s geopolitical goals and democracy promotion are deeply intertwined. It also implies that the bloc should attach more conditionality to the political and financial support it provides. Moreover, the EU should consider investing more in a bottom-up approach to strengthening democracy in the Western Balkans and eastern neighbourhood, with the aim of reducing the level of hybridity in some partner states. Rule of law and democratic standards are essential for resilience against foreign influence. The EU should prioritise advancing these principles in its neighbouring regions and supporting them with technical and financial assistance. This could help foster transparent and accountable governance, thus enhancing stability and security for the entire European continent. **Methodology** We conducted both extensive desk research and interviews to construct an in-depth overview of the EU’s efforts at democracy promotion in the six case study countries. The desk research engaged, firstly, with EU primary documents. These included communications, staff working documents, reports, and programming documents from the European Commission. We also examined council communications, reports from the European Court of Auditors, and the texts of agreements between the EU and the case study countries. These documents were used to establish the EU’s priorities in the case study countries, its financial allocations, and EU institutions’ assessment of the bloc’s efforts at democracy promotion. Where EU documents were unavailable, the desk research engaged with data from secondary literature in the form of academic and grey literature. For the selection of the specific programmes or projects highlighted in this text, we adopted five criteria: a minimum duration of two years; a completion date within the last two years; an EU funding contribution of at least €500,000; implementation in the capital city and a secondary city where possible; and alignment with one of the four components identified in the definition of democracy (that is: free and fair elections; rule of law; human rights; and civil society participation). To supplement the desk research, we conducted 18 interviews. Of these, 12 involved former and current officials from the European Commission and the European External Action Service in Brussels. The 6 additional interviews were conducted with members of the EU delegations in the six selected case study countries. **About the authors** Piotr Burasis the head of ECFR’s Warsaw office and a senior policy fellow. His research focuses on Poland’s EU and foreign policy, EU enlargement, and German politics. Marie Dumoulinis director of the Wider Europe programme at the European Council on Foreign Relations. Prior to joining ECFR, Dumoulin worked as a French career diplomat. She held a number of positions in French diplomatic missions abroad, for example, in Turkmenistan, Algeria, and Germany, and was seconded to the German Foreign Ministry during the German OSCE Chairmanship. Tefta Kelmendiis the deputy director of the Wider Europe programme at ECFR. Prior to joining ECFR, Kelmendi worked as a diplomat at the Embassy of Kosovo in France, where she was responsible for Kosovo’s relations with French-speaking countries and integration into international organisations. Marlene Marx is an intern with the Wider Europe programme at the European Council on Foreign Relations, based in the Paris office. Prior to joining ECFR, Marx held various research assistant positions at Sciences Po Paris School of International Affairs and the University of Groningen, working on projects on international economic sanctions and the European defence industry. **Annexe I: Financial support** This annexe presents data on the main instruments the EU uses to provide financial support to countries in the Western Balkans (the instrument for pre-accession assistance – or IPA – in various iterations) and the eastern partnership (the European neighbourhood instrument – or ENI – and the neighbourhood, development and international cooperation instrument – or NDICI). Regarding democracy promotion, the data illustrates two key points. Firstly, financial support typically allocated to democracy and rule of law priority areas is generally lower than that allocated to growth and environment-related priorities. Secondly, within the overall funds designated for democracy promotion, the largest share usually goes to priority areas related to good governance. However, recent years have seen an increasing focus on the rule of law, particularly evident in the increased funding allocation for Western Balkans countries, reflecting initiatives such as the revised enlargement methodology of 2020 which put rule of law at its centre. Disclaimer: This data is based on desk research from information available on EU portals. It reflects certain limitations as to the availability and consistency of data related to support for democracy. Furthermore, there is a general lack of comparability between the data for the Western Balkans and eastern partnership countries due to the EU’s varying methods of measurement and differing concepts for democracy used across both regions. **Annexe II: Project descriptions** Selected projects in Western Balkans countries Region-wide Name:Horizontal Facility for the Western Balkans and Türkiye III Years:2023-2026 Funding:€41m (85 per cent from the EU; 15 per cent from the Council of Europe) Partners:Council of Europe Link:https://pjp-eu.coe.int/en/web/horizontal-facility/home Objectives:Support reforms in human rights, the rule of law, and democracy. Strengthen justice, combat corruption and economic crime, and promote anti-discrimination. Help the countries meet European standards and advance in the EU enlargement process. Albania Name:EU for Justice Reform Years:2019-2023 Funding:€34m Partners:/ Link:https://euprojects.al/euprojects/eu-for-justice-reform-2/ Objectives:Strengthen the rule of law and law enforcement; reduce corruption in government agencies and the judiciary; and improve the independence, transparency, efficiency, and accountability of the Albanian justice system while aligning with European standards. Name:EU for Justice Reform – Complementary Technical Assistance Years:2020-2023 Funding:€34m Partners:/ Link:https://euprojects.al/euprojects/eu-for-justice-reform-2/ Objectives:Strengthen the rule of law and law enforcement; reduce corruption in government agencies and the judiciary; and improve the independence, transparency, efficiency, and accountability of the Albanian justice system while aligning with European standards. Name:EU for Justice Reform – Complementary Technical Assistance Years:2020-2023 Funding:€8m Partners:/ Link:https://euprojects.al/euprojects/eu-for-justice-reform/ Objectives:Strengthen the rule of law and law enforcement; reduce corruption in government agencies and the judiciary; and improve the independence, transparency, efficiency, and accountability of the Albanian justice system while aligning with European standards. Name:Judiciary under the spotlight Years:2023-2026 Funding:€526,300 Partners:/ Link:https://euprojects.al/euprojects/judiciary-under-spotlight/ Objectives:Develop a judicial monitoring framework for civil society organisations (CSOs) to monitor and evaluate the Albanian judiciary’s functioning in compliance with legal, procedural, and best practices. Name:National Resource Centre for Civil Society in Albania Years:2016 to 2022 Funding:€526,315 Partners:/ Link:https://euprojects.al/euprojects/national-resource-centre-for-civil-society-in-albania/ Objectives:Strengthen the capacities of CSOs to be effective, transparent, and accountable, and to create an environment conducive to civil society participation, participatory democracy, and EU integration in Albania. Name:Youth Standing Up for Human Rights in Albania Years:2016-2022 Funding:€526,315 Partners:/ Link:https://euprojects.al/euprojects/national-resource-centre-for-civil-society-in-albania/ Objectives:Strengthen the capacities of CSOs to be effective, transparent, accountable, and to create an environment conducive to civil society participation, participatory democracy, and EU integration in Albania. Name:Action against economic crime in Albania (Part of Horizontal Facility) Years:2023-2026 Funding:€895,000 Partners:Council of Europe Link:https://www.coe.int/en/web/tirana/action-against-economic-crime-in-albania Objectives:Strengthen legal and operational frameworks to align with GRECO recommendations, improve the effectiveness of law enforcement and the criminal justice system in combating economic crime, and enhance legislative and institutional capacities to oversee political finances and trace and confiscate criminal assets. Name:Advancing protection from discrimination in Albania (Part of Horizontal Facility) Years:2023-2026 Funding:€850,000 Partners:Council of Europe Link:https://www.coe.int/en/web/tirana/advancing-the-protection-from-discrimina-tion-in-albania1 Objectives:Improve protection for minorities and vulnerable groups against discrimination and hate speech, enhance the capacities of public institutions and civil society organisations to combat discrimination, hate speech, and hate crime, and raise public awareness to foster a more inclusive society. Bosnia and Herzegovina Name:EU4Justice – PHASES I and II Years:2019-2025 Funding:€6.7m Partners:/ Link:https://eu4justice.ba/en/about-project/ Objectives:Align the justice system with European standards by enhancing the rule of law; improving the independence, quality, effectiveness, and accountability of the judiciary; and strengthening its efficiency in combating organised crime and corruption. Name:EU4Electoral Process Years:2021-2022 Funding:€2m Partners:/ Link:https://eu4justice.ba/en/about-project/ Objectives:Improve the integrity, transparency, and efficiency of Bosnia and Herzegovina’s electoral process, align with international standards and recommendations, and support the Central Election Commission in implementing electoral reforms. Name:EU4Civil Society - Support to existing and newly established Civil Society Organisa- tions’ networks Years:2022-ongoing Funding:€1 million Partners:/ Link:https://www.eeas.europa.eu/delegations/bosnia-and-herzegovina/eu-civil-soci- ety-eu4cscapacity-building-governments-include-csos-decision-making-bosnia-and_enObjectives:Strengthen cooperation and dialogue between governments and civil society in Bosnia and Herzegovina, supporting inclusive social dialogue and social partners in legislation, collective negotiations, and reform implementation. Name:EU Civil Society Facility and Media Programme for Bosnia and Herzegovina Years:2021-2023 Funding:€1 million Partners:/ Link:https://neighbourhood-enlargement.ec.europa.eu/document/download/75d78516- bae1-4df3-ae42-b0ff0035447b_en Objectives:Strengthen participatory democracy and EU integration in Bosnia and Herzegovina by enhancing the role of civil society and media and promoting networking among CSOs in areas such as the rule of law, anticorruption, and social inclusion. Serbia Name:EU for the Rule of Law Years:2022-2025 Funding:€20.8m Partners:/ Link:https://www.euzatebe.rs/en/projects/eu-for-the-judiciary-reform-in-serbia Objectives:Enhance the judiciary’s independence and accountability, strengthen the ad- ministrative capacities of courts and public prosecutors’ offices, and align Serbian judicial practices with European standards. Name:EU for Fight Against Corruption and for Fundamental Rights (Part of EU for the Rule of Law) Years:2022-2025 Funding:€5m Partners:/ Link:https://www.euzatebe.rs/en/projects/eu-for-fight-against-corruption-and-for-funda-mental-rights- Objectives:Enhance preventive anticorruption measures and strengthen the protection of fundamental rights for Serbia to meet its Chapter 23 (Judiciary and Fundamental Rights) EU accession obligations. Name:Technical Capacity Facility for the Implementation of Action Plans for Chapters 23 and 24 (Part of EU for the Rule of Law) Years:2022-2025 Funding:€5m Partners:/ Link:https://www.euzatebe.rs/en/projects/eu-for-technical-capacities-in-chapters-23-and-24Objectives:Enhance Serbia’s technical capacities to meet EU obligations in Chapters 23 (Judiciary and Fundamental Rights) and 24 (Justice, Freedom, and Security); improve strategic, institutional, and human resources; and support the procurement and training necessary to implement the Action Plans. Name:Pulse of Europe – Media trip to Europe Years:2020-2026 Funding:€900,000 Partners:/ Link:https://www.euzatebe.rs/en/projects/pulse-of-europe--media-trips-to-eu Objectives:Raise awareness of Serbia’s EU accession among citizens through media, support journalists in producing quality content about European integration, and foster debate and experience exchange on EU integration by organising media trips and public events. Name:Development of System for Management of Cohesion Policy Years:2019-2022 Funding:€2,696,600 Partners:/ Link:https://management-cohesion-policy.euzatebe.rs/en/about-project Objectives:Prepare Serbia’s public administration for effective implementation of the EU cohesion policy by adopting the legal and institutional framework, prepare relevant plans and programmes, and capacity-building programmes. Name:Strengthening human rights protection in Serbia (Part of Horizontal Facility) Years:2023-2026 Funding:€1m Partners:Council of Europe Link:https://www.coe.int/en/web/belgrade/strengthening-human-rights-protection-in-serbiaObjectives:Ensure the enjoyment of rights in line with European human rights standards, enhance legal professionals’ capacities to handle human rights cases and execute European Court of Human Rights judgments, and facilitate judiciary-stakeholder dialogue for coherent domestic implementation of human rights standards. Name:Promoting and protecting freedom of expression and media (Part of Horizontal Facility) Years:2023-2026 Funding:€720,000 Partners:Council of Europe Link:https://www.coe.int/en/web/belgrade/protecting-freedom-of-expression-and-of-the-media-in-serbia Objectives:Promote freedom of expression and improve the application of European standards; enhance the protection of journalists; and create a safer, more pluralistic media environment. Name:Combating discrimination and promoting diversity in Serbia (Part of Horizontal Facility) Years:2023-2026 Funding:€800,000 Partners:Council of Europe Link:https://www.coe.int/en/web/belgrade/strengthening-human-rights-protection-in-serbiaObjectives:Support legislative and policy reforms to combat discrimination and protect minority rights, strengthen capacities to counter hate speech and hate crime, and promote the rights of vulnerable groups, including youth, Roma, and LGBTI+ persons. Selected projects in eastern European countries Georgia Name:Inform, Empower, Act! Civil Society for good budgetary governance Years:2019-2023 Funding:€1.5 million Partners:Implemented by UNDP Link:https://eu4georgia.eu/projects/eu-project-page/?id=715 Objectives:Strengthen evidence-based policy and lawmaking processes in parliament, increase parliament’s capacities for government oversight, and enhance public engagement in parliamentary processes through participatory democracy and open governance principles. Name:Human Rights for All II Years:2020-2024 Funding:€2.3m Partners:UN, implemented by UNDP and OHCHR Link:https://eu4georgia.eu/projects/eu-project-page/?id=1481 Objectives:Promote respect for human rights and strengthen protection mechanisms; improve the independent investigation of crimes committed by law enforcement officials; and combat torture and other forms of ill-treatment, ensuring comprehensive legal protection for minority groups and vulnerable populations. Name:Consolidating Parliamentary Democracy in Georgia Years:2019-2023 Funding:€1.5m Partners:Implemented by UNDP Link:https://eu4georgia.eu/projects/eu-project-page/?id=715 Objectives:Strengthen evidence-based policy and lawmaking processes in parliament, increase parliament’s capacities for government oversight, and enhance public engagement in parliamentary processes through participatory democracy and open governance principles. Name:Civil Society STAR Initiative Years:2019-2023 Funding:€1.5m Partners:Implemented by UNDP Link:https://eu4georgia.eu/projects/eu-project-page/?id=1491 Objectives:Improve the policy and financial framework for civil society, strengthen the links between CSOs and their constituencies, and enhance the organisational capacities and accountability of individual CSOs and networks across Georgia. Name:Quality Media and Conscious Media Consumption for Resilient Society Years:2023-2025 Funding:€798,005 Partners:/ Link:https://eu4georgia.eu/projects/eu-project-page/?id=1905 Objectives:Contribute to media freedom, media and information literacy and public resilience to disinformation, and support local media to strengthen democracy in Georgia. Moldova Name:Strengthening the Rule of Law and Anti-corruption Mechanisms in the Republic of Moldova Years:2020-2024 Funding:€7.8m Partners:/ Link:https://eu4moldova.eu/projects/eu-project-page/?id=1225 Objectives:Raise awareness among citizens and civil society about the harm of corruption, strengthen anticorruption institutions and their coordination with civil society, and support the implementation of the national integrity and anticorruption strategy in high-risk sectors such as education, health, and agrifood. Name:Enhance transparency, accountability of and access to the judiciary system Years:2021-2023 Funding:€1.03m Partners:/ Link:https://eu4moldova.eu/projects/eu-project-page/?id=1803 Objectives:Identify and address impediments to access to justice and fair-trial rights, increase the capacity of lawyers and improve the legal aid system to ensure effective access to justice for all citizens, and support the design and implementation of judicial reforms. Ukraine Name:EU-UNDP Parliamentary Reform Project Years:2019-2022 Funding:€3m Partners:UNDP Link:https://eu4ukraine.eu/en/projects-en/eu-project-page-en?id=707 Objectives:Strengthen the legislative, oversight, and representative functions of the Ukrainian parliament; enhance professional capacities and human resource management within the parliamentary secretariat; and improve transparency, accountability, and citizen engagement through modernised communication strategies and digital tools. Name:MediaFit programme for building information integrity in south & east Ukraine Years:2021 to 2023 Funding:€4m Partners:Canal France International (CFI), Lithuanian Radio and Television (LRT) Link:https://eu4ukraine.eu/en/projects-en/eu-project-page-en?id=1585 Objectives:Strengthen the editorial independence and digital capacities of target independent and public media, enhance fact-checking capacity, dismantle disinformation, and support producing relevant educational content for conflict-affected regions. Name:Reinforcing the role of CSOs in the democratisation of Ukraine Years:2020-2023 Funding:€796,997 Partners:/ Link:https://eu4ukraine.eu/en/projects-en/eu-project-page-en?id=721 Objectives:Involve civil society actors in democratisation and war-related processes, enhance their capacity for community engagement, strengthen internal governance of regional CSOs, and improve policy dialogue by informing citizens about international assistance and countering propaganda. Name:European Union and Council of Europe working together to strengthening the protection of human rights in Ukraine Years:2019-2022 Funding:€3m Partners:/ Link:https://eu4ukraine.eu/en/projects-en/eu-project-page-en?id=690 Objectives:Support media freedom by ensuring public broadcasting independence and journalist safety, strengthen the ombudsperson’s capacity to prevent human rights violations, advocate against discrimination, and promote human rights-compliant prison management. [1]Authors’ interview with an EU official, Brussels, June 2024. [2]Authors’ interviews with EU officials, Brussels, June 2024. [3]Authors’ interviews with EU officials, Brussels, 2024. [4]Authors’ interview with EU official, online, June 2024. [5]Authors’ interviews with EU official, held under Chatham House Rule, online, June 20, 2024. [6]Authors’ interviews with EU officials, Brussels, June 2024. This paper is part of the Horizon Europe project “Re-engaging with neighbours in a state of war and geopolitical tensions.” It was first published onthe RE-ENGAGE website. RE-ENGAGE has received funding from the European Union's Horizon Europe research and innovation programme under grant agreement No 101132314. The European Council on Foreign Relations does not take collective positions. ECFR publications only represent the views of their individual authors. **Subscribe to our newsletters** Be the first to know about our latest publications, podcasts, events, and job opportunities. Join our community and stay connected! Sign up forECFR’snewsletters,updates,and mailingsand dive into the most pressing foreign policy issues with insights from our experts,programmes,and offices: I consent to receiving the selected ECFR newsletters and to the analysis of open & click rates. I can revoke my consent later by clicking on the link at the end of every newsletter or by writing to[email protected]. More information on how we process personal data can be foundhere. **More on Wider Europe** **Making them pay: How Ukraine’s special operations could bring Putin to negotiate** Lesia Ogryzko Policy Alert 10 June 2025 **The long game: How Europeans can shape the outcome of Ukraine-Russia talks** Jana Kobzova, Nicu Popescu Commentary 6 June 2025 **Share** LinkedIn Bluesky Tweet Instagram WhatsApp AboutAbout usContact usCouncilEventsJobsLeadershipStaffSupport us About us Contact us Council Events Jobs Leadership Staff Support us About us Contact us Council Events Jobs Leadership Staff Support us RegionAfricaAsiaEuropean PowerMiddle East & North AfricaUnited StatesWider Europe Africa Asia European Power Middle East & North Africa United StatesWider Europe United States Wider Europe Africa Asia European Power Middle East & North Africa United StatesWider Europe United States Wider Europe United States Wider Europe AnalysisPolicy BriefsPolicy AlertsCommentariesSpecialsPodcasts Policy Briefs Policy Alerts Commentaries Specials Podcasts Policy Briefs Policy Alerts Commentaries Specials Podcasts ECFR OfficesBerlinLondonMadridParisRomeSofiaWarsawWashington Berlin London Madrid Paris Rome Sofia Warsaw Washington Berlin London Madrid Paris Rome Sofia Warsaw Washington MediaNewsroomECFR in the mediaMeet our experts Newsroom ECFR in the media Meet our experts Newsroom ECFR in the media Meet our experts Follow usLinkedInBlueskyTwitterInstagramYouTubePodcastRSS feedsNewsletter LinkedIn Bluesky Twitter Instagram YouTube Podcast RSS feeds Newsletter LinkedIn Bluesky Twitter Instagram YouTube Podcast RSS feeds Newsletter Imprint Privacy Consent Accessibility We have embedded content provided by third parties on our website, such as videos or social media content. Because displaying this content involves technical data, as well as data about your device or browser, being sent to the providers hosting the content, and because these providers may use cookies to display or configure this content, it will only be displayed with your consent. The providers, such as YouTube, Instagram, Vimeo or Twitter, may use this data for their own purposes, including marketing purposes, and may combine it with other information they have collected about you. They may transfer data to servers outside the EU. Click on details to find out more or go to our privacy notice.We use cookies and other technologies on our website. Some of them are essential, while others help us to improve this website and your experience.Personal data may be processed (e.g. IP addresses), for example for personalized ads and content or ad and content measurement.You can find more information about the use of your data in ourprivacy policy.You can revoke or adjust your selection at any time underSettings. Essential External Media Accept all Save Individual Privacy Preferences Cookie DetailsPrivacy PolicyImprint We use cookies and other technologies on our website. Some of them are essential, while others help us to improve this website and your experience.Personal data may be processed (e.g. IP addresses), for example for personalized ads and content or ad and content measurement.You can find more information about the use of your data in ourprivacy policy.You can give your consent to whole categories or display further information and select certain services. You can revoke your consent at any time using the links under https://ecfr.eu/consent-management/ Accept allSave Back Essential cookies enable basic functions and are necessary for the proper function of the website. Show InformationHide Information Content from video platforms and social media platforms is blocked by default. If these services are accepted, displaying this content no longer requires manual consent. Show InformationHide Information Privacy PolicyImprint"}