{"id": 515, "name": "Frontiers in Cardiovascular Medicine", "domain": "frontiersin.org/journals/cardiovascular-medicine", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/cardiovascular-medicine/articles/10.3389/fcvm.2025.1361273/full", "title": "Cardiovascular Medicine", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aortic Surgery and Endovascular Repair Archive Atherosclerosis and Vascular Medicine Cardiac Rhythmology Cardio-Oncology Cardioneurology Cardiovascular Biologics and Regenerative Medicine Cardiovascular Epidemiology and Prevention Cardiovascular Genetics and Systems Medicine Cardiovascular Imaging Cardiovascular Metabolism Cardiovascular Nursing Cardiovascular Pharmacology and Drug Discovery Cardiovascular Surgery Clinical and Translational Cardiovascular Medicine Coronary Artery Disease General Cardiovascular Medicine Heart Failure and Transplantation Heart Valve Disease Hypertension Intensive Care Cardiovascular Medicine Lipids in Cardiovascular Disease Pediatric Cardiology Precision Cardiology Sex and Gender in Cardiovascular Medicine Structural Interventional Cardiology Thrombosis and Haemostasis Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Aortic Surgery and Endovascular Repair Archive Atherosclerosis and Vascular Medicine Cardiac Rhythmology Cardio-Oncology Cardioneurology Cardiovascular Biologics and Regenerative Medicine Cardiovascular Epidemiology and Prevention Cardiovascular Genetics and Systems Medicine Cardiovascular Imaging Cardiovascular Metabolism Cardiovascular Nursing Cardiovascular Pharmacology and Drug Discovery Cardiovascular Surgery Clinical and Translational Cardiovascular Medicine Coronary Artery Disease General Cardiovascular Medicine Heart Failure and Transplantation Heart Valve Disease Hypertension Intensive Care Cardiovascular Medicine Lipids in Cardiovascular Disease Pediatric Cardiology Precision Cardiology Sex and Gender in Cardiovascular Medicine Structural Interventional Cardiology Thrombosis and Haemostasis Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Aortic Surgery and Endovascular Repair Archive Atherosclerosis and Vascular Medicine Cardiac Rhythmology Cardio-Oncology Cardioneurology Cardiovascular Biologics and Regenerative Medicine Cardiovascular Epidemiology and Prevention Cardiovascular Genetics and Systems Medicine Cardiovascular Imaging Cardiovascular Metabolism Cardiovascular Nursing Cardiovascular Pharmacology and Drug Discovery Cardiovascular Surgery Clinical and Translational Cardiovascular Medicine Coronary Artery Disease General Cardiovascular Medicine Heart Failure and Transplantation Heart Valve Disease Hypertension Intensive Care Cardiovascular Medicine Lipids in Cardiovascular Disease Pediatric Cardiology Precision Cardiology Sex and Gender in Cardiovascular Medicine Structural Interventional Cardiology Thrombosis and Haemostasis Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Cardiovasc. Med., 11 June 2025 Sec. Hypertension Volume 12 - 2025 |https://doi.org/10.3389/fcvm.2025.1361273 **Knowledge, attitudes, and practices regarding the prevention of intracerebral hemorrhage among hypertensive patients** 1Department of Neurosurgery, Nantong Third People’s Hospital, Affiliated Nantong Hospital 3 of Nantong University, Nantong, Jiangsu, China 2Department of Neurosurgery, Dongtai People’s Hospital, Dongtai, Jiangsu, China 3Department of Emergency, Nantong Third People’s Hospital, Affiliated Nantong Hospital 3 of Nantong University, Nantong, Jiangsu, China 4Medical Oncology, Nantong Tumor Hospital, Nantong, Jiangsu, China 5Department of Emergency, The Third Affiliated Hospital of Guangzhou University of Chinese Medicine, Guangzhou, China Objective:The present study aimed to assess knowledge, attitudes, and practices (KAP) regarding the prevention of intracerebral hemorrhage among hypertensive patients and medication adherence to hypertension. Methods:We conducted a cross-sectional study at the Third People's Hospital of Nantong City between November 4, 2023 and December 4, 2023. Demographic information, KAP and medication adherence scores were collected using an online questionnaire. Results:Totally 600 valid questionnaires were analyzed. Among these, 443 participants (73.83%) were female, with a mean age of 62.95 ± 15.07 years. The mean scores for knowledge, attitude, practice, and medication adherence were 13.93 ± 2.88, 32.10 ± 3.22, 25.53 ± 3.44, and 3.12 ± 1.85, respectively. Only 3.50% had high medication compliance to hypertension. Multivariate analyses revealed that uncertain about family history of hypertensive intracerebral hemorrhage [OR = 0.378, 95%CI: (0.218–0.656);P= 0.001], no smoking [OR = 4.603, 95%CI: (1.954–10.845);P< 0.001], and no alcohol consumption [OR = 3.522, 95%CI: (1.764–7.033);P< 0.001] were independently associated with proactive practice. Structural equation modeling (SEM) results revealed direct effects between knowledge and attitude (β= 0.999,P< 0.001), knowledge and practice (β= 1.103,P< 0.001), as well as attitude and practice (β= 0.452,P< 0.001). Conclusion:Hypertensive patients demonstrated sufficient knowledge, positive attitudes, and inactive practices towards preventing intracerebral hemorrhage, coupled with poor medication adherence to hypertension. Developing targeted interventions to address these gaps and promoting a holistic approach is crucial to improving overall patient outcomes in clinical practice. **Introduction** Intracerebral hemorrhage (ICH) constitutes a significant portion, ranging from 12% to 20%, of the global stroke incidence (1). This specific type of cerebral parenchymal hemorrhage arises from the spontaneous rupture of cerebral blood vessels, representing a subtype within the broader category of cerebral apoplexy. Notably, ICH accounts for 20%–30% of all cerebral apoplexy cases in China, with alarming mortality and disability rates reaching approximately 40% and 90%, respectively (2,3). The profound impact of ICH extends beyond individual health, inflicting substantial pain and burden on families and society (4). The escalating global aging trend intensifies the adverse consequences of ICH, underscoring the urgency to address this health challenge (5). Hypertensive intracerebral hemorrhage (HICH), a prevalent subtype within the spectrum of ICH, further accentuates the gravity of the issue (6,7). This hemorrhagic disorder not associated with trauma to the brain parenchyma exhibits its greatest incidence during the cold season, solidifying its position as a prominent health threat (8). Remarkably, HICH surpasses other stroke types in terms of mortality and disability rates, posing a formidable risk to the overall health of our nation's residents (9). The increasing prevalence of HICH underscores the critical need for targeted research and interventions to alleviate the substantial health and societal burdens associated with this condition. Knowledge, Attitudes, and Practices (KAP) assessment serves as a structured survey tool crucial for understanding the cognitive and behavioral dimensions of hypertensive patients (10). This approach becomes particularly relevant given the necessity of self-management and prevention among individuals with hypertension (11). Despite the imperative for proactive engagement in preventive measures, there exists a discernible deficiency in patients’ knowledge regarding relevant matters. Hence, investigating the KAP of hypertensive patients becomes imperative to address the existing gaps and enhance strategies for intracerebral hemorrhage prevention. Therefore, this study aims to investigate KAP regarding the prevention of ICH among hypertensive patients and medication adherence to hypertension. Through shedding light on these aspects, the study seeks to provide valuable insights that can help address existing gaps, ultimately enhancing preventive strategies and improving patient outcomes. The significance of this survey is underscored by its potential to guide targeted interventions and initiatives aimed at mitigating the impact of hypertensive intracerebral hemorrhage (HICH) on public health. **Methods** **Study design and participants** The present cross-sectional study was conducted at the Third People's Hospital of Nantong City between November 4, 2023, to December 4, 2023, focusing on participants diagnosed with hypertension. The Medical Ethics Committee of the Third People's Hospital of Nantong City approved this study, and informed consent was secured from all participants. The inclusion criteria comprised hypertension with confirmed systolic blood pressure ≥140 mmHg and/or diastolic blood pressure ≥90 mmHg, age ≥18 years, any gender. Exclusion criteria encompassed individuals who, upon entering the questionnaire survey, indicated “no” on the informed consent form before the survey initiation, questionnaires demonstrating logical errors in response to trap questions, and questionnaires displaying abnormal BMI values (less than 10 or greater than 40). **Questionnaire and quality control** The questionnaire was developed in accordance with theChinese Multidisciplinary Guidelines for the Diagnosis and Treatment of hypertensive intracerebral hemorrhageand underwent a pilot test involving 24 copies. The Cronbach'sαcoefficient, assessing internal consistency, was 0.811, indicating satisfactory reliability. The finalized questionnaire comprised demographic data (gender, age, education level, etc.) and the knowledge, attitude, practice and medication adherence dimensions. The knowledge dimension encompassed 16 questions, each scored 1 and 0 for right and wrong or unclear responses, respectively, resulting in a score range of 0–16. The attitude dimension comprised 7 questions, utilizing a 5-point Likert scale from very positive to very negative (5 and 1 points, respectively), yielding a score range of 7–35. The practice dimension involved 7 questions, also utilizing a 5-point Likert scale, with values assigned from always to never (5–1 for questions 1, 3, and 7), and the remaining questions reversed in value from 1 to 5, resulting in a score range of 7–35 points. The medication adherence scale included 8 items, with 8 points maximum, where a score <6, of 6–8 and of 8 reflected poor, moderate and good adherence, respectively (12–14). The distribution of questionnaires to study participants was conducted electronically, employing WeChat groups within various departments such as Cardiovascular Medicine, Neurology, and Geriatrics. Attending physicians played a crucial role in identifying suitable candidates for the survey. In the internal medicine outpatient department, predominantly Cardiovascular Medicine and Neurology, nurses stationed at the registration desk distributed the questionnaires to hypertensive patients as they awaited their appointments, utilizing a QR code for survey participation. All participants received pertinent training, familiarizing themselves with the questionnaire content, and were equipped to promptly address any queries raised during the survey, ensuring the quality of responses. Additionally, trap questions were strategically integrated into the questionnaire to indirectly assess the sincerity of respondents engaging in the survey. **Statistical analysis** SPSS 22.0 was employed for statical analysis. Continuous variates were reported as mean ± standard deviation, and categorical variables as frequency and percentage. Prior to comparing continuous variables, normality tests were applied. If the data adhered to a normal distribution, at-test was employed for group comparisons. In instances where normal distribution was not observed, the Wilcoxon Mann–Whitney test was utilized for group-pair comparisons. For three or more groups with continuous variables displaying normal distribution and homogeneity of variance, ANOVA was employed. In cases where normal distribution was not met, the Kruskal–Wallis analysis of variance was utilized. Univariable and multivariable logistic regression analyses were employed for identifying factors with significant associations with good knowledge, positive attitude, and proactive practice, defined as achieving a mean score in the knowledge and attitude practice dimensions of the population (15). Additionally, univariable and multivariable logistic regression analyses were carried out for determining factors with significant associations with medication adherence. Two-tailedP< 0.05 suggested statistical significance. **Results** Before statistical analysis, unqualified data were excluded, including 5 questionnaires with “no” choice for informed consent, 39 questionnaires with logical errors in trap questions, 25 questionnaires with abnormal BMI of the respondents (<10/>40), and 2 questionnaires with age less than 18 years old. The remaining valid questionnaires totaled 600. Totally 443 (73.83%) of the participants were women with ages of 62.95 ± 15.07 years, and 364 (60.67%) had overweight BMI. Additionally, 411 (68.50%) had been suffering from hypertension for more than 5 years, 463 (77.17%) had a family history of intracerebral hemorrhage or hypertension, and 399 (66.50%) had been taking antihypertensive drugs for more than 5 years. The mean knowledge, attitude, practice, and medication adherence scores were 13.93 ± 2.88, 32.10 ± 3.22, 25.53 ± 3.44, and 3.12 ± 1.85, respectively. Demographic differences in education, family history of the disease, presence of coronary heart disease, and duration of administration of antihypertensive drugs may have contributed to differences in participants’ knowledge, attitude, practice, and adherence. BMI and the presence or absence of intracerebral hemorrhage may differentiate participants’ attitudes. The presence or absence of family history of hypertension may allow for different levels of knowledge and practice. In turn, the presence or absence of diabetes was found to make a difference in attitude, practice, and compliance (Table 1). Table 1.Baseline and scores for knowledge, attitudes, and practices (KAP) and compliance. The overall knowledge dimension demonstrated that only 29.50% of the participants responded correctly to the question “The age of onset for hypertensive intracerebral hemorrhage is predominantly above 50 years” (K3). Regarding the risk factors for hypertensive cerebral hemorrhage (K5), more than 90% of the patients were aware of all the factors, except hyperglycemia (82.67%) (Supplementary Table S1). Turning to the attitude dimension, the first thing that draws attention is that, in contrast to the attitudes of the other questions, only 31.33% strongly agreed that hypertensive patients should measure their blood pressure every day (A1). In addition, 66.83% strongly agreed that exercise is important for health and disease prevention (A7). As for the remaining questions, nearly 80% of the participants were in full agreement, showing their relatively well positive attitudes (Supplementary Table S2). The practice dimension presented the different frequency of practice of the participants, with 53.00% and 54.00% regularly eating vegetables and fruits (P2) and drinking milk (P4). 49.17% tested their blood pressure occasionally (P1). 36.17% and 48.33% occasionally ate salt or sodium-containing condiments (P3) and pickled foods (P5). In addition, 62.50% and 76.17% never drank alcohol (P6) and smoked cigarettes (P7) (Supplementary Table S3). The patient compliance profile showed that the maximum proportion of patients (53.17%) had moderate medication compliance, followed by 43.33% whose medication compliance was low; however, only 3.50% had high medication compliance (Figure 1). Figure 1.Patient compliance profile. The multivariate results showed that being female [OR = 2.215, 95%CI: (1.077–4.553);P= 0.031], unaware of her hypertension family history [OR = 0.387, 95%CI: (0.151–0.993);P= 0.048], and taking antihypertensive drugs for 3–5 years [OR = 3.428, 95%CI: (1.124–10.45);P= 0.030] were independently associated with good knowledge (Table 2). On the other hand, the knowledge score [OR = 1.170, 95%CI: (1.085–1.262);P< 0.001], age [OR = 0.976, 95% I: (0.955–0.997);P= 0.026], graduation from high school or technical school [OR = 2.019, 95%CI: (1.122–3.631);P= 0.019], working more than 8 h daily [OR = 0.366, 95%CI: (0.197–0.680);P= 0.001], working or living with noise interference [OR = 0.288, 95%CI: (0.098–0.845);P= 0.023], and no coronary heart disease [OR = 1.963, 95%CI: (1.067–3.610);P= 0.030] had independent associations with positive attitude (Table 3). Additionally, uncertainty about family history of hypertensive intracerebral hemorrhage [OR = 0.378, 95%CI: (0.218–0.656);P= 0.001], no smoking [OR = 4.603, 95%CI: (1.954–10.845);P< 0.001], and no alcohol consumption [OR = 3.522, 95%CI: (1.764–7.033);P< 0.001] had independent associations with proactive practice (Table 4). Table 2.Analysis of factors affecting good knowledge. Table 3.Analysis of factors affecting positive attitudes. Table 4.Analysis of factors affecting proactive practices. The multivariate analysis revealed a working or living environment with noise interference [OR = 13.191, 95%CI: (2.861–60.808);P= 0.001], no diabetes [OR = 1.929, 95%CI: (1.123–3.314);P= 0.017], no coronary heart disease [OR = 3.080, 95%CI: (1.573–6.028);P= 0.001], and taking antihypertensive drugs for 3–5 years [OR = 3.142, 95%CI: (1.133–8.708);P= 0.028] had independent associations with moderate and high compliance. Furthermore, higher education was associated with better compliance compared to graduating from primary school. Compliance was worse among those who were aware that they did not have a family history of hypertensive intracerebral hemorrhage [OR = 0.549, 95%CI: (0.320–0.942);P= 0.029], while compliance was better among those who were not aware of whether they had that or not [OR = 1.737, 95%CI: (1.004–3.005);P= 0.048] (Table 5). Table 5.Analysis of factors affecting moderate/high compliance. SEM results revealed direct effects between knowledge and attitude (β= 0.999,P< 0.001), knowledge and practice (β= 1.103,P< 0.001), as well as attitude and practice (β= 0.452,P< 0.001) (Figure 2;Supplementary Table S4). Figure 2.Structural equation model (SEM) for knowledge, attitudes, and practices (KAP). **Discussion** Hypertensive patients exhibited good knowledge, positive attitudes, but inactive preventive practices regarding intracerebral hemorrhage and poor medication adherence to hypertension. These findings emphasize the necessity of targeted interventions and educational programs to elevate awareness and encourage proactive health behaviors within this population. Our investigation provided valuable insights into the KAP, and medication compliance among hypertensive patients, specifically in the context of preventing intracerebral hemorrhage. Gender differences were notable, with females displaying higher mean knowledge and practice scores compared to males, aligning with existing studies highlighting gender's influential role in health-related behaviors and outcomes (16,17). Educational disparities were evident, with higher education levels correlating with greater knowledge and more favorable attitudes, consistent with literature emphasizing the positive link between education and health literacy (18). The impact of work and living conditions on KAP scores, particularly in shift work or night shifts, echoed prior research highlighting occupational factors’ influence on health behaviors (19). Family-centered findings revealed higher knowledge and practice scores among those with a family history of hypertensive intracerebral hemorrhage, consistent with studies emphasizing familial influences on health behaviors (20). SEM results indicating direct effects between knowledge, attitude, and practice aligned with the theoretical framework suggesting that enhanced knowledge positively influences attitudes and behaviors (21). Additionally, our study unveiled unique associations, such as the independent association between working or living environments with noise interference and medication compliance. While some studies have examined the effects of environmental factors on hypertension, the specific correlation between noise interference and medication compliance in the context of hypertensive intracerebral hemorrhage patients warrants further investigation (22,23). Understanding how noise interference affects medication adherence could inform targeted interventions to improve compliance in environments with heightened noise levels. Furthermore, the contrasting findings related to awareness of a family history of hypertensive intracerebral hemorrhage and medication compliance raise intriguing questions. While individuals aware of not having a family history exhibited worse compliance, those uncertain about their family history showed better compliance. These results deviate from some studies suggesting that knowledge of a family history might enhance health-related behaviors (24). The nuanced relationship between awareness of family history and medication compliance merits in-depth exploration to elucidate the underlying factors contributing to these unexpected associations. Our study offered a comprehensive overview of hypertensive patients’ knowledge dimensions regarding hypertensive intracerebral hemorrhage. Notably, high accuracy was observed across various knowledge dimensions, ranging from 68.83% to 96.67%. These results indicate a robust understanding among participants regarding the severe complications of hypertension, its diagnostic criteria, age of onset for hypertensive intracerebral hemorrhage, and appropriate responses to symptoms. However, the discrepancy in correct responses across different knowledge dimensions warrants attention, suggesting potential gaps that may need targeted interventions. This finding resonates with existing literature highlighting the need for continuous and specific education to address potential gaps in hypertensive patients’ understanding (25). Responses to various attitude items among hypertensive patients revealed positive attitudes toward key aspects of hypertension control and prevention. Moreover, the acknowledgment of effective blood pressure control, lifestyle changes, and willingness to cooperate with doctors reflects a proactive stance toward hypertension management. However, a notable proportion expressed neutral or negative attitudes towards the importance of physical exercise, suggesting a potential area for intervention. This finding contrasts with extensive research highlighting the positive effect of regular physical activity on blood pressure control and overall cardiovascular health (26,27). To address this, targeted improvement suggestions could involve implementing tailored education programs focusing on the benefits of physical exercise specifically for hypertensive patients. Incorporating personalized exercise plans into hypertension management strategies, considering patients’ preferences and physical capabilities, may enhance adherence to this crucial aspect of preventive care. These recommendations align with studies advocating for patient-centered approaches to promote positive health behaviors on hypertension (28,29). Additionally, exploring and addressing potential barriers to adopting a positive attitude towards physical exercise, such as time constraints or perceived difficulty, may further enhance the effectiveness of interventions. Responses in various practice dimensions among hypertensive patients provided crucial insights into their daily behaviors related to health management. A considerable proportion indicated suboptimal practices, particularly concerning blood pressure monitoring, dietary habits, and lifestyle choices. Notably, a significant number reported infrequent blood pressure monitoring, which is concerning given the importance of regular monitoring in hypertension management (30). Moreover, suboptimal dietary practices were evident, with a substantial percentage reporting infrequent consumption of fruits and vegetables rich in dietary fiber and high-frequency intake of dietary salt and sodium-containing condiments. These dietary patterns are recognized risk factors for hypertension and its complications (30). The high prevalence of frequent alcohol intake and smoking further compounds the risk, aligning with established associations between these behaviors and elevated blood pressure (31,32). To address these challenges, targeted improvement suggestions could involve implementing comprehensive education programs emphasizing the importance of consistent blood pressure monitoring and providing practical tools or reminders to facilitate adherence. Dietary interventions could focus on culturally tailored strategies to increase the consumption of fruits, vegetables, and low-sodium alternatives, aligning with successful interventions documented in the literature (33,34). Despite the valuable insights gained, several limitations should be considered, including the cross-sectional design, use of self-reported data, and an uneven gender distribution among participants. The higher representation of female participants in this study reflects the epidemiological trend of hypertensive intracerebral hemorrhage being more prevalent in females, but it may still introduce potential selection bias. Additionally, the study did not account for variations in patients’ medication regimens, including the number and frequency of antihypertensive medications prescribed. These factors could influence medication adherence independently of KAP and may affect the interpretation of adherence-related findings. As the study was conducted in a hospital setting, there is a possibility of bias toward more favorable KAP outcomes, as hospital-attending patients are likely to have greater health awareness and motivation compared to the general population. Furthermore, the cross-sectional design limits the ability to infer causality and track changes over time. Future research could explore a longitudinal approach to better understand temporal relationships among KAP dimensions and medication adherence. Future research could address this limitation by conducting community-based studies to assess KAP among a broader and more diverse population. Further investigation could benefit from longitudinal studies and objective measures to enhance reliability. Addressing this gender imbalance through larger, multi-center studies could enhance the representativeness and generalizability of findings. In conclusion, the research underscores the need for targeted interventions to enhance knowledge dissemination, foster positive attitudes, and promote active preventive practices among hypertensive patients. Strategies to improve medication adherence should be tailored based on identified factors, including education level and awareness of family history. These insights can inform more effective clinical practices and interventions to mitigate the risk of intracerebral hemorrhage among hypertensive individuals. **Data availability statement** The original contributions presented in the study are included in the article/Supplementary Material, further inquiries can be directed to the corresponding author. **Ethics statement** The studies involving humans were approved by Third People's Hospital of Nantong City. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. **Author contributions** QC: Data curation, Investigation, Writing – original draft, Writing – review & editing. FL: Conceptualization, Data curation, Investigation, Writing – review & editing. LZ: Conceptualization, Data curation, Writing – review & editing. YJ: Data curation, Formal analysis, Writing – review & editing. HH: Conceptualization, Data curation, Writing – original draft. **Funding** The author(s) declare that no financial support was received for the research and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/fcvm.2025.1361273/full#supplementary-material **References** 1. Lu J, Tang X, Zhang D, Lan T, Huang Q, Xu P, et al. Didang tang inhibits intracerebral hemorrhage-induced neuronal injury via Ask1/Mkk7/jnk signaling pathway, network pharmacology-based analyses combined with experimental validation.Heliyon. (2022) 8(11):e11407. doi: 10.1016/j.heliyon.2022.e11407 PubMed Abstract|Crossref Full Text|Google Scholar 2. Wang J, Chen Y, Liang J, Cao M, Shen J, Ke K. Study of the pathology and the underlying molecular mechanism of tissue injury around hematoma following intracerebral hemorrhage.Mol Med Rep. (2021) 24(4):702. doi: 10.3892/mmr.2021.12341 PubMed Abstract|Crossref Full Text|Google Scholar 3. Yang GL, Wang S, Zhang S, Liu Y, Liu X, Wang D, et al. A protective role of tumor necrosis factor superfamily-15 in intracerebral hemorrhage-induced secondary brain injury.ASN Neuro. (2021) 13:17590914211038441. doi: 10.1177/17590914211038441 PubMed Abstract|Crossref Full Text|Google Scholar 4. Liu Z, Wu X, Yu Z, Tang X. Reconstruction of circrna-mirna-mrna associated cerna networks reveal functional circrnas in intracerebral hemorrhage.Sci Rep. (2021) 11(1):11584. doi: 10.1038/s41598-021-91059-9 PubMed Abstract|Crossref Full Text|Google Scholar 5. Zheng Z, Chen H, Yang L. Transfer of promotion effects on elderly health with age: from physical environment to interpersonal environment and social participation.Int J Environ Res Public Health. (2019) 16(15):2794. doi: 10.3390/ijerph16152794 PubMed Abstract|Crossref Full Text|Google Scholar 6. Fang C, An X, Li K, Zhang J, Shang H, Jiao T, et al. A nomogram based on CT radiomics and clinical risk factors for prediction of prognosis of hypertensive intracerebral hemorrhage.Comput Intell Neurosci. (2022) 2022:9751988. doi: 10.1155/2022/9751988 PubMed Abstract|Crossref Full Text|Google Scholar 7. Ding W, Gu Z, Song D, Liu J, Zheng G, Tu C. Development and validation of the hypertensive intracerebral hemorrhage prognosis models.Medicine (Baltimore). (2018) 97(39):e12446. doi: 10.1097/md.0000000000012446 PubMed Abstract|Crossref Full Text|Google Scholar 8. Luan L, Li M, Sui H, Li G, Pan W. Efficacies of minimally invasive puncture and small bone window craniotomy for hypertensive intracerebral hemorrhage, evaluation of motor-evoked potentials and comparison of postoperative rehemorrhage between the two methods.Exp Ther Med. (2019) 17(2):1256–61. doi: 10.3892/etm.2018.7094 PubMed Abstract|Crossref Full Text|Google Scholar 9. Nam TM, Kim YZ. A meta-analysis for evaluating efficacy of neuroendoscopic surgery versus craniotomy for supratentorial hypertensive intracerebral hemorrhage.J Cerebrovasc Endovasc Neurosurg. (2019) 21(1):11–7. doi: 10.7461/jcen.2019.21.1.11 PubMed Abstract|Crossref Full Text|Google Scholar 10. Machaalani M, Seifeddine H, Ali A, Bitar H, Briman O, Chahine MN. Knowledge, attitude, and practice toward hypertension among hypertensive patients residing in Lebanon.Vasc Health Risk Manag. (2022) 18:541–53. doi: 10.2147/vhrm.S367187 PubMed Abstract|Crossref Full Text|Google Scholar 11. Asante DO, Dai A, Walker AN, Zhou Z, Kpogo SA, Lu R, et al. Assessing hypertension and diabetes knowledge, attitudes and practices among residents in Akatsi south district, Ghana using the kap questionnaire.Front Public Health. (2023) 11:1056999. doi: 10.3389/fpubh.2023.1056999 PubMed Abstract|Crossref Full Text|Google Scholar 12. Berlowitz DR, Foy CG, Kazis LE, Bolin LP, Conroy MB, Fitzpatrick P, et al. Effect of intensive blood-pressure treatment on patient-reported outcomes.N Engl J Med. (2017) 377(8):733–44. doi: 10.1056/NEJMoa1611179 PubMed Abstract|Crossref Full Text|Google Scholar 13. Bress AP, Bellows BK, King JB, Hess R, Beddhu S, Zhang Z, et al. Cost-effectiveness of intensive versus standard blood-pressure control.N Engl J Med. (2017) 377(8):745–55. doi: 10.1056/NEJMsa1616035 PubMed Abstract|Crossref Full Text|Google Scholar 14. Morisky DE, Ang A, Krousel-Wood M, Ward HJ. Predictive validity of a medication adherence measure in an outpatient setting.J Clin Hypertens (Greenwich). (2008) 10(5):348–54. doi: 10.1111/j.1751-7176.2008.07572.x PubMed Abstract|Crossref Full Text|Google Scholar 15. Charles Shapu R, Ismail S, Ahmad N, Ying LP, Abubakar Njodi I. Knowledge, attitude, and practice of adolescent girls towards reducing malnutrition in maiduguri metropolitan council, Borno state, Nigeria: cross-sectional study.Nutrients. (2020) 12(6):1681. doi: 10.3390/nu12061681 PubMed Abstract|Crossref Full Text|Google Scholar 16. Grzymisławska M, Puch EA, Zawada A, Grzymisławski M. Do nutritional behaviors depend on biological sex and cultural gender?Adv Clin Exp Med. (2020) 29(1):165–72. doi: 10.17219/acem/111817 PubMed Abstract|Crossref Full Text|Google Scholar 17. O'Neil A, Scovelle AJ, Milner AJ, Kavanagh A. Gender/sex as a social determinant of cardiovascular risk.Circulation. (2018) 137(8):854–64. doi: 10.1161/circulationaha.117.028595 PubMed Abstract|Crossref Full Text|Google Scholar 18. Sundell E, Wångdahl J, Grauman Å. Health literacy and digital health information-seeking behavior—a cross-sectional study among highly educated Swedes.BMC Public Health. (2022) 22(1):2278. doi: 10.1186/s12889-022-14751-z PubMed Abstract|Crossref Full Text|Google Scholar 19. Ryu H, Moon J, Jung J. Influence of health behaviors and occupational stress on prediabetic state among male office workers.Int J Environ Res Public Health. (2018) 15(6):1264. doi: 10.3390/ijerph15061264 PubMed Abstract|Crossref Full Text|Google Scholar 20. Mao X, Xu J, Wang W, Liang C, Hua J, Liu J, et al. Crosstalk between cancer-associated fibroblasts and immune cells in the tumor microenvironment: new findings and future perspectives.Mol Cancer. (2021) 20(1):131. doi: 10.1186/s12943-021-01428-1 PubMed Abstract|Crossref Full Text|Google Scholar 21. Long E, Ponder M, Bernard S. Knowledge, attitudes, and beliefs related to hypertension and hyperlipidemia self-management among African-American men living in the southeastern United States.Patient Educ Couns. (2017) 100(5):1000–6. doi: 10.1016/j.pec.2016.12.011 PubMed Abstract|Crossref Full Text|Google Scholar 22. Bruno RM, Di Pilla M, Ancona C, Sørensen M, Gesi M, Taddei S, et al. Environmental factors and hypertension.Curr Pharm Des. (2017) 23(22):3239–46. doi: 10.2174/1381612823666170321162233 PubMed Abstract|Crossref Full Text|Google Scholar 23. Rios FJ, Montezano AC, Camargo LL, Touyz RM. Impact of environmental factors on hypertension and associated cardiovascular disease.Can J Cardiol. (2023) 39(9):1229–43. doi: 10.1016/j.cjca.2023.07.002 PubMed Abstract|Crossref Full Text|Google Scholar 24. Sanghavi K, Moses I, Moses D, Gordon A, Chyr L, Bodurtha J. Family health history and genetic services-the east Baltimore community stakeholder interview project.J Community Genet. (2019) 10(2):219–27. doi: 10.1007/s12687-018-0379-z PubMed Abstract|Crossref Full Text|Google Scholar 25. Santos MV, Oliveira DC, Novaes Mde A. A telehealth strategy for increasing adherence in the treatment of hypertension in primary care.Telemed J E Health. (2013) 19(4):241–7. doi: 10.1089/tmj.2012.0036 PubMed Abstract|Crossref Full Text|Google Scholar 26. Sharman JE, La Gerche A, Coombes JS. Exercise and cardiovascular risk in patients with hypertension.Am J Hypertens. (2015) 28(2):147–58. doi: 10.1093/ajh/hpu191 PubMed Abstract|Crossref Full Text|Google Scholar 27. Wu NN, Tian H, Chen P, Wang D, Ren J, Zhang Y. Physical exercise and selective autophagy: benefit and risk on cardiovascular health.Cells. (2019) 8(11):1436. doi: 10.3390/cells8111436 PubMed Abstract|Crossref Full Text|Google Scholar 28. Peacock E, Krousel-Wood M. Adherence to antihypertensive therapy.Med Clin North Am. (2017) 101(1):229–45. doi: 10.1016/j.mcna.2016.08.005 PubMed Abstract|Crossref Full Text|Google Scholar 29. Yamane SS, De Gagne JC, Riggs A, Kimberly GD, Holye M. Assessment of a patient-centered initiative to improve hypertension management for adults with comorbid type 2 diabetes at a free clinic in the rural south.Nurs Forum. (2020) 55(3):348–55. doi: 10.1111/nuf.12434 PubMed Abstract|Crossref Full Text|Google Scholar 30. Unda Villafuerte F, Llobera Cànaves J, Lorente Montalvo P, Moreno Sancho ML, Oliver Oliver B, Bassante Flores P, et al. Effectiveness of a multifactorial intervention, consisting of self-management of antihypertensive medication, self-measurement of blood pressure, hypocaloric and low sodium diet, and physical exercise, in patients with uncontrolled hypertension taking 2 or more antihypertensive drugs: the medichy study.Medicine (Baltimore). (2020) 99(17):e19769. doi: 10.1097/md.0000000000019769 PubMed Abstract|Crossref Full Text|Google Scholar 31. Nagao T, Nogawa K, Sakata K, Morimoto H, Morita K, Watanabe Y, et al. Effects of alcohol consumption and smoking on the onset of hypertension in a long-term longitudinal study in a male workers’ cohort.Int J Environ Res Public Health. (2021) 18(22):11781. doi: 10.3390/ijerph182211781 PubMed Abstract|Crossref Full Text|Google Scholar 32. van Oort S, Beulens JWJ, van Ballegooijen AJ, Grobbee DE, Larsson SC. Association of cardiovascular risk factors and lifestyle behaviors with hypertension: a Mendelian randomization study.Hypertension. (2020) 76(6):1971–9. doi: 10.1161/hypertensionaha.120.15761 PubMed Abstract|Crossref Full Text|Google Scholar 33. Ozemek C, Laddu DR, Arena R, Lavie CJ. The role of diet for prevention and management of hypertension.Curr Opin Cardiol. (2018) 33(4):388–93. doi: 10.1097/hco.0000000000000532 PubMed Abstract|Crossref Full Text|Google Scholar 34. Shamsi SA, Salehzadeh M, Ghavami H, Asl RG, Vatani KK. Impact of lifestyle interventions on reducing dietary sodium intake and blood pressure in patients with hypertension: a randomized controlled trial.Turk Kardiyol Dern Ars. (2021) 49(2):143–50. doi: 10.5543/tkda.2021.81669 PubMed Abstract|Crossref Full Text|Google Scholar Keywords:knowledge, attitude, practice, medication adherence, hypertension, intracerebral hemorrhage, cross-sectional study Citation:Chen Q, Liu F, Zhang L, Jin Y and Huang H (2025) Knowledge, attitudes, and practices regarding the prevention of intracerebral hemorrhage among hypertensive patients.Front. Cardiovasc. Med.12:1361273. doi: 10.3389/fcvm.2025.1361273 Received:14 January 2024;Accepted:19 May 2025;Published:11 June 2025. Edited by: Reviewed by: Copyright:© 2025 Chen, Liu, Zhang, Jin and Huang. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Yang Jin,NDAzNzgxNzczQHFxLmNvbQ==; Haibin Huang,OTA0MjI1NzkxQHFxLmNvbQ== †These authors have contributed equally to this work Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Methods Results Discussion Data availability statement Ethics statement Author contributions Funding Conflict of interest Publisher's note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}