{"id": 1592, "name": "WJR - 760AM - Detroit", "domain": "wjr.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.wjr.com/2025/02/13/the-inside-outside-guys-inside-lighting-can-brighten-your-mood/", "title": "The Inside Outside Guys Inside Lighting Can Brighten Your Mood", "content": "Twitter X Facebook Instagram VIP Apple Store Google Play **The Inside Outside Guys: Inside Lighting can Brighten Your Mood** From The Detroit News | By Ken Calverley and Chuck Breidenstein DETROIT, Feb. 13, 2025 ~Ah, the dregs of winter. Everyone is suffering from seasonal affective disorder and praying for the sun to shine. But there are things you can do in that interior space to make it healthier, safer and more energizing. Customize your home by jazzing up the lighting. With the availability and affordability of LED lighting in a broad range of hues and colors, there is little excuse to merely exist in these cold, dark months. Manufacturers include lighting facts on packages to assist us in choosing the appropriate bulb for the desired effect. PODCAST: Feb. 09, 2025~Chuck “The Inside Guy” BreidensteinandKen “The Outside Guy” Calverlyoffer the knowledge and resources you need to make the home of your dreams a reality. (CONTINUED)We are going to provide artificial lighting for one of three basic reasons: accent, task or ambient. Accent, or decorative lighting, might be used to draw attention to, and highlight, a wall or shelving unit or picture. Task lighting should be employed in areas like the food prep section of the kitchen, a bathroom sink or workshop where focus is required, and good lighting is a necessity. Reading lamps are a classic example of a portable version of task lighting. Ambient lighting is what we commonly see in an older bedroom that has a single, bright, fixture in the middle of the ceiling intended to provide the entire space with some illumination. In some cases, a fixture with the appropriate capability and a rheostat switch might provide multiple functions, like a chandelier in the dining room. Based on which bulbs are lit and to what degree, this may provide ambient, accent or task lighting to the room and table below. The type of lighting we provide can set the tone for what we are doing in the space. Lighting has a temperature. Cooler lighting temperatures are excellent for workspaces like kitchens and tool or hobby tables. Rooms that are intended for relaxation like bedrooms or television rooms should be lit in warmer tones. In a TV room, the light should be behind the viewer. For many years, the building code made reference to foot candles, the amount of light a single candle would provide within a 12-inch cube of space. It was always vague and difficult to understand without comparison values. Now you can read a package to discover that one light bulb may provide 100 footcandles for a task space like the garage potting table, while another provides only 20-foot candles of light for a sleeping room. People who design lighting for specific spaces utilize a formula to multiply lumens by the square footage of the space; so, a 12-by-12 bedroom of 144 square feet times 15 to 20 footcandles for the use, would require 2,160-2,880 total lumens. Due to bad lighting, many older homes are simply not safe for us as we age in them. Basement stairways are often poorly lit as are hallways and even main use stairs. We have seen many situations like a stairway where three-way switches should be located at both top and bottom but were never installed. If you conduct a survey of your interior environment, you could come up with a short list of electrical improvements that will add value to the home and living experience while providing a higher degree of safety. How about that microwave circuit that trips every third time you use it, or the buzzing sound you get from the dimmer switch you installed two years ago? An electrical professional could have everything done in a day or two including some new, updated, fixtures, perhaps some pendants and under-counter lights in the kitchen and new wall sconces outside the door. Design professionals at lighting wholesalers can provide suggestions for upgraded style and function. Treat yourself and your home to a lighting upgrade and enjoy the winter months indoors. To preserve and protect the integrity and value of your home, always use professionals like those you can find atInsideOutsideGuys.com. *** For more advice, listen to the“Inside Outside Guys” every Saturday and Sunday from 10 a.m.-noon on760 WJRor contact us atInsideOutsideGuys.com. MORE FROM THE INSIDE OUTSIDE GUYS: The Inside Outside Guys: Inside Lighting can Brighten Your Mood **The Inside Outside Guys: Inside Lighting can Brighten Your Mood** **The Inside Outside Guys: Inside Lighting can Brighten Your Mood** The Inside Outside Guys: Strength of referrals **The Inside Outside Guys: Strength of referrals** **The Inside Outside Guys: Strength of referrals** The Inside Outside Guys: Powered Anode Rods Preserve Water Heater Function **The Inside Outside Guys: Powered Anode Rods Preserve Water Heater Function** **The Inside Outside Guys: Powered Anode Rods Preserve Water Heater Function** Twitter X Facebook Instagram VIP Apple Store Google Play **Podcasts** **MICHIGAN VOICES |MORE** June 8, 2025~Diane Charles, executive director ofThe Furniture Bank of Metro Detroit, leads the oldest furniture bank inNorth America. Since the 1960s, it has provided essential furniture and mattresses to over 80,000 families in crisis acrossWayne,Oakland, andMacombcounties—helping them rebuild their lives with dignity and comfort. **JR SUNDAY WITH MARK HOLLIS |MORE** June 8, 2025~Brad Lott, president ofIntersport, joins “’JR Sunday” in theTrion Solutions Studioto share what’s ahead for the2025 Rocket Classic. Hear about major player announcements, hospitality options, and how the event is driving over $10 million in charitable impact forDetroit. You’ll also get details on tickets, pro-am access, andCommunity Dayopportunities. Listen here: **THE MICHIGAN TRAVEL SHOW |MORE** June 1, 2025~ HostDave Lorenzlooks at theMain Street Memories car show inPort Huronon July 26, theManitoutallship inGrand Traverse Bay, theGreat Lakes Shipwreck MuseumatWhitefish Point, and thePetoskey Yesterdaytours. **THE INSIDE OUTSIDE GUYS |MORE** June 8, 2025~Chuck “The Inside Guy” BreidensteinandKen “The Outside Guy” Calverlyoffer the knowledge and resources you need to make the home of your dreams a reality. Privacy Policy Terms of Service General Contest Rules Advertise With Us Employment Opportunities Station Information FCC Public File 2025 EEO Report Cumulus Media Corporate Copyright © 2025 Cumulus Media / Cumulus Media is an equal opportunity employer / AA Twitter X Facebook Instagram VIP Apple Store Google Play"}