{"id": 1506, "name": "Union of Concerned Scientists", "domain": "ucsusa.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.ucsusa.org/about/news/analysis-published-science-finds-high-assay-low-enriched-uranium-fuel-be-produced-small", "title": "Analysis Published Science Finds High Assay Low Enriched Uranium Fuel Be Produced Small", "content": "We're standing up for science.You can help. **Utility Menu** AbouttoggleAccomplishmentsFunding & FinancialsMission & ValuesWays to GiveHistoryRegional WorkProgramsPeopleRacial EquityJobsMedia Center Accomplishments Funding & Financials Mission & Values Ways to Give History Regional Work Programs People Racial Equity Jobs Media Center Accomplishments Funding & Financials Mission & Values Ways to Give History Regional Work Programs People Racial Equity Jobs Media Center Take ActiontoggleClimate AccountabilityClimate Campaign for the FuturePower AheadTransforming TransportationPreventing Nuclear WarHealthy Food and FarmsSave Science, Save LivesA Healthier Democracy Climate Accountability Climate Campaign for the Future Power Ahead Transforming Transportation Preventing Nuclear War Healthy Food and Farms Save Science, Save Lives A Healthier Democracy Climate Accountability Climate Campaign for the Future Power Ahead Transforming Transportation Preventing Nuclear War Healthy Food and Farms Save Science, Save Lives A Healthier Democracy Science NetworktoggleBe a Science AdvocateBuild SkillsConnect Be a Science Advocate Build Skills Connect Be a Science Advocate Build Skills Connect Reports & Multimedia **Decades of Deceit** **Climate Change** Climate change is one of the most devastating problems humanity has ever faced—and the clock is running out. Impacts Science Accountability Solutions **Defend FEMA and disaster-impacted communities.** **Keeping Everyone's Lights On** **Energy** The energy choices we make today could make or break our ability to fight climate change. Renewable Energy Nuclear Power Fossil Fuels Solutions **Demand power plant outage information be made public.** **Making the Most of Electric Vehicle Batteries** **Transportation** Our transportation system is outdated and broken—and it needs to change. Access Technologies Oil Solutions **Tell Congress we need electric vehicle infrastructure nationwide.** **Wetlands in Peril** **Food and Farms** The US food system should be providing healthy, sustainable food for everyone. Why isn’t it? Sustainable Agriculture Healthy Food Food Justice Solutions **The farm bill must center communities, not corporations.** **Plutonium Pit Production** **Nuclear Weapons** They’re the most dangerous invention the world has ever seen. Can we prevent them from being used again? Justice Worldwide Missile Defense Solutions **Tell Congress: No more nuclear weapons testing.** **Scientific Societies Call on Congress to Save Science** **Science and Democracy** Democracy and science can be powerful partners for the public good—and both are under attack. Independent Science Evidence-Based Decisions A Healthier Democracy **Help strengthen scientific integrity at federal agencies.** **Main Menu** ClimatetoggleImpactsScienceAccountabilitySolutions Impacts Science Accountability Solutions Impacts Science Accountability Solutions EnergytoggleRenewable EnergyNuclear PowerFossil FuelsSolutions Renewable Energy Nuclear Power Fossil Fuels Solutions Renewable Energy Nuclear Power Fossil Fuels Solutions TransportationtoggleAccessTechnologiesOilSolutions Access Technologies Oil Solutions Access Technologies Oil Solutions FoodtoggleSustainable AgricultureHealthy FoodFood JusticeSolutions Sustainable Agriculture Healthy Food Food Justice Solutions Sustainable Agriculture Healthy Food Food Justice Solutions Nuclear WeaponstoggleJusticeWorldwideMissile DefenseSolutions Justice Worldwide Missile Defense Solutions Justice Worldwide Missile Defense Solutions Science & DemocracytoggleIndependent ScienceEvidence-Based DecisionsA Healthier Democracy Independent Science Evidence-Based Decisions A Healthier Democracy Independent Science Evidence-Based Decisions A Healthier Democracy **Utility Menu** AbouttoggleAccomplishmentsFunding & FinancialsMission & ValuesWays to GiveHistoryRegional WorkProgramsPeopleRacial EquityJobsMedia Center Accomplishments Funding & Financials Mission & Values Ways to Give History Regional Work Programs People Racial Equity Jobs Media Center Accomplishments Funding & Financials Mission & Values Ways to Give History Regional Work Programs People Racial Equity Jobs Media Center Take ActiontoggleClimate AccountabilityClimate Campaign for the FuturePower AheadTransforming TransportationPreventing Nuclear WarHealthy Food and FarmsSave Science, Save LivesA Healthier Democracy Climate Accountability Climate Campaign for the Future Power Ahead Transforming Transportation Preventing Nuclear War Healthy Food and Farms Save Science, Save Lives A Healthier Democracy Climate Accountability Climate Campaign for the Future Power Ahead Transforming Transportation Preventing Nuclear War Healthy Food and Farms Save Science, Save Lives A Healthier Democracy Science NetworktoggleBe a Science AdvocateBuild SkillsConnect Be a Science Advocate Build Skills Connect Be a Science Advocate Build Skills Connect Reports & Multimedia **Analysis Published in Science Finds High Assay Low-Enriched Uranium Fuel to be Produced for Small Nuclear Power Reactors Poses a Greater Proliferation Threat than Previously Acknowledged** Published Jun 6, 2024 **Lisa Nurnberger** An analysis published today in the journalSciencefound that, contrary to a widely held assumption, the high assay low-enriched uranium (HALEU) now being produced with federal subsidies to fuel the next generation of small nuclear power reactors can be used directly to make nuclear weapons, and thus presents greater terrorism and nuclear proliferation threats than publicly acknowledged by the federal government and industry. “Were HALEU to become a standard reactor fuel without appropriate restrictions determined by an interagency security review, other countries would be able to obtain, produce, and process weapons-usable HALEU with impunity, eliminating the sharp distinction between peaceful and nonpeaceful nuclear programs,” according to the analysis conducted by five of the world’s leading academic and independent proliferation experts. “Such countries would be only days away from a bomb, giving the international community no warning of forthcoming nuclear proliferation and virtually no opportunity to prevent it.” The paper calls for additional measures to mitigate this risk as the United States and other countries pursue international deployment of HALEU-fueled reactors. “Given the stakes, we recommend that the US Congress direct the DOE’s National Nuclear Security Administration to commission a fresh review of HALEU proliferation and security risks by US weapons laboratory experts.” Fuels for today’s commercial reactors do not rely on HALEU, which is enriched to between 10% and 20% uranium-235, and instead typically use uranium enriched to below 5%. At those levels, the fuel cannot sustain an explosive chain reaction, which has prevented nations or terrorists from repurposing commercial reactor fuel for weapons. However, for technical reasons, many of the nuclear reactor designs that engineers want to build today would use HALEU. Since HALEU is below the 20% enrichment lower bound that defines highly-enriched uranium (HEU), which is understood to be directly usable in nuclear weapons, development of these reactors has not raised significant proliferation concerns. But by reviewing information in the open literature to analyze the quantities and enrichment levels of HALEU that the new reactors would use, the authors of the Science paper concluded that HALEU above about 12% uranium-235 could be used to make practical weapons with yields comparable to the bombs that destroyed Hiroshima and Nagasaki. Many proposed reactors could contain enough HALEU to make a nuclear weapon and thus pose serious security risks, according to the article. These risks are increasing because, although the quantity of HALEU in commercial use today is relatively small, the federal government is actively encouraging HALEU use and funding its production. The U.S. Energy Department is covering half of the cost of deployment of two demonstration nuclear plants that plan to use multi-ton quantities of HALEU fuel, including the “Natrium” fast reactor that TerraPower, a company founded by Bill Gates, plans to build in Kemmerer, Wyoming. And earlier this year, the federal government allocated $2.7 billion to subsidize production of enriched uranium, including HALEU, to fuel these and other reactor projects that are being considered for a range of applications, including powering data centers and oil and gas operations. Other countries are following suit. Many HALEU-fueled reactors would use uranium enriched to just below the 20% limit, which poses the highest risk. The researchers suggest that “a reasonable balance of the risks and benefits would be struck if enrichments for power reactor fuels were restricted to less than 10 to 12% uranium-235,” which would allow many reactor designs to move forward with only modest economic consequences. However, if higher enrichments continue to be used, the authors recommend that the security standards for protecting HALEU from theft be strengthened to the levels that apply for the weapon-usable materials HEU and plutonium. Get email updates **Support our work** For text alerts,text \"SCIENCE\" to 67369orsign up online. Receive urgent alerts about opportunities to defend science. Recurring messages. Reply STOP to cancel. Msg & data rates may apply.Terms, Conditions, and Privacy Policy. **Footer** Privacy Policy State Disclosures FAQ Media Center Jobs Contact © Union of Concerned ScientistsWe are a 501(c)(3) nonprofit organization.2 Brattle Square, Cambridge MA 02138, USA(617) 547-5552 **Tell Citi: Stop Financing Fossil Fuel Expansion** Write today and tell Citi leaders to stop enabling the harms of the fossil fuel industry. We use cookies to improve your experience. By continuing, you accept our use of cookies.Learn more. **Support our work** **Other ways to give** Renew Honor & memory Become a member Give monthly Make a planned gift Gift memberships **Your donation at work**"}