{"id": 1364, "name": "The City", "domain": "thecity.nyc", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thecity.nyc/2025/06/10/nypd-sanctuary-city-doi-investigation-adrienne-adams-gale-brewer/", "title": "Nypd Sanctuary City Doi Investigation Adrienne Adams Gale Brewer", "content": "Donate Facebook Page Twitter Instagram **Newsletters** **The CITY Scoop** A weekday newsletter to keep you up on New York. **Ranked Choices** Stay informed about the 2025 election. **Summer & the city** Bringing you the best of summer in NYC. **Podcast** **FAQ NYC** The New Yorkest podcast. Twice weekly. **Featured** **IMPACT** Our journalism makes a positive impact on the lives of New Yorkers. **How to New York** Your questions answered about the greatest city in the world. **What We're REPORTING** **CITY HALL** **Climate** **Criminal Justice** **Economy** **ERIC ADAMS** **HOUSING** **IMMIGRATION** **Labor** **NYPD** **Transit** **Follow Us** Twitter Bluesky Facebook Instagram RSS Feed **About Us** **Ways to Give** **merch store** **About Us** **Contact US** **Team** **Awards** **REPUBLISH** **Newsletters** **The CITY Scoop** A weekday newsletter to keep you up on New York. **Ranked Choices** Stay informed about the 2025 election. **Summer & the city** Bringing you the best of summer in NYC. **Podcast** **FAQ NYC** The New Yorkest podcast. Twice weekly. **Featured** **IMPACT** Our journalism makes a positive impact on the lives of New Yorkers. **How to New York** Your questions answered about the greatest city in the world. **What We're REPORTING** **CITY HALL** **Climate** **Criminal Justice** **Economy** **ERIC ADAMS** **HOUSING** **IMMIGRATION** **Labor** **NYPD** **Transit** **Follow Us** Twitter Bluesky Facebook Instagram RSS Feed **About Us** **Ways to Give** **merch store** **About Us** **Contact US** **Team** **Awards** **REPUBLISH** THE CITY - NYC News Reporting to New Yorkers Donate Get THE CITY SCOOP newsletter for original reporting and news you can’t miss. **Council Leaders Seek Probe of Possible NYPD Sanctuary City Violations** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on WhatsApp (Opens in new window)WhatsApp Click to share on Bluesky (Opens in new window)Bluesky More Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email **Support local news today!** Our nonprofit newsroom relies on readers like you to power investigations like these. Join the community that powers NYC’s independent local news. **Before you go…** **for all things NYC.** **THE CITY IS HERE FOR YOU. BE HERE FOR US TOO.** **We’re matching up to $10K for our Spring Campaign!** Two City Council leaders are requesting a probe into whether the NYPD has been violating New York City’s sanctuary laws, which are supposed to bar local authorities from participating in federal immigration enforcement. In a letter sent Monday, Speaker Adrienne Adams and Oversight and Investigations Committee Chair Gale Brewer asked the Department of Investigation to look into several incidents this year where the lines between civil immigration enforcement and criminal investigations may have been blurred. “We are concerned by recent reports that information provided to federal agencies by the NYPD is now being used in civil immigration proceedings in ways that may violate New York City’s laws and New Yorkers’ Constitutional rights,” the lawmakers wrote, adding that “these incidents appear to have resulted in multiple people being detained or sent to a prison in El Salvador without due process.” The letter cites a report fromTHE CITY and Documentedabout 19-year-old Merwil Gutiérrez Flores, who the NYPD arrested and charged with gun possession in The Bronx but not prosecuted. Nonetheless, he ended up in FBI and then ICE custody, and was swiftly deported to CECOT, the notorious El Salvadoran prison. **Rep. Yvette Clarke Calls Trump’s LA Deployments an Impeachable Offense** **It’s Time to Vote, New York. Here’s How.** **NYPD Arrests Dozens as Thousands of New Yorkers Join LA in Protesting ICE Raids** **Medicare Advantage, the Housing Crunch and NYC’s Pensions: Comptroller Candidates Weigh In** The letter also mentionsthe NYPD providing Homeland Security Investigations with the sealed arrest record of Leqaa Kordia, who was arrested outside Columbia University during pro-Palestinian demonstrations in the spring. Federal officials told the NYPD they were investigating her for money laundering, which was why police officials said they shared the record. But Kordia was already in ICE custody when ICE made the request, and federal attorneys later used the NYPD document in its deportation case against her. **Sign up for THE CITY SCOOP!** Get the latest stories from THE CITY delivered to your inbox each morning. Cancel anytime. A spokesperson for Mayor Eric Adams — who had been facing federal corruption charges until the Trump administrationdropped that case, and who’svowed not to publicly criticize the president, which the letter-writers say has diminished public trust in his leadership — didn’t immediately return a request for comment on the letter. The NYPD also did not immediately return a request for comment. Clodagh McGowan, a spokesperson for the DOI, said they received the letter and are reviewing it. In April, the Council sued theAdams administration over an executive orderallowing ICE to reopen an office on Rikers Island, which a judge has temporarily blocked from occurring. The mayor’s attorneys have said the lawsuit is a political ploy by someone seeking his job, as Speaker Adams, who’s term-limited out of office, is running for the Democratic mayoral nomination. While the NYPD regularly collaborates with federal agencies on criminal matters, it is barred from cooperating on civil immigration matters under a series of laws signed by former Mayor Bill de Blasio. But in an era where the Trump administration has made mass deportations a priority, with other federal agencies deputized for that effort, the Council members’ letter notes mounting concerns that the NYPD might be aiding in those efforts, “intentionally or unintentionally.” The sanctuary city laws, they wrote, “are grounded in a simple principle: when immigrant communities fear cooperation with law enforcement, everyone is less safe.” They added that “New Yorkers must trust that their own city government will not participate in their civil rights being violated, and these recent episodes raise serious doubts that should be urgently addressed. Any violations of city laws by our own agencies undermine the rule of law, public confidence, and public safety. Police Commissioner Jessica Tisch has repeatedly said the NYPD does not collaborate with the federal government on civil immigration enforcement butdefends collaborationon criminal matters as essential to keep New Yorkers safe. Asked last month at a Council hearing if she was considering changes to the NYPD’s relationship with federal agencies in light of the Trump administration’s deportation push, she had a blunt reply. “The short, straight answer to this is no,” she testified. **Related** **Gwynne HoganSenior Reporter** Gwynne Hogan is a senior reporter covering immigration, homelessness, and many things in between. Her coverage of the migrant crisis earned her the Newswomen’s Club of New York’s Journalist of the...More by Gwynne Hogan THE CITY is an independent nonprofit newsroom dedicated to serving the people of New York. Questions?info@thecity.nyc THE CITY is published by City Report, Inc. **Follow Us** Twitter Bluesky Facebook Instagram RSS Feed **ABOUT** **TEAM** **FUNDERS** **ETHICS** **DIVERSITY** **DONATE** **CONTACT** **REPUBLISH** **CAREERS** **Subscribe to THE CITY SCOOP** Sign up and get everything you need to know to be an active New Yorker delivered to your inbox each morning.See more. This site is protected byreCAPTCHA. Facebook Page Twitter Instagram"}