{"id": 1285, "name": "Salem Radio Network News", "domain": "srnnews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://srnnews.com/peanuts-or-almonds-rice-or-millet-planet-friendly-grocery-shopping-choices-go-beyond-cutting-meat/", "title": "Peanuts Or Almonds Rice Or Millet Planet Friendly Grocery Shopping Choices Go Beyond Cutting Meat", "content": "**** Home AudioTop of the HourNewsGreg ClugstonBob AgnewBernie BennettMichael HarringtonBusinessSports Top of the Hour News Greg Clugston Bob Agnew Bernie Bennett Michael Harrington Business Sports Top of the Hour News Greg Clugston Bob Agnew Bernie Bennett Michael Harrington Business Sports U.S. World Politics Business Religious News Sports Health Science Cartoons Menu Latest News » Listen Now Home News CategoriesU.S.WorldPoliticsBusinessReligious NewsSportsHealthScience U.S. World Politics Business Religious News Sports Health Science U.S. World Politics Business Religious News Sports Health Science AudioTop of the HourNewsGreg ClugstonBob AgnewBernie BennettMichael HarringtonBusinessSportsView All Audio Top of the Hour News Greg Clugston Bob Agnew Bernie Bennett Michael Harrington Business Sports View All Audio Top of the Hour News Greg Clugston Bob Agnew Bernie Bennett Michael Harrington Business Sports View All Audio Cartoons **Business** **Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat** Audio By Carbonatix It’s one of the most impactful climate decisions we make, and we make it multiple times a day. The U.N. estimates about a third of the world’s greenhouse gas emissions, the main driver of climate change, come from food. That pollution can come from several links in the food supply chain: how farmland is treated, how crops are grown, how food is processed and how it’s ultimately transported. Maybe you’ve already heard the short answer to minimizing your diet’s impact on the planet: eat more plants and fewer animals. The data backs up that suggestion. Emissions from meat-rich diets are four times higher than that of vegan diets. But so much focus on meats overshadows many other food choices that also impact the environment and can contribute to global warming. Here is a look at other important grocery store decisions: Swapping one serving of chicken per day for beef cuts a diet’s emissions nearly in half. Ruminant animals such as cows, sheep and goats are the top drivers of emissions. Those animals “are associated not only with nitrous oxide emissions, but they’re also related to direct methane emissions because they burp them up while they digest food,” said Marco Springmann, professorial research fellow in climate change, food systems and health at University College London. Springmann said processed animal products have a higher impact on the planet, too: “You need 10 times the amount of milk to make one unit of cheese.” So — and this is true of most food groups — the less processed the food, the smaller the environmental impact. Plant-based proteins like legumes, beans and nuts all boast a much lower climate impact. The standout here is rice, and not in a good way. “Rice uses a ton of water. It uses gobs of fertilizer. There’s flooded rice paddy fields, and that water actually breeds all kinds of bacteria, and those bacteria produce methane gas,” said eco-dietitian nutritionist Mary Purdy. Purdy said the most planet-friendly alternative is just eating a bunch of different grains. “The wheat, corn and soy world is very, very familiar to us because we’ve been seeing it. It’s been heavily marketed. When was the last time you saw a commercial for millet or buckwheat?” she asked. Diverse diets, Purdy said, incentivize biodiverse agriculture, which is more resilient to erratic weather — a hallmark of climate change — and makes healthier soil. When it comes to produce, minimizing impact is less about choosing between foods and more about buying based on the way that food was grown. Conventionally grown produce “very likely is using pesticides, fertilizer, and maybe more water because the soil isn’t healthy,” said Purdy. Purdy said organic labels, such as Regenerative Organic Certified, indicate those foods had a smaller climate impact when they were grown. The tradeoff is that organic food has a lower yield, so it requires more land use and is often more expensive. Local and “in season” foods also have a smaller climate impact, but not just for one of the reasons you may be thinking of: emissions from international shipping. Every day, thousands of large ships transport goods, including produce, around the world, and the fuel they use is heavily polluting. However, “it’s mostly those local emissions on trucks that are actually impactful, not the international shipping emissions,” Springmann said. Also, food grown nearby tends to be grown in a way that fits with the local climate and is less harmful to the environment. “We’re not trying to grow oranges in some place in a greenhouse,” Purdy said. Plants win out over animals, again. Vegetable oils are less impactful than butter or lard. Springmann also said tropical oils are healthiest in moderation, such as those from coconuts or palms, because they have a higher fat content. Plus, palm oil is associated with deforestation. As for nut butters, almonds might be a great option for limiting carbon emissions, but they require a lot of water. One study out of Tulane University found that a serving of peanuts has an emissions footprint similar to almonds but 30% less impact on water use. Throwing less food away might sound obvious, but roughly a third of food grown in the U.S. is wasted. Meal planning, freezing leftovers and checking the fridge before heading to the grocery store all help cut waste. “The climate impact, the embedded water use, all of the labor and different aspects that went into producing that food, that all gets wasted if we don’t eat it,” Nicole Tichenor Blackstone, a professor at the Friedman School of Nutrition Science and Policy at Tufts University. ___ The Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org. Nintendo says sales of its Switch 2 hit a record within four days With retail cyberattacks on the rise, customers find orders blocked and shelves empty Wall Street’s rally stalls as US stocks dip for their 1st loss in 4 days US immigration raid of Omaha meat plant cuts staff, fuels food production worries Trading Day-Good vibrations turn sour Report: Commanders sign S Jeremy Reaves to extension Tennessee sues US Education Department over grants for Hispanic-serving colleges Japan remains cautious on tariff impact in June econ report Stocks up, Treasury yields down on cooler inflation, US-China ‘deal’ The Media Line: US Ambassador Huckabee Denies Pressuring Haredi Lawmakers Over Israeli Coalition Crisis **Follow SRNNews.com** **Editorial Cartoons** Gary VarvelTue, Jun 3, 2025 FollowUs News U.S. World Politics Business Religious News Sports Health Science Audio Top of the Hour News Greg Clugston Bob Agnew Bernie Bennett Michael Harrington Business Sports Opinion Editorial Cartoons Misc About SRN News RSS Feeds Contact Technical Support This site is a proud member of Salem National, a subsidiary ofSalem Media Group. Other Salem National sites include:HughHewitt.com,MikeOnline.com,DennisPrager.com,MetaxasTalk.com,LarryElder.com,TheCharlieKirkShow.com Copyright © 2025 SRNNews.com & Salem Media Group. All Rights Reserved.Privacy Policy|California - Do not sell my personal information|California- CCPA Notice|Terms of Use It’s one of the most impactful climate decisions we make, and we make it multiple times a day. The U.N. estimates about a third of the world’s greenhouse gas emissions, the main driver of climate change, come from food. That pollution can come from several links in the food supply chain: how farmland is treated, […] Your Name(required) Your Email(valid email required) Friend's Name(required) Friend's Email(valid email required) Optional Message Send"}