{"id": 881, "name": "Mayo Clinic", "domain": "mayoclinic.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mayoclinic.org/departments-centers/mayo-clinic-executive-health-program/sections/overview/ovc-20253196", "title": "Mayo Clinic Executive Health Program", "content": "Care at Mayo ClinicPatient-Centered CareAbout Mayo ClinicRequest AppointmentFind a DoctorLocationsClinical TrialsConnect to Support GroupsPatient & Visitor GuideBilling & InsuranceDepartments & CentersInternational ServicesContact UsPatient & VisitorGuide Health LibraryDiseases & ConditionsSymptomsTests & ProceduresDrugs & SupplementsHealthy LifestyleMayo Clinic Health Letter & BooksMayo Clinic Health Letter &Books For Medical ProfessionalsMedical Professional ResourcesRefer a PatientContinuing Medical EducationAskMayoExpertMayo Clinic LaboratoriesVideo CenterJournals & PublicationsMayo Clinic Alumni AssociationContinuing MedicalEducation Research & Education at Mayo ClinicResearchResearch at Mayo ClinicResearch FacultyLaboratoriesCore FacilitiesCenters & ProgramsDepartments & DivisionsClinical TrialsInstitutional Review BoardPostdoctoral FellowshipsTraining Grant ProgramsEducationMayo Clinic College of Medicine and ScienceMayo Clinic Graduate School of Biomedical SciencesMayo Clinic Alix School of MedicineMayo Clinic School of Graduate Medical EducationMayo Clinic School of Health SciencesMayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine andScience **Research** **Education** **Research** **Education** Giving to Mayo ClinicGive NowGiving to Mayo ClinicFrequently Asked QuestionsContact Us to GiveMake aDonation Request appointment Log in Search MenuRequest appointmentDonateDiseases & conditionsFind a doctorCare at Mayo ClinicPatient-Centered CareAbout Mayo ClinicRequest AppointmentFind a DoctorLocationsClinical TrialsConnect to Support GroupsPatient & Visitor GuideBilling & InsuranceDepartments & CentersInternational ServicesContact UsPatient & VisitorGuideHealth LibraryDiseases & ConditionsSymptomsTests & ProceduresDrugs & SupplementsHealthy LifestyleMayo Clinic Health Letter & BooksMayo Clinic Health Letter &BooksFor Medical ProfessionalsMedical Professional ResourcesRefer a PatientContinuing Medical EducationAskMayoExpertMayo Clinic LaboratoriesVideo CenterJournals & PublicationsMayo Clinic Alumni AssociationContinuing MedicalEducationResearch & Education at Mayo ClinicResearchResearch at Mayo ClinicResearch FacultyLaboratoriesCore FacilitiesCenters & ProgramsDepartments & DivisionsClinical TrialsInstitutional Review BoardPostdoctoral FellowshipsTraining Grant ProgramsEducationMayo Clinic College of Medicine and ScienceMayo Clinic Graduate School of Biomedical SciencesMayo Clinic Alix School of MedicineMayo Clinic School of Graduate Medical EducationMayo Clinic School of Health SciencesMayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine andScienceGiving to Mayo ClinicGive NowGiving to Mayo ClinicFrequently Asked QuestionsContact Us to GiveMake aDonation Care at Mayo ClinicPatient-Centered CareAbout Mayo ClinicRequest AppointmentFind a DoctorLocationsClinical TrialsConnect to Support GroupsPatient & Visitor GuideBilling & InsuranceDepartments & CentersInternational ServicesContact UsPatient & VisitorGuide Health LibraryDiseases & ConditionsSymptomsTests & ProceduresDrugs & SupplementsHealthy LifestyleMayo Clinic Health Letter & BooksMayo Clinic Health Letter &Books For Medical ProfessionalsMedical Professional ResourcesRefer a PatientContinuing Medical EducationAskMayoExpertMayo Clinic LaboratoriesVideo CenterJournals & PublicationsMayo Clinic Alumni AssociationContinuing MedicalEducation Research & Education at Mayo ClinicResearchResearch at Mayo ClinicResearch FacultyLaboratoriesCore FacilitiesCenters & ProgramsDepartments & DivisionsClinical TrialsInstitutional Review BoardPostdoctoral FellowshipsTraining Grant ProgramsEducationMayo Clinic College of Medicine and ScienceMayo Clinic Graduate School of Biomedical SciencesMayo Clinic Alix School of MedicineMayo Clinic School of Graduate Medical EducationMayo Clinic School of Health SciencesMayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine andScience **Research** **Education** Giving to Mayo ClinicGive NowGiving to Mayo ClinicFrequently Asked QuestionsContact Us to GiveMake aDonation Care at Mayo ClinicPatient-Centered CareAbout Mayo ClinicRequest AppointmentFind a DoctorLocationsClinical TrialsConnect to Support GroupsPatient & Visitor GuideBilling & InsuranceDepartments & CentersInternational ServicesContact UsPatient & VisitorGuide Health LibraryDiseases & ConditionsSymptomsTests & ProceduresDrugs & SupplementsHealthy LifestyleMayo Clinic Health Letter & BooksMayo Clinic Health Letter &Books For Medical ProfessionalsMedical Professional ResourcesRefer a PatientContinuing Medical EducationAskMayoExpertMayo Clinic LaboratoriesVideo CenterJournals & PublicationsMayo Clinic Alumni AssociationContinuing MedicalEducation Research & Education at Mayo ClinicResearchResearch at Mayo ClinicResearch FacultyLaboratoriesCore FacilitiesCenters & ProgramsDepartments & DivisionsClinical TrialsInstitutional Review BoardPostdoctoral FellowshipsTraining Grant ProgramsEducationMayo Clinic College of Medicine and ScienceMayo Clinic Graduate School of Biomedical SciencesMayo Clinic Alix School of MedicineMayo Clinic School of Graduate Medical EducationMayo Clinic School of Health SciencesMayo Clinic School of Continuous Professional DevelopmentMayo Clinic College of Medicine andScience **Research** **Education** **Research** **Education** Giving to Mayo ClinicGive NowGiving to Mayo ClinicFrequently Asked QuestionsContact Us to GiveMake aDonation Medical Departments & Centers **Executive Health Program** Departmenthome Request anappointment Overview What toexpect Standardprotocol Corporateenrollment Amenities foryou Optionalservices Doctors Costs &insurance **Overview** **Comprehensive — customized — dedicated** Many Executive Health Program participants remark that the comprehensive nature of our executive physicals, the ability to customize the assessments based on their needs, dedicated time with physicians and the warmth of our staff are what distinguish our program. The Executive Health Program is available at our campuses in Rochester, Minnesota; Phoenix, Arizona; and Jacksonville, Florida, as well as at Mayo Clinic Healthcare's London clinic in the United Kingdom. \"Executive Health’s premier experience focuses on preventive health and wellness. Using the best integrated multi-disciplinary evaluation and health therapeutics, we meet your health goals together.\" — Brian Dougan, M.D., Director of Executive Health, Mayo Clinic Rochester We offer a comprehensive, holistic preventive health evaluation using a thorough set of evidence-based assessments to develop a complete understanding of your health status. Each executive health physical starts with an in-depth meeting with your executive health physician to understand your overall health and identify any concerns. Our testing protocol is customized for your stage in life and any risk factors that have been identified. By scheduling a range of assessments during your visit, we develop an extensive and wide-ranging understanding of your health profile and provide you the convenience of completing these tests in one place at one time. Executive Health Program visits conclude with a detailed meeting with your physician to review your results and develop a plan to improve your health, address any issues that were identified and target any risk factors that may impact your health. **Designed with your time in mind** Your time is precious and your calendar is full. We understand. Our program works within the constraints of your schedule to provide you with efficient yet complete medical evaluations. \"Choosing this program is all about convenience. The efficient planning makes the best use of my time so that I can spend more time doing what I love. And of course, Mayo Clinic delivers top-quality care.\" — Paul Rossberger **Comprehensive care and a seamless experience** Preventive health and wellness is different for everyone. A key to long-term success is a strong relationship with a medical provider and dedicated time to have a thorough discussion of what is required to attain and maintain peak heath. The Executive Health Program maximizes your visit time through a customized, comprehensive one-, two- or three-day itinerary of exams and tests tailored to your specific needs. Comprehensive health assessment and medical history review Full range ofpreventive screening tests Cardiovascular counseling Review of medications and immunizations Lifestyle assessment Access to Mayo Clinic subspecialists, if the need arises In-depth, one-on-one review with your personal executive health physician Optional executive health services Private executive lounge with secure lockers for personal items On-site business services with complimentary Wi-Fi Guide to restaurants and transportation options, as well as local attractions and area amenities Dedicated appointment coordinators to ensure your appointments are scheduled efficiently Dedicated insurance coordinators to file claims on your behalf and work with insurance carriers to resolve claims **Contact** Mayo Clinic Executive Health Program 13400 E. Shea Blvd.Scottsdale, AZ 85259 Phone:480-301-8088 Mayo Clinic Executive Health Program 4500 San Pablo RoadJacksonville, FL 32224 Phone:904-953-2907 Mayo Clinic Executive Health Program 200 First St. SWRochester, MN 55905 Phone:507-284-2288 Mayo Clinic Healthcare 15 Portland Place, London W1B 1PT Phone: 0207-871-2575 **Mayo Clinic is Ranked #1 in More Specialties than any other Hospital in the Nation.** **Mayo Clinic is Ranked #1 in More Specialties than any other Hospital in the Nation.** **Executive Health Program** Departmenthome SectionsRequest an appointmentOverviewWhat to expectStandard protocolCorporate enrollmentAmenities for youOptional servicesDoctorsCosts & insurance Request an appointment Overview What to expect Standard protocol Corporate enrollment Amenities for you Optional services Doctors Costs & insurance Request an appointment Overview What to expect Standard protocol Corporate enrollment Amenities for you Optional services Doctors Costs & insurance **Sections** Request an appointment Overview What to expect Standard protocol Corporate enrollment Amenities for you Optional services Doctors Costs & insurance Medical Departments & Centers Executive Health Program **We are transforming healthcare!** Make a gift now to help create new and better solutions for the more than 1.3 million patients who turn to Mayo Clinic each year. Find a doctor Explore careers Sign up for free e-newsletters **About Mayo Clinic** About this Site Contact Us Locations Health Information Policy Medicare Accountable Care Organization (ACO) Media Requests News Network Price Transparency **MedicalProfessionals** AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a Patient **Businesses** Executive Health Program International Business Collaborations Facilities & Real Estate Supplier Information **MedicalProfessionals** AskMayoExpert Clinical Trials Mayo Clinic Alumni Association Refer a Patient **Businesses** Executive Health Program International Business Collaborations Facilities & Real Estate Supplier Information **Students** Admissions Requirements Degree Programs Student & Faculty Portal **Students** Degree Programs Admissions Requirements Student & Faculty Portal **Researchers** Research Faculty Laboratories **InternationalPatients** Appointments Financial Services International Locations & Offices **Charitable Care & FinancialAssistance** Financial Assistance Documents – Arizona Financial Assistance Documents – Florida Financial Assistance Documents – Minnesota **Follow Mayo Clinic** X YouTube Facebook LinkedIn Instagram **Get the Mayo Clinic app** Terms & Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising & Sponsorship Policy Site Map Manage Cookies Terms and Conditions Privacy Policy Notice of Privacy Practices Notice of Nondiscrimination Accessibility Statement Advertising and Sponsorship Policy Site Map Manage Cookies English Español العربية 简体中文 © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved. English Español العربية 简体中文"}