{"id": 1926, "name": "Commune Magazine", "domain": "communemag.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://communemag.com/a-communique-from-basque-country-in-the-time-of-coronavirus/", "title": "A Communique From Basque Country In The Time Of Coronavirus", "content": "About Contact About Contact **A Communique from Basque Country in the Time of Coronavirus** It’s time to seize the means of care. Euskal Herria is a small nation, situated in the north of the Iberian Peninsula, divided by the Spanish–French border. One part is ruled by the French state, and the other, ruled by the Spanish state, is divided into two autonomous communities: Navarre and the Autonomous Basque Community. Here, in one week of enforced confinement, three women have been killed in Navarre and the Autonomous Basque Community; four men were arrested for violence against women just in Navarre—a region of 450,000 inhabitants—during the first weekend. But from this enforced isolation inside houses and apartments, the feminist struggle, organization, and resistance continue. There have been videos circulating on social media, and public posters, along with noisy, nocturnal protests in the form ofcaceroladasringing from balconies and windows everywhere. Collective solidarity leaps over the walls of social isolation and creates webs of care in towns and neighborhoods, combating the precaritization of life and access to basic necessities. The Feminist Movement of Euskal Herria is made up of a multiplicity of feminist collectives that operate locally and/or nationally, with a long and expansive history of organization and struggle. The Euskal Herria Feminist Days—the fifth since 1977—recently took place, gathering three thousand feminists from diverse feminist collectives, cutting across age and ideology, and organized along many forms of difference: genderqueer, nonbinary, and trans people, racialized women, domestic workers, lesbians, the differently abled, internationalists, and more. One of the main demands of the feminist movement, in and beyond Euskal Herria, is the need to “put life at the center.” By framing it this way, they intertwine struggles against masculinist violence and the need for a revaluation and redistribution of care. In Euskal Herria, public denouncements of violence and collective confrontation of abuse have soared in recent years. Particular cases of gang rapes have become major sites for feminist demands for justice, and each time a woman is killed by misogynist violence, protests fill the streets. Self-defense has become a rallying cry for the entire feminist movement, both in the Basque regions and across the Spanish state. Here, as in many spaces of resistance against femicide, this has resulted in a new paradigm: “Si tocan a una, respondemos todas.” If they attack one, we all respond. Most of Euskal Herria currently belongs to the public health system of the Spanish state, which is in theory universal and free. Even so, this social structure that alleviates and cushions the effects of the coronavirus leaves out many bodies and many demands; incarcerated people and detained migrants are especially vulnerable in this situation. While we can access many public services, this does not overshadow the urgent need to put life—far beyond hegemonic life—at the center. The coronavirus only emphasizes an already ongoing care crisis, the profound and planned capitalist inertia of invisibility, gendering, and racialization of care. The following statement, written by the feminist collectives of the Basque Country, is the current analysis and proposal of the feminist movement to address this crisis of care in this specific, urgent moment of COVID-19 from our position as those who are both knowledgeable and practically available to do so. —Maite Arraiza Zabalegi **OPEN LETTER FROM THE FEMINIST MOVEMENT OF EUSKAL HERRIA** (translated by Brooke Lober) In light of the latest events, the Feminist Movement of Euskal Herria recognizes the imperative to rise up and act now. We do this out of our sense of responsibility, and because the lives of our neighbors, of all our neighbors, matter to us. Currently, a state of emergency has been declared, and closure and confinement have been carried out, but no government measure has been taken for collective response—only individual ones. We want to remind everyone that, even though we are confined to our homes, our organized response must be collective. Toward this end, there are already many community initiatives underway. For years, we have been talking about a crisis of care, and we are seeing it now with the COVID-19 pandemic. It is not a mirage; it is more visible because this crisis has caused care to collapse. It is not circumstantial—the care crisis is structural. So it is necessary to change the paradigm, change the neoliberal model that has been imposed based on the belief in individual self-sufficiency. At the same time, we must put life at the center. We still don’t know how to say it. We do not speak here just to explain our current social condition vis-à-vis care. Our intention is not to hinder this situation with our critique, but we must express our concern about some of the measures that are being taken, as we believe that they may aggravate this crisis. We stay at home without knowing the financial compensation measures (if any); we prohibit new income in residences but we are not told how to take care of dependents; we do not know what will happen to migrants without the right to healthcare; people remain confined in homes at the risk of being infected; the victims of violence are isolated and left without options for fleeing their attackers. We could go on, but our responsibility goes beyond warning of the risks. We believe that it is necessary to recognize civil society, to count on that which is always forgotten: unions and social movements, as well as other forces, can now offer an effective and efficient response to the situation we are experiencing. And we, as a feminist movement, are willing to sit down, co-lead, and coordinate that response. Up to now, our society has focused on markets and neoliberal logic, and now we see that we are not prepared to protect life: the lives of people. The latest crises have been primed with the population, especially with the most vulnerable people, due to cuts in health and public services. The situation of care workers is insane, in residences and in homes, due to the absence of public services at home. This impoverished society now faces a social collapse because we are not prepared to confront these bio-eco-political catastrophes. Getting out of this crisis only to return to the previous norm will not serve us; it is necessary to change the social paradigm. Only then can we live with dignity. The world is crying out to us, but we will be able to get out of this only if we are able to overcome capitalist and patriarchal logics, and put life and care at the center. The Feminist Movement does not want to cede political agency, nor will we. We are the ones who know about care—and this crisis, however much they call it a pandemic, is a crisis of care. The inability of states and governments to see the structural dimension of care is alarming. We have said it before. We are ready to assume the responsibility that we have as the overarching political actor that we are. We are not going to deny that we have fears and doubts, and that we feel vulnerable, but the Feminist Movement of Euskal Herria is not going to shy away from the political responsibility it has with care, with lives, with women and gender dissidents and with society as a whole. For this reason, we call on the Basque and Navarran governments and the Iparralde Commonwealth to create a Care Coordination Bureau, which will include, along with the parties and unions, the social agents excluded so far in decision-making, such as feminist movements and workers’ associations—the participation of groups and agents directly related to care, such as domestic workers, AMPAS, or residential workers, is essential. And to ensure its interconnectivity and technical quality, the Feminist Movement will ensure the presence of experts in care, economics and medicine. The Feminist Movement will be present as guarantor and as participant. We believe that it is necessary to organize ourselves socially to organize care among all, and at the same time address the needs of people without representation. We are ready to work. We will only get out of this if we get out together: for this, social organization is necessary. The public authorities must accept dialogue with the agents who are really behind the care and maintenance of society and life, and who also have the capacity to mobilize and organize society from below. It is necessary that our voice be heard, and that the Feminist Movement be recognized as a valid interlocutor, because it is of no use to us that politicians and institutional representatives attend International Women’s Day demonstrations on March 8 (if they had told us the truth, we would not have invited them) or take photos taking advantage of the political situation, if later they are not able to give us a voice, dialogue, and decision-making capacity. What we are doing and asking for is a matter of moral and political responsibility. We are committing ourselves to coordination, to work. It is time to accept reality and act accordingly. The reality is that this crisis is going at a breakneck speed and we have no time to lose. That is why we ask the Urkullu cabinet to respond within 48 hours if it accepts our proposal. In the same way, we ask the rest of the forces named here—the parties and unions—to respond. We cannot stand still and wait. We will do it from our homes, online, ensuring the health of those who will be at that virtual table—but the table will be set up and will begin to run one way or another, because care can never stop and our lives are at stake. Are you going to be left out? We cannot close without remembering the two Basque women murdered last week. We are concerned because we know that sexist violence, unfortunately, will not rest, nor will it be quarantined in this crisis; it may even get worse. We will also address this at this bureau. The Feminist Movement of Euskal Herria will put all its strength into this. We will live up to it. We have questioned you; we await your response. Will we build together? Maite Arraiza Zabalegi and Brooke Lober Maite Arraiza Zabalegi is a feminist activist and philosopher. She is finishing her PhD in the University of the Basque Country (UPV/EHU). Brooke Lober is a feminist scholar and activist based in Oakland, California, currently investigating histories of anti-imperialist and anti-Zionist feminism. She is a member of the Abolition Collective. Maite Arraiza Zabalegi and Brooke Lober Maite Arraiza Zabalegi is a feminist activist and philosopher. She is finishing her PhD in the University of the Basque Country (UPV/EHU). Brooke Lober is a feminist scholar and activist based in Oakland, California, currently investigating histories of anti-imperialist and anti-Zionist feminism. She is a member of the Abolition Collective. **Recent ArticlesWe’re Being PlayedShane BurleyThe Great May Day Rent StrikeCommuneOrganizing for Survival in New York CityWoodbineSean Bonney, 1969-2019CommuneThe Year of the WombatMadeline Lane-McKinley** **We’re Being Played** **The Great May Day Rent Strike** **Organizing for Survival in New York City** **Sean Bonney, 1969-2019** **The Year of the Wombat** **We’re Being Played** **We’re Being Played** **The Great May Day Rent Strike** **The Great May Day Rent Strike** **Organizing for Survival in New York City** **Organizing for Survival in New York City** **Sean Bonney, 1969-2019** **Sean Bonney, 1969-2019** **The Year of the Wombat** **The Year of the Wombat** **Subscribe now** 1 Year Print Subscription (4 issues) **Popular Posts** **Three Months Inside Alt-Right New York** An undercover antifascist descends through all nine circles of the alt-right inferno. **Three Months Inside Alt-Right New York** An undercover antifascist descends through all nine circles of the alt-right inferno. **Between the Devil and the Green New Deal** We cannot legislate and spend our way out of catastrophic global warming. **Between the Devil and the Green New Deal** We cannot legislate and spend our way out of catastrophic global warming. **The Satanic Death-Cult Is Real** In Hereditary and now Midsommar, horror is family. **The Satanic Death-Cult Is Real** In Hereditary and now Midsommar, horror is family. **Dystopias Now** The end of the world is over. Now the real work begins. **Dystopias Now** The end of the world is over. Now the real work begins. Issue 5 **Winter 2020** Issue 5 **Winter 2020** See Issue 5 See Issue 5 Commune is a popular magazine for a new era of revolution Follow @commune_mag Current Issue About Contact © 2025 Commune Magazine"}