{"id": 2002, "name": "In These Times", "domain": "inthesetimes.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://inthesetimes.com/article/war-protest-standing-rock-cop-city-repression-criminalize-dissent-political-rights-first-amendment", "title": "War Protest Standing Rock Cop City Repression Criminalize Dissent Political Rights First Amendment", "content": "**The War on Protest Is Here** **Political repression is on the rise as the state finds new ways to criminalize dissent and collective action.** Amin Chaoui had been in Atlanta less than24hours when things took an unexpected turn. Chaoui, then31, drove down from Richmond, Va., to attend a March2023music festival organized by activists trying to stop the construction of the police training facility known as Cop City. The sprawling compound in one of Atlanta’s largest urban parks would require clearing at least85acres of partly forested land that abuts a predominantly Black neighborhood in DeKalb County. It faced growing opposition from racial and environmental justice advocates, including an occupation of the forest that began in November2021. Chaoui was loosely familiar with Cop City — he’d seen flyers around Richmond — but hadn’t been involved in the campaign. He’d also never been to Atlanta, and was especially drawn to the music. There was also an Alcoholics Anonymous meeting at the festival that appealed to Chaoui, who had started a recovery program five months prior.​“I honestly just thought I was going to spend a few days in the forest and then go home,” Chaoui said. But before the hour-long AA meeting ended his first night there, Chaoui noticed heavily armed police officers encircling the venue. About a half-mile away, a group of protesters had staged an impromptu march through the development site, setting fire to some of the construction equipment. As the sun began to set, plumes of smoke rose above the forest, providing the only pretext law enforcement needed to round up anyone in attendance. As Chaoui tried to leave, he and about50other people were corralled and handcuffed in a parking lot. By the end of the night,23of them were thrown in the DeKalb County jail. When Chaoui was released18days later, he faced a very different future: He’d been charged with domestic terrorism, which, in Georgia, is punishable by up to35years in prison. Several months later, in August, Chaoui and60others were also indicted under anti-racketeering laws designed to go after organized crime, known as the Racketeer Influenced and Corrupt Organizations Act (RICO). Allegations against members of the group include being part of acriminal conspiracyamong an​“organized mob” to​“occupy the DeKalb forest and cause property damage.” Chaoui has struggled to find work since then; he’s been relying on fundraising networks to pay his rent. Chaoui’s relationships with friends and family have also frayed. As a Muslim American, the domestic terrorism charge — one of the first results that appears if you search him online — is an especially heavy burden.​“My personal life is in shambles now,” Chaoui told me. The sweeping nature of the Cop City arrests and charges may be novel, but the targeting of protesters and social movements is not. Since2017— the same year Georgia expanded its domestic terrorism law to include property destruction —21states have passed legislation to enhance penalties and fines for common protest-related crimes, such as trespassing or blocking highways. “We’re in a really unique moment with the amount of legislation that we’re seeing, [with] this legal assault on protesters and the right to protest in the U.S.,” says Nick Robinson, a senior legal advisor at the International Center for Not-for-Profit Law, which tallied nearly300anti-protest bills introduced in state legislatures since2017,41of which passed. Many of those laws seemed like direct responses to specific protest campaigns, says Nora Benavidez, senior counsel for the nonprofit group Free Press and lead author of the2020PEN America report,Arresting Dissent: Legislative Restrictions on the Right to Protest.​“For every progressive movement — irrespective of its actual views — there’s so quickly a crackdown that occurs in language and narrative and law.” Among recently passed state laws,19enhance penalties for or make it a felony to engage in protest on or near energy infrastructure— a clear reaction to the mass protests over the Dakota Access Pipeline at Standing Rock in2016. After2020’s Black Lives Matter protests, five states enacted laws — and nine others have pending legislation — that impose harsh penalties for individuals who block traffic or even sidewalks. Some states added laws granting immunity to drivers who strike protesters and extending liability for crimes committed during protests to any organizations that support them. This January, in response to growing opposition to the war in Gaza, Democrats in New York proposed a bill that would expand the definition of domestic terrorism to include blocking public roads or bridges. But it’s not just state legislatures cracking down on protest. Republican senators have introduced federal legislation, also in response to protests over Gaza, to criminalize blocking public roads and highways. Another bill, introduced by Sen. Tom Cotton (R-Ark.) and ostensibly responding to​“pro-Hamas leftists,” would increase the prison sentence for participating in a​“riot” — loosely defined as an act of violence committed by a group of three or more people — from five years to10. Accompanying these laws is increasingly harsh rhetoric from political figures to demonize protest movements, characterizing activists as rioters, mobs, violent extremists and terrorists. Protesters face other threats too: During the summer of racial justice protests that followed the police killing of George Floyd in2020, the Trump administration openly discussed deploying military force to clear demonstrations, and protesters in Portland, Ore., were snatched from the street by federal law enforcement officials in unmarked vehicles, a troubling episode still shrouded in mystery. More recently, pro-Palestinian activists say they’ve faced home visits from police and the FBI. This week, Cottonurgedpeople who end up stuck in traffic due to protest actions to​“take matters into your own hands” and​“put an end to this nonsense.” Courts have also struck at the right to protest. Just this Monday, the Supreme Courtannouncedits refusal to hear a case involving DeRay Mckesson, a prominent leader in the Black Lives Matter movement. On two prior occasions, a lower court had ruled that protest organizers like Mckesson can be held liable for the actions of others, upending decades of legal precedent. The Supreme Court’s rejection of Mckesson’s appeal means that, at least for now, it is a huge risk to organize mass actions in Louisiana, Mississippi and Texas. Taken together, says Charlie Hogle, a staff attorney with the American Civil Liberties Union’s National Security Project, these shifts will inevitably​“have a chilling effect on the sort of important political speech we think the First Amendment is intended to protect.” A decade ago, protesters in Georgia and other states who engaged in civil disobedience — knowingly breaking the law to advocate for their cause — likely would have faced misdemeanor charges and perhaps a night in jail. Today, they can spend months in pretrial detention — as several activists involved in the Stop Cop City campaign have — before facing lengthy and expensive legal battles to clear their names. The new laws, stiffer penalties, and more aggressive policing have, in addition to landing more activists in jail, had a corrosive effect on social movements across the country. Jamie Marsicano, a third-year law student at the University of North Carolina-Chapel Hill who was swept up in the same Cop City raid that nabbed Chaoui, had been arrested at protests before — including during street marches in2020— and assumed they’d be processed quickly and released. But like Chaoui, Marsicano spent nearly three weeks in jail and had to post $50,000in bonds to get out — money that may not be recouped for years. Upon their release, Marsicano had to wear an ankle monitor for three months and, after a decision by UNC’s chancellor, was barred from setting foot on campus or even attending classes online. Marsicano was able to finish their coursework at Duke and will graduate this spring — but they can’t take the bar exam in North Carolina or practice law until the case is settled, which could take years. Even if the felony charges are ultimately dropped — as lawyers say they routinely are in protest-related arrests — the threat keeps activists off the streets and siphons resources away from political organizing. “I don’t think the goal is conviction, which is really sinister,” says Xavier T. de Janon, director of mass defense with the National Lawyers Guild. The tactics have already changed the way movements organize. Activists in Georgia are now worried about the implications of participating in routine political activities, such as putting up flyers or circulating and signing Cop City-related petitions. The fears aren’t unfounded: Three activists swept up in the RICO indictment were initially arrested for posting flyers identifying the police officer who allegedly shot and killed Stop Cop City activist Manuel Esteban Paez Terán in January2023.In September2023, the city of Atlanta made the unusual decision to publish the full names and addresses of the more than100,000people who signed a Stop Cop City petition, effectively doxxing them. Afterward, according to Marlon Kautz — cofounder of the Atlanta Solidarity Fund, which has provided bail support and other resources to area activists since2016— many locals said​“they would never sign another controversial petition again.” But many states, including Georgia, are now going even further, attempting to pass new laws that could fatally undermine the support networks that social movements depend on. A couple months after the music festival, Kautz awoke to the sound of his front door being kicked in by law enforcement. The Atlanta Solidarity Fund’s home-based office, which Kautz shares with two of its board members, was ransacked, their files and computers seized. Kautz and his coworkers wereinitially charged, in May2023, with money laundering and charity fraud — though they have not yet been indicted on those initial charges. But in August, they were included in the sweeping RICO indictment, which claims that the Atlanta Solidarity Fund, through its parent nonprofit the Network for Strong Communities, provided financial support to the forest defenders and published posts online claiming responsibility for acts of property destruction. According to Georgia’s attorney general, these were all acts that furthered the​“conspiracy.” (Kautz says he is unable to talk about specific allegations while the case is ongoing but​“suffice it to say the indictment contains claims which are objectively lies.”) Like de Janon, Kautz doesn’t believe the RICO charges are intended​“to secure convictions in the long term.” Rather, he tells me,​“It’s to create as much disruption as possible to protesters and the nonprofit organizations which protect their rights. And in that sense, these charges are working exactly as intended.” But Kautz and his colleagues also face another threat. Republicans in Georgia have introduced multiple anti-protest bills since Cop City protests began in order to, as one said, send​“a signal to troublemakers … that they won’t get a slap on the wrist” if they​“engage in rioting” in Georgia. In2023, Georgia Republican state Sen. Randy Robertson introduced what was initially characterized as a bail reform bill, which would significantly expand the number of offenses requiring mandatory cash bail to include criminal trespass and unlawful assembly — charges frequently lobbed at protesters. That was bad enough, says Tiffany Williams Roberts, policy director at the Southern Center for Human Rights, which opposed the legislation. But this year, a new clause was added that makes it virtually impossible to operate a nonprofit bail fund in Georgia by limiting the number of people that charitable organizations, including churches, can assist in any given year — to only three people. Kautz, who faces up to20years in prison and $25,000in fines if convicted on the RICO charges, sees the bill as a direct response to the solidarity fund’s successful work in bailing out nearly100Cop City activists.​“It was shocking how blatantly targeted it was at our work,” Kautz says. The bill passed both houses of Georgia’s legislature. It takes effect in July. The anti-pipeline campaigns of the2010s ushered in a new era of environmental politics and protest. The Keystone XL campaign, targeting a pipeline that would have carried oil from the Canadian tar sands to the Gulf Coast, embraced direct action, including tree-sits, to disrupt the project’s construction. Though the movement was committed to nonviolent civil disobedience, itengendered heavy resistancefrom industry and law enforcement at multiple levels. In early2012, before Keystone XL became a household name, the FBI opened a counterterrorism assessment of South Dakota activists with a focus on Native groups and leaders. A second FBI assessment, targeting Texas activists protesting the pipeline’s southern leg, began less than a year later. In documents I obtained through Freedom of Information Act requests, the FBI hypothesized both groups — whose members they called​“extremists” — would move from lawful First Amendment-protected activity (including attending public hearings) to​“violent opposition.” The language of extremism — many of the FBI documents are part of larger​“domestic terrorism” case files — came to permeate the federal government’s characterization of the anti-pipeline movement and has dogged subsequent social justice campaigns. The charging documents in many of the Cop City arrests cite a Department of Homeland Security classification that characterized Defend the Atlanta Forest, a group affiliated with the Stop Cop City movement, as​“domestic violent extremists.” Similar labels have been used to describe Black Lives Matter and anti-fascist activists — labels with serious impact on movements’ ability to attract new members and how law enforcement responds to those groups. Hundreds of individuals were arrested during the roughly five-year campaign to halt Keystone XL, which declared victory when Obama canceled the project in late2015. But none of those activists were charged, or even threatened with felonies, recalls Lauren Regan, executive director of the Civil Liberties Defense Center. Nonetheless, policing and prosecution tactics escalated sharply during the Dakota Access Pipeline blockade the following year. In2016, thousands of activists, including many veterans of the Keystone XL fight, descended on the Standing Rock Sioux reservation in North Dakota, where tribal leaders had set up​“spirit camps” in an attempt to block pipeline construction. The standoff lasted several months and was marked by violent clashes with heavily armed state and local law enforcement, National Guard troops and private security firms. The FBI, according to newly released court documents, deployed up to10informants to spy on the protesters. The legislative response to Standing Rock was equally severe. In January2017, just weeks after the camps were cleared, North Dakota introduced and later passed two laws expanding the definition of criminal trespass and dramatically heightening penalties for so-called riot offenses — an unmistakable response to what had unfolded at Standing Rock. As with similar bills that have deployed terms like rioting or domestic terrorism, the language in these was deliberately vague, giving law enforcement and state officials broad discretion to target groups whose viewpoints they disagree with. In2019, a third law was passed, enhancing penalties for trespassing on or near critical infrastructure and making interference with pipeline construction a felony, carrying penalties of five years in prison and fines of up to $10,000. What all of this adds up to is that a Standing Rock-style protest in North Dakota, or many other states, is virtually impossible today. Nearly20states now have similar​“critical infrastructure” laws, which have been supported by the petrochemical and oil and gas industry and shepherded through statehouses with assistance from the conservative American Legislative Exchange Council. At the same time, in the more than20years since9/11, many states have passed or amended laws increasing the number of crimes defined as domestic terrorism, which can levy exceptionally harsh punishments and grant law enforcement far greater investigatory powers. Georgia, for example, updated its domestic terrorism law in2017, ostensibly in response to the2015mass shooting of nine Black parishioners by white supremacist Dylann Roof in Charleston, S.C. But the law included provisions — like classifying as terrorism the disabling or destruction of critical infrastructure, government facilities or public transit systems — that had nothing to do with Roof’s crimes and which were condemned by civil liberties groups as potential threats to constitutionally protected speech. Maine and now Oregon have similar statutes. Oregon’s law, passed in August2023, is particularly worrisome, since its definition of​“critical infrastructure” extends to public roads — meaning protest activity that​“damages” a highway could be prosecuted as domestic terrorism. What constitutes​“damage” Oregon’s statute doesn’t say, exemplifying how vaguely written laws open the door to potential abuse. “It places a lot of power in the hands of state and local law enforcement and gives a lot of prosecutorial discretion to people who may be driven by political incentives,” says the ACLU’s Charlie Hogle.​“And that should be very troubling to everyone, no matter your politics.” Donald Trump’s rise to power overlapped with — and in many ways fueled — the surge in anti-protest legislation, as his2016election was met with unprecedented mass action. The Women’s March on Jan.21,2017, marked what is widely believed to be the largest single-day protest in U.S. history, with some four million people taking to the streets in more than600U.S. cities. The day before— Inauguration Day — more than200protesters were arrested in Washington, D.C., and indicted on felony rioting charges, all but one of which were later dropped. A week after taking office, Trump signed an executive order banning people from seven Muslim-majority countries from entering the United States, prompting yet more demonstrations at airports across the country. This period was also marked by a dark shift in rhetoric, as Trump and his allies vilified protesters as thugs and referred to constitutionally protected activity as crimes. During2020’s demonstrations against police brutality, Trump reportedly instructed law enforcement and top military officials to​“beat the fuck out of” protesters and​“just shoot them.” That June, the National Guard used tear gas and rubber bullets to remove peaceful protesters from Washington’s Lafayette Square, before escorting Trump to a photo-op in front of a church. The following month, federal officers dressed in camouflage and driving unmarked vans grabbed protesters off the street in Portland, Ore., and held them for questioning without pressing charges. An attorney with the Oregon Justice Resource Centertold NPRit was like​“stop and frisk meets Guantanamo Bay.” Mark Pettibone, one of those detained, wrote that the officers covered his eyes and he feared for his life. (The ACLU is currently suing the federal government over what it alleges were unlawful detentions.) Meanwhile, Republican congressmembers pushed the Department of Justice to prosecute antifascist and Black Lives Matter activists under federal anti-racketeering laws.​“We have laws on the books that prohibit organized crime — the kind of organized crime that we’re seeing from BLM,” Rep. Chip Roy (R-Texas) told reporters at an event organized by the House Freedom Caucus in June2020. The year prior, fellow Texan and Republican Sen. Ted Cruz urged Attorney General William Barr to open a similar investigation into​“Antifa,” noting that RICO would enable prosecution of members of a group​“even when the government cannot establish which particular individual … committed a given crime.” State legislators heeded their call, enacting laws that empower local officials to charge not only individual activists but also the networks that support them as part of a broader​“conspiracy.” Many of the critical infrastructure bills, for example, include stiff penalties for organizations that aid — through funding or direct-action trainings — in impeding pipeline construction. In Montana and North Dakota, an organization found to be a​“conspirator” in protesting on or near critical infrastructure is liable for fines10times the amount authorized for trespassing. Still, Georgia’s more recent RICO indictment against Stop Cop City activists marks a clear shift in government targeting of social movements. According to the Civil Liberties Defense Center’s Lauren Regan — who’s representing one Cop City defendant and has advised others — it’s the first time RICO has been weaponized this way. There have been lawsuits brought by corporations against environmental activists in the past, but those were civil, not criminal, cases. And while Indiana prosecutors tried to use RICO to criminally prosecute two Earth First! activists in2009, the racketeering charges were eventually dismissed. Ultimately, Regan says, the statute was never intended to be used to prosecute political activity:​“Historically, we do not place political protests in the same bucket as gang drug dealers.” But now, regardless of whether Georgia prevails in its case, other states could follow suit. “The notoriety and the commitment of resources to these cases in Georgia have made a lot of states look at their RICO statutes,” says Regan, and think of them​“as a potential tool.” On Nov.2,2023, Jewish Voice for Peace (JVP) and allied groups in Durham, N.C., staged a protest that brought rush hour traffic on Highway147to a standstill. About50protesters occupied two lanes of the highway, calling for an immediate cease-fire in Gaza, for two and a half hours. “The political mainstream doesn’t like it when people awaken the conscience of the nation,” Tema Okun, a JVP member who participated in the protest (but did not block traffic), tells me, but​“it’s deeply American to protest like this.” Two months later, North Carolina Sen. Thom Tillis and Tennessee Sen. Marsha Blackburn, both Republicans, introduced the Safe and Open Streets Act, which would make it a federal crime to block a public road or highway or, crucially, to​“attempt to conspire to do so” — a clause which implicates any individual or group that might help plan such an action. A press release for the bill, which describes groups protesting U.S. support for Israel as​“Hamas sympathizers,” said the legislation was a​“direct response to radical tactics of pro-Palestine protesters.” The Tillis-Blackburn bill is part of a wider effort among state and federal lawmakers to subvert the growing opposition to U.S. support for Israel’s war in Gaza. Since the Hamas attack on southern Israel on October7, and Israel’s retaliatory assault (which has killed more than33,000Palestinians), mass civil disobedience has been one of the most visible ways for people to express discontent. These campaigns, many led by progressive Jewish groups, have been met with reactionary rhetoric equating any support for Palestine with Hamas and a new round of legislation criminalizing dissent. Sen. Tom Cotton, who called for deploying the military against Black Lives Matter protests in2020and giving​“no quarter” to participants in protests that turn violent, also introduced a bill this March: the​“Stop Pro-Terrorist Riots Now Act,” against​“pro-Hamas mobs.” And Rep. Ryan Zinke (R-Mont.), Trump’s former interior secretary, proposed legislation that would​“expel Palestinians” from the country. When Sens. Tillis and Blackburn introduced their bill, Tillis declared that blocking roads or bridges — common protest tactics going back at least to the civil rights era —​“needs to be a crime throughout the country.” Soon, it may be. Alaska, Arizona, Missouri, New Jersey, New York, Washington and West Virginia have allintroduced bills in recent monthsto criminalize blocking roads or highways during protest, with some lawmakers explicitly referencing pro-Palestinian protests as justification. In Tennessee, which already criminalized highway protests, Republicans have proposed an enhancement measure that would make the offense a Class D felony, punishable by up to12years in prison and a $5,000fine. (South Dakota, Oklahoma, Iowa, Florida and Arkansas have already passed similar bills, and Massachusetts may soon follow.) New York’s bill, introduced by Democratic lawmakers, is perhaps the most extreme, declaring that blocking public roads, bridges or transportation facilities — or even​“act[ing] with the intent” to do so — is a form of domestic terrorism. Even if these bills fail, they contribute to a climate of intimidation that chills speech and deters people from taking action. The crackdown has been more explicit on college campuses, amounting to what JVP executive director Stefanie Fox describes as a new form of McCarthyism, as student protesters have been doxxed, suspended and threatened with deportation. In early November2023, Brandeis became the first private university to ban its chapter of Students for Justice in Palestine (SJP); a week later, George Washington University followed suit. Around the same time, Columbia University temporarily suspended its SJP and JVP chapters. More recently, Columbia and American University have drafted policies severely limiting when and where students can protest. Meanwhile, Florida’s public university system ordered the deactivation of all SJP chapters, claiming the group’s activism amounted to​“material support” for terrorists, a felony under Florida law. (The order was challenged by the ACLU and has since been walked back by the chancellor, but the deactivation order remains on the university system’s website.) And a growing number of states have passed laws defining antisemitism in ways that limit criticism of Israel and stifle academic freedom All of this is happening at a particularly volatile and perilous moment in U.S. history. The movement opposing U.S. policy toward Israel is attracting​“hundreds of thousands” of new supporters, says Fox, but that’s also coming at​“a time where the Right is really experimenting and trying to build new tactics and legislative tools of repression.” In Democratically controlled Chicago, pro-Palestinian groups have already been denied permits to protest outside this summer’s Democratic National Convention — an echo of the violent clashes between protesters and police at the1968convention, which also concerned racial discrimination and an unjust war. Organizers have declared that, even if Chicago refuses to allow them near the convention center, the march will take place,​“permit or not.” But the FBI has already been knocking on doors in Chicago, home to the largest Palestinian American diaspora community in the country, with roots dating back to the late19thcentury. Muhammad Sankari, a Chicago-based organizer with the U.S. Palestinian Community Network, says at least two Yemeni families and one prominent Palestinian community leader have faced questioning in their homes by the FBI and Chicago police, in visits that followed Democratic Rep. Nancy Pelosi’s January call for the agency to investigate pro-Palestinian groups’ funding. The FBI has conducted home visits to members of the Palestinian community in the past, Sankari says, especially during periods of social unrest. But the visits now seem particularly intent on intimidating a movement that’s growing nationwide. In Oklahoma, three FBI agents showed up at the home of Stillwater resident Rolla Abdeljawad after she posted comments to her Facebook page critical of the war in Gaza. The advocacy group Palestine Legal has reported numerous similar incidents. An attorney working with one of the Chicagoans who was questioned confirmed that a Chicago police officer who was present during the visits told them that the FBI again has its eye on the city’s Arab American community. The Chicago Police Department did not respond to requests for comment. In a written statement, an FBI spokesperson declined to confirm whether the Chicago visits had even taken place or if any investigations had been opened. But, the spokesperson assured,​“The FBI will never open an investigation based solely on protected First Amendment activity.” Sankari is not convinced:​“This sets the stage for the next phase of repression,” he says. And what that phase brings will be shaped by what happens this November. Whatever the outcome of the election, mass protest is almost guaranteed. Should Trump win — as he well might — he has already vowed to pursue his enemies with a vengeance and serve as a dictator for at least​“day one.” On the campaign trail, Trump has lamented not having sent troops to quell protests during the summer of2020and has said he’d consider suspending the Constitution to further his agenda. Meanwhile, his far-right allies have reportedly drafted plans to invoke the Insurrection Act, allowing Trump to use military force to crush opposition movements and civil unrest, making mass action like the Women’s March all but impossible. The legal landscape has shifted considerably since Trump last occupied the White House: states have many more tools to go after protesters, and, as the Cop City arrests indicate, Republican officials are increasingly willing to deploy existing laws in new ways to conduct sweeping arrests of activists. The day after I spoke to Tema Okun, who has been an activist with progressive Jewish organizations for20years, she emailed to say she felt she had understated the threat posed in this moment. She wanted to try again. As more and more laws are proposed and passed to​“criminaliz[e] dissent, and as we face a possible presidency by a man who admires Putin and expresses his penchant for dictatorship,” Okun writes,​“we are skating closer and closer to authoritarianism.” Basic freedoms, once enshrined in the Constitution, are now at risk of being eliminated.​“Congress shaves off more and more rights piecemeal until we find we are unable to speak aloud our criticisms of government policies and practices. We slowly become a police state.” This article was produced in partnership with the nonprofit newsroomType Investigations, where Adam Federman is a reporting fellow. Adam Federmanis a reporting fellow withType Investigationswhose work has appeared inPolitico, theWashington Post,Wiredand other publications. He is the author ofFasting and Feasting: The Life of Visionary Food Writer Patience Gray. Subscribe to the print magazine. Who We Are Past Issues Privacy Policy Donate Become a Sustainer Bequests Advertise Magazine Subscriptions Gift Subscriptions Customer Service Podcasts Submissions & Rates Jobs Internships Reprint Requests National Writers Union Contact Us"}