{"id": 2143, "name": "The Honest Patriot", "domain": "thehonestpatriot.net", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://thehonestpatriot.net/a-lot-of-people-need-long-term-care-but-providers-cant-find-enough-workers/#respond", "title": "A Lot Of People Need Long Term Care But Providers Cant Find Enough Workers", "content": "Latest News News Politics U.S. Tech & Science Health Sports Latest News News Politics U.S. Tech & Science Health Sports **A lot of people need long-term care, but providers can’t find enough workers** The need for long-term care is growing, but it’s getting harder and harder to find people to provide it. Culix Wibonele was a trained nursing assistant who worked in long-term care. She was originally from Kenya and met most of her clients when she moved to Atlanta. She did things like cooking, bathing, and other daily tasks for them. The woman named Wibonele said that she was only paid nine dollars an hour and had to work as a babysitter to make ends meet. “Well, my paycheck was really nothing at all.” Wibonele said, “I was shocked by how much work we were sent to do and how much money you get at the end.” There are a lot of people who work in long-term care agencies like her who feel the same way. She also says that the job comes with a high risk of getting hurt because she sometimes has to lift people who are much bigger than her. The business needs help, but it’s hard to find people to work there because the work is hard and the pay is low. Twenty percent of the population will be 65 or older by the end of the decade, so there will be a greater need for these people. It’s normal for there to be shortages and a lot of staff turnover after a pandemic, but the shortages in this particular work force haven’t gone away much. A poll of nursing home providers showed that almost all of them had open positions and were having trouble finding people to fill them. Alice Bonner, who runs the Center for Innovative Care in Aging at Brown University and is in charge of strategic partnerships, said that nursing home workers leave for good every year. Bonner said, “The people who are still working are working much harder. They are working double shifts, extra hours, and with temporary and agency workers.” Many people don’t work in nursing homes because of the amount of work, the pay, or better job possibilities. For example, nurses make more money in a hospital than in a nursing home. According to experts, there will continue to be a lack of workers in this field as it grows and more adults need more help. **To save orchids, scientists move soil fungi to other places** **Grocery prices are still going up, but soon people may be able to relax** **HPV vaccines are said to keep both men and women from getting cancer** **ICJ asks strikes on Rafah in Gaza to stop** **Chinatown in New York City has small businesses that can’t stay open** Latest News News Politics U.S. Tech & Science Sports Health Terms and Conditions Privacy Policy Contact © Newspaper WordPress Theme by TagDiv"}