{"id": 761, "name": "KIVI - Boise News", "domain": "kivitv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kivitv.com/news/local-news/in-your-neighborhood/today-in-your-neighborhood/today-in-your-neighborhood-harris-ranch-meeting-at-boise-city-hall-tuesdays-on-the-creek-in-caldwell", "title": "Today In Your Neighborhood Harris Ranch Meeting At Boise City Hall Tuesdays On The Creek In Caldwell", "content": "Menu Submit A News Tip In Your NeighborhoodDowntown BoiseSoutheast BoiseWest BoiseNorth EndEast EndWest EndBoise AirportBoise BenchBoise StateSouth BoiseGarden CityFoothillsMeridianNampaKunaEagleCaldwellEmmettStarMountain HomeJeromeTwin FallsIdaho BackroadsBurleyCascadeMcCallPayetteValley CountyHaileyKetchumSun Valley Downtown Boise Southeast Boise West Boise North End East End West End Boise Airport Boise Bench Boise State South Boise Garden City Foothills Meridian Nampa Kuna Eagle Caldwell Emmett Star Mountain Home Jerome Twin Falls Idaho Backroads Burley Cascade McCall Payette Valley County Hailey Ketchum Sun Valley Downtown Boise Southeast Boise West Boise North End East End West End Boise Airport Boise Bench Boise State South Boise Garden City Foothills Meridian Nampa Kuna Eagle Caldwell Emmett Star Mountain Home Jerome Twin Falls Idaho Backroads Burley Cascade McCall Payette Valley County Hailey Ketchum Sun Valley WeatherHourly ForecastDaily ForecastAllergy ReportClimate and EnvironmentWildfiresClosings & Delays Hourly Forecast Daily Forecast Allergy Report Climate and Environment Wildfires Closings & Delays Hourly Forecast Daily Forecast Allergy Report Climate and Environment Wildfires Closings & Delays TrafficTraffic Cams Traffic Cams Traffic Cams CommunityCommunity Baby ShowerFoodLifestyleToys for TotsWalk to End Alzheimers Community Baby Shower Food Lifestyle Toys for Tots Walk to End Alzheimers Community Baby Shower Food Lifestyle Toys for Tots Walk to End Alzheimers Inside the Statehouse Idaho Back Roads Made in Idaho Love Your Neighborhood University of Idaho Murders Vallow-Daybell Coverage America Votes Healthier Together Shine A Light Contests TV ListingsTV Listings - KIVITV Listings - KSAW TV Listings - KIVI TV Listings - KSAW TV Listings - KIVI TV Listings - KSAW About UsContact UsIdaho News 6 StaffAdvertise with UsStation ToursCareers Contact Us Idaho News 6 Staff Advertise with Us Station Tours Careers Contact Us Idaho News 6 Staff Advertise with Us Station Tours Careers Sign In Newsletters Sign Out Manage Emails Apps Careers Search Treasure Valley Magic Valley In Your Neighborhood En Español Weather Traffic Scripps News Group KSAW Twin Falls Be seen on Idaho News 6 Community Baby Shower Shine a Light Allergy Report **Actions** Facebook Tweet Email **Today In Your Neighborhood: Harris Ranch meeting at Boise City Hall & Tuesdays on the Creek in Caldwell** TREASURE VALLEY, Idaho — These are a few of the things going on today in your neighborhood: HARRIS RANCH MEETINGHarris Ranch Community Infrastructure District No. 1 meeting today at Boise City Hall from 1:30 to 3:30 p.m. this afternoon.This group is a separate and distinct legal entity from the City of Boise which encourages the funding and construction of regional infrastructure.That meeting is set up for both in-person and virtual attendees. HARRIS RANCH MEETING Harris Ranch Community Infrastructure District No. 1 meeting today at Boise City Hall from 1:30 to 3:30 p.m. this afternoon. This group is a separate and distinct legal entity from the City of Boise which encourages the funding and construction of regional infrastructure. That meeting is set up for both in-person and virtual attendees. HARRIS RANCH MEETING Harris Ranch Community Infrastructure District No. 1 meeting today at Boise City Hall from 1:30 to 3:30 p.m. this afternoon. This group is a separate and distinct legal entity from the City of Boise which encourages the funding and construction of regional infrastructure. That meeting is set up for both in-person and virtual attendees. TUESDAYS ON THE CREEKTuesdays on the Creek is here in downtown Caldwell at Indian Creek Plaza.Come enjoy music from local and touring artists and grub from one of the plaza's many eateries as the sun sets over the creek.It's also held in conjunction with Farm to Fork Market so you can shop from vendors while listening to great music.That's from 6 to 9 p.m. tonight and every Tuesday this summer. TUESDAYS ON THE CREEK Tuesdays on the Creek is here in downtown Caldwell at Indian Creek Plaza. Come enjoy music from local and touring artists and grub from one of the plaza's many eateries as the sun sets over the creek. It's also held in conjunction with Farm to Fork Market so you can shop from vendors while listening to great music. That's from 6 to 9 p.m. tonight and every Tuesday this summer. TUESDAYS ON THE CREEK Tuesdays on the Creek is here in downtown Caldwell at Indian Creek Plaza. Come enjoy music from local and touring artists and grub from one of the plaza's many eateries as the sun sets over the creek. It's also held in conjunction with Farm to Fork Market so you can shop from vendors while listening to great music. That's from 6 to 9 p.m. tonight and every Tuesday this summer. KID'S SUMMER ADVENTURESAnd in Meridian, the Kid's Summer Adventure Series at The Village.The event series started last week and every Tuesday from 10:30 a.m. to noon through July 29, there will be summer fun for the kids.From a Teddy Bear Clinic to a Wizard's Academy, each week offers activities, crafts and learning.Today's theme is Hero Training Camp. KID'S SUMMER ADVENTURES And in Meridian, the Kid's Summer Adventure Series at The Village. The event series started last week and every Tuesday from 10:30 a.m. to noon through July 29, there will be summer fun for the kids. From a Teddy Bear Clinic to a Wizard's Academy, each week offers activities, crafts and learning. Today's theme is Hero Training Camp. KID'S SUMMER ADVENTURES And in Meridian, the Kid's Summer Adventure Series at The Village. The event series started last week and every Tuesday from 10:30 a.m. to noon through July 29, there will be summer fun for the kids. From a Teddy Bear Clinic to a Wizard's Academy, each week offers activities, crafts and learning. Today's theme is Hero Training Camp. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **Boise 6 / Twin Falls 6, your new home for the Vegas Golden Knights** **Boise 6 / Twin Falls 6, your new home for the Vegas Golden Knights** News Money Sports Traffic Entertainment Community Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers KIVI FCC Public Files K27DX-D FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Idahonews6 Idahonews6 Idahonews6 UCV5KgNhOM87RJB7Fbv8C2CQ"}