{"id": 663, "name": "International Consortium of Investigative Journalists", "domain": "icij.org", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.icij.org/investigations/swazi-secrets/mysterious-memo-tying-zambian-ex-president-edgar-lungu-to-alleged-corruption-highlights-the-limits-of-financial-intelligence-units/", "title": "Mysterious Memo Tying Zambian Ex President Edgar Lungu To Alleged Corruption Highlights The Limits Of Financial Intelligence Units", "content": "InvestigationsChina TargetsCaspian CabalsPandora PapersCyprus ConfidentialPanama PapersMore Investigations Latest DataOffshore Leaks DatabaseMedical Devices DatabaseDatashare Journalists About ICIJAbout ICIJOur teamCorporateICIJ’s awardsMedia partnersOur supportersWork with us Leak to ICIJ Newsletter Donate InvestigationsChina TargetsCaspian CabalsPandora PapersCyprus ConfidentialPanama PapersMore Investigations Latest DataOffshore Leaks DatabaseMedical Devices DatabaseDatashare Journalists About ICIJAbout ICIJOur teamCorporateICIJ’s awardsMedia partnersOur supportersWork with us Leak to ICIJ Newsletter Donate Investigations Swazi Secrets **Mysterious memo tying Zambian ex-president Edgar Lungu to alleged corruption highlights the limits of financial intelligence units** Zambian investigators drafted a request in 2019 asking their counterparts in Eswatini for help investigating Lungu. Why wasn’t it sent until years later? On Dec. 6, 2021, Zambian financial crime investigators sent a confidential memo to their counterparts in Eswatini, the country formerly known as Swaziland. In it, the Zambian Financial Intelligence Centre (ZFIC) laid out serious allegations that the country’s former president, Edgar Lungu, had “accumulated wealth through corrupt activities.” The memo also raised concerns regarding Zambian-Swazi construction magnate Michelo Shakantu, 49, who is married to Pholile Dlamini-Shakantu, Eswatini’s minister of foreign affairs and former justice minister. A key allegation was that one of Shakantu’s companies, Inyatsi Road Construction, had “obtained a number of road construction contracts and in turn offered bribes in [the] form of land and monetary gifts to high profile individuals.” Lungu — who led Zambia from January 2015 to August 2021, when he was voted out amid accusations that his government was corrupt and increasingly authoritarian — was allegedly one of the beneficiaries of these gifts, the ZFIC noted, writing that in 2018, Shakantu bought a plot of land for Lungu at a luxury golf estate in Eswatini. While the contents of the memo were damning, the timing was suspicious. The memo was dated August 2019, when Lungu was in power, but it wasn’t submitted to the Eswatini Financial Intelligence Unit (EFIU) until December 2021 — more than three years after the allegations of the gifted land first surfaced and only after Lungu lost Zambia’s presidential election to opposition candidate Hakainde Hichilema. Hichilema, who’d spent four months in jail during Lungu’s term for what were widely believed to be trumped-up treason charges, won the presidency in a landslide after pledging to restore the rule of law and revive the economy. He also promised to clamp down on corruption that was believed to have spiraled out of control under Lungu. When he left office, Lungu, his Cabinet and his family were plagued by scandals, and Zambia — a landlocked country of roughly 20 million people — was Africa’s most indebted nation. The confidential memo is one of the many documents leaked from the EFIU as part of Swazi Secrets, an investigation into suspicious money flows in Eswatini.Distributed Denial of Secrets, a nonprofit devoted to publishing and archiving leaks, obtained the more than 890,000 documents from the EFIU and shared them with the International Consortium of Investigative Journalists and seven media partners. The EFIU is an independent body set up to identify and investigate complex financial crime. Like other such agencies, including the ZFIC in Zambia, it receives information from institutions like banks, and works with local and international organizations. The information collected and analyzed by the EFIU does not necessarily prove that illicit activity or a crime has taken place, but instead reflects the unit’s suspicions. Documents from the Swazi Secrets trove show that authorities in Eswatini — a tiny southern African kingdom nearly 1,000 miles from Zambia by road — flagged both Lungu and his “associate” Shakantu, with the EFIU stating it had “reasonable grounds to suspect that Michelo Shakantu and his associates are involved in illegal activities of which might have benefitted Dr. Lungu.” Recommended reading **How international gold dealers exploited a tiny African kingdom’s economic dream** **How international gold dealers exploited a tiny African kingdom’s economic dream** **Millions in suspicious transactions tie South Africa’s ruling party to a controversial Swazi archbishop, documents show** **Millions in suspicious transactions tie South Africa’s ruling party to a controversial Swazi archbishop, documents show** **Frequently asked questions about the Swazi Secrets investigation** **Frequently asked questions about the Swazi Secrets investigation** The leaked documents highlight the political constraints on entities like the EFIU and ZFIC — and the institutions they report to, like anti-corruption agencies and law enforcement. As a 2017 unpublished draft of the National Risk Assessment — a high-level Eswatini government review of the country’s exposure to money laundering — put it: “Even though safeguards exist in law, politicians may interfere with [financial crime] investigations. … Although [financial crime] investigators are well protected in terms of the legal framework, in practice they are not well protected against these political pressures.” **Presidential plot** Swazi media broke the news of the alleged gift of land in May 2018. The details were hazy, but they sparked a public outcry. One opposition politician appealed to Zambia’s top court for a ruling that Lungu — a lawyer and former military officer — violated an anti-corruption law in allegedly accepting the gift. The land was within the expansive Nkonyeni Residential Golf Estate, in the rural heart of Eswatini. Residential plots and houses of varying sizes there are available for well-off buyers. On its website, Nkonyeni boasts “stress-free living, within a secure estate — complete with nature trails, a health spa, and two world-class championship golf courses.” Local media reported that Lungu planned to build a $4 million two-story mansion there, raising questions in the news over who was funding the building. Designs for the mansion circulated widely on social media. In a startling admission at the time, Zambia’s then-information minister Dora Siliya told Zambian media that Eswatini’s king, Mswati III, had given the land for the planned residence as a gift to Lungu, adding that this was “normal” — that when the president travels, “various gifts are given in various forms, and in this case it was land that was given to the president.” The story took a twist when Swazi media reported that the property was in fact not owned by Lungu but held through a company owned by Shakantu, the construction magnate. Shakantu also allegedly held shares for Lungu in telecom company Swazi Mobile. But while the news was reported in May 2018, Zambian authorities were slow to act. The confidential ZFIC memo dated August 2019 linked the Nkonyeni property in Eswatini to the alleged bribes for construction contracts in Zambia, and cited media reports that the gifted land was one of 90 plots owned by lnyatsi Properties Ltd., another Shakantu company. The document, however, was emailed by a ZFIC employee to the EFIU on Dec. 6, 2021 — nearly four months after Lungu lost Zambia’s presidential election. The employee noted that the memo, which asked for help with the ZFIC’s investigation, could not be sent earlier “due to unforeseen circumstances” but did not mention what those circumstances were. Maurice Nyambe, executive director of Transparency International Zambia, an anti-corruption organization, told ICIJ that he suspects political interference was to blame for the delay, writing in an email that this “exemplifies the point about interference with state institutions.” The ZFIC’s board, Nyambe notes, is appointed by the president, “so the potential for the presidency to exert influence on the Board is extremely high, and it is inconceivable and even naïve to think that such a thing has never happened before.” The head of the ZFIC, Clement Kapalu, declined to respond to questions put to him by The Africa Report, one of ICIJ’s partners on the Swazi Secrets project. He told that publication that the ZFIC “does not discuss persons that are subject of enquiry except with competent authorities.” Lungu did not respond to questions sent to him in April via his foundation by ICIJ partner OpenSecrets. After the April 15 publication of Swazi Secrets, a Zambian government minister was cited in local media challenging Lungu to explain the funding for any investments he might have in Eswatini, including, presumably, the Nkonyeni property. In response, Lungu issued a statement on Facebook denying owning property in Eswatini. “During my official visit to Eswatini as Head of State in 2018, the King — His Majesty Mswati III — during exchange of gifts, offered me a plot on which he proposed I could build a house,” Lungu said in his statement. “The empty plot was in a gated golf estate and architectural drawings of the proposed house were prepared. I was extremely grateful for the offer from His Majesty, King Mswati III, but I chose not to take it up particularly after the hullabaloo in Zambia, alleging that the gift was not declared,” he said, referring to the 2018 media outcry. Lungu labeled the allegations against Shakantu an “attack” and “malicious.” **The ‘associate’** When the EFIU wrote back to the ZFIC in January 2022, a couple of months after it received the August 2019 memo, it said it had received information on “unusual and suspicious activities on the bank accounts of Michelo Shakantu, who is suspected to be an associate of Dr. Lungu.” Michelo Shakantu is a shareholder and executive chairman of the Inyatsi Group, which was originally established as a construction company and now has a diversified portfolio — including holdings in coal, insurance, telecommunications and other industries — across several African countries. He lives in Eswatini, where Inyatsi has gleaming offices in the commercial hub of Manzini. The company is a ubiquitous presence across the kingdom; its black-and-white buffalo logo is a common sight in ads, on branded vehicles and at construction sites, and Shakantu has been photographed alongside King Mswati at official events and ribbon-cutting ceremonies. “I am very happy with what Shakantu and his team are doing for the country as they collaborate with the government to provide massive support for the empowerment and improvement of the lives of emaSwati,” or the Swazi people, the king told the Eswatini Financial Times in March. Inyatsi was mentioned in a 2016 forensic report on corruption at a state-owned rail company — a report commissioned by South Africa’s National Treasury. It found that Inyatsi Construction Pty Ltd. benefited from a flawed procurement process. Shakantu also co-founded Swazi Mobile with Victor Gamedze, a controversial and highly influential businessman who was murdered in 2018. (Last year, a businessman and football club director was convicted of orchestrating the killing.) Gamedze married into the royal family and was said to be a close associate of the king. According to leaked documents, as of early 2022, the EFIU could not tie any Eswatini property or accounts directly to Lungu. The Nkonyeni property was not registered to Shakantu or his company, Inyatsi, either. However, the EFIU found that the Nkonyeni property was owned by the Link Trust, which the EFIU told its Zambian counterpart was “duly represented by Mr. Michelo Shakantu, which in a way links Dr Lungu to Mr. Shakantu, although the property is still not developed.” Eswatini’s real estate sector is a hotspot for cross-border money laundering due to an insufficient “regulatory framework,” as the country’s draft National Risk Assessment notes. In its report to Zambia’s ZFIC, the EFIU scrutinized Shakantu’s finances and the numerous accounts and companies it said were linked to him, noting that for some transactions it could not determine the “true source.” “The EFIU has also observed that Mr Shakantu, in some entities, is not the Director nor a shareholder or a signatory, but he is the one who funds those accounts.” The unit concluded, in rather vague language, that it “cannot rule out that the accounts of the subject and the identified entities might have been used to facilitate illegal transactions for purposes unknown to the EFIU.” The EFIU told its Zambian counterpart that it had shared this evidence with Swazi authorities in Eswatini and South Africa’s Financial Intelligence Centre. Leak to us Contact ICIJ **Do you have a story about corruption, fraud, or abuse of power?** **Stalled investigations?** It was not the first time Shakantu — or his wife — had appeared on the EFIU’s radar. In 2017, the year before Pholile Dlamini-Shakantu was appointed justice minister, the EFIU reported her to the Anti-Corruption Commission for a host of suspicious transactions. The EFIU noted the large volumes of cash payments moving through her accounts in the form of “frequent ATM cash payments, cheque and cash deposits and ATM cash transfers,” mostly from her husband. At the time she was an attorney and the deputy chairperson of the Elections and Boundaries Commission. The EFIU noted that “the manner in which all these transactions are conducted especially receipts of huge sums of money from her husband Michello [sic] Shakantu in structured amounts and then immediately disposing it to through [online banking] payments and cash withdrawals makes the SFIU to conclude that she could be involved in some sort of criminality bordering around corruption.” The EFIU also scrutinized a series of questionable transactions involving Swazi Mobile, which began operating in July 2017. One of those was an August 2017 payment of about $1.5 million that was split evenly between Michelo Shakantu and Gamedze, supposedly from Swazi Mobile profits. It was “highly unlikely” the company could have generated that amount given that it had become operational only the month before, the EFIU noted. Among other suspicious activity identified by the EFIU was a $3.8 million transaction split into three payments from the Swaziland National Provident Fund — which manages the retirement savings for all employed Eswatini nationals — ostensibly to buy shares from Swazi Mobile. The EFIU questioned why most of the money ended up in the personal accounts of Shakantu and his business partner, Gemedze — who both received more than $1.5 million — and not Swazi Mobile’s accounts. “We believe that the funds are being laundered and the claim of buying shares is a front to cover up an alleged illicit act,” the EFIU wrote. The unit also referred to allegations in the Zambian media that Shakantu had looted about $4.6 million meant to patch a road in that country. While the EFIU was “not certain” if the allegations were true, it did speculate that it “could possibly a source [sic] of some of the funds circulating in his personal accounts.” OpenSecrets asked Shakantu about the accusations of corruption and his alleged ties to Lungu, to which Inyatsi gave brief responses. The company denied any connection between the Inyatsi boss and Lungu, and said that allegations of Shakantu’s involvement in possible corruption were “not factual.” The EFIU pointed to evidence Shakantu was involved in illegal activities and was shuffling his money around in ways designed to conceal its origin, potentially benefiting the former head of state. But investigations appear to have hit a political obstacle. Minutes of a November 2018 meeting between officials of the EFIU and Eswatini’s Anti-Corruption Commission note that the ACC “still need to sit down and appraise the incoming Commissioner” of the matter because it touched on politically exposed persons (PEPs). The minutes note that “one of the parties involved” — Shakantu’s wife — “has been appointed as the Minister responsible for the institution doing the investigation.” She had also been appointed to head a parliamentary committee tasked with combating corruption, according to the minutes. In July 2022, a document providing an update on the progress of cases referred to the ACC was circulated within the EFIU. It noted that Shakantu and his associates were still “under active investigation” — 4½ years after the matter was first referred to the ACC. **Want to know when we publish?** Help us change the world. Get our stories by email. In Zambia, authorities have cracked down on the former president’s inner circle: In mid-2023, police arrested Lungu’s son and daughter-in-law over allegedly tainted cash and property worth roughly $5 million. Shortly before that, the state seized 20 properties it claimed were illegally obtained by the Lungu family. Last month, Lungu’s wife was arrested alongside one of her daughters in connection with several properties worth more than $2 million. A Zambian law enforcement agency suspected the properties were the proceeds of crime. Corruption “remains a dark stain on Edgar Lungu’s legacy as president,” Transparency International’s Nyambe told ICIJ. Lungu, who is still in Zambia, and his party, the Patriotic Front, told U.S.-based international broadcaster Voice of America that he is the target of “a political witch hunt” as he attempts a political comeback after his 2021 defeat. The former president claims he has faced police harassment after announcing his return to politics last October — a charge the Hichilema government denies. “I’m facing the consequences of returning to politics,” Lungu told the BBC in late May, “and I’m ready for it.” Contact reporter Our team **Micah Reddy** Reporter and Africa coordinator **Want to know when we publish?** Help us change the world. Get our stories by email. Latest from Swazi Secrets **In Eswatini, Africa’s last absolute monarchy, bucolic landscapes belie a darker underbelly** **Lawmakers signal crackdown on press freedom following Swazi Secrets** **Millions in suspicious transactions tie South Africa’s ruling party to a controversial Swazi archbishop, documents show** **Frequently asked questions about the Swazi Secrets investigation** Recent investigations MoreThe Panama PapersThe Implant FilesBribery Division **China Targets** **China Targets** **Caspian Cabals** **Caspian Cabals** **Swazi Secrets** **Swazi Secrets** 1730 Rhode Island Ave NW, Suite 317Washington, D.C. 20036 USA contact@icij.org Our team Our supporters ICIJ's Awards Corporate Work with us Journalists China Targets Caspian Cabals Swazi Secrets Cyprus Confidential Deforestation Inc. More investigations Offshore Leaks Database Datashare Newsletter ©2025— The International Consortium of Investigative Journalists.All rights reserved."}