{"id": 1890, "name": "Badger Institute", "domain": "badgerinstitute.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.badgerinstitute.org/taxpayers-spared-nearly-8-5-million-in-wisconsin-alone-due-to-trump-administration-order-cutting-aid-to-public-broadcasting/", "title": "Taxpayers Spared Nearly 8 5 Million In Wisconsin Alone Due To Trump Administration Order Cutting Aid To Public Broadcasting", "content": "Home IssuesTaxesEducationHousingCrime & JusticeSpending & AccountabilityEconomy & InfrastructureFederalismLicensingHealthcareChildcareMarijuanaEnergyCivil Society Taxes Education Housing Crime & Justice Spending & Accountability Economy & Infrastructure Federalism Licensing Healthcare Childcare Marijuana Energy Civil Society Taxes Education Housing Crime & Justice Spending & Accountability Economy & Infrastructure Federalism Licensing Healthcare Childcare Marijuana Energy Civil Society Mandate for Madison Research News & AnalysisNews & AnalysisViewpoints (Op-ed)By the NumbersFact SheetsMagazinesDiggingsWisconsin Interest News & Analysis Viewpoints (Op-ed) By the Numbers Fact Sheets MagazinesDiggingsWisconsin Interest Diggings Wisconsin Interest News & Analysis Viewpoints (Op-ed) By the Numbers Fact Sheets MagazinesDiggingsWisconsin Interest Diggings Wisconsin Interest Diggings Wisconsin Interest MediaBadger in the NewsPress ReleasesPodcastVideoAudioTestimony Badger in the News Press Releases Podcast Video Audio Testimony Badger in the News Press Releases Podcast Video Audio Testimony Events AboutOur MissionBoard of DirectorsTeamVisiting FellowsCareers Our Mission Board of Directors Team Visiting Fellows Careers Our Mission Board of Directors Team Visiting Fellows Careers Top Picks Donate Contact Us **Subscribe to Top Picks** Get the latest news and research from Badger Institute Δ At center of America’s essential debate, Johnson says resist spending frenzy Real answer to siting nuclear plants: ‘Yes, here.’ Taxpayers need more simplicity and transparency — not misleading arguments meant to stoke fears of successful choice schools Plans, zoning and annexation form front lines for Wisconsin cities looking to build more housing We increasingly live in a world of unsolved crime State should cut funding to public media Kewaunee power possibility adds to Wisconsin nuclear trend Taxpayers spared nearly $8.5 million in Wisconsin alone due to Trump administration order cutting aid to public broadcasting Donate Events Contact IssuesTaxesEducationHousingCrime & JusticeSpending & AccountabilityEconomy & InfrastructureFederalismLicensingHealthcareChildcareMarijuanaEnergyCivil Society Taxes Education Housing Crime & Justice Spending & Accountability Economy & Infrastructure Federalism Licensing Healthcare Childcare Marijuana Energy Civil Society Taxes Education Housing Crime & Justice Spending & Accountability Economy & Infrastructure Federalism Licensing Healthcare Childcare Marijuana Energy Civil Society Mandate for Madison Research News & AnalysisNews & AnalysisViewpoints (Op-ed)By the NumbersFact SheetsMagazinesDiggingsWisconsin Interest News & Analysis Viewpoints (Op-ed) By the Numbers Fact Sheets MagazinesDiggingsWisconsin Interest Diggings Wisconsin Interest News & Analysis Viewpoints (Op-ed) By the Numbers Fact Sheets MagazinesDiggingsWisconsin Interest Diggings Wisconsin Interest Diggings Wisconsin Interest MediaPress ReleasesBadger in the NewsPodcastVideoAudioTestimony Press Releases Badger in the News Podcast Video Audio Testimony Press Releases Badger in the News Podcast Video Audio Testimony AboutOur MissionBoard of DirectorsTeamVisiting FellowsCareers Our Mission Board of Directors Team Visiting Fellows Careers Our Mission Board of Directors Team Visiting Fellows Careers **Taxpayers spared nearly $8.5 million in Wisconsin alone due to Trump administration order cutting aid to public broadcasting** President Trump’s executive order to halt federal funding for public broadcasting will save taxpayers nearly $8.5 million annually in reduced federal outlays to public television and radio networks in Wisconsin alone. Republican leadership on the Wisconsin Joint Committee on Finance has said it will not support any attempt to replace those reductions in federal spending with state tax dollars. But so far — unlike what has happened in Indiana — there is no talk of cutting millions in existing state government funding that flows to the same entities. The Indiana General Assembly — an outlier so far — preceded Trump’s executive order last month when it removed all state funding for public broadcasting in the state’s two-year budget. In Wisconsin, in addition to federal funding, at least another $8.6 million on average in annual state appropriations flow to Wisconsin Public Media — a division of the University of Wisconsin-Madison that operates Wisconsin Public Radio and PBS Wisconsin, according to WPM financial documentation. That total does not include any state tax dollars that might flow directly to entities under WPM control or state money that might flow to other public radio and broadcast stations that are not under the WPM umbrella. Wisconsin Public Mediadoes not operate Milwaukee PBS or WUWM, the National Public Radio affiliate in Milwaukee. While the Joint Committee on Finance is in a holding pattern until the impact of the federal cuts becomes clearer, committee member Rep. Alex Dallman told the Badger Institute that state tax dollars won’t be filling any revenue gaps for public broadcasting in the state. Dallman (R-Markesan) said Republicans in the Legislature believe the president is correct to call out the bias in WPR and PBS Wisconsin news coverage. Those Republicans, however, have been frustrated by an inability to spur reform in any area of the UW System due to a budget process that gives lawmakers no line-item control over budgeting for entities like public broadcasting. “Even if we wanted to cut state funding for public broadcasting, we’ve found on other issues that the UW System just moves money around to cover for it. They find the money, so it’s a roundabout,” Dallman said. “I will say we won’t be adding any funding to make up for these federal cuts.” While Wisconsin Public Media does not publish an annual revenue total for all TV and radio affiliates in the state, that figure was at least $60 million in 2024. Somewhere between $24 million and $27 million — that is, 40 to 45 percent of that revenue — comes from donors and members. Federal and state tax dollars are another large source of revenue. Last year, fiscal 2024, the federal Corporation for Public Broadcasting made 16 grants totaling $8,498,812 to PBS Wisconsin, WPR and affiliates, according to a Badger Institute review of CPB records and the required financial statements made to CPB by the Wisconsin affiliates. In 2024, WHA in Madison, the hub of WPR and PBS Wisconsin, got federal CPB grants totaling $2,760,053, 13.2 percent of its $20.9 million of total revenue, according to its CPB filing. Milwaukee PBS, which is not part of PBS Wisconsin andis owned by the Milwaukee Area Technical Collegeinstead of the UW system, got grants totaling $2,057,510, or just under 14 percent of its total revenue for 2024. Some smaller, rural Wisconsin Public Radio affiliates in a network of 39 stations — 18 news and 21 music — are more heavily dependent on federal funding. WXPR in Rhinelander, for example, got nearly 20 percent of its revenue — $155,076 of $837,063 — from the CPB, according to its filing. By contrast, WUWM in Milwaukee, which isnot part of Wisconsin Public Radio, got just 6.2 percent, or $299,874, of its $4,809,467 revenue total from the CPB, according to its filing. Dallman criticized WPR and PBS Wisconsin forposting a warningthat the federal cuts could endanger the state’s emergency alert system, which is part of the larger public communications system. “Our focus is on the programming and what’s coming out of UW,” he said. “There is no willingness to go after the Communications Board or the infrastructure, towers and systems that are in place.” There will, however, be funding questions raised in the response to the federal cuts by WPR and PBS Wisconsin. Layoffs at WPR are expected sometime in June, but the scope of them isn’t clear, according tostatementsmade by Wisconsin Public Media officials to the Capital Times this week. “Now … we’re in a position to confirm that WPR will need to make staff reductions as we work toward a balanced budget,” WPR officials wrote in a staff-wide email that went out in March, the Capital Times reported. Trump’sorder“ending taxpayer subsidization of biased media” comes at a time when the Public Broadcasting Service and National Public Radio are bleeding viewers and listeners in Wisconsin and across the country. Layoffs and corporate restructuring at WPR were in the works months before Trump announced he was putting an end to more than $1 billion in grants paid through the CPB. Membership, donor, viewer and listener declines are outlined in the Communications Board’s budget request made months before the executive order. The number of weekly WPR listeners fell by more than 20 percent to 339,500 in 2024, or 86,700 fewer than the 426,200 in 2019, according to the budget document. And while WPR member revenue was up 18 percent during the same period, to $10.9 million in 2024, the board anticipates a drop of more than $1 million, or almost 10 percent, this year, the document says. The falloff in NPR listeners nationally has been going on for more than five years. A Pew Research Centerstudyof its 20 top stations showed a drop of eight million listeners in a single year, from 2021 to 2022. Radio Research Consortium’sanalysisof 46 public news radio stations last year found a decrease in listeners of 24 percent. In Indiana, the decision to cut all state funding for public broadcasting decreased revenue for the state’s network of 17 public television and radio stations by $3.67 million over two years, Mark Newman, executive director of the Indiana Public Broadcasting Service,told WFYI this week. WFYI is the PBS television station in Indianapolis. Mark Lisheron is the Managing Editor of the Badger Institute. Any use or reproduction of Badger Institute articles or photographs requires prior written permission. To request permission to post articles on a website or print copies for distribution, contact Badger Institute Marketing Director Matt Erdman atmatt@badgerinstitute.org. **Submit a comment** **Top Picks** Subscribe for the latest news and research from Badger Institute Δ Facebook Twitter YouTube LinkedIn The Badger Institute is a nonpartisan, not-for-profit institute established in 1987 working to engage and energize Wisconsinites and others in discussions and timely action on key public policy issues critical to the state’s future, growth and prosperity. **Sign up for Top Picks** Get the latest news and research from Badger Institute Δ Type above and pressEnterto search. PressEscto cancel. **Subscribe to our weekly email** All the latest news and analysis. Every Friday morning. You can modify your subscription preferences at any time by using the link found at the bottom of every email."}