{"id": 1250, "name": "Putnam County Record", "domain": "shawlocal.com/putnam-county-record", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.shawlocal.com/putnam-county-record/opinion/letters-to-the-editor/", "title": "Letters To The Editor", "content": "Sign in Subscribe Print Subscriber? Activate Now Manage Your Account Contact Log out Digital Account(Opens in new window) Print Account(Opens in new window) Contact Us eNewspaper(Opens in new window) Putnam County NewsLocal News(Opens in new window)Business Agriculture Local News(Opens in new window) Business Agriculture Local News(Opens in new window) Business Agriculture Records(Opens in new window) Prep Sports(Opens in new window) Putnam County OpinionColumns(Opens in new window)Letters to the Editor(Opens in new window) Columns(Opens in new window) Letters to the Editor(Opens in new window) Columns(Opens in new window) Letters to the Editor(Opens in new window) Photo Galleries(Opens in new window) Starved Rock Country(Opens in new window) Obituaries(Opens in new window) Jobs(Opens in new window) Classified(Opens in new window) Shaw Media Marketing(Opens in new window) Public Notices Deals(Opens in new window) Today's Ads(Opens in new window) Local Events(Opens in new window) Shaw Careers(Opens in new window) Historical Archive(Opens in new window) Privacy Policy **Letter: Granville Cemetery Association to honor America Reddick Oct. 21 in Granville** The Granville Cemetery Association is inviting the public to attend the commemoration, “Honoring America Reddick,” at 10:30 a.m. on Saturday, Oct. 21 at the Granville Cemetery, 502 W. Hennepin St. **Letter: Putnam County School District 535 seeks community input via survey** Letter to the Editor of the Putnam County Record from Putnam County School District #535 Superintendent Dr. Clayton Theisinger. **Letter: Putnam County Rotary continues its good work in the community** Letter to the Editor of the Putnam County Record from Debbie Buffington of the Putnam County Rotary. **Letter from Putnam County Rotary: Thank you for my year as president** Well, my year as Putnam County Rotary President is coming to an end and what a year it has been. **Letter from Putnam County Rotary: An open letter to prom parents** All parents want their kids to enjoy prom and stay safe. Rotary’s with you, again sponsoring the post-prom Afterglow so that our students can extend the enjoyment and excitement of their Prom night safely. **Letter from Putnam County Rotary: Putnam County Afterglow** Last year was our first year back after Covid and while attendance was low, prom-goers and students who attended had fun and won a record number of raffles and prizes. **Letter from Putnam County Rotary: Join us for Rotary Ag Night March 30** I am proud to be a Rotary member and I am excited to say that after a three-year hiatus due to covid we are once again hosting Rotary Ag Night. At 6 p.m. on Thursday, March 30 at PCHS, we will be celebrating the rich agricultural heritage of the county. **Letter from Putnam County Rotary: Soup for Seniors on Sunday Feb. 26** I hope to see you between 2 and 4 p.m. on Sunday Feb. 26 for ‘Soup for Seniors’ as we say thank you to all you very special county residents. **Letter from the Putnam County Rotary: This time of year can be lonely** Why did I pick loneliness to bring up this month? I know, shut up Deb, we don’t need to be reminded that we are alone and not going out or getting visitors. Well, this is where Rotary comes in. **Letter from Putnam County Rotary: Happy Holidays** **Letter from Putnam County Rotary: Happy Holidays** Can you believe the holiday season is here and the year is almost over? Soon, school will be out, Holiday tournaments will be in full swing for our athletes, the traveling to see family will begin, shopping, cooking, baking; so much to do. Can you believe the holiday season is here and the year is almost over? Soon, school will be out, Holiday tournaments will be in full swing for our athletes, the traveling to see family will begin, shopping, cooking, baking; so much to do. **Letter from Putnam County Rotary: A time to be thankful** **Letter from Putnam County Rotary: A time to be thankful** I thought with Thanksgiving being right around the corner, I would challenge all of you to also think of what you are grateful for. I thought with Thanksgiving being right around the corner, I would challenge all of you to also think of what you are grateful for. **Letter: Small Town, Big Gesture** **Letter: Small Town, Big Gesture** Letter to the editor of the Putnam County Record. Letter to the editor of the Putnam County Record. **Recent Articles** **Lauren Harbison named Tri-County Softball Player of the Year: NewsTribune sports briefs** **Lauren Harbison named Tri-County Softball Player of the Year: NewsTribune sports briefs** **Illinois turkey hunters have record spring harvest** **Illinois turkey hunters have record spring harvest** **Learn foil art June 12 at the Granville library** **Learn foil art June 12 at the Granville library** **Learn about abstract art June 11 at McNabb library** **Learn about abstract art June 11 at McNabb library** **Princeton’s Ian Morris, BV’s Landon Hulsing win discus state titles** **Princeton’s Ian Morris, BV’s Landon Hulsing win discus state titles** Copyright © 2023 Shaw Local News Network Copyright © 2023 Shaw Local News Network"}