{"id": 1880, "name": "Ami Magazine", "domain": "amimagazine.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://amimagazine.org/2023/06/27/putins-deadly-musicians-an-inside-look-at-the-wagner-group-a-secret-paramilitary-force-under-the-control-of-vladimir-putin/", "title": "Putins Deadly Musicians An Inside Look At The Wagner Group A Secret Paramilitary Force Under The Control Of Vladimir Putin", "content": "Advertise AMI Package SubscriptionsSubscribe NowRenew Subscription Subscribe Now Renew Subscription Subscribe Now Renew Subscription E-MagSubscribe to E-MagLogin to E-Mag Subscribe to E-Mag Login to E-Mag Subscribe to E-Mag Login to E-Mag Whisk ArchiveCover ArchiveRecent IssueMost PopularBusinessChinuch/ParentingHuman ExperienceIsraeli PoliticsMarriageMedicalPoliticsPoliticiansRabbis and GedolimTravel Cover Archive Recent Issue Most Popular Business Chinuch/Parenting Human Experience Israeli Politics Marriage Medical Politics Politicians Rabbis and Gedolim Travel Cover Archive Recent Issue Most Popular Business Chinuch/Parenting Human Experience Israeli Politics Marriage Medical Politics Politicians Rabbis and Gedolim Travel Press Submissions Media Kit Contact Us Privacy Policy Advertise AMI Package SubscriptionsSubscribe NowRenew Subscription Subscribe Now Renew Subscription Subscribe Now Renew Subscription E-MagSubscribe to E-MagLogin to E-Mag Subscribe to E-Mag Login to E-Mag Subscribe to E-Mag Login to E-Mag WhiskWhiskMexican Summer Treats // Agua de JamaicaWhiskSnack Smarter // Watermelon Mint PopsiclesWhiskSnack Smarter // Banana ShakeWhiskMexican Summer Treats // Agua de JamaicaWhiskMexican Summer Treats // Paletas de Fresa con Crema WhiskMexican Summer Treats // Agua de JamaicaWhiskSnack Smarter // Watermelon Mint PopsiclesWhiskSnack Smarter // Banana ShakeWhiskMexican Summer Treats // Agua de JamaicaWhiskMexican Summer Treats // Paletas de Fresa con Crema **Mexican Summer Treats // Agua de Jamaica** **Snack Smarter // Watermelon Mint Popsicles** **Snack Smarter // Banana Shake** **Mexican Summer Treats // Agua de Jamaica** **Mexican Summer Treats // Paletas de Fresa con Crema** WhiskMexican Summer Treats // Agua de JamaicaWhiskSnack Smarter // Watermelon Mint PopsiclesWhiskSnack Smarter // Banana ShakeWhiskMexican Summer Treats // Agua de JamaicaWhiskMexican Summer Treats // Paletas de Fresa con Crema **Mexican Summer Treats // Agua de Jamaica** **Snack Smarter // Watermelon Mint Popsicles** **Snack Smarter // Banana Shake** **Mexican Summer Treats // Agua de Jamaica** **Mexican Summer Treats // Paletas de Fresa con Crema** **Mexican Summer Treats // Agua de Jamaica** **Snack Smarter // Watermelon Mint Popsicles** **Snack Smarter // Banana Shake** **Mexican Summer Treats // Agua de Jamaica** **Mexican Summer Treats // Paletas de Fresa con Crema** ArchiveCover ArchiveRecent IssueMost PopularBusinessChinuch/ParentingHuman ExperienceIsraeli PoliticsMarriageMedicalPoliticsPoliticiansRabbis and GedolimTravel Cover Archive Recent Issue Most Popular Business Chinuch/Parenting Human Experience Israeli Politics Marriage Medical Politics Politicians Rabbis and Gedolim Travel Cover Archive Recent Issue Most Popular Business Chinuch/Parenting Human Experience Israeli Politics Marriage Medical Politics Politicians Rabbis and Gedolim Travel Press Ami **Putin’s Deadly Musicians // An inside look at the Wagner Group, a secret paramilitary force under the control of Vladimir Putin by Yosef Katz** The masked men in green uniforms were courteous but their appearance was ominous. They rode in armored personnel carriers, wore flak jackets and helmets and were well-armed, but bore no military insignia. No symbols, no ranks, nothing. They arrived in Ukraine right before Russia’s recent invasion, just as they had during the Russian takeover of the Crimean Peninsula in 2014 when Kiev ejected Ukraine’s pro-Russian president, Viktor Yanukovych, in favor of a pro-Western administration, igniting huge protests. Soon, heavily armed masked men in green began appearing on the streets of Crimea’s capital, Simferopol. Those who didn’t know called them the “little green men.”The green men teamed up with Russian separatists to take over key buildings in the city: warehouses storing ammunition, media outlets and other strategic locations. Although the men were harsh and unyielding, they gained a reputation for civility and courtesy, as they usually refrained from unprovoked violence, merely requesting politely that whoever was there leave. But once their work was done the Russian tanks rolled in, and the little green men disappeared.In early February little green men began appearing on the streets of Lugansk and Donetsk in Eastern UkraineThey were also seen in Kharkov. And according to Ukrainian intelligence, 400 men were sent to Kiev dressed in civilian clothes to permanently silence Ukrainian President Volodymyr Zelenskyy. Warnings of their activities led to Kiev being placed under curfew, and Ukrainian forces went from house to house looking for the infiltrators.In Russia, everyone knows not to talk about these men. Asking too many questions can make someone end up in a gutter of a deserted street, as has happened to journalists who are too nosy. But Ukrainian intelligence began to ask questions, and soon discovered that the little green men are members of an elite Russian force called the Wagner Group. Before the tanks roll inThe Wagner Group is a covert military organization that operates as the ancillary arm of Vladimir Putin. Its members are trained to use lethal force as needed, and their presence is the harbinger of official Russian military operations. In almost every part of the world that has a Russian military presence, Wagner operatives went there first, from Mali and Libya to Belarus, Georgia, Kazakhstan and Syria.A week before Ukraine was invaded, two journalists with The New York Times, Eric Schmitt and Michael Schmidt, reported that a large cohort of Wagner Group members were appearing in Eastern Ukraine, meaning that a Russian invasion was sure to follow. They were right.The Wagner Group is under the command of Russian-born Colonel Dmitry Utkin, a former commander of a special forces intelligence battalion. According to Ukrainian sources, Utkin is an admirer of the Third Reich and named the group after the anti-Semitic composer Richard Wagner. Its members are sometimes referred to as “musicians,” and their logo, when revealed, is a skull inside a red circle.The several thousand men making up the Wagner Group are based near Rostov-on-Don, not far from the Ukrainian border and close to a large Russian intelligence command center. According to various sources, the Wagner Group is a private organization of assassins for hire registered in Argentina with offices in St. Petersburg and Hong Kong, whose members are Russian and Serbian military veterans. In Russia, such hit squads are ostensibly illegal, but Utkin has very close ties with the Kremlin and has visited it on numerous occasions, several of which were events held in his honor.Oddly enough, the connection between these mercenaries and the highest levels of the Russian government lies in Vladimir Putin’s personal chef. From prison to the sausage standYevgeny “Zenya” Prigozhin was born into a dysfunctional family in a poor neighborhood of St. Petersburg. After his father passed away, his mother sank into grim poverty and soon followed her husband to the grave. Young Zenya was transferred from one orphanage to the next, until he ran away and joined a sports institution. There, he attached himself to ski instructor Shmuel Zarkoi Friedmanovitch, who had known his father. Friedmanovitch adopted the young orphan and taught him how to ski.To Shmuel’s dismay, Zenya soon joined a criminal gang and became a small-time pickpocket. He was eventually caught robbing a store, and when police raided his home they found loot from previous robberies. Zenya was sentenced to 11 years behind bars. Eight years later, the USSR dissolved and Zenya was granted a pardon amid the ensuing chaos.After Zenya was released from prison, several business opportunities presented themselves, and Friedmanovitch suggested that they become partners and open a sausage stand. These sausages were served with special home-made mustard. Business took off, and Zenya proved himself to be a capable businessman. The venture swiftly expanded to ten stands, which came with a whole new set of expenses. “I had to pay $100 to the local Mafia for each stand,” Zenya would recall. “But it was worth it.”A short while later, he met up with a former classmate from one of the orphanages he’d been in, Boris Spektor. Spektor offered Zenya a job running St. Petersburg’s very first network of food franchises, starting with a store called Contrast. Zenya made sure that it offered a wide selection of products, and customers came from all over the city. Over time, though, the chain declined. Competitors entered the market and profits fell.One of the branch’s managers invited Zenya to take a look at his warehouse, which was located on the first floor of the Old Customs House, a historic building in the heart of St. Petersburg. The building was rundown and neglected, but its beautiful white domed ceilings caught Zenya’s eye. “I have a room I don’t know what to do with,” the man admitted. In that instant, Zenya decided to become a restaurateur.A quarter million dollars of renovations later, the restaurant at the Old Customs House opened as a high-class establishment, the first of its kind in the city. “People were fed up with meatballs and vodka with lemon,” Zenya claimed. “They wanted something different, so we gave them prime cuts of meat.”At the time, St. Petersburg was home to many oligarchs who had made their fortunes by exploiting state assets, and Zenya knew how to give them what they were looking for. The restaurant quickly became popular among the wealthy as well as local officials. The governor of St. Petersburg, Vladimir Yakovlev, would host delegations there.Within five months, Zenya had paid off all loans and debts; by the end of the year, he made his first million dollars. He soon established another two successful high-end restaurants, as well as a catering company named Concord. Then came the trips to Paris.There, Zenya was drawn to the floating restaurants, in particular a certain boat that combined a fine dining experience with a tour of the Seine. Upon returning home, he bought a used boat and turned it into a luxury restaurant he called New Island. He set it afloat on the Neva River, which flows through the heart of St. Petersburg. It quickly became the favorite venue of the city’s financial and political elites. In 1999, the Russian prime minister dined at New Island together with the managing director of the International Monetary Fund, and he succeeded in persuading his French guest to authorize a $4.5 billion loan to Russia. Strongman and businessmanIn 2000, Russia’s newly elected president, Vladimir Putin, welcomed a very important European leader as his guest, French President Jacques Chirac. He hosted Chirac at the Winter Palace in St. Petersburg, the city of his birth, and one of Putin’s men suggested that he take his guest out to dinner at a place that offered gourmet French food combined with a cruise: New Island.Overwhelmed by such an honor, Zenya, still in his 30s, closed the restaurant for his important guests and served the meal himself, recounting events from the city’s history as they floated on the river. He also related some of his own past to the Russian president, and Putin found in him a kindred spirit. Beneath the expensive suit was a neighborhood tough who had risen from poverty by dint of his own efforts. He was favorably impressed.When President George W. Bush visited Russia to meet with Putin, the Russian president once again chose the floating restaurant as the venue to host his guest. A year later, Putin celebrated his birthday aboard New Island.As a former KGB officer, Putin is extremely cautious about everything he puts in his mouth, knowing full well the various uses of poison. He won’t eat in the home of anyone he doesn’t trust implicitly, and his security agents station themselves in the kitchen while his food is being prepared. Putin trusted Zenya to cook for him.The friendship developed until Zenya eventually became Putin’s personal chef, a job that included preparing all food served in the Kremlin and catering formal events. He joined Putin’s inner circle and became known as an amusing storyteller of cheerful tales, an unofficial court jester. Zenya was given permission to open the only private restaurant in the Russian Parliament building, giving him direct access to the entire Russian ruling class.Soon, Zenya’s catering firm, Concord, was signing state contracts worth hundreds of millions of dollars to provide meals for schoolchildren and government employees. Nonetheless, schools are not restaurants, and pupils and their parents repeatedly complained about the food, which wasn’t always fresh and sometimes tasted awful. In Moscow, protests were organized against using his catering company, especially after several outbreaks of food poisoning. In the end, however, Zenya was successful.Zenya built a huge two-billion-ruble factory for his catering company on the outskirts of St. Petersburg. A short time later, Putin’s motorcade turned up. Only Putin was permitted to enter the building without donning overalls. When they arrived at the food inspection area, Putin pointed to a container. “What is that, soup or something else?”“Borscht,” Zenya replied. He pointed to another container, “That’s porridge. Would you like to try some?”“Later,” promised Putin, nodding to his companion. “It’s great. You can feed hospitals, schoolchildren and prisoners, so why not the army as well?”Like most countries, the Russian military was accustomed to preparing its own food for the troops. Recruits were trained to become cooks, and soldiers peeled potatoes. Overnight, the policy changed with the Defense Ministry’s decision to outsource food provision. Dozens of catering companies entered the field. Concord submitted a tender, and in spectacular fashion, won almost all the contracts.With his company making billions of rubles a year, Zenya moved into a huge estate in St. Petersburg, which included a basketball court and helicopter pad. He also purchased a private plane and yacht. At present, his net worth is calculated to be in the hundreds of millions of dollars. He also owns a beautiful estate on the Black Sea, where Putin and his friends like to stay.Zenya has made significant donations to Putin and also established a pro-Kremlin media organization called Patriot, whose mission is “to draw attention to all the good things that are happening in the country and not to criticize the glorious czar.” Articles by Patriot are sharp in their criticism of the opposition and not above slander, which often leads to the arrest of the unfortunate victim. Patriot’s reach also extends over the border into Ukraine, where Zenya set up a new media arm in Kharkov to espouse pro-Russian sentiments.Zenya works on other projects for Putin too. The Kremlin youth organization, Nashi, raises young people to adulate the new czar. He also established a youth camp for the movement near St. Petersburg, where its young members are taught advanced computer skills, including hacking. Of course, Concord supplies the food. Returning favorsFast-forward to 2016. In the United States, the battle for the presidency was heating up between Democrat Hillary Clinton and Republican Donald Trump. In the wake of her stint as secretary of state under President Obama, during which she tried to meddle in Russian affairs and arrogantly criticized his regime, Putin had an extreme dislike of Hillary Clinton.In the runup to the elections, many fake social media accounts began appearing and attacking Clinton, encouraging voters to abandon her for Trump. The Democratic National Convention’s computers and private email account of John Podesta, who headed Clinton’s campaign, were hacked and leaked.Even before Clinton lost the election, US law enforcement agencies opened investigations into who was behind these covert activities. Digital footprints eventually led to a “troll farm,” the youth camp set up by Zenya near St. Petersburg.Officially known as the Internet Research Agency, it works closely with Russian intelligence. Promising young students, who are paid for their work, are instructed to hack into social media accounts and use them to spread disinformation. Prior to the US presidential election, the troll farm was being used to infiltrate social media networks in Ukraine and Crimea to enhance Russian influence and encourage separatists.The results of this new investigation, however, marked the first time that Putin’s chef appeared on American radar screens. As a result of recommendations in the report compiled by special adviser Robert Mueller, sanctions were placed on Zenya, and many individuals and companies in the US were banned from doing business with him or even providing services for his planes or yacht. Zenya dismissed the accusations, saying, “The Americans are very gullible people. They see only what they want to see… If they want to see me as the devil, let them see it.”Despite the sanctions, the troll farm continues to operate, advancing Russian objectives on matters of domestic and foreign policy.Recently, Facebook uncovered a number of Russian accounts whose purpose was to covertly influence events in central Africa and Libya. According to a BBC documentary, the network was actively trying to influence the elections in Madagascar. Zenya rejected the accusation, claiming that “American media giants are addicted to public relations for their own benefit.”Over the last few months, the troll farm has turned its attention to Ukraine, attacking government websites and planting misinformation.“He’s not afraid of shady business,” Lyubov Sobol, founder of the Anti-Corruption Foundation told The New York Times. “He is capable of executing any task on behalf of Putin, from attacking his political opponents to operating trolls to sending fighters into battle.” Army foodZenya’s operation providing rations for the Russian army along with his connections to Putin gave birth to a new initiative in 2014 that was part military, part business—the Wagner Group—thereby completing a Russian trifecta; journalism, networking and military force.In all probability, the group of “musicians” began as just another way to make money. Utkin, who had served for a while as Zenya’s private bodyguard, was charged with building up a force of Russian mercenaries available for hire to regimes around the world.Unsurprisingly, the Wagner Group quickly morphed into a paramilitary organization with links to Russian intelligence. The group has a nationalistic code of behavior obligating its members to protect Russian interests at all times and in all places; uphold the honor of Russian soldiers; fight for victory at any price; and keep operations absolutely secret. The group has become Putin’s private army, run by Zenya and equipped with the most advanced weapons and ammunition. Soldiers are deployed to particularly complex and difficult combat zones, while officially avoiding any Russian involvement.Only ex-paratrooper or ex-special forces soldiers who have undergone advanced training and graduated from one of the most arduous regimens in the world are accepted, making the members of the Wagner Group the best in the Russian Federation. They are paid the equivalent of $5,000 a month, with an officer receiving double. Families of fallen soldiers receive $60,000. Its training camp is officially classified as a training camp for children.“They have no uniforms and the Russian government officially denies that they are part of the Russian army,” explained Dmitry Simms, president of the Center for the National Interest, an American research institute. “This is how Putin manages to wage war in Ukraine and simultaneously deny that Russian forces are operating in the Crimean Peninsula.” The Ukrainian panicAfter war broke out in the Donbass region of Eastern Ukraine on a clear day in the middle of the summer of 2014, Ukrainian Defense Minister Mykhailo Koval was optimistic. The densely-populated area is the country’s industrial heartland, home to a large coal-mining industry as well as metalworks that produce 30% of Ukraine’s exports. The rebels seized control of several administrative centers in Lugansk—bullets were exchanged in another city, Donetsk —but Ukraine was succeeding in counterattacks.Koval had recruited a huge number of forces and commenced a military operation against the “war of terror.” The separatists were pushed back and the Russians were prevented from intervening. After all, Putin wanted to portray this as an internal uprising of pro-Russian Ukrainians freely choosing closer ties with Russia.On June 14, well-armed elite forces were due to land at a strategic airport 20 kilometers south of Lugansk to help Koval conquer the city. Three Ilyushin Il-76 transport aircraft loaded with special forces, armored vehicles and military equipment took off that evening from Dnipro in northern Ukraine. The first plane landed safely with great fanfare, but as the second plane approached the runway, there was a sharp flash of light followed by a loud boom. Fire burst from one of the plane’s wings, close to the engine. The plane went up in flames and plunged to the ground. The pilots of the third plane turned around in panic.Four paratroopers and nine crew members were killed; the plane was reduced to charred fragments. The attack threw Ukraine’s military into confusion, and a nationwide day of mourning was declared.In the wake of the attack, all flights to the airport in Lugansk ceased. A search of the area turned up fragments of two Russian-made, shoulder-fired missiles. The Ukrainian army soon learned that the Wagner Group was responsible and that Utkin had given the order to fire.The shape of the war shifted. Although composed of just a few thousand men, the highly trained Wagner Group tipped the scales. They captured the airport, seized control of Lugansk and gained air control over the entire Donbass region.(Tragically, they also downed a Malaysia Airlines plane on its way from Amsterdam to Kuala Lumpur, around 40 kilometers from the Russian border. Two hundred ninety-eight passengers and crew were killed and the incident gained international attention. Vladimir Putin argued that Ukraine was responsible, but an investigation revealed that the plane had been hit by a Russian Buk missile.)The little green men fought with the separatists and succeeded in surrounding Ukrainian soldiers in a number of areas, most prominently in Ilovaisk, where thousands were either killed or captured.The decisive battle took place 50 kilometers northeast of Donetsk in Debletza, where some 8,000 Ukrainian soldiers were subjected to one of the heaviest artillery barrages in history. The battle ended with the Ukrainians defeated and humiliated. Thousands surrendered.After this dramatic victory, the “musicians” carried out a number of special operations to assassinate key Ukrainian military figures to ensure lasting defeat. This marked the end of Ukrainian attempts to restore control of the Donbass region. The separatists won, and the ceasefire installed them in power. They announced their independence and started negotiating with the Ukrainian government for their rights.“Over time,” testified Ukrainian intelligence officer Igor Sovisky, “members of the Wagner Group maintained their presence in the region. True, they didn’t number more than a few dozen men during most of this period, but they still managed to assassinate anyone the Russian regime disapproved of in the areas they controlled.”Meanwhile, the two other arms of Zenya’s activities continued to work inside Ukraine to bolster pro-Russian elements and undermine its pro-Western government. After having success in Eastern Ukraine, Putin sensed an American weakness and a rare opportunity in the Middle East. The Wagner Group was given a new mission: Syria. The great defeatThe ancient city of Palmyra is set in a beautiful oasis in the Syrian desert, 200 kilometers north of Damascus. It was established thousands of years ago and flourished until 2015, when its glory days ended with the Islamic State (ISIS) takeover. Hundreds of opponents of ISIS were beheaded, historic buildings were destroyed, and the city became a terrorist base.ISIS’ rule extended over Syria and Iraq, an area that includes vast and valuable oilfields. Its black flag became synonymous with death. The Syrian regime’s army was incapable of posing effective resistance to the cruel fanatics who were threatening to take over Damascus.One morning in the summer of 2016, a convoy of armored vehicles arrived from the south. Men in green stormed the city, cutting down ISIS fighters who would revert to suicidal tactics like speeding towards the enemy in vehicles loaded with explosives. Ultimately, however, the “musicians” triumphed, giving Russia its first foothold in the Middle East, right on the border with Israel. Russia returns to the Middle EastThe USSR had been an influential player in the Middle East for years. The area is rich in natural resources, often unstable, with a glut of oil to sell and customers hungry for military equipment. Through its support of Arab nations, especially Egypt, the Soviets became important in the region. Then the political skills of the legendary US Secretary of State Henry Kissinger after the Yom Kippur War, followed by the disintegration of the USSR, pushed the Russians to the sidelines for several decades.When civil war broke out in Syria, Vladimir Putin spotted the opening he was looking for to reestablish Russian influence in the region. With the Arab Spring and the first stirrings of opposition to Bashar Assad, the Obama administration tried to pressure the Syrian president to resign. Putin offered Assad military assistance in exchange for Russian airbases in Latakia and a naval base in Tarsus. He also lent air support to fight alongside Assad’s forces in Syria.Russian pilots strafed rebel strongholds, but aerial supremacy wasn’t enough in a war sending hundreds of soldiers home in coffins. Cue the “musicians.” Zenya was willing to protect the regime and expel ISIS, but he wanted a 25% cut of the profits from each oilfield they liberated. Assad happily agreed.Hundreds of the Wagner Group’s fighters in the Donbass region packed their bags, armored personnel carriers and tanks, and headed to Syria.“We were the ones who bore the brunt of the fighting,” Dmitry, a veteran of the Group, told Sky News of the fight for Palmyra. “We were cannon fodder… We had two intelligence units, an air defense unit, two attacking forces and infantry forces, as well as heavy artillery, tanks and so forth. We fought hard and chalked up achievements, and the regular Syrian army, made up in large part of frightened chickens, went in after us and finished things up.” The official Russian death count in Palmyra is only 19 but it isn’t the real number.“Around 600 soldiers were killed, but no one will ever admit it,” another veteran relayed. “That was the most frightening aspect. Sometimes the soldiers’ bodies were charred, but the papers would say they were ‘missing.’ Other times, the official records stated that a soldier had been killed in Donbass or had died in a car accident. Not all of the soldiers were buried properly; sometimes they simply dug a hole. It depended on how the commanders felt about that particular soldier.”Some say that close to 6,000 Wagner men fought in Syria. Aided by Russian air power, they regained control over a large part of the country, leading the attacks on ISIS positions.“The situation reminded me of reserve duty in Israel, with the addition of lots of vodka,” was how an Israeli of Russian origin described his stint leading a unit of the Wagner Group. “A tour of duty lasts four months, and a soldier who succeeds in completing it receives a bonus of three months’ salary. A mercenary in a commanding position can receive double that of a regular fighter. But many of them were killed.“These are the guys who do Russia’s dirty work,” he added. “We trained them to use all kinds of weapons that no one would otherwise be able to get his hands on regardless of his connections. Weapons like that can only be found in the hands of those who have government authorization.”In Syria, the Wagner Group also trained a special volunteer unit to fight alongside them called the Fifth Assault Corps, who were known as ISIS-hunters.These fighters were famous for their brutality, and shortly after the conquest of Palmyra, a video was leaked showing their cruel treatment of a man they mistakenly believed to be an ISIS fighter. Muhammad “Hamadi” Abdallah al-Ismail had fled Syria during the Lebanon War and only returned in 2017, whereupon he was arrested and forcibly drafted into the Syrian army. He deserted, but was captured by the Fifth Assault Corps and murdered.The Wagner Group fought ISIS for two long months, helping Syria conquer Aleppo, Homs and the area around Damascus, including a fierce battle for the Yarmouk refugee camp.Afterwards, the Israelis asked the Russians for help in locating the body of missing IDF soldier Zachary Baumel. The Russians complied, and with the support of the Syrian army, exhumed the body from the camp’s cemetery. Israeli Prime Minister Binyamin Netanyahu flew to Russia and participated in a ceremony attended by General Valery Gerasimov, the Russian army’s chief of staff. At the event, the Russians returned Baumel’s overalls and shoes, and Putin bragged that “the Russian army had helped to return the body.”When Dmitry returned to Moscow after his mission was complete, he ran into a little hiccup. Upon joining the Wagner Group, he’d handed over his identity papers, necessary for daily life in Russia, to the Group’s commanders.“When I got home,” he related, “I traveled to the Wagner training base to retrieve my papers. On the way, police stopped me, and as I didn’t have any papers, I explained that I was a hired member of the Wagner Group and that they had taken my papers. He replied, ‘Cut the garbage. Wagner doesn’t exist.’” The captives of Deir ez-ZorThe region of Deir ez-Zor extends over northeastern Syria on the border with Iraq. The Euphrates River runs through it, and the city of Deir ez-Zor, home to 200,000 residents, is located on its banks. Ever since large oil deposits were discovered there, it became an industrial distribution center for the entire country. But due to its proximity to the border, it was one of the first areas to fall to ISIS.The Wagner Group, along with the ISIS-hunters, fought stubbornly to regain the region. In the ISIS stronghold of Deir ez-Zor, vicious battles broke out on the streets. Two members of the Wagner Group were captured and ISIS announced that they would be killed.The incident caused a furor in Russia but the Kremlin claimed it didn’t “know of any Russian soldier who had been captured. Russian armed forces in the Arab Republic of Syria are all safe and well and are fulfilling their designated missions.”The ISIS-hunters, however, announced that they were prepared to pay $1 million for each released soldier; otherwise, they would kill 100 ISIS captives for each dead Russian. The Russians soon succeeded in trapping the Jihadists and demanded the release of the captives during negotiations with the besieged gunmen. The two soldiers were ultimately murdered by ISIS. The Russian public was indifferent to their fate, convinced that the two men were only well-paid mercenaries.After a prolonged siege, ISIS was finally driven out and the area south of the Euphrates came under Syrian control.Meanwhile, north of the river, the Syrian Democratic Forces under Kurdish leadership, together with massive air and ground support from the US Army, succeeded in driving ISIS out of the entire Deir ez-Zor region. An agreement emerged designating the area north of the river to the Americans and their Kurdish allies, and the area south of it to the Russians and Assad.After most of the rebels were driven out, Russia declared victory and announced plans to withdraw some of its troops from Syria. The Wagner Group remained to safeguard its achievements and continue fighting ISIS cells still in operation. The lethal musicians had proven their worth many times, but their founder was about to make a big mistake. Zenya had become too greedy. A resounding defeatSeveral dozen kilometers north of Deir ez-Zor is the huge oilfield of Coneco, conquered at great cost by the Kurds with American assistance.One fine afternoon in the summer of 2018, American intelligence operatives spotted something strange: a large convergence of forces not far from the river and the dividing line between northern and southern Deir ez-Zor. These soldiers, transmitting in Russian, revealed plans to head for the Coneco oilfield after it was dark. Senior American commanders contacted their Russian counterparts and demanded an explanation, threatening that the attacking force would be totally destroyed if it tried to seize the oilfield. The Russians insisted they had no idea what the Americans were talking about, as they had no forces operating in the area.But the Wagner Group did. Frustrated that the Russian share of Deir ez-Zor didn’t include oil, Zenya wanted compensation for having endured such heavy losses. He ordered his forces to take the field, sending 500 fighters accompanied by 27 tanks and armored vehicles to fight the 30 or so Americans and their allies.Reports and photographs were immediately transmitted to the Pentagon and the American air base in Al-Udeid, Qatar. Senior Pentagon staff and officers on the Qatar base put all aerial forces in the region on high alert as President Trump ordered that the oilfield be defended with all force necessary. Reinforcements were sent in the form of 16 Green Berets with anti-tank vehicles and night-vision equipment. That night, Russian tanks approached and fired mortars.US military aircraft, B-52 bombers, fighter planes and Apache helicopters soon arrived on the scene and bombed the attackers. American soldiers on the ground fired anti-tank missiles and the Delta Force joined the fray. Within a short time, the Russians retreated. One Syrian soldier was dead, while 300 Russian fighters were killed and simply left behind.The extent of the defeat was kept quiet. The Americans had delivered a humiliating blow, but President Trump had no interest in causing a diplomatic rift. Everyone wanted the incident hushed up.A few days later, reports started to appear in the foreign media about the Wagner Group’s heavy losses. The American media picked up the stories, even though they had no official confirmation of what sounded like exaggerations. After a few weeks passed and many more reports emerged, Russia admitted that there had been “dozens” of fatalities while continuing to insist that “there was no involvement of Russian security forces and no Russian military equipment was used.”“The Russian cover-up was conspicuous,” wrote journalist Felix Gerzman. “The families of the slain soldiers were threatened that they wouldn’t receive compensation if they spoke out. The silencing apparatus went into action and the furor died down. Russia couldn’t admit to a defeat of this magnitude. Hundreds of invincible Russians being killed was something their minds couldn’t grasp.”But Russian reporter Maksim Borodin was stubborn. He interviewed relatives of members of the Wagner Group and participated in the funerals. A short time later, Borodin called a friend at 5:00 in the morning to say that there was “someone with a weapon on my balcony and masked men on the stairs.” The following day he was found unconscious, having ostensibly fallen from the fifth floor. He was taken to the hospital, where he succumbed to his injuries.This was the last time that the Wagner Group fought in areas under American control during Trump’s term in office. Africa, a new frontierThe victory that the Wagner Group handed to Assad, along with the influence it brought Putin, whetted his appetite. So Putin turned his sights to a place where civil war was exacting a huge price in blood: Libya, home to the tenth-largest oil reserves in the world.After the fall of Muammar Gaddafi, the North African country had split between two rival leaders fighting for control, all complicated by the presence of local ISIS forces. In the west, the city of Tripoli was the center of operations for the Transitional National Council led by Mustafa Abdul Jalil, which was recognized by the United Nations. In the east, General Khalifa Haftar ruled from Tobruk. As expected, the Russians chose the side opposed by the West, and musicians were deployed to assist General Haftar. Around a year ago, a ceasefire agreement was signed between the two sides.Having gained a foothold in North Africa, Putin hosted dozens of African leaders at his vacation home in Sochi on the Black Sea, speaking to them of his ambition to revive the close ties between Moscow and the African states that had existed in the heyday of the USSR.Putin’s usual method of gaining influence was to seek out countries torn by bitter rivalries and pick a side. The first signs of Russian meddling began with Zenya’s cyber unit taking an interest in central Africa. The Wagner Group was soon sent to help the Sudanese regime in its war against ISIS. The regime eventually fell to a Sudanese army general, Abdel Fattah al-Burhan, who imposed military rule on the country to the displeasure of the US. Needless to say, Putin decided to back him.Next, Putin stuck his nose into the internal politics of the Central African Republic, where he supported a local dictator and trained his army.With each new operation, the Wagner Group grew in size and influence. A special heavily armed vehicle was built for Zenya and was nicknamed the “Wagner carriage.” The vehicle made an increasing number of appearances in Africa, including in Mali.For many years, this country in West Africa had been under the control of France and was known as French Sudan. But after years of stability, its democratic government was overthrown and a military junta assumed power, much to the chagrin of the West. Putin leaped at the opportunity to repeat his success in Syria, sending in the little green men to support the dictatorship—all for the price of a portion of revenue from the sale of natural resources like diamonds and minerals.French President Emmanuel Macron was furious and condemned Putin’s actions. “Russia should be encouraging responsible and constructive behavior in the region,” he said. “This will only worsen the security situation as well as the human rights situation in Mali, and also threatens the peace agreement.” Jean Ives La Drian, the French foreign minister, also accused Russia of plundering Mali.Putin claimed he had no idea what the trouble was. This was a simple matter of a private company of hired mercenaries, and it had nothing to do with him.The European Union and the US were unconvinced and imposed sanctions on the commanders of the group, as well as on Zenya. A team of three Russian photojournalists in central Africa were shot and killed, presumably by the Wagner Group. The big stingIn the summer of 2021, things were heating up in Minsk, the capital of Belarus. Presidential elections were being held, and the country’s paranoid dictator, Alexander Lukashenko put his security forces on high alert.In the course of those tense days, a raid was conducted in Minsk that discovered 33 fighters who shouldn’t have been there, members of the Wagner Group. They were arrested and charged with attempting to destabilize the country. “Putin is trying to meddle in our elections just as he has tried to meddle in other countries’ elections in the past,” Lukashenko fumed. Relations between the two countries grew taut.For Ukraine, this was a golden opportunity to settle the score with the Wagner Group after Crimea. The moment they learned of the arrests, the Ukrainians asked their furious neighbor to extradite the captives, detailing the weighty accusations against them that included war crimes in the Donbass region.The Belarussians were ready to transfer them, but just as the negotiations were about to reach their conclusion, Belarus suddenly cut off contact with Ukraine. The prisoners were released a short while later.Some months ago, a man named Sergei Petrovitch, a member of the Russian secret service with close ties to the Wagner Group, sent an email to its members with a proposal for a new mission: the protection of the oilfields owned by RussNeft, one of Russia’s largest oil companies. He offered an enticing $3,200 monthly salary. One of the many applicants was Artiom Milayev, known as Shaman, a Chechen whose reputation as an assassin preceded him. He’d acquired military experience fighting in Chechnya with the Wagner Group, and later in Ukraine and Syria. He suggested to Petrovitch that he assemble a team with specialized experience as snipers who were skilled at bringing down planes. Petrovitch accepted his suggestion with delight.The only problem was that “Petrovitch” didn’t exist. He was a fiction of Ukrainian intelligence in an attempt to get its hands on the Wagner criminals. The objective was to recruit its members for an international mission, then get them on a plane that would land in Ukraine and arrest them.Over 180 mercenaries signed on, all of whom were linked to crimes committed in Ukraine. Shaman assembled the team in Moscow, where they waited for their supposed flight to RussNeft’s oilfields in Venezuela. The operation goes wrongThe coronavirus messed things up first. Russian airports were locked down and very few flights still flew to Europe. The only option was to drive from Russia to Minsk and fly from there to Istanbul, a flight that would take the mercenaries over Ukraine. A Ukrainian agent was supposed to call the airline company after takeoff and claim he’d heard two of the passengers in a café at the airport discussing how they had hidden a bomb in the plane’s cargo. Emergency regulations would demand that the plane land, on a landing strip near Odessa, where special forces would be waiting to arrest the musicians.The plane tickets were purchased and the mercenaries traveled to the border. Because of the coronavirus, people were only allowed to enter and remain in the country for any length of time for medical treatment, to conduct business, or to work in Belarus. Shaman, with the aid of “Petrovitch,” obtained fake job contracts with a Belarussian company for his group. Everything seemed to be proceeding nicely.Only the day before, Ukrainian President Zelenskyy had reached an agreement for a ceasefire in the Donbass region, which was awaiting the signatures of the Russians, French and Germans. The Ukrainians were concerned that if the sting operation went forward, the ceasefire would be dead on arrival, so the operation was postponed for two days in the hope that the agreement would be signed.However, when the bus carrying the mercenaries entered Belarus, the atmosphere was tense due to the upcoming elections. President Lukashenko was suspicious of everyone, from Western countries to his sole ally, the Kremlin. He expressed his concerns to the media that outside forces might attempt to foment a popular uprising—using professional soldiers and trained mercenaries—as a provocation.After crossing the border, Shaman was informed that the operation had been temporarily postponed, and the bus was diverted to a three-star hotel in Minsk, where a travel agent had booked rooms for them. Unbeknownst to the musicians, however, despite their disguises, the distinctly military group had aroused the suspicions of the local KGB, who decided to monitor their movements. They discovered that the men were members of the Wagner Group who had entered Belarus without the coordination of the authorities. They also discovered that the job contracts were fake. Just before dawn, a KGB team raided the hotel in Minsk and arrested them.Under interrogation, Shaman explained that they were members of the Wagner Group who were on their way to Venezuela. The investigators mocked his excuse. “Who exactly ordered this mission?” they asked. Shaman calmly replied, “Someone from the Russian Defense Ministry, as usual.”The local KGB didn’t believe a word. The Wagner Group had been in town before, but they had always been sent a heads-up prior to arrival. Lukashenko was certain that Putin was trying to meddle in his affairs.In Russia, the government was shocked by the arrests and the accusations being leveled against Putin, as the Kremlin genuinely had no idea what members of the Wagner Group were doing in Minsk. The Russian authorities were unsure how to proceed, the Belarussians were furious, and the Ukrainians scrambled to get the men transferred. The Russians eventually managed to locate the Ukrainian behind the mission, and the next day, Putin called Lukashenko and explained the Ukrainian ruse. He was not immediately convinced.Once the elections were over, mass demonstrations broke out and people across the country were arrested for protesting what they believed was a rigged election. Putin immediately stepped in with an offer to provide assistance to Lukashenko, and the Russian attorney general soon announced that the prisoners were back on Russian soil. The failed operation severely damaged the diplomatic relations between Ukraine and Belarus.Meanwhile, back in Russia, Putin vowed to get revenge. It was time to recall the little green men from Africa to get back to work in Ukraine. ● To read more, subscribe to Ami TAGS Thisweek tweet **Being There // Rabbi Sruli Fried talks about how to “be there” for others in times of need** **Musk vs. Trump** **Shloime (Sol) Friedman // QUE Fence** **Boundless Chesed // For thousands of Eretz Yisrael’s poor, Reb Efroyim Stern is a veritable lifeline** **Cream of Chicken Soup** **Pear Cranberry Gingersnap Crumble** **The Unusual Journey of Hadassah Teitelbaum // A member of the Hilltop...** **Hang in There, Young Mommies // It does get easier!** **Sweeping Generalizations // Was my teenage daughter finally ready to grow up?** Submissions Media Kit Contact Us Privacy Policy **I Expected to Die from Coronavirus: Eli Beer’s Remarkable Story** **Joseph (Joe) Popack // Dira Realty**"}