{"id": 1522, "name": "Pioneer Valley Advocate", "domain": "valleyadvocate.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://valleyadvocate.com/2025/05/15/holy-smokes-theatre-lands-in-the-valley-newly-relocated-theater-company-to-stage-queer-erotic-horror-comedy-at-easthamptons-cityspace-this-weekend/", "title": "Holy Smokes Theatre Lands In The Valley Newly Relocated Theater Company To Stage Queer Erotic Horror Comedy At Easthamptons Cityspace This Weekend", "content": "News Podcasts EventsCalendarSubmit Event Calendar Submit Event Calendar Submit Event Arts & MusicSessionsBasementalValley Show GirlFilmCinemadopeStream QueenBlaise’s Bad Movie Guide Sessions Basemental Valley Show Girl FilmCinemadopeStream QueenBlaise’s Bad Movie Guide Cinemadope Stream Queen Blaise’s Bad Movie Guide Sessions Basemental Valley Show Girl FilmCinemadopeStream QueenBlaise’s Bad Movie Guide Cinemadope Stream Queen Blaise’s Bad Movie Guide Cinemadope Stream Queen Blaise’s Bad Movie Guide ColumnsO Cannabis!StagestruckThe V-SpotThe Beerhunter O Cannabis! Stagestruck The V-Spot The Beerhunter O Cannabis! Stagestruck The V-Spot The Beerhunter About UsMeet the StaffContact UsNewsletterSpecial SectionsWhere to find the Advocate in print Meet the Staff Contact Us Newsletter Special Sections Where to find the Advocate in print Meet the Staff Contact Us Newsletter Special Sections Where to find the Advocate in print Best Of 2025 Winners Advertise **Holy Smokes Theatre lands in the Valley: Newly relocated theater company to stage queer ‘erotic horror comedy’ at Easthampton’s CitySpace this weekend** byAdvocate Staff|May 15, 2025 By CAROLYN BROWNStaff Writer Holy Smokes Theatre, which used to be based in southern New Hampshire, now has a home in the Pioneer Valley — and they’re debuting a new show here this weekend. Bats Faber, left, as a Nymph from the Underworld, and Rylee Kassirer, right, as Bogmire, dance around Nisse Greenberg, center, as Phillip, during rehearsal for “Dandy in the Underworld” at CitySpace on Tuesday in Easthampton. STAFF PHOTOs / DANIEL JACOBI II— The theater company, led by founder Wren Hannah, will premiere an original work, “Dandy in the Underworld,” at CitySpace in Easthampton on Friday, May 16, and Saturday, May 17, at 8 p.m. The show, according to a press release, is an erotic horror comedy about “a queer writer who wants to meet their inspirational muse but is uncertain if this seductive nymph is from their subconscious or from another dimension. Their journey to find out the answer brings them in contact with therapists, witches, writers, kinksters, and plant medicine. Expect terror, hilarity, and supernatural sex!” Holy Smokes describes its mission as “producing original works that seek to comfort the afflicted and afflict the comfortable. Where irreverence is reverent and the profane are holy and vice versa. Affordable, adorable, accessible, irrepressible theater that is rough, raw and entertaining.” The group began about a decade ago, when Hannah was living in southern New Hampshire. He and some of his friends wanted to make a “low-brow, cheap, rough-around-the-edges kind of theater” with improv elements, something that would be accessible to working performers as well as audiences. Their shows included a production of “Young Frankenstein” staged in a bar, plus parodies of “Love Boat” and “Miami Vice” that were “very surreal and bombastic and hilarious” as well as timely critiques of political and cultural issues. At the time, he said, “We didn’t really have much ambition other than just creating shows that me and my friends wanted to do, so we didn’t have a website. We just would put up shows, and usually they were one night only at the [Unitarian Universalist] church. But what we found is, we’d put up, like, 50 chairs, and then we’d have 125 people show up.” His takeaway: there’s “a real hunger” for alternative theater in the area. Hannah moved to western Massachusetts a few years ago after a few upending life events, including the pandemic, a divorce, and the death of his parents. He was drawn to the area because he “wanted to be around more people, more artists, more queer people. Southern New Hampshire, as you can guess, is a little bit more homogenized.” Down here, he said, he might have a unique issue: “Now it’s like, ‘Oh, wow, there’s two queer events in one night. There’s two drag shows coming up,’ whereas up in New Hampshire, there’s one a year.” STAFF PHOTO / DANIEL JACOBI II—Kai Marigold, left, and Jupiter Dior, right, both as nymphs from the underworld, dance around Nisse Greenberg, center, as Phillip, during rehearsal for “Dandy in the Underworld” at CitySpace, Tuesday, May 13, 2025, in Easthampton. He joined writing groups in the area, and “Dandy in the Underworld” developed through those: as a writer, his work will often “slide into dialogue, so even my poetry tends to be more like monologues from characters.” The show, he said, is a “gentle satire of alternative communities here,” including those he himself is part of. “It’s sort of spoofing them, but it’s also with so much love.” Initially, he ended up writing, directing, and producing his show himself because he didn’t know other theater people in the area, but he finally made his inroad into the western Mass theater scene by getting involved with a local queer burlesque group, The Grotesque Burlesque, some of whose members became part of the show. Lex Grotesque, the show’s assistant director, said, “The experience I have had with Holy Smokes has been wonderful. I would describe it as a theater company that embraces the queer liberation that adults in Western Mass have been waiting for.” After that, growing the production came from auditions: “One of the nights, I got, like, eight people,” Hannah said. “So I was like, ‘Oh my God, this is great. Wow, really talented.’ And then the next night I got, like, 35 people — ‘Whoa!’” From left: Wren Hannah, Nisse Greenberg, Ezra Thalheimer, Emilia Shaw and Lindsey Schreiner perform during rehearsal for “Dandy in the Underworld” at CitySpace on Tuesday in Easthampton. STAFF PHOTO / DANIEL JACOBI II After their first show, Holy Smokes Theatre doesn’t plan to get a fixed location, but, instead to “go where there’s affordable rehearsal spaces and go where I find collaborators.” Right now, Hannah’s working on another original show, which will be about the sudden cultural shifts of the 1960s, as experienced by a few women in a cafe. (Its potential titles include “Drop Dead, Hippie Scum” or “Turn On, Tune In, Drop Dead.”) After that, looking ahead to the theater company’s future, Hannah said he hopes to “really be surprised by what the needs of the community are.” “I’d really love to keep collaborating with people and cross-pollinating with different artists and different ideas, because that’s how I learn and grow — not just by dictating my own aesthetic, but being influenced by the people around me,” he said. “For me, I think it’s really important to create art that’s accessible and affordable, but also has that balance of providing comfort and challenge, and I think both are essential.” Still, he said, the purpose of theater is ultimately “to entertain. You want people to come in and be instantly hooked into what you’re doing and leave with something to chew on.” Writer, producer and director Wren Hannah, center with red pants, leads a warm up during rehearsal for “Dandy in the Underworld” at CitySpace on Tuesday in Easthampton. STAFF PHOTOS/DANIEL JACOBI II Tickets to “Dandy in the Underworld” are $15 via cityspaceeasthampton.org. The cast includes Nisse Greenberg as Phillip; Rylee Kassirer as Bogmire; Tom Foran and Ray Gunnerson as Phillip’s housemates Seth and Priscilla; Becky Czach as Phillip’s therapist; Daniel Fogarty as the Bookstore clerk; Lindsey Schreiner, Ezra Wilde, Phoebe Bell, Ezra Thalheimer, and Emilia Shaw as writing club members, plant medicine ritualists, and “sub-missives”; and Bats Faber, Leora Akiva, Kai Marigold, and Jupiter Dior as Nymphs from the underworld. Carolyn Brown can be reached at cbrown@gazettenet.com. **Local Advertisers** Copyright © 2025 by H.S. Gere & Sons, Inc.Privacy Policy–Copyright News Podcasts Events Arts & Music Columns About Us Best Of 2025 Winners Advertise Facebook X"}