{"id": 338, "name": "Deadline Hollywood", "domain": "deadline.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://deadline.com/2025/06/the-best-you-can-review-kevin-bacon-kyra-sedgwick-first-screen-teaming-20-years-tribeca-film-festival-1236426669/", "title": "The Best You Can Review Kevin Bacon Kyra Sedgwick First Screen Teaming 20 Years Tribeca Film Festival 1236426669", "content": "**Follow Us:** **site categories** TV Film AwardsAwards HubDigital Issues Awards Hub Digital Issues Awards Hub Digital Issues Box Office Biz International Politics Theater Reviews Obits Video EventsContendersTelevision: Docs+Unscripted+VarietyTelevisionFilm: NomineesFilm: DocumentaryFilm: InternationalFilm: Los AngelesFilm: LondonSound & ScreenTelevisionFilmOtherFor The Love Of DocsVisual Effects + Screen Contenders Television: Docs+Unscripted+Variety Television Film: Nominees Film: Documentary Film: International Film: Los Angeles Film: London Sound & Screen Television Film Other For The Love Of Docs Visual Effects + Screen Contenders Television: Docs+Unscripted+Variety Television Film: Nominees Film: Documentary Film: International Film: Los Angeles Film: London Sound & Screen Television Film Other For The Love Of Docs Visual Effects + Screen FestivalsNorth AmericaSundanceTorontoTellurideSXSWTribecaEuropeCannesZurichVeniceBerlin/EFMMiddle EastRed SeaAsiaTokyo North America Sundance Toronto Telluride SXSW Tribeca Europe Cannes Zurich Venice Berlin/EFM Middle East Red Sea Asia Tokyo North America Sundance Toronto Telluride SXSW Tribeca Europe Cannes Zurich Venice Berlin/EFM Middle East Red Sea Asia Tokyo Prime Experience News Alerts **‘Karen Pirie’ Season 2 First Look; Kim Kardashian Robbery Doc Sells; Mediawan Streaming Deal; Freely Joins Roku TVs; M6 Holiday Format; ‘Panchayat’ Season 4 Trailer; Embracer CEO – Global Briefs** Home Film Festivals **‘The Best You Can’ Review: Kevin Bacon & Kyra Sedgwick Shine As Boomers Looking For Renewal In First Onscreen Pairing In 20 Years – Tribeca Festival** ByPete Hammond **Pete Hammond** Awards Columnist/Chief Film Critic ‘Animal Farm’ Review: Andy Serkis Directs Seth Rogen And All-Star Voice Cast In Clever And Chilling Take On Orwell’s Classic Novella – Annecy Animation Festival ‘Re-Creation’ Review: 6-Time Oscar Nominee Jim Sheridan Creates Fictional Jury Trial For Real-Life Untried Murder Case In ‘12 Angry Men’ Homage – Tribeca Festival ‘Tow’ Review: Rose Byrne Triumphs In Incredible True Story Of Unhoused Woman’s Epic Battle With Car Towing Company – Tribeca Festival **Services to share this page.** Share on Facebook Post Share to Flipboard Email Show more sharing options Share on LinkedIn Pin it Submit to Reddit Post to Tumblr Share on WhatsApp Print This Page Making its world premiere in the Spotlight Narrative section of theTribecaFestival,The Best You Canrepresents the first major onscreen teaming of real-life husband and wifeKevin BaconandKyra Sedgwicksince 2004’sThe Woodsman, and they remain the best reason to see this small but engaging character dramedy about boomers fighting life passing them by. It will also largely appeal to that similar demographic. Nothing wrong with that. It is hard to believe the ever-young dancing presence ofFootlooseis now 66 and playing a guy with prostate problems but, hey, everyone gets older and the sweet premise of this film written and directed byMichael J. Weithornis that maybe it is never too late to find something new to re-energize your life, even if it seems that ship has already sailed.Related StoriesPodcastDoc Talk Podcast: Imagine Entertainment Execs Justin Wilkes And Sara Bernstein On New Barbara Walters Movie, Big Slate Of Emmy ContendersFestivals'Re-Creation' Review: 6-Time Oscar Nominee Jim Sheridan Creates Fictional Jury Trial For Real-Life Untried Murder Case In '12 Angry Men' Homage - Tribeca Festival **Related Stories** **Doc Talk Podcast: Imagine Entertainment Execs Justin Wilkes And Sara Bernstein On New Barbara Walters Movie, Big Slate Of Emmy Contenders** **'Re-Creation' Review: 6-Time Oscar Nominee Jim Sheridan Creates Fictional Jury Trial For Real-Life Untried Murder Case In '12 Angry Men' Homage - Tribeca Festival** **Related Stories** **Doc Talk Podcast: Imagine Entertainment Execs Justin Wilkes And Sara Bernstein On New Barbara Walters Movie, Big Slate Of Emmy Contenders** **Doc Talk Podcast: Imagine Entertainment Execs Justin Wilkes And Sara Bernstein On New Barbara Walters Movie, Big Slate Of Emmy Contenders** **'Re-Creation' Review: 6-Time Oscar Nominee Jim Sheridan Creates Fictional Jury Trial For Real-Life Untried Murder Case In '12 Angry Men' Homage - Tribeca Festival** **'Re-Creation' Review: 6-Time Oscar Nominee Jim Sheridan Creates Fictional Jury Trial For Real-Life Untried Murder Case In '12 Angry Men' Homage - Tribeca Festival** Sedgwick plays Cynthia Rand, the 25-years-younger wife of Walter (Judd Hirsch) who sadly is experiencing the onset of dementia, forgetting more than he remembers. This is evidenced as a young man doing a book on the ’70s Watergate scandal attempts to interview Walter on the subject, since he was a key person working on the committee. Unfortunately, he has little recall in their first conversation, and Cynthia is increasingly concerned about him. When it appears an intruder may have been trying to break into their home one night, she mistakes him for Stan Olszewski (Bacon), a flailing security officer who is attempting to enter the home through an upstairs window simply to do his job. Once she realizes he isn’t breaking in, they strike up a conversation that leads to him asking to use the bathroom as he finds he has to pee a lot “more frequently” these days. Conveniently, she happens to be a urologist and offers to help him discover the problem. Next thing you know, he is face down on the exam table in her office with his pants down and Cynthia putting on a rubber glove to take a deep dive. In the movies, they call this “meeting cute.”Watch on Deadline **Watch on Deadline** **Watch on Deadline** Time goes on, her problems with Walter’s decline continues, and she turns to new friend Stan for texting conversations on just about everything. In addition to his medical problems, he is having a hell of a time dealing with his 20-something daughter Sammi (Brittany O’Grady), with whom he lives. Cynthia and Stan become fast friends as they commiserate and find common ground at this point in life. When Walter perks up and invites him to join them at a restaurant in a few days, Stan accepts. However, much to Cynthia’s dismay, he shows up with a hot date who was a young grocery clerk that boldly tried to pick Stan up once when he was checking out. A jealous Cynthia clearly has other plans for her new friend, and one thing leads to another and, well, they hook up as the kids might say. Complications arise as life goes on. That is really whatThe Best You Canis all about – two boomers connecting at a time in their lives when it appears it is all downhill from here. The spark between them proves otherwise, or so they think. This is something many people of a certain age may identify with, the inevitability of growing old in a society that caters to a generation to which they both don’t belong. What makes it work is its star teaming. Sedgwick is spirited and enthusiastic in her interactions with Bacon, and she hits all the right notes even when it appears she has violated the codes of her profession and gotten too close to the patient. Bacon is always a watchable and superb actor, no matter what role he gets, and this one fits him like a glove. O’Grady is appealing too, a frustrated daughter who is also an aspiring singer. Hirsch does his usual all-pro job ,and Ray Romano even shows up briefly on Zooms as a doctor colleague of Cynthia’s. Weithorn, whose credits are mainly TV sitcoms, delivers a human story that would be just as comfortable on television as in theaters these days, and a streamer is probably its best bet. But thanks to Bacon and Sedgwick’s easy chemistry on screen, as well as off, it is a pleasure to watch no matter how we find it. Producers are Weithorn, Bacon, Sedgwick, Victoria Hill, Andrew Mann, and Andrew Wonder. Title:The Best You CanFestival:Tribeca (Spotlight Narrative)Director-screenwriter:Michael J. WeithornCast:Kyra Sedgwick, Kevin Bacon, Judd Hirsch, Brittany O’Grady, Ray Romano, Olivia Luccardi, Meera Rohit Kumbhani, Misha Brooks, Heather Burns, Victor Williams, Rob BenedictSales agent:CAARunning time:1 hr 43 mins **Must Read Stories** ‘The Cat In The Hat’ Team Talk ‘Coyote Vs. Acme’; ‘Steven Universe’ Sequel **‘The Cat In The Hat’ Team Talk ‘Coyote Vs. Acme’; ‘Steven Universe’ Sequel** **‘The Cat In The Hat’ Team Talk ‘Coyote Vs. Acme’; ‘Steven Universe’ Sequel** Sound & Screen London With Anne Dudley, ‘Shrinking’, ‘Arcane’, More **Sound & Screen London With Anne Dudley, ‘Shrinking’, ‘Arcane’, More** **Sound & Screen London With Anne Dudley, ‘Shrinking’, ‘Arcane’, More** Newsom: “The Moment We Have Feared Has Arrived”; L.A. Curfew Imposed **Newsom: “The Moment We Have Feared Has Arrived”; L.A. Curfew Imposed** **Newsom: “The Moment We Have Feared Has Arrived”; L.A. Curfew Imposed** Starz Opening Writers Room On 2nd New ‘Power’ Spinoff As ‘Origins’ Progresses **Starz Opening Writers Room On 2nd New ‘Power’ Spinoff As ‘Origins’ Progresses** **Starz Opening Writers Room On 2nd New ‘Power’ Spinoff As ‘Origins’ Progresses** **Read More About:** Judd Hirsch Kevin Bacon Kyra Sedgwick Michael J. Weithorn The Best You Can Tribeca Tribeca Festival **Subscribe to Deadline** Get our Breaking News Alerts and Keep your inbox happy. **10 Comments** **Sidebar** **Trending on Deadline** 1'Power': Starz Opening Writers Room On New Spinoff As 'Origins' Development Progresses 2'The Cat In The Hat' Team Defend Warners' Decision To Shelve 'Coyote Vs. Acme': \"We Are Lucky To Do Art In Our Profession But We Can't Lock Ourselves In A Basement\" 3'Steven Universe' Sequel In The Works At Prime Video 4David Harbour On Feeling Relieved Over 'Stranger Things' Ending: \"You're Having To Play A Lot Of The Same Beat\" 5Blake's Version: Scooter Braun's HYBE America Subpoenaed By Taylor Swift's Pal In Justin Baldoni Battle 6'Animal Farm' Review: Andy Serkis Directs Seth Rogen And All-Star Voice Cast In Clever And Chilling Take On Orwell's Classic Novella - Annecy Animation Festival 7'Good Night, And Good Luck' & 'Othello' Go Out On High Notes; 'Call Me Izzy' With Jean Smart Takes $416,759 - Broadway Box Office 8'Little House On The Prairie': Ingalls Family & More In First Cast Photos As Production Begins 9Amazon MGM Talks $1B Slate And Says “We Are Heavily Invested In Theatrical” & “We’re Not Holding Any Content Back” 10Julian Fellowes Shares Health Update As He Kicks Off Promotions For 'Gilded Age' Season 3 & \"Final\" 'Downton Abbey' Film Signup for Breaking News Alerts & Newsletters By providing your information, you agree to ourTerms of Useand ourPrivacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the GooglePrivacy PolicyandTerms of Serviceapply. **Latest Film News** Renate Reinsve Joins Chiwetel Ejiofor In A24 Sci-Fi Horror Pic 'The Backrooms' **Renate Reinsve Joins Chiwetel Ejiofor In A24 Sci-Fi Horror Pic 'The Backrooms'** **Renate Reinsve Joins Chiwetel Ejiofor In A24 Sci-Fi Horror Pic 'The Backrooms'** **Renate Reinsve Joins Chiwetel Ejiofor In A24 Sci-Fi Horror Pic 'The Backrooms'** Gkids Acquires Multiple Territories For Japanese Action Sci-Fi Animated Feature ‘All You Need Is Kill’ - Annecy **Gkids Acquires Multiple Territories For Japanese Action Sci-Fi Animated Feature ‘All You Need Is Kill’ - Annecy** **Gkids Acquires Multiple Territories For Japanese Action Sci-Fi Animated Feature ‘All You Need Is Kill’ - Annecy** **Gkids Acquires Multiple Territories For Japanese Action Sci-Fi Animated Feature ‘All You Need Is Kill’ - Annecy** Laika Signs ‘Corpse Bride’ & ‘Frankenweenie’ Screenwriter John August To Write Stop-Motion Teen Missing Mother Drama For Pete Candeland **Laika Signs ‘Corpse Bride’ & ‘Frankenweenie’ Screenwriter John August To Write Stop-Motion Teen Missing Mother Drama For Pete Candeland** **Laika Signs ‘Corpse Bride’ & ‘Frankenweenie’ Screenwriter John August To Write Stop-Motion Teen Missing Mother Drama For Pete Candeland** **Laika Signs ‘Corpse Bride’ & ‘Frankenweenie’ Screenwriter John August To Write Stop-Motion Teen Missing Mother Drama For Pete Candeland** 'The Cat In The Hat' Team Defend Warners' Decision To Shelve 'Coyote Vs. Acme': \"We Are Lucky To Do Art In Our Profession But We Can't Lock Ourselves In A Basement\" **'The Cat In The Hat' Team Defend Warners' Decision To Shelve 'Coyote Vs. Acme': \"We Are Lucky To Do Art In Our Profession But We Can't Lock Ourselves In A Basement\"** **'The Cat In The Hat' Team Defend Warners' Decision To Shelve 'Coyote Vs. Acme': \"We Are Lucky To Do Art In Our Profession But We Can't Lock Ourselves In A Basement\"** **'The Cat In The Hat' Team Defend Warners' Decision To Shelve 'Coyote Vs. Acme': \"We Are Lucky To Do Art In Our Profession But We Can't Lock Ourselves In A Basement\"** **Marketplace** **Newswire** **Deadline** About Us Advertise **Legal** Terms of Use Privacy Policy Accessibility AdChoices California Privacy Rights Your Privacy Choices EU Privacy Preferences **Sitemap** TV Film Awards Box Office Business International **Connect with Us** Get our latest storiesin the feed of your favorite networks **Have a Tip?** We want to hear from you! Send us a tip using our annonymous form. **Stay in the Know** Sign up for our breaking news alerts By providing your information, you agree to ourTerms of Useand ourPrivacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the GooglePrivacy PolicyandTerms of Serviceapply. Deadline is a part of Penske Media Corporation. © 2025 Deadline Hollywood, LLC. All Rights Reserved. Art in America Artforum ARTnews BGR Billboard BlogHer Deadline Flow Space Gold Derby IndieWire LA3C Life is Beautiful Robb Report Rolling Stone SheKnows Soaps Sourcing Journal Sportico Spy StyleCaster The Hollywood Reporter TVLine Variety Vibe WWD **Our Sites** Art in America Artforum ARTnews BGR Billboard BlogHer Deadline Flow Space Gold Derby IndieWire LA3C Life is Beautiful Robb Report Rolling Stone SheKnows Soaps Sourcing Journal Sportico Spy StyleCaster The Hollywood Reporter TVLine Variety Vibe WWD **Site** TVExpand the sub-menuCastingsRatingsLate-NightPrimetime Pilot Panic **TVExpand the sub-menu** Castings Ratings Late-Night Primetime Pilot Panic **TVExpand the sub-menu** Castings Ratings Late-Night Primetime Pilot Panic FilmExpand the sub-menuFestivalsReviewsCastingsAcquisitionsDocumentary **FilmExpand the sub-menu** Festivals Reviews Castings Acquisitions Documentary **FilmExpand the sub-menu** Festivals Reviews Castings Acquisitions Documentary AwardsExpand the sub-menuAwards HubEmmysOscarsTonys **AwardsExpand the sub-menu** Awards Hub Emmys Oscars Tonys **AwardsExpand the sub-menu** Awards Hub Emmys Oscars Tonys Box OfficeExpand the sub-menuInternational B.O.Specialty B.O.Broadway B.O. **Box OfficeExpand the sub-menu** International B.O. Specialty B.O. Broadway B.O. **Box OfficeExpand the sub-menu** International B.O. Specialty B.O. Broadway B.O. BusinessExpand the sub-menuPoliticsLegalExecutivesAgencies **BusinessExpand the sub-menu** Politics Legal Executives Agencies **BusinessExpand the sub-menu** Politics Legal Executives Agencies InternationalExpand the sub-menuFestivalsFilmTVInternational Insider **InternationalExpand the sub-menu** Festivals Film TV International Insider **InternationalExpand the sub-menu** Festivals Film TV International Insider VideoExpand the sub-menuTrailersThe Actor's SideBehind The LensThe Process **VideoExpand the sub-menu** Trailers The Actor's Side Behind The Lens The Process **VideoExpand the sub-menu** Trailers The Actor's Side Behind The Lens The Process MoreExpand the sub-menuObituariesTheaterMusicPodcastsInsider **MoreExpand the sub-menu** Obituaries Theater Music Podcasts Insider **MoreExpand the sub-menu** Obituaries Theater Music Podcasts Insider **Follow Us** **Alerts & Newsletters** By providing your information, you agree to ourTerms of Useand ourPrivacy Policy. We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the GooglePrivacy PolicyandTerms of Serviceapply. Advertise About Us Give us feedback Leave us a tip"}