{"id": 843, "name": "Liberation (Paris)", "domain": "liberation.fr", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.liberation.fr/international/amerique/etats-unis-gavin-newsom-lambitieux-gouverneur-de-californie-propulse-opposant-numero-1-de-donald-trump-20250610_NAT7DD7Z6BGH5OZDWWJMZYYZA4/", "title": "Etats Unis Gavin Newsom Lambitieux Gouverneur De Californie Propulse Opposant Numero 1 De Donald Trump 20250610_nat7dd7z6bgh5ozdwwjmzyyza4", "content": "Politique International Idées et Débats Culture CheckNews Société Enquêtes Environnement Economie Lifestyle Témoignages Ça va mieux en le lisant Portraits **Etats-Unis : Gavin Newsom, l’ambitieux gouverneur de Californie propulsé opposant numéro 1 de Donald Trump** Parfois, l’histoire impose les rôles. Depuisle retour fracassant au pouvoir de Donald Trumpen janvier, le gouverneur démocrate de Californie, Gavin Newsom, avait choisi d’évoluer sur une ligne de crête dans ses rapports avec la Maison Blanche, alternant bras de fer judiciaire et gestes de conciliation. Une stratégie tempérée, parfois mal perçue dans son propre camp, plus enclin à une opposition frontale. Le déploiement exceptionnel de milliers de soldats dans les rues de Los Angeles, ordonné par Trump après des tensions liées aux raids de ses services migratoires, a fait voler en éclats cette ligne prudente. «Je suis disposé à faire tout ce que je peux pour défendre les intérêts des personnes que je représente, mais pas lorsque notre Constitution et l’état de droit sont bafoués. Nous avons tous nos lignes rouges. Voici la mienne», a déclaré Newsom, 57 ans, auLos Angeles Times. Déjà fermement opposé **Dans la même rubrique** **Musk admet être «allé trop loin» dans son clash avec Trump, qui se dit «reconnaissant» des regrets de son ex-bras droit** **Musk admet être «allé trop loin» dans son clash avec Trump, qui se dit «reconnaissant» des regrets de son ex-bras droit** **Harvey Weinstein à nouveau déclaré coupable d’agression sexuelle, lors de son procès en appel** **Harvey Weinstein à nouveau déclaré coupable d’agression sexuelle, lors de son procès en appel** **Le président Javier Milei annonce le transfert de l’ambassade d’Argentine à Jérusalem et soutient Nétanyahou** **Le président Javier Milei annonce le transfert de l’ambassade d’Argentine à Jérusalem et soutient Nétanyahou** **Donald Trump se félicite d’un accord sur les terres rares entre la Chine et les Etats-Unis** **Donald Trump se félicite d’un accord sur les terres rares entre la Chine et les Etats-Unis** **Nos newsletters** **Nos newsletters** **Les plus lus** Dossiers Services Conditions générales Où lire Libé?"}