{"id": 687, "name": "The News Lens", "domain": "international.thenewslens.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://international.thenewslens.com/feature/taiwan-stories-of-return/151145", "title": "Taiwan Stories Of Return", "content": "Environment Military Science Arts & Culture Economy Health Society Education Politics World Lifestyle A Simple Guide to US Election 2024 Taiwan’s 2024 Presidential Race Roy Ngerng on the Minimum Wage Taiwan: Stories of Return Environment Military Science Arts & Culture Economy Health Society Education Politics World Lifestyle A Simple Guide to US Election 2024 Taiwan’s 2024 Presidential Race Roy Ngerng on the Minimum Wage Taiwan: Stories of Return News Opinion Illustration Feature Story TNL Research About The News Lens Official Blog RSS Submission Guidelines Profile Subscription Bookmarks Following Newsletter **Abandoning Anthropology, From Virginia to Taipei** **Taiwan: Stories of Return** Daniel Yo-Ling Chen (he/they/他) is a writer and independent scholar based in Taipei. They studied Anthropology at the University of Virginia and write primarily about ethics. In the traditional model, anthropologists venture off to their field sites, do their research, and then go back to their home institutions to write up and share their findings. What might a different kind of relationship to Taiwan look like? It was a Monday evening earlier this year in mid-January and we were gathered around an oversized whiteboard. “Taiwan’s Economic Transformation during the KMT Authoritarian Period” titled the top of the board above a timeline spanning from the end of World War II to the founding of Taiwan Semiconductor Manufacturing Company in 1987. We fumbled a bit with technical terms such as “small and medium-sized enterprises” and “contract manufacturing.” One participant shared a story of their grandmother sewing T-shirts at her home for export abroad further down the supply chain. There were sixteen of us gathered this evening for our weekly Taiwanese history reading group, which was started specifically for diasporic Taiwanese who moved to Taipei during the Covid-19 pandemic — diasporic Taiwanese such as myself. I was pursuing graduate studies in cultural anthropology at the University of Virginia and working part-time at a local bakery when the pandemic reached the East coast during the 2020 spring semester. March, April, and May were especially stressful months of attempting to finish my coursework, coping with the financial strain of having my bakery hours cut, and adjusting to new responsibilities providing part-time childcare for my landlord’s two preschoolers. My plan was to receive one of the U.S.-based fellowships I had applied for to go to Taiwan for a year to study Mandarin, further explore my research interests in Taiwan, and then return back to graduate school in the fall of 2021. But as the summer approached and Taiwan’s borders showed no signs of opening to foreign students, I began looking into the process of obtaining a Taiwanese passport and Taiwan Area Resident Card as a Taiwanese national born in the United States. The summer of 2020 was filled with a mix of coordinating with my parents to translate and verify required documents such as their marriage certificate and more mundane moving preparations. It was also when the many dissonances, both personal with my department and intellectual with the discipline of anthropology, came to a breaking point. I decided to leave anthropology, which opened a different kind of space for me to engage with Taiwan. In the traditional model, anthropologists venture off to their field sites, do their research, and then go back to their home institutions to write up and share their findings. My original interests in Taiwan followed this pattern. But having abandoned North American anthropology, I wondered: What might a different kind of relationship to Taiwan look like, one that did not conform to the anthropological imperative of return? What would it take to permanently recontextualize oneself in a different geopolitical location? And what kind of new opportunities and insights might emerge from this process? With these questions in mind, I obtained my passport at the end of July and moved to Taipei in early August, just in time to start in-person Mandarin classes at the start of September. I was fortunate to have already made some connections in Taipei during a visit the previous summer, which meant that I had a social support network when I first arrived. Many of my friends were involved with the bilingual social movements publicationNew Bloom. In October, I got word thatNew Bloomhad just acquired a building in Wanhua and was looking for new members to help manage the space and plan events. Having divested from my previous academic pursuits in anthropology, I eagerly joined with a desire to explore what it would take to collaboratively create a space for intellectual, political, and creative engagement outside of the academy. We decided early on in our space programming discussions that we wanted to reach young diasporic Taiwanese like myself who moved to Taiwan during the pandemic. Most are college students and recent graduates currently in Taiwan doing some mix of working, studying, and learning Mandarin. PerhapsNew Bloomcould provide a space for diasporic Taiwanese to learn more about Taiwanese history, explore their own relationship to Taiwan, and hone a much-needed transnational perspective on contemporary Taiwanese politics. With this aspiration in mind, I took up most of the responsibility for engaging this group and soon we had a weekly reading group up and running. As our discussion time ran out, one participant fortuitously foreshadowed the topic for next week’s reading group by raising the question of how we are to make sense of the relationship between economic development and democratization during the postwar period of Taiwan’s history. It was as if she knew that I assigned sections from Shelly Rigger’s 1999 book,Politics in Taiwan, for next week with the hope that Rigger’s argument against applying the mainstream modernization hypothesis — that economic development leads to the formation of a middle class that then pushes for democratic reform — to Taiwan would stick. With a clear set-up for next week’s session in place, I closed out our discussion and reminded everyone about our upcoming events: A Mandarin-English language exchange focused around the arts and activism, the start of a weekly Taiwanese Hokkien language class, an introductory talk on Indigenous peoples in Taiwan, another talk on refugee and migrant worker issues, and a Lunar New Year party for folks in Taipei. It’s been about five months since that January evening, and about a year since I first considered moving to Taiwan as a national with residency rights rather than as an anthropologist primarily beholden to somewhere else. I can’t help but think back to the question I gave myself last May: What would it take to permanently recontextualize oneself in a different geopolitical location? Definitely more than one year. While I’ve been learning so much about Taiwan, I am painfully aware of all of the things I know I do not know. For instance, I still can’t understand my maternal grandmother’s Taiwanese Hokkien and my paternal family’s Hakka. There are also various social issues in Taiwan that have appeared on my horizon such as the situation of Muslim communities here and the plight of Indonesianmigrant caregivers; what Taiwan can do for Hong Kongers in the wake of the national security law; how the tension between environmental conservation and energy transition goals will play out duringthe August referendum later this year; and the ongoing infringement of Indigenous rights around recent cases likethe Tama Talum constitutional interpretation on huntingand procedural consultation issues withphotovoltaic panel installations in Zhiben on the Katatipul community’s land. But I have yet to pay the price of intimacy with these issues, let alone other issues about which I am unaware. As Taiwan grapples with the most recent explosion in domestic transmission cases and inches ever closer to lockdown, I’ve been reminded that the Covid-19 pandemic is far from over. I wonder how other diasporic Taiwanese from the reading group are doing and what reflections they have one year on. Perhaps they too, regardless of whether their presence here is wholly or partially determined by the pandemic, feel that same resolve of staying a bit longer. There is still so much more to learn about Taiwan, about Taiwan’s place in the world, about the world at large from the perspective of this particular place. READ NEXT:Coming Home to a Place I’ve Never Lived TNL Editor: Nicholas Haggerty, Bryan Chou (@thenewslensintl) If you enjoyed this article and want to receive more story updates in your news feed, please be sure to follow ourFacebook. Taiwan diaspora COVID-19 New Bloom Wanhua Shelly Rigger Returning to Taiwan Daniel Yo-Ling Chen Coming Home to a Place I’ve Never Lived- 4 years ago Many have sought to understand the pandemic year return of the diaspora to Taiwan. How would they benefit Taiwan’s economy? Would they stay? Less attention has been paid to what this means on a personal level for those involved. Here, we reflect on what it means to return — or to not be able to — and what this reverse exodus means for Taiwan. Are you over 18? Environment Military Science Arts & Culture Economy Health Society Education Politics World Lifestyle News Opinion Illustration Feature Story TNL Research Sales :sales@thenewslens.com Marketing :partnership@thenewslens.com Press :press@thenewslens.com Customer Service :contact@thenewslens.com About The News Lens Official Blog RSS Submission Guidelines"}