{"id": 2122, "name": "Sanders Institute", "domain": "sandersinstitute.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sandersinstitute.org/category/racial-justice-human-dignity", "title": "Racial Justice Human Dignity", "content": "AboutMission StatementFellowsBoardWho We Are Mission Statement Fellows Board Who We Are Mission Statement Fellows Board Who We Are IssuesEconomy & Economic JusticeHousingHealthcareRacial Justice & Human DignityEnergy, Environment & ClimateEducationImmigrationSovereign NationsDemocracy & GovernmentVeteransSocial JusticeSustainable DevelopmentCriminal JusticeForeign Policy Economy & Economic Justice Housing Healthcare Racial Justice & Human Dignity Energy, Environment & Climate Education Immigration Sovereign Nations Democracy & Government Veterans Social Justice Sustainable Development Criminal Justice Foreign Policy Economy & Economic Justice Housing Healthcare Racial Justice & Human Dignity Energy, Environment & Climate Education Immigration Sovereign Nations Democracy & Government Veterans Social Justice Sustainable Development Criminal Justice Foreign Policy ResourcesBlogBooksCongressional OutreachVideos Blog Books Congressional Outreach Videos Blog Books Congressional Outreach Videos The Gathering Instagram Twitter Facebook Youtube issues **Racial Justice & Human Dignity** Racial Justice & Human Dignity/Foreign Policy There have been five wars in the last 15 years between Israel and Hamas. How do we end the current one and prevent a sixth from happening, sooner or later?... There have been five wars in the last 15 years between Israel and Hamas. How do we end the current one and prevent a sixth from happening, sooner or later?... Bernie Sanders Bernie Sanders Racial Justice & Human Dignity The nation is in shock over the vicious beating death of Tyre Nichols at the hands of police officers in Memphis, Tennessee. What’s even more perplexing is that the crime—all... The nation is in shock over the vicious beating death of Tyre Nichols at the hands of police officers in Memphis, Tennessee. What’s even more perplexing is that the crime—all... Delaina Dixon Delaina Dixon Racial Justice & Human Dignity Communities all across the country are facing public safety crises. Crime is rising in ways that leave many people feeling unsafe. At the same time, police violence and killings of unarmed... Communities all across the country are facing public safety crises. Crime is rising in ways that leave many people feeling unsafe. At the same time, police violence and killings of unarmed... Ben Jealous Ben Jealous Racial Justice & Human Dignity There’s been a lot of news about the Democratic legislators in Texas who fled the state to prevent Republicans from pushing through sweeping new voter suppression laws. Gov. Greg Abbott... There’s been a lot of news about the Democratic legislators in Texas who fled the state to prevent Republicans from pushing through sweeping new voter suppression laws. Gov. Greg Abbott... Ben Jealous Ben Jealous Racial Justice & Human Dignity Washington, D.C., has a higher percentage of Black residents than any state in the country, and they have no voting representation in Congress. This is systemic racism in action. It... Washington, D.C., has a higher percentage of Black residents than any state in the country, and they have no voting representation in Congress. This is systemic racism in action. It... Ben Jealous Ben Jealous Racial Justice & Human Dignity Four years ago, when Donald Trump first ran for president, he urged Black people to support him, asking us, “What have you got to lose?” Four years later, we know... Four years ago, when Donald Trump first ran for president, he urged Black people to support him, asking us, “What have you got to lose?” Four years later, we know... Harry Belafonte Harry Belafonte Racial Justice & Human Dignity Millions of Americans have come out in big cities and small towns to protest the killings of unarmed civilians — often Black people — at the hands of law enforcement.... Millions of Americans have come out in big cities and small towns to protest the killings of unarmed civilians — often Black people — at the hands of law enforcement.... Ben Jealous Ben Jealous Racial Justice & Human Dignity The Republicans’ rush to fill the vacant U.S. Supreme Court seat before the Nov. 3 election is a terrible threat to Black people’s civil rights and the health of our... The Republicans’ rush to fill the vacant U.S. Supreme Court seat before the Nov. 3 election is a terrible threat to Black people’s civil rights and the health of our... Ben Jealous Ben Jealous Racial Justice & Human Dignity Following the killing of George Floyd, West and Keeanga-Yamahtta Taylor respond to the global uprising against racism and police violence. Keeanga-Yamahtta Taylor is an American academic, writer, and activist. Following the killing of George Floyd, West and Keeanga-Yamahtta Taylor respond to the global uprising against racism and police violence. Keeanga-Yamahtta Taylor is an American academic, writer, and activist. Amy Goodman Amy Goodman Racial Justice & Human Dignity Danny Glover was recently a juror and mentor at Turkey’s virtual International Migration Film Festival, for which he took a deep dive into films tackling the plight of migrants around the... Danny Glover was recently a juror and mentor at Turkey’s virtual International Migration Film Festival, for which he took a deep dive into films tackling the plight of migrants around the... Nick Vivarelli Nick Vivarelli Racial Justice & Human Dignity While the mainstream news media's attention has mostly moved on to other things, the George Floyd protests continue into a fourth week. The Black Lives Matter movement is gaining momentum, in both small majority-white... While the mainstream news media's attention has mostly moved on to other things, the George Floyd protests continue into a fourth week. The Black Lives Matter movement is gaining momentum, in both small majority-white... Chauncey Devega Chauncey Devega **Racial Justice & Human Dignity - Books** ByBen Jealous Racial Justice & Human Dignity/Social Justice ByGoran Hugo Olsson Racial Justice & Human Dignity ByW. E. B. Du Bois Racial Justice & Human Dignity ByDr. Cornel West Economy & Economic Justice/Racial Justice & Human Dignity ByDr. Cornel West Racial Justice & Human Dignity **Purchase** By providing your cell phone number you agree to receive periodic updates. Msg & Data rates may apply. About Issues Resources The Gathering Contact Instagram Twitter Facebook Youtube © 2025 The Sanders Institute"}