{"id": 1594, "name": "WKOW - Madison News", "domain": "wkow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wkow.com/news/top-stories/arrest-warrant-returned-for-madison-woman-charged-with-fraud-reckless-endangerment-bail-jumping-physical-abuse/article_1be65786-7a00-11ef-ba8a-8734de398df4.html", "title": "Arrest Warrant Returned For Madison Woman Charged With Fraud Reckless Endangerment Bail Jumping Physical Abuse", "content": "Facebook Twitter YouTube Instagram Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Election Results Latest News State News National News Politics Crime Digging Deeper Capital City Sunday Wake Up Wisconsin Economy Education Climate Change June Dairy Month Toys For Tots Latest Weather Interactive Radar Submit Closings or Delays Closings and Delays 27 Traffic Tracker Alert Room Map Room Radar Room Forecast and Conditions Dog Walk Forecast WKOW's 4 Degree Guarantee Rain Totals Weather Photos Weather Cameras Latest Sports Badgers Packers Brewers WIAA Sports Live High School Sports EndZone NFL Draft WKOW Live Streaming Video TV Listings 27.1 ABC Network 27.2 Catchy Comedy 27.3 ThisTV 27.4 Court TV 27.5 True Crime ABC News livestream Watch ABC Discover Wisconsin On Demand YouTube TV Apps Recipes The American Athlete Pet of the Week Community Calendar Contests Deals Take Your Brat to Seniors Day WKOW Directory Meet the WKOW Team WKOW History Sign up for Email Alerts Our Apps Careers At WKOW Advertise with WKOW Site searchSearch Site searchSearch Site searchSearch 87° Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Facebook Twitter Instagram News Weather Sports Watch Video Things To Do Contests Contact 27 Storm Track: Interactive Radar Check the Forecast 27 News: Download Our Apps **Weather Alert** **Air Quality Alert until WED 11:00 PM CDT** **Air Quality Alert until WED 11:00 PM CDT** **HOW TO WATCH: WIAA Softball Championships on June 14** Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Arrest warrant returned for Madison woman charged with fraud, reckless endangerment, bail jumping, physical abuse of an elder** By: Enjoyiana Nururdin, M.A.Enjoyiana Nururdin, M.A.Digital Content ProducerEnjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Digital Content Producer Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Digital Content Producer Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Sep 23, 2024 Sep 23, 2024UpdatedSep 24, 2024 0 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save MADISON (WKOW) – A bench warrant was issued on Monday and returned Tuesday for a Madison woman after she failed to show up to court. A cash bond was reinstated for $300. Jaayd S. Roquemore, 20, had a plea/sentencing hearing scheduled for 10:30 a.m. in Madison relating to felony charges of recklessly endangering safety, plus domestic abuse assessments, misdemeanor battery, and criminal damage to property related to an incident that took place two years ago. The day was Thursday, June 23, 2022, and officers with the City of Madison Police Department responded to a Red Roof Inn on the north side around 1:14 p.m. It was a domestic incident with multiple people calling it in and pointing the finger at Roquemore. Court documents reflect that Roquemore struck a security officer and the security dog with her car, sending the two-year-old Rottweiler flying through the air according to witnesses, then pinning the two between the bumper of her car and the rear bumper of another. Roquemore said she thought she hit the car in front of her, but later learned that she supposedly had hit the dog and the security guard, court records said. One witness said after she hit them, she turned her car around and hit two other vehicles before leaving. “I saw her hit the dog with her car,” the witness said. “The dog went flying.” The security guard said Roquemore said something to the tune of “F*** you and your dog,” before putting the car into drive and accelerating towards them, according to court documents. “I saw the devil in her eyes,” the security guard said, adding that he felt scared. He did not request EMS but did suffer injuries to his leg. The dog needed to be taken to the vet. According to the officer who made contact with Roquemore, she didn’t believe it was true that she hit them because she “remembered seeing the dog on the sidewalk ‘walking around and living life’ as she left the lot.” Witnesses reported seeing the dog’s mouth bleeding, the result of a cut on its mouth. Roquemore showed up at the establishment on the 4800 block of Hayes Road that day looking for her ex, identified as JEO, whom she shares a child with. They weren’t dating at the time. She showed up at the front desk looking for him, and the owner contacted him to let JEO know of the situation. Meanwhile, Roquemore arrived at the door she believed he was in, yelling, screaming, and kicking the door nearly ten times, banging on the glass while repeatedly stating, “Open the f***ing door,” according to the court documents. The manager said the damage to the door would cost $400, and the fine for the Class A Misdemeanor, if convicted, is $10,000. She admitted to trying to open the door and throwing rocks at the door and the window. As JEO returned from informing security about the situation, he nearly crossed paths with Roquemore, who then pursued him, punched him two times, on both sides of his face, and tore his shirt as he tried to get away. JEO said that she picked up several rocks and threw them at him. He stated that he believed Roquemore was really trying to hurt him, according to the statement. Court documents state she admitted to hitting him several times in the face with closed fists. Further reporting revealed that there were several other felony charges pending against Roquemore, who was initially mentioned for her connection to ayoung man, Melvin Hubbard, who died in a fatal skateboardingaccident last week. That reporting is ongoing. However, initial reporting found that Roquemore did call 911 for a disturbance on Saturday, Sept. 14, at a home on Bel Aire Drive after Hubbard's mother tried to retrieve the belongings of her son. Per MPD call log records, Roquemore reported being harassed by her boyfriends' family, claiming that someone \"busted the car window,\" and that people were chasing her. The family reported a different story. It was found out by the family that most of Hubbard's belongings at his apartment, which they didn't get access to until the following Monday, an e-bike he bought for his younger brother, pots and pans, a 70\" TV, bedroom set, PS5, and all groceries but a single gallon of milk, were reportedly stolen by Roquemore. Madison Police Department records confirm that they responded to a theft that Tuesday afternoon at a home on the 400 block of West Wilson St., once they finally listened to the family members concerns. Police searched a residence across the street where Roquemore was reported to be living, and returned all stolen belongings except for the TV, which was claimed to be a gift of sorts according to family members. The family ended up in the situation as Hubbard was in a hospital bed on life support because staff at UW Hospital, unbeknownst to the family, gave Hubbard's belongings to Roquemore, who was reportedly in a relationship with Hubbard since last year. In January of last year, Roquemore was charged with criminal damage to property plus domestic abuse assessments and use of a dangerous weapon, involving JEO, the victim mentioned in the previous incident. JEO called the police after Roquemore slashed all of his tires after finding a bra that didn’t belong to her. A conversation about sexually intimate videos with other people being sent back and forth to others escalated. Roquemore then grabbed a smaller steak knife from the kitchen and told him that she was going to “cut his car up,” according to the criminal complaint. She also tried to break the front driver’s seat window by stabbing it, but wasn’t able to do so. In June 2023, Roquemore was charged with one count of physical abuse of an elder, her own grandmother, with the intentional cause of bodily harm, misdemeanor battery, disorderly conduct, and felony bail jumping. On Tuesday, June 20, officers with Fitchburg Police arrived at a home on Deer Valley Road after being flagged down by an individual referred to as AJB in the court documents. AJB directed officials to the incident where an array of items demonstrated something serious went down, including an elderly woman, KJW, who was crying and appeared anxious. KJW reported that her granddaughter, Roquemore, hit her in the head after she threw a half-empty water bottle at Roquemore for spanking a child. AJB and the child were talking about the zoo which excited the child who began expressing that sentiment. Apparently confrontational and upset about the behavior, according to the court documents, Roquemore began spanking the child. In order to stop her from doing so, the grandmother, KJW, threw the bottle, which reportedly didn’t hit Roquemore, but sparked further aggression. Roquemore reportedly used open and closed fists to hit her grandmother, and when AJB tried to break it up, Roquemore started in on them, too. KJW ended up with one welt larger than the responding officer’s thumb, and another smaller welt. AJB experienced puffiness, discoloration, and bleeding to the gums, and severe pain in the head. AJB stated that Roquemore had thrown her grandmother to the ground. In addition to this incident, the total amount of fines for the criminal damages at this point hovered around $101,000. In September 2023, Roquemore and the person involved with the domestic incident at the Red Roof Inn, whose tires were slashed, and was identified in court documents, used someone else’s credit card after breaking into their car in Milton, Wisconsin. They charged a total of $568.04 on their card at a McDonald’s, Mobil gas station, and Walmart on the east side of Madison, resulting in four felony charges, adding another $40,000. The person identified as JEO pleaded guilty to the felony charge last month. This year, officers with the Fitchburg Police Department brought about the charges of felony bail jumping and misdemeanor obstructing an officer after a traffic stop where she gave a false name belonging to a close friend/family member of hers. Around 1 a.m. on Monday, May 20, an FPD officer was monitoring traffic when they observed a car whose license was not valid. Once the car began driving around 50 miles per hour in a 30 mph posted zone, the officer performed a traffic stop. Roquemore was in the driver’s seat and told the officer that she and the passenger, identified as LMM, were in a rush to get home for a sick child. Roquemore verbally identified herself to the officer as another individual found to be a childhood friend of hers. The officer detected drug paraphernalia and smelled marijuana, asking how much was in the car. Roquemore confirmed that she had a small amount on her and gave the officer a small plastic baggie, according to the court documents. After the officer learned that Roquemore was not who she said she was, they searched the car and found a wallet with identification, cards, and a Social Security card all with Roquemore’s name on it. Dispatch was requested to search her name, and it was advised that there was an active warrant out of Fond du Lac for failure to pay. Roquemore stated that she gave a false name because she “had multiple open cases stating that she shall not operate a motor vehicle and did not want to go to jail.” Roquemore told the officer that she knew she shouldn’t have lied about her name but stated that she was “simply trying to get LLM home, as LLM had been drinking,” according to the criminal complaint. Totaled together, Roquemore faces around 90.5 years if convicted for the ten felonies and eight misdemeanors. Jury selection is scheduled for October 7, and the trial is set to begin the next day. *This story was updated to reflect the warrant for arrest being returned on September 24, 2024 at Do you have a breaking news tip to share with 27 News? Email us atnews@wkow.com, or call 608-273-2727. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Digital Content Producer Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. Enjoyiana Nururdin, M.A. \"on-jee-ahna nerd-een\" joined WKOW as a Digital Content Producer in March 2024. She is originally from Madison, where she attended La Follette High School and the University of Wisconsin-Madison for her Bachelor of Arts in Reporting.At UW-Madison, she served as the Managing Editor for The Black Voice, a Black-student-led online publication, and as the Student Representative for the National Association of Black Journalists. Enjoyiana was also a food reporter for The Capital Times, featuring local eateries near Madison's campus. She became fascinated with coverage of the 2020 Presidential Election and decided to continue her education in political science and media studies.After graduating from UW, Enjoyiana pursued her Master of Arts in Political Journalism from Columbia University in the City of New York. Her master's thesis highlighted mutual aid efforts in food security and activism in Black and Brown communities. {{description}} Email notifications are only sent once a day, and only if there are new matching items. **More From 27 News** Updated1 hr ago Updated24 mins ago Updated1 hr ago Updated1 hr ago Updated1 hr ago Updated2 hrs ago **Recommended for you** Facebook Twitter Instagram News Coronavirus Weather Sports Watch Video Things To Do Contact Search Careers Advertise with WKOW FCC Public File EEO Report Closed Captioning FCC Applications Advertiser Services PSA Policy AI Usage Policy Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}