{"id": 1841, "name": "Watts Up with that", "domain": "wattsupwiththat.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://wattsupwiththat.com/2025/06/09/report-bidens-epa-hid-comments-from-dept-of-energy-that-undermined-key-part-of-epa-power-plant-rule/#comments", "title": "Report Bidens Epa Hid Comments From Dept Of Energy That Undermined Key Part Of Epa Power Plant Rule", "content": "Wednesday, June 11, 2025 **Watts Up With That?** The world's most viewed site on global warming and climate change Log In AboutAwardsContactCompose storyFAQsMy Blog SpawnPolicyPrivacy PolicyPublications and ProjectsTest Awards Contact Compose story FAQs My Blog Spawn Policy Privacy Policy Publications and Projects Test Awards Contact Compose story FAQs My Blog Spawn Policy Privacy Policy Publications and Projects Test Climate TV Books Everything ClimateClaimed DangersIncrease in U.S. Wildfires Due to Climate ChangeGreat Lakes Water Levels are falling due to Climate ChangeClimate Change vs. Crop ProductionCoral Reefs are Dying Because of Climate ChangeClimate Change is Lowering Water Levels at Lake TahoeCoal Pollution Can Be Seen Pouring From Power Plant SmokestacksOceans, Sea Level, and IceAntarctic Ice MeltGreenland Ice Loss Will Cause Dangerous Sea Level RiseOcean AcidificationSea Level Rise is Accelerating DramaticallyEarth’s Temperature2023 Was Earth’s Hottest 12 Months in 125,000 yearsThe Global Temperature Record Says We Are in a ‘Climate Emergency’Unprecedented Heat Wave in Pacific Northwest was Driven by Climate ChangeU.S. Heat Waves are Getting WorseWe Need to Limit Global Warming to 1.5 Degrees C°U.S. Temperatures are Rising DramaticallyGlobal Warming is Causing Cold SpellsUrban Heat Islands Do Not Exaggerate Global WarmingWe are in the ‘Hottest Ever’ Period Due to Climate ChangeMeasurement, Emissions & Climate ModelsClimate SensitivityInstrumental Temperature Records Demonstrate Man-Made Global WarmingThe 130-Degree F Reading in Death Valley Is A World RecordIs The US surface Temperature Record a Reliable Indicator of Warming?Climate Change is Causing Accelerated 21st Century Surface WarmingMeasuring the Earth’s Global Average Temperature is a Scientific and Objective ProcessEl Niño and Climate ChangeClimate Models have Accurately Predicted 30 Years of WarmingA Climate Tipping Point Will Happen at 1.5°C of WarmingWeatherClimate Change Will Increase the Number and Severity of TornadoesClimate Change is Increasing the Strength and Frequency of HurricanesClimate Change is Causing More FloodsDroughts are Increasing Due to Climate Change Claimed DangersIncrease in U.S. Wildfires Due to Climate ChangeGreat Lakes Water Levels are falling due to Climate ChangeClimate Change vs. Crop ProductionCoral Reefs are Dying Because of Climate ChangeClimate Change is Lowering Water Levels at Lake TahoeCoal Pollution Can Be Seen Pouring From Power Plant Smokestacks Increase in U.S. Wildfires Due to Climate Change Great Lakes Water Levels are falling due to Climate Change Climate Change vs. Crop Production Coral Reefs are Dying Because of Climate Change Climate Change is Lowering Water Levels at Lake Tahoe Coal Pollution Can Be Seen Pouring From Power Plant Smokestacks Oceans, Sea Level, and IceAntarctic Ice MeltGreenland Ice Loss Will Cause Dangerous Sea Level RiseOcean AcidificationSea Level Rise is Accelerating Dramatically Antarctic Ice Melt Greenland Ice Loss Will Cause Dangerous Sea Level Rise Ocean Acidification Sea Level Rise is Accelerating Dramatically Earth’s Temperature2023 Was Earth’s Hottest 12 Months in 125,000 yearsThe Global Temperature Record Says We Are in a ‘Climate Emergency’Unprecedented Heat Wave in Pacific Northwest was Driven by Climate ChangeU.S. Heat Waves are Getting WorseWe Need to Limit Global Warming to 1.5 Degrees C°U.S. Temperatures are Rising DramaticallyGlobal Warming is Causing Cold SpellsUrban Heat Islands Do Not Exaggerate Global WarmingWe are in the ‘Hottest Ever’ Period Due to Climate Change 2023 Was Earth’s Hottest 12 Months in 125,000 years The Global Temperature Record Says We Are in a ‘Climate Emergency’ Unprecedented Heat Wave in Pacific Northwest was Driven by Climate Change U.S. Heat Waves are Getting Worse We Need to Limit Global Warming to 1.5 Degrees C° U.S. Temperatures are Rising Dramatically Global Warming is Causing Cold Spells Urban Heat Islands Do Not Exaggerate Global Warming We are in the ‘Hottest Ever’ Period Due to Climate Change Measurement, Emissions & Climate ModelsClimate SensitivityInstrumental Temperature Records Demonstrate Man-Made Global WarmingThe 130-Degree F Reading in Death Valley Is A World RecordIs The US surface Temperature Record a Reliable Indicator of Warming?Climate Change is Causing Accelerated 21st Century Surface WarmingMeasuring the Earth’s Global Average Temperature is a Scientific and Objective ProcessEl Niño and Climate ChangeClimate Models have Accurately Predicted 30 Years of WarmingA Climate Tipping Point Will Happen at 1.5°C of Warming Climate Sensitivity Instrumental Temperature Records Demonstrate Man-Made Global Warming The 130-Degree F Reading in Death Valley Is A World Record Is The US surface Temperature Record a Reliable Indicator of Warming? Climate Change is Causing Accelerated 21st Century Surface Warming Measuring the Earth’s Global Average Temperature is a Scientific and Objective Process El Niño and Climate Change Climate Models have Accurately Predicted 30 Years of Warming A Climate Tipping Point Will Happen at 1.5°C of Warming WeatherClimate Change Will Increase the Number and Severity of TornadoesClimate Change is Increasing the Strength and Frequency of HurricanesClimate Change is Causing More FloodsDroughts are Increasing Due to Climate Change Climate Change Will Increase the Number and Severity of Tornadoes Climate Change is Increasing the Strength and Frequency of Hurricanes Climate Change is Causing More Floods Droughts are Increasing Due to Climate Change Claimed DangersIncrease in U.S. Wildfires Due to Climate ChangeGreat Lakes Water Levels are falling due to Climate ChangeClimate Change vs. Crop ProductionCoral Reefs are Dying Because of Climate ChangeClimate Change is Lowering Water Levels at Lake TahoeCoal Pollution Can Be Seen Pouring From Power Plant Smokestacks Increase in U.S. Wildfires Due to Climate Change Great Lakes Water Levels are falling due to Climate Change Climate Change vs. Crop Production Coral Reefs are Dying Because of Climate Change Climate Change is Lowering Water Levels at Lake Tahoe Coal Pollution Can Be Seen Pouring From Power Plant Smokestacks Increase in U.S. Wildfires Due to Climate Change Great Lakes Water Levels are falling due to Climate Change Climate Change vs. Crop Production Coral Reefs are Dying Because of Climate Change Climate Change is Lowering Water Levels at Lake Tahoe Coal Pollution Can Be Seen Pouring From Power Plant Smokestacks Oceans, Sea Level, and IceAntarctic Ice MeltGreenland Ice Loss Will Cause Dangerous Sea Level RiseOcean AcidificationSea Level Rise is Accelerating Dramatically Antarctic Ice Melt Greenland Ice Loss Will Cause Dangerous Sea Level Rise Ocean Acidification Sea Level Rise is Accelerating Dramatically Antarctic Ice Melt Greenland Ice Loss Will Cause Dangerous Sea Level Rise Ocean Acidification Sea Level Rise is Accelerating Dramatically Earth’s Temperature2023 Was Earth’s Hottest 12 Months in 125,000 yearsThe Global Temperature Record Says We Are in a ‘Climate Emergency’Unprecedented Heat Wave in Pacific Northwest was Driven by Climate ChangeU.S. Heat Waves are Getting WorseWe Need to Limit Global Warming to 1.5 Degrees C°U.S. Temperatures are Rising DramaticallyGlobal Warming is Causing Cold SpellsUrban Heat Islands Do Not Exaggerate Global WarmingWe are in the ‘Hottest Ever’ Period Due to Climate Change 2023 Was Earth’s Hottest 12 Months in 125,000 years The Global Temperature Record Says We Are in a ‘Climate Emergency’ Unprecedented Heat Wave in Pacific Northwest was Driven by Climate Change U.S. Heat Waves are Getting Worse We Need to Limit Global Warming to 1.5 Degrees C° U.S. Temperatures are Rising Dramatically Global Warming is Causing Cold Spells Urban Heat Islands Do Not Exaggerate Global Warming We are in the ‘Hottest Ever’ Period Due to Climate Change 2023 Was Earth’s Hottest 12 Months in 125,000 years The Global Temperature Record Says We Are in a ‘Climate Emergency’ Unprecedented Heat Wave in Pacific Northwest was Driven by Climate Change U.S. Heat Waves are Getting Worse We Need to Limit Global Warming to 1.5 Degrees C° U.S. Temperatures are Rising Dramatically Global Warming is Causing Cold Spells Urban Heat Islands Do Not Exaggerate Global Warming We are in the ‘Hottest Ever’ Period Due to Climate Change Measurement, Emissions & Climate ModelsClimate SensitivityInstrumental Temperature Records Demonstrate Man-Made Global WarmingThe 130-Degree F Reading in Death Valley Is A World RecordIs The US surface Temperature Record a Reliable Indicator of Warming?Climate Change is Causing Accelerated 21st Century Surface WarmingMeasuring the Earth’s Global Average Temperature is a Scientific and Objective ProcessEl Niño and Climate ChangeClimate Models have Accurately Predicted 30 Years of WarmingA Climate Tipping Point Will Happen at 1.5°C of Warming Climate Sensitivity Instrumental Temperature Records Demonstrate Man-Made Global Warming The 130-Degree F Reading in Death Valley Is A World Record Is The US surface Temperature Record a Reliable Indicator of Warming? Climate Change is Causing Accelerated 21st Century Surface Warming Measuring the Earth’s Global Average Temperature is a Scientific and Objective Process El Niño and Climate Change Climate Models have Accurately Predicted 30 Years of Warming A Climate Tipping Point Will Happen at 1.5°C of Warming Climate Sensitivity Instrumental Temperature Records Demonstrate Man-Made Global Warming The 130-Degree F Reading in Death Valley Is A World Record Is The US surface Temperature Record a Reliable Indicator of Warming? Climate Change is Causing Accelerated 21st Century Surface Warming Measuring the Earth’s Global Average Temperature is a Scientific and Objective Process El Niño and Climate Change Climate Models have Accurately Predicted 30 Years of Warming A Climate Tipping Point Will Happen at 1.5°C of Warming WeatherClimate Change Will Increase the Number and Severity of TornadoesClimate Change is Increasing the Strength and Frequency of HurricanesClimate Change is Causing More FloodsDroughts are Increasing Due to Climate Change Climate Change Will Increase the Number and Severity of Tornadoes Climate Change is Increasing the Strength and Frequency of Hurricanes Climate Change is Causing More Floods Droughts are Increasing Due to Climate Change Climate Change Will Increase the Number and Severity of Tornadoes Climate Change is Increasing the Strength and Frequency of Hurricanes Climate Change is Causing More Floods Droughts are Increasing Due to Climate Change ReferenceClimate SensitivityAtmosphere PageCO2 PageAtmospheric Oscillation PageClimatic PhenomenaENSO PageENSO Forecast PagePolar Vortex PageNorthern Polar Vortex PageSouthern Polar Vortex PageClimategate“Extreme Weather” PageTornado PageTropical Cyclone PageGeomagnetism PageGlobal Temperature – ClimateGlobal Climate PageGlobal Temperature PageGlossaryOcean PageOceanic Oscillation PagePaleoclimate PageSea Ice PageBeaufort Sea Ice PageGreat Lakes Ice PageResearchPotential Climatic Variables PageThe Spencer-Braswell & Dessler papersSolar PageUS Weather – ClimateUS Climate PageUS Weather Page Climate Sensitivity Atmosphere PageCO2 PageAtmospheric Oscillation Page CO2 Page Atmospheric Oscillation Page Climatic PhenomenaENSO PageENSO Forecast PagePolar Vortex PageNorthern Polar Vortex PageSouthern Polar Vortex Page ENSO Page ENSO Forecast Page Polar Vortex Page Northern Polar Vortex Page Southern Polar Vortex Page Climategate “Extreme Weather” PageTornado PageTropical Cyclone Page Tornado Page Tropical Cyclone Page Geomagnetism Page Global Temperature – ClimateGlobal Climate PageGlobal Temperature Page Global Climate Page Global Temperature Page Glossary Ocean PageOceanic Oscillation Page Oceanic Oscillation Page Paleoclimate Page Sea Ice PageBeaufort Sea Ice PageGreat Lakes Ice Page Beaufort Sea Ice Page Great Lakes Ice Page ResearchPotential Climatic Variables PageThe Spencer-Braswell & Dessler papers Potential Climatic Variables Page The Spencer-Braswell & Dessler papers Solar Page US Weather – ClimateUS Climate PageUS Weather Page US Climate Page US Weather Page Climate Sensitivity Atmosphere PageCO2 PageAtmospheric Oscillation Page CO2 Page Atmospheric Oscillation Page CO2 Page Atmospheric Oscillation Page Climatic PhenomenaENSO PageENSO Forecast PagePolar Vortex PageNorthern Polar Vortex PageSouthern Polar Vortex Page ENSO Page ENSO Forecast Page Polar Vortex Page Northern Polar Vortex Page Southern Polar Vortex Page ENSO Page ENSO Forecast Page Polar Vortex Page Northern Polar Vortex Page Southern Polar Vortex Page Climategate “Extreme Weather” PageTornado PageTropical Cyclone Page Tornado Page Tropical Cyclone Page Tornado Page Tropical Cyclone Page Geomagnetism Page Global Temperature – ClimateGlobal Climate PageGlobal Temperature Page Global Climate Page Global Temperature Page Global Climate Page Global Temperature Page Glossary Ocean PageOceanic Oscillation Page Oceanic Oscillation Page Oceanic Oscillation Page Paleoclimate Page Sea Ice PageBeaufort Sea Ice PageGreat Lakes Ice Page Beaufort Sea Ice Page Great Lakes Ice Page Beaufort Sea Ice Page Great Lakes Ice Page ResearchPotential Climatic Variables PageThe Spencer-Braswell & Dessler papers Potential Climatic Variables Page The Spencer-Braswell & Dessler papers Potential Climatic Variables Page The Spencer-Braswell & Dessler papers Solar Page US Weather – ClimateUS Climate PageUS Weather Page US Climate Page US Weather Page US Climate Page US Weather Page Predictions Submit StorySend News Tip Send News Tip Send News Tip Home 2025 June 9 REPORT: Biden’s EPA hid comments from Dept. of Energy that undermined key part of EPA power plant rule **REPORT: Biden’s EPA hid comments from Dept. of Energy that undermined key part of EPA power plant rule** From CLIMATE DEPOT By Admin https://justthenews.com/politics-policy/energy/biden-admin-epa-may-have-buried-comments-undermining-key-part-its-power ByKevin Killough The Clean Power Plan 2.0 was supported by a finding that carbon capture technology had been “adequately demonstrated.” The EPA sought and got comments from the DOE, which disputed that “demonstration.” Somehow those comments never made it into the administrative record. Former President Joe Biden, as well as his Democratic predecessor Barack Obama, pledged to “follow the science” when it came to climate policies. Since President Donald Trump assumed office — a man accused of waging a “war on science” — revelations have shown that, when it came to previous administrations, sometimes science was either shaped to serve preferred policies or dismissed when it didn’t support them. Energy SecretaryChris Wright confirmed in Marchthat the Biden-Harris administration had completed a study on liquefied natural gas exports prior to enacting a pause on export permits, the stated intention of which was to complete such a study. Wright stated that the Biden-Harris administration didn’t like what the study said, so they set out to produce one that would support the climate policies they wanted. Emails exchanged at the Obama-era EPAin 2009 showed that the so-called endangerment finding, which has been the basis for much of the EPA’s regulation of carbon dioxide emissions ever since, was a foregone conclusion even before the agency announced the finding. It appears that the Biden-Harris administration hid comments that would have undermined itsClean Power Plan 2.0 rule(CPP2), which theTrump administration is currently reviewing. The EPA had sought comments from the Department of Energy’s National Energy Technology Lab (NETL) on the efficacy of carbon capture technology prior to proposing the rule. These comments, which were somehow scrubbed from the administrative record, disputed a key claim the rule is based on. Those missing comments, a legal expert says, could provide a basis for the rule’s repeal. Casting significant doubt The CPP2 requires all coal plants to install carbon capture technology by 2039, which captures and stores emissions in underground geological formations. It also requires new natural gas-fired power plants to install the technology, with requirements starting in 2032.Experts warned the rules would drive up electricity costsand destabilize the grid by disincentivizing reliable power from coal and natural gas in favor of intermittent wind and solar power. The Clean Air Act authorizes the EPA to develop new emissions standards, but those standards must be achievable at a reasonable cost. The technology required for compliance must also beadequately demonstrated. Documents obtained byJust the Newsshow that the EPA formally sought comments from NETL in March 2023 on its soon-to-be proposed rule, which was put out forpublic comment the following May. In December, Rep. James Comer, R-Ky., chair of the House Committee on Oversight and Accountability, wrote to then-EPA Administrator Micheal Regan to ask for the names of people in the Biden administration who had provided comments to the EPA on an internal draft of the CPP2. These comments, Comer’s letter explains, “cast significant doubt” over whether the proposed CPP2 is viable. Letter-to-EPA-Unmasking-Comments.pdf The proposed rule allowed for two technologies — hydrogen and carbon capture and underground storage (CCUS) — to meet the emissions standards on fossil fuel-burning power plants. Comer’s letter quotes two unnamed authors expressing that neither technology was viable. Hydrogen was removed from the rule when it wasfinalized in April 2024. Carbon capture technology, however, was part of the final rule, even though the comments from one unnamed NETL author stated that “CCUS remains prohibitively expensive even after use of funds or tax credits made available through the Inflation Reduction Act.” Underperforming failure The comments disputing the adequacy of CCUS went further than those in Comer’s letter.Government Oversight and Accountability(GAO), a watchdog group, filed a FOIA request in April seeking comments that NETL engineers had submitted via the NETL network in response to the March 2023 request by the EPA for the administrative record of what would later become the CPP2 proposed rule. The EPA based its determination that CCUS was “adequately demonstrated” on the performance of theBoundary Dam Unit #3(BD3), which is a Canadian coal-fired power plant fitted with carbon capture technology. An April 2024 report by theInstitute for Energy Economics and Financial Analysiscalled the project an “under-performing failure.” Despite $1 billion CAD spent on the project, it was, as of April 2024, capturing far less than the 90% originally promised. Its capture rate through the end of 2023 was just 57%, which was 63% of the 90% promised, the report found. Comments from NETL engineers, according to the GAO’s records request, state that “the ongoing operating performance of the same BD3 demonstration project is being, once again, misconstrued as having provided sufficient justification for claiming satisfactory performance to allow the technology to be considered ‘adequately demonstrated.’” Another comment states that BD3 only approached the 90% promised target for two months over a period of 8 years and three months. Another comment states that after 8 years and three months “of demonstration, such failure to meet negligible standards for emissions limitations, over a full-year period ending less than one year ago, argues strongly for not considering BD3 as a credible basis for Best System of Emissions Reduction and ‘adequate demonstration’ of the related technology.” “These comments were sanitized at some point in this process and were not included in NETL’s and/or DoE’s comments to EPA, which made their way into the administrative record,” according to the GAO’s record request. 4.10.25 GAO NETL request for March 2023 CPP comments.pdf Other indications of doubt Chris Horner, an environment and energy policy attorney, toldJust the Newsthat Comer’s letter, which was directed at the EPA, suggests where the comments might have been scrubbed. “From information revealed by the House Oversight Committee, there’s pretty good reason to conclude that the comments did make it to and were buried by EPA, versus by DOE,” Horner said. Whatever happened to the comments, other evidence also suggests the EPA never put much stock in the capabilities of CCUS technology. In May 2024,two dozen states filed a lawsuitover relatedEPA ruleswith the U.S. Court of Appeals for the District of Columbia. The following October, the Louisiana Public Service Commission (LPSC) asked the court to allow them tofile a briefin support of the lawsuit. The LPSC said in their petition that the EPA’s own modeling showed far less confidence in carbon capture than it had publicly stated. The agency’sIntegrated Planning Modelprojects no combined-cycle natural gas units will have carbon capture technologies added through 2055, which is the end of the project period. The EPA also projects that no coal units will be constructed with carbon capture through 2055. The modeling document shows that only one gigawatt of existing coal capacity will be operating through 2055. An EPA spokesperson toldJust the Newsthat the EPA, as part of its reconsideration of the CPP2, is developing a proposed rule, which will be published once it has completed an inter-agency review and been signed by EPA Administrator Lee Zeldin. “Many have voiced concerns that the last administration’s replacement for that rule is similarly overreaching and an attempt to shut down affordable and reliable electricity generation in the United States, raising prices for American families, and increasing the country’s reliance on foreign forms of energy,” the spokesperson said. Kill shot Horner said these comments missing from the administrative record provide a means by which the EPA could effectively nullify the rule. In 2021, the Supreme Court killed Obama’s “Clean Power Plan” with its ruling inWest Virginia v. EPA. The challenged rule set emission reduction targets that could be met by either eliminating coal-fired power plants and replacing them with natural gas turbines, improving energy efficiency, or increasing the use of wind and solar power. The court ruled that the EPA had exceeded its authority by trying to control the nation’s power system generation, because Congress did not grant an administrative agency such control without a clear statute granting that broad authority. The court, however, affirmed the agency’s ability to regulate carbon dioxide emissions at new and existing power plants. By using carbon capture without any required generation shifting, the Biden administration likely expected to avoid any conflicts with the ruling. Horner said that, if the parties agree the record is incomplete, the Trump administration’s EPA can avoid arguing for months whether CCS has been adequately demonstrated. By simply documenting that the record shows the agency knowingly and falsely claimed CCS was adequately demonstrated, that’s the end of it. Horner said he doesn’t think the D.C. Circuit court would ignore that fact and deny the agency the opportunity to clean its own house. “There seems to me no chance the parties would be denied an agency confession of error. That’s what’s really grabbing me about this. These guys have a kill shot, and I don’t know if they know it,” Horner said. **Share this:** Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Post More Click to share on GETTR (Opens in new window)GETTR Tweet Click to share on Telegram (Opens in new window)Telegram **Like this:** **Related** **Discover more from Watts Up With That?** Subscribe to get the latest posts sent to your email. Type your email… Subscribe **Post navigation** Why am I not surprised Democrats Lie. It’s what they do on every topic of political interest Don’t believe a thing a Democrat says unless you check it first. They are not trustworthy. Mr. Abbott: Yes, dems lie, but specifically they hide evidence to obscure truth. And they do it like the mafia disposes of the smoking gun, right in front of you. It used to be, bad actors only regretted getting caught, but dems don’t even do that anymore.If you read the Federalist (I recommend) you’ll learn FBI agents had the capacity to hide efiles to the point supervisors could not find the files. It’s a huge scandal, a US senator named Grassley is on it, but the story has not gotten legs. Yet. The CPP2 requires all coal plants to install carbon capture technology by 2039, which captures and stores emissions in underground geological formations. which captures and stores emissions in underground geological formations. which captures and stores emissions in underground geological formations. ________________________________________________________________________ Sequestering CO2 is stupid. About 15 years ago, Drax power stations (UK) declared an intention to install CC and store it under the North Sea. Yes I thought, I’ll believe it when I see it. Some years later they abandoned the idea, because it was too costly. AND dangerous! Drain that swamp. Let’s not forget that COVID deindustrialisation didn’t afffect the idiosyncratic shapes of the Keeling curve sawtooth. So what does that mean. Oh and you can’t have climate change without change in tropical cyclones. QED A 10 to 20% dip for barely 2 months would not show up in such a noisy signal. My point ils that the idiosyncratic sawtooth is not noisy. Lay your ruler against the peaks and troughs of the sawtooth over the COVID years and it’s a dead straight line and the idiosyncratic shape is pretty similar thu’out Years not months When democrats say “follow the science” they really mean “push the agenda and make ‘the science’ fit later. Sort of how the IPCC functions. EPA functions the same way. I have researched a number of drat rules that make citations into research that support their desired outcome. But when I went back to look at the papers, there was more information that countered the results EPA was trying to support. They know most people will not go read the referenced papers but instead just accept the referenced paper supports the conclusion. From the article: “Experts warned the rules would drive up electricity costs and destabilize the grid by disincentivizing reliable power from coal and natural gas in favor of intermittent wind and solar power.” This was the whole purpose of requiring CO2 capture. They wanted to put fossil fuel power plants out of business. There’s a coal-fired power plant near where I live. Obama was trying to force them to convert to natural gas, but after the Supreme Court ruling, this pressure was no longer there. The coal-fired power plant is still producing our electricity. During the blackouts of 2021, our coal-fired power plant never missed a beat. And we’re happy about that! 🙂 Science am I! Was it Dr. Fauci, or some other (super)scientist? I think the DC Circuit will excuse any misconduct by a Democratic administration. Noble Cause Corruption 101. Is it really fair to call it “Biden’s EPA”? Maybe Americans should just assume those 4 years were post-Covid filler. Every EPA employee who signed off on this lying and cheating should be fired. I don’t give a damn what any administration says if it’s lying and cheating don’t do it. If you are forced to do it officially record your view. It appears so bad right now I wonder if it wouldn’t be better to get rid of everyone and start over or dismantle the agency. LoginSign up to comment or become a paid supporter:Click Here **Donate to support WUWT** **The Maxim of our resolve** “Walk toward the fire. Don’t worry about what they call you.” – Andrew Breitbart |read more **Blog Stats** 569,724,172 hits “…the world’s most viewed climate website”– Fred PearceThe Climate Files:The Battle for the Truth about Global Warming “…invaluable”– Steven F. Hayward,The Weekly Standard “…changed the world and is one of the most influential resources on global warming.– Jonathon Moseley,American Thinker “…flashy (apparently widely distributed)”– Michael E. Mann **Bookmarks** A Walk On The Natural Side – Jim Steele American Elephants Appinsys Australian Climate Madness C3 Headlines Cartoons By Josh Climate Audit Climate Change 101 Climate Change Dispatch Climate Depot Climate Resistance Climate Scepticism Climate Science – Pielke Sr. Climate Views CO2 Science Die Kalte Sonne Dr. Jennifer Marohasy Dr. Judith Curry Dr. Norman Page Dr. Roger Pielke Jr. Dr. Roy Spencer Dr. Susan Crockford – polarbearscience Dr. Tim Ball Environment & Climate News EU Referendum – Richard North Friends of Science ICECAP International Climate Science Coalition Jo Nova LandShape.org Manhattan Contrarian Master Resource No Tricks Zone NOT A LOT OF PEOPLE KNOW THAT Our World in Data Sea Level Info SOHO solar images Solar Cycle 24 Board Stoat – Connolley Surfacestations Main Tallbloke’s Talkshop Tamino’s Open Mind The Air Vent The Chiefio – E.M. Smith The GWPF The Hockey Schtick The Next Grand Minimum Tom Nelson Trust Yet Verify Warren Meyer Warwick Hughes Weather Picture of the Day WFT – Interactive Climate Graph Engine William Briggs **ENSO METER** **ENSO/SST Page** **Feed Me** RSS - Posts RSS - Comments **Meta** Register Log in Entries feed Comments feed WordPress.org **Copyright Notice** Material on this website is copyright © 2006-2024, by Anthony Watts, and may not be stored or archived separately, rebroadcast, or republished without written permission. For permission, contact us. See the About>Contact menu under the header. All rights reserved worldwide. Some material from contributors may contain additional copyrights of their respective company or organization. **Top Posts & Pages** Sunnova Declares Bankruptcy The Conversation’s Greenland Ice Melt Hype: History and Data Say Otherwise Shock New Evidence Shows Unnatural 60-Second Heat Spikes Drive Many UK Met Office Temperature ‘Records’ DOT asked to terminate illegal floating wind grant Empty Seats and Hurricane Histrionics REPORT: Biden’s EPA hid comments from Dept. of Energy that undermined key part of EPA power plant rule The Hill Pushes Discredited Ocean Acidity Scares We Need a ‘Kill Switch’ on Foreign Powers Tampering With Our Electric Grid Defund The National Academy of Sciences! When the Narrative Dies: Climate.gov and the Quiet Collapse of Climate Alarmism **Recent Posts** Carbon Capture Comes Crashing Down (Again): A Comedy in Subsidies When the Narrative Dies: Climate.gov and the Quiet Collapse of Climate Alarmism Shock New Evidence Shows Unnatural 60-Second Heat Spikes Drive Many UK Met Office Temperature ‘Records’ Govt To Invest £14.2 Bn In Sizewell C Sunnova Declares Bankruptcy DOT asked to terminate illegal floating wind grant Empty Seats and Hurricane Histrionics The Hill Pushes Discredited Ocean Acidity Scares The Conversation’s Greenland Ice Melt Hype: History and Data Say Otherwise We Need a ‘Kill Switch’ on Foreign Powers Tampering With Our Electric Grid REPORT: Biden’s EPA hid comments from Dept. of Energy that undermined key part of EPA power plant rule Defund The National Academy of Sciences! Seattle Times Climate Lab Misinforms about Climate Change, Sea-Level Rise, and Seattle Flooding DOUBLE GROAN: Another “new normal” nonsense paper Who would have guessed it? “Tech sector emissions, energy use grow with rise of AI” **Archives** **Categories** **Sea Ice Page** **Solar Images and Data Page**"}