{"id": 102, "name": "Aspen Times", "domain": "aspentimes.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.aspentimes.com/news/homeland-security-pulls-down-sanctuary-jurisdictions-list-identifying-several-colorado-municipalities-counties/", "title": "Homeland Security Pulls Down Sanctuary Jurisdictions List Identifying Several Colorado Municipalities Counties", "content": "NewsLocalSnowmassCrimeBusinessCoronavirusSilver Lining SeriesFaces of the PandemicThe Great Realization ProjectEducationState/RegionalMarijuanaWeatherObituariesNation/WorldWildfiresElectionOpinionColumnsGuest CommentaryEditorialsLetter to the EditorSportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Local Snowmass Crime Business CoronavirusSilver Lining SeriesFaces of the PandemicThe Great Realization Project Silver Lining Series Faces of the Pandemic The Great Realization Project Education State/Regional Marijuana Weather Obituaries Nation/World Wildfires Election OpinionColumnsGuest CommentaryEditorialsLetter to the EditorSportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Columns Guest Commentary Editorials Letter to the Editor SportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Preps Snow League 2025 Outdoors X GamesX Games 2025X Games 2024X Games 2023 X Games 2025 X Games 2024 X Games 2023 World Cup 2024 EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Aspen Times Weekly Calendar Food & Wine Video MagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Local Snowmass Crime Business CoronavirusSilver Lining SeriesFaces of the PandemicThe Great Realization Project Silver Lining Series Faces of the Pandemic The Great Realization Project Silver Lining Series Faces of the Pandemic The Great Realization Project Education State/Regional Marijuana Weather Obituaries Nation/World Wildfires Election OpinionColumnsGuest CommentaryEditorialsLetter to the EditorSportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Columns Guest Commentary Editorials Letter to the Editor SportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Preps Snow League 2025 Outdoors X GamesX Games 2025X Games 2024X Games 2023 X Games 2025 X Games 2024 X Games 2023 World Cup 2024 EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Aspen Times Weekly Calendar Food & Wine Video MagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Columns Guest Commentary Editorials Letter to the Editor SportsPrepsSnow League 2025OutdoorsX GamesX Games 2025X Games 2024X Games 2023World Cup 2024EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Preps Snow League 2025 Outdoors X GamesX Games 2025X Games 2024X Games 2023 X Games 2025 X Games 2024 X Games 2023 World Cup 2024 EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Aspen Times Weekly Calendar Food & Wine Video MagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Preps Snow League 2025 Outdoors X GamesX Games 2025X Games 2024X Games 2023 X Games 2025 X Games 2024 X Games 2023 X Games 2025 X Games 2024 X Games 2023 World Cup 2024 EntertainmentAspen Times WeeklyCalendarFood & WineVideoMagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Aspen Times Weekly Calendar Food & Wine Video MagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Aspen Times Weekly Calendar Food & Wine Video MagazinesArtBest of Aspen, Snowmass, and BasaltCyclingMagazineDiscover BasaltEatFood & Wine ClassicMidValley HolidaysRoaring Fork Valley HeartbeatSummer in Aspen and SnowmassWinter in Aspen and SnowmassPhotosClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos ClassifiedsCelebrationsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsWolvesNewsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Place Legal Ad Search Legal Ads Wolves Newsletters **News** Local Snowmass Crime Business Coronavirus Education State/Regional Marijuana Weather Obituaries Nation/World Wildfires **Election** **Opinion** Columns Guest Commentary Editorials Letter to the Editor **Sports** Preps Snow League 2025 Outdoors X Games World Cup 2024 **Entertainment** Aspen Times Weekly Calendar Food & Wine Video **Magazines** Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass **Photos** **Classifieds** Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad Legals **Wolves** **Newsletters** Sign In Register Profile Newsletters Interests Bookmarks Reading History Logout E-Edition| Submissions| Advertise| Contact Us| **Homeland Security pulls down ‘sanctuary jurisdictions’ list identifying several Colorado municipalities, counties** News|Jun 9, 2025 ateres-martinez@aspentimes.com The Department of Homeland Security’s list of “sanctuary jurisdictions” — which listed several cities and counties on Colorado’s Western Slope —was pulled from its websiteon Sunday, June 1. The department published the list on May 29, citing its decision under President Donald Trump’sProtecting American Communities from Criminal Aliens executive order. The page claimed that “sanctuary jurisdictions undermine the rule of law and endanger the lives of Americans and law enforcement.” Of the 53 sanctuary jurisdictions identified for Colorado when the list was taken down, Western Slope counties included Eagle, Garfield, Pitkin, Rio Grande, Summit and Lake counties. Towns included Avon, Basalt, Carbondale, Dillion, Eagle and Vail. Routt County was not included on the list. Several Colorado countieshave declared themselves as “non-sanctuary,” including Garfield County.Despite commissioners signing a resolution in 2024declaring that it would not aid or provide shelter to undocumented migrants, the county was still included in the list. “As far as that whole list, it’s just kind of BS,” Garfield County Commissioner Tom Jankovsky said. “We have our resolution. The sheriff follows state laws. That’s kind of where we are.” Jankovsky said Garfield County commissioners passing a resolution stating it’s not a sanctuary county was “primarily in response to the Venezuelans who were camping out in Carbondale.” “We were stating that we were not going to provide assistance to undocumented immigrants as far as food and shelter,” he said. “If they got here, then they need to be able to take care of themselves.” Of the other Western Slope counties included in the department’s list, none have officially passed resolutions declaring themselves as sanctuary jurisdictions. Eagle County,while having passed a resolutionrelating to support for local immigrants,does not adopt the label. Several may have still been identified due to having policies that align with sanctuary principles. According to the Department of Homeland Security, criteria for a county or city to be designated as a sanctuary jurisdiction is based on multiple factors: “self-identification as a sanctuary jurisdiction, noncompliance with Federal law enforcement in enforcing immigration laws, restrictions on information sharing, and legal protections for illegal aliens.” Colorado itself was listed by the department as a sanctuary state based on “self-Identification as a state sanctuary jurisdiction.” Colorado Gov. Jared Polis has maintained that Colorado is not a sanctuary state, emphasizing its cooperation with federal law enforcement on criminal investigations. However, Colorado lawlimits how local law enforcement can cooperatewith U.S. Immigration and Customs Enforcement. In May,Polis also signed legislationprohibiting jails from delaying the release of individuals for immigration enforcement purposes and restricting local governments from sharing personal information with federal immigration agencies. These immigration policies have come under attack by the Trump administration, whichfiled a lawsuit against the state of Coloradoand the city of Denver in May seeking to remove local policies restricting cooperation between local law enforcement and federal immigration authorities. Colorado Attorney General Phil Weiser, along with a coalition of 19 attorneys general, responded byfiling two lawsuits against the Trump administrationclaiming its use of billions in emergency services and infrastructure projects to impose “illegal immigration conditions” is unlawful. The department said it notified each listed jurisdiction of its “non-compliance with Federal statutes” and demands that these jurisdictions “immediately review and revise their policies to align with Federal immigration laws and renew their obligation to protect American citizens, not dangerous illegal aliens.” The message has since been taken down along with the list. The National Sheriffs’ Association President Sheriff Kieran Donahue had publiclycriticized the listprior to Sunday for being created “without any input, criteria of compliance, or a mechanism for how to object to the designation.” “Sheriffs nationwide have no way to know what they must do or not do to avoid this arbitrary label,” Donahue said in a statement. Jun 10, 2025 Jun 10, 2025 Jun 10, 2025 Jun 10, 2025 Jun 10, 2025 Jun 8, 2025 The city of Aspen departed from their standard policy of not using herbicides or pesticides when they treated Wagner Park last week to combat an aggressive disease called Ascochyta leaf blight that could have wiped out the turf. Jun 6, 2025 May 26, 2025 Jun 7, 2025 Jun 8, 2025 The CP Restaurant Group is now hiring for a General Manager and an Assistant Manager. Please Email resumes to: ricardo@cprestaurants.com… The CP Restaurant Group is now hiring for a General Manager and an Assistant Manager. Please Email resumes to: ricardo@cprestaurants.com… Project Managers & Superintendents – Join Our High-Performing Team! A respected General Contractor based in Aspen is actively seeking experienced… Project Managers & Superintendents – Join Our High-Performing Team! A respected General Contractor based in Aspen is actively seeking experienced… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Support/Sales Associate — Raven Gallery Aspen Long term, Year Round work. Roaring Fork Valley Residents Only Raven Gallery Aspen is… Support/Sales Associate — Raven Gallery Aspen Long term, Year Round work. Roaring Fork Valley Residents Only Raven Gallery Aspen is… Executive Housekeeper Job Details Job Location: Snowmass Club - Snowmass Village, CO Position Type Full Time Salary Range $90000.00 -… Executive Housekeeper Job Details Job Location: Snowmass Club - Snowmass Village, CO Position Type Full Time Salary Range $90000.00 -… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Lassiter Electric Jobs | May 2025 Licensed Colorado Electricians — Let’s Light It Up! Join the high-voltage crew at Lassiter… Matsuhisa/Yuki hiring cooks Apply in person at Matsuhisa between 1-3pm Send resume to ptanaka@Matsuhisa aspen.com Work and Play in the… Matsuhisa/Yuki hiring cooks Apply in person at Matsuhisa between 1-3pm Send resume to ptanaka@Matsuhisa aspen.com Work and Play in the… Home Health Care Provider Part-Time private home healthcare provider needed for Carbondale resident. Assist with all aspects of daily living… Home Health Care Provider Part-Time private home healthcare provider needed for Carbondale resident. Assist with all aspects of daily living… HOA ACCOUNTANT – ASPEN, CO Frias Properties of Aspen Snowmass seeks a full-time HOA Accountant to manage homeowners’ associations' financials.… HOA ACCOUNTANT – ASPEN, CO Frias Properties of Aspen Snowmass seeks a full-time HOA Accountant to manage homeowners’ associations' financials.… We offer top wages and benefits The following full time year round positions are available: -Maintenance $24-28/hr (BOE) -Reservations $24-28/hr… We offer top wages and benefits The following full time year round positions are available: -Maintenance $24-28/hr (BOE) -Reservations $24-28/hr… **Daily Newsletter** Sign up for daily and breaking news headlines.Manage Subscriptions What makes the best summer vacation?Visiting familyTraveling to a country you've never been toDoing a \"staycation\"I don't take vacationsView ResultsLoading ... What makes the best summer vacation? Visiting family Traveling to a country you've never been to Doing a \"staycation\" I don't take vacations View Results What makes the best summer vacation? Visiting family Traveling to a country you've never been to Doing a \"staycation\" I don't take vacations View Results Home Trending Sections Jobs Classifieds Autos Real Estate Rentals Service Directory Pets Merchandise Legals Place Legal Ad Search Legal Ads Farm & Ranch Recreation Announcements Contact Us Become a Carrier Submissions Submit an Obituary Advertise Archives Newsletters Buy Photos Commercial Print Sales RSS Aspen E-edition Snowmass E-edition Cookie List Do not sell my personal information Breckenridge - Summit County Craig - Moffat County Glenwood Springs - Rifle Lake Tahoe - California Steamboat Springs - Routt County Vail - Eagle Valley Winter Park - Granby - Grand County Printing Press Jobs About Us| Terms of Use| Privacy Policy| Terms and Conditions| Comment Policy| Careers| ©2005 - 2025 Swift Communications, Inc."}