{"id": 1845, "name": "World Affairs Blog", "domain": "worldaffairs.blog", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://worldaffairs.blog/2015/10/20/how-rockefeller-founded-modern-medicine-and-killed-natural-cures/", "title": "How Rockefeller Founded Modern Medicine And Killed Natural Cures", "content": "**World Affairs** **Objective, Nonpartisan and Insightful** **World Affairs** **Objective, Nonpartisan and Insightful** **Menu** Home Foreign Policy China Economy Social Issues Health President Trump Mini Nuggets Quick Links to Previous Posts Election 2016 About Other Topics Technology **How Rockefeller founded modern medicine and killed natural cures** <Check out my new bookChina, China, Chyyna: Greatest Disruption to American Century> People these days look at you like a weirdo if you talk about the healing properties of plants or any other holistic practices. Much like anything else, there is a lot of politics and money behind our modern medical system. It all starts with John D. Rockefeller (1839 – 1937) who was an oil magnate, a robber baron, America’s first billionaire, and a natural-born monopolist. By the turn of the 20th century, he controlled 90% of all oil refineries in the U.S. through his oil company, Standard Oil, which was later on broken up to become Chevron, Exxon, Mobil etc. At the same time, around 1900, scientists discovered “petrochemicals” and the ability to create all kinds of chemicals from oil. For example, the first plastic — calledBakelite— was made from oil in 1907. Scientists were also discovering various vitamins and guessed that many pharmaceutical drugs could be made from oil. This was a wonderful opportunity for Rockefeller who saw the ability to monopolize the oil, chemical and the medical industries at the same time! The best thing about petrochemicals was that everything could be patented and sold for high profits. But there was one problem with Rockefeller’s plan for the medical industry: natural/herbal medicines were very popular in America at that time. Almost half the doctors and medical colleges in the U.S. were practicing holistic medicine, using knowledge from Europe and Native Americans. Rockefeller, the monopolist, had to figure out a way to get rid of his biggest competition. So he used the classic strategy of “problem-reaction-solution.” That is, create a problem and scare people, and then offer a (pre-planned) solution. (Similar to terrorism scare, followed by the “Patriot Act”). He went to his buddy Andrew Carnegie – another plutocrat who made his money frommonopolizing the steel industry– who devised a scheme. From the prestigious Carnegie Foundation, they sent a man named Abraham Flexner to travel around the country and report on the status of medical colleges and hospitals around the country. This led to theFlexner Report, which gave birth to the modern medicine as we know it. Needless to say, the report talked about the need for revamping and centralizing our medical institutions. Based on this report, more than half of all medical colleges were soon closed. Homeopathy and natural medicines were mocked and demonized; and doctors were even jailed. To help with the transition and to change the minds of other doctors and scientists, Rockefeller gave more than $100 million to colleges and hospitals, and founded a philanthropic front group called “General Education Board” (GEB). This is the classic carrot and stick approach. In a very short time, medical colleges were all streamlined and homogenized. All the students were learning the same thing, and medicine was all about using patented drugs. Scientists received huge grants to study how plants cured diseases, but their goal was to first identify which chemicals in the plant were effective, and then recreate a similar chemical –but not identical — in the lab that could be patented. A pill for an ill became the mantra for modern medicine. And you thought Koch brothers were evil? So, now we are, 100 years later, churning out doctors who know nothing about the benefits of nutrition or herbs or any holistic practices. We have an entire society that is enslaved to corporations for its well-being. America spends 15% of its GDP on healthcare, which should be really called “sick care.” It is focusednoton cure, but only onsymptoms, thus creating repeat customers. There is no cure for cancer, diabetes, autism, asthma, or even flu. Why would there be real cures? This is a system founded by oligarchs and plutocrats, not by doctors. As for cancer, oh yeah, theAmerican Cancer Societywas founded by none other than Rockefeller in 1913. In this month of breast cancer awareness, it is sad to see people being brainwashed about chemotherapy, radiation and surgery. That’s for another blog post … but here is a quote from John D. Rockefeller that summarizes his vision for America… Author: Chris Kanthan Related blog posts: Why I haven’t gotten the COVID vaccine yet – An evidence-based analysis Natural immunity for dummies Modern healthcare is like the church of the dark ages **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on LinkedIn (Opens in new window)LinkedIn **Related** **Post navigation** **188 comments** Pingback:Как Рокфеллер основал современную медицину и упразднил естественные лекарства - Nachedeu Pingback:Cómo Rockefeller fundó la medicina moderna y eliminó las curas naturales – The News Peru Pingback:N.O.M. de Zeus Dr. Marty, ton booster c’est pas le pied !… | jbl1960blog Pingback:ΠΩΣ Ο ΡΟΚΦΕΛΕΡ ΙΔΡΥΣΕ ΤΗ ΣΥΓΧΡΟΝΗ ΙΑΤΡΙΚΗ ΚΑΙ ΣΚΟΤΩΣΕ ΤΙΣ ΦΥΣΙΚΕΣ ΘΕΡΑΠΕΙΕΣ - ΝΙΚΟΛΑΟΣ ΑΝΑΞΙΜΑΝΔΡΟΣ Pingback:How Rockefeller Founded Big Pharma And Waged War On Natural Cures - Happy And Healthy Pingback:VIDEO How Rockefeller Founded Modern Medicine and Killed Natural Cures – Unvaxed To Be Vindicated – NarrowPathMinistries Pingback:Politikeren Pingback:Se hvordan Rockefeller opprettet Big Pharma og monopolisert medisin - Antiglobalisten Pingback:La Costruzione dello Stato di biosicurezza in Italia (e altrove) – IV: La tecnocrazia autoritaria e il futuro dell’umanità – Paolo Berdini Sindaco Pingback:Queen Elizabeth’s Long Life Attributed to Homeopathy.. - intolerantchristiansays:January 7, 2023 at 11:05 pmDo you have a list of all the Drs. & reasons why they were jailed? Where did you come up with this information so I can go down this rabbit hole?LikeLikeReply Do you have a list of all the Drs. & reasons why they were jailed? Where did you come up with this information so I can go down this rabbit hole? LikeLike Do you have a list of all the Drs. & reasons why they were jailed? Where did you come up with this information so I can go down this rabbit hole? LikeLike Pingback:How Rockefeller Founded Modern Medicine and Killed Natural Cures – OBLONG MEDIA UNLIMITED Pingback:How Rockefeller Founded Modern Medicine and Killed Natural Cures – The Mad Truther Pingback:Flyby News Health and Spiritual Blog | FlybyNews Pingback:Lyme Disease solutions that work for me | FlybyNews Pingback:The Devolution of Pandemics | FlybyNews Pingback:HOW ROCKEFELLER WIPED OUT NATURAL CURES TO CREATE BIG PHARMA Pingback:How Rockefeller founded modern medicine and killed natural cures - Links Pingback:Letter from HRH King Charles III to Eugénie Rowson﻿ - The Remedy Shoppe Pingback:Den största medicinska skandalen genom tiderna: Är viruset en bluff? MÅSTE LÄSAS! – Bakom kulisserna **Leave a commentCancel reply** Δ **Most Viewed Posts** **Recent Posts** Uighur Card to break Up China — Republished American Empire is Collapsing in Real Time Comment Reblog SubscribeSubscribedWorld AffairsJoin 780 other subscribersSign me upAlready have a WordPress.com account?Log in now. World Affairs Already have a WordPress.com account?Log in now. World Affairs Already have a WordPress.com account?Log in now. World AffairsSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar World Affairs SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar World Affairs SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar **** **** ****"}