{"id": 887, "name": "Media Bias/Fact Check", "domain": "mediabiasfactcheck.com", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://mediabiasfactcheck.com/2025/06/09/fact-vs-fiction-claim-that-san-bernardino-county-will-keep-188000-illegal-and-ineligible-voters-on-rolls-through-2026/", "title": "Fact Vs Fiction Claim That San Bernardino County Will Keep 188000 Illegal And Ineligible Voters On Rolls Through 2026", "content": "Ad-Free Signup Gift Donate Filtered Search API Ad-Free Log In Home Bias Cat.Least BiasedLeft BiasLeft-Center BiasRight-Center BiasRight BiasConspiracy-PseudoscienceQuestionable SourcesPro-Science – Bias and CredibilitySatire Least Biased Left Bias Left-Center Bias Right-Center Bias Right Bias Conspiracy-Pseudoscience Questionable Sources Pro-Science – Bias and Credibility Satire Least Biased Left Bias Left-Center Bias Right-Center Bias Right Bias Conspiracy-Pseudoscience Questionable Sources Pro-Science – Bias and Credibility Satire Genres (NEW) TransparencyAboutFundingMethodologyData and StatsCorrections Policy – Bias and CredibilityChanges/Corrections About Funding Methodology Data and Stats Corrections Policy – Bias and Credibility Changes/Corrections About Funding Methodology Data and Stats Corrections Policy – Bias and Credibility Changes/Corrections NewsFactual NewsFact vs. FictionFact vs. Fiction delivers concise, evidence-based fact checks that clarify viral claims in politics, media, and culture. Backed by reputable sources, each entry separates truth from misinformation to help readers stay accurately informed.Political News Factual News Fact vs. FictionFact vs. Fiction delivers concise, evidence-based fact checks that clarify viral claims in politics, media, and culture. Backed by reputable sources, each entry separates truth from misinformation to help readers stay accurately informed. Political News Factual News Fact vs. FictionFact vs. Fiction delivers concise, evidence-based fact checks that clarify viral claims in politics, media, and culture. Backed by reputable sources, each entry separates truth from misinformation to help readers stay accurately informed. Political News SearchAll Search OptionsFiltered SearchFact Check Search All Search Options Filtered Search Fact Check Search All Search Options Filtered Search Fact Check Search CountriesCountry ProfilesWorld Leaders – Facts and Bias Country Profiles World Leaders – Facts and Bias Country Profiles World Leaders – Facts and Bias Politician/JournalistsUnited States Governors Bias RatingsJournalist BiasPresidential Election 2024 Candidates Bias Ratings United States Governors Bias Ratings Journalist Bias Presidential Election 2024 Candidates Bias Ratings United States Governors Bias Ratings Journalist Bias Presidential Election 2024 Candidates Bias Ratings EducatorsEducator ResourcesEducational Media Sources Educator Resources Educational Media Sources Educator Resources Educational Media Sources Maps/ChartsPolitical Orientation World MapCountry Freedom World MapTrump Performance Tracker ChartMBFC's 2024 Electoral College Map Political Orientation World Map Country Freedom World Map Trump Performance Tracker Chart MBFC's 2024 Electoral College Map Political Orientation World Map Country Freedom World Map Trump Performance Tracker Chart MBFC's 2024 Electoral College Map MOREExtensionsRe-Evaluated SourcesSources PendingSubmit SourceHelp Us Fact CheckLeft vs. Right Bias: How we rate the bias of media sourcesPseudoscience DictionaryMembership Questions Extensions Re-Evaluated Sources Sources Pending Submit Source Help Us Fact Check Left vs. Right Bias: How we rate the bias of media sources Pseudoscience Dictionary Membership Questions Extensions Re-Evaluated Sources Sources Pending Submit Source Help Us Fact Check Left vs. Right Bias: How we rate the bias of media sources Pseudoscience Dictionary Membership Questions June 11, 2025|Media News Daily: Top Stories for 06/11/2025 June 11, 2025|Fact vs. Fiction: Claim That Trump Is Imposing a 300% Penalty Tax on Landlords June 11, 2025|MBFC’s Daily Vetted Fact Checks for 06/11/2025 June 10, 2025|Media News Daily: Top Stories for 06/10/2025 June 10, 2025|MBFC’s Daily Vetted Fact Checks for 06/10/2025 **Fact vs. Fiction: Claim That San Bernardino County Will Keep 188,000 “Illegal and Ineligible” Voters on Rolls Through 2026** Posted By:Media Bias Fact Check A social media postclaims that San Bernardino County admitted in public records that it will keep 188,000 “illegal and ineligible” voters on the voter rolls and will not remove them until after the 2026 election. Accordingto San Bernardino County’s April 18, 2025, response to a public records request, 188,001 voter registrations were classified asinactiveafter missing two consecutive federal elections. However, being on the inactive list does not mean those voters are “illegal” or “ineligible.” Inactive status is applied when a voter fails to respond to a confirmation notice and does not vote in two general elections, per federal law (NVRA Section 8(d)(2)). These voters can still vote if they verify their eligibility at the polls. Removal from the rolls can only occur after following specific federal and state legal procedures. The document also clarifies that due to a past error, some confirmation notices did not include the required cancellation warning. This oversight delayed lawful removal and led to these records remaining inactive but not purged. This is a compliance issue, not evidence of election fraud or unlawful registrations. Fact or Fiction?Fiction. The 188,001 records are inactive, not illegal or ineligible. The county is following federal law and correcting past administrative oversights, not refusing to clean its rolls. National Voter Registration Act (NVRA) Section 8 OverviewHusted v. A. Philip Randolph Inst., 584 U.S. ___ (2018) MBFC Ad-Free or MBFC Donation Found this insightful? Please consider sharing on your Social Media: Enter your email address to subscribe to MBFC and receive notifications of new posts by email. Email Address Subscribe Previous post Next post Fact Check,Report **FactChecking the South Carolina Debate** Fact Check **Trump’s Misleading Attack on Mueller Team** Fact Check,Original **Fact Check: Dianne Feinstein claims Antarctica holds 90 percent of the world’s ice, and the rate of ice melting and calving increased six-fold from 1994 to 2012.** Fact Check **Sessions vs. Sessions on Separating Families** Δ Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. Ad-Free LoginAd-Free Sign upSupport MBFC – DonationsFiltered SearchCountry Freedom Map (fully updated)Trump Performance TrackerSubmit Source for Review Daily Blacksburg – Bias and CredibilityJune 11, 2025 Clinton Item – Bias and CredibilityJune 11, 2025 The Freedom Index – Bias and CredibilityJune 11, 2025 Colville Statesman-Examiner – Bias and CredibilityJune 11, 2025 Fact vs. Fiction: Claim That Taxes Will Rise 68% if the “Big Beautiful Bill” FailsJune 11, 2025 The Swaddle – Bias and CredibilityJune 10, 2025 Canopy Atlanta – Bias and CredibilityJune 10, 2025 Voxeurop – Bias and CredibilityJune 10, 2025 Daily Blacksburg – Bias and Credibility- June 11, 2025 Questionable Sources- June 11, 2025 Least Biased- June 11, 2025 Clinton Item – Bias and Credibility- June 11, 2025 Right Bias- June 11, 2025 The Freedom Index – Bias and Credibility- June 11, 2025 Colville Statesman-Examiner – Bias and Credibility- June 11, 2025 Fact vs. Fiction: Claim That Taxes Will Rise 68% if the “Big Beautiful Bill” Fails- June 11, 2025 Left-Center Bias- June 10, 2025 The Swaddle – Bias and Credibility- June 10, 2025 Fact vs. Fiction: Was Pro-Trump Cuban Activist Hector Luis Valdes Cocho Detained by ICE? The Economic Times - Bias and Credibility Media Bias/Fact Check News The Daily Boulder - Bias and Credibility Filtered Search Least Biased Fox News (foxnews.com) - Bias and Credibility CNN - Bias and Credibility Membership Levels The Free Press (Common Sense) - Bias and Credibility Enter your email address to subscribe to MBFC and receive notifications of new posts by email. For Ad-Free Subscriptions go here: https://mediabiasfactcheck.com/membership-account/membership-levels/ Email Address Subscribe Terms and ConditionsFair Use PolicyFunding About MBFCDisclaimerCancel Ad Free Links/FAQContactRSS Copyright 2024 Media Bias Fact Check LLC **** **** ****"}