{"id": 837, "name": "Leominster Champion", "domain": "leominsterchamp.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.leominsterchamp.com/upcoming-programs-at-the-leominster-public-library-week-of-july-22/", "title": "Upcoming Programs At The Leominster Public Library Week Of July 22", "content": "Home News Schools Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary LegalsLegalsSubmit a Legal Notice Legals Submit a Legal Notice Legals Submit a Legal Notice Jobs Main St Contact Us Contact Us Home News Schools Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary LegalsLegalsSubmit a Legal Notice Legals Submit a Legal Notice Legals Submit a Legal Notice Jobs Main St To The Leominster Champion readers, It is with regret that CherryRoad Media announces the closing of The Leominster Champion. Our company is dedicated to the preservation of community journalism. Since the purchase of our 1st paper in late-2020 to today, we have prided ourselves on our ability to fight the difficult battle that newspapers face in today’s digital society. Unfortunately, that battle cannot always be won. The Leominster Champion, has struggled in recent years to find its footing in this community. Since purchasing The Leominster Champion, CherryRoad Media has been unable to avoid financial losses every month. The paper was losing money when we bought it, and it continued to do so. We must now come to terms with the fact that we do not have a path forward to sustainability. And we thank those who have supported us. **Upcoming programs at the Leominster Public Library, week of July 22** July 17, 2024 Lifestyle For all programs that require registration, the library staff will hold your spot for 10 minutes past the scheduled start time of the program; after that, your spot may be given to someone who is waiting. Plan your arrival accordingly. Registration for all programs begins at 9 a.m. one week prior to the date of the program. To register, visit the website or call (978) 534-7522, ext. 5. Strega Mama presents If You Give a Mouse a Cookie: The Kate & Bill Holloway Monthly Interactive Story-time:Children ages 3-6 and their caregivers are invited on Monday, July 22 at 10 a.m. for story-time with Strega Mama! We’ll readIf You Give a Mouse a Cookieby Laura Numerof, and after we’ll play Who Stole the Cookie, learn an American Sign Language cookie chant, give a mouse a cookie, and more! No registration required. Tape Resist Art:Kids ages 8-13 are invited on Tuesday, July 23 at 10 a.m. Participants will tape their design onto a 16″ x 20″ canvas using removable painters’ tape. After, they will use acrylic paint to fill in each section of their canvas until the complete canvas has been painted. Once the paint has dried, kids will peel off the tape and be left with a masterpiece.Registration is required. Professor Bugman’s Arthropod Petting Zoo:Kids ages 4-13 are invited on July 23 at 1 p.m. or 2:30 p.m. to learn all about Arthropods, the most diverse group of animal life on the planet, during this exciting show-and-tell-and-touch program. Learn, see, hear, touch, and even smell the incredible adaptations these creatures have that help them survive in the wild world. Participants will get an up-close view of Roly Polies, Beatles, African Millipedes and more.Registration is required.This program is sponsored by a generous donation from Rowe & Canary Orthodontists. Plush Pet Adoption Day:Children ages 3-12 are welcome to sign up for an appointment atthePlush Pet Adoption Day on Wednesday, July 24 from 10a.m. to noon. VisitthePlush Pet Animal Shelter, fill out your adoption application, visit with the plushies, and choose your new friend to bring home to keep.You can decorate a little house for your pet,too. (Note: All of the plush pets are new and unused.)Appointments are required and can be made by calling 978-534-7522 ext. 5 starting on July 17. Zoo Animals Story and Craft Time:Children ages 3-7 and a caregiver are welcome on Thursday, July 25 at 10 a.m. for a wild story and craft. The group will readA Trip to the Zoo with Sesame Streetby Christy Peterson andCrocodile Hungryby Eija Sumner. Then, children will get to color their own jungle animal puzzles to keep.Registration is required and begins on July 18. Paint an Owl Bank with the Pottery Paintin’ Place:Children ages 8-13 can visit on Thursday, July 25 at 2:30 p.m. to paint an owl bank with The Pottery Paintin’ Place! Choose a variety of paint colors to make your owl a unique piece of art. Each piece will then be brought back to the Pottery Paintin’ Place for firing, then returned to the library at a later date.Registration is required and begins July 18. Explore and Play for 1-3 Year Olds:Children ages 1-3 and their caregivers are invited on Friday, July 26 at 10 a.m. for Explore and Play. During this casual, self-directed program, children will have the chance to interact with each other and their caregivers through hands-on play and activities: The ball roll game, silliness with scarves, a short, pop-up story, stacking play, and shaving cream squish in a bag. These activities are fun and also help children with their motor skills. Stay for as long or short of a time that works for your child.Registration is required and begins July 19.This program is sponsored by a generous donation from Digital Federal Credit Union. Science is Magic with Seed Education:Calling all magicians in training on Friday, July 26 at 2 p.m. to learn some new tricks and the chemistry and physics that make these tricks possible. Among other tricks, you will watch a piece of paper spontaneously vanish and learn how to make water change colors and disappear right before your eyes. Science is the key to all magic. This program is appropriate for ages 8 and up.Registration is required and begins July 19.This program is sponsored by ACME Auto Body Repairing, Inc., Cristina’s Restaurant, and Demoulas Super Markets, Inc.,Corporate Sponsors of the Friends of the Leominster Public Library. Business briefsJuly 17, 2024 Fitchburg State offering new creative degreesJuly 17, 2024 Leominster students earn honorsJuly 17, 2024 Leominster.TV highlights July 22 to 28July 17, 2024 Upcoming programs at the Leominster Public Library, week of July 22July 17, 2024 Leominster residents star in TAM’s “The Prom”July 17, 2024 Leominster cancer survivor honored at PMC NightJuly 17, 2024 Leominster resident crowned Miss Massachusetts’ TeenJune 25, 2024 Scouts hold ‘Grand Finale Campout’June 25, 2024 Leominster CTEI awarded Skills grant for upgradesJune 25, 2024 **Other News** June 25, 2024 June 25, 2024 May 30, 2024 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 Leominster Champion, aCherryRoad MediaNewspaper. All rights reserved."}