{"id": 1029, "name": "Notes from Poland", "domain": "notesfrompoland.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://notesfrompoland.com/2025/06/11/polish-government-wins-parliamentary-vote-of-confidence-called-in-wake-of-presidential-election-defeat/", "title": "Polish Government Wins Parliamentary Vote Of Confidence Called In Wake Of Presidential Election Defeat", "content": "News Insights Po polsku TopicsPoliticsSocietyCultureBusinessHistoryEducationEnergy & ClimateLawMediaDefenceNotes from Pawland Politics Society Culture Business History Education Energy & Climate Law Media Defence Notes from Pawland Politics Society Culture Business History Education Energy & Climate Law Media Defence Notes from Pawland PodcastsNotes from Poland PodcastThe VoiCEE podcast Notes from Poland Podcast The VoiCEE podcast Notes from Poland Podcast The VoiCEE podcast About usOur storyEditorial teamAdvisory BoardEditorial and diversity policiesNotes from Poland Foundation Our story Editorial team Advisory Board Editorial and diversity policies Notes from Poland Foundation Our story Editorial team Advisory Board Editorial and diversity policies Notes from Poland Foundation Contact NewslettersNotes from Poland NewsletterCentral and Eastern Europe Newsletter Notes from Poland Newsletter Central and Eastern Europe Newsletter Notes from Poland Newsletter Central and Eastern Europe Newsletter **Polish government wins parliamentary vote of confidence called in wake of presidential election defeat** Jun 11, 2025|Featured,Politics **Keep our news free from ads and paywalls by making a donation to support our work!** Notes from Poland is run by asmall editorial teamand is published by an independent, non-profit foundation that is funded through donations from our readers. We cannot do what we do without your support. Poland’s government has won a vote of confidence in parliament called by Prime Minister Donald Tusk in the wake of this month’spresidential election victoryby opposition-aligned conservative Karol Nawrocki. Had he not received the confidence of a majority in parliament, Tusk would have had to resign. In a vote on Wednesday afternoon, 243 members of the Sejm, the more powerful lower house of parliament, supported the government while 210 were against. There were no abstentions. All of the votes in favour of Tusk’s administration came from the four groups that make up the ruling camp: his centrist Civic Coalition (KO), the centre-right Polish People’s Party (PSL), centrist Poland 2050 (Polska 2050) and The Left (Lewica). All opposition parties voted against it, including the national-conservative Law and Justice (PiS), the largest opposition party, the far-right Confederation (Konfederacja), but also the left-wing Together (Razem) party that until last yearcaucused with the ruling coalition before breaking with it. How members of each parliamentary caucus voted in the vote of confidence in Donald Tusk’s government (za = for, przeciw = against) Tusk’s governmenttook power in December 2023, replacing the former PiS administration. However, it has found itself hampered by the presence of President Andrzej Duda, a PiS ally, who has the power to block legislation by vetoing it or sending it to the PiS-aligned constitutional court. The ruling coalition had hoped that its candidate, Rafał Trzaskowski, would win the presidential election run-off on 1 June, thereby ending the current political deadlock. However, Nawrocki’s victory means that much of Tusk’s agenda will remain impossible to implement. That has raised questions about the effectiveness – and even viability – of the government during the remaining two years of its term in office. In response, Tusklast week announced he would hold a vote of confidenceto demonstrate that he still had the support of parliament. On Wednesday morning, ahead of the vote, Tusk gave a speech to the Sejm in which he defended the record of his administration, noting that it has increasedspending on defenceandsocial supportto record levels while also overseeing adecline in inflation. “We have thehighest economic growth in Europe, the lowest unemployment rates,rising investmentlevels andrising real wages,” said the prime minister, while also declaring that, under his government, Poland now “returned to the top of European and world politics”. Tusk pointed out that, over the last two years, Poland has had four elections –parliamentary,local,Europeanandpresidential– and that his coalition has triumphed in three of them. “It’s 3-1 to us, but we conceded the last goal,” said the prime minister, who is a big football fan, quoted byGazeta Wyborcza. Zobacz co zostało#ZrobioneDlaPolski🇵🇱 Nie zatrzymujemy się, działamy dalej!pic.twitter.com/gzz2tbVXd9 — Kancelaria Premiera (@PremierRP)June 11, 2025 “The results of the presidential elections will not reduce our mandate in any way…[or] change the principles of the political system,” said Tusk. “We have two and a half years of full mobilisation ahead of us. This is our obvious duty, even if I understand the mood of those who now feel the bitterness of defeat.” The prime minister did, however, confirm that next month there would be a government reshuffle. Media reports have suggested that a number of ministers could lose their jobs and some departments could be merged. Tusk also confirmed that the government would this monthappoint a spokesperson for the first time since coming to power 18 months ago. Some in the ruling coalition have blamed a lack of clear communication for the government’s unpopularity. A poll by state research agency CBOS last month found that only 32% of Poles hold a positive view of the government while 44% have a negative one. Poland’s government will appoint a spokesperson for the first time since taking office 18 months ago, as pressure mounts following its defeat in Sunday’s presidential election. Media reports also indicate a major government reshuffle is being preparedhttps://t.co/mmb4ZU3yCY — Notes from Poland 🇵🇱 (@notesfrompoland)June 6, 2025 PiS MPs chose not to be present in the chamber for Tusk’s speech, instead gathering outside the Sejm, where the party’s leader, Jarosław Kaczyński, spoke to the media. He accused the Tusk government of overseeing “a completebreakdown of the rule of lawin Poland”,mismanaging public finances, andfavouring German interestsover Polish ones, reports news website wPolityce. Kaczyński last week called on the government to step down and be replaced by a “technical” administration made up of “apolitical experts”. Today in the Sejm, PiS MP Janusz Kowalski said he hoped that Nawrocki’s victory could lead to early parliamentary elections to choose a new government. “On 1 June 2025, the Donald Tusk project ended, just as communism once ended,” said Kowalski, quoted by news website Onet. 🟥 Rząd Tuska może być oceniony wyłącznie bardzo negatywnie. Wszystkie te opowieści, że nie ma Zielonego Ładu i nie będzie przymusowej relokacji migrantów to były kłamstwa. Chciano społeczeństwo wprowadzić w błąd na ogromną skalę – Prezes PiS J. Kaczyński@OficjalnyJK.…pic.twitter.com/3lURdMQndr — Prawo i Sprawiedliwość (@pisorgpl)June 11, 2025 Notes from Poland is run by asmall editorial teamand published by an independent, non-profit foundation that is funded through donations from our readers. We cannot do what we do without your support. Main image credit: Slawomir Kaminski / Agencja Wyborcza.pl Daniel Tilles is editor-in-chief ofNotes from Poland. He has written on Polish affairs for a wide range of publications, includingForeign Policy,POLITICO Europe,EUobserverandDziennik Gazeta Prawna. **You may also like** **Poland introduces tougher new rules for foreign students and economic migrants** Jun 2, 2025|Business,Education,Hot news,News,Politics,Society “This is another step towards regaining control over migration and increasing the safety of Poles,” says the government. **Poland’s fertility rate fell to new low in 2024** Jun 2, 2025|Hot news,News,Society The figure fell to 1.1 in 2024, well below the “replacement rate” of 2.1 needed to prevent population decline. **Right-wing opposition candidate Nawrocki wins Polish presidential election** Jun 2, 2025|Hot news,News,Politics Karol Nawrocki took 50.89% of the vote against 49.11% for his centrist rival Rafał Trzaskowski. **We can only do this thanks to your support!** We are an independent, nonprofit media outlet, funded through the support of our readers. If you appreciate the work we do, please consider helping us to continue and expand it. Chocimska 7 / 830-057 Kraków, PolandNIP: 677 243 97 04KRS: 0000758506 [email protected] Chocimska 7 / 830-057 Kraków, PolandNIP: 677 243 97 04KRS: 0000758506 [email protected] NEWS INSIGHTS POLITICS SOCIETY CULTURE BUSINESS EDITOR’S PICK READER’S CHOICE PO POLSKU Copyright © 2025Notes From Poland|Designjurko studio| Code by2sides.pl Notes from Poland is run by asmall editorial teamand published by an independent, non-profit foundation that is funded through donations from our readers. We cannot do what we do without your support. **Paulina Olszanka** advisory board member Senior Research Fellow at the Global Europe Centre, University of Kent. ARTICLES BY THIS AUTHOR **Weronika Strzyżyńska** contributing editorial assistant Weronika Strzyżyńska is currently studying journalism at Goldsmiths as a Scott Trust Bursary recipient. She has written on issues immigration and Brexit forNew StatesmanandProspect ARTICLES BY THIS AUTHOR **Agnieszka Wądołowska** managing editor Agnieszka Wądołowska is managing editor of Notes from Poland. She has previously worked for Gazeta.pl and Tokfm.pl and contributed toGazeta Wyborcza,Wysokie Obcasy, Duży Format, MidraszandKultura Liberalna” ARTICLES BY THIS AUTHOR contributing writer ARTICLES BY THIS AUTHOR X editor-in-chief Daniel Tilles is editor-in-chief ofNotes from Polandand assistant professor of history at the Pedagogical University of Krakow. He has written on Polish affairs for a wide range of publications, includingForeign Policy,POLITICO Europe,The IndependentandDziennik Gazeta Prawna. ARTICLES BY THIS AUTHOR X founder, editor-at-large Stanley Bill is the founder and editor-at-large of Notes from Poland.He is also Senior Lecturer in Polish Studies and Director of the Polish Studies Programme at the University of Cambridge, where he works on Polish culture, politics and history. Stanley has spent more than ten years living in Poland, mostly based in Kraków and Bielsko-Biała. He founded Notes from Poland in 2014 as a blog dedicated to personal impressions, cultural analysis and political commentary. He is committed to the promotion of deeper knowledge and understanding of Poland. He is the Chair of the Board of the Notes from Poland Foundation. ARTICLES BY THIS AUTHOR deputy editor assistant editor ARTICLES BY THIS AUTHOR advisory board member ARTICLES BY THIS AUTHOR advisory board member Professor of European Studies at Oxford University ARTICLES BY THIS AUTHOR advisory board member Professor at the Institute of History of the Jagiellonian University ARTICLES BY THIS AUTHOR X advisory board member Executive Director of Taube Family Foundation ARTICLES BY THIS AUTHOR advisory board member Associate Professor at the Institute of Political Studies of the Polish Academy of Science, member of the Polish parliaments ARTICLES BY THIS AUTHOR advisory board member ARTICLES BY THIS AUTHOR author ARTICLES BY THIS AUTHOR **Pin It on Pinterest**"}