{"id": 1590, "name": "WISH-TV", "domain": "wishtv.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wishtv.com/wish-tv-70th-anniversary/wishstory-wish-tvs-transition-to-sony-betacams-marks-a-broadcast-milestone/", "title": "Wishstory Wish Tvs Transition To Sony Betacams Marks A Broadcast Milestone", "content": "NewsBE&O ShowBusinessCommunity Connection ContributorsCoronavirus LatestCrime Watch 8Delphi MurdersDigital DownloadEducationEntertainmentElection CoverageElection ResultsI-Team 8Indiana NewsINside StoryInternational NewsLocal NewsHispanic CultureHealth SpotlightMental Health MomentsMulticultural NewsNational NewsPolitical NewsSolar EclipseTrafficUnPHILtered with Phil Sanchez BE&O Show Business Community Connection Contributors Coronavirus Latest Crime Watch 8 Delphi Murders Digital Download Education Entertainment Election Coverage Election Results I-Team 8 Indiana News INside Story International News Local News Hispanic Culture Health Spotlight Mental Health Moments Multicultural News National News Political News Solar Eclipse Traffic UnPHILtered with Phil Sanchez BE&O Show Business Community Connection Contributors Coronavirus Latest Crime Watch 8 Delphi Murders Digital Download Education Entertainment Election Coverage Election Results I-Team 8 Indiana News INside Story International News Local News Hispanic Culture Health Spotlight Mental Health Moments Multicultural News National News Political News Solar Eclipse Traffic UnPHILtered with Phil Sanchez Weather7 Day ForecastAlmanacClosings & DelaysCurrent ConditionsGet Weather Email AlertsHourly ForecastFuture CastInteractive RadarRadarSevere OutlookToday’s RainfallTwo Week OutlookWatches and WarningsWeather BlogWeather StoriesWind Gusts 7 Day Forecast Almanac Closings & Delays Current Conditions Get Weather Email Alerts Hourly Forecast Future Cast Interactive Radar Radar Severe Outlook Today’s Rainfall Two Week Outlook Watches and Warnings Weather Blog Weather Stories Wind Gusts 7 Day Forecast Almanac Closings & Delays Current Conditions Get Weather Email Alerts Hourly Forecast Future Cast Interactive Radar Radar Severe Outlook Today’s Rainfall Two Week Outlook Watches and Warnings Weather Blog Weather Stories Wind Gusts Sports2025 HBCU Games on WNDYBehind the BricksCollege SportsColtsGr8 Golf ClubIndiana FeverIndy ElevenMonth of MayMotorsportsPacersThe Zone BannerThe Zone – High School SportsThe Zone Scoreboard 2025 HBCU Games on WNDY Behind the Bricks College Sports Colts Gr8 Golf Club Indiana Fever Indy Eleven Month of May Motorsports Pacers The Zone Banner The Zone – High School Sports The Zone Scoreboard 2025 HBCU Games on WNDY Behind the Bricks College Sports Colts Gr8 Golf Club Indiana Fever Indy Eleven Month of May Motorsports Pacers The Zone Banner The Zone – High School Sports The Zone Scoreboard LifestyleAll IndianaContestsFinding FaithLIfestyle Live!OffbeatRecipes All Indiana Contests Finding Faith LIfestyle Live! Offbeat Recipes All Indiana Contests Finding Faith LIfestyle Live! Offbeat Recipes Focus on FoodEntertainingEthnic DishesEveryday MealsFarm To TableIngredientsJust the BasicsSpecialty DietsWhat’s For Dinner Entertaining Ethnic Dishes Everyday Meals Farm To Table Ingredients Just the Basics Specialty Diets What’s For Dinner Entertaining Ethnic Dishes Everyday Meals Farm To Table Ingredients Just the Basics Specialty Diets What’s For Dinner CommunityBusiness DirectoryCelebrating MomentsCitizens EnergyCommunity CalendarCommunity LinkContestsFocus on Family and CommunityGas PricesGolden Apple AwardGovernor’s Luncheon for ScoutingGreat Day TV and Pet Pals TVGr8 Paper PushGr8 Pasta PushI Love To ReadIndiana Youth Services AssociationKennedy King Memorial InitiativeMozel SandersMulticultural Media Producing ProgrammyIPSObituariesReal TalkWe Stand TogetherWISH Tree Business Directory Celebrating Moments Citizens Energy Community Calendar Community Link Contests Focus on Family and Community Gas Prices Golden Apple Award Governor’s Luncheon for Scouting Great Day TV and Pet Pals TV Gr8 Paper Push Gr8 Pasta Push I Love To Read Indiana Youth Services Association Kennedy King Memorial Initiative Mozel Sanders Multicultural Media Producing Program myIPS Obituaries Real Talk We Stand Together WISH Tree Business Directory Celebrating Moments Citizens Energy Community Calendar Community Link Contests Focus on Family and Community Gas Prices Golden Apple Award Governor’s Luncheon for Scouting Great Day TV and Pet Pals TV Gr8 Paper Push Gr8 Pasta Push I Love To Read Indiana Youth Services Association Kennedy King Memorial Initiative Mozel Sanders Multicultural Media Producing Program myIPS Obituaries Real Talk We Stand Together WISH Tree PodcastsAll INdiana Podcast Network Feature of the WeekAC’s ConversationsAll INdiana PoliticsBehind The 8Behind the BricksBusiness, Equity and OpportunitiesDaybreak Drive-INGolden AppleGrowing a Beautiful LifeLa Voz Latina en IndianaLife Style Live PodcastIN The CommunityMedical Minutes with WISH-TVNews 8 DailyWho’s Got Next with Andrew ChernoffWeather WeeklyWomen Take The Wheel All INdiana Podcast Network Feature of the Week AC’s Conversations All INdiana Politics Behind The 8 Behind the Bricks Business, Equity and Opportunities Daybreak Drive-IN Golden Apple Growing a Beautiful Life La Voz Latina en Indiana Life Style Live Podcast IN The Community Medical Minutes with WISH-TV News 8 Daily Who’s Got Next with Andrew Chernoff Weather Weekly Women Take The Wheel All INdiana Podcast Network Feature of the Week AC’s Conversations All INdiana Politics Behind The 8 Behind the Bricks Business, Equity and Opportunities Daybreak Drive-IN Golden Apple Growing a Beautiful Life La Voz Latina en Indiana Life Style Live Podcast IN The Community Medical Minutes with WISH-TV News 8 Daily Who’s Got Next with Andrew Chernoff Weather Weekly Women Take The Wheel Station InfoAbout UsAdvertise With UsCareers at WISH-TVCircle City BroadcastingContact UsCW 8Download WISH-TV AppsEmail AlertsHistory of WISH-TVInternships At WISH-TVMeet The TeamMyINDY-TV 23MyINDY-TV 23 SchedulePaid ProgrammingReception Trouble?Tour WISH-TV StudiosWISH-TV News Partners and AffiliatesWISH-TV StoreWISH-TV ScheduleWISH-TV 70th Anniversary About Us Advertise With Us Careers at WISH-TV Circle City Broadcasting Contact Us CW 8 Download WISH-TV Apps Email Alerts History of WISH-TV Internships At WISH-TV Meet The Team MyINDY-TV 23 MyINDY-TV 23 Schedule Paid Programming Reception Trouble? Tour WISH-TV Studios WISH-TV News Partners and Affiliates WISH-TV Store WISH-TV Schedule WISH-TV 70th Anniversary About Us Advertise With Us Careers at WISH-TV Circle City Broadcasting Contact Us CW 8 Download WISH-TV Apps Email Alerts History of WISH-TV Internships At WISH-TV Meet The Team MyINDY-TV 23 MyINDY-TV 23 Schedule Paid Programming Reception Trouble? Tour WISH-TV Studios WISH-TV News Partners and Affiliates WISH-TV Store WISH-TV Schedule WISH-TV 70th Anniversary Watch Live NewsBE&O ShowBusinessCommunity Connection ContributorsCoronavirus LatestCrime Watch 8Delphi MurdersDigital DownloadEducationEntertainmentElection CoverageElection ResultsI-Team 8Indiana NewsINside StoryInternational NewsLocal NewsHispanic CultureHealth SpotlightMental Health MomentsMulticultural NewsNational NewsPolitical NewsSolar EclipseTrafficUnPHILtered with Phil Sanchez BE&O Show Business Community Connection Contributors Coronavirus Latest Crime Watch 8 Delphi Murders Digital Download Education Entertainment Election Coverage Election Results I-Team 8 Indiana News INside Story International News Local News Hispanic Culture Health Spotlight Mental Health Moments Multicultural News National News Political News Solar Eclipse Traffic UnPHILtered with Phil Sanchez BE&O Show Business Community Connection Contributors Coronavirus Latest Crime Watch 8 Delphi Murders Digital Download Education Entertainment Election Coverage Election Results I-Team 8 Indiana News INside Story International News Local News Hispanic Culture Health Spotlight Mental Health Moments Multicultural News National News Political News Solar Eclipse Traffic UnPHILtered with Phil Sanchez Weather7 Day ForecastAlmanacClosings & DelaysCurrent ConditionsGet Weather Email AlertsHourly ForecastFuture CastInteractive RadarRadarSevere OutlookToday’s RainfallTwo Week OutlookWatches and WarningsWeather BlogWeather StoriesWind Gusts 7 Day Forecast Almanac Closings & Delays Current Conditions Get Weather Email Alerts Hourly Forecast Future Cast Interactive Radar Radar Severe Outlook Today’s Rainfall Two Week Outlook Watches and Warnings Weather Blog Weather Stories Wind Gusts 7 Day Forecast Almanac Closings & Delays Current Conditions Get Weather Email Alerts Hourly Forecast Future Cast Interactive Radar Radar Severe Outlook Today’s Rainfall Two Week Outlook Watches and Warnings Weather Blog Weather Stories Wind Gusts Sports2025 HBCU Games on WNDYBehind the BricksCollege SportsColtsGr8 Golf ClubIndiana FeverIndy ElevenMonth of MayMotorsportsPacersThe Zone BannerThe Zone – High School SportsThe Zone Scoreboard 2025 HBCU Games on WNDY Behind the Bricks College Sports Colts Gr8 Golf Club Indiana Fever Indy Eleven Month of May Motorsports Pacers The Zone Banner The Zone – High School Sports The Zone Scoreboard 2025 HBCU Games on WNDY Behind the Bricks College Sports Colts Gr8 Golf Club Indiana Fever Indy Eleven Month of May Motorsports Pacers The Zone Banner The Zone – High School Sports The Zone Scoreboard LifestyleAll IndianaContestsFinding FaithLIfestyle Live!OffbeatRecipes All Indiana Contests Finding Faith LIfestyle Live! Offbeat Recipes All Indiana Contests Finding Faith LIfestyle Live! Offbeat Recipes Focus on FoodEntertainingEthnic DishesEveryday MealsFarm To TableIngredientsJust the BasicsSpecialty DietsWhat’s For Dinner Entertaining Ethnic Dishes Everyday Meals Farm To Table Ingredients Just the Basics Specialty Diets What’s For Dinner Entertaining Ethnic Dishes Everyday Meals Farm To Table Ingredients Just the Basics Specialty Diets What’s For Dinner CommunityBusiness DirectoryCelebrating MomentsCitizens EnergyCommunity CalendarCommunity LinkContestsFocus on Family and CommunityGas PricesGolden Apple AwardGovernor’s Luncheon for ScoutingGreat Day TV and Pet Pals TVGr8 Paper PushGr8 Pasta PushI Love To ReadIndiana Youth Services AssociationKennedy King Memorial InitiativeMozel SandersMulticultural Media Producing ProgrammyIPSObituariesReal TalkWe Stand TogetherWISH Tree Business Directory Celebrating Moments Citizens Energy Community Calendar Community Link Contests Focus on Family and Community Gas Prices Golden Apple Award Governor’s Luncheon for Scouting Great Day TV and Pet Pals TV Gr8 Paper Push Gr8 Pasta Push I Love To Read Indiana Youth Services Association Kennedy King Memorial Initiative Mozel Sanders Multicultural Media Producing Program myIPS Obituaries Real Talk We Stand Together WISH Tree Business Directory Celebrating Moments Citizens Energy Community Calendar Community Link Contests Focus on Family and Community Gas Prices Golden Apple Award Governor’s Luncheon for Scouting Great Day TV and Pet Pals TV Gr8 Paper Push Gr8 Pasta Push I Love To Read Indiana Youth Services Association Kennedy King Memorial Initiative Mozel Sanders Multicultural Media Producing Program myIPS Obituaries Real Talk We Stand Together WISH Tree PodcastsAll INdiana Podcast Network Feature of the WeekAC’s ConversationsAll INdiana PoliticsBehind The 8Behind the BricksBusiness, Equity and OpportunitiesDaybreak Drive-INGolden AppleGrowing a Beautiful LifeLa Voz Latina en IndianaLife Style Live PodcastIN The CommunityMedical Minutes with WISH-TVNews 8 DailyWho’s Got Next with Andrew ChernoffWeather WeeklyWomen Take The Wheel All INdiana Podcast Network Feature of the Week AC’s Conversations All INdiana Politics Behind The 8 Behind the Bricks Business, Equity and Opportunities Daybreak Drive-IN Golden Apple Growing a Beautiful Life La Voz Latina en Indiana Life Style Live Podcast IN The Community Medical Minutes with WISH-TV News 8 Daily Who’s Got Next with Andrew Chernoff Weather Weekly Women Take The Wheel All INdiana Podcast Network Feature of the Week AC’s Conversations All INdiana Politics Behind The 8 Behind the Bricks Business, Equity and Opportunities Daybreak Drive-IN Golden Apple Growing a Beautiful Life La Voz Latina en Indiana Life Style Live Podcast IN The Community Medical Minutes with WISH-TV News 8 Daily Who’s Got Next with Andrew Chernoff Weather Weekly Women Take The Wheel Station InfoAbout UsAdvertise With UsCareers at WISH-TVCircle City BroadcastingContact UsCW 8Download WISH-TV AppsEmail AlertsHistory of WISH-TVInternships At WISH-TVMeet The TeamMyINDY-TV 23MyINDY-TV 23 SchedulePaid ProgrammingReception Trouble?Tour WISH-TV StudiosWISH-TV News Partners and AffiliatesWISH-TV StoreWISH-TV ScheduleWISH-TV 70th Anniversary About Us Advertise With Us Careers at WISH-TV Circle City Broadcasting Contact Us CW 8 Download WISH-TV Apps Email Alerts History of WISH-TV Internships At WISH-TV Meet The Team MyINDY-TV 23 MyINDY-TV 23 Schedule Paid Programming Reception Trouble? Tour WISH-TV Studios WISH-TV News Partners and Affiliates WISH-TV Store WISH-TV Schedule WISH-TV 70th Anniversary About Us Advertise With Us Careers at WISH-TV Circle City Broadcasting Contact Us CW 8 Download WISH-TV Apps Email Alerts History of WISH-TV Internships At WISH-TV Meet The Team MyINDY-TV 23 MyINDY-TV 23 Schedule Paid Programming Reception Trouble? Tour WISH-TV Studios WISH-TV News Partners and Affiliates WISH-TV Store WISH-TV Schedule WISH-TV 70th Anniversary Watch Live **‘WISHstory’: WISH-TV’s transition to Sony Betacams marks a broadcast milestone** **Looking back at the videotape format wars of the 80’s** INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities.The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast.“It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.”In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price.Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes.The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively.Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology.The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades.WEB EXTRAS:The rise of consumer cameras (1987)This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities.The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast.“It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.”In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price.Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes.The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively.Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology.The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades.WEB EXTRAS:The rise of consumer cameras (1987)This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities. The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast. “It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.” In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price. Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes. The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively. Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology. The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades. **WEB EXTRAS:** The rise of consumer cameras (1987) This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities.The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast.“It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.”In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price.Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes.The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively.Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology.The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades.WEB EXTRAS:The rise of consumer cameras (1987)This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities. The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast. “It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.” In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price. Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes. The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively. Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology. The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades. **WEB EXTRAS:** The rise of consumer cameras (1987) This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. INDIANAPOLIS (WISH) — WISH-TV was the first television station in America to use Sony Betacams, revolutionizing its broadcast capabilities. The transition to Sony Betacams marked a significant shift for WISH-TV, enhancing the mobility and reliability of its news production. The new equipment allowed photographers to move more freely and capture higher quality footage, improving the overall news broadcast. “It proved to be a very good format, very reliable, very rugged,” Terry Van Bibber, Chief Engineer at WISH-TV said. “And those are exceptional qualities for us.” In the early days of television, formats were constantly evolving. By the 1980s, VHS and Betamax were the two main contenders for video tape formats, each with its own advantages and disadvantages. VHS tapes were known for their longer recording times and lower cost, while Betamax offered higher quality but at a higher price. Television stations, however, had different requirements than consumers. According to Terry Van Bibber, the Betamax format used by broadcasters was much higher quality than the home VCR Betamax machine, designed specifically for broadcast purposes. The adoption of Sony Betacams at WISH-TV was a pivotal moment. Steve Sweitzer, Chief Photographer, recalled the excitement of the transition, likening it to Christmas when the new Betacams were distributed. The new equipment was more mobile and durable, making it easier for photographers to do their jobs effectively. Bruce McConnell, the owner of WISH-TV, had been an early adopter of video technology, purchasing the first video tape machine for the station in 1956. This forward-thinking approach continued with the adoption of Betacams, positioning WISH-TV at the forefront of broadcast technology. The introduction of Sony Betacams at WISH-TV not only improved the station’s broadcast quality but also set a precedent for other stations to follow. The enhanced mobility and reliability of the new format allowed photographers to capture news more effectively, serving the station well for decades. **WEB EXTRAS:** The rise of consumer cameras (1987) This video features three news packages that aired in Oct. 26,1987.Mike Androvett and chief photographer Steve Sweitzer demonstrate for viewers how to buy and best operate a VHS camcorder. **WISHTV.com Trending Stories** Enhanced security measures in place for Pacers-Thunder NBA Finals games9,784 Views Woman captures Avon Texas Roadhouse brawl on ... Tyrese Haliburton update after Game 2 injury ... Mayor Hogsett dines out after skipping homele... Brian Wilson, music visionary and leader of t... **MORE STORIES** **Categories** News Weather Sports Life. Style. Live! Community Station Info TV Schedule Watch Live Photo Galleries Betting **News/Weather App** **Follow Us** Terms of Use Privacy Policy Publishing Principles EEO Report FCC Public File (WISH) FCC Public File (WNDY)"}