{"id": 2113, "name": "Reclaim the Net", "domain": "reclaimthenet.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://reclaimthenet.org/the-canadian-bill-that-wants-to-make-privacy-rules-optional-for-politicians", "title": "The Canadian Bill That Wants To Make Privacy Rules Optional For Politicians", "content": "Reclaim The Net Latest Free Speech Surveillance Culture Big Tech Alternatives Shop Donate Resist censorship. Reject surveillance. Reclaim your voice. Stay informed on censorship, cancel culture, and surveillance, and learn how to take your digital rights back. Resist censorship. Reject surveillance. Reclaim your voice. Stay informed on censorship, cancel culture, and surveillance, and learn how to take your digital rights back. Archive:June 9, 2025 **The Canadian Bill That Wants To Make Privacy Rules Optional for Politicians** **A quarter-century of data grabs gets wiped clean with a clause tucked between economic forecasts.** Ken Macon If you’re tired of censorship and surveillance,subscribe to Reclaim The Net. The Canadian government has once again sidestepped public debate by embedding broad privacy exemptions for political parties into a piece of unrelated legislation. Bill C-4, framed as a response to economic challenges, includes clauses that effectively remove political organizations from the reach of both federal and provincial privacy laws. The changes are not just forward-looking; they apply retroactively to May 31, 2000. If passed in its current form, Bill C-4 will entrench a system where political parties have free rein to mine personal information with minimal transparency and zero independent oversight. The retroactive nature of these changes adds a further layer of concern, effectively erasing any liability for past misuse. Canadians deserve better than opaque policy maneuvers that trade their privacy for partisan convenience. According toProfessor Michael Geist, this move appears designed to pre-empt a legal challenge in British Columbia where provincial privacy rules were applied to federal political parties. That case is currently under appeal. Rather than allow the court process to unfold, the federal government has taken steps to undercut it entirely by granting all parties legal immunity from most data protection statutes outside the Elections Act. Although a previous attempt to implement similar measures, Bill C-65, failed to pass during an earlier session of Parliament, it at least introduced some checks, such as breach notifications and limits on selling personal information. Those provisions are nowhere to be found in Bill C-4, which takes a more aggressive approach by eliminating safeguards and reaching back a quarter-century to retroactively legitimize any privacy violations. At the core of the exemption is a clause that authorizes political parties and anyone acting on their behalf, whether candidates, staffers, or volunteers, to collect, share, retain, and dispose of personal information as they see fit, so long as their own internal policies permit it. The bill states: “In order to participate in public affairs by endorsing one or more of its members as candidates and supporting their election, any registered party or eligible party… may… carry out any activities in relation to personal information… in accordance with the party’s policy for the protection of personal information.” Not only are political parties excluded from provincial privacy laws, but they also cannot be compelled to disclose what personal data they hold, provide access to it, or correct inaccuracies, even if individuals request it. The legislation makes clear that such responsibilities simply do not apply. One provision reads: “For greater certainty, the registered party, eligible party or person or entity acting on the party’s behalf cannot be required to provide access to personal information… or to correct — or receive, adjudicate or annotate requests to correct — personal information…” The only formal requirement is that each party must publish a privacy policy. That document must list the type of information the party collects, offer examples of how it is used (such as cookie tracking or online outreach), identify a privacy officer, and describe what training staff and volunteers receive. Beyond that, there are no limits on what can be collected or how it can be used. There is also no role for privacy commissioners. No oversight body is empowered to investigate misuse or enforce the few obligations that do exist. Political parties are left to self-regulate, with no consequence for failing to meet even their own stated policies. If you’re tired of censorship and surveillance,subscribe to Reclaim The Net. Resist censorship. Reject surveillance. Reclaim your voice. Stay informed on censorship, cancel culture, and surveillance, and learn how to take your digital rights back. Resist censorship. Reject surveillance. Reclaim your voice. Stay informed on censorship, cancel culture, and surveillance, and learn how to take your digital rights back. Read more **The Federal Data Dragnet Just Got an Upgrade** **The Quiet Coup Against Incognito Mode** **How Every Online Comment Feeds a File You’ll Never See** **The Best Open Source Bookmark and Read-It-Later Tools** **Britain’s Speech Police Just Got a Visit from Uncle Sam** **Your Personal Messages Are Just Waiting to Go Public** **No Warrant No Problem: The Surveillance State Has an App Now** **Surveillance on Wheels: Why You Shouldn’t Connect Your Phone To Your Car** **Meta Courtroom Confessions: When Instagram’s Boss Forgot to Speak in Buzzwords** **The Federal Data Dragnet Just Got an Upgrade** **The Quiet Coup Against Incognito Mode** **How Every Online Comment Feeds a File You’ll Never See** **The Best Open Source Bookmark and Read-It-Later Tools** **Britain’s Speech Police Just Got a Visit from Uncle Sam** **Your Personal Messages Are Just Waiting to Go Public** **No Warrant No Problem: The Surveillance State Has an App Now** **Surveillance on Wheels: Why You Shouldn’t Connect Your Phone To Your Car** Login Home Shop Donate Donate Crypto Contact RSS Privacy Home Subscribe Shop Donate Home Subscribe Shop Donate SUPPORTERS: Login Exclusives Merch Discount Resources Login Exclusives Merch Discount Resources Share this post Defend free speech and individual liberty online."}