{"id": 1493, "name": "Trouw", "domain": "trouw.nl", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.trouw.nl/duurzaamheid-economie/wat-betekent-het-om-arm-te-zijn-in-een-rijk-land-vroeg-anna-custers-zich-af-ons-sociale-zekerheidsstelsel-zet-mensen-juist-klem~b06f159f/", "title": "Wat Betekent Het Om Arm Te Zijn In Een Rijk Land Vroeg Anna Custers Zich Af Ons Sociale Zekerheidsstelsel Zet Mensen Juist Klem~b06f159f", "content": "InloggenU bent niet ingelogd InloggenU bent niet ingelogd InloggenU bent niet ingelogd ServiceKlantenserviceAntwoord op al uw vragenBezorgingUpdates, wijzigingen en klachten **Service** KlantenserviceAntwoord op al uw vragen BezorgingUpdates, wijzigingen en klachten **Service** KlantenserviceAntwoord op al uw vragen BezorgingUpdates, wijzigingen en klachten PersonaliserenMeldingenNieuwsbrievenData en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy **Personaliseren** Meldingen Nieuwsbrieven Data en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy Privacy-instellingen Cookiebeleid Privacy **Personaliseren** Meldingen Nieuwsbrieven Data en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy Privacy-instellingen Cookiebeleid Privacy Privacy-instellingen Cookiebeleid Privacy Meer TrouwKrantWinkelPuzzels & Games **Meer Trouw** Krant Winkel Puzzels & Games **Meer Trouw** Krant Winkel Puzzels & Games Vragen & ContactTip de redactieWat vindt u van deze website?Gebruikersvoorwaarden **Vragen & Contact** Tip de redactie Wat vindt u van deze website? Gebruikersvoorwaarden **Vragen & Contact** Tip de redactie Wat vindt u van deze website? Gebruikersvoorwaarden verdieping duurzaamheid&economie religie&filosofie opinie cultuur&media sport&samenleving podcasts puzzels **Ontdek** Bewaarde artikelenKrantNieuwsbrievenPuzzelsOverlijdensberichten Bewaarde artikelen Krant Nieuwsbrieven Puzzels Overlijdensberichten Bewaarde artikelen Krant Nieuwsbrieven Puzzels Overlijdensberichten **Rubrieken** binnenlandbuitenlandcartoonscultuur&mediadenkendoenduurzaamheid&economiegezondheidlezenonderwijs&opvoedingopiniepodcastspolitiekpuzzelsreceptenreligie&filosofiesport&samenlevingverdiepingweekendwetenschapzorg binnenland buitenland cartoons cultuur&media denken doen duurzaamheid&economie gezondheid lezen onderwijs&opvoeding opinie podcasts politiek puzzels recepten religie&filosofie sport&samenleving verdieping weekend wetenschap zorg binnenland buitenland cartoons cultuur&media denken doen duurzaamheid&economie gezondheid lezen onderwijs&opvoeding opinie podcasts politiek puzzels recepten religie&filosofie sport&samenleving verdieping weekend wetenschap zorg Voorpagina Editie Best gelezen Rubrieken **Wat betekent het om arm te zijn in een rijk land, vroeg Anna Custers zich af. ‘Ons sociale zekerheidsstelsel zet mensen juist klem’** Armoede in Nederland neemt af, maar voor wie erin vastzit, wordt de situatie schrijnender. Hoe kan dat? Lector Anna Custers legt uit hoe ons sociale vangnet soms eerder belemmert dan beschermt. redacteur duurzaamheid en economie Gezinnen zonder fatsoenlijk dak boven hun hoofd, afhankelijk van thee en brood van de buren: vormen van armoede die Anna Custers (40) vaak tegenkwam in Afghanistan en India, waar ze ruim tien jaar werkte als ontwikkelingseconoom, onder andere voor de Wereldbank. Maar wat betekent het om arm te zijn in een rijk land als Nederland? Custers vroeg het zich af toen ze drie jaar geleden terugkeerde, en begon als lector armoede-interventies aan de Hogeschool van Amsterdam, op zoek naar antwoorden. “Ik zie dat armoede in Nederland fysieker wordt”, zegt Custers. “In de jaren zestig werd vooral gesproken over sociale uitsluiting: een bloemetje op tafel stond symbool voor een waardig leven. Nu zijn die normen niet alleen verschoven, mensen komen ook letterlijk basiszaken tekort.” Ze beschrijft gezinnen waarin kinderen zonder ontbijt naar school gaan, slapen op matrassen van het grofvuil, en wonen in tochtige woningen met schimmel op de muren en zonder gordijnen. “De verwarming staat standaard op vijftien graden omdat de energierekening anders niet te betalen is.” Armoede in Nederland is meer dan een tekort aan geld, stelt Custers. Het is een stapeling van tekortkomingen: te dure woningen, ongelijke onderwijskansen, hardnekkige schulden en grote gezondheidsverschillen. Mensen met een laag inkomen leven gemiddeld 21 jaar korter in goede gezondheid en sterven tot negen jaar eerder dan hun rijkere landgenoten. Er ligt een knelpunt bij bestaansonzekerheid, zegt ze. “Wie een te laag of te instabiel inkomen heeft, mist de zekerheid van een stabiel en volwaardig bestaan.” Hoe is die bestaansonzekerheid ontstaan? “Er zijn meerdere trends die samenkomen. De inflatie die volgde toen de oorlog in Oekraïne uitbrak, heeft veel huishoudens hard geraakt, maar het probleem gaat veel verder terug. Het is ons sociale zekerheidsstelsel dat mensen juist klemzet.”“Waar in Afghanistan een sociaal vangnet volledig ontbreekt, hebben we hier een complex netwerk van toeslagen en regelingen. Dat systeem is met goede bedoelingen gebouwd, maar door de vele uitbreidingen is het log en ondoorzichtig geworden.”“Draai je aan één knop, zoals het verhogen van een toeslag, dan ontstaan er onbedoelde gevolgen elders. Je zet A in beweging, en bij luik B, C of D gaat iets mis.” En wat betekent dat complexe systeem voor mensen met een laag inkomen? “Zij raken vaak verdwaald in het web van landelijke toeslagen en gemeentelijke regelingen. Sommige gemeenten hebben meer dan 35 regelingen voor verschillende doelgroepen. Elke regeling heeft haar eigen voorwaarden, en die sluiten vaak niet op elkaar aan. Keer op keer moeten mensen hun gegevens opnieuw aanleveren in een ingewikkeld systeem.” “Gezamenlijk hebben de regelingen al snel zo’n 150 voorwaarden. Stel dat je alleenstaande ouder bent met een minimuminkomen: in theorie kun je aanspraak maken op 36 regelingen. Maar door de complexiteit, angst voor terugvorderingen en gebrek aan overzicht grijpen veel mensen hiernaast, terwijl ze de steun hard nodig hebben.” Tegelijkertijd laten cijfers zien dat armoede in Nederland afneemt. “Dat klopt. Met financiële steun van de overheid zijn flink wat mensen uit de armoede gehaald: van 1,2 miljoen in 2018 naar 540.000 in 2023. Dat is positief, een verbetering die vooral komt door miljarden aan inkomenssteun: verhogingen van toeslagen, een hoger minimumloon en extra steun tijdens de energiecrisis en inflatiepiek. Logisch dat zulke ingrepen effect hebben, het zou pas vreemd zijn als dat niet zo was.” Maar er is ook een scheefgroei ontstaan, zegt Custers. “De inkomenssteun heeft vooral mensen in de bijstand bereikt. Na jaren van achterstallig beleid hebben zij met toeslagen en regelingen hun koopkracht zien stijgen en zijn dichter bij de armoedegrens gekomen, en in driekwart van de gevallen er overheen getild.” Ook het totaal aantal werkende armen is flink afgenomen de afgelopen vijf jaar, zegt Custers. Maar een andere groep, de werkenden die onder de armoedegrens leven, blijft steken. Zij zijn niet goed bereikt met het beleid dat de afgelopen tijd is gevoerd. Wie zijn die werkenden onder de armoedegrens? “Flexwerkers, zzp’ers en parttimers die weinig uren maken, zo’n 240.000 mensen. Voor hen is de afstand tot de armoedegrens groter geworden, ze zijn verder weggezakt. Dat komt door stijgende kosten voor basisvoorzieningen, zoals boodschappen en energie, en door het feit dat de armoedegrens zelf is gecorrigeerd voor inflatie. Voor hen is het inkomen niet evenredig meegestegen. Tegelijkertijd maken deze werkenden minder gebruik van inkomenssteun, of hebben ze hoge zorgkosten of woonlasten.” Gezinnen in de bijstand halen meer dan de helft van hun inkomen uit toeslagen. Voor huur, zorg en kinderen. Ook voor werkenden met een laag inkomen zijn die toeslagen onmisbaar. Maar er is een groep werkenden, met name zelfstandigen, die er minder vaak gebruik van maakt. Dat zorgt voor armoede, zegt Custers, ondanks het werk. Waarom komt de inkomenssteun minder terecht bij mensen met werk? “Veel werkenden op of rond de armoedegrens weten niet van hun rechten, ze denken dat het niet voor hen is en durven het aanvraagproces niet aan. Of ze zijn bang om het later terug te moeten betalen. Een verkeerde inschatting van het inkomen aan het begin van het jaar, wat bij flexwerkers en zelfstandigen eerder regel dan uitzondering is, kan leiden tot flinke schulden.” “Zo zijn mensen in de bijstand in dit opzicht vaak beter af. Zij zijn geregistreerd bij de gemeente en worden actief geholpen bij het aanvragen van toeslagen. Werkende armen zijn daarentegen minder zichtbaar, niet bekend bij de gemeente, en maken vaak geen gebruik van toeslagen en regelingen.” Wat kan de overheid anders doen? “De problemen met het toeslagensysteem zijn al lang bekend. Er liggen meer dan 900 pagina’s aan rapporten die de gebreken van ons socialezekerheidsstelsel opsommen. Terwijl het kabinet zegt van het toeslagensysteem af te willen en de kennis er is, blijven ze sleutelen aan toeslagen om koopkracht te repareren. Hierdoor graven ze zich alleen maar dieper in.” Volgens Custers is er bredere inkomenssteun nodig. “Wil je armoede echt terugdringen, dan moeten meer mensen structureel boven de armoedegrens uitkomen. Dat kan bijvoorbeeld met een hoger minimumloon of een basale uitkering die inkomenszekerheid biedt, waardoor de afhankelijkheid van toeslagen afneemt.” Maar volgens Custers is geld alleen niet genoeg. Ongelijkheden stapelen zich op: slechte woonomstandigheden, ongelijke kansen in het onderwijs, hardnekkige gezondheidsverschillen. “Als we het probleem echt willen aanpakken, dan moeten we het hele sociale systeem herzien. Alleen aan inkomensknoppen draaien, werkt niet meer.” Worden er ook al stappen gezet? “Zeker. Sommige gemeenten experimenteren met het vereenvoudigen van regelingen. Dat is een goede eerste stap, maar voldoende is het niet. Daar is toch echt de Rijksoverheid bij nodig: structurele investeringen op het gebied van wonen, onderwijs, inkomen en gezondheid.” **Lees ook:** **Waarom armoede vrouwen harder raakt. ‘Wie écht gendergelijkheid wil, moet ook armoede aanpakken’** In de strijd voor gelijke kansen richt Nederland zich te veel op het aanmoedigen van ‘topvrouwen’ en te weinig op alleenstaande moeders, mantelzorgers en werkende armen, stelt VN-vrouwenvertegenwoordiger Hoba Gull.Dat moet anders. **Wilt u iets delen met Trouw?** Over ons Opiniestuk insturen Privacystatement Abonnementsvoorwaarden Gebruiksvoorwaarden Cookiebeleid Privacy-instellingen Auteursrecht Colofon Klantenservice Bezorgklacht indienen Bezorging pauzeren Bezorging wijzigen (Bezorg)adres wijzigen Adverteren Losse verkoop Abonneren Nieuwsbrieven Krant Webwinkel RSS-feeds Facebook Android apps iOS apps Columnisten Recensies Archief Op alle verhalen vanTrouwrust uiteraard copyright.Wil je tekst overnemen of een video(fragment), foto of illustratie gebruiken, mail dan naarcopyright@trouw.nl. Trouw is onderdeel van DPG Media. KvK Nummer: 34172906 | BTW Nummer: NL810828662B01 © 2025 DPG Media B.V. Alle rechten voorbehouden"}