{"id": 654, "name": "Johns Hopkins Medicine", "domain": "hopkinsmedicine.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.hopkinsmedicine.org/news/articles/2025/05/quest-finds-relief-in-rare-gi-diagnosis-and-treatment-feeding-therapy", "title": "Quest Finds Relief In Rare Gi Diagnosis And Treatment Feeding Therapy", "content": "Johns Hopkins Medicine Home About Patient Care Health Research School of Medicine MyChart Schedule an Appointment Find a Doctor Find a Clinical Trial Pay Your Bill Employment **News & Publications** **News & PublicationsMain Menu** Home E-Newsletters Publications Social Media Community For the Media (Newsroom) Podcasts **Quest Finds Relief in Rare GI Diagnosis and Treatment, Feeding Therapy** A mother often knows her baby best. For Melissa, that mother’s intuition kicked in within the first few weeks of bringing her newborn son, Quest, home from the hospital. At first, there was no indication of any gastrointestinal issues and Quest seemed perfectly healthy. He passed meconium, the first stool babies have, which is often formed in the intestines when the baby is still in the womb and generally passed within 24 hours of birth. Like many parents, Melissa kept a diaper chart. She and Quest’s father noticed instead of full bowel movements, Quest had small smudges in his diaper. Quest’s pediatrician reassured the new parents that breastfed babies sometimes have constipation issues that can be resolved on their own. “Then the bowel movements seemed to be taking longer,” Melissa remembers. “Like, we're at, you know, two, three weeks, no bowel movement. At 3 weeks old, he finally had one and I remember hearing him scream. I picked him up and he had extremely hard stool.” A Lifechanging Diagnosis When Quest was 5 months old, the new parents received a referral from their pediatrician that would change Quest’s life for the better. They met withDan McClenathan, M.D., the chief of theDivision of Pediatric Gastroenterology, Hepatology and Nutritionat Johns Hopkins All Children’s Hospital in St. Petersburg, Florida. “Dr. McClenathan was concerned for Hirschsprung's disease,” Melissa says. “So, we did biopsies that came back abnormal, but negative for Hirschsprung's disease.” That led to more testing. Quest had three biopsies, two radiology tests, multiple sets of labs and one surgery. Finally, a biopsy came back with the answer McClenathan had been seeking: hypoganglionosis. Hypoganglionosis is a rare intestinal condition characterized by a reduced number of ganglion nerve cells in the gut. “Ganglion cells are nerve cells in the lining of the colon,” McClenathan explains. “Without these cells, the motility of the colon is not normal. These cells help the colon contract and move. There is a condition called Hirschsprung's where there is complete absence of these cells. We then have very infrequent cells, and this is where we see hypoganglionosis, which is extremely rare.” McClenathan says with pediatric GI patients, it’s important to find a diagnosis. “We knew there was something wrong, so we kept pushing for answers,” McClenathan says. “Finally, we came to a diagnosis, and this helps tremendously with creating a good treatment plan and a better prognosis.” Surgical Solutions Quest was put on a regimen of supplements that can serve as laxatives for young children. “They would work and then they would stop working,” Melissa says. “So, Quest began to get admitted to Johns Hopkins All Children’s Hospital for cleanouts because he was so backed up with stool. Sadly, nothing was consistently working for him.” At one point, Quest was coming in on a monthly basis to Johns Hopkins All Children’s for cleanouts. McClenathan continued to seek a better solution, eventually recommending a gastrointestinal motility specialist — an expert in how muscles move food through the body — in Orlando. There, doctors found about 20 centimeters of Quest’s large intestine were not functioning. Doctors in Orlando recommended and performed a colostomy, which is a surgical procedure where an opening (stoma) is created in the abdominal wall to divert stool from the colon (large intestine) through a pouch instead of the rectum. Quest’s colostomy operation was in January 2025, but Melissa says already he’s doing remarkably better. Quest, who will turn 3 years old in July, is constantly on the go. “He's thriving, he's happy, nothing is stopping him,” Melissa says. “He plays and has no more tummy aches, no more hospital visits for cleanouts.” Melissa has also made sure Quest’s stoma (the area where the stool is diverted into a pouch) has become a normal part of his life. Quest even named the stoma: Cuffy. “I love it because I want him to be proud,” Melissa says. “I want him to be proud of his stoma because, the stoma saved his life.” McClenathan says Quest’s outlook is bright. “Quest will always deal with constipation, but long term, it will get better as he ages,” he says. He also adds parents should take the initiative, like Melissa did, to look out for any potential issues. “Parents should look for major constipation, bleeding, poor growth and feeding issues to indicate a possible GI issue in young babies,” McClenathan adds. “Parents would typically raise these questions with their pediatrician. Pediatricians are experts at determining if this is a normal phase or abnormal and refer to GI subspecialties if needed.” Melissa has used Quest’s experience to advocate on behalf of children with rare gastroenterology issues by becoming an ambassador through a group called REACH, which is committed to improving the lives of children and families with Hirschsprung’s disease to promote education and research. “My advice is to push for your child, push for yourself, and push for answers from your child’s specialist,” she says. “My experience with Dr. McClenathan has been nothing short of amazing. He listens to us. He is willing to investigate our concerns. He saved my baby. I couldn’t be more grateful.” Expanded Care This spring, Johns Hopkins All Children’sacquired the Pediatric Gastroenterology, Hepatology and Nutrition practice. Although the GI practice has partnered with Johns Hopkins All Children’s for 40 years, McClenathan says the acquisition will make a difference. He founded the gastroenterology practice in 1984. “Our practice and All Children’s have come a long way through the years,” McClenathan says. “I’m proud of being able to care for so many families, and this helps ensure our team will be able to continue to care for kids for generations to come.” This transition gives patients greater access to tools such as the MyChart patient portal, which connects patients and families with electronic health records and care instructions and enhances communication with the clinical team. The gastroenterology team now has greater ability to use the research and resources of Johns Hopkins Medicine, and the hospital will be able to build on the gastroenterology program’s success as it expands toa second hospital campus in Wesley Chapel. That campus is scheduled to open in 2027. Feeding Therapy As for Quest, he’s thriving in another program at Johns Hopkins All Children’s as well. He takes part in feeding therapy where he’s learning through games and play how to swallow and chew foods more carefully. While not related to the hypoganglionosis, Melissa says Quest has been prone to choking on food since he was a baby. Doctors suspect it may be due to a delayed epiglottis, meaning his epiglottis (the flap-like cartilage that covers the trachea during swallowing) may not close completely or quickly enough while Quest swallows. Quest has been working for several months with Sophia Reh, M.S., CCC-SLP in theSpeech-Language and Feeding Therapyprogram. Together, they focus on taking small bites and chewing completely. “It’s making a big difference,” Melissa says. “We had several close calls where he would swallow something whole, choke and I would have to pat him on his back to get the food out. It’s scary.” Melissa says Quest’s therapy sessions with Reh, or “Ms. Sophia” as Quest calls her, are making all the difference. “He's learning a lot from her and he's taking it home with him. He tells me when we sit at the table ‘I'm chewing, mommy.’ He will show me how he chews his food. So, it's helping him a lot. I'm very thankful for this program.” Reh is thrilled with Quest’s progress as well. “He’s been doing amazing with feeding therapy. When we first started, he had very minimal oral intake. He had difficulty chewing food and difficulty consuming an adequate amount of intake to support his nutritional needs. So, we've been working on both improving his intake and his chewing skills, and he's made huge progress in just the few months we've been together,” she says. “We make it a positive experience for Quest because feeding can be difficult, especially when you have underlying GI issues, so we focus on making him feel accomplished and proud,” Reh said. Reh also helped Quest find a better cup for drinking fluids and better head positioning to enhance Quest’s oral motor skills. “He's come super far, making huge progress, so I'm very proud of him, and I love working with him,” Reh adds. Melissa is grateful for both the GI and feeding therapy programs for how much they’ve helped her son to thrive. “I’ve had nothing but a great experience with Johns Hopkins All Children’s. The doctors and nurses here are amazing and I see them as my child’s heroes. We are so grateful they’re in our lives.” **TreatmentDivision of Pediatric Gastroenterology, Nutrition & Hepatology at Johns Hopkins All Children's** **News & Publications** Home E-Newsletters Publications Social Media Community For the Media (Newsroom) Podcasts **** Español አማርኛ 繁體中文 Français Tagalog Русский Português Italiano Tiếng Việt Ɓàsɔ́ɔ̀-wùɖù-po-nyɔ̀ Igbo asusu èdè Yorùbá বাংলা 日本語 한국어 Kreyòl Ayisyen العربية Deutsch Polski Ελληνικά ગુજરાતી ภาษาไทย اُردُو فارسی हिंदी Deitsch ខ្មែរ"}