{"id": 1521, "name": "Valdosta Daily Times", "domain": "valdostadailytimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://valdostadailytimes.com/2025/06/05/sgmc-health-celebrates-historic-graduation-of-inaugural-class-of-resident-physicians/", "title": "Sgmc Health Celebrates Historic Graduation Of Inaugural Class Of Resident Physicians", "content": "Home Subscriptions Newsletter signup E-Edition NewsYour NewsState NewsGA-FL NewsNational/International Your News State News GA-FL News National/International Your News State News GA-FL News National/International Obituaries SportsYour SportsState SportsNational Sports Your Sports State Sports National Sports Your Sports State Sports National Sports CommunityEngagementsWeddingsAnniversaries Engagements Weddings Anniversaries Engagements Weddings Anniversaries ClassifiedsJobs Jobs Jobs Public noticesLocal noticesGeorgia public notices Local notices Georgia public notices Local notices Georgia public notices ServicesContact UsAbout Us Contact Us About Us Contact Us About Us Home News Sports Obituaries Community Classifieds Notices Contests E-Edition **SGMC Health celebrates historic graduation of inaugural class of resident physicians** Published 5:33 pm Thursday, June 5, 2025 By Staff report SGMC Health celebrated a landmark moment in its history Saturday, May 31, as it honored the graduation of its first class of resident physicians. In a meaningful ceremony, seven internal medicine residents were formally recognized for completing their three-year training program, marking a new era in medical education and healthcare excellence for South Georgia. Jean Sumner, M.D., dean of Mercer University School of Medicine, delivered the keynote commencement address, highlighting the profound impact of training physicians in the communities they serve and the strength of SGMC Health’s collaboration with MUSM. **Email newsletter signup** “This is a momentous occasion not only for SGMC Health but for the entire South Georgia region,” said Ronald E. Dean, president and chief executive officer of SGMC Health. “We are proud to see these talented physicians take the next step in their careers and look forward to the lasting impact they will have on the communities they serve.” The graduating residents — Rija Chaudhary, M.D.; Venkata Gandi, M.D.; Monica Kovuri, M.D.; Dwayne Mohan, M.D.; Anum Munir, M.D.; Shilpa Reddy, M.D.; and Rosaida Silverio-Lopez, M.D. — represent the inaugural class of the program. Among them, Drs. Gandi and Kovuri were honored for their leadership and service as chief residents, playing a vital role in mentoring peers and supporting program operations. Dr. Kovuri was also named the recipient of the Excellence in Residency Award, a prestigious recognition presented to a graduating resident who exemplifies clinical excellence, professionalism, leadership and compassionate patient care. In addition, Dr. Silverio-Lopez received the Scholarly Excellence Award for her outstanding contributions to academic research, scholarly activity and commitment to evidence-based medicine. In a testament to the program’s mission and impact, three of the graduates will remain at SGMC Health as teaching hospitalists, continuing to serve the South Georgia community and helping train future generations of physicians. “This milestone is the result of years of dedication, vision and collaboration,” said Joseph Hayes, M.D., designated institutional official at SGMC Health. “Our graduates represent the future of medicine, and we’re honored to have played a part in shaping their journey.” The Internal Medicine residency at SGMC Health is a rigorous three-year program emphasizing both inpatient and outpatient care, preparing residents to diagnose, treat and manage a broad range of adult medical conditions. The program’s continued success underscores the health system’s commitment to strengthening local care through education and workforce development. Now in its fourth year, SGMC Health’s Graduate Medical Education program continues to expand and thrive. In addition to a full class of internal medicine residents, the system also offers a one-year transitional year residency program, providing foundational clinical experience for physicians entering various specialties. Looking ahead, SGMC Health will launch a family medicine residency program in 2026, further reinforcing the organization’s commitment to advancing healthcare access, education and quality throughout the region. To learn more, visit sgmc.org. **You Might Like** **“Our Homes, Our Future” campaign launches in Valdosta** **“Our Homes, Our Future” campaign launches in Valdosta** **Camp Arrow celebrates 50 years of inclusion and summer fun** **Camp Arrow celebrates 50 years of inclusion and summer fun** **SGMC Health expands mental health services with opening of SGMC Psychiatry** **SGMC Health expands mental health services with opening of SGMC Psychiatry** **New business delivers laundry through an app** **New business delivers laundry through an app** News Obituaries Sports Community Contests e-Edition Subscriptions Classifieds Jobs Public Notices Georgia Public Notices About Us Contact Us"}