{"id": 1829, "name": "USA Television", "domain": "usa-television.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://usa-television.com/prabowo-back-from-the-usa-received-a-jumbo-fund-injection-of-idr-17-5-trillion-for-indonesian-health/", "title": "Prabowo Back From The Usa Received A Jumbo Fund Injection Of Idr 17 5 Trillion For Indonesian Health", "content": "USA TV & News Network Page Privacy Policy **Prabowo Back from the USA Received a Jumbo Fund Injection of IDR 17.5 Trillion for Indonesian Health** Souvenirs from Prabowo’s Visit to the United States, Received a Jumbo Fund Injection of IDR 17.5 Trillion for Indonesian Health There was a souvenir from Indonesian President Prabowo Subianto after he visited the United States (US) some time ago, because the federal republic injected a jumbo fund of 58.9 million US dollars or around IDR 934.4 billion for the Indonesian health system in the past year. “For decades, the United States has partnered with Indonesia to develop Indonesia’s infrastructure, health system, and economy,” he said. The US diplomat further noted that the United States has mobilized more than 500 million US dollars (IDR 7.9 trillion) in humanitarian assistance and recovery efforts to support Indonesia in handling the Aceh tsunami which has benefited more than 580,000 people. **Post navigation** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. usa-television.com www.ukreplica.me transpacifichosting.com **Recent Posts** Release of Furniture Product Exports to the French and United States Markets Trump prepares strategy to tackle Latin American migration to USA Prabowo Back from the USA Received a Jumbo Fund Injection of IDR 17.5 Trillion for Indonesian Health Indonesia and the USA build command center in IKN **Archives** November 2024 **Categories** Uncategorized"}