{"id": 2094, "name": "Patriot News Alerts", "domain": "patriotnewsalerts.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.patriotnewsalerts.com/leftists-growing-desperate-as-former-president-barack-obama-has-become-unusually-quiet-during-the-trump-era/", "title": "Leftists Growing Desperate As Former President Barack Obama Has Become Unusually Quiet During The Trump Era", "content": "Home About Us Latest News Contact Us Unsubscribe **Leftists growing desperate as former President Barack Obama has become unusually quiet during the Trump era** Former President Barack Obama has been unusually quiet as the left mounts its resistance against President Donald Trump,The Atlanticreported. Staff writer and book author Mark Leibovich believes the former leader is just what the Democratic Party needs to reverse its decline. The left can't seem to let go of the past. Whether it's failed candidates like Hillary Clinton and Stacy Abrams or their previous winners like Obama, they believe recycling the same politicians is the key to future success. Liebovich was almost begging Obama to return to the forefront of politics in his essay \"Where Is Barack Obama?\" published Sunday. He demonstrated no awareness that Obama was part of the problem Democrats face today. \"Trump has begun his second term with a continuous spree of democracy-shaking, economy-quaking, norm-obliterating action. And Obama, true to form, has remained carefully above it all,\" Liebovich gushed. **Missing in action** The author hit the usual talking points about Trump to make the case for a more prominent role for Obama in the public discourse these days. While he acknowledges that Obama hasn't been completely missing in action, he believes the former president isn't doing enough. \"No matter how brazen Trump becomes, the most effective communicator in the Democratic Party continues to opt for minimal communication. His 'audacity of hope' presidency has given way to the fierce lethargy of semi-retirement,\" Liebovich charged. While Obama pops up for serious reasons every now and then, he also seems to revel in more cushy cultural roles like his \"summer and year-end book, music, and film recommendations.\" The author sees this as unacceptable in light of Trump's presidency. \"In normal times, no one would deny Obama these diversions. He performed the world’s most stressful job for eight years, served his country, made his history, and deserved to kick back and do the usual ex-president things: start a foundation, build a library, make unspeakable amounts of money,\" Liebovich contends. \"But the inevitable Trump-era counterpoint is that these are not normal times.And Obama’s detachment feels jarringly incongruous with the desperation of his longtime admirers—even more so given Trump’s assaults on what Obama achieved in office,\" he added. **Too much faith** Liebovich mentions Obama's one contribution to the 2024 presidential election, which was convincing then-President Joe Biden to give up his reelection bid. The author downplays the implications of the Democrats' loss in relation to Obama's continued popularity. \"Obama did insert himself in the 2024 election, reportedly taking an aggressive behind-the-scenes role last summer in trying to nudge Biden out of the race. He delivered a showstopper speech at the Democratic National Convention and campaigned several times for Kamala Harris in the fall,\" Liebovich claimed. However, the truth is that Obama just couldn't push Biden or then-Vice President Kamala Harris, his replacement, over the finish line. If Obama were the oracle Liebovich makes him out to be, it would have been an easy win for either Democrat. The author closes with a fantasy scenario where Obama would steal Trump's thunder during the June 14 parade in Washington, D.C., to celebrate the Army’s 250th anniversary. \"Few things would fire up Democrats like a head-to-head matchup between Trump and Obama,\" Liebovich added. What Democrats fail to realize is that Obama's popularity was never as universal as they made it out to be, and handwringing over his diminished role is a waste of time. Perhaps Obama is trying to preserve his legacy by lying low while the party implodes under its own weight. **Latest News**"}