{"id": 45, "name": "Ad Fontes Media", "domain": "adfontesmedia.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://adfontesmedia.com/become-an-analyst-for-the-media-bias-chart/", "title": "Become An Analyst For The Media Bias Chart", "content": "AboutAbout UsOur TeamPressNewsAbout UsOur TeamPressNews About UsOur TeamPressNews Our TeamPressNews PressNews News About Us Our Team Press News About UsOur TeamPressNews Our TeamPressNews PressNews News Our TeamPressNews PressNews News PressNews News News About Us Our Team Press News Media Bias Chart®Interactive Media Bias ChartStatic ChartMethodologySource PagesInteractive ChartInteractive ChartStatic ChartMethodologySource Pages Interactive Media Bias ChartStatic ChartMethodologySource Pages Static ChartMethodologySource Pages MethodologySource Pages Source Pages Interactive Chart Interactive Chart Static Chart Methodology Source Pages Interactive Media Bias ChartStatic ChartMethodologySource Pages Static ChartMethodologySource Pages MethodologySource Pages Source Pages Static ChartMethodologySource Pages MethodologySource Pages Source Pages MethodologySource Pages Source Pages Source Pages Interactive Chart Interactive Chart Static Chart Methodology Source Pages Products & ServicesAdvertisersPublishersEducatorsIndividualsBusinessesSchoolsIndividualsAdvertisersPublishersEducatorsIndividuals AdvertisersPublishersEducatorsIndividuals PublishersEducatorsIndividuals EducatorsIndividuals Individuals Businesses Schools Individuals Advertisers Publishers Educators Individuals AdvertisersPublishersEducatorsIndividuals PublishersEducatorsIndividuals EducatorsIndividuals Individuals PublishersEducatorsIndividuals EducatorsIndividuals Individuals EducatorsIndividuals Individuals Individuals Businesses Schools Individuals Advertisers Publishers Educators Individuals ResourcesTopic of the WeekBlogResearchAcademic CitationsTopic of the WeekBlogResearchAcademic Citations Topic of the WeekBlogResearchAcademic Citations BlogResearchAcademic Citations ResearchAcademic Citations Academic Citations Topic of the Week Blog Research Academic Citations Topic of the WeekBlogResearchAcademic Citations BlogResearchAcademic Citations ResearchAcademic Citations Academic Citations BlogResearchAcademic Citations ResearchAcademic Citations Academic Citations ResearchAcademic Citations Academic Citations Academic Citations Topic of the Week Blog Research Academic Citations SupportDonateShopDonateShop DonateShop Shop Donate Shop DonateShop Shop Shop Donate Shop AboutAbout UsOur TeamPressNews About Us Our Team Press News About Us Our Team Press News Media Bias Chart®Interactive Media Bias ChartStatic ChartMethodologySource Pages Interactive Media Bias Chart Static Chart Methodology Source Pages Interactive Media Bias Chart Static Chart Methodology Source Pages Products & ServicesAdvertisersPublishersEducatorsIndividuals Advertisers Publishers Educators Individuals Advertisers Publishers Educators Individuals ResourcesTopic of the WeekBlogResearchAcademic Citations Topic of the Week Blog Research Academic Citations Topic of the Week Blog Research Academic Citations SupportDonateShop Donate Shop Donate Shop AboutAbout UsOur TeamPressNews About Us Our Team Press News About Us Our Team Press News Media Bias Chart®Interactive Media Bias ChartStatic ChartMethodologySource Pages Interactive Media Bias Chart Static Chart Methodology Source Pages Interactive Media Bias Chart Static Chart Methodology Source Pages Products & ServicesAdvertisersPublishersEducatorsIndividuals Advertisers Publishers Educators Individuals Advertisers Publishers Educators Individuals ResourcesTopic of the WeekBlogResearchAcademic Citations Topic of the Week Blog Research Academic Citations Topic of the Week Blog Research Academic Citations SupportDonateShop Donate Shop Donate Shop **Become an Analyst for Ad Fontes Media** **What We Do – We Rate The News®** Every day, our team of analysts is busy rating news articles and episodes for both bias and reliability. Each article or show is rated by at least three analysts – one left-leaning, one right-leaning and one center, politically. All of our media analysts complete a training period that includes a thorough introduction to our methodology, as well as practice rating articles and other news content. We purposefully assign each analyst a breadth of coverage over as many sources as possible to enhance each analyst’s familiarity with sources across the spectrum. Analysts generally score articles similarly following our analysis training, regardless of their political lean; however, when significant differences occur, the group engages in a conversation during which analysts present their rationale for their respective scores. We do not rate the merits of political positions. Rather, we place the content where it descriptively belongs relative to the current range of political thought within the United States. When scoring for reliability, our method focuses on classifying content along a continuum including fact, analysis, opinion, incomplete story, propaganda, and fabricated information. All of the above minimizes the impact of analyst bias on reliability and source bias scoring. It results in a rating of sources that many individuals, instructors, and other stakeholders find helpful in navigating today’s news ecosystem. **Working as an analyst** Most of our analysts work part time, and all work fully remote.This is a paid position at $20/hour, and analysts are required to work a minimum ofsixhours per week. Has a passionate interest in news media, contemporary U.S. politics, and the work and mission of Ad Fontes Media Has completed a bachelor’s degree Demonstrates excellent reading comprehension skills Demonstrates excellent analytical skills Demonstrates ability to engage in sometimes difficult conversations, including on sensitive issues Demonstrates ability to see issues from multiple perspectives while also respectfully expressing a dissenting perspective when applicable Lives in the United States, and is politically/civically engaged Has a personal computer and reliable internet, and is able to troubleshoot basic technical issues Is familiar with a range of news sources Is familiar with party platforms and government systems in the U.S. Is willing to divulge political leanings internally as required by our approach to analysis Has achieved an advanced degree, or a highly relevant undergraduate degree, in Media, Journalism, Political Science, Linguistics, History, Sociology, Philosophy, or other fields requiring strong skills in analyzing information content Fluent in Spanish (for specific positions) Please note: There are currently no analyst positions available; however, applications are accepted for future positions. Applicants are required to complete a self-classification survey on personally held political perspectives, along with an availability survey and skills self-assessment. All such information will be used only for the application process and for placement in a politically diverse analysis team and will be kept otherwise confidential except when analysts wish to divulge political leanings publicly. Please completeboth the application and political assessmentto be considered for employment. A resume/CV (required) and cover letter (optional) will be uploaded as part of the application. We look forward to hearing from you! Questions about the application process should be sent toinfo@adfontesmedia.com. **Want us to rate an article or episode?** This benefit is limited to ONE free article/episode per person. Want to submit more articles or episodes? Sign up for aNews Nerdmembership! **Quick Links** Home About Us Contact Us Become an Analyst Speaking Engagements **Media Bias Chart** Interactive Static Methodology Rated **Contact Us** info@adfontesmedia.com education@adfontesmedia.com +1 720-288-0412 **Copyright © 2025 Ad Fontes Media, Inc | All Rights Reserved** Terms of Use Privacy Policy Cookies Want to make sure you always see thelatest versions of the Media Bias Chart?Join the Ad Fontes Media email list! You’ll get information about all of our work fornews consumers, educators and enterprises."}