{"id": 1564, "name": "We Hunted the Mammoth", "domain": "wehuntedthemammoth.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wehuntedthemammoth.com/2025/05/30/jordan-petersons-christian-cosplaying-has-come-to-an-ignominious-end-but-some-have-been-quick-to-forgive-him/#more-132018", "title": "Jordan Petersons Christian Cosplaying Has Come To An Ignominious End But Some Have Been Quick To Forgive Him", "content": "About WHTM About David Futrelle Comments Policy Support the Mammoth! WHTM on YouTube Writing Coaching About WHTM About David Futrelle Comments Policy Support the Mammoth! WHTM on YouTube Writing Coaching **Jordan Peterson’s Christian cosplaying has come to an ignominious end. But some have been quick to forgive him** Post authorByDavid Futrelle Post dateMay 30, 2025 21 Commentson Jordan Peterson’s Christian cosplaying has come to an ignominious end. But some have been quick to forgive him We Hunted the Mammoth won’t lie to you about its religious beliefs, or lack thereof. Pleasedrop a few bucks hereorhereif you can! And if you’re feeling stuck as a writer,I can help! For several years now, Canadian fussbudget intellectual Jordan Peterson has been presenting himself as “a new kind of Christian,” as he once put it inan interview, talking endlessly about what he sees as the moral lessons of the Bible and writing a576-page booktaking readers through famous stories in the Old Testament. But there’s always been a question about whether or not he’s a “real” Christian, who believes in the divinity of Jesus and the resurrection and all that, or an opportunist who has seized on a number of Bible stories as useful narratives that seem to reinforce his reactionary judgements of the supposed moral failings of contemporary culture. Seems pretty clear to me that it’s that second one. Peterson basically answered this question by refusing to answer whether or not he was a Christian in an exceedingly embarrassing (for him)YouTube debatethat you’ve probably already seen clips of. (If not, I’ve attached a few at the bottom of the post.) Peterson was prickly, defensive, and evasive about many topics related to the Christianity he was supposed to be defending, and crashed out entirely when he was asked to confirm his religious beliefs, to which he responded “I don’t have to tell you.” This is basically equivalent to admitting youdon’tbelieve, because publicly professing your faith in Jesus is kind of a big deal for Christianity. Like, a “you’re going to go to hell if you don’t” sort of deal. As Romans 10states, “if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.” And if you don’t, well,Jack Chickwould tell you that you’reheaded for the lake of fire. Non-fans of Peterson have reacted to his debate implosion, and his revealing evasiveness on the whole Christian question, with a certain understandable glee. But what do Christians make of it? From a cursory investigation of the Christosphere, it seems that some are disappointed, and some are angry—but others are willing to cut the apparently hellbound Peterson some slack because despite his seeming lack of belief he’s been reportedly bringing people to Jesus. Let’s start with the forgivers. A headline in Christian Today after the debate declared that“Jordan Peterson is not a Christian, but he is our friend.”In the article itself, Robert Parr noted that “Peterson has a long history of giving vague, and seemingly evasive answers about whether he actually believes in God or is a Christian.” Even though Parr suggested that Peterson may be simply “conflicted” he went on to argue that Jordan Peterson doesn’t appear to be a Christian in any conventional sense, however I believe him to be an ally to the faith who has probably done a lot over the last decade to open otherwise closed hearts to the Bible. He’s a heart-opener! Many young people, who twenty years ago would have been cheering on Richard Dawkins and Christopher Hitchens, are instead looking towards Peterson. They are no longer looking at the Bible as a primitive book of superstitions, but as a treasure trove of wisdom and insight into the human condition. This may not lead them into an explicit faith, but many times it does, and many of those who have yet to embrace Christ no longer hold militant atheist views but increasingly see something of value in the faith they may once have derided. So, while we must always remember that Jordan Peterson isn’t really one of us, he has been and probably will be a valued friend and ally to Christianity. Meanwhile, in his newsletter for Christianity Today (which is not the same as Christian Today), Russell MooreacknowledgedPeterson’s “evasiveness,’ but suggested that this was because Peterson is still working through his beliefs. “[P]erhaps … Peterson is becoming broadly convinced that something or someone is out there beyond his sight, but he’s not yet sure what or who that is,” Moore speculated. Of course, if that’s true Peterson probably shouldn’t have called himself any kind of Christian, huh, much less agreed to play the role of a Christian in a debate billed as one between a believer and a bunch of atheists. But never mind. Let’s let Moore continue. “[M]aybe behind Peterson’s hesitation, there’s something more than artful dodging,” Moore suggested. Peterson’s name is literally “Peter’s son.” And maybe he is. Perhaps he is following in the way of Simon Peter, still answering the question “Who do people say that the Son of Man is?” but not yet ready to answer for himself (Matt. 16:13). … “I don’t know” is not a final answer to the most important question posed on YouTube or in life. But sometimes it’s a good start. Of course, Peterson didn’t say “I don’t know” to this “most important question.” He said “I don’t have to tell you,” which is really rather different. After all, inMark 8:38Jesus famously declared that “[i]f anyone is ashamed of me and my words in this adulterous and sinful generation, the Son of Man will be ashamed of them when he comes in his Father’s glory with the holy angels.” Hey, if they’re going to quote scripture I can too. I may not know the Bible inside and out, or even just inside, but I’ve got the internet. Anyhoo, not all Christians were quite so forgiving. In Not The Bee, the “serious” spinoff of the allegedly funny Babylon Bee, Joel Abbottwrotethat while “Peterson has said a lot of things about cosmic order and human psychology that have been very helpful for people seeking moral grounding in their life,” his debate performance was simply “painful,” adding that Jesus did not leave us the option of Him being a wise man with insightful psychological insight that helps us clean our rooms. He is either a lunatic, a liar, or Lord. You either believe Him, or you don’t. It’s all or nothing. Over on the Christianity subreddit, meanwhile, the general consensus seemed to be that Peterson had proved himself to be a bit of an opportunist, Christianity-wise. Others were a bit blunter. I’m no Christian, but based on what I know about the religion I would say that the reaction of these Redditors to Peterson’s Christian cosplaying is more appropriate, and I daresay more Christian, than the rather cynical “forgiveness” of people like Robert Parr from Christian Today. It would be one thing if Peterson was saying publicly that he is sincerely grappling with his beliefs. Or, if this isn’t the case, that he’s an atheist who believes that the stories in the Bible nonetheless offer profound philosophical meditations on issues still acutely relevant today. But he hasn’t done this. He’s publicly stated that heisChristian, without (apparently) believing in the central tenets of the religion. By any standards, Christian or otherwise, that’s pretty bad. As, er, Robert Moore put it in the very same newsletter in which he basically forgave Peterson, Much of what goes under the name of Christianity right now—a claim to Christian identity without personal faith in the God of Abraham, Isaac, and Jacob through the mediation of the crucified and risen Christ—is, in fact, worse than unbelief. … To be a “Christian” because one is Western or because atheism has proven bad for nations and cultures is ancestor worship—not the gospel. To claim God because God is useful is to construct an idol. … In that sense, the synthesis that Peterson now attempts of mining the Bible for Jungian archetypes is not a step on the way to Christianity but a step away from it … . I think the forgivers believe this, but they’re still willing to embrace Peterson because he’s useful for them. He makes some of their arguments for them, and helps to get the asses in the pews. In the end, this makes them just as sleazily opportunistic as Peterson himself. In any case, here are the debate clips I promised you. They’re pretty, pretty good. During a debate titled \"One Christian vs. Twenty Atheists,\" Jordan Peterson was pressed to identify himself as a Christian but awkwardly refused.pic.twitter.com/H8QoIQvmb1 Atheist to Jordan Peterson “ If you lived in Nazi germany, and you were hiding Jewish people, would you lie to save their lives?”Jordan Peterson “I would never put myself in that position!”How did millions of millennial men think this guy was smart?pic.twitter.com/aofnmnB9Zu Damn. That old dude got smoked. — Follow me onBlueskyorMastodon. Send tips to dfutrelle at gmail dot com. We Hunted the Mammoth depends on support from you to survive. So pleasedonate hereif you can, oron Venmo! An initial half-hour writing consultation is FREE.Clickfor details. **Share this:** Tweet Click to share on Reddit (Opens in new window)Reddit Share on Tumblr Click to email a link to a friend (Opens in new window)Email Click to share on Mastodon (Opens in new window)Mastodon Click to share on Bluesky (Opens in new window)Bluesky More Pocket Click to print (Opens in new window)Print **More posts for you** Δ Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. “I would never put myself in that position!” If I wanted to be uncharitable, I’d take that to mean that he’d never hide Jews from the Nazis. Ah, who am I kidding? He’d be fighting the rest of his ilk to be first in line to denounce the Franks. I know I shouldn’t but I sometimes feel a little bit sorry for Peterson. He’s such a self-defeating clown. Truly his own worst enemy, he is the architect of all his own pain. On paper, he is smart enough to know not to go on Jubilee. In practice, not so much. The fact that he made such devastating admissions to a bunch of randos is astonishing. This guy used to be an actual professor. Now he joins the likes of Dawkins in the Trying To Grift The Christians Without Actually Being A Christian Club. (Membership fee: Whatever is left of your dignity.) The Christians are right to be upset about this but they need to learn from it too. After all, the biggest contemporary grifter of Christianity is a similar unbeliever cynically putting on an unconvincing show of faith: The Orange Antichrist himself, Donald J Trump. They need to wake up and realise that politicians and televangelists have been grifting them their whole lives. I have the same question as Syrian Girl—how did thousands of Millenial men think this guy was smart? Or had anything profound to say? [To the tune of “Look at me I’m Sandra Dee”] ♪Look at me, I’m Jordy PI went on the JubileeCouldn’t commit to the Christian bitI won’t, I’m Jordy P♪ ♪Listen, hey, I’ve much to saywhich doesn’t make sense anywaya questioning cross and I’ve already lostbut can’t just quit the game♪ ♪Won’t go to church (no) or pray (oh)Or read the bible (woah)Question my creds I’ll get upset (ah-ha-ho)But I’ll write all day and night‘Bout all those books I’ve never read♪ ♪As for you, atheist dudes,I know what you’re tryna doYou really must show me some trustThere’s evidence I’ve seen (yah yah yah yah)♪ ♪I’ll never tell you what I meankeep your attitude from meYou’re just being cruel trying to make me a foolPlay my rules, I’m Jordy P♪ This is basically equivalent to admitting you don’t believe, because publicly professing your faith in Jesus is kind of a big deal for Christianity. Like, a “you’re going to go to hell if you don’t” sort of deal. As Romans 10 states, “if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved.” And yet there also is Matthew 6:1-6: Beware of practicing your piety before others in order to be seen by them; for then you have no reward from your Father in heaven. So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. So when you give to the needy, do not announce it with trumpets, as the hypocrites do in the synagogues and on the streets, to be honored by others. Truly I tell you, they have received their reward in full. But when you give to the needy, do not let your left hand know what your right hand is doing, so that your giving may be in secret. But when you give to the needy, do not let your left hand know what your right hand is doing, so that your giving may be in secret. But when you give to the needy, do not let your left hand know what your right hand is doing, so that your giving may be in secret. Then your Father, who sees what is done in secret, will reward you. Then your Father, who sees what is done in secret, will reward you. Then your Father, who sees what is done in secret, will reward you. And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. And when you pray, do not be like the hypocrites, for they love to pray standing in the synagogues and on the street corners to be seen by others. Truly I tell you, they have received their reward in full. But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. But when you pray, go into your room, close the door and pray to your Father, who is unseen. Then your Father, who sees what is done in secret, will reward you. There are a number of other passages in a similar vein, in Timothy, Isaiah, and elsewhere. Once again, the Bible contradicts itself (and in this case, the contradictions are even wholly internal to the New Testament, rather than between the two Testaments). And, once again, conservatives pick and choose whichever passage is most convenient to them from moment to moment, much like the hypocritical Pharisees criticized in Matthew 23:27-28. Not to pick on Christians particularly, though: most, if not all, religions seem equally susceptible to such misuses. Christianity just happens to be the one Jordan Peterson is presently misusing. I can’t help but wonder about the recent (last few years) trend in a certain sector of Christianity, a group that has declared they have moved away from calling themselves “Christian” in favor of “person of faith.” Faith in WHAT, is my question. I haven’t been to church in years, but I can still recite the Apostles’ Creed. Those words are tangled up with memories of my dad (he was ordained), but I also remember how comforting it was to recite those words in community with the rest of the congregation. So what does a “person of faith” believe? From what I can tell these days, a person of faith believes they’re going to heaven and everybody else is going to hell, and they feel no obligation to be compassionate to others. But they sure do love to rack up the number of souls they’ve “saved.” Do people on these Christian websites routinely discuss whether this or that public figure is a true Christian and/or useful ally? They must have a field day with Donald Trump. @ Vicky P Faith in WHAT, is my question. Ah, this reminds me of the fuss about The King. As you may know, English monarchs have the title Defender of the Faith. That was originally granted to Henry VIII by the Pope for a defence of the church that he wrote. Monarchs have kept that title ever since, although now the faith would be the Anglican Church. But back when he was Prince of Wales, Charles intimated that he wanted to be defender of faithgenerally. So there was much speculation as to what would happen when he took the Coronation Oath. In the end they went for a typically British compromise. The Archbishop stuck in a clause making it clear Charles was head of the Anglican Church, but they also had representatives of other faiths included in the Liturgy. https://www.theguardian.com/uk-news/2023/may/04/defender-of-all-faiths-coronation-puts-focus-king-charles-religious-beliefs On this note by David: Hey, if they’re going to quote scripture I can too. I may not know the Bible inside and out, or even just inside, but I’ve got the internet. And Sylvia: Once again, the Bible contradicts itself (and in this case, the contradictions are even wholly internal to the New Testament, rather than between the two Testaments). A short while ago on Twitter, I happened to witness an argument between Trumpist and humanist Christians, on how to interpret Christian scripture for the purpose of current US politics and general life ethics. This thing (correctly interpreting the Bible) is famously something that Christians almost always get wrong, according to some other Christian. It’s a problem as old as the Church itself. But now, I noticed that people are seriously asking ChatGPT and similar AI chatbots to give a judgement on their theological arguments! I was amazed, and reminded of the Electric Monk in Douglas Adams’s books. That was a speculative household appliance that believes in religious doctrines so people don’t have to. Now, we apparently have an Electric Scholar that understands scripture so people don’t have to. I love interpreting scripture, it tells you so much about etymology and history. But the key to interpreting scripture is to remember thatM*A*S*Hwas set during the Korean War but was about the Vietnam War. Pretty sure Jorpo’s actually an agent of the Devil. @Alan Robertshaw My religion clearly states that only a cat can be a monarch. Hence, I do not believe that Charles Windsor is a “king.” @ bcb Welllll, Charles is pretty much waited on hand and foot and in exchange occasionally pretends to like us. I’ve seen it pointed out as well how funny it is that, for a man who’s constantly calling everything he doesn’t like “postmodernism”, his arguments are basically the crudest and most tendentious style of postmodernist argument, continually sidestepping any attempt to discuss the actual topic in favour of picking apart the precise meanings of words. Then again what should we really expect from a man who’s fried himself on benzos to the point that he’s spent about a year feuding with Sesame Street characters on Twitter. KindaSortaHarmlessYes, that Peterson would hide not Jews from Nazis was my reaction too. Too self-interested to risk anything for others. The debate should have been titled ’20 Atheists vs. a Living, Walking, Straw Man” The only way to interpret one of his answers is that he definitely wouldn’t have lifted a finger to help Jews. He’d probably have been rounding them up happily, strutting around in his nice uniform. While still being a drug addict, because so many Nazis were. I have a little hope. Saturday night I zoomed the progressive Democratic caucus of my state. They aren’t, as one of the guys said “afraid to call a spade a fucking spade”. Yes, cussing was allowed, along with lots of PoC (I think there was only one old SWM who spoke), lots of women (even in hijab, gasp). LGBTQ, young, old. All agreeing to never appease, keep pushing actual leftwing policies like taking care of non-millionaires, call the other side what it is — evil. No funding for wiping out Palestinians, yes funding for Ukraine, and it ended on a singalong of a civil rights song from back in the day. And I didn’t realize till the next day that the names of any of the other side were never mentioned. It was so beautifulNOTto hear that. Lots of laughs too, one Mexican-American union guy could fall back to a standup career, and one of the women referred to “pimply dorks stealing our data”. Many of the people in the room had volunteered on Bernie’s campaigns. See if your local party has one of these. We can bitch online all we want, but I figure getting to know and support the people one step closer to the levers of power and networking with other people is going to do more good. As is getting more actual liberals into local offices. Your Reddit links are showing up for me like this –Commentbyu/CalienteBurrito from discussioninChristianityThey’re actually live and I could click them, but I’m doubtful that was what was supposed to appear. Firefox browser, Windows 10, if that makes a difference. (The links to Twitter are blocked too, but that’s my choice to avoid Musk’s hellsite.) Jordon is so out of his depth here it feels like, if you were to watch the vids entirely devoid of context, you’d assume that unkind atheist kids were tormenting an old man who’s losing his mental faculties. Peterson won’t come down firmly on the side of Christianity or atheism because he makes a lot of money grifting gullible right wingers in both groups. **Recent Posts** Found a new type of guy (and he has lots of opinions about breeding) Telling new parents that their babies will be miserable is praxis A very manly feud Oops Antinatalist Xitter Party Jordan Peterson’s Christian cosplaying has come to an ignominious end. But some have been quick to forgive him Roosh V joined a mega-trad Orthodox church years ago. Now everyone’s doing it Is Antinatalism a death cult? **Archives** **Recent Comments** Sylvia, Keeper of Arcane LoreonFound a new type of guy (and he has lots of opinions about breeding) David FutrelleonFound a new type of guy (and he has lots of opinions about breeding) Full Metal OxonFound a new type of guy (and he has lots of opinions about breeding) Full Metal OxonFound a new type of guy (and he has lots of opinions about breeding) MakrothonFound a new type of guy (and he has lots of opinions about breeding) MakrothonFound a new type of guy (and he has lots of opinions about breeding) ArkadyonFound a new type of guy (and he has lots of opinions about breeding) David GerardonFound a new type of guy (and he has lots of opinions about breeding) **Subscribe via Email** Email Address Subscribe!"}