{"id": 1728, "name": "The Greanville Post", "domain": "greanvillepost.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.greanvillepost.com/2025/06/09/garland-nixons-dispatches-the-empire-and-its-vassal-nations-keep-pushing-for-war-against-china-and-just-about-every-other-independent-nation/", "title": "Garland Nixons Dispatches The Empire And Its Vassal Nations Keep Pushing For War Against China And Just About Every Other Independent Nation", "content": "Home HOME BLOWBACK WAR MUST VIDEO ESSENTIAL MEDIA FRONT CAPITALISM AUTHORS HISTORIAN J. PAUWELS **MUST WATCH ||| Garland Nixon’s Dispatches: The Empire and its vassal nations keep pushing for war against China and just about every other independent nation.** **Why the US Empire will not go quietly into the night and insists on triggering Armageddon. A Discussion w. Leading Analysts Jeff Brown and Joti Brar** **BEFORE YOU LEAVE:People's journalism can't survive without your active support.** GARLAND'S ROFKIN & RUMBLE PLATFORMS: ROFKIN:https://www.rokfin.com/garlandnixonRUMBLE:https://rumble.com/user/garlandnixon/videos DONATIONS:BUY ME A COFFEE• https://www.buymeacoffee.com/garlandnhPayPal - garlandn@gmail.com/ garlandnixon Unfortunately, most people take this site for granted.DONATIONS HAVE ALMOST DRIED UP…PLEASEsend what you can today!JUST USE THE BUTTON BELOW This work is licensed under aCreative Commons Attribution-NonCommercial 4.0 International License GARLAND NIXON is a polymathic veteran radio talk show host & leading geopolitical analyst, and anti-imperialist activist in Washington DC. **COWARDS! The Video Piers Morgan Doesn’t Want You...** **Apologists For Evil** **• PARASITE** **•A Matter of Agency: The Straight Dope about...** **The General Plan Of Genocide** **USA ADMITS: “We are preparing for war”** **Defiance or Conciliation } Dispatches from Oliver Boyd-Barrett** **• Celebrity activists Greta Thunberg and Liam Cunningham...** **French Dock Workers REFUSE TO LOAD Israeli Weapons...** **• Bobcat: the hunt for truth** Far more urgent are the riots in LA and now protests at Trump Tower in NYC. Are these spreading rebellions the fore bringers of an American revolution? I initially misheard what Jeff Brown said.He said the US intention towards the Taiwanese was to Ukrainise them.I thought Jeff said “euthanise them”.And then I realised it was the same thing.The only people who deserve to be euthanised are the would be mass murderers of innocent civilians, the filthy SuckingToady of Offense Pig Hogsbreath and his ilk. Definitely deserves a bullet between his beady little piggy eyes, which will solve a lot of problems. What the LA demonstrations show unlike what the California governor and the LA mayor say, that these are not minor protests. The story is that Trump wishes to provoke protests in order to be able to suppress them, but reasonably he understands the danger and threatand acts the correct way. These rebellions could well predict a cold revolution, the real stuff then to follow. The uproars in LA are quite different from previous riots there. One can only hope Facebook Twitter Instagram Linkedin Youtube Snapchat Rss @2017 - PenciDesign. All Right Reserved. Designed and Developed byPenciDesign HOME BLOWBACK WAR MUST VIDEO ESSENTIAL MEDIA FRONT CAPITALISM AUTHORS HISTORIAN J. PAUWELS HOME BLOWBACK WAR MUST VIDEO ESSENTIAL MEDIA FRONT CAPITALISM AUTHORS HISTORIAN J. PAUWELS **Read alsox**"}