{"id": 74, "name": "Americas Quarterly", "domain": "americasquarterly.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://americasquarterly.org/article/to-fight-organized-crime-latin-america-needs-a-regional-security-force/", "title": "To Fight Organized Crime Latin America Needs A Regional Security Force", "content": "Subscribe MagazineNew IssuePDFPast IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports CountriesArgentinaBrazilChileColombiaEcuadorGuatemalaMexicoPanamaVenezuelaCaribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries U.S. Policy Corruption Index Events Podcast Culture About MagazineNew IssuePDFPast IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports CountriesArgentinaBrazilChileColombiaEcuadorGuatemalaMexicoPanamaVenezuelaCaribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries U.S. Policy Corruption Index Events Podcast Culture About **To Fight Organized Crime, Latin America Needs a Regional Security Force** Across Latin America and the Caribbean, crime is the top public concern as organized criminal groups increasingly overwhelm local authorities and out-maneuver national governments. Criminal violence is now undeniably a regional crisis that requires a regional response. Traditionally, the U.S. would step in as Latin America’s most important security partner to support its soldiers, police, prosecutors and judges. But amid sharp reductions in its foreign assistance, Washington can no longer be relied upon. That is why leaders in Latin America and the Caribbean should take matters into their own hands—just as Europe is belatedly recognizing its own need for strategic autonomy. For now, despite the metastasizing cross-border threat of organized crime, the region’s governments are largely on their own in this fight, with no formal mechanism for collective action. By coming together to build a permanent security institution, Latin America and the Caribbean could turn the tide on the escalating violence, and begin to build the rule of law that is necessary to protect democracy and build economic prosperity. Democracy in the balance Organized crime mafias now act like multinational corporations, with diversified revenue sources and sophisticated supply chains. This“re-organized crime”poses a critical threat to democracy. Drug lords increasingly shape political landscapes through inducements and intimidation—plata o plomo. Gangstersmurder mayors in Mexico, promotepro-crime laws in the Andes, andfield political candidates across the region. But state responses to escalating violence can also jeopardize democracy. Political leaders are, one after another, declaring states of emergency that suspend civil liberties. Trinidad and Tobago, overwhelmed by competing drug gangs,is the latest example, having followed similar declarations inHondurasandEcuador. In El Salvador, President Nayib Bukele remainsextremely popularfor reducing violence, despite eviscerating civil liberties, judicial independence and other key democratic safeguards. Across the region, voters and leaders alike seem increasingly willing to consider a similar path. This dual threat to democratic governance makes a coordinated response all the more urgent. Such a response has been lacking in part due to one of Latin America’s major successes: Even though it’s the world’s most violent region, interstate armed conflict is exceedingly rare. That has left the Western Hemisphere without a dedicated regional institution for security, with no counterpart to the African Union’s Peace Support Operations, let alone anything resembling NATO. The consequences are most glaring in Haiti. When the U.S. sought to organize an international response to the deepening crisis following the 2021 assassination of President Jovenel Moïse, it turned first to the United Nations Security Council. Despite apocalyptic gang violence, however,UN Secretary General António Guterres was reluctant to get involved, andChina stubbornly opposed a peacekeeping mission. As a result, the U.S. cobbled together an unusual coalition led by Kenyan police officers paid for by the U.S. and Canada and supported by a patchwork of soldiers from Central America. Violence and displacement have worsened, and the capital, Port-au-Prince, is increasingly controlled by warlords. Individually, national police forces and militaries can do only so much. Ecuador is another example. Its security institutions have mounted an impressive response to threats from criminal gangs, some of which are tied to major Mexican cartels. Yet Ecuador will not succeed unless it works in concert with Mexico, an unlikely prospect absent a regional security platform,given their strained relationssince Ecuadorian security services raided the Mexican Embassy last year to arrest a fugitive former vice president. Building solutions Fortunately, security forces across the Americas are beginning to recognize that the scale of the challenge demands close cross-border cooperation. Brazil, for example, is convening defense ministers from across the Amazon, where the Primeiro Comando da Capital and Comando do Norte criminal organizations hold sway. At a smaller scale,IMPACS—the Caribbean Community Implementation Agency for Crime and Security—offers a potential model for a regional project. Similarly, in December, the Inter-American Development Bank (IDB), better known for promoting economic development, launched a regional initiative to tackle organized crime. ItsAlliance for Security, Justice, and Developmentbrought together 22 of the region’s countries and 11 international organizations, including the Organization of American States, World Bank and United Nations Development Program. Meanwhile, the CAF (Corporación Andina de Fomento) multilateral development bank is also setting aside funding to tackle crime. These efforts reflect a growing understanding that spiraling violence undermines any campaign to reduce poverty. The IDB project is in some ways the most promising. It is open to participation from the whole region, and it involves coordination not only among military and security leaders, but also other agencies that play a role in battling criminal groups, such as justice and finance ministry officials combating money laundering. In the past, initiatives at the Organization of American States and the former UNASUR were largely limited to the armed forces—institutions that are traditionally reluctant to take on domestic law enforcement challenges and lack experience in criminal investigations. Similarly, AMERIPOL (the Police Community of the Americas), headquartered in Bogotá, Colombia, is a helpful platform for police cooperation, including intelligence sharing, but its mandate is too limited to meet modern security threats. Scaling up These are promising steps, but they are not enough. The region needs a formal collective security arrangement as well as enduring commitments. Even absent U.S. support, nations with robust peacekeeping experience, such as Brazil, Chile and Uruguay, are in a good position to lead a regional security organization. Moreover, eight Latin American nations havepeacekeeping training institutions(PKTIs) that could be refocused on regional security coordination. This year, the Dominican Republic, deeply affected by Haiti’s turmoil, will host the Summit of the Americas, a meeting of presidents and prime ministers held every three years. It will provide a valuable opportunity to discuss an ambitious regional security initiative. Beyond political will, credibility will be a major challenge. Any regional security organization would need to guarantee strict internal security and ethics protocols. It would need to incorporate robust rights trainings, and subject its officials to safeguards like careful vetting, periodic polygraphs, and personal financial monitoring. And then there’s the problem of money, especially after a decade of regional economic stagnation and a new reluctance from Washington to fund multilateral initiatives. Even so, there are promising precedents. In late 2023, for example, the UN Security Council agreed to pay for up to 75% of international peace operations in Africa after the African Union committed to finding the remaining funds. The Americas could pursue a similar arrangement. Without a credible, collective response, the region risks sliding deeper into a cycle of violence, democratic erosion, and economic decline. With resolve and cooperation, Latin America and the Caribbean can chart a different course—one that is less dependent on the United States, and that is defined by security, justice and shared prosperity. Nelson is the former Deputy Assistant Secretary of Defense for the Western Hemisphere at the U.S. Department of Defense. Gedan is a former South America director on the National Security Council staff. **Current Issue** Guatemala’s President Bernardo Arévalo aims to undertake ambitious reforms and fortify democracy in Central America’s largest country. Our special report examines his first year in office after a tumultuous election and the challenges ahead. About Advertise Contact Careers Magazine Elections Latest U.S. Policy Corruption Index Events Podcast Culture Americas Quarterly (AQ) is the premier publication on politics, business, and culture in Latin America. We are an independent publication of the Americas Society/Council of the Americas, based in New York City. All Rights Reserved PUBLISHED BY AMERICAS SOCIETY/ COUNCIL OF THE AMERICAS 680 Park AvenueNew York, NY 10065Phone: (212) 249-8950 MagazineNew IssuePDFPast IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports New Issue PDF Past IssuesNavigating TrumpLatin America’s Food Security ParadoxWhat the U.S. Election Means for Latin AmericaLatin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports Navigating Trump Latin America’s Food Security Paradox What the U.S. Election Means for Latin America Latin America’s Ports CountriesArgentinaBrazilChileColombiaEcuadorGuatemalaMexicoPanamaVenezuelaCaribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries Argentina Brazil Chile Colombia Ecuador Guatemala Mexico Panama Venezuela Caribbean Countries U.S. Policy Corruption Index Events Podcast Culture About SUBSCRIBE TO OUR PRINT MAGAZINE"}