{"id": 720, "name": "Joplin Globe", "domain": "joplinglobe.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.joplinglobe.com/news/map-area-storm-shelters/article_301e0d3e-8195-11e9-8832-035609ba542b.html", "title": "Map Area Storm Shelters", "content": "Newsletter Facebook YouTube Pinterest Instagram Read local news Get email newsletters Subscribe to the Globe Read the E-Paper Download the Globe app to my phone or tablet Find a store that sells the Globe Report that I didn't get my paper Submit a news tip Write a letter to the editor Place a classified ad Look for jobs, homes or cars Submit an obituary Learn more about the Globe's history Find phone numbers for the Globe Local News Local Business Crime and Courts Events, People, Cuisine Education National News Business, Financial Markets Movies, TV, Music, Pop Culture Video Got a tip? Let us know! Local Sports National Sports Columns Editorials Letters to the Editor Submit a letter Comics Puzzles Games Contests Joplin Living (current issue) Anniversaries Weddings Engagements Births Other celebrations Jobs, Employment Real Estate For Sale House/Apartment For Rent Cars, Trucks, Vehicles I want to place an ad! Start a Subscription Manage My Subscription Get Newsletters App Downloads E-Paper Submit a Letter to the Editor Submit a News Tip Place an Obituary Search Search Search Contact UsStaff DirectoryAbout the GlobeSingle-copy Rack LocationsSubmit a Letter to the EditorSubmit a News TipPlace an Obituary Staff Directory About the Globe Single-copy Rack Locations Submit a Letter to the Editor Submit a News Tip Place an Obituary Staff Directory About the Globe Single-copy Rack Locations Submit a Letter to the Editor Submit a News Tip Place an Obituary SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Login About UsContact UsAdvertise with UsApp Downloads About Us Contact Us Advertise with Us App Downloads About Us Contact Us Advertise with Us App Downloads E-Edition Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Joplin Living Obituaries Public Notices Comics & MoreComicsPuzzlesGamesContests Comics Puzzles Games Contests Comics Puzzles Games Contests 83°SunnyJoplin, MO(64801)TodayOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%..TonightOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.Updated: June 11, 2025 @ 4:23 pmFull Forecast Joplin, MO(64801)TodayOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%..TonightOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.Updated: June 11, 2025 @ 4:23 pm Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.. Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%. Updated: June 11, 2025 @ 4:23 pm Full Forecast Joplin, MO(64801)TodayOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%..TonightOvercast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.Updated: June 11, 2025 @ 4:23 pm Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.. Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%. Updated: June 11, 2025 @ 4:23 pm Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%.. Overcast with rain showers at times. Low 66F. Winds SSE at 5 to 10 mph. Chance of rain 60%. Updated: June 11, 2025 @ 4:23 pm Full Forecast E-Paper Newsletter Facebook YouTube Pinterest Instagram **Los Angeles-area mayors demand that Trump admin…** **Lions put the 'fun' in fundamentals at youth hoops camp** **NBA Finals are shifting to Indianapolis, with t…** **One year from World Cup opener, FIFA leaves que…** **MAP: Area storm shelters** From staff reports | news@joplinglobe.com May 21, 2019 May 21, 2019UpdatedMay 30, 2019 1 min to read The following map shows locations of public storm shelters available in the case of extreme weather. Note: at certain zoom levels, other miscellaneous map markers may appear such as stores, schools, etc.; look for the red storm cloud markers which are the known public storm shelters. Javascript is required for you to be able to read premium content.Please enable it in your browser settings. **More information** **Eight years after 2011 tornado, community safe rooms provide shelter from storms** On May 22, 2011, Kay Johnson and her husband took shelter in a hall closet in their home as an EF5 tornado struck Joplin, killing 161 people a… Storm Map Weather Meteorology Shelter Location Email Construction Industry Social Services **Trending Video** **Obituaries** More Obituaries **Joplin Living** **Most Popular** Articles Images Videos Commented Details released about plans to bring McDonald's to Airport Drive area Carthage Stampede Rodeo worth the wait for local fifth grader Federal judges rule in favor of NASCAR in lawsuit filed by Jordan-owned 23XI and Front Row Joplin grieves with family of slain diplomats Wally Kennedy: Smoking Crab & Seafood Co. opens in former Mary Lee's on 20th Street Allgeier, Martin breaks ground on office expansion Public hearing on CAFO permits draws crowd, comments March for Jesus scheduled for Saturday Shell-shocked: Inside look at Miller's first baseball state championship Virta Health Survey Reveals Secret to Lasting Weight Loss After GLP-1s: Users Who Follow a Guided Off-ramp are 8x More Likely to Continue Losing Weight Sorry, there are no recent results for popular videos. Sorry, there are no recent results for popular commented articles. **Trending Recipes** Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Advertise with Us Submission Forms E-edition Subscriber Services Cookie Preferences Home News Comics Puzzles Sports Community Opinion Obituaries Photos Video Gallery Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}