{"id": 2228, "name": "That's Pretty Good Science", "domain": "thatsprettygoodscience.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://thatsprettygoodscience.com/2017/06/12/facebooks-pride-react-leading-to-homosexual-curiosity-among-straight-males/", "title": "Facebooks Pride React Leading To Homosexual Curiosity Among Straight Males", "content": "Environment Technology Space Health & MedicineBiology & GeneticsFood & NutritionViruses & Outbreaks Biology & Genetics Food & Nutrition Viruses & Outbreaks Biology & Genetics Food & Nutrition Viruses & Outbreaks The Brain Plants & Animals Chemistry ScienceFringe SciencesChildrenLove & RomanceUncategorized Fringe SciencesChildrenLove & Romance Children Love & Romance Uncategorized Fringe SciencesChildrenLove & Romance Children Love & Romance Children Love & Romance Uncategorized AboutAmber Diffenderfer, PhDContact Amber Diffenderfer, PhD Contact Amber Diffenderfer, PhD Contact TPGS AboutAmber Diffenderfer, PhDDisclaimerPrivacy Policy Amber Diffenderfer, PhD Disclaimer Privacy Policy Amber Diffenderfer, PhD Disclaimer Privacy Policy Contact **Facebook’s “pride” react leading to homosexual curiosity among straight males** **Could Facebook be making you gay?** Facebook quietly launched the “pride” react last week, a rainbow flag reaction that can be applied to Facebook posts and comments in place of a Like. A poll conducted on Sunday revealed a stunning correlation – the pride react on Facebook may be leading to homosexual and pansexual curiosity among straight males. The survey, conducted bySharp Research Institute, noticed a spike not only in the homosexual desires of straight males aged 18-40, but also actual physical homosexual activity. It appears that the pride react is influencing men to commit homosexual acts on one another. A spike in the data of this magnitude has not been seen since around 2016, when transsexuals were given the right to use normal people restrooms. “The pride react is turning people gay all over the world,” one researcher told us under the condition of anonymity. “We think Obama may have added some kind ofMKULTRA technologyto the react that is causing people to turn gay.” The new pride react is available on Facebook through the month of June in an attempt to turn as many straight men gay as possible. Christians are working on a counter assault that willreplace the rainbow flags with a pair of praying hands. **That's Worth Sharing** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **Related** **Post navigation** **An unexpected treatment for seasonal allergies shows promising results** **An unexpected treatment for seasonal allergies shows promising results** **Studies show kids do better without lunch** **Studies show kids do better without lunch** **One comment** Jimmy johnsays:June 21, 2018 at 3:59 pmThis was hillariousLikeLikeReply This was hillarious LikeLike This was hillarious LikeLike **What do you think?Cancel reply** Δ This site uses Akismet to reduce spam.Learn how your comment data is processed. **Important dates in science history** January 2021(1) January 2020(1) February 2018(2) January 2018(1) October 2017(1) June 2017(1) March 2017(11) January 2017(2) November 2016(1) October 2016(1) September 2016(2) August 2016(1) July 2016(1) June 2016(1) May 2016(1) April 2016(2) March 2016(2) February 2016(4) January 2016(8) **Contributors** Amber Diffenderfer, PhDFacebook Stupidly Disabled Thousands of Valid ProfilesThe Mandalorian = MAGA? Meet “The Baby Yoda Effect”The dark truth about your Girl Scout CookiesHershey’s to launch ‘guy friendly’ chocolate for men at Winter OlympicsFeces Therapy gaining steam in the medical communityStudies show kids do better without lunchFacebook’s “pride” react leading to homosexual curiosity among straight malesAn unexpected treatment for seasonal allergies shows promising resultsPyongyang Circus giraffes give birth to their own performersIs a hot dog a sandwich? Science has the answer. Facebook Stupidly Disabled Thousands of Valid Profiles The Mandalorian = MAGA? Meet “The Baby Yoda Effect” The dark truth about your Girl Scout Cookies Hershey’s to launch ‘guy friendly’ chocolate for men at Winter Olympics Feces Therapy gaining steam in the medical community Studies show kids do better without lunch Facebook’s “pride” react leading to homosexual curiosity among straight males An unexpected treatment for seasonal allergies shows promising results Pyongyang Circus giraffes give birth to their own performers Is a hot dog a sandwich? Science has the answer. Facebook Stupidly Disabled Thousands of Valid Profiles The Mandalorian = MAGA? Meet “The Baby Yoda Effect” The dark truth about your Girl Scout Cookies Hershey’s to launch ‘guy friendly’ chocolate for men at Winter Olympics Feces Therapy gaining steam in the medical community Studies show kids do better without lunch Facebook’s “pride” react leading to homosexual curiosity among straight males An unexpected treatment for seasonal allergies shows promising results Pyongyang Circus giraffes give birth to their own performers Is a hot dog a sandwich? Science has the answer. **Categories** Biology & Genetics(6) Chemistry(5) Children(8) Environment(10) Food & Nutrition(12) Fringe Sciences(2) Health(15) Love & Romance(5) Plants & Animals(7) Science(13) Space(1) Technology(13) The Brain(4) Uncategorized(7) Viruses & Outbreaks(4) Comment SubscribeSubscribedTPGSJoin 25 other subscribersSign me upAlready have a WordPress.com account?Log in now. TPGS Already have a WordPress.com account?Log in now. TPGS Already have a WordPress.com account?Log in now. TPGSSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar TPGS SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar TPGS SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar **** **** ****"}