{"id": 259, "name": "The Colorado Sun", "domain": "coloradosun.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://coloradosun.com/2025/06/09/can-parents-who-deadname-their-transgender-children-lose-custody-under-a-new-colorado-law/", "title": "Can Parents Who Deadname Their Transgender Children Lose Custody Under A New Colorado Law", "content": "Become a member Login My Account Logout News Events Newsletters Podcast App Colorado’s Best About Us Donate Instagram Bluesky YouTube Bluesky Facebook X Twitter Instagram Reddit Mastodon Threads LinkedIn YouTube Instagram Bluesky YouTube The Colorado Sun Telling stories that matter in a dynamic, evolving state. Become a member Login My Account Logout News Events Newsletters Podcast App Colorado’s Best About Us Donate Editor’s Picks:Electric gridlock|Cows vs. fire|Measles update **Can parents who deadname their transgender children lose custody under a new Colorado law?** **Share this:** Share Click to email a link to a friend (Opens in new window)Email Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on Threads (Opens in new window)Threads Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on WhatsApp (Opens in new window)WhatsApp Original Reporting References **No.** A provision that could have penalized parents in custody disputes who deadname or misgender their children was stripped from a transgender rights bill before it was passed into law. House Bill 1312, which was signed by Gov. Jared Polis in May, introduced a range of new rules meant to protect trans people from discrimination. Before the bill’s passage, lawmakers struck a controversial section that would have considered a parent misgendering, deadnaming or threatening to share materials related to gender-affirming care as forms of “coercive control.” Courts would have been required to consider these actions when deciding custody arrangements. As passed, the law seeks to protect trans Coloradans from being deadnamed or misgendered in schools, workplaces and hospitals. It also allows more frequent changes on official documents to update gender identity, and lets students choose how they dress in school as long as they meet the school dress code, among other protections. See full source list below. This fact brief is responsive to conversations such asthis one. The Colorado Sun partners withGigafactto produce fact briefs — bite-sized fact checks of trending claims. Read ourmethodologyto learn how we check claims. Let us know what you want fact-checked bysubmitting a tip!Please note that claims that are partially true or false cannot be checked. In addition, we are unable to check claims for which there are no credible, available sources to verify or dispute them. **☀️ READ MORE** **Is the recording of police legally protected?** **Are bicyclists allowed to roll through stop signs in Colorado?** **Does Xcel make more than $1B in profit annually?** Trans rights bill loses most controversial provision, but more changes still likely to come, Colorado Public Radio, May 2, 2025.Source link. House Bill 25-1312, Colorado General Assembly, May 2025.Source link. House Bill 25-1312 as introduced, Colorado General Assembly, March 2025.Source link. Legal Protections for Transgender Individuals, Colorado General Assembly, accessed in June 2025.Source link. Transgender Coloradans receive new discrimination protections as Gov. Police signs bill into law, The Denver Post, May 16, 2025.Source link. Fiscal note HB 25-1312, Legislative Council Staff, May 6, 2025.Source link. LGBTQ+ Rights, American Civil Liberties Union Colorado, accessed in June 2025.Source link. Checks a specific statement or set of statements asserted as fact. **Por Jaijongkit** Por recently graduated from CU Boulder with a master’s degree in journalism and is interested in writing about the environment and exploring local stories. When not working on some form of writing, Por is either looking for Thai food or petting...More by Por Jaijongkit Instagram Bluesky YouTube The Colorado Sun is an award-winning news outlet based in Denver that strives to cover all of Colorado so that our state — our community — can better understand itself. The Colorado Sun is a 501(c)(3) nonprofit organization. EIN: 36-5082144 Bluesky Facebook X Instagram Reddit Mastodon Threads LinkedIn YouTube (720) 263-2338 Got a story tip? Drop us a note at tips@coloradosun.com **Follow The Sun** Become a Member Contribute Contact Sponsorship Newsletters Events Podcast **Topics** Business Crime and Courts Education Energy Environment Health Housing Outdoors Opinion Politics SunLit View All **Info** About Us Membership FAQs Editorial Standards and Policies Ethics Policy Corrections How We’re Funded DEI Commitment Jobs Store RSS"}