{"id": 2112, "name": "Quadrant Magazine", "domain": "quadrant.org.au", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://quadrant.org.au/magazine/quadrant-music/the-changing-world-of-musical-composition-an-interview-with-samuel-andreyev/", "title": "The Changing World Of Musical Composition An Interview With Samuel Andreyev", "content": "**Become a memberandenjoy the best content printand digital** Login MenuTopicsUncategorizedClimate ChangeEditor's CornerAustraliaPoliticsFrom Our ArchivesHistoryContentFeaturesMagazineShort ReadsVideoOpinionAboutAboutSubmissionsBoardBecome a memberand enjoy thebest content print and digitalSubscribePart 1: The Waxman-Markey Bill“In my judgment, the proposed cap-and-trade system would be a costly policy that would penalize Americans with little effect on global warming. The proposal to give away most of the permits only makes a bad idea worse”.Are you listening, Kevin Rudd?Continue Reading Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History Become a memberand enjoy thebest content print and digital “In my judgment, the proposed cap-and-trade system would be a costly policy that would penalize Americans with little effect on global warming. The proposal to give away most of the permits only makes a bad idea worse”.Are you listening, Kevin Rudd? Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History Become a memberand enjoy thebest content print and digital “In my judgment, the proposed cap-and-trade system would be a costly policy that would penalize Americans with little effect on global warming. The proposal to give away most of the permits only makes a bad idea worse”.Are you listening, Kevin Rudd? Home TopicsTrending TopicsUncategorizedClimate ChangeEditor's CornerAustraliaPoliticsFrom Our ArchivesHistoryRecommendedEconomicsYou Get What You Vote ForOn energy, industrial relations, immigration, environmental policies and spending, Labor marches proudly down the road of follyAlan MoranMay 31, 20256 minsQEDThe ABC’s Favourite Noisy IngrateWhat is it about the noxious Nasser Mashni that the national broadcaster finds so irresistible?Timothy CootesMay 31, 20257 minsWhat's NewShort-formInterviewsVideoWhat's NewTrending TopicsUncategorizedClimate ChangeEditor's CornerAustraliaPoliticsFrom Our ArchivesHistoryInsights from QuadrantSocietyAmericaIslamDoomed PlanetArts & CultureAboriginesWorldMediaShort-formTrending TopicsEditor's CornerInsights from QuadrantUncategorizedArts & CultureInterviewsTrending TopicsVideoTrending TopicsIslamWorld Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History EconomicsYou Get What You Vote ForOn energy, industrial relations, immigration, environmental policies and spending, Labor marches proudly down the road of follyAlan MoranMay 31, 20256 mins Alan Moran May 31, 2025 6 mins QEDThe ABC’s Favourite Noisy IngrateWhat is it about the noxious Nasser Mashni that the national broadcaster finds so irresistible?Timothy CootesMay 31, 20257 mins Timothy Cootes May 31, 2025 7 mins What's New Short-form Interviews Video What's New Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History Insights from Quadrant Society America Islam Doomed Planet Arts & Culture Aborigines World Media Short-form Editor's Corner Insights from Quadrant Uncategorized Arts & Culture Interviews Video Islam World Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History EconomicsYou Get What You Vote ForOn energy, industrial relations, immigration, environmental policies and spending, Labor marches proudly down the road of follyAlan MoranMay 31, 20256 mins Alan Moran May 31, 2025 6 mins Alan Moran May 31, 2025 6 mins QEDThe ABC’s Favourite Noisy IngrateWhat is it about the noxious Nasser Mashni that the national broadcaster finds so irresistible?Timothy CootesMay 31, 20257 mins Timothy Cootes May 31, 2025 7 mins Timothy Cootes May 31, 2025 7 mins What's New Short-form Interviews Video What's New Uncategorized Climate Change Editor's Corner Australia Politics From Our Archives History Insights from Quadrant Society America Islam Doomed Planet Arts & Culture Aborigines World Media Short-form Editor's Corner Insights from Quadrant Uncategorized Arts & Culture Interviews Video Islam World Music Poetry Authors About Us Contact Us Home Music Poetry Bookshop Subscribe Current Issue Subscription My Account Quadrant Patron About Donate Submissions Contact **Subscribeto Quadrant Online** Quad-cast Magazine & Archives Bookshop Donate SearchSearch By TopicAboriginesAcademiaAfricaAlbum ReviewAmericaAnti-SemitismANZACArchitectureArtArts & CultureAsperitiesAstringenciesAustraliaAustralia DayBooksCensusChinaCivilisationClimateClimate ChangeColonialismCookeryCovidCrimeCultureDefenceDemographicsDoomed PlanetDublin LetterEconomicsEditor's ColumnEditor's CornerEducationEnergyEntertainmentEnvironmentEspionageEuropeFauxboriginesFeatureFeminismFiction & StoriesFilmFirst PersonFourth ColumnFree SpeechFrom Our ArchivesGuest ColumnHealthHistoryIdeasImmigrationInsights from QuadrantIslamIsraelKeith WindschuttleLanguageLetters to the EditorLiteratureMediaMemoirMiddle EastModern MythsNew York LetterNew ZealandNuclearObituaryOpinionPhilosophy & IdeasPoemPoetryPoliticsPublic HealthQEDQuad RantQuad-CastQuadrant MusicReflectionReligionReviewRussiaScienceSicktoriaSocietySportStorySweetness & LightTariffsThe ArtsThe CrownThe LawThe LeftThe Middle EastThe U.S.A.The UniversitiesThe VoiceTheatreTheir ABCThird ColumnTradeTributeTVUkraineUkraine LetterVotingWhimsyWokeryWorldSearch By Writer'Asiya' & Gabrielle Lord\"William York\"A Cronulla MumA Dozen Melbourne DoctorsA Modest LocalA Victorian TeacherA.G. EvansA.M. JusterA.S. PatricAaron AmesAaron CraigAdam BisitsAdam BrowneAdam DayAdam L. DarraghAdam LeBorAdam M. RustowskiadminAdrian NguyenAdrian WilliamsAdriana McOrderoAdrienne EberhardAgnes SelbyAidan ColemanAinu Campbell-BarracksAlamgir HashmiAlan BarcanAlan BarronAlan FewsterAlan G. Futerman & Walter E. BlockAlan GouldAlan LeeAlan MoranAlan MoranAlan Moran and Roger FranklinAlan OxleyAlan R.M. JonesAlan RiachAlan RM JonesAlan RM JonesAlan SaundersAlan SmithAlan Stephens, Murray Mitchell, J.B. PaulAlan Sunderland and Quadrant OnlineAlan WhelanAlana KelsallAlasdair MillarAlasdair Millar & co-authorsAlastair SpateAlberto MingardiAlessio ZanelliAlex HandAlex LakeAlex McDermottAlex MillmowAlex O'SullivanAlex RobsonAlex StuartAlexander BorojevicAlexander Hatzikalimnios and Augusto ZimmermannAlexander VoltzAlexander VoltzAlexander VoltzAlexander Voltz & Barry SpurrAlison BevegeAlison McNaughtAlistair CrooksAlistair NicholasAlistair PopeAlistair PopeAlister HenskensAllan GouldAllan JohnstonAllan LakeAllan PidgeonAllen GreerAlwyn KarpinAmanda HemmingsAmanda StokerAmanda WilsonAmit MajmudarAmy BrookeAmy BrookeAnamaria BeliganAndrea OckerbyAndrea PagliaroAndrew BlythAndrew BoltAndrew BotrosAndrew BraggAndrew C MackinnonAndrew CusackAndrew CusackAndrew ErringtonAndrew GabrielAndrew GambleAndrew GliksonAndrew GutmannAndrew IrvineAndrew Irvine & Stephen WexlerAndrew J. LowyAndrew James MenkenAndrew KennyAndrew KlavanAndrew L. UrbanAndrew LansdownAndrew LeggettAndrew McBurnieAndrew McGeeAndrew McIntyreAndrew MotionAndrew NikolicAndrew NortonAndrew PatersonAndrew R. TimmingAndrew RobertsAndrew Ross ErringtonAndrew Russell & Lana StarkeyAndrew SlatteryAndrew SmallmanAndrew SmallmanAndrew SmithAndrew StoneAndrew StuttafordAndy HalksworthAndy KissaneAndy MullinsAng Chin GeokAngela ShanahanAngela SmithAngus PikeAniello IannuzziAnjali NadaradjaneAnn DixAnn HowardAnn McElhinney and Phelim McAleerAnna BuckAnna FernAnna McHughAnna RatcliffAnna WierzbickaAnna ZeltzerAnne ApplebaumAnne FairbairnAnne HendersonAnne McCoskerAnne SkyvingtonAnne TwomeyAnne WilliamsAnne-Elisabeth MoutetAnonymousAnthony BaileyAnthony CappelloAnthony DanielsAnthony Daniels & Nikos A. SalingarosAnthony DillonAnthony FisherAnthony GrahamAnthony J.H. MorrisAnthony LynchAnthony McAdamAnthony McCarthyAnthony MilnerAnthony O HearAnthony O’HearAnthony PaulAnton BendarzsevszkijAnton LangAntonia NewtonAntonin ScaliaAntony BarracloughAntony CarrAntony Carr & Christopher CarrAntony FlewApril 2012April, 2011Arian GanjaviArjun RajkhowaArt RaicheAryan GanjaviAshley MartinAshley Morgan-ShaeAshley Mrgan-ShaeAshlley Morgan-ShaeAugusto ZimmermannAugusto ZimmermannAugusto Zimmermann & Aramis C. DeBarrosAugusto Zimmermann & Gabriël MoensAugusto Zimmermann and Fabio CondeixaAustralian Conservative onlineAutorenkollektivAveril DrummondAynsley KellowB N OakmanB. CollisB.J. ComanB.J. Coman & Evan JonesB.R. WhitingBabette FrancisBabette Francis, John Reid, Ken Schultz, Michael WBarbara FisherBarclay McGainBarend VlaardingerbroekBaron AlderBarry BrillBarry GillardBarry GillardBarry HumphriesBarry LeithheadBarry MaleyBarry NinhamBarry PetersBarry PosterBarry SpurrBelinda LopezBen BassettBen CrockerBen JellisBen MeehanBen PattisonBen SharafskiBen-Peter TerpstraBenjamin CrockerBenjamin JellisBenjamin MarksBenjamin WilkieBenny PeiserBerislav MaroyaBern BrentBernadette BelejBernadette TobinBernard d’AbreraBernard GaynorBernard LaneBernard LevinBernie LewinBernie PowerBert AlmonBert Kelly’s GhostBess Nungarrayi PriceBest OverendBettina ArndtBettina ArndtBettina ArndtBev CainsBill AckmanBill ArnottBill DawesBill DiPuccioBill HarcourtBill Harcourt, Howard Hutchins, Neil James, JohnTwBill JamesBill James, Digby Ricci, Donald G. Runcie, AndrewBill LeakBill MartinBill MuehlenbegBill MuehlenbergBill RushBill WyndhamBilly McCarronBiswadarshan MohantyBob BourmanBob CarrBob CarterBob Carter & John SpoonerBob Carter and John McLeanBob Carter, Alan Moran & David EvansBob Carter, David Evans, Stewart Franks & BillBob Carter, David Evans, Stewart Franks & WillBob Carter, David Evans, Stewart Franks, Bill KiniBob Carter, Willie Soon & William BriggsBob CatleyBob DayBob ReeceBob WrightBoy on a bikeBrad JackelBrad WilliamsonBradley VoltzBrenda SaundersBrendan CraigBrendan FrainBrendan NelsonBrett JenikBrett MastersBrian DethridgeBrian DoakBrian GriffithsBrian HawkinsBrian LessardBrian PollardBrian RobertsBrian SullyBrian TurnerBrian WimborneBrianna HeseltineBruce AndersonBruce BeresfordBruce BeresfordBruce DaweBruce FlemingBruce GrantBruce WilliamsBryan ColeborneBryan LeylandBryan WimborneBubbles SegallBurchell WilsonBy Christopher AkehurstBy Daryl McCannBy John WhitehallBy Martin LynchBy Robert ClancyBy Tom QuirkBy William KitcherC.A. BroadribbC.A.R. HillsC.J. MurrayC.J. RyanC.R. McArthurC.R. PennyCaitlin MalingCallum J. JonesCally Conan-DaviesCameron FullerCameron SemmensCardinal George PellCarl BridgeCarlos d'AbreraCarlos RoaCarmel Macdonald GrahameCarol ChandlerCarol JenkinsCarole WilkinsCaroline Carvercaroline cooperCaroline OveringtonCaroline Smith GlenCarolyn E. CampbellCarolyn Evans CampbellCarolyn IngvarsonCase SmitCassandra DickinsonCate CadellCath DrakeCath VidlerCatherine BaxendaleCatherine BroadstockCatherine ChandlerCatherine ParishCato SeutoniusCato SuetoniusCecilia MorrisChad SwansonChangming YuanChanming YuanChapman Pincher, Tennent H. Bagley, John L. WilhelChapman Pincher, Tennent H. Bagley, John L. WilhelCharles BradburneCharles CopemanCharles SmithCharlotte O’NeillChris AshtonChris BattleChris BattleChris Battle & Keith WindschuttleChris BergChris Berg & Jason PottsChris Berg and Sinclair DavidsonChris CarrChris DynonChris HarlowChris KeeferChris KennyChris KingChris LeithnerChris LewisChris RahmanChris RajaChris S. FrielChris SheehanChris WalderChrissie GittinsChristian KerrChristie DaviesChristine HammChristine PaiceChristoph KellerChristopher AkehurstChristopher Akehurst & Anthony BaileyChristopher AkerhurstChristopher CaldwellChristopher CarrChristopher CarrChristopher Carr & Roger FranklinChristopher CollingwoodChristopher CrokeChristopher DawsonChristopher DeGrootChristopher DeMuthChristopher EssexChristopher HeathcoteChristopher HeathcoteChristopher Heathcote & Jai MarshallChristopher Heathcote, Ian Osborne, Bern Brent, ChChristopher JoliffeChristopher JolliffeChristopher JolliffeChristopher KochChristopher MoncktonChristopher NailerChristopher NanceChristopher PalmerChristopher PearsonChristopher PyneChristopher RajaChristopher SnookChritopher AkehurstCian HusseyCiaran J. RyanCJ MurrayClaire BerlinskiClaire ChandlerClaire WatsonClare StrideClarence CaddellClarence CaddellClaudio VelizCliff OllierClifford SaundersClive HamiltonClive JamesClive KesslerClive Kessler & Sahar AmerClive S. KesslerCodey SwadlingColin BlackColin FraserColin Ian JefferyColin JoryColin LillieColin MacleodCollin JonesConor RossConor RossConrad BlackConstantinos KaraviasCorry MacleodCory BernardiCourt DocumentCraig KurtzCraig McArthurCraig SherborneCraig WilcoxD.M. ArmstrongD.P. FairbornD.S. MartinDaisy CousensDale AtrensDamian BalassoneDamian GraceDamian PowellDamien CremeanDamien FreemanDamien FreemanDamien RichardsonDamon MoonDan GuentherDan RyanDan RyanDana GioiaDana RiceDaniel HannanDaniel HartDaniel J. FlynnDaniel J. MahoneyDaniel JohnsonDaniel O’NeilDaniel PipesDaniel SearsonDaniel TammetDaniel WildDarby HudsonDarrel KillenDarren Nelson & Anthony DillonDarren SteinDarryl BudgeDaryl McCannDaryl McCannDave PelloweDavid A. EisenbergDavid AlexanderDavid ArchibaldDavid AskewDavid AtkinsonDavid BarnettDavid BarrattDavid BarrettDavid BartonDavid BartonDavid Barton and Roger FranklinDavid BennettDavid BirdDavid BlackallDavid BurchallDavid ChandlerDavid ClarkDavid ClaydonDavid CusworthDavid DaintreeDavid DaintreeDavid DaltonDavid EvansDavid Evans & Bob CarterDavid F. SmithDavid F. Smith, Anne Henderson, Des Moore, Neil McDavid FlintDavid Flint and Jai MartinkovitsDavid FreeDavid FrostDavid FultonDavid Furse-RobertsDavid GoodhartDavid GreenDavid HannaDavid HarrisonDavid HendersonDavid HushDavid HutchesonDavid IsaacsonDavid JefferyDavid JossDavid KellyDavid KempDavid KemperDavid KingDavid KingDavid LeachDavid LeeDavid LumsdenDavid Martin JonesDavid Martin Jones & Lana StarkeyDavid Martin Jones & Nicholas KhooDavid MasonDavid Mason-JonesDavid Mason-JonesDavid McIlwainDavid MitchellDavid MorleyDavid OvertonDavid PackhamDavid Packham and Tim MalseedDavid PhillipsDavid PollardDavid PoveyDavid Prescott-SteedDavid PriceDavid Pryce-JonesDavid R. CrowdenDavid ReesDavid S. BirdDavid S. OderbergDavid ScroDavid ShteinmanDavid SmallboneDavid SmithDavid Smith, James Litchfield, David Daintree, HecDavid StockwellDavid StoveDavid SuissaDavid van GendDavid W. LovellDavid WalkerDavid WardDavid WetherellDavid Young, John Stone, Colin Pratt, Hal G.P. ColDebasish MishraDebbie BullerDebbie GarrettDebbie LimDebra KussDecima WraxallDeclan MansfieldDeepak LalDeidre Clary and Fiona MuellerDeidre Clary and Fiona MuellerDeirdre Therese LittleDenis WhiteDenise O’HaganDennis BoothbyDennis GibsonDennis HaskellDennis JensenDennis LeeDennis MortonDennis O'KeeffeDennis O’DriscollDerek FentonDerek ParkerDerek TurnerDerek WrightDes MooreDes Moore & Tom QuirkDes Moore and Case SmitDes Moore, A. (Len) Puglisi, Murray Mitchell, JameDesmond K. O'TooleDesmond O'GradyDevika BrendonDiana FiggisDiana RichardsonDick Adams, MPDikra RidhaDilantha GunawardanaDina RubinaDoctor XDominic PerrottetDon AitkinDonald J. TrumpDonald MackayDonald RichardsonDonald WheelockDonat GallagherDonna LaframboiseDonna M.Doug BrownDoug BuckleyDoug HurstDoug MorrisseyDouglas BrownDouglas BullochDouglas DrummondDouglas FryDouglas HassallDouglas HassallDouglas MurrayDr Augusto ZimmermannDr Michael CrawfordDr Onan McBroadsheetDr Robert M. CarterDr Tess Lawrie PhD & Dr Edmund Fordham PhDDr. Murray Walters & Dr. Alston UnwinDudley HorscroftDuncan EvansDuncan McIntyreDuncan RichardsonDyson HeydonDyson HeydonE.A. GleesonE.R. DrabikEd ColettiEddie GibbonsEdith SpeersEduardo de la FuenteEducationEdward CranswickEdward NeemanEdwin DygaEinar VikingurElisa C. Martinez SalazarElisabeth TaylorElisabeth TaylorElisabeth WentworthElizabeth AllenElizabeth BeareElizabeth FortescueElizabeth LewisElizabeth McCuskerElizabeth PowerElizabeth PowerElizabeth SmitherÉmile TroullierEmily BarkerEmma Alberici with Roger FranklinEnnio BodéEnzo CordelloEric AbetzEric C. HendriksEric KnightEric LouwEric Paul ShafferEric ZemmourEthan RedekopEthan TurnerEugene A DonniniEugene Alexander DonniniEugene SchlusserEva EnglemanEvan WilliamsEvans CampbellF. S. Hespe.Farhan AzadFatima el Baksheesh-NamatjiraFelix CalvinoFinn BrookeFlora SmithFrancine RochfordFrancis BedeFrancis McLoughlinFrank BatiniFrank BatiniFrank BrennanFrank CorsoFrank DevineFrank FurediFrank K. SalterFrank MackFrank MountFrank MountFrank MurphyFrank P. EnglishFrank PledgeFrank SalterFrank SalterFred BlanksFrom The BridgeG.F. AdlerG.P. RotheryGabriel BergmoserGabriel DonleavyGabriel FitzmauriceGabriel J. KruisGabriel MoensGabriël MoensGabriël Moens & John McRobertGabriël Moens & Kashan PirzadaGabriel Moens and Dejan HinicGabriel Moens and John McRobertGabrielle LordGadi TaubGaetano CarcarelloGale AcuffGarth PaltridgeGarth W. Paltridge DSc FAAGary AllenGary ChristianGary ClarkGary FurnellGary FurnellGary HothamGary JohnsGary JohnsGary Johns and Samara McPhedranGary ScarrabelottiGavin AtkinsGavin SilbertGavin SilbertGeert WildersGeoff KingstonGeoff NewtonGeoff PageGeoff PageGeoff SlatteryGeoff WalkerGeoffrey AllenGeoffrey BlaineyGeoffrey GrayGeoffrey LehmannGeoffrey Lehmann, Peter Farrell & Dick WarburtGeoffrey LuckGeoffrey Luck (and sundry ABC in-house apologists)Geoffrey Luck & Roger FranklinGeoffrey PartingtonGeoffrey SherringtonGeoffrey WalkerGeorge BrandisGeorge Brandis, Stanley Croker, Anthony Sharpe, ToGeorge ChristensenGeorge JonasGeorge PellGeorge ShawGeorge ThomasGeorge WatsonGeorge WeigelGerald FrostGerald J. RusselloGerald MercerGerald O’CollinsGeraldine MasseyGerard CalilhannaGerard HendersonGerard WilsonGerrit J. van der LingenGeza JeszenszkyGiacomo SiniGilbert BerdineGiles AutyGina RinehartGisela Sophia NittelGlenn FaheyGlenn McPhersonGloria ChalkGordon AdlerGordon MorrisonGraeme HaycroftGraeme HetheringtonGraham AllisonGraham BradleyGraham CulverGraham CunninghamGraham HryceGraham JoynerGraham P. CooneyGraham PinnGraham PinnGraham Pinn and Roger FranklinGraham SheilGraham WalkerGraham WoodsGreg Buchanan, Geoff Holt, Bill James, George NikoGreg ChapmanGreg ChapmanGreg JohnsGreg LindsayGreg MelleuishGreg PriceGreg SmithGreg SolomonsGreg WalshGreg WilliamsGregory DallyGregory HainesGregory MelleuishGregory Rose and Lewi StoneGregory SolomonsGuy GreenGuy SormanGwyneth LewisGyörgy SchöpflinH.A. WillisHal ColebatchHal Colebatch, John Hill, Suzanne Edgar, Susan ReiHal G.P. ColebatchHal G.P. Colebatch, Frank Pulsford, Nigel Davies,Hannah FlaxonHarold CallaghanHarry BlutsteinHarry CumminsHarry CumminsHarry G. GelberHarry GelberHarry SandersonHarry SteinHazel HallHelen AndrewsHelen DaleHelen HughesHelen Hughes & Mark HughesHelen J. Wilson, Suzanne Edgar, Robyn Williams, PhHelen LyneHelen MooreHelen ThurloeHelene CastlesHenry ErgasHenry ErgasHenry LawsonHenry OlsenHerman RoborghHilary L. RubinsteinHilary WeisserHira JungkowHolly DayHoward DewhirstHoward Thomas BradyHoward TweedieHugh CanhamHugh CragoHugh MorganI. Marie Bashir II. Noel HushI.D.F. CallinanIain BamforthIain TwiddyIan C. SmithIan CallinanIan CastlesIan GeorgeIan KeastIan Kennedy WilliamsIan le TourneauIan MarshIan McFadyenIan McFaydenIan MitchellIan MottIan Munro-MeeksIan PlimerIan ReidIan ShircoreIan StewartIan TregenzaIda LichterIgor PomerantsevImmanuel SuttnerImogen WallIngrid van Beek, Robert McLaughlin, David Elder, PIrene PetrosIrina DunnIsi UnikowskiIvan HeadIvan HeadJ. B. LawrenceJ. C. GopalJ. GoddardJ. J. SpigelmanJ. T. MitchellJ.A. CooperJ.A.H. Brown, David F. Smith, Geoffrey Luck, MichaJ.B. PaulJ.B. PaulJ.C. ColeJ.D. VanceJ.F. BeckJ.F. HargraveJ.M. CoetzeeJ.R. McRaeJ.R. NethercoteJ.S. WestbrookJ.T. MitchellJack AllenJack HutchinsonJack HutchinsonJack MitchellJack OpieJack RobertsonJack SextonJack SnellingJack WeatherallJacob DunstanJacob WattsJacqueline KarpJacqui WiseJade PisaniJafar JaliliJake BilardiJake DennisJake HartJake RosemanJames AckhurstJames AitchisonJames AllanJames AllanJames Allan and Mirko BagaricJames B.T. McCaughanJames BowenJames BowmanJames BrookesJames C. BennettJames CurranJames DelingpoleJames FalkJames FranklinJames Franklin and Tony AbbottJames GrantJames GuestJames HoggettJames JefferyJames KiersteadJames LucasJames McCannJames MuirheadJames MurrayJames OrrockJames PatersonJames PhilipsJames SpigelmanJames ThomsonJames WaltonJameson DunneJamie DerkenneJamie GrantJamie Q. RobertsJan CooperJan DaviesJan Heller LeviJan HutchisonJan OwenJane BlanchardJane DoeJane DowningJane FraserJane MuellerJane O'SullivanJane PetkovicJane Petkovic and Raymond BurnsJane SuttonJane WilliamsJanet ThompsonJanette ParrJanice PaullJanine FraserJanuary February 2012Jared OlarJarrod BradyJason BealeJason BrennanJason LandlessJason MonaghanJason MorganJason SoonJasper BurgessJasper GlenJavier MileiJavier MileiJay LehrJean BouJean FrancesJean KingJean ThorntonJeff GuessJeff KennettJeff SparrowJeffrey A SingerJeffrey BurghauserJeffrey GoldsworthyJeffrey Grey, Peter Stanley, John Dorman, Murray MJeffrey LordJeffrey R GrimshawJemal SharahJennifer ComptonJennifer GribbleJennifer GribbleJennifer MarohasyJennifer OrielJenny BlackfordJenny StewartJeremy BartholomeuszJeremy BlackJeremy BrayJeremy BuxtonJeremy GaddJeremy Lockhart NelsonJeremy NelsonJeremy SammutJessie BateJill EvansJill IrelandJillian BrannockJillian PattinsonJillian SchedneckJillian SchullerJim AllanJim CampbellJim CarltonJim CarruthJim DalyJim FryarJim MolanJim WoodsJo McInerneyJo NovaJoan Webster OAMJoanna BellJoanna BeresfordJoanna HackettJoanne NovaJoão Carlos EspadaJodie HollanderJoe DolceJoe LaneJoe StellaJoel CrottyJoel EphraimsJoel HodgeJohm IzzardJohn A. MosesJohn AndersonJohn BadgeryJohn BesemeresJohn BigelowJohn BloomJohn BovaJohn BowersJohn BrysonJohn BurgessJohn BurnheimJohn CameronJohn Cameron and David PackhamJohn CareyJohn CarrollJohn ChaumontJohn ClarkeJohn DaicopoulosJohn DawsonJohn de MeyrickJohn DennisJohn DerbyshireJohn DonovanJohn DorrohJohn DuncanJohn Ellison DaviesJohn ElsegoodJohn EppelJohn FinnisJohn FoleyJohn FonteJohn FoulcherJohn FowkeJohn FraserJohn GavaJohn GlynnJohn GoodmanJohn GreeningJohn GriffinJohn HappsJohn HenninghamJohn HenninghamJohn HirstJohn HowardJohn HumphreysJohn HydeJohn IzzardJohn J. Furedy and Christine FuredyJohn J. PrineasJohn KinderJohn KunkelJohn LloydJohn MacRitchieJohn McCallumJohn McConnellJohn McDonaldJohn McDonnellJohn McLeanJohn McLean and the BoMJohn McRobert & Gabriël MoensJohn MikkelsenJohn MontgomeryJohn MosesJohn MuscatJohn NicolJohn O’ConnorJohn O’SullivanJohn OwenJohn P. BrysonJohn PrineasJohn R. RossiterJohn ReidJohn RidlandJohn RigoJohn RuddickJohn RussellJohn SaulJohn ScahillJohn Sheng/Ouyang YuJohn SingerJohn SingerJohn SlaterJohn SleeJohn SnookeJohn SpeerJohn SpoonerJohn StephensonJohn StoneJohn StubleyJohn StylesJohn SumnerJohn ThatcherJohn UptonJohn WestJohn WheelahanJohn WhitehallJohn WhitehallJohn WhitfordJohn WhitworthJohn WilliamsJohn WongJohn ZerilliJohn ZmirakJohn-Paul McCarthyJon BishopJonathan BaldryJonathan ColeJonathan ForemanJonathan GraceJonathan HustonJonathan J. Pincus, Jack Robertson, Hal ColebatchJonathan PincusJonathan SacksJonathan SumptionJordan GranthamJorge González-Gallarza HernándezJoseph LaneJoseph O’DonoghueJoseph PoprzecznyJoseph PowerJosh HawleyJoshua ShrubbJoy HeathJoy ReidJoyce FreedmanJude AquilinaJudith BassettJudith CurryJudy JohnsonJudy StoveJudy Stove-WilsonJulia MagnetJulia PatrickJulian CroftJulian LeeserJulian McGauranJulian O’DeaJulian WoodsJulie NovakJulie SladdenJuly-August, 2011June 2012June, 2011Justene MusinJustin CampbellJustin JeffersonJustin KellyK. M. PrestonK.CairnsK.M. PrestonKamal WeerakoonKara ThomasKaren BlaylockKaren ThrossellKarin Petersen-SchaeferKarl SchmudeKatherine GallagherKatherine SpadaroKathryn RaeKathy DugganKathy GyngellKathy HuntKathy RussellKatrina GulliverKatrina NaomiKay CairnsKayt DaviesKeayr BraxtonKeith McKenryKeith RussellKeith WindschuttleKeith Windschuttle and Brian GalliganKeith Windschuttle and Tim GillinKel RichardsKel RichardsKen GannicottKen HaleyKen HandleyKen HarneyKen PhillipsKen SimpsonKen StoneKenneth HarknessKenneth MaddockKenneth MinogueKenneth SlessorKenneth StevenKerry ConwayKerry PopplewellKerry TilbrookKerryn PholiKesten GreenKevin AndrewsKevin BennettKevin CahillKevin CowdallKevin D. WilliamsonKevin DensleyKevin DonnellyKevin DonnellyKevin HallewellKevin HartKevin McGovernKevin MyersKevin MyersKieran MorrisKieren KoalaKim CoreKim MorrisonKirsten DueKitty DonnellyKnow-it-PoetKnute SkinnerKonstantin KanelleasKris HemensleyKristen RobertsKyle OrtonL W MaherL.S. BerginLaila NawsheenLana StarkeyLance Eccles, David Elder, Bill James, Peter GerarLaura BuzoLaurence KaracsonyLaurence KaracsonyLaurence W MaherLaurence W. MaherLaurent LemassonLaurie HergenhanLawrence BurkeLawrence CrossLawrence QummouLeah HobsonLee ShrubbLeila LoisLennie LowerLeo MaglenLeo MaglenLeo MarziLeon ShannLeon TrainorLeonie KramerLes LouisLes MurrayLes WicksLesley BolandLeslie KemenyLeslie SteinLeslie SteinLettersLetters to the EditorLewi Stone and Gregory RoseLibby SommerLillian AndrewsLin van HekLincoln WrightLinda ReynoldsLindsay BoydLindsay BrienLindsay FoyleLindsay UrwinLionel FarrellLionel ReynoldsLisa JacobsonLiz McQuilkinLloyd ReinhardtLoretta PolsonLorraine BlackLorraine FinlayLorraine McGuiganLouis Cipher (aka Peter Smith)Louis GroarkeLouis GroarkeLouise BremnerLucas McLennanLucas SmithLucas SmithLucinda MoonLucinda SpierLucy K. HahnLuke MaffeoLuke PowellLuke PowellLuke StegemannLuke TorrisiLuke WhitingtonlungfishLW MaherLyle DunneLyn AshcroftLyn AshcroftLyn WesleyLynette Reilly:M. A. CaseyM. L. R. SmithM.A. CaseyM.A. GoldrickM.B. McLatcheyM.G. Michael & Katina MichaelM.T. O’ByrneMadeleine Rose JonesMae VanderschaarMaggie WallisMagnus O’MallonMahammad Kalifa Al–Kalifa More-KalifasMal WeddMalcolm CollessMalcolm ForbesMalcolm GilliesMalcolm GilliesMalcolm H. BrandonMalcolm Hugh PattersonMalcolm KingMalcolm McCuskerMalcolm SaundersMalcolm TurnbullMalcolm Voycemalcolm weddMalcom CollessMarc HendrickxMarc HendrickxMarc Hendrickx & Roger FranklinMarc JanssenMarc MarusicMarch 2012March, 2011Marco PaolettiMarco WollertMarcus Ten LowMargaret BarbaletMargaret BradstockMargaret Cameron-AshMargaret HarveyMargot PearceMargot PearceMaria SchneiderMarie DaoudaMarie GleesonMarie Hansen FelsMarie Hansen Fels & David ClarkMarie Hansen Fels with David Clark and Rene WhiteMarie MuldoonMarilyn PeckMarion LucyMarjon MossammaparastMarjorie Howard JohnsonMark BeltzMark DurieMark DurieMark E.T. Horn & Peter R. ProudfootMark EdgecombeMark EvansMark FowlerMark GregoryMark HendersonMark Horn & Peter ProudfootMark ImisidesMark LathamMark LawsonMark LewisMark LopezMark McGinnessMark McGinnessMark MoyarMark O’ConnorMark PowellMark PowellMark PoynterMark Sneddon & Pete MulherinMark SteynMark SteynMark W. JonesMark WallandMartin AusterMartin BennettMartin DaviesMartin H. SamuelMartin HutchinsonMartin Jones & Michael L.R. SmithMartin LynchMartin R. JohnsonMartin SamuelMary CresswellMary JonesMary KisselMary MakofskeMary-Ellen TurbetMaryanne HannanMarye TrimMathew WhiteMatt GaughwinMatt HaydenMatt RidleyMatt ThompsonMatthew GoldrickMatthew GreenMatthew HeeneyMatthew LeshMatthew MaddernMatthew O'SullivanMatthew OmoleskyMatthew WaltherMatthew WhiteMatthew WhiteMatti FriedmanMaurice NestorMaurice NewmanMax Bennett and Jeff ReimersMax RheeseMax RyanMax TeichmannMaxim NikiforovMay 2102May, 2011Mchael Warren DavisMeg Courtney HawkeMegan CartwrightMelanie PhillipsMelinda SmithMelinda Tankard ReistMelissa AhartMelissa CoburnMelvin SchutMerrie CaveMerv BendleMerve BendleMervyn BendleMervyn BendleMervyn F BendleMervyn F. BendleMervyn F. Bendle PhDMervyn F. Bendle, John Dawson, Bill Muehlenberg, JMervyn F. Bendle, Trevor Sykes, Howard Hutchins,SuMichael AcklandMichael AcklandMichael AngwinMichael AstenMichael AylingMichael BaumeMichael BoundsMichael BuhagiarMichael ByrneMichael CollinsMichael ConnorMichael CookMichael Cook, Joseph Parkinson, Anna Porter, JohnMichael CopemanMichael CotterMichael CraneMichael CrossMichael DanbyMichael DavisMichael de PercyMichael DetmoldMichael DuffyMichael DunnMichael EassonMichael EassonMichael EvansMichael EvansMichael FogartyMichael GalaMichael GalakMichael GalakMichael George SmithMichael GiffenMichael Giffi nMichael GiffinMichael GiffinMichael GreenMichael HaigMichael HalliwellMichael J. GalakMichael JensenMichael KileMichael KowalikMichael LawriwskyMichael LawriwskyMichael MansellMichael McAuleyMichael MintromMichael MorrisseyMichael O'Connor, Dawn Moss, James Allan, Murray MMichael O’ConnorMichael OlsenMichael P. JensenMichael PassanitiMichael RoeMichael SaribanMichael ScammellMichael SharkeyMichael ShellenbergerMichael ThorleyMichael WalshMichael WarbyMichael Warren DavisMichael WildingMichael WilliamsonMichael WittsMichele Fermanis-WinwardMick RingiariMihail EvansMike AlderMike CarlsonMike CooperMike FogartyMiklos Radnoti, translated by John Ridland and PauMilton CockburnMilton CockburnMilton OsborneMilton P. EhrlichMira CrouchMirand DevineMiranda DevineMiranda SiemienowiczMiriam DixsonMisha SaulMishka GoraMitch BrowneMocco WollertMoira DeemingMolly ChongMolly J. SassonMonica WilkieMorris LurieMoya PaceyMurray MitchellMurray WaltersMurray WatersMyles HarrisMyles ParishMyra SchneiderMyron EbellN.A. HaugN.S. LyonsNan OllerenshawNana OllerenshawNathan LivingstoneNathaniel CalhounNathaniel LucasNational Review OnlineNeal PriceNeil Burrows and Rick SneeuwjagtNeil McDonaldNelson RufattNicholas HasluckNicholas HasluckNicholas T. ArndtNicholas T. ParsonsNicholas TamNicholas Tonti-FilippiniNick CaterNick CaterNick GibbNick LloydNick McGowanNick TurnerNicola KnoxNicole JamesNidhi AgrawalNigel BiggarNigel DaviesNigel FreitasNigel JacksonNikki Savage (as told to Jim Allan)Nils A. HaugNiro SivathasanNiro Sivathasan and Duncan SymeNoel GardnerNoel KingNoel PearsonNoel WeeksNoela ShepherdNorm NeillNovember 2011November, 2011October, 2011Ojel L. Rodriguez BurgosOliver BurckhardtOliver FriendshipOliver HartwichOliver HartwichOlivia ByardOlivier BurckhardtOlwyn ConrauOna GrossnickleOscar ClarkeOscar GodsellOtto NebblerOur CorrespondentOuyang YuOwen HarriesP. BrownP.D. JonsonP.F. O’DonohueP.J. MurphyP.P. McGuinnessPadraic P. McGuinnessPamela LeachPaolo Bertolani/Jennifer ComptonPaolo TotaroPascale PetitPastor de LasalaPat BealePat ClintonPatricia AndersonPatricia AzariasPatricia RolfePatricia ShawPatrick CoynePatrick HollandPatrick J. ByrnePatrick McAuleyPatrick McCauleyPatrick McCauleyPatrick MorganPatrick MorganPatrick ParkinsonPatrick WalshPaul Amos, David Bird, Kenneth Barnes, Ken HarknesPaul BlakePaul BrookePaul BussanPaul CatalanottoPaul ChandlerPaul CollitsPaul CollitsPaul ConnollyPaul de ServillePaul DickeyPaul DolphinPaul Fenton, Murray Mitchell, Colin Pratt, Adam BoPaul FraserPaul G. E. AlbrechtPaul GoardPaul GreguricPaul GroverPaul J. GreguricPaul KanePaul KrausePaul LakePaul MabarrackPaul MitchellPaul MonkPaul MonkPaul Monk, Roger Nairn, Ray Evans, Bill James,MichPaul MorrisseyPaul NichollsPaul OatesPaul OslingtonPaul ProcivPaul RaffaelePaul ReadPaul StenhousePaul SturdeePaul ThomasPaul WilliamsPaul WilliamsonPaula JonesPauline ConollyPauline FarleyPeach KlimkiewiczPenelope NelsonPeregrine BlakePersimmonPete MulherinPeter ArnoldPeter BakovskiPeter BaldwinPeter BarclayPeter BarryPeter BrunPeter BrunePeter C. GrundyPeter CoghillPeter ColemanPeter CostelloPeter CravenPeter DayPeter FenwickPeter FenwickPeter GiletPeter GoldsworthyPeter GrossPeter H. EdwardsPeter HannanPeter HansenPeter HayesPeter HowsonPeter J. ElliottPeter JacksonPeter JeffreyPeter JenningsPeter KocanPeter KurtiPeter L. SwanPeter LangPeter LavacPeter MulherinPeter MulhollandPeter MurphyPeter NorrisPeter O'BrienPeter O'Brien & Roger FranklinPeter PhelpsPeter PiercePeter Proudfoot, Kerry Boulton, Frank Pulsford, ChPeter PurcellPeter PurcellPeter R. ClynePeter ReesPeter RiddPeter RowePeter RutherfordPeter RyanPeter SamuelPeter SaundersPeter Sekuless & Tony O’LearyPeter SellickPeter ShergoldPeter SkrzyneckiPeter SmithPeter StilesPeter TiernanPeter ValleePeter WalesPeter WardPeter WestPeter WilkinsPhil Ainsworth & Alistair PopePhil BrownPhil BurchamPhil ShannonPhil ShannonPhilip AyresPhilip Ayres, Roy Williams, Alan Barcan, Bern BrenPhilip BurchamPhilip DrewPhilip EmeryPhilip HaywardPhilip HopkinsPhilip MartinPhilip PlickertPhilip PlickertPhilip RintoulPhilipp AmmonPhilippa MartyrPhillip HallPhillip HiltonPhillip M. AltmanPhillip TurnbullPhillipa MartyrPHILTONPiers AkermanPippa KayPJ MurphyProfessor BunyipQoL EditorQuadrantQuadrant EditorsQuadrant Online ContributorsQuadrant VerseQuentin DempsterR L SwihartR.B. Chenevix TrenchR.J. ArmstrongR.J. ConlonR.J. SmithR.J. StoveR.N. CallanderR.N. CallanderR.W. JohnsonRachael KohnRachael KohnRachel RileyRafe ChampionRafe ChampionRafiq MahmoodRambling PossessionRanald & Airlie MooreRanald MooreRanald Moore, Jack Sexton, Claudio Veliz, Ian JoneRay EvansRay Evans & Tom QuirkRay Evans and Tom QuirkRay Evans, Colin Balmer, Tony AbbottRay Evans, Wilson Tuckey, Michael Kile, Edward DraRay PennyRaymond BurnsRaymond BurnsRaymond IbrahimRaymond Shon & Stephanie ShonRayyar MarronRazeen SallyRB LonetreeReagan UpshawRebecca WeisserReg NaultyRemy ChadwickReuben KirkhamRex AhdarRex PollardRhett TalleyRhoderick McNeillRicardo Pau-LlosaRiccardo BosiRichard AllsopRichard AlstonRichard BakerRichard CastlesRichard FernandezRichard ForrestRichard GateRichard GrayRichard Harrison & Frank SalterRichard LaidlawRichard LansdownRichard MartinRichard MawreyRichard S. LindzenRichard StantonRichard WaddellRichard White, Tony Hassall, Ed Killesteyn, StepheRinzen WidjajaRJ StoveRoad Scholar BlogRob FootRob LongRob NugentRobbie CoburnRobert AndrewsRobert CarterRobert ClancyRobert ConquestRobert ConstantineRobert DarbyRobert DarrochRobert EdmondsRobert EllisonRobert FrenkelRobert GrayRobert HandicottRobert HandicottRobert HillRobert HirschfieldRobert I. EllisonRobert KaplanRobert LewisRobert M KaplanRobert M. CarterRobert M. KaplanRobert M. SteleyRobert McLaughlinRobert MenziesRobert MezeyRobert MurrayRobert RothmanRobert ServiceRobert SolomonRobert WarburtonRobert WargasRobert WoodRobin BarclayRobin NorlingRobin TeeseRobyn LanceRobyn O’SullivanRobyn RowlandRocco LoiaconoRod DreherRod McGarvieRod MoranRod StuartRod UsherRodney PurvisRoger BeamRoger BrownRoger FranklinRoger Franklin & Tony ThomasRoger G McDonaldRoger G McDonald:Roger G. McDonaldRoger KargeRoger KargeRoger KimballRoger KimballRoger NeillRoger PartridgeRoger Pescott and Marita PunshonRoger SandallRoger ScrutonRoger UnderwoodRoger UnderwoodRoger Underwood & Athol Hodgson AMRohan BuettelRohan McHughRon BoswellRon CoxRon KitchingRon MerkelRon PettyRon PikeRon PikeRon PrettyRon RashRon RodgersRon TaftRon WilkinsRon WilsonRory ShinerRosaleen SmythRosanna LicariRoslyn RossRoss BabbageRoss BarhamRoss DonlonRoss FitzgeraldRoss FitzgeraldRoss Fitzgerald & Graham IrvineRoss Fitzgerald & Ian McFadyenRoss Fitzgerald & Stephen HoltRoss Fitzgerald and Stephen HoltRoss JacksonRoss MartinRoss Murdoch MartinRoss TerrillRoss Terrill and Frank MountRoss TwiggRowan CallickRowan DeanRowena WisemanRoy DuffieldRoy W. GotaasRoy WilliamsRoyston MitchellRudolf VybornyRupert DarwallRupert GuentherRussell ErwinRussell ForsterRussell TroodRuth BlakeneyRuth Dudley EdwardsRyan AndersonRyszard LegutkoS. WalkerS.T. KarnickSally SaraSalvatore BabonesSam AbotomeySam RoggeveenSamantha GrosserSamer AbbasSamuel ChamberlainSamuel J.Samuel MullinsSamuel StrathmanSandra Jobson DarrochSara MillerSarah MandieSarah PenwardenSarah TiffenSatya MararSatyajeet MararSaul KellySaxby PridmoreScot BraithwaiteScott A. McConnellScott BuchananScott KellyScott MonkScott MorrisonScott PrasserScotus ViatoSeamus ColeSean BeckettSean HaylockSean JacobsSean KellySean MastersSean McGlynnSean O’CallaghanSean O’LearySean WaymanSean WaymanSean WelshSebastian SchloessingkSebastian TombsSelwyn ParkerSenator James McGrathSeptember 2012September, 2011Sev SternhellSever SternhellShan CharlesworthShane McCauleyShane W. SatterleySharon FoulkesSharon GouldSharon OldsShelley GareSheryl PerssonSheryl PerssonsShimon CowenShimon Cowen and Michael KowalikShirley ApthorpShlomo ShnotvasserShreya SenSimon CatersonSimon CollinsSimon CollinsSimon HainesSimon KennedySimon KennedySimon MolloySimon P. KennedySimon PetchSimone RichardsonSinclair DavidsonSir David SmithSolveig Fosssomeone called \"Tom\"Sonia MycakSophia Nugent-SiegalSophie MassonStan MastersStan McGladeStanley J. SolomonSteele RuddStefan MolyneuxStephanie BastiaanStephanie ForrestStephanie JarrettStephen BeckettStephen BrockStephen BuckleStephen Buetow & Kira BaccalStephen ChavuraStephen CoronesStephen EdgarStephen GilfedderStephen GoldrickStephen H. BalchStephen HoltStephen HoltStephen MasonStephen McInerneyStephen MurphyStephen OrrStephen QuinnStephen SewellStephen SewellStephen TuckerStephen WilksSteve BrockSteve CoxSteve EtheringtonSteve IshamSteve KatesSteve Kates and James AllanSteve WoodmanSteven KatesSteven SchwartzSteven SchwartzSteven TuckerStewart JustmanStuart LindsayStuart WoodSubscriber XSue BrennanSue JonesSusan AdamsSusan BennettSusan MooreSuzannah RowntreeSuzanne EdgarSuzanne Edgar, H.A. Willis, Donat Gallagher, GeoffSuzanne Edgar, L. Peter Ryan, Michael O’Connor,Symeon ThompsonTamara LazaroffTannerTanveer AhmedTanya RoseckyTanya ThistletonTati SofarisTati SofarisTed HopkinsTed O’BrienTed RuleTed WithamTerry BarnesTerry BeathTerry DwyerTerry McCrannTerry PersunThe New CityTheodore DalrympleThomas BanksThomas Banks Christopher Akehurst Gerald J. RusselThomas BarlowThomas SowellTiggy JohnsonTim AndrewsTim BlairTim CannonTim CaseyTim CurtinTim EdwardsTim Fab-EmeTim LovedayTim Macartney-SnapeTim Montgomerie & Andrew GambleTim MurphyTim NeilsonTim O'HareTim O’BrienTim TrainTim van GelderTim WilmsTim WilsonTimoshenko AslanidesTimothy CootesTimothy CootesTimothy LitherlandTimothy O'HareTina FaulkTina KaneTitania ScopticosTJ NewtonToby YoungTodd HardyTodd HuizingaTodd TurnerTom BarlowTom BreenTom BurkardTom BurtonTom CoverdaleTom FrameTom GallagherTom HarrisTom LewisTom LewisTom MinchinTom Morgan and Andrew Bilinsky with Tom SwitzerTom QuirkTom QurikTom RandolphTom SwitzerTomasz ZiejaTomaž Šalamun/ Michael Thomas TarenTony \"Swearing Man\" ThomasTony AbbotTony AbbottTony AbbottTony BartlettTony CousinsTony GreyTony HassallTony HellerTony MackenTony ThomasTony WinkelmanTranscriptTrevor BaileyTrevor KennedyTrevor L. Jordan, Owen Richards, Fred Blanks, RobeTrevor SykesTrevor Sykes, Deirdre Therese Little, and Hal G.P.Tricia DearbornTricia PeakTristan HeinerTronn OverendTrudi TateU. CalderoneUgo RotelliniUlla Terkelsen and Askold KrushelnyckyUS State DepartmentUwe Siemon-NettoVáclav KlausVal MajkusVal MurrayVal YuleValerie MurrayVanessa de LargieVanessa ProctorVarious ARC grant recipientsVeronica WinkelsVeronika WinkelsVery-Anonymous-Scared-to-Stand-up-and-be-Counted-DVic JurskisVic SpandrioVictor Davis HansonVictor StepienVictoria FieldVictoria KincaidVictoria RoystonVirad MathurViscount Monckton of BrenchleyViv ForbesViva HammerVivian SmithVivian Whiteley HopkirkW.H. PresleyWalter SofronoffWalter StarckWalter WaverleyWanda SkowronskaWanda SkowronskaWandoo Hollowswar memorialWarren ShapiroWayne CaldowWayne StrudwickWayne StrudwickWendy VidelockWendy WillemseWesley J. Du PreezWestminster CommissionWill Dallas BrooksWill FraserWilliam BriggsWilliam CarneyWilliam ColemanWilliam D. RubinsteinWilliam EtheridgeWilliam HeathWilliam J. LinesWilliam KininmonthWilliam KitcherWilliam McGurnWilliam PoulosWilliam RushWilliam WalkerWillie Soon and David R. LegatesWilson TuckeyWolfgang Kasperwork -> homeWortley ClutterbuckYan XiaYulia LatyninaZachary GormanZegZenoZoe HiggieMagazineFeaturesShort-readsPodcastsInterviewsVideoFictionReviewsSubscribetoQuadrant OnlineSubscribe Aborigines Academia Africa Album Review America Anti-Semitism ANZAC Architecture Art Arts & Culture Asperities Astringencies Australia Australia Day Books Census China Civilisation Climate Climate Change Colonialism Cookery Covid Crime Culture Defence Demographics Doomed Planet Dublin Letter Economics Editor's Column Editor's Corner Education Energy Entertainment Environment Espionage Europe Fauxborigines Feature Feminism Fiction & Stories Film First Person Fourth Column Free Speech From Our Archives Guest Column Health History Ideas Immigration Insights from Quadrant Islam Israel Keith Windschuttle Language Letters to the Editor Literature Media Memoir Middle East Modern Myths New York Letter New Zealand Nuclear Obituary Opinion Philosophy & Ideas Poem Poetry Politics Public Health QED Quad Rant Quad-Cast Quadrant Music Reflection Religion Review Russia Science Sicktoria Society Sport Story Sweetness & Light Tariffs The Arts The Crown The Law The Left The Middle East The U.S.A. The Universities The Voice Theatre Their ABC Third Column Trade Tribute TV Ukraine Ukraine Letter Voting Whimsy Wokery World 'Asiya' & Gabrielle Lord \"William York\" A Cronulla Mum A Dozen Melbourne Doctors A Modest Local A Victorian Teacher A.G. Evans A.M. Juster A.S. Patric Aaron Ames Aaron Craig Adam Bisits Adam Browne Adam Day Adam L. Darragh Adam LeBor Adam M. Rustowski admin Adrian Nguyen Adrian Williams Adriana McOrdero Adrienne Eberhard Agnes Selby Aidan Coleman Ainu Campbell-Barracks Alamgir Hashmi Alan Barcan Alan Barron Alan Fewster Alan G. Futerman & Walter E. Block Alan Gould Alan Lee Alan Moran Alan Moran Alan Moran and Roger Franklin Alan Oxley Alan R.M. Jones Alan Riach Alan RM Jones Alan RM Jones Alan Saunders Alan Smith Alan Stephens, Murray Mitchell, J.B. Paul Alan Sunderland and Quadrant Online Alan Whelan Alana Kelsall Alasdair Millar Alasdair Millar & co-authors Alastair Spate Alberto Mingardi Alessio Zanelli Alex Hand Alex Lake Alex McDermott Alex Millmow Alex O'Sullivan Alex Robson Alex Stuart Alexander Borojevic Alexander Hatzikalimnios and Augusto Zimmermann Alexander Voltz Alexander Voltz Alexander Voltz Alexander Voltz & Barry Spurr Alison Bevege Alison McNaught Alistair Crooks Alistair Nicholas Alistair Pope Alistair Pope Alister Henskens Allan Gould Allan Johnston Allan Lake Allan Pidgeon Allen Greer Alwyn Karpin Amanda Hemmings Amanda Stoker Amanda Wilson Amit Majmudar Amy Brooke Amy Brooke Anamaria Beligan Andrea Ockerby Andrea Pagliaro Andrew Blyth Andrew Bolt Andrew Botros Andrew Bragg Andrew C Mackinnon Andrew Cusack Andrew Cusack Andrew Errington Andrew Gabriel Andrew Gamble Andrew Glikson Andrew Gutmann Andrew Irvine Andrew Irvine & Stephen Wexler Andrew J. Lowy Andrew James Menken Andrew Kenny Andrew Klavan Andrew L. Urban Andrew Lansdown Andrew Leggett Andrew McBurnie Andrew McGee Andrew McIntyre Andrew Motion Andrew Nikolic Andrew Norton Andrew Paterson Andrew R. Timming Andrew Roberts Andrew Ross Errington Andrew Russell & Lana Starkey Andrew Slattery Andrew Smallman Andrew Smallman Andrew Smith Andrew Stone Andrew Stuttaford Andy Halksworth Andy Kissane Andy Mullins Ang Chin Geok Angela Shanahan Angela Smith Angus Pike Aniello Iannuzzi Anjali Nadaradjane Ann Dix Ann Howard Ann McElhinney and Phelim McAleer Anna Buck Anna Fern Anna McHugh Anna Ratcliff Anna Wierzbicka Anna Zeltzer Anne Applebaum Anne Fairbairn Anne Henderson Anne McCosker Anne Skyvington Anne Twomey Anne Williams Anne-Elisabeth Moutet Anonymous Anthony Bailey Anthony Cappello Anthony Daniels Anthony Daniels & Nikos A. Salingaros Anthony Dillon Anthony Fisher Anthony Graham Anthony J.H. Morris Anthony Lynch Anthony McAdam Anthony McCarthy Anthony Milner Anthony O Hear Anthony O’Hear Anthony Paul Anton Bendarzsevszkij Anton Lang Antonia Newton Antonin Scalia Antony Barraclough Antony Carr Antony Carr & Christopher Carr Antony Flew April 2012 April, 2011 Arian Ganjavi Arjun Rajkhowa Art Raiche Aryan Ganjavi Ashley Martin Ashley Morgan-Shae Ashley Mrgan-Shae Ashlley Morgan-Shae Augusto Zimmermann Augusto Zimmermann Augusto Zimmermann & Aramis C. DeBarros Augusto Zimmermann & Gabriël Moens Augusto Zimmermann and Fabio Condeixa Australian Conservative online Autorenkollektiv Averil Drummond Aynsley Kellow B N Oakman B. Collis B.J. Coman B.J. Coman & Evan Jones B.R. Whiting Babette Francis Babette Francis, John Reid, Ken Schultz, Michael W Barbara Fisher Barclay McGain Barend Vlaardingerbroek Baron Alder Barry Brill Barry Gillard Barry Gillard Barry Humphries Barry Leithhead Barry Maley Barry Ninham Barry Peters Barry Poster Barry Spurr Belinda Lopez Ben Bassett Ben Crocker Ben Jellis Ben Meehan Ben Pattison Ben Sharafski Ben-Peter Terpstra Benjamin Crocker Benjamin Jellis Benjamin Marks Benjamin Wilkie Benny Peiser Berislav Maroya Bern Brent Bernadette Belej Bernadette Tobin Bernard d’Abrera Bernard Gaynor Bernard Lane Bernard Levin Bernie Lewin Bernie Power Bert Almon Bert Kelly’s Ghost Bess Nungarrayi Price Best Overend Bettina Arndt Bettina Arndt Bettina Arndt Bev Cains Bill Ackman Bill Arnott Bill Dawes Bill DiPuccio Bill Harcourt Bill Harcourt, Howard Hutchins, Neil James, JohnTw Bill James Bill James, Digby Ricci, Donald G. Runcie, Andrew Bill Leak Bill Martin Bill Muehlenbeg Bill Muehlenberg Bill Rush Bill Wyndham Billy McCarron Biswadarshan Mohanty Bob Bourman Bob Carr Bob Carter Bob Carter & John Spooner Bob Carter and John McLean Bob Carter, Alan Moran & David Evans Bob Carter, David Evans, Stewart Franks & Bill Bob Carter, David Evans, Stewart Franks & Will Bob Carter, David Evans, Stewart Franks, Bill Kini Bob Carter, Willie Soon & William Briggs Bob Catley Bob Day Bob Reece Bob Wright Boy on a bike Brad Jackel Brad Williamson Bradley Voltz Brenda Saunders Brendan Craig Brendan Frain Brendan Nelson Brett Jenik Brett Masters Brian Dethridge Brian Doak Brian Griffiths Brian Hawkins Brian Lessard Brian Pollard Brian Roberts Brian Sully Brian Turner Brian Wimborne Brianna Heseltine Bruce Anderson Bruce Beresford Bruce Beresford Bruce Dawe Bruce Fleming Bruce Grant Bruce Williams Bryan Coleborne Bryan Leyland Bryan Wimborne Bubbles Segall Burchell Wilson By Christopher Akehurst By Daryl McCann By John Whitehall By Martin Lynch By Robert Clancy By Tom Quirk By William Kitcher C.A. Broadribb C.A.R. Hills C.J. Murray C.J. Ryan C.R. McArthur C.R. Penny Caitlin Maling Callum J. Jones Cally Conan-Davies Cameron Fuller Cameron Semmens Cardinal George Pell Carl Bridge Carlos d'Abrera Carlos Roa Carmel Macdonald Grahame Carol Chandler Carol Jenkins Carole Wilkins Caroline Carver caroline cooper Caroline Overington Caroline Smith Glen Carolyn E. Campbell Carolyn Evans Campbell Carolyn Ingvarson Case Smit Cassandra Dickinson Cate Cadell Cath Drake Cath Vidler Catherine Baxendale Catherine Broadstock Catherine Chandler Catherine Parish Cato Seutonius Cato Suetonius Cecilia Morris Chad Swanson Changming Yuan Chanming Yuan Chapman Pincher, Tennent H. Bagley, John L. Wilhel Chapman Pincher, Tennent H. Bagley, John L. Wilhel Charles Bradburne Charles Copeman Charles Smith Charlotte O’Neill Chris Ashton Chris Battle Chris Battle Chris Battle & Keith Windschuttle Chris Berg Chris Berg & Jason Potts Chris Berg and Sinclair Davidson Chris Carr Chris Dynon Chris Harlow Chris Keefer Chris Kenny Chris King Chris Leithner Chris Lewis Chris Rahman Chris Raja Chris S. Friel Chris Sheehan Chris Walder Chrissie Gittins Christian Kerr Christie Davies Christine Hamm Christine Paice Christoph Keller Christopher Akehurst Christopher Akehurst & Anthony Bailey Christopher Akerhurst Christopher Caldwell Christopher Carr Christopher Carr Christopher Carr & Roger Franklin Christopher Collingwood Christopher Croke Christopher Dawson Christopher DeGroot Christopher DeMuth Christopher Essex Christopher Heathcote Christopher Heathcote Christopher Heathcote & Jai Marshall Christopher Heathcote, Ian Osborne, Bern Brent, Ch Christopher Joliffe Christopher Jolliffe Christopher Jolliffe Christopher Koch Christopher Monckton Christopher Nailer Christopher Nance Christopher Palmer Christopher Pearson Christopher Pyne Christopher Raja Christopher Snook Chritopher Akehurst Cian Hussey Ciaran J. Ryan CJ Murray Claire Berlinski Claire Chandler Claire Watson Clare Stride Clarence Caddell Clarence Caddell Claudio Veliz Cliff Ollier Clifford Saunders Clive Hamilton Clive James Clive Kessler Clive Kessler & Sahar Amer Clive S. Kessler Codey Swadling Colin Black Colin Fraser Colin Ian Jeffery Colin Jory Colin Lillie Colin Macleod Collin Jones Conor Ross Conor Ross Conrad Black Constantinos Karavias Corry Macleod Cory Bernardi Court Document Craig Kurtz Craig McArthur Craig Sherborne Craig Wilcox D.M. Armstrong D.P. Fairborn D.S. Martin Daisy Cousens Dale Atrens Damian Balassone Damian Grace Damian Powell Damien Cremean Damien Freeman Damien Freeman Damien Richardson Damon Moon Dan Guenther Dan Ryan Dan Ryan Dana Gioia Dana Rice Daniel Hannan Daniel Hart Daniel J. Flynn Daniel J. Mahoney Daniel Johnson Daniel O’Neil Daniel Pipes Daniel Searson Daniel Tammet Daniel Wild Darby Hudson Darrel Killen Darren Nelson & Anthony Dillon Darren Stein Darryl Budge Daryl McCann Daryl McCann Dave Pellowe David A. Eisenberg David Alexander David Archibald David Askew David Atkinson David Barnett David Barratt David Barrett David Barton David Barton David Barton and Roger Franklin David Bennett David Bird David Blackall David Burchall David Chandler David Clark David Claydon David Cusworth David Daintree David Daintree David Dalton David Evans David Evans & Bob Carter David F. Smith David F. Smith, Anne Henderson, Des Moore, Neil Mc David Flint David Flint and Jai Martinkovits David Free David Frost David Fulton David Furse-Roberts David Goodhart David Green David Hanna David Harrison David Henderson David Hush David Hutcheson David Isaacson David Jeffery David Joss David Kelly David Kemp David Kemper David King David King David Leach David Lee David Lumsden David Martin Jones David Martin Jones & Lana Starkey David Martin Jones & Nicholas Khoo David Mason David Mason-Jones David Mason-Jones David McIlwain David Mitchell David Morley David Overton David Packham David Packham and Tim Malseed David Phillips David Pollard David Povey David Prescott-Steed David Price David Pryce-Jones David R. Crowden David Rees David S. Bird David S. Oderberg David Scro David Shteinman David Smallbone David Smith David Smith, James Litchfield, David Daintree, Hec David Stockwell David Stove David Suissa David van Gend David W. Lovell David Walker David Ward David Wetherell David Young, John Stone, Colin Pratt, Hal G.P. Col Debasish Mishra Debbie Buller Debbie Garrett Debbie Lim Debra Kuss Decima Wraxall Declan Mansfield Deepak Lal Deidre Clary and Fiona Mueller Deidre Clary and Fiona Mueller Deirdre Therese Little Denis White Denise O’Hagan Dennis Boothby Dennis Gibson Dennis Haskell Dennis Jensen Dennis Lee Dennis Morton Dennis O'Keeffe Dennis O’Driscoll Derek Fenton Derek Parker Derek Turner Derek Wright Des Moore Des Moore & Tom Quirk Des Moore and Case Smit Des Moore, A. (Len) Puglisi, Murray Mitchell, Jame Desmond K. O'Toole Desmond O'Grady Devika Brendon Diana Figgis Diana Richardson Dick Adams, MP Dikra Ridha Dilantha Gunawardana Dina Rubina Doctor X Dominic Perrottet Don Aitkin Donald J. Trump Donald Mackay Donald Richardson Donald Wheelock Donat Gallagher Donna Laframboise Donna M. Doug Brown Doug Buckley Doug Hurst Doug Morrissey Douglas Brown Douglas Bulloch Douglas Drummond Douglas Fry Douglas Hassall Douglas Hassall Douglas Murray Dr Augusto Zimmermann Dr Michael Crawford Dr Onan McBroadsheet Dr Robert M. Carter Dr Tess Lawrie PhD & Dr Edmund Fordham PhD Dr. Murray Walters & Dr. Alston Unwin Dudley Horscroft Duncan Evans Duncan McIntyre Duncan Richardson Dyson Heydon Dyson Heydon E.A. Gleeson E.R. Drabik Ed Coletti Eddie Gibbons Edith Speers Eduardo de la Fuente Education Edward Cranswick Edward Neeman Edwin Dyga Einar Vikingur Elisa C. Martinez Salazar Elisabeth Taylor Elisabeth Taylor Elisabeth Wentworth Elizabeth Allen Elizabeth Beare Elizabeth Fortescue Elizabeth Lewis Elizabeth McCusker Elizabeth Power Elizabeth Power Elizabeth Smither Émile Troullier Emily Barker Emma Alberici with Roger Franklin Ennio Bodé Enzo Cordello Eric Abetz Eric C. Hendriks Eric Knight Eric Louw Eric Paul Shaffer Eric Zemmour Ethan Redekop Ethan Turner Eugene A Donnini Eugene Alexander Donnini Eugene Schlusser Eva Engleman Evan Williams Evans Campbell F. S. Hespe. Farhan Azad Fatima el Baksheesh-Namatjira Felix Calvino Finn Brooke Flora Smith Francine Rochford Francis Bede Francis McLoughlin Frank Batini Frank Batini Frank Brennan Frank Corso Frank Devine Frank Furedi Frank K. Salter Frank Mack Frank Mount Frank Mount Frank Murphy Frank P. English Frank Pledge Frank Salter Frank Salter Fred Blanks From The Bridge G.F. Adler G.P. Rothery Gabriel Bergmoser Gabriel Donleavy Gabriel Fitzmaurice Gabriel J. Kruis Gabriel Moens Gabriël Moens Gabriël Moens & John McRobert Gabriël Moens & Kashan Pirzada Gabriel Moens and Dejan Hinic Gabriel Moens and John McRobert Gabrielle Lord Gadi Taub Gaetano Carcarello Gale Acuff Garth Paltridge Garth W. Paltridge DSc FAA Gary Allen Gary Christian Gary Clark Gary Furnell Gary Furnell Gary Hotham Gary Johns Gary Johns Gary Johns and Samara McPhedran Gary Scarrabelotti Gavin Atkins Gavin Silbert Gavin Silbert Geert Wilders Geoff Kingston Geoff Newton Geoff Page Geoff Page Geoff Slattery Geoff Walker Geoffrey Allen Geoffrey Blainey Geoffrey Gray Geoffrey Lehmann Geoffrey Lehmann, Peter Farrell & Dick Warburt Geoffrey Luck Geoffrey Luck (and sundry ABC in-house apologists) Geoffrey Luck & Roger Franklin Geoffrey Partington Geoffrey Sherrington Geoffrey Walker George Brandis George Brandis, Stanley Croker, Anthony Sharpe, To George Christensen George Jonas George Pell George Shaw George Thomas George Watson George Weigel Gerald Frost Gerald J. Russello Gerald Mercer Gerald O’Collins Geraldine Massey Gerard Calilhanna Gerard Henderson Gerard Wilson Gerrit J. van der Lingen Geza Jeszenszky Giacomo Sini Gilbert Berdine Giles Auty Gina Rinehart Gisela Sophia Nittel Glenn Fahey Glenn McPherson Gloria Chalk Gordon Adler Gordon Morrison Graeme Haycroft Graeme Hetherington Graham Allison Graham Bradley Graham Culver Graham Cunningham Graham Hryce Graham Joyner Graham P. Cooney Graham Pinn Graham Pinn Graham Pinn and Roger Franklin Graham Sheil Graham Walker Graham Woods Greg Buchanan, Geoff Holt, Bill James, George Niko Greg Chapman Greg Chapman Greg Johns Greg Lindsay Greg Melleuish Greg Price Greg Smith Greg Solomons Greg Walsh Greg Williams Gregory Dally Gregory Haines Gregory Melleuish Gregory Rose and Lewi Stone Gregory Solomons Guy Green Guy Sorman Gwyneth Lewis György Schöpflin H.A. Willis Hal Colebatch Hal Colebatch, John Hill, Suzanne Edgar, Susan Rei Hal G.P. Colebatch Hal G.P. Colebatch, Frank Pulsford, Nigel Davies, Hannah Flaxon Harold Callaghan Harry Blutstein Harry Cummins Harry Cummins Harry G. Gelber Harry Gelber Harry Sanderson Harry Stein Hazel Hall Helen Andrews Helen Dale Helen Hughes Helen Hughes & Mark Hughes Helen J. Wilson, Suzanne Edgar, Robyn Williams, Ph Helen Lyne Helen Moore Helen Thurloe Helene Castles Henry Ergas Henry Ergas Henry Lawson Henry Olsen Herman Roborgh Hilary L. Rubinstein Hilary Weisser Hira Jungkow Holly Day Howard Dewhirst Howard Thomas Brady Howard Tweedie Hugh Canham Hugh Crago Hugh Morgan I. Marie Bashir II. Noel Hush I.D.F. Callinan Iain Bamforth Iain Twiddy Ian C. Smith Ian Callinan Ian Castles Ian George Ian Keast Ian Kennedy Williams Ian le Tourneau Ian Marsh Ian McFadyen Ian McFayden Ian Mitchell Ian Mott Ian Munro-Meeks Ian Plimer Ian Reid Ian Shircore Ian Stewart Ian Tregenza Ida Lichter Igor Pomerantsev Immanuel Suttner Imogen Wall Ingrid van Beek, Robert McLaughlin, David Elder, P Irene Petros Irina Dunn Isi Unikowski Ivan Head Ivan Head J. B. Lawrence J. C. Gopal J. Goddard J. J. Spigelman J. T. Mitchell J.A. Cooper J.A.H. Brown, David F. Smith, Geoffrey Luck, Micha J.B. Paul J.B. Paul J.C. Cole J.D. Vance J.F. Beck J.F. Hargrave J.M. Coetzee J.R. McRae J.R. Nethercote J.S. Westbrook J.T. Mitchell Jack Allen Jack Hutchinson Jack Hutchinson Jack Mitchell Jack Opie Jack Robertson Jack Sexton Jack Snelling Jack Weatherall Jacob Dunstan Jacob Watts Jacqueline Karp Jacqui Wise Jade Pisani Jafar Jalili Jake Bilardi Jake Dennis Jake Hart Jake Roseman James Ackhurst James Aitchison James Allan James Allan James Allan and Mirko Bagaric James B.T. McCaughan James Bowen James Bowman James Brookes James C. Bennett James Curran James Delingpole James Falk James Franklin James Franklin and Tony Abbott James Grant James Guest James Hoggett James Jeffery James Kierstead James Lucas James McCann James Muirhead James Murray James Orrock James Paterson James Philips James Spigelman James Thomson James Walton Jameson Dunne Jamie Derkenne Jamie Grant Jamie Q. Roberts Jan Cooper Jan Davies Jan Heller Levi Jan Hutchison Jan Owen Jane Blanchard Jane Doe Jane Downing Jane Fraser Jane Mueller Jane O'Sullivan Jane Petkovic Jane Petkovic and Raymond Burns Jane Sutton Jane Williams Janet Thompson Janette Parr Janice Paull Janine Fraser January February 2012 Jared Olar Jarrod Brady Jason Beale Jason Brennan Jason Landless Jason Monaghan Jason Morgan Jason Soon Jasper Burgess Jasper Glen Javier Milei Javier Milei Jay Lehr Jean Bou Jean Frances Jean King Jean Thornton Jeff Guess Jeff Kennett Jeff Sparrow Jeffrey A Singer Jeffrey Burghauser Jeffrey Goldsworthy Jeffrey Grey, Peter Stanley, John Dorman, Murray M Jeffrey Lord Jeffrey R Grimshaw Jemal Sharah Jennifer Compton Jennifer Gribble Jennifer Gribble Jennifer Marohasy Jennifer Oriel Jenny Blackford Jenny Stewart Jeremy Bartholomeusz Jeremy Black Jeremy Bray Jeremy Buxton Jeremy Gadd Jeremy Lockhart Nelson Jeremy Nelson Jeremy Sammut Jessie Bate Jill Evans Jill Ireland Jillian Brannock Jillian Pattinson Jillian Schedneck Jillian Schuller Jim Allan Jim Campbell Jim Carlton Jim Carruth Jim Daly Jim Fryar Jim Molan Jim Woods Jo McInerney Jo Nova Joan Webster OAM Joanna Bell Joanna Beresford Joanna Hackett Joanne Nova João Carlos Espada Jodie Hollander Joe Dolce Joe Lane Joe Stella Joel Crotty Joel Ephraims Joel Hodge Johm Izzard John A. Moses John Anderson John Badgery John Besemeres John Bigelow John Bloom John Bova John Bowers John Bryson John Burgess John Burnheim John Cameron John Cameron and David Packham John Carey John Carroll John Chaumont John Clarke John Daicopoulos John Dawson John de Meyrick John Dennis John Derbyshire John Donovan John Dorroh John Duncan John Ellison Davies John Elsegood John Eppel John Finnis John Foley John Fonte John Foulcher John Fowke John Fraser John Gava John Glynn John Goodman John Greening John Griffin John Happs John Henningham John Henningham John Hirst John Howard John Humphreys John Hyde John Izzard John J. Furedy and Christine Furedy John J. Prineas John Kinder John Kunkel John Lloyd John MacRitchie John McCallum John McConnell John McDonald John McDonnell John McLean John McLean and the BoM John McRobert & Gabriël Moens John Mikkelsen John Montgomery John Moses John Muscat John Nicol John O’Connor John O’Sullivan John Owen John P. Bryson John Prineas John R. Rossiter John Reid John Ridland John Rigo John Ruddick John Russell John Saul John Scahill John Sheng/Ouyang Yu John Singer John Singer John Slater John Slee John Snooke John Speer John Spooner John Stephenson John Stone John Stubley John Styles John Sumner John Thatcher John Upton John West John Wheelahan John Whitehall John Whitehall John Whitford John Whitworth John Williams John Wong John Zerilli John Zmirak John-Paul McCarthy Jon Bishop Jonathan Baldry Jonathan Cole Jonathan Foreman Jonathan Grace Jonathan Huston Jonathan J. Pincus, Jack Robertson, Hal Colebatch Jonathan Pincus Jonathan Sacks Jonathan Sumption Jordan Grantham Jorge González-Gallarza Hernández Joseph Lane Joseph O’Donoghue Joseph Poprzeczny Joseph Power Josh Hawley Joshua Shrubb Joy Heath Joy Reid Joyce Freedman Jude Aquilina Judith Bassett Judith Curry Judy Johnson Judy Stove Judy Stove-Wilson Julia Magnet Julia Patrick Julian Croft Julian Leeser Julian McGauran Julian O’Dea Julian Woods Julie Novak Julie Sladden July-August, 2011 June 2012 June, 2011 Justene Musin Justin Campbell Justin Jefferson Justin Kelly K. M. Preston K.Cairns K.M. Preston Kamal Weerakoon Kara Thomas Karen Blaylock Karen Throssell Karin Petersen-Schaefer Karl Schmude Katherine Gallagher Katherine Spadaro Kathryn Rae Kathy Duggan Kathy Gyngell Kathy Hunt Kathy Russell Katrina Gulliver Katrina Naomi Kay Cairns Kayt Davies Keayr Braxton Keith McKenry Keith Russell Keith Windschuttle Keith Windschuttle and Brian Galligan Keith Windschuttle and Tim Gillin Kel Richards Kel Richards Ken Gannicott Ken Haley Ken Handley Ken Harney Ken Phillips Ken Simpson Ken Stone Kenneth Harkness Kenneth Maddock Kenneth Minogue Kenneth Slessor Kenneth Steven Kerry Conway Kerry Popplewell Kerry Tilbrook Kerryn Pholi Kesten Green Kevin Andrews Kevin Bennett Kevin Cahill Kevin Cowdall Kevin D. Williamson Kevin Densley Kevin Donnelly Kevin Donnelly Kevin Hallewell Kevin Hart Kevin McGovern Kevin Myers Kevin Myers Kieran Morris Kieren Koala Kim Core Kim Morrison Kirsten Due Kitty Donnelly Know-it-Poet Knute Skinner Konstantin Kanelleas Kris Hemensley Kristen Roberts Kyle Orton L W Maher L.S. Bergin Laila Nawsheen Lana Starkey Lance Eccles, David Elder, Bill James, Peter Gerar Laura Buzo Laurence Karacsony Laurence Karacsony Laurence W Maher Laurence W. Maher Laurent Lemasson Laurie Hergenhan Lawrence Burke Lawrence Cross Lawrence Qummou Leah Hobson Lee Shrubb Leila Lois Lennie Lower Leo Maglen Leo Maglen Leo Marzi Leon Shann Leon Trainor Leonie Kramer Les Louis Les Murray Les Wicks Lesley Boland Leslie Kemeny Leslie Stein Leslie Stein Letters Letters to the Editor Lewi Stone and Gregory Rose Libby Sommer Lillian Andrews Lin van Hek Lincoln Wright Linda Reynolds Lindsay Boyd Lindsay Brien Lindsay Foyle Lindsay Urwin Lionel Farrell Lionel Reynolds Lisa Jacobson Liz McQuilkin Lloyd Reinhardt Loretta Polson Lorraine Black Lorraine Finlay Lorraine McGuigan Louis Cipher (aka Peter Smith) Louis Groarke Louis Groarke Louise Bremner Lucas McLennan Lucas Smith Lucas Smith Lucinda Moon Lucinda Spier Lucy K. Hahn Luke Maffeo Luke Powell Luke Powell Luke Stegemann Luke Torrisi Luke Whitington lungfish LW Maher Lyle Dunne Lyn Ashcroft Lyn Ashcroft Lyn Wesley Lynette Reilly: M. A. Casey M. L. R. Smith M.A. Casey M.A. Goldrick M.B. McLatchey M.G. Michael & Katina Michael M.T. O’Byrne Madeleine Rose Jones Mae Vanderschaar Maggie Wallis Magnus O’Mallon Mahammad Kalifa Al–Kalifa More-Kalifas Mal Wedd Malcolm Colless Malcolm Forbes Malcolm Gillies Malcolm Gillies Malcolm H. Brandon Malcolm Hugh Patterson Malcolm King Malcolm McCusker Malcolm Saunders Malcolm Turnbull Malcolm Voyce malcolm wedd Malcom Colless Marc Hendrickx Marc Hendrickx Marc Hendrickx & Roger Franklin Marc Janssen Marc Marusic March 2012 March, 2011 Marco Paoletti Marco Wollert Marcus Ten Low Margaret Barbalet Margaret Bradstock Margaret Cameron-Ash Margaret Harvey Margot Pearce Margot Pearce Maria Schneider Marie Daouda Marie Gleeson Marie Hansen Fels Marie Hansen Fels & David Clark Marie Hansen Fels with David Clark and Rene White Marie Muldoon Marilyn Peck Marion Lucy Marjon Mossammaparast Marjorie Howard Johnson Mark Beltz Mark Durie Mark Durie Mark E.T. Horn & Peter R. Proudfoot Mark Edgecombe Mark Evans Mark Fowler Mark Gregory Mark Henderson Mark Horn & Peter Proudfoot Mark Imisides Mark Latham Mark Lawson Mark Lewis Mark Lopez Mark McGinness Mark McGinness Mark Moyar Mark O’Connor Mark Powell Mark Powell Mark Poynter Mark Sneddon & Pete Mulherin Mark Steyn Mark Steyn Mark W. Jones Mark Walland Martin Auster Martin Bennett Martin Davies Martin H. Samuel Martin Hutchinson Martin Jones & Michael L.R. Smith Martin Lynch Martin R. Johnson Martin Samuel Mary Cresswell Mary Jones Mary Kissel Mary Makofske Mary-Ellen Turbet Maryanne Hannan Marye Trim Mathew White Matt Gaughwin Matt Hayden Matt Ridley Matt Thompson Matthew Goldrick Matthew Green Matthew Heeney Matthew Lesh Matthew Maddern Matthew O'Sullivan Matthew Omolesky Matthew Walther Matthew White Matthew White Matti Friedman Maurice Nestor Maurice Newman Max Bennett and Jeff Reimers Max Rheese Max Ryan Max Teichmann Maxim Nikiforov May 2102 May, 2011 Mchael Warren Davis Meg Courtney Hawke Megan Cartwright Melanie Phillips Melinda Smith Melinda Tankard Reist Melissa Ahart Melissa Coburn Melvin Schut Merrie Cave Merv Bendle Merve Bendle Mervyn Bendle Mervyn Bendle Mervyn F Bendle Mervyn F. Bendle Mervyn F. Bendle PhD Mervyn F. Bendle, John Dawson, Bill Muehlenberg, J Mervyn F. Bendle, Trevor Sykes, Howard Hutchins,Su Michael Ackland Michael Ackland Michael Angwin Michael Asten Michael Ayling Michael Baume Michael Bounds Michael Buhagiar Michael Byrne Michael Collins Michael Connor Michael Cook Michael Cook, Joseph Parkinson, Anna Porter, John Michael Copeman Michael Cotter Michael Crane Michael Cross Michael Danby Michael Davis Michael de Percy Michael Detmold Michael Duffy Michael Dunn Michael Easson Michael Easson Michael Evans Michael Evans Michael Fogarty Michael Gala Michael Galak Michael Galak Michael George Smith Michael Giffen Michael Giffi n Michael Giffin Michael Giffin Michael Green Michael Haig Michael Halliwell Michael J. Galak Michael Jensen Michael Kile Michael Kowalik Michael Lawriwsky Michael Lawriwsky Michael Mansell Michael McAuley Michael Mintrom Michael Morrissey Michael O'Connor, Dawn Moss, James Allan, Murray M Michael O’Connor Michael Olsen Michael P. Jensen Michael Passaniti Michael Roe Michael Sariban Michael Scammell Michael Sharkey Michael Shellenberger Michael Thorley Michael Walsh Michael Warby Michael Warren Davis Michael Wilding Michael Williamson Michael Witts Michele Fermanis-Winward Mick Ringiari Mihail Evans Mike Alder Mike Carlson Mike Cooper Mike Fogarty Miklos Radnoti, translated by John Ridland and Pau Milton Cockburn Milton Cockburn Milton Osborne Milton P. Ehrlich Mira Crouch Mirand Devine Miranda Devine Miranda Siemienowicz Miriam Dixson Misha Saul Mishka Gora Mitch Browne Mocco Wollert Moira Deeming Molly Chong Molly J. Sasson Monica Wilkie Morris Lurie Moya Pacey Murray Mitchell Murray Walters Murray Waters Myles Harris Myles Parish Myra Schneider Myron Ebell N.A. Haug N.S. Lyons Nan Ollerenshaw Nana Ollerenshaw Nathan Livingstone Nathaniel Calhoun Nathaniel Lucas National Review Online Neal Price Neil Burrows and Rick Sneeuwjagt Neil McDonald Nelson Rufatt Nicholas Hasluck Nicholas Hasluck Nicholas T. Arndt Nicholas T. Parsons Nicholas Tam Nicholas Tonti-Filippini Nick Cater Nick Cater Nick Gibb Nick Lloyd Nick McGowan Nick Turner Nicola Knox Nicole James Nidhi Agrawal Nigel Biggar Nigel Davies Nigel Freitas Nigel Jackson Nikki Savage (as told to Jim Allan) Nils A. Haug Niro Sivathasan Niro Sivathasan and Duncan Syme Noel Gardner Noel King Noel Pearson Noel Weeks Noela Shepherd Norm Neill November 2011 November, 2011 October, 2011 Ojel L. Rodriguez Burgos Oliver Burckhardt Oliver Friendship Oliver Hartwich Oliver Hartwich Olivia Byard Olivier Burckhardt Olwyn Conrau Ona Grossnickle Oscar Clarke Oscar Godsell Otto Nebbler Our Correspondent Ouyang Yu Owen Harries P. Brown P.D. Jonson P.F. O’Donohue P.J. Murphy P.P. McGuinness Padraic P. McGuinness Pamela Leach Paolo Bertolani/Jennifer Compton Paolo Totaro Pascale Petit Pastor de Lasala Pat Beale Pat Clinton Patricia Anderson Patricia Azarias Patricia Rolfe Patricia Shaw Patrick Coyne Patrick Holland Patrick J. Byrne Patrick McAuley Patrick McCauley Patrick McCauley Patrick Morgan Patrick Morgan Patrick Parkinson Patrick Walsh Paul Amos, David Bird, Kenneth Barnes, Ken Harknes Paul Blake Paul Brooke Paul Bussan Paul Catalanotto Paul Chandler Paul Collits Paul Collits Paul Connolly Paul de Serville Paul Dickey Paul Dolphin Paul Fenton, Murray Mitchell, Colin Pratt, Adam Bo Paul Fraser Paul G. E. Albrecht Paul Goard Paul Greguric Paul Grover Paul J. Greguric Paul Kane Paul Krause Paul Lake Paul Mabarrack Paul Mitchell Paul Monk Paul Monk Paul Monk, Roger Nairn, Ray Evans, Bill James,Mich Paul Morrissey Paul Nicholls Paul Oates Paul Oslington Paul Prociv Paul Raffaele Paul Read Paul Stenhouse Paul Sturdee Paul Thomas Paul Williams Paul Williamson Paula Jones Pauline Conolly Pauline Farley Peach Klimkiewicz Penelope Nelson Peregrine Blake Persimmon Pete Mulherin Peter Arnold Peter Bakovski Peter Baldwin Peter Barclay Peter Barry Peter Brun Peter Brune Peter C. Grundy Peter Coghill Peter Coleman Peter Costello Peter Craven Peter Day Peter Fenwick Peter Fenwick Peter Gilet Peter Goldsworthy Peter Gross Peter H. Edwards Peter Hannan Peter Hansen Peter Hayes Peter Howson Peter J. Elliott Peter Jackson Peter Jeffrey Peter Jennings Peter Kocan Peter Kurti Peter L. Swan Peter Lang Peter Lavac Peter Mulherin Peter Mulholland Peter Murphy Peter Norris Peter O'Brien Peter O'Brien & Roger Franklin Peter Phelps Peter Pierce Peter Proudfoot, Kerry Boulton, Frank Pulsford, Ch Peter Purcell Peter Purcell Peter R. Clyne Peter Rees Peter Ridd Peter Rowe Peter Rutherford Peter Ryan Peter Samuel Peter Saunders Peter Sekuless & Tony O’Leary Peter Sellick Peter Shergold Peter Skrzynecki Peter Smith Peter Stiles Peter Tiernan Peter Vallee Peter Wales Peter Ward Peter West Peter Wilkins Phil Ainsworth & Alistair Pope Phil Brown Phil Burcham Phil Shannon Phil Shannon Philip Ayres Philip Ayres, Roy Williams, Alan Barcan, Bern Bren Philip Burcham Philip Drew Philip Emery Philip Hayward Philip Hopkins Philip Martin Philip Plickert Philip Plickert Philip Rintoul Philipp Ammon Philippa Martyr Phillip Hall Phillip Hilton Phillip M. Altman Phillip Turnbull Phillipa Martyr PHILTON Piers Akerman Pippa Kay PJ Murphy Professor Bunyip QoL Editor Quadrant Quadrant Editors Quadrant Online Contributors Quadrant Verse Quentin Dempster R L Swihart R.B. Chenevix Trench R.J. Armstrong R.J. Conlon R.J. Smith R.J. Stove R.N. Callander R.N. Callander R.W. Johnson Rachael Kohn Rachael Kohn Rachel Riley Rafe Champion Rafe Champion Rafiq Mahmood Rambling Possession Ranald & Airlie Moore Ranald Moore Ranald Moore, Jack Sexton, Claudio Veliz, Ian Jone Ray Evans Ray Evans & Tom Quirk Ray Evans and Tom Quirk Ray Evans, Colin Balmer, Tony Abbott Ray Evans, Wilson Tuckey, Michael Kile, Edward Dra Ray Penny Raymond Burns Raymond Burns Raymond Ibrahim Raymond Shon & Stephanie Shon Rayyar Marron Razeen Sally RB Lonetree Reagan Upshaw Rebecca Weisser Reg Naulty Remy Chadwick Reuben Kirkham Rex Ahdar Rex Pollard Rhett Talley Rhoderick McNeill Ricardo Pau-Llosa Riccardo Bosi Richard Allsop Richard Alston Richard Baker Richard Castles Richard Fernandez Richard Forrest Richard Gate Richard Gray Richard Harrison & Frank Salter Richard Laidlaw Richard Lansdown Richard Martin Richard Mawrey Richard S. Lindzen Richard Stanton Richard Waddell Richard White, Tony Hassall, Ed Killesteyn, Stephe Rinzen Widjaja RJ Stove Road Scholar Blog Rob Foot Rob Long Rob Nugent Robbie Coburn Robert Andrews Robert Carter Robert Clancy Robert Conquest Robert Constantine Robert Darby Robert Darroch Robert Edmonds Robert Ellison Robert Frenkel Robert Gray Robert Handicott Robert Handicott Robert Hill Robert Hirschfield Robert I. Ellison Robert Kaplan Robert Lewis Robert M Kaplan Robert M. Carter Robert M. Kaplan Robert M. Steley Robert McLaughlin Robert Menzies Robert Mezey Robert Murray Robert Rothman Robert Service Robert Solomon Robert Warburton Robert Wargas Robert Wood Robin Barclay Robin Norling Robin Teese Robyn Lance Robyn O’Sullivan Robyn Rowland Rocco Loiacono Rod Dreher Rod McGarvie Rod Moran Rod Stuart Rod Usher Rodney Purvis Roger Beam Roger Brown Roger Franklin Roger Franklin & Tony Thomas Roger G McDonald Roger G McDonald: Roger G. McDonald Roger Karge Roger Karge Roger Kimball Roger Kimball Roger Neill Roger Partridge Roger Pescott and Marita Punshon Roger Sandall Roger Scruton Roger Underwood Roger Underwood Roger Underwood & Athol Hodgson AM Rohan Buettel Rohan McHugh Ron Boswell Ron Cox Ron Kitching Ron Merkel Ron Petty Ron Pike Ron Pike Ron Pretty Ron Rash Ron Rodgers Ron Taft Ron Wilkins Ron Wilson Rory Shiner Rosaleen Smyth Rosanna Licari Roslyn Ross Ross Babbage Ross Barham Ross Donlon Ross Fitzgerald Ross Fitzgerald Ross Fitzgerald & Graham Irvine Ross Fitzgerald & Ian McFadyen Ross Fitzgerald & Stephen Holt Ross Fitzgerald and Stephen Holt Ross Jackson Ross Martin Ross Murdoch Martin Ross Terrill Ross Terrill and Frank Mount Ross Twigg Rowan Callick Rowan Dean Rowena Wiseman Roy Duffield Roy W. Gotaas Roy Williams Royston Mitchell Rudolf Vyborny Rupert Darwall Rupert Guenther Russell Erwin Russell Forster Russell Trood Ruth Blakeney Ruth Dudley Edwards Ryan Anderson Ryszard Legutko S. Walker S.T. Karnick Sally Sara Salvatore Babones Sam Abotomey Sam Roggeveen Samantha Grosser Samer Abbas Samuel Chamberlain Samuel J. Samuel Mullins Samuel Strathman Sandra Jobson Darroch Sara Miller Sarah Mandie Sarah Penwarden Sarah Tiffen Satya Marar Satyajeet Marar Saul Kelly Saxby Pridmore Scot Braithwaite Scott A. McConnell Scott Buchanan Scott Kelly Scott Monk Scott Morrison Scott Prasser Scotus Viato Seamus Cole Sean Beckett Sean Haylock Sean Jacobs Sean Kelly Sean Masters Sean McGlynn Sean O’Callaghan Sean O’Leary Sean Wayman Sean Wayman Sean Welsh Sebastian Schloessingk Sebastian Tombs Selwyn Parker Senator James McGrath September 2012 September, 2011 Sev Sternhell Sever Sternhell Shan Charlesworth Shane McCauley Shane W. Satterley Sharon Foulkes Sharon Gould Sharon Olds Shelley Gare Sheryl Persson Sheryl Perssons Shimon Cowen Shimon Cowen and Michael Kowalik Shirley Apthorp Shlomo Shnotvasser Shreya Sen Simon Caterson Simon Collins Simon Collins Simon Haines Simon Kennedy Simon Kennedy Simon Molloy Simon P. Kennedy Simon Petch Simone Richardson Sinclair Davidson Sir David Smith Solveig Foss someone called \"Tom\" Sonia Mycak Sophia Nugent-Siegal Sophie Masson Stan Masters Stan McGlade Stanley J. Solomon Steele Rudd Stefan Molyneux Stephanie Bastiaan Stephanie Forrest Stephanie Jarrett Stephen Beckett Stephen Brock Stephen Buckle Stephen Buetow & Kira Baccal Stephen Chavura Stephen Corones Stephen Edgar Stephen Gilfedder Stephen Goldrick Stephen H. Balch Stephen Holt Stephen Holt Stephen Mason Stephen McInerney Stephen Murphy Stephen Orr Stephen Quinn Stephen Sewell Stephen Sewell Stephen Tucker Stephen Wilks Steve Brock Steve Cox Steve Etherington Steve Isham Steve Kates Steve Kates and James Allan Steve Woodman Steven Kates Steven Schwartz Steven Schwartz Steven Tucker Stewart Justman Stuart Lindsay Stuart Wood Subscriber X Sue Brennan Sue Jones Susan Adams Susan Bennett Susan Moore Suzannah Rowntree Suzanne Edgar Suzanne Edgar, H.A. Willis, Donat Gallagher, Geoff Suzanne Edgar, L. Peter Ryan, Michael O’Connor, Symeon Thompson Tamara Lazaroff Tanner Tanveer Ahmed Tanya Rosecky Tanya Thistleton Tati Sofaris Tati Sofaris Ted Hopkins Ted O’Brien Ted Rule Ted Witham Terry Barnes Terry Beath Terry Dwyer Terry McCrann Terry Persun The New City Theodore Dalrymple Thomas Banks Thomas Banks Christopher Akehurst Gerald J. Russel Thomas Barlow Thomas Sowell Tiggy Johnson Tim Andrews Tim Blair Tim Cannon Tim Casey Tim Curtin Tim Edwards Tim Fab-Eme Tim Loveday Tim Macartney-Snape Tim Montgomerie & Andrew Gamble Tim Murphy Tim Neilson Tim O'Hare Tim O’Brien Tim Train Tim van Gelder Tim Wilms Tim Wilson Timoshenko Aslanides Timothy Cootes Timothy Cootes Timothy Litherland Timothy O'Hare Tina Faulk Tina Kane Titania Scopticos TJ Newton Toby Young Todd Hardy Todd Huizinga Todd Turner Tom Barlow Tom Breen Tom Burkard Tom Burton Tom Coverdale Tom Frame Tom Gallagher Tom Harris Tom Lewis Tom Lewis Tom Minchin Tom Morgan and Andrew Bilinsky with Tom Switzer Tom Quirk Tom Qurik Tom Randolph Tom Switzer Tomasz Zieja Tomaž Šalamun/ Michael Thomas Taren Tony \"Swearing Man\" Thomas Tony Abbot Tony Abbott Tony Abbott Tony Bartlett Tony Cousins Tony Grey Tony Hassall Tony Heller Tony Macken Tony Thomas Tony Winkelman Transcript Trevor Bailey Trevor Kennedy Trevor L. Jordan, Owen Richards, Fred Blanks, Robe Trevor Sykes Trevor Sykes, Deirdre Therese Little, and Hal G.P. Tricia Dearborn Tricia Peak Tristan Heiner Tronn Overend Trudi Tate U. Calderone Ugo Rotellini Ulla Terkelsen and Askold Krushelnycky US State Department Uwe Siemon-Netto Václav Klaus Val Majkus Val Murray Val Yule Valerie Murray Vanessa de Largie Vanessa Proctor Various ARC grant recipients Veronica Winkels Veronika Winkels Very-Anonymous-Scared-to-Stand-up-and-be-Counted-D Vic Jurskis Vic Spandrio Victor Davis Hanson Victor Stepien Victoria Field Victoria Kincaid Victoria Royston Virad Mathur Viscount Monckton of Brenchley Viv Forbes Viva Hammer Vivian Smith Vivian Whiteley Hopkirk W.H. Presley Walter Sofronoff Walter Starck Walter Waverley Wanda Skowronska Wanda Skowronska Wandoo Hollows war memorial Warren Shapiro Wayne Caldow Wayne Strudwick Wayne Strudwick Wendy Videlock Wendy Willemse Wesley J. Du Preez Westminster Commission Will Dallas Brooks Will Fraser William Briggs William Carney William Coleman William D. Rubinstein William Etheridge William Heath William J. Lines William Kininmonth William Kitcher William McGurn William Poulos William Rush William Walker Willie Soon and David R. Legates Wilson Tuckey Wolfgang Kasper work -> home Wortley Clutterbuck Yan Xia Yulia Latynina Zachary Gorman Zeg Zeno Zoe Higgie SubscribetoQuadrant Online Aborigines Academia Africa Album Review America Anti-Semitism ANZAC Architecture Art Arts & Culture Asperities Astringencies Australia Australia Day Books Census China Civilisation Climate Climate Change Colonialism Cookery Covid Crime Culture Defence Demographics Doomed Planet Dublin Letter Economics Editor's Column Editor's Corner Education Energy Entertainment Environment Espionage Europe Fauxborigines Feature Feminism Fiction & Stories Film First Person Fourth Column Free Speech From Our Archives Guest Column Health History Ideas Immigration Insights from Quadrant Islam Israel Keith Windschuttle Language Letters to the Editor Literature Media Memoir Middle East Modern Myths New York Letter New Zealand Nuclear Obituary Opinion Philosophy & Ideas Poem Poetry Politics Public Health QED Quad Rant Quad-Cast Quadrant Music Reflection Religion Review Russia Science Sicktoria Society Sport Story Sweetness & Light Tariffs The Arts The Crown The Law The Left The Middle East The U.S.A. The Universities The Voice Theatre Their ABC Third Column Trade Tribute TV Ukraine Ukraine Letter Voting Whimsy Wokery World 'Asiya' & Gabrielle Lord \"William York\" A Cronulla Mum A Dozen Melbourne Doctors A Modest Local A Victorian Teacher A.G. Evans A.M. Juster A.S. Patric Aaron Ames Aaron Craig Adam Bisits Adam Browne Adam Day Adam L. Darragh Adam LeBor Adam M. Rustowski admin Adrian Nguyen Adrian Williams Adriana McOrdero Adrienne Eberhard Agnes Selby Aidan Coleman Ainu Campbell-Barracks Alamgir Hashmi Alan Barcan Alan Barron Alan Fewster Alan G. Futerman & Walter E. Block Alan Gould Alan Lee Alan Moran Alan Moran Alan Moran and Roger Franklin Alan Oxley Alan R.M. Jones Alan Riach Alan RM Jones Alan RM Jones Alan Saunders Alan Smith Alan Stephens, Murray Mitchell, J.B. Paul Alan Sunderland and Quadrant Online Alan Whelan Alana Kelsall Alasdair Millar Alasdair Millar & co-authors Alastair Spate Alberto Mingardi Alessio Zanelli Alex Hand Alex Lake Alex McDermott Alex Millmow Alex O'Sullivan Alex Robson Alex Stuart Alexander Borojevic Alexander Hatzikalimnios and Augusto Zimmermann Alexander Voltz Alexander Voltz Alexander Voltz Alexander Voltz & Barry Spurr Alison Bevege Alison McNaught Alistair Crooks Alistair Nicholas Alistair Pope Alistair Pope Alister Henskens Allan Gould Allan Johnston Allan Lake Allan Pidgeon Allen Greer Alwyn Karpin Amanda Hemmings Amanda Stoker Amanda Wilson Amit Majmudar Amy Brooke Amy Brooke Anamaria Beligan Andrea Ockerby Andrea Pagliaro Andrew Blyth Andrew Bolt Andrew Botros Andrew Bragg Andrew C Mackinnon Andrew Cusack Andrew Cusack Andrew Errington Andrew Gabriel Andrew Gamble Andrew Glikson Andrew Gutmann Andrew Irvine Andrew Irvine & Stephen Wexler Andrew J. Lowy Andrew James Menken Andrew Kenny Andrew Klavan Andrew L. Urban Andrew Lansdown Andrew Leggett Andrew McBurnie Andrew McGee Andrew McIntyre Andrew Motion Andrew Nikolic Andrew Norton Andrew Paterson Andrew R. Timming Andrew Roberts Andrew Ross Errington Andrew Russell & Lana Starkey Andrew Slattery Andrew Smallman Andrew Smallman Andrew Smith Andrew Stone Andrew Stuttaford Andy Halksworth Andy Kissane Andy Mullins Ang Chin Geok Angela Shanahan Angela Smith Angus Pike Aniello Iannuzzi Anjali Nadaradjane Ann Dix Ann Howard Ann McElhinney and Phelim McAleer Anna Buck Anna Fern Anna McHugh Anna Ratcliff Anna Wierzbicka Anna Zeltzer Anne Applebaum Anne Fairbairn Anne Henderson Anne McCosker Anne Skyvington Anne Twomey Anne Williams Anne-Elisabeth Moutet Anonymous Anthony Bailey Anthony Cappello Anthony Daniels Anthony Daniels & Nikos A. Salingaros Anthony Dillon Anthony Fisher Anthony Graham Anthony J.H. Morris Anthony Lynch Anthony McAdam Anthony McCarthy Anthony Milner Anthony O Hear Anthony O’Hear Anthony Paul Anton Bendarzsevszkij Anton Lang Antonia Newton Antonin Scalia Antony Barraclough Antony Carr Antony Carr & Christopher Carr Antony Flew April 2012 April, 2011 Arian Ganjavi Arjun Rajkhowa Art Raiche Aryan Ganjavi Ashley Martin Ashley Morgan-Shae Ashley Mrgan-Shae Ashlley Morgan-Shae Augusto Zimmermann Augusto Zimmermann Augusto Zimmermann & Aramis C. DeBarros Augusto Zimmermann & Gabriël Moens Augusto Zimmermann and Fabio Condeixa Australian Conservative online Autorenkollektiv Averil Drummond Aynsley Kellow B N Oakman B. Collis B.J. Coman B.J. Coman & Evan Jones B.R. Whiting Babette Francis Babette Francis, John Reid, Ken Schultz, Michael W Barbara Fisher Barclay McGain Barend Vlaardingerbroek Baron Alder Barry Brill Barry Gillard Barry Gillard Barry Humphries Barry Leithhead Barry Maley Barry Ninham Barry Peters Barry Poster Barry Spurr Belinda Lopez Ben Bassett Ben Crocker Ben Jellis Ben Meehan Ben Pattison Ben Sharafski Ben-Peter Terpstra Benjamin Crocker Benjamin Jellis Benjamin Marks Benjamin Wilkie Benny Peiser Berislav Maroya Bern Brent Bernadette Belej Bernadette Tobin Bernard d’Abrera Bernard Gaynor Bernard Lane Bernard Levin Bernie Lewin Bernie Power Bert Almon Bert Kelly’s Ghost Bess Nungarrayi Price Best Overend Bettina Arndt Bettina Arndt Bettina Arndt Bev Cains Bill Ackman Bill Arnott Bill Dawes Bill DiPuccio Bill Harcourt Bill Harcourt, Howard Hutchins, Neil James, JohnTw Bill James Bill James, Digby Ricci, Donald G. Runcie, Andrew Bill Leak Bill Martin Bill Muehlenbeg Bill Muehlenberg Bill Rush Bill Wyndham Billy McCarron Biswadarshan Mohanty Bob Bourman Bob Carr Bob Carter Bob Carter & John Spooner Bob Carter and John McLean Bob Carter, Alan Moran & David Evans Bob Carter, David Evans, Stewart Franks & Bill Bob Carter, David Evans, Stewart Franks & Will Bob Carter, David Evans, Stewart Franks, Bill Kini Bob Carter, Willie Soon & William Briggs Bob Catley Bob Day Bob Reece Bob Wright Boy on a bike Brad Jackel Brad Williamson Bradley Voltz Brenda Saunders Brendan Craig Brendan Frain Brendan Nelson Brett Jenik Brett Masters Brian Dethridge Brian Doak Brian Griffiths Brian Hawkins Brian Lessard Brian Pollard Brian Roberts Brian Sully Brian Turner Brian Wimborne Brianna Heseltine Bruce Anderson Bruce Beresford Bruce Beresford Bruce Dawe Bruce Fleming Bruce Grant Bruce Williams Bryan Coleborne Bryan Leyland Bryan Wimborne Bubbles Segall Burchell Wilson By Christopher Akehurst By Daryl McCann By John Whitehall By Martin Lynch By Robert Clancy By Tom Quirk By William Kitcher C.A. Broadribb C.A.R. Hills C.J. Murray C.J. Ryan C.R. McArthur C.R. Penny Caitlin Maling Callum J. Jones Cally Conan-Davies Cameron Fuller Cameron Semmens Cardinal George Pell Carl Bridge Carlos d'Abrera Carlos Roa Carmel Macdonald Grahame Carol Chandler Carol Jenkins Carole Wilkins Caroline Carver caroline cooper Caroline Overington Caroline Smith Glen Carolyn E. Campbell Carolyn Evans Campbell Carolyn Ingvarson Case Smit Cassandra Dickinson Cate Cadell Cath Drake Cath Vidler Catherine Baxendale Catherine Broadstock Catherine Chandler Catherine Parish Cato Seutonius Cato Suetonius Cecilia Morris Chad Swanson Changming Yuan Chanming Yuan Chapman Pincher, Tennent H. Bagley, John L. Wilhel Chapman Pincher, Tennent H. Bagley, John L. Wilhel Charles Bradburne Charles Copeman Charles Smith Charlotte O’Neill Chris Ashton Chris Battle Chris Battle Chris Battle & Keith Windschuttle Chris Berg Chris Berg & Jason Potts Chris Berg and Sinclair Davidson Chris Carr Chris Dynon Chris Harlow Chris Keefer Chris Kenny Chris King Chris Leithner Chris Lewis Chris Rahman Chris Raja Chris S. Friel Chris Sheehan Chris Walder Chrissie Gittins Christian Kerr Christie Davies Christine Hamm Christine Paice Christoph Keller Christopher Akehurst Christopher Akehurst & Anthony Bailey Christopher Akerhurst Christopher Caldwell Christopher Carr Christopher Carr Christopher Carr & Roger Franklin Christopher Collingwood Christopher Croke Christopher Dawson Christopher DeGroot Christopher DeMuth Christopher Essex Christopher Heathcote Christopher Heathcote Christopher Heathcote & Jai Marshall Christopher Heathcote, Ian Osborne, Bern Brent, Ch Christopher Joliffe Christopher Jolliffe Christopher Jolliffe Christopher Koch Christopher Monckton Christopher Nailer Christopher Nance Christopher Palmer Christopher Pearson Christopher Pyne Christopher Raja Christopher Snook Chritopher Akehurst Cian Hussey Ciaran J. Ryan CJ Murray Claire Berlinski Claire Chandler Claire Watson Clare Stride Clarence Caddell Clarence Caddell Claudio Veliz Cliff Ollier Clifford Saunders Clive Hamilton Clive James Clive Kessler Clive Kessler & Sahar Amer Clive S. Kessler Codey Swadling Colin Black Colin Fraser Colin Ian Jeffery Colin Jory Colin Lillie Colin Macleod Collin Jones Conor Ross Conor Ross Conrad Black Constantinos Karavias Corry Macleod Cory Bernardi Court Document Craig Kurtz Craig McArthur Craig Sherborne Craig Wilcox D.M. Armstrong D.P. Fairborn D.S. Martin Daisy Cousens Dale Atrens Damian Balassone Damian Grace Damian Powell Damien Cremean Damien Freeman Damien Freeman Damien Richardson Damon Moon Dan Guenther Dan Ryan Dan Ryan Dana Gioia Dana Rice Daniel Hannan Daniel Hart Daniel J. Flynn Daniel J. Mahoney Daniel Johnson Daniel O’Neil Daniel Pipes Daniel Searson Daniel Tammet Daniel Wild Darby Hudson Darrel Killen Darren Nelson & Anthony Dillon Darren Stein Darryl Budge Daryl McCann Daryl McCann Dave Pellowe David A. Eisenberg David Alexander David Archibald David Askew David Atkinson David Barnett David Barratt David Barrett David Barton David Barton David Barton and Roger Franklin David Bennett David Bird David Blackall David Burchall David Chandler David Clark David Claydon David Cusworth David Daintree David Daintree David Dalton David Evans David Evans & Bob Carter David F. Smith David F. Smith, Anne Henderson, Des Moore, Neil Mc David Flint David Flint and Jai Martinkovits David Free David Frost David Fulton David Furse-Roberts David Goodhart David Green David Hanna David Harrison David Henderson David Hush David Hutcheson David Isaacson David Jeffery David Joss David Kelly David Kemp David Kemper David King David King David Leach David Lee David Lumsden David Martin Jones David Martin Jones & Lana Starkey David Martin Jones & Nicholas Khoo David Mason David Mason-Jones David Mason-Jones David McIlwain David Mitchell David Morley David Overton David Packham David Packham and Tim Malseed David Phillips David Pollard David Povey David Prescott-Steed David Price David Pryce-Jones David R. Crowden David Rees David S. Bird David S. Oderberg David Scro David Shteinman David Smallbone David Smith David Smith, James Litchfield, David Daintree, Hec David Stockwell David Stove David Suissa David van Gend David W. Lovell David Walker David Ward David Wetherell David Young, John Stone, Colin Pratt, Hal G.P. Col Debasish Mishra Debbie Buller Debbie Garrett Debbie Lim Debra Kuss Decima Wraxall Declan Mansfield Deepak Lal Deidre Clary and Fiona Mueller Deidre Clary and Fiona Mueller Deirdre Therese Little Denis White Denise O’Hagan Dennis Boothby Dennis Gibson Dennis Haskell Dennis Jensen Dennis Lee Dennis Morton Dennis O'Keeffe Dennis O’Driscoll Derek Fenton Derek Parker Derek Turner Derek Wright Des Moore Des Moore & Tom Quirk Des Moore and Case Smit Des Moore, A. (Len) Puglisi, Murray Mitchell, Jame Desmond K. O'Toole Desmond O'Grady Devika Brendon Diana Figgis Diana Richardson Dick Adams, MP Dikra Ridha Dilantha Gunawardana Dina Rubina Doctor X Dominic Perrottet Don Aitkin Donald J. Trump Donald Mackay Donald Richardson Donald Wheelock Donat Gallagher Donna Laframboise Donna M. Doug Brown Doug Buckley Doug Hurst Doug Morrissey Douglas Brown Douglas Bulloch Douglas Drummond Douglas Fry Douglas Hassall Douglas Hassall Douglas Murray Dr Augusto Zimmermann Dr Michael Crawford Dr Onan McBroadsheet Dr Robert M. Carter Dr Tess Lawrie PhD & Dr Edmund Fordham PhD Dr. Murray Walters & Dr. Alston Unwin Dudley Horscroft Duncan Evans Duncan McIntyre Duncan Richardson Dyson Heydon Dyson Heydon E.A. Gleeson E.R. Drabik Ed Coletti Eddie Gibbons Edith Speers Eduardo de la Fuente Education Edward Cranswick Edward Neeman Edwin Dyga Einar Vikingur Elisa C. Martinez Salazar Elisabeth Taylor Elisabeth Taylor Elisabeth Wentworth Elizabeth Allen Elizabeth Beare Elizabeth Fortescue Elizabeth Lewis Elizabeth McCusker Elizabeth Power Elizabeth Power Elizabeth Smither Émile Troullier Emily Barker Emma Alberici with Roger Franklin Ennio Bodé Enzo Cordello Eric Abetz Eric C. Hendriks Eric Knight Eric Louw Eric Paul Shaffer Eric Zemmour Ethan Redekop Ethan Turner Eugene A Donnini Eugene Alexander Donnini Eugene Schlusser Eva Engleman Evan Williams Evans Campbell F. S. Hespe. Farhan Azad Fatima el Baksheesh-Namatjira Felix Calvino Finn Brooke Flora Smith Francine Rochford Francis Bede Francis McLoughlin Frank Batini Frank Batini Frank Brennan Frank Corso Frank Devine Frank Furedi Frank K. Salter Frank Mack Frank Mount Frank Mount Frank Murphy Frank P. English Frank Pledge Frank Salter Frank Salter Fred Blanks From The Bridge G.F. Adler G.P. Rothery Gabriel Bergmoser Gabriel Donleavy Gabriel Fitzmaurice Gabriel J. Kruis Gabriel Moens Gabriël Moens Gabriël Moens & John McRobert Gabriël Moens & Kashan Pirzada Gabriel Moens and Dejan Hinic Gabriel Moens and John McRobert Gabrielle Lord Gadi Taub Gaetano Carcarello Gale Acuff Garth Paltridge Garth W. Paltridge DSc FAA Gary Allen Gary Christian Gary Clark Gary Furnell Gary Furnell Gary Hotham Gary Johns Gary Johns Gary Johns and Samara McPhedran Gary Scarrabelotti Gavin Atkins Gavin Silbert Gavin Silbert Geert Wilders Geoff Kingston Geoff Newton Geoff Page Geoff Page Geoff Slattery Geoff Walker Geoffrey Allen Geoffrey Blainey Geoffrey Gray Geoffrey Lehmann Geoffrey Lehmann, Peter Farrell & Dick Warburt Geoffrey Luck Geoffrey Luck (and sundry ABC in-house apologists) Geoffrey Luck & Roger Franklin Geoffrey Partington Geoffrey Sherrington Geoffrey Walker George Brandis George Brandis, Stanley Croker, Anthony Sharpe, To George Christensen George Jonas George Pell George Shaw George Thomas George Watson George Weigel Gerald Frost Gerald J. Russello Gerald Mercer Gerald O’Collins Geraldine Massey Gerard Calilhanna Gerard Henderson Gerard Wilson Gerrit J. van der Lingen Geza Jeszenszky Giacomo Sini Gilbert Berdine Giles Auty Gina Rinehart Gisela Sophia Nittel Glenn Fahey Glenn McPherson Gloria Chalk Gordon Adler Gordon Morrison Graeme Haycroft Graeme Hetherington Graham Allison Graham Bradley Graham Culver Graham Cunningham Graham Hryce Graham Joyner Graham P. Cooney Graham Pinn Graham Pinn Graham Pinn and Roger Franklin Graham Sheil Graham Walker Graham Woods Greg Buchanan, Geoff Holt, Bill James, George Niko Greg Chapman Greg Chapman Greg Johns Greg Lindsay Greg Melleuish Greg Price Greg Smith Greg Solomons Greg Walsh Greg Williams Gregory Dally Gregory Haines Gregory Melleuish Gregory Rose and Lewi Stone Gregory Solomons Guy Green Guy Sorman Gwyneth Lewis György Schöpflin H.A. Willis Hal Colebatch Hal Colebatch, John Hill, Suzanne Edgar, Susan Rei Hal G.P. Colebatch Hal G.P. Colebatch, Frank Pulsford, Nigel Davies, Hannah Flaxon Harold Callaghan Harry Blutstein Harry Cummins Harry Cummins Harry G. Gelber Harry Gelber Harry Sanderson Harry Stein Hazel Hall Helen Andrews Helen Dale Helen Hughes Helen Hughes & Mark Hughes Helen J. Wilson, Suzanne Edgar, Robyn Williams, Ph Helen Lyne Helen Moore Helen Thurloe Helene Castles Henry Ergas Henry Ergas Henry Lawson Henry Olsen Herman Roborgh Hilary L. Rubinstein Hilary Weisser Hira Jungkow Holly Day Howard Dewhirst Howard Thomas Brady Howard Tweedie Hugh Canham Hugh Crago Hugh Morgan I. Marie Bashir II. Noel Hush I.D.F. Callinan Iain Bamforth Iain Twiddy Ian C. Smith Ian Callinan Ian Castles Ian George Ian Keast Ian Kennedy Williams Ian le Tourneau Ian Marsh Ian McFadyen Ian McFayden Ian Mitchell Ian Mott Ian Munro-Meeks Ian Plimer Ian Reid Ian Shircore Ian Stewart Ian Tregenza Ida Lichter Igor Pomerantsev Immanuel Suttner Imogen Wall Ingrid van Beek, Robert McLaughlin, David Elder, P Irene Petros Irina Dunn Isi Unikowski Ivan Head Ivan Head J. B. Lawrence J. C. Gopal J. Goddard J. J. Spigelman J. T. Mitchell J.A. Cooper J.A.H. Brown, David F. Smith, Geoffrey Luck, Micha J.B. Paul J.B. Paul J.C. Cole J.D. Vance J.F. Beck J.F. Hargrave J.M. Coetzee J.R. McRae J.R. Nethercote J.S. Westbrook J.T. Mitchell Jack Allen Jack Hutchinson Jack Hutchinson Jack Mitchell Jack Opie Jack Robertson Jack Sexton Jack Snelling Jack Weatherall Jacob Dunstan Jacob Watts Jacqueline Karp Jacqui Wise Jade Pisani Jafar Jalili Jake Bilardi Jake Dennis Jake Hart Jake Roseman James Ackhurst James Aitchison James Allan James Allan James Allan and Mirko Bagaric James B.T. McCaughan James Bowen James Bowman James Brookes James C. Bennett James Curran James Delingpole James Falk James Franklin James Franklin and Tony Abbott James Grant James Guest James Hoggett James Jeffery James Kierstead James Lucas James McCann James Muirhead James Murray James Orrock James Paterson James Philips James Spigelman James Thomson James Walton Jameson Dunne Jamie Derkenne Jamie Grant Jamie Q. Roberts Jan Cooper Jan Davies Jan Heller Levi Jan Hutchison Jan Owen Jane Blanchard Jane Doe Jane Downing Jane Fraser Jane Mueller Jane O'Sullivan Jane Petkovic Jane Petkovic and Raymond Burns Jane Sutton Jane Williams Janet Thompson Janette Parr Janice Paull Janine Fraser January February 2012 Jared Olar Jarrod Brady Jason Beale Jason Brennan Jason Landless Jason Monaghan Jason Morgan Jason Soon Jasper Burgess Jasper Glen Javier Milei Javier Milei Jay Lehr Jean Bou Jean Frances Jean King Jean Thornton Jeff Guess Jeff Kennett Jeff Sparrow Jeffrey A Singer Jeffrey Burghauser Jeffrey Goldsworthy Jeffrey Grey, Peter Stanley, John Dorman, Murray M Jeffrey Lord Jeffrey R Grimshaw Jemal Sharah Jennifer Compton Jennifer Gribble Jennifer Gribble Jennifer Marohasy Jennifer Oriel Jenny Blackford Jenny Stewart Jeremy Bartholomeusz Jeremy Black Jeremy Bray Jeremy Buxton Jeremy Gadd Jeremy Lockhart Nelson Jeremy Nelson Jeremy Sammut Jessie Bate Jill Evans Jill Ireland Jillian Brannock Jillian Pattinson Jillian Schedneck Jillian Schuller Jim Allan Jim Campbell Jim Carlton Jim Carruth Jim Daly Jim Fryar Jim Molan Jim Woods Jo McInerney Jo Nova Joan Webster OAM Joanna Bell Joanna Beresford Joanna Hackett Joanne Nova João Carlos Espada Jodie Hollander Joe Dolce Joe Lane Joe Stella Joel Crotty Joel Ephraims Joel Hodge Johm Izzard John A. Moses John Anderson John Badgery John Besemeres John Bigelow John Bloom John Bova John Bowers John Bryson John Burgess John Burnheim John Cameron John Cameron and David Packham John Carey John Carroll John Chaumont John Clarke John Daicopoulos John Dawson John de Meyrick John Dennis John Derbyshire John Donovan John Dorroh John Duncan John Ellison Davies John Elsegood John Eppel John Finnis John Foley John Fonte John Foulcher John Fowke John Fraser John Gava John Glynn John Goodman John Greening John Griffin John Happs John Henningham John Henningham John Hirst John Howard John Humphreys John Hyde John Izzard John J. Furedy and Christine Furedy John J. Prineas John Kinder John Kunkel John Lloyd John MacRitchie John McCallum John McConnell John McDonald John McDonnell John McLean John McLean and the BoM John McRobert & Gabriël Moens John Mikkelsen John Montgomery John Moses John Muscat John Nicol John O’Connor John O’Sullivan John Owen John P. Bryson John Prineas John R. Rossiter John Reid John Ridland John Rigo John Ruddick John Russell John Saul John Scahill John Sheng/Ouyang Yu John Singer John Singer John Slater John Slee John Snooke John Speer John Spooner John Stephenson John Stone John Stubley John Styles John Sumner John Thatcher John Upton John West John Wheelahan John Whitehall John Whitehall John Whitford John Whitworth John Williams John Wong John Zerilli John Zmirak John-Paul McCarthy Jon Bishop Jonathan Baldry Jonathan Cole Jonathan Foreman Jonathan Grace Jonathan Huston Jonathan J. Pincus, Jack Robertson, Hal Colebatch Jonathan Pincus Jonathan Sacks Jonathan Sumption Jordan Grantham Jorge González-Gallarza Hernández Joseph Lane Joseph O’Donoghue Joseph Poprzeczny Joseph Power Josh Hawley Joshua Shrubb Joy Heath Joy Reid Joyce Freedman Jude Aquilina Judith Bassett Judith Curry Judy Johnson Judy Stove Judy Stove-Wilson Julia Magnet Julia Patrick Julian Croft Julian Leeser Julian McGauran Julian O’Dea Julian Woods Julie Novak Julie Sladden July-August, 2011 June 2012 June, 2011 Justene Musin Justin Campbell Justin Jefferson Justin Kelly K. M. Preston K.Cairns K.M. Preston Kamal Weerakoon Kara Thomas Karen Blaylock Karen Throssell Karin Petersen-Schaefer Karl Schmude Katherine Gallagher Katherine Spadaro Kathryn Rae Kathy Duggan Kathy Gyngell Kathy Hunt Kathy Russell Katrina Gulliver Katrina Naomi Kay Cairns Kayt Davies Keayr Braxton Keith McKenry Keith Russell Keith Windschuttle Keith Windschuttle and Brian Galligan Keith Windschuttle and Tim Gillin Kel Richards Kel Richards Ken Gannicott Ken Haley Ken Handley Ken Harney Ken Phillips Ken Simpson Ken Stone Kenneth Harkness Kenneth Maddock Kenneth Minogue Kenneth Slessor Kenneth Steven Kerry Conway Kerry Popplewell Kerry Tilbrook Kerryn Pholi Kesten Green Kevin Andrews Kevin Bennett Kevin Cahill Kevin Cowdall Kevin D. Williamson Kevin Densley Kevin Donnelly Kevin Donnelly Kevin Hallewell Kevin Hart Kevin McGovern Kevin Myers Kevin Myers Kieran Morris Kieren Koala Kim Core Kim Morrison Kirsten Due Kitty Donnelly Know-it-Poet Knute Skinner Konstantin Kanelleas Kris Hemensley Kristen Roberts Kyle Orton L W Maher L.S. Bergin Laila Nawsheen Lana Starkey Lance Eccles, David Elder, Bill James, Peter Gerar Laura Buzo Laurence Karacsony Laurence Karacsony Laurence W Maher Laurence W. Maher Laurent Lemasson Laurie Hergenhan Lawrence Burke Lawrence Cross Lawrence Qummou Leah Hobson Lee Shrubb Leila Lois Lennie Lower Leo Maglen Leo Maglen Leo Marzi Leon Shann Leon Trainor Leonie Kramer Les Louis Les Murray Les Wicks Lesley Boland Leslie Kemeny Leslie Stein Leslie Stein Letters Letters to the Editor Lewi Stone and Gregory Rose Libby Sommer Lillian Andrews Lin van Hek Lincoln Wright Linda Reynolds Lindsay Boyd Lindsay Brien Lindsay Foyle Lindsay Urwin Lionel Farrell Lionel Reynolds Lisa Jacobson Liz McQuilkin Lloyd Reinhardt Loretta Polson Lorraine Black Lorraine Finlay Lorraine McGuigan Louis Cipher (aka Peter Smith) Louis Groarke Louis Groarke Louise Bremner Lucas McLennan Lucas Smith Lucas Smith Lucinda Moon Lucinda Spier Lucy K. Hahn Luke Maffeo Luke Powell Luke Powell Luke Stegemann Luke Torrisi Luke Whitington lungfish LW Maher Lyle Dunne Lyn Ashcroft Lyn Ashcroft Lyn Wesley Lynette Reilly: M. A. Casey M. L. R. Smith M.A. Casey M.A. Goldrick M.B. McLatchey M.G. Michael & Katina Michael M.T. O’Byrne Madeleine Rose Jones Mae Vanderschaar Maggie Wallis Magnus O’Mallon Mahammad Kalifa Al–Kalifa More-Kalifas Mal Wedd Malcolm Colless Malcolm Forbes Malcolm Gillies Malcolm Gillies Malcolm H. Brandon Malcolm Hugh Patterson Malcolm King Malcolm McCusker Malcolm Saunders Malcolm Turnbull Malcolm Voyce malcolm wedd Malcom Colless Marc Hendrickx Marc Hendrickx Marc Hendrickx & Roger Franklin Marc Janssen Marc Marusic March 2012 March, 2011 Marco Paoletti Marco Wollert Marcus Ten Low Margaret Barbalet Margaret Bradstock Margaret Cameron-Ash Margaret Harvey Margot Pearce Margot Pearce Maria Schneider Marie Daouda Marie Gleeson Marie Hansen Fels Marie Hansen Fels & David Clark Marie Hansen Fels with David Clark and Rene White Marie Muldoon Marilyn Peck Marion Lucy Marjon Mossammaparast Marjorie Howard Johnson Mark Beltz Mark Durie Mark Durie Mark E.T. Horn & Peter R. Proudfoot Mark Edgecombe Mark Evans Mark Fowler Mark Gregory Mark Henderson Mark Horn & Peter Proudfoot Mark Imisides Mark Latham Mark Lawson Mark Lewis Mark Lopez Mark McGinness Mark McGinness Mark Moyar Mark O’Connor Mark Powell Mark Powell Mark Poynter Mark Sneddon & Pete Mulherin Mark Steyn Mark Steyn Mark W. Jones Mark Walland Martin Auster Martin Bennett Martin Davies Martin H. Samuel Martin Hutchinson Martin Jones & Michael L.R. Smith Martin Lynch Martin R. Johnson Martin Samuel Mary Cresswell Mary Jones Mary Kissel Mary Makofske Mary-Ellen Turbet Maryanne Hannan Marye Trim Mathew White Matt Gaughwin Matt Hayden Matt Ridley Matt Thompson Matthew Goldrick Matthew Green Matthew Heeney Matthew Lesh Matthew Maddern Matthew O'Sullivan Matthew Omolesky Matthew Walther Matthew White Matthew White Matti Friedman Maurice Nestor Maurice Newman Max Bennett and Jeff Reimers Max Rheese Max Ryan Max Teichmann Maxim Nikiforov May 2102 May, 2011 Mchael Warren Davis Meg Courtney Hawke Megan Cartwright Melanie Phillips Melinda Smith Melinda Tankard Reist Melissa Ahart Melissa Coburn Melvin Schut Merrie Cave Merv Bendle Merve Bendle Mervyn Bendle Mervyn Bendle Mervyn F Bendle Mervyn F. Bendle Mervyn F. Bendle PhD Mervyn F. Bendle, John Dawson, Bill Muehlenberg, J Mervyn F. Bendle, Trevor Sykes, Howard Hutchins,Su Michael Ackland Michael Ackland Michael Angwin Michael Asten Michael Ayling Michael Baume Michael Bounds Michael Buhagiar Michael Byrne Michael Collins Michael Connor Michael Cook Michael Cook, Joseph Parkinson, Anna Porter, John Michael Copeman Michael Cotter Michael Crane Michael Cross Michael Danby Michael Davis Michael de Percy Michael Detmold Michael Duffy Michael Dunn Michael Easson Michael Easson Michael Evans Michael Evans Michael Fogarty Michael Gala Michael Galak Michael Galak Michael George Smith Michael Giffen Michael Giffi n Michael Giffin Michael Giffin Michael Green Michael Haig Michael Halliwell Michael J. Galak Michael Jensen Michael Kile Michael Kowalik Michael Lawriwsky Michael Lawriwsky Michael Mansell Michael McAuley Michael Mintrom Michael Morrissey Michael O'Connor, Dawn Moss, James Allan, Murray M Michael O’Connor Michael Olsen Michael P. Jensen Michael Passaniti Michael Roe Michael Sariban Michael Scammell Michael Sharkey Michael Shellenberger Michael Thorley Michael Walsh Michael Warby Michael Warren Davis Michael Wilding Michael Williamson Michael Witts Michele Fermanis-Winward Mick Ringiari Mihail Evans Mike Alder Mike Carlson Mike Cooper Mike Fogarty Miklos Radnoti, translated by John Ridland and Pau Milton Cockburn Milton Cockburn Milton Osborne Milton P. Ehrlich Mira Crouch Mirand Devine Miranda Devine Miranda Siemienowicz Miriam Dixson Misha Saul Mishka Gora Mitch Browne Mocco Wollert Moira Deeming Molly Chong Molly J. Sasson Monica Wilkie Morris Lurie Moya Pacey Murray Mitchell Murray Walters Murray Waters Myles Harris Myles Parish Myra Schneider Myron Ebell N.A. Haug N.S. Lyons Nan Ollerenshaw Nana Ollerenshaw Nathan Livingstone Nathaniel Calhoun Nathaniel Lucas National Review Online Neal Price Neil Burrows and Rick Sneeuwjagt Neil McDonald Nelson Rufatt Nicholas Hasluck Nicholas Hasluck Nicholas T. Arndt Nicholas T. Parsons Nicholas Tam Nicholas Tonti-Filippini Nick Cater Nick Cater Nick Gibb Nick Lloyd Nick McGowan Nick Turner Nicola Knox Nicole James Nidhi Agrawal Nigel Biggar Nigel Davies Nigel Freitas Nigel Jackson Nikki Savage (as told to Jim Allan) Nils A. Haug Niro Sivathasan Niro Sivathasan and Duncan Syme Noel Gardner Noel King Noel Pearson Noel Weeks Noela Shepherd Norm Neill November 2011 November, 2011 October, 2011 Ojel L. Rodriguez Burgos Oliver Burckhardt Oliver Friendship Oliver Hartwich Oliver Hartwich Olivia Byard Olivier Burckhardt Olwyn Conrau Ona Grossnickle Oscar Clarke Oscar Godsell Otto Nebbler Our Correspondent Ouyang Yu Owen Harries P. Brown P.D. Jonson P.F. O’Donohue P.J. Murphy P.P. McGuinness Padraic P. McGuinness Pamela Leach Paolo Bertolani/Jennifer Compton Paolo Totaro Pascale Petit Pastor de Lasala Pat Beale Pat Clinton Patricia Anderson Patricia Azarias Patricia Rolfe Patricia Shaw Patrick Coyne Patrick Holland Patrick J. Byrne Patrick McAuley Patrick McCauley Patrick McCauley Patrick Morgan Patrick Morgan Patrick Parkinson Patrick Walsh Paul Amos, David Bird, Kenneth Barnes, Ken Harknes Paul Blake Paul Brooke Paul Bussan Paul Catalanotto Paul Chandler Paul Collits Paul Collits Paul Connolly Paul de Serville Paul Dickey Paul Dolphin Paul Fenton, Murray Mitchell, Colin Pratt, Adam Bo Paul Fraser Paul G. E. Albrecht Paul Goard Paul Greguric Paul Grover Paul J. Greguric Paul Kane Paul Krause Paul Lake Paul Mabarrack Paul Mitchell Paul Monk Paul Monk Paul Monk, Roger Nairn, Ray Evans, Bill James,Mich Paul Morrissey Paul Nicholls Paul Oates Paul Oslington Paul Prociv Paul Raffaele Paul Read Paul Stenhouse Paul Sturdee Paul Thomas Paul Williams Paul Williamson Paula Jones Pauline Conolly Pauline Farley Peach Klimkiewicz Penelope Nelson Peregrine Blake Persimmon Pete Mulherin Peter Arnold Peter Bakovski Peter Baldwin Peter Barclay Peter Barry Peter Brun Peter Brune Peter C. Grundy Peter Coghill Peter Coleman Peter Costello Peter Craven Peter Day Peter Fenwick Peter Fenwick Peter Gilet Peter Goldsworthy Peter Gross Peter H. Edwards Peter Hannan Peter Hansen Peter Hayes Peter Howson Peter J. Elliott Peter Jackson Peter Jeffrey Peter Jennings Peter Kocan Peter Kurti Peter L. Swan Peter Lang Peter Lavac Peter Mulherin Peter Mulholland Peter Murphy Peter Norris Peter O'Brien Peter O'Brien & Roger Franklin Peter Phelps Peter Pierce Peter Proudfoot, Kerry Boulton, Frank Pulsford, Ch Peter Purcell Peter Purcell Peter R. Clyne Peter Rees Peter Ridd Peter Rowe Peter Rutherford Peter Ryan Peter Samuel Peter Saunders Peter Sekuless & Tony O’Leary Peter Sellick Peter Shergold Peter Skrzynecki Peter Smith Peter Stiles Peter Tiernan Peter Vallee Peter Wales Peter Ward Peter West Peter Wilkins Phil Ainsworth & Alistair Pope Phil Brown Phil Burcham Phil Shannon Phil Shannon Philip Ayres Philip Ayres, Roy Williams, Alan Barcan, Bern Bren Philip Burcham Philip Drew Philip Emery Philip Hayward Philip Hopkins Philip Martin Philip Plickert Philip Plickert Philip Rintoul Philipp Ammon Philippa Martyr Phillip Hall Phillip Hilton Phillip M. Altman Phillip Turnbull Phillipa Martyr PHILTON Piers Akerman Pippa Kay PJ Murphy Professor Bunyip QoL Editor Quadrant Quadrant Editors Quadrant Online Contributors Quadrant Verse Quentin Dempster R L Swihart R.B. Chenevix Trench R.J. Armstrong R.J. Conlon R.J. Smith R.J. Stove R.N. Callander R.N. Callander R.W. Johnson Rachael Kohn Rachael Kohn Rachel Riley Rafe Champion Rafe Champion Rafiq Mahmood Rambling Possession Ranald & Airlie Moore Ranald Moore Ranald Moore, Jack Sexton, Claudio Veliz, Ian Jone Ray Evans Ray Evans & Tom Quirk Ray Evans and Tom Quirk Ray Evans, Colin Balmer, Tony Abbott Ray Evans, Wilson Tuckey, Michael Kile, Edward Dra Ray Penny Raymond Burns Raymond Burns Raymond Ibrahim Raymond Shon & Stephanie Shon Rayyar Marron Razeen Sally RB Lonetree Reagan Upshaw Rebecca Weisser Reg Naulty Remy Chadwick Reuben Kirkham Rex Ahdar Rex Pollard Rhett Talley Rhoderick McNeill Ricardo Pau-Llosa Riccardo Bosi Richard Allsop Richard Alston Richard Baker Richard Castles Richard Fernandez Richard Forrest Richard Gate Richard Gray Richard Harrison & Frank Salter Richard Laidlaw Richard Lansdown Richard Martin Richard Mawrey Richard S. Lindzen Richard Stanton Richard Waddell Richard White, Tony Hassall, Ed Killesteyn, Stephe Rinzen Widjaja RJ Stove Road Scholar Blog Rob Foot Rob Long Rob Nugent Robbie Coburn Robert Andrews Robert Carter Robert Clancy Robert Conquest Robert Constantine Robert Darby Robert Darroch Robert Edmonds Robert Ellison Robert Frenkel Robert Gray Robert Handicott Robert Handicott Robert Hill Robert Hirschfield Robert I. Ellison Robert Kaplan Robert Lewis Robert M Kaplan Robert M. Carter Robert M. Kaplan Robert M. Steley Robert McLaughlin Robert Menzies Robert Mezey Robert Murray Robert Rothman Robert Service Robert Solomon Robert Warburton Robert Wargas Robert Wood Robin Barclay Robin Norling Robin Teese Robyn Lance Robyn O’Sullivan Robyn Rowland Rocco Loiacono Rod Dreher Rod McGarvie Rod Moran Rod Stuart Rod Usher Rodney Purvis Roger Beam Roger Brown Roger Franklin Roger Franklin & Tony Thomas Roger G McDonald Roger G McDonald: Roger G. McDonald Roger Karge Roger Karge Roger Kimball Roger Kimball Roger Neill Roger Partridge Roger Pescott and Marita Punshon Roger Sandall Roger Scruton Roger Underwood Roger Underwood Roger Underwood & Athol Hodgson AM Rohan Buettel Rohan McHugh Ron Boswell Ron Cox Ron Kitching Ron Merkel Ron Petty Ron Pike Ron Pike Ron Pretty Ron Rash Ron Rodgers Ron Taft Ron Wilkins Ron Wilson Rory Shiner Rosaleen Smyth Rosanna Licari Roslyn Ross Ross Babbage Ross Barham Ross Donlon Ross Fitzgerald Ross Fitzgerald Ross Fitzgerald & Graham Irvine Ross Fitzgerald & Ian McFadyen Ross Fitzgerald & Stephen Holt Ross Fitzgerald and Stephen Holt Ross Jackson Ross Martin Ross Murdoch Martin Ross Terrill Ross Terrill and Frank Mount Ross Twigg Rowan Callick Rowan Dean Rowena Wiseman Roy Duffield Roy W. Gotaas Roy Williams Royston Mitchell Rudolf Vyborny Rupert Darwall Rupert Guenther Russell Erwin Russell Forster Russell Trood Ruth Blakeney Ruth Dudley Edwards Ryan Anderson Ryszard Legutko S. Walker S.T. Karnick Sally Sara Salvatore Babones Sam Abotomey Sam Roggeveen Samantha Grosser Samer Abbas Samuel Chamberlain Samuel J. Samuel Mullins Samuel Strathman Sandra Jobson Darroch Sara Miller Sarah Mandie Sarah Penwarden Sarah Tiffen Satya Marar Satyajeet Marar Saul Kelly Saxby Pridmore Scot Braithwaite Scott A. McConnell Scott Buchanan Scott Kelly Scott Monk Scott Morrison Scott Prasser Scotus Viato Seamus Cole Sean Beckett Sean Haylock Sean Jacobs Sean Kelly Sean Masters Sean McGlynn Sean O’Callaghan Sean O’Leary Sean Wayman Sean Wayman Sean Welsh Sebastian Schloessingk Sebastian Tombs Selwyn Parker Senator James McGrath September 2012 September, 2011 Sev Sternhell Sever Sternhell Shan Charlesworth Shane McCauley Shane W. Satterley Sharon Foulkes Sharon Gould Sharon Olds Shelley Gare Sheryl Persson Sheryl Perssons Shimon Cowen Shimon Cowen and Michael Kowalik Shirley Apthorp Shlomo Shnotvasser Shreya Sen Simon Caterson Simon Collins Simon Collins Simon Haines Simon Kennedy Simon Kennedy Simon Molloy Simon P. Kennedy Simon Petch Simone Richardson Sinclair Davidson Sir David Smith Solveig Foss someone called \"Tom\" Sonia Mycak Sophia Nugent-Siegal Sophie Masson Stan Masters Stan McGlade Stanley J. Solomon Steele Rudd Stefan Molyneux Stephanie Bastiaan Stephanie Forrest Stephanie Jarrett Stephen Beckett Stephen Brock Stephen Buckle Stephen Buetow & Kira Baccal Stephen Chavura Stephen Corones Stephen Edgar Stephen Gilfedder Stephen Goldrick Stephen H. Balch Stephen Holt Stephen Holt Stephen Mason Stephen McInerney Stephen Murphy Stephen Orr Stephen Quinn Stephen Sewell Stephen Sewell Stephen Tucker Stephen Wilks Steve Brock Steve Cox Steve Etherington Steve Isham Steve Kates Steve Kates and James Allan Steve Woodman Steven Kates Steven Schwartz Steven Schwartz Steven Tucker Stewart Justman Stuart Lindsay Stuart Wood Subscriber X Sue Brennan Sue Jones Susan Adams Susan Bennett Susan Moore Suzannah Rowntree Suzanne Edgar Suzanne Edgar, H.A. Willis, Donat Gallagher, Geoff Suzanne Edgar, L. Peter Ryan, Michael O’Connor, Symeon Thompson Tamara Lazaroff Tanner Tanveer Ahmed Tanya Rosecky Tanya Thistleton Tati Sofaris Tati Sofaris Ted Hopkins Ted O’Brien Ted Rule Ted Witham Terry Barnes Terry Beath Terry Dwyer Terry McCrann Terry Persun The New City Theodore Dalrymple Thomas Banks Thomas Banks Christopher Akehurst Gerald J. Russel Thomas Barlow Thomas Sowell Tiggy Johnson Tim Andrews Tim Blair Tim Cannon Tim Casey Tim Curtin Tim Edwards Tim Fab-Eme Tim Loveday Tim Macartney-Snape Tim Montgomerie & Andrew Gamble Tim Murphy Tim Neilson Tim O'Hare Tim O’Brien Tim Train Tim van Gelder Tim Wilms Tim Wilson Timoshenko Aslanides Timothy Cootes Timothy Cootes Timothy Litherland Timothy O'Hare Tina Faulk Tina Kane Titania Scopticos TJ Newton Toby Young Todd Hardy Todd Huizinga Todd Turner Tom Barlow Tom Breen Tom Burkard Tom Burton Tom Coverdale Tom Frame Tom Gallagher Tom Harris Tom Lewis Tom Lewis Tom Minchin Tom Morgan and Andrew Bilinsky with Tom Switzer Tom Quirk Tom Qurik Tom Randolph Tom Switzer Tomasz Zieja Tomaž Šalamun/ Michael Thomas Taren Tony \"Swearing Man\" Thomas Tony Abbot Tony Abbott Tony Abbott Tony Bartlett Tony Cousins Tony Grey Tony Hassall Tony Heller Tony Macken Tony Thomas Tony Winkelman Transcript Trevor Bailey Trevor Kennedy Trevor L. Jordan, Owen Richards, Fred Blanks, Robe Trevor Sykes Trevor Sykes, Deirdre Therese Little, and Hal G.P. Tricia Dearborn Tricia Peak Tristan Heiner Tronn Overend Trudi Tate U. Calderone Ugo Rotellini Ulla Terkelsen and Askold Krushelnycky US State Department Uwe Siemon-Netto Václav Klaus Val Majkus Val Murray Val Yule Valerie Murray Vanessa de Largie Vanessa Proctor Various ARC grant recipients Veronica Winkels Veronika Winkels Very-Anonymous-Scared-to-Stand-up-and-be-Counted-D Vic Jurskis Vic Spandrio Victor Davis Hanson Victor Stepien Victoria Field Victoria Kincaid Victoria Royston Virad Mathur Viscount Monckton of Brenchley Viv Forbes Viva Hammer Vivian Smith Vivian Whiteley Hopkirk W.H. Presley Walter Sofronoff Walter Starck Walter Waverley Wanda Skowronska Wanda Skowronska Wandoo Hollows war memorial Warren Shapiro Wayne Caldow Wayne Strudwick Wayne Strudwick Wendy Videlock Wendy Willemse Wesley J. Du Preez Westminster Commission Will Dallas Brooks Will Fraser William Briggs William Carney William Coleman William D. Rubinstein William Etheridge William Heath William J. Lines William Kininmonth William Kitcher William McGurn William Poulos William Rush William Walker Willie Soon and David R. Legates Wilson Tuckey Wolfgang Kasper work -> home Wortley Clutterbuck Yan Xia Yulia Latynina Zachary Gorman Zeg Zeno Zoe Higgie SubscribetoQuadrant Online Subscribe Login Quadrant Music Arts & Culture From Our ArchivesMass Immigration is Suffocating EuropeAs Douglas Murray notes, some 130,000 women in Britain have suffered female genital mutilation. In 30 years, not one successful prosecutionEdward CranswickJun 12 202518 mins As Douglas Murray notes, some 130,000 women in Britain have suffered female genital mutilation. In 30 years, not one successful prosecution Edward Cranswick Jun 12 2025 18 mins As Douglas Murray notes, some 130,000 women in Britain have suffered female genital mutilation. In 30 years, not one successful prosecution Edward Cranswick Jun 12 2025 18 mins AustraliaA Stranger in an Ever-Stranger LandThe values of this new, modern Australia are quite foreign to me. The older Australia I knew and loved is as good as goneAlistair CrooksJun 11 20258 mins The values of this new, modern Australia are quite foreign to me. The older Australia I knew and loved is as good as gone Alistair Crooks Jun 11 2025 8 mins The values of this new, modern Australia are quite foreign to me. The older Australia I knew and loved is as good as gone Alistair Crooks Jun 11 2025 8 mins PremiumAboriginesRecognising RacismIf we want to stress our common humanity, our easy-going acceptance of all Australians, we will demand an end to all welcomes to countryKel RichardsJun 11 20259 mins If we want to stress our common humanity, our easy-going acceptance of all Australians, we will demand an end to all welcomes to country Kel Richards Jun 11 2025 9 mins If we want to stress our common humanity, our easy-going acceptance of all Australians, we will demand an end to all welcomes to country Kel Richards Jun 11 2025 9 mins **The Changing World of Musical Composition: An Interview with Samuel Andreyev** Alexander Voltz May 27 2025 16 mins Samuel Andreyev is one of music’s most important contemporary voices. His works, which include numerous chamber, solo, orchestral and vocal compositions, have been performed, broadcast and recorded worldwide. Among his many achievements as a composer, educator and public speaker, he has taught at the Haute École de Musique de Genève, the Hochschule für Musik Freiburg and the Strasbourg Center of the University of Syracuse. Currently, he is the vice-president of the Fondation Prince Pierre de Monaco’s music council. A Canadian by birth, he teaches two eight-hour courses on music for Jordan Peterson’s online universal education platform, Peterson Academy. Notably, Andreyev joined YouTube on September 4, 2008, to establish what is now regarded as one of the world’s foremost podcasts for the examination of ideas relating to art music. The following interview took place online in April. Look, it’s always possible to have artistic freedom. The question is: Are artists… Subscribe and enjoy unlimited access to Quadrant Editorial and much more. Unlimited Access Unlimited Access Unlimited Access Print & Digital Print & Digital Print & Digital Member Benefits Member Benefits Member Benefits From only $8.99 a month Quadrant Music Arts & Culture **Join the Conversation** Already a member? **What to read next** PremiumArts & CultureThe Artistic Fount of the Spiritual PreconsciousAllow scientism or crass consumerism to dominate a culture and one result will be a rash of uninspired artGary FurnellMay 28 202513 mins Allow scientism or crass consumerism to dominate a culture and one result will be a rash of uninspired art Gary Furnell May 28 2025 13 mins Allow scientism or crass consumerism to dominate a culture and one result will be a rash of uninspired art Gary Furnell May 28 2025 13 mins PremiumQuadrant MusicBorn in Exile: Antal Doráti HonouredRJ StoveMay 26 202519 mins RJ Stove May 26 2025 19 mins RJ Stove May 26 2025 19 mins Quadrant MusicThe Theremin: The Craft of HoveringIt's the instrument you've heard introducingDoctor Who, but it's much more than a novelty in the hands of virtuoso Carolina EyckMalcolm GilliesMay 26 20253 mins It's the instrument you've heard introducingDoctor Who, but it's much more than a novelty in the hands of virtuoso Carolina Eyck Malcolm Gillies May 26 2025 3 mins It's the instrument you've heard introducingDoctor Who, but it's much more than a novelty in the hands of virtuoso Carolina Eyck Malcolm Gillies May 26 2025 3 mins **Become a memberand enjoy the best content print and digital** Current Issue Subscription My Account Quadrant Patron Magazine Features Poetry Music Politics World Quadrant Online China About Donate Contact Us"}