{"id": 57, "name": "Al.com (Alabama News)", "domain": "al.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.al.com/news/anniston-gadsden/2025/06/this-rapper-once-glorified-violence-now-hes-speaking-out-against-it-at-a-community-event.html", "title": "This Rapper Once Glorified Violence Now Hes Speaking Out Against It At A Community Event.html", "content": "Birmingham Huntsville Mobile Montgomery Tuscaloosa Anniston/Gadsden Beaches Alabama **This rapper once glorified violence, now he’s speaking out against it at a community event** Updated:Jun. 11, 2025, 6:08 a.m. |Published:Jun. 11, 2025, 6:00 a.m. The \"I Want to Live\" event will feature guest speaker Yung Joc, a well known rapper, who, at the first anti-violence event apologized for his music which promoted gun violence and substance misuse.The Agency for Substance Abuse Prevention Alaina Bookman | abookman@al.com Multi-platinum recording artist and television personality Yung Jocsaid there will be “real change” at this local anti-violence event. TheAgency for Substance Abuse Preventionis hosting its third annual “I Want to Live” event at Zinn Park on Monday, June 16, at 10 a.m. The free event is open to the public and will include food, live music, resources and important discussions led by guest speakers like Yung Joc. “We gotta come together man to stand up against gun violence and fight for our future. I’m really about that life for real, for real. It’s going to be free food, real talk and real change,” Yung Joc said in a recent Facebook post. At the first anti-violence event, Yung Joc opened up about the fatal shooting of his nephew and apologized for his music which promoted gun violence and substance misuse. “It’s a community wide event that has shined light on the devastating effects of gun violence and substance misuse, which are often intertwined, and they are both two major public health crisis that continue to claim the lives and impact communities across the country,” Laniyah Smith, a prevention specialist and spokesperson for the nonprofit, told AL.com. Since 1973, the Oxford-based advocacy nonprofit has worked to put a stop to violence and substance misuse across Alabama. In 2023, after a community survey found that Anniston and Talladega area youth, ages 16-23, were the primary victims of gun violence, the agency launched multiple anti violence campaigns includingmentorship programs,intervention trainingandcommunity events. And the agency says there is more work to be done. Yung Joc will be joined by Shepton Goodson, a local funeral home director, who will speak about his experience with grieving families who have lost their loved ones to gun violence and substance misuse. “We’re just calling for a change, for prevention and intervention before tragedy strikes,” Smith said. “We just want everyone to come out. By coming together as a community, we’re hoping to take an active stand against these issues.” Smith said the event will bring awareness to community members of all ages and backgrounds about the dangers of guns and substance misuse. She said the annual event is also more than that. “It’s a movement towards healing, accountability and transformation,” Smith said. **Morebirmingham violence** This high school fraternity offers brotherhood, mentorship to Birmingham teens Birmingham mayor proposes record $591 million budget, including funding for public safety ‘czar’ Ivey announces over $200,000 grant to reduce violent crime in Birmingham, Jefferson County A second chance hiring fair employed 200 job-seekers: ‘Better outlook on life’ If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** About Alabama Media Group Jobs at Alabama Media Group Advertise with us About AL.com Frequently Asked Questions Accessibility Statement Contact Us Online Store AL.com The Birmingham News The Huntsville Times Press-Register Newsletter Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback News Business Sports High School Sports Alabama Life & Culture Opinion Archives Obituaries Jobs Autos Anniston/Gadsden Birmingham Huntsville Mobile Montgomery Tuscaloosa Gulf Coast Beaches Mobile Apps Tablet Apps Pinterest Twitter Facebook Instagram RSS Send us an email Submit a news tip Buy newspaper front pages, posters and more Videos Weather News Site Map & search Sponsor Content Post a job Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}