{"id": 99, "name": "Ashe Post & Times", "domain": "ashepostandtimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ashepostandtimes.com/classifieds/community/public_notices/proposed-budget-fiscal-year/pdfdisplayad_71a7e678-bba5-5b2e-88d9-1798e14e9b0d.html", "title": "Proposed Budget Fiscal Year", "content": "e-Edition How-To Circulars Subscribe Manage Subscription (Pay Your Bill, Vacation Request, Update Account Info) Subscriber Savings Newsletters Contact Customer Service NC News Editorials Letters to the Editor Promote Your Event Place an Ad Read Today's Newspaper e-Edition How To 77°Partly Cloudy Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch Home News Community Local Events A&E SportsSports Betting News Sports Betting News Sports Betting News Business Opinion Columns Obits ClassifiedsPublic NoticesPlace an Ad Public Notices Place an Ad Public Notices Place an Ad Shop Local Circulars **Proposed Budget Fiscal Year** Facebook Twitter WhatsApp SMS Email Print Copy article link **Details forProposed Budget Fiscal Year** May 21, 2025 Ad 274272 Public Notices [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Your comment has been submitted. Reported There was a problem reporting this. **Welcome to the discussion.** Log In Keep it Clean.Please avoid obscene, vulgar, lewd, racist or sexually-oriented language.PLEASE TURN OFF YOUR CAPS LOCK.Don't Threaten.Threats of harming another person will not be tolerated.Be Truthful.Don't knowingly lie about anyone or anything.Be Nice.No racism, sexism or any sort of -ism that is degrading to another person.Be Proactive.Use the 'Report' link on each comment to let us know of abusive posts.Share with Us.We'd love to hear eyewitness accounts, the history behind an article. Success!An email has been sent towith a link to confirm list signup. Error!There was an error processing your request. We'll send breaking news and news alerts to you as they happen! **Trending Now** Christmas in July announces music lineup High Country residents to participate in 'No Kings' march on June 14 Ashe County arrest reports May sentenced 25 years in prison after being charged statutory rape of a child, other crimes North Carolina GOP sends immigration-crackdown bills to Democratic Gov. Stein Facebook Twitter YouTube Ashe Post & Times Watauga Democrat Blowing Rocket Mountain Times Avery Journal High Country NC News Community Sports Opinion Obits Local-events Photo Gallery Video Gallery Online Features Weather About Us Contact Us Promote Your Event Advertise Rack Locations Submission Forms Subscription Services Subscriber Savings Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}