{"id": 789, "name": "KTNV - Las Vegas News", "domain": "ktnv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ktnv.com/news/good-morning-las-vegas/good-morning-las-vegas-fatal-shooting-on-the-las-vegas-strip-extreme-heat-warning-starts-today", "title": "Good Morning Las Vegas Fatal Shooting On The Las Vegas Strip Extreme Heat Warning Starts Today", "content": "Menu Watch LiveWatch clips from our showsWatch us on your streaming devices Watch clips from our shows Watch us on your streaming devices Watch clips from our shows Watch us on your streaming devices NewsLocal NewsNational NewsCrimeVegas Things To DoSubmit a tip/idea Local News National News Crime Vegas Things To Do Submit a tip/idea Local News National News Crime Vegas Things To Do Submit a tip/idea WeatherToday's Forecast7-Day ForecastHourly Forecast13 Weather Kids Q&AInteractive RadarMonsoon First Alert Today's Forecast 7-Day Forecast Hourly Forecast 13 Weather Kids Q&A Interactive Radar Monsoon First Alert Today's Forecast 7-Day Forecast Hourly Forecast 13 Weather Kids Q&A Interactive Radar Monsoon First Alert Traffic 13 InvestigatesDarcy, What's the Deal? Darcy, What's the Deal? Darcy, What's the Deal? SportsGolden KnightsRaidersUNLVAcesAviatorsAcademic AthletesTyke Highlights Golden Knights Raiders UNLV Aces Aviators Academic Athletes Tyke Highlights Golden Knights Raiders UNLV Aces Aviators Academic Athletes Tyke Highlights 13 ConnectsDonate to Make It Home Donate to Make It Home Donate to Make It Home Morning BlendLas Vegas Morning Blend Hosts Las Vegas Morning Blend Hosts Las Vegas Morning Blend Hosts Contests Give a Child a Book! About UsChannel 13 News StaffTV ListingsWatch us on your streaming devicesKTNV closed captioning infoJobs at KTNVAdvertiseTechnical SupportRemoval Requests Channel 13 News Staff TV Listings Watch us on your streaming devices KTNV closed captioning info Jobs at KTNV Advertise Technical Support Removal Requests Channel 13 News Staff TV Listings Watch us on your streaming devices KTNV closed captioning info Jobs at KTNV Advertise Technical Support Removal Requests Links We Mentioned Vegas 34How to rescan your TVWatch the Golden Knights on Vegas 34 How to rescan your TV Watch the Golden Knights on Vegas 34 How to rescan your TV Watch the Golden Knights on Vegas 34 Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Traffic Local News Local Sports 13 Investigates Darcy, What's the Deal? Ask Steve Contests 13 Connects: Make It Home Vegas 34 How to stream KTNV **Actions** Facebook Tweet Email **Good Morning, Las Vegas: Fatal shooting on the Las Vegas Strip, Extreme Heat Warning starts today** KTNV — We have breaking overnight news this morning as authorities investigate a shooting on the Las Vegas Strip that has left two people dead. Police are also responding to a barricade in east Las Vegas. Additionally, an Extreme Heat Warning begins this morning as we see temperatures higher than normal for this time of year. Breaking overnight: 2 dead following shooting on Las Vegas Strip Gunfire erupts on the Las Vegas Strip, leading to chaos near the Bellagio as police respond to a shooting just steps from one of the city's most iconic landmarks. Streets shut down, pedestrian access blocked, and homicide detectives are now leading theinvestigation. Anjali Patel is live at the scene to bring you the latest. NEW THIS MORNING: Barricade in east Last Vegas Authorities are also responding to a barricade situation early this morning. Details are limited, but Anyssa Bohanan is live at the scene sharing what authorities are saying. PUCN to hold more consumer sessions on NV Energy rate adjustments Today, Southern Nevadans will get a chance to weigh in on potential changes to their power bills. NV Energy is proposing both a rate hike and a small cost reduction, and the Public Utilities Commission of Nevada is takingpublic comments. WATCH | Jhovani Carrillo explains the latest proposed rate adjustments Highs range from 107° to 109° Monday, Tuesday, and Wednesday. An Extreme Heat Warning is in place from 10 a.m. Monday until 10 p.m. Tuesday, and above-average heat is expected over the next two weeks. We are seeing a few surface street crahses across the valley, but freeways are mostly clear at the time of this report. After an overnight fatal shooting, the Las Vegas Strip appears to be opening back up to traffic in front of the Bellagio. Report a typo 13 Connects **Your unused furniture and appliances can make a difference. Here's how** 13 Connects **Your unused furniture and appliances can make a difference. Here's how** Traffic News Weather Now Trending Positively Las Vegas Morning Blend Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Public File Contact FCC Application Kids Programming Report Contact us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact KTNVLasVegas ktnv KTNV"}