{"id": 599, "name": "Global News", "domain": "globalnews.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://globalnews.ca/the-curator/11226735/susan-yara-from-newsrooms-to-skincare-stardom-how-one-journalist-built-a-beauty-empire/", "title": "Susan Yara From Newsrooms To Skincare Stardom How One Journalist Built A Beauty Empire", "content": "World Juniors Travel Greta Thunberg India Watch World Canada Local Politics Money Health Entertainment Lifestyle Perspectives Sports Shopping Commentary Contests Podcasts U.S. News **MenuClose** **Topics** Watch World Canada LocalChange location Politics Money Health Entertainment Lifestyle Perspectives Sports Shopping Commentary Contests Podcasts U.S. News **TV Programs** Global National West Block The Morning Show Video Centre More… **Connect** Email alerts Alexa Breaking News Alerts from Global News License Content Contact Us Barrie BC Calgary Durham Edmonton Guelph Halifax Hamilton Kingston Kitchener Lethbridge London Montreal New Brunswick Okanagan Ottawa Peterborough Regina Saskatoon Toronto Winnipeg **Go BackCloseLocal** Barrie BC Calgary Durham Edmonton Guelph Halifax Hamilton Kingston Kitchener Lethbridge London Montreal New Brunswick Okanagan Ottawa Peterborough Regina Saskatoon Toronto Winnipeg **ShareClose** **CalendarClose** **CalendarClose** All event types Comedy Festival Food Health Music Sports Theatre Virtual Other **SearchClose** **Add Global News to Home ScreenClose** Instructions: Press theshareicon on your browser SelectAdd to Home Screen PressAdd **CommentsClose comments menu** Want to discuss? Please read ourCommenting Policyfirst. Beautyhomepage The Curator Home & Kitchen Fashion Health & Fitness Kids & Family Outdoor Travel Gift Ideas **Susan Yara: From newsrooms to skincare stardom – how one journalist built a beauty empire** If you get Global News from Instagram or Facebook - that will be changing.Find out how you can still connect with us. **ShareClose** The Curatorindependently decides what topics and products we feature. When you purchase an item through our links, we may earn a commission. Promotions and products are subject to availability and retailer terms. When Susan Yara speaks, there’s a sense of clarity and purpose that feels earned – honed through years in front of the camera, behind the scenes and in the fast-paced world of beauty entrepreneurship. From broadcast journalism to founding the skincare brand Naturium, Yara’s career reflects a rare mix of reinvention, intuition and grit. Today, she’s one of the most influential voices inbeauty, but her journey started in the world of hard news. **From News to Digital Media Pioneer** Yara began her career believing she’d be a traditional news reporter. After graduating, she landed her first role in New York City covering local news. But the rigid structure of hard news didn’t quite fit. “It just wasn’t exactly what I liked,” she recalls. That realization led her to pivot into lifestyle journalism, landing atForbesat a pivotal time – right as the publication was beginning its digital transformation. Being part ofForbes’early push into dot-com media gave her a front-row seat to the evolving nature of content. From there, she went on to help build digital platforms forPeople,PopSugarandNewBeauty. The experience eventually inspired her to start her own venture:Mixed Makeup, a YouTube channel aimed at skincare and cosmetic education. **Becoming the Brand** When Yara first started Mixed Makeup, she approached it like media. “I wasn’t thinking of myself as an influencer,” she explains. She focused on high-quality content, often featuring multiple people and treating herself more as a journalist than the face of the brand. But as influencer culture evolved, so did her strategy. Viewers wanted personality, relatability and consistency – and that meant more ofher. “At some point it really shifted where I became the personality,” Yara says. That personal branding move would eventually fuel her success – not only as a creator but also as a founder. **Building Naturium** Years of studying skin and beauty through content – and listening closely to her audience – led to a realization: there was a gap in the skincare market. High-performance products were either overpriced or under-delivering. People, including her own mother, were hesitant to use luxury skincare regularly for fear of “wasting” it. So she launched Naturium, a line of science-backed skincare products designed to be effective yet affordable. “The only time you really see results with your skin is if you’re consistent,” she explains. “And to be consistent, you need products that you can afford to actually use.” Inside Bubble Skincare: Shai Eisenman’s mission to make high-quality beauty affordable Her strategy was smart, data-driven and deeply rooted in community insight. Unlike brands that spend heavily on packaging and marketing, Yara poured 80% of Naturium’s budget into the formulas. The goal? Deliver clinical-level skincare that people could trust – and afford. In 2022, Naturium was acquired bye.l.f. Beauty, a move that gave the brand global distribution power. “We needed the power of a bigger company,” Yara says, pointing to the logistical challenges of scaling an indie brand. With Naturium now in major retailers likeShoppers Drug MartandAmazon, the acquisition has only amplified what Yara and her team started. Despite the sale, she remains actively involved. “They wanted us to stay on board and do exactly what we’re doing – just with their help,” she says. The partnership has allowed her to keep building the brand’s identity while expanding its reach. **Marketing with Authenticity** As someone with deep roots in digital strategy, Yara is refreshingly non-gimmicky when it comes to marketing. Naturium doesn’t rely on flashy influencer campaigns; instead, it focuses on authentic word-of-mouth. “We like to find people who naturally talk about the product,” she explains. Her team prioritizes micro-influencers, real customers and genuine reviews – often turning passionate user testimonials into paid ads. This approach mirrors her own standards as a creator. “I always needed to try a product and develop a real opinion before I could ever do a sponsorship,” she says. **Breaking Beauty Myths** One of Yara’s biggest missions has been education. She challenges the idea that expensive skincare is inherently better and debunks misleading claims around “medical grade” labels. Her content emphasizes consistency over quick fixes and ingredient efficacy over brand prestige. “The truth is, skincare is just a cosmetic,” she says. “It’s not a prescription. You have to use it every day for at least six weeks before you see real results.” **Finding Fulfillment in Impact** Despite her high-profile career, Yara remains grounded by one simple reward: helping people. “It’s so rewarding when someone tells me I helped change their skin,” she says. For Yara, that’s the most fulfilling part of the job. **Advice for Aspiring Creators and Entrepreneurs** When asked for advice, Yara gets personal. “People talk a lot about imposter syndrome, but if you’re working hard, you deserve to be here,” she says. Her philosophy? Build relationships, embrace community over competition and trust your instincts. “Nobody’s success has ever stopped my success,” she adds. “The more I support people, the more they support me.” From a newsroom rookie to the founder of one of skincare’s most buzzed-about brands, Susan Yara’s journey is a testament to the power of evolution, connection and showing up – consistently. Just like great skincare. **What is Susan Currently Loving?** Best bug repellents to keep you bite-free this summer Top summer picks for your next boat, beach or cabin escape You may also like: Tatcha The Brightening Serum – $125.00 Quantum Mud Mask – $65.99 Dermalogica Discover Healthy Skin Kit – $59.00 Rhode Pocket Blush – $24.00 Tatcha The Serum Stick – $64.00 Bioderma Sensibio Micellar Cleansing Oil – $26.99 5 things you need to know about sunscreen Barbet: The beverage redefining connection Be in the know before you shop with The Curator email sent twice a week. **More from Global News** Explore homegrown Canadian brands you’ll love 5 things you need to know about sunscreen **More Recommendations** Best bug repellents to keep you bite-free this summer Top summer picks for your next boat, beach or cabin escape Best patio set deals you can buy right now 16 last minute Father’s Day gift ideas Dad will love Best lighting to brighten up your outdoor space **Daily Deals** 15% off: Armani Beauty Acqua di Giò Profondo$170 on amazon (was $200) 15%: Hessawell Gold Silver Hoop Dangle Earrings$14.9517.59on Amazon 25% off: 100% Egyptian Cotton Bed Sheets$119.99139.99on Amazon 19% off: LEVOIT Air Purifier$72.8589.99on Amazon 17% off: Amazon Kindle$119.99144.99on Amazon **Top Videos** Poilievre calls for ‘severe limits’ on Canadian population growth137Viewed Canada Post, union exchange arbitration proposals as they return to talks36Viewed Global News at 5:30 Montreal: June 931Viewed Ontario keeps paying Beer Store agreement as alcohol revenue falls30Viewed Poilievre calls for ‘severe limits’ on Canadian population growth Nova Scotia woman demanding answers after breast cancer misdiagnosis Be in the know before you shop with The Curator email sent twice a week. **Report an Error** About Principles & Practices Branded Content Contact us RSS Newsletters Notifications Smart home Advertisers Election Registry Global News Licensing Requests Cookie consent Privacy Policy Copyright Terms of Use Advertise Advertising Standards Terms Corus Entertainment Accessibility"}