{"id": 783, "name": "KSDK - St. Louis News", "domain": "ksdk.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ksdk.com/article/entertainment/television/show-me-st-louis/st-louis-magazines-family-editor-shares-top-picks-for-things-to-do-for-fathers-day-weekend-emily-adams/63-1c042036-f76d-449b-94d5-05b51914c777", "title": "St Louis Magazines Family Editor Shares Top Picks For Things To Do For Fathers Day Weekend Emily Adams", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalPoliticsNear MeEntertainment NewsHealthCrimeNation WorldI-TeamSt. Louis Food NewsShow Me St. LouisLatest News Stories'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to liveSt. Louis mom elevates gun lock drive after son's tragic death Back Local Politics Near Me Entertainment News Health Crime Nation World I-Team St. Louis Food News Show Me St. Louis 'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to live St. Louis mom elevates gun lock drive after son's tragic death Back Local Politics Near Me Entertainment News Health Crime Nation World I-Team St. Louis Food News Show Me St. Louis 'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to live St. Louis mom elevates gun lock drive after son's tragic death WeatherBackForecastMapsRadarClosings & Delays10-DayAllergy IndexHourlyWeather CamsTrafficSchool Closings RegistrationLatest Weather StoriesWeather Impact forecast for St. Louis: Clouds, unsettled weather return by end of the week'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to live Back Forecast Maps Radar Closings & Delays 10-Day Allergy Index Hourly Weather Cams Traffic School Closings Registration Weather Impact forecast for St. Louis: Clouds, unsettled weather return by end of the week 'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to live Back Forecast Maps Radar Closings & Delays 10-Day Allergy Index Hourly Weather Cams Traffic School Closings Registration Weather Impact forecast for St. Louis: Clouds, unsettled weather return by end of the week 'They had a home... They had a plan' - After St. Louis tornado, mother and son have nowhere to live SportsBackCardinalsBluesCity SCCollegeHigh SchoolMotorsportsOutdoorLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawSt. Louis venue is getting a $54 million renovation, but top official says it'll need over $150 million more Back Cardinals Blues City SC College High School Motorsports Outdoor Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law St. Louis venue is getting a $54 million renovation, but top official says it'll need over $150 million more Back Cardinals Blues City SC College High School Motorsports Outdoor Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law St. Louis venue is getting a $54 million renovation, but top official says it'll need over $150 million more SearchSearch:Search Advertise With Us Weather Forecast Stream 5+ As Seen On TV Contact us Show Me St. Louis Contests TISL Radar Making A Difference Get Our Newsletters Download our app Searching for Solutions Project 5 TV Listings **St. Louis Magazine’s Family Editor shares top picks for things to do for Father's Day weekend** **** To stream 5 On Your Side on your phone, you need the 5 On Your Side app. **** **Download the 5 On Your Side app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video ST. LOUIS — Show Me St. Louis is continuing its brand-new weekly segment! Each week, St. Louis Magazine’s Family Editor, Emily Adams, joins us to share the best things to do with your kids—but this week, it’s all about DAD. RELATED:St. Louis Magazine’s Family Editor shares top picks for local parents Whether you're looking to kick back, eat good food, or get competitive, Emily has rounded up the perfect ways to celebrate Father's Day around the St. Louis area: -9 Mile Garden is the place to be for a day of fun, flavor, and festivities. From bourbon tasting and yard games to music bingo, food trucks, and Nascar on the big screen—dad is sure to feel celebrated. -Das Bevo is firing up the grill for a barbecue brunch featuring tasty food, refreshing beer, and live music from Kevin Buckley. - If your dad is into classic cars, make your way to the Kimmswick Car Show. It's a great spot to enjoy lunch, shop locally, and check out some vintage rides. - Dads can also score FREE admission to the National Museum of Transportation during the Horseless Carriage Car Show—a fun and educational stop for the whole family. - Got a competitive gamer dad? Dave & Buster’s is back with its 2nd Annual Dad Games. Lead your family team to victory and compete for prizes, including a year of free game play! - And finally, for the golf-loving dad, Five Iron Golf in Clayton is officially open! This tech-driven golf simulator and elevated sports bar brings the game indoors with a fun, modern twist. RELATED:Five Iron Golf debuts in Clayton with a modern swing on golfing fun Catch Emily every week onShow Me St. Louisfor family fun ideas, and sign up for theSt. Louis Familynewsletter atstlmag.com/newsletters. Want more local lifestyle news delivered straight to your inbox?Sign Upfor the Show Me newsletter. RELATED:Sponsored: Grant's Farm unveils 'Summer Nights' with drone show and live music **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}