{"id": 1229, "name": "Scripps News (Newsy)", "domain": "scrippsnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.scrippsnews.com/science-and-tech/animals-and-insects/invasive-asian-needle-ants-with-potentially-deadly-sting-spreading-across-multiple-states", "title": "Invasive Asian Needle Ants With Potentially Deadly Sting Spreading Across Multiple States", "content": "Menu Watch Live NewsBusinessCrimeEducationEntertainmentGood NewsHealthScripps News LifePoliticsScience and TechSportsU.S. NewsWeatherWorld News Business Crime Education Entertainment Good News Health Scripps News Life Politics Science and Tech Sports U.S. News Weather World News Business Crime Education Entertainment Good News Health Scripps News Life Politics Science and Tech Sports U.S. News Weather World News ShowsTV ScheduleMorning RushThe National ReportOn the SceneHappening Now in AmericaToday as it HappenedScripps News WeekendIn The Shadows with Jason BelliniThe Week as it HappenedScripps News ShowcaseMore Shows TV Schedule Morning Rush The National Report On the Scene Happening Now in America Today as it Happened Scripps News Weekend In The Shadows with Jason Bellini The Week as it Happened Scripps News Showcase More Shows TV Schedule Morning Rush The National Report On the Scene Happening Now in America Today as it Happened Scripps News Weekend In The Shadows with Jason Bellini The Week as it Happened Scripps News Showcase More Shows DocumentariesNext LevelBellingcatAll Docs Next Level Bellingcat All Docs Next Level Bellingcat All Docs InvestigationsScripps News InvestigatesPoisoned: Fentanyl's Child VictimsHope DeniedMaine ShootingUkraine's Women WarriorsMore Investigations Scripps News Investigates Poisoned: Fentanyl's Child Victims Hope Denied Maine Shooting Ukraine's Women Warriors More Investigations Scripps News Investigates Poisoned: Fentanyl's Child Victims Hope Denied Maine Shooting Ukraine's Women Warriors More Investigations Latest Videos About Scripps NewsNews TeamViewer HotlineDownload Our App News Team Viewer Hotline Download Our App News Team Viewer Hotline Download Our App Follow UsFacebookInstagramXTikTokYouTubeThreadsLinkedIn Facebook Instagram X TikTok YouTube Threads LinkedIn Facebook Instagram X TikTok YouTube Threads LinkedIn Newsletter Sign In Newsletters Sign Out Manage Emails Apps Careers Search U.S. NewsCrimeEducationHousingWeatherEntertainment Crime Education Housing Weather Entertainment Crime Education Housing Weather Entertainment Politics LifeRecallsTravelMoneyGood News Recalls Travel Money Good News Recalls Travel Money Good News Health World News Investigations ShowsMorning RushMain & WallThe RaceThe DebriefScripps News TonightScripps News ShowcaseScrippsTechGood To KnowXploration: Animal Science Morning Rush Main & Wall The Race The Debrief Scripps News Tonight Scripps News Showcase ScrippsTech Good To Know Xploration: Animal Science Morning Rush Main & Wall The Race The Debrief Scripps News Tonight Scripps News Showcase ScrippsTech Good To Know Xploration: Animal Science Documentaries Latest Videos **Actions** Facebook Tweet Email **Invasive Asian needle ants with potentially deadly sting spreading across multiple states** Asian needle ants that carry a potentially fatal sting have spread across multiple states, with experts warning people to be cautious when spending time outdoors. The invasive species has been found in more than a dozen states from Washington to Florida, but is expanding more rapidly in the southeastern United States. Entomologists at the University of Georgiaare tracking these ants and have warned that their stings could be deadly. RELATED STORY |3 rodeo horses killed by a swarm of bees in Central Texas People who have strong reactions to stings from insects like bees, wasps or yellowjackets should be especially careful, experts said. If you suffer from anaphylaxis, you should be especially vigilant and carry an EpiPen. The insect has been in the U.S. since at least the 1930s, but only recently has started to disrupt local ecosystems by competing with other ant species that are important to the ecology of that area. RELATED STORY |'Flying' venomous Joro spiders spotted for the first time in this state The Asian needle ants are tiny — about a fifth of an inch long — and are dark brown or black with lighter orange-brown on their antennae and legs. They can be difficult to notice because, unlike fire ants, for example, they don't build mounds or establish foraging trails. These ants prefer to hide under logs, stones and in leaf litter — anywhere with high moisture. Researchers said you should contact a professional exterminator if you think you have spotted these ants in or around your home. This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Most Recent** **Most Recent** Kennedy names 8 vaccine committee replacements, including COVID shot criticAP via Scripps News Group **Kennedy names 8 vaccine committee replacements, including COVID shot critic** **Kennedy names 8 vaccine committee replacements, including COVID shot critic** **Kennedy names 8 vaccine committee replacements, including COVID shot critic** Scripps News asks Republican senators if they'll attend Saturday's Army paradeNathaniel Reed **Scripps News asks Republican senators if they'll attend Saturday's Army parade** **Scripps News asks Republican senators if they'll attend Saturday's Army parade** **Scripps News asks Republican senators if they'll attend Saturday's Army parade** Trump admin signs waivers for 3 states to ban sugary drinks, junk food from SNAPScripps News Group **Trump admin signs waivers for 3 states to ban sugary drinks, junk food from SNAP** **Trump admin signs waivers for 3 states to ban sugary drinks, junk food from SNAP** **Trump admin signs waivers for 3 states to ban sugary drinks, junk food from SNAP** **Science and Tech** **Science and Tech** Rattlesnake vs. bobcat: Arizona resident captures standoff between two predatorsScripps News Group **Rattlesnake vs. bobcat: Arizona resident captures standoff between two predators** **Rattlesnake vs. bobcat: Arizona resident captures standoff between two predators** **Rattlesnake vs. bobcat: Arizona resident captures standoff between two predators** Nintendo Switch 2 gaming console sells a record 3.5 million units in four daysScripps News Group **Nintendo Switch 2 gaming console sells a record 3.5 million units in four days** **Nintendo Switch 2 gaming console sells a record 3.5 million units in four days** **Nintendo Switch 2 gaming console sells a record 3.5 million units in four days** Utah boy suffers third-degree burns attempting toy trend he saw on social mediaScripps News Group **Utah boy suffers third-degree burns attempting toy trend he saw on social media** **Utah boy suffers third-degree burns attempting toy trend he saw on social media** **Utah boy suffers third-degree burns attempting toy trend he saw on social media** **Covering the stories that inspire and impact everyday lives.** **Covering the stories that inspire and impact everyday lives.** About Scripps News **Download the Scripps News app** About Scripps News **Download the Scripps News app** TV Schedule Channel Finder About Scripps News Contact Us Careers Newsletter Sitemap Do Not Sell My Info Privacy Policy Terms of Use Licensing Journalism Ethics Guidelines Scripps Media Trust Center Privacy Center scrippsnews scrippsnews scripps-news scrippsnews @scrippsnews"}