{"id": 24, "name": "ABC (Spain)", "domain": "abc.es", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.abc.es/espana/galicia/informe-toxicologico-paloma-lago-encuentra-sustancias-avalen-20250611114920-nt.html#vtm_modulosEngag=lomas::noticia:1", "title": "Informe Toxicologico Paloma Lago Encuentra Sustancias Avalen 20250611114920 Nt.html#vtm_modulosengag=lomas::noticia:1", "content": "Copiar enlace Copiar enlace Copiar enlace Copiar enlace Facebook Facebook Facebook Facebook X X X X Whatsapp Whatsapp Whatsapp Whatsapp Email Email Email Esta funcionalidad es sólo para registrados Inicio Inicio Inicio Inicio MIABC MIABC MIABC MIABC Mi perfil Mi perfil Mi perfil Mi perfil Mis suscripciones Mis suscripciones Mis suscripciones Mis suscripciones Mis intereses Mis intereses Mis intereses Mis intereses Newsletters y alertas Newsletters y alertas Newsletters y alertas Newsletters y alertas Club ABC Premium Club ABC Premium Club ABC Premium Club ABC Premium Noticias guardadas Noticias guardadas Noticias guardadas Noticias guardadas Autores seguidos Autores seguidos Autores seguidos Autores seguidos Mi archivo Mi archivo Mi archivo Mi archivo Concursos y eventos Concursos y eventos Concursos y eventos Concursos y eventos Contacto Contacto Contacto Contacto Cerrar sesión Cerrar sesión Cerrar sesión Cerrar sesión Es noticia Acuerdo Gibraltar Brian Wilson Nuevas señales DGT Madeleine McCann Paloma Lago Álex González Amnistía Antonio Pagudo Pedro Sánchez Papa Apagón en Madrid Santoral hoy Horóscopo hoy Portada OpiniónCartas al DirectorFe de ratasEl sacapuntas Cartas al Director Fe de ratas El sacapuntas Cartas al Director Fe de ratas El sacapuntas MadridAgenda Agenda Agenda Casa Real ABC SevillaPasión en SevillaSevilla solidaria Pasión en Sevilla Sevilla solidaria Pasión en Sevilla Sevilla solidaria EspañaAndalucíaAsturiasAragónBalearesCanariasCantabriaCastilla y LeónCataluñaCastilla - La ManchaC. ValencianaExtremaduraGaliciaNavarraMurciaPaís Vasco Andalucía Asturias Aragón Baleares Canarias Cantabria Castilla y León Cataluña Castilla - La Mancha C. Valenciana Extremadura Galicia Navarra Murcia País Vasco Andalucía Asturias Aragón Baleares Canarias Cantabria Castilla y León Cataluña Castilla - La Mancha C. Valenciana Extremadura Galicia Navarra Murcia País Vasco Internacional EconomíaInmobiliarioFormación Inmobiliario Formación Inmobiliario Formación Motor SociedadSaludNatural Salud Natural Salud Natural Ciencia Tecnología Gente Antropía CulturaLibrosMúsicaTeatroArteToros Libros Música Teatro Arte Toros Libros Música Teatro Arte Toros PlayTelevisiónEurovisión 2025SeriesCine Televisión Eurovisión 2025 Series Cine Televisión Eurovisión 2025 Series Cine Historia Archivo ABC DeportesReal MadridAtlético de MadridFútbolMMABaloncestoTenisFórmula 1CiclismoVelaJJ.OO.ABC de la Caza Real Madrid Atlético de Madrid Fútbol MMA Baloncesto Tenis Fórmula 1 Ciclismo Vela JJ.OO. ABC de la Caza Real Madrid Atlético de Madrid Fútbol MMA Baloncesto Tenis Fórmula 1 Ciclismo Vela JJ.OO. ABC de la Caza EstiloViajarGastronomíaModaBellezaDecoración Viajar Gastronomía Moda Belleza Decoración Viajar Gastronomía Moda Belleza Decoración FamiliaPadres e hijosParejasEducaciónMayoresFamilia sanaPlanes con niños Padres e hijos Parejas Educación Mayores Familia sana Planes con niños Padres e hijos Parejas Educación Mayores Familia sana Planes con niños AlimentaciónFitnessPsicología y sexo Alimentación Fitness Psicología y sexo Alimentación Fitness Psicología y sexo EstiloGourmetProtagonistasLivingRodar Estilo Gourmet Protagonistas Living Rodar Estilo Gourmet Protagonistas Living Rodar Gurmé Qué Plan Última hora ServiciosProgramación TVLoteríasHoróscopoTiempoEsquelasRecreo Programación TV Loterías Horóscopo Tiempo Esquelas Recreo Programación TV Loterías Horóscopo Tiempo Esquelas Recreo Pasatiempos Juegos FinanzasPréstamos personalesCuentas corrientesCuentas remuneradas Préstamos personales Cuentas corrientes Cuentas remuneradas Préstamos personales Cuentas corrientes Cuentas remuneradas Vídeos Podcast: El boletín Favorito Newsletters Premios Máster ABC Kiosko y más **El informe toxicológico de Paloma Lago no encuentra sustancias que avalen la supuesta sumisión química** **La prueba se realizó en la noche del 27 de diciembre, cuando la presentadora se despertó en su domicilio aturdida y mareada** **Alfonso Villares confía su defensa a la abogada compostelana Belén Hospido, que también representó al padre de Asunta Basterra** **Un familiar de Paloma Lago alertó al 112 cuatro días antes de que se presentara la denuncia** José Luis JiménezyPatricia Abet SANTIAGO Copiar enlace Copiar enlace Copiar enlace Copiar enlace Facebook Facebook Facebook Facebook X X X X Whatsapp Whatsapp Whatsapp Whatsapp Email Email Email Esta funcionalidad es sólo para registrados Esta funcionalidad es sólo para suscriptores La prueba toxicológica practicada a Paloma Lago no encuentra rastro de sustancias que avalen que hubiera sido víctima de una supuesta sumisión química por parte del exconselleiro Alfonso Villares, investigado por una presunta agresión sexual a la presentadora. Según han indicado a ABC fuentes judiciales que han tenido conocimiento de dicha analítica,los resultados son negativostanto en sustancias compatibles con el escenario de la presunta sumisión como en alcohol. Esta pruebase realizó el 27 de diciembre, el mismo día en que Lago se despertó aturdida y mareada en su domicilio de Covas (Ferrol). Según han añadido a ABC las citadas fuentes, cuando se produce el desvanecimiento de la presentadora se encuentra en compañía de Villares, que es quien alerta de la situación a los familiares que residen en una vivienda muy próxima a la de Lago. Allí se personan tanto su hermana comosu sobrino, que es quien realiza la llamada al teléfono de emergencias 112. Como ya relató este periódico la pasada semana, hasta el domicilio de Lagose desplazaron tanto una ambulancia como una patrulla de la Policía Nacional. Los sanitarios atendieron a la presentadora. Ese mismo día se le tomaron las muestras con las que se ha elaborado el informe toxicológico, informan las fuentes consultadas. Cuatro días más tarde, Paloma Lago acude a la comisaría de Ferrol a interponer la denuncia. El momento de realización de la prueba es muy relevante en este caso, dado que el organismo suele eliminar de manera natural la presencia de estas sustanciasen un margen de 24 a 48 horas. De haberse realizado esta analítica en un periodo temporal muy posterior a ese 27 de diciembre, y no con la premura con la que hizo, sus resultados no serían concluyentes para determinar si se produjo esa supuesta sumisión química que aparece reflejada como hipótesis en el atestado elaborado por los investigadores de la UFAM, la Unidad de Atención a la Familia y a la Mujer de la Policía Nacional. Este informe estáincorporado en el atestado policialque ya maneja la titular del Juzgado de Instrucción nº2 de Ferrol, Sara Vega, que instruye la causa después de que Villares renunciara a su condición de aforado -derivada desu dimisión la semana pasadacomo miembro del gobierno gallego- y el Tribunal Superior de Justicia de Galicia devolviera la causa al juzgado competente. La instrucción judicial se encuentra en su fase más inicial. Está pendiente de que comparezca ante la juez el denunciado, Alfonso Villares, después de que distintos medios hayan apuntado que Paloma Lago ya se habría ratificado en su denuncia en las últimas semanas.Villares ya declaró de manera voluntaria en sede policial en el mes de febrero. Además de Villares, se espera que presten igualmente declaración los testigos que puedan designar las partes, así como las pruebas documentales o forenses que se consideren oportunas. De la defensa del exconselleiro do Mar se encargarála abogada compostelana Belén Hospido. La letrada, muy respetada en la capital gallega, es conocida por haber representado al padre de Asunta, Alfonso Basterra, en el juicio por la muerte de la menor. De perfil rocoso y poca amiga de los medios,la profesión la reconoce como una magnífica penalista. Como abogada, Hospido limita sus intervenciones y argumentos a la sede judicial, evitando en todo momento ofrecer declaraciones a la prensa sobre los casos que recaen en su despacho. En lo tocante a Paloma Lago, el nombre de su defensa sigue siendo una incógnita. En un primer momento, se rumoreó que pudiese tratarse de un conocido letrado ferrolano, amigo de la comunicadora. Sin embargo, y llamativamente, parece quede la defensa de Lago se encarga una abogada de oficio. Más temas: Tribunales Galicia Ferrol Ver comentarios(0) Esta funcionalidad es sólo para suscriptores Últimas Noticias La Aemet avisa de un cambio radical en el tiempo de España por la dana: tormentas y descenso térmico en estas zonas Okupan una casa de Madrid y el propietario denuncia no poder pagar la residencia de su madre por el dinero que le deben María Galiana, Herminia en 'Cuéntame', sobre la repentina muerte de su hijo: «Se lo encontró mi marido sin vida» Un español va a un supermercado en Suiza y se queda sin palabras al descubrir el origen de la fruta y verdura Fraude electoral en Albaida del Aljarafe: una testigo admite que una concejal del PSOE le rellenó el voto por correo Le dan una paliza a un músico en San Nicolás por reprocharles que fumasen porros delante de niñosIdeal **Le dan una paliza a un músico en San Nicolás por reprocharles que fumasen porros delante de niños** **Le dan una paliza a un músico en San Nicolás por reprocharles que fumasen porros delante de niños** Estos son los cambios que llegan a los cajeros automáticos antes de finales de junioSur **Estos son los cambios que llegan a los cajeros automáticos antes de finales de junio** **Estos son los cambios que llegan a los cajeros automáticos antes de finales de junio** El error que cometes al tomar el sol y que provoca que te salgan manchas en la caraLa Verdad **El error que cometes al tomar el sol y que provoca que te salgan manchas en la cara** **El error que cometes al tomar el sol y que provoca que te salgan manchas en la cara** Las críticas de un profesor a las notas hinchadas: «Selectividad no era darse el paseíto y sacar un 13,5 para entrar en Medicina»Las Provincias **Las críticas de un profesor a las notas hinchadas: «Selectividad no era darse el paseíto y sacar un 13,5 para entrar en Medicina»** **Las críticas de un profesor a las notas hinchadas: «Selectividad no era darse el paseíto y sacar un 13,5 para entrar en Medicina»** Dos detenidos en la playa de San Lorenzo de Gijón tras la denuncia de una joven por grabarla en toplessEl Comercio **Dos detenidos en la playa de San Lorenzo de Gijón tras la denuncia de una joven por grabarla en topless** **Dos detenidos en la playa de San Lorenzo de Gijón tras la denuncia de una joven por grabarla en topless** El informe toxicológico de Paloma Lago no encuentra sustancias que avalen la supuesta sumisión química Los mejores calefactores de bajo consumo A +++ 1El informe toxicológico de Paloma Lago no encuentra sustancias que avalen la supuesta sumisión química 2Emiliano García-Page, presidente de Castilla - La Mancha, sobre el Rocío: «Es cautivador por todos lados, seas o ... 3Europa abre otra vía para frenar el aval de Pumpido a la amnistía 4La Justicia abre otro frente contra Sánchez y ordena investigar si hubo conflicto de intereses en su papel ... 5Bruselas apunta a que el Gobierno tramitó la ley de amnistía para «garantizar la impunidad de sus socios» *Campos obligatorios Algunos campos contienen errores Tu mensaje se ha enviado con éxito *Campos obligatorios Algunos campos contienen errores Tu mensaje se ha enviado con éxito Muchas gracias por tu participación Vocento Sobre nosotros Contacto Política de privacidad Política de cookies Administrar Utiq Condiciones de uso Aviso legal Condiciones de contratación Compromisos editoriales Comprobar Lotería Navidad Lotería Navidad Buscar número Lotería Navidad Horóscopo Programación TV Horóscopo Chino Últimas noticias Loterías Escuchar noticias del día Pódcast Sorteo Navidad comprobar número - La Verdad ABC ABC Sevilla Hoy El Correo Diario Vasco Las Provincias Diario Montañes Norte de Castilla El Comercio La Voz Digital Norte de Castilla Sur La Verdad Ideal La Rioja Leonnoticias Burgosconecta XL Semanal Mujerhoy Oferplan WomenNow Autocasión Pisos.com Unoauto Turium Welife"}