{"id": 913, "name": "Daily Mining Gazette", "domain": "mininggazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mininggazette.com/sports/2025/06/from-a-massive-hit-to-a-breakaway-goal-sam-bennetts-unforgettable-moment-in-the-stanley-cup-final/", "title": "From A Massive Hit To A Breakaway Goal Sam Bennetts Unforgettable Moment In The Stanley Cup Final", "content": "NewsLocal NewsFront PageBusinessFeaturesOutdoorsMichigan NewsNational NewsInternational News Local News Front Page Business Features Outdoors Michigan News National News International News Local News Front Page Business Features Outdoors Michigan News National News International News SportsLocal SportsSports columnsMichigan SportsNational Sports Local Sports Sports columns Michigan Sports National Sports Local Sports Sports columns Michigan Sports National Sports OpinionEditorialColumnsLetters to the Editor Editorial Columns Letters to the Editor Editorial Columns Letters to the Editor Obituaries Classifieds Jobs Garage Sales Contact InformationContact UsSubmit NewsSubscribeAdvertiseStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Statement of Values Terms of Service Public NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice News Sports Opinion Obituaries Classifieds Jobs Garage Sales Public Notices SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **From a massive hit to a breakaway goal: Sam Bennett’s unforgettable moment in the Stanley Cup Final** **** Jun 11, 2025 SUNRISE, Fla. (AP) — In a single shift, Florida Panthers forward Sam Bennett showed why he’s been one of the most unstoppable players in the Stanley Cup playoffs. In Game 3 of the Stanley Cup Final, Bennett knocked Vasily Podkolzin off his feet with a huge hit in the defensive zone, then buried a breakaway goal on the other end moments later. After the goal, which put the Florida Panthers up 4-1 in the second period of an eventual 6-1 rout of the Edmonton Oilers on Monday night, Bennett pumped his fist and hugged teammate Matthew Tkachuk, whose mouth was wide open, as if neither could believe what had just happened. That’s who Bennett has been throughout the postseason — a hard-hitting, goal-guzzling centerpiece to Florida’s third straight run to the Stanley Cup Final. And after another standout performance that strengthened his case for winning the Conn Smythe Trophy given to the playoff MVP, Bennett has the Panthers two wins away from hoisting a championship trophy for the second straight season. “He’s been an animal this whole playoffs. He’s built for this time of year,” said Brad Marchand, who opened scoring Monday with his eighth goal of the postseason. “Just how competitive he is and how intense. Obviously you see the physicality piece. That shift was a perfect example of his game. He blows two guys up and then somehow leads the rush after that and scores a beautiful goal.” “He can do it all,” Marchand continued. “He doesn’t get fazed. He competes and battles and he’s not scared to go to the dirty areas. … When you get in this time of year, you have to be able to go into the dirty areas, and he lives there.” Marchand had so many positive things to say about Bennett’s game that his teammate, Sam Reinhart, nudged him during their postgame media session to finish up his answer. “Sorry, I’ve got to wrap it up,” Marchand quipped. “But he’s been great.” Bennett had 51 points (25 goals, 26 assists) during the regular season, which was fifth on the team. His 20 postseason points lead the Panthers, and he has more goals — 14 — than any other player in the playoffs. He’s also scored in each of the first three games of the Cup final. Bennett had two goals in Florida’s 4-3 overtime loss at Edmonton in the series opener and opened scoring just two minutes into the Panthers’ 5-4 double overtime win in Game 2. “He’s been incredible,” said Panthers captain Aleksander Barkov. “Obviously he’s scoring goals, but he’s doing so much more other stuff. He’s carrying the puck in the neutral zone. He’s making plays. He’s defending well. He’s just unreal right now.” Bennett’s breakaway goal, which came on an assist from Eetu Luostarinen on Monday, stretched his goal streak to four games, which is a Panthers’ postseason record. “That goal was the perfect Benny goal,” said Tkachuk said, “lays a big hit. (Luostarinen) makes a great block, springs Benny for a breakaway and a great goal.” Bennett’s playoff scoring surge couldn’t have come at a better time, with the 28-year-old set to hit free agency at the end of the season. Panthers coach Paul Maurice, fully aware of Bennett’s pending free agency, made sure to issue a warning to any teams interested in his squad’s leading postseason scorer. “Horrible attitude,” Maurice quipped during a midgame television interview. “I think he’s got bubonic plague. Dengue fever. He’s got a whole bunch of things. We’re not sure he can be cured.” **Newsletter** **National Sports** **National Sports** **Matt Vogt once chose dentistry over golf. Back home at the US Open, he’s learned he didn’t have to** **Matt Vogt once chose dentistry over golf. Back home at the US Open, he’s learned he didn’t have to** **Seattle fills out forward group, while Vancouver emphasizes defense following PWHL expansion draft** **Seattle fills out forward group, while Vancouver emphasizes defense following PWHL expansion draft** PWHL Seattle GM Meghan Turner can already envision having her top two lines in place with a group of forwards led ... **College World Series will feature some Pac-12 nostalgia. ‘This is for the West,’ UCLA coach says** **College World Series will feature some Pac-12 nostalgia. ‘This is for the West,’ UCLA coach says** OMAHA, Neb. (AP) — The ghosts of the old Pac-12 will be lurking at Charles Schwab Field this weekend when the ... **Xander Schauffele is a sick man when it comes to golf’s toughest test. He loves the US Open** **Xander Schauffele is a sick man when it comes to golf’s toughest test. He loves the US Open** **From a massive hit to a breakaway goal: Sam Bennett’s unforgettable moment in the Stanley Cup Final** **From a massive hit to a breakaway goal: Sam Bennett’s unforgettable moment in the Stanley Cup Final** SUNRISE, Fla. (AP) — In a single shift, Florida Panthers forward Sam Bennett showed why he's been one of the most ... **Nashville grows from ‘not a soccer city’ to hosting Club World Cup matches** **Nashville grows from ‘not a soccer city’ to hosting Club World Cup matches** NASHVILLE, Tenn. (AP) — Soccer enthusiasts in Music City once numbered so few that when a fan spotted someone ... MOST READ **Shottle Bop wins Wisconsin Guts Championship** **Shottle Bop wins Wisconsin Guts Championship** **Xander Schauffele is a sick man when it comes to golf's toughest test. He loves the US Open** **Xander Schauffele is a sick man when it comes to golf's toughest test. He loves the US Open** **Vickie Aro** **Vickie Aro** **Nashville grows from 'not a soccer city' to hosting Club World Cup matches** **Nashville grows from 'not a soccer city' to hosting Club World Cup matches** **William Kotila** **William Kotila** **Mary Sager** **Mary Sager** **Newsletter** **Starting at $3.50/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsBusinessFeaturesObituaries Local News Business Features Obituaries Local News Business Features Obituaries SportsLocal SportsSports columnsMichigan SportsNational Sports Local Sports Sports columns Michigan Sports National Sports Local Sports Sports columns Michigan Sports National Sports OpinionEditorialColumnsLetters to the Editor Editorial Columns Letters to the Editor Editorial Columns Letters to the Editor ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Ogden News Publishing of Michigan, Inc. | https://www.mininggazette.com | P.O. Box 368, Houghton, MI 49931 | 906-482-1500"}