{"id": 355, "name": "Denver Post", "domain": "denverpost.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.denverpost.com/2025/06/05/roman-holiday-denver-now-has-a-nonstop-flight-to-the-colosseum-trevi-fountain-and-pasta-galore/", "title": "Roman Holiday Denver Now Has A Nonstop Flight To The Colosseum Trevi Fountain And Pasta Galore", "content": "NewsLatest HeadlinesColorado NewsPoliticsElection 2024Crime and Public SafetyCourtsNational NewsWorld NewsEducationHealthEnvironmentTransportationHousingNews ObituariesPhotosVideoYour HubWeather Latest Headlines Colorado News Politics Election 2024 Crime and Public Safety Courts National News World News Education Health Environment Transportation Housing News Obituaries Photos Video Your Hub Weather Latest Headlines Colorado News Politics Election 2024 Crime and Public Safety Courts National News World News Education Health Environment Transportation Housing News Obituaries Photos Video Your Hub Weather SportsSportsSports ColumnistsDenver BroncosColorado RockiesDenver NuggetsColorado AvalancheColorado RapidsOlympicsCollege SportsPrepsBettingGolfBoxing / MMASports on TV/RadioSports PodcastsOlympics Sports Sports Columnists Denver Broncos Colorado Rockies Denver Nuggets Colorado Avalanche Colorado Rapids Olympics College Sports Preps Betting Golf Boxing / MMA Sports on TV/Radio Sports Podcasts Olympics Sports Sports Columnists Denver Broncos Colorado Rockies Denver Nuggets Colorado Avalanche Colorado Rapids Olympics College Sports Preps Betting Golf Boxing / MMA Sports on TV/Radio Sports Podcasts Olympics BusinessBusinessReal EstateAirlinesEconomyEnergyRetailTechnologyBest Reviews Business Real Estate Airlines Economy Energy Retail Technology Best Reviews Business Real Estate Airlines Economy Energy Retail Technology Best Reviews The KnowThe KnowFood and DrinkArtCultureMoviesTV & StreamingMusicTheaterTravelFamily FriendlyBarsBeer The Know Food and Drink Art Culture Movies TV & Streaming Music Theater Travel Family Friendly Bars Beer The Know Food and Drink Art Culture Movies TV & Streaming Music Theater Travel Family Friendly Bars Beer OutdoorsOutdoorsHikingFall ColorsCyclingFitnessRunningCampingFishingHuntingWater SportsSkiingSnowboardingWinter Sports Outdoors Hiking Fall Colors Cycling Fitness Running Camping Fishing Hunting Water Sports Skiing Snowboarding Winter Sports Outdoors Hiking Fall Colors Cycling Fitness Running Camping Fishing Hunting Water Sports Skiing Snowboarding Winter Sports OpinionOpinionEditorialsColumnistsLettersCartoonsEndorsements Opinion Editorials Columnists Letters Cartoons Endorsements Opinion Editorials Columnists Letters Cartoons Endorsements ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Things To DoThings To DoEvent CalendarTelevision ListingsComicsGamesHoroscopesAsk AmyHome & GardenFree and CheapCannabisRecipesDenver Post Store Things To Do Event Calendar Television Listings Comics Games Horoscopes Ask Amy Home & Garden Free and Cheap Cannabis Recipes Denver Post Store Things To Do Event Calendar Television Listings Comics Games Horoscopes Ask Amy Home & Garden Free and Cheap Cannabis Recipes Denver Post Store ClassifiedsClassifiedsAutomotiveHomesJobs Classifieds Automotive Homes Jobs Classifieds Automotive Homes Jobs Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for Newsletters and Alerts **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Subscribe Log In Sign up for Newsletters and Alerts Subscribe Log In Food and Drink Art Culture Movies TV & Streaming Music Theater Travel Family Friendly Bars Beer Trending: Rockies Futility Tracker ⚾ Colorado measles exposure tracker **Roman holiday: Denver now has a nonstop flight to the Colosseum, Trevi Fountain and pasta galore** **Rome is an ideal destination for solo female travelers, one of the fastest-growing travel segments** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Two men — one younger, one older — are sitting quietly under a light gray awning, cleaning dozens of artichokes. Clear bags between their legs are slowly filling with the tough, green and purple outer leaves. I’m benefitting from their hard work: A fried artichoke sits on the plate in front of me (next to an Aperol Spritz, naturally). It’s shaped almost like a flattened dahlia, with its charred, golden-brown edges crisp and curling. It’s early May and nearing the end of artichoke, or carciofi as they’re called in Italian, season. At Il Giardino Romano restaurant, I’ve stumbled across one of Rome’s most traditional dishes: carciofi alla giudia, or Jewish-style artichokes, so called because they were first served by Italian Jews — a community that was forcibly relocated to a ghetto near the River Tiber in the mid-1500s. It’s the same area I’m sitting in now. Like much of Rome, the neighborhood is a juxtaposition of time periods. From the restaurant, one can look at the ruins of Portico d’Ottavia, which were once a public meeting space before evolving into a fish market and a church. A 10-minute walk takes you to the imposing Monument to Vittorio Emanuele II, with its towering columns and grandiose sculptures. Rome does this. It surprises you. One minute, you’re shopping for a leather bag, the next, you round a corner and are suddenly confronted with Trajan’s Forum, the last of the Imperial forums to be constructed in ancient Rome. These spontaneous encounters are part of the beauty of the Eternal City, a place that’s easier than ever for Denverites to visit:In May, United Airlines launched a nonstop flight between Denver International Airport and Rome. The airport’s first direct route to Italy is offered daily between May 1 and September 24. “These are our peak travel months,” said Jonna McGrath, United’s vice president of airport operations in Denver. “There’s always a chance it goes year-round. It depends on what the demand is.” (Full disclosure: United hosted my flight.) Rome is known to be a relatively safe city (though tourists should be careful about pickpockets around popular sites) and easy to get around. In other words, it’s an ideal destination for solo female travelers like me, one of the fastest-growing travel segments. The travel company Virtuoso reported that “wander women” make up 71% of solo travelers, while Hilton’s 2025 trends report found that close to half of respondents said they often travel by themselves (a group the hotel chain refers to as “MeMooners”). The solo travel market is anticipated to grow by 9.1% between 2023 and 2030. As the most populated city in Italy and one of the largest, Rome is known for its “beautiful chaos.” The streets buzz with people and cars and motorbikes and buses. There are endless neighborhoods, restaurants and sites to explore. Lone travelers can benefit from having at least one destination in mind — a venue that can serve as a launching point before allowing curiosity, and Rome’s maze of streets and alleyways, to take the lead. Start, for instance, with a dose a fresh air following your overnight flight. Villa Borghese is considered the city’s “green lung” and is situated close to the luxurious InterContinental Rome Ambasciatori Palace hotel. The 197-acre park and its gardens were first developed in 1606. (The Galleria Borghese houses one of the city’s most esteemed art collections; reserve tickets well in advance of your visit.) From there, take a leisurely, mile-long stroll to some of the key tourist attractions: the Spanish Steps, which burst in hues of pink and white when azaleas decorate them in the spring; the Trevi Fountain (visit early in the morning to avoid the lengthy line of people waiting to toss a coin in the turquoise water); and the Pantheon. Save the Colosseum, one of the New Seven Wonders of the World, and the Roman Forum for another day, when you take ample time to explore the blocks-long complex. (It’s worth booking guided tickets in advance to get the most out of the experience.) A visit in late afternoon offers a view unlike any other: As golden hour approaches, the Colosseum is set ablaze with the last of the sunlight, as if the ball of fire has been purposefully hung to light this one singular feature. Reward yourself — and give your feet a break — at Fatamorgana’s Monti location, where dozens of gelato flavors await. Or stop at whichever trattoria, enoteca (wine bars) or bar (where you’ll also find coffee) appeals as you walk. Rome is particularly well-known for its pizza; if an option topped with anchovies and zucchini blossoms (fiori di zucca) is available, order it. The city also specializes in two kinds of pasta, carbonara and Amatriciana. **Related Articles** Jeffco, RTD hope to test Red Rocks public transportation project this fall NTSB finds fuel leak and improperly installed parts in the engine of an airliner that caught fire in Denver 7 pet-friendly Colorado hotels for your next getaway or roadtrip Colorado has now recorded 10 measles cases this year as airport outbreak grows Colorado weather, RTD issues snarl Memorial Day travel at DIA There are enough crowded tourist locales to fill an entire visit to Rome, but it’s worth going off the beaten path, too. A short bus ride from the historic center takes you to Trastevere, a residential neighborhood of cobblestone streets and local restaurants that’s considered by some to be the true heart of Rome. Walking 20 minutes uphill from the bustling Piazza di Santa Maria takes you to Gianicolo Hill (also known as Janiculum Hill). The overlook, sometimes considered Rome’s eighth hill, is the site of a significant battle in the fight for Italy’s unification back in 1849 (hence the many sculptures that line the area, including a massive bronze monument to one of the country’s forefathers, Giuseppe Garibaldi, at the top), but it’s as well-loved for the views it affords over the Eternal City. If you’re lucky, a busker will be playing music, inviting a few moments of calm amid the chaos. Subscribe to our weekly newsletter, In The Know, to get entertainment news sent straight to your inbox. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Policies Report an Error Contact Us Submit a News Tip **RevContent Feed** **Most Popular** $71 million gondola construction underway in Idaho Springs$71 million gondola construction underway in Idaho Springs **$71 million gondola construction underway in Idaho Springs** **$71 million gondola construction underway in Idaho Springs** MyPillow CEO Mike Lindell takes stand in Denver defamation trial, continues attacks on plaintiffMyPillow CEO Mike Lindell takes stand in Denver defamation trial, continues attacks on plaintiff **MyPillow CEO Mike Lindell takes stand in Denver defamation trial, continues attacks on plaintiff** **MyPillow CEO Mike Lindell takes stand in Denver defamation trial, continues attacks on plaintiff** Jeffco, RTD hope to test Red Rocks public transportation project this fallJeffco, RTD hope to test Red Rocks public transportation project this fall **Jeffco, RTD hope to test Red Rocks public transportation project this fall** **Jeffco, RTD hope to test Red Rocks public transportation project this fall** RTD routes detoured, suspended for Denver protestsRTD routes detoured, suspended for Denver protests **RTD routes detoured, suspended for Denver protests** **RTD routes detoured, suspended for Denver protests** Green Dragon dispensary chain shuttering Denver grow facilityGreen Dragon dispensary chain shuttering Denver grow facility **Green Dragon dispensary chain shuttering Denver grow facility** **Green Dragon dispensary chain shuttering Denver grow facility** Colorado protesters push back after Douglas County town orders them to cancel ‘No Kings’ rallyColorado protesters push back after Douglas County town orders them to cancel 'No Kings' rally **Colorado protesters push back after Douglas County town orders them to cancel ‘No Kings’ rally** **Colorado protesters push back after Douglas County town orders them to cancel ‘No Kings’ rally** Denver protesters march against ICE; police arrest 17, fire pepper balls to disperse crowdsDenver protesters march against ICE; police arrest 17, fire pepper balls to disperse crowds **Denver protesters march against ICE; police arrest 17, fire pepper balls to disperse crowds** **Denver protesters march against ICE; police arrest 17, fire pepper balls to disperse crowds** On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicampOn red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp **On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp** **On red zone-heavy day, Bo Nix mixes it up with defenders at Broncos minicamp** Olive & Finch doubles down on downtown DenverOlive & Finch doubles down on downtown Denver **Olive & Finch doubles down on downtown Denver** **Olive & Finch doubles down on downtown Denver** Friends of Denver hairdresser who was missing two months remember her as ‘full of life, creativity and love’Friends of Denver hairdresser who was missing two months remember her as 'full of life, creativity and love' **Friends of Denver hairdresser who was missing two months remember her as ‘full of life, creativity and love’** **Friends of Denver hairdresser who was missing two months remember her as ‘full of life, creativity and love’** **More in Travel** Lookout Mountain’s next vendor will focus on Native American food and goods **Lookout Mountain’s next vendor will focus on Native American food and goods** **Lookout Mountain’s next vendor will focus on Native American food and goods** Here’s where Rocky Mountain National Park ranks in a list of the best parks for hiking **Here’s where Rocky Mountain National Park ranks in a list of the best parks for hiking** **Here’s where Rocky Mountain National Park ranks in a list of the best parks for hiking** 7 pet-friendly Colorado hotels for your next getaway or roadtrip **7 pet-friendly Colorado hotels for your next getaway or roadtrip** **7 pet-friendly Colorado hotels for your next getaway or roadtrip** 3 places to stroll in the fresh Colorado air and experience art sanctuaries **3 places to stroll in the fresh Colorado air and experience art sanctuaries** **3 places to stroll in the fresh Colorado air and experience art sanctuaries** 2025 June 5 SubscribeNews AlertsSubmit a News Tip News Alerts Submit a News Tip News Alerts Submit a News Tip Member ServicesBecome a MemberPlace a HoldDigital Replica EditionSitemap Become a Member Place a Hold Digital Replica Edition Sitemap Become a Member Place a Hold Digital Replica Edition Sitemap ClassifiedsAutosReal EstateJobs Autos Real Estate Jobs Autos Real Estate Jobs Contact UsCareersDenver Post StorePlace an ObituaryAdvertise With UsNetwork AdvertisingPrivacy PolicyAccessibility Careers Denver Post Store Place an Obituary Advertise With Us Network Advertising Privacy Policy Accessibility Careers Denver Post Store Place an Obituary Advertise With Us Network Advertising Privacy Policy Accessibility Today’s Front PageBack IssuesArchivesMobile Apps Back Issues Archives Mobile Apps Back Issues Archives Mobile Apps Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Site Map Ethics Policy Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}