{"id": 373, "name": "Drug Policy Alliance", "domain": "drugpolicy.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://drugpolicy.org/news/700-families-with-loved-ones-lost-to-overdose-release-open-letter-to-trump-prioritize-health-over-punishment/", "title": "700 Families With Loved Ones Lost To Overdose Release Open Letter To Trump Prioritize Health Over Punishment", "content": "IssuesReduce Harms of FentanylPrevent Overdose DeathsAddress Public Drug Use & Street ConditionsIncrease Access to Addiction ServicesPrioritize Health, End Criminal PenaltiesRemove Barriers to Work, Care, & SupportsRegulate Drugs for Health & SafetyLegalize Marijuana RightCenter Health in U.S. Foreign Drug Policy Reduce Harms of Fentanyl Prevent Overdose Deaths Address Public Drug Use & Street Conditions Increase Access to Addiction Services Prioritize Health, End Criminal Penalties Remove Barriers to Work, Care, & Supports Regulate Drugs for Health & Safety Legalize Marijuana Right Center Health in U.S. Foreign Drug Policy Reduce Harms of Fentanyl Prevent Overdose Deaths Address Public Drug Use & Street Conditions Increase Access to Addiction Services Prioritize Health, End Criminal Penalties Remove Barriers to Work, Care, & Supports Regulate Drugs for Health & Safety Legalize Marijuana Right Center Health in U.S. Foreign Drug Policy ResourcesResource LibraryDrug FactsDrug War StatsDrug War HistoryDrug Criminalization Impacts (Map) Resource Library Drug Facts Drug War Stats Drug War History Drug Criminalization Impacts (Map) Resource Library Drug Facts Drug War Stats Drug War History Drug Criminalization Impacts (Map) Take ActionCampaignsBecome a MemberSign Up for NewsletterGive a GiftAttend Reform Conference Campaigns Become a Member Sign Up for Newsletter Give a Gift Attend Reform Conference Campaigns Become a Member Sign Up for Newsletter Give a Gift Attend Reform Conference AboutWinsOur TeamNewsroomFinancialsCareersContact Wins Our Team Newsroom Financials Careers Contact Wins Our Team Newsroom Financials Careers Contact Donate Join Give Monthly Donor Advised Funds (DAFs) Other Ways to Give IssuesReduce Harms of FentanylPrevent Overdose DeathsAddress Public Drug Use & Street ConditionsIncrease Access to Addiction ServicesPrioritize Health, End Criminal PenaltiesRemove Barriers to Work, Care, & SupportsRegulate Drugs for Health & SafetyLegalize Marijuana RightCenter Health in U.S. Foreign Drug Policy Reduce Harms of Fentanyl Prevent Overdose Deaths Address Public Drug Use & Street Conditions Increase Access to Addiction Services Prioritize Health, End Criminal Penalties Remove Barriers to Work, Care, & Supports Regulate Drugs for Health & Safety Legalize Marijuana Right Center Health in U.S. Foreign Drug Policy Reduce Harms of Fentanyl Prevent Overdose Deaths Address Public Drug Use & Street Conditions Increase Access to Addiction Services Prioritize Health, End Criminal Penalties Remove Barriers to Work, Care, & Supports Regulate Drugs for Health & Safety Legalize Marijuana Right Center Health in U.S. Foreign Drug Policy ResourcesResource LibraryDrug FactsDrug War StatsDrug War HistoryDrug Criminalization Impacts (Map) Resource Library Drug Facts Drug War Stats Drug War History Drug Criminalization Impacts (Map) Resource Library Drug Facts Drug War Stats Drug War History Drug Criminalization Impacts (Map) Take ActionCampaignsBecome a MemberSign Up for NewsletterGive a GiftAttend Reform Conference Campaigns Become a Member Sign Up for Newsletter Give a Gift Attend Reform Conference Campaigns Become a Member Sign Up for Newsletter Give a Gift Attend Reform Conference AboutWinsOur TeamNewsroomFinancialsCareersContact Wins Our Team Newsroom Financials Careers Contact Wins Our Team Newsroom Financials Careers Contact Donate Join Give Monthly Donor Advised Funds (DAFs) Other Ways to Give **700 Families with Loved Ones Lost to Overdose Release Open Letter to Trump: Prioritize Health Over Punishment** Kristen Millnick[email protected] Washington, D.C. –In advance of Mother’s Day,more than 700 families with loved ones lost to overdose just released an open letterto President Trump and Congress. They are urging lawmakers to embrace lifesaving health responses to the overdose crisis and reject punitive policies. Trump often uses stories from grieving parents to emphasize the threat of fentanyl and justify more enforcement. Now, American parents and families are raising the alarm on Trump’sdevastating cutsto addiction treatment and overdose prevention programs, advocating for him to invest funding in these lifesaving measures instead. Theletterincludes a moving plea to President Trump and lawmakers: “Every day, we wake up missing someone we love. The pain can feel unbearable, and we don’t want others to suffer the same devastating loss. We are fighting to save lives—so no other parent or family member has to bury their loved one and endure the pain and grief of this horrific loss. Please don’t let another family join our ranks. Save lives by prioritizing public health over punishment. Thousands of families are counting on you.” “Mother’s Day is especially difficult for me because I lost my son, Tyler, to a fentanyl and xylazine overdose. He wanted to recover, but stigma and red tape prevented him from accessing the treatment that he needed. Now, President Trump is creating more barriers for American families,”said Susan Ousterman,Founder of the Vilomah Memorial Foundation. “The Trump administration has used fentanyl to create fear and push for enforcement—but it was never about saving our kids. The real story is in the cuts to naloxone, Medicaid, and long-term care. I wouldn’t wish this grief on any other parent, but these cuts almost guarantee more children will be lost to overdose. This is why I’ve joined more than 700 families in asking President Trump to invest in treatment, overdose prevention, and health services.” Families are calling on Trump and Congress to protect federal funding and prioritize health interventions that prevent overdose deaths. They want fewer barriers to treatment, greater access to lifesaving addiction medications, and increased distribution of naloxone to communities that need it most. They are cautioning against harsh drug laws that cycle Americans in and out of jail, increase their risk of overdose, and make people afraid to seek help in an emergency. This letter, a collaboration betweenBroken No Moreand theDrug Policy Alliance, has been released in advance of the “Save Lives, Stop the New War on Drugs” delegation visit to Capitol Hill. From May 14th to 15th, a coalition of parents who lost their children to overdose or have children struggling with addiction will meet with elected officials to share their personal stories and oppose escalating violence with other countries under the guise of addressing the overdose crisis. “I lost my only child, Jeff, to an overdose. No other parent should have to endure the pain and grief I live with every day of my life. This is why I oppose the punitive drug polices and catastrophic federal funding cuts proposed by the Trump administration. Instead of keeping our kids safe from fentanyl and overdose, these policies will result in nothing but more harm, more death, and more parents burying their children. To save lives, we need to invest in health-based policies and President Trump must preserve funding for addiction treatment, overdose prevention, and other health solutions that are proven to keep people safe,”said Denise Cullen, Co-Founder and Board Member of Broken No More. “I lost a family member to overdose. I know how important it is for our families to receive the care and support they need,”said Kassandra Frederique, Executive Director at the Drug Policy Alliance. “These cuts in federal funding to overdose prevention and health services will worsen an overdose crisis that already takes nearly 90,000 lives each year. This Mother’s Day, we must stand behind the more than 700 families who are bravely fighting for care over criminalization. Their message is abundantly clear—Americans need health interventions that save lives and support recovery.” All names of family members who signed the letter in honor of their loved ones can befound here.To join the call to action, those with loved ones lost to overdose canadd their name to the letter here. ### About the Drug Policy Alliance The Drug Policy Alliance (DPA)addresses the harms of drug use and drug criminalization through policy solutions, organizing, and public education. We advocate for a holistic approach to drugs that prioritizes health, social supports, and community wellbeing. DPA opposes punitive approaches that destabilize people, block access to care, and drain communities of resources. We believe that the regulation of drugs should be grounded in evidence, health, equity, and human rights. In collaboration with other movements, we change laws, advance justice, and save lives. About Broken No More Broken No Moreis an organization formed by families and friends of those suffering from a substance use disorder. We have lived the trauma of addiction with our loved ones and we have experienced the devastating effects caused by the drug policies of prohibition and criminalization. Far too many of us have experienced the loss of a loved one from overdose because of these policies. Broken No More was formed with the mission of supporting and promoting more enlightened drug policies that will reduce the stigma of drug use and keep other parents and family members from losing the one they love to overdose. **Sign up for updates from DPA.** Careers Financials Newsroom Contact Us Become a Member Privacy Policy Terms & Conditions © Copyright 2025 Drug Policy Alliance. All rights reserved. Drug Policy Alliance is a 501(C)(3) nonprofit registered in the US underEIN: 52-1516692 Made withlovebyCreatives with a Conscience"}