{"id": 347, "name": "Defenseworld.net", "domain": "defenseworld.net", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.defenseworld.net/2025/06/11/spartan-planning-wealth-management-has-1-93-million-stock-position-in-amazon-com-inc-nasdaqamzn.html", "title": "Spartan Planning Wealth Management Has 1 93 Million Stock Position In Amazon Com Inc Nasdaqamzn.html", "content": "Home About Us Account Privacy Policy Contact Us AirArmamentEnginesFighter AircraftHelicopters Armament Engines Fighter Aircraft Helicopters Armament Engines Fighter Aircraft Helicopters LandArmored Vehicles and TanksOrdinance and ArtilleryPersonnel EquipmentSmall Arms Armored Vehicles and Tanks Ordinance and Artillery Personnel Equipment Small Arms Armored Vehicles and Tanks Ordinance and Artillery Personnel Equipment Small Arms Missiles and SpaceAir DefenseMilitary SatellitesMissile Technology Air Defense Military Satellites Missile Technology Air Defense Military Satellites Missile Technology Naval Civil AviationAccidentsAirlinesEnginesManufacturersMRO Accidents Airlines Engines Manufacturers MRO Accidents Airlines Engines Manufacturers MRO EconomyManagement AppointmentsMarket Trends and FinanceMergers and Acquisitions Management Appointments Market Trends and Finance Mergers and Acquisitions Management Appointments Market Trends and Finance Mergers and Acquisitions Companies Home About Us Account Privacy Policy Contact Us AirArmamentEnginesFighter AircraftHelicopters Armament Engines Fighter Aircraft Helicopters Armament Engines Fighter Aircraft Helicopters LandArmored Vehicles and TanksOrdinance and ArtilleryPersonnel EquipmentSmall Arms Armored Vehicles and Tanks Ordinance and Artillery Personnel Equipment Small Arms Armored Vehicles and Tanks Ordinance and Artillery Personnel Equipment Small Arms Missiles and SpaceAir DefenseMilitary SatellitesMissile Technology Air Defense Military Satellites Missile Technology Air Defense Military Satellites Missile Technology Naval Civil AviationAccidentsAirlinesEnginesManufacturersMRO Accidents Airlines Engines Manufacturers MRO Accidents Airlines Engines Manufacturers MRO EconomyManagement AppointmentsMarket Trends and FinanceMergers and Acquisitions Management Appointments Market Trends and Finance Mergers and Acquisitions Management Appointments Market Trends and Finance Mergers and Acquisitions Companies **Spartan Planning & Wealth Management Has $1.93 Million Stock Position in Amazon.com, Inc. (NASDAQ:AMZN)** Posted byDefense World StaffonJun 11th, 2025 Spartan Planning & Wealth Management decreased its position inAmazon.com, Inc.(NASDAQ:AMZN) by 41.1% in the 1st quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The institutional investor owned 10,119 shares of the e-commerce giant’s stock after selling 7,067 shares during the period. Amazon.com comprises approximately 1.9% of Spartan Planning & Wealth Management’s holdings, making the stock its 16th largest holding. Spartan Planning & Wealth Management’s holdings in Amazon.com were worth $1,925,000 at the end of the most recent reporting period. Other large investors have also recently added to or reduced their stakes in the company. Castlekeep Investment Advisors LLC acquired a new position in shares of Amazon.com in the 4th quarter worth approximately $25,000. Accordant Advisory Group Inc raised its holdings in shares of Amazon.com by 400.0% in the 4th quarter. Accordant Advisory Group Inc now owns 125 shares of the e-commerce giant’s stock worth $27,000 after buying an additional 100 shares in the last quarter. Prudent Man Investment Management Inc. acquired a new position in shares of Amazon.com in the 4th quarter worth approximately $27,000. LSV Asset Management acquired a new position in shares of Amazon.com in the 4th quarter worth approximately $35,000. Finally, Perritt Capital Management Inc raised its holdings in shares of Amazon.com by 72.7% in the 4th quarter. Perritt Capital Management Inc now owns 190 shares of the e-commerce giant’s stock worth $42,000 after buying an additional 80 shares in the last quarter. Institutional investors and hedge funds own 72.20% of the company’s stock. **Amazon.com Stock Up 0.3%** NASDAQ:AMZNopened at $217.61 on Wednesday. The stock’s fifty day simple moving average is $193.04 and its 200-day simple moving average is $209.02. Amazon.com, Inc. has a 12-month low of $151.61 and a 12-month high of $242.52. The firm has a market capitalization of $2.31 trillion, a P/E ratio of 39.35, a P/E/G ratio of 1.50 and a beta of 1.33. The company has a quick ratio of 0.87, a current ratio of 1.06 and a debt-to-equity ratio of 0.18. Amazon.com (NASDAQ:AMZN–Get Free Report) last released its quarterly earnings results on Thursday, May 1st. The e-commerce giant reported $1.59 earnings per share (EPS) for the quarter, beating the consensus estimate of $1.38 by $0.21. Amazon.com had a return on equity of 24.25% and a net margin of 9.29%. The firm had revenue of $155.67 billion for the quarter, compared to the consensus estimate of $154.96 billion. During the same quarter last year, the business posted $0.98 EPS. The company’s revenue for the quarter was up 8.6% on a year-over-year basis. Equities research analysts expect that Amazon.com, Inc. will post 6.31 earnings per share for the current year. **Wall Street Analyst Weigh In** A number of equities analysts have recently issued reports on the company. Deutsche Bank Aktiengesellschaft dropped their target price on Amazon.com from $287.00 to $206.00 and set a “buy” rating for the company in a report on Monday, April 14th. UBS Group reissued a “buy” rating on shares of Amazon.com in a report on Tuesday, May 6th. Jefferies Financial Group dropped their target price on Amazon.com from $250.00 to $240.00 and set a “buy” rating for the company in a report on Tuesday, April 22nd. DA Davidson dropped their price target on Amazon.com from $280.00 to $230.00 and set a “buy” rating for the company in a report on Monday, April 14th. Finally, Truist Financial dropped their price target on Amazon.com from $265.00 to $230.00 and set a “buy” rating for the company in a report on Thursday, April 10th. Four investment analysts have rated the stock with a hold rating and forty-four have given a buy rating to the company. According to MarketBeat.com, Amazon.com has a consensus rating of “Moderate Buy” and a consensus target price of $244.89. Get Our Latest Research Report on AMZN **Insider Buying and Selling at Amazon.com** In related news, VPShelley Reynoldssold 2,695 shares of Amazon.com stock in a transaction dated Wednesday, May 21st. The stock was sold at an average price of $200.79, for a total value of $541,129.05. Following the sale, the vice president now owns 119,780 shares of the company’s stock, valued at approximately $24,050,626.20. The trade was a 2.20% decrease in their ownership of the stock. The transaction was disclosed in a legal filing with the Securities & Exchange Commission, which can be accessed throughthe SEC website. Also, CEOAndrew R. Jassysold 19,872 shares of Amazon.com stock in a transaction dated Wednesday, May 21st. The shares were sold at an average price of $201.30, for a total value of $4,000,233.60. Following the completion of the sale, the chief executive officer now directly owns 2,148,694 shares in the company, valued at approximately $432,532,102.20. This represents a 0.92% decrease in their position. The disclosure for this sale can be foundhere. Insiders have sold 102,037 shares of company stock valued at $20,531,075 in the last 90 days. 9.70% of the stock is currently owned by company insiders. **Amazon.com Profile** (Free Report) Amazon.com, Inc engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. **Read More** Five stocks we like better than Amazon.com Most Volatile Stocks, What Investors Need to Know AppLovin Dips on S&P 500 Snub, Morgan Stanley Lifts Target Anyway Retail Stocks Investing, Explained Casey’s Surges on Strong Q4, More Gains Likely Ahead How to Calculate Stock Profit Government Mandate Sends eVTOL Stocks Flying Want to see what other hedge funds are holding AMZN?Visit HoldingsChannel.comto get the latest 13F filings and insider trades for Amazon.com, Inc. (NASDAQ:AMZN–Free Report). Receive News & Ratings for Amazon.com Daily- Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Amazon.com and related companies withMarketBeat.com's FREE daily email newsletter. **« PREVIOUS HEADLINE** Amazon.com, Inc. (NASDAQ:AMZN) Shares Sold by LVM Capital Management Ltd. MI **« PREVIOUS HEADLINE** Amazon.com, Inc. (NASDAQ:AMZN) Shares Sold by LVM Capital Management Ltd. MI **NEXT HEADLINE »** O Connor Financial Group LLC Has $544,000 Holdings in Amazon.com, Inc. (NASDAQ:AMZN) **NEXT HEADLINE »** O Connor Financial Group LLC Has $544,000 Holdings in Amazon.com, Inc. (NASDAQ:AMZN) **You might be interested in:** **Recent News** Silvia Mccoll Wealth Management LLC Raises Position in Amazon.com, Inc. (NASDAQ:AMZN) First County Bank CT Has $2.86 Million Stake in Amazon.com, Inc. (NASDAQ:AMZN) Lowe Wealth Advisors LLC Has $186,000 Holdings in Amazon.com, Inc. (NASDAQ:AMZN) Summit Global Investments Reduces Holdings in Amazon.com, Inc. (NASDAQ:AMZN) Lantz Financial LLC Grows Position in Amazon.com, Inc. (NASDAQ:AMZN) DXC Technology (NYSE:DXC) Shares Sold by Rhumbline Advisers Doliver Advisors LP Grows Stake in Amazon.com, Inc. (NASDAQ:AMZN) Amazon.com, Inc. (NASDAQ:AMZN) Shares Acquired by Welch Group LLC Private Client Services LLC Purchases 139 Shares of Amazon.com, Inc. (NASDAQ:AMZN) Amazon.com, Inc. (NASDAQ:AMZN) Holdings Increased by Global Financial Private Client LLC Andrew Hill Investment Advisors Inc. Lowers Position in Amazon.com, Inc. (NASDAQ:AMZN) O Connor Financial Group LLC Has $544,000 Holdings in Amazon.com, Inc. (NASDAQ:AMZN) Spartan Planning & Wealth Management Has $1.93 Million Stock Position in Amazon.com, Inc. (NASDAQ:AMZN) Somerset Trust Co Has $372,000 Position in Amazon.com, Inc. (NASDAQ:AMZN) Rothschild Investment LLC Reduces Position in Amazon.com, Inc. (NASDAQ:AMZN) Amazon.com, Inc. (NASDAQ:AMZN) Shares Sold by LVM Capital Management Ltd. MI IFG Advisors LLC Sells 283 Shares of Amazon.com, Inc. (NASDAQ:AMZN) S.E.E.D. Planning Group LLC Buys 3,730 Shares of Amazon.com, Inc. (NASDAQ:AMZN) Amazon.com, Inc. (NASDAQ:AMZN) Stock Position Lowered by Burns J W & Co. Inc. NY Parallel Advisors LLC Reduces Stock Position in Amazon.com, Inc. (NASDAQ:AMZN) Home About Us Account Privacy Policy Contact Us"}