{"id": 1186, "name": "Retraction Watch", "domain": "retractionwatch.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://retractionwatch.com/2025/06/07/weekend-reads-a-university-integrity-index-surgeon-falsely-claims-harvard-ph-d-more-on-gold-standard-science-executive-order/#more-132086", "title": "Weekend Reads A University Integrity Index Surgeon Falsely Claims Harvard Ph D More On Gold Standard Science Executive Order", "content": "Retraction Watch Tracking retractions as a window into the scientific process **Get Retraction Watch in your inbox** Get the latest news from Retraction Watch and beyond Monday through Friday, plus Weekend Reads each Saturday. **Retraction Watch Lists** The Retraction Watch Leaderboard Retractions by Nobel Prize winners Top 10 most highly cited retracted papers The Retraction Watch Mass Resignations List The Retraction Watch Hijacked Journal Checker Papers and peer reviews with evidence of ChatGPT writing Retracted coronavirus (COVID-19) papers **Search Retraction Watch** **Retraction Watch Database** Database User Guide View the Database **About Retraction Watch** Meet the Retraction Watch staffAbout Adam MarcusAbout Ivan Oransky About Adam Marcus About Ivan Oransky About Adam Marcus About Ivan Oransky The Center For Scientific IntegrityBoard of Directors Board of Directors Board of Directors The Retraction Watch FAQ, including comments policy Papers that cite Retraction Watch What people are saying about Retraction Watch Invite us to speak **Recent Comments** owlbertonJournal tells author it’s retracting three papers for concept that ‘violates’ law of thermodynamics OraconApparent NCI director candidate wants ‘open, respectful’ post-publication peer review while promoting anonymous site that calls sleuths a ‘mob’ JohnonApparent NCI director candidate wants ‘open, respectful’ post-publication peer review while promoting anonymous site that calls sleuths a ‘mob’ **Archives** **Weekend reads: A university ‘integrity index’; surgeon falsely claims Harvard Ph.D.; more on ‘gold standard science’ executive order** Dear RW readers,can you spare $25? The week at Retraction Watch featured: NIH-funded replication studies are not the answer to the reproducibility crisis inpre-clinical research $900,000 grant to Retraction Watch’s parent organization will fund forensic analysis of articles thataffect human health. A link toNature’s coverage ‘Anyone can do this’: Sleuths publish a toolkit forpost-publication review Fourth retraction for Italian scientist comes 11 years after sleuthsflagged paper 10 years after the downfall of a same-sex marriage canvassing study, tenure, some better practices —and an engagement Our list of retracted or withdrawn COVID-19 papers isup past 500. There are more than59,000 retractions in The Retraction Watch Database— which is nowpart of Crossref. The Retraction Watch Hijacked Journal Checkernow contains more than 300 titles. And have you seen our leaderboard ofauthors with the most retractions lately— or our list oftop 10 most highly cited retracted papers? What aboutThe Retraction Watch Mass Resignations List— or ourlist of nearly 100 papers with evidence they were written by ChatGPT? Here’s what was happening elsewhere (some of these items may be paywalled, metered access, or require free registration to read): “‘Integrity index’ flags universities with highretraction rates.” Plastic surgeon suspended after he “falsely gave the impression” he had aPhD from Harvard. “The White House Gutted Science Funding. Now It Wants to ‘Correct’ Research“: More on the ‘gold standard science’executive order. medRxiv and bioRxiv cofounder makes Time’s list of 100 peopleinfluencing health. “US veterans agency orders scientists not to publish in journalswithout clearance.”Or did it? Two journals say they will no longer “consider submissions that include sports-related injury, treatment, or recovery data”that is publicly obtained. “Falling Dollar, Rising Prices”: the effect of inflation on globalbuying power for APCs. “When society publishing suffers, research suffers”: over half of surveyed societies reported flat or declined revenue frompeer-reviewed journals since 2019. “Does collaboration outside academia lead to greaterscientific impact?” Researchers say International Committee of Medical Journal Editors “Should Create a Certification System toIdentify Predatory Journals.” In survey of researchers from four countries, nearly half admitted to “deleting data point based on pure gut” or “co-authoring outof mutual benefit.” “Research integrity in Spain: Great expectations,mediocre results.” “Researchers who ‘pivot’ into new fields should not be given acitation penalty.” “Why don’t medicinal chemists from industrypublish anymore?” “Let Unfunded Grant ApplicationsSee the Light of Day.” Possible solutions to the “crisis” of biomedicalresearch reproducibility. “Bot-made art undermines research and public trust in science,say illustrators.” “When your science is attacked, how do you cope?”: Advice fromembattled researcher. “Science in the Gray Zone“: A podcast on scientific sleuthing. “A New Concept” for funding journals: “long-term public funding as a continuous task” and “quality control”through journal evaluations. “And Plato met ChatGPT”: the myth of Theuth and Thamus applied tochatbots in academic papers. Like Retraction Watch? You can make atax-deductible contribution to support our work, follow uson XorBluesky, like uson Facebook, follow uson LinkedIn, add us to yourRSS reader, or subscribe to ourdaily digest. If you find a retraction that’snot in our database, you canlet us know here. For comments or feedback, email us at[email protected]. By clicking submit, you agree to share your email address with the site owner and Mailchimp to receive marketing, updates, and other emails from the site owner. Use the unsubscribe link in those emails to opt out at any time. **Share this:** Click to email a link to a friend (Opens in new window)Email Click to share on Bluesky (Opens in new window)Bluesky Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **Related** **Leave a ReplyCancel reply** This site uses Akismet to reduce spam.Learn how your comment data is processed. **Post navigation**"}