{"id": 1696, "name": "Creation-Evolution Headlines", "domain": "crev.info", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://crev.info/2025/06/surprises-in-science-how-do-possibilities-become-realities/", "title": "Surprises In Science How Do Possibilities Become Realities", "content": "Sign in / Join Your Profile About Contact Home OriginsOrigin of LifeDarwin and EvolutionIntelligent Design Origin of Life Darwin and Evolution Intelligent Design Origin of Life Darwin and Evolution Intelligent Design SpaceSolar SystemAstronomyCosmologySETI Solar System Astronomy Cosmology SETI Solar System Astronomy Cosmology SETI Physical SciencePhysicsGeologyDating Methods Physics Geology Dating Methods Physics Geology Dating Methods BiologyMarine BiologyTerrestrial ZoologyMammalsBirdsBotany Marine Biology Terrestrial Zoology Mammals Birds Botany Marine Biology Terrestrial Zoology Mammals Birds Botany MicrobiologyCell BiologyGenetics Cell Biology Genetics Cell Biology Genetics PaleoFossilsDinosaursEarly Man Fossils Dinosaurs Early Man Fossils Dinosaurs Early Man HumanityHuman BodyMind and BrainHealthBiomimetics Human Body Mind and Brain Health Biomimetics Human Body Mind and Brain Health Biomimetics IssuesPolitics and EthicsEducationMediaPhilosophyTheology Politics and Ethics Education Media Philosophy Theology Politics and Ethics Education Media Philosophy Theology AwardsAmazing FactsDumb Ideas Amazing Facts Dumb Ideas Amazing Facts Dumb Ideas FeaturesScientist of the MonthSite MapPopular PostsAuthor ProfilesRecommended ResourcesArchive SpotlightBaloney DetectorDarwin DictionaryFunny Pages Scientist of the Month Site Map Popular Posts Author Profiles Recommended Resources Archive Spotlight Baloney Detector Darwin Dictionary Funny Pages Scientist of the Month Site Map Popular Posts Author Profiles Recommended Resources Archive Spotlight Baloney Detector Darwin Dictionary Funny Pages **Surprises in Science: How Do Possibilities Become Realities?** Does it make sense to imagine realitiesout of possibilities? Sure; a philosophersays, by committing self-deception! Real vs. Imaginary Possibility by John D. Wise, PhD Something in Deep Space Is Flashing Every 44 Minutes and No One Knows Why(Study Finds, 30 May 2025). This article is introduced in this way (bold added): In a nutshell Scientists discovered the first long-period radio transient that also emits X-rays, creatingan entirely new class of cosmic objects ASKAP J1832−0911 pulses every 44.2 minutes with both radio waves and X-rays,something that wasn’t supposed to be possible The object could be either an ancient magnetar or an ultra-magnetized white dwarf system, both of whichchallenge current theories PERTH —Something deep in the Milky Way is pulsing like clockwork, and no one knows what it is. Every 44 minutes, a mysterious space object nearly 15,000 light-years away sends out a blast of radio waves and high-energy X-rays,defying everything astronomers thought they knewabout how stars behave. It’s not a pulsar, not a black hole, andnot quite like anything we’ve ever seen before. Now, scientists say this bizarre cosmic beaconmight be rewriting the rulebook on extreme stellar physics. The article ends with this: ASKAP J1832−0911 is yet another demonstration thatthe universe is still full of surprises. In a time whenscientists often assume they’ve figured out how stars work, this one strange object proves that space still has secrets— and some of them are flashing at us every 44 minutes. A Word of Testimony As I familiarize myself with recent scientific literature for CREV, I have encountered a fascinating pattern: “Scientists have discovered X, something previously thought impossible” – fill in X with any of a great number of recent “scientific” discoveries. It is shocking—though “scientists” somehow contrive to never beshaken[1]in their beliefs—how often we read recent stories like this in biology and cosmology (especially since JWST). I am relatively new to this (rather important and serious) game of examining the failures and gaps in recent evolutionary science, both logical and evidentiary. A little more than a year ago I was a believer in the Darwinian narrative and its historical outplay, despite my developed understanding that it was Hegelianin its practice. How strange, then, to find myself writing for CREV! As ourChristian Atheistepisode, “The Structure of a Scientific Revolution” made clear, there was a moment of radical transition for me, and a new way ofseeingthe world popped into focus. Iexperienceda Kuhnian revolution. I propose that something similar, though more universal, happened in the 19thcentury. I would like to use this article to make my case. How Science Interacts with Philosophy As a philosopher my training has accustomed me to playing with words, concepts and systems of thought more readily than empirical evidence.[2]Nevertheless, I resist the idea that science and philosophy are so very distant from one another as is popularly assumed. This article highlights the thought processes of scientists in relation to empirical discoveries. Their theoretical models of reality (theory, paradigm, worldview) cause them toexpectnature to act in specifiable ways. We say that theories make predictions. When nature doesn’t comply with expectations, we get another article like this one, with the above-mentioned pattern instantiating differences only in the details. These new discoveries raise a dilemma. Does science change themodel(which, in this case, dictates that a cosmic object pulsing with both X-rays and radio waves is impossible), or find a way tomake senseof the new informationinside“the box” – in effectexplaining awaythe contradiction – the evidence. How does this relate to philosophy? Distinguishing Possibilities In Immanuel Kant’s groundbreaking magnum opus,The Critique of Pure Reason, he differentiates betweenrealpossibility andlogicalpossibility. Logical possibility is the idea that everything that is logically consistent ispossible. For instance, a married bachelor isimpossiblebecause it is contradictory. Therecan beno such animal, as the logic of combining the terms yields contradiction. However, a unicorn isnotlogically impossible, as there is nothing contradictory in the notion of a horned horse. Hence a unicorn, or a dragon, or a leprechaun islogicallypossible. Since, however, human knowledge of reality is finite, bounded by actual experience, logical possibility is insufficient to tell us what isreallypossible or impossible. Reality, as in this article, can surprise us. Perhaps as our knowledge of reality expands (as we see in this article), we will discover some new information that reveals a logical contradiction between ‘horned-creature’ and ‘horse’ (perhaps at the genetic level?). We can’t imaginewhatthat discovery might be, but neither can we deny the logical possibility that such a reality may come to light. It it did, the very meaning of our concepts “horse” and/or “horned” would have to be modified. If such a discovery were madeunicornwould be as internally incoherent asmarried bachelor. Hence, the only way to determine therealpossibility of a unicorn – that thereisno logical contradiction in its idea – is toencounterit.[3] Another way to make this point is to say thatrealitymust correct our thinkingaboutreality – our theories, paradigms, and worldviews. This is one of the foundational assumptions of systematic thought,andscience. And this consideration brings us to the facts of history. Why Philosophy and Science Parted Ways, and How to Rejoin Them Exactly when (and perhaps more interestingly,why) did science and philosophy part ways? For most of Western history what we call “science” today wasnatural philosophy.Newton’sPrincipia, considered one of the foundational texts of modern science (1687), was titled “Mathematical Principles of Natural Philosophy.” It was not until (surprised, anyone?)the 19thcenturythat what today we call “science” ceased to be considered a part of philosophy.Whenis uncontroversial and easy to answer.Whyis far more complex and interesting. In the early 1830’s (Hegel died in 1831 – coincidence?), the term “scientist” was coined byWilliam Whewell(see ourbiography). His motivation? Whewell observed an “increasing proclivity of separation and dismemberment” within the sciences. As fields like chemistry, mathematics, and natural history grew in their own right, the overarching term “philosopher” or “natural philosopher” was felt inadequate to describe the diverse individuals engaged in these pursuits. Despite the specialization, Whewell sought a term that could unite these disparate fields under a common umbrella, signifying a sharedmethod of inquiryanda commitment to empirical investigation of the material world. Whewell also aimed todistinguish the empirical, fact-driven study of nature from the more contemplative and theoretical aspects of traditional philosophy.[4] I argue that Whewell was motivated by a complex reaction to Hegelian philosophy and a profound understanding of the science of his day.[5]As an Anglican divine, Whewell opposed Darwinian evolution on two groundsin combination: 1) theological, and 2) empirico-rational. Design in natureimpliesa Designer; this is both rational and empirical. Natural selection, denying this obvious conclusion, was inadequate for Whewellas a purely rational mechanism,[6]and insufficiently supported by empirical evidence. Whewell’s criticism of Hegel was almost exclusivelyscientific. Hegel’sa priorimethod wasunscientific, as it was not empirical. You cannot unravel the contingent truths of nature by Reason alone. Whewell was a Kantian. To establish the facts of science, we need the input of reality (empiricism)to which we then apply rational categories. The conclusion to Whewell was obvious. Hegel’sa priorirationalism denies God. Darwin’s hyper-rational[7]empiricism denies God. Science, like its various increasingly specialized branches, must be a highly specialized pursuit of knowledge different anddistinct fromthe philosophical, which is (Hegel as example) speculative and insufficiently grounded in empirical investigation. Philosophy, Whewell reasoned, isspeculative,but Science is empirical. In effect, he mirrored the “increasing proclivity of separation and dismemberment” within the sciences by sequestering faith and reason, and making theunselbstandigpart(evidence-based reasoning) into thewhole– Science. Watch Those Presuppositions Unwittingly, Whewell laid the groundwork for the now-prevalent (and demonstrablyfalse) view that Science is a non-presuppositional exercise of empirical investigation that does not participate in philosophical speculation, or assumptions. Science, the establishment now dogmatically believes, ispureMethod (or Process) applied to apureobjective reality, yieldingpure“scientific” results.[8] Whewell’s solution mirrors that of Marx and Darwin – applypure rational methodto materialism but never acknowledge the contradiction. By dividing science from philosophy, he set the ground for true believers in scientism tolie to themselvesabout the uniquepurityof science. The lie-to-onself, what I call a self-deceptive structure, is one of the most prominent features of Hegelian dialectic. It allows scientists to hold their theory dogmatically, yet claim skepticism It allows Darwinists to tell stories as if theyareempirical evidence It allows scientists to claim empirical objectivity, yet deny correction by empirical evidence It allows scientists to claim skepticism, yet act with certainty It allows scientists to segregate their fundamental assumptions from correction by rationality or evidence Bringing the Lesson Home While a new discovery, like the one in this article, may rewrite the textbooks, the one thing it will never rewrite is thea prioriphilosophical commitment thatif itexists, it evolved. Because science is pure rational method applied to an empirical world,notphilosophy, science has no assumptions to question. Thishiddenphilosophical assumption makes all scientific assumptionsimmuneto being rewritten by reality. Why? Because it is founded on the denial of having philosophical assumptions, which is in turn founded on a global assumption denying what ismostevident of all: that Design implies a Designer. Denythatas conditional, and logic dictates thatanythingcan follow. That’s Imaginary Possibility, folks, a just-so story that isutterlyunfalsifiable … until it encounters the Designer. Footnotes [1]I can’t help thinking here of a passage in C.S. Lewis’s conversion narrative,Surprised by Joy, as he read G. K. Chesterton’sThe Everlasting Man: … for the first time [I] saw the whole Christian outline of history set out in a form that seemed to me to make sense.Somehow I contrived not to be too badly shaken. You will remember that I already thought Chesterton the most sensible man alive ‘apart from his Christianity.’ Now, I veritably believe, I thought—I didn’t of coursesay; words would have revealed the nonsense—that Christianity itself was very sensible ‘apart from its Christianity’. [2]Science asavocation, if not vocation, was never far from me. [3]My own view of Kantianreal possibilityis idiosyncratic, as it is built on my graduate advisor, Ermanno Bencivenga’s Kantian scholarship. His book,Kant’s Copernican Revolutionis, I think, the best of the secondary literature on the topic. [4]Taken from a Google Gemini response to the prompt, “Tell me more about William Whewell’s coining of the term ‘scientist.’” [5]Whewell was a critic of both DarwinandHegel, though for opposing reasons. [6]By excluding divine agencya prioriDarwinian natural selection segmented scientific (empirical) and rational (a priori) explanation byfiat, limiting the available rational explanations for the obvious (empirical) design in nature. [7]Hyper-rational because it denies the supernatural appeal by rationalisticfiat, not on the basis of empirical evidence. [8]To all intents and purposes, they believescientificresults are “certainties.” It is not just in the popular mind that “scientific” = certain, but also nearly universal even among scientists, no matter how much theysaythey are skeptical. For almost everyone in society today, looking for knowledge anywhereotherthan science is to practice science denial. They treat Science asthesource of knowledge. To them, ScienceisGod. John Wise received his PhD in philosophy from the University of CA, Irvine in 2004. His dissertation was titledSartre’s Phenomenological Ontology and the German Idealist Tradition. His area of specialization is 19th to early 20th century continental philosophy. He tells the story of his 25-year odyssey from atheism to Christianity in the book,Through the Looking Glass: The Imploding of an Atheist Professor’s Worldview(available on Amazon). Since his return to Christ, his research interests include developing a Christian (YEC) philosophy of science and the integration of all human knowledge with God’s word. He has taught philosophy for the University of CA, Irvine, East Stroudsburg University of PA, Grand Canyon University, American Intercontinental University, and Ashford University. He currently teaches online for the University of Arizona, Global Campus, and is a member of the Heterodox Academy. He and his wife Jenny are known online asThe Christian Atheistwith a podcast of that name, in addition to a YouTube channel: John and Jenny Wise. **Comments** DaBumpsays:June 8, 2025 at 6:47 pmYes, indeed, many things in the past few years have not fit expectations (unwritten predictions), but scientists deny they are thinking inside a box, so they can’t think of thinking outside the box! And anything outside the box wouldn’t be scientific, so even if they did think about it, they couldn’t propose it professionally! As Carl Sagan put it, the box is everything that is, and was, and will be — in their minds.Of course, you know that Darwin hadn’t made his ideas public when the term “science” was coined. However, there were other evolutionary ideas floating around, and even if Whewell had no knowledge of Hegel, there were similarly problematic philosophical and theological ideas and movements afoot.One cannot fully understand the origin of modern science and how it was off the rails from the (1830) start, without looking back at the false “science” of the Greeks (retconned in the false “Enlightenment”), contrast that with work of the Christian “natural philosophers” who turned their backs on pure rationalism and Authorities to search out the wonders of God’s creation and natural laws, and read the relevant works of Sir Francis Bacon.Another key consideration is how the good concept of “the book of nature” as a junior companion to the Book of God’s revelations (the Bible) was twisted and overblown to become first an equal, then a superior source of knowledge. From there, it was hardly a step for human research of nature (natural philosophy, the handmaid of faith) to discard anything the Bible had to say about the physical world and call itself “science.” Even church people did and continue to do that much, and it is the delight of those who turn their backs on the Bible and God entirely.Log in to Reply Yes, indeed, many things in the past few years have not fit expectations (unwritten predictions), but scientists deny they are thinking inside a box, so they can’t think of thinking outside the box! And anything outside the box wouldn’t be scientific, so even if they did think about it, they couldn’t propose it professionally! As Carl Sagan put it, the box is everything that is, and was, and will be — in their minds. Of course, you know that Darwin hadn’t made his ideas public when the term “science” was coined. However, there were other evolutionary ideas floating around, and even if Whewell had no knowledge of Hegel, there were similarly problematic philosophical and theological ideas and movements afoot. One cannot fully understand the origin of modern science and how it was off the rails from the (1830) start, without looking back at the false “science” of the Greeks (retconned in the false “Enlightenment”), contrast that with work of the Christian “natural philosophers” who turned their backs on pure rationalism and Authorities to search out the wonders of God’s creation and natural laws, and read the relevant works of Sir Francis Bacon. Another key consideration is how the good concept of “the book of nature” as a junior companion to the Book of God’s revelations (the Bible) was twisted and overblown to become first an equal, then a superior source of knowledge. From there, it was hardly a step for human research of nature (natural philosophy, the handmaid of faith) to discard anything the Bible had to say about the physical world and call itself “science.” Even church people did and continue to do that much, and it is the delight of those who turn their backs on the Bible and God entirely. Yes, indeed, many things in the past few years have not fit expectations (unwritten predictions), but scientists deny they are thinking inside a box, so they can’t think of thinking outside the box! And anything outside the box wouldn’t be scientific, so even if they did think about it, they couldn’t propose it professionally! As Carl Sagan put it, the box is everything that is, and was, and will be — in their minds. Of course, you know that Darwin hadn’t made his ideas public when the term “science” was coined. However, there were other evolutionary ideas floating around, and even if Whewell had no knowledge of Hegel, there were similarly problematic philosophical and theological ideas and movements afoot. One cannot fully understand the origin of modern science and how it was off the rails from the (1830) start, without looking back at the false “science” of the Greeks (retconned in the false “Enlightenment”), contrast that with work of the Christian “natural philosophers” who turned their backs on pure rationalism and Authorities to search out the wonders of God’s creation and natural laws, and read the relevant works of Sir Francis Bacon. Another key consideration is how the good concept of “the book of nature” as a junior companion to the Book of God’s revelations (the Bible) was twisted and overblown to become first an equal, then a superior source of knowledge. From there, it was hardly a step for human research of nature (natural philosophy, the handmaid of faith) to discard anything the Bible had to say about the physical world and call itself “science.” Even church people did and continue to do that much, and it is the delight of those who turn their backs on the Bible and God entirely. **Leave a ReplyCancel reply** You must belogged into post a comment. Contact Leave Feedback About"}