{"id": 1316, "name": "Sunlight Foundation", "domain": "sunlightfoundation.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://sunlightfoundation.com/2019/11/21/new-web-integrity-project-report-documents-changes-to-lgbtq-related-web-content-under-the-trump-administration/", "title": "New Web Integrity Project Report Documents Changes To Lgbtq Related Web Content Under The Trump Administration", "content": "**Sunlight Foundation** Facebook Twitter AboutAbout SunlightBoard & AdvisorsOur TeamOur FundingJobs About Sunlight Board & Advisors Our Team Our Funding Jobs About Sunlight Board & Advisors Our Team Our Funding Jobs Our WorkWeb Integrity ProjectOpen CitiesConflicts of Interest Web Integrity Project Open Cities Conflicts of Interest Web Integrity Project Open Cities Conflicts of Interest Blog PressOverviewPress ReleasesPolicy SuccessSubject Matter ExpertsLogos Overview Press Releases Policy Success Subject Matter Experts Logos Overview Press Releases Policy Success Subject Matter Experts Logos Contact **New Web Integrity Project report documents changes to LGBTQ-related web content under the Trump Administration** Since President Trumpâ\u0080\u0099s inauguration, his administration has made numerous policy changes that may affect the rights and lives of lesbian, gay, bisexual, transgender, and questioning (LGBTQ) people, including increasingemphasis on religious freedom and conscience protections, rolling back Obama-era protections for transgender populations, and reducing efforts to increase data coverage of LGBTQ populations in federal surveys.Â Anew reportby the Web Integrity Project (WIP) explores how these policy changes are reflected, or not, on federal agency websites. The report reveals how language and access to resources related to or intended for LGBTQ users on federal government websites have changed since President Trumpâ\u0080\u0099s inauguration. We are able to compare each webpage now to what it looked like in previous administrations thanks to the wonderful work of the Internet Archive’sWayback Machine, which regularly archives many government webpages.Â Â Our study of language use on federal webpages shows:Â In the aggregate, there have been significant but uneven shifts toward more inclusive identity language on federal webpages Our analysis of almost 150 federal government webpages on LGBTQ-related topics, all of which were created before President Trump took office and continue to be live on the web, reveals that, under the Trump administration,federal government webpages addressing LGBTQ-related topics use the terms â\u0080\u009cgenderâ\u0080\u009d and â\u0080\u009ctransgenderâ\u0080\u009d more and the terms â\u0080\u009csexâ\u0080\u009d less. However, there is considerable variation between departments and within departments. HHS.gov appears to have shifted away from identity language but toward â\u0080\u009creligious freedomâ\u0080\u009d language Our analysis of 1,875 HHS.gov webpages on all topics for LGBTQ-related terms, showed that LGBTQ-related terms are used less often under the Trump administration with a 25% reduction in the use of the term â\u0080\u009cgenderâ\u0080\u009d and a 40% reduction in the use of â\u0080\u009ctransgender.â\u0080\u009d By contrast, the use of terms like â\u0080\u009cfaith-based and community organizations,â\u0080\u009d â\u0080\u009creligious freedom,â\u0080\u009d and â\u0080\u009cconscience protectionâ\u0080\u009d all increased markedly. Our examination of key case studies of changed LGBTQ-related content on federal agency websites identifies two key trends:Â The removal of access to resources about discrimination protections and prevention, especially for transgender individuals The removal of resources containing LGBTQ community-specific information The case studies include previously reported changes, such asalterations to languagerelating to sex discrimination on webpages about Section 1557 of the Affordable Care Act, the removal of Department of Housing and Urban Development resources on transgender protections in homeless shelters, and the removal of Department of Education guidance about protections for transgender students. In addition to these reported changes, several unreported findings are discussed, including: The Department of Labor scrubbed references to an existing executive order, adding â\u0080\u009cgender identityâ\u0080\u009d as a protected class The Department of Laborâ\u0080\u0099s Office of Federal Contract Compliance Programs altered an FAQ page on sexual orientation and gender identity to remove references to Executive Order 13672. The EO was issued in 2014 around the same time as EO 13673, which was rescinded by the Trump administration in 2017. EO 13672 is still in force. WIP Senior Investigator, Jon Campbell, explores the meaning and consequences of this change in his latest blog, “Changes to Department of Labor and Healthcare.gov websites foreshadowed formal LGBTQ policy shifts.“ The Department of Health and Human Services appeared to downgrade an LGBT data improvement goal Two pages on Healthypeople.gov, the website of an interagency initiative that sets â\u0080\u009cscience-based, 10-year national objectives for improving the health of all Americans,â\u0080\u009d were altered to reduce LGBT-community data coverage goals. Without notice or annotation, as was done for past revisions, the 2020 coverage target for the â\u0080\u009cnumber of states, territories and the District of Columbia that include questions on sexual orientation and gender identity in the Behavioral Risk Factor Surveillance System (BRFSS)â\u0080\u009d objective was reduced from â\u0080\u009cTotal coverageâ\u0080\u009d to a â\u0080\u009c10 percent improvement.â\u0080\u009d The report is available athttps://sunlightfoundation.com/lgbtq-trend-report/. **Contact Us** Contact About Us Jobs Facebook Twitter Flickr Instagram Tumblr YouTube **Privacy** Ourprivacy policydetails how personally identifiable information that is collected on our web sites is handled. Read ourterms of service. This work by Sunlight Foundation, unless otherwise noted, is licensed under aCreative Commons Attribution 4.0 International License. 59063"}