{"id": 2039, "name": "Manila Times", "domain": "manilatimes.net", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.manilatimes.net/2025/06/12/supplements/special-features/127th-ph-independence-day-highlights-stories-of-revolutionary-struggle-giving-birth-to-the-nation/2131807", "title": "127th Ph Independence Day Highlights Stories Of Revolutionary Struggle Giving Birth To The Nation", "content": "**127th PH Independence Day highlights stories of revolutionary struggle, giving birth to the nation** **** Small Medium Large Read this in The Manila Times digital edition. THIS year's Philippine Independence Day celebration focuses on the freedom that Filipino forebears struggled for in honor of the future they envisioned for the country and the historical retrospective through which those living in the present seek to remember and honor their forefathers. By virtue of Republic Act (RA) 10086 and Administrative Order 23, s. 2011, the National Historical Commission of the Philippines (NHCP) leads the country's commemoration of the 127th anniversary of Philippine Independence and Nationhood, which started in 2023 on the 125th anniversary until 2026. The theme, \"Kalayaan, kinabukasan, kasaysayan (Freedom, future, history),\" highlights the struggle for freedom from more than three centuries of Spanish rule of the Islands, culminating in the proclamation of Philippine Independence in Kawit, Cavite on June 12, 1898. The birth of the Filipino nation has given the Philippines a unique place in history as the earliest modern democracy and republic in Asia, espousing generally accepted ideals such as democracy, universal human rights, freedom, sovereignty and self-determination as core values. This year's commemoration also aims to raise stories of revolutionary struggle from the regions and provinces across the Philippines, and incorporate them into the national narrative of independence and nationhood. Activities start at 7 a.m. today with simultaneous commemorative programs nationwide, spearheaded by the Local Historical Committees Network (LHCN), a national network under NHCP, which connects various local historical bodies, organizations and institutions that are engaged in local history and heritage work. All Philippine embassies also celebrate Independence Day at the same time. The Parada ng Kalayaan or Freedom Parade takes place at the Quirino Grandstand at 7:30 a.m. immediately after President Ferdinand Marcos Jr. lays the wreath at the Rizal monument in Rizal Park, Manila. At 7 p.m., Filipino arts and culture — with emphasis on heroism — take center stage at the Metropolitan Theater in a show, titled \"Musika III: Ang tanghalan at ang kalayaan (Music III: The stage and freedom)\". According to NHCP, the theme \"is a call to reflect on the legacy of independence and inspire Filipinos to work toward a brighter future while also preserving and valuing the nation's rich history.\" The long fight for freedom On June 12, 1898, over a year since the martyrdom of Jose Rizal, Gen. Emilio Aguinaldo — considered a renegade by the Spaniards, who ruled the Philippine islands, commencing on the arrival of Ferdinand Magellan in March 1521 — declared the nation's independence from Spanish rule from the window of his ancestral home in what was then called Cavite en Viejo. He founded a provisional republic with himself as president. As the Spanish American War raged on, Aguinaldo initially allied with the United States (US) believing that the Americans would support the Filipino struggle for independence. After the US defeated the Spanish fleet at the Battle of Manila Bay on May 1, 1898, American forces occupied Manila in August, dashing Filipino hopes that the US would grant the country sovereignty. When the Treaty of Paris formally ended the Spanish American War in December, Spain ceded the Philippines to the US for $20 million. This marked the beginning of American colonial rule, and Filipino resistance continued in the Philippine American War from 1899 to 1902. Although Aguinaldo's government — later known as the First Philippine Republic or the Malolos Republic — never gained international recognition or lasting authority, it retained symbolic significance in Philippine history. The Filipino people did not achieve independence until 1946, when the US government formally recognized Philippine sovereignty in accordance with the Philippine Independence Act (also known as the Tydings-McDuffie Act). The US had long planned to grant independence but World War II significantly complicated this process, as imperial Japan occupied the Philippines from 1942 to 1945, leading to widespread devastation and loss of life. The war reinforced Filipino nationalist movements, as many Filipinos fought both against and alongside US forces to liberate their homeland. After the war, the US recognized the urgent need for Philippine reconstruction and sovereignty. From July 4 to June 12 According to Britannica, that the Philippines was granted independence on July 4 — the same date as the US' own Independence Day – was an intentional choice by the US government to symbolically honor its supposed \"civilizing\" of the Philippines into a modern, self-governing nation. This decision had its contemporary critics, but the date nonetheless remained fixed for 16 years. Serious discussion of changing it did not emerge until the late 1950s, when an anti-American mood emerged among Filipino intellectuals who increasingly criticized lingering US influence over Philippine affairs. These intellectuals, particularly members of the prominent Philippine Historical Association (PHA), began to speak of an \"unfinished revolution,\" and they advocated the moving of the country's Independence Day from July 4 to June 12. The PHA's lobbying gained traction under then-President Diosdado Macapagal, who sought to distance the Philippines from the US and strengthen its standing among other Asian nations. His push for a symbolic break from American colonial ties intensified in 1961 after the US Congress refused to pass a war damages compensation bill that would have provided $73 million to the Philippines. Although a version of the bill was enacted under then-US President John Kennedy the following year, the earlier rejection galvanized nationalist sentiment and led Macapagal to embrace the call to change the date of Philippine Independence Day. On May 12, 1962, Macapagal issued a presidential proclamation, declaring June 12 the country's new Independence Day. Two years later, RA 4166, passed on August 4, 1964, legally cemented the change. The same law renamed July 4 as Philippine Republic Day (which was renamed Philippine American Friendship Day years later), marking it as a commemoration of the nation's formal independence from US rule rather than its true liberation."}