{"id": 912, "name": "Millbury-Sutton Chronicle", "domain": "millburysutton.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.millburysutton.com/dudley-gendron-hold-commemoration-before-memorial-day-parade/", "title": "Dudley Gendron Hold Commemoration Before Memorial Day Parade", "content": "Home NewsTown ElectionTown Meeting Town Election Town Meeting Town Election Town Meeting Sports Community Opinion Schools ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Contact Us Subscribe Login Home NewsTown ElectionTown Meeting Town Election Town Meeting Town Election Town Meeting Sports Community Opinion Schools ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Subscribe Login **Dudley-Gendron hold commemoration before Memorial Day parade** June 5, 2025 Community Login Sign Up Now Millbury earns a spot in the elite eight with dominant winJune 6, 2025 Dudley-Gendron hold commemoration before Memorial Day paradeJune 5, 2025 Millbury remembers fallen soldiers at St. Brigid CemeteryJune 5, 2025 Sutton High seniors graduate at Mechanics HallJune 5, 2025 Cattle on Feed report shows more tightening of beef suppliesJune 5, 2025 Ettamarna, Watkins will join Sutton Select BoardJune 5, 2025 Who Cut the Cheesecake? Millbury shop owner didJune 5, 2025 Sutton powers its way into MIAA tournamentJune 5, 2025 Gibbons resigns from Sutton School CommitteeJune 4, 2025 Sutton High students share their internship experiencesMay 30, 2025 **Other News** June 5, 2025 June 5, 2025 May 30, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 The Millbury-Sutton Chronicle, aCherryRoad MediaNewspaper. All rights reserved."}