{"id": 2036, "name": "Mint Newspaper (livemint.com)", "domain": "livemint.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.livemint.com/opinion/online-views/artificial-intelligence-deepseek-tsinghua-university-medical-ai-reasoning-models-peking-university-ai-risks-china-danger-11749411214109.html", "title": "Artificial Intelligence Deepseek Tsinghua University Medical Ai Reasoning Models Peking University Ai Risks China Danger 11749411214109.html", "content": "Home Latest News Delhi Gold Rate Markets News Premium Companies Share Market Today Money Technology Mint Hindi In Charts All Companies Technology Markets Money MyMint Mutual Funds Insurance Auto Industry Personal Finance Subscribe My Watchlist Newsletters My Vouchers Notifications My Reads For You Market Dashboard BullionGoldSilver Gold Silver Gold Silver FuelPetrolDiesel Petrol Diesel Petrol Diesel CommoditiesGoldGoldMAluminumMenthaoilSilverSilverMICGoldPetalNatural GasCopperZincSilverMCrudeOilGoldGinueaLead Gold GoldM Aluminum Menthaoil Silver SilverMIC GoldPetal Natural Gas Copper Zinc SilverM CrudeOil GoldGinuea Lead Gold GoldM Aluminum Menthaoil Silver SilverMIC GoldPetal Natural Gas Copper Zinc SilverM CrudeOil GoldGinuea Lead CryptoCurrencies App home Money NewsPersonal FinanceQ&AOpinion Personal Finance Q&A Opinion Personal Finance Q&A Opinion Today's NewsIndia NewsWorld NewsUS News Today India News World News US News Today India News World News US News Today Premium Economy Stock Market NewsStock MarketsCommodity NewsMark To MarketIPO NewsLive Blog Stock Markets Commodity News Mark To Market IPO News Live Blog Stock Markets Commodity News Mark To Market IPO News Live Blog Election Results 2025Assembly Elections 2025 Assembly Elections 2025 Assembly Elections 2025 personal loanpersonal loan emi calculatorPersonal Loan Interest RatePersonal Loan EligibilityBusiness LoanInstant Loan personal loan emi calculator Personal Loan Interest Rate Personal Loan Eligibility Business Loan Instant Loan personal loan emi calculator Personal Loan Interest Rate Personal Loan Eligibility Business Loan Instant Loan e-paper WSJ Economist Barron's MyMint Mint Premium IFSC Code Finder Income Tax Calculator SIP Calculator EMI Calculator Home Loan EMI Calculator Car Loan EMI NPS Calculator Videos WebStories Photo Gallery Podcasts Mint Genie Mint Lounge Mint Hindi About Us Print Subscription Mint Authors Terms of Use Disclaimer Mint Code Code of ethics Cookie Policy Privacy Policy Subscriber - Terms of Use SITEMAP Contact Us Mint Apps **Brave Chinese voices have begun to question the hype around AI** **It takes courage to speak up in China, but not only have murmurs arisen, many are warning of what could go wrong if AI is adopted hastily without guard-rails. These voices need to be heard before it’s too late.** This is a Mint Premium article gifted to you.Subscribe to enjoy similar stories. Against the odds, some in China are questioning the top-down push to get aboard the artificial intelligence (AI) hype bandwagon. In a tightly controlled media environment where these experts can easily be drowned out, it’s important to listen to them. Across theUSand Europe, loud voices inside and outside the tech industry are urging caution about AI’s rapid acceleration, pointing to labour market threats or more catastrophic risks. But in China, this chorus has been largely muted. Until now. Also Read:Parmy Olson: The DeepSeek AI revolution has a security problem China has the highest global share of people who sayAI toolshave more benefits than drawbacks, and they’ve shown an eagerness to embrace it. It’s hard to overstate the exuberance in the tech sector since the emergence of DeepSeek’s market-moving reasoning model earlier this year. Innovations and updates have been unfurling at breakneck speed and the technology is being widely adopted across the country. But not everyone’s on board. Publicly, state-backed media has lauded the widespread adoption of DeepSeek across hundreds of hospitals in China. But a group of medical researchers tied to Tsinghua University published a paper in the medical journal JAMA in late April gently questioning if this was happening “too fast, too soon.\" It argued that healthcare institutions are facing pressure from “social media discourse\" to implement DeepSeek in order to not appear “technologically backward.\" Doctors are increasingly reporting patients who “present DeepSeek-generated treatment recommendations and insist on adherence to these AI-formulated care plans.\" The team argued that as much as AI has shown potential to help in the medical field, this rushed rollout carries risks. They are right to be cautious. Also Read:The agentic AI revolution isn’t the future, it’s already here It’s not just the doctors who are raising doubts. A separate paper from AI scientists at the same university found last month that some of the breakthroughs behind reasoning models—including DeepSeek’s R1, as well as similar offerings from Western tech giants—may not be as revolutionary as some have claimed. They found that the novel training method used for this new crop “is not as powerful as previously believed.\" The method used to power them “doesn’t enable the model to solve problems that the base model can’t solve,\" one of the scientists added. This means the innovations underpinning what has been widely dubbed as the next step—toward achieving so-called Artificial General Intelligence—may not be as much of a leap as some had hoped. This research from Tsinghua holds extra weight: The institution is one of the pillars of the domestic AI scene, long churning out both keystone research and ambitious startup founders. Another easily overlooked word of warning came from a speech by Zhu Songchun, dean of the Beijing Institute for General Artificial Intelligence, linked to Peking University. Zhu said that for the nation to remain competitive, it needs more substantive research and less laudatory headlines, according to an in-depth English-language analysis of his remarks published by the independent China Media Project. These cautious voices are a rare break from the broader narrative. But in a landscape where the deployment of AI has long been government priority, it makes them especially noteworthy. The more President Xi Jinping signals that embracing AI technology is important, the less likely people are to publicly question it. This can lead to less overt forms of backlash, like social media hashtags on Weibo poking fun at chatbots’ errors. Or it can result in data centres quietly sitting unused across the country as local governments race to please Beijing—as well as a mountain of PR stunts. Also Read:AI as infrastructure: India must develop the right tech Perhaps the biggest headwind facing the sector, despite the massive amounts of spending, is that AI still hasn’t altered the earnings outlooks at most of the Chinese tech firms. The money can’t lie. This doesn’t mean that AI in China is just propaganda. The conflict extends far beyond its tech sector—US firms are also guilty of getting carried away promoting the technology. But multiple things can be true at once. It’s undeniable that DeepSeek has fuelled new excitement, research and major developments across the AI ecosystem. But it’s also been used as a distraction from the domestic macro-economic pains that predated the ongoing trade war. Without guard-rails, the risk of rushing out the technology is greater than just investors losing money—people’s health is at stake. From Hangzhou to Silicon Valley, the more we ignore the voices questioning the AI hype bandwagon, the more we blind ourselves to consequences of a potential derailment.©Bloomberg The author is a Bloomberg Opinion columnist covering Asia tech. **topics** #artificial intelligence #china #technology Download the Mint app and read premium stories About Us Contact Us Terms Of Use Privacy Policy RSS Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. **Congratulations!** You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp"}