{"id": 27, "name": "ABC11 Eyewitness News", "domain": "abc11.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abc11.com/post/denied-unemployment-benefits-losing-federal-job-wake-county-woman-calls-abc11-troubleshooter-resolves-issue/16591034/", "title": "Denied Unemployment Benefits Losing Federal Job Wake County Woman Calls Abc11 Troubleshooter Resolves Issue", "content": "SOCIETY **ABC11 Troubleshooter helps woman get unemployment benefits after denial: 'Don't stop filing'** ZEBULON, N.C. (WTVD) --Denied for unemployment. A Zebulon woman says she lost her job due to federal funding cuts, and she didn't think getting job loss benefits would be a problem. However, she was denied benefits, appealed that decision, and turned toABC11 TroubleshooterDiane Wilson for help. Deanna Faison says she unexpectedly lost her job at the NC Department of Health and Human Services. \"I didn't get any severance. I didn't get anything,\" Faison said. Fired workers got no advance notice, she says. \"Due to the government cuts, we're letting people go, so we found out that day.\" She tells ABC11 that she got to stay on the job for one more week, but that was it. Faison says she filed for unemployment on April 13th, and she never heard anything until she got a letter dated May 5th, which states she's ineligible for benefits due to failing to respond to the new hire recall notice. She said, \"I haven't received anything about a recall, about a job. I would rather work than have to go through unemployment because it is, it has been an adventure, stressful.\" Faison started making calls. She adds, \"I reached out to unemployment. They were saying, oh, well, we're still working on it and just going back and forth. Then I reached out to my HR personnel, and she was saying that she hadn't received anything from unemployment. so now I'm like, ok, what's? what's really going on?\" Fed up, she reached out to Troubleshooter and said, \"Because you get results. You get things done.\" Wilson reached out to the NC Department of CommerceDivision of Employment Security, and they said they would investigate. Within days, Faison says she heard from them and they admitted to the mistake, she is eligible for benefits and got her unemployment for all the weeks she filed to date. Faison says she is so happy this has been resolved. Her advice to others in similar situations, \"Hopefully anybody else that is going through it, don't stop filing. Don't give up, because I think that's what their main goal is for people to just, hey, say, hey, forget about it. I'm not going to pursue it, but no.\" A representative with the Division of Employment Security said they can't discuss unemployment information because of confidentiality aspects in the state public records law. **Related Topics** SOCIETY NC ZEBULON ABC11 TROUBLESHOOTER UNEMPLOYMENT NORTH CAROLINA NEWS JOBS U.S. & WORLD LAYOFF **Top Stories** **Scattered storms possible into evening hours | Live Radar** 1 hour ago **Scattered storms possible into evening hours | Live Radar** 1 hour ago **Wolfspeed announces jobs being cut at Siler City plant** 3 hours ago **Wolfspeed announces jobs being cut at Siler City plant** 3 hours ago **NC House set to vote on concealed carry permit bill** **NC House set to vote on concealed carry permit bill** **Army restoring names of these 7 bases that were changed under Biden** 1 hour ago **Army restoring names of these 7 bases that were changed under Biden** 1 hour ago **Raleigh police reveal summer safety plans** **Raleigh police reveal summer safety plans** **Teenager dead after car flips into Harnett County pond** 16 minutes ago **Teenager dead after car flips into Harnett County pond** 16 minutes ago **Judge, attorneys discuss undisclosed problem with juror | Live updates** 24 minutes ago **Judge, attorneys discuss undisclosed problem with juror | Live updates** 24 minutes ago **Inflation ticked slightly higher in May amid Trump tariffs** **Inflation ticked slightly higher in May amid Trump tariffs**"}