{"id": 600, "name": "Global Strategy Group", "domain": "globalstrategygroup.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://globalstrategygroup.com/2025/06/05/democracy-in-the-balance-public-attitudes-in-a-shifting-political-landscape/", "title": "Democracy In The Balance Public Attitudes In A Shifting Political Landscape", "content": "Communications & Public Affairs GSG Political Creative & Digital InsightsThought LeadershipResearch LibraryThe Latest Thought Leadership Research Library The Latest Thought Leadership Research Library The Latest Who We AreAbout GSGOur CultureTeamLocations About GSG Our Culture Team Locations About GSG Our Culture Team Locations Careers **Democracy in the Balance: Public Attitudes in a Shifting Political Landscape** In an era when “democracy” is invoked on campaign trails, cable news, and in everyday conversation—its meaning remains elusive and its political value uncertain. Many Democrats are grappling with a critical question:Is talking about democracy a winning message—or just an abstraction voters tune out? GSG set out to answer this question. Using cutting-edge research tools, including factor analysis and adaptive interviews, our latest study digs deep into what democracy actually means to voters—and how they respond to threats against it. The findings inDemocracy in the Balance: Public Attitudes in a Shifting Political Landscapeshed new light on how to reframe democracy as an issue that resonates emotionally and politically. Key insights from the report include: Over half (54%) of voters describe American democracy as “not strong,”and aplurality label it a “major crisis” Voters see democracy through four distinct lenses:Representation, Free Debate, Institutional Independence, and Electoral Participation A plurality of voters volunteer Trump as the biggest threat to American democracy.Voters are most troubled by his actions surrounding the “Free Debate” pillar of democracy. Among Trump-approving voters,47% still want Congress to place checks on his power, especially younger, more moderate supporters Download the full report to dive deep into the research. **Partner With Us** **Partner With Us** **Join Our Team** **Join Our Team** New York • Washington, D.C. • Chicago • Denver • Hartford • Los Angeles • Nashville • Philadelphia • Seattle (212) 260-8813 • (202) 525 4125 Privacy Policy Subscribe We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off insettings. Privacy Overview Strictly Necessary Cookies This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."}