{"id": 1377, "name": "The Gazette (Cedar Rapids)", "domain": "thegazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thegazette.com/campaigns-elections/zach-wahls-says-iowans-want-change-need-new-generation-of-leaders-as-he-announces-his-u-s-senate-c/", "title": "Zach Wahls Says Iowans Want Change Need New Generation Of Leaders As He Announces His U S Senate C", "content": "Manage Account Log Out Weather News Sports Entertainment Food & Drink Health & Wellness Obituaries Manage Account Log Out **More Stories** **Iowa Gov. Kim Reynolds vetoes bill on eminent domain, pipelines and property rights** **Iowa Gov. Kim Reynolds vetoes bill on eminent domain, pipelines and property rights** **I.C. residents charged with misusing more than $500K belonging to elderly family member** **I.C. residents charged with misusing more than $500K belonging to elderly family member** **UPDATED: Unvaccinated Johnson County child infected by measles** **UPDATED: Unvaccinated Johnson County child infected by measles** **UIHC to have ‘honest conversation about feasibility’ of planned $1.5B inpatient tower** **UIHC to have ‘honest conversation about feasibility’ of planned $1.5B inpatient tower** Home/News/Government & Politics/Campaigns & Elections **Zach Wahls says Iowans want change, need new generation of leaders as he announces his U.S. Senate campaign** The 33-year-old state senator from Coralville is the 3rd Democrat to announce in Iowa’s 2026 U.S. Senate election Jun. 11, 2025 6:00 am, Updated: Jun. 11, 2025 3:33 pm Why you can trust The Gazette The Gazette offers audio versions of articles using Instaread. Some words may be mispronounced. DES MOINES — Calling for a new generation of political leaders — including new leadership for U.S. Senate Democrats — and saying national politicians in both parties “have been screwing over Iowa families for too long,” Iowa Democrat and state legislator Zach Wahls on Wednesday announced his candidacy for the U.S. Senate. Wahls, a 33-year-old state senator from Coralville, in an interview ahead of Wednesday’s announcement said Iowans need someone who will have “the courage to stand up to the establishment to fight for us.” “I’ve spent my entire career doing exactly that: standing up to powerful interests and insiders when it’s hard, delivering real results for Iowans and demonstrating that Iowa Democrats believe in hard work and not handouts for billionaires,” Wahls said. Iowa’s 2026 U.S. Senate election is for the seat held since 2015 by Republican U.S. Sen. Joni Ernst. Ernst has not yet declared whether she plans to run for re-election, although her campaignhired a campaign manager earlier this month. Wahls is the third Iowa Democrat to announce his candidacy for the state’s U.S. Senate election, joining fellowstate legislator J.D. Scholtenof Sioux City andchamber of commerce leader Nathan Sageof Indianola. Wahls said he believes Iowa voters of all political ideologies are ready for change. “I think it’s time for a new generation of leaders who are focused on solving the problems that we are going to be facing today and tomorrow, and not rehashing the battles of the past,” Wahls said. “I think that (Iowans) are more interested in leaders who will roll up their sleeves and do the hard work of solving problems, rather than just engaging in political posturing and point-scoring in Washington and in Iowa.” That new generation of leaders should include new leadership in the U.S. Senate Democratic caucus, Wahls said. New York U.S. Sen. Chuck Schumer has led U.S. Senate Democrats since 2017. When asked, Wahls said if elected to the U.S. Senate he would vote for a new Democratic leader. “Absolutely. It’s time for new generation of leaders,” Wahls said. Wahls experienced a leadership change of his own when, in 2023, Iowa Senate Democratsvoted to remove Wahls as their caucus leaderand install Sen. Pam Jochum, of Dubuque, who has since retired. At the time,Wahls claimedhe was voted out as leader after he fired two longtime Senate Democrat staffers who, Wahls said, did not share his vision for the caucus. Wahls said at the time that Iowa Democrats “desperately need a new direction and leaders who will chart that course.” He has similar thoughts now about the direction of the country. “I’ve stood up to my own party before. I’ve got the scars to show for it,” Wahls said during his campaign announcement interview. “Making change is hard, and that’s exactly why it’s so important. “Look, I’m a Democrat because I believe that since the New Deal, our party has stood for economic security and civil rights. That’s the core of what it means to be a Democrat. I think a lot of people in our party are frustrated by leaders in our party because they don’t see leaders who can effectively deliver on those two commitments,” Wahls added. “And I think there is a lot of excitement about a new generation of leaders stepping forward and saying we have a new vision for how our party can win elections, can govern and can solve the problems that are facing Iowa families.” Wahls was first elected to the Iowa Senate in 2018. He represented a district that included Coralville and western Johnson County, and all of Cedar County. After decennial redistricting in 2021, Wahls’ district changed to include Coralville, North Liberty and western Johnson County. Wahls is cofounder of Wahls Enterprise LLC, which he established for the customized “Woman Cards” playing cards that hecreated in 2016after then-candidate Donald Trump accused his 2016 presidential election opponent Hillary Clinton of playing “the woman card.” Wahls previously worked as vice president for community investment and development at GreenState Credit Union. Wahls first gained prominence in 2011 when, as a 19-year-old, hespoke on the Iowa House floorabout his two mothers as legislators debated a proposal to ban same-sex marriage in the state. **Campaign of community service** Wahls said he expects economic concerns to be the top issue in the 2026 election. He also highlighted health care issues — including Iowa’s high cancer rates — education, and protecting Social Security. Wahls said he wants his U.S. Senate campaign to be one of community service. He pledged to campaign across the state and ask Iowans about the needs in their communities. “One of the things that I always loved growing up was that quote from President Kennedy who said, ‘Ask not what your country can do for you. Ask what you can do for your country.’ With this campaign, we’re asking not what can Iowa do for this campaign. We’re asking what can this campaign do for Iowa,” Wahls said. “So we’re looking for opportunities to provide community service along the way, to hear from people across the state about the problems in their communities and use whatever resources our campaign can find to address those problems,” Wahls said. “And if we can’t address those problems during the campaign, that’s going to be our to-do list in Washington. Our legislative agenda is going to be directly informed by the problems that we hear about as we campaign across the state.” Another political quote that Wahls is drawing on as he launches his Senate campaign comes from Sam Rayburn, a Democratic U.S. House Speaker in the 1940s, who once said, “Any jackass can kick down a barn, but it takes a good carpenter to build one.” And Wahls said he will take the cue from longtime Iowa Republican U.S. Sen. Chuck Grassley and campaign in all 99 of Iowa’s counties. Wahls credited Grassley for “good constituent service and hearing from Iowans.” “And frankly, that is the same ethos that we want to bring to this campaign. Those are good, old fashioned Iowa values,” Wahls said. “We’re going to be running a grassroots effort. I want to hear from Iowans. We’re going to respond to Iowans. We’re going to hear their problems. We’re going to try to help solve their problems. And that’s the approach that we’re going to take in this campaign, and that is exactly how I will represent them in the United States Senate if they choose to elect me.” The primary election in Iowa is scheduled for June 2, 2026. Wahls' current, four-year term in the Iowa Senate ends at the end of 2026, and state law prohibits Iowa legislators from holding multiple elected offices at the same time. **Republicans react** The Republican Party of Iowa and the National Republican Senatorial Committee, the campaign organization that works to elect Republicans to the U.S. Senate, both issued statements Wednesday addressing Wahls’ campaign announcement. Both Republican statements referenced immigration and transgender athlete policies. In her statement, Republican Party of Iowa co-chair Linda Upmeyer, a former Iowa House Speaker, called Wahls “another far-left, do-nothing Democrat.” “During his forgettable time in the Iowa Senate, Zach Wahls made a name for himself as an extreme liberal activist championing out-of-touch policies including high taxes, open borders, and letting biological men play in women’s sports,” Upmeyer said in the statement. “But above all else, he has always been more interested in chasing headlines than listening to Iowans.” Comments: (515) 355-1300, erin.murphy@thegazette.com Get the latest Iowa politics and government coverage each morning in theOn Iowa Politics newsletter. **Erin Murphy** Des Moines Bureau chief, The Gazette Covering Iowa politics and government for The Gazette. Get theOn Iowa Politics Newsletter **Videos** **Today's Trending Stories** Iowa Gov. Kim Reynolds vetoes bill on eminent domain, pipelines…Erin Murphy Erin Murphy Erin Murphy University of Iowa Health Care settles negligence lawsuits for $3.5M…Vanessa Miller Vanessa Miller Vanessa Miller Consultant warns of ‘political interference’ in Iowa State presidential search…Vanessa Miller Vanessa Miller Vanessa Miller Latest News **Share Your Voice** **Related Stories** FOLLOW US The Gazette has been informing Iowans with in-depth local news coverage and insightful analysis for over 140 years. Support our award-winning, independent journalism with a subscription today. **Subscribe nowfor unlimited access.** **Links** Subscriber Help Center News Tip | Submit Correction Join Our Newsletters Puzzle Answers Green Gazette Article Removal Request Public Notices Work at The Gazette Become a Newspaper Carrier Local Jobs in Eastern Iowa **Contact Us** 116 3rd St SECedar Rapids, Iowa 52401 customercare@thegazette.com (319) 398-8333 Live Chat About The Gazette Advertise with us Privacy Web Accessibility Review us on Google ⭐⭐⭐⭐⭐ © 2025 The Gazette | All Rights Reserved. Digital Edition Account Log In Log Out Gazette Travel Our latest offers SubscribersSubscriber ServicesManage or Activate AccountToday’s Digital EditionHow to use the Digital EditionRewards DashboardPuzzles & Puzzle AnswersNewslettersHelp Center Subscriber Services Manage or Activate Account Today’s Digital Edition How to use the Digital Edition Rewards Dashboard Puzzles & Puzzle Answers Newsletters Help Center Subscriber Services Manage or Activate Account Today’s Digital Edition How to use the Digital Edition Rewards Dashboard Puzzles & Puzzle Answers Newsletters Help Center Advertise NewsAll NewsBusiness NewsCommunityCrashesCrime & CourtsCurious IowaData CenterEducationEnvironmental NewsGovernment & PoliticsHealthNation & WorldPhotosPublic NoticesSearch ArchiveTime MachineVideosWeatherOur JournalistsEmily AndersenErin MurphyGrace KingGrace NielandJared StrongMegan WoolardOlivia CohenTom BartonTrish MehaffeyVanessa Miller All News Business News Community Crashes Crime & Courts Curious Iowa Data Center Education Environmental News Government & Politics Health Nation & World Photos Public Notices Search Archive Time Machine Videos Weather Our Journalists Emily Andersen Erin Murphy Grace King Grace Nieland Jared Strong Megan Woolard Olivia Cohen Tom Barton Trish Mehaffey Vanessa Miller All News Business News Community Crashes Crime & Courts Curious Iowa Data Center Education Environmental News Government & Politics Health Nation & World Photos Public Notices Search Archive Time Machine Videos Weather Our Journalists Emily Andersen Erin Murphy Grace King Grace Nieland Jared Strong Megan Woolard Olivia Cohen Tom Barton Trish Mehaffey Vanessa Miller SportsAll SportsIowa High School SportsIowa HawkeyesIowa State CyclonesUNI PanthersOther College SportsMinor League SportsOutdoorsSports DeskMike HlasJohn SteppeJeff JohnsonJeff LinderK.J. PilcherAmir Prellberg All Sports Iowa High School Sports Iowa Hawkeyes Iowa State Cyclones UNI Panthers Other College Sports Minor League Sports Outdoors Sports Desk Mike Hlas John Steppe Jeff Johnson Jeff Linder K.J. Pilcher Amir Prellberg All Sports Iowa High School Sports Iowa Hawkeyes Iowa State Cyclones UNI Panthers Other College Sports Minor League Sports Outdoors Sports Desk Mike Hlas John Steppe Jeff Johnson Jeff Linder K.J. Pilcher Amir Prellberg OpinionAll OpinionFact CheckerGuide to Editorial and CommentaryGuest ColumnistsLetters to the EditorPolitical CartoonsStaff ColumnistsStaff EditorialsSubmit a Letter or ColumnEditorial Fellow ProgramOur ColumnistsTodd DormanAlthea ColeEditorial FellowsDavid ChungSofia DeMartinoChris Espersen All Opinion Fact Checker Guide to Editorial and Commentary Guest Columnists Letters to the Editor Political Cartoons Staff Columnists Staff Editorials Submit a Letter or Column Editorial Fellow Program Our Columnists Todd Dorman Althea Cole Editorial Fellows David Chung Sofia DeMartino Chris Espersen All Opinion Fact Checker Guide to Editorial and Commentary Guest Columnists Letters to the Editor Political Cartoons Staff Columnists Staff Editorials Submit a Letter or Column Editorial Fellow Program Our Columnists Todd Dorman Althea Cole Editorial Fellows David Chung Sofia DeMartino Chris Espersen Food and DrinkAll Food and DrinkRecipesRestaurantsChew on This NewsletterElijah Decious All Food and Drink Recipes Restaurants Chew on This Newsletter Elijah Decious All Food and Drink Recipes Restaurants Chew on This Newsletter Elijah Decious BusinessAll BusinessAgricultureBusiness NotesColumnsCompaniesPersonal FinanceEconomyEmploymentEnergyManufacturingOpenings & ClosuresReal EstateRestaurantsRetailSmall BusinessTransportation All Business Agriculture Business Notes Columns Companies Personal Finance Economy Employment Energy Manufacturing Openings & Closures Real Estate Restaurants Retail Small Business Transportation All Business Agriculture Business Notes Columns Companies Personal Finance Economy Employment Energy Manufacturing Openings & Closures Real Estate Restaurants Retail Small Business Transportation ObituariesAll ObituariesIn Memory OfSubmit an ObituaryObituary Newsletter All Obituaries In Memory Of Submit an Obituary Obituary Newsletter All Obituaries In Memory Of Submit an Obituary Obituary Newsletter PodcastsAll PodcastsOn Iowa PoliticsHawk Off the PressIowa Prep SportsPinning CombinationGet to Know Gives Back Podcast All Podcasts On Iowa Politics Hawk Off the Press Iowa Prep Sports Pinning Combination Get to Know Gives Back Podcast All Podcasts On Iowa Politics Hawk Off the Press Iowa Prep Sports Pinning Combination Get to Know Gives Back Podcast EntertainmentAll EntertainmentArtBooksComedyMuseums & GalleriesMusicPuzzles & GamesTheaterThings To DoHooplaSubmit EventOur WritersElijah Decious All Entertainment Art Books Comedy Museums & Galleries Music Puzzles & Games Theater Things To Do Hoopla Submit Event Our Writers Elijah Decious All Entertainment Art Books Comedy Museums & Galleries Music Puzzles & Games Theater Things To Do Hoopla Submit Event Our Writers Elijah Decious LivingAll LivingHealth & WellnessHome & GardenMilestonesPeople & PlacesPets & AnimalsRecreationReligion & BeliefTravelOur WritersElijah Decious All Living Health & Wellness Home & Garden Milestones People & Places Pets & Animals Recreation Religion & Belief Travel Our Writers Elijah Decious All Living Health & Wellness Home & Garden Milestones People & Places Pets & Animals Recreation Religion & Belief Travel Our Writers Elijah Decious Photos and VideosAll Photos and VideosThe Iowa PhotoNews Photo GalleriesSports Photo GalleriesVideo GalleriesOur PhotojournalistsJim SlosiarekSavannah BlakeNick RohlmanBailey Cichon, Multimedia JournalistGazette Visuals All Photos and Videos The Iowa Photo News Photo Galleries Sports Photo Galleries Video Galleries Our Photojournalists Jim Slosiarek Savannah Blake Nick Rohlman Bailey Cichon, Multimedia Journalist Gazette Visuals All Photos and Videos The Iowa Photo News Photo Galleries Sports Photo Galleries Video Galleries Our Photojournalists Jim Slosiarek Savannah Blake Nick Rohlman Bailey Cichon, Multimedia Journalist Gazette Visuals Special Events Special Sections Classifieds MilestonesAll MilestonesAnniversariesDays To RememberEngagementsHolidaysIn RemembranceNew ArrivalsThank YousWeddingsSubmit a Milestone All Milestones Anniversaries Days To Remember Engagements Holidays In Remembrance New Arrivals Thank Yous Weddings Submit a Milestone All Milestones Anniversaries Days To Remember Engagements Holidays In Remembrance New Arrivals Thank Yous Weddings Submit a Milestone DataDataData CenterSalariesInteractive Maps & ChartsCoronavirus DataArrestsLegal Notices Data Data Center Salaries Interactive Maps & Charts Coronavirus Data Arrests Legal Notices Data Data Center Salaries Interactive Maps & Charts Coronavirus Data Arrests Legal Notices More GazetteMore GazetteFollow us on SocialClassifiedsCorridor CareersGarage SalesGazette Gives BackGazette Print ServicesGazette RewardsGazette StoreGreen GazetteHERHoliday Light FinderHooplaIowa IdeasPhoto Store More Gazette Follow us on Social Classifieds Corridor Careers Garage Sales Gazette Gives Back Gazette Print Services Gazette Rewards Gazette Store Green Gazette HER Holiday Light Finder Hoopla Iowa Ideas Photo Store More Gazette Follow us on Social Classifieds Corridor Careers Garage Sales Gazette Gives Back Gazette Print Services Gazette Rewards Gazette Store Green Gazette HER Holiday Light Finder Hoopla Iowa Ideas Photo Store Other LinksOther LinksAbout The GazetteSearch the Gazette ArchivesArticle RemovalCR Arrest DatabaseFollow us on SocialLegal NoticesMobile AppsBecome a CarrierCustomer CareOrder Back IssuesPage ReprintsPrivacy PoliciesPuzzle AnswersSponsorship RequestsSubmit a LetterWeather Other Links About The Gazette Search the Gazette Archives Article Removal CR Arrest Database Follow us on Social Legal Notices Mobile Apps Become a Carrier Customer Care Order Back Issues Page Reprints Privacy Policies Puzzle Answers Sponsorship Requests Submit a Letter Weather Other Links About The Gazette Search the Gazette Archives Article Removal CR Arrest Database Follow us on Social Legal Notices Mobile Apps Become a Carrier Customer Care Order Back Issues Page Reprints Privacy Policies Puzzle Answers Sponsorship Requests Submit a Letter Weather Digital Edition Jobs FOLLOW US Digital Edition Account Log In Log Out Share this article: Digital Edition Account Log In Log Out Subscribe Gazette Travel Our latest offers Subscribers Advertise News Sports Opinion Food and Drink Business Obituaries Podcasts Entertainment Living Photos and Videos Special Events Special Sections Classifieds Milestones Data More Gazette Other Links Digital Edition Jobs Subscriber Services Manage or Activate Account Today’s Digital Edition How to use the Digital Edition Rewards Dashboard Puzzles & Puzzle Answers Newsletters Help Center All News Business News Community Crashes Crime & Courts Curious Iowa Data Center Education Environmental News Government & Politics Health Nation & World Photos Public Notices Search Archive Time Machine Videos Weather Our Journalists Emily Andersen Erin Murphy Grace King Grace Nieland Jared Strong Megan Woolard Olivia Cohen Tom Barton Trish Mehaffey Vanessa Miller All Sports Iowa High School Sports Iowa Hawkeyes Iowa State Cyclones UNI Panthers Other College Sports Minor League Sports Outdoors Sports Desk Mike Hlas John Steppe Jeff Johnson Jeff Linder K.J. Pilcher Amir Prellberg All Opinion Fact Checker Guide to Editorial and Commentary Guest Columnists Letters to the Editor Political Cartoons Staff Columnists Staff Editorials Submit a Letter or Column Editorial Fellow Program Our Columnists Todd Dorman Althea Cole Editorial Fellows David Chung Sofia DeMartino Chris Espersen All Food and Drink Recipes Restaurants Chew on This Newsletter Elijah Decious All Business Agriculture Business Notes Columns Companies Personal Finance Economy Employment Energy Manufacturing Openings & Closures Real Estate Restaurants Retail Small Business Transportation All Obituaries In Memory Of Submit an Obituary Obituary Newsletter All Podcasts On Iowa Politics Hawk Off the Press Iowa Prep Sports Pinning Combination Get to Know Gives Back Podcast All Entertainment Art Books Comedy Museums & Galleries Music Puzzles & Games Theater Things To Do Hoopla Submit Event Our Writers Elijah Decious All Living Health & Wellness Home & Garden Milestones People & Places Pets & Animals Recreation Religion & Belief Travel Our Writers Elijah Decious All Photos and Videos The Iowa Photo News Photo Galleries Sports Photo Galleries Video Galleries Our Photojournalists Jim Slosiarek Savannah Blake Nick Rohlman Bailey Cichon, Multimedia Journalist Gazette Visuals All Milestones Anniversaries Days To Remember Engagements Holidays In Remembrance New Arrivals Thank Yous Weddings Submit a Milestone Data Data Center Salaries Interactive Maps & Charts Coronavirus Data Arrests Legal Notices More Gazette Follow us on Social Classifieds Corridor Careers Garage Sales Gazette Gives Back Gazette Print Services Gazette Rewards Gazette Store Green Gazette HER Holiday Light Finder Hoopla Iowa Ideas Photo Store Other Links About The Gazette Search the Gazette Archives Article Removal CR Arrest Database Follow us on Social Legal Notices Mobile Apps Become a Carrier Customer Care Order Back Issues Page Reprints Privacy Policies Puzzle Answers Sponsorship Requests Submit a Letter Weather FOLLOW US"}