{"id": 538, "name": "Frontiers in Disaster and Emergency Medicine", "domain": "frontiersin.org/journals/disaster-and-emergency-medicine", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/disaster-and-emergency-medicine/articles/10.3389/femer.2025.1519991/full", "title": "Disaster And Emergency Medicine", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Disaster Medicine Emergency Health Services Pediatric Emergency Medicine Resuscitation and Cardiac Emergency Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Disaster Medicine Emergency Health Services Pediatric Emergency Medicine Resuscitation and Cardiac Emergency Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Disaster Medicine Emergency Health Services Pediatric Emergency Medicine Resuscitation and Cardiac Emergency Medicine Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office COMMUNITY CASE STUDY article Front. Disaster Emerg. Med., 20 May 2025 Sec. Disaster Medicine Volume 3 - 2025 |https://doi.org/10.3389/femer.2025.1519991 **Kern's Six Steps to implement simulation in public health crisis** 1Department of Quality and Safety, New York City Health + Hospitals, New York, NY, United States 2Department of Medicine, Icahn School of Medicine at Mount Sinai, New York, NY, United States 3Department of Emergency Medicine, New York City Health + Hospitals/Elmhurst Hospital Center, New York, NY, United States 4Department of Emergency Medicine, Icahn School of Medicine at Mount Sinai, New York, NY, United States 5Division of Pulmonary and Critical Care, Department of Medicine, New York City Health + Hospitals/Bellevue Medical Center, New York, NY, United States 6Division of Pulmonary and Critical Care, Department of Medicine, New York University, New York, NY, United States 7Division of Pulmonary and Critical Care, Department of Medicine, New York City Health + Hospitals/Jacobi Medical Center, New York, NY, United States 8Simulation Center, New York City Health + Hospitals/Jacobi Medical Center, New York, NY, United States 9Department of Emergency Medicine, New York City Health + Hospitals/Harlem Medical Center, New York, NY, United States The coronavirus disease 2019 (COVID-19) pandemic resulted in a rapid influx of critically ill patients, necessitating adding intensive care unit (ICU) beds and redeploying non-ICU clinicians to critical care areas. New York City Health + Hospitals (NYC H+H) applied the Kern's Six Steps Curriculum Design framework to deploy a ventilator simulation course across the system to build preparedness for ventilator management in non-ICU providers. In this article we describe how our quality improvement initiative prepared the largest public hospital system in the country to take care of intubated COVID patients for the “second wave” by applying Kern's Six Steps. Through this description, we offer how applying a framework, like Kern's Six Steps, is a model that structures interventions for success and can be applied to future disaster preparedness educational strategies. **Introduction** As of January 1st, 2023, the coronavirus 2019 (COVID-19) has affected more than 100,000,000 patients in the United States (1). New York City, a “hot-spot,” was particularly overwhelmed with cases at the beginning of the pandemic accounting for 200,000 cases in the first 3 months creating a surge of critically ill patients. New York City Health + Hospitals System (NYC H+H), the largest public health system in the United States, was at the forefront of this crisis. The system worked to expand its 300 Intensive Care Unit (ICU) capacity at baseline to more than 1,000 critical care beds. The expansion of critical care brought a challenge of staffing to treat these mostly ventilated patients. To meet this demand, the system was required to deploy non-critical care trained clinicians to our ICUs. As the number of COVID-19 cases slowed in New York City, NYC H+H began preparations for future patient surges and specifically targeted simulation education as solution. Healthcare Simulation is recognized as providing a safe environment to practice and develop skills and has demonstrated its utility as a training tool during epidemics (2). In addition, ventilator management, an important part of ICU care, has been identified as a skill reliably trained through the use of ventilator simulators, partnered with real ventilators (3). To tailor this simulation-based approach, the team applied the Kern's Six Steps to Curriculum Design framework. Having a conceptual framework to approach this emergency more effectively targets the needs of the response. The six steps consist of (1) Problem Identification and general needs assessment, (2) Targeted Needs Assessment, (3) Goals and Objectives, (4) Educational Strategies, (5) Implementation, and (6) Evaluation and Feedback.(4). Step 1 defines the purpose of a program and may be informed by the needs of the organization, national standards or even staff sentiment. Step 2, drills down on the specifics to target the actual problems. This can be achieved through survey, focus groups, reviews of the electronic medical record, observations of actual work or even through observation of simulated work being done. Step 3 takes the lessons learned from the needs assessment and formulates specific objectives to be achieved through the program or experience being created. It may differ from the overarching goal of the general needs assessment as it factors in the scope and scale of what can be achieved. In step 4, the appropriate educational strategy is applied to tailor to the lesson objectives, factoring in elements like the number of learners, complexity of the topic and appreciation of the skills to be learned. Step 5 addresses implementation of the program, including timing of the experience, recruitment of learners and faculty, engaging stakeholders (especially those with competing interests), among other logistics. Lastly, step 6 addresses how we are measuring the programs' success, in both the short and sometimes long-term. The measurement of success may be limited due to the capacity of available measurement tools. Although the Kern's Six Steps framework is listed in series, often, the steps run in parallel supporting the overall development of a tailored program as lesson objectives speak to outcomes and both speak to educational strategy, etc. (4–6). The aim of this paper is to describe the application of the Kern's Six Steps to Curriculum Design framework in the setting of the emergency response during the COVID-19 pandemic. With this description, the paper looks to prepare emergency response systems with an approach to address education in this setting of other anticipated emerging infectious disease as well as other causes of patient surge by expanding workforce capacity. **Context** The program was launched across the entire system at New York City Health + Hospitals and targeted non-Intensive Care clinicians. The program created a multi-pronged approach that supported both virtual content as well as in-person simulation content to scaffold more confident care delivery within COVID-related critical care situations. **Programmatic elements** **Applying Kern's Six Steps** From a Kern's lens, step 1 of the framework recognized after the first COVID-19 surge, a lack of non-ICU clinicians prepared to manage ventilated ICU-level patients. To better understand the problem and not be driven by assumptions to create solutions, the second step of the framework was to perform targeted needs assessments. Focus group conversations were held to understand what types of support were needed for hospitalists and non-ICU clinicians to manage ventilated-COVID patients. In the focus groups, clinicians identified they needed occasional intensivist oversight as well as approaches to troubleshoot alarms and understand strategies to combat hypoxia in decompensating COVID-19 patients. A multidisciplinary committee convened consisting of representation from critical care, hospital medicine, respiratory therapy, emergency medicine and simulation to address the third step of the framework; creating goals and objectives of the program based on the identified needs (Figure 1). As part of the committee's responsibilities, specified, measurable outcomes needed to be detailed in the objectives to ensure the program achieved success, highlighting the non-linear approach of Kern's framework (Figure 2). Outcomes will be detailed later when describing step 6 of the framework. To make the goal of non-critical care trained clinicians function in ICU settings, a structured tiered redeployment system was created in which these clinicians would be supervised by critical care physicians. This partnered with educational training, where the non-ICU clinicians were equipped with a series of common critical care scenarios seen in COVID-19 patients. Figure 1. Objectives are designed according to SMART objectives with an intention to be specific, measurable, achievable, relevant and time-bound. These are two examples from the larger program. Figure 2. Kern's six step model of curriculum demonstrating the non-sequential approach as well as the influence each step can have on other steps. In developing the educational strategies, the fourth step of the framework, the same committee decided to apply two mediums for training: online didactics and in-person simulation. The online didactics focused on basic ventilator management, waveforms, troubleshooting, recognition, and management of refractory hypoxia, prone positioning, and advanced ventilator modes. The 2-h, in-person simulation component consisted of a prebriefing to establish psychological safety, an introductory case, and eight modules addressing various clinical issues that may arise while caring for a COVID patient. These modules were scaffolded from the initial presentation of the case so learners could apply lessons from the previous module to the next more complex patient situation (7,8). Please see supplementary material for simulation scenario curriculum content. Additionally, an infographic was created to reinforce the highest yield material presented during the course with the intention of use in clinical practice. To implement the program, a flipped classroom method was used with the expectation of two online modules, one focused on ventilator wave interpretation and the other discussing managing ventilator troubleshooting with an emphasis on alarms related to hypoxia and elevated peak pressures. These modules were to be completed prior to the simulation experience. Through a Federal Emergency Management Agency grant, each acute care facility was provided with a SimMan Essentials (Laerdal) coupled with an Ingmar Medical ASL 5000 to recreate the lung dynamics needed to simulate critically ill COVID patients. The program was conducted by a board-certified Emergency Medicine physician and respiratory therapist trained in simulation, and an intensivist. Due to social distancing requirements, sessions were conducted with 5–6 non-ICU clinicians, utilizing a reflective pause approach. In this educational strategy, an adjustment to the ventilator is made to address a particular change in patient condition during the scenario, the facilitator pauses the experience so that the learner could then share their thought processes for that change to support a shared mental model (8,9). Implementation of this educational intervention, step five, required identifying stakeholders specific to the targeted departments and exploring the program with them to understand when and where to deliver the course as well as time constraints of delivery. Gaining their insights offered a different lens and helped build ignition prior to execution. Engaging these stakeholders proved beneficial as they were integral in scheduling learners and advocating the merits of the program. To consider outcomes, step six of the framework, the Phillip's Return on Investment model (Figure 3) serves as a construct to measure the impact of the intervention (10). As this was a performance improvement project in the midst of the pandemic, evaluation tools were limited to level 0 data, or participation numbers, level 1 data, reflecting the learner's perception of the program's impact on their capabilities post-training and level 2 data, knowledge acquisition, through pre and post-test surveys. With more resources or targeted evaluations, level 3 data might have been achieved through bedside evaluation of knowledge application. Additional resources and electronic medical record extractions may have achieved level 4 data, to monitor and analyze lengths of stay, mortality, incidence of lung injury, among other clinical outcomes. Outcomes served another purpose, as they informed if the program needed to pivot certain elements of the intervention in the midst of execution. For example, if learners are not achieving expected learning outcomes or the program delivery is not well received by the learners, adjustments can be made. Another vehicle to focus outcomes may be to apply research methodology. In our case, as this was a necessary performance improvement project focused on workforce expansion. As a result, IRB approval was not sought for this effort. Figure 3. Phillip's model return on investment framework applied to ventilator intervention. Overall, 751 providers completed the introductory, online didactic course and 667 completed the advanced course. Additionally, 1990 people completed the recorded simulation modules. Of the internal medicine providers, 564 (28%) were attending physicians, 32 were fellows (2%), 31 had specialty training (2%), and 1,271 (64%) were residents from October 2020 to September 2021. Nine of the eleven acute care facilities in NYC H+H participated in the in-person simulation course. In total, there were 131 participants from October 2020 to January 2021, during the height of NYC H+H second COVID-19 surge. A total of 115 worked within the department of Internal Medicine (87.8%), 6 (4.5%) identified as critical care, 7 (5.3%) from the Department of Emergency Medicine, 2 (1.5%) from Obstetrics and 1 (0.8%) from Ambulatory Care. Of the 131, 94 (71.8%) identified as Attending physicians, 5 (3.8%) identified as pulmonary fellows, 5 (3.8%) were physician assistants, 24 (18.3%) residents and 3 (2.3%) respiratory therapists. One hundred eight (77.7% response rate) individuals completed the pre-survey and 112 (80.6% response rate) completed the post-survey during the in-person sessions. Of those surveys completed, the majority (66.0%) of participants were hospitalists, followed by internal medicine specialists (17.5%) and emergency medicine (8.7%). There was variability with experience in ventilator management, indicated by 34 (33.0%) routinely managing ventilators, 37 (35.9%) stating they don't routinely manage ventilators but were reassigned to do so during the pandemic, and 32 (31.1%) not managing ventilators at all. Of respondents in the pre-survey, 15.74% were “not comfortable at all” in managing patients on ventilators and 27.78% were “uncomfortable” whereas 47.22% were “somewhat comfortable” and 9.26% were “very comfortable”. Using the same measurements specific to managing COVID ventilated patients, 14.95% were “not comfortable at all”, 36.45% were “uncomfortable”, 42.06% “somewhat comfortable” and 6.54% were “very comfortable”. Upon completion of the experience, the learners appreciation of comfort in managing ventilated patients shifted to only 1.82% as “not comfortable at all”, 10.91% “uncomfortable”, 60.91% “somewhat uncomfortable” and 26.36% “very comfortable”. Similarly, in managing COVID ventilated patients after the training, 1.83% were “not comfortable at all”, 10.09% “uncomfortable”, 66.06% “somewhat comfortable” and 22.02% “very comfortable”. More granular shifts were also appreciated in comfort addressing basic ventilator settings, managing ventilator alarms, troubleshooting, and adjusting for hypoxia, hypercarbia, dysynchrony and elevated peak pressures. While confidence grew across the board, knowledge-based assessments informed improvement in understanding all concepts. There were noted to be some limitation in concept transfer specific to identifying and mitigating resistance vs. compliance issues. In appreciating the value of the larger program, ratings on pre-work didactics demonstrated a rating of 4.6 out of 5. The value of the simulation training experience was rated 4.9 out of 5. The majority of respondents (90.1%) indicated this course would very likely or likely change their practice. **Discussion** Utilizing a combination of online didactics and simulation in real time during the pandemic, the program was successful in training non-ICU clinicians in ventilator management, effectively increasing critical care capacity. More than a third of the participants indicated that they were managing ventilators during the pandemic when ventilators are not part of their routine practice. Despite this being a time when being systematic was challenging, applying Kern's Six Steps proved reliable in creating a program that was perceived to change practice. Following the intervention, confidence shifted toward being somewhat to very comfortable in managing both ventilated and COVID-ventilated patients despite the relatively large number of clinicians already using ventilators in their regular practice. Outcomes related to knowledge acquisition, identified the concepts of resistance and compliance as topics that might benefit from adjusting the educational approach. In addition to the reflective pause, learners would use “teach- back methodology”, requiring them to teaching back the concepts of resistance and compliance they had just learned to verify understanding (11). During the COVID-19 pandemic, there have been other efforts to train non-ICU clinicians in the treatment of critically ill ventilated patients. In the literature approaches included online didactics covering various critical care topics (9). Telesimulation, using platforms to join a virtual meeting to watch a simulation experience, offered another teaching strategy. In one report, educators applied a simulator linked to a ventilator to explore a hypoxemic respiratory failure scenario in a COVID patient by non-ICU clinicians (2). More than just an online course, didactics paired with simulation offers participants foundational knowledge followed by the opportunity for deliberate practice (the repetition of an activity with conscious reflection in order to improve performance), adjustable clinical complexity, and regular execution of complex events on demand, such as overwhelming respiratory failure witnessed during COVID-19 (7,12–15). Other applications of simulation during the pandemic were similarly focused on the gap related to scaling staffing. One descriptive study described focused simulation training for new ICU nurse trainees with the objectives of infection control, mitigation of pressure injury and safe drug practices on a simulated unit over a 3-day course (16). Applying a systematic approach like Kerns Six Steps to this intervention would have sought measured outcomes such as perceived improvement or measurable competencies. Clinical impact may have been better appreciated as the training was targeted to a single unit making it more convenient to measure preventable infections or drug errors. As the pandemic continued, monitored outcomes could inform a need to pivot education if a particular metric signaled underperformance. Engaging hospital leadership with strategies, like Kern's, may help focus response as well as determine if, and how, simulation or other educational strategies can be utilized when responding to a public health emergency or prolonged patient surge. Including this strategy in the toolkit used by emergency management prepares clinical teams to pivot during a disaster and the potential to respond more effectively. With the threat of multiple emerging infectious diseases like Zika, Ebola and Monkey Pox, our clinical teams may be asked to provide care outside of their normal scope, making education a major part of the response. Addressing these diseases fall easily into the Kern's framework. Targeting and isolating Ebola patients in the Emergency Department, for example, may be identified as a potential gap (Step 1). Simulated Ebola-infected patients could be used to explore the effectiveness of the Ebola alert system in Emergency Triage (Step 2). This needs assessment would clarify objectives (Step 3) of the program (i.e., building travel awareness, symptom awareness, etc.). Through an intervention of repeat simulated Ebola cases entering through the Emergency Room and a post-event debriefing, practitioners can deepen their understanding of the screening process and isolate potential Ebola patients more consistently (Step 4). Engaging Emergency Department leadership to both schedule and partake in process review of failures is necessary to address potential latent safety threats (Step 5). Success of the program could be defined as appropriate isolation of all simulated Ebola cases on all tours for 3 weeks straight (Step 6). What separates Kern's from other inductive approaches is that the educational intervention is informed by targeted needs assessments, collaborative goal creation and identifying specific measures of success. These clarify resource management and time commitment necessary for the intervention and without them, risk significant energy and time expenditure with the potential of little reward. An added element to consider is the ability to create short-term outcome measures of success to inform the intervention is moving toward intended results or if the program needs to pivot its strategy. More innovations should apply constructs like Kern's to demonstrate the benefits of structured approaches. Future research needs to focus attention on the clinical outcomes of these interventions, or Philips Level 4 outcomes. In this study, mapping learners to specific COVID case management may have appreciated metrics like length of stay, mortality rates, extubation, ARDS-related lung injury among other outcomes to validate the effectiveness of the intervention. It is also important to consider how, the Plan, Do, Study, Act (PDSA) construct integrates with Kern's Six Steps in Curriculum Design Framework, especially when interventions do not provide the expected results. In our intervention, the “teach-back” approach was integrated into our delivery to mitigate the poor understanding around the topics of compliance and resistance. As programs run for increased duration, these realizations may call for a revisit to lesson objectives and intervention to better target goals. **Constraints and limitations** Performing the program amid the second wave of the COVID pandemic posed a challenge that limited resources and opportunities for data collection and participation. As a result, concrete data for comparison of the care and outcomes of trained non-ICU clinicians that attended this program with those who did not attend was not achieved. Offering online curricula hoped to reach learners who might not be able to attend the simulation experience. Due to the multiple approaches packaged in this program, another limitation posed to program evaluation was that confidence and knowledge data was only collected on those who attended the simulation course and not the online didactic portion. When considering the change in approach made to include “teach-back methodology”, the length of time the intervention spanned did not allow for another iterative cycle of evaluation to consider the impact of that change. As feedback to our own process, an intentional review process at specific attendance milestones would have allowed for more polish to the program and potentially moved the needle of confidence and knowledge more dramatically. Work toward appreciating the difference in partnering the simulation intervention with online learning vs. online learning alone on knowledge may have been demonstrated the synergistic effect of the teaching methodologies had both cohorts been captured for summative assessment. **Conclusion** In conclusion, applying a strategy like Kern's Six Steps Curriculum Design Framework provides the needed structure to create a collaborative educational intervention that was responsive to the crisis specific to ventilator management training. Non-ICU clinicians perceived the program positively changed their use of the ventilator to approach these critically ill patients in the height of the crisis. Educational frameworks such as Kern's Six Steps should be included in preparedness and response phases of the disaster cycle. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Author contributions** MK: Conceptualization, Methodology, Project administration, Resources, Supervision, Writing – original draft, Writing – review & editing. LM: Conceptualization, Methodology, Supervision, Writing – original draft, Writing – review & editing. SB: Methodology, Writing – original draft, Writing – review & editing. DA: Project administration, Writing – original draft, Writing – review & editing. AU: Conceptualization, Project administration, Supervision, Writing – original draft, Writing – review & editing. ML: Conceptualization, Methodology, Project administration, Writing – original draft, Writing – review & editing. JA: Conceptualization, Methodology, Supervision, Writing – original draft, Writing – review & editing. LI: Conceptualization, Methodology, Writing – original draft, Writing – review & editing. A-SL: Investigation, Methodology, Project administration, Resources, Validation, Writing – original draft, Writing – review & editing. JP: Conceptualization, Methodology, Project administration, Resources, Supervision, Writing – original draft, Writing – review & editing. KW: Conceptualization, Methodology, Project administration, Resources, Supervision, Writing – original draft, Writing – review & editing. CT: Project administration, Supervision, Writing – original draft, Writing – review & editing. MM: Conceptualization, Methodology, Project administration, Resources, Supervision, Writing – original draft, Writing – review & editing. **Funding** The author(s) declare that no financial support was received for the research and/or publication of this article. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Gen AI was used in the creation of this manuscript. **Publisher's note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/femer.2025.1519991/full#supplementary-material **References** 1. Centers for Disease Control and Prevention.COVID Data Tracker. Atlanta, GA: U.S. Department of Health and Human Services, CDC (2025). Available online at:https://covid.cdc.gov/covid-data-tracker Google Scholar 2. Corvetto MA, Altermatt FR, Belmar F, Escudero E. Health care simulation as a training tool for epidemic management: a systematic review.Simul Healthcare. (2023) 18:382–91. doi: 10.1097/SIH.0000000000000716 PubMed Abstract|Crossref Full Text|Google Scholar 3. Pan D, Rajwani K. Implementation of simulation training during the COVID-19 pandemic: a New York hospital experience.Simul Healthcare. (2021) 16:46–51. doi: 10.1097/SIH.0000000000000535 PubMed Abstract|Crossref Full Text|Google Scholar 4. Chen BY, Tackett SA, Hughes MT, Kern DE, Thomas PA.Curriculum Development for Medical Education: A Six-Step Approach.Baltimore: Johns Hopkins University Press. (2022). Google Scholar 5. Miller-Kuhlmann R, Sasnal M, Gold CA, Nassar AK, Korndorffer JR, van Schaik S, et al. Tips for developing a coaching program in medical education. inMedical Education Online (vol. 29). Milton Park: Taylor and Francis Ltd (2023). Google Scholar 6. Khamis NN, Satava RM, Alnassar SA, Kern DE. A stepwise model for simulation-based curriculum development for clinical skills, a modification of the six-step approach.Surg Endosc. (2016) 30:279–87. doi: 10.1007/s00464-015-4206-x PubMed Abstract|Crossref Full Text|Google Scholar 7. Meguerdichian M, Walker K, Bajaj K. Working memory is limited: Improving knowledge transfer by optimising simulation through cognitive load theory.BMJ Simul Technol Enhanc Learn.(2016) 4:131–8. doi: 10.1136/bmjstel-2015-000098 PubMed Abstract|Crossref Full Text|Google Scholar 8. Hunt EA, Duval-Arnould JM, Nelson-McMillan KL, Bradshaw JH, Diener-West M, Perretta JS, et al. Pediatric resident resuscitation skills improve after “rapid cycle deliberate practice” training.Resuscitation.(2014) 85:945–51. doi: 10.1016/j.resuscitation.2014.02.025 PubMed Abstract|Crossref Full Text|Google Scholar 9. Clapper TC, Leighton K. Incorporating the reflective pause in simulation: a practical guide.J Contin Educ Nurs.(2020) 51:32–8. doi: 10.3928/00220124-20191217-07 PubMed Abstract|Crossref Full Text|Google Scholar 10. Bukhari H, Andreatta P, Goldiez B, Rabelo L. A framework for determining the return on investment of simulation-based training in health care.Inquiry.(2017) 54:46958016687176. doi: 10.1177/0046958016687176 PubMed Abstract|Crossref Full Text|Google Scholar 11. Dunham S, Lee E, Persky AM. The psychology of following instructions and its implications.Am J Pharmaceut Educ. (2020) 84:1052–6. doi: 10.5688/ajpe7779 PubMed Abstract|Crossref Full Text|Google Scholar 12. Medicine SoCC.COVID-19 Resources for Non-ICU Clinicians(2020). Available online at:https://covid19.sccm.org/nonicu/(accessed May 24, 2021). Google Scholar 13. Diaz MCG, DK. Sobolewski H. Using simulation to prepare healthcare teams during the COVID-19 pandemic.J Patient Saf.(2020) 16:251–2. doi: 10.1097/PTS.0000000000000778 PubMed Abstract|Crossref Full Text|Google Scholar 14. Peterson WJMB, Tucker RV, Losman ED, Harvey C, Hatton C, et al. Rapid dissemination of a COVID-19 airway management simulation using a train-the-trainers curriculum.Acad Med.(2020) 95:1334–6. doi: 10.1097/ACM.0000000000004120 PubMed Abstract|Crossref Full Text|Google Scholar 15. Munzer BWBB, Peterson WJ, Tucker RV, Doan J, Harvey C, et al. In-situ simulation use for rapid implementation and process improvement of COVID-19 airway management.West J Emerg Med.(2020) 21:99–106. doi: 10.5811/westjem.2020.7.48159 PubMed Abstract|Crossref Full Text|Google Scholar 16. Monesi A, Imbriaco G, Mazzoli CA, Giugni A, Ferrari P. In-situ simulation for intensive care nurses during the COVID-19 pandemic in Italy: advantages and challenges.Clin Simul Nurs. (2022) 62:52–6. doi: 10.1016/j.ecns.2021.10.005 PubMed Abstract|Crossref Full Text|Google Scholar Keywords:Kern's Six Steps, COVID, emergency response, special pathogens, critical care, workforce expansion Citation:Krouss M, Musser L, Bentley S, Alaiev D, Uppal A, Langston MD, Arbo JE, Iavicoli L, Lee A-S, Pohlman J, Walker K, Taubman C and Meguerdichian M (2025) Kern's Six Steps to implement simulation in public health crisis.Front. Disaster Emerg. Med.3:1519991. doi: 10.3389/femer.2025.1519991 Received:30 October 2024;Accepted:21 April 2025;Published:20 May 2025. Edited by: Reviewed by: Copyright© 2025 Krouss, Musser, Bentley, Alaiev, Uppal, Langston, Arbo, Iavicoli, Lee, Pohlman, Walker, Taubman and Meguerdichian. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Michael Meguerdichian,TWljaGFlbC5tZWd1ZXJkaWNoaWFuQG55Y2hoYy5vcmc= Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Context Programmatic elements Discussion Constraints and limitations Conclusion Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher's note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}