{"id": 690, "name": "Investopedia", "domain": "investopedia.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.investopedia.com/s-and-p-500-gains-and-losses-today-nucor-stock-falls-as-us-mexico-negotiate-on-steel-tariffs-11752613", "title": "S And P 500 Gains And Losses Today Nucor Stock Falls As Us Mexico Negotiate On Steel Tariffs 11752613", "content": "NewsMarketsCompaniesEarningsCD RatesMortgage RatesEconomyGovernmentCryptoLive Markets NewsPersonal FinanceView All Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All InvestingStocksCryptocurrencyBondsETFsOptions and DerivativesCommoditiesTradingAutomated InvestingBrokersFundamental AnalysisMarketsView All Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All SimulatorLogin / PortfolioTradeResearchMy GamesLeaderboard Login / Portfolio Trade Research My Games Leaderboard Login / Portfolio Trade Research My Games Leaderboard BankingSavings AccountsCertificates of Deposit (CDs)Money Market AccountsChecking AccountsView All Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal FinanceBudgeting and SavingPersonal LoansInsuranceMortgagesCredit and DebtStudent LoansTaxesCredit CardsFinancial LiteracyRetirementView All Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All EconomyGovernment and PolicyMonetary PolicyFiscal PolicyEconomicsView All Government and Policy Monetary Policy Fiscal Policy Economics View All Government and Policy Monetary Policy Fiscal Policy Economics View All ReviewsBest Online BrokersBest Crypto ExchangesBest Savings RatesBest CD RatesBest Life InsuranceBest Mortgage RatesBest Robo-AdvisorsBest Personal LoansBest Debt Relief CompaniesView All Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All SearchSearchPlease fill out this field. NewsNewsMarketsCompaniesEarningsCD RatesMortgage RatesEconomyGovernmentCryptoLive Markets NewsPersonal FinanceView All Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All InvestingInvestingStocksCryptocurrencyBondsETFsOptions and DerivativesCommoditiesTradingAutomated InvestingBrokersFundamental AnalysisMarketsView All Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis Markets View All SimulatorSimulatorLogin / PortfolioTradeResearchMy GamesLeaderboard Login / Portfolio Trade Research My Games Leaderboard Login / Portfolio Trade Research My Games Leaderboard BankingBankingSavings AccountsCertificates of Deposit (CDs)Money Market AccountsChecking AccountsView All Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal FinancePersonal FinanceBudgeting and SavingPersonal LoansInsuranceMortgagesCredit and DebtStudent LoansTaxesCredit CardsFinancial LiteracyRetirementView All Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All EconomyEconomyGovernment and PolicyMonetary PolicyFiscal PolicyEconomicsView All Government and Policy Monetary Policy Fiscal Policy Economics View All Government and Policy Monetary Policy Fiscal Policy Economics View All ReviewsReviewsBest Online BrokersBest Crypto ExchangesBest Savings RatesBest CD RatesBest Life InsuranceBest Mortgage RatesBest Robo-AdvisorsBest Personal LoansBest Debt Relief CompaniesView All Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Top Stories US, China Agree on Path for Trade Truce Musk Says He Regrets Some of His Posts About Trump Inflation Rose Less Than Expected In May S&P 500 Slips After Three Straight Days of Gains **S&P 500 Gains and Losses Today: Nucor Stock Falls as US, Mexico Negotiate on Steel Tariffs** Michael Bromberg is a finance editor with a decade of experience. He is an expert at elucidating complex financial topics in clear, concise language. Michael received a Bachelor of Arts in literature from the University of Wisconsin-Madison and a master's in linguistics from the Universidad de Antioquia in Medellin, Colombia. Michael Nagle / Bloomberg via Getty Images **Key Takeaways** The S&P 500 slipped 0.3% on Wednesday, June 11, as investors weighed softer-than-expected inflation data and progress on U.S.-China trade talks. Shares of Nucor and other steelmakers lost ground following reports that the U.S. and Mexico have discussed reducing or eliminating tariffs on steel imports up to a certain volume. GE Vernova shares advanced after BofA analysts boosted their price targets. The analysts highlighted expectations for strong growth in U.S. electricity demand. Major U.S. equities indexes ended the midweek session slightly lower. Stocks failed to extend their rally even as the latest Consumer Price Index (CPI) report showed alighter-than-expected uptick in inflationin May, while the U.S. and China announced aframework for implementing a trade deal. The S&P 500 traded in positive territory for much of the day but lost steam on Wednesday afternoon. It closed with a loss of 0.3%, snapping a streak of three straight winning sessions. The Nasdaq was down 0.5%, while the Dow finished just a point below Tuesday's closing level. After securing the S&P 500'stop performance in the previous session, Intel (INTC) shares gave back most of their gains on Wednesday, tumbling 6.5% to record the steepest daily drop in the benchmark index. This week'svolatility for Intel stockcame as trade talks between the U.S. and China boosted hopes for less onerous semiconductor export restrictions. Meanwhile, the chipmaker remains in the midst of a major restructuring effort under CEO Lip-Bu Tan, who has been focused on cutting costs through workforce reductions, divestitures, and other initiatives since entering the role in March. Shares of steelmakers came under pressure following reports that the U.S. and Mexico are negotiating to scale back or cancel President Donald Trump's 50% tariff on steel imports up to a certain volume. The North American neighbors are reportedly exploring a quota system that would allow a specific amount of the metal to enter the U.S. from Mexico duty-free or at lower rates, with excess amounts subject to the full 50% levy. Nucor (NUE) shares lost 6.1%. Lockheed Martin (LMT) shares dropped 4.3% after reports indicated that the U.S. Department of Defense is cutting down on its orders for the aerospace and defense manufacturer's F-35 fighter jets. Delays involving a technological upgrade have hampered the finalization of contracts for the F-35. Warner Bros. Discovery (WBD) jumped 5%, climbing the most of any S&P 500 stock on Wednesday, as investors continue to evaluate the entertainment giant's recently announced plan tosplit its studio operations and TV businessinto two separate companies. The stock has been volatile since the announcement, and uncertainties about the strategy remain. Starbucks (SBUX) shares jolted 4.3% higher on Wednesday. The coffee giant announced thelaunch of Green Dot Assist, a virtual assistant powered by generative artificial intelligence (AI) that is designed to help baristas with in-store functions, from learning to make drinks to troubleshooting maintenance issues. The company's CEO also said that Starbucks would accelerate its rollout of an updated staffing model across its stores and noted that the company has garnered significant interest regarding a possible sale of its stake in its China business. Shares of GE Vernova (GEV), the energy technology company that spun off from General Electric in 2024, surged 3.9% after Bank of America boosted its price target on the stock. Analysts highlighted their expectations for growing electricity demand in the U.S. over the next 10 years. They noted that GE Vernova could be well-positioned to capitalize on its natural gas turbine market strength. BofA also pointed to upside potential for GE Vernova's electrification business, anticipating strong demand for grid reliability equipment. Broadcom (AVGO) shares gained 3.4%. In results released last week, the chipmaker reported record quarterly revenue, driven by a boom in AI semiconductors, prompting numerous analysts to raise their price targets on the stock. However, Broadcom issued a muted forecast for the current quarter, citing potential softness in its server storage, wireless, and industrial businesses, and its shares initially moved lower in the wake of the report. Despite these challenges, Broadcom expects AI revenue growth to remain robust, saying it could hit $5.1 billion in the fiscal third quarter. News Markets News **Related Articles** About Us Terms of Service Dictionary Editorial Policy Advertise News Privacy Policy Contact Us Careers Your Privacy Choices # A B C D E F G H I J K L M N O P Q R S T U V W X Y Z"}