{"id": 1053, "name": "The Organized Crime and Corruption Reporting Project (OCCRP)", "domain": "occrp.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.occrp.org/en/project/russian-asset-tracker/secretive-cyprus-registered-funds-were-used-to-hide-megayachts-and-luxury-real-estate-linked-to-sanctioned-russian-banker", "title": "Secretive Cyprus Registered Funds Were Used To Hide Megayachts And Luxury Real Estate Linked To Sanctioned Russian Banker", "content": "Our Projects Our ReportingAll InvestigationsAll ScoopsAll FeaturesAll News All Investigations All Scoops All Features All News All Investigations All Scoops All Features All News AboutAbout OCCRPOur TeamOur Global NetworkGlobal Anti-Corruption ConsortiumAccomplice ProgramImpactAnnual ReportsAwardsSupportersBoard of DirectorsCorrections PolicyFAQs - Funding and Editorial Policies About OCCRP Our Team Our Global Network Global Anti-Corruption Consortium Accomplice Program Impact Annual Reports Awards Supporters Board of Directors Corrections Policy FAQs - Funding and Editorial Policies About OCCRP Our Team Our Global Network Global Anti-Corruption Consortium Accomplice Program Impact Annual Reports Awards Supporters Board of Directors Corrections Policy FAQs - Funding and Editorial Policies Resources for JournalistsOCCRP ID – Research DeskOCCRP Aleph – Data Platform OCCRP ID – Research Desk OCCRP Aleph – Data Platform OCCRP ID – Research Desk OCCRP Aleph – Data Platform Donate Organized CrimeAsset SeizuresCartelsFraudLaundromatsDrugsSmugglingAll Organized Crime Asset Seizures Cartels Fraud Laundromats Drugs Smuggling All Organized Crime Asset Seizures Cartels Fraud Laundromats Drugs Smuggling All Organized Crime CorruptionEmbezzlementSanctions BustingCOVID 19Election-riggingAll Corruption Embezzlement Sanctions Busting COVID 19 Election-rigging All Corruption Embezzlement Sanctions Busting COVID 19 Election-rigging All Corruption RegionsRussiaUnited StatesUnited Arab EmiratesAzerbaijanEuropeAll Regions Russia United States United Arab Emirates Azerbaijan Europe All Regions Russia United States United Arab Emirates Azerbaijan Europe All Regions Resources for JournalistsOCCRP AlephExplore DatasetsOCCRP IDGet Help Researching Your Story OCCRP Aleph Explore Datasets OCCRP ID Get Help Researching Your Story OCCRP Aleph Explore Datasets OCCRP ID Get Help Researching Your Story OCCRPAbout UsOur TeamGlobal NetworkGlobal Anti-Corruption ConsortiumSubscribe to our NewsletterAccomplice ProgramAnnouncementsImpactFAQ on OCCRP's Funding and Editorial PoliciesFeaturesAll ProjectsLeak to OCCRPBypassing Censorship About Us Our Team Global Network Global Anti-Corruption Consortium Subscribe to our Newsletter Accomplice Program Announcements Impact FAQ on OCCRP's Funding and Editorial Policies Features All Projects Leak to OCCRP Bypassing Censorship About Us Our Team Global Network Global Anti-Corruption Consortium Subscribe to our Newsletter Accomplice Program Announcements Impact FAQ on OCCRP's Funding and Editorial Policies Features All Projects Leak to OCCRP Bypassing Censorship **Matching Results** About Us Our Team Global Network Global Anti-Corruption Consortium Subscribe to our Newsletter Accomplice Program Announcements Impact FAQ on OCCRP's Funding and Editorial Policies Features All Projects Leak to OCCRP Bypassing Censorship Get quality reporting directly into your inbox, every week By submitting your email address you agree toOCCRP’s Privacy Policy en ru Still, We Report Dubai Unlocked Russian Asset Tracker Scam Empire Ukraine Russia Georgia **Secretive Cyprus-Registered Funds Were Used to Hide Megayachts and Luxury Real Estate Linked to Sanctioned Russian Banker** In Cyprus, a new type of investment fund was marketed to clients as a way to avoid disclosing their ownership of assets. In one case, these funds were used to obscure the ownership of offshore companies that allegedly held luxury assets linked to powerful Russian banker Andrei Kostin, including two megayachts worth tens of millions. James O'Brien/OCCRP Banner: James O'Brien/OCCRP Two megayachts linked to Andrei Kostin were hidden behind secretive investment funds in Cyprus, known as “registered alternative investment funds.” The funds were managed by a company called Inveqo, owned by the wife of a sanctioned Cypriot lawyer. Registered alternative investment funds, or RAIFs, were marketed by the lawyer’s firm as a way for clients to avoid revealing their ownership after an EU crackdown on corporate secrecy. Ownership of three Kostin-linked properties in Moscow and a neighboring region were also obscured behind investment funds managed by Inveqo. Two companies that Russian state banker Andrei Kostin allegedly used to control a pair of megayachts were transferred to secretive Cyprus investment funds on the eve of the Ukraine invasion, making it impossible to see who owned them, financial records show. The funds were managed by a company called Inveqo Fund Management Ltd. At the time, Inveqo was owned by the wife of a Cypriot lawyer, Christodoulos Vassiliades, who was sanctioned by the U.S. last year for acting as a “prolific enabler” of Russian oligarchs. Inveqo marketed the special type of funds used to own the megayachts — known as “registered alternative investment funds,” or RAIFs — as a way to help clients avoid revealing ownership information after the European Union tried to crack down on corporate secrecy, according to marketing materials found amid leaked emails obtained by OCCRP. The emails referred to in this investigation were found amid two different large-scale leaks from Russian businesses: one from mining company Solway leaked to Forbidden Stories and shared with OCCRP, and another from the Russian real estate developer Accent Capital, which OCCRP obtained from the pro-transparency group Distributed Denial of Secrets. One user appears to be Kostin, the longtime head of Russia’s state-owned VTB Bank, who has been sanctioned by the U.S. and European Union for his close ties to the regime of Vladimir Putin. Anti-corruption activist and opposition politician Aleksei Navalny, who died in a Russian prison camp this year, first linked Kostin to a 62-meter megayacht, the Sea & Us,in 2019. In February this year, a U.S. indictment of Kostin for sanctions evasion alleged that the banker also owned another megayacht, the 66-meter Sea Rhapsody, and that the vessels were held through two offshore companies, one based in theMarshall Islandsand another inBelize. The yacht Sea & Us, shown on Navalny’s website. The yacht Sea & Us, shown on Navalny’s website. The yacht Sea & Us, shown on Navalny’s website. The U.S. indictment claimed that Kostin “owned and controlled” these two offshore companies through “a series of additional shell companies, nominee owners, and trust and investment fund structures” which were used “to obscure his true beneficial ownership of the Sea Rhapsody and the Sea & Us.” (Kostin did not respond to a request for comment sent through VTB bank.) The indictment did not name these structures, but an OCCRP investigation has found that in October 2021, as tensions between Russia and the West over Ukraine were rising, ownership of the two offshore companies that held the yachts was transferred to two RAIFs managed by Inveqo, according to the Cypriot corporate register and financial records. (The funds have since been dissolved, and the current ownership structure of the yachts is unknown.) The Cypriot government had only introduced RAIFs in July 2018, just two months aftera European Union anti-money laundering directiverequired member states to create publicly accessible registries of “ultimate beneficial owners,” or UBOs, of companies. Read more about beneficial ownership registries and why they're critical in the fight against corruption. RAIFs received a particularly light regulatory touch. Unlike most funds, RAIFs only need to be registered — not licensed — by the Cyprus securities regulator, and they are available only to institutional and other professional investors. The use of RAIFs to obscure even highly sought-after assets like the megayachts highlights how hard it is to enforce sanctions effectively, said Stephan Blancke, an associate fellow at the Royal United Service Institute, a U.K.-based think tank. “This raises the question: How many other beneficiaries of these Cypriot alternative investment funds exist that we do not know about?” he asked. The lawyer whose firm marketed the funds, Vassiliades, said that he and his law firm had always acted in “strict compliance” with Cypriot and European Union sanctions and anti-money laundering and anti-corruption rules and regulations. He said that he had never been informed that Kostin or “any other sanctioned person” was an investor or beneficial owner in the RAIFs and yachts identified by OCCRP. “I was not informed or had any knowledge of this fact. No one ever disclosed such facts to me,” he said. Vassiliades himselfwas sanctionedlast year along with other “entities and individuals in his network” the U.S. said had acted as “prolific enablers of a number of Russian oligarchs.” (The sanctions announcement did not mention which oligarchs he was accused of working with, nor did it name Kostin.) **Marketing RAIFs to Hide Ownership** Inveqo was set up in late 2018 and licensed as an “alternative investment fund manager.” It was acquired in May 2021 by a company owned by Vassiliades’ wife, Eleni Vasiliadou, who also worked as an office manager at her husband’s law firm, Christodoulos Vassiliades & Co LLC. Although Inveqo was nominally owned by Eleni, a leaked email obtained by OCCRP showed that Vassiliades’ law firm circulated its marketing materials, and even referred to Inveqo as “our own affiliated company.” Although Vasiliadou did not respond to a request for comment, Vassiliades told OCCRP that she had owned Inveqo from June 2021 to May 2023 “as an investment” and that she had not been involved in the company’s day-to-day operations. He added that the email had been sent as part of a bulk newsletter to “many clients” of his law firm and was “not meant to promote or market Inveqo.” He said the term “affiliate” had been used to refer to “a firm in my law firm’s referral network and to which my law firm acted as a legal advisor.” “Neither me nor my law firm ever controlled INVEQO in any way, or had any ownership interest, or engaged or participated in INVEQO’s business activities or day-to-day operations,” he wrote. The marketing materials in the leaked emails show that RAIFs were presented to prospective clients as a way of avoiding having their ownership of assets revealed by the new EU transparency law, which the law firm referred to as “optimization of the UBO disclosure requirements.” The materials laid out how the actual investor in an RAIF would not appear when Cyprus published its register of company owners, but would instead remain hidden behind the name of an external fund manager. An excerpt from marketing materials for RAIFs obtained by OCCRP. An excerpt from marketing materials for RAIFs obtained by OCCRP. An excerpt from marketing materials for RAIFs obtained by OCCRP. In one information sheet distributed by the law firm, prospective clients were assured that “access to investors [sic] information is only available to the Fund Manager and to the Depositary.” Another example of the marketing material for RAIFs. Another example of the marketing material for RAIFs. Another example of the marketing material for RAIFs. Vassiliades denied that the RAIFs were marketed as a way of avoiding ownership disclosure. “Neither I or my law firm ever promoted or enabled any sanctions evasion or promoted any non-declaring of owners of assets. Any such practice is entirely against my professional ethics,” he said. In another leaked email introducing Inveqo to prospective clients, a Cypriot company called InterTaxAudit — whichVassiliades’ law firm calls its “affiliated partners” — referenced the disclosure requirements under the new EU directive. “The Fund structure can be a solution to this problem,” the email continued, “since it does not require a UBO, the investors are holding units of the Fund, they don’t ‘own’ the assets therefore their names are not disclosed anywhere.” In other words, clients could continue to control assets through these funds, but with their ownership hidden. **Moving Yachts Into RAIFS** The U.S. indictment alleged that Kostin owned his megayachts through companies registered in theMarshall IslandsandBelize. In October 2021, both of those offshore companies were transferred into Inveqo-managed RAIFs: Ostreus RAIF V.C.I.C. and Lorenor RAIF V.C.I.C., respectively, financial statements show. Andrei Kostin. Andrei Kostin. Andrei Kostin. Kostin was sanctioned by the European Union in February 2022, a day before Russia’s full-scale invasion of Ukraine. Cyprus made its register of beneficial owners publicly available that summer to adhere to the EU anti-money laundering directive. But thanks to the RAIFs, theyachts could not be found.Furthermore, because Vassiliades’ wife — not Vassiliades himself — owned Inveqo, the company was not affected when the U.S. and U.K. sanctioned Vassiliades inApril 2023. **Where Did the Yachts Go?** Where Did the Yachts Go? Where Did the Yachts Go? In 2022, when OCCRP published the Russian Asset Tracker project, the Sea Rhapsody and the Sea & Us were included ona list of “most wanted” assets— ones we had strong reason to believe were linked to a sanctioned figure with ties to the regime of Vladimir Putin, but whose ownership we could not prove. Since then, more information about the yachts has become publicly available: The U.S. indicted Kostin in February this year for sanctions evasion and money laundering, andnamed the two yachts as assets he had sought to hide. The indictment also named the Belize and Marshall Islands companies that owned the yachts, and provided detail on their luxurious fittings, including an infinity pool, a jacuzzi, and customized stationary on the Sea Rhapsody. The Belize company, Solston Shipping Limited, is still listed as the owner of the Sea Rhapsody on its current shipping certificate issued by the International Maritime Organization, a U.N. body responsible for regulating maritime transport. However, The Sea & Us changed its name to the Serenity and Unity, and it is now owned by a company called Comhold Limited, based in an unknown jurisdiction. The Marshall Islands company that previously owned it, Pasithea Shipping Ltd., has been dissolved. Both yachts were flagged as Marshall Islands vessels until 2022, when they began flying the Malaysian flag. They are currently docked in the Aegean Sea, off the coast of Turkey. The two megayachts were not the only Kostin-linked luxury assets whose ownership was obscured behind Inveqo RAIFs. In November 2021, the same RAIFs also took over three Cyprus firmslinked to Kostin’s property holdings by previous OCCRP and Navalny investigations: Angerston Holdings Ltd, Castelor Investments Ltd, and Eralmor Holdings Ltd. Angerston owned a luxurious three-story townhouse in Moscow, while Eralmor owned a luxury apartment in Moscow. Castelor held a share in a countryside resort in the Tver region northwest of Moscow for which it paid $58 million. **Kostin’s Alleged “Co-Conspirators” in Cyprus and Russia** Kostin’s Alleged “Co-Conspirators” in Cyprus and Russia Kostin’s Alleged “Co-Conspirators” in Cyprus and Russia The U.S. indictment against Kostin bolsters the findings of a previous OCCRP investigation, which named two people who appeared to be used by Kostin as fronts for his holdings: Eric Whyte and Natalia Solozhentseva. Though the indictment does not name them, it identifies the two co-owners of a Cyprus firm, Gesford Holdings, as “co-conspirators” in helping Kostin evade sanctions — including by concealing the ownership of his two superyachts. The indictment alleges that these “co-conspirators” owned Gesford via two shell firms, Aktien Enterprises Limited and Ionics Nominees Limited. (The indictment misspells Aktien as “Atkien” and Ionics as “Ionic.”) During the brief window when Cyprus’ beneficial owner registry was open, OCCRP identified the owner of Aktien as Eric Whyte, the son of a Canadian communist who moved to Moscow in the 1960s when Whyte was a boy. Properties linked to Kostin but held by Whyte included a luxury villa near the French coastal town of St. Tropez, a Paris property on the banks of the Seine, a luxury hotel in the Austrian Alps, and a winery in Ukraine’s occupied Crimean peninsula. The U.S. indictment alleges that one of the alleged “co-conspirators,” who matches the description of Whyte, “served as a nominal owner for several of Kostin’s assets, and … created, owned, and controlled a business in Cyprus that managed several of Kostin's companies and assets.” The other owner of Gesford was Natalia Solozhentseva, a former vice president of Kostin’s VTB Bank and board member of its Cypriot subsidiary. Solozhentseva was the beneficial owner of a Cyprus firm that bought stakes in the Russian franchise of fast food outlet KFC, as well as Russia’s leading discount retailer, Fix Price. Her profile matches that of alleged “co-conspirator 2” in the U.S. indictment, which claims that she “was an employee of VTB Bank and opened an office in Cyprus specifically to assist with the management of many of Kostin’s shell companies and assets.” The indictment accuses co-conspirators 1 and 2 of working together to manage Kostin’s superyachts, through a yacht management company based in Switzerland and a Cyprus-based company. Neither Whyte nor Solozhentseva responded to a request for comment. Since RAIFs were first introduced, the Cyprus company registry has publicly clarified that the ultimate investors in the funds must be declared, not just the fund managers, but it is difficult to know the extent to which this is being enforced. In November 2022, the European Union’s Court of Justice rulingstruck downthe requirement for member states to publish beneficial ownership information on privacy grounds, and the Cyprus registry closed to public access six days later. In July 2023, both of the Inveqo-managed funds used to hold the Kostin assets were dissolved, for reasons that remain unclear. Inveqo changed ownership in May 2023 and was itself dissolved earlier this year.” Tatiana Tkatchenko contributed reporting. **Join the fight.Hold power to account.** Join the fight.Hold power to account. Join the fight.Hold power to account. Support from readers like you helps OCCRP expose organized crime and corruption around the world. By donating, you’ll be directly supporting investigative journalism as a public good. You’ll also gain access to exclusive insights and benefits. **Related Reporting** **Sanctioned Russian Banker Andrei Kostin, Head of ‘Putin’s Piggy Bank,’ Uses Canadian Man as Proxy For Vast Holdings** A man named Eric Whyte controls offshores that own luxury properties and investments worth millions. Clues suggest he is... A man named Eric Whyte controls offshores that own luxury properties and investments worth millions. Clues suggest he is... A man named Eric Whyte controls offshores that own luxury properties and investments worth millions. Clues suggest he is... **Send Us Your Tips!** We need your help to keep tracking down the assets of Russia’s top oligarchs and enablers. We need your help to keep tracking down the assets of Russia’s top oligarchs and enablers. We need your help to keep tracking down the assets of Russia’s top oligarchs and enablers. **The US Tightens Sanctions Against Putin and Russia’s Elites** A U.S. court has authorized law enforcement to seize two planes belonging to sanctioned Russian oligarch Roman Abramovich,... A U.S. court has authorized law enforcement to seize two planes belonging to sanctioned Russian oligarch Roman Abramovich,... A U.S. court has authorized law enforcement to seize two planes belonging to sanctioned Russian oligarch Roman Abramovich,... Get quality reporting directly into your inbox, every week By submitting your email address you agree toOCCRP’s Privacy Policy Contact Us Work with Us Annual Reports Awards Supporters Board of Directors OCCRP Aleph OCCRP ID Investigations Scoops News Features Projects Person of the Year in Organized Crime and Corruption Privacy Policy Responsible Disclosure Contact Us"}