{"id": 841, "name": "WLEX - Lexington News", "domain": "lex18.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lex18.com/news/covering-kentucky/aclu-of-ky-advocates-for-increased-paid-leave-highlighting-the-challenges-faced-by-working-families", "title": "Aclu Of Ky Advocates For Increased Paid Leave Highlighting The Challenges Faced By Working Families", "content": "Menu NewsKentucky PoliticsCovering KentuckyNational NewsHeroes Among UsLEX 18 In-DepthLEX 18 InvestigatesLivestream/VideosPositively LEX 18Spotlight SeriesNews AppSubmit Photo/VideoVote in our LEX 18 Poll!Contests Kentucky Politics Covering Kentucky National News Heroes Among Us LEX 18 In-Depth LEX 18 Investigates Livestream/Videos Positively LEX 18 Spotlight Series News App Submit Photo/Video Vote in our LEX 18 Poll! Contests Kentucky Politics Covering Kentucky National News Heroes Among Us LEX 18 In-Depth LEX 18 Investigates Livestream/Videos Positively LEX 18 Spotlight Series News App Submit Photo/Video Vote in our LEX 18 Poll! Contests WeatherDaily ForecastHourly ForecastMaxTrack DopplerRadars and ForecastClosings and DelaysBill's Weather 101Weather Bug CamsTrafficStormTracker Weather App Daily Forecast Hourly Forecast MaxTrack Doppler Radars and Forecast Closings and Delays Bill's Weather 101 Weather Bug Cams Traffic StormTracker Weather App Daily Forecast Hourly Forecast MaxTrack Doppler Radars and Forecast Closings and Delays Bill's Weather 101 Weather Bug Cams Traffic StormTracker Weather App We Follow Through Investigates Community BBN Tonight Contests Contact Us Send Photo/Video Sign In Newsletters Sign Out Manage Emails Apps Careers Search Top StoriesNewsCovering KentuckyElection ResultsKentucky PoliticsKentucky Votes News Covering Kentucky Election Results Kentucky Politics Kentucky Votes News Covering Kentucky Election Results Kentucky Politics Kentucky Votes Weather Sports We Follow Through Kentucky PoliticsTop StoriesCovering KentuckyElection ResultsKentucky PoliticsKentucky VotesSportsWeather Top Stories Covering Kentucky Election Results Kentucky Politics Kentucky Votes Sports Weather Top Stories Covering Kentucky Election Results Kentucky Politics Kentucky Votes Sports Weather Covering KentuckyNews News News National NewsNews News News LEX 18 In-Depth LEX 18 InvestigatesNews News News Positively LEX 18 Spotlight Series News AppNews News News Submit Photo/Video **Actions** Facebook Tweet Email **ACLU of KY advocates for increased paid leave, highlighting the challenges faced by working families** FRANKFORT, Ky. (LEX 18) — In a recent committee hearing in Frankfort, representatives from the ACLU of Kentucky and other advocacy groups called for changes to the state’s paid leave policy for state workers. Currently, state employees get six weeks of paid parental leave for childbirth, adoption, or foster care, which can only be utilized once every decade. Advocates argue that this is not enough time for families. Brittany Elam from Kentucky Voices for Health spoke during the meeting: “Unless we expect families to plan out these births or adoptions or their medical needs like dentist appointments, this simply doesn’t reflect reality for most families.” Elam was joined by a representative from March of Dimes, who highlighted the benefits of improved paid leave policies. According to Nikki Boyd from March of Dimes, “Studies have consistently shown that paid leave reduces turnover costs for businesses, boosts business productivity, and leads to higher workforce participation among women.” With over 52,000 babies born in Kentucky each year, and approximately 70% of those homes having both parents working, the necessity for better parental leave policies is underscored. Boyd pointed out the stark realities of inadequate leave: “An international evaluation of paid leave policies shows that an increase of 10 weeks of paid maternity leave resulted in a 10% lower neonatal and infant mortality rate and a 9% lower rate of mortality of children under the age of five.” Public comments submitted regarding the current leave policy further illustrated the urgency for change. Many state workers expressed that the 10-year limit is unrealistic, with almost half reporting that they had more than one child by birth or adoption within a decade. As of October 2024, Kentucky remains one of the few states without comprehensive paid parental leave policies for state employees. According to Kentucky Voices for Health, 36 states and Washington D.C. have adopted various paid parental leave policies, typically providing between six to twelve weeks per event, such as childbirth, adoption, or foster placement. In response to the advocacy for change, Rosemary Holbrook, Assistant General Counsel for the Personnel Cabinet, defended the existing program. “We have a very comprehensive and competitive leave program we believe already in place. This was a generous enhancement, we think, to have those additional six weeks of leave and we matched it up under our sick leave at the 10-year and 20-year mark,” she said. Report a typo **Sign up to get your weekly dose of good news celebrating the best people and places in the Bluegrass! It's free and delivered right to your inbox!** **now signed up to receive theBest of Bluegrass Newsletter.** **Positively LEX18** **Positively LEX18** News Weather Sports Health Community BounceTV CourtTV Grit Apps Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact lex18 lex18news/?hl=en lex18news"}