{"id": 141, "name": "Block Telegraph", "domain": "blocktelegraph.io", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://blocktelegraph.io/meet48-officially-announces-tge-and-idol-listing-on-binance-alpha-bitget-gate-mexc-and-pancakeswap-on-june-11/#respond", "title": "Meet48 Officially Announces Tge And Idol Listing On Binance Alpha Bitget Gate Mexc And Pancakeswap On June 11", "content": "NewsBitcoinBlockchainCryptoTradingPolygonNFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Markets Regulation Press Releases Podcasts Subscribe NewsBitcoinBlockchainCryptoTradingPolygonNFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Markets Regulation Press Releases Podcasts Subscribe NewsBitcoinBlockchainCryptoTradingPolygonNFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Bitcoin Blockchain Crypto Trading Polygon NFTs Markets Regulation Press Releases Podcasts Subscribe Press Releases **MEET48 Officially Announces TGE and $IDOL Listing on Binance Wallet, Bitget, Gate, MEXC, and PancakeSwap on June 11** Dubai, UAE, June 10th, 2025, Chainwire On June 10,MEET48— the world’s first Web3.0 AI-Agent and AIUGC creator & fan economy entertainment community — announcedit will officially launch its TGE on June 11, 2025. MEET48’s native token, $IDOL, will be listed on Binance Alpha, Bitget, Gate, MEXC, and PancakeSwap.With a vision of disrupting Web3 through entertainment and leading a new Web3 entertainment era with idol cultivation and fan economy, MEET48 continues to shape the future. Binance Wallet and PancakeSwap have announced that MEET48’s TGE will take place on June 11, 2025, from 8AM to 10AM (UTC).Eligible participants must use Binance Alpha Points to join the subscription.$IDOL will go live on Bitget, Gate and MEXC on June 11, 2025 at 12PM (UTC). Currently, MEET48 boasts 3.8 million active users and 500,000 Web3 wallets globally, frequently ranking #1 among social applications on BNB Chain with on-chain interaction volumes exceeding hundreds of millions. With the TGE as a starting point, MEET48 will inject a range of major AI entertainment products and services, aiming to reinforce the utility and market value of the $IDOL token, and position it as a mainstream token in the Web3 real-world application landscape. The project also targets the market pain point of “IEO as a short-term peak,” striving to deliver long-term value for investors. In previous major Web3 events from 2024 to 2025 — whether in Hong Kong, Tokyo, Bangkok, or Singapore — MEET48 captivated global audiences with its distinctive interactive formats and powerful stage performances. For instance, during TOKEN2049, MEET48 hosted the Side Event “Back To The Streets,” where idols engaged in face-to-face interactions and handshakes with fans from around the world, deepening emotional bonds between them. FacebookTwitterBufferredditLinkedInIn addition, MEET48 officially announced that it had secured token round funding from a number of prominent institutions and individuals, including Liang Xinjun (Co-founder of Fosun Group), Hash Global, HashKey Capital, and Animoca. The round valued the project at a fully diluted valuation (FDV) of $100 million. Following the TGE, MEET48 will reveal further breakthroughs from this funding round, continuing to advance its mission of redefining Web3 through entertainment — and opening up broader possibilities for its future development on BNB Chain. Facebook Twitter Buffer reddit LinkedIn Facebook Twitter Buffer reddit LinkedIn On June 9, MEET48 launched its $IDOL airdrop program for all users interacting with the MEET48 ecosystem, partner communities, special contributors, active users of Mars Protocol, the top three winners of “The Mars Audition for Best3 AI-MEME” and holders of ecosystem NFTs. The first token claim will open immediately after TGE and can be used to participate inthe 1st Web3.0 All-Community Annual Idol Popularity Audition & Ceremony (WIPA). Notably, WIPA is the first global initiative to integrate blockchain mechanisms into idol audition systems. It is co-hosted by MEET48 and China’s major youth girl group SNH48 GROUP as global strategic partners and will be held on August 2 at Arena, AsiaWorld-Expo, Hong Kong. All members of SNH48 GROUP and their overseas AI-Agent virtual group will participate in the WIPA Global Finals to compete for resources in overseas and Web3 development. FacebookTwitterBufferredditLinkedIn2025 Q3 Roadmap — Mars Protocol, AIdol Producer, and AI-Audition Facebook Twitter Buffer reddit LinkedIn Facebook Twitter Buffer reddit LinkedIn Beyond WIPA, MEET48 will continue to execute its published ecosystem roadmap. In Q3 2025, MEET48 will further develop the Mars Protocol — a BSC-based AI-Agent and social idol coin launch platform. AIdol Producer will allow users to create AI Idol-Agents with autonomous interaction capabilities in one click, supporting chat, livestreaming, and virtual performances, while also leveraging advanced AIGC technologies to generate AI-based music, dance, and multimedia content. At the same time, MEET48 will launch “AI-Audition”, a next-generation AI + Web3 upgrade of the globally renowned game IP “Audition” — a classic dance simulation game with over 1 billion users and over $10 billion in historical revenue. “AI-Audition” is developed by the original “Audition” marketing team and deeply integrated with the MEET48 community, using $IDOL as its main in-game currency. It is built on the Web3 framework and rooted in idol cultivation and fan economy principles. As the world’s first virtual music and dance LLM + AI-Agent-powered simulation chain game, “AI-Audition” fuses three ecosystems under Web3 consensus: the music & dance AIUGC creator economy, virtual idol/group cultivation system, and dance simulation gameplay. As the core content pillar of the MEET48 ecosystem, “AI-Audition” represents the largest classic game IP integration in the history of AI entertainment and GameFi. With over 3 years of R&D, a total investment exceeding $100 million, and more than 500 developers, “AI-Audition” is set to launch public limited testing in Q3 2025, poised to become a landmark global industrial breakthrough in AI and Web3. FacebookTwitterBufferredditLinkedIn2025 Q4 Roadmap — CoinFishing and MonopoliFi Facebook Twitter Buffer reddit LinkedIn Facebook Twitter Buffer reddit LinkedIn In Q4 2025, MEET48 will introduce more game projects using the same governance token for community incentive and governance. CoinFishing combines a decentralized explosion rate mechanism with a market-driven swap liquidity pool to create a next-gen 3D upgrade of the classic fishing game under a fair, non-intervention Play-to-Earn model. MonopoliFi is a large-scale GameFi project integrating open-world and city-building UGC mechanics, allowing users to mine through tasks, build virtual cities using in-game editors, and conduct on-chain transactions — bridging the game economy with real-world financial systems. 2026 Q1 Roadmap — AI-Audition, Decentralized AI-Agent Graphic Social Layer, and Metaverse In Q1 2026, AI-Audition will enter unlimited testing and commercial operation. MEET48 will also prioritize the development of a decentralized AI-Agent-based graphic social layer and the MEET48 Metaverse. With its foundation in UGC creation and token-driven idol popularity growth, MEET48 aims to co-build with its users a robust Web3 + AI-powered entertainment infrastructure, pioneering the future of idol cultivation and the fan economy. About MEET48 MEET48is the world’s first AI-Agent and AIUGC-powered fan economy entertainment community and is regarded as one of the largest Web3 application project teams globally. With a 500-member R&D team and regional operations spanning Singapore, Hong Kong, Taipei, Tokyo, Seoul, and Dubai, MEET48 is committed to realizing mass adoption of Web3 through a youth entertainment ecosystem centered around AIGC (Animation, IDOL, GAME, and Comics) and a graphically intelligent social metaverse base. Official Website:https://www.meet48.xyz/ Twitter (X):https://x.com/meet_48 Telegram:https://t.me/MEET_48 Discord:https://discord.gg/meet48 Marketing DirectorEra SMEET48siyu@meet48.com Facebook Twitter Buffer reddit LinkedIn **Live Caffeine demonstration rounds out a landmark day at the 2025 World Computer Summit** **Bybit Adds Limit Order Functionality to Convert for Greater Trading Precision** **tBTC launches on Starknet: Expanding Bitcoin’s Role in Multi-Chain DeFi** Advertise Submit News Editorial Guidelines and Ethics Policy Privacy Policy User Agreement BlockTelegraph is the leading source of blockchain and cryptocurrency news for industry outsiders with digestable coverage and influencer opinions. **News** Industry Markets Podcasts Press Releases Blockchain Editorial Guidelines and Ethics Policy **The latest** **Live Caffeine demonstration rounds out a landmark day at the 2025 World Computer Summit** **Bybit Adds Limit Order Functionality to Convert for Greater Trading Precision** **tBTC launches on Starknet: Expanding Bitcoin’s Role in Multi-Chain DeFi** **BlockTelegraph Newsletter** © Grit Daily Group. All Rights Reserved."}