{"id": 1735, "name": "ICAN - Informed Consent Action Network", "domain": "icandecide.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://icandecide.org/press-release/ican-attorneys-secure-religious-exemption-to-vaccination-in-mississippi/", "title": "Ican Attorneys Secure Religious Exemption To Vaccination In Mississippi", "content": "Get Informed Legal Updates The HighWire About Us Take Action **Resource Links** Report a Vaccine Injury Blow the Whistle Vaccine Safety Debate V-Safe Data Pfizer Documents Ages 16+ Pfizer Documents Ages 12-15 Moderna Documents Ages 18+ **Donate Today** ICAN is a 501(c)(3) organization.Donationsto ICAN are tax-deductible.ICAN Legislateis a 501(c)(4) and the political arm of ICAN.Donations to ICAN Legislateare not tax-deductible. **Stay Connected** Subscribe to our newsletter and stay informed. **ICAN Attorneys Secure Religious Exemption to Vaccination in Mississippi** Today, ICAN’s attorneys secured a historic and critical win with a ruling from the bench following an evidentiary hearing, where a federal court has ruled that the First Amendment requires that, by July 15, 2023, the State of Mississippi afford its residents a religious exemption for their children to attend school without one or more state mandated vaccines! A written entry on the Court’s docket was issued shortly after the hearing providing, in relevant part: Minute Entry for proceedings before District Judge Halil S. Ozerden: Hearing on Plaintiffs’ Motion for Preliminary Injunction held on 4/17/2023. Court heard testimony and additional argument. For the reasons stated on the record, and to be more fully detailed in a written order to follow, the Court will grant Plaintiffs’ Motion. From and after July 15, 2023, Defendants Daniel P. Edney, in his official capacity as the State Health Officer … their officers, agents, servants, and employees, and anyone acting in active concert or participation with them will be enjoined from enforcing Mississippi Code § 41-23-37 [Mississippi’s compulsory school vaccination law] unless they provide an option for individuals to request a religious exemption from the vaccine requirement. Read the Judge’s full decision and order concerning the preliminary injunctionHERE. Mississippi is one of only six states that does not have a religious exemption for students to attend school. Numerous parents have sincerely held religious beliefs that do not permit them to vaccinate their children, including because of the involvement and development of vaccines using the products of abortions. Those parents were put in an impossible position as they were forced to violate their sincere religious beliefs if they wanted to send their children to school. The refusal to recognize religious exemptions has needlessly harmed these children by forcing their parents to homeschool or move out of the State, often directly across the border to attend school in a neighboring state while otherwise continuing to live their lives in Mississippi. Thus, ICAN supported a lawsuit to defend these parents’ constitutional rights. The State of Mississippi affords a secular exemption to those with medical reasons that prohibit vaccination, reflecting that it can accommodate students that are unvaccinated. It has simply chosen to not accord an exemption when it is someone’s immortal soul that a parent believes would be at risk. The plaintiffs and all parents in Mississippi whose children have been excluded from school due to their religious beliefs are, no doubt, incredibly heartened that a federal court agreed that the State cannot afford a secular exemption without affording a religious exemption because doing so violated the First Amendment. The six plaintiffs in thecaseare parents from across the state including a pastor that had to exclude his own daughter from his own private Christian school because he could not accord his own religious convictions to let her attend. ICAN could not be more proud to support this lawsuit that secured this incredible win for freedom! It is yet another step in its ongoing work to restore the right of every parent in this country to have his or her convictions respected and not trampled by the government. We look forward, with your support, to continuing and broadening this fight! **Recent** ICAN Investigates Johns Hopkins “Independent” Institute of Vaccine SafetyAs part of its watchdog work, ICAN routinely monitors suspicious health organizations and NGOs. The latest organization on our radar [...] ICAN Investigates Johns Hopkins “Independent” Institute of Vaccine SafetyAs part of its watchdog work, ICAN routinely monitors suspicious health organizations and NGOs. The latest organization on our radar [...] ICAN Investigates Johns Hopkins “Independent” Institute of Vaccine SafetyAs part of its watchdog work, ICAN routinely monitors suspicious health organizations and NGOs. The latest organization on our radar [...] ICAN Investigates Johns Hopkins “Independent” Institute of Vaccine SafetyAs part of its watchdog work, ICAN routinely monitors suspicious health organizations and NGOs. The latest organization on our radar [...] BREAKING: ICAN Sues CDC for Vaccine Safety Datalink (VSD) DataICAN has filed a lawsuit against the U.S. government to obtain critical vaccine safety data that has been used for [...] BREAKING: ICAN Sues CDC for Vaccine Safety Datalink (VSD) DataICAN has filed a lawsuit against the U.S. government to obtain critical vaccine safety data that has been used for [...] BREAKING: ICAN Sues CDC for Vaccine Safety Datalink (VSD) DataICAN has filed a lawsuit against the U.S. government to obtain critical vaccine safety data that has been used for [...] BREAKING: ICAN Sues CDC for Vaccine Safety Datalink (VSD) DataICAN has filed a lawsuit against the U.S. government to obtain critical vaccine safety data that has been used for [...] ICAN Helps Motocross Racer Obtain Green Card After He Was Denied Due to Refusal of the COVID-19 Vaccine ICAN Helps Motocross Racer Obtain Green Card After He Was Denied Due to Refusal of the COVID-19 Vaccine ICAN Helps Motocross Racer Obtain Green Card After He Was Denied Due to Refusal of the COVID-19 Vaccine ICAN Helps Motocross Racer Obtain Green Card After He Was Denied Due to Refusal of the COVID-19 Vaccine BREAKING: EPA Announces Probe Into Geoengineering Company in Response to Legal Letters from ICAN Attorneys BREAKING: EPA Announces Probe Into Geoengineering Company in Response to Legal Letters from ICAN Attorneys BREAKING: EPA Announces Probe Into Geoengineering Company in Response to Legal Letters from ICAN Attorneys BREAKING: EPA Announces Probe Into Geoengineering Company in Response to Legal Letters from ICAN Attorneys **Contact Us** [email protected][email protected]512-522-8739 **Media Inquiries** For media requests only[email protected]512-522-8739 **Donate** ICAN is a 501(c)(3) organization.Donationsto ICAN are tax-deductible.ICAN Legislateis a 501(c)(4) and the political arm of ICAN.Donations to ICAN Legislateare not tax-deductible. **Donate By Mail** **Call To Donate** 9am - 5pm CT737-297-4120 © 2025 ICAN Informed Consent Action Network. All rights reserved. **Stay Connected** Subscribe to our newsletter and stay informed. Privacy Policy|Cookie Policy|Terms of Use **Join our email list & get informed, FREE!** As a subscriber, you’ll be the first to receive: ICAN Legal Updates HighWire Insider Emails FREE ‘Introduction to Vaccine Safety’ Guide Get Informed. Get Involved.Sign up!"}