{"id": 624, "name": "Harper's Magazine", "domain": "harpers.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://harpers.org/2025/06/weekly-review-aid-site-madleen-ice-creative-knob-another-year-another-record-staffing-shortages-doge-tesla-whitney-houston-confirm-humanness-taylor-swift-llama-condom/", "title": "Weekly Review Aid Site Madleen Ice Creative Knob Another Year Another Record Staffing Shortages Doge Tesla Whitney Houston Confirm Humanness Taylor Swift Llama Condom", "content": "**Sign in to accessHarperâ\u0080\u0099s Magazine** We've recently updated our website to make signing in easier and more secure **Hi there. You have1freearticlethis month.Connect to your subscription or subscribe for full access** **You've reached your free article limit for this month.Connect to your subscription or subscribe for full access** **Thanks for being a subscriber!** About Archive Authors Gala Newsletters Shop Podcast Events Subscribe Search 175 Years Current Issue Sections The Latest Search About Archive Authors Gala Newsletters Shop Podcast Events Subscribe Search **Weekly Review** In Gaza, at least five Palestinians were killed while attempting to access an Israeli- and U.S.-backed aid site, the latest in a string of attacks at or near aid centers.12Greta Thunberg and other activists embarked from Catania, Italy, aboard theMadleen, a humanitarian aid vessel named after a Gazan fisherwoman, that aimed to break Israelâ\u0080\u0099s naval blockade on the Gaza Strip; days later, the shipencountered thirty to forty Sudanese refugees on a deflating boat and rescued four of them who had jumped into the sea to avoid arrest; and about a week after the aid ship set sail, Israeli forces seized it and detained those onboard.3456Satellite imagery captured roughly 40 balloons of mysterious function floating around a 5,000-ton North Korean warship that capsized in late May, and a Mylar balloon caused a power outage at the St. Louis Lambert International Airport.78The Maryland man Kilmar Abrego Garcia, who was deported due to what a senior ICE official called an â\u0080\u009cadministrative error,â\u0080\u009d returned to the United States from a Salvadoran mega-prison to face criminal charges; the U.S. president deployed 2,000 members of the National Guard to Los Angeles in response to protests that erupted over citywide ICE raids; senior immigration officials ordered ICE officers to â\u0080\u009cturn the creative knob up to 11,â\u0080\u009d â\u0080\u009cpush the envelope,â\u0080\u009d and to interrogate and apprehend â\u0080\u009ccollateralsâ\u0080\u009d during arrests; and an ethics columnist addressed the question,is it OK to earn rental income from an ICE holding facility?9101112The United States instituted a travel ban to seven African nations, and a second group of white South African Afrikaners arrived under the U.S. presidentâ\u0080\u0099s new refugee resettlement program.1314A Pentagon investigation into conspiracy theories regarding UFO programs uncovered that some theories were promoted by members of the Pentagon itself, in an attempt to cover-up real secret-weapons programs; and at least eight states have introduced legislation to investigate or mitigate chemtrails, which some conspiracy theorists believe shower toxins, perform mind control, sterilize people, and manipulate the weather.1516The World Meteorological Organization predicts that global average temperatures may reach two degrees Celsius above preindustrial levels for the first time within the next five years, and it was reported that Earthâ\u0080\u0099s atmosphere now has more carbon dioxide in it than it has in millions of years.17â\u0080\u009cAnother year, another record,â\u0080\u009d said a professor of climate sciences. â\u0080\u009cItâ\u0080\u0099s sad.â\u0080\u009d18Â Economists questioned the integrity of U.S. inflation data after staffing shortages at the Bureau of Labor Statistics impeded its ability to conduct its massive monthly survey, and the United Kingdomâ\u0080\u0099s Office for National Statistics admitted that its April headline inflation rate had been too high due to its receiving inaccurate road tax data from the Department for Transport.1920Following the breakdown of the U.S. president and Elon Muskâ\u0080\u0099s relationship, Department of Government Efficiency employees worried about their job security; several government agencies rushed to rehire employees fired by DOGE; Teslaâ\u0080\u0099s stock price dropped 14 percent in a single day; and it was reported that the president decided to sell his red Tesla Model S, which he purchased in March, and which is typically parked on West Executive Avenue at the White House.21222324In suburban Detroit, employees on the beta production line of an â\u0080\u009canti-Tesla,â\u0080\u009d Jeff Bezos-funded EV startup assembled cars to Whitney Houstonâ\u0080\u0099s â\u0080\u009cSaving All My Love for Youâ\u0080\u009d and Pat Benatarâ\u0080\u0099s â\u0080\u009cLove is a Battlefieldâ\u0080\u009d; and in Newark, the U.S. president proceeded to his cageside seats at a UFC fight as Kid Rockâ\u0080\u0099s â\u0080\u009cAmerican Bad Assâ\u0080\u009d played.252627The worldâ\u0080\u0099s largest arms dealer, Lockheed Martin, launched an â\u0080\u009cAI Fight Clubâ\u0080\u009d that simulates head-to-head matchups between AI systems; and World, an iris-scanning identification project from the OpenAI CEO, launched in London, with an orb that â\u0080\u009cconfirms humannessâ\u0080\u009d to help distinguish real people from AI impersonators, including those created by OpenAIâ\u0080\u0099s own technology.282930The TSA reminded flyers that Costco Gold Star membership cards do not suffice as a form of identification; and it was reported that the U.S. president has at least two cell phones, including one whose lock-screen wallpaper is his own face.3132 The Chinese technology conglomerate Tencent purchased a nearly 10 percent stake in the South Korean agency SM Entertainment, streams of Taylor Swiftâ\u0080\u0099s catalogue jumped by 55 percent after she bought back her first six records, and physicists claimed to have created the worldâ\u0080\u0099s smallest violin.333435A cow attempting an escape from an Arkansas livestock auction scaled the bleachers and tore down ceiling tiles; a runaway pet zebra was located in central Tennessee and airlifted to an animal trailer; and San Diego activists protested the cruelty of goldfish races.363738A study deemed Llama the best AI chatbot for assessing the reliability and quality of information regarding penis enhancement, and Amsterdamâ\u0080\u0099s Rijkmuseum acquired a twenty-centimeter condom dating from around 1830 that is printed with an image of a half-naked nun holding court with three men displaying erect penises and is likely made from a sheepâ\u0080\u0099s appendix.3940â\u0080\u009cWe suspect,â\u0080\u009d the curator said, â\u0080\u009cit was never actually used.â\u0080\u009d41Ââ\u0080\u0094Jasmine Liu A weekly email taking aim at the relentless absurdity of the 24-hour news cycle. **Got it! Thanks for signing up!** A weekly email taking aim at the relentless absurdity of the 24-hour news cycle. **Got it! Thanks for signing up!** Current IssueAdvertisingPermissions and ReprintsInternshipsCustomer Care ContactCareersClassifiedsHelp ArchiveSubmissionsFind a Newsstand AboutMediaStoreTerms of ServicePrivacy Policy Current Issue Contact Archive About AdvertisingPermissions and ReprintsInternshipsCustomer Care CareersClassifiedsHelp SubmissionsFind a Newsstand MediaStoreTerms of ServicePrivacy Policy â\u0080\u009cAn unexpectedly excellent magazine that stands out amid a homogenized media landscape.â\u0080\u009d â\u0080\u0094theNew York Times **Debug**"}