{"id": 434, "name": "Fairmont Sentinel", "domain": "fairmontsentinel.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fairmontsentinel.com/sports/local-sports/2025/06/10/area-roundup-north-union-suffers-first-loss-of-the-season/", "title": "Area Roundup North Union Suffers First Loss Of The Season", "content": "NewsLocal NewsPoliceCourtsMN State NewsNational NewsInternational News Local News Police Courts MN State News National News International News Local News Police Courts MN State News National News International News SportsLocal SportsMN State SportsNational Sports Local Sports MN State Sports National Sports Local Sports MN State Sports National Sports OpinionColumnsLocal EditorialsLetters to the Editor Columns Local Editorials Letters to the Editor Columns Local Editorials Letters to the Editor LifePeople & EventsEngagementsWeddingsAnniversariesNew ArrivalsBirthdays People & Events Engagements Weddings Anniversaries New Arrivals Birthdays People & Events Engagements Weddings Anniversaries New Arrivals Birthdays Obituaries Jobs Classifieds Garage Sales Public NoticesBrowse NoticesPlace Notices Browse Notices Place Notices Browse Notices Place Notices Contact InformationContact UsSubmit NewsSubscribeAdvertiseRoute OpeningsStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Route Openings Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Route Openings Statement of Values Terms of Service News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **Area Roundup: North Union suffers first loss of the season** **** Jun 10, 2025 FONDA – In their first defeat of the season, the North Union Warriors fell to nonconference opponent Newell-Fonda 19-5 in four innings in their second Saturday game. The game started off red hot with the score 10-4 Newell-Fonda after the first inning. Newell-Fonda tightened up and North Union’s bats went quiet as the score grew to 19-4 after three innings. North Union got a run in the fourth, but not enough to keep them in the game. Shallie Walders went 1 for 2 with one RBI and one run. Bryn Nicoson went 1 for 2 with an RBI, while Maisey Bierstedt went 0 for 2 with one RBI. The Warriors (7-1) won their next game to be shown in Wednesday’s roundup. Their next game is against West Hancock Tuesday on the West Hancock Softball field at 6 p.m. NORTH UNION 5, SIOUX CENTRAL 4 FONDA – In a close game to start their Saturday games, the North Union Warriors beat Sioux Central 5-4 in a nonconference battle. North Union initially got out to a 3-0 lead after the third. They tacked on two runs in the fifth, but so did Sioux Central to make it 5-2. With one last gasp, Sioux Central got two runs in the seventh but could not make it all the way. Aslynn Sobolik went 3-3 with two RBIs and one run. Ainsley Ulrich, Shallie Walders, and Kyla Irmiter each had one RBI, with Ulrich and Walders each scoring runs as well. In a complete game, Ulrich had 11 strikeouts while only allowing three hits and one earned run. LATE FRIDAY NORTH UNION 16, BISHOP GARRIGAN 1 ALGONA – The North Union Warriors beat Top of Iowa Conference opponent Bishop Garrigan 16-1 in four innings Friday. North Union started hot with a 6-0 score after the first inning. They then scored three in the second, five in the third, and two in the fourth. Bishop Garrigan would score one in the fourth, but it wasn’t enough to keep the game going. Ainsley Ulrich went 4 for 4 with three RBIs and three runs. Aslynn Sobolik went 1 for 4 with three RBIs and two runs. Maisley Bierstedt was 1 for 2 with two RBIs and one run, while Ariana Giddings was 1 for 3 with two RBIs. Pitching a complete game, Ulrich had seven strikeouts while only allowing three hits with no earned runs. PREP BASEBALL LAKE MILLS 10, NORTH UNION 2 BANCROFT – The North Union Warriors fell to Lake Mills in a Top of Iowa Conference game 10-2 Monday. Lake Mills jumped out to an early lead, 3-0 after the first and 5-0 after the second. Though there would be rallies in the third and fifth, each produced one run and could not match Lake Mills. Brennan Bollinger went 0 for 1 with one RBI and three walks. Caden Walders went 1 for 3 with one run. In the start, Caden Walders had eight strikeouts and three earned runs in three innings. In relief, Colin Kruse got two strikeouts in one inning of work. The Warriors (4-4) have their next game Tuesday against West Hancock at 7:30 p.m. on West Hancock’s High School field. **Newsletter** **Local Sports** **Local Sports** **Area roundup: Local boys faring well at state golf** **Area roundup: Local boys faring well at state golf** **Area Roundup: North Union suffers first loss of the season** **Area Roundup: North Union suffers first loss of the season** PREP SOFTBALL NEWELL-FONDA 19, NORTH UNION 5 FONDA – In their first defeat of the season, the North Union ... **Cardinals boys tennis earns 3 Big South honors** **Cardinals boys tennis earns 3 Big South honors** The Big South Conference revealed its All-Conference Boys Tennis teams for the 2025 season. Making the East ... **Martins bounce back, run over Heron Lake** **Martins bounce back, run over Heron Lake** **Fairmont sending bus full to state** **Fairmont sending bus full to state** **Fairmont has 3 softball players honored by Big South** **Fairmont has 3 softball players honored by Big South** The Big South Conference released its All-Conference Softball teams on Friday, with three Fairmont Cardinals ... MOST READ **Area roundup: Local boys faring well at state golf** **Area roundup: Local boys faring well at state golf** **School Board hosts first open house for improvement projects** **School Board hosts first open house for improvement projects** **City Band plays on for community** **City Band plays on for community** **Council still in pursuit of projects, funds** **Council still in pursuit of projects, funds** **Alice L. Russenberger** **Alice L. Russenberger** **June events planned in Sherburn** **June events planned in Sherburn** **Newsletter** **Starting at $2.99/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsPoliceCourtsObituaries Local News Police Courts Obituaries Local News Police Courts Obituaries SportsLocal SportsMN State SportsNational Sports Local Sports MN State Sports National Sports Local Sports MN State Sports National Sports OpinionLocal EditorialsLetters to the Editor Local Editorials Letters to the Editor Local Editorials Letters to the Editor LifePeople & EventsEngagementsWeddingsNew Arrivals People & Events Engagements Weddings New Arrivals People & Events Engagements Weddings New Arrivals ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Ogden Newspapers of Minnesota, Inc. | https://www.fairmontsentinel.com | 64 Downtown Plaza, Fairmont, MN 56031 | 507-235-3303"}