{"id": 413, "name": "Yonhap News Agency", "domain": "en.yna.co.kr", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://en.yna.co.kr/economy-finance/economy", "title": "Economy Finance", "content": "한국어 中文 日本語 عربي Español Français Facebook Twitter RSS Feed All News NationalPoliticsDiplomacyDefenseNational Politics Diplomacy Defense National Politics Diplomacy Defense National North Korea Economy/FinanceEconomyFinanceHealth Economy Finance Health Economy Finance Health BIZLatest NewsOn the RecordM&AsCorporate NewsroomEarningsStartupsFocus/FeatureStocks Latest News On the Record M&As Corporate Newsroom Earnings Startups Focus/Feature Stocks Latest News On the Record M&As Corporate Newsroom Earnings Startups Focus/Feature Stocks Culture/K-popEntertainmentMoviesK-popArts/Culture Entertainment Movies K-pop Arts/Culture Entertainment Movies K-pop Arts/Culture Sports ImagesK-waveGeneralNorth Korea K-wave General North Korea K-wave General North Korea Videos Press Releases **Economy/Finance Economy** #BessentBessent hints reciprocal tariff pause can be extended for those in 'good-faith' negotiationsBy Song Sang-ho and Kim Dong-hyun WASHINGTON, June 11 (Yonhap) -- U.S. Treasury Secretary Scott Bessent hinted Wednesday that President Donald Trump's temporary pause on \"reciprocal\" tariffs could ...05:06 Jun. 12 #extra budgetNew vice finance minister vows swift implementation of extra budget focused on economic recoveryrelated articleBy Kim Han-joo SEJONG, June 11 (Yonhap) -- Lim Ki-keun, the newly appointed second vice finance minister, said Wednesday the government will swiftly draw up an extra budget aimed at revitalizing t...18:00 Jun. 11 #Samyang Foods-plantSamyang Foods completes plant expansion amid growing demand for Buldak spicy ramyeonrelated articleSEOUL, June 11 (Yonhap) -- Samyang Foods Inc., known for its globally popular Buldak spicy ramyeon, said Wednesday it has completed a plant expansion to meet rising global demand for its signature ...15:59 Jun. 11 #vice industry ministerKorean economy at golden time for fundamental change: new vice industry ministerrelated articleSEOUL, June 11 (Yonhap) -- The South Korean economy is at a golden time to make \"fundamental\" changes amid various challenges, including global trade uncertainties, the country's new first vice ind...14:54 Jun. 11 #corporate sales(LEAD) Corporate sales, operating profits advance in 2024: BOK(ATTN: ADDS details on interest coverage ratio in last 5 paras, first photo) SEOUL, June 11 (Yonhap) -- South Korean companies' sales and profitability improved last year, driven by strong performa...14:02 Jun. 11 #household loans(LEAD) Household borrowing logs sharpest gain in 8 months in May on rising home transactionsrelated article(ATTN: ADDS more details in last 8 paras) SEOUL, June 11 (Yonhap) -- Household loans extended by South Korean banks rose sharply in May, central bank data showed Wednesday, driven by an increase in...13:57 Jun. 11 #BGF Retail-tatoo kioskBGF Retail launches industry's 1st tattoo kiosk at CU convenience storesrelated articleSEOUL, June 11 (Yonhap) -- BGF Retail Co., the operator of CU convenience stores, said Wednesday it has introduced the industry's first-ever \"tattoo kiosk\" aimed at enhancing the in-store customer ...12:10 Jun. 11 #household loansHousehold borrowing logs sharpest gain in 8 months in May on rising home transactionsrelated articleSEOUL, June 11 (Yonhap) -- Household loans extended by South Korean banks rose sharply in May, central bank data showed Wednesday, driven by an increase in housing transactions. Banks' outstandi...12:00 Jun. 11 #TemuS. Korea fines Chinese e-commerce platform Temu over deceptive promotionsrelated articleBy Kim Han-joo SEJONG, June 11 (Yonhap) -- South Korea's antitrust watchdog said Wednesday it has fined Temu for misleading South Korean consumers through deceptive promotional campaigns, marking t...12:00 Jun. 11 #corporate salesCorporate sales, operating profits advance in 2024: BOKSEOUL, June 11 (Yonhap) -- South Korean companies' sales and profitability improved last year, driven by strong performance in the semiconductor, transportation and other industries, as well as a l...12:00 Jun. 11 #firms-governance structureOnly 6 pct of listed firms adopt cumulative voting: reportSEOUL, June 11 (Yonhap) -- Only six percent of 171 listed companies on South Korea's main stock exchange have adopted cumulative voting, a system aimed at enhancing shareholder rights, according to...11:22 Jun. 11 #seafood exportsGov't to meet with seafood exporters on boosting global competitivenessrelated articleSEOUL, June 11 (Yonhap) -- The oceans ministry was set to meet with officials from South Korea's seafood companies Wednesday to discuss measures to further boost the local industry's export competi...11:00 Jun. 11 #Samsung SDI-supply dealSamsung SDI to supply batteries to German ESS firm Tesvoltrelated articleSEOUL, June 11 (Yonhap) -- Samsung SDI Co., South Korea's second-largest battery maker, said Wednesday it has signed a battery supply deal with German energy storage system (ESS) provider Tesvolt A...10:48 Jun. 11 #exports tally(LEAD) Exports up 5.4 pct during first 10 days of June on strong chip, automobile demandrelated articleSEJONG, June 11 (Yonhap) -- South Korea's exports went up 5.4 percent from a year earlier in the first 10 days of this month driven by robust demand for semiconductors and automobiles, data showed ...09:56 Jun. 11 #OpenAI CSO-visitOpenAI CSO Kwon to visit S. Korea for AI partnership: sourcesrelated articleSEOUL, June 11 (Yonhap) -- Jason Kwon, Chief Strategy Officer (CSO) of OpenAI, will visit South Korea on Thursday for the second time in just over two weeks to explore partnerships in the artificia...09:27 Jun. 11 #exports tallyExports up 5.4 pct during first 10 days of Junerelated articleSEJONG, June 11 (Yonhap) -- South Korea's exports went up 5.4 percent from a year earlier in the first 10 days of this month, data showed Wednesday. Outbound shipments reached US$15.47 billion i...09:20 Jun. 11 #jobless rate(2nd LD) S. Korea adds 245,000 jobs in May, yet manufacturing, construction sectors remain weakrelated article(ATTN: ADDS more info throughout) SEJONG, June 11 (Yonhap) -- South Korea added more than 200,000 jobs for the first time in 13 months in May, but employment losses continued in the manufacturing a...09:01 Jun. 11 #SK hynix-biz outlookSK hynix CEO says company on track but warns of rising uncertainties in H2related articleSEOUL, June 11 (Yonhap) -- The head of SK hynix Inc. said the South Korean chipmaker is on track to meet its business targets for the year but warned that uncertainties are likely to grow in the se...08:55 Jun. 11 #jobless rate(LEAD) S. Korea adds 245,000 jobs in May, yet manufacturing, construction sectors remain weakrelated article(ATTN: CHANGES headline, lead; ADDS more info throughout) SEJONG, June 11 (Yonhap) -- South Korea added more than 200,000 jobs for the first time in 13 months in May, but employment losses continue...08:25 Jun. 11 #jobless rateS. Korea adds more than 200,000 jobs for first time in 13 months in MaySEJONG, June 11 (Yonhap) -- South Korea added 245,000 jobs in May, marking the first time in 13 months that employment grew by more than 200,000, government data showed Wednesday. The number of ...08:00 Jun. 11 BGF Retail launches industry's 1st tattoo kiosk at CU convenience stores (LEAD) Exports up 5.4 pct during first 10 days of June on strong chip, automobile demand (LEAD) S. Korea adds 245,000 jobs in May, yet manufacturing, construction sectors remain weak (2nd LD) S. Korea adds 245,000 jobs in May, yet manufacturing, construction sectors remain weak OpenAI CSO Kwon to visit S. Korea for AI partnership: sources N.K. leader inspects hospital construction site BTS' RM, V discharged from military service N.K. leader inspects hospital construction site N.K. leader inspects hospital construction site KT&G to face fierce battle to appoint new CEO at shareholder meeting Demographic time bomb in S. Korea over world's lowest birth rate, super aging Korean Air, Asiana one step away from forming mega-carrier after EU's merger nod Facing rapid aging and regional disparity, S. Korea takes first step to secure more doctors in decades All News National North Korea Economy/Finance Biz Culture/K-pop Sports Images Videos Top News Most Viewed Korean Newspaper Headlines Today in Korean History Yonhap News Summary Editorials from Korean Dailies Korea in Brief Useful Links Weather Advertise with Yonhap News Agency 한국어 中文 日本語 عربي Español Français Facebook Twitter RSS Feed Sitemap"}