{"id": 1978, "name": "Frontiers in Child and Adolescent Psychiatry", "domain": "frontiersin.org/journals/child-and-adolescent-psychiatry", "bias": "pro-science", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/child-and-adolescent-psychiatry/articles/10.3389/frcha.2025.1604431/full", "title": "Child And Adolescent Psychiatry", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Autism and Other Neurodevelopmental Disorders Child Mental Health and Interventions Developmental Psychopathology and Mental Health Interventions for Adolescent Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Autism and Other Neurodevelopmental Disorders Child Mental Health and Interventions Developmental Psychopathology and Mental Health Interventions for Adolescent Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Autism and Other Neurodevelopmental Disorders Child Mental Health and Interventions Developmental Psychopathology and Mental Health Interventions for Adolescent Mental Health Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Child Adolesc. Psychiatry Sec. Child Mental Health and Interventions Volume 4 - 2025 |doi: 10.3389/frcha.2025.1604431 This article is part of the Research TopicAddressing emotionally based school avoidance: causes, consequences, and interventionsView all 10 articles **A Longitudinal Investigation of School Absenteeism and Mental Health Challenges among Canadian Children and Youth in the COVID-19 Context** 1University of Ottawa, Ottawa, Canada 2Carleton University, Ottawa, Ontario, Canada 3Saint Paul University, Ottawa, Ontario, Canada 4University of Calgary, Calgary, Alberta, Canada 5Dalhousie University, Halifax, Nova Scotia, Canada 6University of British Columbia, Vancouver, British Columbia, Canada The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here School absenteeism across the globe has risen dramatically since the COVID-19 pandemic. Literature indicates that children and youth of all ages are struggling to attend school regularly, leading to problematic outcomes both concurrently and across time. As well, research demonstrates that children and youth who experience mental health challenges are at greater risk of increased school absenteeism rates. The present study investigated the school attendance patterns of Canadian children and youth and the longitudinal and bidirectional links with mental health challenges within the COVID-19 pandemic context. The study sample consisted of 72 children and youth, using parent reports. Parents were asked to complete an online questionnaire which included questions about the demographic characteristics of themselves and their child, their child's school attendance patterns, and their child's mental health challenges. Preliminary descriptive statistics were run in relation to school absenteeism. Two separate path analyses were conducted to determine the longitudinal links between school absenteeism and mental health (split into externalizing and internalizing behaviours) across two timepoints (Time 1 [T1]: Fall 2022, Time 2 [T2]: Spring 2023). These analyses indicated concurrent links between mentalhealth difficulties and school absenteeism. Importantly, path analyses also showed that absenteeism at T1 predicted poorer mental health at T2, indicating that school absenteeism may be one of the driving factors in the causal relationship. A bidirectional effect was found between externalizing behaviours at T1 and absenteeism rates at T2. The reasons for school absenteeism were examined across each time point and for both the externalizing and internalizing groups separately. The present study highlights the complex interplay between mental health and school absenteeism in the context of the COVID-19 pandemic. It provides avenues for effective Keywords:internalizing mental health problems, child and adolescent, Longitudinal, School absenteeism, externalizing mental health problems Received:01 Apr 2025;Accepted:06 Jun 2025. Copyright:© 2025Krause, Rogers, Jiang, Climie, Corkum, Mah, McBrearty, Smith and Whitley. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Amanda Krause, University of Ottawa, Ottawa, Canada Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}