{"id": 210, "name": "Center for European Policy Analysis", "domain": "cepa.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cepa.org/comprehensive-reports/meeting-chinas-trade-and-tech-challenge-how-the-us-and-europe-can-come-together/", "title": "Meeting Chinas Trade And Tech Challenge How The Us And Europe Can Come Together", "content": "Geopolitics Technology Defense Tech ExpertsOur FellowsOur Team Our Fellows Our Team Our Fellows Our Team Insights & AnalysisLatest CommentaryComprehensive ReportsPodcastsThe CEPA PodcastEventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts Latest Commentary Comprehensive Reports PodcastsThe CEPA Podcast The CEPA Podcast EventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts Latest Commentary Comprehensive Reports PodcastsThe CEPA Podcast The CEPA Podcast The CEPA Podcast EventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts AboutCEPA at 20IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracyProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech InitiativeTeamSupportersWork With UsContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA at 20 IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy ProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Team Supporters Work With Us ContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA at 20 IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy ProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Team Supporters Work With Us ContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA Brussels CEPA London Support Now Geopolitics Technology Defense Tech ExpertsOur FellowsOur Team Our Fellows Our Team Our Fellows Our Team Insights & AnalysisLatest CommentaryComprehensive ReportsPodcastsThe CEPA PodcastEventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts Latest Commentary Comprehensive Reports PodcastsThe CEPA Podcast The CEPA Podcast EventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts Latest Commentary Comprehensive Reports PodcastsThe CEPA Podcast The CEPA Podcast The CEPA Podcast EventsAll Events2025 CEPA Europe ForumCEPA ForumState of the AllianceTranscripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts All Events 2025 CEPA Europe Forum CEPA Forum State of the Alliance Transcripts AboutCEPA at 20IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracyProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech InitiativeTeamSupportersWork With UsContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA at 20 IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy ProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Team Supporters Work With Us ContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA at 20 IssuesSecurity and DefenseAuthoritarian ThreatsBehind the Lines TrackerTechnology and InnovationTransatlantic Tech Policy TrackerDemocracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy Security and Defense Authoritarian ThreatsBehind the Lines Tracker Behind the Lines Tracker Behind the Lines Tracker Technology and InnovationTransatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Transatlantic Tech Policy Tracker Democracy ProgramsDemocratic ResilienceTransatlantic Defense and SecurityTech Policy ProgramDefense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Democratic Resilience Transatlantic Defense and Security Tech Policy Program Defense Tech Initiative Team Supporters Work With Us ContactCEPA Washington DC HQCEPA EuropeCEPA BrusselsCEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA Washington DC HQ CEPA EuropeCEPA BrusselsCEPA London CEPA Brussels CEPA London CEPA Brussels CEPA London Support Now **Meeting China’s Trade and Tech Challenge: How the US and Europe Can Come Together** For more than two decades, China has worked to free itself from dependence on Western technology while making the West dependent on Chinese products. It protects priority industries and subsidizes them into becoming export juggernauts. China engages in economic coercion. Its civil-military fusion strategy powers a significant buildup of its military, surveillance, and disruptive capabilities. Its aggressive territorial claims in the South and East China Seas, and its threats to Taiwan’s integrity, present real risks of military conflict. Beijing and Moscow’s declaration of a “no limits” strategic partnership, and China’s active support for Russia’s war on Ukraine, threaten US and European security, interests, and values. Although the transatlantic partners are closer in their assessments of the China challenge today than they were four years ago, they approach Beijing from different strategic positions, with different tools, and with different senses of urgency. They have allowed their own bilateral squabbles to get in the way of robust transatlantic efforts to address Chinese aggression. These simmering problems could boil over in 2025. This series analyzes the impact of China’s rise on transatlantic ties and presents ideas about how to forge a constructive partnership to meet the China challenge. It is based on a yearlong series of CEPA-sponsored workshops of leading European and US experts that I chaired together with Lucinda Creighton under the Chatham House Rule. The basic question we addressed is whether Donald Trump’s new administration and Europe’s new leaders believe their own bilateral disputes are more or less important than the need to adopt joint or complementary approaches to China. Does the Trump administration believe it can and should fight predatory Chinese economic practices on its own, or forge a broad coalition of countries that could impose far greater costs on China than individual efforts? Are Europeans willing and able to bridge their own considerable differences over both China and Trump’s America to help lead such a coalition? Δ A joint approach to China should be guided by three Ds: deconflict, disentangle, and deny. The US and Europe should deconflict their own bilateral ties so they do not endanger transatlantic cooperation on China. They should disentangle their economies from uncomfortable dependence on China. And they should deny critical technologies, data, or goods to China that could advance Beijing’s military capabilities and revisionist goals. To deal with China, the transatlantic partners first need to deal with each other. A transatlantic accord could include European commitments to boost defense spending to 3% or more of gross domestic product by the end of the decade; bolster support for Ukraine; diversify from Russian energy; buy more US-produced liquified natural gas and other energy exports, agricultural products, and defense equipment; and refrain from levying unilateral digital services taxes on US firms. The US, in turn, could commit to maintain an active role in NATO, ensure Ukrainian security and sovereignty, refrain from imposing preemptive tariffs, and explore effective global tax reform. The two parties should streamline the US–European Union (EU) Trade and Technology Council, now ensnared in an unwieldy tangle of many working parties, with three strong pillars. Pillar One would focus on mitigating US-EU disputes and advancing bilateral cooperation. It could include efforts to strike a quick trade deal to avoid a transatlantic trade war, finalize the Global Arrangement on Sustainable Steel and Aluminum, conclude critical minerals agreements, reduce trade costs by expanding conformity assessments, improve transatlantic risk assessments, and ensure that new EU laws such as the Digital Markets Act do not privilege Chinese and Russian tech over US firms. NATO allies should invoke Article 2 of the North Atlantic Treaty to promote defense-related innovation, and enhance screening of foreign investment in security-related infrastructure, companies, and technologies. Pillar Two would address the China challenge: extending sanctions on Chinese actors for supporting Russia’s war efforts; improving and expanding coordination on export controls; restricting data flows to China, Russia, and other countries of concern; sharing information on nonmarket policies affecting digital trade; and improving inbound and outbound investment screening. Pillar Three would include areas in which the US and the EU could address China-related issues by working with like-minded partners. These include strengthening and expanding cooperation on critical minerals, energy security and climate change; coordinating and enhancing efforts to counter Chinese theft of intellectual property; supporting the use of trusted vendors in digital technologies; reviving and expanding US-EU-Japanese talks on nonmarket economies; and promoting a “Free Road Initiative” to help allies develop more secure and resilient connectivity options. It is an ambitious agenda. Any effort to forge joint or complementary US-European approaches to China could be a bridge too far. Yet the high stakes warrant exploring what a transatlantic deal on China might look like. **Read More** **Defining the China Challenge** Part Two:Efforts to manipulate interdependence began in Beijing, not Washington or Brussels. **Coming Together or Falling Apart Over China?** Part Three:Americans generally agree on the China Challenge. Europeans do not. **Recalibrating Connectivity to Compete Against China** Part Four:China manipulates flows of information, goods, and critical materials. The West must respond. **Chips War 2025** Part Five:Semiconductors power the digital economy. US and European industries are complementary — and need to join forces to beat China. **A Post-Mortem for Transatlantic Clean Tech** Part Six:For the past four years, Europe and the US agreed on green goals while disagreeing on tactics. Trump’s re-election torpedoes this tentative rapprochement. **Recommendations for a Transatlantic China Policy** Part Seven:Although common or complementary US-European approaches to China could be a bridge too far, the stakes are such that it is worth exploring what a deal might look like. Daniel S. Hamiltonchaired CEPA’s yearlong series of workshops examining the transatlantic response to the China Challenge. He is a Senior non-resident Fellow at the Brookings Institution and a Senior Fellow at the Foreign Policy Institute of Johns Hopkins University School of Advanced International Studies. Bandwidthis CEPA’s online journal dedicated to advancing transatlantic cooperation on tech policy. All opinions expressed on Bandwidth are those of the author alone and may not represent those of the institutions they represent or the Center for European Policy Analysis. CEPA maintains a strict intellectual independence policy across all its projects and publications. **2025 CEPA Europe Tech & Security Conference** **2025 CEPA Europe Tech & Security Conference** CEPA Europe’s Tech & Security Conference in Brussels. **Related Articles** **Related Issue Tags** **Image Credit** Issues Experts Events Insights & Analysis About CEPA Privacy Policy **Help support CEPA’s next 20 years** Your support will help CEPA’s mission to ensure a strong and democratic transatlantic alliance for future generations."}