{"id": 37, "name": "ABC7 New York", "domain": "abc7ny.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abc7ny.com/post/bronx-subway-conductor-slashed-photos-released-man-suspected-slashing-mta-worker-whitlock-avenue-station/16723100/", "title": "Bronx Subway Conductor Slashed Photos Released Man Suspected Slashing Mta Worker Whitlock Avenue Station", "content": "**Photos released of man suspected of slashing MTA conductor in Bronx subway station** FOXHURST, Bronx (WABC) --The NYPD has released photos of a suspectwanted for slashing an MTA train conductor across the faceat a subway station in the Bronx. It happened early Tuesday afternoon at the Whitlock Avenue station in Foxhurst. Police say the 36-year-old conductor was looking up and down the platform when a man came up and slashed the left side of her face. \"While experiencing a delay in service at the station, our conductor was making announcements when a man stepped to her and told her that 'no one will tell him what to do,' and then he slashed her on the left side of her nose below her left eye with a sharp object, possibly a razor,\" TWU Local 100 President John V. Chiarello said in a statement. The victim, who has only been on the job for 15 months, was taken to the hospital where she received stitches before she was released. The union president said her attack was similar to a February 2024 attack on train conductor Alton Scott -- but said the difference in the most recent case is the high-quality photos of the suspect. \"An unprovoked attack with a deadly weapon is every Train Conductor's nightmare, and it has happened again,\" Chiarello said. The suspect was described as approximately 5'9\", 170 pounds with black hair and brown eyes. Anyone with information is asked to call police at 718-378-8301 or 718-378-8083. ---------- *More Bronx news *Send us a news tip *Download the abc7NY app for breaking news alerts *Follow us on YouTube **Submit a tip or story idea to Eyewitness News** Have a breaking news tip or an idea for a story we should cover? Send it to Eyewitness News using the form below. If attaching a video or photo,terms of use apply. **Related Topics** BRONX NEW YORK CITY MTA SUBWAY CRIME SLASHING NYPD **Top Stories** **Body that appears to be missing 2-year-old boy found in East River** 3 hours ago **Body that appears to be missing 2-year-old boy found in East River** 3 hours ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **More than 80 arrested as anti-ICE protesters march through Manhattan** 2 hours ago **More than 80 arrested as anti-ICE protesters march through Manhattan** 2 hours ago **Luigi Mangione makes '27 Things I'm Grateful For' list from jail** **Luigi Mangione makes '27 Things I'm Grateful For' list from jail** **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **Bison gores NJ man in Yellowstone after visitors get too close** 2 hours ago **Bison gores NJ man in Yellowstone after visitors get too close** 2 hours ago **Navy sailor found dead, another sailor in custody** **Navy sailor found dead, another sailor in custody**"}