{"id": 1558, "name": "WDIO - Duluth News", "domain": "wdio.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wdio.com/front-page/top-stories/trump-says-us-steel-will-keep-hq-in-pittsburgh-in-a-sign-hell-approve-bid-by-japan-based-nippon/", "title": "Trump Says Us Steel Will Keep Hq In Pittsburgh In A Sign Hell Approve Bid By Japan Based Nippon", "content": "Home Page LivestreamWDIO News LiveWatch The LiftABC News LiveLive Weather Cams Storm Track WeatherStorm Track Current ConditionsInteractive RadarLive Weather CamsAllergy ReportTraffic and Road ConditionsWeatherz SchoolPhoto Gallery School Alert NewsTop StoriesLocal NewsMidwest NewsWorld & National NewsPoliticsConsumerHealth & MedicineEntertainment This Week in Mining The LiftThe Lift OnlineWeekend Wrap Viewer PhotosThe Lift CookbookMidweek MomentThat's Old NewsWhat's BrewingAsk Dr. DylanCommon CentsFamily-FriendlyIn Otter News Local NewsCommunity EventsDuluth NewsSuperior NewsNorthern MinnesotaNorth Central MinnesotaNorthern Wisconsin Northland Bike Report Scoreboard SportsWDIO SportsScoreboardGrandma’s MarathonHigh School SportsBeyond the PlaybookUp NorthGone Fishing & HuntingOutdoorREPLAY: 7A & 7AA Boys’ hockey games 2025 Good Morning NorthlandGMN OnlineOur Life in PicturesCommunity EventsTech BytesGMN Birthday ClubGMN Weather Sketch Ready to Work Contests Community Events Entertainment TV Guide About WDIOContact UsNewsletterWDIO News TeamCareers **Trump says US Steel will keep HQ in Pittsburgh in a sign he’ll approve bid by Japan-based Nippon** WASHINGTON (AP) — President Donald Trump said Friday that U.S. Steel will keep its headquarters in Pittsburgh as part of what he called a “planned partnership” that seemed to signal that he’ll approve a bid by Japan-based Nippon Steel to make a big investment in the iconic American steelmaker, if not buy it outright. Still, Trump’s statement left it vague as to whether he is approving Nippon Steel’s bid after he vowed repeatedly to block the deal to prevent U.S. Steel from being foreign-owned. More recently, Trump suggested that Nippon Steelwould invest in U.S. Steel, not buy it. But investors seemed to take his statement as a sign that he’s approving some sort of merger, sharply pushing up U.S. Steel’s shares, and the companies issued approving statements. Nippon Steel said the partnership is a “game changer — for U. S. Steel and all of its stakeholders, including the American steel industry, and the broader American manufacturing base.” U.S. Steel said it “will remain American, and we will grow bigger and stronger” through a partnership. Nippon Steel’snearly $15 billion bidto buy U.S. Steelwas blockedby former President Joe Biden on his way out of office and, after Trump became president, subject to anothernational security reviewby the Committee on Foreign Investment in the United States. In his statement Friday, Trump said that “after much consideration and negotiation, US Steel will REMAIN in America, and keep its Headquarters in the Great City of Pittsburgh.” What Trump called a “planned partnership” will add $14 billion to the U.S. economy, he said, although it wasn’t clear what the terms of the deal would be or who would control U.S. Steel under the arrangement. Neither company explained Friday how the partnership would be structured. Josh Spoores, the Pennsylvania-based head of steel Americas analysis for commodity researcher CRU, said that, from what he’s seeing, “this ‘partnership’ is a green light for the acquisition.” Shares of U.S. Steel jumped 21% on the news, and continued rising in aftermarket trading. Keeping U.S. Steel’s headquarters had always been part of Nippon Steel’s bid to buy it. Tosweeten the deal, Nippon Steel had offered up a $2.7 billion commitment to upgrade U.S. Steel’s two blast furnaces and pledged that it wouldn’t import steel slabs that would compete with the facilities. Nippon Steel also had pledged not to conduct layoffs or plant closings during the term of the existing labor agreement and to protect the best interests of U.S. Steel in trade matters. U.S. Steel’s CEO David Burritt warned last September that blocking Nippon Steel’s bid would mean U.S. Steel would “largely pivot away” from investing in its two blast furnaces — one just outside Pittsburgh and one in Gary, Indiana — and it would raise “serious questions” about remaining headquartered in Pittsburgh. U. S. Steel’s board and stockholders approved Nippon Steel’s bid last year. It has been opposed by the United Steelworkers union. The union had no immediate comment Friday. Asrecently as December, Trump said he was “totally against the once great and powerful U.S. Steel being bought by a foreign company.” Then in February, Trump suggested thatNippon Steelwouldn’t buy U.S. Steel, as it had planned, but that it would instead invest in U.S. Steel. Last month, Trump ordered a new national security review of Nippon Steel’s proposed bid. ___ Levy reported from Harrisburg, Pennsylvania. Follow Marc Levy on X:https://x.com/timelywriter All contents © copyright 2025 Associated Press. All rights reserved Home Page Livestream Storm Track Weather School Alert News This Week in Mining The Lift Local News Northland Bike Report Scoreboard Sports Good Morning Northland Ready to Work Contests Community Events Entertainment TV Guide About WDIO WDIO-DT FCC Public Inspection File WIRT-DT FCC Public Inspection File Contact Us | Public Information FCC Applications WDIO Terms of Use DMCA Notice Hubbard Television Group Privacy Policy Any person with disabilities who needs help accessing the content of the FCC Public file should contact Vicki Kaping atvkaping@wdio.comor (218) 727-6864 This website is not intended for users located within the European Economic Area.©WDIO-TV, LLCA Hubbard Broadcasting Company WDIO Follow WDIO Follow **WDIO Follow** WDIO Follow **WDIO Follow** **WDIO Follow**"}