{"id": 2075, "name": "Numbers USA", "domain": "numbersusa.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.numbersusa.com/u-s-commission-on-immigration-reform-jordan-commission/", "title": "U S Commission On Immigration Reform Jordan Commission", "content": "BackAboutAbout NumbersUSAOur HistoryOur TeamOur Board of DirectorsOur InitiativesOur Accuracy GuaranteeNo Immigrant BashingContact Us About NumbersUSA Our History Our Team Our Board of Directors Our Initiatives Our Accuracy Guarantee No Immigrant Bashing Contact Us About NumbersUSA Our History Our Team Our Board of Directors Our Initiatives Our Accuracy Guarantee No Immigrant Bashing Contact Us BackResourcesImmigration NumbersImmigration Grade CardsImmigration HistoryOur ArticlesOur BooksOur VideosOur StudiesImmigration FAQs Immigration Numbers Immigration Grade Cards Immigration History Our Articles Our Books Our Videos Our Studies Immigration FAQs Immigration Numbers Immigration Grade Cards Immigration History Our Articles Our Books Our Videos Our Studies Immigration FAQs BackChallengesImmigration ChallengesEnforcement ChallengesConservation ChallengesEconomic ChallengesRewarding Bad Behavior Immigration Challenges Enforcement Challenges Conservation Challenges Economic Challenges Rewarding Bad Behavior Immigration Challenges Enforcement Challenges Conservation Challenges Economic Challenges Rewarding Bad Behavior BackOur VisionOur ApproachReEnvisioning ImmigrationReEnvisioning EnforcementFederal InitiativeState and Local InitiativeHiring Line InitiativeSustainability InitiativeAlliances InitiativeInternational Initiative Our Approach ReEnvisioning Immigration ReEnvisioning Enforcement Federal Initiative State and Local Initiative Hiring Line Initiative Sustainability Initiative Alliances Initiative International Initiative Our Approach ReEnvisioning Immigration ReEnvisioning Enforcement Federal Initiative State and Local Initiative Hiring Line Initiative Sustainability Initiative Alliances Initiative International Initiative BackCongressImmigration Grade CardsSix Great Immigration SolutionsState Immigration ScorecardsBills by Congress Immigration Grade Cards Six Great Immigration Solutions State Immigration Scorecards Bills by Congress Immigration Grade Cards Six Great Immigration Solutions State Immigration Scorecards Bills by Congress Quick Links Join Us Log In U.S. Commission on Immigration Reform (Jordan Commission) The U.S. Commission on Immigration Reform was mandated by the Immigration Act of 1990 in order to examine and evaluate U.S. immigration policy, and to provide recommendations for its improvement. The Commission’s initial recommendations were released in 1995, and wereendorsedby President Clinton. The final report was presented to Congress in 1997. President Clinton said the proposals “reflect a balanced immigration policy that makes the most of our diversity while protecting the American work force so that we can better compete in the emerging global economy. (“Clinton Embraces a Proposal to Cut Immigration by a Third,”The New York Times, June 8, 1995). The Commission is now commonly referred to as the “Jordan Commission” after its most well-known chair, the esteemed Barbara Jordan. **We are a nation of immigrants, dedicated to the rule of law. That is our history – and it is our challenge to ourselves.…It is literally a matter of who we are as a nation and who we become as a people. E Pluribus Unum. Out of many, one. One people. The American people.”** **–Barbara Jordan, 1995** **** Click here to learn more about about Barbara Jordan’s life and her work on immigration reform. Clear goals and priorities must define U.S. immigration policy; Effective policy means enforcement of immigration limits; Regular review is needed to ensure flexibility to adjust to changing circumstances in the United States; Immigration policy should be comprehensible and its implementation efficient; Sponsors are responsible for ensuring that immigrants do not become burdens on the American taxpayer; Immigration policy must protect U.S. workers against unfair competition from foreign workers, with an appropriately higher level of protection for the most vulnerable in our society; Both temporary and permanent admissions categories must be seen as integral parts of a cohesive immigration policy; A sound immigration policy supports Americanization, meaning that immigrants share with Americans such values as the belief in liberty, democracy, and equal opportunity; Fundamental immigration reform requires a period of transition to get from the present system to the new one. Following the above principles, the Commission recommended the creation of a “credible, coherent immigrant and immigration policy” and a “credible, efficient naturalization process” which included the following: A scale back of family chain-migration by implementing a prioritization of nuclear family relationships to determine who will be admitted through family-based immigration. Spouses and minor children of US citizens would continue to be admitted as first priority. Elimination of other family-based admission categories, including:Adult children of U.S. citizens;Adult children of legal permanent residents, and;Siblings of U.S. citizens. Adult children of U.S. citizens; Adult children of legal permanent residents, and; Siblings of U.S. citizens. Adult children of U.S. citizens; Adult children of legal permanent residents, and; Siblings of U.S. citizens. A focus on the admission of highly-skilled individuals whose skills would benefit our society. Recommended the elimination of the admission of unskilled workers and elimination of the diversity visa lottery. Immigration admissions level of 550,000 per year, to be divided as follows:Nuclear family immigration 400,000;Skill-based immigration 100,000;Refugee resettlement 50,000. Nuclear family immigration 400,000; Skill-based immigration 100,000; Refugee resettlement 50,000. Nuclear family immigration 400,000; Skill-based immigration 100,000; Refugee resettlement 50,000. Stressed that deportation is crucial. “Credibility in immigration policy can be summed up in one sentence: those who should get in, get in; those who should be kept out, are kept out; and those who should not be here will be required to leave.” Jordan Commission’s full report Jordan Commission’s Executive Summary on Illegal Immigration Jordan Commission’s Executive Summary on Legal Immigration Jordan Commission’s Refugee Policy Report This website provides information about NumbersUSAand its affiliated entities, NumbersUSA Education andResearch Foundation (NERF) and NumbersUSA Action. NumbersUSA About Us Team Contact MY ACCOUNT Log in Take Action Donate FOLLOW US Facebook Youtube Twitter Tiktok OUR MOBILE APP Copyright © 2025 NumbersUSA, 1201 Wilson Blvd 25th Floor Arlington, VA 22209, All Rights Reserved. Privacy Policy Terms & Conditions Help"}