{"id": 917, "name": "Mississippi Free Press", "domain": "mississippifreepress.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mississippifreepress.org/person-of-the-day-jessica-singleton-covers-bullying-addiction-and-growing-up-in-ocean-springs-in-hi-yall-comedy-special/", "title": "Person Of The Day Jessica Singleton Covers Bullying Addiction And Growing Up In Ocean Springs In Hi Yall Comedy Special", "content": "**Get our top stories straight to your phone once a week.** Sign up today. **You won’t find this anywhere else.** Get exclusive stories that look at context and solutions to systemic issues for Mississippi and the nation with these FREE daily newsletters. 📩 Subscribe to our free newsletter NewsOpen dropdown menuIn-DepthInvestigationsSolutionsLegislature 2025Capital CityOxford In-Depth Investigations Solutions Legislature 2025 Capital City Oxford In-Depth Investigations Solutions Legislature 2025 Capital City Oxford MFP VoicesOpen dropdown menuDemocracy Democracy Democracy Culture People Events Calendar Impact and AwardsOpen dropdown menuMFP Awards to DateStaff and AwardsMFP Impact, Media and Awards 2025MFP Impact, Media and Awards 2024MFP Impact, Media and Awards 2023MFP Impact, Media and Awards 2022MFP Impact, Media and Awards 2021MFP Impact, Media and Awards 2020 MFP Awards to Date Staff and Awards MFP Impact, Media and Awards 2025 MFP Impact, Media and Awards 2024 MFP Impact, Media and Awards 2023 MFP Impact, Media and Awards 2022 MFP Impact, Media and Awards 2021 MFP Impact, Media and Awards 2020 MFP Awards to Date Staff and Awards MFP Impact, Media and Awards 2025 MFP Impact, Media and Awards 2024 MFP Impact, Media and Awards 2023 MFP Impact, Media and Awards 2022 MFP Impact, Media and Awards 2021 MFP Impact, Media and Awards 2020 Who We AreOpen dropdown menuMississippi Free Press StaffMississippi Journalism And Education Group BoardsWe Are MississippiOur DonorsContact the MFPJobs with the Mississippi Free PressContract GigsMFP Editorial Independence Policy Mississippi Free Press Staff Mississippi Journalism And Education Group Boards We Are Mississippi Our Donors Contact the MFP Jobs with the Mississippi Free Press Contract Gigs MFP Editorial Independence Policy Mississippi Free Press Staff Mississippi Journalism And Education Group Boards We Are Mississippi Our Donors Contact the MFP Jobs with the Mississippi Free Press Contract Gigs MFP Editorial Independence Policy MoreOpen dropdown menuSubscribe to our NewsletterDonate to MFPAdvertise with the MFPSolutions CirclesBlack Women, Systemic Barriers and COVID-19 ProjectMFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast Subscribe to our Newsletter Donate to MFP Advertise with the MFP Solutions Circles Black Women, Systemic Barriers and COVID-19 Project MFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast Subscribe to our Newsletter Donate to MFP Advertise with the MFP Solutions Circles Black Women, Systemic Barriers and COVID-19 Project MFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast Mississippi Free Press Jackson Free Press Legislature 2025 JXN Pulse Solutions Circles Bluesky Facebook Threads Instagram Linkedin Youtube Email Mississippi Free Press Jackson Free Press Legislature 2025 JXN Pulse Solutions Circles Bluesky Facebook Threads Instagram Linkedin Youtube Email Mississippi Free Press Journalism by Mississippians, for Mississippians 📩 Subscribe to our free newsletter NewsOpen dropdown menuIn-DepthInvestigationsSolutionsLegislature 2025Capital CityOxford In-Depth Investigations Solutions Legislature 2025 Capital City Oxford In-Depth Investigations Solutions Legislature 2025 Capital City Oxford MFP VoicesOpen dropdown menuDemocracy Democracy Democracy Culture People Events Calendar Impact and AwardsOpen dropdown menuMFP Awards to DateStaff and AwardsMFP Impact, Media and Awards 2025MFP Impact, Media and Awards 2024MFP Impact, Media and Awards 2023MFP Impact, Media and Awards 2022MFP Impact, Media and Awards 2021MFP Impact, Media and Awards 2020 MFP Awards to Date Staff and Awards MFP Impact, Media and Awards 2025 MFP Impact, Media and Awards 2024 MFP Impact, Media and Awards 2023 MFP Impact, Media and Awards 2022 MFP Impact, Media and Awards 2021 MFP Impact, Media and Awards 2020 MFP Awards to Date Staff and Awards MFP Impact, Media and Awards 2025 MFP Impact, Media and Awards 2024 MFP Impact, Media and Awards 2023 MFP Impact, Media and Awards 2022 MFP Impact, Media and Awards 2021 MFP Impact, Media and Awards 2020 Who We AreOpen dropdown menuMississippi Free Press StaffMississippi Journalism And Education Group BoardsWe Are MississippiOur DonorsContact the MFPJobs with the Mississippi Free PressContract GigsMFP Editorial Independence Policy Mississippi Free Press Staff Mississippi Journalism And Education Group Boards We Are Mississippi Our Donors Contact the MFP Jobs with the Mississippi Free Press Contract Gigs MFP Editorial Independence Policy Mississippi Free Press Staff Mississippi Journalism And Education Group Boards We Are Mississippi Our Donors Contact the MFP Jobs with the Mississippi Free Press Contract Gigs MFP Editorial Independence Policy MoreOpen dropdown menuSubscribe to our NewsletterDonate to MFPAdvertise with the MFPSolutions CirclesBlack Women, Systemic Barriers and COVID-19 ProjectMFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast Subscribe to our Newsletter Donate to MFP Advertise with the MFP Solutions Circles Black Women, Systemic Barriers and COVID-19 Project MFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast Subscribe to our Newsletter Donate to MFP Advertise with the MFP Solutions Circles Black Women, Systemic Barriers and COVID-19 Project MFP LiveOpen dropdown menuMFP Live – 2023MFP Live – 2022MFP Live – 2021MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast MFP Live – 2023 MFP Live – 2022 MFP Live – 2021 MFP Live Podcast Topic Highlight Menu Education Equity Policing Race & Racism TANF Scandal National News **Person of the Day | Jessica Michelle Singleton Covers Bullying, Addiction and Growing Up in Ocean Springs in ‘Hi Y’all’ Comedy Special** **Share this:** Click to share on Bluesky (Opens in new window)Bluesky Click to share on Facebook (Opens in new window)Facebook Click to share on Threads (Opens in new window)Threads Click to email a link to a friend (Opens in new window)Email More Click to print (Opens in new window)Print Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Mastodon (Opens in new window)Mastodon Click to share on X (Opens in new window)X University of South Florida senior Jessica Michelle Singleton confidently stepped onto the stage of Side Splitters comedy club in Tampa, Fla., in 2008 ready to perform her new set. A week prior, she had the crowd busting their guts, advancing her to the semifinals of the club’s open-mic comedy competition. The business’ manager B.T. advised her to clean up her set a little by not dropping as many F-bombs. She prepared new material completely void of curse words that included a music cue. She overcorrected. When she told her first few jokes, instead of being filled with uproarious laughter, the room was quiet—the faint sound of someone slurping their drink breaking the silence. Singleton began to sweat, panic evident on her face. She pushed through her set, speeding up the pacing of her joke-telling when her material continued to land flat with the audience. The amateur comedian reached the music cue within the set, reciting the lead-up into it just like she had written it at home. “This one has to work,” she anxiously thought. But the DJ didn’t play the song, messing up the punchline. In the end, Singleton exited the stage to stilted applause and headed over to her friends, who greeted her with open arms. They left for a bar afterward to soothe the pain when a man recognized the Mississippi native from Side Splitters. “You do comedy right?” he asked her. “I’m trying to start doing it,” she responded. “I just want you to know that I saw you last week, and it was really great,” he started. Internally, Jessica breathed a sigh of relief, happy that someone had seen her at her greatest. The moment of reassurance renewed her hopes that she could actually have a career in comedy despite her bad set that night. A second later, however, the man bursted her bubble with his next words. “I saw you tonight, and I don’t know what happened up there, but keep on keeping on,” he said, trying to be encouraging. To say she was embarrassed would have been an understatement; Singleton could have died right there on the spot. Seventeen years later, though, she can laugh heartily at how bad that week’s set had been, understanding that she had learned a lesson: Sometimes, you have to bomb early in your career so that you know you can get through it, she explained. “The set I wrote, I think I just blocked it outta my memory because of the trauma. To be honest, I don’t have the slightest clue of what song it was. It was terrible,” Singleton told the Mississippi Free Press. “… If you’re doing really well too much upfront and then you go do a big showcase and bomb, I think that could really just kill a person.” Get exclusive stories that look at context and solutions to systemic issues for Mississippi and the nation with these FREE daily newsletters. Still, the woman who had dreams of someday appearing on Saturday Night Live persevered, the laughs she earned the first time she attended an open mic during her final semester in college solidifying her desire to pursue the field. “From the first laugh I got, I had this instant feeling of like, ‘Oh, this is what I wanna do. This is what I think I’m supposed to do,” she said. **‘I Wanna Do This’** Jessica Singleton’s family moved to Ocean Springs when she was 3 years old because her dad was stationed at the Keesler Air Force Base in Biloxi. She attended Magnolia Park Elementary School, made great friends, and basked in the nice weather and good food. “I grew up in a household that was pretty funny, but my mom used to watch so much stand-up comedy when I was a kid. George Carlin. We watched all the good nineties sitcoms like ‘Martin,’ ‘Living Single,’ ‘In Living Color,’ ‘SNL.’ Eddie Murphy’s specials, which I probably shouldn’t have watched as young as I did,” she said. When she entered sixth grade, the family moved to Anchorage, Alaska, which was a hard transition for Singleton. She had a difficult time making friends, as classmates would make fun of her accent and otherwise pick on her. “I would get bullied by boys, and they would make fun of me, and I would just keep to myself and be like, ‘Keep your head down; like, don’t cause a scene,’” she recalled. Her home life wasn’t faring that much better. Her mother and father were both struggling with addiction issues, drugs and alcohol, respectively, so Singleton leaned on comedy as a coping mechanism—doing funny things and cracking jokes to break up the tension of her parents’ arguing. Comedy ultimately became her super weapon against her bullies as well. “There was just one guy who constantly picked on me, and one day I just snapped back at him with a comeback,” she recalled. “Whatever I said was very funny, and all of his friends started laughing. And then it became this slow thing where everyone just started becoming my friend because they were like, ‘She’s better at making fun of us.’” After that, Singleton became more comfortable with being herself, and she started speaking out and showcasing her personality more often. She made friends, joined clubs, and hosted talent shows and events where her comedy could really shine. “Even though I still went to college (for other disciplines), by my senior year I was like, ‘Well I’m gonna do comedy.’ I didn’t know what it looked like, but I was like I wanna do this,” she said. Singleton graduated from the University of South Florida in 2008 with degrees in public relations and marketing. She dabbled in the Tampa comedy scene while working three jobs to save up enough money to eventually move to Los Angeles, Calif. **‘On the Right Path’** When Singleton first moved to Los Angeles, she got a job working at a nonprofit doing public relations, fundraising and event coordination. She would work her day job from 7:30 a.m. to 3:30 p.m. and then go to open mics afterward, driving across the city to perform at as many locations as she could. “I’d go to like three or four open mics at night trying material and getting it as strong as I could, and then I would hang out at The Comedy Store on Sunset until they closed,” she explained. “I was just soaking it up for about three years ’til I left my full-time job. Because I was so immersed in the scene, people saw me places, they got to know me, and I would do my material.” Eventually, she honed her material enough to do a set atThe Comedy Store, a 53-year-old American comedy club in West Hollywood, where she impressed comedian Bobby Lee, who was in attendance that night. He came up to her after her set, hailing her talent and encouraging her to keep going. Months later, he asked her to open for his comedy show. “It was this spiral of bigger comics starting to ask me to open for them,” she said. “I started submitting tapes to comedy festivals all over the country. In 2013, I got into like 15 festivals. That was the year I left my full-time job. By the end of the year, there was this big European festival that never had English-speaking comedy. It was the coolest experience in my life. I think that was the moment I was like, ‘I think I’m on the right path.’” A few years later, she became a regular at The Comedy Store and released some comedy albums that went number one. Now, she is gearing up to release her new comedy special “Hi Y’all” on April 29, 2025, onPunchUpand later to YouTube and other platforms. She filmed the special in New Orleans in October 2024, wanting to feel closer to the South. “ There’s like a big chunk of jokes about growing up in Mississippi and then jokes about my childhood, which aren’t necessarily like a hundred percent pertinent to being in the South. But I was like, ‘I wanna go back close to where I’m from,’ and I love New Orleans,” she said. Some of Singleton’s comedy is rooted in her childhood trauma, including her experiences in having to deal with parents struggling with addictions. One of the jokes in her special revolves around her dad leaving her at a Waffle House when she was 8, and another touches on the many jobs he had, which she said spoke more to his inability to keep a job. “He was addicted to meth, and I make a joke about it in the special where I go ‘I didn’t know. Nobody knew ’cause he was fat. And it’s like, ‘Come on man. How are you fat and a meth head? Like pick an addiction dude,’” Singleton joked. “That was a thing I didn’t talk about for years and even until a few years into stand-up,” the comedian said. “I was like, ‘I’m gonna try to make this funny.’ I think some of it was not wanting to remember at all. I think being able to find ways to make it funny now as an adult is also healing.” Following the release of her special, Jessica is hoping to tour and to expose her comedy to more audiences. She has also been auditioning for some acting roles, though her first priority will always be comedy. “At the end of the day, stand-up is what I love, and it’s really meant to be seen live. So, if I could encourage one thing, it’s to go see a live show,” Singleton said. “ A live stand-up show is such a unique and fun experience where you feel just connected to a whole crowd of people around you through your laughter. My goal is to be able to do that at a bigger level.” Jessica Michelle Singleton’s new comedy special “Hi Y’all” will premiere on April 29, 2025 at 7 p.m. Central Time on PunchUp. To watch her comedy special, visitpunchup.live/jms. To keep up with the comedian, follow her at JMScomedy onFacebookorInstagramand listen to her podcast, “Hey Idiots!” onApple Podcasts. **Thanks for reading.** If you value independent, paywall-free information, consider supporting our 501(c)(3) today so we can expand journalism for Mississippi and the nation. **Related** **Aliyah VealCulture Reporter** Jackson, Miss., native Aliyah Veal is a proud alumna of Spelman College, where she earned her bachelor’s degree in English in 2017. Afterward, she attended the Craig Newmark Graduate School of Journalism in New York, gaining a master’s degree in journalism in 2018. After moving back home in 2019, she interned at the Jackson Free Press, covering city council and Jackson neighborhoods before moving up to culture writer. Her interests include tattoos, music and food, really, really good food. She now writes about culture, music and the arts for the Mississippi Free Press. Get exclusive stories that look at context and solutions to systemic issues for Mississippi and the nation with these FREE daily newsletters. **Recent Stories** **Coalition Sues to Stop Mississippi’s New Anti-Diversity Law, Calling It an ‘Attack on Truth’** **Opinion | Like Trump, I Pledge to Hold China Accountable** **Person of the Day | Chris Allen Baker: Scott County Father Builds Local Chess Community** **‘A Coup’: RFK Jr. Ousts Entire CDC Vaccine Advisory Committee, Will Install His Own Picks** **Find and Submit local Mississippi Events Here** Bluesky Facebook Threads Instagram Linkedin Youtube Email 125 S. Congress Street #1324Jackson, MS 39201info@mississippifreepress.orgtips@mississippifreepress.orgevents@mississippifreepress.org601-362-6121 Mississippi Journalism and Education Group | A 501(c)(3) Public Charity | EIN 85-1403937 **** **** You must belogged into post a comment. ****"}