{"id": 2131, "name": "Student News Daily", "domain": "studentnewsdaily.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.studentnewsdaily.com/daily-news-article/supreme-court-rules-trump-admin-must-give-venezuelan-gang-members-more-time-to-challenge-deportation/", "title": "Supreme Court Rules Trump Admin Must Give Venezuelan Gang Members More Time To Challenge Deportation", "content": "ArchivesDaily News ArticlePosted every weekdaykeyboard_arrow_rightWeekly Example of Media BiasWeekly example of biased reportingkeyboard_arrow_rightWeekly EditorialWeekly opinion article from the webkeyboard_arrow_rightFriday's News QuizQuestions from the week's Daily News Articleskeyboard_arrow_rightFriday's Editorial CartoonCartoon is accompanied by a questionkeyboard_arrow_rightExtras!Videos, Quotes, Human Interest Newskeyboard_arrow_rightTuesday's World EventsArchived - now part of Daily News Articlekeyboard_arrow_right Answers ResourcesSocialism vs Capitalismkeyboard_arrow_rightConservative vs. Liberal Beliefskeyboard_arrow_right2024 Presidential Electionkeyboard_arrow_right2024 General Electionkeyboard_arrow_rightTypes of Media Biaskeyboard_arrow_rightJournalist Code of Ethicskeyboard_arrow_rightLetter to the Editorkeyboard_arrow_rightMedia Vocabularykeyboard_arrow_rightBackgrounderskeyboard_arrow_rightRecommended Siteskeyboard_arrow_right About UsNew to the site?keyboard_arrow_rightHow Teachers Use Student News Dailykeyboard_arrow_rightCommon Core and Student News Dailykeyboard_arrow_rightAbout Uskeyboard_arrow_rightContact Uskeyboard_arrow_rightDonatekeyboard_arrow_right Search **Supreme Court rules Trump admin must give Venezuelan gang members more time to challenge deportation** Photos of TdA members from the Aurora Police Dept., September, 2024. Questions Questions Background Background Entire Page Entire Page Just Article Just Article Just Questions Just Questions (by Samuel Chamberlain, NY Post) – President Trump cannot use theAlien Enemies Actto quickly deport a group of suspected Venezuelan gang members currently being held in Texas, the Supreme Court ruled Friday. In anunsigned order, the justices ruled that the South Americans should remain in the US while lower courts decide how far in advance migrants must be informed of their removal. Friday’s ruling follows an April 19 order that also blocked quick deportations under the Alien Enemies Act, invoked by the administration earlier this year. “We did not on April 19 — and do not now — address the underlying merits of the parties’ claims regarding the legality of removals under the AEA [Alien Enemies Act],” themajority opinionread, noting at the very end that the government could still deport the migrants “under other lawful authorities.” However, those removals would typically require notice and a chance to challenge their deportation in court. Surveillance video captures a robbery at a Denver jewelry store by members of the migrant gang Tren de Aragua in June 2024. The Trump has made deporting alleged gang members from the U.S. a top priority. via REUTERS ConservativeJustices Samuel AlitoandClarence Thomasnoted theirdissentsfrom the order, whileJustice Brett Kavanaughauthored a briefconcurring opinion. “From the Court’s order, it is not entirely clear whether the Court has silently decided issues that go beyond the question ofinterim [temporary]relief. (I certainly hope that it has not.),” Alito wrote. “But if it has done so, today’s order is doubly extraordinary. Grantingcertioraribefore a court of appeals has entered a judgment is a sharp departure from usual practice, but here neither the Court of Appeals nor the District Court has decided any merits questions.” “The circumstances call for a prompt and final resolution, which likely can be provided only by this Court,” Kavanaugh warned. “At this juncture, I would prefer not to remand to the lower courts and further put off this Court’s final resolution of the critical legal issues. Rather, consistent with the Executive Branch’s request forexpedition [speed]—and as the detainees themselves urge—I would grantcertiorari, order prompt briefing, hold oral argument soon thereafter, and then resolve the legal issues.” This is a developing story. Supreme Court Justices Samuel Alito (left), Clarence Thomas (center) and Brett Kavanaugh (right) Published at NYPost on May 16.Reprinted here for educational purposes only. May not be reproduced on other websites without permission. **Questions** 1. Define the following court terms as used in the article: unsigned order majority opinion dissent concurring opinion certiorari 2. The first paragraph of a news article should answer the questions who, what, where and when. List the who, what, where and when of this news item. (NOTE: The remainder of a news article provides details on the why and/or how.) 3. What did the justices rule in the unsigned order? 4. What did the Supreme Court previously rule on April 19? 5. Which two justices dissented from the majority order on the use of the Alien Enemies Act? 6. a) What did Justice Kavanaugh note in a concurring opinion about what he would like the court to do?b) Do you agree with Justice Kavanaugh? Explain your answer. 7. President Biden opened the borders and allowed (in some cases flew in on commercial airliners) close to 10 million illegal migrants (or more) into the U.S. How long do you think it would take the courts under the usual method of deportation (being granted a court hearing) to deport this number of people? 8. If a known gang member enters our country illegally, authorities have no legal right to deport them immediately. What do you think? Should known criminal gang members be granted a court hearing, or be immediately deported upon apprehension under the Alien Enemies Act? Explain your answer. 9. From a May 16 X post by Georgetown Law professor Jonathan Turley: The Supreme Court delivered a blow to the Trump Administration in blocking deportations under the Alien Enemies Act. However, the Court only did so based on the lack of notice (24 hours) afforded by the Administration. It did not rule on the legality of the use of the [Alien Enemies Act]. The Court expressly stated: “To be clear, we decide today only that the detainees are entitled to more notice than was given on April 18.” That still leaves much to be decided including what notice is required: “it is not optimal for this Court, far removed from the circumstances on the ground, to determine in the first instance the precise process necessary to satisfy the Constitution in this case. We remand the case to the Fifth Circuit for that purpose.” Both the legality of using the act and the required notice remain undecided (beyond the fact that 24 hours is clearly not enough). The court is pumping the brakes as a warning to the Administration that it must give these individuals and the courts more time to consider these issues. And some reader responses to Mr. Turley: “Great job kicking the can until next time. The US isn’t a sovereign country if they must ignore tens of millions of unvetted foreigners streaming into the country illegally, but has no means to get them out. This isn’t hard. It is a pass by a [Supreme Court] unwilling to do their job.” “It’s patently ABSURD for the courts to protect foreign criminals and “give notice” to foreign nationals who entered the country without any kind of process or permission. They are just creating an expensive red tape quagmire on the taxpayers’ dime. With a country 36 trillion in debt, you would think the courts would mind the expense! I think that it is time for Congress to reign in Judicial micromanagement of the Executive, especially when some justices apply double standards to various administrations.” What do you think? Do you agree with one, both or neither of the reader responses to Mr. Turley’s post on X? Explain your answer. **Background** The Alien Enemies Act of 1798: On the campaign trail prior to the election, Trump pledged to “invoke the Alien Enemies Act of 1798 to target and dismantle every migrant criminal network operating on American soil.” …It is a sweeping law that, when invoked, grants the president extraordinary power. In his inaugural address on Jan. 20, President Trump said, “I will direct our government to use the full and immense power of federal and state law enforcement to eliminate the presence of all foreign gangs and criminal networks bringing devastating crime to U.S. soil.” On his first day in office, Trump signed 10 border-related executive actions, including anexecutive orderthat states that the president may invoke the Alien Enemies Act to stop “any invasion or predatory incursion against the territory of the United States by a qualifying actor.” The Alien Enemies Act permits the government to detain and expel without a hearing most citizens of a nation deemed a threat to U.S. security, based solely on their country of birth or citizenship. The President’s order says violence stemming from drug cartels and transnational gangs — such as the Venezuelan gang Tren de Aragua—threatens U.S. security. It states that in certain portions of Mexico, cartels “function as quasi-governmental entities, controlling nearly all aspects of society.” From a user post on X: The Alien Enemies Act does not require notification: “The Alien Enemies Act of 1798 (50 U.S.C. § 21-24) does not explicitly require notification to individuals being deported under its provisions. The Act grants the President broad authority to detain, relocate, or deport “all natives, citizens, denizens, or subjects” of a hostile nation or government during a declared war or when there is a credible threat of invasion or predatory incursion. The language focuses on executive action — such as apprehension, restraint, or removal — without mandating specific procedural requirements like formal notification to those targeted.” Daily “Answers” emails are provided for Daily News Articles, Tuesday’s World Events and Friday’s News Quiz. About Site Overview Free Answers by Email Contact Us Donate"}