{"id": 665, "name": "Independent Journal Review", "domain": "ijr.com", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://ijr.com/judge-who-allowed-harvard-to-racially-discriminate-blocks-trump-order-banning-foreign-students-from-university/", "title": "Judge Who Allowed Harvard To Racially Discriminate Blocks Trump Order Banning Foreign Students From University", "content": "Latest Trending All News Business Lifestyle **Judge Who Allowed Harvard To Racially Discriminate Blocks Trump Order Banning Foreign Students From University** **Air Force Loses Appetite For Shiny Fighter Jet With Huge Price Tag** **State Department Authorizes Middle East Evacuations As Iran Speculation Swirls** **Maxine Waters Blames Trump For LA Violence She Previously Claimed Wasn’t Even Happening** **FBI Admits What Its Fmr Director Wouldn’t Say About Biden’s Afghanistan Withdrawal** **EXCLUSIVE: ‘Right Thing To Do’: Thune Goes To Mat For Medicaid Reforms In ‘Big, Beautiful’ Bill** **Beach Boys’ Brian Wilson Dies at 82** **REP MICHAEL CLOUD: It’s Time To Get Serious About Ending Washington’s Wasteful Spending** **EXCLUSIVE: Conservative Groups Urge Senate To Finally Confirm Trump’s IRS Chief, Root Out Obama-Era Deep Staters** **Trump Admin Moves To Blow Up Biden’s Assault On America’s Power Grid** **‘What A Stupid Question’: Karoline Leavitt Clashes With Reporter As She Attempts To Trip Her Up Over Riots** **Take A Look At The Newest List Of Illegals ICE Nabbed In Riot-Plagued Los Angeles** **Justice Department Paves Way To Rein In Federal Land Grabs** Donald Trump State of the Union Elon Musk Tariffs Congress Faith Immigration Login Politics US News Commentary World News Faith Latest Polls **Judge Who Allowed Harvard To Racially Discriminate Blocks Trump Order Banning Foreign Students From University** A federal judge late on Thursday issued a temporary restraining order against President Donald Trump’s recently signed executive order banning Harvard from admitting foreign students. U.S. ​​District Judge Allison Burroughs’ order is an extension of aprevious orderissued against the administration in May after the Department of Homeland Security (DHS)attemptedto revoke Harvard’s eligibility to host students on foreign visas. Trump’s June 4executive orderattempted to skirt the original ruling against the DHS, preventing any new international students intending to attend Harvard from entering the U.S. and directs the Secretary of State to consider revoking the visas of current foreign Harvard students. Trump’s orderclaimed “Harvard has a demonstrated history of concerning foreign ties and radicalism.” Harvard immediatelyvowedto fight back against the order. “Singling out our institution for its enrollment of international students and its collaboration with other educational institutions around the world is yet another illegal step taken by the Administration to retaliate against Harvard,” university president Alan Garberwrotein a community message following the singing of Trump’s order. Harvard did not immediately respond to the Daily Caller News Foundation’s request for comment. The Obama-appointed judge also oversaw theHarvard v. Students for Fair Admissionscase prior to its reaching the Supreme Court, in which Burroughs allowed Harvard to racially discriminate in its admissions policy. The Trump administration has been targeting the Ivy League university due to its alleged failure to respond to antisemitism on campus and protect Jewish students. Harvard’s owninternal investigationfound that more than a quarter of Jewish students felt “physically unsafe” on campus and “Almost 60% of Jewish students reported experiencing ‘discrimination, stereotyping, or negative bias.’” Despite this, Harvard declined to comply with the Trump administration’s demands to reshape its vetting and admissions process for foreign students and reform its disciplinary processes. The university stated it “will not surrender” its academic freedom and free speech rights. Along with targeting its foreign students, the administration has also revokedbillionsin federal dollars from Harvard and is working tocut all remaining contractswith the school. The White House did not immediately respond to the DCNF’s request for comment. All content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact[email protected]. **Daily Caller News Foundation** **Advertisements** Join Over 6M Subscribers We’re organizing an online community to elevate trusted voices on all sides so that you can be fully informed. Copyright © 2024 IJR **Trusted Voices On All Sides** About Us GDPR Privacy Policy Terms of Service Editorial Standards & Corrections Policy Subscribe to IJR **Follow Us** **Welcome Back!** Login to your account below Remember Me **Retrieve your password** Please enter your username or email address to reset your password. Politics US News Commentary World News Faith Latest Polls Copyright © 2024 IJR"}