{"id": 2204, "name": "Empire News", "domain": "empirenews.net", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://empirenews.net/only-hours-after-announcing-separation-from-lisa-bonet-actor-jason-momoa-photographed-holding-hands-with-snls-pete-davidson/", "title": "Only Hours After Announcing Separation From Lisa Bonet Actor Jason Momoa Photographed Holding Hands With Snls Pete Davidson", "content": "Write For Empire News Sign In Create Account Follow Us : **Only Hours After Announcing Separation from Lisa Bonet, Actor Jason Momoa Photographed Holding Hands with SNL’s Pete Davidson** NEW YORK CITY, New York – Only a few hours after publicly announcing that he would be divorcing wife Lisa Bonet, superstar actor Jason Momoa (Aquaman)was photographed leaving a club in New York City with SNL cast member and comedian Pete Davidson. Momoa and Bonet had been together for over 16 years, but didn’t marry until 2017. The couple announced an amicable split on social media which immediately was picked up by the AP, but nobody thought they’d see Momoa out with anyone new quite so soon. Davidson, who has been romantically linked to nearly every woman on the planet, most recently Kim Kardashian, has reportedly swooped in quickly to get in on Momoa’s hunky, manly body. “The dude is fucking awesome inAquaman,” Davidson told a reporter for TMZ. “I’ve never felt super into dudes, but one look at Jason with his shirt off throughout the entire runtime of that movie, and I challenge any man not to get erect. It’s just not possible.” Davidson is known for his whirlwind relationships, and friends of Momoa are already concerned for his well-being. “Jason is one big, badass dude,” said friend Timothée Chalamet, who recently starred in the epic film DUNE with Momoa. “Nobody is saying that Jason can’t take care of himself, but on the inside he’s a big soft teddy bear, and I just hope that Pete doesn’t screw around with his feelings.” Momoa and his reps could not be reached for comment. According to sources, his ex Lisa Bonet – best known for her role as Denise Huxtable onThe Cosby Show– is “completely broken up” about Momoa being seen out so soon with someone new. “She knew he’d eventually start seeing someone else, but didn’t know it would be this fast,” said a friend of Bonet’s who asked to remain anonymous. “I mean, Jason could have any woman on this planet, and Lisa knows that. Hell, God knows I’ve jilled-off to thoughts of him before. So Lisa expected someone to come along eventually, but I think we’re all surprised that it’s Pete Fucking Davidson.” **Comments** comments About / Disclaimer Privacy Policy Terms and conditions Feed Copyright © 2025Empire News LLC Design & Developed ByOpen Source Technologies."}