{"id": 2132, "name": "Talk TV", "domain": "talk.tv", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://talk.tv/news-uk-broadcasting-talk-tv-airtime-terms-and-conditions", "title": "News Uk Broadcasting Talk Tv Airtime Terms And Conditions", "content": "**NEWS UK BROADCASTING TV AIRTIME TERMS AND CONDITION** 1. INTRODUCTION News UK Broadcasting Limited (company number 05891478) of 1 London Bridge Street, London, SE1 9GF (‘News UK’) and its Affiliates are the operators of TV channels (including Talk TV) and wish to sell Airtime to Agencies or Direct Advertisers (together “Buyer”) in accordance with these general terms and conditions (‘Conditions’). These Conditions apply to all Airtime booked with News UK. By entering into a Booking with News UK, Buyer accepts and agrees to be bound by these Conditions in full. These Conditions apply to, and are incorporated by reference into, any Booking. The Booking and these Conditions together are the ‘Agreement’. This Agreement may only be amended to the extent set out in the Booking and any amendment purportedly made other than as set out in the Booking shall not be binding. 2. DEFINITIONS AND INTERPRETATION a) In this Agreement, unless defined in the Booking or the context otherwise requires: ‘AB Deadline’means in relation to a calendar month the date(s) notified by News UK to the Advertiser from time to time as the advance booking deadline(s) for that month or for a particular Campaign; ‘Advertiser’means the entity for whom Airtime is being purchased as identified in the Booking; ‘Affiliate’means in relation to a party, any of its associates, subsidiaries or holding companies, its ultimate parent company and all of its ultimate parent company’s associates, subsidiaries or holding companies, in each case whether direct or indirect, from time to time. A reference to a holding company or a subsidiary means a holding company or a subsidiary (as the case may be) as defined in section 1159 of the Companies Act 2006; ‘Agency’means an advertising agency or other media buyer acquiring on behalf of an advertiser client or portfolio of clients; ‘Agency Commission’has the meaning given in clause 3; ‘Airtime’means any television advertising inventory; ‘Applicable Laws’means all applicable laws as amended from time to time, including: (i) laws, regulations and codes; (ii) regulations, requirements, common law, rulings, restrictions, standards and directions relating to editorial content (including the OFCOM Broadcasting Code, BCAP Code, the CAP Code, and the OFCOM broadcasting licence obligations (including those contained in all OFCOM licences relating to each of the channels relevant to the applicable Campaign)); (iii) any relevant rules and guidelines of any Competent Authority; and (iv) Data Protection Legislation; ‘Approved Advertisement’means any submitted Copy from the Advertiser to News UK that News UK has responded to in writing stating (in its sole discretion) that such submitted Copy is approved and shall have the same meaning as 10.c)(iii); ‘ASA’means the Advertising Standards Authority, and the Advertising Standards Authority for Ireland, including the Advertising Standards Authority (Broadcast) Limited and in each case includes any successor or replacement body; ‘Audience’means Demographs recognised and reported by BARB; ‘BARB’means the Broadcasters’ Audience Research Board Limited (or its successor); ‘BCAP’means the Broadcast Committee of Advertising Practice (or its successor); ‘BCAP Code’means the TV Advertising Standards Code monitored and administered by the ASA; ‘Booking’means the Airtime booking or order form agreed between the parties setting out the terms for the relevant Campaign; ‘Brand’means the Advertiser’s brand(s), service(s) or product(s) identified in the Booking; ‘Campaign’means all or part of the Airtime within the Booking which relates to a single burst of activity for a single Brand or service for a single promotional purpose; ‘Campaign Delivery Targets’means the number of Impacts or any other agreed targets as set out in the Booking; ‘Campaign Approval System’means the campaign approval software used by News UK such as CARIA; ‘Campaign Term’means the duration of the relevant Campaign as agreed in the Booking; ‘CAP’means the Committee of Advertising Practice (or its successor); ‘CAP Code’means the British Code of Advertising, Sales Promotion and Direct Marketing enforced and administered by CAP; ‘Channel(s)’means the TalkTV channel (and variations thereof including branded slots available on third party channels), and any other television channel(s) or channel blocks represented by News UK in respect of the sale of Airtime as specified in the Booking; ‘Clearcast’means the industry recognised copy clearance system of that name and any successor or replacement; ‘Competent Authority’means any national court, any governmental authority, any other court or person exercising powers pursuant to any Applicable Law, any other equivalent, similar or other official person (including OFCOM, BCAP and CAP, as relevant) or any relevant self-regulatory body or industry body; ‘Confidential Information’means any information obtained by a party from the other as a result of or in connection with this Agreement which would be regarded as confidential by a reasonable business person and which relates to the business, clients, suppliers, operations or affairs of either a party or its Affiliate, including the contents of this Agreement; ‘Copy’means Airtime materials provided to News UK for the purpose of transmission, whether finished or in preparation; ‘Copy Requirements’means News UK’s technical specification requirements for all Copies from time to time in force and available upon request; ‘Copy Rotation Instructions’means the instructions provided to News UK regarding Copy to be broadcast, such instructions to be delivered through News UK’s nominated Campaign Approval System except in the case of Spot-specific requests; ‘Cost Per Spot’means the cost for a number of specified Spots; ‘CPT or Cost Per Thousand’means the cost per 1000 (one thousand) Impacts, for a target Audience, in respect of Airtime; ‘Data Protection Legislation’means all applicable privacy related laws and regulation, including: (i) Regulation (EU) 2016/679 (“GDPR”); (ii) the Directive on Privacy and Electronic Communications 2002/58/EC; (iii) the Privacy and Electronic Communications (EC Directive) (Amendment) Regulations 2011; (iv) any applicable national data protection laws and regulations enacted under or pursuant to (i) and (ii) and any successor laws and regulations (including the Data Protection Act 2018, the UK GDPR and other Applicable Laws and regulations); and (v) all codes of practice and guidance issued by national regulators relating to the laws and regulations set out in (i) to (iii) above, in each case as amended or superseded from time to time.‘Controller’and‘Personal Data’shall have the meanings given in the GDPR; ‘Daypart’means the part or parts of the viewing day commencing and finishing at times expressly specified by News UK; ‘Demograph’means an audience type defined by age or social classification as defined by BARB; ‘Direct Advertiser’means a person buying Airtime with News UK directly and not through an Agency; ‘Gross Expenditure’means gross expenditure, whether in cash or otherwise, before any Agency Commission, but net of VAT; ‘Impact’means a measure of viewing, with one Impact being one viewing of one advertisement by one person; ‘Insolvency Event’means in respect of a party: (i) other than for the purposes of a bona fide reconstruction or amalgamation, such party passing a resolution for its winding up, or a court of competent jurisdiction making an order for it to be wound up or dissolved, or that party being otherwise dissolved; or (ii) the appointment of an administrator of, or the making of an administration order in relation to, that party, or the appointment of a receiver or administrative receiver of, or an encumbrancer taking possession of or selling, the whole or any part of the entity's undertaking, assets, rights or revenue; or (iii) that party entering into an arrangement, compromise or composition in satisfaction of its debts with its creditors or any class of them, or taking steps to obtain a moratorium, or making an application to a court of competent jurisdiction for protection from its creditors; or (iv) that party being unable to pay its debts, or being capable of being deemed unable to pay its debts; or (v) that party entering into any arrangement, compromise or composition in satisfaction of its debts with its creditors; ‘Intellectual Property Rights’means trade marks, service marks, trade and business names, domain names, design rights, copyright, moral rights, know-how, rights in databases, rights in inventions, patents, logos, rights to sue for passing off, trade secrets, rights in Confidential Information and other intellectual property rights, in each case whether registered or unregistered and including applications for the grant of any of the foregoing and all rights or forms of protection having equivalent or similar effect to any of the foregoing which may subsist anywhere in the world; ‘Loss’means all damages, losses, costs, claims, liabilities or expenses of any kind (including reasonable legal costs); ‘Notice’means any notice, consent, request, demand, approval or other communication to be given or served under, or in connection with, this Agreement; ‘OFCOM’means the Office of Communications established by the Office of Communications Act 2002 (or its successor); ‘OFCOM Broadcasting Code’means the code for television and privacy drawn up by OFCOM from time to time; ‘Platforms’means all relevant platforms on which Spots will be broadcast, published, transmitted or otherwise communicated to the public; ‘Rates’means the pricing for an Airtime Campaign as agreed News UK and the Buyer from time to time. ‘Spot’means a slot for an advertisement (within an advertising break) on a channel; ‘TVR’means a television rating, being one percent (1%) of a given audience universe. ‘UK’means the United Kingdom of Great Britain and Northern Ireland, the Isle of Man and the Bailiwicks of Jersey and Guernsey; ‘VAT’means value added tax; and ‘Working Day’means a day, except a Saturday or Sunday, which is not a public holiday or bank holiday in England and Wales. b) In this Agreement, unless the context otherwise requires: i) a reference to a‘party’or the‘parties’is a reference to News UK, the Advertiser, or the Agency (as applicable); ii) a reference to the singular shall include the plural and vice versa; iii) a reference to any Applicable Laws shall be construed as a reference to such Applicable Laws in force as at the date of this Agreement and as subsequently amended, varied, consolidated, re-enacted or replaced from time to time and any subordinate legislation made from time to time under it; iv) a reference to‘writing’or‘written’, or any cognate expression, is a reference to any mode of representing or reproducing words in a visible, non-transitory form, including e-mail; v) a reference to a‘clause’is a reference to a clause of these Conditions unless, in the context, the reference is clearly to a clause of the Booking; vi) a reference to a‘person’shall be construed as a reference to any individual, firm, company (including, without limitation, a limited liability company), business division, joint venture, trust, agency, body corporate, committee, organisation, corporation, government, state or agency of a state or any association or partnership or any other entity whether or not having separate legal personality; vii) a reference to a‘company’shall include a reference to any body corporate; viii) any phrase introduced by the terms‘including’or‘in particular’, or any similar expression, shall be construed as illustrative and not limiting the generality of any preceding words; ix) a reference to any time or date shall be construed as a reference to the time or date prevailing in England; and x) unless otherwise specified in this Agreement, abbreviations for audience demographics shall have the meaning given to them by BARB. c) If this Agreement is entered into by an Agency, such Agency shall act as principal to contract and shall be responsible for compliance with all Buyer obligations, representations, undertakings and all warranties. . d) The headings in this Agreement are for convenience only and shall not affect its interpretation. 3. AGENCY COMMISSION a) News UK may in its sole and absolute discretion apply Agency Commission in respect of the purchase of Airtime by an Agency only as agreed in a Booking. b) Agency Commission is only applied to the actual cost of the Airtime and is not applied to any other charges such as late payment surcharges, cancellation fees, late fees, alternative Copy surcharges, deferment charges, or any other surcharges payable by any Agency in addition to the Fee. 4. AIRTIME BOOKINGS a) News UK may accept a Booking: (i) by Notice in writing; (ii) by the provision of Airtime to the Advertiser; or (iii) via its nominated Campaign Approval System. b) Buyer agrees and acknowledges that News UK shall have no obligation to accept any Bookings for Airtime. News UK reserves the right, at its sole discretion, to charge a different amount to any agreed Rates in relation to any Booking submitted after the advised AB Deadline. 5. COPY APPROVAL AND DELIVERY REQUIREMENTS a) Copy will only be transmitted by News UK if it: (i) is approved by News UK (such approval to be exercised in News UK’s absolute discretion); (ii) satisfies all of News UK’s Copy Requirements; (iii) complies with all Applicable Laws (including the spirit, and not just the letter, of the OFCOM Broadcasting Code and the BCAP Code); (iv) is approved by Clearcast, unless News UK determines (in News UK's sole discretion) that such approval is not required; and (v) is delivered to News UK accompanied with Copy Rotation Instructions. b) Where applicable, the Advertiser shall ensure that the Copy provided to News UK for transmission is the same Copy (and with the same clock number) as the Copy approved by Clearcast pursuant to clause 5.a.(iv). The parties acknowledge and agree that from time to time, News UK shall provide the clock number. c) Any approval by News UK of the Copy pursuant to clause 5.a.(i) will not be deemed to constitute an acceptance by News UK that such Copy is provided in accordance with these Airtime Terms, nor will it constitute a waiver of News UK’s rights hereunder. d) Copy must be delivered to News UK not less than three (3) clear Working Days before the date of the first intended transmission date of such Copy. e) If Copy is delivered less than three (3) clear Working Days before the first intended transmission date, News UK may decline to transmit such Copy and the Advertiser shall, at the discretion of News UK, be liable to pay in full for the Airtime time booked, whether or not any Airtime is in fact transmitted, and the Advertiser acknowledges and agrees that such payment is a genuine pre estimate of News UK's Loss. f) Application of Copy changes or changes in transmission instructions initiated by the Buyer and accepted less than three (3) clear Working Days before the first intended transmission date shall be at the sole discretion of News UK. g) Subject to clause 5(f), if News UK decides that the Copy is unsuitable, News UK shall notify the Buyer accordingly, who must supply alternative Copy as soon as practicable and in any case not later than three (3) clear Working Days prior to the first intended transmission date of such Copy. Alternative Copy shall be accepted at shorter notice at the sole discretion of News UK. Should alternative Copy not be supplied, or not be accepted by News UK, News UK may decline to transmit such Copy and shall be entitled to be paid by the Buyer in full for the Booking made, notwithstanding that no Airtime may have been transmitted and the Buyer acknowledges and agrees that such payment is a genuine pre-estimate of News UK's Loss. h) News UK shall not be liable for any additions to, changes in or deletions from any Copy required by OFCOM, Clearcast or as a consequence of any Applicable Law. i) News UK reserves the right in its absolute discretion and without incurring any liability, to decline to transmit any Copy without giving any reason in writing for so declining but the Buyer shall not be liable to pay for any such Airtime which News UK so declines to transmit in accordance with this clause 5(g). The Buyer shall be liable to pay for Airtime which News UK declines to transmit in accordance with clauses 5(a), 5(b), 5(d), 5(e), 5(f) and/or 5(i). j) News UK reserves the right to restrict or prevent any repeat transmission of the same Copy. k) News UK reserves the right at its discretion to refuse Copy advertising more than one Brand or Advertiser. If Copy advertises more than one Brand or Advertiser, News UK will be entitled to charge the Advertiser on the basis that it comprises separate Spots. l) News UK will use reasonable endeavours to follow any Copy Rotation Instructions but shall not be liable for any failure to do so. m) Neither News UK nor any of its Affiliates shall have any liability in respect of any Loss arising out of or in connection with the application of any of the provisions of this clause 5 including News UK’s refusal to approve Copy for any reason. 6. DATES AND TIMES OF TRANSMISSION a) Subject to clause 6(b) below, News UK shall have the right to use, reproduce, and transmit Spots at the dates and times which it considers to be most efficient for the purposes of delivering the Advertiser’s Campaign Delivery Targets. b) If any Copy is not transmitted on a particular agreed day and/or in an agreed segment of a day or a Daypart, News UK’s only obligation will be to use reasonable endeavours to reinsert such Copy in equivalent Airtime within the relevant Campaign Term. Where such Copy was break or programme specific, News UK will use reasonable endeavours to offer an alternative transmission at some other date. c) News UK shall not incur any liability for any error in any Copy transmitted except to the extent that such error is due solely to the fault of News UK in which case News UK’s sole liability to the Buyer shall be that News UK shall not charge the Buyer for the Airtime in relation to such erroneously transmitted Copy. d) Spots appearing within fifteen (15) minutes of the relevant Daypart segment band will be regarded as appearing within that Daypart segment. Advertisements booked for transmission at a specific time will be transmitted in the commercial break nearest to that time. e) News UK shall not be held responsible in any way for the content, nature or subject matter of any other Airtime or other programmes transmitted on the Channels and the impact or otherwise that any of the same may have on the effectiveness or otherwise of any Airtime transmitted by News UK on behalf of the Advertiser. 7. CANCELLATION AND POSTPONEMENT a) Upon notice to News UK, the Buyer may cancel a Campaign, provided that the Buyer must pay: i) twenty percent (20%) of the total value of the Booking as at the date of cancellation if the Buyer cancels no less than forty two (42) days before the first intended transmission of the relevant Approved Advertisement; ii) thirty five percent (35%) of the total value of the Booking as at the date of cancellation if the Buyer cancels no less than twenty nine (29) but no more than forty two (42) days before the first intended transmission of the relevant Approved Advertisement; iii) fifty percent (50%) of the total value of the Booking as at the date of cancellation if the Buyer cancels no less than fifteen (15) but no more than twenty eight (28) days before the first intended transmission of the relevant Approved Advertisement; and iv) one hundred percent (100%) of the total value of the Booking as at the date of cancellation if the Buyer cancels no more than fourteen (14) days before the first intended transmission of the relevant Approved Advertisement. b) News UK will in its absolute discretion consider written requests from Buyer to postpone a Campaign without incurring a cancellation charge as set out in clause 7(a). If News UK agrees to postpone the Campaign, the Campaign must be rescheduled to commence as soon as reasonably practicable thereafter. Campaigns may not be rescheduled to a date more than six (6) months following the originally intended first transmission of the relevant Approved Advertisement. If the Campaign is not rescheduled within this timeframe, the Campaign shall be deemed cancelled and the charges set out in clause 7(a)(iv) shall apply. 8. RATES a) News UK’s prices will be as agreed from time to time between News UK and the Buyer. The Buyer agrees that where an approval in relation to the transmission of Airtime is not received by News UK from the Buyer in writing prior to any applicable AB Deadline, News UK reserves the right not to make such transmission, but if it agrees to make such transmission any price previously agreed in respect of such transmission may, at the absolute discretion of News UK, no longer apply and be subject to b) Special rates and conditions for Spots may be announced by News UK from time to time for particular programmes. 9. PAYMENT TERMS AND FINANCE a) News UK may require the Buyer to pay the Rates in advance of the Campaign, including in circumstances the Buyer has not previously purchased Airtime from News UK and has no credit history. b) If any sum payable by the Buyer to the News UK is not paid by the applicable due date, except to the extent and for the period that any sum is the subject of a bona fide dispute, the News reserves the right to charge interest on a daily basis at the rate of 4% per annum above the base rate of Barclays Bank Plc (from time to time) from the applicable due date until the date of actual payment. c) Unless otherwise agreed in a Booking, payment in full must be made by the Buyer to News UK prior to the AB Deadline. The Buyer shall pay each invoice submitted by News UK: i) within thirty (30) days of the date of the invoice or the date specified on the invoice, whichever is earlier; and ii) in full and in cleared funds to a bank account nominated in writing by News UK. d) All payments of accounts for Airtime shall be made in full and the Buyer shall have no right to claim any set off or to make any counterclaim in any proceedings brought by News UK in respect of any such payment. News UK is entitled to set off any monies due to it by the Buyer, against any monies due by News UK to the Buyer (or any of such Buyer’s Affiliates). 10. WARRANTIES a) Each party represents, warrants and undertakes to the other party that: i) it has the full right, power, and authority to enter into this Agreement and to perform the acts required of it and to grant the rights granted and is not subject to any prior or existing contractual or other obligation that prevents, restricts, limits or in any way affects its capacity to enter into this Agreement or to perform its obligations hereunder; ii) in the performance of its obligations hereunder it shall comply with Applicable Laws; iii) all materials provided to the other party under this Agreement comply with all Applicable Laws and do not and will not infringe the rights of any person (including any copyright or trade mark right); iv) it shall only use the rights granted under this Agreement in accordance with the terms of this Agreement; v) to the extent that it provides personal data to the other party in connection with this Agreement, such disclosure complies with the Data Protection Legislation; and vi) Unless expressly stated in this Agreement, no third party consent or approval is required to exercise any rights or discharge any obligations of the respective party under this Agreement. b) Any Agency identified in the Booking represents, warrants and undertakes to News UK that it is authorised to act on behalf of the Advertiser as principal to contract. c) The Buyer represents, warrants and undertakes to News UK and its Affiliates (as appropriate) that: i) it has obtained, maintained and paid for all necessary permits, licenses, authorisations and any other consents (whether statutory or otherwise) required under this Agreement, including in respect of the transmission of any Airtime or copyright material contained in, or the appearances of any person in, the Copy including any music rights or performing rights in relation to all Platforms; ii) the Copy and its use, recording, broadcasting, transmission, distribution or communication to the public on any Platform does not breach the copyright or other rights (including Intellectual Property Rights) of, or is not defamatory to, any third party; iii) the Copy is Clearcast approved (unless deemed unnecessary by News UK and prior written agreement has been given by News UK that it is not required) and complies with any OFCOM guidelines and other News UK approval requirements (“Approved Advertisement”); iv) the Copy is not in any way misleading, false, defamatory, obscene, indecent or otherwise offensive; v) the Copy does not constitute a financial promotion within the meaning of the Financial Services and Markets Act 2000 or other Applicable Law; and vi) the Copy complies with all Applicable Laws. d) In the event of any issues raised by OFCOM in connection with News UK’s compliance with any Applicable Laws, the Buyer shall co-operate fully with News UK and its Affiliates and provide such assistance as may reasonably be required by any of the same in connection with such issue. 11. INDEMNITY a) The Buyer shall indemnify and keep News UK and its Affiliates indemnified, in full and on demand, against all claims (actual or threatened), demands, actions, fines, settlement, interest and Loss or other regulatory penalties of whatsoever nature arising directly or indirectly out of or in connection with each Campaign or any Approved Advertisements (or content therein) including any breach or alleged breach of any third party’s Intellectual Property Rights, or any breach by the Buyer of this Agreement or Applicable Laws. b) News UK shall: (i) advise the Buyer of any such claim that it becomes aware of in a timely fashion; and (ii) cooperate or assist in the defence of the claim or litigation where the Buyer reasonably requests such cooperation or assistance and at no cost to News UK. 12. LIABILITY a) Subject to clause 12.b) below, News UK’s aggregate liability and that of its Affiliates to Advertiser and its Affiliates for Loss arising out of, or in connection with, this Agreement, whether such liability arises in contract, tort (including negligence) or otherwise, shall not exceed the Gross Expenditure in relation to the Booking in respect of which the liability arises). No party nor any of its Affiliates shall be liable to the other party or any of its Affiliates (whether such liability arises in contract, tort (including negligence) or otherwise) for: (a) any loss of profit, loss of, or damage to, data, loss of anticipated savings or interest, loss of or damage to reputation or goodwill or any indirect, special or consequential damages; or (b) any Loss arising from a failure or delay in performing its obligations under this Agreement to the extent that such failure or delay was caused by an act or omission of another party or any of its Affiliates. b) Nothing in this Agreement shall exclude or restrict any Party’s liability for death or personal injury caused by such Party or for fraud or fraudulent misrepresentation. c) Except as otherwise expressly provided in this Agreement, all warranties, conditions, undertakings, terms and other provisions implied by statute, common law or custom are excluded to the fullest extent permitted by law. d) News UK shall have no liability to Advertiser under this Agreement if it is unable to perform any of its obligations hereunder as a result of the Applicable Laws. e) News UK’s maximum aggregate liability arising out of or in connection with this Agreement shall be limited to the aggregate of the Rates payable by the Advertiser (or Agency, as applicable) to News UK for the relevant Campaign. 13. FORCE MAJEURE a) In this clause 13, ‘Force Majeure Event’ means any event or circumstance which is beyond the reasonable control of the affected party, including flood, lightning, subsidence, terrorist act, fire, war, power shortage, failure of a utility service, natural disaster, epidemic or pandemic, illness, public health concern in relation to potential infection, war, riot, civil commotion, accident, malicious damage, compliance with any law or governmental order, rule, regulation or direction, accident, breakdown of ICT infrastructure, default of suppliers or subcontractors, acts of government or industrial action not involving the employees of the affected party. b) Neither party will be liable for any delay or failure in meeting its obligations under this Agreement (other than the obligation of Advertiser or Agency to make payments due to News UK) if such delay or failure is caused by a Force Majeure Event, provided that the affected party notifies the other of the occurrence of the Force Majeure Event within 5 Working Days and uses reasonable endeavours to minimise the consequences of the Force Majeure Event and to bring it to a close as soon as reasonably possible. 14. TERM AND TERMINATION a) Unless terminated earlier in accordance with its terms, this Agreement will remain in force until the date specified in the relevant Booking, or for as long as News UK continues to transmit or otherwise make available the relevant Campaign. b) Without limiting its other rights or remedies, a party may terminate this Agreement or a relevant Booking with immediate effect by giving written Notice to the other party if: i) the other party commits a material breach of any term of this Agreement and (if such a breach is remediable) fails to remedy that breach within fourteen (14) days of that party being notified in writing to do so; ii) it is affected by a Force Majeure Event which continues for a period of fourteen (14) days and which prevents it from performing all, or a material part of, its obligations under this Agreement; or iii) the other party suffers an Insolvency Event. If News UK terminates any accepted Booking in accordance with clause 14(b) at any time after AB Deadine, then the Gross Expenditure for all the Airtime booked in relation to the Campaign(s) shall become payable immediately on such termination. c) Without limiting its other rights or remedies, News UK may terminate this Agreement or a relevant Booking with immediate effect by giving written Notice to the other party if: iv) the Advertiser or Agency fails to pay any amount payable under this Agreement within fourteen (14) days of the due date; v) News UK reasonably believes it has suffered or is likely to suffer significant or damaging adverse publicity as a result of its connection with the whole or any part of a Campaign or the Advertiser (or its Brand, as the case may be) or this Agreement; vi) there is any change in any Applicable Laws or News UK’s status as an OFCOM regulated entity or any complaint, regulatory adjudication, intervention, requirement or ruling that prevents News UK from continuing or, in News UK’s reasonable opinion, makes it materially more onerous for News UK to fulfil its obligations under this Agreement; or vii) there is a material change in the ownership of or a change of control of the Buyer or if the Buyer disposes of all or a substantial part of its assets or undertaking. d) News UK may terminate this Agreement (or any part of it) or a Booking (or any part of it) for convenience by giving not less than twenty-eight (28) days’ Notice. In the event of termination by News UK in accordance with this clause, the Campaign booking set out in a Booking shall be charged at the rate appropriate to the number of Approved Advertisements broadcast before the date of termination or, where applicable, to reflect the Campaign Delivery Targets (as the same may be revised by News UK to reflect the date of termination). In the event of such termination, the Buyer shall be released from its obligations to make any further payments of the Gross Expenditure from the date of termination, but the Buyer shall be responsible for payment of the Gross Expenditure is respect of all Approved Advertisements already transmitted or, if applicable, revised Campaign Delivery Targets already achieved, in each case prior to the date of termination. e) Without prejudice to clause 14.f), in the event of termination of this Agreement (or any part thereof) by News UK, the Buyer shall be responsible for payment of all Gross Expenditure payable under the Booking (to the extent unpaid as at the date of termination). Any termination of this Agreement or Booking (or any part thereof) shall be without prejudice to any accrued rights and remedies of News UK at the date of termination. f) Termination by News UK in accordance with this clause 14 shall not give the Buyer any right to be reimbursed any sums paid under the Booking in respect of Airtime supplied by News UK prior to the date of such termination. g) Without prejudice to News UK’s other rights and remedies under this Agreement, News UK may, by notice in writing to the Buyer, terminate any accepted Campaign, Booking or this Agreement (as applicable) at any time if the Buyer fails to agree with News UK express terms as to price and/or scheduling in respect of Airtime prior to the first scheduled transmission of the relevant Spots. 15. CONFIDENTIALITY AND DATA PROTECTION a) Each party shall not, and will procure that its Affiliates shall not, disclose to any person any Confidential Information of the other, whether before or after termination of this Agreement, and neither party shall use the other’s Confidential Information for any purpose other than to perform its obligations under this Agreement. b) Notwithstanding clause 15.(a), the receiving party may disclose such Confidential Information to those of its employees, agents and subcontractors who need to know it for the purpose of discharging the receiving party's obligations under this Agreement or to its professional advisers, auditors or bankers (and shall ensure that such persons comply with the obligations set out in this clause) and to the extent required to be disclosed by law, any governmental or regulatory authority or to a court of competent jurisdiction. c) This clause 15 will not apply to information which the disclosing party can show was known to the recipient, under no obligation of confidence, at the time it was disclosed or became publically known through no wrongful act of the disclosing party. d) Neither party may make any public statement or announcement in connection with this Agreement without the other party’s prior written consent. e) Unless otherwise agreed in writing, for the purposes of the Data Protection Legislation, the parties acknowledge and agree that they are separate and independent Controllers of any Personal Data that is shared between them or otherwise processed by or on behalf of the parties under this Agreement. Each party shall independently determine the manner and purpose of the processing of such Personal Data, and comply with all Data Protection Legislation applicable to it in respect of such Personal Data. 16. PUBLICITY AND INFORMATION CONCERNING ADVERTISEMENTS The Buyer shall not, without the prior written consent of News UK, publish any information in connection with any Booking, Campaign or other trading terms in relation to this Agreement. News UK shall be entitled to refer to the Buyer and/or Advertiser’s association with News UK and the Airtime placed hereunder to promote News UK’s business generally. 17. BRIBERY, CORRUPTION AND MODERN SLAVERY In the performance of its obligations under this Agreement each party shall: a) comply with all Applicable Laws and regulations relating to anti-bribery and anti-corruption (including the Bribery Act 2010 and the Foreign Corrupt Practices Act 1977) and maintain its own policies and procedures in this respect; b) as soon as practicable report to the other party any offer, request or demand for any undue financial or other advantage of any kind received in connection with the performance of this Agreement; c) ensure that any person associated with the party who is providing services or goods in connection with this Agreement does so only on the basis of a written contract including similar anti-corruption terms; d) comply with all applicable anti-slavery and human trafficking laws, statutes, regulations from time to time in force including the Modern Slavery Act 2015 and maintain throughout the term of this Agreement its own policies and procedures to ensure its compliance; e) not engage in any activity, practice or conduct that would constitute an offence under sections 1, 2 or 4, of the Modern Slavery Act 2015 if such activity, practice or conduct were carried out in the UK; and f) include in its contracts with its subcontractors and suppliers applicable and appropriate anti-slavery and human trafficking provisions. 18. GENERAL a) Reservation of rights. The Advertiser acknowledges and agrees that all rights not granted to it under this Agreement are reserved to News UK, its Affiliates and its licensors (as applicable). b) Entire agreement. This Agreement contains the whole agreement between the Buyer and News UK and supersedes all prior agreements, arrangements and understandings between News UK and the Buyer relating to the subject matter of this Agreement. Any: (i) inclusion by or on behalf of the Buyer within any correspondence of additional terms and conditions; or (ii) reference within any correspondence or document to the application of the Buyer’s terms and conditions, shall be invalid. In the event of any conflict between these Conditions and this Agreement, this Agreement shall prevail. c) Non-reliance. The Buyer acknowledges that it has not relied upon any statement or representation made by News UK in entering into this Agreement unless expressly set out in this Agreement. d) Rights cumulative. The rights, powers, privileges and remedies provided in this Agreement are cumulative and are not exclusive of any rights, powers, privileges or remedies provided under other provisions of this Agreement, by law or otherwise. e) Severance. If any provision of this Agreement is found by a Competent Authority to be invalid, unenforceable or illegal, the other provisions of this Agreement shall remain in force. If any invalid, unenforceable or illegal provision of this Agreement would be valid, enforceable or legal if some part of it were deleted, the provision shall apply with whatever modification is necessary to give effect to the commercial intention of the parties. f) Survival. No termination of this Agreement (howsoever caused) shall affect any provisions of this Agreement which are expressly stated to survive, or which by their nature survive, such termination or any other rights which a party may have under this Agreement or any liabilities accrued prior to the date of termination. g) Waiver. No forbearance or delay by News UK in enforcing its rights will prejudice or restrict its rights and no waiver of any such right or of any breach of this Agreement will be deemed to be a waiver of any other right or of any later breach. h) No partnership. Nothing in this Agreement is intended to, or shall be deemed to, establish any partnership or joint venture between any of the parties. This Agreement shall not be deemed to create any partnership, agency or employment relationship between News UK and the Advertiser or Agency. i) Third party rights. Save in relation to News UK Affiliates, which shall benefit from all warranties, indemnities and caveats under this Agreement, a person who is not a party to this Agreement has no rights under the Contracts (Rights of Third Parties) Act 1999 to, directly or indirectly enforce its terms, except for any News UK Affiliates that enter into, or have an express benefit of rights under, this Agreement. j) Notice. Any Notice to be given or made under or in connection with this Agreement shall be in English, in writing and signed by or on behalf of the person giving it. Notices shall be sent to the address for each party set out in this Agreement. k) Assignment. News UK may assign, sub license or sub-contract all or any part of its rights or duties under this Agreement. The Advertiser may not assign or sub contract all or any part of its rights or duties under this Agreement without News UK’s prior written consent. l) Variation. News UK may vary and update the terms of these Conditions at any time (including by posting a new version of these Conditions on its website) and the updated Conditions shall apply to all Bookings entered into thereafter. Except as set out in these Conditions, no variation of this Agreement shall be effective unless it is agreed in writing and signed by the parties. m) Counterparts. This Agreement may be executed in any number of counterparts, each of which when executed and delivered shall constitute a duplicate original, but all the counterparts shall together constitute the one Agreement. Transmission of an executed counterpart of this Agreement by email (in PDF, JPEG or other agreed format), shall take effect as delivery of an executed counterpart of this Agreement. If either method of delivery is adopted, without prejudice to the validity of this Agreement made, if requested each Party shall provide the others with the original of such counterpart as soon as reasonably possible thereafter. No counterpart shall be effective until each Party has executed and delivered at least one counterpart. n) Governing law and jurisdiction. This Agreement and any dispute or claim relating to it or its subject matter, its enforceability or its termination (including non-contractual disputes or claims) is to be governed by and construed in accordance with the law of England and Wales. Each party agrees that the courts of England and Wales have exclusive jurisdiction to settle any dispute or claim arising out of or in connection with this Agreement or its subject matter or formation (including non-contractual disputes or claims). **GET IN TOUCH** **SUPPORT** **TERMS AND CONDITIONS** **STAY IN TOUCH** ©2025News UK Broadcasting Ltd.Our and are applicable to you. All rights reserved."}