{"id": 858, "name": "The Journal News", "domain": "lohud.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lohud.com/story/news/2019/05/06/corrections-and-classifications/1117670001/", "title": "Corrections And Classifications", "content": "**Corrections and clarifications** To report corrections and clarifications, contact: Phone: 914-694-5077 E-mail:accuracy@lohud.com Please indicate whether you're responding to content online or in the newspaper. The following corrections and clarifications have been published on stories produced by lohud/The Journal News' newsroom: January 2020 Lakeland/Panas’ girls sprint medley relay team that finished third at the Saturday, Jan. 4, U.S. Air Force Hispanic Games consisted of Brooke Sayre, Makayla Waugh, Millie Lichtenwalner-Seabaugh and JaLia Williams. Two team members’ names were incorrect in a Journal News Page B1 article on Monday, Jan. 6. https://www.lohud.com/story/sports/high-school/track/2020/01/04/hispanic-games-track-field-iona-prep-brendan-mulvany-pearl-river-ciara-durcan-win/2793718001/ November 2019 The Chaverim volunteer patrol organization's name was misspelled in a story posted Nov. 21 and published in The Journal News on Nov. 22 about increased security in Monsey after a stabbing. https://www.lohud.com/story/news/local/rockland/ramapo/2019/11/21/monsey-stabbing-tensions-and-concerns-remain/4257929002/ October 2019 In a story posted Oct. 29, an earlier version reported the role of the \"nanny cam\" incorrectly. https://www.lohud.com/story/news/crime/2019/10/29/man-accused-using-nanny-cam-take-sexual-photos-child-da/2501794001/ In a story posted Oct. 23, an early version of this story stated guests are able to test drive a Tesla. In fact, guests are invited to ride along in a Tesla with a Tesla employee behind the wheel. And a drawing is to win a week with a Tesla X. https://www.lohud.com/story/life/2019/10/23/test-drive-teslas-go-karts-palisades-center-sunday/4069978002/ July 2019 A Page One article on Wednesday, July 31, in The Journal News incorrectly identified the federal judge who will sentence Hector May on his conviction involving the theft of $11 million from his investor-clients. The judge is Vincent Briccetti. https://www.lohud.com/story/news/local/rockland/2019/07/30/rockland-broker-hector-may-faces-20-years-prison-ponzi-scheme/1865822001/ June 2019 Incumbent Nadine Hunt-Robinson, Victoria Presser and Jennifer Puja won the White Plains Common Council Democratic primary on Tuesday, June 25. A chart in The Journal News on Page A7 Thursday, June 27, misstated the number of candidates being selected. https://www.lohud.com/story/news/politics/elections/2019/06/25/primary-election-2019-results-westchester-rockland/1564743001/ Dennis M. Robertson is running in the Democratic primary for Yonkers City Council District 3. Information about the was incorrect in an earlier version of this article, posted June 13: https://www.lohud.com/story/news/politics/elections/2019/06/13/westchester-primaries-june-25/1435817001/ Money to pay for the contractual raises for Rockland County’s CSEA workers was previously set aside in the county’s 2019 budget. There is no additional cost to taxpayers this year. Increases in 2020 and 2021 will be appropriately budgeted for those years. An earlier version of this article was unclear about the implications for taxpayers. The article was posted online June 5: https://www.lohud.com/story/news/local/rockland/2019/06/05/rockland-county-ny-and-csea-union-reach-five-year-contract-raises/1350640001/ May 2019 Raymond Bartoszek, the keynote speaker at Iona Prep's graduation, in 2011 became the youngest limited partner of the New York Yankees but is no longer the youngest. Information about his status was incorrect in an earlier version of this story, posted online May 23:https://www.lohud.com/story/news/education/graduations/2019/05/23/iona-prep-graduation-2019-schools-100th-commencement-photos/1210672001/ News:The Tappan Zee Bridge is 64 years old. An earlier version of this story, which ran on page 1A on May 11, had an incorrect number.https://www.lohud.com/story/news/local/tappan-zee-bridge/2019/05/10/tappan-zee-bridge-final-section/1162239001/ Weekend:The Scarsdale Memorial Day Parade takes place on May 27. An earlier version of this story, which ran on page K3 on May 24, had the incorrect date.https://www.lohud.com/story/life/2019/05/20/memorial-day-2019-observances-parades/3745570002/"}