{"id": 549, "name": "Frontiers in Energy Research", "domain": "frontiersin.org/journals/energy-research", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/energy-research/articles/10.3389/fenrg.2025.1441767/full", "title": "Energy Research", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Clean Fuel Technologies Bioenergy and Biofuels Carbon Capture, Utilization and Storage Electrochemical Energy Storage Energy Efficiency Energy Storage Fuel Cells, Electrolyzers and Membrane Reactors Hydrogen Storage and Production Nano Energy Nuclear Energy Process and Energy Systems Engineering Smart Grids Solar Energy Sustainable Energy Systems Wave and Tidal Energy Wind Energy Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Clean Fuel Technologies Bioenergy and Biofuels Carbon Capture, Utilization and Storage Electrochemical Energy Storage Energy Efficiency Energy Storage Fuel Cells, Electrolyzers and Membrane Reactors Hydrogen Storage and Production Nano Energy Nuclear Energy Process and Energy Systems Engineering Smart Grids Solar Energy Sustainable Energy Systems Wave and Tidal Energy Wind Energy Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Advanced Clean Fuel Technologies Bioenergy and Biofuels Carbon Capture, Utilization and Storage Electrochemical Energy Storage Energy Efficiency Energy Storage Fuel Cells, Electrolyzers and Membrane Reactors Hydrogen Storage and Production Nano Energy Nuclear Energy Process and Energy Systems Engineering Smart Grids Solar Energy Sustainable Energy Systems Wave and Tidal Energy Wind Energy Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Energy Res. Sec. Sustainable Energy Systems Volume 13 - 2025 |doi: 10.3389/fenrg.2025.1441767 **What drives asset and resource stranding in the transition from fossils to clean energy? A systematic review** 1Makerere University Business School, Kampala, Uganda 2Norwegian University of Science and Technology, Trondheim, Norway 3United Nations Development Program, Kampala, Uganda The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here The study investigates the drivers and mechanisms of asset and resource stranding in the context of energy transitions. A systematic review approach was used to analyze existing studies, identify the drivers of energy resource and asset stranding, and examine their underlying mechanisms. The results show a regional bias, with most studies on stranded energy resources and assets conducted in Europe. Key factors influencing asset stranding are linked to policies, institutional frameworks, economic mechanisms such as shifts in investments toward clean technologies and divestment from fossil fuels and technological advancements related to increased accessibility of renewable energy technologies. Environmental risks also dynamically facilitate the stranding of fossil fuel assets. These findings suggest a critical research gap in understanding the drivers and mechanisms of asset and resource stranding in developing economies, particularly in Africa and Asia. Limited studies have explored asset-stranding dynamics in these regions, undermining the understanding of their unique challenges and opportunities for managing energy transitions effectively. Additionally, the interdependencies between these drivers and their cumulative effects remain underexplored, highlighting the need for more integrated and cross-disciplinary analyses. The findings of this study contribute to our understanding of asset and resource stranding and have implications for informing effective energy transition strategies in these less-studied regions. Keywords:Stranded assets, stranded resources, energy transition, drivers, Mechanism, Transition risk Received:04 Jun 2024;Accepted:10 Jun 2025. Copyright:© 2025Kemitare, Nantongo, Nakakaawa-Jjunju, Mukisa, Wasswa and Muyiwa. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Rochelle Gladys Kemitare, Makerere University Business School, Kampala, Uganda Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}