{"id": 1165, "name": "Redlands Daily Facts", "domain": "redlandsdailyfacts.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.redlandsdailyfacts.com/2025/06/05/update-thunderstorms-with-damaging-winds-in-san-bernardino-and-clark-counties-thursday-gusts-may-reach-60-mph/", "title": "Update Thunderstorms With Damaging Winds In San Bernardino And Clark Counties Thursday Gusts May Reach 60 Mph", "content": "e-Edition e-Edition NewsNewsCrime and Public SafetyInvestigative ReportingElectionPoliticsHealthEnvironmentBusinessBest ReviewsJobsHousingWeather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Jobs Housing Weather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Jobs Housing Weather Local NewsLocal NewsRedlandsHighlandLoma LindaYucaipaSan Bernardino CountySan Bernardino MountainsRiverside County Local News Redlands Highland Loma Linda Yucaipa San Bernardino County San Bernardino Mountains Riverside County Local News Redlands Highland Loma Linda Yucaipa San Bernardino County San Bernardino Mountains Riverside County SportsSportsHigh School SportsChargersRamsLakersClippersDodgersAngelsCollege SportsUCLA SportsUSC SportsKingsDucksOlympicsBoxing/MMASoccerHorse Racing Sports High School Sports Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Sports High School Sports Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Things To DoThings To DoRestaurants Food and DrinkCasinosAmusement ParksMoviesMusic + ConcertsTheaterTV and StreamingHome + GardenTravelComicsEvents Things To Do Restaurants Food and Drink Casinos Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events Things To Do Restaurants Food and Drink Casinos Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnsCommentaryLetters to the EditorEditorial BoardEndorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements SCNG Premium Sponsored Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint The T.E.A. Subscribe Daily Facts Store Log In Logout Get the latest news delivered daily! **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Log In Get the latest news delivered daily! Subscribe Log In e-Edition e-Edition News Local News Sports Things to Do Obituaries Opinion The T.E.A. Trending: ICE protests 🎓 2025 Graduations Crime news AYCE dining deals Top Workplaces 2025 🏢 Rooftop dining in the IE **Update: Thunderstorms with damaging winds in San Bernardino and Clark counties Thursday – gusts may reach 60 mph** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print San Bernardino and Clark counties are under an updated severe thunderstorm warning which was issued by the National Weather Service on Thursday at 9:54 p.m. The warning is in effect until 10:15 p.m. Residents should be prepared for wind gusts of up to 60 mph. “At 9:53 p.m., a severe thunderstorm was located near Jean, moving east at 15 mph,” says theNWS Las Vegas NV. “Expect damage to roofs and trees.” The warning is for Jean and Goodsprings. This includes Interstate 15 in Nevada between mile markers 5 and 23. According to the NWS, “For your protection move to an interior room on the lowest floor of a building. Torrential rainfall is occurring with this storm, and may lead to flash flooding. Do not drive your vehicle through flooded roadways.” **Road closures** Updates on road closures can be found onCalTrans’ websiteor mobile app or by calling 800-427-7623. **Emergency alerts in Southern California** For “considerable or catastrophic” hazards, emergency alerts will be sent to all enabled mobile phones in the area. To monitor lesser risk, residents are advised to sign up for county alert systems and to monitor agencies’ social media. How to sign up for alerts in your area: LA County Orange County Riverside County San Bernardino County **Where to get sandbags** If you’re in an area at risk of flooding, sandbags can be one line of defense. County fire departments typically offer a limited supply of free sandbags for residents of their nearby communities. You should bring your own shovel to fill your bags, and be prepared to show proof of residency. Sand and sandbags can also be purchased at many home improvement and hardware stores. Here are links of locations that might have sandbags in your area: Los Angeles Countyhttps://dpw. Lacounty. Gov/dsg/sandbags/ Orange Countyhttps://ocfa. Org/AboutUs/Departments/OperationsDirectory/Sandbags. Aspx San Bernardino Countyhttps://sbcfire. Org/sandbags/ Riverside Countyhttps://rvcfire. Org/resources/fire-stations **How to fill a sandbag** Not sure how to fill your sandbags?Watch the how-to video, provided by the City of Seal Beach. **Lightning on the horizon: Expert safety measures for thunderstorms** Each year, lightning strikes the United States approximately 25 million times, with the majority of these electrifying events occurring during the summer months. Unfortunately, lightning is responsible for claiming the lives of approximately 20 people annually, as reported by the NWS. The threat of lightning becomes more pronounced as thunderstorms draw nearer, peaking when the storm is directly overhead and gradually waning as it moves away. To ensure your safety during a thunderstorm, keep these recommendations in mind: Lightning safety plan: When venturing outdoors, it’s crucial to have a lightning safety plan in place. Stay vigilant by monitoring the sky for ominous signs and listening for the telltale sound of thunder. If thunder is audible, it’s a clear indication of nearby lightning. Seek a safe place to shelter, preferably indoors. Indoors safety measures: Once you’ve found shelter indoors, abstain from using corded phones, electrical appliances, or plumbing fixtures, and refrain from approaching windows and doors. Lightning can follow conductive pathways, and these precautions reduce the risk of electrical surges. Wait for the all-clear: After the last lightning strike or thunderclap, wait at least 30 minutes before resuming outdoor activities. It’s important to remember that lightning can strike even when a storm seems to have passed, so exercise caution. When indoor shelter isn’t available: If you find yourself outdoors without access to indoor shelter during a thunderstorm, take these steps to maximize your safety: Avoid open fields, hilltops, or ridge crests, as they expose you to greater lightning risk. Steer clear of tall, isolated trees and other prominent objects. In forested areas, stay close to lower stands of trees. If you’re with a group, ensure individuals are spread out to prevent lightning current from transferring between people. Camping in an open setting during a thunderstorm is strongly discouraged. If you have no alternative, set up camp in a valley, ravine, or other low-lying areas. It’s crucial to note that a tent provides no protection against lightning. Do not approach water bodies, wet objects, or metal items. While water and metal don’t attract lightning, they conduct electricity effectively and can pose significant risks. In summary, when facing the threat of lightning, vigilance and preparedness are your best allies. By following these guidelines, you can significantly reduce the chances of lightning-related accidents and prioritize your safety. **Rainy roadways ahead: Essential safety tips for heavy rain** When heavy rain sets in, the risk of flooding and hazardous driving conditions rises. Whether it’s prolonged rainfall or rapid runoff, being prepared is essential. Here are some valuable safety tips from the NWS to ensure you stay safe in heavy rain: Beware of rapid water flow: During heavy rain, avoid parking or walking near culverts or drainage ditches, where swift-moving water can pose a serious risk. Maintain safe driving distances: Use the two-second rule to maintain a safe distance from the car in front of you and allow an extra two seconds in heavy rain. Reduce speed and drive cautiously: On wet roads, reducing your speed is crucial. Ease off the gas pedal gradually and avoid abrupt braking to prevent skidding. Choose your lane wisely: Stick to the middle lanes on multi-lane roads to minimize the risk of hydroplaning, as water tends to accumulate in outer lanes. Visibility matters: Turn on your headlights and be careful of other vehicles to the rear and in blind spot areas as they are especially difficult to see through rain-spattered windows. Watch out for slippery roads: Be extra careful during the first half hour after rain begins. Grime and oil on the road surface mix with water to make the road slippery. Keep a safe distance from large vehicles: Large trucks and buses can reduce your visibility with tire spray. Avoid tailgating and pass them swiftly and safely. Mind your windshield wipers: Overloaded wiper blades can hinder visibility. If rain severely limits your sight, pull over and wait for conditions to improve. Seek refuge at rest areas or protected spots. If the roadside is your only option, pull off as far as possible, preferably past the end of a guard rail, and wait until the storm passes. Keep your headlights on and turn on emergency flashers to alert other drivers of your position. In the face of heavy rain, these precautions can make a significant difference in ensuring your safety on the road. Remember to stay informed about weather conditions and heed guidance from local authorities for a secure journey. Sourcing & Methodology This article was generated by software that analyzes National Weather Service warnings and advisories and creates an article based on templates created by humans. Our data comes from publicly available information. You can report errors to online@scng.com **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Newsroom Guidelines News Tips Contact Us Report an Error **RevContent Feed** **Most Popular** Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho CucamongaFrito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** 3 dead after motorcyclist fleeing deputies crashes in Redlands3 dead after motorcyclist fleeing deputies crashes in Redlands **3 dead after motorcyclist fleeing deputies crashes in Redlands** **3 dead after motorcyclist fleeing deputies crashes in Redlands** Redlands pastors pray for school board, LGBTQ+ students at vigilRedlands pastors pray for school board, LGBTQ+ students at vigil **Redlands pastors pray for school board, LGBTQ+ students at vigil** **Redlands pastors pray for school board, LGBTQ+ students at vigil** Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa ValleyPedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley **Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley** **Pedestrian fatally struck by Riverside County sheriff’s patrol car in Jurupa Valley** Update: Thunderstorms with damaging winds in San Bernardino and Clark counties Thursday – gusts may reach 60 mphUpdate: Thunderstorms with damaging winds in San Bernardino and Clark counties Thursday – gusts may reach 60 mph **Update: Thunderstorms with damaging winds in San Bernardino and Clark counties Thursday – gusts may reach 60 mph** **Update: Thunderstorms with damaging winds in San Bernardino and Clark counties Thursday – gusts may reach 60 mph** Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’ **Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’** **Celebrities owned many Inland Empire businesses during Hollywood’s ‘Golden Age’** California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearingCalifornia judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** Redlands school board to discuss racial issuesRedlands school board to discuss racial issues **Redlands school board to discuss racial issues** **Redlands school board to discuss racial issues** New hours for Redlands’ household hazardous waste facilityNew hours for Redlands’ household hazardous waste facility **New hours for Redlands’ household hazardous waste facility** **New hours for Redlands’ household hazardous waste facility** Explore the hidden charms of Redlands’ Kimberly Crest House and GardensExplore the hidden charms of Redlands’ Kimberly Crest House and Gardens **Explore the hidden charms of Redlands’ Kimberly Crest House and Gardens** **Explore the hidden charms of Redlands’ Kimberly Crest House and Gardens** **More in Weather Advisory** Update: Penny-sized hail forecast with thunderstorms in Yosemite Sunday – gusts to hit 40 mph **Update: Penny-sized hail forecast with thunderstorms in Yosemite Sunday – gusts to hit 40 mph** **Update: Penny-sized hail forecast with thunderstorms in Yosemite Sunday – gusts to hit 40 mph** Update: Expect pea-sized hail with thunderstorms in Yosemite and Yosemite Valley Saturday – gusts to hit 40 mph **Update: Expect pea-sized hail with thunderstorms in Yosemite and Yosemite Valley Saturday – gusts to hit 40 mph** **Update: Expect pea-sized hail with thunderstorms in Yosemite and Yosemite Valley Saturday – gusts to hit 40 mph** Update: Thunderstorms with pea-sized hail in Yosemite Friday – gusts as high as 40 mph **Update: Thunderstorms with pea-sized hail in Yosemite Friday – gusts as high as 40 mph** **Update: Thunderstorms with pea-sized hail in Yosemite Friday – gusts as high as 40 mph** Update: Flash flood warning active for San Bernardino County until early Friday **Update: Flash flood warning active for San Bernardino County until early Friday** **Update: Flash flood warning active for San Bernardino County until early Friday** 2025 June 5 SubscribeSign Up For Newsletterse-EditionBreaking News Sign Up For Newsletters e-Edition Breaking News Sign Up For Newsletters e-Edition Breaking News Contact UsCorrectionsWork With UsNewspapers in EducationDaily Facts Store Corrections Work With Us Newspapers in Education Daily Facts Store Corrections Work With Us Newspapers in Education Daily Facts Store About Redlands Daily FactsAbout Southern California News GroupMediaNews GroupPartnersLocal Job BoardLive Traffic MapPrivacy PolicyAccessibilityNews ArchiveReader’s Choice About Southern California News Group MediaNews Group Partners Local Job Board Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice About Southern California News Group MediaNews Group Partners Local Job Board Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice MarketplaceClassifiedLegalsObituary Classified Legals Obituary Classified Legals Obituary Advertising SolutionsGet in Touch with a Marketing StrategistRequest Media KitCreative ServicesContent Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Reader RewardsPhoto ReprintsSponsored AccessSponsor a Student Photo Reprints Sponsored Access Sponsor a Student Photo Reprints Sponsored Access Sponsor a Student Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}