{"id": 2064, "name": "KKOB - 96.3 - Albuquerque", "domain": "newsradiokkob.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.newsradiokkob.com/news/us-companies-warn-of-multibillion-dollar-setbacks-amid-trade-war/", "title": "Us Companies Warn Of Multibillion Dollar Setbacks Amid Trade War", "content": "ShowsBob Clark M-F 5A-10AVince Coglianese M-F 10A-1PBrandon Vogt M-F 1P-3PTJ Trout M-F 3P-6PEric Strauss M-F 6P-8PMark Levin M-F 8P-11PTerry Travis S-S 7A-10AGarden Talk – Jericho NurseryFull Lineup Bob Clark M-F 5A-10A Vince Coglianese M-F 10A-1P Brandon Vogt M-F 1P-3P TJ Trout M-F 3P-6P Eric Strauss M-F 6P-8P Mark Levin M-F 8P-11P Terry Travis S-S 7A-10A Garden Talk – Jericho Nursery Full Lineup Bob Clark M-F 5A-10A Vince Coglianese M-F 10A-1P Brandon Vogt M-F 1P-3P TJ Trout M-F 3P-6P Eric Strauss M-F 6P-8P Mark Levin M-F 8P-11P Terry Travis S-S 7A-10A Garden Talk – Jericho Nursery Full Lineup NewsLocalNews TeamEmail KKOB News Room Local News Team Email KKOB News Room Local News Team Email KKOB News Room Contests Community Listen & ConnectPodcastsEmail KKOB News RoomStation Information Podcasts Email KKOB News Room Station Information Podcasts Email KKOB News Room Station Information Advertise With UsRADIO + DIGITAL RADIO + DIGITAL RADIO + DIGITAL Sweet Deals **US Companies Warn of Multibillion-Dollar Setbacks Amid Trade War** American companies are voicing concern over the escalating tariffs issued by the Trump administration to China. The Hill reported that American companies are warning of multibillion-dollar losses and deep uncertainty. United Airlines issued two separate financial outlooks, citing the unpredictable nature of the current economic climate. The company said it was “impossible to predict” whether the U.S. could slide into a recession as a result of the ongoing reciprocal tariffs. Johnson & Johnson CEO Joaquin Duato voiced his concern over the potential for new tariffs on pharmaceuticals, warning that such measures could disrupt the medical supply chain. Read more at Newsmax© 2025 Newsmax. All rights reserved. **Free Apps** Privacy Policy Terms of Service General Contest Rules Contest Rules Advertise With Us Station Information Employment Opportunities EEO Report EEO Public File Report AM EEO Public File Report FM FCC Public File – KKOB-FM FCC Public File KKOB-AM FCC Applications Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}