{"id": 683, "name": "InsideClimate News", "domain": "insideclimatenews.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://insideclimatenews.org/news/05062025/global-scientific-community-urges-world-leaders-to-transform-research-into-policy-ahead-of-un-ocean-conference/", "title": "Global Scientific Community Urges World Leaders To Transform Research Into Policy Ahead Of Un Ocean Conference", "content": "Science Politics Justice & Health Fossil Fuels Clean Energy ICN Local Projects About Us **Search** Science Politics Justice & Health Fossil Fuels Clean Energy ICN Local Projects About Us Newsletters Contact Us **Topics** Activism Arctic Biodiversity & Conservation Business & Finance Climate Law & Liability Climate Treaties Denial & Misinformation Environment & Health Extreme Weather Food & Agriculture Fracking Nuclear Pipelines Plastics Regulation Super-Pollutants Water/Drought Wildfires **Information** About Job Openings Reporting Network Whistleblowers Memberships Ways to Give Fellows & Fellowships **Publications** E-Books Documents **Politics** **Global Scientific Community Urges World Leaders to Transform Research Into Policy Ahead of UN Ocean Conference** **At the One Ocean Science Congress, scientists offer ten key recommendations for protecting and restoring marine ecosystems suffering from climate change, biodiversity loss and pollution.** **Share this article** Republish **Related** Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change **Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change** **Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change** **Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change** A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten **A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten** **A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten** **A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten** As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs **As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs** **As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs** **As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs** **Share this article** Republish **Most Popular** Rockaway is a New York Coastal Community Trying to Fight Erosion–and Then EPA Cancelled Funding Gila River Tribes Intend to Float Solar Panels on a Reservoir. Could the Technology Help the Colorado River? As an Eastern Iowa Quarry Seeks to Quadruple Its Water Use, Residents Urge the State to Intervene NICE, France—As world leaders prepare to attend the third U.N. Ocean Conference here next week, scientists are urging them to take action to combat a dual climate and biodiversity crisis plaguing marine ecosystems, and base their decisions on the best available science. To guide them, the International Scientific Committee of the One Ocean Science Congress unveiled alist of comprehensive recommendationsfor ocean recovery its members hope can be transformed into actionable policy. “We say, act where science is clear,” said François Houllier, a member of the committee and president and managing director of Ifremar, a French ocean research institute that co-organized the scientific summit. The 18-member committee spent the last year developing the list of recommendations and included insights from some of the 2,000 scientists in attendance at the four-day congress in the French Riviera. **We’re hiring!** Please take a look at the new openings in our newsroom. “This is our responsibility to clearly tell what we know,” said Houllier. The list of recommendations are organized around 10 topics that will be discussed during next week’s conference, which will be co-hosted by France and Costa Rica and bring together not only heads of state and government, but also financial institutions, NGOs, civil society groups, Indigenous peoples and philanthropists. The main objective of the summit will be to implement one of the U.N.’s 17 sustainable development goals—Goal 14 or Life Below Water—aimed at managing the conservation and sustainable use of oceans, marine biodiversity and resources. Historically, many scientists at the congress said, this goal has been overlooked and underfunded. On average, nations dedicate less than 2 percent of their research budgets to ocean science, which is significantly less than what they spend on other areas of research,according to UNESCO. But they’re paying the price. The global ocean is warming at an alarming rate. Coral reefs, which support more than 25 percent of all marine life, are bleaching en masse due to repeated and long-lasting marine heatwaves. Overfishing and illegal fishing are contributing to fish stock declines, particularly in some of the most populated parts of the world that depend on seafood as a main source of protein. As temperatures continue to rise, so do sea levels and the intensity of more frequent catastrophic storms. “You cannot deal with the crisis of the climate without also dealing with the crisis of the ocean and vice versa,”said John Kerry, the former U.S. secretary of state, during a live-streamed video speech he gave Thursday to scientists. The ten recommendations made by the congress address both. Some reiterate what scientists have been calling for for decades— a “strong and urgent phase out of fossil fuel use” in order to achieve the goals of the Paris Climate Agreement, for instance. Efforts to end marine plastic pollution entangling sea turtles, whales and other marine species must be made by investing in new technologies that can produce alternatives to plastic. Recently, some companies have begun to use seaweed for such purposes, said Houllier. Likewise, governments should end illicit, unreported and unregulated fishing by eliminating harmful government subsidies that incentivise overfishing in international waters. “Many nations are subsidizing the fishing industry, which leads to too large a number of boats,” said Jean-Pierre Gattuso, an oceanographer and research director of the National Centre for Scientific Research (CNRS), a French organization that co-organized the congress with Ifremar. He is also a member of the scientific committee that developed the recommendations. While the fishing industry has grown significantly since 1950, he said, “there is no increase in the amount of fish that is available.” The first recommendation promotes a newer and more inclusive marine conservation approach by encouraging a shift from humanity’s extractive relationship with the sea to one that promotes “responsibility, respect and reverence,” according to the first recommendation titled “Inspiring Ocean Stewardship.” **Inspiring Ocean Stewardship** To do this, the list of recommendations recognizes the importance of integrating Indigenous and other traditional knowledge systems in marine policy and encouraging their collaboration with scientists. It also recognizes the intrinsic rights of marine life and states: “We advocate for legal personhood initiatives for marine ecosystems to advance conservation and raise awareness.” **This story is funded by readers like you.** Our nonprofit newsroom provides award-winning climate coverage free of charge and advertising. We rely on donations from readers like you to keep going. Please donate now to support our work. Other recommendations promote a precautionary and equitable approach to utilizing marine resources. The fourth recommendation asks leaders to pause harmful activities in the deep ocean such as oil and gas extraction, deep sea mining and destructive fishing practices like bottom trawling. Instead, it suggests more robust efforts be made to understand deep ecosystems better through vigorous research in this largely unexplored realm. **Proceeding With Caution** The second recommendation aimed at promoting safe and equitable ocean-based climate solutions encourages decision makers to explore marine carbon dioxide removal from the ocean with caution. “It is a hot topic because there is an urgency to decrease the amount of CO2 in the atmosphere,” said Gatusso. “All eyes are turning to the ocean,” as sequestration of carbon on land proves difficult. Capturing and storing carbon dioxide in the ocean relies on various techniques, including cultivating or sinking seaweed, ocean alkalinity enhancement and nutrient fertilization. Some estimates, according to the World Resources Institute, show that billions of tons of carbon could be stored in the ocean each year by midcentury. “There are also some risks,” said Houllier. “Here we say, please let us continue to do research before taking decisions that could be harmful.” **About This Story** Perhaps you noticed: This story, like all the news we publish, is free to read. That’s because Inside Climate News is a 501c3 nonprofit organization. We do not charge a subscription fee, lock our news behind a paywall, or clutter our website with ads. We make our news on climate and the environment freely available to you and anyone who wants it. That’s not all. We also share our news for free with scores of other media organizations around the country. Many of them can’t afford to do environmental journalism of their own. We’ve built bureaus from coast to coast to report local stories, collaborate with local newsrooms and co-publish articles so that this vital work is shared as widely as possible. Two of us launched ICN in 2007. Six years later we earned a Pulitzer Prize for National Reporting, and now we run the oldest and largest dedicated climate newsroom in the nation. We tell the story in all its complexity. We hold polluters accountable. We expose environmental injustice. We debunk misinformation. We scrutinize solutions and inspire action. Donations from readers like you fund every aspect of what we do. If you don’t already, will you support our ongoing work, our reporting on the biggest crisis facing our planet, and help us reach even more readers in more places? Please take a moment to make a tax-deductible donation. Every one of them makes a difference. Thank you, David SassoonFounder and Publisher Vernon LoebExecutive Editor **Share this article** Republish **Teresa Tomassoni** Teresa Tomassoni is an environmental journalist covering the intersections between oceans, climate change, coastal communities and wildlife for Inside Climate News. Her previous work has appeared in The Washington Post, NPR, NBC Latino and the Smithsonian American Indian Magazine. Teresa holds a graduate degree in Journalism from the Craig Newmark Graduate School of Journalism. She is also a recipient of the Stone & Holt Weeks Social Justice Reporting Fellowship. In addition to reporting on oceans, Teresa teaches climate solutions reporting for The School of the New York Times. [email protected] **Newsletters** We deliver climate news to your inbox like nobody else. Every day or once a week, our original stories and digest of the web's top headlines deliver the full story, for free. ICN Weekly Inside Clean Energy Today's Climate Breaking News ICN Sunday Morning Justice & Health I agree to theterms of service and privacy policy. **Related** **Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change** **By Teresa Tomassoni** **Top Ocean Experts Sound the Alarm Over Growing Marine Crisis Due To Climate Change** **By Teresa Tomassoni** **A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten** **By Kiley Price** **A Seabird Chick With 778 Pieces of Plastic in Its Body Shows How Bad Marine Pollution Has Gotten** **By Kiley Price** **As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs** **By Bob Berwyn** **As NOAA Cuts Continue, Ocean Researchers Worry About Monitoring Programs** **By Bob Berwyn** **Most Popular** **Rockaway is a New York Coastal Community Trying to Fight Erosion–and Then EPA Cancelled Funding** **By Lauren Dalban** **Rockaway is a New York Coastal Community Trying to Fight Erosion–and Then EPA Cancelled Funding** **By Lauren Dalban** **Gila River Tribes Intend to Float Solar Panels on a Reservoir. Could the Technology Help the Colorado River?** **By Jake Bolster** **Gila River Tribes Intend to Float Solar Panels on a Reservoir. Could the Technology Help the Colorado River?** **By Jake Bolster** **As an Eastern Iowa Quarry Seeks to Quadruple Its Water Use, Residents Urge the State to Intervene** **By Anika Jane Beamer** **As an Eastern Iowa Quarry Seeks to Quadruple Its Water Use, Residents Urge the State to Intervene** **By Anika Jane Beamer** **Politics** The Trump administration has long touted the downsizing and elimination of national monuments, and a legal opinion from the Department of Justice argues that the president has the power to do that. By Wyatt Myskow The Trump administration has long touted the downsizing and elimination of national monuments, and a legal opinion from the Department of Justice argues that the president has the power to do that. By Wyatt Myskow **Keep Environmental Journalism Alive** ICN provides award-winning climate coverage free of charge and advertising. We rely on donations from readers like you to keep going. Science Politics Justice & Health Fossil Fuels Clean Energy Home About Contact Us Whistleblowers Privacy Policy"}