{"id": 1527, "name": "Vaxopedia", "domain": "vaxopedia.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://vaxopedia.org/2025/05/19/the-novavax-covid-vaccine-has-been-approved/", "title": "The Novavax Covid Vaccine Has Been Approved", "content": "Home A-Z Index Blog CategoriesMenu ToggleVaxopediaHistory of VaccinesImmunization NewsImmunization SchedulesVaccine AdvocatesVaccine EducationVaccine Fact CheckVaccine IngredientsAnti-Vaccine PropagandaVaccine Preventable DiseasesVaccine SafetyVaccine Side EffectsVaccines Vaxopedia History of Vaccines Immunization News Immunization Schedules Vaccine Advocates Vaccine Education Vaccine Fact Check Vaccine Ingredients Anti-Vaccine Propaganda Vaccine Preventable Diseases Vaccine Safety Vaccine Side Effects Vaccines Vaxopedia History of Vaccines Immunization News Immunization Schedules Vaccine Advocates Vaccine Education Vaccine Fact Check Vaccine Ingredients Anti-Vaccine Propaganda Vaccine Preventable Diseases Vaccine Safety Vaccine Side Effects Vaccines About Contact **The Novavax COVID Vaccine Has Been Approved** Good news everybody! The FDA has approved Nuvaxovid, the non-mRNA COVID vaccine from Novavax. That doesn’t necessarily mean that everyone is going to be able to get this COVID vaccine though. **The Novavax COVID Vaccine Has Been Approved** Unlike other COVID vaccines, the FDA approval for Nuvaxovid is limited to: adults 65 years and older individuals 12 through 64 years who have at least one underlying condition that puts them at high risk for severe outcomes from COVID-19 While unusual for a COVID vaccine, these restrictions may not be as big a deal as some people might think though. Why not? There is a good chance that the folks at ACIP were going to switch to a non-universal recommendation for COVID vaccines soon. A non-universal recommendation that would mean certain high-risk age groups and those with certain high-risk conditions should still get a vaccine. And of course, the other big thing that makes the FDA limitations a bit of a non-factor is that the great majority of people have at least one condition that puts them at risk for severe COVID! What kind of conditions? In general, condition that put people at risk for severe COVID can include asthma, diabetes, and being immunosuppressed, etc. “Diversity in vaccine production helps increase the number of patients vaccinated,” says Dr. Florescu. “Some might not accept mRNA vaccines, while others may be allergic to certain ingredients.” And that means that most people will be able to get the newly approved Nuvaxovid, the non-mRNA COVID vaccine from Novavax if they want it. “The Novavax vaccine is the only non-mRNA updated COVID vaccine that has been available in the U.S. This vaccine is a protein adjuvant that had a 90% efficacy in its clinical trial, performing almost as well as the mRNA vaccines in their early trials. It is simpler to make than some of the other vaccines and can be stored in a refrigerator, making it easier to distribute.” A vaccine that had already been approved for emergency use and has been preferred by some who believe it causes fewer side effects than other COVID vaccines. **More on COVID Vaccines** Do COVID Vaccines Cause Bell’s Palsy? Did the Head of Pfizer Research Say the COVID Vaccine is Female Sterilization? The New Normal – Blame Everything On COVID Vaccines Did Over 80 Percent of Pregnant Women in the Pfizer Vaccine Trial Have a Miscarriage? Is Canada Testing Aerosol COVID Vaccines That Can Be Delivered With Crop Dusters? How Many People Have Died After Listening to Bad Advice About COVID? FDA–NUVAXOVID Use of 2025–2026 COVID-19 Vaccines: Work Group Considerations Novavax has a good COVID-19 vaccine. How good is it? A very deep dive. Should you pick Novavax’s COVID-19 shot over mRNA options? Comparing the COVID-19 Vaccines: How Are They Different? Novavax says its COVID vaccine produces fewer, milder reactions than Pfizer version Is the Novavax COVID Vaccine Better Than mRNA Vaccines? What We Know So Far Moths and tree bark: How the Novavax vaccine works Last Updated on May 19, 2025 **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to share on Tumblr (Opens in new window)Tumblr Click to share on WhatsApp (Opens in new window)WhatsApp **Like this:** **Related** **Follow Vaxopedia via Email** Enter your email address to follow Vaxopedia and receive notifications of new posts by email. Email Address Follow Vaxopedia **What’s New?** The North American Measles Outbreak of 2025 The Novavax COVID Vaccine Has Been Approved Measles Protection Questions and Answers Polio and the Xavante Indians of Brazil What Has Casey Means Said About Vaccines? What Has Vinay Prasad Said About Vaccines? How to Test Someone Who Might Have Measles **StopAntiVaxPropaganda** RSS - Posts A Baby With Congenital Measles Has Died in Canada Has the CDC Issued New Measles Travel Warnings? More Calls for Secretary RFK Jr to Resign or be Fired The CDC Moves to Shared Decision-Making on COVID Vaccines for Kids Roman Bystrianyk is Trying to Rewrite the History of Measles **Search Vaxopedia** **Categories** **Vaccines Work** **Follow me on Twitter** **Translate** **** **** You must belogged into post a comment. ****"}