{"id": 724, "name": "Le Journal de Montreal", "domain": "journaldemontreal.com", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.journaldemontreal.com/2025/06/11/greve-inadmissible-de-la-stm-linterruption-du-transport-en-commun-paralyse-des-vies-familiales-declare-le-ministre-jean-boulet", "title": "Greve Inadmissible De La Stm Linterruption Du Transport En Commun Paralyse Des Vies Familiales Declare Le Ministre Jean Boulet", "content": "Sections Infolettres S’abonner TARIFS DOUANIERS ACTUALITÉSJustice et faits diversCOVID-19PolitiqueSantéÉducationTransportsEnvironnementConsommationSociétéÉlections FédéralesACTUALITÉSJustice et faits diversCOVID-19PolitiqueSantéÉducationTransportsEnvironnementConsommationSociétéÉlections Fédérales Justice et faits divers COVID-19 Politique Santé Éducation Transports Environnement Consommation Société Élections Fédérales Justice et faits divers COVID-19 Politique Santé Éducation Transports Environnement Consommation Société Élections Fédérales Justice et faits divers COVID-19 Politique Santé Éducation Transports Environnement Consommation Société Élections Fédérales Justice et faits divers COVID-19 Politique Santé Éducation Transports Environnement Consommation Société Élections Fédérales OPINIONSChroniqueursFaites la différencePerspectiveCaricaturesOPINIONSChroniqueursFaites la différencePerspectiveCaricatures Chroniqueurs Faites la différence Perspective Caricatures Chroniqueurs Faites la différence Perspective Caricatures Chroniqueurs Faites la différence Perspective Caricatures Chroniqueurs Faites la différence Perspective Caricatures ARGENTOpinionsFinances personnellesEmploisOù vont vos impôtsEntreprisesBourseMarché immobilierTarifs douaniersARGENTOpinionsFinances personnellesEmploisOù vont vos impôtsEntreprisesBourseMarché immobilierTarifs douaniers Opinions Finances personnelles Emplois Où vont vos impôts Entreprises Bourse Marché immobilier Tarifs douaniers Opinions Finances personnelles Emplois Où vont vos impôts Entreprises Bourse Marché immobilier Tarifs douaniers Opinions Finances personnelles Emplois Où vont vos impôts Entreprises Bourse Marché immobilier Tarifs douaniers Opinions Finances personnelles Emplois Où vont vos impôts Entreprises Bourse Marché immobilier Tarifs douaniers SPORTSOpinionsCanadienHockeyTennisSoccerCF MontréalBaseballFootballAlouettesCombatsCourse automobileGolfBasketballChasse et pêcheAutres sportsSPORTSOpinionsCanadienHockeyTennisSoccerCF MontréalBaseballFootballAlouettesCombatsCourse automobileGolfBasketballChasse et pêcheAutres sports Opinions Canadien Hockey Tennis Soccer CF Montréal Baseball Football Alouettes Combats Course automobile Golf Basketball Chasse et pêche Autres sports Opinions Canadien Hockey Tennis Soccer CF Montréal Baseball Football Alouettes Combats Course automobile Golf Basketball Chasse et pêche Autres sports Opinions Canadien Hockey Tennis Soccer CF Montréal Baseball Football Alouettes Combats Course automobile Golf Basketball Chasse et pêche Autres sports Opinions Canadien Hockey Tennis Soccer CF Montréal Baseball Football Alouettes Combats Course automobile Golf Basketball Chasse et pêche Autres sports MONDEOpinionsGuerre en UkraineÉtats-UnisAmériquesEuropeMoyen-OrientAsie-PacifiqueAfriqueMONDEOpinionsGuerre en UkraineÉtats-UnisAmériquesEuropeMoyen-OrientAsie-PacifiqueAfrique Opinions Guerre en Ukraine États-Unis Amériques Europe Moyen-Orient Asie-Pacifique Afrique Opinions Guerre en Ukraine États-Unis Amériques Europe Moyen-Orient Asie-Pacifique Afrique Opinions Guerre en Ukraine États-Unis Amériques Europe Moyen-Orient Asie-Pacifique Afrique Opinions Guerre en Ukraine États-Unis Amériques Europe Moyen-Orient Asie-Pacifique Afrique BUREAU D'ENQUÊTE SPECTACLESOpinionsStar AcadémieCinémaTélévisionMusiqueThéâtreHumourVedettesPlateformes NumériquesLivresSPECTACLESOpinionsStar AcadémieCinémaTélévisionMusiqueThéâtreHumourVedettesPlateformes NumériquesLivres Opinions Star Académie Cinéma Télévision Musique Théâtre Humour Vedettes Plateformes Numériques Livres Opinions Star Académie Cinéma Télévision Musique Théâtre Humour Vedettes Plateformes Numériques Livres Opinions Star Académie Cinéma Télévision Musique Théâtre Humour Vedettes Plateformes Numériques Livres Opinions Star Académie Cinéma Télévision Musique Théâtre Humour Vedettes Plateformes Numériques Livres STYLES DE VIESantéMode et beautéSexualitéPsychoCuisineFamilleSortirTechnoLivresChez soiSTYLES DE VIESantéMode et beautéSexualitéPsychoCuisineFamilleSortirTechnoLivresChez soi Santé Mode et beauté Sexualité Psycho Cuisine Famille Sortir Techno Livres Chez soi Santé Mode et beauté Sexualité Psycho Cuisine Famille Sortir Techno Livres Chez soi Santé Mode et beauté Sexualité Psycho Cuisine Famille Sortir Techno Livres Chez soi Santé Mode et beauté Sexualité Psycho Cuisine Famille Sortir Techno Livres Chez soi VOYAGESQuébecCanadaÉtats-UnisMexique et CaraïbesEuropeConseilsTout inclusAutres destinationsVOYAGESQuébecCanadaÉtats-UnisMexique et CaraïbesEuropeConseilsTout inclusAutres destinations Québec Canada États-Unis Mexique et Caraïbes Europe Conseils Tout inclus Autres destinations Québec Canada États-Unis Mexique et Caraïbes Europe Conseils Tout inclus Autres destinations Québec Canada États-Unis Mexique et Caraïbes Europe Conseils Tout inclus Autres destinations Québec Canada États-Unis Mexique et Caraïbes Europe Conseils Tout inclus Autres destinations EN 5 MINUTES AUTOOpinionsActualitésEssaisOccasionÉlectriquesAUTOOpinionsActualitésEssaisOccasionÉlectriques Opinions Actualités Essais Occasion Électriques Opinions Actualités Essais Occasion Électriques Opinions Actualités Essais Occasion Électriques Opinions Actualités Essais Occasion Électriques MAISON MOTS CROISÉS Dossiers thématiquesDossiers thématiques Dossiers thématiques Dossiers thématiques Dossiers thématiques Dossiers thématiques INFOLETTRES CIRCULAIRES PlusOUTILS INTERACTIFSHOROSCOPEDÉCÈSAVIS LÉGAUXCONCOURSPlusOUTILS INTERACTIFSHOROSCOPEDÉCÈSAVIS LÉGAUXCONCOURS OUTILS INTERACTIFS HOROSCOPE DÉCÈS AVIS LÉGAUX CONCOURS OUTILS INTERACTIFS HOROSCOPE DÉCÈS AVIS LÉGAUX CONCOURS OUTILS INTERACTIFS HOROSCOPE DÉCÈS AVIS LÉGAUX CONCOURS OUTILS INTERACTIFS HOROSCOPE DÉCÈS AVIS LÉGAUX CONCOURS Actualités Société **Grève à la STM: les deux parties acceptent l'offre de médiation du ministre Jean Boulet** Mercredi, 11 juin 2025 10:21 MISE À JOURMercredi, 11 juin 2025 10:35 À la troisième journée de grève, la Société de transport de Montréal (STM) et la Confédération des syndicats nationaux (CSN) ont accepté mercredi la proposition du ministre du Travail, Jean Boulet, de nommer un médiateur pour accélérer les pourparlers. • À lire aussi:Voici pourquoi la grève à la STM est interrompue pendant le Grand Prix, mais pas quand on travaille • À lire aussi:Grève à la STM: «Ils devraient négocier tous les jours», selon un ex-syndicaliste • À lire aussi:Grève à la STM: «Le monde qui gagne 100 000$ par année prend en otage ceux qui en gagnent 35 000$» Le médiateur aura pour mandat de «rétablir un dialogue propice à la négociation» et d’«apaiser la tension entre les deux parties», a écrit le ministre, dans une publication sur le réseau social X. Celui qui occupera le rôle de médiateur est Gaston Boutin, a confirmé l'attachée de presse de Jean Boulet. Grève des employés d’entretien de la STM : les parties ont accepté ma proposition et j’ai nommé un médiateur ce matin.Celui-ci aura pour mandat de rétablir un dialogue propice à la négociation, ainsi que d’apaiser les tensions entre les parties.J’encourage les représentants… La directrice générale de la STM, Marie-Claude Léonard, a indiqué, par voie de communiqué, que l’entente conclue entre les deux parties est «un pas dans la bonne direction». «Toutefois, nous ne sommes pas à une rencontre près pour arriver à une résolution, a-t-elle ajouté. Il reste encore du chemin à faire.» «Il faut que ça débloque», a insisté le ministre Jean Boulet, en entrevue mercredi matin à l'émissionLe Québec Matinà LCN, avant que les deux parties acceptent la proposition. «On accélère les pourparlers de renouvellement de la convention collective de travail, puis il faut apaiser les tensions», a-t-il poursuivi. Jean Boulet s'est dit profondément préoccupé par les conséquences sociales de ce conflit. À ses yeux, le transport en commun à Montréal est un service «essentiel» pour assurer la sécurité sociale et économique, dont l'interruption entraîne des répercussions majeures. «Paralyser le transport commun à Montréal, c'est paralyser bien des vies familiales et bien des vies d'étudiants en cette fin d'année scolaire», a affirmé le ministre du Travail. «C'est le cœur de nos déplacements, de l'accès à différents services, puis ça bouleverse des planifications familiales, ça engendre une réorganisation qui est extrêmement inquiétante pour les familles et les personnes qui vivent à Montréal.» • Regardez aussi ce podcast vidéo tiré de l'émission d’Isabelle Maréchal, diffusée sur les plateformesQUBet simultanément sur le 99.5 FM Montréal : M. Boulet a estimé qu'un médiateur pourrait jouer un rôle crucial pour sortir de l'impasse actuelle. «Le médiateur, c'est une personne qui est patiente, qui va accompagner les parties puis qui va les aider à embarquer dans un processus de recherche de solutions», a précisé le ministre. Le ministre a qualifié la situation d'«inadmissible», compte tenu de l'état des négociations, qui stagnent depuis l'échéance de la convention collective en janvier. Jean Boulet a insisté de nouveau sur l'impact disproportionné de cette grève sur la population. «On ne peut pas prendre la population en otage, a-t-il souligné. On ne peut pas affecter les besoins fondamentaux de personnes qui doivent aller au travail, à l'école ou chez un professionnel de la santé. Il y a tellement de réalités humaines qui s'additionnent, ce n'est pas acceptable». Les rencontres entre la STM et le syndicat des employés de l'entretien se poursuivent. Voyez l'entrevue complète avec Jean Boulet ci-dessus. Vous devez être connecté pour commenter.Se connecter Bienvenue dans la section commentaires! Notre objectif est de créer un espace pour un discours réfléchi et productif. En publiant un commentaire, vous acceptez de vous conformer auxConditions d'utilisation."}