{"id": 755, "name": "Kilgore News Herald", "domain": "kilgorenewsherald.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kilgorenewsherald.com/newspaperads/service/knh-breaking-news-e-edition/pdfdisplayad_a0748a7b-e511-5441-959e-1d6c60945b2d.html", "title": "Knh Breaking News E Edition", "content": "Activate Subscribe My Account Logout Login/Register Subscribe Local Weather Submission Forms Contact Us Terms of Use Privacy Policy Local News Police, Fire & Arrests Schools State/Natl/World News Business Photos/Videos ET Varsity Advice Entertainment Religion Card of Thanks Death Notices In Memoriam Place An Ad Jobs Business Directory Legal Notices Celebrations Letters to the Editor Editorials Columnists Blogs My Account e-Edition Newsletters Readers Choice Site searchSearch Site searchSearch Site searchSearch Facebook Contact Us e-Edition Subscribe Archives Activate Subscribe My Account Logout Login/Register 74°CloudyKilgore, TX(75662)TodayThunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%..TonightRain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 12:54 pmFull Forecast Kilgore, TX(75662)TodayThunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%..TonightRain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 12:54 pm Thunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%.. Rain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 12:54 pm Full Forecast Kilgore, TX(75662)TodayThunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%..TonightRain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%.Updated: June 11, 2025 @ 12:54 pm Thunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%.. Rain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 12:54 pm Thunderstorms. Storms may contain strong gusty winds. High 77F. Winds ESE at 5 to 10 mph. Chance of rain 100%.. Rain showers in the evening with thunderstorms developing overnight. Low 69F. Winds SE at 5 to 10 mph. Chance of rain 100%. Updated: June 11, 2025 @ 12:54 pm Full Forecast Site searchSearch Site searchSearch Site searchSearch Newsletter Signups HomeSubscribeLocal WeatherSubmission FormsContact UsTerms of UsePrivacy Policy Subscribe Local Weather Submission Forms Contact Us Terms of Use Privacy Policy Subscribe Local Weather Submission Forms Contact Us Terms of Use Privacy Policy NewsLocal NewsPolice, Fire & ArrestsSchoolsState/Natl/World NewsBusinessThe StreetPhotos/VideosPhotosGalleriesVideos Local News Police, Fire & Arrests Schools State/Natl/World News BusinessThe Street The Street Photos/VideosPhotosGalleriesVideos Photos Galleries Videos Local News Police, Fire & Arrests Schools State/Natl/World News BusinessThe Street The Street The Street Photos/VideosPhotosGalleriesVideos Photos Galleries Videos Photos Galleries Videos SportsET Varsity ET Varsity ET Varsity FeaturesAdviceEntertainmentReligion Advice Entertainment Religion Advice Entertainment Religion ObitsCard of ThanksDeath NoticesIn Memoriam Card of Thanks Death Notices In Memoriam Card of Thanks Death Notices In Memoriam Classifieds/AdvertisingPlace An AdJobsBusiness DirectoryLegal Notices Place An Ad Jobs Business Directory Legal Notices Place An Ad Jobs Business Directory Legal Notices EventsCelebrationsAnniversariesBirthsEngagementsWeddings CelebrationsAnniversariesBirthsEngagementsWeddings Anniversaries Births Engagements Weddings CelebrationsAnniversariesBirthsEngagementsWeddings Anniversaries Births Engagements Weddings Anniversaries Births Engagements Weddings OpinionLetters to the EditorEditorialsColumnistsBlogs Letters to the Editor Editorials Columnists Blogs Letters to the Editor Editorials Columnists Blogs SubscriberMy Accounte-EditionNewsletters My Account e-Edition Newsletters My Account e-Edition Newsletters ContestsReaders Choice Readers Choice Readers Choice ETX View **Weather Alert** **Flash Flood Warning from WED 12:04 PM CDT until WED 3:00 PM CDT** **Flash Flood Warning from WED 12:04 PM CDT until WED 3:00 PM CDT** **River Flood Warning from WED 8:09 PM CDT until SUN 4:00 AM CDT** **River Flood Warning from WED 8:09 PM CDT until SUN 4:00 AM CDT** **Flood Watch from WED 7:00 AM CDT until THU 7:00 PM CDT** **Flood Watch from WED 7:00 AM CDT until THU 7:00 PM CDT** **KNH Breaking News e-Edition** Facebook Twitter WhatsApp SMS Email Print Copy article link **Details forKNH Breaking News e-Edition** 13 hrs ago Service **Subscription Help?** Articles Images Videos Commented Kilgore's new health inspector cleaning up the city Marlin (Red) Lee Harris, Sr. City approves additional downtown infrastructure upgrades Kilgore judge nears four decades of service FCA All-Star games set for weekend Kilgore’s strategic grant wins fast-track downtown improvements Kilgore council discusses bridge repair options Kilgoround: Farmer's market returns downtown on Saturdays through July Carmen Sue Yoachum Camp Minister's Moment: The pope’s being ‘black’ matters less than Jesus’s being human Sorry, there are no recent results for popular videos. William Ronny Temple(1) **EVENTS** **LATEST e-EDITION** **Newspaper Ads** News Sports Obituaries Opinion Celebrations Multimedia Online Features Local Events Promote an Event Classifieds Place an Ad Submission Forms Business Directory Email Alerts Search Weather Subscribe Facebook Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}