{"id": 1360, "name": "The Bureau of Investigative Journalism", "domain": "thebureauinvestigates.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thebureauinvestigates.com/stories/2024-11-22/nadim-zahawi-mohamed-al-fayed-and-ampika-pickston-all-the-silenced-stories-raised-in-slapps-debate", "title": "Nadim Zahawi Mohamed Al Fayed And Ampika Pickston All The Silenced Stories Raised In Slapps Debate", "content": "**Zahawi, Al-Fayed and Ampika Pickston: All the silenced stories** MPs used parliamentary privilege during the SLAPPs debate to reveal stories suppressed by legal threats We expose injustice and spark change. Help change the world by becoming a Bureau Insider PublishedNovember 22 2024 ByEd Siddons,Josephine Lethbridge,Jasper Jackson,Chrissie Giles,Billie Gay Jackson TBIJ co-publishes its stories with major media outlets around the world so they reach as many people as possible. A sexual abuser; a wealthy businessman; a landlord “offering substandard and potentially dangerous accommodation to vulnerable people”; a “wealth creator”. All of them silenced scrutiny by using the threat of a lawsuit against their critics, a cross-party group of MPs argued in Parliament on Thursday. The debate wasprompted by the Bureau of Investigative Journalism’s (TBIJ) Silenced Stories project. TBIJ spent a year uncovering stories in the public interest that were suppressed because the UK’s legal system favours the rich and powerful, making it dangerous for people and publications with legitimate questions and scrutiny to speak up. TBIJ is not alleging that any individual or organisation breached any regulatory obligations or that any legal threats were abusive or meritless. Sometimes there was little in the way of a threat. Instead, TBIJ’s work highlighted the chilling effect the legal system has on scrutinising those in power. After a two-and-a-half hour debate in which more than a dozen MPs from seven parties raised concerns, Heidi Alexander, the justice minister, said the government would not bring any new legislation during this parliament. This was, she said, to avoid ending up with “unworkable legislation with unintended consequences”. However, she did acknowledge that abusive lawsuits “have a chilling effect on public interest journalism and pose a threat to our democracy”. TBIJ has not investigated the claims that led to the threats shared by MPs itself and doesn’t know whether the allegations made by the MPs are true. However, we believe there is a public interest in providing a fair and balanced reflection of the debate. TBIJ has only added further details, where it has more information, to provide balance. **Lloyd Hatton on scrutiny of a $500m development in Uzbekistan** Hatton talked about Professor Kristian Lasslett from Ulster University, who wrote an article foropenDemocracyraising concerns about a lucrative construction project in Uzbekistan. His research questioned why this project was costing hundreds of millions of dollars and raised concerns about due diligence procedures. His article focused on the links between the developers and a family sanctioned for corruption, the Guptas, who have been accused of systemic corruption in South Africa. Lasslett received a legal letter from a boutique law firm on behalf of the developers. It provided some meaningful information but also outright denied any relationship between the developers and the Guptas, despite clear evidence to the contrary.openDemocracydecided that the time and financial expense it would take to face down a deep-pocketed litigant would outweigh the benefits of publishing the story. “The public interest merits of this investigation are, in my view, undeniable,” said Hatton, “but this story was never published. The information it contains, linking potential procurement corruption to the looting of billions of dollars from South Africa’s state coffers was effectively blocked. The Uzbek people were denied and deprived this information that speaks directly to its government’s propriety in the award of enormous public contracts.” What are the next steps to end abusive libel actions? **Hatton on “threats” from lawyers working for the former chancellor Nadhim Zahawi** Hatton also said Dan Neidle, a tax lawyer and researcher, investigated whether Zahawi “was benefiting from tax codes that he had had a hand in shaping” and whether he had avoided almost £4m in capital gains tax. Neidle shared the allegations on Twitter, before receiving two letters from Zahawi’s lawyers demanding he retract the accusation. Instead of complying, Neidle published the letters. Hatton said: “It’s not just the odd former politician who uses legal threats to avoid scrutiny. Sadly Britain has become a go-to destination for lawfare tactics. Our courts have become the playground of the super wealthy. The UK is by far the most frequent country of origin for SLAPPs [strategic lawsuits against public participation].” **Julian Lewis on legal letters from the Post Office** Lewis cited the example ofComputer Weekly’s coverage of the Post Office Horizon scandal starting in 2009, during which the trade magazine’s investigation into the flawed prosecution of post masters suffered “multiple aggressive actions to shut down the story”. Lewis said the editor of the magazine, Bill Goodwin, is quoted as saying they received multiple “bullying letters” demanding to know sources. He added that the Post Office’s general counsel also wrote to the magazine in 2015, claiming an article reporting the closure of a working group looking into claims against the Horizon software included “ ‘significant number of inaccuracies’ and ‘damaging errors’ and argued that the reporters had acted improperly.” The Post Office has since apologised for the scandal and, Lewis said, committed to being transparent and supporting justice and redress for those who have been impacted by the scandal. **Apsana Begum on her own experiences of surviving domestic abuse** Begum described her own experience of lawfare as a survivor of domestic abuse, and the need to tackle the ability of abusers to “weaponise litigation”. She said “vexatious litigation” was used “with the purpose of shutting down my public participation as a democratically elected member of Parliament and as a survivor of domestic abuse”. She said she had been pursued in the courts by a local council, where her ex-husband was a councillor at the time, and that the authority has ended up spending more money on the case than the amount it alleged it was trying to recoup. The purpose of these types of proceedings, she said, “is to silence, intimate, discredit and further disempower” victims. **Begum on scrutiny of a children’s care home** Begum also described how Tom Latchem, a freelance journalist, faced legal threats after publishing a story withByline Times. The story was about Ofsted suspending a care home owned by Ampika Pickston, the fiancée of West Ham’s billionaire owner David Sullivan, “due to reported serious safeguarding failings”. Begum said that Latchem believes he has been prevented from reporting further on the care home, in particular an incident in which Ms Pickston allegedly took a child from the home to her private residence. He was sent a letter from Pickston’s lawyers warning that, if they considered anything defamatory or libellous in a published article, they would advise their client to sue both the newspaper and any individual author or journalist for libel, seeking damages and costs. The lawyers said the communications were courteous and cordial and did not prevent him from any reporting. However, Latchem feels he cannot afford to face down someone with such resources. “It is obvious who loses out if accountability and transparency on the treatment of children in care homes are thwarted,” Begum said. **Siân Berry about a citizen questioning a housing provider** Berry outlined the case of Ben Jenkins, a housing campaigner who faced multiple legal threats from the company he co-owns his home with, GreenSquareAccord, for repeatedly raising concerns over the safety and adequacy of his home. GreenSquareAccord said Jenkins’ criticism was excessive, targeted individual employees, and was so frequent it prevented them from responding to other residents’ issues. The battle with GSA had a “serious ongoing effect” on Jenkins’s mental health, Berry said. “Safety in housing completely depends upon maintaining good standards and public accountability,” she said. “Ultimately, that depends on this kind of whistleblowing.” She called on Alexander, the justice minister, to look at “abuses of legal proceedings” and the use of bullying lawfare, “where money and resources are used to shield the powerful from proper public scrutiny when they should be held to account”. SLAPPs thwarted attempts to stop Al-Fayed, says MP **Joe Powell on legal threats over sexual abuse allegations against Mohamed Al-Fayed** Powell highlighted Mohamed Al-Fayed’s legal threats to journalists who attempted to expose his alleged sexual misconduct. A BBC investigation this year aired multiple allegations of rape and sexual assault against the late Harrods owner. In 2008, the Mail on Sunday prepared a report stating that Al-Fayed was under investigation for sexually assaulting a 15-year-old, Powell said, adding that legal threats forced it to remove his name and refer instead to a “senior Harrods executive”. “[SLAPPs] don’t just protect reputations, they shield individuals from accountability and allow abuse to continue unchecked,” Powell said. “Al Fayed died before he could face justice. Imagine how many women’s lives would not have been ruined if anti-SLAPP legislation had been in place, and journalists had been able to report freely on the case.” **Rachel Gilmour on a “wealth creator’s” response to a woman whose brother had died by suicide** Gilmour raised the story of Carrie Jones, who lost her brother, Danny Butcher, an army reservist, to suicide in 2019. Butcher had spent thousands to attend a controversial “wealth creation” course run by Samuel Leeds. When Jones sought answers from Leeds after his death, including in a public video on Youtube, she ultimately received a legal letter from Ellisons, Leeds’ solicitors. “It did not immediately threaten her with a lawsuit, but it warned that legal action could follow if she suggested that Mr Leeds and his course had had any influence on her brother’s suicide,” Gilmour said. Gilmour saidTheGuardianfound 15 individuals who were subjected to legal threats from Leeds. She also highlighted one man, who wished to remain anonymous, who faced a legal threat from Leeds’ solicitors after posting on his MP’s social media page asking about protections for vulnerable people from wealth creation schemes. The individual did not even mention Leeds by name, Gilmour said. Leeds said this account was “one-sided, and misses important context, which we have no confidence you will fairly represent to fellow MPs”, adding that he has been the subject of a “campaign of abuse”. Gilmour concluded with a resounding plea for parliament to introduce anti-SLAPP protections, something she said was “desperately needed for this country, for our citizens, and indeed for our legal system”. **Seamus Logan on a woman forced out of work after alleging sexual assault** Logan shared the story of Jan Cruickshank, a constituent of his in Aberdeenshire North and Moray East. Cruickshank was allegedly sexually assaulted by a coworker at the Construction Industry Training Board (CITB) in 2015. After suffering from a nervous breakdown when she reported the allegations, Cruickshank had to confront her alleged attacker daily on returning to work. Logan described how CITB subjected her to a “targeted campaign to discredit” her after its legal team indicated it was potentially liable should her case come to trial. A predetermined HR investigation “focused on facilitating her exit from the company”, whistleblowers revealed. Her employment was terminated and she was pressured to accept a low settlement and asked to sign a non-disclosure agreement so she could not speak freely about the case. Logan called for a broader understanding of SLAPPs, emphasising the need for protective measures for individuals seeking justice. **Max Wilkinson on substandard housing for asylum seekers** Wilkinson revealed how an investigation into “substandard and potentially dangerous” housing for homeless people and asylum seekers was stifled by a threat of legal action from the taxpayer-funded landlord. Journalists fromInside Housingsaw a stain on the ceiling apparently caused by leaking sewage, a broken fire door, and damp that risked the health of the vulnerable people that lived there. “This clear case of public interest should have involved the naming of the landlords and the building. That would have enabled power to be held to account,” Wilkinson said. But threats of legal action forcedInside Housingto leave the building and landlord’s names out – meaning they escaped scrutiny and could still be receiving public money. “We do not know whether that landlord is still in receipt of public sector contracts, or whether they are still running buildings that are not fit for habitation, and there is no way for us to find out.” This story was amended on 2 December 2024 to clarify that MPs from seven parties attended the debate. Reporters: Ed Siddons, Josephine Lethbridge, Jasper Jackson, Chrissie Giles and Billie Gay JacksonEnablers Editor: Eleanor RoseDeputy editors: Chrissie Giles & Katie MarkEditor:Franz WildProduction editor: Frankie Goodway TBIJ has a number of funders, a full list of which can be found here. None of our funders have any influence over editorial decisions or output. Area:Money **Area:** Money **Area:** Money Subject:Press freedomJustice systemCorruptionUK government **Subject:** Press freedom Justice system Corruption UK government **Subject:** Press freedom Justice system Corruption UK government Ed investigates how the UK’s white-collar businesses facilitate oligarchs, dictators and organised criminals around the world Jasper has covered digital media and technology for more than a decade. He has previously worked for the New Statesman and the Guardian Chrissie was editor of the award-winning longform publication Mosaic before joining TBIJ as global health editor Billie is TBIJ’s first Bruce Page Fellow. She has a particular interest in migration and disinformation, and previously worked at The Week **More FromThe Enablers** The Bureau of Investigative JournalismPO Box 76421LondonEC2P 2SH Email:info@thebureauinvestigates.com This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Unported License. **Corporations** Binary Options Corporate Watch Fixed-Odds Betting Machines High Cost Credit High Frequency Trading Smoke Screen **Food and Drugs** Big Tobacco **Justice** Deaths in Police Custody Family Court Files Investigating Rape Joint Enterprise Rough Justice **Human Rights** CIA Torture Citizenship Revoked Drone Warfare Iraq War Logs Marikana Massacre Migration Crisis Privatised War Shadow Wars Surveillance State Trapped in work **PR and Spin** Fake News Lobbying’s Hidden Influence **State Scrutiny** Care Sector Europe Under Scrutiny Health Political Party Funding Public Sector Pay Royal Mail Rulers’ Riches Scrutinising Government Teaching The Enablers **Bureau Local** Local Stories Open Resources Cost of living crisis Domestic Violence Homelessness Is Work Working? Local Power The Housing Crisis The People’s Newsroom UK Elections"}