{"id": 1811, "name": "The Event Chronicle", "domain": "theeventchronicle.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://theeventchronicle.com/the-rothschild-bloodline-one-of-the-13-satanic-bloodlines-that-rule-the-world/", "title": "The Rothschild Bloodline One Of The 13 Satanic Bloodlines That Rule The World", "content": "Menu Home News Finance Health Science History Contact Us Sidebar Search for **The Rothschild Bloodline: One of the 13 Satanic Bloodlines that Rule the World** **The 13 Satanic Bloodlines that Rule the World** The concept of Illuminati bloodlines was popularized by Christian Illuminati researcher Fritz Springmeier in his book Bloodlines of the Illuminati. Springmeier utilizes the same elements common to all Illuminati conspiracies but adds his own spin: 13 generational Satanic bloodlines ruling all other elite groups and secret societies from the top of their pyramid of power. ALL members of the Illuminati are Satanists. ALL members of the Illuminati are subjected to trauma-based mind-control. ALL members of the Illuminati have Multiple Personality Disorder. When a member of an Illuminati bloodline reaches the age of 3, he or she is taken to meet an Illuminati Grande Mother, a high-level Satanic priestess. These meetings are held twice a year and are attended by all Illuminati families and their Mothers of Darkness. The Grande Mother examines and evaluates seven Illuminati children. If the child is worthy of entry into the Illuminati, he or she is assigned to one of the Illuminati bloodlines. For each approved child, another is sacrificed and his or her blood is used to write the name of the newly-approved Illuminati child. Fritz’s Illuminati structure looks like this: Sources? Fritz gets most of his information from ex-illuminati and ex-Satanists such as John Todd and others which he has personally deprogrammed. His book The Illuminati Formula Used to Create an Undetectable Total Mind Controlled Slave was written in cooperation with one such ex-illuminati victim, Cisco Wheeler. **The Rothschild Bloodline** When you research Illuminati conspiracies, one name continues to come up over and over: Rothschild. The sons of Mayer Amschel Rothschild established family banks in five key European countries, where they are said to have amassed enormous wealth by starting wars and selling weapons to both sides. It’s alleged that even now, Rothschild-controlled politicians make their decisions based on what’s good for the family, not the people. Two neighbor horse farmers came together one day to talk business. The first farmer sold his horse to the second for a quarter million dollars, and then bought it back for about $20 more. He could now advertise his horse (actually worth $20), as a horse he that he had paid over a quarter of a million dollars for. We can laugh over such schemes. And perhaps we should laugh at ourselves for having been fooled, for if there is one area in life that exceeds the religious in deception, and touches all of us it is the financial. What else can we do about it except laugh? The famous poet Lord Byron describes the archtype of our two farmers in 1823, Who keeps the world, both old and new, in pain Or pleasure? Who makes politics run glibber all? The shade of Bonaparte’s noble daring? Jew Rothschild and his fellow-Christian, Baring. You’ll learn about some other “neighbor horse traders” in this chapter too. **Rothschild Talks About Their Dynasty** Lord Rothschild in his book The Shadow of a Great Man quotes a letter sent from Davidson on June 24, 1814 to Nathan Rothschild, “As long as a house is like yours, and as long as you work together with your brothers, not a house in the world will be able to compete with you, to cause you harm or to take advantage of you, for together you can undertake and perform more than any house in the world.” (1) The closeness of the Rothschild brothers is seen in a letter from Saloman (Salmon) Rothschild to his brother Nathan on Feb. 28, 1815, “We are like the mechanism of a watch: each part is essential. (2) This closeness is further seen in that of the 18 marriages made by Mayer Amschel Rothschild’s grandchildren 16 were contracted between first cousins. **Visiting the Nation the Rothschild’s Built** In 1974, in the summer after the Yom Kippur War this Author toured Israel, and got the chance to personally visit many of the buildings like the Knesset that the Rothschild’s money has built. The Knesset is the Israeli equivalent to our Congress’s Capitol building. One of the Rothschilds in his will left money for ongoing building projects in Israel, and the Rothschilds are honored with a Street named after them in Jerusalem. The people of Germany and Turkey have been very close. I can recall meeting Turkish ,,Gastarbeiter” (guestworkers) in Germany. The reader will remember that Turkey fought on Germany’s side in W.W. I. A few powerful Jews, including the Rothschilds were responsible for the wording of the Treaty imposed on Germany that ended W.W. I (3) The treaty gave the Rothschilds the German owned railway rights in Palestine (which had been part of the Turkish Ottoman Empire), thus paving the way for the Rothschilds to have a sure leverage to dictate policy concerning Palestine. The Rothschilds had made loans to Turkey which amounted to almost one hundred million pounds. When the Turkish government collapsed after W.W. I because they were on the losing side, the Rothschilds had a claim on Palestine because of those unpaid Turkish loans. (4) The British government followed the dictates of the Rothschilds. The British were given a mandate over Palestine, and the Rothschilds were able to through their proxies in the British government, to create the steps that led to the nation of Israel. (5) **The Rothschilds As “Prophets”** Money is the god of our time, and Rothschild is his prophet Heinrich HeineOne item stands out as a person listens to the International Bankers and reads their books. They believe money is what makes the world go round. If you have money, you can do anything. Money is “God”, and it is worshipped and served. Even after these families accumulate more than can be spent, these devotees continue selling their souls for this false but powerful god. The great poet-philosopher Heinrich Heine (a Banker’s son) said, “Money is the god of our time, and Rothschild is his prophet.” (6) Following the cue of the Rothschilds, Heinrich Heme, a Jew, signed his name by drawing a Seal of Solomon. (7) Amsel Rothschild is reported to have said, “Give me control of the economics of a country; and I care not who makes her laws. (8) Today his descendents meet twice daily in London to dictate to the world what the world price of gold will be. They also dictate what the “Federal Reserve System” will do with America’s finances. **Another God Too** According to eye-witnesses, who were prominent enough to visit one of the British Rothschild homes, the Rothschilds worship yet another god too, Satan. They set a place for him at their table. (8a) The Rothschilds have been Satanists for many generations. The Rothschilds are an important part of the history of the Seal of Solomon (also known as hexagram, Magen David, six-pointed star, Star of David.) The Seal of Solomon, the hexagram, was not considered a Jewish symbol before the Rothschilds began using it. (9) Throughout the Middle Ages the Seal of Solomon had been used by Arab Magicians, Cabalist Magicians, Druid witches and Satanists. One of the few ancient uses of the symbol was on the floor of a 1,200 year old Moslem Mosque found where Tel Aviv is today. (10) In the twelve century an Ashkenazic Jew Menahem ben Duji, who thought he was the Messiah, used the magical symbol. (11) Because the Rothschilds were Satanists they adopted this powerful magic symbol in 1822 for their coat- of-arms. The name they adopted for their family actually comes from the fact that in the 17th century Mayer Amschel Bauer began hanging out a red hexagram in front of their house to identify it. Mayer Amschel then decided to take the name red-schield (Rothschild in German) after the red Seal of Solomon that they used. Alice Bailey in A Treatise On White Magic, p. 412, claims that the Hierarchy has a special group which she calls “the financial group” “controlling all that can be converted into energy, and constituting a dictatorship over all modes of intercourse, commerce and exchange.” According the Luciferian Alice Bailey, the “financial group” is the latest group directed by the Hierarchy. In 1836 Zevi Hirsch Kalischer approached Rothschild and proposed Rothschild buy all of Erez Israel. It took many years for the Rothschilds to finally create Israel. The Rothschilds have been a primary force behind the creation of Israel, and so it is appropriate that the nation carries their magical Seal of Solomon as the state logo. The Ultra-orthodox Jews in Israel will not serve in the Israeli army because they know that Almighty God was not behind the creation of modern Israel, but rather the rich ungodly apostate Jews. They refuse to serve the ungodly. They are more wiser than men like Jerry Falwell who run around proclaiming Israel is God’s nation. Men like Falwell are the type that this Author finds reference to repeatedly in Jewish documents that speak of their power within the Fundamentalists. God is ultimately in charge, he has allowed Hitler to come to power, Stalin to come to power, and the Rothschilds to come to power. In the same sense that God rules over and blessed Stalin’s Russia, he rules over America and Israel. To twist scriptures about God seating the rulers and then to apply them to bless one Satanic secular communist nation and not another is inconsistent and not correctly using the Word of Truth. Some people object that the conspiracy of Power is labelled Jewish rather than Satanic by certain concerned citizens. This objection is valid– however, will these objectors then take the obvious next step and admit the nation of Israel which the Rothschild’s created is Satanic and not Jewish? But then who knows precisely why people do what they do? If you ask someone why he does something, he will give you one answer today, another tomorrow, and another the next day. Does he do what he does for a real reason, or a single motive? Perhaps to label the Power as only Satanic or only Jewish or only Masonic is to neglect the personal human dimension. This personal human dimension is godless. Being godless it fills that void, by pretending its men are gods. This brings us right back to the Gnostic religions and Satan. Most Jewish people do not concern themselves with learning the occultic significance to their treasured Magen David (Star of David). King David did not have anything to do with the hexagram, although his son Solomon did when he began worshipping Ashtoreth (star, also known as Astarte, Chiun, Kaiwan, Remphan, and Saturn). (12) Solomon built altars to Star (Astarte, aka Ashtoreth). The god Saturn is associated with the Star but both Saturn and Astarte also been identified with a number of other names. Saturn is an important key to understanding the long heritage this conspiracy has back to antiquity. The city of Rome was originally known as Saturnia or City of Saturn. The Roman Catholic church retains much of the Saturn worship in its ritual. Saturn also relates to Lucifer.’ (13) In various occult dictionaries Saturn is associated with evil. Saturn was important to the religion of Mithra, and also the Druids. **Co-masters of the World – Connections to JWs, Mormons, and Judaism** It has been said all roads lead to Rome. For this book, it could be said all paths of investigation lead to the Rothschilds. Charles T. Russell, in a 1891 letter to Baron (Lord) Rothschild, mailed from Palestine, outlined possible courses of action that could be taken to establish the Jews in Palestine. Russell’s letters praised the Rothschild’s money which established Jewish colonies in Palestine. Russell writes Rothschild, What is needed here, therefore, next to water and cleanliness, is a good government which will protect the poor from the ravenous and the wealthy. Banking institutions on sound bases, and doing business honorably, are also greatly needed ” Russell continues, “May the God of Jacob direct you, my dear Sir, and all interested with you in the deliverance and prosperity of Israel, and blessed will they be who, to any extent, yield themselves as his servants in fulfilling his will as predicted.” (14) When the Mormon Church needed financing in the late 19th century, they went to Kuhn, Loeb Co. (15) To explain the Rothschild’s control of Kuhn, Loeb Co. here is some background information. The method that the House of Rothschild used to gain influence, was the same that Royalty had used for centuries, marriage. The Rothschild children, girls and boys, have had their spouses chosen on the basis of alliances that would benefit the House of Rothschild, but since consolidating world power they generally have married cousins these last two centuries.’ (16) Jacob Schiff grew up in the house that the Rothschild’s had at 148 Judengasse, Frankfurt. Jacob Schiff came to the United States with Rothschild capital and took over control of a small jewish banking concern founded by two Cincinnati dry goods merchants Abraham Kuhn and Solomon Loeb. He even married Soloman’s daughter. In 1885, Loeb retired, and Schiff ran the Kuhn, Loeb Co. for the Rothschilds until 1920 when he died. (17) During Russell’s and Brigham Young’s day, Lord Rothschild was considered the “lay leader of world Jewry.” (18) Edmund Rothschild was President of the Jewish Colonization Assoc, (19) which was a major Zionist group. Amselm Rothschild indicated that his grandfather Amschel Mayer Rothschild had insisted in Clause 15 of his will to his children, “may they and their descendants remain constantly true to their ancestral Jewish faith.” (20) However, the will has been secret and there is no way of knowing what it says. The Rothschilds have not remained true to the Orthodox faith. If this was actually what Clause 15 said then something is amiss. The Jewish world has showered the Rothschilds with praises, “The Rothschilds govern a Christian world. Not a cabinet moves without their advice. They stretch their hand, with equal ease, from Petersburg to Vienna, from Vienna to Paris, from Paris to London, from London to Washington. Baron Rothschild, the head of the house, is the true king of Judah, the prince of the captivity, the Messiah so long looked for by this extraordinary people… .The lion of the tribe of Judah, Baron Rothschild, possesses more real force than David–more wisdom than Solomon.” (21) The Prieure de Sion-the Elders of Sion (22) also relates to the Rothschilds who are reported to serve on a jewish council of Elders of Sion. (23) The Rothschilds have “helped” the Jewish people the Rothschild’s own way. For those who admire stingyness, the Rothschilds will be greatly looked up to. For instance, the extent of James Rothschild’s charity in France to poor Jews was 5 francs (the equivalent of $1). Their dynasty has destroyed honest Jews along with Christians. Today, few dare criticize the Rothschilds. **Co-Masters of the World – Connections to Secret Societies** The Rothschilds had played a major role in the Bavarian Illuminati, (25) and it is known that a least one of the sons of Amsel was a member. As the reader remembers, Amsel placed his sons in the major European capitals, where they each set up the principal banking houses. By their own secret intelligence service and their own news network they could outmanouver any European government. (26) The large amounts of voluminous correspondence by Rothschild couriers attracted attention, (27) but no one ever stopped their personal intelligence and mail services. After the Bavarian illuminati were exposed, the central occult power over the European secret societies shifted to Carbonarism a.k.a. the Alta Vendita, (28) led by another powerful Rothschild, Karl Rothschild, (29) son of Amschel. In 1818, Karl participated in a secret document that was sent out to the head-quarters of Masonry from the Alta Vendita. The Masons were quite distressed when a copy of this was lost, and offered rewards to anyone who could return the lost copy. It was originally written in Italian. Its title translates ,,Permanent Instructions, or Practical Code of Rules; Guide for the Heads of the Highest Grades of Masonry.” (30) The Masonic reference book 10,000 Famous Freemasons, Vol. 4, p.74, indicates two other sons of Amschel were Masons, James Meyer Rothschild, and his brother Nathan Meyer Rothschild. James Rothschild in Paris was a 33 degree Scottish Rite Mason, and his brother Nathan in London was a member of the Lodge of Emulation. And Jewish Freemason Katz indicates Solomon Meir Rothschild, a third member of the five brothers, was initiated into Freemasonry on June 14, 1809. (31) The Rothschilds became powerful within Freemasonry. We find the Saint-Simonians, the occult religious millenialist forerunners of communism, praising Baron de Rothschild in their magazine Le Globe, “There is no one today who better represents the triumph of equality and work in the nineteenth century than M. le Baron de Rothschild… .Was this Jew born a millionaire? No, he was born poor, and if only you knew what genius, patience, and hard work were required to construct that European edifice called the House of Rothschild, you would admire rather than insult it.” Lionel de Rothschild (the de was added by the French Rothschilds) was involved with the first communist Internationale. The Mason Mazzini who helped start communism praised Rothschild, “Rothschild could be King of France if he so desired.” (32) Adoiphe Cremieux, was a french Jewish Mason (see chap. 1.4 for his credentials). The Rothschilds gave at least Â£ i ,000 to Cremieux to go to Damascus with Salomon Munk, and Sir Moses Montefiore to win the release of Jews imprisoned there, and to convince the Turkish Sultan to declare the charges of ritual murder false. (33) According to the three Jewish authors of Dope, Inc. the B’nai B’rith was a spin-off of the Order of Zion and was organized as a ,,covert intelligence front” for the House of Rothschild. It is highly probable that the B’nai B’rith was used as a Rothschild intelligence cover. The Rothschilds are prominent in the Bilderbergers too. The Rothschilds were closely related to the Council of Foreign Relations (CFR). Although many people today would not view the CFR as a secret society it was originally set up as part of a secret society and it was kept secret for many years, in spite of its awesome power. Carroll Quigley, professor of International Relations at the Jesuit Georgetown University, exposed the Round Table Group with his book Tragedy and Hope. (34) The Rothschilds supported Rhodes to form De Beers. (35) Later, Rhodes made seven wills which established a secret society modelled after the Jesuits and Masons to help bring in a One-World- Government centered upon Britain, and the Rhodes Scholarships. (36) The inner group was established in Mar. 1891 and consisted of Rhodes, Stead, Lord Esher (Brett), and 33* Mason Alfred Milner. (33bb) A secondary circle of “potential members of the Circle of Initiates” consisted of the Jew Lord Balfour, Sir Harry Johnson, Lord Rothschild, Lord Grey and others. Initially, Lord Rothschild was part of the inner group of Rhode’s secret society, but was replaced by his son-in-law Lord Rosebury who wasn’t as conspicuous. (37) The Fabian Socialists dominated the staff at Oxford when the Rhodes Scholars began arriving. These scholars then received indoctrination and preparation to become part of an international socialist New World Order. (38) The Round Table Group developed from the inner executive circle of Rhode’s secret society. The outer circle was established after the start of the 20th century. The Round Table Group was extended after W.W. I by organizing a front organization the Royal Institute of International Affairs. The Council of Foreign Relations was the American part of this front. The inner circle continues to direct the outer circle and its two front organizations RIIA and CFR. The CER in turn set up a number of fronts including the Institute of Pacific Relations (IPR). **Co-Masters of the World – Management of the Catholic and Czars’ wealth and the capture of the Orthodox Church’s wealth** Early in the 19th century the Pope came to the Rothschilds to borrow money. The Rothschilds were very friendly with the Pope, causing one journalist to sarcasticly say “Rothschild has kissed the hand of the Pope…Order has at last been re-established.” (39) The Rothschilds in fact over time were entrusted with the bulk of the Vatican’s wealth. The Jewish Ency., Vol. 2, p.497 states, It is a somewhat curious sequel to the attempt to set up a Catholic competitor to the Rothschilds that at the present time (1905) the latter are the guardians of the papal treasure.” Researcher Eustice Mullins writes that the Rothschilds took over all the financial operations of the worldwide Catholic Church in 1823. (40) Today the large banking and financial business of the Catholic Church is an extensive system interlocked with the Rothschilds and the rest of the International Banking system. The great wealth of the Russian Czars was entrusted to the Rothschilds, $35 million with the Rothschild’s Bank of England, and $80 million in the Rothschild’s Paris bank. The Rothschilds financed the Russian Revolution which confiscated vast portions of the Orthodox Church’s wealth. They have been able to prevent (due to their power) the legitimate heirs of the Czars fortune to withdraw a penny of the millions deposited in a variety of their banks. The Mountbattans, who are related to the Rothschilds, led the court battles to prevent the claimants from withdrawing any of the fortune. In other words, the money they invested in the Russian Revolution, was not only paid back directly by the Bolshevists in millions of dollar of gold, but by grabbing the hugh deposits of the Czars’ wealth, the Rothschilds gained what is now worth over $50 Billions. (41) **Co-Masters of the World–Control Over Satanism & Witchcraft** Chapter 2.11 gives the names of a Witchcraft Council of 13 which is under Rothschild control and in turn issue orders to various groups. One of the purest form of Satanism can be traced to the Jewish Sabbatain sect and its Frankist spinoff. The leaders of this up to the Rothschilds were: Sabbatai Zevi (1626-1676) Nathan of Gaza (16??-?) Jacob Frank (1726-1791) Rothschilds Three connections between Satanism, evil, and money. Money naturally attracts itself to evil. For instance, if a woman prostitutes herself she may receive a great sum of money, but who will pay her for keeping her virginity or her dignity? If you are a hit man a large amount of money is yours if you kill your target, who will pay you if you would miss your target? Second, evil men believe in where there is a will there is a way, and they are willing to sell their souls for their God money. They will employ evil to gain money. While most people are quite aware of these last two connections, a third may likely have escaped their attention. Thirdly, the principle group of men who cranked up International Banking were Satanists from the beginning. These Satanists now are the ones who run the Federal Reserve and are responsible for the creation of U.S. Federal Reserve notes. Just having total control over the supply of U.S. paper money almost gives them leverage over the world’s finances, without mentioning they control the world bank. It is no accident then, that once they established world financial control, they would do all in their power to divide and conquer and destroy both the Christian and the Moslem faith in God. These powerful Bankers relate to faith in God as Cain related to his brother Abel. That they may be related to the Jewish people, does not mean they have the Jewish people’s best interest at heart. Initially Sabbetai Zevi was rejected by many Jews. His sect gained momentum in second half of the seventeenth century in southeastern Poland. (42) In 1759-60, 500 Jewish Sabbateans ,,converted” to Christianity. (43) In 1715, 109 of the 415 Jewish families in Frankfurt were engaged in moneylending. The rest were merchants of various kinds. The concepts that Satanism holds to were a natural shoe in to justify for many of these Jewish bankers the type of behavior they were engaged in.” (44) **Long-Story Short** Many divisions and battles between religious elements in the world have been encouraged and supported by the Power’s wealth. Unfortunately, many have been fooled into thinking that being devout and faithful to God is the source of religious fighting. In some areas of the world, Moslems, Christians, and others have gotten along fine for centuries. Religious tensions do spring to some degree from within the religions themselves, but the fuel to keep those fires burning and to light up conflicts often come from the Power’s wealth. An obvious example is the Iran-Iraq war. **Co-Masters of the World–Control Over W.W. I Treaty** When Germany fell, not only did Rothschild agents draft the treaty, prepare the idea of the League of Nations, but Max Rothschild was one of 11 men who took control over Bavaria. Max Rothschild was a Freemason in Lodge No. 11, Munich, Germany. **Co-Masters of the World–Connections to MI5, Rockefellers, J.P. Morgan, CFR, et. al.** Victor Rothschild, who worked for J.P. Morgan & Co., and was an important part of MI5 (British Intelligence). Victor Rothschild was also a communist and member of the Apostles Club at Cambridge. (45) Lord Rothschild was one of the original members of Rhode’s Round Table group which developed into the CFR. It was the Rothschilds who had financed Cecil Rhodes, beginning in Africa. The Rothschilds’ have several agents which their money got started and who still serve them well, the Morgans and the Rockefellers. The Rockefellers were Marrano Jews. The original Rockefeller made his money selling narcotics, (they weren’t illegal then). After acquiring a little capital he branched out in oil. But it was the Rothschild capital that made the Rockefeller’s so powerful. “They also financed the activities of Edward Harriman (railroads) and Andrew Carnegie Steel.” (46) **Co-Masters of the World–Power within Christendom** The Rothschilds also wielded much influence and power not only in Secret Societies, but also in Christendom’s churches. The Salvation Army under the suggestion of the Rothschilds adopted the Red Shield (Roth-red Schild-shield) for their logo. One history of the Rothschilds remarks, “The Rothschilds had rapidly propelled themselves into a position of immense financial power and political influence. They were an independent force in the life of Europe, accountable to no one and, to a large extent, reliant on no one. Popular lampoons depicted them as the real rulers of Christendom…” (47) Some of the Rothschilds have been involved in the campaign to loosen public morals. The first executive Secretary of the National Student Forum was John Rothschild. This National Student Forum changed its name like articles of clothing. Speaking about clothing, one of the aims of this Socialist group was to promote public nudity, and free love. This organization had the following constituent groups Radcliffe Liberal Club, Union Theological Seminary Contemporary Club, Yale Liberal Club” (48) to name just a few. A further development of this was the Youth Peace Federation which consisted of the League of Youth of Community Church, Methodist Epworth League, NY District, Young Judea, and Young People’s Fellowship of St. Phillip’s Parish (49) to name a few. American religious men have ties to the Rothschilds especially through their various agents. Harry Emerson Fosdick, who was Pastor of Rockefeller’s church was also among the Presidents of the Rockefeller Foundation. John Foster Dulles, CFR, was chairman of the board of the Rockefeller Foundation, and married a Rockefeller, Janet Pomeroy Avery. Remember John Foster Dulles was an important Federal Council of Churches of Christ official. (See chap. 2.9) Every road leads back to the Rothschilds. There are more items than what have been mentioned above linking the Rothschilds to the various tenticles. Each of the various tenticles that conspiracy theorists have put forth,–the Jews, the Masons, the Intelligence Communities, the International Bankers, the Prieure de Sion, the Catholics, the Trilateral commission, the CFR, the New Age, the Cults– each ties back to the Rothschild’s power. **Extent of Rothschild Power** According to one source “it was estimated that they controlled half the wealth of the world.” (50) The Federal Reserve Bank of New York was controlled by five banks which owned 53% of its stock. These five banks were controlled by Nathan M. Rothschild & Sons of London. Control over the U.S. Fed is basically control over the world’s money. That fact alone shows how immense the Rothschild Power is. If one examines who has been appointed to head the Fed, and to run it, the connections of the “Federal” Reserve System to the Rothschilds can further be seen. Another private enterprise using the name Federal that the Rothschilds also direct is Federal Express. Any one else might be taken to court for making their businesses sound like their are government, not the Rothschilds. It is appropriate for them to appropriate the name of Federal, because by way of MI6 via the CIA they instruct the U.S. government. Senators are bought and paid off by their system, as investigators of the BCCI are discovering. The Rothschilds have been intimately involved in witchcraft and the Illuminati since its early known history. The Kaiser of Germany seems to refer to them when he said, “the magic powers of money as wielded by the Lord of Lucre are powers of Black Magic at its blackest.” (51) If only half of the wealth is controlled by the Rothschilds, it indicates that if they are to be part of the world’s rulership, they must have allies. **Allies** The Rothschilds and Rockefellers are only two of thirteen controlling families of the Illuminati. (52) Two Jewish families that appear to be prominent are the Oppenheims and the Oppenheimers. A. Oppenheim was situated in Cologne. The Oppenheimers were early members of the Bavarian Illuminati. The Bund der Gerechten (League of the Just) was an illuminati front run mainly by Jews who were Satanists. This Bund financed in part by the Rothschilds paid the Satanist and Mason Karl Marx to write the Communist Manefesto. The Jew Gumpel Oppenheim was in the inner circle of the Bund. His relative Heinrich Oppenheim masterminded the communist revolution of 1848 in Germany. The Communist Party’s official histories even accept the Bund as the predecessor of Communism. The Oppenheimers apparently are close to the Rothschilds. J. Robert Oppenheimer of the CFR was exposed as a communist. Harry Oppenheimer, an international banker, is chairman of the Jewish De Beers world-wide diamond monopoly, and chairman of the Anglo-American Corp. Oppenheimers can be found in important financial positions in the U.S. They help run around 10 large foundations, including the Oppenheimer Haas Trust of NY for the care of needy Jewish children. The Jewish Ency. Vol. 2, p. 496 indicates other Jewish families “adopted the Rothschild plan.” These were the Lazards, Sterns, Speyers, and Seligmans. The Rothschild plan was to place family members in the 5 largest European capitals to coordinate their activities. One of Germany’s largest magazines is the Stern, and Ernst Stern is second-in-command of the World Bank.” (53) The Jewish families that established the Frankfurt Judenloge (this was the Masonic lodge the Rothschilds belonged to in Frankfurt) included the Adlers, Speyers, Reisses, Sichels, Ellisons, Hanaus, Geisenheimers, and Goldschmidts. Isaac Hildesheim, a Jew who changed his name to Justus Hiller is credited as being the founder of this Frankfurt lodge. Michael Hess, principal of the Reformed Jewish school Philanthropin was an important figure in the lodge too, as was Dr. Ludwig Baruch (later Borne) who joined in 1808. Most of these Frankfurt Jewish Freemasons engaged in commerce. (54) Those Freemasons from 1817-1842 were the leaders of the Frankfurt Jewish community. (55)A gentile Mason in Frankfurt Johann Christian Ehrmann began warning the German people that the Frankfurt Jewish Masons wanted a world republic based on humanism. In 1816 he came out with a warning pamphlet Das Judenthum in der M[aurere]y (The Jews in Masonry). A powerful ally of the world’s jewry can be seen beginning with men like Oliver Cromwell, who was considered a Mason. Cromwell was financed by Jews, and helped the Jews gain power in England. Cromwell was willing to go along with the Jews, because he became convinced of British Israelism. Since the core of the conspiracy of power is Jewish, the attitude of those allied with it hinges on their attitude toward the Jewish people. The religious idea that the British people are descended from the tribes of Israel doesn’t automatically place people into the camp of the conspiracy. Some of the British-Israelites realize that the so called Jewish people in general have no claim over the promises of God. For that reason, they realize that it is not the Christian duty to bow and scrape at their every move. When Christians can be arrested in Israel and abused, and Christians will not even stand up for their own kind, we can see how much hold the idea of the “Chosen Race” theory has over Christendom. Some of the British Israelites such as the Mormons, the old New England wealthy families such as make up the Order, some Masons and New Agers, and the non-Jewish members of the Priuere de Sion are collaborating with the One-World-Power. The anglican church which is run by the Freemasons is strongly British Israelistic. **Sorting Out the Various Identity Groups** In contrast, a hodge-podge of groups which are opposed to the conspiracy like some Neo-Nazi groups, and various Churches unrelated with them are also believers in British Israelism. These various groups are sometimes all lumped together as the “Identity” movement, which is misleading because of their vast differences. It is important to diferentiate between those groups that are trying to approach things from a Christian perspective and place themselves under the authority of God, and those who are setting themselves up under the New Order’s authority, or under their own authority. **Co-Masters of the World —The Media** Eustace Mullins has published his research in his book Who Owns the TV Networks showing that the Rothschilds have control of all three U.S. Networks, plus other aspects of the recording and mass media industry. It can be added that they control Reuters too. From other sources it appears CNN, which began as an independent challenge to the Jewish Network monopoly, ran into repeated trickery, and ended up part of the system. Money from B.C.C.I., (B.C.C.I. has been one of the New World Orders financial systems for doing its dirty business such as controlling Congressmen, and is involved with INSLA, the Iran-Contra Scandal, Centrust, and other recent scandals) which has tainted so many aspects of public power in the U.S. has also been behind CNN. Perhaps nothing dominates the life of some Americans as does the television. Americans sit themselves before the television set and simply absorb what it projects to them. On a day to day basis the biggest way the Rothschilds touch the lives of Americans are the three major networks which are under Rothschild direction. To illustrate this we will examine who run the networks. This list is not current, and no attempt was to provide that. The length of writing a book insures that some material will be dated anyway. **Rothschild Connections** John Brademas — Dir.Rockefeller. Fdtn. chrm Fed. Reserve Bank of N.Y. which controls all other Fed.R.Bks. Humanist of the Yr 1978 Cecily B. Selby — nat. dir. Girl Scouts (the occult is now part of the to Girl Scout program), dir. Avon Products and Loehmann’s (dresses). Husb. James Cole, pres. Bowdoin College Peter G. Peterson — frmr head of Kuhn-Loeb Ex-Sec. of commerce Robert Cizek — dir. First City Bancorp dir. RCA, chairmn Cooper Industries Thomas O. Paine — Pres. of Northrup- large defense contractr. Dir. of Strategic dir of Inst. of Studies, various munitions assoc. Donald Smiley — dir. of several Morgan Firms dir. of Ralston- Purina, Irving Trust, Metro-Life and U.S. Steel and chrm of Macy Co. David C. Jones — Pres. Consolidated Contr., dir. U.S. Steel, Kemper Insur. Thornton Bradshaw — dir. Aspen Inst. of Humanistic Studies, Atlantic-Richfield dir. Rock. Bros. Fund Oil, Champion Paper Co., chairman of RCA Brandon Tartikoff — (head of NBC entertainment) Jewish CBS Harold Brown — Jewish. ex-Sec. of Air Force and ex-Sec. of Defense. Ex. dir. Trilat. Com. Roswell Gilpatric — dir. Fed. Res. Bk.NY. Kuhn Loeb firm C.S.& M Henry B. Schnacht — dir. Chase Manhattan, dir AT&T, chnmn Cummins CFR, Brookings Inst Engine Co., Committee for Economic Develop Michel C. Bergerac — chrmn. Revlon dir. Manufacturers James D. Wolfensohn — frmr.hd. J. Henry SchrÃ¶der Bank Walter Cronkite Newton D. Minow — dir. Rand Corp Franklin A. Thomas — head of Ford Found. Marietta Tree — dir. Winston Churchill Found., dir. Salomon Bro., Foundation & dir., dir. U.S. Trust, granddgtr of fdr. of Groton, hsbd in Br. Intell., assoc. w/ Ditchlcy **The Rothschild’s History by a Jewish Writer Related to the Rothschilds** Jewish writer Anka Muhlstcin wrote a book Baron James The Rise of the French Rothschilds. I prefer paraphrase and make short quotes from her book, because I am trying to document for the reader the mindset and history of thc Rothschilds. Anka Muhlstein has nothing against the Rothschilds, so it will be easier for the reader to accept what shc says about them than from me. I can’t require the reader to read her book, but I can try to summarize some of the appropriate thoughts. Other books also relate many of the things Anka does, but again if I write a footnoted article, it will not carry the weight as my paraphrase will. The reader is recommended to read the book first hand if he has the time and is interested in the details of James’ life. The Jews in the 18th century were restricted to living in Ghettos. Mayer Amschel Rothschild lived in the Frankfurt ghetto. (p.22) The Jews were repressed by outsiders. (p.23) They lived in geographically isolated and self-contained communities (p. 24). The Jewish communities in Europe used a secret relay system between all the Ghettoes. Hebrew characters were one effective code. (p.24) Because of the persecution and repression, the Jewish communities were very tight- knit and highly organized. (p.23) They were deeply hostile to the Christian people. Christians had restricted their own people from money-lending with interest, so lending money on interest had become a Jewish enterprise. The German princes of Thurn and Taxis in the 16th century initiated a postal service. Mayer Amschel loaned them money. (p.21) “Certainly they [the Rothschilds] discovered the latitude that the Thurn and Taxis allowed themselves in unsealing letters, possibly divulging their contents, and according to their own interests, delaying or accelerating delivery. “(p.22) When it profited Mayer Amschel, he would hire Christians, but in general his business and banking were conducted by his close knit family. For instance Mayer Amschel hired a young Christian woman to write his letters for him. (p. 25) Mayer Amschel Rothschild and his family were wholeheartedly Jewish. (p.27) Mayer Amschel Rothschild picked his sons’ wifes for the business gains the wives would bring the family. The oldest son was not happy with this (actually he was bitter because he was denied marriage to the woman he loved), but he complied with his father’s choice. (p.26) Amschel’s daughters all married bankers–in Worms, Sichel, and Beyfus. (p.26) Mayer had ten children and they were all employed in the family business. (p.25) The Jews were taught from childhood up, that the Christians were to blame for all their woes, and that the Christians were to be feared and detested. (p.24) Mayer Amschel had secret, underground passages. (p.22) His carriage was honey-combed with secret drawers. (p.27) The Napoleonic War greatly helped the Rothschild business. (p. 27) Rothschild even outsmarted Napoleon–because the Rothschilds had such good connections. (p.38) The Rothschilds smuggled during the English blocade of Napoleon’s Europe, and made millions. (p.33) “The Rothschilds changed course constantly during this period, always manuevering to avoid any kind of political commitment. “(p.34) One of the things Mayer Amschel set up, was to disperse his 5 sons to the major capitals of Europe. Anka attributes the respectibility of Jewish money lending to the help it gave merchants and entrepreneurs. [See chap. 3.2 -this Author’s view is that merchants had been borrowing for centuries prior to interest taking becoming acceptable by society in the 19th century. It was greatly in part due to who owned and controlled the major newspapers in the 19th century–Jews and Masons–that led the public to change.] “The obligation to reimburse a loan and to pay interest became less onerous to men whose affairs had flourished as a result of the borrowed money. The Jewish lender ceased to be a bloodsucker; often, indeed, he became an associate of the borrower.” (p.31) [The Bible says a borrower is a slave to the lender, hardly an association to be desired.] The business of financing Monarchs was lucrative. The Rothschilds had developed several traits in the ghetto that made their family hard to stop. “The great gift the Frankfurt ghetto bestowed upon him [James Rothschild] was adaptibility, a quality matched by the driving force of his ambition, his prodigious energy, tremendous powers of concentration, and determination to get even [with Christians]. James set out to make his place in the world.” (p.40) The five Rothschild brothers, each in the five major European capitals set up their own private courier system which was faster than the regular mail. (p.47) The Rothschilds had news whether political or economic faster than anyone else including the monarchs. “Thus the Rothschilds had news before anyone else, including ministers [govt.]; they also understood how to make use of it.” (p.47) [Somewhat akin to how money could be made off of knowing the future.] The Rothschilds nomal correspondence to each other was in code.(p.46) Their world was one of finance, politics and secrecy. In the anti-Napoleonic time period, the Rothschilds increased their wealth ten-fold. (p.47) “…James. He enjoyed, moreover, a rock-solid strength and stability, built up by his family, that family simultaneously closed tight like a fist, united by mutual confidence and an invisible wall of secrecy, yet wide open to the outside world. Such was the cohesion of the Rothschilds that the removal of one or more of them left no gap in their common defenses.” The Rothschilds carried out espionage with their own intelligence service, and other questionable subversive activities but none of these could be tracked. “Whenever Mayer Amschel and his sons were on the verge of being caught out, some highly placed person stepped in and stopped the investigation.” (p.36) The made their money doing technically illegal activity. The original large sum of money made was to take the Elector of Hesse’s large sum and instead of investing it into government bonds as directed–to put it to use at investments of higher returns, and giving the elector the return from the government bonds. Anka writes, “The Elector was never the wiser, but even if he had been, he could hardly have complained of disobedience.” (p.34) In summary, the Mafia-like closeness of the Rothschild family, along with their tactic to situate themselves in all the major capitals, along with their own quick secret personal news/intelligence/mail service gave them the contacts and the power to manipulate all kinds of business opportunities. 1. Lord Rothschild. The Shadow of a Great Man. London: 1982, p.6. 2. Wilson, Derek. Rothschild The Wealth and Power of a Dynasty. NY: Charles Schribner’s Sons, p. 101. Source of quote given in the book. 3. Armstrong, George. Rothschild Money Trust. CPA reprint of 1940 ed., pp.66-88. Also in this vein read Mullins, Eustice. The World Order. pp. 31-33 and other sources too. 4. Darms, Anton. The Delusion of British-Israelism. N.Y.: Loizeaux Brothers, pp. 186-187. 5. Darms, op. cit., plus there are numerous other accounts of how Israel was started with British help, and one has to simply see who did it and their Rothschild connections. 6. As quoted in Sampson, Anthony. The Money Lenders. Middlesex, Eng.: Penguin Books, Ltd., 1985, p.37. 7. Encyclopaedia Judaica, p. 696. 8. Mohr, Gordon. The Hidden Power Behind Freemasonry. Burnsville, MN: Weisman Pub., 1990, p. 154. 8a. Various high-ranking Satanists that the power of God has pulled out of Satanism have said they were eyewitnesses to Satan appearing at the Rothschilds. What they witnessed when Satan showed up at the Rothschilds was that Satan appeared as an extremely beautiful man, except his hoofs would be cloven. He would wear a black tuxedo to gamble and play cards (winnings were sexual victims) and a white tuxedo when coming only to socialize. 9. An excellently researched book by a Christian journalist of Jewish ancestry is The Six-Pointed Star by O.J. Graham. New Puritan Library, 1984. This book covers the satanic/magic history of the Seal of Solomon before its modern Jewish use. The book shows how the symbol was not a Jewish symbol until recent times. 10. Goldberg, M. Hirsch. The Jewish Connection. NY: Stein & Day, 1976, p.197. 11. Koestler, Arthur. The Thirteenth Tribe. NY: Random House, 1976, pp. 136-137. 12. The Satanic star is refered to in Acts 7:43, in Amos 5:25-26. “The shield carried by King David.. .was traditionally believed to be engraved either with the name of God or the Menorah, or Psalm 67.” Siegel, Richard and Carl Rheins. “Metamophoses of a Tree; 10 Jewish Symbols and Their Meanings,” Jewish 44 Almanac. New York: Bantam Books, 1980, p. 515. 13. Hall, Manly P., 33°. Masonic, Hermetic, Qabbalistic & Rosicrucian Symbolical Philosophy. l7ed., L.A.,CA: The Philosophical Research Soc., 1971, p. CXLV. 14. WT Dec. 1891, pp.170-71 See also WTR p.1342. C.T. Russell’s letter was sent by him from Palestine in Aug., 1891 to Rothschild. 15. Taylor, Samuel W. Rocky Mountain Empire The Later-Day Saints Today. NY: Macmillan Pub. Co., Inc., 1978, p.66. 16. Read Wilson, Derek. Rothschild, The Wealth and Power of a Dynasty. NY: Charles Scribner’s Sons, 1988. 17. Mullins, The World Order, p. 11. 18. Wilson, op. cit., pp. 338-339. 19. ibid., p.338 20. The Reign of the House of Rothschild, p. 405. 21. Muhlstein, Anka. Baron James, The Rise of the French Rothschilds. NY: The Vendome Press, (n.d.-c.1980) . 22. Baigent, Leigh, Lincoln. Holy Blood, Holy Grail. pp. 190-199. 23. Various references. For instance, Armstrong, The Rothschild Trust, p. 196, “That is the present objective of Jeroboam Rothschild and his secret Elders of Zion.” 24. Wilson, Derek. op. cit., p. 45. 25. William Still writes, “In 1782, the headquarters of illuminized Freemasonry was moved to Frankfurt, the stronghold of German finance, and controlled by the Rothschilds.” Still, The New World Order, p. 82. 26. Muhlstein, Anka. Baron James, The Rise of the French Rothschilds. ‘p.47. She describes how their private courier system was faster than the regular mail. 27. Corti, Count Egon Caesar. (trans. from German by B.& B. Lunn). The Rise Of The House Of Rothschild. Boston: Western Is., 1972, p.278 cf. pp. 386-389. 28. Miller, Edith Star. Occult Theocracy. chap on Carbonarism, pp. 427-438 is a start in learning its importance. 29. Mullins, op. cit., p.2. 30. di Gargano, Michael. Irish and English Freemasons and their Foreign Brothers, 1878, p. 62. 31. Bruell, Geschichte, p. 24 as quoted by Katz, Jacob. Jews and Freemasons in Europe 1723- 1939. (trans. by L. Oschry) Cambridge, Mass.: Harvard University Press, 1970, pp.61, 248 32. Mullins, op. cit. p. 3. 33. Muhlstein, op. cit. p. 125 34. Carroll Quigley’s book was very enlightening on the New World Order except that it leaves out the Catholic Church and the Jesuits’ participation, at a time that their participation was increasing dramatically. In other words, Quigley’s book must be taken with a grain of salt, it would be a mistake to believe it to be infallible or unbiased. 35. Le Sueur, Gorden (Rhode’s confidential secretary). Cecil Rhodes The Man and His Work. London: John Murray, 1913, p. 10. 36. Aydelotte, Frank (co-fndr CFR and Amer. Sec. to Rhodes Trustees). American Rhodes Scholarships. “The model for this proposed secret society was the Society of Jesus, though he mentions also the Masons.” 37. Allen, Gary. Nixon’s Palace Guard. Boston: Western Islands, 1971, p. 9. cf. Quigley. Tragedy and Hope. 38. Martin, Rose. Fabian Freeway. Boston: Western Islands, 1966. 39. Wilson, Derek. Rothschild The Wealth and Power of a Dynasty, p. 101. The source of the quote is given in the book. 40. Mullins, Eustice. The Curse of Canaan, p.125. 41. Mullins, Eustice. The World Order, p.5. 42. Friesel, Evyatar. Atlas of Modern Jewish History. Oxford: Oxford University Press, 1990. 43. ibid. 44. Mohr, op. cit. p. 118. 45. Read Mullins, The World Order. 46. Still, op. cit. p. 136 quoting Griffin, op. cit. p. 37. See also Mullins, op. cit., p. 11. 47. Wilson, op. cit., p. 92. 48. pamphlet published by The American Defense Society Inc., 154 Nassau St., NY. 49. Peace Militant. NY: The New History Foundation. 50. Griffin, Des. Descent into Slavery. S. Pasadena, CA: Emissary Publications, 1980, p. 52. 51. England Under the Heel of the Jew. London, 1918, pp 60-2. 52. Confidential interview with those who were recently in the illuminati hierarchy. 53. Smith, Gary. Land of the ZOG. Portland, OR: VuePoint, 1989, p.58. 54. Katz, Jacob. Jews and Freemasons in Europe 1723-1939. Cambridge, Mass. Harvard University Press, 1970, p.60. 55. ibid, p.92 **Where Does Nazism Fit Into Satan’s Plans?** Let me briefly recap what some of the plan was . And while you read these plans that I am relaying to you from my intensive research on high level Satanism, see if you don’t see the irony in the Satanic plans . How very ironic it is that in all the twisted thinking and reasoning of the leading Satanists for why they must do things, it is surprising they do not catch on that this plan of Satan’s is going to achieve God’s revealed plan . How pride does blind us! (For the sake of brevity I will dispense with my normal method of documenting everything; I suggest that my book Be Wise As Serpents be read for documentation, and further questions be written to me . Otherwise this article would be way to bulky for the newsletter.) The “brilliant” plan given in detail to the Illuminati was to create a thesis and its opposite called the antithesis . The process would repeat itself until the desired outcome . Out of the battle between the two would emerge the synthesis . Out of the battle of chaos would come a new order reminding us of the Masonic slogan “Order out of Chaos.” If the thesis were like a hammer and the antithesis like an anvil, what was caught in between would be broken or reshaped . Three world wars would enable the plan to work. The hammer would be constructed and then given a homeland, a secure base in Russia . It is what we call communism. The first anvil would be created out of economic chaos in Germany . It would be called National Socialism . That anvil would be destroyed in a Second World War, but another anvil would replace it called democracy. The first two world wars accomplished exactly what they were intended to accomplish. Out of the first world war came: (1) A secure Satanic dictatorship in Russia, a secure base to carry out further world subversion. (2) The Satanic family of Rothschilds gained partial control over Palestine, preparing the way for Satan to rule from Jerusalem some day (3) Weapons of mass destruction and terror. (4) The League of Nations. Out of the second world war came (1) The enlargement of their secure base in Russia into a world power. (2) complete control over Palestine by the Rothschilds. (3) airpower, including long range missiles, jets, secret flying saucers, and powerful submarines, all items that individuals could not produce. Those in control of production would therefore control all air and sea ways of the earth. (4) The cold war and an era of terror to convince the people of the need for Satan’s One World Order. (5) the United Nations . Out of the third world war would emerge a new religious system . The third world war would have to be tailored to be like the Bible’s Armaggeddon, Satan told his highest slaves, because- if it resembled Armaggeddon, then the people would believe he was the Messiah when he came after its end . It would have to be terrible, so that he could step in and bring miraculous order out of a world beaten into chaos by the worst war in history. Again it would be “Order out of chaos”, as the Masonic documents repeatedly proclaim. The third world war would come during a period of seven years of tribulation starting in 1992 and running until 1999. Just like the Second World War emerged out of the great world-wide depression. Satan told his followers this 1992-99 tribulation would repeat on a larger scale the plagues of Egypt, for he would wreck revenge for what was done to Egypt by God (and Moses) by giving back in a bigger way to the world what happened to ancient Egypt . To a demonic controlled mind it makes sense to wreck such revenge, especially when the end result is held out to be the salvation of the world by the Lightbearer, the Morning Star, also known as Lucifer. For most of us, the idea of such pain and destruction seems like demonic madness- – which it is . At the core of the One-World-System is Satanism. It hides itself behind fronts such as Jewish Finance, Socialism, Aryanism, British Israelism, Zionism, and Freemasonry which are tools to get the broad masses to serve the Plan. The “conspiracy” to create the One-World-System has enlisted the help of almost everyone. That is because most of the religious systems at the top are controlled by Satanists who know what they are doing and direct the people’s religious efforts. (Read the research in Be Wise As Serpents for the documentation on this.) Nazism was a Pagan Gnostic religious system whose High Priest Hitler knew what he was doing in relation to Satan’s mission. (More about this further down.) The Jewish people (1 use the term in its broadest sense) are being used. Actually the allegiance of the Satanic hierarchy is not in the least concerned with Judaism, although it appears that at first the plans are to create a religious leader that will have the apparent credentials of the Jewish messiah. How sad, because the actions of the Rothschilds and other Satanic “jewish” bloodlines during W.W. II show that their first allegiance is not to the Old Testament and not to even Orthodox Judaism, but is purely to Satan. At some point in the future the Orthodox Jews and the Conservative Jews will find that this Messiah, who is already alive waiting to play his role, will only give them temporary relief. They are being taken for a ride and then they will be dumped by the New World Order’s dictatorship. Constance Cumbey correctly notices that the New Age movement resembles Nazism exactly to a T . For those students wanting to get a detail by detail parallel go to pages 114 to 120 in The Hidden Dangers Of The Rainbow. In 1952, James Larratt Battersby in England published The Holy Book of Adolf Hitler for the German World Church in Europe . Except for some of his pro-German ideas, obviously thrown in to make the book enlist the intended audience’s favor, the book is an exact description of what would happen in the next 50 years to bring in the New World Order. The reason some of the prognostications of pro-German ideas are not valid is that the Satanic hierarchy is not really concerned for the German people either, except to harness their help in their plans . Batterby’s Holy Book of Adolf Hitler was given to him “in the spirit” . According to Battersby the book was written in order that “May God open the eyes of the Gentiles to Truth, and carry his Holy Gospel to the ends of the earth” . The book is an excellent synopsis of what Satan had planned in 1952 and has carried out since to a large degree. The Rothschilds (and other top Satanic families in a lesser way) financed a jewish Mason and devote Satanist named Karl Marx to write his Das Kapital . The Satanists controlling key Masonic groups (along with some other groups they controlled) got Communism started. The original idea came from Satan, and was given at a Feast of the Beast in meticulous detail to those highest in the Satanic Hierarchy . Albert Pike, and Guiseppe Mazzini were two men in strategic positions of control that were let in on the plans. After creating International Socialism (communism) a temporary antithesis was created called National Socialism (nazism). The process to create National Socialism was to turn again to the Masonic Lodges and other esoteric secret Societies to get it done. Therefore, the secret esoteric gnostic and satanic societies along with the Illuminati helped create “the Thule Gesellshaft” (in English the Thule Society) . Adolf Hitler was some type of member of this occult Thule Society, along with many other men who later began leading Nazi leaders such as Rudolf Hess. The Thule Society used the Masonic/Hindu symbol the Swastika, which the Nazi party then also used as its symbol. In other words the grandmother of the Nazi Party was the Masonic Lodges in Germany. The Vril was another secret occult group that many of the Nazi leadership belonged to. Hitler also was a member of the Theosophical Society, which has strong Satanic and Masonic ties. Both Bailey and Hitler studied from Tibetians, Hindus, occultists, and black magicians. They also both studied the Gnostics, and every major Pagan/Occult religious system. A example of how valued the Swastika was for Freemasons before Hitler ruined its image, is a quote from Joseph Fort Newton, a Baptist Minister and high ranking Mason, “The second of these volumes also contains an essay. . . by Thomas Carr, with a list of Lodges, and a study of their history, customs, and emblems- -especially the Swastika . Speculative Masons are now said to be joining.., seeking more light on what are called the Lost Symbols of Masonry.” After promoting and using the Swastika for years the Freemasons quit using it after Hitler. The Holy Book of Hitler provides the answer as to why the Theosophical Society worked so hard to destroy the British Empire. It had always at first mystified me why the Theosophical Society Presidents who connected to the Satanic hierarchy would want to ruin the British Empire. The reason it seemed strange is that the mother country of Satanism and Witchcraft is Great Britian. The center of secret political power is geographically in England. And further, one of the largest and most powerful secret fronts for Satanism is Britism-Israelism. The reason why the British Empire was destroyed was that Satan had already determined even before 1870 that the steps to world government would include setting up around 9 or 10 Continental blocs . The Union of Europe into one country (or bloc) could not be accomplished while Great Britian had most of her focus on her empire. Great Britian as long as she had an empire would never want to join up with Europe. In fact all the European nations would have to be convinced to give up their colonies, that is why the World Power got everyone they could get to help fight Portugal in Angola in recent history, everyone including the large masonic-controlled Christian denominations who donated millions of dollars to the NCC and WCC which moneys were then passed on to the guerillas to buy weapons and ammo. The Theosophical Society is mostly to blame for India’s independence from Britian . First, the Theosophical Society managed to change British policy so that the British became unpopular. Then Theosophical President Besant, who published the largest English paper strongly criticized British rule in her newspapers and eventually was arrested . Gandhi and other Indian leaders were involved in Besant being made the President of the Indian Congress Party. And that political party still rules Indian politics . The Theosophist Mahatma Gandhi, foilowing in the steps of Theosophical President Annie Besant, led the Indian people against British rule. But the final blow to the British Empire was done by another Theosophist–Adolf Hitler. It is common knowledge that the powerful blows of Axis attacks in W.W. II struck the death blow to the British Empire, or so we are told. The truth is that the elite wanted the Empire to die, and pulled every string to convince the British public and indigenous natives that the Empire was too weak after W . W . II to save the empire and prevent her colonies from independence. It is hard for people to grasp that the Illuminati controlled Russia, Great Britian, Germany and France during World War II, but they did. Churchill, Roosevelt, and Stalin were all Masons . DeGaulle of France was closely linked with several esoteric groups, and the Priere de Sion and Grand Orient Masons helped him to power in the 50s . Churchill was a Zionist and pro-Fabian Socialist . Stalin was a closet satanist . Roosevelt was a Zionist, pro-communist and socialist . Both Churchill and Roosevelt came from important elite blood lines . Apparently, Stalin was somewhat independent, but basically did what was expected of him. As the previous paragraph indicates the people of the world weren’t ready for a world government, and most not even a united Europe. W.W. II was carried out to adjust people’s thinking toward wanting European unity . Satan already ruled the world through his secret chain of command, but he wanted to openly rule the world’s hearts and to be publicly hailed as ruler and savior. Who was Hitler? Hitler’s father was the offspring of the Rothschild’s secret breeding program which impregnated his grandmother. It appears from the details available, Hitler was groomed for his role, without realizing his heritage at first . It appears that Hitler learned of his ,,jewish bloodline” after taking over Germany. Hitler had romances with many beautiful women. Although Hitler was very strict with his New Age religious practices such as being a vegitarian, that did not include being celebrate . He did have sex contrary to the deceptions of the Establishment. Hitler’s seed (the Rothschild’s powerful generational occult bloodline) was hidden in an Askenazim bloodline, at least part of which has come to the U.S. In fact, Hitler’s generational occult power was passed on too . This was most likely done by thrusting a knife into his heart, and the person who received his occult power then gulped his last breath with the kiss of death to receive his occult power . What I am telling you is that Hitler’s offspring are alive and well and that his terrifying Anti-Christ spirit was passed to someone and is not dead. Let me remind you of some of Hitler’s own prophecies about himself and his goals. “At the time of supreme peril I must die a martyr’s death for the people. But after my death will come something really great, an overwhelming revelation to the world of my mission.” The world was to witness his divinity . Further, “My spirit will rise from the grave, and the world will see that I was right.” Von Ribbentrop on Apr. 30, 1945 was told this same thing, “You will see that my spirit will rise from the grave . ” National Socialism “is even more than a religion; it is the will to make mankind anew.” “All creative energy will pass to the new man.” Hitler claimed to be the real fulfillment of Marx’s socialism. “I am not only the conqueror, but also the executor of Marxism, of that part of it which is essential and justified, stripped of its Jewish-Talmudic dogma.” In essense, he is saying whatever veneer of Jewishness that Marx’s satanic plan had, he disagreed with it and would destroy that veneer . These type of statements reveal that the essence of the message of various elite men like Hitler is the same Satanic plan if stripped of their variously decorated veneers . Hitler is viewed as the Messiah, the Holy Spirit, the martyred Savior of his people by his followers today. The blasphemous Holy Book of Adolf Hitler states, “All hail to God’s Christ and Chosen, Adolf Hitler…Lord of Lords, and King of Kings, the Eternal Adolf Hitler.” Such blasphemy . Father forgive them for they know not what they do. Hitler’s Demonic Spirit and Hitler’s descendents both live on today. (By the way, some Rothschild descendents such as Hitler’s have come to Christ as their Lord and Savior!) Will this powerful occult branch of the Rothschild’s be used again by the New World Order? Whatever the case it is clear that Hitler’s Anti-Christ spirit will get plenty of demonic help. The demonic forces that have manifested themselves in National Socialism and International Socialism (aka Communism) demonized much of Europe. So much so that Europe officially portrays itself as a beast with Venus on it on a stamp commemorating the Second election of the European Parliament, and also as the same forces that tried to build the Tower of Babel on an official poster. Not only are the same demons that led communist leaders and nazi leaders operating in Europe’s leaders, but there are armies of demons trampling over anything of moral value in Europe . It can be said without a doubt that the ,,man” who rules the One-World-Government will derive his power from a demonic supernatural source . According to Revelations, God is going to have an angel open up a key to the abyss and teeming hordes of demonic spirits shall be decending upon the earth . My conclusion is that Satan has so many Anti-Christs available that Hitler’s personal occult power is not necessary for the New World Order’s success . I rarely like to comment on the end times from Scriptures because I feel like most people are thoroughly confused about the clear teachings that the Scriptures give. 2 Thes. 2:3 and other Scriptures make it clear that the Christians must witness a great apostasy and the Anti-Christ being revealed before Christ returns . We can live everyday as if it may be our last, but Scriptures are clear that the Apostles did not live each day as if Jesus could return that day. They knew that certain things had to happen first . The church has been going through tribulations since Pentecost . The church will go through the “great tribulation” according to the Word of God . We will if we are that faithful remnant we will be spared from the Wrath of God, but we will not be spared from the tribulation of Satan which shall include martyrdom . The New Age leaders are fully ready to cooperate with this “cleansing” from the earth of us bothersome disciples of Truth. In this respect, their thinking will resemble the Nazi’s rationalizations that people must pay their Karmic debt, and shall benefit from being killed . How truth can be stood on its head! The Plans are already drawn up how to use rail lines to move large groups of civilians to labor camps . When we compare Nazi Germany with today’s New World Order plans, Nazi Germany can be seen to be the basic model of what Satan’s timetable includes for us these next few years . To illustrate that the Pagan religion of Nazism is an example to the Satanists and New Agers, let us ponder Anton LaVey’s (head of a visible Church of Satan) trip to the sacred initiation castle of Hitler’s Black Order the SS . The SS apparently brought the Holy Grail to Germany, and hid it before the end of the war . On May 2, 1945, a select group of SS officers, those initiated into the higher mysteries of the Nazi Pagan religion, hid the Grail in the Schleigeiss glacier at the foot of 3,000 meter high Hochfeiler mountain . Seekers in the area have been found decaptitated, and mutilated . The area is still guarded by the Black Order in anticipation of the day that the Grail can be revealed to the world . It has been speculated 1995 might be the date, but this is pure speculation . The important thing for us is to begin to experience the Kingdom of God right now . Let us prepare ourselves for Almighty God’s New World Order as the Satanists launch their counterfeit New World Order. **The Rothschilds** **A Continuation of Articles on the Top 13 Illuminati Families** The Rothschilds are one of the most well-known of the thirteen families. David J. Smith of Portland was asked to prepare an article on the Rothschilds for this newsletter. His article follows this introduction. Satan’s selective breeding program has been continuing down through the ages hidden from the eyes of the public. One of the most powerful Rothschild bloodline families in America are the Springs. The Springs were originally the Springsteins when they came to America in the mid-I 1700s and settled in NY and NJ. They later changed their name from Springstein to Springs to hide their identity. Leroy Springs was hired by LC. Payseur. Now most American’s have to ask, who is L.C. Payseur? One of the most secret and most powerful families in North America has been the Payseurs. They have been so powerful that they could hide their wealth and power, and use other Satanic families as proxies. The Payseurs are part of the i 3th top Illuminati family. The first Payseur to come to America was the former crown prince of France Daniel Payseur (1785-1860). He came over about 1805 to the U.S. and married Susannah Kiser c. 1814. They had two boys Adam and Jonas (1819-1 884). Jonas married Harrietta Smith and they had Lewis Cass Payseur (1850-1939). It was this Lewis Cass Payseur who hired the Rothschild bloodline of the Springs to run a number of the Payseur’s companies. The Payseurs were one of the original big railroad families along with Issac Croom and William H. Beatty. Isaac Croom’s wife was a sister of William Beatty’s, so the reader can see how all these elite bloodlines intertwine. Remember that LC. Payseur hired Leroy Springs to operate a host of his companies. Leroy Springs father was A.A. Springs and A.A. Springs was the secret father of Abraham Lincoln. In 1808, Nancy Hanks, of the lineage of the McAdden Scottish family visited some of her famIly at Lincolnton, N.C. Nancy Hawks visited the Springs family and that is when A.A. Springs impregnated her, and her child when born was named Abraham Lincoln. Abraham Lincoln’s Rothschild blood was kept very secret, but he did grow up to be a famous lawyer, a secret leader of the Rosicrucians, and President of the United States. It is believed from the evidence that the establishment conspiracy concocted the person of Thomas Lincoln out of thin air. The actual early history of Abraham Lincoln is shrouded in myth and mystery, and as one encyclopedia puts it, “We know little about the family of his mother, Nancy Hanks Lincoln.” While a lawyer, Abraham Lincoln had a sexual liaison with Elizabeth who was the illegitimate daughter of German King Leopold, who is also of elite blood lineage. Abraham Lincoln and Elizabeth had two twin daughters Ella and Emily in 1856 who were adopted out. Lincoln in fact had a fairly large number of illegitimate children. Now A. A. Springs, who was both the biological father of Leroy Springs and Abraham Lincoln left an enormous amount of land in what is now Huntsville, AL to his son Abraham Lincoln. Huntsville, AL by the way has become a hotbed of NWO activity. Some of the mind-control research the intelligence community has been conducting has been done at Huntsville. The Rothschilds even named one of their boys after Abraham Lincoln, his name was Lincoln Rothschild. Although Abraham Lincoln secretly had powerful occult blood, he was a great man in his own right. And just like JFK, he had the strength of personality to refuse to bow to the Illuminati’s instructions. Lincoln refused to go the path that his distant European International Banking Rothschild relatives wanted for the United States. The Illuminati goal had been to split the U.S. into two easier to control nations. And just as with JFK, who also came from a top 13 family, a large scale conspiracy Involving many government officials including the Secretary of Defense was put into place to assassinate Lincoln. There are numerous indications that show that the Rothschilds were in part behind the assassination of Lincoln. Some of the men who worked for the Payseurs of the 13th top family were Andrew Carnegie, J.P. Morgan, the Vanderbilts, Giftord Pinnchot, and John D Rockefeller. These men were selected to run Payseur companies because they belonged to the satanic elite. The Leroy Springs family got Payseur family companies in the early 1920s. It was Leroy that managed to get the Rothschild’s involved with the Federal Reserve. Two companies that have come out of the Payseur’s old Lancaster Manufacturing Co. ins Weyerhaeuser and Crown-Zellerbach. I have long know these were companies tied to the elite, but it wasn’t until i found the secret Payseur family at the very top of these companies that I really understood the full story. The Payseurs have gone to extreme lengths to corrupt government documents, such as courthouse records. They have hidden the births of many of their descendants, and have covered over with extreme secrecy most of their monetary holdings. Remember the Beatty family was an early railroad family with business ties to the Payseur family. Bartholomew F. Moore, who was the private attorney for years to President Abraham Lincoln, was a blood relative of the Beatty family. It was Bart Fingers Moore who co-authored the 14th amendment for the conspiracy. The Beatty family continually resurfaces when doing research on the conspiracy. Shirley MacLaine, the famous New Age leader/author is from the Beatty family. She credits her start to Edgar Cayce by the way, who in turn was interested in Blavatsky. Blavatsky was a student of the Mason Anton Mesmer, who introduced the world to hypnotism. Hypnotism had been secretly practiced by the Mystery Religions for thousands of years before Mesmer taught Blavatsky and others about it. Charles Beatty Alexander, who is an Illuminati ,, prince”/Pilgrim Society member is an example of a Beatty in recent times who was within the elite. Quantrill, who was a famous Confederate colonel and guerilla leader, whose band of raiders evolved into the Jessie James gang was married into the Springs (Rothschild) family The recent lala Madelyn Payseur Gatling Fulghum (1876-1972) was the late head of the Payseur family. The documentation on the above families is extensive, but much of the evidence that has been photocopied out of the few documents left intact have been destroyed since the documents were photocopied. The amount of tampering with official documents is incredible, and further Illustrates the enormous power the Rothschilds and the Payseurs (the 13th family–the Holy Blood line) have. The researchers who wrote Holy Blood, Holy Grail got a taste of the power of the 13th blood line to manipulate documents held by libraries and governments in Europe. The same type of thing has been happening in the United States. The researcher into the Satanic elite has a hard row to hoe because the Satanic families have tried to cover their tracks through history. They have also tried very hard to cover up what their financial assets are. Those Rothschilds who have carried on the Rothschild name have had a higher visibility. It is this group of Rothschilds which have gained the public’s attention, even though they too are very secretive. The origins of the Masonic and Rosicrucian movements lie with the medieval alchemists. Manly P. Hall, Freemasonry’s greatest philosopher writes, ,,During the Middle Ages, alchemy was not only a philosophy and a science but also a religion. Those who rebelled against the religious limitations of their day concealed their philosophic teachings under the allegory of gold-making. In this way they preserved their personal liberty and were ridiculed rather than persecuted. Alchemy is a threefold art, its mystery well symbolized by a triangle.” (The Secret Teachings of All Ages, pg CLIV-ul) – Manly P Hall also states in his book on magic entitled Magic, “… [the] pentagram. This was known to medieval alchemy as the sign of the cloven hoof …. (Hall.. Magic, Los Angeles, CA: Philosophical Research Soc., pg. 46) QuicksIlver (which was one of the things the early Astor family traded in) was one of the primary items employed in the aichemical trarismutations. The oxide produced using quicksilver was considered magical and mystically identified with the god Osiris. As the reader may have already figured out, alchemy practiced Hermetic magic from ancient Egypt. Alchemy was really a front for the mystery religion of Satanic witchcraft. The leading alchemist was a german Richard Bauer who was alive sometime in the 14 or 15 hundreds. Richard Bauer is said to have been the only alchemist who was successful in transforming lead to gold. Whether that report is meant in an allegorical way, or some other way I do not know What I am trying to communicate is that the Bauer family was a leading alchemical family which secretly practiced Hermetic magic during the late Middle Ages. David’s article on the Rothschilds is meant to be an extension of what I have already put out on the Rothschilds. for instance my chapter 3.3 in the Be Wise As Serpents book. Chapter 3.3 is entirely devoted to the Rothschilds. I chose them to write about in the book, because the family is the most renown of the Satanic families and the easiest to expose to people just becoming acquainted with what is going on. The other family which has a chapter devoted to it is the Russell family, which is described in chapter 1. 6. The Russell family has yet to be covered in this series, but was covered in the Be Wise As Serpents book because of their importance to the Watchtower Bible & Tract Society. I am aware of intense secret meetings that have been going on in Frankfurt and Moscow between World Bank officials. These secret meetings have been going on now for two months which gives some of the scope of their importance. Undoubtedly the Rothschilds are playing a role in these secret meetings, even while I write this. There has been a great deal of misinformation put out that the Rothschilds and the Rockefellers are fighting for control of the world. It is true that they are in intense competition in some areas. It has also been true that they have been in intense cooperation in many areas. One of the difficulties for people to sort out what is going on, is that they don’t know about the Satanic spiritual dimension of the Rothschilds and the Rockefellers. For instance, to make an analogy, if I am a minister and one of my brothers-in-Christ is my upline on a multi-level marketing distributorship, then he is my business head, but I could be the spiritual leadership that he looks up to. The point is that essentially all researchers trying to expose the NWO are drawing conclusions about occult power on the basis of business relationships, and it doesn’t always work. Sometimes the business boss may be in a secret satanic leadership position over someone else, but it may also be that both men are on equal footing when it comes to occuft power and status within the Illuminati. So far I have seen only one book advertised (and I haven’t read it) which claims to expose the conflict between the Rothschilds and the Rockefellers as a sham. If It really does show this, then the book has contributed greatly toward helping people tear down their isunderstandings about the Illuminati power structure. **Part I** **The House of Rothschild** If one looked on the backstage of history, he would find the House of Rothschild. They have indebted Kings, manipulated kingdoms, created wars and molded the very shape of the international world. Among the hierarchy of the Illuminati they are revered as a powerful satanic bloodline. They are “living legends.” Said one biographer: “In America a boy wants to become President. In Europe he would rather be a Rothschild…. To be ‘a Rothschild’ is to be a modern Croesus, a twentieth-century Midas.” They are a dynasty of enduring power; a “magic” bloodline In Satan’s Empire. We will probably never know exactly when occultism was introduced to the Rothschilds. Several of their ancestors have been rabbis, so the occultism probably came in the form of Jewish Cabalism, Sabbatism, or Frankism. The House of Rothschild practices gnostic-satanism (the Rothschilds would probably not call themselves satanists, but by our standards they are, considering the sacrificial and spiritual worship involved). The truth is sometimes hard to tell. The stories the family weave are hard to distinguish from the truth. Myths are one of their best weapons, and a researcher must be wary. The family began in Frankfort, Germany (the city where paper money was popularized). The oldest known Rothschild went by the name of Uri Feibesch who lived in the early 16th century. His descendants lived in the House of Red Shield. His great, great, great, great Grandson was Moses Bauer, who lived in the early 18th century. The family was mostly made-up of Jewish retail traders, and lived in the Judengasse, or Jew’s Alley in Frankfort. Jew’s Alley was the product of the anti-semitic bent in Europe, and did not have very good living conditions. Most Ashkenazim Jews of that time did not use sir-names, instead they preferred the Chinese custom of using a symbol as the family identity. These symbols were sometimes used on signs outside Jewish houses as an address. Some Jews had taken on sir-names, to fit in, but the use of symbols was more popular. The early Rothschilds chose the sir-name Bauer (meaning farmer in German. Why would a family of retail traders call themselves Bauer? Perhaps to remain un-noticed). The Bauer line continues today, but in the 1700’s one man re-named his branch of the family after its symbol and address – the Red Shield or the Seal of Solomon. Mayer Amschel Bauer was a well-off coin trader in Frankfort. In front of his house hung a sign with the family’s symbol, which was a red hexagram. The hexagram (also known as the Seal of Solomon, the Magden David, or the Star of David) is very occultic. It is used today as the symbol of Israel, but It is not “Jewish.” In his excellent book THE SIX-POINTED STAR, O.J. Graham explains that the hexagram was used in the ancient mystery religions. It was the symbol of Moloch, Ashtoreth, and others. In fact, the hexagram was used to represent Saturn, which earlier newsletters have discussed. The six-pointed star is considered the equivalent of the Oriental Yin-and-Yang symbol, which is the Luciferian concept of balancing good and evil. The symbol appears to have been used by King Solomon when he apostasized, and was thereafter called the Seal of Solomon. Later on, Jewish Cabalism (or Occultism – different name, same game) picked it up as a magic symbol. Through the promotion of the Cabalists and the Zionists it has become the symbol of Jewish identity, although the occult circles know better. The Bauer’s use of a hexagram as their family sign points to their involvement in Jewish Cabalism. In fact, the six-pointed star was so significant to them that Mayer Amschel Bauer decided to adopt it as his new name – Mayer Amschel Rothschild (Rot-schildt = Red Shield). I believe this was done to identify his family with occultism and the likes of Saturn or Ashtoreth (whom the Astors are named after). Mayer was sent to be a rabbi when he was 10, in 1753. A year and a half later his parents died. Mayer was brilliant and was encouraged by relatives to continue his studies but coin trading was his love. He left the school and when 13 was sent to Hanover to be an apprentice at the Illuminati Oppenheimer bank. He worked there for 7 years, learning the ins and out of money. The big question is why he left the Oppenheimer bank. It was a good situation, both financially and socially (Hanover was less antagonistic towards the Jews than Frankfort). Why leave this security and head back home to an uncertain future? Because the future wasn’t all that uncertain. While in Hanover Mayer made the acquaintance of General von Estorff, a numismatist who was impressed by Mayer’s knowledge of the subject. In 1763 General von Estorff left Hanover and joined the Court of Prince William IX of Hesse-Hanau, whose territory included Frankfort. Mayer knew that through his connections he would be able to get some business with the Prince. It appears Mayer’s stay at the Oppenheimer bank was used to establish himself in Illuminati circles and to find a way to get close to the Illuminati royalty. General von Estorff was his key. Prince William of Hesse-Hanau was tied into the Illuminati. He was the son of Landgrave Frederick or Hesse-Cassel, of the royal family of Hesse. Prince William was a Freemason, and his younger brother Karl, was according to JEWS AND FREEMASONS IN EUROPE, 1723-1939, ‘accepted as the head of all German Freemasons.’ Members of the Hesse dynasty have been described as the leaders of the Strict Observance (in 1782 a Masonic Congress in Wilhelmsbad, a city in the Hesse province, dropped the name ‘Strict Observance’ and changed it to “Beneficent Knights of the Holy City”). The Hesse dynasty is totally connected to the Illuminati. Prince William was the grandson of King George II of England. The Hesse-Cassel’s were one of the richest royal houses in Europe. Their income came mainly from the loaning-out of Hessian soldiers to foreign countries. (The elite loves to makes profit off of “peacekeeping” troops, which is exactly what the Hessians were called. This “peacekeeping” always adds up to imperialism. The Hessian troops were used by England in the American Revolution, in fact the colonial armies fought more Hessian soldiers than English. The House of Hesse-Cassel made a lot of money off the American Revolution.) Another example of the Hesse- Cassel’s ties to the Illuminati is the enigmatic figure St. Germain, who is hailed as a New Age Messiah-figure. Many researchers believe that St. Germain was the son of Francis II of Transylvania. Francis II’s second wife was Charlotte Amalie of the House of Hesse, he married her in 1694. St. Germain was either her son, or the prior wife’s, this point is debated. His name was Leopold-George and they staged his death in 1700 to save him from the deadly collapse of the Transylvanian dynasty. Prince Karl of Hesse, Masonic leader of Germany, wrote that St. Germain had been sent down to Italy to be raised by the Medici family. Later on St. Germain appeared out of nowhere to work with the elite. There were questions as to his identity and Napoleon Ill had a dossier gathered on him, but the house holding the dossier was mysteriously destroyed in a fire. St. Germain was an alchemist and he claimed to have the alchemical Elixir of Life, the secret formula of immortality (which the Rosicrucians also claimed to have). He was a guest of William and Karl of Hesse in 1774, and in 1779 returned to Karl to spend the last years of his known life. Helena Blavatsky, cofounder of the Theosophical Society claimed that St. Germain was one of the Hidden Masters of Tibet who secretly controlled the world’s destiny. In 1930 Guy Ballard claimed that he met St. GermaIn on Mount Shasta. This supposed meeting led to the creation of the ‘I AM’ movement. The Hesse Dynasty has lasted clear up to the 20th century. During WWII they were on Hitler’s side. Prince Philip of Hesse was a messenger between Hitler and Mussolini. He was still alive in 1973 and was reported to be the richest prince in Europe. The House of Hesse is still a powerful force in Germany. In 1763 Mayer left Hanover to build his fortune in Frankfort. His main objective was to become a financial agent of Prince William of Hesse-Hanau. Prince William was an intelligent man who loved to make money. (His passions went beyond money. His wife did not please him so he became an adulterer and almost every woman he slept with became pregnant. He fathered between 70 to 21 illegitimate children. His main mistress, Frau von Lindenthal, bore him 8 children and ran his household.) William loved to loan money at high interest rates. He was the perfect man to aid Mayer’s quest for riches. Mayer began bribing Prince William’s servants to become informants. At that time he was an antique dealer, trader, coin collector, and exchanger (the country was divided and as a result the separate currencies made money exchanging very profitable) . General von Estorff convinced Prince William of the value of a rare coin collection and then recommended Rothschild. Thus began the relationship between the Prince and the Rothschilds. Mayer would sell rare coins, precious stones, and antiques to the Prince at ridiculously low prices. Then, in 1769, after a significant amount of sales, he wrote the Prince asking for and receiving the designation ‘Crown Agent to the Prince of Hesse-Hanau” (a great commercial advertiser. Tities and honors were important in that day, they opened doors). Mayer then married Gutle Schnapper, daughter of a respected merchant, Wolf Salomon Schnapper, in 1770. He then set up a money exchange bureau. His two brothers worked in this bureau with him untIl 1785 when Kalmann died and Moses quite. Some researchers contend that Adam Wieshaupt of the Bavarian Illuminati was financially supported by the Rothschilds. The Bavarian Illuminati was founded in 1776, and the Rothschilds were not necessarily a financial power at that time. I may be wrong, but I do not believe Mayer was in a financial position to support Wieshaupt. It is possible, though, that when, in 1782, the headquarters of the Illuminati moved to Frankfort, that it began to be controlled by the Rothschilds. In 1785 Prince William’s father, Landgrave Frederick of Hesse-Cassel, died and William became the new Landgrave. This made him the richest prince in Germany and possibly Europe. He left the small province of Hesse-Hanau to become ruler in Hesse-Cassel. Around this time Wolf Schnapper, Mayer’s father-in-law, introduced Rothschild to Carl Buderus who was the Prince’s chief financial advisor. Through either coercion, friendship, or occultic ties Mayer was able to convince Buderus to become an agent for him. This was a big mover for Mayer. The Landgrave William of Hesse-Cassel was to be the ‘steppingstone” to power. Until then Mayer had only done meager business with William, but by 1789 Buderus managed to get some royal bills for Rothschild to discount. This wasn’t much, but it was a start. Carl received a cut of the profits when he did William’s business through Rothschild. This was the beginning of a long financial relationship that would benefit both parties. Mayer Amschel Bauer-Rothschild was a shrewd man, but his quick rise in social status shows the power of money, for Mayer was not cultured. He could never master the German language and so he and his family spoke a strange Yiddish German mixture (which benefitted their secret network). He enjoyed discussing the medieval world and coin collecting. When it came to business he was ruthless and naturally adept. His occult side was well hidden. He was most likely a Cabalistic Jew. Although it is not known if he was a Freemason, he did accompany the Landgrave on several trips to Masonic lodges (after the two had become better friends). He had 5 daughters and 5 sons, plus several children that died young. He moved from his old house, the ,,Haus zur Hinterpfann”, to a new one, Green Shield, when he started making more money. Green Shield was a dual residency and the other half was occupied by the Schiff family who were to play an important role later on as agents of the Rothschilds. Every passage of Green Shield held hidden shelves and cupboards, and the backyard countinghouse’s walls had a number of secret shelves and a secret underground room which was connected to a neighbor’s house for a quick getaway if necessary (the house was built to protect Jews from the dangerous pogroms that would sweep Germany, it was a great place to secretly practice their gnostic-satanic rituals, if they were yet involved in that form of worship). His five sons have been called the Mayer brothers because they all shared that middle name: Amschel Mayer, Salomon Mayer, Nathan Mayer, Kalmann (Carl) Mayer, and Jacob (James) Mayer. Each son entered the family business at the age of 12. The humorous side of studying an elite IllumInati family is the biographer’s insistence on owing the family’s ability to profit from circumstances as “luck.’ They never seem to put two and two together. Many of these circumstances happened by design. They always say things like ‘… the infant opportunity seemed to be the child of coincidence.” They never attribute a family’s wealth to well planned extortion, cheating, or thievery, which is exactly how families like the Rothschilds attain their riches. The French Revolution is an example. The Illuminati fueled French Revolution got under way in the 1790’s, and Prince William began to get nervous. He was afraid the revolutionary riots would reach Germany and he would lose his gold. So he invested his money in a magnificent new palace called Wilhelmshoe, which was built from 1791 to 1798. Although the French Revolution frightened William it was a delight for Mayer. The war helped his sales. When the French ended up pitted against the Holy Roman Empire, the prices of imported goods skyrocketed, and importing goods from England was a Rothschild specialty. In fact Mayer’s English trade helped him secure a deal with the Landgrave (through Buderus, of course) in which he became a middleman in England’s payments for the hire of Hessian soldiers. ‘…every ill wind of the 1790’s seemed to blow good to the Rothschilds.” The winds were so good that by the end of the decade they were established as a rich and independent family. In 1800 they were the 11th richest family in Frankfort’s Jew Alley (not counting the wealth in proxy). Around the turn of the century Mayer decIded to send his most clever son, Nathan to England to establish another Rothschild House. The family tells a silly story about Nathan leaving for England to best an annoying English cotton trader, but I believe that Nathan was sent by Mayer with a specific purpose – to establish power with the Rothschild network in that country. Nathan arrived in England with no knowledge of the language but a great amount of money. He would soon be the most powerful man in Europe. Many more profitable events occurred at the turn of the century. Many of these events revolve around the Rothschild infiltration of the Thurn and Taxis postal system. The House of Thurn and Taxis was of the Black Nobility. In 1516 Holy Roman Emperor Maximilion I (of the Merovinglan bloodline and husband of a member of the Black Nobility) commissioned the House to create a mounted postal service between Vienna and Brussels. The service eventually included all of Central Europe. The head office of the system was in Frankfort, which was rather convenient for Mayer who proceeded to do business with them. His relationship with Thurn and Taxis became so close that the service began to inform him of any pertinent Information found among the letters (that they had a habit of covertly reading). This mail fraud system was also used by the Emperor Francis to keep abreast of his enemies. While Mayer was receiving stolen news from Thurn and Taxis he was busy setting up his own postal service so that no-one could secretly discover his dealings. This system was eventually so effective that the Rothschilds became the best and fastest informed individuals in the world. The system was so good that many prominent men began to send their letters through the Rothschilds, who of course, always snuck a peak at the contents. The business with Thurn and Taxis helped Mayer receive the title ,,Imperial Crown Agent” in 1800. This title served as a passport that allowed him to travel throughout the Holy Roman Empire. It also provided the right to bear arms, and it freed him from having to pay the taxes and obligations upon the Jews of that period. Mayer began to get even more titles, including one from the German Order of St. John. His sons Amschel and Salomon were also busy getting various titles. In 1801 they became crown agents of the Landgrave William of Hesse-Cassel. All these titles were wonderful, but most important was the Landgrave’s. The Landgrave was the richest Prince in Europe and the Rothschilds were determined to take advantage of his wealth. The relationship with the Landgrave improved greatly in 1803. A Danish King, and cousin of William, asked the Prince for loans but William declined because he did not want anyone to know how rich he had become. Rothschild learned about it and through Buderus, proposed lending the money anonymously. William thought the idea was splendid. The loan was sent through Mayer and a Hamburg Jew. The interests were paid to Rothschild who, after taking commission, forwarded the money to the Landgrave. The event was a great triumph, after 36 years, Mayer had finally done a significant job for the Prince. Six more Landgrave loans to Denmark were negotiated by Rothschild. Many more loans ensued (although they required some teeth pulling on Buderus’ part), Including loans to the Order of St. John. This negotiating of the Landgrave’s loans greatly increased the reputation of the House of Rothschild. By this time Napoleon had come to power in France. This caused a distress in Europe, but brought great profits to the House of Rothschild. As one biographer put it “Napoleon seemed bent on Improving the Rothschild’s lot in life.” Even though Napoleon was not purposely doing It, the conditions he created were of great benefit. Napoleon tried to get the Landgrave as his ally, but Prince William squirmed and politely as possible refused. William’s goal was to wait untIl the winning side in the Napoleonic conflict was clear so that he could join without any risks. The pressure of the situation gave the Landgrave a very bad temper. By this time half the crown heads of Europe were in his debt. Napoleon grew tired of the Landgrave’s games. His troops Invaded Germany and the province of Hesse to “remove the House of Hesse-Cassel from rulership and to strike It out of the list of powers.” Wllhelmshoe became frantic as William attempted to hide his riches. After the scramble to conceal his wealth he fled the province and went to live in exile in Denmark. The French immediately found most of his treasures. Buderus and Mayer had to act fast to preserve the wealth of the Landgrave. Some of the valuables had already been sold. They quickly bribed a French General, Lagrange, who turned over 42 trunks to Hessian officials and lied to Napoleon about the Prince’s true wealth. Lagrange’s deceptive act was eventually discovered and he was dismissed, but much of the wealth was preserved. During the frantic moments before Hesse-Cassel’s Invasion, the Landgrave gave Buderus the right to collect the Interest payments due from Holy Roman Emperor Francis. Buderus eventually transferred this right to the Rothschilds. Mayer began doing the Landgrave’s business behind Napoleon’s back. These secret dealings were greatly boosted by the man Napoleon appointed to rule the area -Karl von Dalberg. Dalberg was a friend of Mayer and Buderns and had done business with them (his connection to them may have also been occult). Napoleon made Dalberg Primate of the new Confederation of the Rhine, which included Frankfort. As ruler of the region Dalberg protected the Rothschilds from being exposed as traders of contraband and as agents of the House of Hesse-Cassel. When the French cut off trade with England prices on Imports soared. The Rothschilds smuggled goods in and made large profits, with Dalberg keeping guard. “It was certainly most remarkable,” said one biographer. “That the Archbishop and Lord of the Confederation of the Rhine, who ruled over sixteen German princes, and stood so high in Napoleon’s favor, should have shown so much good-will to the Jewish Mayer Amschel Rothschild at Frankfort, who, although now a rich man, had no daim to move in high and influential circles.” Despite Dalberg’s protection Mayer kept two sets of books, one inspectable and the other secret. By 1807 Buderus, as proxy for the Landgrave, was almost exclusively using the Rothschilds for Hesse-Cassel business. Mayer himself would visit the Prince in exile, but since he was getting old he soon had to give up these trips and sent his sons on the journeys. The House of Rothschild was collecting the income of the wealthiest prince in Europe less than half a century after Mayer had begun building his fortune! The satanic House of Rothschild’s IllumInati dealings at this time are well exemplified by their involvement with the second Tugenbund League. The first Tugenbund League (or Virtue League) was formed in 1786 as a kind of sex society. The group would meet at Henrietta Herz’s home (her husband was an Illuminati Jew who was the disciple of the powerful occultist Moses Mendelssohn). Many Illuminists attended this “Virtue” League. A number of young Jewish women whose husbands were always away on business would come to the Herz’s house to participate in the immorality (two members were daughters of Moses Mendelssohn). Frequenters of this ‘salon” included revolutionary Freemason Mlrabeau, William von Humbolt, and Frederick von Gentz who was to become an important Rothschild agent. Later on, I will discuss Gentz in further detail. In 1807 the second Tugenbund League was formed. This League pursued ‘moral-scientific” and political aims. The main aim being the deliverance of Germany from French occupation. The League was formed by Baron von Stein who was its principle “protector.” Thomas Frost wrote in SECRET SOCIETIES OF THE EUROPEAN REVOLUTION that ‘The Initiations [into the second Tugendbund] multiplied rapidly, and the League soon numbered in its ranks most of the Councillors of State, many officers of the army, and a considerable number of the professors of literature and science…. A central directorate at Berlin, presided over by Stein, had the supreme control of the movement, and exercised, through provincial committees, an authority all the more potent from emanating from an unknown source, and which was obeyed as implicitiy as the decrees of Emperor or King.’ The Landgrave William of Hesse-Cassel held an important position in the second Tugendbund. Buderus was also involved. It appears the Rothschilds were members and they were “go-betweens for the [Landgrave’s] correspondence on this matter, and made payments in favor of the Tugendbund.” This put Mayer Rothschild at the head of the propaganda system against Napoleon. Napoleon tried to suppress Tugundbund but it went underground, concealing itself under the protection of the English Masonic Lodge at Hanover, It as sisted many anti-Napoleon causes physically and financially. Tugendbund was eventually dissolved, but many of its members moved on to other Masonic societies such as the ‘Black Knights, ”The Knights of the Queen of Prussia,” and “The Concordists.” In 1818 the second Tugundbund was revived as the Burschenschaft (Association of Boys or Fellows). The Burschenschaft was a revolutionary group of students who introduced martial exercises into the universities. The Burschenschaft eventually fell apart. After a few years the exiled Landgrave came to totally trust the Rothschilds. ‘…[Prince William] got more and more accustomed to following [Mayer] Rothschild’s advice, and scarcely took any important financial step without consulting him.’ This princely steppingstone was working out perfectly. It was paving the way towards Rothschild financial freedom. Mayer wanted to become a creditor, and his goal was soon achieved. In 1810 the Rothschild’s firm became ‘Mayer Amschel Rothschild and Sons” (Nathan was not a public partner of this firm). That same year Mayer loaned his own money to Denmark and when Dalberg took out a big loan to go to the baptism of Napoleon’s son, the financial security of the Frankfort bank was set in stone. The House of Rothschild needed a new steppingstone. The old one, the Landgrave, would not be discarded, but they needed a younger, more political man who could be their key to controlling Europe. That man was Prince Clemens Metternich who in 1809 became the Austrian Minister for Foreign Affairs. He became the leading opposer of Napoleon, and the Landgrave moved in his exile to Austria, hoping the powerful up-start would get Hesse back. So the Rothschild network increased its operations in Austria – the land of the Hapsburgs. Around this time Mayer Amschel Bauer-Rothschild got sick. Before his death he wrote a Will that would dictate the structure of the Rothschilds. Although the exact content’s of Mayer’s Will have been kept secret, one edict is clear. It completely excluded the daughters and their husbands and heirs from the business, and all knowledge of it. The Will totally exalted the importance of the family circle. On Sept. 19, 1812 Mayer died. A bogus legend about his death maintains that his five sons gathered around his deathbed and he split Europe between them. Only Amschel and Carl were in Frankfort when he died. Nathan was in England, and Salomon and James were on the road (the brothers were constantly traveling). **‘The Five Wizards’** When Mayer died, headship over the family fell on Nathan Rothschild of England. Even though Nathan was not the oldest, the 5 brothers had voted unanimously that he was the most capable to lead them. Nathan was an intelligent, uneducated, self-absorbed jerk. Though he was an impolite, foul-mouthed man (‘…he could swear like a trooper.’) his money got him into the high society of England. His cold view on life and power is seen in his response to an English Major who was being sentimental about the horrible deaths of the large number of soldiers that had died in the war. ‘Well,’ said Rothschild. ‘If they had not all died, Major, you presumably would still be a drummer.’ There is a story that says one of Nathan’s sons asked him how many nations there were in the world and Nathan replied: ‘There are only two you need to bother about. There is the mishpoche [Yiddish for family] and there are the others.’ This story may be false, but the attitude is real. Nathan first settled in Manchester, England, the center of cloth manufacturing. In 1804 he moved to London. As his wealth and his reputation began to grow he was able to marry Hannah Cohen. The Cohens were a wealthy Jewish family from Amsterdam, and Hannah’s father, Salomon Cohen was a respected merchant in London. Nathan served with him as Warden of the Great Synagogue (the Rothschilds relationship to the Jews will be discussed later on in this article). Hannah’s sister, Judith, married the powerful Jewish Freemason Moses Montefiore (the Montefiore’s were of “ancient” and extremely ‘aristocratic Jewish stock’, probably another Cabalistic family), who was friends with Nathan (Nathan’s sister Henrietta married a Montefiore, so did his second son, Anthony, and his brother, Salomon’s great grandson, Aiphonse married a Sebag-Montefiore in 1911). Nathan’s social life revolved around the Cohens. Nathan was a Freemason. He was a member of London’s Lodge of Emulation. Nathan’s accumulation of wealth was incredible. His money-making exploits were unbelievable. He was smuggling English goods past the French blockade during the Napoleonic conflict, and making great profits. This smuggling required an agent in Paris, so Mayer, through his Dalberg connections, got his son James a passport and James went to live in Paris. A large amount of the Landgrave’s money was sent to Nathan in England, on the advice of Buderus, for the purpose of buying stock. But Nathan, as he and Buderus had planned, used the money as capitol for other ventures. When the exiled Landgrave began asking for a proof-of-purchase, Buderus and the Rothschild brothers had to come up with all sorts of excuses to protect Nathan’s thievery. Eventually the Landgrave demanded to see receipts, so Nathan quIckly bought some stock (the Landgrave had told him to buy the stocks at 72, but their price when be ended up buying them was 62, Nathan pocketed the savings) and they snuck the receipts through the French blockade to the exiled Prince. The Landgrave was satisfied, he had no idea what had really been done with his money. Nathan began making connections in the British government. Probably his greatest early connection was to the Treasury official John Herries. Herries aided Nathan’s rise to power in every way possible. He became an intimate friend or Nathan’s and eventually a proxy for Rothschild in the British government. Their dealings were kept secret and the public had no idea as to the enormity of Nathan’s power. The most incredible example of Nathan’s devious schemes is a job he would later describe as the best business he had ever done. Through Nathan’s connections in the treasury he learned of the plight of the English army in Spain. The Duke of Wellington (soon to become Nathan’s friend) had British troops in Spain ready to attack France, only they lacked one thing – hard cash (the army’s financiers would not take paper money), but the government was very short on gold at the time. Nathan knew how to profit from this situation. The East India Company was trying to sell gold that, of coarse, the government wanted to buy, but the price was so high that officials decided to wait until it dropped. Nathan stepped in and bought up the gold (using some of the Landgraves money as well as his own). He then proceed to raise the price. When the officials realized the price wouldn’t drop they bought the gold and Nathan made a great profit. But the deal didn’t stop there. Nathan offered to deliver the gold to Wellington (this was a heavy responsibility because of the French blockade). Hemes went to bat and got Rothschild the job. Nathan’s plan was incredible, one biographer said his scheme was ‘comparable to burglary in broad daylight.’ Nathan’s brother, James went to Napoleon’s government and told them that Nathan would be importing gold into France and that the British government was upset at the move because it would financially hurt England. Napoleon’s government believed his lie and any French police who might have uncovered the plot were bribed. So Nathan was able to ship the gold to Paris with the approval of both the English and French governments. In Paris the gold was exchanged in French banking firms for cash Wellington could use, and then the Rothschild network carried the money into Spain as France allowed Nathan to fund the war against itself. Eventually some French officials grew suspicious, but Napoleon ignored their reports (why?). The plan went smoothly even though the same officials secretly watched James Rothschild and his brother Carl (who was in on the plot). Wellington eventually defeated Napoleon at Waterloo. The Wellington smuggle was one of the greatest scams in history! In order to better understand the Rothschild’s involvement in the defeat of Napoleon we must look at the role played by the Rothschild’s second steppingstone – Metternich. Metternich was the Austrian Minister of Foreign Affairs and he led the opposition against Napoleon. Metternich was a fierce enemy of the revolutionary fires that were spreading through Europe. The Rothschild’s got to him through a member of the first Tugendbund (the sexual one), Frederick von Gentz. Gentz was Metternich’s right-hand man. Metternich was not financially minded and he relied on Gentz’s advise concerning economics (Gentz’s ability to handie his private finances was terrible, but he had a knack for political economy). John Herries brought Gentz and the Rothschilds together. The family proceeded to bribe the man into their service. Gentz is an interesting character. He was a Freemason so he was probably occultic. His involvement in the first Tugendbund League points to Immorality. Another interesting fact is that I found most of his visits to the Rothschilds occurred on occultic holidays, such as Winter Solstice. This may be a coincidence, but it is interesting non-the-less. Gentz called the Rothschilds ‘a special species plantarum with its own characteristics.’ Gentz steadily brought Metternich into the Rothschild’s web. By at least 1814 Metternich was an ally of the House of Rothschild. His goal was to protect the power of the old aristocracy. His plan was simply to extinguish revolution, and he began with Napoleon. Austria declared war on France and allied Itself with Russia. England Joined them to form a powerful coalition against Napoleon. The battle of Waterloo in 1815 decided the war. Metternich had led Europe to victory with the help of Nathan’s delivery network which funded the overthrow. The victory made Metternich the most powerful man in Europe. Due to his speedy courier system, Nathan knew of the outcome of the Waterloo battle before the news reached any other Englander. A persistent myth is that he made the bulk of his fortune by manipulating the stock exchange with this knowledge. First of all, he did manipulate the market, but he already had a fortune, this only added to It. Second of all, he might not have even made a significant profit (the issue is complicated and debatable. I will not go into it). Two years before his defeat, Napoleon had pulled out of Germany. In 1813 the Landgrave William of Hesse-Cassel returned to his province. Said one biographer: ‘Earlier it had been the Rothschilds who had asked for favors, now it was the (Landgrave] and Buderus who tried to maintain a close connection.’ In 1818 Buderus died. By 1815 Nathan controlled England’s finance. He did a large amount of direct business with the English treasury. John Hemes was allowing deals that would hurt England but fill the pockets of the House of Rothschild. The following quote by one of Nathan’s contemporaries describes his eerie countenance: ‘Eyes are usually called windows of the soul. But in Rothschild’s case you would conclude that the windows are false ones, or that there was no soul to look out them. There comes not one pencil of light from the interior, neither is there any gleam of that which comes from without reflected in any direction. The whole puts you in mind of an empty skin, and you wonder why it stands upright without at least something in it. By and by another figure comes up to it. It then steps two paces aside, and the most inquisitive glance that you ever saw, and a glance more inquisitive than you would have thought of, is drawn out of the fixed and leaden eyes, as if one were drawing a sword from a scabbard…’ This description is disturbingly similar to either MPD or demonic possession. A Prussian official said that Rothschild had ‘an incredible influence upon all financial affairs here in London. It is widely stated … that he entirely regulates the rate of exchange in the City. His power as a banker is enormous.’ ‘When Nathan … (made] a fuss, the Bank of England trembled.’ Once he tried to cash a check from his brother Amschel at the Bank, but the Bank refused saying it cashed only its own notes. Nathan’s volcano-like temper exploded. The next morning he and nine of his clerks arrived at the Bank and began exchanging bank notes for gold. In one day he had reduced the Bank’s gold reserves by a substantial amount. The next day he and his clerks arrived with more bank notes. A Bank executive nervously asked how long he intended to keep this up. Nathan replied something to the effect of ‘The Bank of England refused to take by bills, so I will not keep theirs.’ A meeting was quickly called and they decided that from then on the Bank of England would be pleased to cash any Rothschild check Nathan’s firm was named N.M. Rothschild and Sons. The firm met in the New Court building and for the sake of brevity will be referred to as New Court. New Court was so powerful that it even became a gold broker for the Bank of England (whose price I believe they still fix at will, though I may be wrong). He also founded the Alliance Insurance Company in England. The Illuminati has the Luciferian belief system that one’s evil acts must be balanced by one’s good acts. This belief system has led to the philanthropy of the truly evil elite (although much of this ,,charity” money goes to fund their objectives). Nathan hated the common masses but his duty called. ‘Almoners, particularly those acting on behalf of the poor Jews of London, reported that they got thousands, even hundreds of thousands, of pounds out of Rothschild, but hardly a word and never a courtesy.’ Nathan did not enjoy charity. He was good friends with Thomas Buxton, the anti-slavery leader. The famous musicians Mendelssohn and Rossini taught his daughter to play the harp. When Mayer died in 1812, his oldest son Amschel took over the Frankfort firm. Although Amschel was not the head of the family, he was its spokesman to the aristocracy. He was the one who would apply for the honors and titles for his brothers. He has been described as a crotchety worrier who clung to the past. He was socially odd, yet held great dinners that were the talk of the elite. Religion was a big part of his life, to the point of being called ,,monkish.” Even though he lived on a grand scale Amschel had no joy. Much of this distress came from the fact that he had failed to have any children. After Napoleon exited Germany a German Confederation was set up, of which Amschel became the treasurer. In a sense this made him the first finance minister of the Prussian Empire which was created by the Confederation. Amschel’s sorrow over his lack of children led him to pick prominent young men to treat as his sons. One such man was Otto von Bismark, who would later become the Iron Chancellor of Germany. Amschel was the protector of his mother Gutle, who was the Matriarch of the family. No one could receive full admission into the House of Rothschild by marriage unless she approved. Gutie smiled little and had a harsh tongue. One legend has it that a neighbor asked her whether there was to be peace or war. ,,War?” Gutle replied. “Nonsense. My boys won’t let them.” Saloman was the second oldest son of Mayer. Along with the other brothers he was constantly travelling through Europe. What separated him from his brothers was his gift of diplomacy. He was more stately and complimentary than the others. Said one banker of Salomon: “Nobody leaves him without being comforted.” in other words he knew how to kiss up. It was this fact that led the brothers to send him to Vienna, Austria to establish a relationship with the painfully aristocratic Hapsburgs and with vain Metternich. Although the Rothschilds had attempted to enter a close business relationship with the Hapsburgs and Austria, the Austrian royalty kept putting them off. Then Salomon came along. He rode in on a wave of new found Rothschild power. Their name had become famous. One person described it as the “two magic syllables.” The brothers had become, as one biographer put it, “the Archdemons of Progress.” Salomon began to vie for Austrian ties through Gentz and Metternich. Eventually Salomon’s diplomacy, Metternich’s lobbying, and the below-cost method earlier used on the Landgrave broke down the wall between the House of Rothschild and the Illuminati Hapsburgs. Austria began to employ the Rothschilds on a regular basis. Salomon moved into Vienna and bought a Hotel and a house. Salomon knew how to play Metternich like a piano. He knew the right thing to say at the right time. He knew Metternich’s quirks and prejudices, such as his vanity which Salomon easily manipulated. Pretty soon Metternich and Salomon became close friends. The same goes for Metternich’s right-hand man, Gentz. Gentz and Salomon were “inseparable.” Salomon was also a Freemason. It came to the point where Austria became so controlled by the Rothschilds that the government did not want to refuse the brothers anything. In 1816 Amschel, Salomon, Carl, and James received a title of nobility from the Hapsburgs. In 1818 the Aix-la-Chapelle Congress met to discuss the future of Europe. Salomon, Carl, Metternich, and Gentz all attended this Congress. It was here that Metternich first met the Rothschilds. Gentz kept the minutes of the Congress, he was called the “Secretary of Europe.” A Rothschild scheme at this Congress totally shook the financial institutions of Europe, there was no denying the power of the Rothschilds. “The divine right of kings had been overthrown by the divine right of money..” At Aix-la-Chapelle the Rothschilds widened their circle of influence in the Illuminati. Salomon set up a new firm in Vienna. He financially supported Metternich’s fight against revolution. Metternich had established the “Vienna System” which controlled Europe after Napoleon’s defeat. The Austrian leader began doing what the elite love to do – sending “peacekeeping” troops Into conflIcts. 1814-1848 has been described as “The Age of Metternich”, but since the Rothschilds financed and controlled him it would be more accurate to call it “The Age of the House of Rothschild.” The Order of Vladimir was conferred upon Salomon for his work with Russia. Gioacchino Rossini, the Italian opera composer who wrote Cinderella and the William Tell overture became a good friend of both Salomon and his brother James. In 1822, he, Metternich, Gentz, James, and Cari attended the Verona Congress. This Congress was totally manipulated by the Rothschilds. They profited Immensely by its outcome. Salomon financed the first important Central European railways. The Austrians began saying that they had an Emperor Ferdinand and a King Salomon. When it came to Austrian finances Salomon got the last word. The people would show up at his office and beg for a royal “laying on of hands.” He only had to touch a bond or a stock, and its owner went away certain of its rise. Uke the other Rothschilds he gave immense charity donations. He bought the huge coal and iron works of Vitkovitz. In 1843 he received permission to purchase inheritable agricultural real estate (many people were against Jews buying private property), and he proceeded to buy up large amounts of land. He obtained the lease of Austria’s mercury mines. This and the only other mercury deposit in Spain were controlled by the Rothschilds, creating a world monopoly on a key metal. Salomon was incredibly powerful. The next son, Cart was the family’s chief courier. He was the least intelligent of all the brothers. He was awkward when he spoke and he had a nasty temper. One biographer described him as “punchy”. In 1821 Carl was sent to Naples, Italy to oversee loans there that were meant to finance Metternich’s forces who had arrived to quell a rebellion. While in Italy the Rothschild “mantle” came upon Carl and he made a series of ingenious deals with the Italian government that forced Naples to pay for its own occupation. He also helped Luigi de Medici of the Black Nobility to re-gain his position as finance minister of Naples, and later did business with the powerful man. Due to his success it was decided that he would stay in Naples and set up his own bank. He became financier to the court, the “financial overiord of Italy.” Carl “…wound the Italian peninsula around his hand.” He did business with the Vatican, and when Pope Gregory XVI received him by giving him his hand rather than the customary toe to kiss, people realized the extent of his power. The Pope conferred upon him the Order of St. George. It appears that in Italy Carl became a leader of Carbonarism. After the Bavarian IllumInati was exposed, Carbonarism (or the Alta Vendita) became the major European occult power. Carl’s leadership in this group is very significant. In 1818 a secret Alta Vendita document, that Cari had participated in preparing, was sent to the headquarters of Masonry. A copy of this document was lost, and the Masons got very upset, and offered rewards for the return of this copy. The title of the document translates “Permanent Instructions, or Practical Code of Rules; Guide for the Heads of the Highest Grades of Freemasonry. ” Last, but absolutely not least, was the youngest son, James. During the Napoleonic conflict James had spent his time between London and Paris, supporting the Rothschild’s network of illegal trade with England. After the Wellington smuggle and the defeat of Napoleon, James became an established figure in France. He founded a bank there and began the French branch of the Rothschild family. James was a 33 degree Scottish Rite Mason. At this time the French House was the center of operations for the Rothschilds. Even though successive revolutions would de-throne ruler after ruler, Rothschild power kept the family in control. James was good friends with the leading minister of the Bourbon court, Count de Villele, and he “owned” King Louis Philippe. He also secretly funded Spanish revolutionaries (his agent in Madrid was Monsieur Belin). James yearned for social status. The pursuit of which was second only to money. He had gown so powerful that the French exchange was deeply affected by all his decisions. Like his brother, Salomon, he pioneered the railroad business in France. He also bought the great Lafite vineyards. His bank, de Rothschild Freres was in a league all its own. No one in France could even wish to be as powerful as James. As Salomon had, James received the Order of Vladimir for his work with the Russian dynasty. He also became a member of the Societe de Antiquites. In the Rothschild tradition (as constituted by Mayer’s Will) of trying to keep everything within the family James married his niece, Betty Rothschild, the daughter of Salomon. The Rothschilds main advantage was their incredible courier system. It kept the 5 Houses connected. In fact, the Hapsburgs used this system quite often. All evidence points to the Rothschild brothers being very powerful within Freemasonry. They were one of the leading families in occultism at that time in Europe. Many prominent Masons of their day praised the brothers. In 1820, due to Metternich’s lobbying, Nathan was made Austrian consul in London, and two years later he was made consul-general. James was also made an Austrian consul in Paris. Metternich’s promptings also provided something else very important to the family; in 1822 all the brothers and their descendants of either sex were made Barons. This established social position for the Rothschilds. The Gentz-Metternich team was very beneficial to the House of Rothschild. By this time a few papers had run some upsetting articles about the family. Salomon asked Gentz to censure any more unkind reports and he also commissioned the Illuminist to write a bogus biography on the family that would portray them in a good light. Gentz, now called the “Pen of Europe”, proceeded to write legends for the Rothschilds, and the family fully encouraged the propaganda in their social circles. The brothers had a system (based on Mayer’s Will) where only family members were partners or owners of the banks. This system is still in use today. The Rothschild banks bought everything up, from mining corporations to national debts. For instance, New Court has been controlling Brazil’s debts since 1824. In 1836 Nathan Rothschild, head of the House of Rothschild, died (he may have been poisoned). The headship was passed on to his younger brother, James, by a vote of all the brothers. In 1830 the signs of masonic-fueled revolution began to appear again. Metternich’s “peace of the world” (they always call imperialism ,,peace”) was being threatened. A new king was set up in France, the House of Orange was dethroned in the Netherlands. The fires of revolution were spreading through the masonic network and Metternich began to lose his grip on Europe. The Revolution of 1848 in France de-throned yet another royal house. James went along with the masonic agenda and financed this revolution, even though he was a friend of the court. The revolution marked the end of Metternich’s “Age” and that same year insurrectors chased him and Salomon out of Austria. Neither returned, but a Vienna House had already been established, others would carry it on, under the direction of Salomon’s son, Anselm. Metternich’s descendants are still close to the House of Rothschild. After this the power of the Rothschilds weakened. By 1855 all five brothers were dead except James. Napoleon III was now in power in France and his advisors were the enemies of James. But Rothschild ingenuity came through again when James got Napoleon Ill to marry a Rothschild agent. James died in I 868 and the family headship went to Alphonse, his son. **“The New Trinity”** Three cousins now ran the show – Alphonse of the French House, Uonel of the English House and Anselm of the Vienna House – “the new trinity”. The three banned together to destroy an enemy bank, French Credit Mobilier. Anselm set up a new firm, Creditanstalt in Vienna to combat the French bank. With the help of Lionel and Alphonse he attacked Credit Mobilier until it collapsed. The new head of the House of Rothschild was Baron Alphonse de Rothschild. Alphonse was a suave, socially elite man. After the rail of France’s Credit Mobilier Napoleon ill stepped onto the Rothschild bandwagon. Alphonse was powerful, he had “access” to men like Napoleon III and Bismark of Prussia. The Illuminati decided to get rid of Napoleon Ill, so English Prime Minister Gladstone (friend of the Rothschilds) set things up so that Prussia and France would go to war. Napoleon ill proceeded to attack Prussia and Bismark responded in a furry, defeating France and banishing Napoleon III from the throne. The war indemnities were paid to Bismark (who had a dislike for Alphonse, despite his connections to the family) through the Rothschilds. Alphonse’s brother, Edmond, was the one who helped create Israel (this will be discussed further on in the article). Alphonse married another Rothschild, but his love for her was not very strong. The Comtesse de Castiglione was a beautiful woman who was a Marylin Monroe of her day. She was the mistress of Alphonse, his brother Gustave Rothschild (whose daughter married a Sassoon), and Napoleon III. Anselm Rothschild of the Vienna House was a shrewd playboy. He destroyed Credit Mobilier with Creditanstalt, and in 1861 he became a member of the Austrian Imperial House of Lords. Anselm had many mistresses and his wife left him because of his adultery. He died in 1874. Lionel Rothschild of the English House inherited New Court. He financed England’s Crimean War, Cecil Rhodes’ South African kingdom, vast copper and nitrate mines, and the purchase of the Suez Canal. Lionel’s younger brother, Anthony was knighted by the Queen. Another brother, Nathaniel, bought the renowned Mouton vineyards near Bordeaux. Lionel was a good friend of Prime Ministers Disraeli (who was controlled by Rothschild money) and Gladstone. He also probably paid for Lord John Russell’s election as Prime Minister. Lord Tennyson (whose poems are used in programming) attended his house parties. Lionel has been described as “grouchy” and “crotchety.” In 1858, Lionel became the first Jew in House of Commons. After eleven tries, the British Parliament gave in and allowed Rothschild to take his seat. Not a single significant political move by Lionel was recorded during his stay in Parliament. He was a member for 15 years. in 1879 he died. After Amschel of the House of Frankfort died without an heir, two of Carl of Italy’s sons came to take over the business. But they also remained heirless, bearing only daughters. When the last brother died in 1901, the Frankfort bank was liquidated (I believe they did not try to continue the original bank because they knew that Germany was about to be caught up in the turmoil of the world wars, they eventually set up another Frankfort bank after Germany’s turmoil). The House of Italy ended the same way. The one son of Carl who had stayed in Naples produced only daughters, and when Geribaldi’s Red Shirts unified Italy this remaining son (out of character for a Rothschild) chose not to accommodate the new powers and moved to France. Thus ended the Italian branch. **Rothschild Influence in America** This subject is so massive that it will only be touched on. In 1837 August Belmont came to the U.S., during the Panic of 1837. August Belmont appears to have been a Rothschild proxy. Belmont bought up government bonds in this Panic and his success eventually led him to the White House where he became the “financial advisor to the President of the United States”. His policies helped pit the North against the South for the Civil War. Judah P. Benjamin, who according to A. Ralph Epperson was the Clvii War campaign strategist for the House of Rothschild held many key positions in the Confederacy. He was apparently connected to John Wilkes Booth. J.P. Morgan has been called a Rothschild agent. His father was one of the many elite who made their fortunes by shipping supplies past the North’s blockade and into the Confederacy. J.P. was a major supporter of an American central bank (Interestingly enough, he is reported to be related to Alexander Hamilton). In 1869, J.P. Morgan went to the House of England and formed Northern Securities as an agent for New Court in the U.S. Then, in 1907 J.P. Morgan shuttled back and forth between London and Paris, presumably getting orders from the Rothschilds. He returned to America and instigated the Panic of 1907, which led to the ,,need” for a central bank. Another man who appears to be connected to the Rothschilds was Thomas House, who also made his fortune slipping supplies past the North and into the South. His son, Colonel Edward M. House was one of the main Illuminati figures to control America during the early 20th Century. Some of the Bauer line of the Rothschild family moved to America and took up Important positions in the hierarchy’s network. **The House of Rothschild and Israel** The Rothschild relationship to the Jews is deceiving. The family stance is publicized as “pro-Jewish”, and they have given abundant charity to Jewish causes. But their support of the Jewish race has, in most cases, been used for the sole purpose of controlling the direction and profiting from the Jews. The Rothschilds have been described as the royal family of the Jews. Many leading Rothschilds have been dubbed “King of the Jews”. But what kind of Judaism do the Rothschilds support? Do they support the orthodox Jews who believe in the Old Testament and are waiting for the return of the messiah? No. Do they support Messianic Jews who believe Jesus Christ was the messiah who came to save all men? No. The Rothschilds support those Jews who have fallen prey to the deceptive gnostic and occultic teachings of Cabalism, and in turn support the Illuminati controlled Zionist movement. Not all Zionists are part of the conspiracy, but their leaders are, and the ultimate leaders of the Zionists have been the Rothschilds. I am disappointed by some researchers, who automatically coin the conspiracy a ,,Jewish” one. This unfortunate stumbling block has polluted their work, making it just as misleading as the information put out by the popular media. These researchers seem blinded by the fact that the conspiracy has abused and manipulated the Jewish race more than any other group in the history of the world. The hierarchy of the Jews has sat back and allowed the attack on, and control of the Jewish masses for the furtherance of Satan’s agenda. I am saying this to let you see that I am not anti-semitic. I believe that there are people who call themselves “Christians” who are part of the conspiracy, at the same token there are people who call themselves “Jews” who are part of the conspiracy. To call the conspiracy “Jewish” is ignorant. I believe the Rothschilds to have been involved in Cabalism, Jewish Sabbatism, or Frankism, all of which are involved in witchcraft. This belief is strengthened by the Rothschild’s use of the occultic Seal of Solomon as a family symbol. The city in which the Rothschilds originated, Frankfort, was deeply anti-Semitic. The Rothschilds were constantly striving to overcome the boundaries put on them because of their culture. It is very likely this berthed a bitterness in their hearts towards “Christian” society. This bitterness, and the need to facilitate more profit and power were most likely the reasons why they excepted the idea of a Jewish state. (I will assume that the readers understand that the Zionism / restoration of Israel concept is an unbiblical sham.) The following quote will help you understand the Rothschild attitude towards the Jews. ,,… the first principle of the House of Rothschild was to amass wealth, [and] the liberation of the [Jewish] race from oppressive restrictions contributed Indirectly to this end, since it would facilitate intercourse with the rest of the world, and thereby increase the possibility of financial gain, which in turn would serve to increase its power.” (The Rise of The House of Rothschild by Count Egon Corti, p. 124-125) Amschel of the Frankfort House was constantly harassed by anti-semites. As a result “He became the grand almoner and grand protector to the German Jews; he helped sweep away the chains of Jew Street; he pressed, in the end successfully, for the Jews’ enfranchisement as free citizens of Frankfort.” One of the main Rothschild agents used to promote the emancipation of the Jews in Frankfort was Frederick von Gentz, the evil “Pen of Europe”. At this point I must clarify something for the reader. There are 3 Baron Edmond Rothschilds, and all 3 have been involved with the nation of Israel. To avoid confusion I will number them: Baron Edmond de Rothschild — (1845-1934) House of France. Son of James and brother of Alphonse. Baron Edmund “Eddie” L de Rothschild — (1916- ) House of England. Son of Uonei Nathan and great, great grandson of the infamous Nathan Rothschild. Baron Edmond de Rothschild — (1926. ) House of France. Son of Maurice and grandson of #1 Edmond. The story begins with #1 Edmond, the “Father of Israel”. During the Crimean War (which was funded by the Rothschilds) the small Jewish community in Jerusalem became cut off from all outside support. This resulted in “semi-starvation”. #1 Edmond’s father, James, set up the James Mayer de Rothschild Hospital in Jerusalem in response to this problem. #1 Edmond picked up his fathers interest in Palestine. When the Russian Jews fled the Czar’s pogroms in the 1880’s Edmond began to finance the Russian Jew’s attempts to establish colonies in Palestine, It is clear that #1 Edmond was a fan of Zionism, his charities were not only aiding the persecuted but were promoting the concept of a return the “homeland”. “The Baron’s money drained swamps, dug wells and built houses. It founded industries ranging from scent factories to glass works, form wine cellars to bottle manufacturers. The Baron established his own administration in Palestine and his overseers dictated to the farmers exactly what crops were to be grown and where.” The man who set up the first Zionist Congress was Theodor Herzl. He attempted to get the support for his plans to “restore the Jewish state” from the Rothschilds but many members of the family were opposed to Zionism (the Rothschilds supported those causes which they could profit from and the Integration of Jews into the European culture was profitable for them. One Rothschild told Herzl he was an Englishman and proposed to remain one. #1 Edmond on the other hand. was leading a Rothschild plan similar to Herzl’s that slowly created a Jewish state controlled by the family). #1 Edmond did not oppose Zionism, in fact he supported Herzl’s cause, yet he felt Herzl’s plans should not be implemented so soon (they were “to be accomplished quietly, stealthily, not by shouting from the roof-tops”), plus he was concerned that Herzl would take away too much Rothschild power over the slowly forming Jewish state. The Baron continued to support his own colonies and though Herzl was socially supported, because his Ideas facilitated Rothschild power in Palestine, he was not allowed to implement his plans. #1 Edmond did not want Herzl in control. Later, after Herzl had died and was no longer a threat, #1 Edmond “admitted” that Herzl had been right, and went right on pouring money into the Jewish “Homeland”. #1 Edmond had a tight-fisted control of the colonies. ,,… the Baron was a dictator who expected the colonists to obey him unquestionably.” In 1901 the Jews in Palestine sent a delegation to the Baron who told him ,,… if you wish to save the Yishuv [the -83 Jewish settlement] first take your hands from It, and … for once permit the colonists to have the possibility of correcting for themselves whatever needs correcting …” This upset the Baron. He replied: “I created the Yishuv, I alone. Therefore no men, neither colonists nor organizations, have the right to interfere in my plans.” Herzl was succeeded as President of World Zionism by David Wolffsohn. Wolffsohn got the full support of the Baron. Wolffsohn’s successor was Otto Warburg. Another prominent leader of the Zionists was Chalm Weizmann. Weizmann was on better terms with #1 Edmond than his predecessor, Herzl. He made this observation of the Baron after their first visit. “In manner be could be both gracious and brutal; and this was the reflex of his split personality; for on the one hand he was conscious of his power and arrogant in the possession of it; on the other hand he was rather frightened by it, and this gave him a touch of furtiveness.” The Baron Rothschild told Weizmann be would finance a Hebrew University in Palestine. With Weizmann’s appearance on the scene the Baron became closer to Zionism. In 1914 #1 Edmond traveled to Palestine. “Edmond could scarcely believe his eyes. Tel Aviv had become a city and his miserable windswept colonies had been transformed into lush gardens…” His journey to Palestine was hailed as the “prince returning to his people”. Later the Baron Rothschild told Weizmann: “Without me Zionism would not have succeeded, but without Zionism my work would have been struck to death.” Another Rothschild embraced Zionism through Weizmann – Lionel Walter, the second Lord Rothschild (apparently this upset some relations). The Balfour declaration, which declared England’s support of the creation of a Jewish homeland, was addressed to Lord Rothschild II. Lord Rothschild also received the documents of support from the League of Nations. Charles T. Russell sent a letter to Lord Rothschild that praised him for his work towards a Jewish homeland. After World War I Britain ruled Palestine, and the Rothschilds ruled Britain. Also, a bulk of unpaid debts to the Rothschilds by the failed Ottoman Empire gave the family more control over Palestine. Then came Hitler. According to Walter Langer, a psychoanalyst who wrote the book THE MIND OF ADOLF HITLER, the demonic German leader was a grandson of a Rothschild. ,,Adolf’s father, AIls Hitler, was the illegitimate son of Maria Anna Schicklgruber. It was generally supposed that the father of Alols Hitler was Johann Georg Hiedler…. “There are some people who seriously doubt that Johann Georg Hiedler was the father of Alois…. [an Austrian document was supposedly] prepared that proved Maria Anna Schicklgruber was living in Vienna at the time she conceived. “At that time she was employed as a servant in the home of [a] Baron Rothschild. As soon as the family discovered her pregnancy she was sent back to her home … where Alois was born.” It is believed that Hitler (who was totally created by Satan’s Empire) attacked Austria first, in order to destroy the Austrian records that proved his Jewish ancestry. As Hitler’s demonic attack on the Jews progressed, one would imagine that the Zionists would come to the rescue and offer Palestine as a safe haven. Not so. Many European countries shut their doors to the Jews, including the Palestine colonies. The Zionist controlled immigration laws in Palestine were very strict and it was near impossible to escape to the Jewish homeland. In fact, the ZIonists refused to admit there was a Holocaust going on although evidence points to them knowing! I suppose in their minds it was ok to sacrifice a great number of Jewish lives in order to promote the idea of a Jewish state. To the elite the Holocaust was like shooting dead a herd of cattle to receive the insurance payment. Said Michael Seizer in his book. ZIONISM RECONSIDERED: “Not even the events of 1933 aroused their [Zionism’s] political interest. They were naive enough to see them as a God-sent opportunity for an undreamt of wave of immigration to Palestine. When the Zionist Organization against the natural impulses of the whole Jewish people, decided to do business with Hider, to trade German goods against the wealth of German Jewry, to flood the Palestine market with German products and thus make a mockery of the boycott against German-made articles, they found llttle opposition in the Jewish National Homeland, and least of all among its aristocracy – the so-called Kibutniks.” Hitler forced the Jews to wear the six-pointed star as a sign of shame. It was this same symbol that the Rothschilds were named after and the same symbol that the Zionists promoted as a symbol of Jewish national identity. Do you see the contradiction? Said Jewish author OJ. Graham in THE SIX-POINTED STAR: “Not all the concentration camp victims were Jewish people. Many were Christians. Spiritually, a parallel can be seen in the rituals to Ashteroth and Moloch, where the victims were burned as sacrifices to these false gods. Were the victims of the Nazis someone’s sacrificial offerings?” I believe they were. Remember the six-pointed star was the symbol of Moloch and Ashteroth. Unfortunately, few Jews will tolerate a discussion of this subject. After World War II, the U.N., spurred on by the IllumInati created horrors against the Jews, panted Israel its statehood. Weizmann was the first president of Israel’s Knesset (which was built with Rothschild money). The occultic hexagram is on the Knesset, and is also displayed on the Jewish flag. “…the six-pointed star [had] made its way from Egyptian pagan rituals of worship, to the goddess Ashteroth and Moloch, to King Solomon when he went into idolatry,” say, Graham. “Then it progressed through the magic arts, witchcraft [including Arab magicians, Druids, witches and Satanists], astrology (in which It was no new thing), through the Cabala to Isaac Luria, a Cabalist, in the 16th century, to Mayer Amschel Bauer, who changed his name to this symbol, to Zionism, to the Knesset of the new State of Israel, to the flag of Israel and Its medical organization equivalent to the Red Cross.” What is the ultimate goal of Zionism? David Ben-Gurion, a Zionist leader, tells us: “Weth the exception of the U.S.S.R. as a federated Eurasian state, all other continents will become united in a world alliance, at whose disposal will be an International police force. All armies will be abolished, and there will be no more wars. In Jerusalem, the United Nations (a truly United Nations) will build a Shrine of the Prophets to serve thi federated union of all continents; this will be the seat of the Supreme Court of Mankind, to settle all controversies among the federated continents.” Simply stated, Zionism (with Rothschild support) promotes a New World Order. The Rothschild control of Israel is Immense. #1 Edmond established Trusts that make massive donations to Israel. Biographer Virginia Cowles explains: “Originally the principle Trust was known as Pica – Palestine Jewish Colonization Association – but when it became clear, after the establishment of the State of Israel, that colonization would be handled by the Government, Its functions were changed. Edmond’s son, James, renamed it ,Hanadiv’ the Hebrew word for ‘benefactor’ by which his father was known throughout Palestine; and at the same time rechannelled the Trust’s funds to the promotion of education, science and culture. When James died in 1957 his widow, Dollie, assumed the presidency which she still holds. For many years she has been powerfully assisted by Lord [Victor] Rothschild, and recently she has enlisted the help of the latter’s son, [Lord] Jacob. The Trust knows no boundaries. In the 1960s it carried out James’ wishes by providing money for the Knesset, the new Parliament building in Jerusalem. Today its beneficiaries range from universities, hospitals and public libraries to archaeological digs; from the board of the Weizmann Scientific Institute to the organizers of Instructional Television.” #2 Edmund is the most “race-conscious” of all the Rothschilds. He is on the board of many Jewish philanthropies – including president of the Association of Jewish Ex-Servicemen and Women, joint treasurer of the Council of Christians and Jews and treasurer of the Friends of the Hebrew University of Jerusalem. In 1967 he sent a letter to THE TIMES magazine suggssting Great Britain, Russia, and the U.S. all chip in and build de-salinization plants for Israel so that the desert could be turned into a lush garden, with plenty of food and nothing to fight over (I have found that #2 Edmund loves to come up with cock-a-maime scientific suggestions towards the solution of world problems. For example, in an address to the organizers of the U.N.’s Earth Summit, he suggested building massive dry-ice machines on the polar capes to prevent their melting in the face of global warming). #2 Edmund is also a warden of the Great Synagogue in London. He is the senior member of New Court in London and is a member of the Illuminati’s Pilgrim Society. #3 Edmond is an entrepreneur. He is very involved in tourism, and has funded many luxury resorts in Israel. He controls Compagnie Financlere, which is his holding company in France. He owns Banque Privee in Switzerland, and a merchant bank in Paris. He controls the largest toy company and the largest frozen food company in France. He is a director of Belgium’s Banque Lambert, and of DeBeers Consolidated Mines in South Africa. He is on the Steering Committee of the Bilderbergers. And his interests extend into Israel, where he is the chairman of Tri-Continental Pipelines. Chairman of the Israel Corporation, and chairman of Isrop, which controls the Israel General Bank. The list continues. #3 Edmond is on the board of the Hebrew University of Jerusalem. He directs the Middle East Peace Institute, which he founded in 1967. He regularly donates money to the Biological-Physio-Chemical Institute, which was founded by his grandfather, #1 Edmond. Hesits on the boards ofa dozen or so hospitals and scientific institutes. #3 Edmond is considered the richest Rothschild. He has massive power, and this includes control of much of Israel. The Rothschilds have even had a street named in their honor. The First International Bank of Israel is located at 39 Rothschild Boulevard in Tel Aviv. Bank Hapoalim, “Israel’s fastest growing bank”, is next door at 50 Rothschild Boulevard. The satanic Rothschilds simply dominate Israel. Apparently Israel has served as the meeting grounds for the French and English Rothschilds. The French and English Houses contributed over $1 million to Israel around the time of the Six-Day War. It is reported that when Baron Alain of the French House visited Israel he “burst into tears” at the sight of the walling wall. Baroness Alix of the French House is the World President of Youth Aliyah, which deals with the emigration of Jewish children to Israel. Evelyn of the English House is chairman of the Board of Governors of the Technion, Israel’s Institute of Technology. The satanic Rothschilds simply dominate Israel. The Rothschilds help Satan’s Empire control the world’s resources, the world’s nations and the world’s religions. They are an institution in the conspiracy and, if one looks carefully, the path of their destructive reign can be followed through the history of the past 3 centuries. This article will be continued in the next newsletter, where It will discuss the House of Rothschild in the 20th century. Bibliography: Corti, Count Egon Caesar. THE RISE OF THE HOUSE OF ROTHSCHILD. Boston, Los Angeles: Western Islands, 1972 (copyright 1928 by Cosmopolitan Books Corporation). Graham, OJ. THE SIX-POINTED STAR. Fletcher, NC: New Puritan Ubrary, 1984. Springmeier, Fritz. BE WISE AS SERPENTS. Portland, OR.: Privately published, 1991. Cowles, Virginia. THE ROTHSCHILDS: A FAMILY OF FORTUNE. New York.: Alfred A. Knopf, Inc., 1973 Morton, Frederic. THE ROTHSCHILDS: A FAMILY PORTRAIT. New York.: Collier Books, 1961, introduction and epilogue 1991. Miller, Edith Starr. OCCULT THEOCRASY. Los Angeles, CA. 1933 Epperson, Raiph A. THE UNSEEN HAND. Tucson, AR.: Publius Press, 1985 **Part 2** Lenin said that the establishment of a central bank was 90% of communizing a nation Lenin himself (and Trotsky) were required to place MI6 operatives in key positions during the Russian Revolution. and these operatives were in turn controlled by the Satanic elite back in London, England. It is no secret that the Rothschilds play a major rode in International Bankers, and that various Rothschilds like Lord Victor Rothschild have played major roles in MI6. I mentIon these two items to drIve home what should be an obvious condusion, the Rothschilds are major players in the control of the world and the New World Order. There is so much activity on the part of the modern-day Rothschilds, that the controlled news media’s censorship which protects the Rothschilds have not been able to screen out everything, there are stIll tidbits here and there that filter through the controlled media’s censorship. Still my search continues for descendants of the Rothschilds who are willing to expose what the Rothschilds are all about. I have found a few. One who I have not had the opportunity to interview yet, is the husband of Rebecca Brown. It is reported that Rebecca Brown’s husband was an Illuminatus of the Rothschild bloodlIne, and that he escaped them and has been attemptIng to do some exposure of their Satanic practices. According to what I have been told, they wanted to skin him alive. I have unfortunately not been able to interview Rebecca Brown Yoder’s husband, who has been called by the Lord to strengthen the end time church. **Their Power is Extensive** Peter Rupert Lord Carrington, who is the chairman of the Bilderbergers. has been the Rothschild’s director of their Rio Tinto Zinc Corp. He also is director of Barclay’s Bank and part of the Trilateral Commission. Francois Mitterand, who has led France, is an extremely close friend of the Rothschilds. I point these two men out just to portray to the reader the extensive power the Rothschilds wield behind the scenes. WHAT THEY CALL THEIR BLOODUNE IN THE ILLUMINATI During IlluminatI ceremonies, when candidates are presented for approval at the Sisters of Ught and the Mothers of Darkness levels the bloodline of the Rothschilds is actually called ,,the Rothschild bloodline.” Although It was orIginally went by the name Bauer (and many of the descendants today continue to be Bauers and Bowers, the name ,,Rothschild” was the occult name that the Bauers personally chose for their bloodline to be POWER BROKER IN LATIN AMERICA One of my friends from South America got to personally witness the destruction of South America by Rothschild interests. One item that I am familiar with from history, and which I can’t help thinking about is how the nation of Bolivia in 1908 had the fine distinction of having absolutely no foreign debt. However, in 1908 the Morgans of America loaned Bolivia money, and in 1917 Chandler & Co. loaned them $2.4 millIon. Thus began the plunge of a free nation Into economic slavery to the Illuminati’s international Bankers. The point is that nations like Bolivia, if left alone would have been far better off. People don’t realize that the problems these “banana republics” have is to a large degree beIng cause by powerful outsiders lIke the Rothschilds. who then direct organizations like the IMF to “save” these poor nations. When the Rothschilds set themselves up in Brazil, they set up to be there permanently. They came in during the 19th century. The Rothschilds and other british Interests played a major role in Brazil’s railway system, which became a law unto itself. Just as the secret history of the railway tycoons reveals a great deal about the secret elite in the United States, so it also does in Brazil. Later Henry Kaiser and Nelson Rockefeller moved into South America (incl. Brazil) to promote their capitalistic visIons. They promoted the light industrialization of LatIn America and its economic interdependence in the 1950’s and 1960’s. The Scroll & Key Society is one of the illuminati’s secret entry points at Yale University. The Scroll and Key Society financed a book by Elizabeth A. Cobbs entitled The Rich Neighbor Policy: Rockefeller and Kaiser in Brazil. This book (Yale Univ., 1992, p. 248) states that Brazilians have looked to Rockefeller as their connection to the United States. Other elite families besides the Rothschilds have also substantial Latin American economic control, such as the DuPonts. **The Bloodlines Are Secret** One of the principle points that should be borne in mind, is that the actual occult power of the Rothschild bloodlIne is hidden in secret lineages. Although the Rothschilds make up part of the Rothschild bloodline, people should also watch out for names such as Bauer, Bowers, Sassoons, and many other last names. People within the illuminati who have Rothschild blood are aware of their secret ancestry, but outsiders in the world are more often than not are never going to be told that they carry such “powerful” occult blood. **Above the Law** The story of what happened to BankCal, which was the oldest bank in California, illustrates how powerful the Rothschilds are in the United States. (The details of this story come from the San Jose Calif Mercury News, Jan. 12. 1992. I was somewhat surprised that the article appeared considering the strength of the Rothschilds. Sometimes corruption at the top stinks so bad, that It can’t be suppressed entirely.) The United States has the Securities Exchange Commission (SEC) in place to protect the American public from stock fraud. During the 1980’s there were 3 highly publicized cases of fraud that the SEC uncovered. These three cases created widespread confidence within the american public that stock market trading was in general honestly traded. The story of what Edmond Rothschild (full name is Edmond Adolphe Jules Jacques Maurice Baron de Rothschild) did with BankCal expose to the world that men like the Rothschilds do not have to play by the same rules as everyone else. They are literally above the law. The powerful Illuminati control the law. In 1973, the CEO of BankCal, De Bretteville sold Edmond Rothschild 300,000 shares of Bancal Tristate Corp., 22% of the holding company for the Bank of California. De Bretteville had originally asked two English Rothschild cousins if they wanted to purchase the stock. These two cousins then called two French Rothschild cousins, who then called Edmond in Geneva, Switzerland for assistance. Edmond told them he would help them buy it, and that after he purchased it. he would turn around and divide it with his relatives. He lied. And over the next few years, he would continue to lie to numerous people about his intents for the bank. De Bretteville says, “He lied to his family and he lied to me, it was a dirty deal all around.” Bank of California had the only banking franchise at the time which was in all three Pacific rim states (OR, WA, CA). It turned out that the Bank of California was like a piece of art to Rothschild. He had no Intention of improving the bank, he simply wanted it for his collection of companies. Edmond already owned companies in Brazil, toy companies, 10% in De Beers mining in So. Africa, joint business ventures with Robert Vesco, and 30% of Club Mediterranean which Edmond co-founded. Club Mediterranean was created out of the idea that others of the elite would enjoy seaside playgrounds like those he and his mother cavorted at when he was a youngster. Edmond went on to marry a chorus girl named Nadine Actually, sources indicate that the Baron Edmond had wanted to give the Bank of California to his only son. Bengie (Benjam in de Rothschild) as a graduation present. But Bengie who was going to Pepperdine University was more interested in partying. Bengie lived high on the hog at a fabulous California beach house while flunking school and living wildly. Apparently, his father decided his son wasn’t ready for a graduation present. In fact, he left Pepperdine Univ. after 4 years with 31 credits (97 short to graduate) and went back home to Chateau Pregny on the shore of Lake Geneva near Geneva. Switz. It wasn’t until 1989, that Benjamin stepped forward into the world of finance, by launching his La Compagnie de Tresorerie-Benjamin de Rothschild. The San Jose Mercury. Jan. 12, 1992 reported, ,,The longtime chief executive of the blue-blood San Francisco bank invited Rothschild to invest. Banking regulators encouraged Rothschild to take charge. Securities investigators ignored the frenzy of trading overseas, and later, the documentation of insider trading. The bank’s directors fawned while the baron used it as a personal plaything. “This is not what made this country great.” says Bill Miles, a former BankCal vice president. “This is greed, all the way through.” Edmond Rothschild only purchased a mInority of BankCal’s shares, but he was still able to totally control the company. He was also able to manipulate its stock prices and carry out insider trading without the Securities and Exchange Commission watching it. Edmond named two representatives to the board of directors. The first was George Coulon Karlweis, a patrician Swiss Banker who worked for Edmond. The other was George Shapiro. a New York lawyer who knew nothing about banking. Edmond has called George Shapiro his “godfather and his “guardian angel.” Then Edmond replaced De Bretteville as CEO with his man Chauncey Schmidt. Edmond had agreed to leave DeBretteville in his position as a condition to purchase BankCal shares, but when he chose to renege on his agreement he did without compassion. Bank board meetings became a game of ,,What does Edmond think?” Edmond on his part threw parties that enamored him to San Francisco’s high society. Edmond carried out a series of actions which dropped the value of BankCal’s stock drastically. Financial advisors and securities analysts convinced small stockholders to sell their BankCAl stock which they then did for rock bottom prices as little as $16 a share. Rothshild bought some at that price. Some of Rothschild’s secret proxies paid slightly higher prices. Most of the stock went to anonymous investors trading through private banks protected by secrecy laws. Nearly 20% of the bank’s stock was sold by misled shareholders, and was sold to secret European bank accounts. The Baron and his friends secretly began buying the Bank’s stock after It had hit rock bottom prices. During 1979 to 1981 more than 15% of Bank of California’s stock was sold in Europe. Such an abrupt shift in a stock’s trading pattern is supposed to set off alarms with the Securities and Exchange Commission. Instead the Securities and Exchange Commission turned a blind eye to all the insider trading. The European buyers bought their cheap stock as secretly as possible. They did not openly shop through American brokerages. Instead, they bought small (and therefore. unremarkable) blocks of stock through dozens of private banks in Switzerland, the Netherlands. Germany. Luxembourg. The Baron told his friends that he would sell BankCal, while he publicly gave the appearance that the company was not for sale. For instance, publicly It was announced that David Rockefeller. as well as the elite’s front man for BCCI Ghaith Pharaon had both taiked with Edmond Rothschild about the purchase of BankCal. According to what the public was led to believe. Rothschild said he would not sell his shares in the bank. Jean Marc Vemes, a buddy of Edmond. bought 310.000 shares through a defunct Asian mining company. He was anonymous until Edmond Rothschild nominated him to the bank’s board of directors. After gathering up shares at rock bottom prices, Rothschild announced an official change of heart to sell the bank at $50 a share. Rothschild then sold this supposedly American bank to the Japanese, Mitsubishi, to be exact, and ,,made a killing” off of his manipulations and insider trading. In Mar. 1982, Mitsubishi began secret negotiation to buy the bank which they codenamed ,,Snoopy.” Over the years, stockholders had watched various companies offer $74 a share, $60 a share and other good terms only to be rebuffed. When Rothschild finally sold for $50 a share to the Japanese, it was clear that his whole goal had been to cheat stockholders to Insure a big cash reward for himself. Richard Freemon, a large stockholder who had sold. sued Rothschild and the directors for cheating him on his stock. The $25 million dollar lawsuit was settled out of court, with all parties swearing not to disclose how much Freemon got for having lost money due to Rothschild’s stock manipulations. **The Round Table Group** David Smith who has written the following article on the Rothschilds for this newsletter asked me to explain in this introduction about Rothschild and the Round Table Group. The men who formed Milner’s Round table group from the various clues in their lives were by and large secret satanists. Rhodes and Stead created a secret society which had a ,,circle of initiates.” This circle included such names as Albert (Lord) Grey, Arthur (Lord) Balfour, Sir Harry Johnston, and Lord Rothschild. Milner was on the executive committee of this secret group. Carroll Quigley dates the start of the group as March i 891. Apparently, the Rothschilds helped finance this secret society. In 1909-1913, this secret society in turn formed Round Table groups in British dependencies and the U.S. Eight of these round table groups were still functioning into the 1970s. Sir Abe Bailey supported the Round Table groups quarterly magazine called The Round Table in 1919, Sir Abe Bailey and the Astors financed the creation of the Royal Institute of International Affairs which in turn created daughter organizations such as the Council on Foreign Relations in the United States. The RIIA is also sometimes called Chatham House. The first Round Table group of the Rhode-Milner group were sometimes called the Cliveden Set because they often met at the Astor’s Cliveden Estate. Terence O’Brien’s biography describes Milner’s relationship to the Rothschild’s as very close Lord Alfred Milner (1854-1925) frequently visited the Rothschilds, stayed overnight with various Rothschilds, and even had some sleepless nights with them. without explanation as to why. Milner also worked for Rothschild as a director of Rio Tinto. Three Illuminati families stand out in the creation of the Round Table groups, which then became the RIIA and the CFR and related groups. These are the Rothschilds, Astors, and Greys. The Bailey family also shows up an important generational satanic family. The RIIA and its various branches such as the CFR are very powerful today. In my Be Wise As Serpents book readers can find a chart showing the role the CFR plays in the Policy Process of the U.S. **The Rothschilds** By David Smith The Rothschild family reached a peak in Its power during the Age of Metternich (1814-1848), but as the century waned, so did Rothschild power. They still held a considerable amount of influence but their “veto power” was not as strong as It had been before the Revolutionary overthrow of Metternich’s Europe. This lagging power was nothing that could not be reversed though, and last half of the 19th century was spent manufacturing another incredible climb upward. The new rise in power came about during the reign of the “New Trinity” – Alphonse (France), Lionel (England), and Anselm (Vienna). The succeeding generations of these three family leaders were the catalysts of new family order. An excellent example of Rothschild power in the late 19th century is the families dealings with the Illuminati Habsburgs. In order to be courtworthy for the Habsburgs you had to have four ancestral lines of nobility and you had to be baptized. Yet Emperor Francis Joseph gave the Rothschilds ,,a special act of grace” in 1887. From then on, the House was allowed to be on close terms with the Habsburgs. This was a considerable act. The European nobility are very serious about their aristocratic rules. (Francis Joseph was not very close to the House, but his wife was a good friend of the Rothschilds). Another great example of Rothschild influence is their direct Involvement on both sides of the Austro-Prussian and Franco-Prussian Wars. Bismarck., dictator of Prussia, was a sort of son to fatheriess Amschel of Frankfort. After Amschel died Bismarck remained close to the Rothschilds (although he had occasional quibbles with the family). Bismarck’s banker, Bleichroder, was a Rothschild agent and the richest man in Berlin. He was invaluable to Bismarck as the financier of the dictator’s wars with Austria and France. In Austria, the Hapsburgs were at least publicly Implored by Alphonse and Anthony of Paris and Anselm of Vienna to avoid a war with the ambitious Prussian dictator at all costs. Of all the international banking families, the Rothschilds appeared to be in favor of peace the most, although this was probably a ruse. “We want peace at any price,” said Anthony de Rothschild. “What do we care about Germany, or Austria or Belgium? That sort of thing is out of date.” But the Austrians gave in to Bismarck’s provocations and embarked on a war with Prussia in 1866 (the Rothschilds had all congregated in London for a family wedding the year before; it is possible the wedding was used as an excuse to assemble the family together to discuss a plan of action concerning the up-coming events) . Austria had been warned. In seven weeks the war was over, Bismarck had crushed the Austrians. The war had been financed by Rothschild agent, Bleichroder. Then Bismarck began to provoke France. Napoleon III was in the pocket of the head of all the Rothschilds, Alphonse de Rothschild of the Paris House. In fact, the two even shared the same mistress. Alphonse also had “access” to Bismarck. He was on both sides of the track, so to speak. Then, (very possibly under Rothschild direction) Bismarck began to try to put a German prince on the Spanish throne. Napoleon III responded by telling Alphonse that France could not allow such a thing, and unless England intervened diplomatically he would have no choice but to go to war against Prussia. The Emperor wished to use the Rothschild’s courier/agent system to reiay this message to England. Baron Alphonse did so, sending the message to Nathaniel de Rothschild at New Court who relayed it to a close family Mend, and former Prime Minister Gladstone (England happened to be without a Prime Minister at that time). Gladstone (shedding. I believe, a light on the family’s own opinions) answered the message with a refusal to intervene. The stage was set. Although Bismarck withdrew his SpanIsh candidate, the frictions between France and Prussia had become irreconcilable. Napoleon III declared war on Prussia in 1870. Explained one biographer: “No one foresaw the fall of France. Indeed crowned beads and statesmen alike believed that at long last Bismarck. had taken on an impossible task.” Despite everyone’s confidence in France, Alphonse sent his family to England. He apparently knew better. Napoleon III suffered a terrible defeat. His empire came to an end. This war was also financed by the Rothschild agent, Bleichroder. Here comes the great puzzle concerning the whole affair. Biographers, using diaries and such, seem to think the Rothschilds were very distraught over Napoleon III’s loss. But It also appears they were behind the whole mess. Perhaps the fear of the unpredictability of the new revolution caused this dismay. Perhaps It is just Rothschild disinformation. Perhaps their pan was to keep connections on both sides of the conflict and ride out the storm, but they were upset because their philosophical loyalty was to France (although I find this hard to believe). The family had their hands in both sides of the conflict, it even appears they manufactured the conflict, why the outcome might have upset them I have no idea. I personally believe the House of Rothschild wanted to get rid of Napoleon Ill and his empire, which is exactly what happened, the third republic was set up in France. After the war the French economy was devastated. The Rothschild agent, Junius Morgan was brought in to help restore the French financial situation. He made a large profit. As you can see the Rothschild’s involvement in the Austro-Prussian and Franco-Prussian Wars was significant, even though they were crying peace. **French House, Late 19th and Early 20th Century** Alphonse, of the “New Trinity”, was the 4th bead of the House of Rothschild. He was an aristocratic man and friend of many prominent leaders of his day. He was also an adulterer, his most notable affair being with the Comtesse de Castiglione. He and his wife were called “the most lavish entertainers of their day.” The sophisticated Alphonse was even friends with Belgium’s King Leopold and England’s Prince of Whales. He also improved upon his Inherited network of Rothschild agents, an underground system that would continue to grow well after his death. He was one of best Informed men of his day. His older sister Charlotte married Nathaniel of the English House. His brother Gustave also had an affair with the Comtesse de Castiglione. His youngest brother, Edmond #1 was a genius and a main figure in the creation of a Jewish homeland in Israel. He helped divide the world’s oil between Shell and the Rockefeller’s Standard Oil. His other brother Salomon James married a Frankfurt Rothschild and is the subject of a weird circumstance described by biographer Virginia Cowles. “In 1864 Baron James’ third son, the brilliantly clever Salomon [James], dropped dead. The boy had become a compulsive gambler which had caused his father great anxiety, as anyone with the Rothschild name was given unlimited financial credit. Apparently Salomon died of a heart attack which fascinated the Goncourt brothers. ,,Cabarrus, Rothschild’s doctor,’ one of them wrote, ,,told Saint-Victor that the young Rothschild who died the other, day really died of the excitement of gamblIng on the Stock Exchange. Imagine it; a Rothschild dead of a paroxysm over money.’ “However, If the Goncourt brothers had known the details of a previous heart attack suffered by Salomon they would have been even more enthralled. Three years earlier Salomon had ‘dropped dead’. He had been placed in a comn and, according to Jewish custom, carried into every room in the house. One of the pall bearers had stumbled, the coffin had crashed Into a door and -Salomon had woken up! Not for another three years was he well and truly buried.” This story could lead to all sorts of speculation. De Rothschild Freres, the French House bank, was very powerful. It got its hands Into electrical Industries, the development of the Mediterranean Railway and North African business. It also controlled, with the British House, the Baku oil fields in Russia, which made the Rothschilds the main competitors of the Rockefeller trust. The oil business was principly run by Edmond #1. When Alphonse died in 1905, the new generation of the French House came under the charge of Baron Edouard, a quiet and very rich man. Edouard was a director of the Bank of France. Baron Edouard also ran the de Rothschild Freres with his cousin, Robert (who married a Beer), son of Gustave (Robert’s sister, Alice Caroline married Sir Edward A. Sassoon). These two carried de Rothschild Freres through the tumult of the first world war. Their policies were passive, as they extremely protective of the family wealth. Baron Edouard and Robert had close business dealings with J.P. Morgan. One of the operations of the Morgan-French Rothschild combine involved economic manipulation that allowed the Vienna House to almost fully regain the losses that the Austrian Rothschilds had incurred during WWI. The son of Edmond #1, James Armand de Rothschild, carried on the Israel work of his father after Edmond #1’s death in 1934. James Armand’s brother Maurice was the black sheep of the Rothschild’s new French generation. Maurice was a banker and a Senator in the French Parliament. Maurice was a very scandalous figure in the aristocratic scene. He was known as Don Juan de Rothschild. Said one biographer: “Some peopie went as far as to claim that … one had to be seduced or at least pinched by Baron Maurice if one was a woman, or affronted by Baron Maurice, if a man. No other personage surpassed him in enriching the delicious scandal of his times.” Thus a new french generation began the 20th century, the undynamic Baron Edouard leading the way. **British House, Late 19th and Early 20th** Lionel de Rothschild, of the “New Trinity”, brought the British House into the late 19th century. Lionel was a very powerful man. He ran New Court shrewdly, and financed many promInent ventures, such as Cecil Rhodes’ gold and diamond mines, and the purchase of the Suez Canal. He was also the first Jewish member of Parliament. His sister, Charlotte married another member of the “New Trinity”, Anselm of Vienna. Another sister married into the soon-to-be extinct Italian House. Lionel’s brother Anthony – who described the Rothschilds as “complete slaves to business – married a Montefiore, and was knighted by the Queen – thus Sir Anthony de Rothschild. Lionel’s next brother, Nathaniel, was the father of the Mouten Rothschilds. Nathaniel, though of the British House, loved France and moved to Paris in 1851. In 1853 he bought vineyards that became known as Mouton Rothschild, and he lived at these vineyards several months of the year. His descendants, the Mouton Rothschilds, are citizens of France but are of the British House (except that their mother was a French Rothschild, but the male lineage is the most important in the Rothschild family). Another of Lionel’s brothers, Baron Mayer, married a Cohen. Mayer built a spectacular house, Mentmore Towers. Said one woman: “I do not believe that the Medicis were ever so lodged at the height of their glory.” The Mentmore Towers were turned over to Mayer’s daughter, Hannah, when he died. Hannah married the Earl of Roseberry in 1878. The Earl of Roseberry became Prime Minister of England in 1894-95. The Mentmore Towers are still owned today by the son of Hannah, the current Earl of Roseberry. The Baron Mayer de Rothschild was a member of Parliament (never made a speech), and loved horse breeding and racing. He was the “sporting” member of the family. When Lionel died in 1879 a new generation of British Rothschild appeared on the scene led by Lionel’s aristocratic son, Nathaniel “Natty” de Rothschild. Natty took control of New Court, the Rothschild’s British banL He was elected to the House of Commons in 1865, and then, in 1885, Queen victoria made hIm a Lord and he entered the House of Lords – the first Lord Rothschild. The Intelligent and extroverted Natty was an ornate speechmaker, unlike his father, Lionel, and uncle Mayer. Lord Natty has been described as exclusive, lofty, humorless, “one of the three rudest men in England,” selective, blunt, aloof, powerful and a man with an explosive temper. A perfect representative of the ruling class. Said one biographer: “Although Natty lacked the soaring Intelligence of his rough, unsociable grand father [Nathan, 2nd head of the Rothschilds] he had a strong personality and the authoritative air of a man who is not accustomed to being contradicted.” Lord Natty was a good friend of Prime Ministers Disraeli and Gladstone. He played the philanthropy game of the rich very well. The powerful head of New Court was known for his charities, especially to the Jews – he was called ,,King of the Jews” as have many other Rothschilds. The haughty Lord Rothschild was even chairman of the British Red Cross. Lord Natty won the hearts of the London police (an effective measure when one is in the Illuminati). Every Christmas he presented them with a “handsome cheque,” and any officer could receive a four course meal at his home. Hence, Rothschild carriages were always given the right of way in traffic. In business Lord Natty was very conservative. He dld not take very many risks and looked only for safe family investments. His self-confidence told hIm to manage his wealth himself and not trust his Investments with people who might strike a painful blow to his riches. “Natty was brusque and humorless and dld not suffer fools gladly.” Nor could he allow his money Into the hands of a fool, caution was a necessary device as far as he was concerned. According to the writer Frank Harris the Lord Rothschild told him: ,,I go to the bank [New Court] every morning and when I say ‘no’ I return home at night without a worry. But when I say ‘yes’ Its like putting your finger Into a machine – the whirring wheels may drag your whole body in after the finger.” New Court was very powerful at this time, for example It controlled the Ruby Mines in Burma, and the banks operations covered most of South America. Brazil was the Rothschild’s “preserve” in South America, as Argentina was the “preserve” of London’s other major banking family – the Barings. While Lord Natty’s two brothers, Alfred and Leo, helped run New Court, Natty was almost totally calling the shots. “Natty stood for finance, Alfred for the arts, Leo for sport.” Son of the Queen, the Prince of Whales Albert College, Cambridge. They became good friends and soon the Prince was close friends with most of the British House and others of the Rothschild clan, Including Natty’s brothers, Alfred and Leo. The group of friends became known as ,,The Marlborough Boys”, named after the Prince’s Marlborough House at which they regularly gathered. ,,The Marlborough Boys” were intent on having fun. The small circle of partiers were living a life where “wit took precedence over etiquette…” The Prince probably had a hand in convincing the Queen to grant Natty peerage. The Rothschilds were suspected, rightfully so, of financing the Prince’s investments and paying off his debts. The Prince later became King Edward VII of England. As you can see, Rothschild influence extends far and wide. Alfred, Lord Natty’s brother, was an eccentric man. He had a zebra four-in-hand, a pet gont, a private philharmonic which be conducted and a private circus which he would ringmaster. Needless to say, the Baron Alfred was a man with flair. “He loved music, clothes, furniture, paintings, beautiful women and, above all, luxury.” He was also Involved in business – he worked at New Court and was the first Jewish Director of the Bank of England. The Baron was among those in charge of the last rites over Disraelis’ dead body (Queen Victoria might have had an affair with Disraeli that the Rothschilds covered up). Alfred’s demeanor was like that of a diplomat and was very Interested in foreign affairs. He was instrumental in easing the English – German tensions around the turn of the century. It was not to the Rothschilds benefit to have war. Alfred parted with tradition when he gave, in his will, his great wealth to his daughter. His daughter, in turn, used some of that Rothschild money to fund the expedition into Egypt that discovered Tutankhamen’s grave. Lord Natty’s other brother, Baron Leopold de Rothschild, was not much of a businessman. He much more preferred horse racing and automobiles. He had the reputation of being a kind man. His wife, Maria Perugia, was the sister of Mrs. Arthur Sassoon. The first world war supposedly hurt the British House financially (although it appears their missing riches only went underground), but as always they bounced right back (in the eyes of the public). Thus a new British House of Rothschild began the 20th century, lofty Lord Natty leading the way. **Austrian House, Late 19th and Early 20th Century** Baron Anselm von Rothschild, of the “New Trinity”, brought the Austrian House to the close of the 19th century. Anselm lived under the reputation of his father, Salomon, and his uncle, Amschel (with whom he spent a good deal of his time). But be did not necessarily ride their coat tails, he proved his worth, so to speak. His most notable act being the creation Creditanstalt, which destroyed the financial challenger of the Rothschilds, Credit Mobilier. As a young man Anselm was a bit wild and frivolous, so hi. father sent him away to apprentice. Anselm ended up working under his uncle Amschel in the Frankfort bank (which was doomed to future liquidation). Frankfort mellowed hlm, and he lived there for 30 years. When his father died in 1855, Anselm returned to Vienna to take his father’s place. He became a very active businessman. Anselm had influence in the Habsburg court. Baron Anselm’s “name was inscribed in the Golden Book of the capital and in 1861 he had been made a member of the Imperial House of Lords.” He also knew bow to incur his wrath. One club in Austria refused him membership because be was a Jew. Baron Anselm simply bought a sewage disposable unit and installed it right next to the club. The smell was horrible. The dub then tried to give him a membership card, to mend the problem, but he returned the card doused in perfume and informed them that he would not move his sewage unit. The Rothschilds set off the financial crisis of 1873 in Vienna. S.M. Rothschild und Sohne totally controlled Hungarian finance. And Creditanstalt was the financial powerhouse of the Habsburg realm. Anselm’s children carried on in Vienna after he died in 1874. Ills eldest son Nathaniel was an aristocrat, who was not interested in banking, only fine art and history. Anselm’s second son, Ferdinand, moved to England. Only Baron Albert von Rothschild, Anselm’s youngest son had a business inclination and be was chosen to take over Creditanstalt. Baron Albert and Nathaniel were the two richest men in Austria. Baron Albert “held controlling interest in innumerable industries ranging from coal to railways; and when, in 1881, he converted the famous six-per-cent Gold Loan to Hungary the bank was recognized as the greatest financial force in the empire.” Albert was afraid of the common people and he built a mansion that was more of a dtadel than a house. Its wails were seven het high, and on top of that sat another eight feet of iron fencing. Anselm’s second son, Baron Ferdinand, was a member of Prince Edward’s “Marlborough Boys.” He remained in England, becoming a naturalized citizen. ,,Ferdy” as he was called was an intellectual socialite. He built an Incredibly grandiose mansion named Waddeson Manor; one of the most awesome of all the Rothschild homes. The Manor was so marvelous that the Queen herself paid it a visit. Visitors to its halls ranged from the Empress Frederick to the Shah of Persia. Ferdinand also had a zoo. One of Anselm’s daughters also moved to England – Alice. The unmarried Alice was a very “tyrannical” person. In fact, she even yelled at the Queen when she saw her Inadvertently trampling a flower-bed. The Queen and Alice remained friends, and the Queen nicknamed Alice ,,The Al Powerful” “Alice … reigns absolutely,” wrote a cousin. “There is nothing constitutional about this monarchy. No wonder the Queen has named her ‘The Al Powerful’…” When Ferdinand died Alice received Waddeson Manor. Head of the Austrian House, Albert died in 1911. His son (none of his brothers had any children), Baron Louis became the head of the house. Louis’ brothers, Alphonse and Eugene, were “gentlemen of leisure.” Baron Louis and his two brothers both served in the Austrian army during World War I (the war supposedly split the Vienna House from the French and English Houses, I don’t believe this). The Austrian House’s wealth had to go underground during the war. After the war ended the French and English Houses put the Austrian House back “on their feet again.” Thus a new Austrian House began the 20th century, powerful Albert and suave Baron Louis leading the way. **The Morgan Connection** George Peabody, a Massachusetts’s trader, set up a banking house – George Peabody & Co. – in London in 1837. He became regarded as a “financial ambassador in London. Carrol Quigley attributes the use of tax-exempt foundations for manipulation of society to Peabody, seen in his IllumInati Peabody foundation. Daniel Colt Gilman, a member of the Skull & Bones and first President of the Carnegie Institution, was involved in the establishment of the Peabody foundation. He was in such high regard by the elite that they have erected a statue of him across from the Bank of England. Peabody was getting old and needed a younger partner. Junius Morgan, of Hartford, Connetticut, was recommended to Peabody. In 1854 Junius and his family arrived in London to join George Peabody & Co. When the elite’s concocted American Civil War broke out, Peabody and Junius Morgan raised loans for the North. It appears JunIus played both sides of the war. Ralph Epperson claims Junius was one of the Rothschild agents who shipped supplies to the South. When Peabody retired in 1864 Junius took over the business. The firm was re-named JS. Morgan & Co. That same year Junius’ son, J.P. Morgan, became a junior partner in the firm. A year later J.P. left for America to represent the firm in the New York. After the end of the Franco-Prussian War, Junius Morgan was called on to help restore the French etonomy. Around this time his bank was talked of as a rival to the Rothschild’s New Court, but Junius was a Rothschild agent, when he prospered so prospered the Rothschilds and the Illuminati. J.S. Morgan & Co. was one of the Rothschild’s great power tools in the United States. In 1869 JunIus’ son, J.P. Morgan went to London to met with the Rothschilds. They laid out the plans to form Northern Securities, a company that would act as an agent for New Court in the US. J.P. ruling as a proxy for the family. In 1871 Junius’ son, J.P. Morgan, made an alliance with Tony Drexel, heir to the powerful Philadelphia bank. Their firm – Drexel, Morgan & Co. -resided in an extravagant new building on Wall St., which is still Morgan headquarters today. After the Europeans got over their lack of confidence at the end of the CIvil War, money began to stream across the ocean to the US., providing massive profit for the firm. It set out to finance the growing number of industrial projects in America. The House of Morgan was getting extremely rich. Junius retired in 1879 and J.P. took over JS. Morgan & Co., reorganizing It under the title J.P. Morgan & Co. “J.P. Morgan soon became a symbol of the growing centralization of American money.” He was very monopolistic. His agents would create cartels through ‘Morganization.” By 1896 the IllumInati families Payne, Whitney and the Vanderbilts all bad money in Morgan-Guarantee Company which was run by the “J.P. Morgan and Guggenheim outfits.” At a certain point he controlled neariy half the American railroad system. He established the United States Steel Corp. (“based on Andrew Carnegie’s Pittsburgh Steel mills”) In 1901 by raising the “unprecedented” amount of $1.4 billion. J.P. was adept at creating financial syndicates for the Illuminati, joint efforts to further the “Great Plan.” President William Mckinley began prosecuting the Rothschild’s Morgan-run Northern Securities under the anti-trust laws in 1900. In 1901 Mckinley ran for a second term and appointed a new vice-president, Theodore Roosevelt, a lock, stock and barrel Illuminatus. Less than a year later he was assassinated. When “Teddy” became president the prosecution of Northern Securities stopped. For this reason some people think Mckinley’s death was ordered by J.P. Morgan and the Rothschilds. He was able to set up a syndicate, with the help of Rothschild agent, August Belmont, Jr., that bailed the U.S. out of a Treasury depletion. The syndicate raised $65 billion in gold. The sum would be repaid by an issue of bonds. J.P. received some criticism for the strict terms of the deal. For 5 months in early 1907, J.P. Morgan was in Europe, traveling back and forth between London and Paris, presumably visiting the Rothschild House’s there. A. Ralph Epperson writes: “Apparently the reason Morgan was in Europe was because the decision was being made to have Morgan precipitate a bank panic in America. When he returned, he started rumors that the KnIckerbocker Bank in New York was insolvent.” Panic ensued. People began a mass withdrawal of their deposits – a run. The Knickerbocker run had a domino effect, other banks had runs and the Panic of 1907, was complete.” J.P. Morgan oversaw the banking communities response to the Panic of 1907. The whole Incident helped the elite push for a central bank. One man who knew of the plot was historian Frederick Lewis Allen, who wrote in LIFE magazine: “. . . certain chroniclers have arrived at the ingenious conclusion that the Morgan interests took advantage of the unsettled conditions during the autumn of 1907 to precipitate the Panic, guiding It shrewdly as it progressed, so that it would kill off rival banks, and consolidate the pre-eminence of the banks within the Morgan orbit.” The Panic of 1907 made people want a powerful central bank that could “protect” the common man from the “abuses of the Wall Street bankers.” This whole thing eventually led to the creation of the Federal Reserve. One of the men with the Morgan financial groups was Harold Stanley. Stanley was a member of the Skull & Bones. After J.P.’s death a Morgan firm became Morgan, Stanley & Co. J.P. Morgan died in 1913. HIs son, Harvard educated J.P. Morgan, Jr. took over (most conspiratorial writers do not make a distinction between these two). J.P. Morgan, Jr ran the bank with a team of managers that was led by Thomas Lamont. Morgan, Jr was, like his father, a power-hungry international banker. He was famous for his handling of Immense foreign loans. Most Importantly J.P. Morgan, Jr appears to have followed in the footsteps of the former heads of the House of Morgan by working with the Rothschilds. **The Schiff Connection** Remember the Schiff family? In the first article I explained that they shared a residency in Frankfort, forever binding the two families. The Schiffs became Rothschild agents, and like most agents of the Rothschilds they eventually became very rich and powerful. The most prominent of the Schiffs was Jacob Henry Schiff. Jacob was born in Frankfort in 1847, and was sent by the Rothschild/Schiff network to America to make his fortune (Much like the Astors sent John Jacob Astor). Jacob Schiff arrived in New York in 1865. Ten years later he became the partner of the Illuminati firm Kuhn, Loeb & Company. Ten years after that he became Its president. Directing Rothschild and IllumInati affairs from this seat of authority. Jacob Schiff was also on the board of directors of Central Trust Company, Western Union. and Wells Fargo Company. Uke most elite, he gave vast amounts of money to charity. Philanthropy pays off in a big way to the ruling class. **Jekyll Island** The Illuminati interests wanted to create a Central Bank in America. They wanted to build the Federal Reserve. First, they needed a bunch of banking crisis’ that would push public opinion towards a Federal Reserve system. These were provided by the Illuminati, including J.P. Morgan’s Knickerbocker Panic of 190?. Second, they needed a favorable U.S. president in office. Rothschild agent Colonel House provided this by getting Woodrow Welson elected. The American people were being couditioned. To provide the ‘reform of the American banking system” a congressional National Monetary Commission was created and a man related to the Rockefellers, Nelson Aldrich, was put in charge. For two years this Commission travel around Europe hob-nobbing with the IllumInati and getting directions as to how the central bank should be set up. Then the Commission returned in 1910, and Nelson Aldrich went to a secret meeting at the Jekyll Island Hunt Club in Georgia to write the legislation for an American central bank to be run by the IllumInati. Others at the Jekyll island meeting were these Illuminati men – A. Platt Andrew, Frank Vanderiip (of a Kuhn-Loeb & Company bank), Henry Davidson (of J.P. Morgan), Charies Norton (of a Morgan bank), Paul Warburg (of Kuhn-Loeb & Company and brother-in-law of Schiff), Benjamin Strong (of another Morgan company). Most of these men were connected to Jacob Schiff or J.P. Morgan, who in turn were agents for the House of Rothschild. The Jekyll Island Hunt Club was even owned by J.P. Morgan. The Federal Reserve bill was sneakily passed through congress in the winter of 1913 and President Woodrow Wilson signed the bill into law. The Illuminati, particularly the Rockefellers and Rothschilds, bad usurped the financial power of the United States. The first governor of the New York branch of the Federal Reserve was Benjamin Strong. The first governor of the FED’s board of directors was Paul Warburg. Both connected to Schiff, J.P. Morgan, Jr, and the House of Rothschild. The FED has been an effective tool of the Illuminati and the Rothschilds, creating crisis such as the Great Depression (which J.P. Morgan, Jr was very involved in creating). Apparentiy (according to Congressman Louis McFadden), the Depression helped consolidate financial power over the US., putting It in the hands of the Rothschild banking alliance between J.P. Morgan’s First National Bank group and Schiff’s Kuhn, Loeb-run National City Bank. The Great Depression also lead to Roosevelt’s New Deal. **World War I** Rothschild connections to the first worid war are an excellent example of controlled conflict. On the Allied side the British and French Houses financially supported their countries battles. Some Rothschilds were even soldiers, although they didn’t see much action. J.P. Morgan Bank was a big financial help to the Allied cause. It was the Allies “purchasing agent” until the U.S. entered the war. It also created a syndicate that financed “modernization” in China, to help defend that country against the Japanese threat. The elite wanted America in the war. Historian Charles Tansill noted: ,,… the large banking Interests were deeply interested in the World War because of wide opportunities for large profits. On August 3, 1914, even before the actual clash of arms, the French firm of Rothschild Freres cabled to Morgan and Company in New York suggesting the floatation of a loan of $100,000,000, a substantial part of which was to be left in the United States, to pay for French purchases of American goods.’ The Lusitania was a ploy. It was packed with some Morgan owned ammunition, had been given over to England as a member of the navy, and despite the warnings of the Germans was sent Into a naval war zone, specifically to be a target – the catalyst for America’s entrance to the war. A knowledgeable American State Department failed to warn the US. citizens aboard the ship of the voyages definite danger. Churchill ordered the Lusitanina’s naval escort to return to port, and the fated ship was left unprotected, to be sunk. Rothschild agent Colonel House probably knew of this plot, records point to a discussion of it between him and Sir Edward Grey of England. Historian Colin Simpson called the sinking of the Lusitania the “foulest act of willful murder ever committed on the seas.’ On the Axis side the Rothschild network was also funneling money. Another family allied to the Rothschilds was the Warburgs. Max Warburg, brother of Kuhn-Loeb’s Paul Warburg. ran a family financial powerhouse in Frankfort, Germany (one of the reasons the Rothschilds were able to liquidate their Frankfort bank, the Warburgs would run things). Max was the head of the German secret police during WWI. The Warburg connection is reported to have helped the Axis powers financially. At the end of the war in 1919, the Treaty of Versailles meetings were attended by Rothschild connected men like Paul and Max Warburg, John Foster Dulles (of Kuhn-Loeb), Colonel House, Thomas Lamont (of Morgans) and Allen Dulles (of Kuhn-Loeb). The harsh terms of the Treaty of Versailles totally set the stage for World War II. Said one delegate: ‘This is no peace; this is only a truce for twenty years.” Sure enough, in 1939 the second World War started. Another product of the Versailles meetIngs was the elite’s Charter for the League of Nations – the Illuminati’s first attempt at creating a global institution. The League of Nations failed. This called for the need to create a think tank/special Interest organization that could promote the new world order. Thus the creation of the Foreign Relations Institutions – the CFR., RIIA, etc. This will be discussed in a bit. World War I helped create a Communist State. Max Warburg funded Lenin and his revolutionaries. Jacob Schiff gave a known $20 million to Lenin. J.P. Morgan & Co. helped finance the Bolshevik revolution. Alfred de Rothschild also helped finance the Bolsheviks. **World War II** The second World War was also controlled by Illuminati and Rothschild interests. The Great Depression did not only occure in America. It also swept Europe. The economic depression in Europe, coupled with an extremely harsh Versailles Treaty helped fan the flames of the nationalistic fires that swept Germany. Hitier was a member of the most powerful occultic secret society in Germany. He penetrated the inner circle of this society where Satanism was practiced. Hitler was dedicated to Satan’s Empire – an evil puppet. He was brought into this evil group by Dietrich Eckart who is supposed to have said on his deathbed: “Follow Hitler. He will dance, but It is I who have called the tune! I have initiated him into the ‘Secret Doctrine’; opened his centers in vision and given him the means to communicate with the Powers. Do not mourn for me: I shall have influenced history more than any German.’ In the last article we discussed the possibility of Hitler having been of Rothschild descendance. Consider this – he probably had satanic bloodline, he had the backing of a powerful satanic society, he had sold his soul to Satan, and he had the financial backing of the Illuminati. is it any wonder that he rose from obscurity, poverty and Imprisonment to become one of the most powerful men to ever live? I believe that It is even safe to specuiate that Hitler was totally controlled by a demonic spirit(s); that he simply gave himself over to Satan’s control. An ex-member of the Satanic Hierarchy of the Illuminati expressed a belief to me that there have been certain evil men through-out history that have totally given themselves over to possession by Satan. That these men (Hitler, Ghengis Khan, for example) have been anti-christ types, simply human containers for the residence of a very powerful demonic spirit, or even Satan himself. The ex-illuminati member believed that when Satan no longer had need for the body of his anti-christ he would discard It with death and find another willing soul to sacrifice his bodily control to the devil. These evil figures would not be ‘The” Anti-Christ, explained the informant, but would have allowed themselves to taken over by “the spirit” of the Anti-Christ. This is just a theory, but I believe it has certain merit. If it is true, it paints an interesting picture of Hitler and the ruling class that created him. Hitler’s main source of economic power was from the I.G. Farben chemical cartel, and I.G. Farben in turn was controlled by the Illuminati. The I.G. Farben cartel was created by loans from Wall Street in what has been called the Dawes plan. Carroll QuIgley calls the Dawes Plan “largely a J.P. Morgan production.” The J.P. Morgan Group set up the loan to I.G. Farben, which created Hitler. ,,Without the capital supplied by Wall Street, there would have been no I.G. Farben in the first place, and almost certainly no Adolf Hitler and Worid War II.” Henry Ford merged his German assets with I.G. Farben in 1928. The cartel created the lethal Zyklon B gas that was used to exterminate the Jews. It was also involved in the torture experimentations that led to mind control methods, such as Monarch Programming. Do you see what happened? A Rothschild agent set up a cartel that was directly involved in the horrible persecution of the Jews. Still the family maintains the illusion of being totally supportive of their race. At first Germany had a significant disadvantage if they were to embark on a second world war. The nation had a fuel shortage, but the Illuminati fixed this problem. The Germans were able to fight WWII through the use of synthetic fuels that were created by the hydrogenation process (turning coal into gasoline). This process was discovered by I.G. Farben. Hydrogenation technology would not have been fully developed by WWII, but I.G. Farben made a deal with Rockefeller’s Standard Oil, who was able to complete the research, facilitating the war. Interestingly, I.G. Farben plants were not targeted by the bombing raids on Germany. By the end of the war the refineries had experienced only 15% damage. William Dodd, American ambassador to Germany before WWII, wrote President Roosevelt: “At the present moment, more than a hundred American corporations have subsidiaries here or cooperative understandings. ,,The DuPonts have their allies in Germany that are aiding in the armament business. Their chief ally is the I.G. Farben Company… ,,Standard Oil Company … sent $2,000,000 here in December, 1933 and has made $500,000 a year helping Germans limprove hydrogenation technology] … ,,The International Harvester Company president told me their business here rose 33% year, but they could take nothing [earnings] out [except in goods]. ‘Even our airplanes people have secret arrangements with Krupps. ‘General Motors Company [which was controlled by the J.P. Morgan Group] and Ford do enormous business here through their subsidiaries and take no profits out.” Germany needed the capital of these, and many more American companies in order to wage a war. I.G. Farben had a holding company in the United States called American I.G. Farben. Paul Warburg, his brother Max (head of Germanies secret police during WWI), and Warburg agent Herman Metz were some of the members of the board of directors of the American I.G. Farben. Other directors included Rockefeller/International banking men (Edsel Ford, Charies Mitchell, Walter Teagle, etc) . Three Germans on the Board of Governors were convicted as war criminals after the war, but the elite Americans fore-mentioned were not, even though they participated in the same criminal decisions as those who were punished. According to author Eustice Mullins, Hitier met with Allen and John Foster Dulles in 1933. The Dulles brothers were acting as legal representatives of Schiff and Warburg’s Kuhn, Loeb & Co, which was an Integral part of the Rothschild network. Mullins claims Kuhn & Loeb had extended large short-term credits to Germany, and needed to ensure the repayment of these loans. The Dulles supposedly assured Hitler he would receive the funds necessary to be installed as Chancellor of Germany, if he promised to repay the debts. One of the largest tank manufacturers for Germany was Opel, which was controlled by the J.p. Morgan Group. Another company connected to the J.p. Morgan Group was Bendix Aviation, ‘which supplied data [to Germany] on automatic pilots, aircraft Instruments and aircraft and diesel engine starters.’ The examples go on and on. There is much more that could be written on this subject. The manufactured Pearl Harbor attack allowed Roosevelt to enter America into the war. A second worid war had been created by the Illuminati, with the help of the Rothschild/Morgan/Warburg/Schiff syndicate. After the end of the war, the Tribunals that investigated Nazi war criminals censored “any materials recording Western assistance to Hitler,” said historian Antony C. Sutton. **Globalism** World War II facilitated the American acceptance of a giobal ‘peacekeeping” institution – the United Nations. After the U.S. had rejected the first attempt to create such an institution in the League of Nations, the illuminatI decided to create an arm of the Rothschild funded Round Table groups which could help influence western society towards the embracement of globalism. The original idea was to create an international special interest group of advisors that would promote a New World Order, called the Institute of on International Affairs. The plan eventually changed, the Institute was split up so that separate groups could influence separate governments without having the appearance of a conspiracy. These groups were formed at what are called the Hotel Majestic meetings. Baron #1 Edmond de Rothschild of France was the main force behind these meetings, and all the founders of these groups were men who had met with his approval. Chief of these was Rothschild agent Colonel Edward Mandell House. One of these groups was the CFR.. The CFR Handbook of 1936 explains how It was established. ‘On May 30, 1919, several leading members of the delegations to the Paris Peace Conference met at the Hotel Majestic in Paris to discuss setting up an international group which would advise their respective governments on international affairs…. It was decided at this meeting to call the proposed organization the Institute of International Affairs. At a meeting on June 5, 1919, the planners decided it would be best to have separate organizations cooperating with each other. Consequentiy, they organized the Council on Foreign Relations, with headquarters in New York. and a sister organization, the Royal Institute of International Affairs [RIIA], in London, also known as the Chatham House Study Group, to advise the British Government. A subsidiary organization, the Institute of Pacific Relations, was set up to deal exclusively with Far Eastern Affairs [and facilitated the Pearl Harbor attack] . Other organizations were set up in Paris and Hamburg, the Hamburg branch being called the Institut fur Auswartige Politik. and the Paris branch being known as Centre d’Etudes de Politicque Etrangere…” I have never seen any research on the Institut fur Auswartige Politik in Germany. It wouid be interesting to see how this group was Involved with the elite and the creation of WWII. A group of Illuminati wise men took the plans laid out at the Hotel Majestic meetings and formed the CFR. The founders included; Colonel Edward Mandell House (a Rothschild agent), John Foster Dulles (of Rothschild connected Kuhn, Loeb & Co.), and Allen Dulles (also of Kuhn, Loeb & Co.). The CFR was officially founded on July 29, 1921. Money for the founding came from J.P. Morgan, Bernard Baruch, Otto Kahn, Jacob Schiff, Paul Warburg, and John D. Rockefeller, among others. The funding for the RIIA in London came primarily from the Astor family. Rothschild-connected Paul Warburg was on the original board of directors of the CFR. As you can clearly see, the Rothschild network had significant influence in the creation of the foreign relation groups. This influence continues today. The Rothschild’s power within the secret “Society of the Elect” and the Round Table Groups extended to the semi-publIc CFR, RIIA, etc. The House of Rothschild was up in arms with their feilow elites; managing the creation of the New World Order. Should there be a part 3 to this series, it will Investigate individual Rothschilds from the worid war era up into the modern day world, and their continuing involvement in the Illuminati. **Bibliography:** Cowles, Virginia. THE ROTHSCHILDS: A FAMILY FORTUNE. New York: Alfred A Knopf, Inc., 1973 Sampson, Anthony. THE MONEY LENDERS. New York: Penguin Books, 1983 Morton, Frederic. THE ROTHSCHILDS: A FAMILY PORTRAIT. New York: Collier Books, 1991 Wechsberg, Joseph. THE MERCHANT BANKERS. New York: Pocket Books, 1968 Still, William. NEW WORLD ORDER. Lafayette, Louisiana: Huntington House Publishers, 1990 Sutton, Antony C. AMERICA’S SECRET ESTABLISHMENT: AN INTRODUCTION TO THE ORDER OF SKULL & BONES. Liberty House Press Mullins, Eustace. THE WORLD ORDER. Boring, OR: CPA Book Publisher, 1985 Epperson, A. Ralph. THE UNSEEN HAND. Tucson, Arizona: Publius Press, 1985 **A Note About the Krupps of Germany** It has been said by an Illuminati informant that the Krupp ramily is part of the Illuminati. It is clear that that the Krupp family must be at least in agreement to the plans of the Illuminati. This can be said because of the extensive power of the Krupps. The Krupps were the primary producers of the big guns for the German army in W.W.I. Lenin wanted the Krupps to help him make the Russian steppes productive. The Krupps have produced agricultural equippment, and train locomotives as well as tanks. After W.W. I had ended, the head of the Krupp family, Gustav Krupp von Bohlen und Halbach, began secretly planning to rebuild Germany’s military might. Gustav Krupp bought coal mines after W.W. I with an eye on using them for future weapons production. After the Allied Control Commission departed Germany in 1928, Krupp factories began secretly turning out a few tanks particularly at Krupp’s Garusonwerk Factory. The Christian Science Monitor which ties in with the occult system sent reporters to Krupps factories during the 1920s to report on how well the Germans were complying with the Versailles Treaty limitations. The reporters gave a clean bill of health to the Krupp factories even though the reporters should have questioned why all their film was destroyed during factory tours (infared rays were beamed Into their film while they toured Krupps factories.) Prussian-trained Gustav Krupp had married the daughter of Friedrich Krupp whose name was Bertha. Bertha was a powerful woman, and sole owner in 1902 of one of Germany’s largest steel firms. The Krupps have lived above Essen, German in a hugh palace called Villa Huegel, whose small wing has 60 rooms. They also have other castles and villas. At one time they owned (as far as I know they still do) a castle in the Austrian Alps named Bluehnbach. Gustav Krupp hosted and was one of the leaders of a secret group of 12 powerful German industrialists called the Ruhrlade which secretly made Germany’s industrial decisions during the Weimar Republic. This group also made political decisions. In 1932, Krupp began to help HItler. The secret governing body of the Ruhrlade covered their meetings behind the cover of having lavish hunting parties. The Illuminati kept close tabs and gave secret support to Hitler on his rise to power. Illuminatus William Randolph Hearst had his chief European correspondent William Bayard Hale met with Hitler early in the 1920s at Hale’s lavish suite at the Hotel Bayrisher Hof. **Part 3** **The Rothschilds Today** by Fritz Springmeier Introduction to Part 3. The Rothschilds are one of the most prominent of the top thirteen Illuminati families. This newsletter has been singling out each of the top thirteen Illuminati families for a feature article. Articles in this newsletter have already been done on the Astor, Buady, Collins, DuPont, Freeman, U, Kennedy, Onassis, and Van Duyn families. The Rockefellers were featured in a December 1992 article just prior to this series. Because there is more Information out about the Rothschilds than some of the other families, I decided to write more than just one feature article about them. **Reviewing the recent newsletter articles** The first set of my recent Rothschild articles consisted of my Introduction and then main article. The Introduction covered the hidden lineages of the Springs, the Payseurs, the Beatty family and Abraham Lincoln. The main article by David Smith covered the 18th and 19th centuries of Rothschild power. The second set of articles again consisted of my introduction along with a main article. In my Introduction I covered some about their secret power, their power in Latin America, and their secret power to manipulate financial things without playing the same rules as others play. David Smith’s main article covered the Rothschild’s influence in history in the late 19th century and during the 20th century. **The Rothschilds a daily threat** My desire was to have an article about what the Rothschild’s are doing today. One of my most dangerous opponents in this area to the work I’m doing against the Monarch program is a secret Rothschild descendent. I know Monarch slaves who were created to serve the Rockefeller family, the Russell family, the 13th Holy Blood Family, the Li family and the CollIns family. I also know Monarch slaves who were created to serve the Rothschilds. From what I have been told and also from just personal observation, all of the top 13 IllumInati families are involved in the creation of Monarch slaves. It goes without saying that It is Impossible to be a high level Satanist and not have MPD. Any person without MPD would go insane after participating in high level Illuminati rituals. It can’t be stated with certainty that all Illuminati members (by Illuminati I mean members of the first pyramidal structure diagrammed in the Jan. 1, ’93 newsletter and in the Feb. I Issue) have been through Monarch programming today, but it can be stated with certainty that they all suffer from multiple personality disorder. This means that the Rothschilds in this country and in Canada and the U.K.. have closely collaborated with the highest levels of the intelligence community and the military. Who initiated my phone being tapped? At any rate, the Rothschilds and their satanic power is here in America, and people need to understand that. **The first great temple** The Illuminati are building their temples secretly throughout the United States. The last issue of this newsletter described the massive pyramid that has been built at Los Vegas. Pyramids have also been built at San Francisco (the Trans-America building) and in Chicago, and in other eastern places. The San Francisco building was built by people with ties to the Rockefellers. Just north of San Francisco and east of the Bohemian Grove is the Napa Valley of California. Anton LaVey moved to Napa Valley after his split with Aquino. LaVey ran a construction company during the 1910. out of Napa, CA. (As an aside, Anton LaVey’s chief representative in our Portland area is Rex ,,Diablos” Church, who grew up as Rex Nance in Seaside High School on the Oregon coast. Rex worked at the drug store at Broadway and Holiday at Seaside during high school. Two years after high school he returned to his hometown with his head shaved and wearing black in LaVey fashion. He had a stripper who dressed in black who was a Satanist as his girl friend for a while in the Portland area. According to Rex’s own words, he grew up in a secret Satanic family and was baptized to Satan as a child. Rex and his Satanic friends have schemed how to hurt the Christians. How many of their devious plans have succeeded I do not know. Also of Interest is that Rex lived a good deal with his what has been reported as Jehovah’s Witness grandparents.) With the Church of Satan feeling comfortable in Napa, it is not surprising that tbe Baron and Baroness Phillipi de Rothschild picked the area to build a secret temple to Satan. Also as readers of this newsletter know, these people have been constructing castles and other large buildings on spiritual ley lines for centuries, so it goes without saying that when this secret temple was built in Napa, that the Icy lines were at least considered in choosing a site. The Baron Rothschild began the construction of a pyramid in Napa Valley, which his wife completed after he died. The pyramid is called Opus 1. According to one of the contractors who participated in building the pyramid, the project cost $35 million. The various construction cost reports given the public have been much less than what this contractor has said was the real cost of the building. The theme of the numbers 3 and 6 runs throughout the large Opus i pyramid building. as well as the number 666. Also little circles frequently appear. The name of the building is Opus 1, which means the First Work. It’s cover or front for the temple is that It is a winery. The winery operates very strangely to a legitimate winery. The entire project of buying the land, building Opus 1, and operating it has been shrouded in secrecy. The wineries in California when they open traditionally and normally are open to the public. The opening ceremonies of Opus 1 were shrouded in secrecy. The opening announcement was low key and only select people and select International media types were Invited. This opening is extremely unusual for a winery in the Napa Valley area. Private guided tours are very hard to obtain of Opus 1, in contrast to the other wineries in Napa Valley. Further, the estate that the winery (temple) sits on is very protected and secluded. The wrought iron gates are always closed. However, I was able to get a first hand report from a group of three that managed to view Opus 1. During the tour this group saw many occult and satanic items, and yet large areas of the winery (temple) were closed off to even this private tour group. The winery is not constructed even remotely similar to any winery in the Us. The project began as a joint venture between Robert Mondavi and Baron Rothschild in 1979. The land was secretly purchased and in the late 1960s construction quietly began using contractors from far away. Strangely, the Napa Valley Register which reports on all building activity remained extremely quiet about what was being built. From the air, the construction forms a masonic square and compass. On the Inside hidden stairwells and other hidden features have been built in. The capstone of the pyramid has a rotunda where skylight penetrates the capstone and where viewers can get a view of the entire Napa Valley. There have numerous Rothschilds who have entered Into the various Masonic rites. For Instance, Louis Rothschild was a 32° Scottish Rite Mason in Chicago during the 1890’s. The reason for this is that Freemasonry is used as type of early class for those who are in the Illuminati to get them familiar with the symbols of the Mystery religions and give them more practice with hand signals, rituals, and secrecy. Orchids, which are used by the Mothers of Darkness, are grown all over the area. Orchids are the only type of flower grown on the site, and they are cared for by apparently Mothers of Darkness who are dressed in all black, which is the standard color of garb of the Mothers of Darkness. The pyramid was built with limestone from Texas. No doubt there is some occult significance to the site that the limestone came from. The limestone itself has fossils, which have been hidden from easy view for some reason. (Remember the ancient Egyptian pymmids used limestone.) Originally Opus I was scheduled to open around the Summer Solstice but the date was shifted to Weds., Oct. 30, 1991 which is the day before Halloween. Since the opening day, the Rothschilds have had events scheduled around Satanic high days. Those who are familiar with the occult know that these events are covers for Satanic rituals which are held secretly. The land has wrought iron gates which are locked at all times. Some of the occult Items which private visitors saw within the pyramid were: a book on wine depicting orgies by Salvadore Dailey who is a Satanist, a blue-black picture with naked ritual dancers, and other strange occultic pieces of art (such as an oil painting of what looked like Satan). Massive draconian oak doors are built facing the hail that leads to the room where wine is tasted. Mirrors abound in the place. The guilded art work on the mirrors is often Rococo. The Baroness personally designed and furnished the Interior. The upside down peace sign is found designed in some of the furniture as barren trees. Two trees of life from Peru are by the fireplace. The tree of life is by the way very Important to this level of the Illuminati. The visitors also saw 3 Mouton ceremonial drinking cups with rams, and chairs which had the carvings on the front arms/legs of fully formed demons were found in one of the rooms. The foyer looks like the Inside of a snail or “corkscrewy.” Much of the furnishings were purchased by the Baroness Rothschild from the De Medicis. It has various marble floors and tables set with orchids. The stainless steel and the floors in the winery are immaculate. The workers who work there were scrutinized closely before being hIred. Originally, the wine workers were required to were black pants and white shirts, but the workers who had to stomp the grapes were unhappy about the uniform requirements. I have been trying to follow the Rothschild family with Its many branches. Although the Rothschilds are seen as great internationalists, don’t be surprised If some of the people of the Rothschilds seem somewhat middleclass, For instance, in the Millington, MI NE of Flint, MI one family dominates the tows. This family is the Bauer family. Stan Bauer was a man who mysteriously simply attracted material possessions to himself without any visible source of money. His son Harold Bauer a 32° Mason who sat on the Houghton Lake city counciL His next son Terry Bauer was also a Mason, also had a position in local government and was on the school beard. His daughter Barbers Bauer married Jim Hagger who was also a Mason who lived in Grand Blanc south of Flint. There is certainly more that could be said about the satanic Rothschild bloodline, but this is where I will bring this article to a close, with the statement that, Lord Welling, I will write more about them later. **Related Articles** **Rothschild Family Wealth is Five Times that of World’s Top 8 Billionaires Combined** **Benjamin de Rothschild is Forcing Native Pygmies Off Their Own Land So the Elite Can Slaughter Elephants** **Hillary Clinton Begs Forgiveness From Rothschilds In Leaked Email** **The House of Rothschild, the Freemasons & the Federal Reserve Cartel** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Solve Captcha*66 − 64 = Popular Recent Comments List of Deep Underground Military Bases (DUMBs)November 29, 2016 The USAs Most Secret Plane — TR-3B Patent is Now in the Public DomainMay 17, 2017 What is GESARA?October 24, 2016 The Rothschild Bloodline: One of the 13 Satanic Bloodlines that Rule the WorldMarch 20, 2016 2-Billion-Year-Old Nuclear Mega-Reactor Discovered in AfricaMay 29, 2015 Finding a Medical Malpractice Lawyer1 week ago Major Challenges in Nonprofit Accounting and How to Overcome Them2 weeks ago Enhancing scRNA-Seq Accuracy: The Transformative Role of Automated Cell CountersMarch 26, 2025 Exploring Kohler’s Luxury Faucets for Eco-Conscious HomeownersMarch 6, 2025 What Makes Excel Consultants Essential for Tailored Business Solutions?October 18, 2024 Ravi MadanayakeThe anomaly in the microwave background could just be due to... The anomaly in the microwave background could just be due to... The anomaly in the microwave background could just be due to... Mike HeathHillary is nothing but a small insignificant barking dog, as... Hillary is nothing but a small insignificant barking dog, as... Hillary is nothing but a small insignificant barking dog, as... Net Worth527 Tips353 Business348 Health263 Music168 House154 Science130 News123 Blog106 Tech105 TV Show102 Finance99 Gambling98 Television personality87 Sport79 Reality star76 Singer67 Actress66 Rappers65 Actor61 History58 Education57 Style53 Cars50 Uncategorized47 Celebrities47 Casino43 CBD39 World98Travel63Foods8Games2 Travel63 Foods8 Games2 Travel63 Foods8 Games2 Law35 Life Style34 Football player34 Gaming31 Athlete26 Relationship26 Website21 Pets19 Housewives18 Rothschild Family18 Basketball player17 Marketing15 Cryptocurrency13 Businessman13 Politician10 Artist10 Social Media9 Food8 Wrestler8 Model7 fashion5 Software5 Nikola Tesla5 Producer5 Hillary Clinton5 Beauty4 Stylist4 Entertainment4 Religion3 Tattoo artist2 Hobby2 Kitchen2 Moving2 Racer2 Radio2 Tax1 Ebola1 George Soros1 DJ1 Manager1 Travel1 Email :desk@theeventchronicle.com March 6, 2025Exploring Kohler’s Luxury Faucets for Eco-Conscious Homeowners **Exploring Kohler’s Luxury Faucets for Eco-Conscious Homeowners** **Exploring Kohler’s Luxury Faucets for Eco-Conscious Homeowners** **Exploring Kohler’s Luxury Faucets for Eco-Conscious Homeowners** August 2, 2022How to Make Sure Your Aqua Shoes Are the Right Fit **How to Make Sure Your Aqua Shoes Are the Right Fit** **How to Make Sure Your Aqua Shoes Are the Right Fit** **How to Make Sure Your Aqua Shoes Are the Right Fit** August 1, 20225 Best Kids Soccer Shoes 2024 – Buying Guide **5 Best Kids Soccer Shoes 2024 – Buying Guide** **5 Best Kids Soccer Shoes 2024 – Buying Guide** **5 Best Kids Soccer Shoes 2024 – Buying Guide** Facebook X YouTube Instagram NewsList of Deep Underground Military Bases (DUMBs)November 29, 2016 The USAs Most Secret Plane — TR-3B Patent is Now in the Public DomainMay 17, 2017 What is GESARA?October 24, 2016 The Rothschild Bloodline: One of the 13 Satanic Bloodlines that Rule the WorldMarch 20, 2016 2-Billion-Year-Old Nuclear Mega-Reactor Discovered in AfricaMay 29, 2015 April 7, 2016Evidence Of Parallel Universes **Evidence Of Parallel Universes** **Evidence Of Parallel Universes** **Evidence Of Parallel Universes** October 18, 2016Hillary Clinton Begs Forgiveness From Rothschilds In Leaked Email **Hillary Clinton Begs Forgiveness From Rothschilds In Leaked Email** **Hillary Clinton Begs Forgiveness From Rothschilds In Leaked Email** **Hillary Clinton Begs Forgiveness From Rothschilds In Leaked Email** March 29, 2014Your Aura and How It Affects Others **Your Aura and How It Affects Others** **Your Aura and How It Affects Others** **Your Aura and How It Affects Others** 1 week agoFinding a Medical Malpractice Lawyer **Finding a Medical Malpractice Lawyer** **Finding a Medical Malpractice Lawyer** **Finding a Medical Malpractice Lawyer** April 5, 2014What is Project Blue Beam? **What is Project Blue Beam?** **What is Project Blue Beam?** **What is Project Blue Beam?** April 15, 2014The Rockefeller/Rothschild Energy Cartel: Speculators, Cartels & Myth of Scarcity **The Rockefeller/Rothschild Energy Cartel: Speculators, Cartels & Myth of Scarcity** **The Rockefeller/Rothschild Energy Cartel: Speculators, Cartels & Myth of Scarcity** **The Rockefeller/Rothschild Energy Cartel: Speculators, Cartels & Myth of Scarcity** Ravi MadanayakeThe anomaly in the microwave background could just be due to... The anomaly in the microwave background could just be due to... The anomaly in the microwave background could just be due to... Mike HeathHillary is nothing but a small insignificant barking dog, as... Hillary is nothing but a small insignificant barking dog, as... Hillary is nothing but a small insignificant barking dog, as..."}