{"id": 2103, "name": "Post Carbon Institute", "domain": "postcarbon.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.postcarbon.org/publications/power-limits-and-prospects-for-human-survival/", "title": "Power Limits And Prospects For Human Survival", "content": "DonateD SubscribeS **** Issue AreasThe Big PictureThe Great UnravelingCommunity ResilienceThe Energy TransitionLimits to Growth The Big Picture The Great Unraveling Community Resilience The Energy Transition Limits to Growth The Big Picture The Great Unraveling Community Resilience The Energy Transition Limits to Growth ProductsResilience.orgBooks + ReportsOnline CoursePodcastsWebsitesVideos Resilience.org Books + Reports Online Course Podcasts Websites Videos Resilience.org Books + Reports Online Course Podcasts Websites Videos EventsUpcoming EventsPast EventsRequest a SpeakerSpeakers Bureau Upcoming Events Past Events Request a Speaker Speakers Bureau Upcoming Events Past Events Request a Speaker Speakers Bureau About UsAbout UsStaffBoardAdvisorsFinancialsDonateFAQsContact About Us Staff Board Advisors Financials Donate FAQs Contact About Us Staff Board Advisors Financials Donate FAQs Contact **Books + Reports** **Power: Limits and Prospects for Human Survival** Richard Heinberg September 15, 2021 Featured inBloomberg Best Books of 2021. Power: Limits and Prospects for Human Survivaltraces how humans have come to overpower the earth’s natural systems and oppress one another…with catastrophic implications. Humanity must act quickly to prevent environmental and economic collapse. But is it even possible for human beings to deliberately rein in our power?Powerlays the groundwork to understand what we’ve done and how to fix it. Visitpower.postcarbon.orgfor these additional resources: Description and Table of Contents Podcast Reading Guide Chapter commentaries Discussion webinar recordings Power: Limits and Prospects for Human Survivalby Richard Heinberg. Published 2021 by New Society Publishers. Paperback. 416 pages. ISBN 9780865719675. Also available as an eBook and audiobook. **About Power** **Praise forPower** “In this book Richard Heinberg offers a powerful new way of understanding the historic rise and probable fall of our species. It is an impressive, sweeping, and thought-provoking narrative.”—Dennis Meadows, coauthor,The Limits to Growth “Richard Heinberg is a writer of unfailing interest and this book sums up much of his life’s thinking. Understanding our dilemma in terms of power is, well, a powerful way for getting at the predicaments and possibilities of this fraught moment in our evolving history as a species.”—Bill McKibben, author ofFalterand co-founder of 350.org “Richard Heinberg’s panoramic review of known forms of power is both sobering and inspiring. Given our species’ habitual methods for getting its way, be these methods physical, mental, or social, the outlook for our future is bleak indeed. Yet, Heinberg allows for the slim but real possibility of exercising restraint. If we are so persuaded, by wisdom or love for beauty, the future even now remains open. Indeed, such restraint returns us to ancient, almost forgotten appetites and capacities.”—Joanna Macy, author,World As Lover, World As Self “A profound, rigorous, convincing, and actionable lesson on how to understand power less as the control one has over others than as the collective capacity we have to share with one another. A rich, moving, and necessary treatise from our most accomplished, coherent, and compassionate thinker on sustainable futures. This can still be accomplished.”—Douglas Rushkoff, author,Team Human “Heinberg goes to the very heart of the issue. Using his immense knowledge of biology, science, history, psychology. and the politics of energy, he shows that the environmental and social crises we face today have in their origin the insatiable human pursuit (and often abuse) of power, in all its forms.“In showing us the path forward, Heinberg guides us to achieve power-limiting behavior so that we can not only survive but thrive on a healthy planet and in healthy balance with one another.”—Maude Barlow, cofounder, The Blue Planet Project “I’ve thoroughly enjoyed readingPower. It brings a half century if scholarship and thinking into clear focus.”—David Orr, Paul Sears Distinguished Professor of Environmental Studies and Politics Emeritus, Oberlin College “Power: Limits and Prospects for Human Survivalis sweeping in scope and a powerful presentation. Richard Heinberg is willing to face the harsh reality of multiple, cascading social and ecological crises without flinching, and he has written a comprehensive book offering readers a framework moving forward that isn’t based on wishful thinking. Drawing on his decades of activism and research, Heinberg explains why power and energy are central concepts for understanding the human predicament and shaping our future.“Equal parts science and philosophy, history and contemporary analysis, Power is more engaging than a scholarly tome and more thoughtful than journalism. Heinberg’s book is a model of public scholarship about life-or-death challenges to human societies.“—Robert Jensen, Emeritus Professor, University of Texas at Austin “Poweris an extraordinary tour de force. It is a comprehensive compendium of how it has emerged, despite our self-proclamation to be sentient beings, that we now find ourselves scrambling on the edge of a cliff. Ironically this perilous rock-face is one that we ourselves have created. As a species, spurred on by the power of our migrant curiosity, we have exploited the immediate opportunities of the natural world while blindly discounting the future. But our planet keeps score — and fortunately so does Richard Heinberg.“Poweris a must-read. It is a call to action for those seeking a sustainable, balanced, human future in harmony with the Earth. No guarantees, of course, but harnessing the power of sentient action certainly beats the alternative: of continuing our blind stumble only soon to be swept aside, as have many creatures before us.”—Peter Whybrow, author,The Well-Tuned Brain: Neuroscience and the Life Well-Lived “Poweris Heinberg’s masterwork. And it could not be more timely, arriving just as that window of time for action threatens to slam shut. Ignore this book at your peril.”—Stan Cox, author,The Green New Deal and Beyond “Powerserves as a Rosetta Stone to decipher how our species went from one of many to apex predator in a very short time. A necessary book to fully understand the imperative that our species return to “right relation” in this critical time.”—Peter Buffett, composer and philanthropist “Heinberg’sPoweris a searing, unflinching revelation of what has driven us to our current existential crisis: humanity’s quest for power. Impeccably researched and masterfully written, this book explains how and why humanity is driving itself off the cliff. If there is any hope for us to continue, Heinberg shows why it must come from efforts to limit our own power.”—Dahr Jamail, author ofThe End of Ice: Bearing Witness and Finding Meaning in the Path of Climate Disruption “Poweris Richard Heinberg at his synthesizing best. In this sweeping volume, he deftly links raw energy – essential for anything to happen in the physical world – to the exercise of political power in the cultural domain.“If the productive use of energy to expand is the ultimate key to evolutionary success, then humanity has no equal on Earth. But energy is also the ultimate source of material success, society’s addiction to economic growth and the international power politics that are destroying the planet. InPower, Richard Heinberg asks whether we can avoid catastrophe. Will competing nations’ primal lust for power give way to high intelligence, mutual trust, and unreserved cooperation in the quest to salvage civilization? Not a trivial question – failure would deny humanity the chance to advance another rung up the evolutionary ladder.”—William E. Rees, FRSC, Professor Emeritus, University of British Columbia; co-originator of the ecological footprint concept “Powerreminds us that Richard Heinberg is one of the most important public intellectuals in the conversation about society’s future. Eminently readable and engaging,Poweris breathtaking in its scope and insight. Heinberg persuasively argues that we have reached evolutionary limits to concentrated social power and that empathy and beauty are key to averting ecological and social catastrophe.”—Chuck Collins, Institute for Policy Studies, author,The Wealth Hoarders: How Billionaires Pay Millions to Hide Trillions “I turn to Richard Heinberg whenever I need to understand something about energy; he’s the ‘go-to’ source. And now this!Power, with seamless fluency in paleo-history, economics, psychology, and politics, is the ‘must-read’ for anyone wondering how we can make it through the 21st century. This book is more than informative. It is enlightening. It is essential. It is powerful!”—Suzanne Moser, climate researcher and consultant “A delight to read, it has a number of sobering messages for policy makers and politicians alike… Setting this book apart from virtually all others covering the topic of energy transition and climate change is that Heinberg covers power in all its manifestations… A sobering and timely book just as many governments appear to acknowledge – after decades of inaction – the dangers of climate change.”—EEnergy Informer “It may be a moral idea that hard work pays off but if we need proof that it counts, this latest of Richard Heinberg carries all the evidence we need. His encyclopedic treatment of power is brilliant. It is sure to pop up in courses and living rooms like toast.”—Wes Jackson, Founder, The Land Institute Share Tweet Email Print Share viaFacebookTwitterPinterest Facebook Twitter Pinterest Facebook Twitter Pinterest **Podcasts** **Resilience.org** **Support Us** **Follow Us** **Contact Us** Post Carbon InstituteP.O. Box 1143Corvallis, Oregon 97339 - USAphone:+1 (541) 566-8700 **Follow Us** **Support Us** **Our Mission** Leading the transition to a more resilient, sustainable, and equitable world. Reposting Policy|Privacy PolicyAutomatic translation byGTranslate Copyright © 2025. All rights reserved. Designed byWPlook Studio"}