{"id": 1916, "name": "Christian Today", "domain": "christiantoday.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.christiantoday.com/news/scottish-campaigner-arrested-in-brussels-for-holding-gender-critical-sign", "title": "Scottish Campaigner Arrested In Brussels For Holding Gender Critical Sign", "content": "Christian TodayHomeNewsOpinionWorldChurchCultureLifeUS Home News Opinion World Church Culture Life US Home News Opinion World Church Culture Life US Home News **Scottish campaigner arrested in Brussels for holding gender critical sign** A Scottish Christian woman was arrested in Brussels on Thursday for holding a sign that said \"Children are never born in the wrong body\". Lois McLatchie Miller, who works for the Alliance Defending Freedom (ADF), was arrested and detained by Brussels police alongside Billboard Chris - a Canadian father and campaigner who is being supported by the organisation in his defence of free speech. They were held for several hours before being released without charge. Despite not being charged or convicted of any crime, the police said that their signs would be destroyed. Billboard Chris called their arrests \"total madness\", while McLatchie Miller said they were emblematic of a \"free speech crisis\" in Europe and further evidence that US Vice-President JD Vance was right to raise concerns in his recent Munich speech. Addressing their \"peaceful\" message affirming biological reality, she toldFox News: \"It's an opinion that's shared by many people across Europe, and yet the authorities came and shut down that conversation in the streets of this capital city, this heart of the European Union. \"If free speech is not accessible here in Europe's alleged home of democracy, then it's not accessible anywhere and it really does raise an alarm bell.\" She added that she had not expected such \"hostility\" in Brussels. \"But hopefully it exposes some things that need to be exposed about the need to protect freedom of expression in Europe,\" she said. Paul Coleman, ADF executive director, said the organisation was considering legal action in the wake of their arrests. “The Belgian authorities not only failed to uphold the fundamental right to speak freely — they turned the power of the state against those who were peacefully exercising their rights at the behest of a mob,” he said. “This is the type of authoritarianism we challenge in other parts of the world, and it’s deeply disturbing to see it here in the very heart of Europe.“While we are grateful our colleague has been safely released, we are deeply concerned by her treatment at the hands of the police in Brussels.”He added, “We will not stand by while peaceful citizens are criminalized for speaking out on vital issues — especially when it’s the safety and wellbeing of children at stake.\" Relief for Kristie Higgs as Supreme Court denies school's appeal in Facebook post case Relief for Kristie Higgs as Supreme Court denies school's appeal in Facebook post case Relief for Kristie Higgs as Supreme Court denies school's appeal in Facebook post case Relief for Kristie Higgs as Supreme Court denies school's appeal in Facebook post case Over 1,000 doctors sign letter against assisted suicide Over 1,000 doctors sign letter against assisted suicide Over 1,000 doctors sign letter against assisted suicide Over 1,000 doctors sign letter against assisted suicide Poll shows little support for decriminalising abortion Poll shows little support for decriminalising abortion Poll shows little support for decriminalising abortion Poll shows little support for decriminalising abortion The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean What is Pentecost Sunday and why do churches mark it? What is Pentecost Sunday and why do churches mark it? What is Pentecost Sunday and why do churches mark it? What is Pentecost Sunday and why do churches mark it? Newsboys respond to sexual assault allegations against Michael Tait Newsboys respond to sexual assault allegations against Michael Tait Newsboys respond to sexual assault allegations against Michael Tait Newsboys respond to sexual assault allegations against Michael Tait What was Whit Monday and why was it important? What was Whit Monday and why was it important? What was Whit Monday and why was it important? What was Whit Monday and why was it important? The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean The three symbols of the Holy Spirit in the Bible and what they mean Trump admin has no plans to celebrate Pride Month Trump admin has no plans to celebrate Pride Month Trump admin has no plans to celebrate Pride Month Trump admin has no plans to celebrate Pride Month Scottish campaigner arrested in Brussels for holding gender critical sign Scottish campaigner arrested in Brussels for holding gender critical sign Scottish campaigner arrested in Brussels for holding gender critical sign Scottish campaigner arrested in Brussels for holding gender critical sign The decision ends a years-long legal battle over religious free speech for the Christian teacher. \"Rose\" offered to help educate the women as to why they should be willing to get undressed in front of him. Ann Widdecombe, former MP and long-standing Christian voice in public life, believes the apparent resurgence of interest in Christianity among Britain’s youth is not as unexpected as it seems. Though record levels of pastors, including more than half in mainline Protestant churches, seriously considered leaving full-time ministry during the COVID-19 pandemic, only about 1% of them have been leaving ministry work annually in the last decade, a new Lifeway Research study finds. Home News Opinion World Church Culture Life US About Us Editorial Team Advertising Terms & Conditions Privacy Policy RSS Feeds E-Newsletter Contact Us"}