{"id": 1326, "name": "Tama-Toledo News Chronicle", "domain": "tamatoledonews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.tamatoledonews.com/news/local-news/2025/06/03/salt-creek-files-for-emergency-injunction-from-purported-construction-stay/", "title": "Salt Creek Files For Emergency Injunction From Purported Construction Stay", "content": "NewsLocal NewsAgricultureBusinessCOVID-19EducationCrimeGovernmentNews Briefs Local News Agriculture Business COVID-19 Education Crime Government News Briefs Local News Agriculture Business COVID-19 Education Crime Government News Briefs SportsLocal Sports Local Sports Local Sports OpinionEditorialsLetters to the EditorLocal Columns Editorials Letters to the Editor Local Columns Editorials Letters to the Editor Local Columns ObituariesView ObituariesPlace Obit View Obituaries Place Obit View Obituaries Place Obit Classifieds Garage Sales Contact InformationContact UsStatement of Values Contact Us Statement of Values Contact Us Statement of Values Public NoticesView a NoticePlace Notice View a Notice Place Notice View a Notice Place Notice News Sports Opinion Obituaries Classifieds Garage Sales Contact Us Place Notice June 10, 2025 | Submit News **Salt Creek files for emergency injunction from purported construction stay** **Hearing held May 27 in remaining wind case** Jun 3, 2025 A hearing was held on Tuesday, May 27, in Tama County District Court in Toledo as part of the Feb. 5, 2025 petition filed by Salt Creek Wind LLC against the Tama County Board of Supervisors in connection to the Jan. 6, 2025 wind moratorium. Those pictured on May 27 include Board Chairman Mark Doland (far left); attorneys Michael R. Reck and Haley Hermanson for the County (third and fourth from left); Supervisor Heather Knebel (fifth from left); and attorneys Spencer Willems (back to the camera), Elizabeth R. Meyer (second from right), and Sarah K. Franklin (far right) for Salt Creek Wind. PHOTO BY RUBY F. MCALLISTER News Chronicle Note: After this story went to press, Judge Cox denied Salt Creek Wind’s May 30 application for an emergency injunction without prejudice, writing on May 31: “The Court denies without prejudice as these issues can be remedied by the Plaintiffs. The Court suggests the parties discuss the actions taken by the Board since the injunction hearing in an attempt to reach an agreement. If the parties are unable to reach an agreement, then the Court may be utilized as appropriate.” This story will publish in the Friday, June 6, 2025 print edition of the News Chronicle. TOLEDO – Following years of conflict in the court of public opinion, the future of commercial wind energy conversion systems (CWECS) development in Tama County appeared to finally be on the path to a concrete legal decision in Tama County District Court when a hearing was held on Tuesday, May 27, for the Feb. 5, 2025 petition filed by Salt Creek Wind LLC (SCW) against the Board of Supervisors and the County. But all that was thrown into further chaos later in the week when the existence of a purported construction stay of the project by the Board was brought forward for enforcement. On Friday, May 30, Salt Creek in turn filed an emergency application for a temporary injunction against such enforcement, requesting expedited relief and a virtual hearing. “This emergency application is the result of Defendants’ abuse of authority and blatant disregard for Plaintiff’s rights and this Court’s own authority and jurisdiction,” SCW’s emergency filing states. “This Application involves identical issues of fact and law as those heard by Judge [David M.] Cox at the parties’ hearing on Plaintiff’s Application for Temporary Injunction on May 27, 2025.” During the May 27 hearing in the case in which SCW – acquired in Nov. 2024 by NextEra Energy Resources, LLC – seeks clarification that the Jan. 2025 moratorium on development and construction of CWECS does not apply to its central Tama County project, Dexter Liu, executive director at NextEra and assistant vice president for the SCW project, took his seat in the witness chair for much of the half-day hearing as the plaintiff’s only witness; Tama County’s counsel cross-examined Liu while never calling any witness of their own. Attorney Sarah K. Franklin, SCW’s counsel, began her questioning of Liu by taking him through the project’s baseline and current status. During questioning, he described SCW as an approximately 170 MW wind project (1MW at peak output could power approximately 700 homes, Liu indicated) located southwest of Traer and consisting of approximately 60 wind turbines that had been in development “for a long time.” When asked to describe the project’s current status, Liu stated it was “extremely mature” with all land agreements secured, an interconnection agreement contractually signed and ready to go, permits in hand, required surveys and studies completed, and a commercial agreement for procurement of power in place. Salt Creek Wind's laydown yard located at the intersection of US 63 and 220th Street southwest of Traer pictured earlier this year. Construction on the 170 MW project which includes 60 turbines continues as of press time. PHOTO BY RUBY F. MCALLISTER In addressing the project’s current status, Liu said construction was ongoing as of that moment, telling the court he was “actually just there this morning” at the laydown yard (SCW’s base of operations located at the intersection of US 63 and 220th Street southwest of Traer). Liu said there were currently 50-some people on site with that number expected to swell to nearly 250 at its peak later this summer. The total anticipated investment in Tama County as it relates to SCW is pegged at $270 million, Liu said. “That is all of the equipment that goes in … all civil work … all construction labor … land use agreements – initially paid to develop the project, all of the development fees … as well as interconnection of the project itself,” he said. The project should generate approximately $50 million in tax revenue over its lifespan, he added, while also generating approximately $2.5 million in estimated economic activity locally (based on third party research) and approximately $7.5 million in revenue for the State of Iowa. PHOTO BY RUBY F. MCALLISTER Franklin also took Liu through the project’s conditional use permit (CUP) granted by the Board of Adjustment in Dec. 8, 2020, and never appealed. She likewise went through SCW’s zoning application for 60 turbines and one (1) substation which was approved by the Zoning Administrator on Sept. 16, 2024. “These are the zoning certificates related to the Salt Creek Wind project, right?” Franklin asked. “Yes,” Liu said in response. “To your knowledge, is there any pending appeal of the zoning certificates?” “No,” he replied. Liu then described the financial commitment NextEra and previous project owners had made and/or plan to make toward the project including $140 million already expended to acquire all 60 turbines, $12 million on development work by the prior owner, and an additional $9 million spent by NextEra on ongoing construction and engineering efforts since acquisition. In closing arguments which took place later that morning close to noon, SCW stated that “over 50 percent of the total cost of this project” was spent or committed prior to the Jan. 6, 2025 moratorium enacted by the Board of Supervisors. “If this project doesn’t move forward,” Franklin asked Liu, “does NextEra have another use for the 60 turbines that it has purchased?” “It does not have an alternate site for the turbines,” he replied. “Does Salt Creek Wind have another use for the 60 turbines that it has purchased,” she asked. PHOTO BY RUBY F. MCALLISTER “It does not,” he said. Liu added that NextEra would incur approximately $70 million in fines (as of the end of April) if the purchase of the turbines is not finalized; later he stated delaying the project would cost the company approximately $2.5 million per month including turbine storage costs. Franklin also addressed Tama County’s recent denial of SCW’s application for a zoning certificate for a meteorological station (LiDAR) submitted on Jan. 24, 2025. The application was denied by Zoning Administrator Laura Wilson on May 20, 2025. In the denial letter, Liu said, the moratorium was cited as the basis for the decision. “Did a delay in processing this permit cause harm to Salt Creek Wind?” Franklin asked. “Yes, it introduced significant uncertainty in terms of how Tama County was dealing with the moratorium,” Liu replied before later stating, “The large logistical effort that’s required and our committed spend to the project would be at harm if the moratorium were to be applied by Tama County to this project. County cross-examines Attorney Michael R. Reck, representing the Board of Supervisors, also questioned Liu during the hearing, at one point focusing on the Nov. 2024 election during which Tama County moved from three supervisors to five – four of those elected were new to the position. “Sir, are you aware that Tama County voters overwhelmingly elected supervisors who had been raising questions about this project?” “I am aware that new supervisors were elected recently, over the last seven or eight months or so, in Tama County, yes,” Liu replied. When asked how much NextEra paid to acquire SCW, an objection was raised by Franklin. In response to Judge Cox’s inquiry regarding the line of questioning, Reck replied, “They’re claiming a vested right. But this is a company that stepped into this knowing these issues. They bought a pig in a poke, and we intend to demonstrate that. And I think we have a right to show how much they spent to [acquire the project] – if it was $1, then they really knew what the problem was, right? If it was $50 million, then we have a different sort of issue.” Ultimately, Judge Cox ruled the courtroom would need to be cleared to address the acquisition costs (due to a protective order requested by SCW) and would reserve doing so until the end of the hearing. Later, when asking Liu about any warranties NextEra may have secured prior to its purchase of the project, Reck said he was addressing “the same issue.” “We think that it was obvious that this project was built on a faulty foundation – that it violated the ordinances from the very beginning. And we suspect, if they did their due diligence, they would absolutely know that and should have gotten warranties,” Reck told the judge. “Do you understand supervisors are likely to be the voice of the Tama County residents?” Reck later asked Liu before adding, “Do you agree elected officials should listen to constituents’ concerns?” To both, Liu responded affirmatively. Reck then asked if Liu understood “the moratorium was put in place to allow Tama County to review and address concerns” related to CWECS. Liu responded that he could not speak to the exact discussion by the supervisors regarding the moratorium. Reck also asked Liu if NextEra sought a “variance from the moratorium,” to which Liu responded, “I can’t speak to whether this is specifically a variance or not, but I know that we did submit a zoning certificate (application) for a LiDAR device as we discussed earlier.” In reference to SCW’s application for an extension of its zoning certificates – an application which was approved in the fall of 2024 by now-former Zoning Administrator Bob Vokoun – Reck asked Liu if he knew Vokoun “had been a vocal advocate of this Salt Creek Wind project?” before later referring to Vokoun as the “losing candidate” for the seat now held by Supervisor Heather Knebel. Knebel defeated Vokoun in a three-way GOP primary in June 2024. “We had started construction on the project, but we had also filed for an extension as a standard practice to grant additional time,” Liu said in reference to SCW’s extension request on the 90-day period to start the project.” Questions surrounding Vokoun were repeatedly objected to by Franklin on relevance grounds. “What they have done is they have gone and sought extreme extensions of the 90-day permit,” Reck told the judge. “They went to the losing candidate who they knew advocated on their behalf and they got the permit extension five-fold over what the ordinance provides. And they did it intentionally to try to put this beyond the reach of the supervisors … before they took office.” After ascertaining Vokoun was the Zoning Administrator as of Dec. 6, 2024, Judge Cox pointedly asked Reck, “Who else would they have sent [the extension application] to?” Later, following a brief recess, Reck addressed inconsistencies in the model of turbine NextEra had procured for the Salt Creek Wind project in comparison to what was specified in the 2020 CUP application. “Are you using any of those four turbines identified in the CUP application of this project?” Reck asked. “Not these four specific turbine types,” Liu said while holding a copy of SCW’s 2020 CUP application before adding, “No, we are not using any of the turbines listed in this table here.” Reck also addressed alleged inconsistencies between maps of collection lines for the project contained in both the CUP application and the zoning certificates, repeatedly showing Liu map after map for specific turbine locations. After repeated questioning – and repeated objections by Franklin, some which were upheld by the judge – Liu conceded, “There appear to be some differences,” before later stating, “We represent a proposed location for electrical lines in the conditional use permit application.” Toward the end of his time, Reck also brought up SCW’s decommissioning plan which includes a bond for the project. Whether done intentionally with malice or just sloppy legalwork, Reck pointed out at least one instance in the decommissioning plan which refers to a location not in Tama County – Cedar Rapids. He also pointed out an instance where a different project – the Rock Creek Solar Project which is also not in Tama County – was referenced, among other inconsistencies. Closing arguments, new filing In their closing arguments, SCW’s counsel said they believed Liu’s testimony coupled with the hundreds, if not thousands, of pages of evidence submitted to Judge Cox indicates the company is “likely to prevail” on the merits of vested rights. SCW also rebuked the County’s claims NextEra is acting unlawfully – citing both the valid CUP application dating back to 2020 and the zoning certificates which were appealed last fall before being reaffirmed by the Board of Adjustment. “The Board of Supervisors could have filed an action,” attorney Elizabeth R. Meyer, Franklin’s co-counsel, stated. “The Board of Supervisors’ members could have filed their own action. They did not do so, they are time barred. The law provides appeal periods for a reason. Parties are entitled to legal certainty, and Salt Creek Wind now has legal certainty with regard to both the [CUP] and the zoning certificates.” To wrap up SCW’s arguments, Meyer said, in part, “An injunction is necessary to prevent substantial injury because the zoning certificates have inherent time limitations and … there is significant cost associated with a delay that could arise if some enforcement action or additional step is taken by the County related to the moratorium. … Salt Creek Wind has demonstrated that it is entitled to a temporary injunction while this suit is pending in order to protect its rights.” In the County’s closing arguments, the project was described by Reck as a “house of cards – its foundation is improper.” He said the Board of Supervisors “always has the power to change the law” and that “one prior board does not have the right to bind the future board, and this board has passed the moratorium.” Reck further said in order for NextEra to cite vested rights, they needed to follow “the applicable law in submitting the CUP application” – something the County alleges SCW did not do. “[N]obody is above the law,” Reck said. “It was built on a faulty application to begin with.” Judge Cox closed the hearing, which began at 9 a.m. and ended just after 12:15 p.m., by stating he understood there was “a lot of passion on both sides,” but that he now faced combing through a tremendous amount of evidence while on a very tight work schedule. “I’ll give a ruling when I can,” he said before citing late June or early July for his decision. As of press time, SCW had requested – through its May 30 emergency application for temporary injunction – that the Court “immediately grant an injunction prohibiting Defendants from taking any steps to enforce the purported ‘automatic stay’ of construction of the Project.” “At the May 29, 2025 meeting, the Board of Supervisors, citing evidence ‘learned’ at the Injunction Hearing, announced their plans to halt construction at the Project pursuant to a purported ‘stay,'” SCW’s emergency filing stated. “Specifically, Defendants erroneously claimed there is already a ‘stay’ of construction and announced their intention to direct the Tama County Sheriff’s Office to physically halt construction of the Project pursuant to this non-existent ‘stay.’ … Notably, this argument was not made to the Court at the Injunction Hearing. At no point during the contested, half-day hearing did the County argue it had a stay or otherwise urge the Court to stay or enjoin ongoing construction of the Project. … The County’s position that such a stay exists is erroneous as a matter of law.” Doland, Knebel respond On May 28, Board Chairman Mark Doland and Supervisor Knebel – both present at the May 27 hearing – issued a press release in which they stated, in part, “Testimony presented at the hearing answered many questions the Supervisors had previously posed to Salt Creek. The testimony and other evidence presented made clear that Salt Creek, now owned by NextEra Energy, did not comply with the Commercial Wind Energy Conversion System (’C-WECS’) zoning ordinance in submitting the application for a Conditional Use Permit (‘CUP’) and that the zoning certificates issued to Salt Creek in September 2024 do not match the CUP application materials.” “We are thankful that some of the lingering questions we had before the hearing have been answered. These answers only confirmed the concerns we have heard from citizens in regard to the Salt Creek Wind project, including the concerns that it had not complied with the ordinances at the outset,” Doland said in the release. “This hearing is a significant step forward in ensuring that all projects within Tama County adhere to the established zoning ordinances. We are committed to maintaining the integrity of our zoning laws and ensuring that all applications are thoroughly reviewed and compliant,” Knebel further added, while also stating, “As we look forward to next steps, it is important that we revisit the validity and legality of the permits and zoning certificates that have been issued by the previous zoning administrator and Board of Adjustment.” “Now that we have the answers to some of our questions, I believe that the Supervisors have a responsibility to ensure full compliance with the law. The Supervisors are assessing the appropriate avenues to address Salt Creek’s non-compliance, including the numerous deficiencies in the CUP application and the failure to comply with the specifications and requirements in the C-WECS ordinance,” Doland also stated. The press release ended with: “The Board of Supervisors intends to do just that and will consider the appropriate action to take at an upcoming meeting.” This is a developing story. Editors’ Note: On May 26, 2025, Salt Creek Wind filed a dismissal without prejudice of its April 16, 2025 petition against Tama County, the Tama County Board of Adjustment, and the Tama County Zoning Administrator — the second lawsuit filed by SCW involving the County. On May 28, 2025, that case was dismissed without prejudice by Judge Cox. **Local News** **Local News** **‘We’ll keep being loud’** **‘We’ll keep being loud’** **Traer Historical Museum BBQ fundraiser set for June 8** **Traer Historical Museum BBQ fundraiser set for June 8** TRAER – The Traer Historical Museum will hold a fundraising barbecue at the Traer Memorial building on Sunday, ... **South Tama Schools Summer Food Service Program** **South Tama Schools Summer Food Service Program** TAMA-TOLEDO — South Tama County Schools is participating in the Summer Food Service Program. Meals will be ... **Tama-Toledo Community Yard Sale Set for June 19-21** **Tama-Toledo Community Yard Sale Set for June 19-21** The Tama-Toledo Community Yard Sale is only two weeks away, and preparations are underway. This event, coordinated ... **The Works with Fireworks** **The Works with Fireworks** This week's Tama City Council meeting began with the discussion of a topic that's been on many iowan's lips as of ... **Marty Hardon takes cancer advocacy to Capitol Hill** **Marty Hardon takes cancer advocacy to Capitol Hill** MOST READ **Newsletter** Today's breaking news and more in your inbox Daily Newsletter Breaking News NewsGovernmentz_BusinessEducation Government z_Business Education Government z_Business Education SportsLocal Sports Local Sports Local Sports OpinionEditorialsLetters to the EditorLocal Columns Editorials Letters to the Editor Local Columns Editorials Letters to the Editor Local Columns Contact Us Copyright © Tama-Toledo News Chronicle | https://www.tamatoledonews.com | 220 W. Third Street, P.O. Box 118, Tama, IA 52339 | 641-484-2841 |Terms of Service"}