{"id": 2012, "name": "The Jordan Times", "domain": "jordantimes.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://jordantimes.com/news/local/foreign-ministry-condemns-israeli-shelling-near-gaza-hospital-that-injured-jordanian-nurse", "title": "Foreign Ministry Condemns Israeli Shelling Near Gaza Hospital That Injured Jordanian Nurse", "content": "What's On About Us Contact us Advertise Archive Home Local Region World Business Sports Features Opinion Letters Biz Club Home Local Region World Business Sports Features Opinion Letters Biz Club What's On About Us Contact us Advertise Archive Home Local Foreign Ministry condemns Israeli shelling near Gaza hospital that injured Jordanian nurse **Foreign Ministry condemns Israeli shelling near Gaza hospital that injured Jordanian nurse** AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement.A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery.The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment.The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime.The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incidentQudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\"The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties.Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\"The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement.A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery.The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment.The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime.The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incidentQudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\"The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties.Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\"The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement. A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery. The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment. The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime. The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incident Qudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\" The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties. Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\" The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement.A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery.The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment.The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime.The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incidentQudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\"The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties.Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\"The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement. A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery. The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment. The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime. The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incident Qudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\" The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties. Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\" The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. AMMAN — A Jordanian nurse was injured Wednesday morning after Israeli shelling struck near the Kingdom's field hospital in southern war-torn Gaza, according to an army statement. A statement from the General Command of the Jordan Armed Forces–Arab Army (JAF) said that the nurse was inside the hospital when shrapnel from the shelling landed nearby. The official said the nurse sustained injuries to his left hand and right thigh, and was immediately transferred to the operating room for surgery. The JAF confirmed that his condition was moderate and plans were in place to evacuate him to Jordan later on Wednesday for further treatment. The Foreign Ministry strongly condemned the Israeli attack, calling it a “blatant violation” of international law, particularly the 1949 Geneva Convention, which protects civilians during wartime. The ministry's spokesperson Sufian Qudah emphasised in a statement that Israel bears full responsibility for ensuring the safety of medical personnel and civilians, and criticized the incident Qudah described the incident as part of the \"wider pattern of war crimes committed by the Israeli occupation forces in Gaza, which includes the systematic targeting of hospitals, medical teams, and innocent civilians. He also condemned the ongoing policies of starvation and blockade enforced in the besieged Strip.\" The official also stressed that the Jordanian government holds the Israeli occupation fully accountable for endangering the lives of Jordanian medical teams, and urged Israel, as the occupying power, to fulfill its obligations under international law, specifically by refraining from targeting protected sites such as hospitals and obstructing medical workers from carrying out their duties. Qudah also called on the international community to take urgent and decisive action to halt Israeli violations against civilians and civilian infrastructure in Gaza. He urged support for the immediate and adequate delivery of humanitarian aid to the Strip which, he said, is suffering an \"unprecedented humanitarian catastrophe.\" The Jordanian Nursing Council also condemned the attack, expressing solidarity with the injured nurse and his family, and wishing him a swift recovery. **{{articles_filter_1623_widget?.title}}** {{ articles_filter_1623[0]?.title }} {{ articles_filter_1623[0]?.title }} {{ articles_filter_1623[1]?.title }} {{ articles_filter_1623[1]?.title }} **Today’s Paper** Popular Rated Commented **{{articles_filter_1746[0]?.title}}** **{{articles_filter_1746[0]?.title}}** **{{item?.title}}** **{{item?.title}}** **{{articles_filter_1747[0]?.title}}** **{{articles_filter_1747[0]?.title}}** **{{item?.title}}** **{{item?.title}}** **{{articles_filter_1748[0]?.title}}** **{{articles_filter_1748[0]?.title}}** **{{item?.title}}** **{{item?.title}}** **{{item?.title}}** {{item?.subtitle}} **{{item?.title}}** {{item?.subtitle}} The Jordan Times is an independent English-language daily published by the Jordan Press Foundation since October 26, 1975. The Jordan Press Foundation is a shareholding company listed on the Amman Stock Exchange. {{item.name}} Join Our Newsletters Sign up by email to receive news. {{menu.name}} Copyright © 2025 The Jordan Times. All Rights Reserved."}