{"id": 1139, "name": "Progressive Policy Institute", "domain": "progressivepolicy.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.progressivepolicy.org/ppi-applauds-introduction-of-pink-tariffs-study-act-to-examine-how-tariffs-drive-up-costs-for-american-women/", "title": "Ppi Applauds Introduction Of Pink Tariffs Study Act To Examine How Tariffs Drive Up Costs For American Women", "content": "Donate Home AboutAbout UsLocationsCareers About Us Locations Careers About Us Locations Careers People Projects Our Work Events Donate **Our Work** **PPI Applauds Introduction of Pink Tariffs Study Act to Examine How Tariffs Drive Up Costs for American Women** March 11, 2025 Ed Gresser WASHINGTON— Today,Ed Gresser, Vice President and Director for Trade and Global Markets at the Progressive Policy Institute (PPI), issued the following on today’s introduction of the Pink Tariffs Study Act by Representatives Lizzie Fletcher (D-Texas) and Brittany Pettersen (D-Colo.): “As Representatives Fletcher and Pettersen introduce the Pink Tariffs Study Act today, they are rightly going beyond pure — and fully justified — opposition to Mr. Trump’s tariff increases. By helping alert policymakers to unequal tariff taxation of American women, and tariff rates biased against lower-income families, their bill will help us design a better and fairer system. “Economists have long known that tariffs are a poor form of taxation. As taxation of purchases of goods, they tax hourly-wage families more than wealthy households, and impose greater cost burdens on goods-using industries like retail, manufacturing, farming, restaurants, and homebuilding than on services- and investment-heavy industries. Even within this context, the U.S. tariff system is far more regressive than those of most of our trading partners — for example, by taxing polyester clothes more heavily than silks, and cheap stainless steel silverware more than sterling silver. And it appears to be unique in the world in taxing women’s clothes more heavily than directly analogous men’s clothes. This gender bias in the two clothing chapters likely costs women at least $2.5 billion per year. “The Pink Tariffs Study Act directs the Treasury Department to conduct a formal study of the U.S. tariff system for gender bias and regressivity — something neither the Treasury Department nor other trade agencies with tariff powers, such as Customs and Border Protection or the Office of the U.S. Trade Representative, have ever done. This would give Congress the data and information it will need as it reasserts its Constitutional authority over tariff policy and begins to undo the harms Mr. Trump’s policies are causing. We are proud to applaud and endorse their work.” Gresser’s pathbreaking research has repeatedlyanalyzed U.S. tariff datato explain an opaque system andilluminate inequity inthe country’s tariff taxation system, especially on women’s clothes and household consumer goods such as shoes, silverware, and home linens. Most recently,PPI has warned of the economic risks posed by Trump’s tariff policies in arecent reportand detailed these concerns intestimonybefore Congress.PPIoutlinedfour key principlesfor responding to tariff-driven economic isolationism: Defend the Constitution and oppose attempts to rule by decree Connect tariff policy to growth, work, prices, family budgets, and living standards Stand by America’s neighbors and allies Offer a positive alternative For further context on the Constitution over tariffs and taxation and how the legislative, not executive branch, has the authority, see thefull text of the U.S. Constitution. Founded in 1989, PPI is a catalyst for policy innovation and political reform based in Washington, D.C. Its mission is to create radically pragmatic ideas for moving America beyond ideological and partisan deadlock.Find an expertand learn more about PPI by visitingprogressivepolicy.org. Follow us@PPI. ### Media Contact: Ian O’Keefe –iokeefe@ppionline.org **Related Work** **U.S. earnings from international student tuition above those for gold, silver, platinum, diamonds, and gems** **U.S. earnings from international student tuition above those for gold, silver, platinum, diamonds, and gems** Ed Gresser **‘Congress shall have the power to lay and collect Taxes, Duties, Imposts, and Excises’** **‘Congress shall have the power to lay and collect Taxes, Duties, Imposts, and Excises’** Ed Gresser **Denmark is a four-generation ally and a good neighbor** **Denmark is a four-generation ally and a good neighbor** Ed Gresser **PPI: Trump’s Tariffs Are Reckless, Constitutionally Unsound** **PPI: Trump’s Tariffs Are Reckless, Constitutionally Unsound** Ed Gresser **Polling: U.S. public is against Trump tariffs by about 60%-36%** **Polling: U.S. public is against Trump tariffs by about 60%-36%** Ed Gresser **The U.S. trade deficit has nearly doubled this year** **The U.S. trade deficit has nearly doubled this year** Ed Gresser Never miss an update: **Never miss an update:** **Never miss an update:** Subscribe to our newsletter Donate Careers © 2025 Progressive Policy Institute.All Rights Reserved. | Privacy Policy | Privacy Settings"}