{"id": 1246, "name": "Lake County Journal", "domain": "shawlocal.com/lake-county-journal", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.shawlocal.com/lake-county-journal/arts-and-entertainment/", "title": "Arts And Entertainment", "content": "Sign in Subscribe Print Subscriber? Activate Now Manage Your Account Contact Log out Lake County Journal(Opens in new window) Digital Account(Opens in new window) Print Account(Opens in new window) Contact Us eNewspaper(Opens in new window) News - Lake CountyLocal News(Opens in new window) Local News(Opens in new window) Local News(Opens in new window) Sports - Lake CountyLake County Prep SportsBearsFriday Night Drive Lake County Prep Sports Bears Friday Night Drive Lake County Prep Sports Bears Friday Night Drive The Scene(Opens in new window) A&E(Opens in new window) Lake County Opinion Online Newspaper(Opens in new window) Starved Rock Country(Opens in new window) Obituaries(Opens in new window) Sponsored(Opens in new window) Jobs(Opens in new window) Wheels(Opens in new window) Real Estate(Opens in new window) Classified(Opens in new window) Public Notices Shaw Media Marketing(Opens in new window) Deals(Opens in new window) Local Events Historical Archive(Opens in new window) Shaw Careers(Opens in new window) **B4 Summer Fest brings beer, bourbon, bacon and bands to Richardson Farm** Discounted tickets are on sale now for June 7 event at Richardson Adventure Farm in Spring Grove. **‘A Jukebox for The Algonquin’ pushes buttons, tickles funny bones at Citadel in Lake Forest** Set in a senior living community, the play features comic genius and laugh-out-loud punchlines that land with precision and tenderness. **Personalized pairing offer unique fine-dining experience at casual Wauconda eatery** Unlike other pairing dinners, which are usually designed for a whole room of guests, the Side Lot Experiences are intimate, four-course affairs for parties as small as two. **‘Mauritius’ puts distinctive ‘stamp’ on Barrington production** Director Kurt Naebig has cast well and keeps the show’s pacing fluid and intense in this active and intriguingly suspenseful play. **Be it the thrill of coasters or other entertainment, Six Flags Great America opens April 18** The 49th season will see the debut of the Wrath of Rakshasa, the steepest and most inverted dive coaster in the world. **Spa getaway destinations to help melt away stress** Illinois and Wisconsin boast a wealth of spa getaways, offering luxurious pampering and relaxation just a short trip away. **‘Titanic The Musical’ comes to Marriott Theatre in northern suburbs** “Titanic The Musical” is a stirring portrait of the passengers on board the “unsinkable ship” and the tragedy that followed. **Cellist Drew Wiegman to perform at College of Lake County in Grayslake** Wiegman is a native of Grayslake and will perform original pieces March 29 & 30 at the College of Lake County. **Volo Museum to offer interactive spring break staycation event, new exhibits** Families can enjoy interactive live reptile shows for spring break. Kids ages 12 and younger will be admitted for free March 22-30. **‘I and You’ conjures compelling 90 minutes at Citadel Theatre in Lake Forest** **‘I and You’ conjures compelling 90 minutes at Citadel Theatre in Lake Forest** This production of “I and You” is earning raves. The show is written by Lauren Gunderson, one of the most-produced playwrights in the United States. This production of “I and You” is earning raves. The show is written by Lauren Gunderson, one of the most-produced playwrights in the United States. **Marriott’s ‘Joseph’ pairs sheer fun with glorious voices in Lincolnshire** **Marriott’s ‘Joseph’ pairs sheer fun with glorious voices in Lincolnshire** A sublime cast dazzles in \"Joseph and the Amazing Technicolor Dreamcoat,\" playing through March 30. A sublime cast dazzles in \"Joseph and the Amazing Technicolor Dreamcoat,\" playing through March 30. **Balloon Adventure event takes guests on enchanting voyage** **Balloon Adventure event takes guests on enchanting voyage** The 2025 Balloon Adventure theme is 'Voyage into the Deep Sea' and will feature 100,000 balloons throughout the 10-day event on The 2025 Balloon Adventure theme is 'Voyage into the Deep Sea' and will feature 100,000 balloons throughout the 10-day event on **Recent Articles** **5-story apartment, retail building planned for vacant block on Route 14 in Fox River Grove** **5-story apartment, retail building planned for vacant block on Route 14 in Fox River Grove** **Brighten Your Smile for Summer with Whitening at Metro Square Dental** **Brighten Your Smile for Summer with Whitening at Metro Square Dental** **Are You Ready for a Healthier Smile? Book Your Appointment at Manus Dental Lake Zurich Today!** **Are You Ready for a Healthier Smile? Book Your Appointment at Manus Dental Lake Zurich Today!** **Gurnee to groove to Sounds of Summer Concert series** **Gurnee to groove to Sounds of Summer Concert series** **Lake County Forest Preserves announce summer concert series** **Lake County Forest Preserves announce summer concert series** Copyright © 2023 Shaw Local News Network Copyright © 2023 Shaw Local News Network"}