{"id": 1932, "name": "CounterVortex", "domain": "countervortex.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://countervortex.org/blog/california-sues-trump-admin-over-national-guard-deployment/#comment-10017082", "title": "California Sues Trump Admin Over National Guard Deployment", "content": "**CounterVortex** Resisting Humanity's Downward Spiral Daily ReportBill Weinberg’s BlogCounterVortexNew Jewish ResistanceWeekly News Update on the AmericasJURIST Bill Weinberg’s Blog CounterVortex New Jewish Resistance Weekly News Update on the Americas JURIST Bill Weinberg’s Blog CounterVortex New Jewish Resistance Weekly News Update on the Americas JURIST FeaturesBack IssuesDocumentsSearch Archive (pre-2004)CounterVortex Classic Back Issues Documents Search Archive (pre-2004) CounterVortex Classic Back Issues Documents Search Archive (pre-2004) CounterVortex Classic Audio Video Support Us About UsOur MissionPosting PolicyContact Us Our Mission Posting Policy Contact Us Our Mission Posting Policy Contact Us Links Subscribe **California sues Trump admin over National Guard deployment** Californiafiled suitagainst the Trump administration June 9, asserting that its activation and deployment of the state National Guard to quell protests in Los Angeles is unconstitutional. The suit asks the US District Court for the Northern District of California to halt President Donald Trump’s “unlawful militarization” of Los Angeles. Calling Trump’s actions an abuse of power that needs to be ended, Gov. Gavin Newsom further described the administration’s actions as “an unmistakable step toward authoritarianism.” The governor stated that the calling up of the California National Guard unit, after the governor expressed hisobjection, only escalated the violence and chaos in Los Angeles. The governor characterized the administration’s “federalizing the California National Guard” as an illegitimate takeover that had no legal basis. Finally, Newsom warned that thememorandumTrump issued on June 7, entitled “Department of Defense Security for the Protection of Department of Homeland Security Functions,” could be used for the president to “assume control of any state militia.” California’s lawsuit comes as the US Northern Command hasannouncedthat it is activating 700 Marines to Los Angeles. The Marines are set to join the California National Guard members who were deployed there over the weekend for the purpose of “protecting federal personnel and federal property in the greater Los Angeles area.” The Northern Command press release stated that the National Guard members who had already been deployed to Los Angeles and the 700 Marines are both “trained in de-escalation, crowd control, and standing rules for the use of force.” Together the Guard and Marine personnel are to be designated Task Force 51. The unrest began on Friday June 6, when protesters gathered outside the Federal Building in downtown Los Angeles following reports that Immigration & Customs Enforcement (ICE) officers were conducting raids throughout the city. The Los Angeles Police Department (LAPD) was called to the protests, which were later classified as an “unlawful assembly.” On the following night, Trump issued hismemorandumactivating some 2,000 California National Guard troops to be deployed to the protests. This came despite Newsom’s expressed preference for the LAPD to deal with the protesters. On June 8, after the National Guard troops arrived in Los Angeles, the governor demanded that they be withdrawn. Newsom called Trump’s activation of the National Guard illegal, citing10 USC § 12406(3). FromJURIST, June 10. Used with permission. See our last reports ondomestic militarizationand thestruggle in California. Photo: US Northern Command viaWikimedia Commons **Post navigation** CounterVortexsays:June 11, 2025 at 3:02 pmJudge denies request to block deployment of troops to Los AngelesA federal judge on June 10deniedarequestby the state of California for an emergency order blocking the deployment of additional federalized National Guard troops and US Marines to the Los Angeles area.Gov. Gavin Newsom argued that the deployment of the National Guard violates state sovereignty and poses an immediate threat to public safety and civil order. Newsom also argued that thePosse Comitatus Acthas historically prohibited the use of active duty armed forces and federalized National Guard for civilian law enforcement. Therefore, the use of “federalized National Guard troops and Marines to accompany federal immigration enforcement officers on raids throughout Los Angeles,” is unlawful.Judge Charles Breyer denied Newsom’s request and scheduled a hearing for two days afternoon in San Francisco federal court. (Jurist)Log in to Reply Judge denies request to block deployment of troops to Los Angeles A federal judge on June 10deniedarequestby the state of California for an emergency order blocking the deployment of additional federalized National Guard troops and US Marines to the Los Angeles area. Gov. Gavin Newsom argued that the deployment of the National Guard violates state sovereignty and poses an immediate threat to public safety and civil order. Newsom also argued that thePosse Comitatus Acthas historically prohibited the use of active duty armed forces and federalized National Guard for civilian law enforcement. Therefore, the use of “federalized National Guard troops and Marines to accompany federal immigration enforcement officers on raids throughout Los Angeles,” is unlawful. Judge Charles Breyer denied Newsom’s request and scheduled a hearing for two days afternoon in San Francisco federal court. (Jurist) Judge denies request to block deployment of troops to Los Angeles A federal judge on June 10deniedarequestby the state of California for an emergency order blocking the deployment of additional federalized National Guard troops and US Marines to the Los Angeles area. Gov. Gavin Newsom argued that the deployment of the National Guard violates state sovereignty and poses an immediate threat to public safety and civil order. Newsom also argued that thePosse Comitatus Acthas historically prohibited the use of active duty armed forces and federalized National Guard for civilian law enforcement. Therefore, the use of “federalized National Guard troops and Marines to accompany federal immigration enforcement officers on raids throughout Los Angeles,” is unlawful. Judge Charles Breyer denied Newsom’s request and scheduled a hearing for two days afternoon in San Francisco federal court. (Jurist) **Regions** **Recent Updates** Judge denies request to block deployment of troops to Los Angeles Yet another massacre at GHF​ distribution point Demand release of Egyptian activist Ibrahim Metwally More killings at GHF​ distribution points Mexico's first nationwide election for judges **Features** PKK DISSOLUTION: THE LONG FAREWELL TO VANGUARDISM FREE SYRIANS STAND UP FOR PALESTINE LEONARD PELTIER HEADS HOME —AT LAST REVOLUTION 9 CHIQUITA TO PAY FOR PARAMILITARY TERROR IN COLOMBIA **Links** We depend on our readers. Please support us: **Login** Log in Entries feed Comments feed WordPress.org"}