{"id": 1411, "name": "Moscow Times", "domain": "themoscowtimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.themoscowtimes.com/2025/04/16/i-am-being-tried-for-my-professional-activity-the-last-words-of-journalists-jailed-for-alleged-navalny-ties-a88743", "title": "I Am Being Tried For My Professional Activity The Last Words Of Journalists Jailed For Alleged Navalny Ties A88743", "content": "SectionsHomeUkraine WarNewsOpinionBusinessArts and Life Home Ukraine War News Opinion Business Arts and Life Home Ukraine War News Opinion Business Arts and Life RegionsPodcastsGalleriesNewslettersTMT Lecture SeriesArchive Regions Podcasts Galleries Newsletters TMT Lecture Series Archive Regions Podcasts Galleries Newsletters TMT Lecture Series Archive Multimedia projectsMothers & DaughtersGeneration P Mothers & Daughters Generation P Mothers & Daughters Generation P News Ukraine War Regions Business Opinion Arts & Life Podcasts Archive **‘I Am Being Tried For My Professional Activity’: The Last Words of Journalists Jailed for Alleged Navalny Ties** **** Four Russian journalists weresentencedto 5.5 years in prison each on Tuesdayafter authorities claimed that they workedwith late Kremlin critic Alexei Navalny’s banned organizations. Artyom Kriger, Antonina Favorskaya, Konstantin Gabov and Sergei Karelin were found guilty of \"participating in an extremist group\" after a trial carried out behind closed doors. All four deny their guilt. Video journalists Gabov and Karelin had worked for a variety of outlets including major international agencies — Gabov with Reuters and Karelin with the Associated Press. In his courtroom speech, Karelin said he shot footage for Popular Politics, a YouTube channel launched by Navalny’s allies that he agreed to work for after a lawyer told him it “had not been designated as extremist or a foreign agent.” The Moscow Times previouslypublishedKriger’s final word in court. Favorskaya’s letter containing her speech was blocked by prison censors. We are nowpublishingGabov and Karelin’s courtroom speeches. Statements have been edited for length and clarity. **Sergei Karelin’s court argument** I have worked in television since 2004, and I spent my first eight years in the industry as a sound engineer at NTV Channel. During that time, I traveled to many countries as part of the presidential press pool, and I felt a growing desire to tell stories about my country, to document what was happening here. I later worked for several years at the 360 TV channel as a cameraman. I hold a professional degree from the State Institute of Television and Radio, with a diploma in film and television camerawork, as well as in teaching. I’ve always wanted to make documentaries and tell stories about life in my country — a country I deeply love. But since this is quite a challenging pursuit, especially financially, I continued to work at TV channels to support myself. Since 2017, I’ve been accredited by the Russian Foreign Ministry and worked as a cameraman for internationally respected Western media outlets and news agencies. … In 2022, my life changed dramatically. Early that year, the company where I had worked for the previous five years ceased operations in Russia. I lost another client due to budget cuts. In February, [the war] began. It affected the lives of everyone in our country — and beyond. Many Russian citizens emigrated. And in March, I became the father of a wonderful daughter, Miroslava. We could have left too — I have a second citizenship — but my family is here, my friends are here, the ones now standing in the hallway. My grandfather turned 101 in November. I love my country, Moscow, our village in the Pskov region, nature and my work — here! This is my home. My wife went on maternity leave and my financial responsibilities grew significantly. At the same time, it became increasingly difficult to find steady, well-paid work, so I had to take on almost any filming job I could find. Still, as a professional, it was important for me to preserve my dignity as a journalist — to maintain respect for my subjects and for storytelling, and to uphold journalistic ethics. Around that time, I was offered a job filming street interviews for the YouTube channel Popular Politics. I consulted with a lawyer — the media outlet was not [officially] designated as extremist or a foreign agent — and so I agreed to take on the assignment. Given my desire to tell stories about life in my country, I was genuinely interested in hearing people’s unfiltered opinions. Street interviews are a standard journalistic method and I’ve filmed them for various editorial teams. I want to stress that even then, it was important for me to do the job honestly — to engage with all points of view and to film people from a range of backgrounds and beliefs. I also filmed public events for different outlets — from concerts to mass rallies. At the rallies, I was there strictly as a cameraman working under editorial direction. … Everything I’ve described comes down to one thing: I love my country and my family — that’s all. Despite having a second citizenship, I never wanted to leave. I wanted to raise my daughter here, in our beautiful country. I want this to be a country where people are not persecuted for their views or positions, where they aren’t labeled a ‘fifth column’ or turned into targets for others. I stand for freedom of expression, for people’s right to speak freely, and for the media’s right to show Russia — and the world — what’s happening. I dream of a future in which journalists can work freely, without censorship or pressure. I want to see a strong civil society in this country — and for the rights of its people to be respected. **Russia Sentences Journalists to 5.5 Years in Navalny 'Extremism' Case** **Russia Sentences Journalists to 5.5 Years in Navalny 'Extremism' Case** **Sergei Karelin’s last word** I am in prison for my professional activity, for my honest and impartial approach to journalism, and for my love of my family and my country. Since I’ve already spoken about my work in the courtroom, I now want to say something else — something personal. I’d like to try to address the most important person in my life — my daughter Mira, whom I haven’t seen in 11 months. And I don’t know when I will. You understand, of course, that if I’m convicted, my whole family will suffer — my 101-year-old grandfather, a war veteran, my elderly parents who are doing their best to hang in there, and most of all — my beautiful daughter. I never imagined my child would become a victim of political repression — just like the children of those persecuted in the 1930s. Can you imagine such a fate for your own children? So yes, I’m now a ‘dad on a business trip,’ like many others today — just like so many were back then. I don’t know when I’ll see her again, let alone hold her in my arms. **Konstantin Gabov’s last word** Today I am being tried for my professional activity. All my life, working as a journalist at a number of media outlets, I have acted in strict accordance with the Russian Constitution. Article 29 guarantees freedom of thought and speech. Everyone has the right to freely seek, receive, transmit, produce and distribute information by any legal means. Freedom of the mass media is guaranteed. Censorship is prohibited. I have never been a member of any political party. I have always believed that a journalist's duty is to objectively reflect the opinions of people with different views, helping them to be heard by those in power. As early as last spring, I was producing reports about trials of activists — earlier, on the closure of [Nobel Peace Prize-winning human rights group] Memorial, the closure of the Sakharov Center and the dismantling of the Moscow Helsinki Group. Federal Security Service officers ran background checks on my employment history — from a local TV station in the city of Syktyvkar to major international media like Reuters. For some reason, a payment from the German company Deutsche Welle in May 2024 was cited by [state watchdog] Rosfinmonitoring when I was added to the register of ‘extremists and terrorists.’ Meanwhile, my work for [U.S.-funded media outlets] Current Time and Radio Free Europe/Radio Liberty became part of this case. Out of the five episodes used as evidence in my case, only one has witnesses. The participants confirm that I conducted the interview. The video was published on the NavalnyLIVE YouTube channel on January 23, 2024, under the title: ‘If you were face to face with Putin, what would you say?’ The investigators from the Russian Investigative Committee’s Main Investigation Department did not establish any correspondence between me and [Navalny’s Anti-Corruption Foundation] members, nor did they find evidence that I had received assignments or money from them, subscribed to their channels, reposted or liked their content. I’d like to stress that I have never had any administrative offenses in my life. Now I’m being charged under one of the most serious articles in the Russian Criminal Code, under the section ‘Crimes Against the Constitutional Order’: ‘Participation in an extremist organization.’ As someone with a background in cultural studies, I am fully aware of the country I live in. Throughout its history, Russia has remained the same — there’s nothing new in the current situation. Russia has always had a talent for creating problems not only for its own people, but also for neighboring countries. Independent journalism is now equated with extremism. Such rigidity is a result of a polarized society. … Even behind bars, I believe that the problems and developments in Russia must be reported on from inside the country. Working under such extreme conditions is hard, but possible. And, most importantly — necessary. … My work has always been about giving voice to those who cannot be heard, and covering events that are crucial for society. I believe that journalism is not a crime — it is an essential part of a democratic society. We must remember that every voice matters, and only together can we change things for the better. I hope that one day we will live in a country where freedom of speech is not just a right, but an integral part of everyone’s life. A Message from The Moscow Times: Dear readers, We are facing unprecedented challenges. Russia's Prosecutor General's Office has designated The Moscow Times as an \"undesirable\" organization, criminalizing our work and putting our staff at risk of prosecution. This follows our earlier unjust labeling as a \"foreign agent.\" These actions are direct attempts to silence independent journalism in Russia. The authorities claim our work \"discredits the decisions of the Russian leadership.\" We see things differently: we strive to provide accurate, unbiased reporting on Russia. We, the journalists of The Moscow Times, refuse to be silenced. But to continue our work,we need your help. Your support, no matter how small, makes a world of difference. If you can, please support us monthly starting from just$2.It's quick to set up, and every contribution makes a significant impact. By supporting The Moscow Times, you're defending open, independent journalism in the face of repression. Thank you for standing with us. **Most read** **Just in** June 11, 2025Serbian Leader in Ukraine for First Time Since Russian Invasion June 11, 2025Yandex Co-Founder Volozh's Dutch Tech Firm Unveils Second Supercomputer June 11, 2025Why the Families of Russia’s Regional Elites Still Covet Life in the West June 11, 2025The Wagner Group Is Leaving Mali. But Russian Mercenaries Aren't Going Anywhere. June 11, 2025Russia Moves to Revise 2025 Budget on Lower Energy Revenues and Wider Deficit June 11, 2025Russian Ruble Dips After EU Unveils New Sanctions on Energy and Banks June 11, 2025Estonia Jails Ex-Russian State Media Journalist 6 Years for Treason 1Russian Overnight Drone Strikes on Kharkiv Kill 3, Injure Dozens 2Russian Gymnastics Federation Announces Return to International Competitions 3Emergency Declared in Parts of Southern Russia as Drought Concerns Grow 4FSB Says It Foiled Assassination Attempt on Russian War Veteran 5Ukraine Says Russia Returned More Than 1.2K Bodies of Killed Soldiers **Read more** **Russia Jails Journalist for Criticizing Ukraine Offensive** **Russia Jails Journalist for Criticizing Ukraine Offensive** **'This Case Was a Fake from Start to Finish': Dagestani Journalist's Final Word in Russian Court** **'This Case Was a Fake from Start to Finish': Dagestani Journalist's Final Word in Russian Court** **Russian Journalist Safronov Loses Final Appeal of 22-Year Treason Sentence** **Russian Journalist Safronov Loses Final Appeal of 22-Year Treason Sentence** **Colleagues Rally Behind Russian Former Journalist Detained for Treason** **Colleagues Rally Behind Russian Former Journalist Detained for Treason** The Moscow TimesAbout usPrivacy PolicyPrivacy Manager About us Privacy Policy Privacy Manager Privacy Manager About us Privacy Policy Privacy Manager Privacy Manager Privacy Manager PodcastsVideosGalleriesNewslettersArchive Podcasts Videos Galleries Newsletters Archive Podcasts Videos Galleries Newsletters Archive Follow us Media Partnersbne IntelliNewsBelarusian Investigative Center bne IntelliNewsBelarusian Investigative Center bne IntelliNews Belarusian Investigative Center bne IntelliNewsBelarusian Investigative Center bne IntelliNews Belarusian Investigative Center bne IntelliNews Belarusian Investigative Center Euractiv Euractiv Euractiv Euractiv Euractiv Euractiv"}