{"id": 535, "name": "Frontiers in Detector Science and Technology", "domain": "frontiersin.org/journals/detector-science-and-technology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/detector-science-and-technology/articles/10.3389/fdest.2025.1551948/full", "title": "Detector Science And Technology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Data Acquisitions Methods and Readout Electronics Detector Physics Detectors Apparatus and Methods Materials for Detectors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Data Acquisitions Methods and Readout Electronics Detector Physics Detectors Apparatus and Methods Materials for Detectors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Data Acquisitions Methods and Readout Electronics Detector Physics Detectors Apparatus and Methods Materials for Detectors Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Detect. Sci. Technol., 02 May 2025 Sec. Detector Physics Volume 3 - 2025 |https://doi.org/10.3389/fdest.2025.1551948 **Gamma-ray and high-energy X-ray detection with large-area scintillating crystals: A hands-on review** Sezione INFN and Dipartimento di Fisica G. Occhialini, Universitá Milano Bicocca, Milano, Italy Detection of photons with scintillating inorganic crystals in the high-energy range (>0.1 MeV) will be discussed, making a comparison with other available methods. Energy resolutions up to 2% at 662 keV and fast decay time of the order of 20 ns are within reach, with the introduction of Ce-doped crystals in place of alkali halide ones. Development is underway for the production of non-hygroscopic scintillating crystals, such as PrLuAg and Ce: GAAG. At the end of this review, examples of experimental devices based on scintillating inorganic crystals will be discussed. Practical hands-on experience is emphasized at the expense of a more comprehensive description of all available and possible options. Detectors’ construction details and consequences of the different choices will be discussed. Emphasis will be put on theLaBr3: Ce-based detectors that are the present “golden standard” in gamma ray spectroscopy. The focus of this review will be on photon detection in the high-energy region: mainly 0.1–2 MeV, including both gamma rays and high-energy X-rays, even if many considerations may be applied to the detection of low-energy X-rays. **1 Introduction** Photons in the high-energy region (>0.1 MeV) include both gamma rays from nuclear decays and high-energy X-rays, such as the ones from muonic atomic decays. In the following, regardless of their origin, be it nuclear or atomic, we will use the generic term gamma rays to cover both types of radiation. X-rays were discovered approximately 130 years ago by W.C. Roentgen, by observing the glow on a phosphor screen (Roentgen, 1896). As direct registration of X-rays on a photographic plate is quite inefficient, a search for materials to convert X-rays into visible/ultraviolet (UV) light, to be detected later by a photographic plate, started immediately. Powders such asCWO4(Edison, 1896) or ZnS-based ones were then introduced. A similar indirect detection method is used with inorganic scintillating crystals. Direct detection of X-rays may be done instead with semiconductor detectors. Here, the incoming radiation is directly converted into the output signal, without an intermediate step. Gamma-ray detectors in common use may be divided into three main categories: • Gas-filled detectors • Semiconductor crystal detectors • Inorganic scintillating crystal detectors The choice depends on the energy range of interest, the needed energy resolution, and the required detection efficiency. In addition, other requirements such as count rate performances, signal pulse shape, and cost may be of relevance. In the high-energy region (>0.1 MeV) for photon detection, scintillating inorganic crystals are the most common choice for large-area detectors, and they will be fully reviewed in the following sections. **2 Detectors based on scintillating inorganic crystals** Common materials include sodium iodide (NaI(Tl)), bismuth germanate (BGO), lutetium-yttrium oxy orthosilicate (LYSO), lanthanum bromide (LaBr3:Ce), and many others. Their great importance is associated with their good energy and time resolution, their high counting rate capability (up to107counts/s), their high detection efficiency, and finally, their variety in size and making. Following are the main characteristics required for a scintillating crystal: • High material density in the range of 3–7 g/cm3, with high atomic number of the major constituent, to allow high detection efficiency for gamma rays (high “stopping power”). • Small decay time of the crystal’s fluorescent component providing fast signals, thus allowing high counting rates. • High light yield, improving the photon statistics and thus the energy resolution. • Small response nonlinearity, giving a small degradation in energy. • Chemical stability and radiation hardness. • Matching of the crystal peak emission wavelength with the photodetector peak response. The first scintillating crystals used for gamma ray detection were alkali halide ones (such as NaI, NaCl, and NaBr) with thallium as the activator (Pohl, 1938). If the concentration of thallium is small (up to 0.1 molar percent), luminescence is in the near UV region; otherwise, if it is larger (from 0.1 to 5 molar percent), the emission extends to the visible region. A crystal, such as NaI(Tl), is a nonconducting crystal. This means there is a large energy gap between its filled valence band and its empty conduction band. Energetic electrons generated by a gamma interaction with the NaI material will lose their kinetic energy by producing electron–hole pairs. The recombination of these pairs may result in light emission through radiative transitions or energy release as lattice vibrations. The inclusion of thallium at a10−3molar fraction significantly enhances the crystal’s light emission, acting as an activator. The radiative emission of thallium follows an exponential decay law with a large decay constant, meaning that luminescence occurs within a few microseconds. This enables the distinction of different scintillation events in time, which is crucial for differentiating the timing of gamma photon energy depositions. In a simple phosphor, the numberNof visible/UV photons produced in the scintillation conversion by an incoming gamma ray of energy E may be expressed as follows: whereEgapis the energy of the forbidden gap,QET(QEL)are the quantum efficiencies of the transport (luminescence) stages in visible/UV light production, andβis a phenomenological parameter in the range 2–3. Thus, the relative conversion efficiency is as follows: withEvisenergy of the generated visible/UV photons. For the best available material,ηreaches a value of∼0.2. For a scintillator as an inorganic crystal, one has to also take into account the collection time of photons after the gamma ray absorption, which, at the end, gives a lower value for the efficiencyη. After some preliminary studies on phosphors such as naphthalene (Kallman, 1947), anthracene (Bell, 1948), and calcium tungstate (Moon, 1948), the use of NaI(Tl) crystals for gamma detection was introduced in seminal papers byHofstader (1948),Hofstader (1949)in the late 40s. They were the crystals of election for many years, having a good photon yield and a reasonable energy resolution even with a long signal decay time (∼250ns). The additional problem of being hygroscopic was handled by a proper aluminum housing. NaI(Tl) typically converts approximately 11% of the incident gamma energy into photons, with an average energy of 3.0 eV per photon. For a 1 MeV photon, approximately3.8×104photons are produced on average. The statistical fluctuations in the number of photons generated by each gamma contribute to the observed width (energy resolution) of the observed photopeaks. **2.1 Available crystals** A selection of scintillating crystals in current use for gamma ray detection is shown inTable 1, with their main properties. Table 1. Main characteristics of the crystals commonly used for X-ray detection. Typical energy resolutions (FWHM in%), taken from published data, are measured with a PMT readout. Crystals are made from compounds, with a melting point in the typical range 700°C–2,000°C. They can be grown using melt-based methods such as the ones from Bridgman or Czochralski. These methods are suitable for growing large-volume crystals (Brice, 1986). The first relevant distinction is between hygroscopic crystals, where an encapsulation is needed, and non-hygroscopic ones. Whereas PrLuAG crystals (Drozdowski et al., 2008) and Ce: GAAG crystals (Yeom et al., 2013) are non-hygroscopic and thus do not need encapsulation, the more conventionalLaBr3: Ce (van Loef et al., 2001),CeBr3(Quarati et al., 2012) and NaI(Tl) scintillating crystals are hygroscopic. Their main properties are also shown inTable 1, which is a compilation from published data (Workman et al., 2022) and producers’ datasheets. The reported crystal’s thickness (Δz in cm) for 88% attenuation at lower energy is computed from mass attenuation coefficients, as reported in the study byHubbell and Seltzer (1996)and confirmed by Monte Carlo calculations with the MNCP code (Carter et al., 1975). NaI(Tl) crystals have been recently superseded by more performant Ce-doped crystals such asLaBr3:Ce, lanthanum bromochloride (LBC), and others, especially concerning the signal timing. At photon energies of 662 (122) keV, LBC has a full width at half maximum (FWHM) energy resolution of∼3% (∼6.4%) compared with 7% (9%) obtained with a NaI(Tl) crystal. Instead, the “golden standard”LaBr3: Ce has FWHM energy resolution of∼2.9% (∼6.6%) at 662 (122) keV. LaBr3: Ce is the crystal of choice for X-ray spectroscopy due to its high light output (∼60000γ/MeV), fast decay time (τ∼30ns), and small nonlinearity (less than 5%). This nonlinearity compares well with what has been measured for Na(Tl) (20%). Its scintillation properties are connected with the used cerium concentration, as shown in the stuudy byShah et al. (2002). Going from 0.5% concentration to 5%, the light output decreases by∼10%, whereas the decay time goes from 26 ns to 15 ns. All inorganic crystals based on lanthanum or lutetium suffer from an intrinsic activity, due to the presence of either the176Lu isotope in naturally occurring lutetium1or138La, which emits conversion electrons andβparticles with energy up to 1.7 MeV (Bonesini et al., 2016;Iyudin et al., 2009). Whereas the intrinsic activity of PrLuAg crystals is not negligible (∼36Bq/g), the intrinsic activity of Ce: GAAG crystals is minimal (≤1.5×10−3Bq/g). The activity ofLaBr3: Ce (∼0.2Bq/g) is half way between the two. CeBr3scintillating crystals (Quarati et al., 2007;Fraile, 2013;Ackerman, 2015) offer an alternative to NaI(Tl) for high-resolution gamma ray spectroscopy. With FWHM energy resolution similar to the one ofLaBr3: Ce, they do not suffer from the138La background typical for La-halide crystals, such asLaBr3: Ce and LBC. However, they have a small intrinsic background due to227Ac, giving a number of peaks between 1,500 and 2,200 keV. The new LBC crystals have similar properties toLaBr3:Ce ones but are mechanically stronger. With similar resolution at the137Cs peak, LBC suffers from the same138La problems as LaBr3:Ce. For a more complete review of the available scintillating inorganic crystals, the reader may refer to the study byNikl (2006)andYanagida (2018). Photon detectors in the high energy range (≥0.1MeV) have applications in many fields. Examples are time-of-flight (TOF) positron electron tomography (PET) imaging (Shah, 2005), fundamental physics such as the FAMU measurement at Riken-RAL of the Zemach proton radius (Pizzolotto et al., 2020), gamma-ray astronomy (Gostojic et al., 2016), and homeland security (Zentai, 2008). **2.2 Assembly of crystal-based detectors** Crystals are commonly made in cylindrical or cubic shapes. Usually, only one surface of the scintillator is designed to provide the light output, whereas the others are coated with diffusive or reflecting materials2. This introduces the problem of matching the terminal face or the optical window of the crystal with the surface of the readout device. If SiPM arrays are used, nearly circular sizes may be obtained only by a custom mounting, as done, for example, in the FATIMA experiment (Pascu et al., 2025), using3×3and6×6mm2SiPM. In the standard mounting, either cubic crystals are used or some active area of the SiPM array does not see the crystal end-face. This implies a moderate increase in the dark noise. The optical coupling between crystal and the photodetector face is usually obtained by optical glue or silicon optical grease. More details are reported in the following. Detectors based on crystals may be mounted in different configurations, according to experimental requirements, even if the standard cylindrical or parallelepiped form of mounting is available from producers such as Berkeley Nucleonics, Bicron, CAEN, and Nuclear Instruments. An example of a custom detector’s mounting from the FAMU experiment at RAL is shown in the left and middle panels ofFigure 1. The crystal holder was made in ABS with a 3D printer. Figure 1. Left panel. Top-left: image of a complete 1″ X-ray detector for the FAMU experiment at RAL. Bottom-left: images of some details of the crystal holder: H) with the printed circuit board (PCB) inside, K) with mounted SiPM array, and M) with crystal inside. Right: exploded view of a 1″ detector. From top to bottom:(a)heat dissipator,(b)detector base,(c)gap filler,(d)PCB,(e)PCB holder, and(f)crystal holder. Right panel. Top-right: image of the i-Spector detector. Bottom-right: exploded inside view of one i-Spector detector. Crystals of different types and sizes may be provided (courtesy of CAEN srl). Instead, an innovative off-the-shelf solution is the i-Spector detector from CAEN, as shown in the right panel ofFigure 1. It is a fully integrated tube designed to replace existing systems based on PMTs. It includes an SiPM array, an amplifier stage, an integrated power supply for biasing of SiPM, and temperature drift correction of SiPM gain. When the bottom face of a crystal has a similar or equal area to the photodetector’s one, a simple coupling, based on optical glue or optical cement, may be used3. If, instead, there is a large mismatch in the two areas, a light guide is utilized. Such light guides are made of optical quality plexiglass, lucite, or perspex and work on the principle of internal reflection. Light is “guided” from one end to the other via internal reflections between the external walls of the light guide. For this scope, the external walls are polished. As the given flux of light at the input can never be concentrated into a smaller cross-sectional area at the output (Garwin, 1970), other methods, such as Winston cones (Winston, 1970), have to be used, to maximize the collection of incoming rays. A Winston cone is an off-axis parabola of revolution designed to maximize the collection of incoming rays within some field of view. Winston cones are non-imaging light concentrators intended to funnel all wavelengths passing through the entrance aperture out through the exit aperture. They maximize the collection of incoming rays by allowing off-axis rays to make multiple bounces before passing out of the exit aperture. **2.3 Readout techniques** The output signal from scintillating inorganic crystals may be read by different photodetectors such as photomultipliers (PMTs), silicon photomultipliers (SiPMs), silicon avalanche photodiodes (Si-APD), and silicon drift detectors (SDDs). The advantages and disadvantages of the different solutions will be discussed in the following. Their main characteristics are presented inTable 2, where QE is the peak quantum efficiency andVopis the operating voltage. Table 2. Main characteristics of used photodetectors for crystal readout. Typical values are reported. A PMT has been the conventional choice for many years for crystal readout. The main characteristics of some PMTs from Hamamatsu Photonics or Photonis, which are currently in use, are shown inTable 3. When a good energy resolution is needed, PMTs with higher photocathode QE have to be used. Hamamatsu has recently introduced an Ultra BiAlkali (UBA) photocathode (QE≃42%at 380 nm) replacing the old BiAlkali (BA) one (QE≃22%at 380 nm). Table 3. Main characteristics of some PMTs from Hamamatsu or Photonis that are in common use for crystal readout. The use of high photon yield crystals coupled to high-efficiency photocathodes may produce very high peak currents with the dynodes’ current saturation, producing nonlinear effects. To deal with these effects, one may reduce the number of dynodes or use a tapered voltage divider. In this last design, the voltage gradient is enhanced in either the first and/or last few stages. The output linearity is thus improved. Another way to increase the linearity is to use transistors or Zener diodes instead of resistors in the last few stages of the divider. This active divider ensures a good linearity up to an output current of∼60−70% of the voltage divider current, as explained in the study byHamamatsu (2017). At low detector rates (≤10 kHz), no difference is seen between resistor-type and active-type voltage dividers, as shown in the study byGandolfo et al. (2023). Examples of LaBr3:Ce detectors with a PMT readout are reported in several studies (Pani et al., 2008;Omer et al., 2013;Cinti et al., 2013;Gandolfo et al., 2023;Baldazzi et al., 2017;Chewpraditke and Moszynski, 2011;Quarati et al., 2007;Swiderski et al., 2015;Giaz et al., 2014;Giaz et al., 2013). Their main characteristics are shown inTable 4. Table 4. Main characteristics of some LaBr3:Ce detectors with PMT readout. R is the FWHM energy resolution. WhereasLaBr3:Ce crystals of small sizes were grown starting from 2001, only in 2008, Saint Gobain Crystals were able to grow large-sized crystals up to 3.5″ × 8″, which were under test in the study byGiaz et al. (2013). For these large-sized crystals, performances are affected in addition by self-absorption, possible internal non-homogeneity that may affect the light yield, and the longer mean free path to the photodetector’s front face. As a consequence, their properties may not immediately be extrapolated from the ones of smaller crystals. Silicon photomultipliers (SiPMs) are a valuable alternative to conventional photomultipliers (PMTs) for the readout of scintillation detectors4. As readout devices, they have high reliability, low sensitivity to external magnetic fields, and can operate at voltages significantly lower than the ones used for PMTs. Using a SiPM array for the readout of an inorganic scintillating crystal, it is possible to obtain energy resolutions comparable to what is obtained with PMTs. However, SIPMs have a relevant problem: in addition to an increased noise level, their gain drifts significantly as a function of temperature. This feature prevents their use in conditions with a changing temperature, such as homeland security and military applications, unless anad hoccorrection, either offline or online, is implemented. To read large-area crystals instead of a single SiPM (max area6×6mm2), SiPM square arrays of typical size 1″ or 1/2″ are used. A larger area (up to 2″) may be obtained by combining single SiPMs, as done in the study byDu et al. (2016), at the cost of increased dark noise and the need to engineer a custom PCB. The main characteristics of some available SiPM arrays are reported inTable 5. Operating voltagesVopare set toVbrk+ΔV, where the overvoltageΔVis chosen according to the manufacturer’s specifications. Typical overvoltages are in the range 2–5 V. Table 5. Main characteristics of common SiPM 1/2“ and 1” arrays. Data are from producers’ datasheets. The photon detection efficiency (PDE) of SiPM arrays at different light wavelengths depends also on the type of window used: epoxy or silicone. A more fragile silicone window is used to increase the response at approximately 380 nm (near UV) to match the light emission ofLaBr3:Ce or PrLuAg crystals. For other types of crystals, epoxy-type windows, with better mechanical characteristics, are to be preferred. In the case when the signals from the SiPM cells in the readout of an SiPM array are summed up, the different cells may be powered using different schemes (“ganging”). The type of “ganging” used has a relevant influence on the shaping time of the signal (especially the fall time). A simple processing scheme, based on a flash analog to digital converter (FADC), digitizes the input signal, producing charge, amplitude, and timing informations. This scheme compares well with the one used in a standard spectroscopic chain where the input signal is shaped by a spectroscopic amplifier5going to a multi-channel analyzer (MCA). In the following section, results with different ganging schemes will be shown, going from standard parallel ganging to hybrid ganging and, finally, to a custom 4–1 scheme developed by Nuclear Instruments. Examples of LaBr3:Ce detectors with an SiPM array readout are reported in several studies (Divita et al., 2022;Poleshchuck et al., 2021;Bonesini et al., 2023b;Bonesini et al., 2023a;Cozzi et al., 2017;He et al., 2023). Their main characteristics are shown inTable 6. Table 6. Main characteristics of someLaBr3:Ce detectors with SiPM array readout. R is the FWHM energy resolution. The breakdown voltageVbdof an SiPM varies with temperature according to the following equation: whereT0is the reference temperature (typically 25°C) andβis the temperature coefficient of the SiPM, given byΔVbdΔT(for instance, 34 mV/C for Hamamatsu S14161). As a result, the operating voltageVop=Vbd+ΔV, whereΔV is the overvoltage, must be adjusted accordingly to maintain a consistent gain, as discussed in the study byDinu et al. (2010)andOtte et al. (2017). The response of a typical 1″ detector to a137Cs source in a Memmert IPV-30 climatic chamber, where the temperature spans the range between 20°C and 30°C, is shown in the top panel ofFigure 2. Without the online temperature correction, the resolution of the 662 keV photopeak is significantly degraded. With the online temperature correction applied (further details provided below), no major degradation of the137Cs photopeak is observed. Figure 2. Top panel. Top-left:137Cs spectra recorded by aLaBr3:Ce 1″ detector read by a Hamamatsu 14461 SiPM array during a temperature scan between 20°C and 30°C, inside a climatic chamber, from the study byBonesini et al. (2023c), without temperature correction. Top-right: the same with online temperature correction. Arrows point to the position of the137Cs photopeak. Bottom panel. Bottom-left: dependence of the photo peak position at 662 keV for a typical 1″ detector with and without temperature correction. Bottom-right panel: dependence of the FHWM energy resolution for the same typical 1″ detector with and without temperature correction. The SiPM gain drift may be corrected by measuring the temperature of the SiPM array and making either an online or an offline correction. In addition to custom solutions, as implemented in previous studies (Kaplan, 2009;Eigen, 2019;Shim et al., 2021;Divita et al., 2022), electronic circuits for SiPM biasing and corrections with temperature are commercially available, as is the A7585 chip from CAEN. In the FAMU experiment at RAL, a solution based on the custom assembly of these chips in an 8-channel NIM module was developed. Temperature T is measured on the back side of the SiPM arrays via Analog Devices TMP37 thermistors to correct the operating voltage online (seeBonesini et al., 2016, andBonesini et al., 2022afor more details). As shown inFigure 2, the effect on the detector response (pulse height (P.H.) of the137Cs photopeak in a.u.) between 10°C and 30°C is reduced from 41%to 5%for 1”LaBr3:Ce detectors. The custom module has an interface with the control PC based on the I2C protocol via an FDTI USB-I2C or Arduino module. A single SiPM within an SiPM array can be interconnected in various configurations depending on specific requirements, such as speed, signal-to-noise ratio (S/N), and granularity. The top panel ofFigure 3illustrates the different possible conventional configurations. Figure 3. Top panel: layout of different ganging schemes for SiPMs: series ganging, parallel ganging, and hybrid ganging, from the study byBonesini et al. (2023b). Bottom panel: schematic behavior of the various stages of the Nuclear Instruments 4-1 PCB circuit. In parallel ganging, the increased capacitance results in slower rise times and longer fall times. Additionally, SiPMs with the same operating voltageVopmust be grouped together. On the other hand, in series ganging, the charge and amplitude are reduced, leading to faster signals but requiring higher operating voltages, specifically a factor of N more, where N is the number of individual SiPMs. Hybrid ganging combines both series and parallel connections: the SiPMs are connected in series for the signal and in parallel for the bias, with decoupling capacitors placed between them. This configuration, which was originally developed for the MEG II upgrade (Ogawa, 2016), uses a common bias voltage for all the SiPMs. Taking into account the shape of the produced signal waveforms with the different ganging schemes, the pulse height is nearly equivalent with either a series or a hybrid ganging, whereas it is smaller with a parallel ganging. Instead, time constants are bigger with parallel ganging and shorter with either series or hybrid ganging. The 4-1 Nuclear Instruments circuit is based on the idea of dividing 1″ square SiPM arrays into four sub-arrays to reduce the capacitance of the single elements, dealing with smaller detectors. In a single sub-array, the ganging is still parallel. As shown in the bottom panel ofFigure 3, in the initial stage (stage 1), the signal from each sub-array has a pole-zero compensation stage, followed by an amplification stage via Texas Instruments OPA695 amplifiers. Signals are then added in stage 2. The following stages realize an AC coupling (to cancel offsets) and invert the output signal. For construction details, refer to the studies byBonesini et al. (2023a)andBonesini et al. (2023b). Timing and energy resolution results for a typical 1”LaBr3:Ce detector are shown inTable 7for different “ganging” schemes, applied to the same 1”LaBr3:Ce detector. With both the hybrid ganging solution and the one with pole zero suppression + increased SiPM overvoltage, to compensate for signal reduction, good timing may be obtained. Unfortunately, a good FWHM energy resolution may be achieved only with the pole zero suppression + increased SiPM overvoltage(Vover)solution at the expense of increased noise. For more details, refer to the study byBonesini et al. (2022b). An optimal compromise is obtained with the 4-1 Nuclear Instruments solution, where at nominalVop, the rise time (fall time) of the signal is reduced by a factor∼2, with respect to parallel ganging while keeping the same good FWHM energy resolution. Table 7. Results for a typical 1″ detector with different ganging. Studies are underway to further reduce the fall time of the 4-1 Nuclear Instruments circuit solution. An additional factor of two is expected. Innovative readout schemes for crystals, based on Si-APD or silicon drift detectors (SSDs), have been recently proposed, but their use is still quite limited. SSDs were invented in 1964 byGatti and Rehak (1984). They have a lower noise and thus a better energy resolution in principle, as compared to PMTs, smaller mass, and lower power consumption, thus well fitting space applications. Being additionally sensitive to visible light, they may be used for the readout of scintillating inorganic crystals. As an example, in the study byGangemi et al. (2016), aLaBr3:Ce crystal measuring 0.5″ round and 0.5″ thick was coupled to an SSD developed by FBK Trento for the INFN-ASI RedSoX collaboration. A FWHM energy resolution of 3.45% was obtained at 662 keV. The result compares well with the ones obtained with a PMT readout and may be improved by a more efficient coupling between the crystal and the SSD and by an electronics with smaller noise. The authors estimate that these effects may contribute a term∼1.9% to the measured energy resolution. The good QE (∼60%) obtained with the newest Si-APD, Hamamatsu S8664-55, at theLaBr3:Ce emission peak has prompted the use of these devices. Unfortunately, the limited size of the available Si-APD as compared to one of the used crystals has produced worse energy resolution values due to the poor light sampling. In the study byScafe et al. (2007), values of 23.1% (7.3%) at the57Co peak and 7.3% (3.3%) at the137Cs peak are reported for a 0.5″ round and 0.5″ thick crystal for a Si-APD (PMT) readout. Using smallerLaBr3:Ce round crystals of 6 mm diameter and 6 mm thickness, different readout schemes were compared, avoiding the size mismatch between crystal and detector, in the study byMoszynski et al. (2008). Results show that Si-APD and PMTs are the best solutions below 100 keV, whereas SSDs are better at higher energies (≥300 keV). Clearly, with larger crystals (size 1″ or bigger), the light sampling problem is dominant. **2.4 Electronic processing chains** To process the analog signal from a crystal detector, different front-end schemes may be used. In the most simple case, a spectroscopy shaping amplifier is used. The amplifier is then followed by an MCA. If the analog signal is sizeable, it may instead be fed directly into a FADC channel, as shown in the study byBonesini et al. (2016). For segmented crystal detectors, many engineered processing chips are available, starting from the SPIROC application-specific integrated circuit (ASIC) developed by the OMEGA group in 2007 (Bouchet et al., 2007). With a large dynamic range and variable gain adjustment, it digitized the input information via a 12-bit Wilkinson ADC with a conversion time of80μs. More modern readout chips for SiPM or PMTs are commercially available from Weeroc and are described in the study byAhmed et al. (2021). **3 Performances of scintilating crystal-based detectors** Performances of a crystal-based detector involve FWHM energy resolution, linearity of the response vs. impinging X-ray energies, and signal timing properties as main properties. Detection efficiency, mainly connected with crystal thickness and density, also has to be considered. These properties depend on the crystal type and the chosen readout scheme. The energy resolution may be written as follows: whereδscintis the intrinsic crystal resolution,δtris the transfer component,δstatis the statistical contribution of the readout device, andδnoiseis the dark noise contribution connected to the detector’s current and the noise of the electronics. This last term is negligible with a PMT readout. The statistical contribution is given by whereNpeis the number of photoelectrons and F is the excess noise factor for SiPMs or APDs or a term expressed by1+ϵfor PMTs, whereϵis the variance of the electron multiplication gain in the device (Moszynski et al., 2002)6. The transfer componentδtris given instead by the variance associated with coupling between the crystal and photocathode. The intrinsic resolutionδscintdepends mainly on the nonlinearity of the scintillator response (Dorenbos et al., 1995;Moszynski et al., 2002). Other effects, such as the scintillator inhomogeneity or nonuniformity of the reflecting cover of the crystal, may also contribute. The number of photoelectrons(Npe)is proportional to the PDE, which may be expressed for an SiPM as follows: where QE is the quantum efficiency of the photocathode, FF is the filling-factor giving the ratio of the photodetector’s active area to the total area, and THR is the probability of electrons and holes to start the Geiger breakdown. The threshold THR depends on the applied voltage. Detectors’ linearity and FWHM energy resolution may be studied in a laboratory with calibrated radioactive sources, such as137Cs, or with X-ray machines. The linearity and the energy resolution for three common inorganic scintillating crystal detectors with an SiPM array readout are shown inFigure 4. The resolution of LBC is slightly better at low energies with respect to the one ofLaBr3:Ce. The solid line is a fit to the data, intended to guide the eye for theLaBr3:Ce crystal. The FWHM decreases linearly as a function of1E. Figure 4. Top panel: linearity for typical 1″ LaBr3:Ce, CeBr3, and LBC crystals read by a Hamamtsu S14161-6050-AS SiPM array. Bottom panel: FWHM energy resolution vs. energy for the same detectors. Energy in keV refers to the incoming photon. Data were obtained in a laboratory with a readout based on a CAEN V1730 fast FADC. Statistical errors are not reported, being smaller than the symbols’ size. The obtained energy resolution sometimes reduces the effectiveness of the application. This is also due to the limited light collection efficiency. As an example, in a BGO crystal,∼1% of the emitted photons are absorbed over a 1″ path and∼5% are absorbed in the bounces between the reflective sides. The mismatch in the refractive index among crystal (2.15), optical glass window (1.48), and silicon grease (1.4) produces an additional factor. At the end, only a 30%–40% light collection efficiency may be expected. To improve the energy resolution, exotic proposals such as including the scintillating crystal inside the PMT vacuum housing and depositing the cathode directly on the scintillator surface (Chen and Belbot, 2005) were studied. In this way, an increase in resolution for a BGO detector from 10% to 6% at 662 keV may be expected. Similar ideas were also proposed in the study byGrimma et al. (2003). A relevant issue for crystal-based detectors is their timing properties. They have a relevant impact on PET where adding TOF information enhances image-to-noise properties (Kuhn et al., 2006) or in experiments, such as FAMU, where a fast signal fall time may enhance the signal (prompt) background (delayed) X-ray separation (Bonesini et al., 2023a). In addition, a high-rate capability is a must in other experiments such as NUMEN (Cappuzzello et al., 2023). The light emission from an inorganic crystal normally follows an exponential decay law: withτdecay time (∼30ns forLaBr3: Ce). This simple exponential decay may be complicated by a persistence (“afterglow”) corresponding to a non-exponential component on a few ms timescale after the primary excitation has stopped (Nikl et al., 1996). Timing issues are not a problem with a PMT-based readout, where a fast PMT adds a little to the scintillator decay time. In the study bySchaart et al. (2010), a3×3×5mm3LaBr3:Ce (5%) is read by an SiPM obtaining a 10%–90% risetime of∼9ns and a∼120ns falltime, which is compared to that obtained in the study byKuhn et al. (2006)with a4×4×30mm3LaBr3:Ce (5%) read by a Hamamatsu R4998 PMT, where a 3 ns risetime is obtained. The difference may be reduced by using SiPMs with a bigger fill factor and increasing the doping of the crystal with Ce up to 30%. The FWHM coincidence resolving time (CRT) using twoLaBr3:Ce detectors and one interposedNa22source is101±2ps, corresponding to a position resolution of∼15mm. These results may be compared with what is obtained with other small crystals coupled to SiPMs. With two3×3×10mm3LYSO:Ce crystals, a CRT of 268 ps was obtained in the study byBurr and Wang (2007)and that of 240 ps was obtained in the study byKim et al. (2009). Compared to LSO:Ce and similar materials,LaBr3:Ce crystals have the problem of a lower stopping power, thus requiring thicker detectors to have the same detection efficiency. The use of larger crystals poses more severe problems due to the longer time-walk due to the increased variation of the photon path length with the interaction point (Moses, 2007). Without corrections, an increase of rise time up to∼29ns for a 4 × 4 SiPM 1″ array is observed, as compared to14±1ns for a PMT readout (Pizzolotto et al., 2020). This issue was not considered a problem in the FAMU experiment, as the relevant point was to have a signal fall time below 600 ns to be in a condition to distinguish the X-ray signal from the background. **3.1 Comparison with other detector types** The main alternatives to scintillating inorganic crystals are semiconductor detectors. They are based on crystal materials with a few eV band gap. Their operation is based on the direct collection of the charge carriers produced in the intrinsic region of the detector by photon interaction, applying a suitable bias voltage. Their advantage is due to a much better energy resolution. The better intrinsic resolution is due to their small Fano factor and the much smaller ionization energy required: a factor ten times smaller than the one of scintillator detectors. As an example, at 1,173 keV, the energy FWHM resolution is∼75keV for a NaI(Tl) scintillator and∼2.35keV for a high purity germanium (HPGe) detector. The drawback of the choice of the HPGe as the detector is the need of cooling the germanium crystal to reduce the intrinsic noise. At 20°C, a 1cm3sample of germanium generates2.5×1013electron–hole pairs from thermal energy, which is compared with a signal of3×105electron–hole pairs from a 1 MeV photon’s total absorption. Thus, at room temperature, the signal-to-noise (S/N) ratio would be quite low. Cooling at cryogenic temperatures is thus mandatory to reduce the thermal noise that manifests itself as a reverse leakage current. Whereas semiconductor detectors, such as HPGe, have superior energy resolution, scintillating crystal-based detectors have better timing performances.Figure 5from the study byBonesini et al. (2019)compares typical muonic X-ray spectra taken in the FAMU experiment at RAL, with different types of detectors. Figure 5. Muonic X-ray spectra recorded in the FAMU experiment at RAL using(a)1″ LaBr3:Ce counters with PMT readout, whereKβandKγlines are not resolved,(b)the HPGe detector, and(c)1/2″ LaBr3:Ce counters with SiPM array readout, from the study byBonesini et al. (2019) The better energy resolution of the HPGe detectors, as compared to LaBr3:Ce either with a PMT or an SiPM array readout, is clear. However, the much longer signal fall time of HpGe compared to LaBr3:Ce has prompted the choice of these last detectors in the FAMU experiment to have a better separation between the signal (delayed X-rays) and background (prompt X-rays). For nuclear spectroscopy at higher energy, CdTe and CdZnTe (CZT) have found increasing applications (Squillante and Entine, 1992;McConnel et al., 2000;Zambelli et al., 2020). Their main advantage is to operate at room temperature, with no need for cooling, and to have a high count-rate capability (up to108photons per second permm2). The FWHM energy resolution of CZT is better than that of any scintillating crystal on the market. Values of approximately 1.7% (5%) at 662 (122) keV are within reach. In addition, these detectors are not hygroscopic. CZT detectors may be built either as a single crystal up to a size 20 mm square or as an array made of smaller elements. The top and bottom sides are metalized with the cathode and anode terminals plus any guard rings to control electrical parameters and sensitivity. As CZT crystals are extremely brittle, low stress designs to produce reliable assemblies are required. On adding selenium to the CZT matrix, an outstanding resolution of up to 0.87% at 662 keV and 4.6% at 81 keV is reached for detectors of a size of4.5×4.5×10.8mm3(Roy et al., 2019). **3.2 Future improvements** Future improvements are mainly connected to the development of non-hygroscopic crystals, the improvement ofLaBr3:Ce characteristics withLi+,Na+,Mg2+,Ca2+,Sr2+, orBa2+co-doping (Yang et al., 2012;Alekhin et al., 2013) to increase energy resolution, and the development of new crystals responsive to both gamma rays and neutrons, such as CLBBC. As shown in the study byYang et al. (2012), with a Sr or Ba co-doping, there is a light output improvement of∼25%, reducing the energy FWHM resolution of approximately 14% at 120 keV and 662 keV in a 60 mm round and 80-mm-thick crystal. The decay time increases only slightly: from 17.2 ns to 18.2 ns (with Sr co-doping) and to 19.1 ns (with Ba co-doping). At the present moment, the best compromise is stillLaBr3:Ce crystals that have an excellent energy resolution (up to 2.5% at 662 keV) and good timing properties: a 100 ps coincidence resolving time was obtained, at the price of a moderate intrinsic activity (∼0.2Bq/g) due to the presence of138La. Detectors up to 3.5″ have been developed, and 1″ round detectors are in common use. They have extensive applications from PET or TOF PET to ones as a satellite payload in a harsh environment. For their readout, the new wave is the SiPM-based one, which is insensitive to magnetic fields and requires limited power to work at the cost of a temperature dependence of gain. **4 Examples of crystal-based gamma-ray detection systems** In the following, some gamma-ray detection systems based on scintillating crystals are discussed. They cover the field from fundamental physics: the FAMU experiment at RAL for the study of hyperfine spectroscopy of muonic hydrogen and the NUMEN experiment at INFN LNS, to study0νββdecay, to astrophysics: the Academy of China GECAM observatory for X-ray bursts. All detectors involveLaBr3:Ce detectors in some form or the other and suffer from different experimental problems and challenges. For the FAMU experiment at RAL, a fast detector response (fall time≤200ns) is required to separate the prompt background from the delayed X-ray signal. Instead in G-NUMEN, a high-rate capability (up to 300 kHz) is needed, whereas in the GECAM observatory, the radiation damage to SiPM arrays due to cosmic high-energy protons is an issue. Problems in all the examples are enhanced by the common requirement to have large-area detectors: at least 1″ in size. **4.1 The FAMU apparatus** The FAMU (Fisica degli Atomi Muonici) experiment at RIKEN-RAL (Pizzolotto et al., 2020;Adamzack et al., 2018) aims at high-precision spectroscopic studies of muonic hydrogen. In particular, it aims to measure the hyperfine splittingΔEhfsin the 1S state of muonic hydrogen (Bakalov et al., 1993;Adamczak et al., 2012;Vacchi et al., 2012). It makes use of a high-intensity pulsed low-energy muon beam (Matsuzaki et al., 2001), stopping in a hydrogen target, to produce muonic hydrogen (in a mixture of singlet F = 0 and triplet F = 1 states) and a tunable mid-IR (MIR) pulsed high-power laser (Baruzzo et al., 2024) to excite the hyperfine splitting (HFS) transition of the 1S muonic hydrogen (from F = 0 to F = 1 states). Exploiting the muon transfer from muonic hydrogen to another higher-Z gas in the target (such asO2or Ar), the(μ−p)1SHFS transition will be recognized by an increase in the number of X-rays from the(μZ*)cascade while tuning the laser frequencyν0(ΔEHFS=hν0). From the measure ofΔEhfs(μ−p)1S, the Zemach radiusrZof the proton (Zemach, 1956) may be deduced with a precision better than10−2, thus shedding new light on the problem of the proton radius puzzle (Antognini et al., 2013;Pohl et al., 2010). The signal X-ray detection (around 130 keV) is based onLaBr3:Ce crystals read either by photomultipliers (Baldazzi et al., 2017) or SiPM arrays (Bonesini et al., 2020)7. One HPGe detector is used for inter-calibration. In this experiment, a fast detector response (fall times≤200 ns) is needed to separate signal X-rays from the background. The FAMU setup for the 2023–2024 data taking is based on one ORTEC GEM-S5020P4 HpGe for inter-calibrations and 34LaBr3:Ce detectors: • Six 1″ round and 1″ thick detectors are read by conventional PMTs (Baldazzi et al., 2017). • Sixteen 1″ round and 0.5″ thick detectors are read by SiPM arrays (Bonesini et al., 2023a). • Twelve 1/2″ cubic detectors are read by SiPM arrays (Bonesini et al., 2016). In the 2024 data taking, the twelve 1/2″ detectors were replaced by 1″ round and 0.5″ thick detectors. An enlargement of the layout of the FAMU experimental setup in the region where X-ray detectors are placed is shown inFigure 6, where the 34LaBr3:Ce detectors are arranged in three crowns. Figure 6. Enlargement of the FAMU experimental setup in the region of X-ray detectors. The three crowns of LaBr3:Ce detectors are shown, together with the HPGe detector. The detectors with a PMT readout have a fully active divider and a custom digital pulse processor (DPP) based on 12-bit 500 M/s analog devices ADC, as explained in the study byBaldazzi et al. (2017). Timing and FWHM energy resolution of the three types of detectors are shown inTable 8. FWHM energy resolutions at137Cs and57Co peaks are from laboratory measurements, whereas those at 142 keV (Ag peak) are from beam data at RAL with 55 Mev/c impinging muons. For comparison, the FWHM energy resolution at the 142 keV muonic silver peak is1.26±0.17%from the HPGe detector, at the cost of a much longer fall time. Table 8. Average performances of FAMULaBr3:Ce detectors. Rise time and fall time (10%–90%) refer to the detectors’ analog outputs. Rise time and fall time are 10–90%and are measured in laboratory at the137Cs peak. Whereas 1/2″ detectors with an SiPM readout use a conventional parallel ganging, the 1″ detectors use the 4-1 NI layout, which reduces fall time by a factor of 2 at least. **4.2 The G-NUMEN apparatus** The G-NUMENLaBr3:Ce array is the future gamma spectrometer for the NUMEN experiment at INFN-LNS (Cappuzzello et al., 2023) that aims to study neutrinoless double beta decay(0νββ). Information on nuclear matrix elements of the0νββdecay will be obtained through double-exchange (DCE) reactions generated by heavy ions. As cross-sections of the order of a few nb are expected for DCE reactions, an apparatus with high sensitivity and resolution is needed. The experimental apparatus is made of the high-acceptance spectrometer (MAGNEX), a focal plane detector (FPD), and the G-NUMEN array. The G-NUMEN array includes 110 LaBr3:Ce detectors placed around the scattering chamber, as shown inFigure 7, and it will be used to detect the characteristic gamma-ray transitions in DCE events. The used detectors will have to sustain a rate up to 300 kHz per crystal. Having a conventional PMT readout with Hamamatsu R6231 PMTs, phototube stability under high rates is a relevant issue, together with linearity. The used LaBr3:Ce crystals are 1.5″ round and 2″ thick. At the137Cs peak, a FWHM energy resolution∼3% has been obtained. Figure 7. Image of the NUMEN experimental setup in the region of X-rays detectors, from the study byCappuzzello et al. (2023). **4.3 The GECAM experiment** The Gravitational Wave High-Energy Electromagnetic Counterpart All-Sky Monitor (GECAM) is a Chinese Academy of Sciences project aiming at the detection of the high-energy counterparts of gravitational waves (Feng and Su, 2024). Scientific goals of the GECAM include the detection of gamma-ray bursts (GRBs), solar flares (SGLs), and fast radio bursts (FRBs). Approximately 300 GRBs have been detected by GECAM, including the brightest GDR of all time, that is, the GRB221009A. This GDR was also detected by many other instruments worldwide, but the GECAM was the only one not suffering from signal saturation and pulse pile-up. The GeCAM includes four instruments, namely, GECAM A/B, GECAM C, and GECAM D, launched between December 2020 and March 2024, equipped with gamma-ray detectors (GDRs) mainly based on 3″ round and 15 mm thickLabr3:Ce detectors. The detectors have readout based on SiPMs: 646×6mm2SiPMs arranged in a circular shape (He et al., 2023). A FWHM energy resolution∼5.3% was reached at the137Cs peak in laboratory tests, matching the target requirement of 8%. Energy resolution and linearity were evaluated using radioactive sources and a high-energy X-ray calibration facility (HCXF). In-orbit gain variation of SiPMs due to temperature excursions was corrected, reducing nonuniformity from 17% to 0.6%. Due to the presence of background cosmic high-energy protons, an increase in the dark currents of SiPM∼0.43μA/day was observed, connected to the displacement damage in SiPMs under irradiation. To circumvent this phenomenon, anin situcurrent annealing was studied (Gu et al., 2023). The generated local heat during current flow may repair damage and defects. **5 Conclusion** The field of high-energy X-ray and gamma-ray detectors based on inorganic scintillating crystals is in continuous evolution. The last years have seen a relevant progress in the development of new scintillating crystals. Energy resolutions up to 2% at 662 keV are within reach, and heavy and fast scintillators have been produced. The present development effort is mainly concentrated on the improvement ofLaBr3:Ce crystals with co-doping, the introduction of new non-hygroscopic crystals, and the development of either new PMTs with higher photocathode QE or novel SiPM arrays with reduced dark noise, lower bias voltages, and larger dimensions. In addition, efforts for the development of new ASICs for the readout of segmented scintillating crystal are underway. The readout of scintillating inorganic crystals with SiPMs is promising, and FWHM energy resolutions and timing are reaching values that are obtained with conventional PMTs. However, a full understanding of the finite measured energy resolution of scintillating crystals (below the intrinsic one) has not yet been fully reached, even if there are hints that nonlinearity in the crystal’s response or nonuniformity may be the reason. **Author contributions** MB: conceptualization, funding acquisition, investigation, resources, supervision, validation, visualization, writing – original draft, and writing – review and editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by INFN Commissione 3 under the 2024 funding for the FAMU experiment at RAL. **Acknowledgments** This review is the outcome of a 10-year-old research activity in the FAMU experiment at RAL, where a lot of the shown problems were tackled. The author would like to thank all their colleagues of the FAMU collaboration, in particular Andrea Vacchi, Roberto Bertoni,Ludovico Tortora, and Emiliano Mocchiutti for many interesting discussions and suggestions. In addition, they would like to thank Francesco Caponio and Andrea Abba from Nuclear Instruments srl for many interesting discussions on SiPM readout and M. Saviozzi from CAEN srl for a lot of help on electronics issues. **Conflict of interest** The author declares that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Footnotes** 1τ1/2=3.78⋅1010years, 2.59% abundance. 2For crystals emitting aproximately at 310 nm, as PrLuAg, it is difficult to find a proper optical diffuser. The choice in the study byBonesini et al. (2016)was the Avian-B optical coating, based onBaSO4. A reflectance≥97%(≥92%)is quoted for it in the range 350–850 nm (250–1300 nm). 3Bicron BC600 (BC630) is a typical optical cement (grease) used in this case. BC630 has a refractive index of 1.465. 4A SiPM is a set of miniature avalanche photodiodes operating in Geiger mode, connected in parallel. Their outputs are connected to one common output. For a full discussion, see the studies byBuzhan et al. (2003)andVan Dam et al. (2010). 5The Ortec 672 NIM module is a well-known example. 6For good PMTs used in gamma spectroscopy,ϵis approximately 0.1. 7A preliminary study to asses if non-hygroscopic crystals, such as PrLuAg and Ce:GAAG, may be suitable was done, with a negative response, and is reported in the study byBonesini et al. (2017). **References** Ackerman, U., Ackermann, U., Egger, W., Sperr, P., and Dollinger, G. (2015). Time and energy resolution measurements of BaF2, BC-418, LYSO and CeBr3scintillators.Nucl. Instr. Meth.A786, 5–11. doi:10.1016/j.nima.2015.03.016 CrossRef Full Text|Google Scholar Adamczak, A., Bakalov, D., Stoychev, L., and Vacchi, A. (2012). Hyperfine spectroscopy of muonic hydrogen and the PSI lamb shift experiment.Nucl. Instrum. Methods Phys. Res. Sect. B Beam Interact. Mater. Atoms281, 72–76. doi:10.1016/j.nimb.2012.04.001 CrossRef Full Text|Google Scholar Adamczak, A., Baccolo, G., Banfi, S., Bakalov, D., Baldazzi, G., Benocci, R., et al. (2018). The FAMU experiment at RIKEN-RAL to study the muon transfer rate from hydrogen to other gases.JINST13, P12033. doi:10.1088/1748-0221/13/12/p12033 CrossRef Full Text|Google Scholar Ahmed, S., Blin, R., Callier, S., Cizel, S., Cizel, J. B., Conforti, S., de La Taille, C., et al. (2021). OMEGA SiPM readout ASICs.Nucl. Instr. Meth.A986, 164628. doi:10.1016/j.nima.2020.164628 CrossRef Full Text|Google Scholar Alekhin, M., Biner, D. A., Krämer, K. W., and Dorenbos, P. (2013). Improvement of LaBr3: 5 % Ce scintillation properties by Li, Na, Mg, Ca, Sr and Ba co-doping.J. Appl. Phys.113, 224904. doi:10.1063/1.4810848 CrossRef Full Text|Google Scholar Antognini, A., Nez, F., Schuhmann, K., Amaro, F. D., Biraben, F., Cardoso, J. M. R., et al. (2013). Proton structure from the measurement of 2S-2P transition frequencies of muonic hydrogen.Science339, 417–420. doi:10.1126/science.1230016 PubMed Abstract|CrossRef Full Text|Google Scholar Bakalov, D., Milotti, E., Rizzo, C., Vacchi, A., and Zavattini, E. (1993). Experimental method to measure the hyperfine splitting of muomic hydrogen (μ-p)1S.Phys. Lett. A172, 277–280. doi:10.1016/0375-9601(93)91021-v CrossRef Full Text|Google Scholar Baldazzi, G., Vacchi, A., Labanti, C., Morgante, G., Fuschino, F., Rignanese, L., et al. (2017). The LaBr3:Ce based detection system for the FAMU experiment.JINST12, C03067. doi:10.1088/1748-0221/12/03/c03067 CrossRef Full Text|Google Scholar Baruzzo, M., Suárez-Vargas, J. J., Stoychev, L. I., Cabrera, H., Gadedjisso-Tossou, K. S., Toci, G., et al. (2024). A mid-IR laser source for muonic hydrogen spectroscopy: the FAMU laser system.Opt. Laser Technol.179, 111375. doi:10.1016/j.optlastec.2024.111375 CrossRef Full Text|Google Scholar Bell, P. (1948). The use of Anthracene as a scintillation counter.Phys. Rev.73, 1405–1406. doi:10.1103/physrev.73.1405.2 CrossRef Full Text|Google Scholar Bonesini, M., Bertoni, R., Cervi, T., Clemenza, M., de Bari, A., Mazza, R., et al. (2016). “Laboratory tests for X-rays crystal detectors with SiPM array readout”.IEEE nuclear science symposium, medical imaging conference and room-temperature semiconductor detector workshop (NSS/MIC/RTSD), 1–5. doi:10.1109/NSSMIC.2016.8069925 CrossRef Full Text|Google Scholar Bonesini, M., Bertoni, R., Cervi, T., Clemenza, M., de Bar, A., Mazza, R., et al. (2017). Systematic study of innovative hygroscopic and non-hygroscopic crystals with SiPM readout.PoS(EPS-HEP2017), 777. doi:10.22323/1.314.0777 CrossRef Full Text|Google Scholar Bonesini, M. (2019). The FAMU experiment at RiKEN RAL.PoS(EPS-HEP2019), 132. doi:10.22323/1.364.0132 CrossRef Full Text|Google Scholar Bonesini, M., Benocci, R., Bertoni, R., Clemenza, M., Ghittori, D., Mazza, R., et al. (2020). Ce:LaBr3 crystals with sipm array readout and temperature control for the famu experiment at ral.JINST15, C05065. doi:10.1088/1748-0221/15/05/c05065 CrossRef Full Text|Google Scholar Bonesini, M., Benocci, R., Bertoni, R., Menegolli, A., Prata, M., Rossella, M., et al. (2023a). Large area Labr3:Ce crystals read by SiPM arrays with improved timing and temperature gain drift control.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.1046, 167677. doi:10.1016/j.nima.2022.167677 CrossRef Full Text|Google Scholar Bonesini, M., Benocci, R., Bertoni, R., Menegolli, A., Prata, M., Rossella, M., et al. (2023b). 1 inch LaBr3:Ce detectors, with temperature control and improved time resolution for low energy X-ray spectroscopy.PoS (EPS-HE2023), 547. Google Scholar Bonesini, M., Bertoni, R., Abba, A., Caponio, F., Prata, M., and Rossella, M. (2023c). Improving the time resolution of large-area LaBr3:Ce detectors with SiPM array readout.Condens. Matter8, 99. doi:10.3390/condmat8040099 CrossRef Full Text|Google Scholar Bouchel, M., Dulucq, F., Fleury, J., de La Taille, C., Martin-Chassard, G., Raux, L., et al. (2007). SPIROC (SiPM integrated read-out chip).IEEE NSS-MIC, 1857–1860. doi:10.1109/NSSMIC.2007.4436519 CrossRef Full Text|Google Scholar Brice, J. (1986).Crystal growth processes. Glasgow:Blackie Halsted Press. Google Scholar Burr, K., and Wang, G. (2007). Scintillation detection using 3 mm × 3 mm silicon photomultipliers.IEEE trans. Nucl. Sci. Conf. Record, 975–982. Google Scholar Buzhan, P., Dolgoshein, B., Filatov, L., Ilyin, A., Kantzerov, V., Kaplin, V., et al. (2003). Silicon Photomultipliers and its possible applications.Nucl. Instr. Meth.A504, 48–52. doi:10.1016/S0168-9002(03)00749-6 CrossRef Full Text|Google Scholar Cappuzzello, F., Acosta, L., Agodi, C., Boztosun, I., Brischetto, G. A., Calabrese, S., et al. (2023). The NUMEN project: an update of the facility towards the future experimentals campaign.Front. Astron, Space Sci.8, 668587. doi:10.3389/fspas.2021.668587 CrossRef Full Text|Google Scholar Carter, L. L., Cashwell, E. D., Everett, C. J, Forest, C. A., Schrandt, R. G, Taylor, W. M., et al. (1975). Monte Carlo development in Los Angeles LA-5903-MS. Google Scholar Chen, G., and Belbot, M. (2005). Improving energy resolution of scintillation detectors.IEEE Nucl. Sci. Symposium Conf. Rec. 20051, 235–238. doi:10.1109/NSSMIC.2005.1596244 CrossRef Full Text|Google Scholar Chewpraditke, W., and Moszynski, M. (2011). Scintillation properties of Lu3Al5O12, Lu12SiO5and LaBr3crystals activated with Cerium.Phys. Procedia22, 218–226. Google Scholar Cinti, M., Pani, R., Pellegrini, R., Bennati, P., Orlandi, C., Fabbri, A., et al. (2013). Spectrometric performances of high quantum efficiency multi and single anode pmts coupled to LaBr3:Ce crystal.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.724, 27–33. doi:10.1016/j.nima.2013.04.045 CrossRef Full Text|Google Scholar Cozzi, G., Buonanno, L., Busca, P., Carminati, M., Fiorini, C., Montagnani, G. L., et al. (2017). A SiPM-based detection module for 2 LaBr3:Ce readout for nuclear physics applications.2017 IEEE nuclear science symposium and medical imaging conference NSS/MIC, 1–3. doi:10.1109/NSSMIC.2017.8532888 CrossRef Full Text|Google Scholar Dinu, N., Bazin, C, Chaumat, V, Cheikali, C, Para, A, Puill, V, Sylvia, C, and Vagnucci, JF (2010). “Temperature and bias voltage dependence of the MPPC detectors,“.IEEE Nuclear Science Symposuim & Medical Imaging Conference, 215–219. doi:10.1109/nssmic.2010.5873750 CrossRef Full Text|Google Scholar Di Vita, D., Buonanno, L., Canclini, F., Ticchi, G., Camera, F., Carminati, M., et al. (2022). A 144-SiPM 3 inches LaBr3 readout module for PMTs replacement in Gamma Spectroscopy.Nucl. Instr. Meth.A1040, 167179. doi:10.1016/j.nima.2022.167179 CrossRef Full Text|Google Scholar Dorenbos, P., de Haas, J., and van Eijk, C. (1995). Non-proportionality in the scintillation response and the energy resolution obtainable with scintillation crystals.IEEE Trans. Nucl. Sci.42, 2190–2202. doi:10.1109/23.489415 CrossRef Full Text|Google Scholar Drozdowski, W., Dorenbos, P., de Haas, J. T. M., Drozdowska, R., Owens, A., Kamada, K., et al. (2008). Scintillation properties of praseodymium activatedLu3Al5O12single crystals.IEEE Trans. Nucl. Sci., 2429. doi:10.1109/TNS.2008.2000845 CrossRef Full Text|Google Scholar Du, J., Yang, Y., Bai, X., Judenhofer, M. S., Berg, E., Di, K., et al. (2016). Characterization of large-area SiPM array for PET applications.IEEE Trans. Nucl. Sci.63, 8–16. doi:10.1109/tns.2015.2499726 PubMed Abstract|CrossRef Full Text|Google Scholar Edison, T. (1896). Notes.Nature53. Google Scholar Eigen, G. (2019). Gain stabilization of SiPMs and afterpulsing.J.Phys.:Conf. Ser.1162, 012013. doi:10.1088/1742-6596/1162/1/012013 CrossRef Full Text|Google Scholar Feng, P.-Y., and Su, X.-L. (2024). SiPM-based gamma-ray detectors of GECAM.Nucl. Instr. Meth.A1069, 169826. doi:10.1016/j.nima.2024.169826 CrossRef Full Text|Google Scholar Fraile, L. M., Mach, H., Vedia, V., Olaizola, B., Paziy, V., Picado, E., et al. (2013). Fast timing study of CeBr3crystal: time resolution below 120ps at60Co energies.Nucl. Instr. Meth.A701, 235–242. doi:10.1016/j.nima.2012.11.009 CrossRef Full Text|Google Scholar Gandolfo, E., Oliveira, J. R. B., Campajola, L., Pierroutsakou, D., Boiano, A., Agodi, C., et al. (2023). Response of G-NUMEN LaBr3:Ce detectors to high counting rates.Instruments7, 28. doi:10.3390/instruments7030028 CrossRef Full Text|Google Scholar Gangemi, C. (2016).Characterization of a versatile sensitive detector for gamma ray astronomy.Master Thesis Bologna. Google Scholar Garwin, R. (1970).Nucl. Instr. Meth.83, 145. Google Scholar Gatti, E., and Rehak, P. (1984). Semiconductor drift chamber. an application of a novel charge transport scheme.Nucl. Instrum. Methods Phys. Res.225, 608–614. doi:10.1016/0167-5087(84)90113-3 CrossRef Full Text|Google Scholar Giaz, A., Pellegri, L., Riboldi, S., Camera, F., Blasi, N., Boiano, C., et al. (2013). Characterization of large volume 3.5 x 8 LaBr3: Ce detectors.Nucl. Instr. Meth.A729, 910–921. doi:10.1016/j.nima.2013.07.084 CrossRef Full Text|Google Scholar Giaz, A., Blasi, N., Camera, F., Boiano, C., Brambilla, S., Million, B., et al. (2014). 3 x 3 LaBr3:Ce position sensitivity with multi-anode PMT readout,”.2014 IEEE Nucl. Sci. Symposium Med. Imaging Conf. (NSS/MIC), 1–5. doi:10.1109/NSSMIC.2014.7431199 CrossRef Full Text|Google Scholar Gostojić, A., Tatischeff, V., Kiener, J., Hamadache, C., Peyré, J., Karkour, N., et al. (2016). Characterization of LaBr3:Ce and CeBr3calorimeter modules for 3d imaging in gamma-ray astronomy.Nucl. Instr. MethA832, 24. doi:10.1016/j.nima.2016.06.044 CrossRef Full Text|Google Scholar Grimm, O., Kim, G., Lee, M., Röser, U., Viertel, G., and von Gunten, H. (2003). A channel photomultiplier with a scintillator faceplate.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.513, 644–646. doi:10.1016/j.nima.2003.07.034 CrossRef Full Text|Google Scholar Gu, F., Liu, Y., Sun, X., Xu, Y., Zhang, D., An, Z., et al. (2023). Achieving significant performance recovery of SiPM’s irradiation damage within-situcurrent annealing.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.1053, 168381. doi:10.1016/j.nima.2023.168381 CrossRef Full Text|Google Scholar Hamamatsu (2017).Photomultiplier tubes. 4th Edition. Google Scholar He, J., An, Z. H., Peng, W. X., Li, X. Q., Xiong, S. L., Zhang, D. L., et al. (2023). Ground-based calibration and characterization of LaBr3-SiPM-based gamma-ray detector on GECAM satellite: 8-160 keV.Mon. Notices R. Astronomical Soc.525, 3399–3412. doi:10.1093/mnras/stad2439 CrossRef Full Text|Google Scholar Hofstader, R. (1949). The detection of gamma-rays with thallium activated sodium iodide crystals.Phys. Rev.796. Google Scholar Hofstadter, R. (1948). Alkali halide scintillation counters.Phys. Rev.74, 100–101. doi:10.1103/physrev.74.100 CrossRef Full Text|Google Scholar Hubbell, J., and Seltzer, S. (1996). X-ray mass attenuation coefficients. Available online at:https://www.nist.gov/pm/X-ray-mass-attenuation-coefficients. Google Scholar Iyudin, A., Bogomolov, V. V., Svertilov, S. I., Yashin, I. V., Klassen, N. V., Shmurak, S. Z., et al. (2009). Peculiarities of intrinsic background in LaBr3: Ce and CeBr3crystals.Instrum. Exp. Tech.52, 774–781. doi:10.1134/s0020441209060037 CrossRef Full Text|Google Scholar Kallman, H. (1947). Natur and technik. Google Scholar Kaplan, A. (2009). Correction of SiPM temperature dependencies.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.610, 114–117. doi:10.1016/j.nima.2009.05.137 CrossRef Full Text|Google Scholar Kim, C., Wang, G. C., and Dolinsky, S. (2009). Multi-pixel photon counters for TOF PET detector and its challenges.IEEE Trans. Nucl. Sci.56, 2580–2585. doi:10.1109/tns.2009.2028075 CrossRef Full Text|Google Scholar Kuhn, A., Surti, S., Karp, J., Muehllehner, G., Newcomer, F., and VanBerg, R. (2006). Performance assessment of pixelated LaBr3detector modules for TOF PET.IEEE Trans. Nucl. Sci.53, 1090–1095. doi:10.1109/tns.2006.873708 CrossRef Full Text|Google Scholar Matsuzaki, T., Ishida, K., Nagamine, K., Watanabe, I., Eaton, G., and Williams, W. (2001). The RIKEN RAL pulsed muon facility.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.465, 365–383. doi:10.1016/s0168-9002(01)00694-5 CrossRef Full Text|Google Scholar McConnell, M. L., Macri, J. R., Ryan, J. M., Larson, K. P., Hamel, L. A., Bernard, G., et al. (2000). Three-dimensional imaging and detection efficiency performance of orthogonal CZT strip detectors.Proc. SPIE4141, 157–167. doi:10.1117/12.407576 CrossRef Full Text|Google Scholar Moon, R. (1948). Inorganic crystals for the detection of high energy particles and quanta.Phys. Rev.73, 1210. doi:10.1103/physrev.73.1210 CrossRef Full Text|Google Scholar Moses, W., and Shah, K. S. (2005). Potential of RbGd2Br7:Ce, LaBr3:Ce and LuI3:Ce in nuclear medical imaging.Nucl. Instr. Meth.537, 317. doi:10.1016/j.nima.2004.08.034 CrossRef Full Text|Google Scholar Moses, W. (2007). Recent advances and future advances in time-of-flight PET.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.580, 919–924. doi:10.1016/j.nima.2007.06.038 PubMed Abstract|CrossRef Full Text|Google Scholar Moszyński, M., Zalipska, J., Balcerzyk, M., Kapusta, M., Mengesha, W., Valentine, J. D., et al. (2002). Intrinsic energy resolution of NaI (Tl).Nucl. Instr. Meth.A484, 259–269. doi:10.1016/S0168-9002(01)01964-7 CrossRef Full Text|Google Scholar Moszynski, M., Plettner, C., Nassalski, A., Szczesniak, T., Swiderski, L., Syntfeld-Kazuch, A., et al. (2009). “A comparative study with PMTs, avalanche photodiodes, photodiodes and PIN photodiodes in gamma spectroscopy with LaBr3crystals,”, 56.IEEE Trans. Nucl. Sci., 1006–1011. doi:10.1109/tns.2008.2005110 CrossRef Full Text|Google Scholar Nikl, M., Nitsch, K., Polak,, K., Mikokova, E., Dafinei, I., et al. (1996). Slow components in the photoluminescence and scintillation decay of PbWO4single crystals.Phys. Status Solidib195, 311–323. Google Scholar Nikl, M. (2006). Scintillation detectors for x-rays.Meas. Sci. Technol.17, R37–R54. doi:10.1088/0957-0233/17/4/r01 CrossRef Full Text|Google Scholar Ogawa, M. (2016).MEG II collaboration. Master Thesis:University of Tokio. Google Scholar Omer, M., Ohgaki, H., Negm, H., Daito, I., Hori, T., Kii, T., et al. (2013). “Performance of LaBr3(Ce) array detector system for non-destructive inspection of special nuclear material by using nuclear resonance fluorescence,” inIEEE Int. Conf. Technol. Homel. Secur. (HST), 671–676doi. doi:10.1109/THS.2013.6699084 CrossRef Full Text|Google Scholar Otte, A., Garcia, D., Nguyen, T., and Purushotham, D. (2017). Characterization of three high efficiency and blue sensitive silicon photomultipliers.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.846, 106–125. doi:10.1016/j.nima.2016.09.053 CrossRef Full Text|Google Scholar Pani, R., Cinti, M., Scafe, R., Bennati, P., Pellegrini, R., Vittorini, F., et al. (2008). Gamma-ray spectroscopy with LaBr3:Ce scintillation crystal coupled to an ultra high quantum efficiency pmt.2008 IEEE Nucl. Sci. Symposium Conf. Rec., 2462–2466. doi:10.1109/nssmic.2008.4774853 CrossRef Full Text|Google Scholar Pascu, S., Stoica, A., Neacşu, C., Bruce, A., Costache, C., Das, B., et al. (2025). New readout system of the FATIMA detectors based on silicon photomotipliers arrays.Nucl. Instr. Meth., A17001. doi:10.1016/j.nima.2024.170001 CrossRef Full Text|Google Scholar Pizzolotto, C., Adamczak, A., Bakalov, D., Baldazzi, G., Baruzzo, M., Benocci, R., et al. (2020). The FAMU experiment: muonic hydrogen high precision spectroscopy studies.Eur. Phys. J. A56, 185. doi:10.1140/epja/s10050-020-00195-9 CrossRef Full Text|Google Scholar Pohl, R., Antognini, A., Nez, F., Amaro, F. D., Biraben, F., Cardoso, J. M. R., et al. (2010). The size of the proton.Nature466, 213–216. doi:10.1038/nature09250 PubMed Abstract|CrossRef Full Text|Google Scholar Pohl, R. (1938). Zusammen fassender bericht uber elektronenleitung und photochemische vorgang in alkalihalogeneid kristallen.Zeit. Phys.39, 36. Google Scholar Poleshchuck, O., Swartz, J. A., Arokiaraj, A., Ceruti, S., De Witte, H., Grinyer, G. F., et al. (2021). Performances tests of a LaBr3:Ce detector coupled to a SiPM array and the GET electronics forγ-ray spectroscopy in a strong magnetic field.Nucl. Istr. Meth.A987, 1648663. doi:10.1016/j.nima.2020.164863 CrossRef Full Text|Google Scholar Quarati, F., Bos, A. J. J., Brandenburg, S., Dathy, C., Dorenbos, P., Kraft, S., et al. (2007). X-ray and gamma-ray response of a 2 x 2 LaBr3: Ce scintillation detector.Nucl. Instr. Meth.A574, 115–120. doi:10.1016/j.nima.2007.01.161 CrossRef Full Text|Google Scholar Quarati, F., Dorenbos, P., van der Biezen, J., Owens, A., Selle, M., Parthier, L., et al. (2013). Scintillation and detection characteristics of high-sensitivity CeBr3gamma-ray spectrometers.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.729, 596–604. doi:10.1016/j.nima.2013.08.005 CrossRef Full Text|Google Scholar Roentgen, W. (1896). On a new kind of rays.Science3 (59), 227–230. Google Scholar Roy, U., Camarda, G. S., Cui, Y., Gul, R., Yang, G., Zazvorka, J., et al. (2019). Evaluation of cdzntese as a high-quality gamma-ray spectroscopic material with better compositional homogeneity and reduced defects.Sci. Rep.9, 7303. doi:10.1038/s41598-019-43778-3 PubMed Abstract|CrossRef Full Text|Google Scholar Scafe, R., Pani, R., Pellegrini, R., Iurlaro, G., Montani, L., and Nerina Cinti, M. (2007). Si-APD readout for LaBr3:Ce scintillator.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.571, 355–357. doi:10.1016/j.nima.2006.10.108 CrossRef Full Text|Google Scholar Schaart, D. R., Seifert, S., Vinke, R., van Dam, H. T., Dendooven, P., Löhner, H., et al. (2010). LaBr3:Ce and SiPMs for time-of-flight PET: achieving 100 ps coincidence resolving time.Phys. Med. Biol.55, N179–N189. doi:10.1088/0031-9155/55/7/n02 PubMed Abstract|CrossRef Full Text|Google Scholar Shah, K. S., Glodo, J., Klugerman, M., Moses, W. W., Derenzo, S. E., Weber, M. J., et al. (2002). LaBr3:Ce scintillators for gamma ray spectroscopy.LBNL-51793. Available online at:https://www.osti.gov/servlets/purl/894974 Google Scholar Shim, H. S., Park, H., and Lee, J. S. (2021). A temperature-dependent gain compensation technique for positron emission tomography detectors based on a silicon photomultiplier.Phys. Med. Biol.66, 205015. doi:10.1088/1361-6560/ac2b81 PubMed Abstract|CrossRef Full Text|Google Scholar Squillante, M., and Entine, G. (1992). New applications of CdTe nuclear detectors.Nucl. Instrum. Methods Phys. Res. Sect. A Accel. Spectrom. Detect. Assoc. Equip.322, 569–574. doi:10.1016/0168-9002(92)91234-z CrossRef Full Text|Google Scholar Swiderski, L., Gojska, A., Grodzicka, M., Korolczuk, S., Mianowski, S., Moszynski, M., et al. (2016). Scintillators for high temperature plasma diagnostics.Proc. 1st EPS Conf. Plasma Diagnostics — PoS(ECPD2015), 162. doi:10.22323/1.240.0162 CrossRef Full Text|Google Scholar Vacchi, A., Adamczak, A., Andreson, B., Bakalov, D., Battistoni, G., Bhattacharya, N., et al. (2012). “Measuring the size of the proton,” inSPIE NewsRoom. doi:10.1117/2.1201207.004274 CrossRef Full Text|Google Scholar van Dam, H., Seifert, S., Vinke, R., Dendooven, P., Lohner, H., Beekman, F. J., et al. (2010). A comprehensive model of the response of silicon photomultipliers.IEEE Trans. Nucl. Sci.57, 2254–2266. doi:10.1109/tns.2010.2053048 CrossRef Full Text|Google Scholar van Loef, E., Dorenbos, P., van Eijk, C. W. E., Krämer, K., and Güdel, H. U. (2001). High resolution scintillator: Ce3+Activated LaBr3:Ce.Appl. Phys. Lett.79, 1573–1575. doi:10.1063/1.1385342 CrossRef Full Text|Google Scholar Winston, R. (1970). Light collection within the framework of geometrical optics*.J. Opt. Soc. Am.60, 245–247. doi:10.1364/josa.60.000245 CrossRef Full Text|Google Scholar Workman, R. L., Burkert, V. D., Crede, V., Klempt, E., Thoma, U., Tiator, L., et al. (2022).Review of particle physics(PTEP 2022). doi:10.1093/ptep/ptac097 CrossRef Full Text|Google Scholar Yanagida, T. (2018). Inorganic scintillating materials and scintillation detectors.Proc. Jpn. Acad. Ser.B94, 75–97. doi:10.2183/pjab.94.007 PubMed Abstract|CrossRef Full Text|Google Scholar Yang, K., Menge, P. R., Buzniak, J. J., and Ouspenski, V. (2012). Performance improvement of large Sr2+and Ba2+co-doped LaBr3:Ce scintillation crystals.NSS/MIC Symp. Anheim, U. S. A. doi:10.1109/NSSMIC.2012.6551133 CrossRef Full Text|Google Scholar Yeom, J., Yamamoto, S., Derenzo, S. E., Spanoudaki, V. C., Kamada, K., Endo, T., et al. (2013). First performance results of Ce:GAGG scintillation crystals with silicon photomultipliers.IEEE Trans. Nucl. Sci.60, 988–992. doi:10.1109/tns.2012.2233497 CrossRef Full Text|Google Scholar Zambelli, N., Zanettini, S., Benassi, G., Bettati, A., and Zappettini, A. (2020). CdZnTe-Based X-ray spectrometer for absolute density determination.IEEE Trans. Nucl. Sci.67, 2273–2277. doi:10.1109/tns.2020.2996272 CrossRef Full Text|Google Scholar Zemach, A. (1956). Proton structure and the hyperfine shift in hydrogen.Phys. Rev.104, 1771–1781. doi:10.1103/physrev.104.1771 CrossRef Full Text|Google Scholar Zentai, G. (2008). “X-ray imaging for homeland security,” inIeee int. Workshop on imaging systems and techniques.Chania,Greece, 1–6. Google Scholar Keywords:gamma rays, muonic X-rays, SiPM, PMT, crystals, LaBr 3:Ce Citation:Bonesini M (2025) Gamma-ray and high-energy X-ray detection with large-area scintillating crystals: A hands-on review.Front. Detect. Sci. Technol.3:1551948. doi: 10.3389/fdest.2025.1551948 Received:26 December 2024;Accepted:31 March 2025;Published:02 May 2025. Edited by: Reviewed by: Copyright© 2025 Bonesini. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Maurizio Bonesini,bWF1cml6aW8uYm9uZXNpbmlAbWliLmluZm4uaXQ= Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Detectors based on scintillating inorganic crystals 3 Performances of scintilating crystal-based detectors 4 Examples of crystal-based gamma-ray detection systems 5 Conclusion Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher’s note Footnotes References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}