{"id": 108, "name": "1010 WINS AM", "domain": "audacy.com/1010wins", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.audacy.com/1010wins/news/national/things-to-know-about-the-retrial-of-karen-read-in-the-killing-of-her-police-officer-boyfriend", "title": "Things To Know About The Retrial Of Karen Read In The Killing Of Her Police Officer Boyfriend", "content": "All Music Stations All News & Talk Stations All Sports Stations Stations by City All Stations Fox News CBS News NBC News All Music Stations Music News Pop Alternative Latino Country Rock Classic Rock Hip-Hop and R&B LIVE Performances All News Stations Latino News NBC News Fox News CBS News All Sports Stations Sports News NFL MLB NBA NHL NCAA Football Sports Betting Baseball Isn’t Boring Reception Perception Kickoff with Boomer Listen Live Watch Live BetMGM The Daily Tip BetQL Daily BetMGM Tonight The Sunshine Place Gone South Fly on the Wall We Can Do Hard Things Impolitic with John Heile Otherworld The Moth Office Ladies Gets Interesting History That Doesn’t Suck High Strange Search Engine Start Here Jill on Money Baseball Isn’t Boring Tony Kornheiser Show Fantasy Football Today Fantasy Baseball Today Cash The Ticket You Better You Bet Go Birds Battleground America On Deadline About Audacy Get the Audacy App More Ways to Listen FAQ Find Us on X Contact Customer Support Sign up for Email Follow Us on Social #ImListening 1Thing Contests Contest Rules All Music Stations All News & Talk Stations All Sports Stations Stations by City All Stations Fox News CBS News NBC News All Music Stations Music News Pop Alternative Latino Country Rock Classic Rock Hip-Hop and R&B LIVE Performances All News Stations Latino News NBC News Fox News CBS News All Sports Stations Sports News NFL MLB NBA NHL NCAA Football Sports Betting Baseball Isn’t Boring Reception Perception Kickoff with Boomer Listen Live Watch Live BetMGM The Daily Tip BetQL Daily BetMGM Tonight The Sunshine Place Gone South Fly on the Wall We Can Do Hard Things Impolitic with John Heile Otherworld The Moth Office Ladies Gets Interesting History That Doesn’t Suck High Strange Search Engine Start Here Jill on Money Baseball Isn’t Boring Tony Kornheiser Show Fantasy Football Today Fantasy Baseball Today Cash The Ticket You Better You Bet Go Birds Battleground America On Deadline About Audacy Get the Audacy App More Ways to Listen FAQ Find Us on X Contact Customer Support Sign up for Email Follow Us on Social #ImListening 1Thing Contests Contest Rules Local NewsNew York CityLong IslandNew JerseyWestchester CountyNew York StateConnecticutWINS NoticiasTribeca Festival New York City Long Island New Jersey Westchester County New York State Connecticut WINS Noticias Tribeca Festival New York City Long Island New Jersey Westchester County New York State Connecticut WINS Noticias Tribeca Festival More NewsNationalPoliticsBusinessEntertainmentSportsHealthWorldCoronavirusPets National Politics Business Entertainment Sports Health World Coronavirus Pets National Politics Business Entertainment Sports Health World Coronavirus Pets Weather & TrafficWeatherTraffic1010 WINS Traffic on Twitter Weather Traffic 1010 WINS Traffic on Twitter Weather Traffic 1010 WINS Traffic on Twitter ShowsComplete ScheduleWINS Morning DriveMidday NewsWINS Afternoon DriveNightsOvernightsWeekend News Complete Schedule WINS Morning Drive Midday News WINS Afternoon Drive Nights Overnights Weekend News Complete Schedule WINS Morning Drive Midday News WINS Afternoon Drive Nights Overnights Weekend News Podcasts1010 WINS All LocalWINSAM: On-DemandYour HealthIt's OK To Say Gay1010 WINS 9/11 Archive1010 WINS ExtrasSounds from Seaver WayVideoCity VewsOn the Marc22 minutesLIVEBeyond Black History MonthYour Weirdest Fears 1010 WINS All Local WINSAM: On-Demand Your Health It's OK To Say Gay 1010 WINS 9/11 Archive 1010 WINS Extras Sounds from Seaver Way Video City Vews On the Marc 22 minutes LIVE Beyond Black History Month Your Weirdest Fears 1010 WINS All Local WINSAM: On-Demand Your Health It's OK To Say Gay 1010 WINS 9/11 Archive 1010 WINS Extras Sounds from Seaver Way Video City Vews On the Marc 22 minutes LIVE Beyond Black History Month Your Weirdest Fears CONNECTNews StaffSubscribe to NewslettersFacebookFind us on XInstagramYoutubeContestsContest RulesEventsI'm Listening1Thing News Staff Subscribe to Newsletters Facebook Find us on X Instagram Youtube Contests Contest Rules Events I'm Listening 1Thing News Staff Subscribe to Newsletters Facebook Find us on X Instagram Youtube Contests Contest Rules Events I'm Listening 1Thing on-airWINS Afternoon Drive9:00 PM-10:00 PM **on-air** **WINS Afternoon Drive** **on-air** **WINS Afternoon Drive** audio from 1010 WINSLivePodcasts **audio from 1010 WINS** Live Podcasts **audio from 1010 WINS** Live Podcasts Ask your smart speaker to playten ten wins **ten ten wins** **ten ten wins** Local NewsNew York CityLong IslandNew JerseyWestchester CountyNew York StateConnecticutWINS NoticiasTribeca Festival New York City Long Island New Jersey Westchester County New York State Connecticut WINS Noticias Tribeca Festival New York City Long Island New Jersey Westchester County New York State Connecticut WINS Noticias Tribeca Festival More NewsNationalPoliticsBusinessEntertainmentSportsHealthWorldCoronavirusPets National Politics Business Entertainment Sports Health World Coronavirus Pets National Politics Business Entertainment Sports Health World Coronavirus Pets Weather & TrafficWeatherTraffic1010 WINS Traffic on Twitter Weather Traffic 1010 WINS Traffic on Twitter Weather Traffic 1010 WINS Traffic on Twitter ShowsComplete ScheduleWINS Morning DriveMidday NewsWINS Afternoon DriveNightsOvernightsWeekend News Complete Schedule WINS Morning Drive Midday News WINS Afternoon Drive Nights Overnights Weekend News Complete Schedule WINS Morning Drive Midday News WINS Afternoon Drive Nights Overnights Weekend News Podcasts1010 WINS All LocalWINSAM: On-DemandYour HealthIt's OK To Say Gay1010 WINS 9/11 Archive1010 WINS ExtrasSounds from Seaver WayVideoCity VewsOn the Marc22 minutesLIVEBeyond Black History MonthYour Weirdest Fears 1010 WINS All Local WINSAM: On-Demand Your Health It's OK To Say Gay 1010 WINS 9/11 Archive 1010 WINS Extras Sounds from Seaver Way Video City Vews On the Marc 22 minutes LIVE Beyond Black History Month Your Weirdest Fears 1010 WINS All Local WINSAM: On-Demand Your Health It's OK To Say Gay 1010 WINS 9/11 Archive 1010 WINS Extras Sounds from Seaver Way Video City Vews On the Marc 22 minutes LIVE Beyond Black History Month Your Weirdest Fears CONNECTNews StaffSubscribe to NewslettersFacebookFind us on XInstagramYoutubeContestsContest RulesEventsI'm Listening1Thing News Staff Subscribe to Newsletters Facebook Find us on X Instagram Youtube Contests Contest Rules Events I'm Listening 1Thing News Staff Subscribe to Newsletters Facebook Find us on X Instagram Youtube Contests Contest Rules Events I'm Listening 1Thing **Things to know about the retrial of Karen Read in the killing of her police officer boyfriend** Karen Read will not take the witness stand in the second trial about the death of her Boston police officer boyfriend, as the defense rested on Wednesday. Read, 45, is accused of striking John O’Keefe with her car outside a suburban house party and leaving him to die in the snow in January 2022. She has been charged with second-degreemurder, manslaughter and leaving the scene. Read's lawyers say O’Keefe, 46, was beaten, bitten by a dog, then left outside a home in Canton in a conspiracy orchestrated by the police that included planting evidence against Read. Read's second trial has so far followedsimilar contoursto the first, which ended in a mistrial last year. The judge, who also oversaw the first trial, said closing statements could arrive on Friday. The defense rested on the 31st day of the second trial. **Read will not testify at second trial** Read did not testify at her first murder trial and will not testify at this one, either. Read told reporters on Tuesday that the defense has called its final witness and that the jury has already heard from her in the form of interview clips. The case could be headed toward closing statements as soon as this week. “They've heard my voice,” Read told reporters outside court. “They've heard a lot of me.” The case will go to the jury after closing statements. Read's announcement came a day before the defense rested its case. **Crash expert says damage to the SUV and clothing are inconsistent with a collision** Daniel Wolfe, who works for the accident reconstruction firm ARCCA, testified Monday about the numerous tests he and others conducted of a dummy colliding with a replica of Read’s SUV taillight at various speeds. Wolfe, who testified for the prosecution at Read’s first trial but this time is being paid to speak in her defense, also described a test in which an SUV backed into a crash test dummy’s arm suspended in the air and a full-body dummy wearing clothing that matched O’Keefe’s outfit on the night he died. A prosecution expert testified that O’Keefe’s injuries were consistent with having been struck by a vehicle. But Wolfe said the damage to Read’s taillight and O’Keefe’s clothing was inconsistent with striking an arm or a body. Wolfe acknowledged that the dummy arm he used for some of the tests weighed more than 2 pounds (0.9 kilogram) less than O’Keefe’s arm likely weighed, based on his height and weight. He denied that it made a difference in his conclusions and noted that the actual weight of O’Keefe’s arm was not known. Andrew Rentschler, a biomechanical engineer and accident reconstructionist from ARCCA, also testified on Tuesday and Wednesday. He also found O'Keefe's injuries were inconsistent with a vehicle strike. Rentschler was the defense's final witness. **Former medical examiner says O'Keefe died of trauma, not hypothermia** The medical examiner's report says O’Keefe died from hypothermia and blunt impact injuries to the head. But on Tuesday, an expert witness for the defense called that autopsy into question. Elizabeth Laposata, a forensic pathologist, said O'Keefe died from blunt force trauma alone. “The body did not have any hypothermia,” Laposata said. The medical examiner who performed O'Keefe's autopsy, Irini Scordi-Bello, testified earlier that she could not determine the cause of O'Keefe's death to a reasonable degree of medical certainty but that hypothermia was a contributing factor. Laposata also said she didn’t think eye injuries suffered by O'Keefe were consistent with being hit by the rear of Read’s SUV. She said there was no evidence of impact from a vehicle at all. The judge barred Laposata from testifying about potential dog bite wounds, but allowed her to say that some of O'Keefe's injuries were consistent with an animal bite. She said they were “very much” consistent with bite or claw marks, and appeared to be inflicted before death. AP News **Featured Local Savings** **Featured Local Savings** **LATEST** EPA moves to repeal rules that limit greenhouse gas emissions from US power plants Peanuts or almonds? Rice or millet? Planet-friendly grocery shopping choices go beyond cutting meat National Guard troops have temporarily detained civilians in LA protests, commander says Is the Trump-Musk spat really over? Judging from Wall Street trading, it's a fragile peace Pulse massacre survivors are set to revisit the nightclub before it's razed Listen to 1010 WINS Contact Us Join the Listener Community EEO Public Inspection File Contest Rules FCC Applications Advertise with Us **listen** Listen Live Mobile App **connect** FAQ 1Thing Get My PERKS #ImListening Contact Us Submit a Podcast Sitemap Advertise with Us Audacy Corporate Site **legal** Careers Privacy Policy Terms of Use Copyright Notice Music Submission Policy Do Not Sell or Share My Personal Info Public File Help"}