{"id": 2241, "name": "The Shovel", "domain": "theshovel.com.au", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://theshovel.com.au/2025/06/04/minimum-wage-hike-could-lift-people-out-of-poverty-business-groups-warn/", "title": "Minimum Wage Hike Could Lift People Out Of Poverty Business Groups Warn", "content": "NewsAustraliaWorldSport & EntertainmentBusinessLocal Australia World Sport & Entertainment Business Local Australia World Sport & Entertainment Business Local Live Shows Wankernomics Become a Supporter Shop Support Us Newsletter Search for: **Minimum Wage Hike Could Lift People out of Poverty, Business Groups Warn** The Fair Work Commission’s decision to increase the minimum wage from $24.10 per hour to $24.94 an hour could have the unintended consequence of providing workers with the necessary money to buy food and water, business leaders have cautioned. Noting that the 3.5% increase was ‘well above’ the current CPI rate, business industry spokesperson Jeremy Fadden said the ruling meant workers would essentially be getting free money. “All this is doing is providing millions of Australians with excess money to buy luxuries like groceries and rent, or three litres of petrol”. He said the new wage rate was unworkable and has called for it to be scrapped. “How can corporations be expected to run their businesses if they are forced to pay their workers enough to live off? It’s not sustainable”. Fadden said a more cautious approach was required. “We’d all love to get paid more – I mean, I haven’t had a pay rise since 2021, and that was only a 4% raise, or $26,000 a year. We all need to make sacrifices and think about the impact this will have on the economy”. Like this?Support The Shovel. And follow us onEmail|Facebook|Twitter|Instagram **Recent News** **“Violent, Insurrectionist Mobs Are Attacking Federal Agents!” Says Man Who Called for Violent, Insurrectionist Mobs To Attack Federal Agents** **Australia To Send Troops To Support America’s Invasion Of America** **Disappearing, Reappearing Tasmanian Parliament Revealed To Be Elaborate Dark Mofo Exhibition** **Scott Morrison Receives King’s Birthday Honours for Services to Hairdressing, Truck Driving, Welding, Cooking, Cricket, Building and Not Shooting Women** **Women Too Emotional To Hold Positions of Power, Says MAGA Voter** About Shop Newsletter Contribute We’re Hiring Support Us Live Shows Wankernomics Australia World Entertainment Business Local **Subscribe to The Shovel!** Email me the latest articles © Copyright The Shovel, 2025. All rights reserved|Privacy Policy|Website by KHAN **Want the latest articles emailed to you?** Join thousands of other subscribers who get their news from The Shovel. Newsletter signupEmailPlease wait...Go!Thank you for subscribing to the newsletter! **Newsletter signup** Thank you for subscribing to the newsletter! **Newsletter signup** Thank you for subscribing to the newsletter! News▼AustraliaWorldSport & EntertainmentBusinessLocal Australia World Sport & Entertainment Business Local Australia World Sport & Entertainment Business Local Live Shows Wankernomics Become a Supporter Shop Support Us Newsletter"}