{"id": 2166, "name": "U.S. Right to Know", "domain": "usrtk.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://usrtk.org/factory-farming/new-tool-measure-industrial-animal-farming-pollution/new-tool-measure-industrial-animal-farming-pollution/", "title": "New Tool Measure Industrial Animal Farming Pollution", "content": "**U.S. Right to Know** AboutOverviewOur StaffOur Board Overview Our Staff Our Board Overview Our Staff Our Board Donate AboutOverviewOur StaffOur Board Overview Our Staff Our Board Overview Our Staff Our Board Donate Academic Work Bees Covid-19 Origins Factory Farming Healthwire Pesticides Ultra-Processed Foods All TopicsAcademic WorkBeesBill GatesCDCChemicals of ConcernCoca-ColaCorporate Influence at UniversitiesCosmeticsCovid-19 OriginsEndocrine DisruptorsEPAFactory FarmingFDAUltra-Processed FoodsFOIAFood-Related DiseasesGMOsHealthwireIndustry PRMarketing to ChildrenMonsanto/BayerMonsanto Roundup & Dicamba Trial TrackerNews ReleasesNIHPesticidesRisky ResearchSweetenersUltra-Processed Foods Academic Work Bees Bill Gates CDC Chemicals of Concern Coca-Cola Corporate Influence at Universities Cosmetics Covid-19 Origins Endocrine Disruptors EPA Factory Farming FDA Ultra-Processed Foods FOIA Food-Related Diseases GMOs Healthwire Industry PR Marketing to Children Monsanto/Bayer Monsanto Roundup & Dicamba Trial Tracker News Releases NIH Pesticides Risky Research Sweeteners Ultra-Processed Foods Academic Work Bees Bill Gates CDC Chemicals of Concern Coca-Cola Corporate Influence at Universities Cosmetics Covid-19 Origins Endocrine Disruptors EPA Factory Farming FDA Ultra-Processed Foods FOIA Food-Related Diseases GMOs Healthwire Industry PR Marketing to Children Monsanto/Bayer Monsanto Roundup & Dicamba Trial Tracker News Releases NIH Pesticides Risky Research Sweeteners Ultra-Processed Foods **Breathing injustice: How a new scientific tool could help communities oppose industrial animal farming pollution** Plumes of manure particles and other toxic gases waft from industrial animal farms over to nearby communities. The haze of pollution coats the inside and outside of residents’ homes with potentially harmful bacteria, and when inhaled can lead to respiratory problems. Air pollution from industrial animal operations isn’t controlled by the federal government and weak local oversight has left many communities to fend for themselves. Some are now working with researchers to develop tools and gather evidence that will help them advocate for justice and compensation. In one such community in North Carolina, residents have collaborated with researchers at Johns Hopkins University in Baltimore, Maryland to test a technique that can identify and measure the amount of pig manure in dust that settled in and around residents’ homes. The tool will help communities and researchers trace the pollution back to nearby factory farms, the researchers say. Residents of the community in Duplin county, a hotspot for the state’s hog production and bad air quality, say that local authorities have previously dismissed or overlooked their concerns and complaints about the pollution. But having tools and data to reliably show the source of the pollution will help them make their case more effectively, says Devon Hall Sr., executive director of a community group Rural Empowerment Association for Community Help (REACH) in North Carolina, which collaborated on the research. Hall lives within 3 miles of 30 factory farms. He says the community knows that pig manure is in the air because they can smell it and taste it. The odor can be “so horrific that it immediately makes you want to gag,” he says. The Duplin county community also worries for the health of their families, says Hall. Particles of swine manure contain dangerous pathogens, including antimicrobial-resistant bacteria, and other zoonotic viruses and parasites, say scientists. Research shows that communities who live close to factory farms, who aredisproportionately low-incomepeople of color, have increasedrisks ofasthma,lung disorders, andmooddisordersincluding anxiety and depression. But the state legislature has repeatedlyshielded the hog industryfrom regulationand common law nuisanceto the detriment of communities, says Blakely Hildebrand, senior attorney at the Southern Environmental Law Center. Senator Brent Jackson, who represents Duplin county and several other hog production hotspot counties, did not answer requests for comment. Lawmakers don’t understand what it is like to live in Duplin county, Hall says. “When we’re telling the powers that be how bad it is sometimes, that our eyes are watering, our nose is running, and we’re coughing, sometimes we hear, ‘oh, it can’t be that bad’”. **A tool to trace pollution** Determined to make their voices heard, the community has co-designed research with a team of scientists led by Chris Heaney, an epidemiologist at Johns Hopkins University’s Center for a Livable Future to develop a tool that will help them prove their claims against the farms. The project is testing and refining the tool that identifies a segment of bacterial DNA only found in the gut of swine. The tool can identify the pig-specific genetic sequence, called Pig-2-Bac, from fecal bacteria in dust that has settled in and around locals’ homes, enabling them to show that pollution from pig operations has reached their residences. Chris Heaney and Devon Hall Sr., courtesy of Chris Heaney The project is described in a study that is submitted to the journalScience of the Total Environmentfor peer review. In the study, the researchers ran DNA tests to analyze over 1,400 samples collected by residents from nearly 300 households. Residents swabbed dust on top of their air conditioning units, roof, front porch, vents, refrigerators, and TV remotes. They sealed the swabs inside tubes containing a liquid solvent – similar to those used as home testing kits for the virus that causes COVID-19 – and sent them to the laboratory at Johns Hopkins University for analysis. The analysis found that the pig-specific DNA sequence was widespread inside and outside the homes of people who work in and live next to industrial pig farms. They found only one positive sample from an urban area located far from the farms. The researchers also calculated that homes in areas close to more and bigger pig farms were contaminated with more fecal waste. This further demonstrates that the pig-specific genetic marker found in people’s homes is linked to the swine farms, the research says. “This work provides evidence that is consistent with neighbors’ testimony that industrial swine production and land application practices inundate their homes with swine fecal wastes,” wrote the study’s authors in an email. The team is now working to strengthen the tool even further. Air pollution from pig farms carries a mix of contaminants – in addition to bacteria, it also contains particulate matter and hazardous gases such as ammonia and hydrogen sulfide. Heaney and his team are matching the Pig-2-Bac data taken from residents’ homes with minute-by-minute data on levels of these other air pollutants. The data are recorded by palm-sized sensors located in the residents’ property. They say the technique can be easily adapted for use in other farmed animals such as cows and chickens. **Providing evidence for lawsuits** Alexis Andiman, a senior attorney at the environmental law firm Earthjustice, says communities who are exposed to pollution from industrial animal facilities need access to data, such as that provided by the Pig-2-Bac tool, to be able to protect their health. Local air pollution data will become increasingly important as the Environmental Protection Agency finalizes new federal rules under the Clean Air Act, a bedrock environmental law that factory farms have been shielded from. The new rules aim to control air pollution from animal agriculture, including hydrogen sulfide, ammonia and particulate matter. For the past 20 years, the EPA has been developing models to enable it to estimate emissions from industrial animal farms. During this period, the EPA gave factory farms a free pass to pollute without limits or penalties. If not for the free pass, neighbors of industrial hog operations that have been plagued for decades by hog waste pollution could use this powerful legal tool to hold the industry accountable, says Hildebrand. Many researchers and activists say the models are long overdue – the EPA initially said they would becompleted in 2009. The EPA published a draft of the models in November 2024 and is now collecting public comments on the draft. When the models are finalized, industrial farms will be required to operate with a permit and comply with clean air laws. If farms fail to comply with the law, communities will be able to use pollutant data to help bring lawsuits against those operations. And tools like Pig-2-Bac could help make the case that the pollution is coming from animal operations, as opposed to other sources like chemical plants. And now that Heaney and Hall’s teams have tested and refined the Pig-2-Bac tool it could stand-up even better under scrutiny in court. Dan Snyder, an attorney at the public-interest law firm Public Justice who has worked with factory farm water pollution cases, says data collected by citizens is often attacked by defendants’ lawyers for not being credible. But if plaintiffs can demonstrate that the data are collected using valid methods then it is admissible, he says. The tool is already proving useful in bringing justice to communities. Duplin county residents used Pig-2-Bac in a landmark nuisance lawsuit against Smithfield, the largest pork producer in the world. The community complained that waste from a nearby Smithfield operation was contaminating their homes and damaging their health and quality of life. The tool helped the plaintiffs demonstrate that the air and their homes were covered in pig waste and link it to the Smithfield operation. Expert witness Shane Rogers from Clarkson University in New York argued that pig manure was likely also inside the residents’ homes where they eat and sleep – a claim the new Pig-2-Bac study results support. In 2018, residents won the case and were initially awarded $50 million in damages and compensation which was later reduced to $2.5 million following a change in state law. The Pig-2-Bac tool has also helped researchers argue that toxins from industrial farms in Duplin county travelled into public waterways, far off-site from operations that were not allowed to discharge pollutants. Researchers first developed the Pig-2-Bac tool to track pollution in local wells and rivers. **Pushing for Change** But as communities living in the shadow of industrial animal farms make headway, states have strengthened their “right-to farm” laws, which shield the agriculture industry from regulation. Since 2018, North Carolina and Iowa – two states with the most hogs in the country – have made it nearly impossible for residents to file nuisance lawsuits against industrial farms. Andat least seven morehave made it more difficult by changing criteria for filing suits or decreasing the amount of damages plaintiffs can recover. And now, some activists and lawyers are worried the progress will backslide under the Trump administration. Emily Miller, attorney at the environmental nonprofit Food and Water Watch, says that the new Trump EPA immediately moved todelaythe agency’s work to finalize the air emissions models.Recent mass layoffs and promise of huge budget cutsat the EPAcould further delay or even stop the process, Miller says. This would leave industrial animal farms free to continue releasing hazardous pollution. The new administration is also rolling-back environmental justice initiatives, includingfreezing community-run projectsthat monitored local air pollution. The EPA funds over one hundred community air monitoring programs, including ones relating to factory farms. One grant to CleanAIRE North Carolina, a local nonprofit, installed 30 real-time air monitors in Sampson County households to help identify and track particulate matter pollution from nearby pig farms. Although the project is still funded, there are constant concerns about funding and unexpected changes with personnel, says Daisha Wall, Community Science Program Manager at CleanAIRE NC. Wall says the monitors provide crucial information about how families in the rural community, who are largely low-income earners and people of color, are disproportionately exposed to air pollution from the surrounding pig farms. The nearest federal air monitor is unhelpfully 74 miles away, says Wall. The Trump Administration has alsodeleted from federal websitesnationwide air pollution data and data screening tools, making it difficult for community projects to demonstrate how they are affected compared to other areas, says Wall. “More than ever right now we need the federal government to prioritize data transparency and accessibility,” she says. “Communities have fought way too hard for transparency to lose ground now.” Hall says he won’t be deterred from collecting data and pushing for change because he and his community can’t get away from the pollution smothering their neighborhood. Helping to develop and refine new tools like Pig-2-Bac will arm communities with reliable evidence when the time comes to fight, he says. “If I tell you my story and you don’t believe it, well at some point you believe the science,” Hall says. Disclosure: USRTK is represented by EarthJustice in a case seeking public records in Maryland on a topic unrelated to this article. **Get our newsletter| Weekly updates in your inbox** Academic Work Bees Covid-19 Origins Factory Farming Healthwire Pesticides Ultra-Processed Foods All TopicsAcademic WorkBeesBill GatesCDCChemicals of ConcernCoca-ColaCorporate Influence at UniversitiesCosmeticsCovid-19 OriginsEndocrine DisruptorsEPAFactory FarmingFDAUltra-Processed FoodsFOIAFood-Related DiseasesGMOsHealthwireIndustry PRMarketing to ChildrenMonsanto/BayerMonsanto Roundup & Dicamba Trial TrackerNews ReleasesNIHPesticidesRisky ResearchSweetenersUltra-Processed Foods Academic Work Bees Bill Gates CDC Chemicals of Concern Coca-Cola Corporate Influence at Universities Cosmetics Covid-19 Origins Endocrine Disruptors EPA Factory Farming FDA Ultra-Processed Foods FOIA Food-Related Diseases GMOs Healthwire Industry PR Marketing to Children Monsanto/Bayer Monsanto Roundup & Dicamba Trial Tracker News Releases NIH Pesticides Risky Research Sweeteners Ultra-Processed Foods Academic Work Bees Bill Gates CDC Chemicals of Concern Coca-Cola Corporate Influence at Universities Cosmetics Covid-19 Origins Endocrine Disruptors EPA Factory Farming FDA Ultra-Processed Foods FOIA Food-Related Diseases GMOs Healthwire Industry PR Marketing to Children Monsanto/Bayer Monsanto Roundup & Dicamba Trial Tracker News Releases NIH Pesticides Risky Research Sweeteners Ultra-Processed Foods Donate Subscribe Contact Twitter Facebook RSS About U.S. Right to Know Creative Commons License News Releases **It's Your Right to Know** Sign up for our newsletter to get our latest stories delivered straight to your inbox."}