{"id": 1929, "name": "Conservative Opinion", "domain": "conservativeopinion.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://conservativeopinion.com/the-blithe-ignorance-of-alexandria-ocasio-cortez-shows-why-socialism-appeals-to-millennials/", "title": "The Blithe Ignorance Of Alexandria Ocasio Cortez Shows Why Socialism Appeals To Millennials", "content": "OpinionTrumpCultureEconomicsCourtsImmigrationForeign PolicyAbortionReligionArchive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Satire Login/Register Submissions Contact About Privacy Policy OpinionTrumpCultureEconomicsCourtsImmigrationForeign PolicyAbortionReligionArchive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Satire Login/Register Submissions Contact About Privacy Policy OpinionTrumpCultureEconomicsCourtsImmigrationForeign PolicyAbortionReligionArchive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Trump Culture Economics Courts Immigration Foreign Policy Abortion Religion Archive Satire Login/Register Submissions Contact About Privacy Policy **The Blithe Ignorance of Alexandria Ocasio-Cortez Shows Why Socialism Appeals to Millennials** It sounds like the plot of some brain-dead Hollywood comedy that has already been made too many times: Movie executive: OK, here’s an idea. You know those geniuses who Jay Leno used to interview on the street who couldn’t answer basic questions like who the vice president is, or what Columbus Day celebrates? Well, what if someone like that ran for Congress and actually won? How funny would that be! Producer: Great! We’ll get Amy Schumer or Lena Dunham to play the lead! Executive: No, I said it’s supposed to be funny. Yes, you’ve seen some version of this before. It was basically “The Distinguished Gentleman,” and “Legally Blonde 2,” and now it’s been rebooted for the millennial generation in the form of “Ms. Ocasio-Cortez Goes to Washington (If She Can Find It).” But this version is less funny than the originals (which says a lot) because it’s actually happening. Alexandria Ocasio-Cortez is a twenty-eight-year old community organizer… or something (actually, it’s unclear even from her own website what exactly she does for a living, thoughshe was a bartender less than a year ago)… and of the almost 700,000 people in New York’s 14thcongressional district, about 15,000 of them decided for everyone else that she is the most qualified person to represent them in Congress. And though that was just a primary election, there is no doubt she will win November’s general election, because she’s a Democrat and 110% of the voters in her district are also Democrats. (I added the extra 10% to account for fraudulent voters and dead people, though that’s probably a conservative estimate). All that remains is her coronation. That has already begun, as she tours the country with her mentor, money maven Bernie Sanders, much to the delight of Republicans, who could not be happier with her sudden ascendancy to the apex of the Democratic Party. It is not hard to see why. She has already proven herself to be totally clueless on major issues. For example, when asked to explain why unemployment is low, she complained “because everyone has two jobs. Unemployment is low because people are working 60, 70, 80 hours a week and can barely feed their family.” Forget for a moment that she is lamenting that unemployment is low, and forget also that she is just wrong on the facts: many have already pointed out thatAmericans working multiple jobs are outnumbered by Americans working one job by about 148 million to 7 million,and, no, Americans are not working more than they have in the past. Fine. What is more worrisome is her inability to draw a logical connection between the question and her answer. Even if all workers did have two jobs, that could never explain low unemployment, because if anything, that would decrease the amount of jobs available to everyone else, and thereby raise, not lower, unemployment. It’s one thing to be wrong on the facts, but it’s quite something else to still be wrong even if your facts are assumed right. This just demonstrates defective thinking. The liberals over at Slate.comreferred to her statement as a “gaffe,”but no, a “gaffe” is when you misspeak —like when she said Democrats are going to “flip a Republican seat red”— not when you are totally uninformed and can’t logically process a thought. Her economic illiteracy does not stop there. She demands that all student loans be forgiven, saying that “[f]or the cost of the GOP’s tax bill, we could forgive ALL the student loan debt in the United States,” But pointing to the “cost” of a tax cut, as though it is a government appropriation, demonstrates her incognizance of the economic benefits — such as job creation – that come with people keeping more money of their own to invest. She also claims “capitalism has not always existed in the world, and it will not always exist in the world.” Actually, it pretty much has always existed as long as people have exchanged things: goods for goods, services for services, services for goods. Any sort of productive economic activity is necessarily capitalist. And what do you mean it won’t always exist? Well, let us not jump to ridiculous conclusions. She is obviously not proposing a post-economic world where we return to subsistence farming, hunting and gathering, and forced labor (though socialism has a strong track record of producing exactly that). She just does not know what capitalism is or what she’s talking about. Okay, so economics is not her strength. Actually, it is! One of her two majors atBoston University was economics, and she allegedly graduated fourth in her class. But she’s a millennial, so it’s not surprising that she received good grades and a diploma for apparently learning nothing, other than that life is unfair. And here’s the problem: Sure, lots of people don’t know what they’re talking about when it comes to economics, even (especially) congressmen. But like so many other millennials, Ocasio-Cortez does not let ignorance of a subject get in the way of her certainty. Worse, she’s happy not to understand, because understanding would challenge her assumptions. She doesn’t want to understand costs, because then she can’t campaign by promising everything that enters her stream of consciousness: Medicare for all, free college tuition for everyone, forgiveness of all outstanding student loans, a federal jobs guarantee that includes full healthcare (why is that needed, if everyone gets Medicare?),cancellation of Puerto Rico’s Wall Street debt owed to “vulture funds”(otherwise known as “investors” who were stupid enough to loan money to Puerto Rico so that it actually had some),and an energy policy that will “eliminateallfossil fuels by 2035”by handing out free solar panels, eliminatingallgasoline cars, and convertingallpower plants to… I don’t know. Nuclear power? All of them? Who cares? The “how” does not matter. And it’s not just economic costs to which she is blithely ignorant. She seems not to care about social costs, either. Of course she demands that ICE be abolished for doing its job, because that’s this month’s new thing, and we must end mass incarceration which, in her precious mind, is the cause of, rather than the result of, our urban criminal subculture that terrorizes city streets, parks, and schools. So let everyone into the country, and keep criminals mixed in with the public. What could go wrong? Perhaps to demonstrate her authenticity as a leftist, as though that was in doubt, she also gratuitously complains that Israelis “occupy” Palestine, even though the Israelis are themselves Palestinians (yes, they are). But when asked to clarify that remark she admitted “Um..Yeah… I mean, I think … I’d … also just— I am not the expert on geo-politics on this issue.“ OK, buther other major at Boston University was in international relations, so… In sum, New York is about to send to Congress a totally unqualified dilettante who has no notable work experience, much less experience as an elected official. Who graduated at the top of her class with a degree in economics, despite not understanding the first thing about economics. Who proposes costly things despite not having any idea how they will be paid for, or even acknowledging that they must be paid for. Who demands that law enforcement not enforce laws, and cannot fathom how this could cause any problems. And, who has no compunction about opining, with moral certainty, on complex foreign policy issues relating to countries she almost certainly could not locate on a map, even though she specialized in international relations in college, which was only a few semesters ago. Get used to it, because while Republicans are celebrating her elevation as the new face of the Democrats, she is, in all respects,the quintessential millennial, often wrong but never in doubt, and there will be more after her. This is problematic because no group of people, and it’s a large group, are more convinced of their assumptions than millennials, precisely because so many don’t know anything, and therefore facts don’t ever inconvenience their self-perceived wisdom. So naturally they’re socialists, and leftists in general, because that’s easy; it doesn’t require knowledge, just an understanding that all of the world’s problems are caused by some combination of the Big Three Isms: racism, sexism, and capitalism.Congratulations, now you’re an intellectual. And the fact that so many millennials leave college — for which they paid a lot and at which they did not learn a lot — only to find that the job market does not reward their self-esteem, simply reaffirms their conviction that the world is unfair and/or rigged, as is an economic system that rewards value, and both must therefore be modified by an increasingly authoritarian government. Great. Conservatism, on the other hand, is not so easily accessible, because it requires a certain core competency. Capitalism needs to be understood. History needs to be learned. Reality needs to be experienced, and more than that, acknowledged, even when it presents uncomfortable truths. Everything has a cost, even well-intentioned ideas. The road to Hell is paved with good intentions. Unfortunately, the rest of us are at the mercy of increasingly uninformed voters, who elect equally uninformed politicians, who wish to speed us all down that road, because at least then we’ll all arrive at the same place together. And who better to put at the wheel than a millennial socialist who, like so many other millennials unable to find work in their given field, will now be employed by the government. Tags alexandria ocasio-cortez leftist millennial socialist **Georges Lemaitre: The Priest Who Discovered the Big Bang** **What Ayn Rand Got Wrong—and Capra Got Right—About Capitalism** **A Gift Too Far: The Ethical Failure of Trump’s Qatari Jet** Hack StoneJuly 22, 2018 At 8:45 amI guess that New York is trying to outperform Georgia in who can send the most incompetent person to Washington to represent them. Hank Johnson may just have to pass the crown in the next year. I guess that New York is trying to outperform Georgia in who can send the most incompetent person to Washington to represent them. Hank Johnson may just have to pass the crown in the next year. I guess that New York is trying to outperform Georgia in who can send the most incompetent person to Washington to represent them. Hank Johnson may just have to pass the crown in the next year. lijJuly 24, 2018 At 3:14 pmWow, this author dissed college and millennials- “One of her two majors at Boston University was economics, and she allegedly graduated fourth in her class. But she’s a millennial, so it’s not surprising that she received good grades and a diploma for apparently learning nothing, other than that life is unfair.” not to mention talking “blithely” about things he doesn’t know about…… like how people don’t even bother to find work any more, because there are no jobs at all.. and ones that have jobs, like solar, has been gutted because of Trump’s policy to put tarrifs on Chinese solar panels. This author goes on and on about how capitalism has been with us for centuries, but doesn’t get into what it has done to human beings………. and as such the morphed capitalism that we have today is for the wealthy at the expense of everyone else. At first it was the poor, the black , who’s backs were used in the Capitalistic society, now, it’s pretty much everyone who isn’t a billionaire. Because the billionaires now own all of us. By the money and power they have bought through the government. The government and the corporate capitalists are now one. And PS, we are a one party system in Washington, we are NOT a democracy anymore. Wow, this author dissed college and millennials- “One of her two majors at Boston University was economics, and she allegedly graduated fourth in her class. But she’s a millennial, so it’s not surprising that she received good grades and a diploma for apparently learning nothing, other than that life is unfair.” not to mention talking “blithely” about things he doesn’t know about…… like how people don’t even bother to find work any more, because there are no jobs at all.. and ones that have jobs, like solar, has been gutted because of Trump’s policy to put tarrifs on Chinese solar panels. This author goes on and on about how capitalism has been with us for centuries, but doesn’t get into what it has done to human beings………. and as such the morphed capitalism that we have today is for the wealthy at the expense of everyone else. At first it was the poor, the black , who’s backs were used in the Capitalistic society, now, it’s pretty much everyone who isn’t a billionaire. Because the billionaires now own all of us. By the money and power they have bought through the government. The government and the corporate capitalists are now one. And PS, we are a one party system in Washington, we are NOT a democracy anymore. Wow, this author dissed college and millennials- “One of her two majors at Boston University was economics, and she allegedly graduated fourth in her class. But she’s a millennial, so it’s not surprising that she received good grades and a diploma for apparently learning nothing, other than that life is unfair.” not to mention talking “blithely” about things he doesn’t know about…… like how people don’t even bother to find work any more, because there are no jobs at all.. and ones that have jobs, like solar, has been gutted because of Trump’s policy to put tarrifs on Chinese solar panels. This author goes on and on about how capitalism has been with us for centuries, but doesn’t get into what it has done to human beings………. and as such the morphed capitalism that we have today is for the wealthy at the expense of everyone else. At first it was the poor, the black , who’s backs were used in the Capitalistic society, now, it’s pretty much everyone who isn’t a billionaire. Because the billionaires now own all of us. By the money and power they have bought through the government. The government and the corporate capitalists are now one. And PS, we are a one party system in Washington, we are NOT a democracy anymore. JimNovember 21, 2018 At 1:15 pmWell, you get what you vote for! Miss Cortez is ignorant of almost everything except pulling her hair back to look a little better. What a waste oftaxpayer money.God help us! Well, you get what you vote for! Miss Cortez is ignorant of almost everything except pulling her hair back to look a little better. What a waste oftaxpayer money.God help us! Well, you get what you vote for! Miss Cortez is ignorant of almost everything except pulling her hair back to look a little better. What a waste oftaxpayer money.God help us! **LEAVE A REPLY** Log in to leave a comment **Subscribe to our newsletter** To be updated with all the latest news, offers and special announcements. **Georges Lemaitre: The Priest Who Discovered the Big Bang** **What Ayn Rand Got Wrong—and Capra Got Right—About Capitalism** **A Gift Too Far: The Ethical Failure of Trump’s Qatari Jet** **The Myth of Settled Law: Birthright Citizenship and the Collapse of Sovereignty** **Both Parties are Wrong About the Department of Education** **Illegal Immigration Caused This Domestic Violence Nightmare** **It’s About Time Someone Acknowledged the Border Crisis as a National Emergency!** **America Must Not Recede. Europe Must Ascend.** **Let Ukraine Win!** **If Killing Bin Laden Was Wrong, I Don’t Want To be Right** **Bin Laden’s Death Was A Happy Letdown** **Roberts is Wrong: Why Bad Judges Must Be Removed** **Democrats’ Tariff Hypocrisy: Trump’s Policies Aren’t New, Just Newly Criticized** **The Myth of Settled Law: Birthright Citizenship and the Collapse of Sovereignty** Opinion120 Culture25 Archive25 Trump24 Economics20 Foreign Policy18 Republican party14 Courts14 **ABOUT US** Contact us:conservativeopinion.com@gmail.com **FOLLOW US** © Newspaper WordPress Theme by TagDiv Opinion Satire Login/Register Submissions Contact About Privacy Policy"}