{"id": 1658, "name": "ZME Science", "domain": "zmescience.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.zmescience.com/feature-post/natural-sciences/biology-reference/plants-fungi/how-dandelions-break-through-concrete-with-nothing-but-willpower-and-physics/", "title": "How Dandelions Break Through Concrete With Nothing But Willpower And Physics", "content": "Home→Features→Natural Sciences→Biology→Plants and Fungi **How Dandelions Break Through Concrete With Nothing but Willpower (and Physics)** Whether you think of it as a weed or a bit of nature in the city, a dandelion has impressive survival skills. You’ve probably seen a lot. A lone dandelion (or two) popping cheerfully out of the tough pavement. How do these crazy dandelions manage to poke through the concrete? How does something so fragile crack something so strong? Dandelions don’t just survive on lawns. They can grow from sidewalks, parking lots, and plenty of other places they’re not supposed to. Their secret is a mix of clever biological power and hydrostatic pressure. **Cracks in the (urban) armor** The dandelions do all the magic. But let’s start with the concrete for now. Concrete is designed to be strong and perfect — but it’s not perfect forever. It expands and contracts with heat. It absorbs water. And over time, it cracks. Asphalt wears out even faster. Sun and rain break down its surface, and traffic adds stress. It often gets patched instead of replaced, leaving weak points. These imperfections are exactly what plants like dandelions need. In reality, most sidewalks and roads have numerous imperfections that dandelions can take advantage of. This is where the dandelions start to work, starting with the seeds. Dandelion seeds are a bit like a parachute. They spin and drift and can travel long distances. When they ultimately land, their shape helps them lodge into tight spaces. That tight space can be a tiny crevice between sidewalk slabs or a hairline crack in older asphalt. It’s not just a fortunate coincidence. The dandelion’s seed points downward like a dart, with fine spines that help it grip. Wind can blow many seeds away, but some stay. And those are the ones that matter. **RelatedPosts** Dandelions also producea lotof seeds — up to 20,000 from a single plant. The seeds don’t need much soil. And once established, they’re hard to kill. Add in their rapid growth and deep roots, and they become the perfect urban colonizer. A dandelion can go from seed to flower in just a few weeks. **The underground push** Once inside a crack, the seed waits. It needs a bit of moisture and maybe a little dust or soil. That’s all it takes. Within days, it sprouts a root. The dandelion’s root grows with force — slowly, steadily pushing downward. It’s called a taproot. Many plants, including root vegetables like carrots, beets, and radishes, have tap roots. Trees like oaks, elms, pines, and firs also do. The taproot acts like a wedge. It searches for water and space, and in doing so, it presses outward on the crack itself. They’re also incredibly tough. Dandelions can handle heat, drought, and being stepped on. Their leaves hug the ground at first, helping them avoid being mowed. And if you break off the top, they just regrow from the root. This toughness, combined with smart seed design, makes dandelions nearly unstoppable in cities. To get even deeper and see how dandelions (and other plants) can break through tough materials, we need to zoom in and look at liquids and pressure. **Turgor pressure** The root’s cells absorb water, and the pressure builds. Scientists call itturgor pressure. It’s a type of hydrostatic pressure, meaning it’s caused by water pushing outward from within. It’s a basic force that plants use to stay upright and to grow. When the root grows, it’s a bit like inflating thousands of tiny balloons, each one pressing against the crack’s walls. This might sound gentle, but it isn’t. That pressure can be up to 0.6 MPa, which is over three times that of a car tire. Now picture thousands of these balloons packed together in the tip of the root, all swelling in unison. That collective force becomes powerful. It presses outward in all directions — but because the root is constrained by surrounding pavement or soil, it pushes into the path of least resistance, often right into microscopic cracks. If the pavement has even a slight weakness, the growing root can make it worse. Over time, this pressure causes the root to slowly wedge its way in, growing longer and wider. It’s not fast — but it’s persistent. And when the plant’s internal pressure exceeds the resistance of the crack, the pavement gives way, little by little. This subtle force is what lets a dandelion — notoriously “fragile” — actually push through solid materials that seem far stronger. Its growth powered by water and amplified by design. **It’s not just dandelions** Dandelions are the most common example, but they’re not the only ones. Grasses likePoa annua, plantain, and even moss can work their way into cracks. Japanese knotweed, one of the world’s most destructiveinvasive plants, can grow through concrete up to three inches thick. Some fungi can push paving slabs up several inches in just days. Trees, of course, do it too — but over years. Their roots are stronger, but the basic idea is the same. Find a crack, grow into it, and force it wider. Even tiny plants can do major damage over time, and roots can spread way beyond the crown of the tree. Plants blooming from concrete are a powerful message. The symbolism is fantastic, with life thriving even in areas built against it. But these plants do a lot of damage. For urbanists, dandelions are often considered weeds for exactly this reason, because they trigger and accentuate pavement damage. That’s why cities and contractors often spray herbicides on sidewalks and road edges. But not everyone sees dandelions as a problem. Some ecologists argue that plants like dandelions provide benefits. They feedpollinators on the brink, especially in early spring. They add greenery to otherwise barren spaces. And they make cities a little wilder — something many people now value. “Dandelions are an abundant source of nectar and pollen for bees flying around an environment in which the diversity of food options continues to shrink. These plants grow in very little soil, flower from early spring to just before winter and offer sustenance for bees all year round,” writes Philip Donkersley Senior Research Associate in Entomology at Lancaster University, in an article for The Conversation. In places like London and Paris, public campaigns have sprung up to protect pavement plants. Signs next to dandelions say things like “I’m not a weed — I’m a wildflower.” You can think of dandelions as a weed or as an important urban plant, but at the end of the day, they show remarkable strength and adaptability. They remind us that our cities, no matter how modern, are still part of nature. And nature has a way of slipping back in. **Mihai Andrei** Dr. Andrei Mihai is a geophysicist and founder of ZME Science. He has a Ph.D. in geophysics and archaeology and has completed courses from prestigious universities (with programs ranging from climate and astronomy to chemistry and geology). He is passionate about making research more accessible to everyone and communicating news and features to a broad audience. **RelatedPosts** **Sinking Giant Concrete Orbs to the Bottom of the Ocean Could Store Massive Amounts of Renewable Energy** **Finally, green concrete? New mixture sequesters CO2 while producing strong, durable concrete** **Making cement and bricks out of the gemstone olivine could cut CO2 emissions by 11 percent** **Rechargeable concrete batteries could make buildings double as energy storage** **Recent news** **Spanish Galleon Sank With $17-Billion Worth of Treasure In Today’s Money. Now Confirmed As the World’s Richest Shipwreck** **The oceans are so acidic they’re dissolving the shells of marine creatures** **Scientists Made a Battery Powered by Probiotics That’s Completely Biodegradable** About Advertise Editorial Policy Privacy Policy and Terms of Use How we review products Contact © 2007-2025 ZME Science - Not exactly rocket science. All Rights Reserved. Science News Environment Health Space Future FeaturesNatural SciencesPhysicsMatter and EnergyQuantum MechanicsThermodynamicsChemistryPeriodic TableApplied ChemistryMaterialsPhysical ChemistryBiologyAnatomyBiochemistryEcologyGeneticsMicrobiologyPlants and FungiGeology and PaleontologyPlanet EarthEarth DynamicsRocks and MineralsVolcanoesDinosaursFossilsAnimalsMammalsBirdsFishAmphibiansReptilesInvertebratesPetsConservationAnimal factsClimate and WeatherClimate changeWeather and atmosphereHealthDrugsDiseases and ConditionsHuman BodyMind and BrainFood and NutritionWellnessHistory and HumanitiesAnthropologyArchaeologyHistoryEconomicsPeopleSociologySpace & AstronomyThe Solar SystemSunThe MoonPlanetsAsteroids, meteors & cometsAstronomyAstrophysicsCosmologyExoplanets & Alien LifeSpaceflight and ExplorationTechnologyComputer Science & ITEngineeringInventionsSustainabilityRenewable EnergyGreen LivingCultureResources Natural Sciences PhysicsMatter and EnergyQuantum MechanicsThermodynamics Matter and Energy Quantum Mechanics Thermodynamics ChemistryPeriodic TableApplied ChemistryMaterialsPhysical Chemistry Periodic Table Applied Chemistry Materials Physical Chemistry BiologyAnatomyBiochemistryEcologyGeneticsMicrobiologyPlants and Fungi Anatomy Biochemistry Ecology Genetics Microbiology Plants and Fungi Geology and PaleontologyPlanet EarthEarth DynamicsRocks and MineralsVolcanoesDinosaursFossils Planet Earth Earth Dynamics Rocks and Minerals Volcanoes Dinosaurs Fossils AnimalsMammalsBirdsFishAmphibiansReptilesInvertebratesPetsConservationAnimal facts Mammals Birds Fish Amphibians Reptiles Invertebrates Pets Conservation Animal facts Climate and WeatherClimate changeWeather and atmosphere Climate change Weather and atmosphere HealthDrugsDiseases and ConditionsHuman BodyMind and BrainFood and NutritionWellness Drugs Diseases and Conditions Human Body Mind and Brain Food and Nutrition Wellness History and HumanitiesAnthropologyArchaeologyHistoryEconomicsPeopleSociology Anthropology Archaeology History Economics People Sociology Space & AstronomyThe Solar SystemSunThe MoonPlanetsAsteroids, meteors & cometsAstronomyAstrophysicsCosmologyExoplanets & Alien LifeSpaceflight and Exploration The Solar System Sun The Moon Planets Asteroids, meteors & comets Astronomy Astrophysics Cosmology Exoplanets & Alien Life Spaceflight and Exploration TechnologyComputer Science & ITEngineeringInventionsSustainabilityRenewable EnergyGreen Living Computer Science & IT Engineering Inventions Sustainability Renewable Energy Green Living Culture Resources Natural Sciences PhysicsMatter and EnergyQuantum MechanicsThermodynamics Matter and Energy Quantum Mechanics Thermodynamics Matter and Energy Quantum Mechanics Thermodynamics ChemistryPeriodic TableApplied ChemistryMaterialsPhysical Chemistry Periodic Table Applied Chemistry Materials Physical Chemistry Periodic Table Applied Chemistry Materials Physical Chemistry BiologyAnatomyBiochemistryEcologyGeneticsMicrobiologyPlants and Fungi Anatomy Biochemistry Ecology Genetics Microbiology Plants and Fungi Anatomy Biochemistry Ecology Genetics Microbiology Plants and Fungi Geology and PaleontologyPlanet EarthEarth DynamicsRocks and MineralsVolcanoesDinosaursFossils Planet Earth Earth Dynamics Rocks and Minerals Volcanoes Dinosaurs Fossils Planet Earth Earth Dynamics Rocks and Minerals Volcanoes Dinosaurs Fossils AnimalsMammalsBirdsFishAmphibiansReptilesInvertebratesPetsConservationAnimal facts Mammals Birds Fish Amphibians Reptiles Invertebrates Pets Conservation Animal facts Mammals Birds Fish Amphibians Reptiles Invertebrates Pets Conservation Animal facts Climate and WeatherClimate changeWeather and atmosphere Climate change Weather and atmosphere Climate change Weather and atmosphere HealthDrugsDiseases and ConditionsHuman BodyMind and BrainFood and NutritionWellness Drugs Diseases and Conditions Human Body Mind and Brain Food and Nutrition Wellness Drugs Diseases and Conditions Human Body Mind and Brain Food and Nutrition Wellness History and HumanitiesAnthropologyArchaeologyHistoryEconomicsPeopleSociology Anthropology Archaeology History Economics People Sociology Anthropology Archaeology History Economics People Sociology Space & AstronomyThe Solar SystemSunThe MoonPlanetsAsteroids, meteors & cometsAstronomyAstrophysicsCosmologyExoplanets & Alien LifeSpaceflight and Exploration The Solar System Sun The Moon Planets Asteroids, meteors & comets Astronomy Astrophysics Cosmology Exoplanets & Alien Life Spaceflight and Exploration The Solar System Sun The Moon Planets Asteroids, meteors & comets Astronomy Astrophysics Cosmology Exoplanets & Alien Life Spaceflight and Exploration TechnologyComputer Science & ITEngineeringInventionsSustainabilityRenewable EnergyGreen Living Computer Science & IT Engineering Inventions Sustainability Renewable Energy Green Living Computer Science & IT Engineering Inventions Sustainability Renewable Energy Green Living Culture Resources Videos Reviews About UsAboutThe TeamAdvertiseContributeEditorial policyPrivacy PolicyContact About The Team Advertise Contribute Editorial policy Privacy Policy Contact About The Team Advertise Contribute Editorial policy Privacy Policy Contact © 2007-2025 ZME Science - Not exactly rocket science. All Rights Reserved."}