{"id": 372, "name": "The Dominion Post", "domain": "dominionpost.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dominionpost.com/2025/06/09/trinity-christians-josalyn-phillips-named-class-a-first-team-all-state-after-leading-warriors-back-to-state-tournament/", "title": "Trinity Christians Josalyn Phillips Named Class A First Team All State After Leading Warriors Back To State Tournament", "content": "**Follow us** facebook x instagram linkedin Sign In Subscribe Gift Subscriptions SubmitSubmit AnnouncementSubmit a Classified AdSubmit Breaking News TipSubmit News ArticleSubmit Sports ArticleCoverage Request Submit Announcement Submit a Classified Ad Submit Breaking News Tip Submit News Article Submit Sports Article Coverage Request Submit Announcement Submit a Classified Ad Submit Breaking News Tip Submit News Article Submit Sports Article Coverage Request Marketing Services Sunday Comics Sign In Subscribe Gift Subscriptions SubmitSubmit AnnouncementSubmit a Classified AdSubmit Breaking News TipSubmit News ArticleSubmit Sports ArticleCoverage Request Submit Announcement Submit a Classified Ad Submit Breaking News Tip Submit News Article Submit Sports Article Coverage Request Submit Announcement Submit a Classified Ad Submit Breaking News Tip Submit News Article Submit Sports Article Coverage Request Marketing Services Sunday Comics Home NewsLatest NewsBusinessCommunityCops and CourtsEducationReligionWVU NewsGovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover CouncilEntertainmentLife & LeisureContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Latest NewsBusinessCommunityCops and CourtsEducationReligionWVU News Business Community Cops and Courts Education Religion WVU News GovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council EntertainmentLife & Leisure Life & Leisure ContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das Latest NewsBusinessCommunityCops and CourtsEducationReligionWVU News Business Community Cops and Courts Education Religion WVU News Business Community Cops and Courts Education Religion WVU News GovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council EntertainmentLife & Leisure Life & Leisure Life & Leisure ContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das SportsLocal SportsWVU SportsOutdoors Local Sports WVU Sports Outdoors Local Sports WVU Sports Outdoors OpinionEditorialsDaily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy KerchevalLetters to the EditorLettersGuest EssaysGuest Editorials Editorials Daily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Letters to the EditorLettersGuest Essays Letters Guest Essays Guest Editorials Editorials Daily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Letters to the EditorLettersGuest Essays Letters Guest Essays Letters Guest Essays Guest Editorials Classifieds Obituaries E-Edition Marketing ContactContactFrequently Asked QuestionsNewspapers In EducationAbout the Dominion Post Contact Frequently Asked Questions Newspapers In Education About the Dominion Post Contact Frequently Asked Questions Newspapers In Education About the Dominion Post Sign In Subscribe Home NewsLatest NewsBusinessCommunityCops and CourtsEducationReligionWVU NewsGovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover CouncilEntertainmentLife & LeisureContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Latest NewsBusinessCommunityCops and CourtsEducationReligionWVU News Business Community Cops and Courts Education Religion WVU News GovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council EntertainmentLife & Leisure Life & Leisure ContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das Latest NewsBusinessCommunityCops and CourtsEducationReligionWVU News Business Community Cops and Courts Education Religion WVU News Business Community Cops and Courts Education Religion WVU News GovernmentWest Virginia LegislatureGranville CouncilKingwood CouncilMonongalia CountyMorgantown CouncilPreston CountyReedsville CouncilWestover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council West Virginia Legislature Granville Council Kingwood Council Monongalia County Morgantown Council Preston County Reedsville Council Westover Council EntertainmentLife & Leisure Life & Leisure Life & Leisure ContributorsAldona BirdDr. Trembush and Dr. StoutHealthy LivingIrene MarinelliJoe SmithJohn SamsellJustin JacksonKeenan CummingsKerri KostenLeague of Women VotersMaryWade TriplettSean ManningVaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das Aldona Bird Dr. Trembush and Dr. Stout Healthy Living Irene Marinelli Joe Smith John Samsell Justin Jackson Keenan Cummings Kerri Kosten League of Women Voters MaryWade Triplett Sean Manning Vaageesha Das SportsLocal SportsWVU SportsOutdoors Local Sports WVU Sports Outdoors Local Sports WVU Sports Outdoors OpinionEditorialsDaily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy KerchevalLetters to the EditorLettersGuest EssaysGuest Editorials Editorials Daily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Letters to the EditorLettersGuest Essays Letters Guest Essays Guest Editorials Editorials Daily ColumnistsCal ThomasLeonard Pitts Jr.Froma HarropSalena ZitoHoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Cal Thomas Leonard Pitts Jr. Froma Harrop Salena Zito Hoppy Kercheval Letters to the EditorLettersGuest Essays Letters Guest Essays Letters Guest Essays Guest Editorials Classifieds Obituaries E-Edition Marketing ContactContactFrequently Asked QuestionsNewspapers In EducationAbout the Dominion Post Contact Frequently Asked Questions Newspapers In Education About the Dominion Post Contact Frequently Asked Questions Newspapers In Education About the Dominion Post Sign In Subscribe **Trinity Christian’s Josalyn Phillips named Class A first team all-state after leading Warriors back to state tournament** CHARLESTON – Pendleton County’s Baylee Beachler saw her 2024 campaign come to an end after tearing a tendon in her shoulder at the end of that regular season. The injury kept her from throwing until December but when she returned this year there was no indication of a setback in the circle, where she went 19-1 with a 158 strikeouts and a 1.13 ERA, or at the plate where she batted .558 with 12 home runs and 65 RBI. Her standout campaign helped Pendleton capture the Class A state championship and now Class A first team all-state captain honors, as selected by the West Virginia Sports Writers Association. Beachler isn’t alone, joined by fellow Wildcat Avery Townsend who batted .563 with 10 home runs and 50 RBI. “Those two kids, if there ever is an A and an A-plus, it’s those two kids,” Pendleton head coach Eric Crites said. “The only advantage is Baylee pitches too. They’ve been the 1-2 in my lineup all year long and they work so well together. They’re such great kids that don’t let their athletic abilities get beyond what they need to do as team leaders. I think that’s what sets them apart from everybody else. They understand they’ve got to make their other teammates better and they work very hard during practice and during games. “If they see someone making a mistake they’ll show them how to correct it and that was always a pleasure. They were like a second group of coaches on the field for us.” Beachler and Townsend aren’t the only teammates to grace the first team list. State runner-up Wahama placed four on the first team in pitcher Elissa Hoffman, infielder Kalyn Christian, outfielder Audrey Reynolds and utility player Fionna VanMatre. Reynolds batted .551 with four home runs and 38 RBI while Christian added a .505 batting average and .961 fielding percentage. Hoffman led the White Falcons in the circle with an 18-4 record following sectional play. Last but not least to least, VanMatre blasted five home runs with a .460 batting average. Greenbrier West placed three on the first team in pitcher-utility player Brilee Redden, outfielder Maddie Fields and infielder Preslee Treadway. Redden, West’s ace, led the team in batting average (.526), hits (51) and home runs (10) while sporting a 9-9 record with a 2.25 ERA. Fields batted .436 with 35 RBI and four home runs for the Cavaliers while Treadway finished with a .393 batting average and 31 RBI. The final set of teammates to earn first-team honors hail from Mingo County in Tug Valley’s Bailee Hall and Emma Lackey. Hall blasted 14 home runs to go along with a .540 batting average, driving in 38 runs for the Panthers. She also went 13-6 in the circle. Lackey, a freshman, split the pitching duties with a 2.24 ERA and team-best 154 strikeouts. At the plate she batted .400 and drove in 39 runs. Securing the catcher spots are Sherman’s Lexi Lowe and Trinity’s Josalyn Phillips. Lowe batted .505 with 46 hits for the Tide who pushed Wahama in the regional series. Phillips helped Trinity earn a state tournament berth with a .427 batting average and eight home runs. Rounding out the infield are Gilmer County’s Layla Smith and Magnolia’s Jessa Anderson. Smith blasted nine home runs and drove in 47 total runs while Anderson batted .515 with 34 hits. Madonna’s Maddie Owens grabbed the final outfield spot on first team with a .585 batting average to go with 11 home runs and 51 RBI. Wirt County catcher Kylee Ross earned second team captain honors. She was joined by pitchers Mallory McDiffitt (Magnolia), Phoebe Dudgeon (Mount View), Peyton Conley (Madonna), catcher Chloe Orrechio (Madonna) and infielders Katie Hall (Tug Valley), Kalyn Salmons (Tolsia), Paige Montgomery (Gilmer County), Savannah Drake (Sherman) and Lizzie Alt (Pendleton County). Rounding out the second team outfield are Peyton Moore (Trinity) and Summer Harvey (Sherman). The utility players are Jenna Smith (Pendleton County), Susan Vincell (Pendleton), Peyton Hicks (Tucker County) and Emma Russell (Sherman). Wooden plaques in the shape of West Virginia that include the player’s name, school, licensed WVSWA logo, year of the honoree are available to all-state first team, second team and honorable mentions and can be purchased at from the Bear Wood Company throughWVSWA.comorBearwoodcompany.com. First Team P – Bailee Hall, Tug Valley (Jr.) P – Baylee Beachler, Pendleton County (Sr.) (CAPTAIN) P – Elissa Hoffman, Wahama (Sr.) C – Lexi Lowe, Sherman (Soph.) C – Josalyn Phillips, Trinity Christian (Soph.) IF – Avery Townsend, Pendleton County (Sr.) IF – Kalyn Christian, Wahama (Sr.) IF – Layla Smith, Gilmer County (Sr.) IF – Jessa Anderson, Magnolia (Jr.) IF – Preslee Treadway, Greenbrier West (Sr.) OF – Audrey Reynolds, Wahama (Soph.) OF – Maddie Owens, Madonna (Soph.) OF – Maddie Fields, Greenbreir West (Sr.) U – Brilee Redden, Greenbrier West (Jr.) U – Emma Lackey, Tug Valley (Fr.) U – Fiona Vanmatre, Wahama (Jr.) Second Team P – Mallory McDiffitt, Magnolia (Sr.) P – Phoebe Dudgeon, Mount View (Jr.) P – Peyton Conley, Madonna (Fr.) C – Kylee Ross, Wirt County (Sr.) (CAPTAIN) C – Chloe Orrechio, Madonna (Sr.) IF – Katie Hall, Tug Valley (Fr.) IF – Kalyn Salmons, Tolsia (Fr.) IF – Paige Montgomery, Gilmer County (Jr.) IF – Savannah Drake, Sherman (Jr.) IF – Lizzie Alt, Pendleton County (Sr.) OF – Peyton Moore, Trinity Christian (Soph.) OF – Summer Harvey, Sherman (Jr.) U – Jenna Smith Pendleton County (Sr.) U – Susan Vincell, Pendleton County (Soph.) U – Peyton Hicks, Tucker county (Soph.) U – Emma Russell, Sherman (Jr.) Honorable Mentions Aubrey Thomas, Cameron; Calli Brown, Van; Ava Shaffer, Tucker County; Shana Cabell, Van; Taylor White, Montcalm; Kayleigh Rose, Mount View; Hailey Tackett, Van; Emily Smith, Tygarts Valley, Addison Armentrout, East Hardy, Meri Hickman, Gilmer County; Kenley Hartshorn, Gilmer County; Kailyn Williams, Richwood; Brandi Mullins, River View;Brooklyn Adkins, Greenbrier West; Paisley Bolyard, Tug Valley;Paige Hopkins, Trinity Christian Story by Tyler Jackson (playsheetsports.com) MORGANTOWN WEATHER **WVU Medicine Video** We love hearing from you! Check out what we’re asking for. **Dominion Post** Home News Sports Opinion Classifieds Obituaries E-Edition Marketing Contact Sign In Subscribe"}