{"id": 1931, "name": "CounterFire", "domain": "counterfire.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.counterfire.org/article/palantirs-involvement-in-the-nhs-shows-the-interconnectedness-of-genocide-and-welfare-cuts/", "title": "Palantirs Involvement In The Nhs Shows The Interconnectedness Of Genocide And Welfare Cuts", "content": "Articles Events Who we are Shop Join **Palantir’s involvement in the NHS shows the interconnectedness of genocide and welfare cuts** **Palantir’s entry into the UK’s NHS is very worrying as the company has a terrifying track record and deep ties with the ongoing genocide in Gaza, argues Steven McWilliam** In November of 2023, theNHS entered into a £330m contractwith US-based software company Palantir. The stated aim of the partnership was to build a new data-access platform that could connect the disparate data stores and systems. This is a good idea on the surface, but some major concerns ought to be raised about Palantir as a company and the ethical decision-making of politicians who think that the NHS should work with such a technology firm. Palantir is essentially a data-science company that enables its clients to make decisions based on insights gathered from big data sources. They operate by building up a vast bank of all possible information on a subject and using a combination of data scientists and artificial intelligence systems to induce insights that would otherwise be hard to determine from simple deduction. This sort of company offering is often referred to as ‘business intelligence’. Despite the apparent reasonableness, Palantir has always had more questionable objectives Palantir was founded in 2003, at the height of the Iraq war, with its original goal being to provide military-strategic insights to help occupying forces counter the insurgency that was at that time inflicting casualties on American troops. Its first financial backer wasIn-Q-Tel, the CIA’s venture-capital arm, but it didn’t take long to capture the attention of other government agencies with clients today including the Department of Defense, Department of Homeland Security and – most infamously – the department of immigration who have used the technology toassist in performing immigration raids. In addition to the strong ties with the US government, Palantir’s founder, Peter Thiel, has been a lifelong vocal advocate for the state of Israel, for which he has enthusiastically supplied technology. Since the beginning of the present genocide in Gaza and Israel’s offensives against the West Bank, Lebanon and Syria, the IDF [Israeli Defence Force] has made extensive use of ‘Lavender’, a Palantir-provided AI technology for generating kill lists of potential Hamas targets. When answering a question on the role that his company has played in these actions,Thiel made the comment, ‘I believe that broadly the IDF gets to decide what it wants to do, and that they’re broadly in the right.’ There are obvious legal implications in willingly assisting a genocide, but Thiel’s glibness is made even more shocking by the acknowledgement by the IDF that ‘Lavender’ has a10% false positive rate, causing the Israelis to attack civilians regularly with the claim that ‘the machine said they were terrorists’. Chillingly, the technology has been used to give every person in Gaza a personal score that rates their likelihood of being a Hamas operative, which would be dystopian even if it actually worked, and has been directly responsible for an uncountable number of bombing strikes against civilian areas. Additionally Thiel has beenvery clear in the pastthat he believes the solution for higher standards of living is to cut funding for public health and the welfare state in order to fund scientific research. ‘I am not aware of a single political leader in the U.S., either Democrat or Republican, who would cut health-care spending in order to free up money for biotechnology research — or, more generally, who would make serious cuts to the welfare state in order to free up serious money for major engineering projects.’ Even to the most trusting person, this must seem like a very dangerous attitude that will promote further austerity and privatisation of the NHS and other healthcare institutions globally and given that Palantir was funded originally by the US government, he will fully expect a cut of any funding received. The NHS is one of the most sophisticated healthcare systems in the world, collecting a vast array of personal patient data. This data would be of very high value for any government or company that could get their hands on it, but any value that is extracted from it would be at the expense of the NHS’s users. Palantir claims there should be no concern for patients in letting them have control over NHS data. On the security front, they claim that it will be safe from malicious actors due to an extensive auditing system on their platforms and that logs of the actions will be presented for the proper authorities to audit. However, there is no value in audit logs if no one ever looks at them. This system is to be extended across Britain, as it already has in over 100 Acute NHS trusts and integrated care boards. The sheer volume of logs being generated has already become an overwhelming task for NHS administration, meaning that it is impossible to ensure user privacy is not being violated as a result of limited capacity. However, the real concern lies not in external hackers breaching the data but instead in the deliberate use of NHS data in other projects. Thiel knows that the quality and quantity of the data that he can obtain from NHS contracts could be worth billions of dollars if used for AI training processes. NHS data repositories will contain some of the most valuable, high-quality data in the world, far better than the public-domain junk on which so many AIs are usually trained. Powerful tech companies can and will monetise any data sets that they can access, and do not care whether or not consent was given to use the data for their commercial projects. There is a genuine threat to public safety in allowing a for-profit company that was funded by the CIA to have access to all this valuable information. Just trusting that this business run by a right-wing ideologue not to use it for their own gain is idiotic at best, criminal at worst. For a horribly likely example, it is feasible that they could implement a similar system for supporting deportations in Britain that they have already delivered for the US Immigration enforcement. It is completely possibly that NHS data could identify migrants and refugees to be targeted. Additionally, the platform could be used to steal people’s medical information to use against them for political coercion. On 13 March, Keir Starmer announced that the government would be cutting funding for various Quasi-Autonomous Non-Governmental Organisations, also known as quangos, the headline item on the chopping block being NHS England. During this speech,he mentionedhow the government was going to bring in ‘the best of the best on AI working across government’ and ‘send teams into every government Department’. As with so much to do with AI, the ‘innovations’ we are being asked to support come with job cuts, not as a bug but a feature. It is as foul using new technology to simply shed jobs in our NHS, as it is to do it in partnership with a company whose hands are dripping with blood from the Gaza genocide. This is before not letting it go unremarked that this research has an extreme environmental cost, as a result of the vast power and water demands of AI data centres. The movement should be opposed to the government’s love affair with these tech companies. The ongoing genocide in Gaza, Starmer’s austerity and the danger of a resurgent far right demonstrate the urgent need for socialist organisation and ideas. Counterfire has been central to the Palestine revolt and we are committed to building mass, united movements of resistance.Become a member todayand join the fightback. **Steven McWilliam** **Tagged under:** NHS United House,39-41 North Road,London,N7 9DP [email protected] Join Counterfire Support us Donate Privacy Policy Contact us"}