{"id": 469, "name": "KDFW - Fox 4 - Dallas-Fort Worth", "domain": "fox4news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox4news.com/news/fox-news-sunday-with-shannon-bream", "title": "Fox News Sunday With Shannon Bream", "content": "Live News Weather Good Day Sports Latest Episodes Vote More Local News Texas National World Election Politics Consumer Business Health FOX News Sunday Forecast Closings Allergies Almanac Rainfall Totals FOX Weather Dallas-Fort Worth Live Cameras Cowboys Rangers Mavericks Stars FC Dallas Wings Colleges High School Links from On Air Birthdays Recipes Traffic Entertainment Things To Do Save Me Steve Watch Live The Ten Last Call with Steve Noviello Texas: The Issue Is Trackdown Afterthought Who Cares!? 4th & 12 DZTV The Mom Game The Tex Factor Texas To-Do List Here's To You Here & Now Contact Us Anchors and Reporters Station History FAQ How to Stream Work for Us TV Listings FCC Public File FCC Applications KDFI / MORE 27 Brand Spotlight Houston News - FOX 26 Houston Austin News - FOX 7 Austin **FOX News Sunday with Shannon Bream: How and when to watch on FOX 4** Share Copy Link Email Facebook Twitter LinkedIn Reddit Watch FOX News Sunday with Shannon Bream on FOX 4 starting at 8 a.m. on Sundays. DALLAS-Shannon Bream has ushered in a new era of Sunday morning talk shows as she interviews the biggest newsmakers of the week on FOX News Sunday. You can catch all the action ofFOX News Sunday with Shannon Breamon FOX 4 from 8 a.m. to 9 a.m. on Sundays. Leading guests in providing context and analysis of the issues facing Americans, Bream’s weekly guest roster is among the most diverse in Sunday morning talk, featuring interviews with political, business and public affairs newsmakers from the U.S. and abroad. Before becoming the first woman to host FOX News Sunday in its nearly three-decade history, Bream served as anchor of FOX News @ Night for five years. In addition to her new role, she also continues to serve as the network’s chief legal correspondent. WatchFOX News Sunday with Shannon Breamon FOX 4 starting at 8 a.m. on Sundays. **** **Trending Now** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. Local News Texas National World Election Politics Consumer Business Health FOX News Sunday Forecast Closings Allergies Almanac Rainfall Totals FOX Weather Dallas-Fort Worth Live Cameras Cowboys Rangers Mavericks Stars FC Dallas Wings Colleges High School Links from On Air Birthdays Recipes Traffic Entertainment Things To Do Save Me Steve Watch Live The Ten Last Call with Steve Noviello Texas: The Issue Is Trackdown Afterthought Who Cares!? 4th & 12 DZTV The Mom Game The Tex Factor Texas To-Do List Here's To You Here & Now Contact Us Anchors and Reporters Station History FAQ How to Stream Work for Us TV Listings FCC Public File FCC Applications KDFI / MORE 27 Brand Spotlight Houston News - FOX 26 Houston Austin News - FOX 7 Austin facebook twitter instagram youtube email About Us New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File Closed Captioning Contests This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}