{"id": 1589, "name": "Wired Magazine", "domain": "wired.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wired.com/story/airlines-dont-want-you-to-know-they-sold-your-flight-data-to-dhs/#intcid=_wired-verso-hp-trending_1582aa24-b002-41fa-8283-ea3900344aeb_popular4-2", "title": "Airlines Dont Want You To Know They Sold Your Flight Data To Dhs", "content": "Security Politics The Big Story Business Science Culture Reviews Security Politics The Big Story Business Science Culture Reviews Newsletters Podcasts Video The Big Interview Magazine Merch Travel Steven Levy's Plaintext Column Events WIRED Insider WIRED Consulting Coupons **Airlines Don’t Want You to Know They Sold Your Flight Data to DHS** A data brokerowned by the country’s major airlines, including Delta, American Airlines, and United, collected US travelers’ domestic flight records, sold access to them to Customs and Border Protection (CBP), and then as part of the contract told CBP to not reveal where the data came from, according to internal CBP documents obtained by 404 Media. The data includes passenger names, their full flight itineraries, and financial details. This article was created in partnership with404Media, a journalist-owned publication covering how technology impacts humans. For more stories like this,sign up here. CBP, a part of the Department of Homeland Security (DHS), says it needs this data to support state and local police to track people of interest’s air travel across the country, in a purchase that has alarmed civil liberties experts. The documents reveal for the first time in detail why at least one part of DHS purchased such information, and comes after Immigration and Customs Enforcement (ICE)detailed its ownpurchase of the data. The documents also show for the first time that the data broker, called the Airlines Reporting Corporation (ARC), tells government agencies not to mention where it sourced the flight data from. “The big airlines—through a shady data broker that they own called ARC—are selling the government bulk access to Americans' sensitive information, revealing where they fly and the credit card they used,” senator Ron Wyden said in a statement. ARC is owned and operated by at least eight major US airlines, otherpublicly released documents show. The company’sboard of directorsinclude representatives from Delta, Southwest, United, American Airlines, Alaska Airlines, JetBlue, and European airlines Lufthansa and Air France, and Canada’s Air Canada. More than240 airlines depend on ARCfor ticket settlement services. ARC’s other lines of business include being the conduit between airlines and travel agencies,finding travel trendsin data with other firms like Expedia, and fraud prevention, according to material on ARC’s YouTube channel and website. The sale of US fliers’ travel information to the government is part of ARC’s Travel Intelligence Program (TIP). AStatement of Work included in the newly obtained documents, which describes why an agency is buying a particular tool or capability, says CBP needs access to ARC’s TIP product “to support federal, state, and local law enforcement agencies to identify persons of interest’s US domestic air travel ticketing information.” 404 Media obtained the documents through a Freedom of Information Act (FOIA) request. The new documents obtained by 404 Media also show ARC asking CBP to “not publicly identify vendor, or its employees, individually or collectively, as the source of the Reports unless the Customer is compelled to do so by a valid court order or subpoena and gives ARC immediate notice of same.” The Statement of Work says that TIP can show a person’s paid intent to travel and tickets purchased through travel agencies in the US and its territories. The data from the Travel Intelligence Program (TIP) will provide “visibility on a subject’s or person of interest’s domestic air travel ticketing information as well as tickets acquired through travel agencies in the U.S. and its territories,” the documents say. They add that this data will be “crucial” in both administrative and criminal cases. ADHS Privacy Impact Assessment (PIA) available onlinesays that TIP data is updated daily with the previous day’s ticket sales, and contains more than one billion records spanning 39 months of past and future travel. The document says TIP can be searched by name, credit card, or airline, but ARC contains data from ARC-accredited travel agencies, such as Expedia, and not flights booked directly with an airline. “If the passenger buys a ticket directly from the airline, then the search done by ICE will not show up in an ARC report,” that PIA says. The PIA notes that the data impacts both US and non-US persons, meaning it does include information on US citizens. WIRED has made this article free for all to read because it is primarily based on reporting from Freedom of Information Act requests.Please consider subscribing to support our journalism. “While obtaining domestic airline data—like many other transaction and purchase records—generally doesn't require a warrant, there's still supposed to go through a legal process that ensures independent oversight and limits data collection to records that will support an investigation,” Jake Laperruque, deputy director of the Center for Democracy & Technology's Security and Surveillance Project, told 404 Media in an email. “As with many other types of sensitive and revealing data, the government seems intent on using data brokers to buy their way around important guardrails and limits.” CBP’s contract with ARC started in June 2024 and may extend to 2029, according to the documents. The CBP contract 404 Media obtained documents for was an $11,025 transaction. Last Tuesday, a public procurement database added a $6,847.50 update to that contract, which said it was exercising “Option Year 1,” meaning it was extending the contract. The documents are redacted but briefly mention CBP’s OPR, or Office of Professional Responsibility, which inpart investigates corruption by CBP employees. “CBP is committed to protecting individuals’ privacy during the execution of its mission to protect the American people, safeguard our borders, and enhance the nation’s economic prosperity. CBP follows a robust privacy policy as we protect the homeland through the air, land and maritime environments against illegal entry, illicit activity or other threats to national sovereignty and economic security,” a CBP spokesperson said in a statement. CBP added that the data is only used when an OPR investigation is open, and the agency needs to locate someone related to that investigation. The agency says the data can act as a good starting point to identify a relevant flight record before then getting more information through legal processes. On May 1, ICE published details about its own ARC data purchase. In response, on May 2, 404 Media filed FOIA requests with ICE and a range of other agencies that 404 Media found had bought ARC’s services, including CBP, the Secret Service, SEC, DEA, the Air Force, US Marshals Service, TSA, and ATF. 404 Media found these by searching US procurement databases. Around a week later,The Lever covered the ICE contract. Airlines contacted by 404 Media declined to comment, didn’t respond, or deferred to either ARC or DHS instead. ARC declined to comment. The company previously told The Lever that TIP “was established after the Sept. 11 terrorist attacks to provide certain data to law enforcement … for the purpose of national security matters” and criminal investigations. “ARC has refused to answer oversight questions from Congress, so I have already contacted the major airlines that own ARC—like Delta, American Airlines, and United—to find out why they gave the green light to sell their customers' data to the government,” Wyden’s statement added. US law enforcement agencies have repeatedly turned to private companies to buy data rather than obtain it through legal processes such as search warrants or subpoenas. That includeslocation data harvested from smartphones,utility data, andinternet backbone data. “Overall it strikes me as yet another alarming example of how the ‘Big Data Surveillance Complex’ is becoming the digital-age version of the military-industrial complex,” Laperruque says, referring to the purchase of airline data. “It's clear the data broker loophole is pushing the government back towards a pernicious ‘collect it all’ mentality, gobbling up as much sensitive data as it can about all Americans by default. A decade ago the public rejected that approach, and Congress passed surveillance reform legislation that banned domestic bulk collection. Clearly it's time for Congress to step in again, and stop the data broker loophole from being used to circumvent that ban,” he added. According to ARC’s website, the company onlyintroduced multifactor authenticationon May 15. **You Might Also Like …** In your inbox:Upgrade your life withWIRED-tested gear In your inbox:Upgrade your life withWIRED-tested gear In your inbox:Upgrade your life withWIRED-tested gear Demis Hassabis embraces the future of work in the age of AI Demis Hassabis embraces the future of work in the age of AI Demis Hassabis embraces the future of work in the age of AI Big Story:Airbnb is in midlife crisis mode Big Story:Airbnb is in midlife crisis mode Big Story:Airbnb is in midlife crisis mode We talked to a fired DOGE staffer about who was really in charge We talked to a fired DOGE staffer about who was really in charge We talked to a fired DOGE staffer about who was really in charge Uncanny Valley:An insider look atthe influence of Silicon Valley Uncanny Valley:An insider look atthe influence of Silicon Valley Uncanny Valley:An insider look atthe influence of Silicon Valley More From WIRED Subscribe Newsletters FAQ WIRED Staff WIRED Education Editorial Standards Archive RSS Accessibility Help Reviews and Guides Reviews Buying Guides Mattresses Electric Bikes Soundbars Streaming Guides Wearables TVs Coupons Gift Guides Advertise Contact Us Manage Account Jobs Press Center Condé Nast Store User Agreement Privacy Policy Your California Privacy Rights ©2025Condé Nast. All rights reserved.WIREDmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices Italia Japón Czech Republic & Slovakia Facebook X Pinterest YouTube Instagram Tiktok"}