{"id": 1606, "name": "World Politics Review", "domain": "worldpoliticsreview.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.worldpoliticsreview.com/petro-colombia-eln-insurgency-conflict-farc-violence/", "title": "Petro Colombia Eln Insurgency Conflict Farc Violence", "content": "Sign Up Now About Get Help Log In Sign Up Now LatestBriefingsColumnsIn-DepthDaily Review Free ResourcesInsightsPodcasts BrowseRegionAfricaCentral AfricaEast AfricaSouthern AfricaWest AfricaThe AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral AmericaUnited StatesAsia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth AsiaEuropeCaucasusCentral & Eastern EuropeWestern EuropeRussiaGlobalPolar RegionsUnited NationsMiddle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkeyIssueDefense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMDEconomics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTradeDiplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman SecurityAuthorThe EditorsEmil AvdalianiJames BosworthCora Fernández AndersonAfolabi AdekaiyaojaWilder Alejandro SánchezAaron AllenEduardo ArcosSamba Dialimpa BadjiAbolghasem BayyenatRoland BenedikterTangi BihanBruno BinettiLaurence BlairView all authors RegionAfricaCentral AfricaEast AfricaSouthern AfricaWest AfricaThe AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral AmericaUnited StatesAsia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth AsiaEuropeCaucasusCentral & Eastern EuropeWestern EuropeRussiaGlobalPolar RegionsUnited NationsMiddle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkey AfricaCentral AfricaEast AfricaSouthern AfricaWest Africa Central Africa East Africa Southern Africa West Africa The AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral America Brazil Caribbean Mexico North America South America Central America United States Asia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth Asia Afghanistan Australia Central Asia China East Asia India Japan North Korea Southeast Asia South Asia EuropeCaucasusCentral & Eastern EuropeWestern EuropeRussia Caucasus Central & Eastern Europe Western Europe Russia GlobalPolar RegionsUnited Nations Polar Regions United Nations Middle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkey North Africa Gulf States Iran Iraq Syria Turkey IssueDefense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMDEconomics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTradeDiplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman Security Defense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMD Cyber Crime Insurgencies Intelligence Military Terrorism War & Conflict WMD Economics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTrade Energy Resources Infrastructure Nuclear Energy Technology Trade Diplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman Security Domestic Politics Environment Human Rights International Law Maritime Issues Radical Movements U.S. Foreign Policy Aid and Development Human Security AuthorThe EditorsEmil AvdalianiJames BosworthCora Fernández AndersonAfolabi AdekaiyaojaWilder Alejandro SánchezAaron AllenEduardo ArcosSamba Dialimpa BadjiAbolghasem BayyenatRoland BenedikterTangi BihanBruno BinettiLaurence BlairView all authors The Editors Emil Avdaliani James Bosworth Cora Fernández Anderson Afolabi Adekaiyaoja Wilder Alejandro Sánchez Aaron Allen Eduardo Arcos Samba Dialimpa Badji Abolghasem Bayyenat Roland Benedikter Tangi Bihan Bruno Binetti Laurence Blair View all authors RegionAfricaCentral AfricaEast AfricaSouthern AfricaWest AfricaThe AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral AmericaUnited StatesAsia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth AsiaEuropeCaucasusCentral & Eastern EuropeWestern EuropeRussiaGlobalPolar RegionsUnited NationsMiddle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkey AfricaCentral AfricaEast AfricaSouthern AfricaWest Africa Central Africa East Africa Southern Africa West Africa The AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral America Brazil Caribbean Mexico North America South America Central America United States Asia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth Asia Afghanistan Australia Central Asia China East Asia India Japan North Korea Southeast Asia South Asia EuropeCaucasusCentral & Eastern EuropeWestern EuropeRussia Caucasus Central & Eastern Europe Western Europe Russia GlobalPolar RegionsUnited Nations Polar Regions United Nations Middle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkey North Africa Gulf States Iran Iraq Syria Turkey AfricaCentral AfricaEast AfricaSouthern AfricaWest Africa Central Africa East Africa Southern Africa West Africa Central Africa East Africa Southern Africa West Africa The AmericasBrazilCaribbeanMexicoNorth AmericaSouth AmericaCentral America Brazil Caribbean Mexico North America South America Central America Brazil Caribbean Mexico North America South America Central America United States Asia-PacificAfghanistanAustraliaCentral AsiaChinaEast AsiaIndiaJapanNorth KoreaSoutheast AsiaSouth Asia Afghanistan Australia Central Asia China East Asia India Japan North Korea Southeast Asia South Asia Afghanistan Australia Central Asia China East Asia India Japan North Korea Southeast Asia South Asia EuropeCaucasusCentral & Eastern EuropeWestern EuropeRussia Caucasus Central & Eastern Europe Western Europe Russia Caucasus Central & Eastern Europe Western Europe Russia GlobalPolar RegionsUnited Nations Polar Regions United Nations Polar Regions United Nations Middle East & North AfricaNorth AfricaGulf StatesIranIraqSyriaTurkey North Africa Gulf States Iran Iraq Syria Turkey North Africa Gulf States Iran Iraq Syria Turkey IssueDefense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMDEconomics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTradeDiplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman Security Defense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMD Cyber Crime Insurgencies Intelligence Military Terrorism War & Conflict WMD Economics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTrade Energy Resources Infrastructure Nuclear Energy Technology Trade Diplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman Security Domestic Politics Environment Human Rights International Law Maritime Issues Radical Movements U.S. Foreign Policy Aid and Development Human Security Defense & SecurityCyberCrimeInsurgenciesIntelligenceMilitaryTerrorismWar & ConflictWMD Cyber Crime Insurgencies Intelligence Military Terrorism War & Conflict WMD Cyber Crime Insurgencies Intelligence Military Terrorism War & Conflict WMD Economics & BusinessEnergyResourcesInfrastructureNuclear EnergyTechnologyTrade Energy Resources Infrastructure Nuclear Energy Technology Trade Energy Resources Infrastructure Nuclear Energy Technology Trade Diplomacy & PoliticsDomestic PoliticsEnvironmentHuman RightsInternational LawMaritime IssuesRadical MovementsU.S. Foreign PolicyAid and DevelopmentHuman Security Domestic Politics Environment Human Rights International Law Maritime Issues Radical Movements U.S. Foreign Policy Aid and Development Human Security Domestic Politics Environment Human Rights International Law Maritime Issues Radical Movements U.S. Foreign Policy Aid and Development Human Security AuthorThe EditorsEmil AvdalianiJames BosworthCora Fernández AndersonAfolabi AdekaiyaojaWilder Alejandro SánchezAaron AllenEduardo ArcosSamba Dialimpa BadjiAbolghasem BayyenatRoland BenedikterTangi BihanBruno BinettiLaurence BlairView all authors The Editors Emil Avdaliani James Bosworth Cora Fernández Anderson Afolabi Adekaiyaoja Wilder Alejandro Sánchez Aaron Allen Eduardo Arcos Samba Dialimpa Badji Abolghasem Bayyenat Roland Benedikter Tangi Bihan Bruno Binetti Laurence Blair View all authors The Editors Emil Avdaliani James Bosworth Cora Fernández Anderson Afolabi Adekaiyaoja Wilder Alejandro Sánchez Aaron Allen Eduardo Arcos Samba Dialimpa Badji Abolghasem Bayyenat Roland Benedikter Tangi Bihan Bruno Binetti Laurence Blair View all authors Daily Review Sign Up Now About Get Help Log In Sign Up Now **Colombia’s ‘Invisible’ Violence Persists Despite Petro’s ‘Total Peace’** **Share this:** Click to share on Twitter (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Facebook (Opens in new window) Click to share on Email (Opens in new window) The administration of Colombian President Gustavo Petro has embarked on a program of what it calls “total peace,” aimed at reducing violence through dialogue with armed insurgencies and criminal groups across the country. This focus on negotiated settlements is a welcome and necessary shift in strategy from the past five years, during which Bogota relied almost exclusively on the military to curb insecurity in Colombia.That securitized approach failed to produce tangible results, as conflict worsened across the country. In the last half decade, armed groups have expanded and deepened their presence, while indicators of conflict such as displacement, massacres, targeted assassinations and forced confinement have all increased markedly. In fact, disillusionment with the inability of former President Ivan Duque’s administration to stem the tide of violence partly explains theoverwhelming electoral supportPetro received in violence-affected areas of the country, including along Colombia’s Pacific coast and the Amazon region in the south.Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. That securitized approach failed to produce tangible results, as conflict worsened across the country. In the last half decade, armed groups have expanded and deepened their presence, while indicators of conflict such as displacement, massacres, targeted assassinations and forced confinement have all increased markedly. In fact, disillusionment with the inability of former President Ivan Duque’s administration to stem the tide of violence partly explains theoverwhelming electoral supportPetro received in violence-affected areas of the country, including along Colombia’s Pacific coast and the Amazon region in the south.Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. That securitized approach failed to produce tangible results, as conflict worsened across the country. In the last half decade, armed groups have expanded and deepened their presence, while indicators of conflict such as displacement, massacres, targeted assassinations and forced confinement have all increased markedly. In fact, disillusionment with the inability of former President Ivan Duque’s administration to stem the tide of violence partly explains theoverwhelming electoral supportPetro received in violence-affected areas of the country, including along Colombia’s Pacific coast and the Amazon region in the south.Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. Thus far, Bogota is engaged in ongoing negotiations with the largest remaining leftist insurgency, the National Liberation Army, or ELN, and is set to open formal talks with the largest faction of so-called dissidents of the former Revolutionary Forces of Colombia, or FARC. ThePetro administrationhas moreover reached out groups including the Gulf Clan, the largest organized criminal group, and several other smaller outfits. It has announced cease-fires with all FARC dissidents, though the monitoring mechanisms for those deals are still in construction, making it difficult to ensure that both sides comply, and running the risk of being too dependent on the good faith of armed groups. **Keep reading for free** Already a subscriber?Log in here. Immediate and instant access to the full searchable library of tens of thousands of articles. Daily articles with original analysis, written by leading topic experts, delivered to you every weekday. The Daily Review email, with our take on the day’s most important news, the latest WPR analysis, what’s on our radar, and more. ContentWPR AnalysisDaily Review ResourcesAboutGet AccessGet Help OtherTerms of UsePrivacy PolicyContact InformationFAQs World Politics Review LLC 401 E. Jackson St, Ste 3300 Tampa, FL 33602. Phone 1-917-740-9773 © 2025, World Politics Review LLC. All rights reserved."}