{"id": 1933, "name": "Communist Party USA", "domain": "cpusa.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://cpusa.org/article/adopted-poetry-and-children-the-educators-who-sang-for-justice/", "title": "Adopted Poetry And Children The Educators Who Sang For Justice", "content": "Join Donate Pay Dues **Communist Party USA** **Communist Party USA** AboutParty ProgramConstitutionSocialism in the USAHistoryContact UsDonate Party Program Constitution Socialism in the USA History Contact Us Donate Party Program Constitution Socialism in the USA History Contact Us Donate StudyClassesMarxist IQDownloadable Materials Classes Marxist IQ Downloadable Materials Classes Marxist IQ Downloadable Materials ArticlesParty voices Party voices Party voices Legacy Giving Newsletter Español **Adopted poetry and children: The educators who sang for justice** This article is part of a series on Communist educators brought to you by the CPUSA Labor Commission Educators Subcommittee.Click here for more. Abel Meeropol was a teacher, a poet, a unionist, and a quiet witness to some of the worst aspects of U.S. history. Born in the Bronx in 1903 to Jewish immigrants from what is now Ukraine,Meeropolgrew up in a working-class household shaped by the turbulence of the early 20th century. He went on to study at City College and later became an English teacher at DeWitt Clinton High School in the Bronx, where he taught thousands of students — among them a young James Baldwin. But his contributions would go far beyond the classroom. A unionist with a conscience Meeropol was a member of the Teachers Union (TU), AFT Local 5, which during the 1930s and ’40s was one of the most progressive and politically engaged labor organizations in New York. The union stood for more than better pay and working conditions. It promoted racial equality, opposed fascism, defended academic freedom, and encouraged educators to see themselves as part of the broader struggle for justice. It was through this union that Meeropol firstpublishedone of his most famous works — a poem called “Bitter Fruit,” which appeared in theNew York Teacher, the TU’s publication.Inspiredby a 1930 photograph of the lynching of two Black men in Indiana, the poem was a stark and mournful reflection on racist terror in the United States. Meeropol later set the poem to music with his wife Anne.Retitled“Strange Fruit,” it would become one of the most enduring protest songs of the 20th century. Billie Holiday’s performance of the song electrified audiences — and drew the attention of the FBI. Holiday was repeatedly harassed for singing it, and venues were pressured to keep it off their stages. “Southern trees bear a strange fruit,Blood on the leaves and blood at the root…” The song’s power came not only from its lyrics, but from the context in which it was created — by a public school teacher, through a union paper, during a time when speaking openly about racism could cost someone their job, or worse. Acts of quiet resistance Meeropol never sought attention. He published most of his poetry and music under the pen nameLewis Allan— a tribute to two stillborn children he and Anne had lost. While he was sympathetic to socialist ideas and had been a member of the Communist Party, he withdrew from party activity before the height of the Cold War. Still, his politics remained consistent: anti-racist, internationalist, and rooted in working-class solidarity. Perhaps the most profound example of his moral conviction came in 1953, when Julius and Ethel Rosenberg were executed by the U.S. government on charges of espionage. Their two young sons, Michael and Robert, were orphaned. The Meeropols — who had long been friends and supporters of the Rosenbergs —adoptedthe children and raised them as their own. It was an act of deep personal loyalty and political courage, at a time when simply associating with the Rosenbergs carried social and professional risks. “The savage manipulation of children is a human rights abuse, a kind of state-sponsored terrorism, Robert would laterwrite, connecting their own experience to Trump’s family separation policies today. A lasting influence In addition to “Strange Fruit,” Meeropol wrote numerous other songs and poems, including “The House I Live In,” which wasperformedby Frank Sinatra as part of a short film promoting racial and religious tolerance. He continued teaching for many years and remained active in literary and cultural work throughout his life. Abel Meeropol passed away in 1986. Today, his legacy lives on — not only in the music he helped create, but in the example he set as a teacher who understood his role as both an educator and a citizen. In a time when public education is once again under pressure, and when teachers across the country are being called upon to defend the truth in the face of censorship and repression, Meeropol’s life offers a quiet but enduring lesson: That the classroom is never separate from the world — and that sometimes, the most powerful thing a teacher can do is refuse to stay silent. Images: Abel and Anne Meeropol (The Rosenberg Fund / X) / Billy Holiday (Library of Congress / Britannica); Abel Meeropol (In These Times); Anne Meeropol plays a song on guitar for her adopted sons, Robert and Michael (WGCU / Robert And Michael Meeropol); Abel Meeropol watches as his sons, Robert and Michael, play with a train set (Ibid.) Communist educators communists education Marxist Education Public Education teachers Teachers Unions **Related Articles** Doxey Wilkerson: A revolutionary educator Black youth resistance highlighted at CT People’s World event Columbia’s attack on UAW grad workers an attack on democracy A pivotal year for the Detroit Club Black lives still matter For democracy. For equality. For socialism. For a sustainable future and a world that puts people before profits. Join the Communist Party USA today. We are a political party of the working class, for the working class, with no corporate sponsors or billionaire backers. Join the generations of workers whose generosity and solidarity sustains the fight for justice. **CPUSA Mailbag** QHow does the CPUSA feel about the current American foreign... AThanks for a great question, Conlan. CPUSA stands for peace and international solidarity, and has a long history of involvement... **Most Popular** GMR Today: Marxism, fascism, and the rule of law Communist Party USA condemns Trump ordered LA violence Labor must stand up against MAGA Adopted poetry and children: The educators who sang for justice Alliance and Cooperation with the Labor Movement and All Working People Join Contact Commenting Guidelines Political Affairs Archive Licensed under Creative Commons"}