{"id": 2030, "name": "Left Foot Forward", "domain": "leftfootforward.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://leftfootforward.org/2025/06/spending-review-extra-funding-for-public-services-welcomed-but-labour-urged-to-reverse-disability-benefit-cuts/", "title": "Spending Review Extra Funding For Public Services Welcomed But Labour Urged To Reverse Disability Benefit Cuts", "content": "**Left Foot Forward: Leading the UK's progressive debate** **Left Foot Forward: Leading the UK's progressive debate** Home Donate Sign up Right-Wing Watch Columnists Polling AboutAbout LFFWrite for LFFAdvertise with LFFOur complaints policyPrivacy About LFF Write for LFF Advertise with LFF Our complaints policy Privacy About LFF Write for LFF Advertise with LFF Our complaints policy Privacy Trending Labour NHS economy Climate Change **Thank you for supporting independent media** We’re so grateful for your donation and will make sure your money goes as far as possible Spread the word about us: **Spending review: Extra funding for public services welcomed but Labour urged to reverse disability benefit cuts** From scrapping the use of asylum hotels to increasing spending on the NHS and education, LFF looks at reactions to Labour’s Spending Review. The Chancellor Rachel Reeves stood at the dispatch box this afternoon and signalled that she was rejecting Tory austerity in her first spending review. Many of her announcements, from the 3% extra funding per year for day-to-day NHS spending and £4.5 billion more per year for schools, to £39 billion for social and affordable housing over the next 10 years, will be welcomed by the public. However, looming over Labour’s head is a growing backlash over their plans to cut disability benefits (with a crunch vote next week) and its refusal to axe the two-child benefit cap. Many are warning that Labour still needs to fully break away from austerity. What’s been the response to the Spending Review so far? Labour announced £190 billion more for day to day spending on public services. Responding to Reeves’ announcement, TUC General Secretary Paul Nowak said: “After over a decade of Conservative chaos, rebuilding and repairing Britain was never going to be easy – but this Government is on the right track. “The much-needed cash injection into the NHS and schools will be vital to help fix our public services after years of Conservative austerity, and an important boost for the workforce.” Unison’s general secretary Christina McAnea said: “The chancellor is trying to turn the page on the austerity disaster inflicted on communities across the UK by successive Conservative governments. “Ministers know investing in key public services is the best way to undo the damage of the past and grow the economy of the future.” However, McAnea said: “The government could make it easier on itself by shifting the dial on taxation. Bringing in a wealth tax would generate extra money that could help fix broken Britain.” Despite the funding boost for the NHS, she said: “The reality on the ground now is very different. Health trusts across England are making damaging cuts to jobs and services under ministers’ orders to balance this year’s budgets.” On the additional funding for affordable housing, Paul Kissack, Chief Executive of the Joseph Rowntree Foundation said: “The lack of genuinely affordable homes has had huge implications for poverty, for our economy and for living standards.” He added that “there’s no fixing that overnight but freeing up funds to invest in such a significant 10-year settlement for a new Affordable Homes Programme will be key to meeting the government’s housing targets and ensuring more people have a decent place to live.” However, Kissack warned that to address poverty, the government must also reverse its planned disability benefit cuts. He warned that the cuts could push 300,000 to 400,000 people into poverty, including 50,000 children. As Labour outlined in its manifesto, Reeves committed to ending the use of asylum hotels by the end of the Parliament, which she said would save the taxpayer £1 billion a year. She announced £280 million in additional funding for the Border Security Command, which she said will help cut the asylum backlog, hear more appeal cases, and return people who have no right to be here. Enver Solomon, CEO of the Refugee Council, said: “Asylum hotels have become a flashpoint for community tensions and cost billions to the taxpayer, so ending their use is good for refugees, the taxpayer and communities.” However, he said that the deadline of 2029 is “far away” and urged the government to end the use of asylum hotels before then. Solomon added: “We need to see the men, women and children who arrive in Britain in search of safety being housed within our communities, not isolated in remote hotels.” While Labour has expanded free school meals to 500,000 more children, charities are warning that to lift children out of poverty, the two-child benefit cap must also be scrapped. Chief executive of Child Poverty Action Group, Alison Garnham, said: The Chancellor described austerity as destructive but the government is still rolling it out in the two-child limit which pulls 109 children into poverty every day. “Struggling families won’t feel any renewal until the two-child limit –the biggest driver of rising child poverty – is scrapped and that must happen in the Autumn budget. National renewal doesn’t start with record child poverty.” General secretary of the Fire Brigades Union, Steve Wright stressed that “Labour must break with austerity” and, like Unison and the TUC, called for the government to introduce a wealth tax. Wright said: “Rachel Reeves and Keir Starmer need to start acting like the Chancellor and Prime Minister, in a real Labour government that taxes the wealthy to fund these priorities for the working class.” Wright welcomed Labour’s U-turn on cutting the winter fuel allowance, but warned that planned welfare cuts risk plunging tens of thousands of people into abject poverty and driving up food bank use. He concluded: “It’s time to permanently move on from austerity with a wealth tax to fund public services, the welfare state and pay.” Olivia Barber is a reporter at Left Foot Forward Left Foot Forward doesn't have the backing of big business or billionaires. We rely on the kind and generous support of ordinary people like you.You can support hard-hitting journalism that holds the right to account, provides a forum for debate among progressives, and covers the stories the rest of the media ignore. Donate today. You can support hard-hitting journalism that holds the right to account, provides a forum for debate among progressives, and covers the stories the rest of the media ignore. Donate today. You can support hard-hitting journalism that holds the right to account, provides a forum for debate among progressives, and covers the stories the rest of the media ignore. Donate today. **Related posts:** 5 key takeaways from Rachel Reeves’ Spending Review Voters prefer spending on public services over tax cuts, poll finds These are the 42 Labour MPs who have called for Starmer to abandon disability benefit cuts Labour’s disability benefit reforms slammed as ‘devastating’ and ‘shameful’"}