{"id": 1242, "name": "Elburn Herald", "domain": "shawlocal.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.shawlocal.com/thank-you/first-responders/", "title": "First Responders", "content": "Sign in Subscribe Print Subscriber? Activate Now Manage Your Account Contact Log out Subscribe Digital Account(Opens in new window) Print Account(Opens in new window) Contact Us eNewspapers(Opens in new window) Illinois NewsDeKalb County(Opens in new window)DuPage / Cook Counties(Opens in new window)Friday Night Drive(Opens in new window)Grundy County(Opens in new window)Illinois Valley(Opens in new window)Kane County(Opens in new window)Kankakee County(Opens in new window)Kendall County(Opens in new window)Lake County(Opens in new window)McHenry County(Opens in new window)The MidWeek(Opens in new window)Ogle County(Opens in new window)Putnam County(Opens in new window)Sauk Valley(Opens in new window)Whiteside County(Opens in new window)Will County(Opens in new window) DeKalb County(Opens in new window) DuPage / Cook Counties(Opens in new window) Friday Night Drive(Opens in new window) Grundy County(Opens in new window) Illinois Valley(Opens in new window) Kane County(Opens in new window) Kankakee County(Opens in new window) Kendall County(Opens in new window) Lake County(Opens in new window) McHenry County(Opens in new window) The MidWeek(Opens in new window) Ogle County(Opens in new window) Putnam County(Opens in new window) Sauk Valley(Opens in new window) Whiteside County(Opens in new window) Will County(Opens in new window) DeKalb County(Opens in new window) DuPage / Cook Counties(Opens in new window) Friday Night Drive(Opens in new window) Grundy County(Opens in new window) Illinois Valley(Opens in new window) Kane County(Opens in new window) Kankakee County(Opens in new window) Kendall County(Opens in new window) Lake County(Opens in new window) McHenry County(Opens in new window) The MidWeek(Opens in new window) Ogle County(Opens in new window) Putnam County(Opens in new window) Sauk Valley(Opens in new window) Whiteside County(Opens in new window) Will County(Opens in new window) Iowa NewsCreston News Advertiser (Union County)(Opens in new window)Newton News (Jasper County)(Opens in new window)Osceola Sentinel-Tribune (Clarke County)(Opens in new window) Creston News Advertiser (Union County)(Opens in new window) Newton News (Jasper County)(Opens in new window) Osceola Sentinel-Tribune (Clarke County)(Opens in new window) Creston News Advertiser (Union County)(Opens in new window) Newton News (Jasper County)(Opens in new window) Osceola Sentinel-Tribune (Clarke County)(Opens in new window) AgriNews(Opens in new window) The First Hundred Miles(Opens in new window) Friday Night Drive U Pick 'Em(Opens in new window) The Scene(Opens in new window) Shaw Local Radio(Opens in new window) Starved Rock Country(Opens in new window) News Bears Sports Pro Football Weekly(Opens in new window) Newsletter(Opens in new window) Opinion Thank You First Responders(Opens in new window) Thank You Teachers(Opens in new window) Thank You Veterans(Opens in new window) Wheels(Opens in new window) Obituaries(Opens in new window) Deals(Opens in new window) Public Notices Jobs(Opens in new window) Classified(Opens in new window) Shaw Media Marketing(Opens in new window) Historical Archive(Opens in new window) Shaw Careers(Opens in new window) Privacy Policy **Thank You, First Responders** A tribute to local First Responders Shaw Local News Network **Video: Ride along as DeKalb police urge motorists to use caution along dangerous roadway** Video: A recent ride along with DeKalb Police Sgt. Raynaldo Hernandez highlighted a dangerous stretch of North Annie Glidden Road where a February crash sent one man to the ICU. **School Resource Officer Jennifer Larsen keeps St. Charles schools safe** Jennifer Larsen said she knew she wanted to be a police officer when she was in high school **Brookfield Zoo’s top cop serves guests, staff and animals** Sgt. Lee Zeitlin faces myriad challenges as head of the Brookfield Zoo Chicago's police force **Honoring first responders: Answering the call, no matter the peril** Today we celebrate and honor first responders across our communities in northern Illinois **Joliet police pipe and drum band plays on** Joliet unique with police and fire bagpipe bands **At 20 years old, 911 dispatcher has a ‘poise you can’t train’** Alexis Echebarria loves her work, doesn’t seek recognition for her job as the first point of contact during an emergency. **Married to each other and law enforcement: Cop couple has mutual aid through tough times** Husband, wife, father, mother, Illinois State Police master sergeant and McHenry County Sheriff’s deputy. Robert and Khalia Satkiewicz have worn several titles during their 22-year marriage. With each title is a common thread: caring and wanting to help. Our communities rely on a special kind of hero: the first responder. Firefighters, police officers, EMTs, emergency room nurses, doctors, and paramedics – these brave men and women are the first on the scene of emergencies, facing danger head-on to protect and serve others. They answer the call at any hour, bringing a sense of calm and control to chaotic situations. . This project, \"Thank You First Responders,\" is dedicated to acknowledging the unwavering dedication and selfless service of our community's first responders. **Eye On Illinois: Every session has legislative efforts to address work of first responders** Typing the phrase “first responder” into the General Assembly website (ilga.gov) returns dozens of bills introduced during the current session."}