{"id": 1388, "name": "TheJournal.ie", "domain": "thejournal.ie", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thejournal.ie/factcheck-factfind-conor-mcgregor-asked-if-there-was-a-single-autistic-person-who-had-not-been-vaccinated-6679707-Apr2025/", "title": "Factcheck Factfind Conor Mcgregor Asked If There Was A Single Autistic Person Who Had Not Been Vaccinated 6679707 Apr2025", "content": "We need your help now Support from readers like you keeps The Journal open. You are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough. If you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it. Sign in.It’s quick, free and it’s up to you. An account is an optional way to support the work we do.Find out more. Irish News FactCheck Voices Investigates J-TV **FactCheck: Studies of millions of children show there is no connection between autism and vaccines** WEEKS AFTER HIS visit to Donald Trump in the White House, Conor McGregor repeated a long-debunked theory that vaccines cause autism in children. “I wonder is there a person in the world with autism, who was not vaccinated whatsoever, nor their mother vaccinated during the pregnancy term etc.,” McGregor posted on Elon Musk’s social media platform X on the evening of 2 April. “I wonder if there is one such case to disprove the vaccine connection to autism theory?” McGregor tagged Robert F. Kennedy Jr, an anti-vaccine activist who Trump recently appointed to head the United States’s Health and Human Services. Kennedy announcedlast weekthat he was launching a “massive testing and research effort” to figure out the cause of autism. McGregor’s post was praised as a “great question” by General Mike Flynn, who served as national security advisor during the first Trump presidency before resigningfor lyingabout discussing sanctions with a Russian official. Flynn continued: “We have two in my family and the only similarity is the vaccines, something we would never have done had we known the statistics or the consequences of these dangerous shots.” (It is unclear what statistics or consequences Flynn is referring to. The main consequence of vaccines is protection from disease). Another reply to McGregor’s post on X by self-described “conspiracy theorist” account @Liz Churchill reads: “Check the Amish Community where they also don’t have cancer or diabetes.” This reply is wrong on a number of counts, most pointedly: Amish people do havechildren with autism. The Amish alsooften vaccinate,so this does not necessarily answer McGregor’s question. Similar suggestions that vaccines might be the cause of autism have long been promoted by believers of fringe medicine, particularly since the publication of a study in the 1990s that has since been debunked, retracted and the lead author has been barred from practising medicine in the UK. Where do claims there is a connection between vaccines and autism come from? Haven’t there been studies on this? And has there been, as McGregor asked, people with autism who haven’t been vaccinated? **Vaccines** Vaccines in Europe are usuallytraced back to 1796, when an English doctor, Edward Jenner, successfully inoculated an eight-year-old with a scraping from cowpox sore. Although this initially made the child who the vaccine was tested on mildly sick, it also conferred them with protection against the much more dangerous smallpox virus. More modern methods of vaccination have followed this rough template: introducing a less dangerous version of the pathogen (sometimes a dead bacteria or damaged virus) which prepares a person’s immune system to fight when it encounters the real deal. ModernmRNA vaccines, which were rolled out to fight the Covid-19 pandemic, work by introducing a section of the virus’s genetic code, which prompts some cells to create parts of the pathogen (such as the famous “spike” protein), which the body then learns to recognise and counteract. There is no connection between vaccines and autism, which describes a range of developmental conditions that affect how people think. Although the conditions are sometimes referred to as autism spectrum disorder (ASD), the HSEemphasisesthat autism is not an illness or a disease, and therefore does not have a cure. They say that autism is instead a description for some people whose “brain works in a different way”. The HSE also lists some ways that autism may present, such as an affected person finding it hard to communicate with others or interpret another person’s feelings. They may also feel very uncomfortable in unfamiliar or unpredictable situations. Further examples of symptoms can be readhereandhere. It is also clear that the effects of the condition on people vary significantly, with many autistic people leading independent lives and others who require significant help to manage the impact of their condition on their day-to-day lives. **Fraudulent studies** The myth that vaccines cause autism has been spread widely since the turn of the century, and can be traced back to anow-retracted Lancet articleby Andrew Wakefield, a British conspiracy theorist who was then a research doctor, that was published in 1998. This article claimed that there was a link between the MMR shot — a combination vaccine for Measles, Mumps, and Rubella — and developmental disorders in children. Wakefield had previously filed a patent for an alternative measles vaccine that some havealleged was his motivefor portraying the existing MMR vaccine as dangerous. Multiplesubsequentstudiesattempting to replicate the Wakefield’s findings were unable to find a link between vaccines and autism. After an investigation, Wakefield wasfound guiltyby the UK General Medical Council of “dishonesty and flouting ethics protocols” and is nowbannedfrom practising medicine in the UK The British Medical Association’s publication, the BMJ,reported that dataused in the original study was fraudulent and that Wakefield had “altered numerous facts about the patients’ medical histories in order to support his claim to have identified a new syndrome”. The Wakefield paper hasbeen describedas “perhaps, the most damaging medical hoax of the last 100 years”. **Ongoing issues** However, despite the debunking of Wakefield’s research, a wave of vaccine hesitancy that it inspired continues, often among people who have no living memory of diseases like measles, which were effectively eliminated by vaccines in the developed world. This was particularly apparent during the pandemic, when many believers of Wakefield’s claims condemned the vaccines for Covid-19 as being dangerous, even before they had been developed and tested. Despite previously seeing the disease eliminated, Ireland saw its firstmeasles deathin over 20 years during February 2024. Other outbreaksand suspected cases have since been reported in Ireland, including recent suspected cases ata crecheand ona train. Measles is a highly infectious disease that can cause serious complications, particularly in children under one year of age, pregnant women and the immuno-suppressed. It typically starts with cold-like symptoms that develop about 10 days after a person gets infected. The person will get a rash a few days later. Typically, one in 1,000 people will develop encephalitis (swelling of the brain). For every 10 children who develop encephalitis, one will die and up to four will have brain damage. One in 8,000 children under two years of age get SSPE (brain degeneration), which may be many years after measles and is always fatal. Advertisement However, the MMR (measles, mumps and rubella) vaccination is a very effective way to protect people from measles. Two doses of the MMR vaccine are necessary to be considered fully vaccinated. The first dose is given by a GP when a child is 12 months of age. The second dose is generally given by school vaccination teams when the child is in junior infants. The overall uptake of the MMR vaccine in Ireland in2021/2022, the latest annual figure available, was 87.5%. The WHO recommends a 95% uptake rate of the MMR vaccine to ensure herd immunity. Some people cannot be vaccinated – for health reasons, pregnancy, or if they are less than one year old – and rely on mass immunity among the general population. “The importance of taking precautions to protect both the individual and the community from measles cannot be understated,” a spokesperson from the HSE toldThe Journal. “While measles is preventable through vaccination, the virus spreads very quickly between people who are not vaccinated and can have severe consequences, particularly for babies and vulnerable groups.” The World Health Organisation has noted a massive increase in measles cases, up from 941 reported in the European Region in 2022 to 127,350 measles cases in 2024. This represents a 135-fold increase over two years and the highest yearly numberin decades. As of early March,38 deathshad been reported in Europe, according to the World Health Organisation. A smaller outbreak of measles in Texas this year has led to the deaths oftwo childrenand prompted long-time anti-vaccine activist Robert F. Kennedy Jr to endorse the use of vaccines to stop the disease. Kennedy had previously been criticised for fueling distrust of the MMR vaccine in Samoa and Tonga, where later measles outbreaks would kill dozens. As of 2023, Kennedy has been “on leave” from the Children’s Health Defense, an anti-vaccine organisation he had founded and which continues to spread claims that the MMR vaccine causes autism. **Modern medicine** If these outbreaks are caused in part because people are afraid that vaccines might cause autism, it is not a fear shared by medical experts. More than a hundred studies since have shown that there is no link between vaccines and autism or that there is no higher incidence of autism in vaccinated children compared to unvaccinated children. “We know that vaccines don’t cause autism,” theHSE website reads. “However, when things happen around the time vaccines are given we can think that there is a link between the two things. “For example, the signs of autism usually become noticeable at about the age when children are given the MMR vaccine, but one does not cause the other.” There has been extensive research and, helpfully, there has also been research on the research in the form of a Cochrane report — a meta analysis that collates and categorises data from other studies to give a summary of their findings. These studies from Cochrane, a well-respected healthcare research network, hold research to very high standards and are supposed to show the current best understanding of various forms of health interventions. Their most up-to-date review of the MMR vaccine is entitled “Vaccines for measles, mumps, rubella, and varicella in children” which was updated in 2021. Looking at 138 studies with 23,480,668 participants, they assessed the dangers that such vaccines might harm, including 87 studies that looked at 13,232,509 children. Given the sheer number of participants, rare reactions to the vaccines, such as seizures, were detected. However, even with these huge numbers of participants, the review found that “there is no evidence of an association” between the vaccine and autism. “The meta‐analysis did not provide evidence supporting an association between MMR immunisation and autism spectrum disorders,” the review reads (after a lengthy discussion of the studies it looked at, what they showed, as well as their limitations). However, do these studies directly address the first part of McGregor’s post: “I wonder is there a person in the world with autism, who was not vaccinated whatsoever”? Yes, overwhelmingly so. Many of the studies reviewed in the Cochrane meta-analysis worked by comparing vaccinated children with non-vaccinated children (and often by pairing them off further by, for example, whether they had a relative with autism). Rates of autism and other developmental conditions were the same between vaccinated and unvaccinated children. One such studyin Denmark looked at 537,303 children, of which 96,648 were not vaccinated. Of the unvaccinated group, 53 were diagnosed as having autism, while another 77 had other related conditions. Not just were unvaccinated children diagnosed with autism found, but they appeared to have it at a slightly higher rate than the vaccinated group (though Cochrane warns about reading too much into variations like that). However, McGregor’s questions was more involved than that. He asked whether it was true if any “person in the world with autism, who was not vaccinated whatsoever, nor their mother vaccinated during the pregnancy term etc.” The Danish study did not record data on mothers receiving vaccinations, however there is strong reason to believe that few of them would have been vaccinated. The Danish study was conducted between 1991 and 1998 and the MMR vaccine was introduced in Denmark only 4 years before the study began. Therefore, it is unlikely that the mothers of the children had received such a vaccine. And, given Europe still hasno mandatory vaccination policyfor pregnant women, presumably, mothers who do not get their children vaccinated are unlikely to seek out vaccinations for themselves (no vaccines appear to have been recommended for pregnant women at the time). In addition, it has been noted that autism has been studied since the 1940s, before the vaccines in use were in wide use, and that various historical figures have displayed traits associated with autism since before the invention of vaccines. It is true that levels of autism diagnosis haveincreased, this is largely attributed to better diagnosis and wider assessment boundaries; more people are now considered to have autism, even if it causes them little trouble in their lives. Modernresearch, including the use of twin studies, suggests that autism has a strong genetic component. In other words, it’s in the child’s unchangeable DNA. Some expertshave suggested that if you remove cases of people with low support needs, the jump in cases drops dramatically. However, whatever the cause for the rise in recorded cases is, one suspected cause that has been repeatedly and comprehensively studied is vaccines, and the evidence is clear: vaccines do not cause autism. With reporting from Órla Ryan Want to be your own fact-checker? Visit our brand-newFactCheck Knowledge Bankfor guides and toolkits The Journal’s FactCheck is a signatory to the International Fact-Checking Network’s Code of Principles. You can read ithere. For information on how FactCheck works, what the verdicts mean, and how you can take part, check out our Reader’s Guidehere. You can read about the team of editors and reporters who work on the factcheckshere. Readers like you are keeping these stories free for everyone...It is vital that we surface facts from noise. Articles like this one brings you clarity, transparency and balance so you can make well-informed decisions. We set up FactCheck in 2016 to proactively expose false or misleading information, but to continue to deliver on this mission we need your support.Over 5,000 readers like you support us. If you can, please consider setting up a monthly payment or making a once-off donation to keep news free to everyone.Learn MoreSupport The Journal To embed this post, copy the code below on your site 600px wide<iframe width=\"600\" height=\"460\" frameborder=\"0\" style=\"border:0px;\" src=\"https://www.thejournal.ie/https://www.thejournal.ie/factcheck-factfind-conor-mcgregor-asked-if-there-was-a-single-autistic-person-who-had-not-been-vaccinated-6679707-Apr2025/?embedpost=6679707&width=600&height=460\" ></iframe> 400px wide<iframe width=\"600\" height=\"460\" frameborder=\"0\" style=\"border:0px;\" src=\"https://www.thejournal.ie/https://www.thejournal.ie/factcheck-factfind-conor-mcgregor-asked-if-there-was-a-single-autistic-person-who-had-not-been-vaccinated-6679707-Apr2025/?embedpost=6679707&width=400&height=460\" ></iframe> 300px wide<iframe width=\"600\" height=\"460\" frameborder=\"0\" style=\"border:0px;\" src=\"https://www.thejournal.ie/https://www.thejournal.ie/factcheck-factfind-conor-mcgregor-asked-if-there-was-a-single-autistic-person-who-had-not-been-vaccinated-6679707-Apr2025/?embedpost=6679707&width=300&height=460\" ></iframe> Voices FactCheck Investigates Daft.ie Property Magazine Allianz Home Magazine The 42 Sports Magazine Money Diaries The Journal TV About us Careers Contact Advertise With Us About FactCheck The 42 FactCheck Knowledge Bank Terms of Use Cookies & Privacy Advertising Comments Copyright Competition TV Listings Quizzes Live Blogs GAA Fixtures The Video Review About us Careers Contact Advertise With Us The Journal FactCheck Knowledge Bank Terms of Use Cookies & Privacy Advertising Comments Copyright Competition Terms of Use Cookies & Privacy Advertising Comments Copyright Competition Create an email alert based on the current article ****"}