{"id": 1005, "name": "New Statesman", "domain": "newstatesman.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newstatesman.com/spotlight/economic-growth/regional-development/housing/2025/05/inside-the-hidden-homeless-crisis", "title": "Inside The Hidden Homeless Crisis", "content": "Reviewing politicsand culture since 1913 Economic Growth Sustainability Healthcare Tech and Regulation Reports Spotlight Marketing Solutions My profile Sign out My profile Subscribe Sign out Subscribe Sign In PoliticsBack to all sectionsUKScotlandWalesNorthern IrelandPollingMediaBrexitSociety Back to all sections UK Scotland Wales Northern Ireland Polling Media Brexit Society Back to all sections UK Scotland Wales Northern Ireland Polling Media Brexit Society Comment WorldBack to all sectionsUSEuropeAfricaAsiaAustralasiaAmericasMiddle EastChinaIndia Back to all sections US Europe Africa Asia Australasia Americas Middle East China India Back to all sections US Europe Africa Asia Australasia Americas Middle East China India IdeasBack to all sectionsThe Ideas Interview Back to all sections The Ideas Interview Back to all sections The Ideas Interview CultureBack to all sectionsBooksFilmTVMusicRadio & PodcastsTheatreGoldsmiths PrizeArt & DesignQ&AFood & DrinkNaturePoetryFictionSport Back to all sections Books Film TV Music Radio & Podcasts Theatre Goldsmiths Prize Art & Design Q&A Food & Drink Nature Poetry Fiction Sport Back to all sections Books Film TV Music Radio & Podcasts Theatre Goldsmiths Prize Art & Design Q&A Food & Drink Nature Poetry Fiction Sport Magazine Newsletters State of the Nation Spotlight on PolicyBack to all sectionsEconomic GrowthSustainabilityHealthcareTech and RegulationReportsSpotlight Marketing Solutions Back to all sections Economic Growth Sustainability Healthcare Tech and Regulation Reports Spotlight Marketing Solutions Back to all sections Economic Growth Sustainability Healthcare Tech and Regulation Reports Spotlight Marketing Solutions Podcasts Newsletters Archive Podcasts Video Events Featured writers Goldsmiths Prize About us Partners Spotlight on Policy Economic Growth Regional Development Housing **Inside the hidden homeless crisis** How insecure housing impacts tens of thousands of children. BySpotlight More than 60,000 people in London are living in temporary accommodation (TA). With housing costs vastly inflated, the crisis of the so-called “hidden homeless” is even more extreme in the capital than elsewhere. While the public’s perception of homelessness often focuses on rough sleeping, this is a far rarer phenomenon when compared with the vast numbers of registered homeless people who are suffering the precarity of sofa-surfing with family and friends, or else living in council-provided TA. Nowadays, TA, while allocated and paid for by local authorities, is rarely owned by them, since councils have had their own housing stock decimated over the last forty years of right-to-buy and low rates of housebuilding. Instead, TA for homeless residents often entails budget hotels, hostels, and B&Bs, with whole families sometimes sharing single rooms. If this is not an option, accommodation for the homeless is sought in the private rented sector, which can also be over-crowded, with councils paying private landlords to provide those in acute need with shelter. The places that we grow up, live and work impact how healthy we are and urban areas, like inner-city London, have some of the most extreme health outcomes. Alongside their vibrancy and diversity sit stark health inequalities and high levels of homelessness. The effects of living in TA are particularly harmful for children and young people. Statistically, every classroom in the capital will have a homeless child. In some schools, particularly in areas of lower-than-average income, the number of homeless pupils can be as high as 25 per cent. One of those pupils is Timi, an 18-year-old from South London. “I’ve lived the majority of my life in TA”, he says. Timi, who is autistic, has been in his current temporary home for nine years with his mother and three siblings. With his lifetime of lived experience, he knows that conditions are often well below livable standards. Families living in TA often lack access to adequate cooking facilities – this is especially the case for families placed in hotels. The lack of access to healthy, fresh and nutritious food can quickly have massive consequences for children’s physical and mental health, including: malnutrition, diabetes, heart disease, obesity, depression, and exhaustion. These are just some of the many ways that living in TA perpetuates health inequalities for children. “In many places we’ve stayed, including where we are now, there have been rotten sofas and fridges, dirty surfaces, including mold that covered the entire bathroom for a very long time”, says Timi. “We’ve stayed in places where none of the cooking appliances worked, the heating didn’t work, some places didn’t even have a shower, so we had to use buckets to wash.” The young Londoner, who will be taking a place at university next year, has even been seriously injured due to faulty appliances in TA. He recounts an incident when “the glass in the shower broke all over me. Paramedics had to attend and I went into urgent care… We’ve also had issues with sewage in the garden and toilets not flushing”, he adds. “The amount of things that go wrong with TA… you become numb to it.” Perhaps unsurprisingly, almost six in ten TA residents report that their children’s physical or mental health is being negatively impacted by their living situation. Temporary housing has been linked to the deaths of at least 74 children, according to figures from an NHS-funded database. 58 of those deaths have been of children younger than one year old. The effect on children’s education and their access to public services more generally is also severe. “I’ve been to eight schools, mainly due to moving around a lot”, says Timi. “Part of the stress is that the council can put you wherever they want to, they can move [you]because it’s not part of the council’s housing stock. It means that the landlord can take back the property at any time.” More than half of young TA residents have been forced to move schools. According to research by the Institute for Health Equity, children under five years old living in TA are also less likely to receive statutory checks from health visitors in their home, they are therefore also more likely to miss routine screening and immunisations. To compound all this, temporary accommodation residents are also far more susceptible to getting into problem debt, which can then be used as a reason to exclude them from waiting lists for a social rent home. This ‘debt trap’ is a policy barrier which has been raised by academics at Kings College London and the charity Shared Health Foundation. For many, it is all too easy to accrue these types of household debt. The housing charity Shelter found that almost nine in ten (87 per cent) of TA residents struggle to keep up with their housing costs, and almost half (47 per cent) have borrowed money to keep up with payments. Financial burdens are often exacerbated when residents are forced to reduce working hours (affecting 27 per cent) or even stop work completely (11 per cent) due to the impact of being moved around temporary housing allocations. “Your life chances from a young age are impacted by constant moving, constant worries, constant stress,” Timi says. “Your whole future is put on hold because you have to deal with homelessness, because you have to contribute to bills. The moment you turn 16 the council asks for evidence that you’re still in education, otherwise you have to contribute to rent. I started working before I even received my GCSEs and contributed to paying bills. TA is destroying young people’s futures.” But things can change. Young people like Timi are organising and becoming involved in social action. “Last year I successfully applied to the Young Gamechangers Fund, part of the Co-op Foundation, for funding for an initiative I called Project 9.0”, he says. “The project aims to create a coalition of people who have lived experience of homelessness and TA. We want to identify solutions and create a nine-point plan to end child homelessness in London within 9 years (by 2035). We’re looking for children and young people aged 11-25 with experience of homelessness, whether that’s temporary accommodation, or other forms of housing insecurity, to join the campaign”. Impact on Urban Health are supporting a number of initiatives to improve security for tenants, prevent homelessness, and ensure that when TA must be used it meets the needs of children and families. Too often, TA prevents children from having access to the things they need to be healthy, feel safe, and reach their full potential. To address this, Impact on Urban Health are calling for an end to the long-term use of Temporary Accommodation and the barriers that it creates to achieving health equity for all children. If you’d like to find out more about Project 9.0 and get involved, please visit www.endz.uk/project9.0 This article first appeared in our Spotlight on Child Poverty supplement, of 23 May 2025, guest edited by Gordon Brown. Related **Spotlight** **More of this topic** **Recent Podcasts** About us History Help Centre Contact us Advertising & Partnerships RSS Facebook Instagram Twitter LinkedIn Privacy policy T&Cs"}