{"id": 1065, "name": "Oregonian", "domain": "oregonlive.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.oregonlive.com/beavers/2025/06/a-lineup-gamble-a-coaching-handoff-and-superb-defense-3-things-that-fueled-oregon-state-baseballs-college-world-series-berth.html", "title": "A Lineup Gamble A Coaching Handoff And Superb Defense 3 Things That Fueled Oregon State Baseballs College World Series Berth.html", "content": "College Football Beavers Schedule **A lineup gamble, a coaching handoff and superb defense: 3 things that fueled Oregon State baseball’s College World Series berth** Updated:Jun. 11, 2025, 8:34 a.m. |Published:Jun. 10, 2025, 1:12 p.m. Joe Freeman | The Oregonian/OregonLive The lineup thatlaunched the Oregon State baseball teaminto theCollege World Seriesbecame official less than an hour before the first pitch of Sunday’s win-or-go-home Game 3 at the Corvallis Super Regional. But, really, it materialized one night earlier. An enduring legacy.pic.twitter.com/goAkJyatpz If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Our Journalists About OregonLive.com Contact The Newsroom Technical Support Search Our Archives Advertise With Us Subscribe to The Oregonian Subscriber Services Digital Subscription FAQ Delivery Opportunities Accessibility Statement The Oregonian eNewspaper Email Newsletters Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Today's Top News Politics Crime Business Commuting Weather Education Homes & Gardens Letters to the Editor Video Environment Here is Oregon Noticias en español Special Sections Sports High School Sports Ducks Beavers Trail Blazers Timbers Thorns Recruiting News Entertainment Travel TV & Movies Eat, Drink, Cook Comics Archives Portland Washington County Clackamas County Clark County Pacific Northwest Email Newsletters YouTube Twitter Facebook Instagram RSS iPhone, Android apps Tablet apps Place an Ad Autos Jobs Sponsor Content Post a Job Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}