{"id": 844, "name": "LifeWire", "domain": "lifewire.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lifewire.com/first-things-you-should-do-with-your-new-computer-2625779", "title": "First Things You Should Do With Your New Computer 2625779", "content": "NEWSNEWSSee All NewsThreads Just Got Real Messaging (No Insta Needed)Your Next Samsung Camera Might Know What You’re Looking AtAndroid 16 Solves the “Where’s My Order?” ProblemiPadOS 26 Adds Journal, Preview, Phone, and Games Apps to iPad This FallAI Can’t Think Like You—And That’s a Good ThingtvOS 26 Update: New Apple TV Design and Apple Music Sing UpgradeScam Texts Are Targeting Teens: What Can You Do?Apple’s Workout Buddy Uses AI and Real Voices to Coach You Through Every WorkoutMicrosoft and ASUS Launch New Handhelds for Xbox and PC Gaming on the Go WHAT TO BUYWHAT TO BUYALL CATEGORIESTech Buying GuidesPhones & AccessoriesHeadphones & SpeakersSmart HomeSoftware & ServicesHome EntertainmentComputers & LaptopsGames & ConsolesWearablesHome NetworkingDeals and GiftsDEALS & GIFTS WE LOVEThe Best Target Tech DealsOur Favorite Tech Deals at Best BuyWalmart's Top Tech Deals Right NowThe Best Tech Gifts for Anyone, AnytimeThe Most Awesome Tech Deals AnywhereAll Tech Deals & GiftsCOMPUTERS & ACCESSORIESThe Best UPS Battery BackupsTop-rated Mesh Wi-Fi Network SystemsExternal Hard Drives We RecommendMust-Have Ergonomic KeyboardsThe Best Vertical Mice This YearAll Computers & AccessoriesPHONES & ACCESSORIESWhere to Buy Your Next PhoneThe Best Charging Stations This YearMost Popular Bluetooth SpeakersGotta Have It: Waterproof Phone CasesOur Fave Portable KeyboardsAll Phones & Accessories ALL CATEGORIES Tech Buying Guides Phones & Accessories Headphones & Speakers Smart Home Software & Services Home Entertainment Computers & Laptops Games & Consoles Wearables Home Networking Deals and Gifts The Best Target Tech Deals Our Favorite Tech Deals at Best Buy Walmart's Top Tech Deals Right Now The Best Tech Gifts for Anyone, Anytime The Most Awesome Tech Deals Anywhere The Best UPS Battery Backups Top-rated Mesh Wi-Fi Network Systems External Hard Drives We Recommend Must-Have Ergonomic Keyboards The Best Vertical Mice This Year Where to Buy Your Next Phone The Best Charging Stations This Year Most Popular Bluetooth Speakers Gotta Have It: Waterproof Phone Cases Our Fave Portable Keyboards ALL CATEGORIES Tech Buying Guides Phones & Accessories Headphones & Speakers Smart Home Software & Services Home Entertainment Computers & Laptops Games & Consoles Wearables Home Networking Deals and Gifts The Best Target Tech Deals Our Favorite Tech Deals at Best Buy Walmart's Top Tech Deals Right Now The Best Tech Gifts for Anyone, Anytime The Most Awesome Tech Deals Anywhere The Best UPS Battery Backups Top-rated Mesh Wi-Fi Network Systems External Hard Drives We Recommend Must-Have Ergonomic Keyboards The Best Vertical Mice This Year Where to Buy Your Next Phone The Best Charging Stations This Year Most Popular Bluetooth Speakers Gotta Have It: Waterproof Phone Cases Our Fave Portable Keyboards HOW TOHOW TOALL CATEGORIESPhonesComputersSmart & Connected LifeStreamingGamingSocial MediaSoftware & AppsHome TheaterInternet & SecurityEmail & MessagingPHONES & CONNECTIONSiPhone v. Android: Which Is Best For You?Before You Buy an Unlocked SmartphoneThe Best Apps for Your PhoneHow to Check Your Data UsageHow to Create Group Chat NamesAll Phone How To’sCOMPUTERS & INTERNET5 Things to Do With a New ComputerThe Best Ways to Speed Up Your ComputerHow to Network a Printer5 Ways to Back up Your DataHow to Choose a Computer MonitorAll Computer How To’sSTREAMING & ENTERTAINMENTCable vs. StreamingWhat to Know Before Buying a Smart TVThe Best TV Streaming Services to TryWhere to Watch Free Movies OnlineThe Best Free Music Streaming SitesAll Streaming How To’s ALL CATEGORIES Phones Computers Smart & Connected Life Streaming Gaming Social Media Software & Apps Home Theater Internet & Security Email & Messaging iPhone v. Android: Which Is Best For You? Before You Buy an Unlocked Smartphone The Best Apps for Your Phone How to Check Your Data Usage How to Create Group Chat Names 5 Things to Do With a New Computer The Best Ways to Speed Up Your Computer How to Network a Printer 5 Ways to Back up Your Data How to Choose a Computer Monitor Cable vs. Streaming What to Know Before Buying a Smart TV The Best TV Streaming Services to Try Where to Watch Free Movies Online The Best Free Music Streaming Sites ALL CATEGORIES Phones Computers Smart & Connected Life Streaming Gaming Social Media Software & Apps Home Theater Internet & Security Email & Messaging iPhone v. Android: Which Is Best For You? Before You Buy an Unlocked Smartphone The Best Apps for Your Phone How to Check Your Data Usage How to Create Group Chat Names 5 Things to Do With a New Computer The Best Ways to Speed Up Your Computer How to Network a Printer 5 Ways to Back up Your Data How to Choose a Computer Monitor Cable vs. Streaming What to Know Before Buying a Smart TV The Best TV Streaming Services to Try Where to Watch Free Movies Online The Best Free Music Streaming Sites FEATURESFEATURESAI & ScienceHome Office CentralFamily Tech TipsWomen in GamingUp & Coming Tech LeadersEco-friendly TechnologyTraveling With TechWhat to Watch: TV, Movies, & MoreConnected Car TechFrom batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out.Home EntertainmentWhether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. AI & Science Home Office Central Family Tech Tips Women in Gaming Up & Coming Tech Leaders Eco-friendly Technology Traveling With Tech What to Watch: TV, Movies, & More Connected Car TechFrom batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. From batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. Home EntertainmentWhether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. Whether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. AI & Science Home Office Central Family Tech Tips Women in Gaming Up & Coming Tech Leaders Eco-friendly Technology Traveling With Tech What to Watch: TV, Movies, & More Connected Car TechFrom batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. From batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. From batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. From batteries to connecting your phone via bluetooth and asking for help to navigate the way home, your connected car is part of your life. We'll help you figure it all out. Home EntertainmentWhether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. Whether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. Whether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. Whether you want to build your own home theater or just learn more about TVs, displays, projectors, and more, we've got you covered. ABOUT USABOUT USContact Us Watch Movies Outside: Outdoor Projectors M5 MacBook Rumors Watch Movies Outside: Outdoor Projectors M5 MacBook Rumors NEWSThreads Just Got Real Messaging (No Insta Needed)Your Next Samsung Camera Might Know What You’re Looking AtAndroid 16 Solves the “Where’s My Order?” ProblemiPadOS 26 Adds Journal, Preview, Phone, and Games Apps to iPad This FallAI Can’t Think Like You—And That’s a Good ThingtvOS 26 Update: New Apple TV Design and Apple Music Sing UpgradeScam Texts Are Targeting Teens: What Can You Do?Apple’s Workout Buddy Uses AI and Real Voices to Coach You Through Every WorkoutSee All News Threads Just Got Real Messaging (No Insta Needed)Your Next Samsung Camera Might Know What You’re Looking AtAndroid 16 Solves the “Where’s My Order?” ProblemiPadOS 26 Adds Journal, Preview, Phone, and Games Apps to iPad This FallAI Can’t Think Like You—And That’s a Good ThingtvOS 26 Update: New Apple TV Design and Apple Music Sing UpgradeScam Texts Are Targeting Teens: What Can You Do?Apple’s Workout Buddy Uses AI and Real Voices to Coach You Through Every Workout See All News Threads Just Got Real Messaging (No Insta Needed)Your Next Samsung Camera Might Know What You’re Looking AtAndroid 16 Solves the “Where’s My Order?” ProblemiPadOS 26 Adds Journal, Preview, Phone, and Games Apps to iPad This FallAI Can’t Think Like You—And That’s a Good ThingtvOS 26 Update: New Apple TV Design and Apple Music Sing UpgradeScam Texts Are Targeting Teens: What Can You Do?Apple’s Workout Buddy Uses AI and Real Voices to Coach You Through Every Workout See All News WHAT TO BUYWHAT TO BUYTech Buying GuidesPhones & AccessoriesHeadphones & SpeakersSmart HomeSoftware & ServicesHome EntertainmentComputers & LaptopsGames & ConsolesWearablesHome NetworkingDeals and GiftsDEALS & GIFTS WE LOVEThe Best Target Tech DealsOur Favorite Tech Deals at Best BuyWalmart's Top Tech Deals Right NowThe Best Tech Gifts for Anyone, AnytimeThe Most Awesome Tech Deals AnywhereAll Tech Deals & GiftsCOMPUTERS & ACCESSORIESThe Best UPS Battery BackupsTop-rated Mesh Wi-Fi Network SystemsExternal Hard Drives We RecommendMust-Have Ergonomic KeyboardsThe Best Vertical Mice This YearAll Computers & AccessoriesPHONES & ACCESSORIESWhere to Buy Your Next PhoneThe Best Charging Stations This YearMost Popular Bluetooth SpeakersGotta Have It: Waterproof Phone CasesOur Fave Portable KeyboardsAll Phones & Accessories WHAT TO BUY Tech Buying Guides Phones & Accessories Headphones & Speakers Smart Home Software & Services Home Entertainment Computers & Laptops Games & Consoles Wearables Home Networking Deals and Gifts DEALS & GIFTS WE LOVE The Best Target Tech Deals Our Favorite Tech Deals at Best Buy Walmart's Top Tech Deals Right Now The Best Tech Gifts for Anyone, Anytime The Most Awesome Tech Deals Anywhere All Tech Deals & Gifts COMPUTERS & ACCESSORIES The Best UPS Battery Backups Top-rated Mesh Wi-Fi Network Systems External Hard Drives We Recommend Must-Have Ergonomic Keyboards The Best Vertical Mice This Year All Computers & Accessories PHONES & ACCESSORIES Where to Buy Your Next Phone The Best Charging Stations This Year Most Popular Bluetooth Speakers Gotta Have It: Waterproof Phone Cases Our Fave Portable Keyboards All Phones & Accessories WHAT TO BUY Tech Buying Guides Phones & Accessories Headphones & Speakers Smart Home Software & Services Home Entertainment Computers & Laptops Games & Consoles Wearables Home Networking Deals and Gifts DEALS & GIFTS WE LOVE The Best Target Tech Deals Our Favorite Tech Deals at Best Buy Walmart's Top Tech Deals Right Now The Best Tech Gifts for Anyone, Anytime The Most Awesome Tech Deals Anywhere All Tech Deals & Gifts COMPUTERS & ACCESSORIES The Best UPS Battery Backups Top-rated Mesh Wi-Fi Network Systems External Hard Drives We Recommend Must-Have Ergonomic Keyboards The Best Vertical Mice This Year All Computers & Accessories PHONES & ACCESSORIES Where to Buy Your Next Phone The Best Charging Stations This Year Most Popular Bluetooth Speakers Gotta Have It: Waterproof Phone Cases Our Fave Portable Keyboards All Phones & Accessories HOW TOHOW TOPhonesComputersSmart & Connected LifeStreamingGamingSocial MediaSoftware & AppsHome TheaterInternet & SecurityEmail & MessagingPOPULAR IN PHONES & CONNECTIONSiPhone v. Android: Which Is Best For You?Before You Buy an Unlocked SmartphoneThe Best Apps for Your PhoneHow to Check Your Data UsageHow to Create Group Chat NamesAll Phone How To’sPOPULAR IN COMPUTERS & INTERNET5 Things to Do With a New ComputerThe Best Ways to Speed Up Your ComputerHow to Network a Printer5 Ways to Back up Your DataHow to Choose a Computer MonitorAll Computer How To’sPOPULAR IN STREAMING & ENTERTAINMENTCable vs. StreamingWhat to Know Before Buying a Smart TVThe Best TV Streaming Services to TryWhere to Watch Free Movies OnlineThe Best Free Music Streaming SitesAll Streaming How To’s HOW TO Phones Computers Smart & Connected Life Streaming Gaming Social Media Software & Apps Home Theater Internet & Security Email & Messaging POPULAR IN PHONES & CONNECTIONS iPhone v. Android: Which Is Best For You? Before You Buy an Unlocked Smartphone The Best Apps for Your Phone How to Check Your Data Usage How to Create Group Chat Names All Phone How To’s POPULAR IN COMPUTERS & INTERNET 5 Things to Do With a New Computer The Best Ways to Speed Up Your Computer How to Network a Printer 5 Ways to Back up Your Data How to Choose a Computer Monitor All Computer How To’s POPULAR IN STREAMING & ENTERTAINMENT Cable vs. Streaming What to Know Before Buying a Smart TV The Best TV Streaming Services to Try Where to Watch Free Movies Online The Best Free Music Streaming Sites All Streaming How To’s HOW TO Phones Computers Smart & Connected Life Streaming Gaming Social Media Software & Apps Home Theater Internet & Security Email & Messaging POPULAR IN PHONES & CONNECTIONS iPhone v. Android: Which Is Best For You? Before You Buy an Unlocked Smartphone The Best Apps for Your Phone How to Check Your Data Usage How to Create Group Chat Names All Phone How To’s POPULAR IN COMPUTERS & INTERNET 5 Things to Do With a New Computer The Best Ways to Speed Up Your Computer How to Network a Printer 5 Ways to Back up Your Data How to Choose a Computer Monitor All Computer How To’s POPULAR IN STREAMING & ENTERTAINMENT Cable vs. Streaming What to Know Before Buying a Smart TV The Best TV Streaming Services to Try Where to Watch Free Movies Online The Best Free Music Streaming Sites All Streaming How To’s FEATURESSPECIAL TOPICSAI & ScienceHome Office CentralFamily Tech TipsWomen in GamingUp & Coming Tech LeadersEco-friendly TechnologyTraveling With TechWhat to Watch: TV, Movies, & MoreConnected Car TechHome Entertainment SPECIAL TOPICS AI & Science Home Office Central Family Tech Tips Women in Gaming Up & Coming Tech Leaders Eco-friendly Technology Traveling With Tech What to Watch: TV, Movies, & More Connected Car Tech Home Entertainment SPECIAL TOPICS AI & Science Home Office Central Family Tech Tips Women in Gaming Up & Coming Tech Leaders Eco-friendly Technology Traveling With Tech What to Watch: TV, Movies, & More Connected Car Tech Home Entertainment ABOUT USAbout UsOur ExpertsTechnology Review BoardProduct Review GuidelinesHow-To GuidelinessContact Us About Us Our Experts Technology Review Board Product Review Guidelines How-To Guideliness Contact Us About Us Our Experts Technology Review Board Product Review Guidelines How-To Guideliness Contact Us Hit Refresh on Your Tech NewsGet tech's top stories in 30 seconds:Subscribe Get tech's top stories in 30 seconds: Get tech's top stories in 30 seconds: 1How to Actually Get Your Hands On A Nintendo Switch 2 2If He Says “Don’t Get Me Anything,” Get Him One of These 3Your iPad’s Getting Four New Apps That Used to Be Mac-Only 4Editor's Choice: Tech Gifts for Dad That’ll Make Him Say, ‘Wow, You Nailed It!’ 5The Best Thing About AI? It Still Needs You to Make It Work Software & Apps> Windows> **The First 5 Things You Should Do With Your New Computer** Important first steps include installing available updates and a file recovery program Emporia State University Update Antimalware Install Windows Updates Set Up File Recovery Set Up Online Backups Uninstall Unwanted Programs Frequently Asked Questions As compelling as it is to jump right into using your new computer, there are a few things you need to do first when setting it up. No matter if it's a snazzy new Microsoft Surface Book, some otherWindows 11laptop, or a traditional desktop computer...don't worry about your computer skills or where specific keyboard keys are. Instead, here are five things to address before you do anything else: Have a laptop or tablet instead? Yourfirst steps look a little different. **Update Your Antimalware Program** The last thing you want to do is get your new computer infected with malware. Who wants that? We considered calling this \"install anantimalware program\" but almost all computers come with one preinstalled. Windows has Microsoft's own built-in tool, so most PCs are ready to go. Here's the thing, though: It won't be updated. Probably not, anyway. So, after setting it up, head to the scanner's settings and update the \"definitions\"—the instructions that teach the program how to identify and remove new viruses, Trojans, worms, etc. As mentioned above, new Windows computers typically have basic antivirus protection, but it's not the best. There are plenty ofantivirus programs for Windowsthat you can get for free; you can alsoremove viruses on your Mac. **Install Available Windows Updates** Yes, you'd think yourbrand-newcomputer would be fully updated, but chances are it won't be. Microsoft releases security and non-security updates to Windows on at least a monthly basis, oftentimes more frequently than that! SeeHow to Install Windows Updatesif you've never done this and need help. TheWindows Updatetool is preconfigured to download and install updates automatically. While this is generally a good thing, it can be a bit overwhelming of a thing to happen in the background during the first few hours of using your new computer. Fortunately, it's easy tochange Windows Update settings—this is something we usually recommend people do. Windows Update might installdriverupdates for you, too, which are needed for yourhardwareto work properly. However, Microsoft only provides basic drivers forsomehardware, and will not install a driver for some gaming mice,USBmicrophones, and other devices you might plug into your new computer, like a webcam, drawing tablet, etc. Fortunately, there are several options when it comes to using afree driver updater tool, which is a program that can check for missing or outdated drivers and, oftentimes, download and install them for you, sometimes even automatically. Keep one of those programs on your computer to make sure you always have quick access to these updates. They're especially helpful if yournetwork adapterdoesn't work and you need a network driver but don't have an internet connection. This might be a scenario if you'veinstalled Windows manually. **Install a File Recovery Program** This one might surprise you. Why install a program to helprecover accidentally deleted filesif you haven't even used your computer yet, let alone lost something? Here's why: The big catch-22 about file recovery programs is that you're better off installing one before you actually need it. Waiting until the file has been deleted to install the program, might overwrite that same space on thehard drivewhere your deleted file is sitting, preventing you from undeleting it. That's not a risk you want to take. See ourFree File Recovery Software Programslist for a number of excellent and completely free undelete tools. Just install one and forget it. If you need it in the future, it'll be there. **Sign Up for an Online Backup Service** Yep, another proactive step here, one you'll be thanking us for someday. Online backup services are combination software tools and subscription services that automatically keep what data you want to be protected on secure servers away from your home or business. Anonline backup serviceis the best and most cost-effective long term solution to keeping your data safe. The better-rated ones in our list are inexpensive, let you back up as much as you want, and are really easy to download and install. However, if buying a new computer is the last big purchase you want to make for a while, consider using afree backup serviceor, at the very least, alocal backup tool. **Uninstall Programs You Don't Want** You may already have noticed that your computer came with a lot of...well, let's just say \"extra\" software. In theory, leaving these programs installed won't hurt much if anything, aside from taking up a bit of hard drive space. In reality, many of these preinstalled programs run in the background, hogging upmemoryandprocessorpower that you'd rather use for other things. Our advice? Head into Settings ofControl Panel, depending on your Windows version, anduninstall those programs. An easier option, if you'd like, is to use a dedicated uninstaller program for just this purpose. They're calleduninstallers, andwe've reviewed a number of them. **FAQ** How do I transfer files to a new computer?If you're replacing an older computer, the two easiest ways to move files between them are via backups or with an external drive. For example, you can restore a new Mac from aTime Machine backupof the old one; PCs have the similarFile History feature. Alternatively, put files from your old computer to a hard drive, and then connect it to the new one and move them over. If you're replacing an older computer, the two easiest ways to move files between them are via backups or with an external drive. For example, you can restore a new Mac from aTime Machine backupof the old one; PCs have the similarFile History feature. Alternatively, put files from your old computer to a hard drive, and then connect it to the new one and move them over. If you're replacing an older computer, the two easiest ways to move files between them are via backups or with an external drive. For example, you can restore a new Mac from aTime Machine backupof the old one; PCs have the similarFile History feature. Alternatively, put files from your old computer to a hard drive, and then connect it to the new one and move them over. How do I move software licenses to a new computer?Generally, you'll install the software on your new Mac or PC, and then sign in with your credentials. In some cases, like when your license can only be used on a certain number of devices, you'll need to remove the authorization from the old one before you can add the new one. Generally, you'll install the software on your new Mac or PC, and then sign in with your credentials. In some cases, like when your license can only be used on a certain number of devices, you'll need to remove the authorization from the old one before you can add the new one. Generally, you'll install the software on your new Mac or PC, and then sign in with your credentials. In some cases, like when your license can only be used on a certain number of devices, you'll need to remove the authorization from the old one before you can add the new one. Get the Latest Tech News Delivered Every Day How to Clean Install Windows (Delete & Reinstall) What to Do When Windows 10 Settings Are Not Working How to Check the Current BIOS Version on Your Computer I Forgot My Windows 8 Password! What Are My Options? How to Fix a Computer That Makes a High-Pitched Noise 5 Reasons to Stick With Windows Vista 8 Things You Should Never Do on Evernote 12 Ways to Destroy Your Computer How to Fix 'This Copy of Windows Is Not Genuine' Errors Building vs. Buying a PC: Which One Is Right For You? Reset This PC: A Complete Walkthrough How to Troubleshoot Beep Codes How Often Should You Defrag Your Computer? What to Do If You Forgot Your Windows Vista Password How to Test Your Computer's CPU Temperature Speed Up Your Computer: Essential Tips for a Faster PC Experience Hit Refresh on Your Tech News NEWS WHAT TO BUY HOW TO FEATURES ABOUT US About Us Privacy Policy Editorial Guidelines Terms of Service Careers Advertise Contact Your Privacy Choices"}