{"id": 1593, "name": "WKBW - Buffalo News", "domain": "wkbw.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wkbw.com/news/local-news/southern-tier/students-were-crying-cassadaga-job-corps-centers-future-in-jeopardy-following-department-of-labor-decision", "title": "Students Were Crying Cassadaga Job Corps Centers Future In Jeopardy Following Department Of Labor Decision", "content": "Menu NewsLocal News7 News I Team7 Problem SolversOur 716America ForwardEntertainmentWKBW Live StreamNews Tips Local News 7 News I Team 7 Problem Solvers Our 716 America Forward Entertainment WKBW Live Stream News Tips Local News 7 News I Team 7 Problem Solvers Our 716 America Forward Entertainment WKBW Live Stream News Tips Weather7 Super DopplerDaily ForecastHourly ForecastSevere Weather AlertsClosings and DelaysTraffic 7 Super Doppler Daily Forecast Hourly Forecast Severe Weather Alerts Closings and Delays Traffic 7 Super Doppler Daily Forecast Hourly Forecast Severe Weather Alerts Closings and Delays Traffic SportsBuffalo BillsBuffalo SabresSuper 7High SchoolCollege Buffalo Bills Buffalo Sabres Super 7 High School College Buffalo Bills Buffalo Sabres Super 7 High School College 7LifeMr. FoodSuper Savings on 7 Mr. Food Super Savings on 7 Mr. Food Super Savings on 7 Special SectionsLifestyle7 things to do in WNYYour Health MattersDont Waste Your MoneyContests Lifestyle 7 things to do in WNY Your Health Matters Dont Waste Your Money Contests Lifestyle 7 things to do in WNY Your Health Matters Dont Waste Your Money Contests About UsAdvertise With UsWKBW StaffMobile and Streaming AppsTV ListingsWKBW HistoryContact UsContests Advertise With Us WKBW Staff Mobile and Streaming Apps TV Listings WKBW History Contact Us Contests Advertise With Us WKBW Staff Mobile and Streaming Apps TV Listings WKBW History Contact Us Contests Contests Advertise With Us Sign In Newsletters Sign Out Manage Emails Apps Careers Search 7 News I Team Local News Buffalo Genesee Wyoming Niagara Orleans Northtowns Southtowns Southern Tier Making Ends Meet National News News Tips **Actions** Facebook Tweet Email **'Students were crying': Cassadaga Job Corps Center’s future in jeopardy following Department of Labor decision** CASSADAGA, N.Y. (WKBW) — The U.S. Department of Labor could shut down the Job Corps by the end of the month. The nationwide program is for low-income 16-to-24-year-olds to obtain free housing, food and job training. This decision would include the Cassadaga location in Chautauqua County and the Iroquois Job Corps in Medina. The Department of Labor is on the verge of closing the Job Corps, which has been in existence for more than 50 years, at the end of June. The Department said the Job Corps operated in a $140 million deficit during the last fiscal year, had multiple incidents of sexual assault, physical violence, and drug use, and had an average graduation rate of under 39%. However, the National Job Corps Association said the incident numbers are misleading, including things such as power outages, inclement weather and athletic injuries. The association also said that graduation rates have historically been above 60%, and I’m told in Cassadaga, their graduation rates are closer to 80%. Students and staff in Cassadaga told me it’s been a heartbreaking time, as they try to plan for the future. “I was just thinking about how much opportunity was ripped away from me,\"a student from Buffalo studying to be an electrician said. \"Put yourself in this position. You don’t want somebody to take away your home, your food, your money, or your support system.” “It put us in a position where we felt like the rug was pulled up from underneath us,\"a student from Brooklyn studying to become a Certified Nursing Assistant said. \"I would even say it’s kind of like being given an eviction notice, but instead of three months or thirty days, you’ve been given a week or two... believe Job Corps unlocked something in me that I didn’t know I had.” “It was very sad, I was crying, a lot of students were crying,\"a student from Queens studying to become a Certified Nursing Assistant said. \"It’s some people’s last chance at a second shot at life... It’s a really good program with a lot of good people and good resources.” “It kind of seems silly to me, and I’d think other people, to deny these services that are making these students self-sufficient,\"reading teacher Trisha Lockwood said. \"If we get rid of these services, where are these kids going to get these services?” U.S. District Judge Andrew Carter of New York issued a temporary restraining order that lasts through June 17. The order prohibits the Department from terminating jobs, removing students from the 99 contractor-run centers across the country or eliminating the Job Corps program without congressional authorization. **A Voice For Everyone** We want to hear what’s going on in your community. Share your voice and hear from your neighbors. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **Stay connected by downloading the WKBW app** **Stay connected by downloading the WKBW app** Local News Sports 7 News I Team Weather Advertise With Us Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact wkbwtv wkbw wkbw"}