{"id": 2239, "name": "The Science Post", "domain": "thesciencepost.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://thesciencepost.com/crazy-mom-still-decides-to-vaccinate-her-daughter-even-after-being-shown-multiple-anti-vaccine-memes/", "title": "Crazy Mom Still Decides To Vaccinate Her Daughter Even After Being Shown Multiple Anti Vaccine Memes", "content": "**Moderna scientists reportedly struggling to add microchips to latest boosters** Pandemic Flu DKD Senate Home Contact Buy a Beer News Vaccines Big Pharma Alt Med MoreConspiracyFood&ScienceSpace Conspiracy Food&Science Space Conspiracy Food&Science Space Support Contact Home Contact Buy a Beer Vaccines **Crazy mom still decides to vaccinate her daughter even after being shown multiple anti-vaccine memes** Local mom Katie Smith, 32, shocked everyone when she announced she was taking her daughter to get her childhood vaccines. This after being shown upwards of 10 anti-vaccine memes on both Facebook and Twitter. “I shared some of our best stuff with her and she still wouldn’t wake up,” said anti-vaccer Rebecca Johnson. “I mean they were really, really good: stats taken out of context, results of anti-vaccine low quality studies, multiple anecdotes, everything. She must be crazy or something.” Katie said she saw most of the memes that were sent to her, but after a quick check on some medical websites and a chat with a healthcare professional she decided the memes were full of shit. “The memes actually didn’t make much sense,” explained Katie. “They were trying to say that the vaccines are worse than the diseases kids can get? Something like that.” Anti-vaccers often attempt to get new moms into their cult by using various methods, the most common of which is misleading and false facts put over pictures of screaming kids. “Some of our best work is done when we find a picture of a child who has died and claim they died of a vaccine injury. Sure, the parents of the child get angry but we are really doing them a favor,” claims Johnson. “If a child dies, and has ever had a vaccine in their lifetime (or their mother got a vaccine while pregnant), it was vaccines that killed them. FACT.” **SP Team** Evil doktor, pharma shill, vaccine chemist, Monsanto spokesperson, GMO lobbyist, chemtrail deployer and false flag organizer. Moderna scientists reportedly struggling to add microchips to latest b...289 Shares Thanks for subscribing! Moderna scientists reportedly struggling to add microchips to latest boosters Thousands rush to exchange online medical degree for Google PhD in foreign policy Wearing a mask may help protect against deadly chemtrails, new study finds Scientist disappointed to learn grad school was a waste of money FDA gives full approval to Pfizer vaccine, anti-vaccers move goalposts in record speed Alt Med Big Pharma Conspiracy Food Science News Space Vaccines Home Contact Buy a Beer"}