{"id": 1430, "name": "The Solutions Project", "domain": "thesolutionsproject.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thesolutionsproject.org/what-we-do/inspiring-action/climate-curious-web-series/", "title": "Climate Curious Web Series", "content": "What We DoGrantmakingGrantmaking InfrastructureJustice + EquityGrant FAQsGrantee SupportBuild Media CapacityCommunity ResilienceInspiring ActionCampaigns & EventsClean Energy in the MediaClimate Curious Web Series100% Renewable Energy VisionOur Impact2024 Impact Report2023 Impact Report2022 Impact Report2021 Impact Report2020 Impact Report2019 Impact Report GrantmakingGrantmaking InfrastructureJustice + EquityGrant FAQs Grantmaking Infrastructure Justice + Equity Grant FAQs Grantee SupportBuild Media CapacityCommunity Resilience Build Media Capacity Community Resilience Inspiring ActionCampaigns & EventsClean Energy in the MediaClimate Curious Web Series100% Renewable Energy Vision Campaigns & Events Clean Energy in the Media Climate Curious Web Series 100% Renewable Energy Vision Our Impact2024 Impact Report2023 Impact Report2022 Impact Report2021 Impact Report2020 Impact Report2019 Impact Report 2024 Impact Report 2023 Impact Report 2022 Impact Report 2021 Impact Report 2020 Impact Report 2019 Impact Report GrantmakingGrantmaking InfrastructureJustice + EquityGrant FAQs Grantmaking Infrastructure Justice + Equity Grant FAQs Grantmaking Infrastructure Justice + Equity Grant FAQs Grantee SupportBuild Media CapacityCommunity Resilience Build Media Capacity Community Resilience Build Media Capacity Community Resilience Inspiring ActionCampaigns & EventsClean Energy in the MediaClimate Curious Web Series100% Renewable Energy Vision Campaigns & Events Clean Energy in the Media Climate Curious Web Series 100% Renewable Energy Vision Campaigns & Events Clean Energy in the Media Climate Curious Web Series 100% Renewable Energy Vision Our Impact2024 Impact Report2023 Impact Report2022 Impact Report2021 Impact Report2020 Impact Report2019 Impact Report 2024 Impact Report 2023 Impact Report 2022 Impact Report 2021 Impact Report 2020 Impact Report 2019 Impact Report 2024 Impact Report 2023 Impact Report 2022 Impact Report 2021 Impact Report 2020 Impact Report 2019 Impact Report Our Grantee PartnersMeet Our GranteesStorybankCase Studies Meet Our Grantees Storybank Case Studies Meet Our Grantees Storybank Case Studies Who We AreOur ValuesOur StoryOur TeamGloria Walton, President & CEOOur FundersBlog Our ValuesOur Story Our Story Our TeamGloria Walton, President & CEO Gloria Walton, President & CEO Our Funders Blog Our ValuesOur Story Our Story Our Story Our TeamGloria Walton, President & CEO Gloria Walton, President & CEO Gloria Walton, President & CEO Our Funders Blog KEYWORD SEARCH **Climate Curious Web Series** Real talk about climate change **Learn about real solutions to save our planet** Communities of color are disproportionately affected by climate change, air pollution, and health disparities due to generations of systemic racism and injustice. In this web series, we dive into the latest headlines affecting our communities and the planet, introduce you to frontline leaders, and sometimes feature special celebrity guests. Our goal is to radically transform the conversations we have about climate change so we can learn more from each other and talk about the solutions already here to save our environment, and have a little fun along the way! Season 1 available now. ASL interpretation is provided for each show. Our Food + Our BodiesDiana Tellefson Torres and Chris Newman connect on where and how food comes from farms to our table and how people can support farmers. **Our Food + Our Bodies** **Our Food + Our Bodies** **Our Food + Our Bodies** Our Soulful Nature + The EarthDon Cheadle, Angelou Ezelio, and Rue Mapp talk about why nature is critical to our humanity, the importance of environmental education, and that time Don got chased by a rhino. **Our Soulful Nature + The Earth** **Our Soulful Nature + The Earth** **Our Soulful Nature + The Earth** Green New DealLily Gardner, Kristal Hansley, and Miya Yoshitani talk about the impact the Green New Deal has on communities of color in California, solar energy & accessibility, and the power we all hold to make change. **Green New Deal** **Green New Deal** **Green New Deal** Media Portal Work With Us Contact Us Privacy We need everyone to solve the climate crisis - and that means the future is also in your hands! Your donation boosts the efforts of people already delivering climate solutions in neighborhoods all across the country. We’ll keep you updated on the latest projects, events, and solutions that are working to make life better, for everyone. **Subscribe to Our Mailing List** Contact Information 4096 Piedmont Avenue #728, Oakland CA 94611 ©2025 The Solutions ProjectWebsite byWire Media"}