{"id": 931, "name": "Moultrie Observer", "domain": "moultrieobserver.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://moultrieobserver.com/2025/06/09/georgia-gop-delegates-keep-chairman-despite-grievances-ahead-of-a-big-election-year/", "title": "Georgia Gop Delegates Keep Chairman Despite Grievances Ahead Of A Big Election Year", "content": "Home Subscriptions Newsletter Signup E-Edition News Obituaries SportsLocal SportsState SportsNational Sports Local Sports State Sports National Sports Local Sports State Sports National Sports OpinionEditorialsColumnsLetters to the Editor Editorials Columns Letters to the Editor Editorials Columns Letters to the Editor ContestsBest of Moultrie Best of Moultrie Best of Moultrie CommunityBirthsEngagementsWeddingsAnniversaries Births Engagements Weddings Anniversaries Births Engagements Weddings Anniversaries ClassifiedsJobsLocal Public NoticesGeorgia Public Notices Jobs Local Public Notices Georgia Public Notices Jobs Local Public Notices Georgia Public Notices ServicesContact UsAbout Us Contact Us About Us Contact Us About Us Home News Sports Obituaries Opinion Community Classifieds Notices E-Edition ContestsBest of Moultrie Best of Moultrie Best of Moultrie **Georgia GOP delegates keep chairman despite grievances ahead of a big election year** Published 9:39 am Monday, June 9, 2025 By Ty Tagami, Capitol Beat News Service DALTON – By the time nearly 1,700 Republican delegates were driving away from their annual state convention, a vigorous storm had descended on Dalton, rocking cars, dislodging a glass door at the convention center entry and tearing a flag off one of the poles outside. Party stalwarts fear another kind of storm could tear at GOP unity as a momentous election year approaches. But despite some discontent, the delegates voted overwhelmingly to re-elect Josh McKoon as their chairman. Otherwise, nothing earth-shaking happened. A resolution to bar Secretary of State Brad Raffensperger running as a Republican did pass, but McKoon later said it was probably not legally enforceable. **Email newsletter signup** And no one unexpectedly declared their candidacy for the U.S. Senate or for the smorgasbord of other seats that have opened up, or appear to possibly be open, as the incumbents either launch or consider a run for higher office. Up for grabs next year are the governor’s office, the attorney general’s office, and probably the office of lieutenant governor. The national Republican Party is also targeting the Senate seat now occupied by Democrat Jon Ossoff. In Ossoff, the delegates found a unifying cause, with leaders labeling him a liberal extremist and, in the words of U.S. Rep. Marjorie Taylor Greene, R-Rome, a “spoiled brat.” Greene was allotted more time than anyone else, talking for about 40 minutes to close out the speeches Saturday before candidates for party office took the stage. Greene has ruled out a run for Ossoff’s seat but when asked in an interview if she was considering a run for governor next year, the final year for term-limited Republican Brian Kemp, Greene said she is “always keeping my options open.” She said she needs to consult with family, friends and supporters, “so I don’t have a time frame, but it is something I will think through.” Others said to be considering higher office, including Lt. Gov. Burt Jones, the Republican who presides over the state Senate, and members of Congress besides Greene, also spoke without revealing their plans. This election year is the quiet one before next year’s storm. The only major race is for two seats on the state Public Service Commission (PSC), Georgia’s Republican-led utility regulator. Both Tim Echols, one of the GOP incumbents, and Republican challenger Lee Muns fretted over turnout during this early voting period before the June 17 primary. “I don’t want to start this convention off being a Debbie Downer, but I’m having trouble getting my own relatives to go to the polls,” Echols said to a small crowd as the convention got underway Friday afternoon. Ideological purity was a through-line of the convention, with assertions of loyalty to President Donald Trump, opposition to everything transgender (God made only two genders), support for Israel, opposition to the state income tax and a commitment to energy dominance. “The very first words that God spoke to us in his word is, ‘Let there be light,'” said Tricia Pridemore, who serves on the PSC. “Think about that.” John King, the elected state insurance and safety fire commissioner who is running in the GOP primary for Ossoff’s Senate seat, said on Friday that Trump had sent him to secure the border with Mexico when he was a major general in the U.S. Army National Guard, a role he retired from two years ago. U.S. Rep. Buddy Carter, R-St. Simons, the first elected official to announce for Ossoff’s seat, praised Trump and his energy policy while criticizing Ossoff for his positions on immigration, transgender policy and Israel. Another potential candidate for that Senate seat, U.S. Rep. Michael Collins, R-Jackson, said in an interview that he was not close to deciding on a run. But his speech on stage Saturday was preceded by a recording of hip hop music overlaid with Trump’s voice, and he wore a white ball cap that said, “Gulf of America.” “Like God, we’ve got Donald Trump’s back, and we are going to continue to make America great,” Collins said. He asserted Georgia is a “red” state, adding, “We’re going to send that trust fund boy Ossoff home, and we’re going to put us a solid conservative in that seat.” No declared candidate for governor spoke, although Jones talked about state Senate passage of conservative legislation under his watch, and he shared an anecdote about Trump answering his phone calls within a ring or two. Attorney General Chris Carr, who has announced he is running for governor, did not speak, though he did hold a rally at a nearby pizza spot Friday. There were also candidates up on stage, both announced and presumed, for the seats currently held by Jones and Carr. John F. Kennedy, a Republican state senator from Macon, said he was running for Jones’ lieutenant governor seat even though Jones has not yet announced he’s leaving it to run for governor. Kennedy, the Senate president pro tempore, had tipped his hand a couple of weeks ago by registering to raise money to campaign for the office, as had Sen. Blake Tillery, R-Vidalia. Tillery spoke about his unsuccessful bill that targeted “debanking” but didn’t openly declare he was running for lieutenant governor. Sen. Steve Gooch, R-Dahlonega, who declared for Jones’ seat in mid-May, claimed credit for creating an “America First” car tag for Georgia. “We need to defend the America-First agenda that President Trump ignited,” the Senate majority leader said. (Both Kennedy and Tillery co-sponsored the bill, which Kemp signed into law). Gooch also said it is time to eliminate Georgia’s state income tax. Greene said Georgia should eliminate the income tax, too, and she said the state should deal with homelessness by reopening mental hospitals. Greene also acknowledged “a little bit of a quarrel going on,” which would later manifest in booing when party leaders announced that the voting to select the chairman and other party leadership positions would be conducted with electronic “clickers” rather than the paper ballots prepared by a contingent in orange vests. “This convention has been rigged,” said Norine Cantor, a candidate for second vice chair, who said the party lacked morals and values. When Kylie Kremer, a candidate for another leadership post, said the way the party was being run was a “disgrace,” many in the crowd roared their approval. “You guys have no idea what a functioning party looks like because this is all you know,” she added. Neither won a place in party leadership. McKoon handily won re-election, taking nearly 64% of the 1,666 votes clicked for the chairmanship. After the convention, he said paper ballots would have been too slow, though he said the state has the resources to pull off an election with paper. McKoon shrugged off the controversy. “I really appreciate the confidence of the delegates here in Dalton,” he said. “To win by a two-to-one margin is really pretty humbling.” **You Might Like** **Tax Assessors ask County Commission for electronic tablets in lieu of more staff** **Tax Assessors ask County Commission for electronic tablets in lieu of more staff** **The Class of 2025 Valedictorian is Newman and Autrey is Salutatorian** **The Class of 2025 Valedictorian is Newman and Autrey is Salutatorian** **Georgia Department of Agriculture Law Enforcement seeks additional victims in cattle theft fraud scam** **Georgia Department of Agriculture Law Enforcement seeks additional victims in cattle theft fraud scam** **United Way campaign sparks friendly competition and pig kissing** **United Way campaign sparks friendly competition and pig kissing** Home News Community Obituaries Sports Opinion Newsletter Signup e-Edition Subscriptions Classifieds Jobs Georgia Public Notices About Us Contact Us"}