{"id": 1393, "name": "The Libertarian Republic", "domain": "thelibertarianrepublic.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://thelibertarianrepublic.com/maine-governor-janet-mills-refuses-to-comply-with-trumps-executive-order-a-blow-to-mainers/", "title": "Maine Governor Janet Mills Refuses To Comply With Trumps Executive Order A Blow To Mainers", "content": "Headline News Shop OpinionsExpandEconomics of LibertyGov’t IncompetenceAbuse of Authority Economics of Liberty Gov’t Incompetence Abuse of Authority Economics of Liberty Gov’t Incompetence Abuse of Authority Free StyleExpandTech FreedomThe War on DrugsEducationPop CulturePolitical CorrectnessRecommended Tech Freedom The War on Drugs Education Pop Culture Political Correctness Recommended Tech Freedom The War on Drugs Education Pop Culture Political Correctness Recommended Missouri Liberty AboutExpandContact UsPrivacy Policy Contact Us Privacy Policy Contact Us Privacy Policy **Maine Governor Janet Mills Refuses to Comply with Trump’s Executive Order: A Blow to Mainers?** by Jenna Obie Maine Governor Janet Mills is once again at the center of controversy, this time for refusing to comply with an executive order issued by President Donald Trump. While some have hailed her defiance as an act of political courage, many Mainers see it as yet another example of her disregard for the people she was elected to serve. **A Pattern of Overreach and Hypocrisy** Throughout her tenure, Mills has been accused of prioritizing her own political agenda over the needs of Maine’s citizens. Her track record includes secret meetings, alleged misuse of public funds, and controversial decisions that have left many questioning her integrity. Critics allege that she has “lined her pockets with taxpayer money” while failing to address key issues such as homelessness, healthcare, and education. Her administration’s policies during the COVID-19 pandemic also drew sharp criticism. Families faced harsh consequences for noncompliance with state mandates, including children being expelled from school for refusing to wear masks. Healthcare workers were forced to choose between complying with state-imposed vaccine mandates or losing their jobs. Now, Maine’s healthcare system is struggling, with hospitals closing and providers leaving as a result of these policies. **Refusing Federal Law While Using Taxpayer Money to Fight It** Fast forward to today, and Mills is taking a hard stance against Trump’s executive order, which mandates compliance with federal law or risks losing funding. While she has no issue forcing Mainers to comply with her policies, she now refuses to abide by federal law—despite bipartisan support for Trump’s order within the state. Adding insult to injury, she plans to use taxpayer money to challenge the federal government in court. Many see this as blatant hypocrisy. If any ordinary worker ignored the directives of their employer, they would face consequences or even be fired. Yet Mills continues to act with impunity, leaving Mainers to bear the financial burden of her decisions. **Questions Mainers Deserve Answers To** This battle with the federal government has also raised pressing concerns about the state’s financial management. Where has the federal funding for essential services gone? Mainers are demanding accountability for: Federal money allocated for homelessness assistance Funding designated for veterans’ services Resources for substance abuse treatment Investments in schools and education The lack of healthcare providers and the financial distress of MaineCare These issues continue to plague Maine, yet the governor seems more focused on fighting political battles than addressing the needs of her constituents. **A Call for Justice and Transparency** With Mills’ defiance now drawing national attention, some see a silver lining: Maine is now on the federal government’s radar. Calls for an investigation into the state’s mismanagement of funds are growing, and many hope the Department of Justice will step in to uncover the truth. At the end of the day, this is not about defying Trump—it’s about the well-being of Mainers. People are suffering, and it’s time for accountability. Mills’ refusal to comply with federal law is not an act of bravery; it is an act of negligence. Mainers deserve better, and they deserve answers. **Post navigation** **Similar Posts** **Held Hostage By Hackers, North Carolina County Refuses To Pay Ransom** LISTEN TO TLR’S LATEST PODCAST: Anders Hagstrom A North Carolina county fended off a second wave of “ransomware” attacks Thursday after the county government refused to pay the hackers $23,000 to regain nearly 50 computers. Mecklenburg County was hit with an initial phishing attack Tuesday, infecting 48 of the county’s roughly 500 computers. County Manager… Read MoreHeld Hostage By Hackers, North Carolina County Refuses To Pay RansomContinue **Lindsey Graham Wants FBI Briefing On Roger Stone Raid** Chuck Ross Senate Judiciary Committee Chairman Lindsey Graham is requesting an FBI briefing about the circumstances of a pre-dawn raid of Trump confidant Roger Stone’s home in Florida last Friday. “I am concerned about the manner in which the arrest was effectuated, especially the number of agents involved, the tactics employed, the timing of the… Read MoreLindsey Graham Wants FBI Briefing On Roger Stone RaidContinue **Al-Qaida Calls For ‘Easy And Simple’ Attacks In The West** LISTEN TO TLR’S LATEST PODCAST: By Russ Read The leader of al-Qaida in the Arabian Peninsula (AQAP) called upon followers in the West to engage in “easy and simple” terrorist attacks in a video address Sunday. Qasim al-Raymi’s address pushed for fellow jihadists to view themselves as part of a standing army in a global fight,… Read MoreAl-Qaida Calls For ‘Easy And Simple’ Attacks In The WestContinue **20 for 20, Part 5: You Are Not Your Stump Speech** 20 for 20, Parts 1-4 linked below. You’ve come a long way, baby. But we’re not done yet. Today we’re discussing your favorite topic — you. You’re in the spotlight. But you can’t use Instagram filters or FUPA-slimming camera angles for this close-up. Can you allow yourself to feel exposed? Good. Doors are locked. Blinds… Read More20 for 20, Part 5: You Are Not Your Stump SpeechContinue **West Virginia Special Needs Teachers on Paid Leave After Horrifying Classroom Recording** Disturbing audio from a special education classroom in Berkeley County, West Virginia is raising several questions about the conduct of the teachers in the classroom. Instructor #1: “I ought to back hand you right in your teeth. How is that for anxiety?” According to Amber Pack, the mother of an eight year old special needs… Read MoreWest Virginia Special Needs Teachers on Paid Leave After Horrifying Classroom RecordingContinue **Watch Steven Crowder’s Epic Takedown of Leftist Protesters** Steven Crowder pulled no punches when taking on protesters at the University of Massachusetts. by Joey Clark This week comedian and conservative activist Steven Crowder, joined Milo Yiannopolous and Christina Hoff Sommers for a panel discussion regarding the “political correctness” of the regressive left. The event was called “The Triggering,” and what transpired certainly lived up… Read MoreWatch Steven Crowder’s Epic Takedown of Leftist ProtestersContinue **Leave a Reply** You must belogged into post a comment. **Wake Up America Show!** **FTC Should Declare Victory and Leave** **How the Soft2Bet Foundation Is Transforming Lives and Communities** © 2025 - WordPress Theme byKadence WP Headline News Shop OpinionsToggle child menuExpandEconomics of LibertyGov’t IncompetenceAbuse of Authority Economics of Liberty Gov’t Incompetence Abuse of Authority Economics of Liberty Gov’t Incompetence Abuse of Authority Free StyleToggle child menuExpandTech FreedomThe War on DrugsEducationPop CulturePolitical CorrectnessRecommended Tech Freedom The War on Drugs Education Pop Culture Political Correctness Recommended Tech Freedom The War on Drugs Education Pop Culture Political Correctness Recommended Missouri Liberty AboutToggle child menuExpandContact UsPrivacy Policy Contact Us Privacy Policy Contact Us Privacy Policy"}