{"id": 2089, "name": "Pajiba", "domain": "pajiba.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.pajiba.com/celebrities_are_better_than_you/the-sean-combs-trial-has-become-yet-another-uncomfortable-true-crime-spectacle-.php#comments", "title": "The Sean Combs Trial Has Become Yet Another Uncomfortable True Crime Spectacle .php#comments", "content": "**The Sean Combs Trial Has Become Yet Another Uncomfortable True Crime Spectacle** **The Sean Combs Trial Has Become Yet Another Uncomfortable True Crime Spectacle** ByKayleigh Donaldson|Celebrity| June 6, 2025 Rapper and mogulSean Combs, perhaps better known by his array of rap names and monikers, is currently on trial for charges of racketeering, conspiracy, and sex trafficking. Combs was arrested last September. He has pleaded not guilty to all allegations. He could be sentenced to life in prison if convicted. The trial has become a massive news story worldwide, the subject of daily reporting and live blogs as well as endless social media speculation. The court proceedings are not being televised or streamed, but reporters are offering extensive updates on the trial. Every detail of the case has become fodder for a level of conspiratorial speculation and misogynistic fury that has, alas, become commonplace whenever a famous man is accused of sexual abuse or misconduct. Everything about the Combs trial is now akin to a true crime special and it’s bad for both justice and victims. And at the centre of this is Cassie Fine, the singer and former girlfriend of Combs, who wesaw on camerabeing aggressively beaten by him after she tried to escape his abuse. Fine had already sued Combs and settled with him after accusing him of rape and sex trafficking. Combs’ lawyer said the settlement was “in no way an admission of wrongdoing”, but that leaked video only confirmed what a hell of a lot of people already knew. One of the biggest open secrets in the music industry was undeniable. And yet Fine has become yet another cipher for the world’s fury against women (especially Black women) who dare to speak openly about the violence they’ve experienced. From the moment that Combs was sued by Fine, the floodgates were opened for what I can only describe as the contentification of abuse. TikTokers turned into amateur reporters, blogs printed speculation as truth, and especially grim details about Combs’ so-called “freak offs” became jokes for the masses. Franchesca Ramsey noted in a video how the Combs case was being treated like a Netflix series by some, a programme to react to and offer unsolicited hot takes on from afar. Certainly, every time I log onto Instagram or browse the internet for pop culture updates, I am besieged by #content that dissects, decontextualizes, and outright lies about Fine, Combs, and the trial. It’s all going far more viral than any of the real reporting on the case, as are the victim blaming screeds that wouldn’t sound of place in an Andrew Tate rant. It’s not simply that this trial has become a public spectacle to be plundered for content: it’s that this process is now so wearily familiar, yet nothing seems to change. A post shared by Franchesca Ramsey (@chescaleigh) It’s hard to read all the coverage of Combs’ trial, and the contentification of abuse, and not think of whatAmber Heardwent through. When she spoke out against her ex-husband, he wielded his immense wealth to publicly humiliate her through a kangaroo court case that was televised and turned into a cavalcade of misogynistic mockery. People made gifs of Heard crying as she recounted her trauma. They turned her pain into Etsy merchandise and TikTok memes. Unqualified losers rebranded themselves as “body language experts” to push woo-woo narrative against her under the guise of objectivity. It being live-streamed to the world allowed the press to present it as yet another frivolous celebrity story. The end result was a case that has set back victims’ rights by decades and a renewed hunger for public shame in the guise of justice. We saw this agony replicated withMegan thee Stallion, who was turned into a shady conspiracist through baseless speculation and garden variety misogynoir because she was a victim of a violent man. Halle Bailey’s dirtbag ex has wielded the power of his live-streamer audience to further attack her after she alleged abusive behaviour on his part, and plenty of creeps are giddy at the chance to harass her and her child. This attitude has extended to non-famous women, as evidenced by the glut of true crime documentaries and reaction videos wherein bad actors exaggerate their responses to the case of the day and brag about how they’d never find themselves in such a situation. The Combs case is notably bleak because of the sheer extent of the allegations and the picture they paint of a very powerful man forcing countless people into an orgiastic hell that wouldn’t look out of place in a horror movie. It suggests a kind of abuse so grand and cartoonish that it could only happen in Hollywood, and that any victim caught in this trap must have somehow invited it upon themselves. It’s an attitude not unlike what we saw with both the Harvey Weinstein and Jeffrey Epstein cases, where two rich men wielded their power like a whip to enforce a decades-old open secret of abuse. These cases give a lot of people, especially those who wilfully embrace their ignorance, fodder to push a contradictory narrative of victim blaming: one where abusers are inhuman monsters separate from the general populace and the women who suffered at their hands are partly to blame because they must have wanted wealth and fame. This all ignores a painful truth: that someone being abused by their spouse is one of the most unsurprising things on the planet. It is so commonplace that one in four women and one in nine men have experienced it. Not only that but society has all but decriminalized it through a lack of legislative case, the misogyny and victim-blaming pushed by the police, and increasingly convoluted but potent anti-victim narratives that empower men to act as they please. The guy in the White House was found liable for rape. We have long moved past the brief spark of #MeToo and into an even darker age for victims, and it’s made all the worse by the ways in which the average person with a Wi-Fi connection and true crime addiction has begun to treat these court cases like their latest Netflix binge-watch. It’s not just that this has become content: it’s that it’s now a fandom. People are taking sides, forming fan theories, and aggressively policing the opinions of others, including journalists just trying to get the truth told. Amber Heard’s ex was grimly savvy in how his team managed to wield his decades’ old fanbase into a hate machine that eagerly played the roles of unpaid publicists and playground bullies. Tory Lanez, who is in jail for shooting a woman, has been accused of paying offa gossip YouTuberto spread lies about Megan thee Stallion to further paint her as the aggressor in this case. With Cassie Fine, a woman whose abuse is now available to watch on YouTube, the tinhatters have still worked overtime to make her a fandom villain, a Medea-esque schemer and “fallen woman” who is simultaneously not a real victim and too much of one. She’s talked about like she’s a soap opera character. Writing forThe Guardian, Tayo Bero detailed how these men’s fandoms have been encouraged to treat everything but especially abuse allegations like a target to be taken down. Wrote Bero, “The patriarchy demands loyalty and requires that its beneficiaries pay their dues in acts of hatred. That means that anyone who doesn’t join in the bullying or speaks up for women is automatically deemed a traitor and punished accordingly.” It’s no coincidence that stuff like this is being empowered amid the rise of the so-called manosphere and toxic influencers like Tate oversaturating online spaces, especially among boys and young men. Halle Bailey’s ex is a so-called rapper who is largely known for live-streaming his life, and he’s garnered a powerful fanbase eager to do his bidding through these channels. It’s well beyond parasocial and into cultishness. To once again quote Bero: “These are the children of the streaming age, a generation whose experience of fandom means being constantly and staunchly engaged with their favourite streamers - staying glued to their screens, watching every waking moment of these people’s lives.” When he lies about Bailey, these people, many of whom are scarily young, listen. I’ve talked before about my concerns with the trends aroundmodern true crime, particularly the ways in which blatant exploitation and journalistic malpractice have been culturally whitewashed through the aesthetic of prestige TV and legitimization offered through platforms like Netflix. It’s also tough to deny how true crime, now so popular and plentiful, is treated in such a cavalier manner by many of its most avid consumers. We get cutesy podcasts doing graphic breakdowns of brutal murders in-between ads for mattresses. Subreddits full of amateur detectives harass troubled and traumatized people in the name of exacting justice. The hunger for easy heroes and villains leads to memes and smears, as happened whenTiger Kingviewers turned an animal killer into a folk hero and the quirky big cat lover he wanted to have murdered into the “real villain.” Such dramas make it easy to fictionalize and provide distance from the terrors of violence and its long-term impacts. It makes people cheer on crooked cops and demonize neglected communities who don’t fit the easy mould of “real victims.” The focus on the wildest and most dramatic cases makes people hungry for bigger and weirder stakes in their true crime. Then they find the sad mundanities of the average person’s pain to be too boring. They have to zhuzh it up, add a few more “what if” and alternative realities to keep things interesting. It’s how we end up with decades of obviously nasty and sexist conspiracies over who killed John Lennon or Kurt Cobain, where the blame is largely laid at the feet of their wives. It’s how the idea of a rich bully with documented issues with alcohol and violence hurting his younger wife had to be spun into aGone Girl-esque anti-feminist fantasy. It’s how a heavily pregnant mother bravely taking the stand to testify against the man who beat her must be mutated into a schemer and liar, so that the story can continue. Conspiracies make for good stories. Humans are hard-wired to find a narrative amid the tangled and oft-uncontrollable ways our lives unfold. It becomes easier for us to believe the ludicrous and impossible over the depressing normalcy of power, pain, and control. Shadowy figures and deep state reveals make more narrative sense to us than confronting how often women will be beaten by their spouses. Well, that or it’s just too painful to admit that we as a society simply do not care about women, and that men have always been able to get away with doing whatever the hell they want. **Does the Latest Development in 'Doctor Who' Feel Like a Red Flag?** **Does the Latest Development in 'Doctor Who' Feel Like a Red Flag?** Comments require JavaScript to load. **The Phenomenal 'Dept. Q' Ending Explained: Who Kidnapped Merritt Lingard?** **The Phenomenal 'Dept. Q' Ending Explained: Who Kidnapped Merritt Lingard?** **The Sean Combs Trial Has Become Yet Another Uncomfortable True Crime Spectacle** **The Sean Combs Trial Has Become Yet Another Uncomfortable True Crime Spectacle** **Joshua Jackson’s Story About George Clooney Explains a Lot About Dr. Max** **Joshua Jackson’s Story About George Clooney Explains a Lot About Dr. Max** **It's Time for 'Criminal Minds: Evolution' to Cut Zach Gilford Loose** **It's Time for 'Criminal Minds: Evolution' to Cut Zach Gilford Loose** film tv politics news celeb social media pajiba love cbr about us privacy policy advertise"}