{"id": 61, "name": "Albert Lea Tribune", "domain": "albertleatribune.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.albertleatribune.com/2025/06/republican-gubernatorial-candidate-speaks-on-economy-education-and-reducing-crime-at-local-republicans-meeting/", "title": "Republican Gubernatorial Candidate Speaks On Economy Education And Reducing Crime At Local Republicans Meeting", "content": "Home NewsArts & CultureArts & Culture featuresArts & Culture columnsBirth AnnouncementsCampus NotesEngagementsWeddingsFaithOrganizationsCops, Courts & FiresEducationElections & CampaignsHealth UpdatesProgress 2025State & RegionalWeather Arts & CultureArts & Culture featuresArts & Culture columnsBirth AnnouncementsCampus NotesEngagementsWeddingsFaithOrganizations Arts & Culture features Arts & Culture columns Birth Announcements Campus Notes Engagements Weddings Faith Organizations Cops, Courts & Fires Education Elections & Campaigns Health Updates Progress 2025 State & Regional Weather Arts & CultureArts & Culture featuresArts & Culture columnsBirth AnnouncementsCampus NotesEngagementsWeddingsFaithOrganizations Arts & Culture features Arts & Culture columns Birth Announcements Campus Notes Engagements Weddings Faith Organizations Arts & Culture features Arts & Culture columns Birth Announcements Campus Notes Engagements Weddings Faith Organizations Cops, Courts & Fires Education Elections & Campaigns Health Updates Progress 2025 State & Regional Weather Sports OpinionEditorialsColumnsAl BattSarah StultzApril JeppsonGuest ColumnsLetters to the Editor Editorials ColumnsAl BattSarah StultzApril JeppsonGuest Columns Al Batt Sarah Stultz April Jeppson Guest Columns Letters to the Editor Editorials ColumnsAl BattSarah StultzApril JeppsonGuest Columns Al Batt Sarah Stultz April Jeppson Guest Columns Al Batt Sarah Stultz April Jeppson Guest Columns Letters to the Editor ObitsObituary Information And Guidelines Obituary Information And Guidelines Obituary Information And Guidelines ServicesAbout UsPoliciesAdvertise with UsNews TipPhotoSend a Videophoto order formSubmit a Letter to the EditorEngagement AnnouncementWedding AnnouncementSubscribeEmail Customer Service About Us Policies Advertise with Us News Tip Photo Send a Video photo order form Submit a Letter to the Editor Engagement Announcement Wedding Announcement Subscribe Email Customer Service About Us Policies Advertise with Us News Tip Photo Send a Video photo order form Submit a Letter to the Editor Engagement Announcement Wedding Announcement Subscribe Email Customer Service ContestsAlbert Lea Reader’s Choice Albert Lea Reader’s Choice Albert Lea Reader’s Choice Albert Lea Magazine Classifieds Public Notices E-Edition **Republican gubernatorial candidate speaks on economy, education and reducing crime at local Republicans meeting** Published 9:30 pm Monday, June 9, 2025 Byayannaeckblad Minnesota governor candidate Kendall Qualls on Monday spoke about revitalizing the state’s economy, reducing crime and providing a better quality of education at the Freeborn County Republicans monthly meeting at Edgewater Bay Pavilion. Qualls was originally going to be one of several speakers present at the meeting, but elected officials that were also scheduled were called to a special legislative session in St. Paul and were not able to attend. In his speech, Qualls covered why he is running for governor in the 2026 gubernatorial election and the three main topics he was running on. **Email newsletter signup** “People say, ‘Minnesota is far gone. We’re like California.’ We’re not. Minnesota is not a one-party state yet like California,” Qualls said. He continued by stating that although Democrats own the media, K-12 and higher education, they only have a one-seat majority in the Senate and a tie in the House. With the right candidate at the top of the ticket for governor, he said, the GOP could win the state governorship, House, Senate, attorney general and secretary of state positions. Qualls said he would like to restore Minnesota to its former glory. “Minnesota, if you think about it, if it was a company traded on the New York stock exchange, most people would have sold their stock by now,” he said. Qualls explained he served for five years in active duty before entering the private sector. He said a good leader can see an opportunity where others may only see a failing business. “I know because I’ve done this. I’ve worked on brands and turned it around.” Qualls said over the course of his campaign travels throughout the state, he has spoken to many people who have been forced to move from Minnesota to neighboring states because of Gov. Tim Walz’s policies. He added he plans to win the election by reaching swing voters without compromising values. Qualls outlined three main issues he would like to address as governor. The first issue was to cultivate a thriving economy by creating an environment with a low tax base in which communities can thrive. Everybody wants a thriving economy, he said. The second issue Qualls spoke about was how to increase safety in the state, specifically in metro areas like Minneapolis. He began by saying that Minneapolis rated highly in safety and quality of life by Forbes in 2009, but Walz since his election has turned the city into a war zone with a 45 percent increase in violent crime. “We can’t live in a great state without a great Minneapolis,” Qualls said. If he were to be elected governor, he said, he would begin by issuing a public apology to Minnesota law enforcement. The third topic Qualls spoke on was the need for a quality system of public education in Minnesota. “Whether you’re a Republican or a Democrat, everyone wants their children to have a great education,” he said. Following Qualls’ speech, local attorney Matt Benda and Shell Rock River Watershed District Board member Brad Kramer also spoke. **Minnesota’s cannabis tax will be one of the highest in the nation after hike** **Man injured in motorcycle crash in Albert Lea** **Female cited for DWI, underage consumption and other reports** **Council approves agreements with developers for single family homes on empty lots** Construction UpdatesI-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge constructionMay 27, 2025 **Construction Updates** I-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge constructionMay 27, 2025 **I-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge construction** **Construction Updates** I-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge constructionMay 27, 2025 **I-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge construction** **I-90 Austin traffic changes begin Wednesday for Cedar River, 6th Street bridge construction** Financials **Financials** **Financials** Southern Minnesota News Collection **Southern Minnesota News Collection** **Southern Minnesota News Collection** Home News Sports Opinion Arts & Culture Classifieds Small Business About Us Policies News Tip Subscriptions Email Customer Service © 2025, Albert Lea Tribune"}