{"id": 1928, "name": "Conservative Institute", "domain": "conservativeinstitute.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://conservativeinstitute.org/conservative-news/social-media-posts-suggest-feud-between-president-trump-and-elon-musk-is-cooling-off.htm", "title": "Social Media Posts Suggest Feud Between President Trump And Elon Musk Is Cooling Off.htm", "content": "Home Articles About Us Our Mission Conservative News Stand Against Bigotry Contact Us **Social media posts suggest feud between President Trump and Elon Musk is cooling off** The past two weeks have seena feuderupt between President Donald Trump and former Department of Government Efficiency (DOGE) head Elon Musk. Yet while the public split has stunned and baffled many conservatives, a recent response from Musk suggests that it may be coming to an end. **Musk reacts favorably to comments from Trump** According toFox News, evidence for that could be seen in Musk's recent social media use, including his reaction to a clip of Trump speaking. President Donald Trump on Elon Musk: “We had a great relationship and I wish him well — very well, actually.”pic.twitter.com/FhiZcP4xYw — ALX 🇺🇸 (@alx)June 9, 2025 The video was posted by conservative influencer ALX, and it feature the president saying that he and Musk \"had a great relationship.\" The president then went on to say of Musk, \"I wish him well — very well, actually,\" to which Musk reacted by posting a heart emoji. **Musk signals support for Trump's handling of LA riots** What's more, Musk appeared to show support for Trump's response to the anti-ICE riots that have rocked Los Angeles in recent days. \"Governor Gavin Newscum and ‘Mayor’ Bass should apologize to the people of Los Angeles for the absolutely horrible job that they’ve done, and this now includes the ongoing L.A. riots,\" Trump said in a post which Musk shared. The president went on to assert that those participating in the unrest \"are not protesters, they are troublemakers and insurrectionists.\" Musk also reposted comments from Vice President J.D. Vance, who declared that Trump \"will not tolerate rioting and violence.\" **Vance expresses hope \"that eventually Elon comes back into the fold\"** Meanwhile, Newsmaxreportedthat Vance made conciliatory remarks regarding Musk during an interview in Nashville this past Friday with comedian and social media personality Theo Von. Although the vice president characterized Musk as \"an emotional guy\" who made \"a huge mistake,\" Vance added that he has himself \"flown off the handle way worse than Elon Musk did in the last 24 hours.\" \"Look, it happens to everybody,\" Vance went on and predicted that \"if Elon chilled out a little bit, everything would be fine.\" While Vance expressed hope \"that eventually Elon comes back into the fold,\" he acknowledged that this might not be \"possible now because he's gone so nuclear.\" The vice president's comments came days after hedge fund manager Bill Ackmanpublicly calledfor reconciliation between Musk and Trump. **Latest Posts** **DANIEL VAUGHAN: Democrats Started The Los Angeles Riots** **DANIEL VAUGHAN: Democrats Started The Los Angeles Riots** **Montana Supreme Court strikes down multiple abortion laws in sweeping decision** **Montana Supreme Court strikes down multiple abortion laws in sweeping decision** **John Fetterman says his party 'loses the moral high ground' by not condemning riots** **John Fetterman says his party 'loses the moral high ground' by not condemning riots** **Attorney General: Man accused of throwing rocks at police has been identified** **Attorney General: Man accused of throwing rocks at police has been identified** **Social media posts suggest feud between President Trump and Elon Musk is cooling off** **Social media posts suggest feud between President Trump and Elon Musk is cooling off** **VP Vance uses humorous GIF to show support for deportation of biased fashion critic who revealed illegal status** **VP Vance uses humorous GIF to show support for deportation of biased fashion critic who revealed illegal status** Home Articles About Us Contact Us Our Mission Conservative News Stand Against Bigotry Unsubscribe"}