{"id": 551, "name": "Frontiers in Environmental Chemistry", "domain": "frontiersin.org/journals/environmental-chemistry", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.frontiersin.org/journals/environmental-chemistry/articles/10.3389/fenvc.2025.1591290/full", "title": "Environmental Chemistry", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Oxidation Processes Catalytic Remediation Chemical Treatments Electrochemical Environmental Engineering Environmental Analytical Methods Inorganic Pollutants Organic Pollutants Separation Technologies Sorption Technologies Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Advanced Oxidation Processes Catalytic Remediation Chemical Treatments Electrochemical Environmental Engineering Environmental Analytical Methods Inorganic Pollutants Organic Pollutants Separation Technologies Sorption Technologies Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Advanced Oxidation Processes Catalytic Remediation Chemical Treatments Electrochemical Environmental Engineering Environmental Analytical Methods Inorganic Pollutants Organic Pollutants Separation Technologies Sorption Technologies Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Environ. Chem. Sec. Advanced Oxidation Processes Volume 6 - 2025 |doi: 10.3389/fenvc.2025.1591290 This article is part of the Research TopicUnveiling Innovation: Advanced Technologies in Wastewater TreatmentView all 3 articles **A Review of Understanding Per-and Polyfluoroalkyl Substances (PFAS) Impact and Exploring Photo-Assisted Fenton Chemistry for Their Oxidative Degradation and Remediation** Delaware State University, Dover, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Per-and polyfluoroalkyl substances (PFAS) are highly stable anthropogenic compounds characterized by their persistence in the environment and potential for bioaccumulation. This review investigates the physicochemical properties that underlie their environmental persistence, particularly the robustness of the carbon-fluorine bond. It also examines the synthesis processes of PFAS, their extensive applications across various industries, and the related health risks, including endocrine disruption and carcinogenic effects. The occurrence of PFAS in diverse environmental matrices, such as soil, water, and biota, is analyzed. Additionally, this study assesses advanced oxidation processes (AOPs), with an emphasis on Fenton-based treatments for the oxidative degradation of PFAS. Methods such as Photo-Assisted Anodic Fenton Treatment (P-AAFT) are highlighted for their promise in achieving complete mineralization of PFAS. The findings highlight the critical need for continued research and policy advancement to address the environmental and health challenges posed by PFAS, underscoring the urgent requirement for effective remediation strategies to mitigate PFAS contamination. Keywords:Per-and polyfluoroalkyl substances (PFAS), Environmental Remediation, Oxidative degradation, Advanced oxidation processes (AOPs), fenton chemistry, Water contamination, endocrine disruption Received:10 Mar 2025;Accepted:26 May 2025. Copyright:© 2025Walker and Milligan. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Tasia Walker, Delaware State University, Dover, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}