{"id": 2060, "name": "New Moderate", "domain": "newmoderate.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://newmoderate.com/2022/07/29/adios-friends-the-new-moderate-ends-its-15-year-run-on-a-hopeful-note/#comments", "title": "Adios Friends The New Moderate Ends Its 15 Year Run On A Hopeful Note", "content": "**POLITICS & CIVILIZATION FOR THE PASSIONATE CENTRIST** Home About Rick Bayan About The New Moderate Mission Strategies Moderate Hall of Fame Hit List The Issues Wild Card Debate **Adios, Friends: The New Moderate Ends Its 15-Year Run on a Hopeful Note** I suppose this day was as inevitable as death, taxes and computer malfunctions. After fifteen years of outspokenly moderate musings that seem to have had zero influence (or less) on our dismally divided national politics, I’ve finally decided to retire The New Moderate as an active monthly blog. Why? It wasn’t the lack of recognition, or the fact that I was pouring hours of work into the project without generating a cent of income, or even the failure of my site to spark anything resembling a much-needed moderate movement. No, in the end it was yet another technical glitch that forced me to put my pet blog to sleep. Here’s what happened.Several years ago WordPress suddenly started asking for my password, even though it never demanded one in the past. After trying every password I had ever used in the online universe, I gave up and attempted to change it. You’d think it would be a simple enough matter to change a password, but WordPress needed my current e-mail address to verify my identity. Turns out it had mydefuncte-mail address on file, and I couldn’t update it because – you guessed it – I didn’t know my password! Nearly foiled by this diabolical Catch-22, I eventually discovered that the WordPress app on my rarely used iPad Mini didn’t ask for my password. It still recognized me! But as I quickly found out, it’s a royal pain to type a thousand-word column on a cramped virtual keyboard. What to do? I devised a clever plan: I’d type my column on my computer ande-mailit to my iPad. From there I’d copy the column and paste it into the waiting template on WordPress. Done! I used this circuitous route for roughly three years, even weathering a phase during which search engines decimated my traffic by declaring the site “unstable” — whatever that means incomputerese. Neverthless, I persisted — until I discovered, just this past month, thatmy iPad Mini was no longer accepting new e-mails! That was the end. The universe was obviously telling me to hang it up and find another pet project. Well, fifteen years isn’t a bad lifespan for a dog or a blog, and we’ve had plenty of good times along the way. No need to weep for me. Granted, I never launched that moderate movement or achieved the exalted status of public pundit, but I can retire with the knowledge that I spoke my mind month after month and said things that needed to be said. (After all, I didn’t have to worry about being fired, threatened by armed insurrectionists or forced to attend a “diversity, equity and inclusion” brainwashing course.) As a Baby Boomer born precisely at the midpoint of the 20th century, I’m aware that my productive years are passing quickly. I’d like to get another book or two into print while my mind is still reasonably robust, and I’ll be content to leave the political punditry to the younger folks with an appetite for constant bickering. I’ll still be observing the American scene, but I won’t feel obligated to share my opinions with the world (or at least the few hundred followers I had amassed during the past fifteen years). Of course, if any bloviating bully on the MAGA right or woke left goes overboard, I’ll be tempted to fire a salvo in their direction. You should, too. Coincidence… Or intelligent design?The very day I sat down to write my final column, hunting and pecking on my iPad’s virtual keyboard, former Democrat and political gadfly Andrew Yang announced the formation of a major third (and centrist) party, via the merger of his own Forward Party with the Renew America Movement and the Serve America Movement. The new party would preserve the name of Yang’s organization (would members be known as Forwardists?). They’d launch a “national building tour” this fall and plan to hold their first convention next summer with the hope of getting national candidates onto the ballot in nearly every state by 2024. Yang and former New Jersey governor Christine Todd Whitman, a Republican environmentalist (apparently not an oxymoron) who defected from the GOP, will co-chair the new party. Along with David Jolly, another ex-Republican, they wrote in a recentWashington Postop-ed that “political extremism is ripping our nation apart, and the two major parties have failed to remedy the crisis.” They added this cogent point: “Today’s outdated parties have failed by catering to the fringes. As a result, most Americans feel they aren’t represented.” In an interview with CNN, Yang noted that “62% of Americans now want a third party, a record high.” Whitman added that “the majority of Americans actually agree on… divisive issues of the day like abortion or firearms — there’s actually a common sense coalition position on these issues and just about every other issue under the sun.” That’s pretty much what I’ve been shouting from my rooftop for the past fifteen years, so I’m pleased that someone with a louder voice will be doing the shouting now. Of course, we also need to remember that no new party has entrenched itself permanently as a force in US politics since the Republicans burst onto the scene in 1854. That’s a long dry spell, and it’s time we had a bold new player in the game. Any party committed to combatting polarization in our politics and culture has my vote. Let’s hope it can generate another hundred million votes from America’s mostly silent moderate majority. Farewell, good luck, and stay centered! * *. * * . * Note: Although I won’t be writing new columns for The New Moderate, the site will remain up and running. I’ll occasionally be updating features like our Hall of Fame and Hit List. I might even write a few new three-way arguments in the Issues section. And I probably won’t be able to resist updating The New Moderate’s Vigilance List each year. Rick Bayanis founder-editor of The New Moderate. His three collections of dark-humored ( but oddly comforting) essays are available on Amazon and wherever else e-books are sold — for the absurdly low price of $2.98 each. That’s less than a cappuccino at Starbucks, and these e-books are even more stimulating. All material in The New Moderate is copyright 2007-2022 by Rick Bayan. Feel free to quote from this site as long as you credit Mr. Bayan as the author. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email **Related** Paul GallandapermalinkJuly 30, 2022 1:45 pmRick, I’d like to think that Andrew and Christine stumbled upon a recent issue and said, “Hey! Let’s do this!”…Thanks for all the good reads. I’ll miss the monthly (more or less) sliver of sanity.ReplyRick BayanpermalinkJuly 30, 2022 11:23 pmGood to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying.Reply Rick, I’d like to think that Andrew and Christine stumbled upon a recent issue and said, “Hey! Let’s do this!”… Thanks for all the good reads. I’ll miss the monthly (more or less) sliver of sanity. Rick BayanpermalinkJuly 30, 2022 11:23 pmGood to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying.Reply Good to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying. Rick, I’d like to think that Andrew and Christine stumbled upon a recent issue and said, “Hey! Let’s do this!”… Thanks for all the good reads. I’ll miss the monthly (more or less) sliver of sanity. Rick BayanpermalinkJuly 30, 2022 11:23 pmGood to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying.Reply Good to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying. Good to hear from you, old friend — and I’m glad you’ve still been a reader. I was actually wondering if a few politicians or pundits might give me a tip of the hat after reading The New Moderate in silence all these years, but your comment is just as satisfying. Savannah Jo0rdanpermalinkJuly 30, 2022 2:35 pmHopefully, you will find another platform from which to write your columns. I agree that WordPress is very, very frustrating. I am not as enthusiastic as you about this third party. They have not specified their particular policies and, as you know, third parties have had a fleeting existence in American politics. Thanks for your many columns. They gave me the sense that rationality is not dead and I believe they had a greater impact than anyone realizes.ReplyRick BayanpermalinkJuly 30, 2022 11:29 pmThanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook!ReplyMilton FreidmanpermalinkAugust 9, 2022 2:52 pmThere have been several third parties. The last truly successful third party was the Republican Party.Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates.If you are expecting any sucessful move to a third party – you will be disappointed.ReplyRick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote.dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. Hopefully, you will find another platform from which to write your columns. I agree that WordPress is very, very frustrating. I am not as enthusiastic as you about this third party. They have not specified their particular policies and, as you know, third parties have had a fleeting existence in American politics. Thanks for your many columns. They gave me the sense that rationality is not dead and I believe they had a greater impact than anyone realizes. Rick BayanpermalinkJuly 30, 2022 11:29 pmThanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook!Reply Thanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook! Milton FreidmanpermalinkAugust 9, 2022 2:52 pmThere have been several third parties. The last truly successful third party was the Republican Party.Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates.If you are expecting any sucessful move to a third party – you will be disappointed.ReplyRick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote.dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. There have been several third parties. The last truly successful third party was the Republican Party. Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates. If you are expecting any sucessful move to a third party – you will be disappointed. Rick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. Dave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties. By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. No one can stop you from hoping. But the odds in favor are infinitesimal. The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot. The most likely political changes we will see are within the parties. These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically. On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be. It is far easier to change the GOP or Democrats than to start a new party. Hopefully, you will find another platform from which to write your columns. I agree that WordPress is very, very frustrating. I am not as enthusiastic as you about this third party. They have not specified their particular policies and, as you know, third parties have had a fleeting existence in American politics. Thanks for your many columns. They gave me the sense that rationality is not dead and I believe they had a greater impact than anyone realizes. Rick BayanpermalinkJuly 30, 2022 11:29 pmThanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook!Reply Thanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook! Thanks, Savannah. I’ve always appreciated your clear-headed views here. Yeah, WordPress gave me all kinds of grief, but on the whole it was a good home for The New Moderate. I’m too tired of political squabbling to keep writing commentary on events (so the final technical glitch was well timed), but I’m sure I’ll keep writing in one form or another. See you on Facebook! Milton FreidmanpermalinkAugust 9, 2022 2:52 pmThere have been several third parties. The last truly successful third party was the Republican Party.Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates.If you are expecting any sucessful move to a third party – you will be disappointed.ReplyRick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote.dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. There have been several third parties. The last truly successful third party was the Republican Party. Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates. If you are expecting any sucessful move to a third party – you will be disappointed. Rick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. Dave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties. By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. No one can stop you from hoping. But the odds in favor are infinitesimal. The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot. The most likely political changes we will see are within the parties. These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically. On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be. It is far easier to change the GOP or Democrats than to start a new party. There have been several third parties. The last truly successful third party was the Republican Party. Libbertarians have been trying to put a dent in politics for 5 deades and rarely get more than a few percent of the vote – despite often excellent candidates. If you are expecting any sucessful move to a third party – you will be disappointed. Rick BayanpermalinkAugust 10, 2022 11:45 amDave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties.By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. Dave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties. By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. Dave: I know that no third party has successfully established itself since the Republicans entered the political scene in the 1850s. Of course, I’m hopeful about the new Forward party, even though I’m not betting any money on it. I think their chances are better than most third parties, especially if they can take advantage of the widespread dissatisfaction with both the Republicans and Democrats by the more moderate members of both parties. By the way, I actually liked Gary Johnson and his running mate when I saw them interviewed back in (I think) 2012. I think they deserved to win more than 1% of the vote. dhliipermalinkAugust 19, 2022 2:03 amNo one can stop you from hoping.But the odds in favor are infinitesimal.The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot.The most likely political changes we will see are within the parties.These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically.On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be.It is far easier to change the GOP or Democrats than to start a new party. No one can stop you from hoping. But the odds in favor are infinitesimal. The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot. The most likely political changes we will see are within the parties. These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically. On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be. It is far easier to change the GOP or Democrats than to start a new party. No one can stop you from hoping. But the odds in favor are infinitesimal. The only US political party with a shot at ever being consequential is the libertarian party and that is a long shot. The most likely political changes we will see are within the parties. These happen all the time. The current GOP is radically different than the GOP even 2 decades ago, and Democrats have changed as radically. On innumerable issues Republicans are what democrats used to be and democrats what republicans used to be. It is far easier to change the GOP or Democrats than to start a new party. PriscillapermalinkJuly 31, 2022 9:45 amIt’s the end of an era, that’s for sure. We will all miss your fair, insightful columns, Rick. Those of us “regulars” wll miss having a safe space to argue over them! (Speaking of that, it’s been a long time since Roby has weighed in ~ if you’re out there, my friend, I hope all is well. You’ve been very influential on my thinking, as have Ron, Dave,Savannah, and others.)It has occured to me that, had I not had Rick or the rest of the TNM crew to debate with, I would still have a somewhat limited, less balanced (to the extent that it is balanced!), and more one-sided view of the world of politics. It’s not as if any of us changed our core beliefs, but I think that all of us, at one time or another, came around to understanding the legitimacy of arguments that perhaps didn’t fit our pre-existing biases.But, it’s time to move on. To say that “times have changed” would be an understatement. I look forward to Rick’s next project, and. whether or not it involves the social and political universe, I am confident it will be worth my attention.ReplyRick BayanpermalinkJuly 31, 2022 10:40 pmThanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course).My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic.I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.)Reply It’s the end of an era, that’s for sure. We will all miss your fair, insightful columns, Rick. Those of us “regulars” wll miss having a safe space to argue over them! (Speaking of that, it’s been a long time since Roby has weighed in ~ if you’re out there, my friend, I hope all is well. You’ve been very influential on my thinking, as have Ron, Dave,Savannah, and others.) It has occured to me that, had I not had Rick or the rest of the TNM crew to debate with, I would still have a somewhat limited, less balanced (to the extent that it is balanced!), and more one-sided view of the world of politics. It’s not as if any of us changed our core beliefs, but I think that all of us, at one time or another, came around to understanding the legitimacy of arguments that perhaps didn’t fit our pre-existing biases. But, it’s time to move on. To say that “times have changed” would be an understatement. I look forward to Rick’s next project, and. whether or not it involves the social and political universe, I am confident it will be worth my attention. Rick BayanpermalinkJuly 31, 2022 10:40 pmThanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course).My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic.I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.)Reply Thanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course). My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic. I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.) It’s the end of an era, that’s for sure. We will all miss your fair, insightful columns, Rick. Those of us “regulars” wll miss having a safe space to argue over them! (Speaking of that, it’s been a long time since Roby has weighed in ~ if you’re out there, my friend, I hope all is well. You’ve been very influential on my thinking, as have Ron, Dave,Savannah, and others.) It has occured to me that, had I not had Rick or the rest of the TNM crew to debate with, I would still have a somewhat limited, less balanced (to the extent that it is balanced!), and more one-sided view of the world of politics. It’s not as if any of us changed our core beliefs, but I think that all of us, at one time or another, came around to understanding the legitimacy of arguments that perhaps didn’t fit our pre-existing biases. But, it’s time to move on. To say that “times have changed” would be an understatement. I look forward to Rick’s next project, and. whether or not it involves the social and political universe, I am confident it will be worth my attention. Rick BayanpermalinkJuly 31, 2022 10:40 pmThanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course).My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic.I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.)Reply Thanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course). My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic. I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.) Thanks, Priscilla. You’ve been here from the start, and I’ve always valued your intelligent input even when we didn’t agree (which actually wasn’t all that often). As you said, we might not have changed our core beliefs, but maybe we’ve come to respect a variety of viewpoints (except for those on the far left and far right, of course). My current project is literally an odd bird — the far-fetched tale of Jeremy Dodo, the last of his species, an articulate fowl who finds his way to England in the early 18th century and becomes a minor celebrity until he runs afoul of the establishment. It’s written entirely in archaic English, purportedly by one of his loyal friends, and is presented as a factual biography — although of course it’s all a bit surrealistic. I had started this story in my 30s and left it half-finished — because who on earth would buy a story about an English-speaking dodo, written in 18th-century style prose? (I feel the same way today, but the old bird called out to me and I couldn’t leave him in limbo.) RobypermalinkAugust 2, 2022 1:01 pmHi Rick and everyone,Thank you Rick for all your good moderate energy and intentions. We all have profited from your efforts and talents. The much wider circle of silent readers and subscribers tells the real story of your impact. Those of us verbose regulars who talked out heads off over the years were just the tip of the iceberg.Thanks for asking Priscilla, things are fine with me and mine, my wife’s niece is now living with us, from Ukraine by way of Poland by way of United for Ukraine, which is credited to Joe Biden in the news. I now have a two Ukrainian power gardening team on my property. Borscht by the gallon. I hope all is well with everyone here.I have not commented lately because all I care about is Russia’s fascist dictator and fascist invasion. Nothing else is much on my mind. Blathering on and on about politics seems fruitless to me, I try to keep my own world on an even keel and appreciate the good things. There is only so much I can say here about Putin’s war and enthronement as tsar, history was moving very fast in February and March, the pace has slowed sown and it will take years now to know how this comes out. Russia is full of good people and good things, but its social pattern is some form of police state with a tsar and his corrupt retinue. That is probably their future, forever. They will always need to be contained, like a disease. A disease with 4000 nuclear warheads that they can’t use without being exterminated themselves. It will be the most eventful question in the world in the next years whether things will turn out so utterly bad for them that they are forced to change the nature of their fascist shithole of a motherland.So, that is what is on my mind and I cannot predict, and no one can predict the future.Vast impersonal amoral forces shape the future and it only ever will seem to be a logical story decades after it happens. Looking at history it seems to make sense, the story seems to have a direction and a plot. Looking at the future is totally different, it’s unknown.Looking at history it seems that things usually move slowly in the direction of an improvement despite all the horrors of conflicts. We may very well survive all the turmoil and our descendents may well live is a world that is livable and enjoyable for most in spite of the bad people and bad events.ReplyRick BayanpermalinkAugust 5, 2022 12:04 amRoby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.)Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene.I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go.ReplyrobypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books!dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Hi Rick and everyone, Thank you Rick for all your good moderate energy and intentions. We all have profited from your efforts and talents. The much wider circle of silent readers and subscribers tells the real story of your impact. Those of us verbose regulars who talked out heads off over the years were just the tip of the iceberg. Thanks for asking Priscilla, things are fine with me and mine, my wife’s niece is now living with us, from Ukraine by way of Poland by way of United for Ukraine, which is credited to Joe Biden in the news. I now have a two Ukrainian power gardening team on my property. Borscht by the gallon. I hope all is well with everyone here. I have not commented lately because all I care about is Russia’s fascist dictator and fascist invasion. Nothing else is much on my mind. Blathering on and on about politics seems fruitless to me, I try to keep my own world on an even keel and appreciate the good things. There is only so much I can say here about Putin’s war and enthronement as tsar, history was moving very fast in February and March, the pace has slowed sown and it will take years now to know how this comes out. Russia is full of good people and good things, but its social pattern is some form of police state with a tsar and his corrupt retinue. That is probably their future, forever. They will always need to be contained, like a disease. A disease with 4000 nuclear warheads that they can’t use without being exterminated themselves. It will be the most eventful question in the world in the next years whether things will turn out so utterly bad for them that they are forced to change the nature of their fascist shithole of a motherland. So, that is what is on my mind and I cannot predict, and no one can predict the future. Vast impersonal amoral forces shape the future and it only ever will seem to be a logical story decades after it happens. Looking at history it seems to make sense, the story seems to have a direction and a plot. Looking at the future is totally different, it’s unknown. Looking at history it seems that things usually move slowly in the direction of an improvement despite all the horrors of conflicts. We may very well survive all the turmoil and our descendents may well live is a world that is livable and enjoyable for most in spite of the bad people and bad events. Rick BayanpermalinkAugust 5, 2022 12:04 amRoby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.)Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene.I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go.ReplyrobypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books!dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Roby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.) Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene. I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go. robypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books! Rick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars. Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period. If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out. Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending. Good luck with your Books! dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Russia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail. The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia. Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar. Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committments Russia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons. The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided. Joe Biden will fight Russia down to the very last Ukrainian. Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river. That is a very dangerous situation for Russia if true – and it appears to be. Hi Rick and everyone, Thank you Rick for all your good moderate energy and intentions. We all have profited from your efforts and talents. The much wider circle of silent readers and subscribers tells the real story of your impact. Those of us verbose regulars who talked out heads off over the years were just the tip of the iceberg. Thanks for asking Priscilla, things are fine with me and mine, my wife’s niece is now living with us, from Ukraine by way of Poland by way of United for Ukraine, which is credited to Joe Biden in the news. I now have a two Ukrainian power gardening team on my property. Borscht by the gallon. I hope all is well with everyone here. I have not commented lately because all I care about is Russia’s fascist dictator and fascist invasion. Nothing else is much on my mind. Blathering on and on about politics seems fruitless to me, I try to keep my own world on an even keel and appreciate the good things. There is only so much I can say here about Putin’s war and enthronement as tsar, history was moving very fast in February and March, the pace has slowed sown and it will take years now to know how this comes out. Russia is full of good people and good things, but its social pattern is some form of police state with a tsar and his corrupt retinue. That is probably their future, forever. They will always need to be contained, like a disease. A disease with 4000 nuclear warheads that they can’t use without being exterminated themselves. It will be the most eventful question in the world in the next years whether things will turn out so utterly bad for them that they are forced to change the nature of their fascist shithole of a motherland. So, that is what is on my mind and I cannot predict, and no one can predict the future. Vast impersonal amoral forces shape the future and it only ever will seem to be a logical story decades after it happens. Looking at history it seems to make sense, the story seems to have a direction and a plot. Looking at the future is totally different, it’s unknown. Looking at history it seems that things usually move slowly in the direction of an improvement despite all the horrors of conflicts. We may very well survive all the turmoil and our descendents may well live is a world that is livable and enjoyable for most in spite of the bad people and bad events. Rick BayanpermalinkAugust 5, 2022 12:04 amRoby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.)Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene.I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go.ReplyrobypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books!dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Roby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.) Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene. I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go. robypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books! Rick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars. Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period. If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out. Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending. Good luck with your Books! dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Russia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail. The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia. Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar. Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committments Russia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons. The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided. Joe Biden will fight Russia down to the very last Ukrainian. Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river. That is a very dangerous situation for Russia if true – and it appears to be. Roby: Thanks for your kind words; I’ve always valued your opinions here. Glad you returned for my valedictory post, which seems to have generated fewer comments than any of my posts to date. (Wow, it’s as if only four people showed up for my funeral.) Anyway, I hope I’ve provoked, reassured and entertained all those silent readers over the years. I feel a little more positive about retiring my blog now that a moderate third party has entered the scene. I totally understand your current preoccupation with the war and atrocities in Ukraine, and good on you for getting involved as much as you have. I’d still like to see a cabal of Russian insiders remove Putin from office, dead or alive. I doubt if the Russian despot will retreat from his pet project as long as he’s in power. He needs to go. robypermalinkAugust 5, 2022 11:08 amRick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars.Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period.If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out.Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending.Good luck with your Books! Rick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars. Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period. If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out. Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending. Good luck with your Books! Rick, the “crew” who have posted our mini (or not so mini) commentaries in response to yours all have I am sure the same fondness for your writing and sadness to see the end of this. Its just that no one is very tuned in and those who have not replied just did not happen to drop in yet. Be sure, its a wistful occasion for all your regulars. Putin is not likely do go anywhere soon. The Russian economy is withering, but not at a frantic pace, it will suffer huge losses but over a long period. If Russian forces suffer a truly complete defeat then Putin is in danger of being removed eventually. We are talking years most likely for all this to play out. Its incredibly Important that the Ukraine invasion be a catastrophic loss to Russia. I cannot predict whether it will be that or how it will all play out. I am sure it has done tremendous harm to Russia in the long run, but the west must remain united and determined for decades if that is what it takes to prevail. We did prevail once over the USSR and the way we will prevail again will likely be similar. We prosper while they face ever larger problems and we outspend them and force them to cripple their already unimpressive economy trying to keep up with us in defense spending. Good luck with your Books! dhliipermalinkAugust 19, 2022 2:13 amRussia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail.The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia.Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar.Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committmentsRussia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons.The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided.Joe Biden will fight Russia down to the very last Ukrainian.Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river.That is a very dangerous situation for Russia if true – and it appears to be. Russia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail. The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia. Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar. Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committments Russia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons. The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided. Joe Biden will fight Russia down to the very last Ukrainian. Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river. That is a very dangerous situation for Russia if true – and it appears to be. Russia has done a fantastic job of propping up its economy but the means it has used are unsustainable – though it will take many months to fail. The most damaging news for Russia is that Europe has announced it will reduce its consumption of Russian energy by 15% by winter – that would be devastating to Russia. Low estimates for Russian casualties so far are higher than the US casualties for the entire Vietnam war. Unfortunately Ukraines are similar. Regardless,. Ukraine has little choice but endure – Russia does not.Further though Russia has a larger military – it also has more committments Russia is probably capable of producing the weapons to continue this war – but without access to the west, those weapons will be increasing “dumb” weapons. The longer this continues the better trained Ukrainians will be and the more sophisticated the western weapons they will be provided. Joe Biden will fight Russia down to the very last Ukrainian. Purportedly US weapons have allowed Ukraine to sever supply lines to about 2%K russian troops north of the Nyper river. That is a very dangerous situation for Russia if true – and it appears to be. RobypermalinkAugust 25, 2022 8:55 pmHey Ron, are you out there? I hope you are well. Strange not to see you here.Reply Hey Ron, are you out there? I hope you are well. Strange not to see you here. Hey Ron, are you out there? I hope you are well. Strange not to see you here. **Leave a commentCancel reply** Δ PagesAbout Rick BayanAbout The New ModerateThe Whole StoryHit ListMissionModerate Hall of FameStrategiesThe IssuesAbortionAffirmative ActionAfrocentrismBaby BoomersBilingualismBirth ControlCapitalismCensorshipClass SystemCorporationsDeath PenaltyDiversityEugenicsEuphemismsEvolutionFeminismGaysGeorge W. BushGlobal WarmingGodIllegal ImmigrantsIraqIsraelJews and Anti-SemitismLobbyingMcCarthyismModeratesModern ArtMoralityNationalized HealthcarePatriotismPolitical PartiesRacial ProfilingSeparation of Church and StateStereotypesTerroristsThe EnvironmentWhite PeopleWild Card Debate **Pages** About Rick Bayan About The New ModerateThe Whole Story The Whole Story Hit List Mission Moderate Hall of Fame Strategies The IssuesAbortionAffirmative ActionAfrocentrismBaby BoomersBilingualismBirth ControlCapitalismCensorshipClass SystemCorporationsDeath PenaltyDiversityEugenicsEuphemismsEvolutionFeminismGaysGeorge W. BushGlobal WarmingGodIllegal ImmigrantsIraqIsraelJews and Anti-SemitismLobbyingMcCarthyismModeratesModern ArtMoralityNationalized HealthcarePatriotismPolitical PartiesRacial ProfilingSeparation of Church and StateStereotypesTerroristsThe EnvironmentWhite People Abortion Affirmative Action Afrocentrism Baby Boomers Bilingualism Birth Control Capitalism Censorship Class System Corporations Death Penalty Diversity Eugenics Euphemisms Evolution Feminism Gays George W. Bush Global Warming God Illegal Immigrants Iraq Israel Jews and Anti-Semitism Lobbying McCarthyism Moderates Modern Art Morality Nationalized Healthcare Patriotism Political Parties Racial Profiling Separation of Church and State Stereotypes Terrorists The Environment White People Wild Card Debate **Pages** About Rick Bayan About The New ModerateThe Whole Story The Whole Story The Whole Story Hit List Mission Moderate Hall of Fame Strategies The IssuesAbortionAffirmative ActionAfrocentrismBaby BoomersBilingualismBirth ControlCapitalismCensorshipClass SystemCorporationsDeath PenaltyDiversityEugenicsEuphemismsEvolutionFeminismGaysGeorge W. BushGlobal WarmingGodIllegal ImmigrantsIraqIsraelJews and Anti-SemitismLobbyingMcCarthyismModeratesModern ArtMoralityNationalized HealthcarePatriotismPolitical PartiesRacial ProfilingSeparation of Church and StateStereotypesTerroristsThe EnvironmentWhite People Abortion Affirmative Action Afrocentrism Baby Boomers Bilingualism Birth Control Capitalism Censorship Class System Corporations Death Penalty Diversity Eugenics Euphemisms Evolution Feminism Gays George W. Bush Global Warming God Illegal Immigrants Iraq Israel Jews and Anti-Semitism Lobbying McCarthyism Moderates Modern Art Morality Nationalized Healthcare Patriotism Political Parties Racial Profiling Separation of Church and State Stereotypes Terrorists The Environment White People Abortion Affirmative Action Afrocentrism Baby Boomers Bilingualism Birth Control Capitalism Censorship Class System Corporations Death Penalty Diversity Eugenics Euphemisms Evolution Feminism Gays George W. Bush Global Warming God Illegal Immigrants Iraq Israel Jews and Anti-Semitism Lobbying McCarthyism Moderates Modern Art Morality Nationalized Healthcare Patriotism Political Parties Racial Profiling Separation of Church and State Stereotypes Terrorists The Environment White People Wild Card Debate \"Too long have we been tyranniz'd by the militant dogmatizing of Right and Left. Let the Rebellion of the Middle commence here!\" -Rich'd Bayan, Founder & Editor SEARCH **SEARCH** **SEARCH** Email SubscriptionEnter your email address to subscribe to this blog and receive notifications of new posts by email.Email Address:Sign me up!Join 405 other subscribers **Email Subscription** Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address: Sign me up! **Email Subscription** Enter your email address to subscribe to this blog and receive notifications of new posts by email. Email Address: Sign me up! SubscribeSubscribe in a reader **Subscribe** Subscribe in a reader **Subscribe** Subscribe in a reader Spread the Word! **Spread the Word!** **Spread the Word!** E-MAIL MErickbayan at verizon dot net **E-MAIL ME** **E-MAIL ME** Get My TweetsBy: Twitter Buttons **Get My Tweets** **Get My Tweets** Take Our Poll (11/12/09)What are the three biggest challenges facing moderates today?(polls) **Take Our Poll (11/12/09)** **Take Our Poll (11/12/09)** Recent PostsAdios, Friends: The New Moderate Ends Its 15-Year Run on a Hopeful NoteR.I.P. Roe v. WadeAngry Young Men with Guns: An American CrisisMuskmania: the Twitter Takeover and the Consequences of Free SpeechSurreal Times, Real Anger **Recent Posts** Adios, Friends: The New Moderate Ends Its 15-Year Run on a Hopeful Note R.I.P. Roe v. Wade Angry Young Men with Guns: An American Crisis Muskmania: the Twitter Takeover and the Consequences of Free Speech Surreal Times, Real Anger **Recent Posts** Adios, Friends: The New Moderate Ends Its 15-Year Run on a Hopeful Note R.I.P. Roe v. Wade Angry Young Men with Guns: An American Crisis Muskmania: the Twitter Takeover and the Consequences of Free Speech Surreal Times, Real Anger Recent CommentsAnonymous onDoes America Need a Mission…Piotr SkalskionThe Great Philadelphia Swim Cl…Martin EvanonDebate THIS! Trump and Biden G…foijioonThe New Moderate Gives Th…Cody GonAmerica Is Burning: Notes on t… **Recent Comments** **Recent Comments** Top PostsSurreal Times, Real AngerStereotypesFrom the Sublime to the PoliticalAfrocentrismDiversity **Top Posts** Surreal Times, Real Anger Stereotypes From the Sublime to the Political Afrocentrism Diversity **Top Posts** Surreal Times, Real Anger Stereotypes From the Sublime to the Political Afrocentrism Diversity ArchivesJuly 2022May 2022April 2022March 2022February 2022January 2022December 2021November 2021October 2021August 2021July 2021June 2021April 2021March 2021January 2021December 2020November 2020October 2020September 2020August 2020July 2020June 2020May 2020April 2020March 2020February 2020January 2020November 2019October 2019August 2019July 2019June 2019April 2019March 2019February 2019January 2019November 2018October 2018August 2018November 2017October 2017September 2017August 2017July 2017May 2017April 2017March 2017February 2017January 2017November 2016October 2016September 2016August 2016July 2016June 2016May 2016April 2016March 2016February 2016January 2016November 2015October 2015September 2015August 2015July 2015June 2015April 2015March 2015February 2015January 2015November 2014October 2014August 2014July 2014June 2014March 2014January 2014December 2013November 2013October 2013September 2013December 2012November 2012October 2012September 2012August 2012July 2012June 2012May 2012April 2012March 2012February 2012January 2012December 2011November 2011October 2011September 2011August 2011July 2011June 2011May 2011April 2011March 2011February 2011January 2011December 2010November 2010October 2010September 2010August 2010July 2010June 2010May 2010April 2010March 2010February 2010January 2010December 2009November 2009October 2009September 2009August 2009July 2009May 2009 **Archives** July 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 August 2021 July 2021 June 2021 April 2021 March 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 November 2019 October 2019 August 2019 July 2019 June 2019 April 2019 March 2019 February 2019 January 2019 November 2018 October 2018 August 2018 November 2017 October 2017 September 2017 August 2017 July 2017 May 2017 April 2017 March 2017 February 2017 January 2017 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 April 2015 March 2015 February 2015 January 2015 November 2014 October 2014 August 2014 July 2014 June 2014 March 2014 January 2014 December 2013 November 2013 October 2013 September 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 April 2010 March 2010 February 2010 January 2010 December 2009 November 2009 October 2009 September 2009 August 2009 July 2009 May 2009 **Archives** July 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 August 2021 July 2021 June 2021 April 2021 March 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 November 2019 October 2019 August 2019 July 2019 June 2019 April 2019 March 2019 February 2019 January 2019 November 2018 October 2018 August 2018 November 2017 October 2017 September 2017 August 2017 July 2017 May 2017 April 2017 March 2017 February 2017 January 2017 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 April 2015 March 2015 February 2015 January 2015 November 2014 October 2014 August 2014 July 2014 June 2014 March 2014 January 2014 December 2013 November 2013 October 2013 September 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 April 2010 March 2010 February 2010 January 2010 December 2009 November 2009 October 2009 September 2009 August 2009 July 2009 May 2009 Bayan's SitesBAYANologyRichardBayan.comThe Cynic's Sanctuary **Bayan's Sites** BAYANology RichardBayan.com The Cynic's Sanctuary **Bayan's Sites** BAYANology RichardBayan.com The Cynic's Sanctuary Facebook GroupThe New Moderate **Facebook Group** The New Moderate **Facebook Group** The New Moderate Good Reading/ViewingArts & Letters DailyMental FlossOrdinary TimesPolitiFact.comStuff White People LikeThe OnionU.S. Politics GuideUrban DictionaryWikipedia **Good Reading/Viewing** Arts & Letters Daily Mental Floss Ordinary Times PolitiFact.com Stuff White People Like The Onion U.S. Politics Guide Urban Dictionary Wikipedia **Good Reading/Viewing** Arts & Letters Daily Mental Floss Ordinary Times PolitiFact.com Stuff White People Like The Onion U.S. Politics Guide Urban Dictionary Wikipedia Moderate BlogsBooker RisingConnecting the DotsModerateVoters.orgModerateVoters.orgPoli-TeaRadical Middle NewsletterThe Center LaneThe HanksterThe Moderate VoiceThe Politically Moderate ChristianVodka Pundit **Moderate Blogs** Booker Rising Connecting the Dots ModerateVoters.org ModerateVoters.org Poli-Tea Radical Middle Newsletter The Center Lane The Hankster The Moderate Voice The Politically Moderate Christian Vodka Pundit **Moderate Blogs** Booker Rising Connecting the Dots ModerateVoters.org ModerateVoters.org Poli-Tea Radical Middle Newsletter The Center Lane The Hankster The Moderate Voice The Politically Moderate Christian Vodka Pundit Moderate/Non-partisan GroupsAmerica SpeaksCentrist Independent Voter NetworkCentrist PartyCentrist ProjectCommonsense CoalitionModern Whig PartyNo LabelsSunlight FoundationThird Way **Moderate/Non-partisan Groups** America Speaks Centrist Independent Voter Network Centrist Party Centrist Project Commonsense Coalition Modern Whig Party No Labels Sunlight Foundation Third Way **Moderate/Non-partisan Groups** America Speaks Centrist Independent Voter Network Centrist Party Centrist Project Commonsense Coalition Modern Whig Party No Labels Sunlight Foundation Third Way News & OpinionABC NewsBalloon JuiceBBC NewsBloomberg Financial NewsCBS NewsChicago Sun-TimesChicago TribuneChristian Science MonitorCNNDaily BeastDaily KosDer Spiegel InternationalDrudge ReportFox NewsGuardian (UK)Hot AirHuffington PostInstapunditInternational Herald TribuneJerusalem PostLos Angeles TimesMemeorandumMother JonesMSNBCNational Review OnlineNew RepublicNew York TimesNewserNewsweekNPRPoliticoReal Clear PoliticsReason MagazineRed StateSalonSlateThe Daily CallerThe EconomistThe NationThe Times Online (UK)Time MagazineUSA TodayVillage VoiceWall Street JournalWashington PostWeekly Standard **News & Opinion** ABC News Balloon Juice BBC News Bloomberg Financial News CBS News Chicago Sun-Times Chicago Tribune Christian Science Monitor CNN Daily Beast Daily Kos Der Spiegel International Drudge Report Fox News Guardian (UK) Hot Air Huffington Post Instapundit International Herald Tribune Jerusalem Post Los Angeles Times Memeorandum Mother Jones MSNBC National Review Online New Republic New York Times Newser Newsweek NPR Politico Real Clear Politics Reason Magazine Red State Salon Slate The Daily Caller The Economist The Nation The Times Online (UK) Time Magazine USA Today Village Voice Wall Street Journal Washington Post Weekly Standard **News & Opinion** ABC News Balloon Juice BBC News Bloomberg Financial News CBS News Chicago Sun-Times Chicago Tribune Christian Science Monitor CNN Daily Beast Daily Kos Der Spiegel International Drudge Report Fox News Guardian (UK) Hot Air Huffington Post Instapundit International Herald Tribune Jerusalem Post Los Angeles Times Memeorandum Mother Jones MSNBC National Review Online New Republic New York Times Newser Newsweek NPR Politico Real Clear Politics Reason Magazine Red State Salon Slate The Daily Caller The Economist The Nation The Times Online (UK) Time Magazine USA Today Village Voice Wall Street Journal Washington Post Weekly Standard Worth a LookWordPress.comWordPress.org **Worth a Look** WordPress.com WordPress.org **Worth a Look** WordPress.com WordPress.org 9/112020 electionacademic leftistsAmerican plutocracyangry white peopleArizona immigrant lawBidenbirthersblacksbroken democracyCambridge policecentermovement.orgcentrist movementcentrist partycentristsconservative populistsculture warsdecline of AmericaEgypt revolutionextremistsfaithfederal deficitGatesGates arrestGeorge WashingtonGlenn Beckgreat recessiongun controlhealthcare reformHenry Louis GatesHillary Clintonidentity politicsillegal immigrantsISISIslamistsLibya revolutionlobbyistsmiddle of the roadMitt Romneymoderate movementmoderate Muslimsmoderate partymoderate revolutionmoderatesnew moderateNPR liberalsObamaObama birth certificateObamacareObama moderatePC policepolarizationpolarized Americapolicepolitical correctnesspublic optionraceracial profilingracial tensionracismradical centristsradical Islamradical moderatesRick BayanRush LimbaughSean HannitySkip Gatesspecial interest groupsTrumpvigilance listWall StreetWall Street bonuseswhat do moderates believewhite angerwhite people **** **** Site InfoCreate accountLog inEntries feedComments feedWordPress.com **Site Info** Create account Log in Entries feed Comments feed WordPress.com **Site Info** Create account Log in Entries feed Comments feed WordPress.com Search Engine Submission - AddMe All material in The New Moderate copyright Rick Bayan 2007-2010. Blog at WordPress.com. Comment Reblog SubscribeSubscribedTHE NEW MODERATEJoin 405 other subscribersSign me upAlready have a WordPress.com account?Log in now. THE NEW MODERATE Already have a WordPress.com account?Log in now. THE NEW MODERATE Already have a WordPress.com account?Log in now. THE NEW MODERATESubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar THE NEW MODERATE SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar THE NEW MODERATE SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}