{"id": 639, "name": "Anderson Herald Bulletin", "domain": "heraldbulletin.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.heraldbulletin.com/elections/primary-election-guide-2022/html_7b3ddcd4-c17c-11ec-a98a-dfa185503f61.html", "title": null, "content": "Facebook Instagram Email Local News Business Courts Education Public Safety Across Indiana Nation & World Coronavirus Short Takes Best of Madison County Annual Report News Primary Election Guide 2022 High School Sports NCAA Tournament THB Sports Awards Colts Indiana Hoops in the Hoosier State Purdue Notre Dame Pacers Anderson University Podcasts College Sports Auto Racing Videos Photo Galleries Podcasts Buy Photos Entertainment Eats Celebrations Editorials Columns Letters to the Editor Submit a Letter Full Obituaries Notices & Funerals Comics Puzzles Games THB Sports Awards Graduation 2021 Graduation 2020 Hoops in the Hoosier State Hidden Treasures 24 Hours in Anderson Broken Trust Seniors2022 Madison Life & Times Discover Magazine Madison County Chamber Guide Jobs Autos Homes Place An Ad Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Weekly Ads Newspaper Ads Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletterText Alerts Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Text Alerts Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Text Alerts Login E-Paper Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Celebrations ObituariesFull obituariesObituary notices & funerals Full obituaries Obituary notices & funerals Full obituaries Obituary notices & funerals Public Notices 83°Anderson, IN(46016)TodaySome clouds. Low 62F. Winds SSW at 5 to 10 mph..TonightSome clouds. Low 62F. Winds SSW at 5 to 10 mph.Updated: June 11, 2025 @ 5:23 pmFull Forecast Anderson, IN(46016)TodaySome clouds. Low 62F. Winds SSW at 5 to 10 mph..TonightSome clouds. Low 62F. Winds SSW at 5 to 10 mph.Updated: June 11, 2025 @ 5:23 pm Some clouds. Low 62F. Winds SSW at 5 to 10 mph.. Some clouds. Low 62F. Winds SSW at 5 to 10 mph. Updated: June 11, 2025 @ 5:23 pm Full Forecast Anderson, IN(46016)TodaySome clouds. Low 62F. Winds SSW at 5 to 10 mph..TonightSome clouds. Low 62F. Winds SSW at 5 to 10 mph.Updated: June 11, 2025 @ 5:23 pm Some clouds. Low 62F. Winds SSW at 5 to 10 mph.. Some clouds. Low 62F. Winds SSW at 5 to 10 mph. Updated: June 11, 2025 @ 5:23 pm Some clouds. Low 62F. Winds SSW at 5 to 10 mph.. Some clouds. Low 62F. Winds SSW at 5 to 10 mph. Updated: June 11, 2025 @ 5:23 pm Full Forecast E-Paper Newsletter Facebook Instagram **Primary Election Guide 2022** Apr 21, 2022 Apr 21, 2022 The Herald Bulletin presents information about candidates in contested races and their goals if elected. **Trending Recipes** **Obituaries** More Obituaries **PHOTO REPRINTS** Graduations, games or events, order prints of your favorites photos from The Herald Bulletin. **SCHOOL DELAYS** Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Contact Us Advertise with Us Subscriber Services Site Forms Cookie Preferences Home News Comics Puzzles Sports Life & Times Opinion Obituaries Photos Video Gallery Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}