{"id": 998, "name": "NewsLaundry", "domain": "newslaundry.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.newslaundry.com/2025/06/11/decoding-mallyas-259-minute-spin-job-from-king-of-good-times-to-podcast-prince-of-excuses", "title": "Decoding Mallyas 259 Minute Spin Job From King Of Good Times To Podcast Prince Of Excuses", "content": "Video Podcast Long Form Subscriber Only #FightToBreathe Explainers हिन्दी Subscribe NL Sena MoreStoreAnalysisBooksLegal FundMediaNewsletterNL InterviewComicNL DocumentariesReport Store Analysis Books Legal Fund Media Newsletter NL Interview Comic NL Documentaries Report Store Analysis Books Legal Fund Media Newsletter NL Interview Comic NL Documentaries Report Store Analysis Books Legal Fund Media Newsletter NL Interview Comic NL Documentaries Report Analysis Analysis **Decoding Mallya’s 259-minute spin job: From king of good times to podcast prince of excuses** Raj Shamani’s podcast left a key question unanswered. When Raj Shamani – a role model for much of India’s Gen Z – sat across Vijay Mallya for a podcast lasting 258 minutes and 47 seconds – what we ended up with wasn’t just highly viral content but also a carefully constructed image management exercise vaguely masquerading as some sort of amea culpa. After years of silence, Mallya finally spoke and shared his side of the story – and if I had to put it in typical Mumbaikar style, what he basically said was, “Apun ka bad luck ich kharab tha” (I just had bad luck). Mallya said that his downfall was just a result of unfortunate timing and bad luck. In a country which thrives onfatalism, this was a terrific marketing ploy and that explains the close to23 million viewsthat the podcast has got on YouTube at the time of writing this. It also explains the positive sentiment that has been generated towards Mallya. However, the podcast left a key question unanswered: Was it just bad luck?In a May 2016 interview to theFinancial Times, a few months after he had fled India, Mallya had said: “I am a small fry … But I’m the big fish that people want to catch – that’s the trouble.” Indeed, Mallya wasn’t totally wrong about this. In the overall scheme of things he was a small fry. In a question answered in the Rajya Sabha (unstarred question no. 2133) on March 21, 2017, the government had said that as of December 31, 2016, Mallya had owed the public sector banks Rs 8,191 crore. At that point of time, the media constantly put the total amount of bank loans that he had defaulted on at greater than Rs 9,000 crore. This was a significantly smaller amount in comparison to some of the bigger defaults made by companies like Bhushan Steel, Essar Steel, Bhushan Power and Steel, Alok Industries, etc. Even Nirav Modi’s fraud which cost the Punjab National Bank Rs 13,000 crore was larger than Rs 8,191 crore. Nonetheless, it wasn’t a small amount on its own. So, how did things reach such a stage, where Mallya decided to leave India in early March 2016? The Mallya story Vijay Mallya was born to Vittal Mallya and Lalitha Ramaiah. His father, Vittal, was a frugal liquor baron and the chairman of United Breweries Ltd. Vittal died at the age of 59 in 1983, and a very young Mallya took over his business interests. The liberalisation of 1991 allowed him to rapidly expand his liquor business. By 2001,his companywas selling 26 million cases a year. When he had taken over from his father, the company used to sell 2.5 million cases a year. Indeed, by 2005, Mallya was ready for bigger challenges. He was also well-connected with India’s politicians by then, having himself become a Rajya Sabha MP in 2002. In May 2005, Mallya launched Kingfisher Airlines. Mallya, unlike the other low-cost operators in the business, wanted to provide people with a five-star experience up in the sky. In fact, by 2008, Kingfisher was carrying around one-fourth of India’s domestic flyers. Further, Mallya wanted Kingfisher to fly internationally. The trouble was that the government had a requirement in place to let private airlines fly abroad: a private airline had to be flying for five years and have a fleet of 20 airplanes in order to be allowed to fly internationally. It has often been suggested that this requirement was put in place to help Jet Airways, which had started to fly internationally in 2005. If Mallya were to follow this rule, he would have to wait until May 2010 to fulfil the criteria. But he was a man in a hurry. In June 2007, United Breweries Holding Ltd, one of Mallya’s companies, bought a 26 percent stake in Deccan Aviation, which ran Air Deccan, a low-cost airline. Air Deccan had started to fly in 2003 and was just a year away from being able to fly internationally. In early September 2008, Kingfisher launched a Bengaluru-London direct flight. This was around the time when the global financial crisis of 2008 hit the world. Air travel took a significant beating in the aftermath of the crisis. In October 2008, just about a month later, Kingfisher decided to stop expanding global operations. Iteven soldthree of its five Airbus A340 planes it had bought for overseas flying. What did not help was that global oil prices started to rise late 2009 onwards. This hurt the domestic airline business. In 2010, the banks which had lent to Mallya’s companies helped him by restructuring the loans. He gave them a personal guarantee on these loans. In 2013,he claimedthat the personal guarantee was extracted under duress. Meanwhile, even the domestic business of Kingfisher Airlines continued to lose money – battered by the cheap fares offered by competitors along with the high oil prices. The airline had to finally suspend operations in October 2012. Bad luck? So, was this simply bad luck and unfortunate timing as Mallya claimed in Shamani’s podcast, where he said: “You ever heard of the global financial crisis, right? Did it not impact India? Of course, it did.” 1) The launch of international operations at the time the financial crisis of 2008 broke out turned out to be wrong. We could say it was a matter of some bad luck and unfortunate timing. But what needs to be remembered is that there were enough and more things that happened in 2007 and in early 2008, which clearly suggested that the times ahead would be challenging on the economic front. So, it wasn’t just bad luck. There was also an escalation of commitment at play, where, having committed to an idea, Mallya simply wanted to go ahead with it. 2) Airlines are a very high risk business. So, anyone who later blames only circumstances for an airline business not taking off, clearly does not understand or probably does not want to understand the amount of risk they had taken on. As the investing legend Warren Buffett has said about airlines: “The worst sort of business is one that grows rapidly, requires significant capital to engender the growth, and then earns little or no money. Think airlines. Here a durable competitive advantage has proven elusive ever since the days of the Wright Brothers. Indeed, if a farsighted capitalist had been present at Kitty Hawk, he would have done his successors a huge favour by shooting Orville down. The airline industry’s demand for capital ever since that first flight has been insatiable. Investors have poured money into a bottomless pit, attracted by growth when they should have been repelled by it.” 3) Also, buying Air Deccan, which was a low-cost airline, led to confused positioning, which did not help the business. On the flip side, the government’s five-year rule to be allowed to fly internationally, probably pushed him into making that decision. So, the lack of ease of doing business also had a role to play. 4) Airlines were not the only business that Mallya was expanding in. Over the years he had also acquired a whole host of different sports teams. He had bought a 50 per cent stake in the old Kolkata football clubs of Mohun Bagan and East Bengal. He had bought the Dutch Formula One Team, Spyker, spending $110 million to buy it. The team was renamed Force India. He had also bought a cricket team in the newly launched Indian Premier League for $111 million and named it the Royal Challengers Bangalore. Now, buying these businesses may have made business sense, but in the process Mallya spread himself too thin, given that there is only so much time and mind-space that an individual can possibly have to do things that they want to do. While India has had many successful family-owned business firms which operate in multiple sectors, over the last few decades, core competence – with entrepreneurs operating in one particular sector – has been the order of the day. Of course, there are always exceptions. Airlines are a difficult business to run. But then Mallya was often busy elsewhere…with his IPL team…with his Formula One team…with his Kingfisher calendar. So, what does this tell us? That there was some bad timing involved but a lot of it was simply bad decision making and an underappreciation of how risky the airline business could be. Where is the ‘chori’? In fact, as Mallya told Shamani: “If you want to call me a fugitive, go ahead, but where is the ‘chor’ coming from… where is the ‘chori’?” Here is where things get slightly complex and the simplistic story that Mallya sold on Shamani’s podcast starts to unravel. 1) The Enforcement Directorate (ED) has filed charges against Mallya under the Prevention of Money Laundering Act. It hasallegedthat Kingfisher Airlines diverted at least Rs 3,547 crore of the loan received from banks.In the podcast, Mallyasaid: “What is laundering? Did I steal it? Did I fund my lifestyle with it?” This was classic whataboutery of supposedly answering a question without really answering it. In fact, as perthe ED, between April 2008 and March 2012, Rs 3,432 crore was diverted through over invoicing of lease rentals of aircraft. Further, Rs 45.42 crore was diverted to pay the rental lease on a corporate jet used exclusively by Mallya. Several other diversions have been pointed out.Shamani did not get into these details to keep things simplistic and in the process allowed Mallya to hit his low full-tosses out of the park. 2) Kingfisher Airlines owed the payment of service tax to the service tax department. This was tax which was collected but never paid. In July 2018, the department managedto sella luxury jet owned by Mallya to recover a part of the non-payment. And there’s more. The birthday bash On December 18, 2015, Mallya turned 60. He celebrated at the Kingfisher Villa located in Candolim, Goa. A news report in theMumbai Mirrorpointed out: “International pop icon Enrique Iglesias belted out his 2014 chartbuster ‘Bailando’ (Dancing) hours after Sonu Nigam completed a nonstop two-hour session with‘Tum jiyo hazaron saal, saal ke din ho pachaas hazaar’.”This did not go unnoticed and basically increased Mallya’s problems. Now, it can be argued that the concept of limited liability essentially separates the businessman from the business and that Mallya had all the right to celebrate, but the fact of the matter is that by deciding to celebrate he ended up attracting unwanted attention which he could have done without. As Raghuram Rajan, the then RBI governor, without naming Mallya,saidin January 2016: “If you flaunt your yacht, massive birthday bashes, etc, even while owing the system a lot of money...it seems to suggest that you don’t care.” This was a very basic mistake that Mallya made given that he did fancy himself as some sort of a marketing guru. Over the years, Mallya had become a brand ambassador for his company, with the media following his parties, his holidays, his friends and the very famous Kingfisher calendars, which were shot every year with models wearing bikinis. In a way it made sense given that advertising alcohol is banned in India. Mallya even admitted in later years: “I did what [Richard] Branson does … I lived the brand.” The point being that he created a brand around himself helping promote his business interests. And that meant that the media was always interested in what Mallya was up to. They had followed him in the good times, and they would follow him in the bad times as well. This was PR 101 which Mallya got wrong. The media likes to create heroes only to pull them down as and when an opportunity arises. As the old cliché in journalism goes: “If it bleeds, it leads\". And all this was happening at a time when Mallya hadn’t paid the employees of Kingfisher. As a March 2016 report inThe Economic Timespoints out: “The number includes 900 employees who are still, on paper, employed with the airline and about 2000 more who left since 2015. The salary arrears, mounting since 2012, work out to more than Rs 300 crore.”Given this, the situation that emerged went beyond the argument of limited liability. This in a way ensured that Mallya became the poster boy of bank loan defaults in India, even though there were bigger defaulters out there. Now, Mallya did apologise to the employees in the podcast, but this was too little and too late. In a scenario, where Mallya emerged as a poster boy of corporate villainy, no government would look to reach a settlement with him. Whatever conclusion, and if and when it emerges, will come through the courts, both in India and the United Kingdom. The identified life The Nobel prize winning economist Thomas Schelling came up with the concepts of the identified life and the statistical lives. He offered the example of a sick six-year-old girl to essentially distinguish between a ‘statistical life’ and an ‘identified life’. The sick girl dying in a hospital due to lack of resources is a known, identifiable life – one we can relate to. In contrast, the countless others who die under similar circumstances remain ‘statistical lives’ – anonymous, faceless, and therefore easier to ignore. Now, the media can keep talking about the facilities in hospitals not being up to the mark and the world at large simply won’t care. But if it starts talking about this one girl who needs medical care and her parents do not have enough money for it, then people are more than likely to get around to donating money to finance this girl’s care. She becomes an identified life. In that sense, Vijay Mallya became the identified life of the bank loan defaults in India, whereas other defaulters – both small and big – remained statistical lives. And this hurt his cause. The biggest defaulter among all companies was Bhushan Steel. The chairman of the company was Brij Bhushan Singal. Almost no one outside the business and banking community has ever heard of him, back then or even now for that matter. The other interesting thing is that the media has had a field day printing pictures and running stories around Mallya; the same was not true for Singal or the Ruia brothers (Shashi and Ravi), who ran Essar Steel, the second-biggest defaulters after Bhushan Steel. In fact, if you were to go to Google images and search for a picture of Singal, you will only get a few pictures that have appeared in the niche business press and nothing beyond. Now, try doing that with Mallya. Indeed, the story of Mallya, who ran an airline, a liquor company, owned a cricket team and, more famously, was closely associated with the Kingfisher calendar, was bound to have been more interesting for the common man than the other bigger defaulters. Also, Mallya wasn’t the only one to flee the country. In an answer to a question in the Lok Sabha, the Ministry of External Affairs, said on December 19, 2018, that the following people were involved in financial irregularities, were facing criminal investigation and who had fled the country or were living abroad: Vijay Mallya, Christian Michel James, Nirav Modi, Mehul Choksi, Ashish Sureshbhai Jobanputra, Priti Ashish Jobanputra, Ramachandran Viswanathan, MG Chandrasekhar, Sanjay Bhandari, Nitin Jayantilal Sandesara, Chetan Jayantilal Sandesara, Dipti Chetan Sandesara, Hiteshkumar Narendrabhai Patel, Deepak Talwar, Deepa Talwar, Sunny Kalra, Aarti Kalra, Sanjay Kalra, Varsha Kalra, Jatin Mehta, Lalit Modi, S. Harpal Singh Dutta, Ritesh Jain, Mugundhan Gangam, Pushpesh Kumar Baid, Nitish J Thakur, Purvi Modi, Mihir Rashmi Bhansali, Aditya Nanavati, Sunil Varma, Neeshal Deepak Modi, Nehal Modi, Mayank Mehta, Jayesh Indravardan Shah, Deepak Krishna Rao Kulkarni, Deepak Modi, Subhash Shankar Parab, Rajiv Saxena, Rajesh Gajera, Carlo Valentino Fernando Gerosa and Guido Ralph Haschke. (Question No. 1551 answered on December 19, 2018). So, clearly the attention that Mallya managed to attract didn’t do him much good. And that can’t be blamed on anyone else. Final thoughts Does that mean that Mallya was unlucky? Maybe not. It wasn’t that Mallya did not know how the system worked in India. He was an insider, having been born in a business family and then becoming an MP as well. Further, he used to run a liquor company, where regular interactions are needed with the state governments and the local governments all across the country. He used the media to pump up his brand and then the media used him to drive eyeballs. Perception was reality both ways. This brings us to the final point in this piece. In arecent tweet, Mallya said: “The union finance ministry has confirmed in writing that banks have recovered Rs 14,100 crores from me.” On Page 148 of the Ministry of Finance’sannual report for 2024-25, it’s pointed out: “Complete amount of attached properties have been successfully restored to the public sector banks.” In case of Mallya, the value of the properties is determined to be Rs 14,131.6 crore. In fact, on December 17, 2024, the finance minister Nirmala Sitharamanhad saidin the Lok Sabha: “We have not left anyone, even if they fled the country, we've gone after them. ED has collected this money and given back to the banks.” At the same time,The Times of Indiadated June 10, 2025, points out that as of April 10, 2025, Mallya’s Kingfisher Airlines still owed the banks around Rs 7,000 crore. The total liabilities with loan defaults, interest and other charges added up to around Rs 18,000 crore. Around Rs 11,000 crore has been repaid and the remaining Rs 7,000 crore remains unpaid. Now, the problem here is that the finance ministry has said on record that properties worth more than Rs 14,000 crore have been recovered and restored to the public sector banks. If Rs 11,000 crore has been repaid, how is Rs 7,000 crore outstanding against liabilities of Rs 18,000 crore. The amount should be lower. A possible explanation is that while these properties may have been restored to the banks but they may not have gotten around to selling all of them. This needs clarification from the government. To conclude, Mallya’s “bad luck” narrative, expertly sold to millions, crumbles under scrutiny. While unfortunate timing played a role, his downfall was fundamentally engineered by expansion into perilous aviation without an understanding of the level of risk, disastrous diversification diluting focus, and alleged financial malfeasance diverting loans. His flamboyant lifestyle, epitomised by the infamous Goa birthday bash while employees suffered, transformed him from King of Good Times into the poster boy for corporate default – the “identified life” India loved to hate. Ultimately, it wasn’t just fate, but a toxic cocktail of hubris, poor judgement, and questionable financial practices that grounded Mallya. In the end Mallya won the ovarian lottery and thenscrewedit up. Vivek Kaul is an economic commentator and a writer. If you liked this piece, let our reporters tell youwhy you should subscribe to Newslaundry. podcast Vijay Mallya **Comments** **You may also like** AboutAbout UsAccessibilityNL ExplainedMeet the teamContact UsCareersPrivacy PolicyTerms of Services **About** About Us Accessibility NL Explained Meet the team Contact Us Careers Privacy Policy Terms of Services **About** About Us Accessibility NL Explained Meet the team Contact Us Careers Privacy Policy Terms of Services SubscriptionSubscribeAccount DetailsNL Legal FundSubscriber FAQPaywall StoriesPodcast LettersStudent Subscription **Subscription** Subscribe Account Details NL Legal Fund Subscriber FAQ Paywall Stories Podcast Letters Student Subscription **Subscription** Subscribe Account Details NL Legal Fund Subscriber FAQ Paywall Stories Podcast Letters Student Subscription Noteworthyन्यूज़लॉन्ड्री हिन्दीMedia BiascopeNewslettersNL StoreNL InterviewsThe Media RumbleBooks **Noteworthy** न्यूज़लॉन्ड्री हिन्दी Media Biascope Newsletters NL Store NL Interviews The Media Rumble Books **Noteworthy** न्यूज़लॉन्ड्री हिन्दी Media Biascope Newsletters NL Store NL Interviews The Media Rumble Books **Follow** **Download the Newslaundry app** © Newslaundry Media Private Limited. All Rights Reserved."}