{"id": 2101, "name": "Popculture.com", "domain": "popculture.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://popculture.com/reality-tv/news/larsa-pippen-talks-really-emotional-season-7-of-rhom-finding-love-with-jeff-coby-after-marcus-jordan-split-exclusive/", "title": "Larsa Pippen Talks Really Emotional Season 7 Of Rhom Finding Love With Jeff Coby After Marcus Jordan Split Exclusive", "content": "TV Streaming Reality TV Celebrity Facebook X YouTube Instagram TVABCNBCCBS ABC NBC CBS ABC NBC CBS StreamingParamount+PeacockMaxNetflixHuluAmazon Prime Paramount+ Peacock Max Netflix Hulu Amazon Prime Paramount+ Peacock Max Netflix Hulu Amazon Prime Reality TVMTVTLCHGTV MTV TLC HGTV MTV TLC HGTV Celebrity Facebook X YouTube Instagram **Larsa Pippen Talks ‘Really Emotional’ Season 7 of ‘RHOM’, Finding Love With Jeff Coby After Marcus Jordan Split (Exclusive)** The Real Housewives of Miamireturn for Season 7 on June 11 at 9 p.m. ET on Bravo. ByAnna Rumer Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Larsa Pippen had a “really tough” time on the upcoming season ofThe Real Housewives of Miamiin the aftermath of hersplit from Marcus Jordan. Ahead of Wednesday’s premiere ofSeason 7 of the Bravo show, Larsa teased the “emotional” episodes ofRHOMto come in an interview with PopCulture.com while revealing how she found true love with new boyfriend Jeff Coby — and how you might also find love with the help of her new dating app. **Videos by PopCulture.com** “I feel like this season is hard because I’m really emotional,” Larsa told PopCulture ofRHOMSeason 7. “It’s hard goingthrough a breakup publicly. I think it was just [that] I’ve never had to be in the situation before.” When Larsa and her ex-husband,NBA legend Scottie Pippen, filed for divorce in October 2016, the Olujo tequila founder said it was a relatively “quiet” split. “You know, people assumed all kinds of things, but it was quiet,” she explained. “It wasn’t necessarily so out there.” Being so open about her split from Jordan on camera, however, was more difficult. “It was really tough to be so open with my emotions and share all that,” she confessed. “Because I feel like, for me, in the past, I only want to talk about the good things. I’m not one of those people that wants to share my darkest moments.” She continued, “I just feel like that sometimes it’s heavy if you’re constantly telling people negative things, and it just weighs on everyone. I’m not like that. But I feel like this season, it was hard. I cried a lot.” Larsa may have been on a dating “detox” during Season 7 ofRHOM, but it wasn’t long before she ran into her current beau at a party. “I feel like we just have so much in common,” Larsa said of Coby. “I think this is the first relationship that I’ve had where it’s so normal. You know, I don’t feel like we have to go out all the time. I don’t think we have to be in the public eye. You know, we just do very normal things. We cook together, we work out together, we go to bed early together, we watch shows together. We just do normal things. And I feel like maybe that’s what I needed all along — a very normal relationship.” When it comes to possibly taking the next step in their relationship, Larsa noted, “I really enjoyed being married. I think that marriage is really nice, and it’s something that I definitely want to go back into. So yeah, definitely, I would get married again.” As Larsa enjoys the loved-up life, she wants to help singles all over find connection as the co-founder ofDate.com. The AI-powered dating app makes meeting men “so easy,” Larsa said, and helps make online dating more privacy- and safety-conscious with features like in-app calling, a date concierge service, and anti-catfishing measures, which include profile photos that have to be taken within the app. “It’s just an amazing app that makes dating easy, fun, [and] safe,” Larsa told PopCulture, adding, “It’s just a smart way of dating, I think, in 2025.” The Real Housewives of Miamireturn for Season 7 on June 11 at 9 p.m. ET on Bravo. **Next Article** ‘1000-lb Sisters’ Star Tammy Slaton Reveals Jaw-Dropping Results of Her Skin Removal Surgery→ **‘1000-lb Sisters’ Star Tammy Slaton Reveals Jaw-Dropping Results of Her Skin Removal Surgery** **‘1000-lb Sisters’ Star Tammy Slaton Reveals Jaw-Dropping Results of Her Skin Removal Surgery** **More Reality** ‘Love & Hip Hop Atlanta’ Season 13 Trailer Revealed **‘Love & Hip Hop Atlanta’ Season 13 Trailer Revealed** **‘Love & Hip Hop Atlanta’ Season 13 Trailer Revealed** Meet All 5 Couples From ‘Married at First Sight’ Season 17 **Meet All 5 Couples From ‘Married at First Sight’ Season 17** **Meet All 5 Couples From ‘Married at First Sight’ Season 17** Netflix Couple Expecting Their First Baby **Netflix Couple Expecting Their First Baby** **Netflix Couple Expecting Their First Baby** ‘Dancing With the Stars’ Couple Sparks Breakup Rumors **‘Dancing With the Stars’ Couple Sparks Breakup Rumors** **‘Dancing With the Stars’ Couple Sparks Breakup Rumors** Tarek El Moussa Cited for Battery Following Alleged Altercation **Tarek El Moussa Cited for Battery Following Alleged Altercation** **Tarek El Moussa Cited for Battery Following Alleged Altercation** **Your inbox just got relevant** Sign up to get the latest pop culture scoop and celebrity news. By signing up, you confirm that you have read and agree to theTerms of Useand acknowledge ourPrivacy Policy. **Most Viewed** (Credit: Liudmila Chernetska / Getty Images)Celebrity19 hours ago‘Hercules’ and ‘Xena’ Actress Dead at 61: RIP to Marise Wipani **‘Hercules’ and ‘Xena’ Actress Dead at 61: RIP to Marise Wipani** **‘Hercules’ and ‘Xena’ Actress Dead at 61: RIP to Marise Wipani** ATLANTA, GEORGIA – JUNE 03: Sean \"Diddy\" Combs attends Black Tie Affair For Quality Control's CEO Pierre \"Pee\" Thomas at Fox Theater on June 02, 2021 in Atlanta, Georgia.Music21 hours agoSean ‘Diddy’ Combs Just Suffered a Big Legal Loss in Trial **Sean ‘Diddy’ Combs Just Suffered a Big Legal Loss in Trial** **Sean ‘Diddy’ Combs Just Suffered a Big Legal Loss in Trial** A ring of vibrant marigold flowers with glowing candles at the center, set against a dark background. (Credit: Eduardo Monroy Husillos / Getty Images)Celebrity3 days agoActress Who Appeared in Dozens of Iconic TV Shows Dead at 90: Daughter Confirms Death of Pippa Scott **Actress Who Appeared in Dozens of Iconic TV Shows Dead at 90: Daughter Confirms Death of Pippa Scott** **Actress Who Appeared in Dozens of Iconic TV Shows Dead at 90: Daughter Confirms Death of Pippa Scott** Celebrity Parents22 hours agoActress/Singer Welcomes Baby No. 2 **Actress/Singer Welcomes Baby No. 2** **Actress/Singer Welcomes Baby No. 2** Sebastian Kahnert/picture alliance via Getty ImagesCelebrity17 hours agoDaytime TV Host Undergoes Surgery to Remove Ovaries and Fallopian Tubes **Daytime TV Host Undergoes Surgery to Remove Ovaries and Fallopian Tubes** **Daytime TV Host Undergoes Surgery to Remove Ovaries and Fallopian Tubes** (Photo by Steve Granitz/WireImage)Celebrity Couples7 hours ago‘Party of Five’ Actor and Wife Break up After 21 Years of Marriage **‘Party of Five’ Actor and Wife Break up After 21 Years of Marriage** **‘Party of Five’ Actor and Wife Break up After 21 Years of Marriage** Photo Credit: iStock / Getty Images PlusCelebrity Parents24 hours agoCountry Music Star and Partner Welcome First Child **Country Music Star and Partner Welcome First Child** **Country Music Star and Partner Welcome First Child** TV Shows2 days agoABC News Correspondent Suspended **ABC News Correspondent Suspended** **ABC News Correspondent Suspended** Facebook X YouTube Instagram TVABCNBCCBS ABC NBC CBS ABC NBC CBS StreamingParamount+PeacockMaxNetflixHuluAmazon Prime Paramount+ Peacock Max Netflix Hulu Amazon Prime Paramount+ Peacock Max Netflix Hulu Amazon Prime Reality TVMTVTLCHGTV MTV TLC HGTV MTV TLC HGTV Celebrity Contact Us Advertising About Careers Privacy Policy Terms of Use"}