{"id": 933, "name": "Mount Airy News", "domain": "mtairynews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mtairynews.com/classifieds/community/announcements/auction/118-laurel-dr-comm-sale-mt-airy/pdfdisplayad_e5f10705-8071-5e6f-ad25-c8eff79ebde2.html", "title": "118 Laurel Dr Comm Sale Mt Airy", "content": "Facebook Twitter Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout e-Edition How-To Circulars Subscribe Manage Subscription (Pay Your Bill, Vacation Request, Update Account Info) Subscriber Savings Newsletter Sign-up Contact Customer Service About Us Contact Us Announcement Forms Online Services Terms of Use Privacy Policy Local News Food and Gardening Special Section Submit News Tips Pilot Mountain News AP Sports Submit Scores and Stories Sports Betting Guide Local Arts & Entertainment Calendar Submit Arts & Entertainment News Local Business AP Business News Stock Market Letters to Editor Columnists Editorials Place an ad Mount Airy Public Notices North Carolina Public Notices SHOP LOCAL Jobs Cars Real Estate Classifieds Place an Ad e-Edition How To Mobile App Facebook Twitter 86°Sunny Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch Home News Sports A&E Business Opinion Obituaries Lifestyles Public Notices Special Sections Circulars **118 Laurel Dr Comm Sale Mt Airy** Facebook Twitter WhatsApp SMS Email Print Copy article link **Details for118 Laurel Dr Comm Sale Mt Airy** Updated16 hrs ago Ad 275107 Auction **Trending Now** Man jailed after shootout with city police Educational foundation director quits after school board meeting, criticism Foundation’s former director discusses sudden resignation Luck Stone buys granite quarry Police reports More Humidity:40% Cloud Coverage:24% Wind:3 mph UV Index:0 Low Sunrise:06:03:32 AM Sunset:08:40:40 PM **Today** Partly cloudy. Low 63F. Winds light and variable. **Tonight** Partly cloudy. Low 63F. Winds light and variable. **Tomorrow** Partly cloudy skies in the morning will give way to cloudy skies during the afternoon. High 87F. Winds light and variable. **Obituaries** Facebook Twitter News Sports Arts & Entertainment Business Opinion Announcements Obituaries On The Vine Online Features Submission Forms Classifieds Place an ad Shop Local Calendar Search Weather Subscriber Savings Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}