{"id": 1537, "name": "Virology Jounral", "domain": "virologyj.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://virologyj.biomedcentral.com/articles/sections/other-viruses-e-g-pox-papilloma-parvo-reoviridae-", "title": "Other Viruses E G Pox Papilloma Parvo Reoviridae ", "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Sections Submission Guidelines **Articles** SectionsClinical VirologyEmerging virusesHepatitis virusesHerpes virusesInfluenza virusesNegative-strand RNA virusesOther viruses (e.g. pox, papilloma, parvo, reoviridae)Plant virusesPositive-strand RNA virusesPublic healthRetrovirusesVeterinary DNA virusesVeterinary RNA virusesViruses of microbes Clinical Virology Emerging viruses Hepatitis viruses Herpes viruses Influenza viruses Negative-strand RNA viruses Other viruses (e.g. pox, papilloma, parvo, reoviridae) Plant viruses Positive-strand RNA viruses Public health Retroviruses Veterinary DNA viruses Veterinary RNA viruses Viruses of microbes Clinical Virology Emerging viruses Hepatitis viruses Herpes viruses Influenza viruses Negative-strand RNA viruses Other viruses (e.g. pox, papilloma, parvo, reoviridae) Plant viruses Positive-strand RNA viruses Public health Retroviruses Veterinary DNA viruses Veterinary RNA viruses Viruses of microbes Collections Reviewer acknowledgements **Other viruses (e.g. pox, papilloma, parvo, reoviridae)** Section Editor:Erna Geessien Kroon,Universidade Federal de Minas Gerais, BrazilDeputy Section Editor:Marco Antônio Campos,Fundação Oswaldo Cruz, Brazil TheOther viruses (e.g. pox, papilloma, parvo, reoviridae)section ofVirology Journalinvites the submission of manuscripts on basic and applied virology that contribute to the scientific knowledge in, but not limited to, the following groups: Papillomavirus Parvovirus Poxvirus Prions Reoviridae Rotavirus The section welcomes virology research manuscripts which include the discovery, biology of the viruses, genomic characterization, bioinformatic analysis, diagnosis, pathogenesis, immunological response, prevention, treatment and epidemiology of the viruses, use of the viruses as vectors, as well as pre-clinical and clinical studies. Editorial Board Manuscript editing services Instructions for Editors SNAPP Editorial Login Contact support for Authors Contact support for Editors Sign up for article alerts and news from this journal **Follow** Follow us on Twitter ISSN: 1743-422X (electronic) Advertisement ISSN: 1743-422X Submission enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}