{"id": 918, "name": "Mitchell Daily Republic", "domain": "mitchellrepublic.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mitchellrepublic.com/sports/northland-outdoors/dokken-memory-of-getting-locked-outside-during-a-thunderstorm-provides-laughter-during-celebration-of-life", "title": "Dokken Memory Of Getting Locked Outside During A Thunderstorm Provides Laughter During Celebration Of Life", "content": "Advertise With Us 📣 Prep Sports 🏀 Photo Galleries 📸 Inside Sports Crime 🚔 Best of Mitchell 🏆 Weather Announcements 🌤️ Advertise With usDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public NoticeGet Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter NewsLocalSouth DakotaNationalWorldThe VaultAgweekForum News Network Local South Dakota National World The Vault Agweek Forum News Network Local South Dakota National World The Vault Agweek Forum News Network Weather SportsPrepCollegeJackrabbits footballCoyotes footballInside SportsPrep BB calendarFCS StandingsProNorthland Outdoors Prep College Jackrabbits football Coyotes football Inside Sports Prep BB calendar FCS Standings Pro Northland Outdoors Prep College Jackrabbits football Coyotes football Inside Sports Prep BB calendar FCS Standings Pro Northland Outdoors Obituaries Health BusinessBusiness Announcements Business Announcements Business Announcements OpinionEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters LifestyleArts / EntertainmentHome / GardenComicsFree Games Arts / Entertainment Home / Garden Comics Free Games Arts / Entertainment Home / Garden Comics Free Games CommunityMilestonesContests & AuctionsCalendarAnnouncements Milestones Contests & Auctions Calendar Announcements Milestones Contests & Auctions Calendar Announcements Podcasts ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ Local InterestMagazine Rack Magazine Rack Magazine Rack AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **Dokken: Memory of getting locked outside during a thunderstorm provides laughter during celebration of life** **So there I was, in T-shirt and skivvies, as the rain poured and the lightning flashed. “Someday, you’re going to look back on this and laugh,” I thought to myself.** WINNIPEG – Saying goodbye to a good friend and fishing partner is hard – gut wrenching, actually – but through the sadness, funny stories inevitably emerge to take the edge off. Such was the case last Saturday, May 24, in Winnipeg, when a sizable crowd of us gathered tocelebrate the life of Jim Stinson,a passionate outdoorsman, retired Royal Canadian Mounted Police officer and good friend to all who knew him. ADVERTISEMENT Jim died March 2 after a three-year battle with multiple myeloma, a form of blood cancer. He was 76 years old. Through pure coincidence I won’t go into here, I was fortunate to spend many a day in the boat with Jim after we first met in June 2003. There were lots of memories over those 20-plus years. I hadn’t planned to write about this particular encounter, but through the urging of some at last weekend’s celebration of life, I’ll share one of those memories. It occurred last June, when Jim and I made a trip to visit friends who have a cabin on Lake of the Prairies in western Manitoba. Formed by a dam on the Assiniboine River,Lake of the Prairies is an absolutely marvelous walleye fishery,and the fishing we enjoyed last year was no exception. A bit of a hiccup – for lack of a better word – occurred on the second evening of our visit when it was discovered the cabin’s septic tank was full and would have to be pumped out, which wouldn’t occur until the next day. Until then, the indoor plumbing would have to be used sparingly. ADVERTISEMENT Before I proceed any further, it should be noted here that Jim was extremely hard of hearing, the result of too much time at the shooting range without ear protection during his time as an RCMP officer. Without his “ears in,” Jim was nearly deaf. A nasty thunderstorm rolled through in the wee hours that night, and Jim and I were in separate bedrooms in the lower level of the cabin. During the height of the thunderstorm, nature’s inevitable call required my attention. So, instead of using the cabin’s precarious indoor plumbing, I opted to step out on the patio for what I expected would be a quick trip. When I turned around to head back inside, I discovered the door had locked behind me. So there I was, in T-shirt and skivvies, as the rain poured and the lightning flashed. “Someday, you’re going to look back on this and laugh,” I thought to myself. ADVERTISEMENT “This,” however, was not one of those times. Given the predicament facing me at that particular moment, my only option was to head for the shelter of an adjacent shower house that had been built the previous summer. Measuring maybe 6x6 feet square, the shower house wasn’t exactly spacious, but at least it would give me protection from the elements. “This is going to be a very long night, I thought to myself,” as I tried to curl up on the bench of the shower house. It would be several hours before anyone was awake. About that time, I noticed the light come on in Jim’s bedroom window, which was clearly visible from my vantage point in the shower house. His reason for rising was likely the same as mine, but he’d opted to avoid going outside into a heavy thunderstorm. Good choice, it turns out. Thinking my rescue was imminent, I stepped back outside into the pouring rain, climbed a small ladder that stood nearby and proceeded to knock on Jim’s bedroom window. Jim, who was looking the other direction, didn’t have his hearing aids in and couldn’t hear my efforts to get his attention. All things considered, that’s probably just as well because I’m sure I would have been quite a sight, standing on a ladder in the pouring rain looking in through his window. ADVERTISEMENT “This can’t be happening,” I thought to myself. Fortunately, one of our hosts heard the commotion from their upstairs bedroom and came down to see what was going on; I was soon back inside. Jim, through it all, was completely oblivious. All’s well that ends well, as the old saying goes, and by early afternoon, the septic tank was pumped out. The storm had passed and, I’m glad to say, the humor of my earlier predicament wasn’t lost on me. Later that afternoon, I was standing on the upstairs deck looking at the woods below – and the lake beyond that – when a black bear sauntered by the lower-level patio where I’d been stuck outside in the rain just hours earlier. Uffda. Last weekend, while celebrating Jim’s life, we all had a chuckle about my little misadventure; it was a moment of laughter amid the resounding loss. ADVERTISEMENT Next time, I joked, I’ll make sure the door isn’t locked. ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersToday’s PaperOur News Network Subscription Options Email Newsletters Today’s Paper Our News Network Subscription Options Email Newsletters Today’s Paper Our News Network ContactGet HelpContact Us​Advertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us ​Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us ​Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Facebook"}