{"id": 1839, "name": "Wake Up World", "domain": "wakeup-world.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://wakeup-world.com/2024/04/10/up-to-11-million-tonnes-of-plastic-found-resting-on-the-ocean-floorunveiling-the-hidden-depths-the-ocean-floor-as-a-final-resting-place-for-plastic-pollution/", "title": "Up To 11 Million Tonnes Of Plastic Found Resting On The Ocean Floorunveiling The Hidden Depths The Ocean Floor As A Final Resting Place For Plastic Pollution", "content": "About Contact Email Sign Up Your Path to Financial Freedom Learn Mindful Meditation Free Wellbeing Events Facebook x.com Youtube Pinterest Instagram RSS Feed EnvironmentENVIRONMENT (Browse All)AnimalsFrackingGeoengineering (Chemtrails)GMOs & MonsantoHAARPPlants and AgricultureSustainabilityThe Nuclear Era ENVIRONMENT (Browse All) Animals Fracking Geoengineering (Chemtrails) GMOs & Monsanto HAARP Plants and Agriculture Sustainability The Nuclear Era ENVIRONMENT (Browse All) Animals Fracking Geoengineering (Chemtrails) GMOs & Monsanto HAARP Plants and Agriculture Sustainability The Nuclear Era HealthHEALTH (Browse All)AddictionAutism & ADHDAutoimmune & degenerative diseasesBig PharmaCancerCannabis & HempDepression, Anxiety & Mental HealthDetoxFluorideGMOsHealthy RecipesNatural SolutionsNutritionPharmaceuticalsSeeds, Oils, Herbs & SpicesWifi / EMF HEALTH (Browse All) Addiction Autism & ADHD Autoimmune & degenerative diseases Big Pharma Cancer Cannabis & Hemp Depression, Anxiety & Mental Health Detox Fluoride GMOs Healthy Recipes Natural Solutions Nutrition Pharmaceuticals Seeds, Oils, Herbs & Spices Wifi / EMF HEALTH (Browse All) Addiction Autism & ADHD Autoimmune & degenerative diseases Big Pharma Cancer Cannabis & Hemp Depression, Anxiety & Mental Health Detox Fluoride GMOs Healthy Recipes Natural Solutions Nutrition Pharmaceuticals Seeds, Oils, Herbs & Spices Wifi / EMF HomeHOME & GARDEN (Browse All)AquaponicsD.I.Y. and Self SufficiencyGardeningHealthy RecipesNatural CleaningSurvival & Disaster Preparation HOME & GARDEN (Browse All) Aquaponics D.I.Y. and Self Sufficiency Gardening Healthy Recipes Natural Cleaning Survival & Disaster Preparation HOME & GARDEN (Browse All) Aquaponics D.I.Y. and Self Sufficiency Gardening Healthy Recipes Natural Cleaning Survival & Disaster Preparation LifeLOVE & LIFE (Browse All)Family & ParentingRelationshipsRelax & Be InspiredSelf-Discovery & EmpowermentTrauma & Healing LOVE & LIFE (Browse All) Family & Parenting Relationships Relax & Be Inspired Self-Discovery & Empowerment Trauma & Healing LOVE & LIFE (Browse All) Family & Parenting Relationships Relax & Be Inspired Self-Discovery & Empowerment Trauma & Healing RecommendedFree Summits, Videos and EventsThe Good NewsRelax and be InspiredDown the Rabbit HoleWake Up Free Summits, Videos and Events The Good News Relax and be Inspired Down the Rabbit Hole Wake Up Free Summits, Videos and Events The Good News Relax and be Inspired Down the Rabbit Hole Wake Up Science & TechSCIENCE & TECH (Browse All)EnvironmentDNA & The Human BodyEnergy & ResourcesGenetic EngineeringHealth & MedicalOur UniversePlants and AgriculturePsychologyThe Nuclear Era SCIENCE & TECH (Browse All) Environment DNA & The Human Body Energy & Resources Genetic Engineering Health & Medical Our Universe Plants and Agriculture Psychology The Nuclear Era SCIENCE & TECH (Browse All) Environment DNA & The Human Body Energy & Resources Genetic Engineering Health & Medical Our Universe Plants and Agriculture Psychology The Nuclear Era SocietySOCIETY (Browse All)CommunityCorporationsEducationFinancial SystemGovernmentHistoryMediaSovereigntyWar & Peace SOCIETY (Browse All) Community Corporations Education Financial System Government History Media Sovereignty War & Peace SOCIETY (Browse All) Community Corporations Education Financial System Government History Media Sovereignty War & Peace SpiritualSPIRITUAL (Browse All)AstrologyDNA & Pineal ActivationEnergy HealingEnergy & VibrationInterventionMeditation, Yoga, Grounding & MindfulnessMultidimensionalityPhilosophyPsychedelicsThe MatrixThe Shift SPIRITUAL (Browse All) Astrology DNA & Pineal Activation Energy Healing Energy & Vibration Intervention Meditation, Yoga, Grounding & Mindfulness Multidimensionality Philosophy Psychedelics The Matrix The Shift SPIRITUAL (Browse All) Astrology DNA & Pineal Activation Energy Healing Energy & Vibration Intervention Meditation, Yoga, Grounding & Mindfulness Multidimensionality Philosophy Psychedelics The Matrix The Shift WritersWRITERS (Browse All)Aletheia LunaAlexandra “Earthie Mama” Du ToitCarolanne WrightDr. Edward F. GroupDr. Joseph MercolaEthan Indigo SmithHilde LarsenJack Adam WeberJessie KlassenJuliet TangLissa Rankin MDLorna BevanMakia FreemanMarco TorresMateo SolNanice EllisNikki HarperNick PolizziOpenPaul A. PhilipsPaul LendaSayer JiSergey Baranov WRITERS (Browse All) Aletheia Luna Alexandra “Earthie Mama” Du Toit Carolanne Wright Dr. Edward F. Group Dr. Joseph Mercola Ethan Indigo Smith Hilde Larsen Jack Adam Weber Jessie Klassen Juliet Tang Lissa Rankin MD Lorna Bevan Makia Freeman Marco Torres Mateo Sol Nanice Ellis Nikki Harper Nick Polizzi Open Paul A. Philips Paul Lenda Sayer Ji Sergey Baranov WRITERS (Browse All) Aletheia Luna Alexandra “Earthie Mama” Du Toit Carolanne Wright Dr. Edward F. Group Dr. Joseph Mercola Ethan Indigo Smith Hilde Larsen Jack Adam Weber Jessie Klassen Juliet Tang Lissa Rankin MD Lorna Bevan Makia Freeman Marco Torres Mateo Sol Nanice Ellis Nikki Harper Nick Polizzi Open Paul A. Philips Paul Lenda Sayer Ji Sergey Baranov **Revealed: Up to 11 Million Tonnes of Plastic Found Resting on the Ocean Floor** April 10th, 2024 ByJohn Patterson Staff Writer forWake Up World In a groundbreaking study, our ocean floors’ vast, uncharted territories were revealed as the ultimate reservoirs of plastic pollution. This study challenged our understanding of oceanic waste management and its impact on marine ecosystems. With new research from CSIRO, Australia’s national science agency, and the University of Toronto, we are now closer to comprehending the magnitude of this issue and the urgent need for action. **The Alarming Reality of Ocean Floor Pollution** **The Surprising Scale of the Crisis** “Every minute, a garbage truck’s worth of plastic enters the ocean,” begins a startling revelation from the collaborative research by CSIRO and the University of Toronto. This research brings to light the first estimate of the colossal amount of plastic pollution that finds its way to the ocean floor, which could be as high as 11 million tonnes. With the use of plastic expected to double by 2040, understanding the journey of this pollution becomes not just a matter of scientific inquiry but a dire necessity for marine conservation efforts. **A Deep Dive into the Findings** Dr Denise Hardesty, a Senior Research Scientist with CSIRO, shared, “We discovered that the ocean floor has become a resting place, or reservoir, for most plastic pollution, with between 3 to 11 million tonnes of plastic estimated to be sinking to the ocean floor.” This research not only quantifies the issue but also highlights the longevity of plastic waste, which accumulates and gradually breaks down into smaller pieces, eventually mixing with ocean sediment. **The Deep Ocean: A Permanent Sink for Plastics** **Beyond Surface Pollution** Ms Alice Zhu, a PhD from the University of Toronto who led the study, pointed out a critical comparison: the estimate of plastic pollution on the ocean floor could be up to 100 times greater than the amount of plastic floating on the ocean’s surface. This emphasizes the gravity of the issue, as the ocean surface has often been the primary focus of pollution studies and clean-up efforts. “The ocean surface is a temporary resting place of plastic, so it is expected that ifwe can stop plastic entering our oceans, the amount would be reduced,” Ms. Zhu noted. However, her research found that plastic continues to find its way into the deep ocean, making it a permanent reservoir for marine plastic pollution. **Insights from Predictive Models** The study employed two predictive models based on data from remote-operated vehicles (ROVs) and bottom trawls to estimate the distribution of plastic on the ocean floor. Findings reveal that plastic mass clusters around continents, with approximately half of the predicted plastic mass residing above 200 m depth. Surprisingly, inland and coastal seas, despite their smaller surface area compared to the open ocean, are predicted to hold as much plastic mass as the rest of the ocean floor. **Moving Forward: Towards a Solution** **Filling the Knowledge Gap** “These findings help to fill a longstanding knowledge gap on the behaviour of plastic in the marine environment,” stated Ms. Zhu. By understanding the forces driving the transport and accumulation of plastic in the deep ocean, we can better inform source reduction and environmental remediation efforts. This is crucial for mitigating the risks that plastic pollution poses to marine life. **A Call to Action** This research forms part ofCSIRO’s Ending Plastic Waste Mission, which aims to revolutionize how we produce, use, recycle, and dispose of plastic. It’s a clarion call for collective action, urging us to reconsider our relationship with plastic and its lasting impact on the planet’s most remote and unexplored habitats. As this study’s findings circulate, they serve as a poignant reminder of our interconnectedness with the natural world and the urgent need for sustainable practices to protect our oceans. The path to a cleaner, healthier marine environment is complex, but with informed action and global cooperation, it is within reach. **Practical Steps to Combat Ocean Floor Plastic Pollution** In light of the sobering revelations regarding the scale of plastic pollution settling on the ocean floor, it becomes imperative for each of us to take actionable steps to mitigate this crisis. Here are practical ways individuals and communities can contribute to reducing the influx of plastic into our oceans and safeguarding marine ecosystems. **For Individuals and Households:** Reduce Plastic Usage:Begin by minimizing your reliance on single-use plastics. Opt for reusable alternatives such as water bottles, shopping bags, and straws. Every small change contributes to a larger impact. Proper Waste Management:Ensure that plastic waste is correctly disposed of and, where possible, recycled. Participate in local recycling programs and educate yourself on which plastics are recyclable in your area. Support Eco-Friendly Brands:Purchase products from companies that prioritize sustainable packaging and are committed to reducing plastic waste. Your spending power can drive positive change in corporate practices. Beach Clean-Ups:Participate in or organize local beach clean-ups. This direct action not only removes waste from marine environments but also raises awareness about the severity of ocean pollution. **For Communities:** Educational Programs:Implement educational initiatives in schools and community centers to teach the importance of reducing plastic waste and proper recycling practices. Infrastructure for Recycling:Develop and enhance community recycling facilities to make it easier for residents to recycle. Properly managed waste reduces the likelihood of plastics entering waterways. Policy Advocacy:Advocate for local policies that limit single-use plastics and encourage businesses to adopt sustainable practices. Community support for environmental regulations can influence policymakers. **Final Thoughts** The journey to significantly reduce the plastic ending up on ocean floors is daunting but necessary. It requires concerted efforts from individuals, communities, and governments worldwide. By adopting sustainable practices, advocating for change, and supporting research and innovation, we can protect our oceans for future generations. Let’s take these steps together, embracing our responsibility to heal and preserve our planet’s magnificent marine ecosystems. Journal Reference: Xia Zhu, Chelsea M. Rochman, Britta Denise Hardesty, Chris Wilcox.Plastics in the deep sea – A global estimate of the ocean floor reservoir.Deep Sea Research Part I: Oceanographic Research Papers, 2024; 206: 104266 DOI:10.1016/j.dsr.2024.104266 About the author: John Patterson is an avid writer and researcher who delves into the latest scientific research. With an insatiable curiosity, he translates complex concepts into accessible narratives, allowing readers to embark on a journey of discovery. John bridges the gap between experts and the public through his work, igniting curiosity and inspiring meaningful conversations about scientific breakthroughs. [pro_ad_display_adzone id=”110027″] **You may also like** **Eat Your Way to Happiness: New Study Changes Everything** **Defy Age with Movement: Older Adults’ Power of Exercise for Mind and Body** **Barefoot Bliss: Ranking the Best Natural Grounding Methods** **Science-Backed Magic: Music’s Benefits for Humans, Plants, Pets** **Your Bedtime Scroll Sabotages Your Brain by 59%, Study Warns** **The Power of Food: Research Shows African Diets Heal, Western Ones Harm** facebook x instagram pinterest telegram youtube Please Consider a Donation Rediscover the Ancient Anti-Aging Wisdom Hidden in These 10 Powerful Herbs You Are Not Who You Think You Are – Here’s Why Unlocking Your Supernatural Self: The Teachings of Dr. Joe Dispenza Ancient Remedies Your Doctor Doesn’t Know About Help That Goes Where They Go: Helping Seniors Stay Safe Anywhere Eat Your Way to Happiness: New Study Changes Everything Are These 7 Spiritual Beliefs Blocking Your Awakening? Free-Form Dance Provides Health Benefits Comparable to Traditional Exercise Astrology Forecast May 11th – 18th 2025 – Dispelling Old Ghosts Transcend Inherited Trauma: Reclaim Your Power Through Somatic Practices Home About Wake Up World Contact Us Free Online Wellness Events Join Wake Up World: Get Our Newsletter & Access to Free Courses Disclaimer Privacy Policy Site Map"}