{"id": 1448, "name": "This Day Live", "domain": "thisdaylive.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thisdaylive.com/2025/06/11/first-lady-inaugurates-mega-technical-vocational-college-in-enugu-explains-why-tinubu-supports-leaders-like-mbah/", "title": "First Lady Inaugurates Mega Technical Vocational College In Enugu Explains Why Tinubu Supports Leaders Like Mbah", "content": "Wednesday, 11th June, 2025 Home Business Politics Nigeria InternationalAfricaRest of the World Africa Rest of the World Africa Rest of the World Health & Wellbeing Education Life & Style Sport Editorial Backpage **June 12th and the Pothole Theory** **FG Debunks Reports on Collapse of Forward Crude Oil Sales** **June 12: Tinubu to Address National Assembly Joint Session, Cancels 7am National Broadcast** **FG Debunks Reports of Collapse of Forward Crude Oil Sales** **First Lady Inaugurates Mega Technical/Vocational College in Enugu, Explains Why Tinubu Supports Leaders Like Mbah** First Lady, Senator Oluremi Tinubu, has explained President Bola Tinubu’s support for Governor Peter Mbah administration in Enugu, saying her husband would always support leaders, who judiciously deploy public funds for the common good of the people. Mrs. Tinubu made the revelation during the commissioning of the Technical, Vocational Education and Training College, GTC, Enugu, on the sidelines of her just-concluded two-day working visit to Enugu State. It is recalled that Governor Mbah Administration inherited a highly dilapidated Government Technical College, GTC, Enugu, which it demolished about 11 months ago to erect a Technical, Vocational Education and Training (TVET) College comprising 24 ultra-modern skill training centres and massive hostels for 1,000 resident students. The government equally built two Smart Green Schools in the quite expansive premises. Speaking during the commissioning, Senator Tinubu, who noted the increased federal allocations accruing to the states under the Tinubu Administration, stressed the need for leaders to deploy the resources in the service of the people. “I am really excited. Like some critics will say that Mr. President is really in support of the governor here. Now your allocation has tripled. The president will be happy to associate with the people, who are using the resources of this nation judiciously. And this is part of it. And we are excited. “The slogan for Enugu state is ‘Tomorrow is Here’ and tomorrow is indeed here. This is just a glimpse of a better tomorrow that our children and even generations yet unborn will enjoy,” she stated. In his remark, Governor Mbah said the project was the first of the eight Technical, Vocational Education and Training Colleges meant for each of the eight Federal Constituencies of the state to equip the youth with skills to shape the future. He explained that his government decided to break away from the outdated system of memorisation to experiential learning, stressing that no nation could be greater than its human capital. Mbah said that with the TVETs and other modern post-basic education schools being built, graduates of Green Smart Schools would sustain their upward trajectory in experiential and smart learning. “So, today is a great day for us. It is a launch further into our vision to transform education in Enugu State. We are profoundly honoured and delighted that you were able to make out time to commission the TVET, Government Technical College,” he stated. Giving further insight into the project, the Commissioner for Education, Prof. Ndubueze Mbah, said TVETs were geared towards empowering the youth with skills and knowledge in response to emerging industry needs. “The new GTC Enugu is made up of 24 ultramodern skill and training centres, which include ICT and Digital Innovation Hub, Renewable Energy, Weldieng and Fabrication, Auto-Mechatronics, Refrigeration and Air Conditioning, Electrical Installation, Fashion Design and Garment Making, Hospitality Training, and others equipped with twenty-four ultra-modern skill training centres. “It is supported by two massive modern hostels accommodating 1,000 resident students. The new GTC, Enugu, is a milestone realisation of an audacious vision, that enables a transition from the Enugu Smart Green Schools, into professional workforce and masterful skills development for the youth of Enugu State,” Prof. Mbah explained. Recall that President Tinubu had during his official visit to Enugu on 4th January to inaugurate some iconic projects executed by the Governor Mbah Administration also said he was more interested in performance than political affiliations. “He is doing a fantastic job. The election is over and we have to move the nation forward. You have demonstrated that irrevocable commitment towards human development. I don’t care which party you come from. You are my friend. You are doing well and very focused,” the president had asserted. **Related Articles** Founded on January 22, 1995, THISDAY is published by THISDAY NEWSPAPERS LTD., 35 Creek Road Apapa, Lagos, Nigeria with offices in 36 states of Nigeria , the Federal Capital Territory and around the world. It is Nigeria’s most authoritative news media available on all platforms for the political, business, professional and diplomatic elite and broader middle classes while serving as the meeting point of new ideas, culture and technology for the aspirationals and millennials. The newspaper is a public trust dedicated to the pursuit of truth and reason covering a range of issues from breaking news to politics, business, the markets, the arts, sports and community to the crossroads of people and society. Home About Us Privacy Policy Terms & Conditions You can email us at: hello@thisdaylive.com or visit ourcontact uspage. Home Business Politics Nigeria InternationalAfricaRest of the World Africa Rest of the World Africa Rest of the World Health & Wellbeing Education Life & Style Sport Editorial Backpage"}