{"id": 1257, "name": "Showbiz411", "domain": "showbiz411.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.showbiz411.com/2023/11/02/review-bradley-coopers-maestro-is-a-brilliant-but-brutal-major-work-with-oscars-written-all-over-it-especially-for-carey-mulligan", "title": "Review Bradley Coopers Maestro Is A Brilliant But Brutal Major Work With Oscars Written All Over It Especially For Carey Mulligan", "content": "Home Celebrity Movies Music Television Theater Reviews **Browse:** Home Celebrity Movies Music Television Theater Reviews **Company:** About Partner with us **Support Showbiz411** Support independent journalism, free from the trades and other publications that are part of the tinsel town machine. For 12 years, Showbiz411.com has been covering Hollywood, Broadway, the music business and the business of celebrity. Ads are our main source of funding, but contributions (not tax exempt) from readers who enjoy the scoops, exclusives, and fact based reports are always welcome and very appreciated. To inquire about ads, email us at showbiz411@gmail.com. Home Celebrity Movies Music Television Theater Reviews **Review: Bradley Cooper’s “Maestro” Is a Brilliant But Brutal Major Work with Oscars Written All Over It, Especially for Carey Mulligan** Share Bradley Cooper is a real filmmaker. “A Star is Born” was no fluke. Cooper’s movie about composer Leonard Bernstein is brutal and brilliant. Cooper stars as the genius conductor of great symphonies and the writer of, among other things, “West Side Story.” Carey Mulligan plays his long suffering — and that’s an understatement — Felicia. Each of these actors are so sensational they are guaranteed Oscar nominations. And lots of accolades. What “Maestro” isn’t about is the life of Leonard Bernstein. This is not a biopic. It focuses most specifically on the love story, and the marriage. It’s also largely about Bernstein’s ego, his lack of regard for anyone but himself, and Felicia’s struggle to be free of him and yet remain in his orbit. The relationship is fascinating and devastating and makes for an actual drama. But “Maestro” is not, as I’ve read in some weird pieces, Oscar “bait.” It is what is, a film that will be examined for years to come for its sophistication and accomplishment. The movie begins in a whirlwind as Bernstein, who is clearly gay, falls for Felicia, a Chilean Jewish beauty. Cooper is disarming in his approach both as a director and actor. The pair are so consumed with each other that they don’t just finish each other’s sentences, their dialogue overlaps.. They’re high, giddy on love and the adrenaline of finding soulmates. They marry and have children quickly. Cooper kind of skips through their earliest time together to a quarter of the way in when it’s clear Felicia has accepted that Lenny has a double life she’s resigned to. He’s a huge international sensation, the money has rolled in, they’re living in the Dakota, New York’s most prestigious building. Up to this point, Lenny has fastidiously compartmentalized his life. But with fame and money, he gets sloppy. That outsized ego makes him feel like he’s above pretending about his lovers. Into this mix comes a more permanent boyfriend (played by Gideon Glick, the strange magician from “Mrs. Maisel”) whose presence in the family is exacerbated by Lenny’s lack of a filter. There are some set pieces in this film that just blow the roof off. Two that come to mind: Felicia finally losing it in their Dakota bedroom while the Thanksgiving parade goes by outside featuring a Snoopy balloon. Mulligan is devastating. Cooper is every bit her match if not more so, especially when Bernstein is transcendentally conducting orchestras. He seems like he’s levitating, the look of joy on his face is beatific to say the least. You can see why both Steven Spielberg and Martin Scorsese have their names on “Maestro” as producers, regardless of business deals. They know Cooper is the real thing. Netflix has their best film yet, even if it doesn’t win Best Film — “Oppenheimer” and “Killers of the Flower Moon” are Bigger Ideas. But “Maestro” is a tour de force, with performances (Sarah Silverman is outstanding as Lenny’s sister, as is Maya Hawke as Jamie Bernstein) that will live on and on. Of course, the production values are as high as possible, with sets, cinematography all of it steeped in detail and nuance. (Give the makeup department its Oscar now.) But it’s the music, the glorious music, that fills the silences between Lenny and Felicia and becomes its own character. Stay through the end credits. There’s no Marvel-esque scene, but the score is an unmissable grace note to what has come before. Showbiz411 is now in its 13th year of providing breaking and exclusive entertainment news. This is an independent site, unlike the many Hollywood trades that are owned by one company. To continue providing news that takes a fresh look at what's going on in movies, music, theater, etc, advertising is our basis. Reader donations would be greatly appreciated, too. They are just another facet of keeping fact based journalism alive.Thank you Read more **Sad News: Brian Wilson, Beloved Founder of the Beach Boys, Dies at 81, American Icon, Five Star Composer, Singer** **Exclusive: Don’t Expect $40 Mil Melania Trump Documentary from Amazon Until January, Will Definitely Skip Awards Season** **Trump Parade: Forecast Calls for Pain, and Rain, Thunderstorms, But Smooth Sailing for the Pope in Chicago** **RIP Actor Chris Robinson, 86, The Last of the Famous “General Hospital” Foursome That Brought the Show Back to Life** **Broadway: “Smash,” the Musical Made from a Failed TV Show, Will Close June 22nd After Receiving No Love from Tony Awards** **Sad News: Brian Wilson, Beloved Founder of the Beach Boys, Dies at 81, American Icon, Five Star Composer, Singer** **Exclusive: Don’t Expect $40 Mil Melania Trump Documentary from Amazon Until January, Will Definitely Skip Awards Season** **Trump Parade: Forecast Calls for Pain, and Rain, Thunderstorms, But Smooth Sailing for the Pope in Chicago** **RIP Actor Chris Robinson, 86, The Last of the Famous “General Hospital” Foursome That Brought the Show Back to Life** Hollywood to the Hudson Company About Partner with us Trending **Sad News: Brian Wilson, Beloved Founder of the Beach Boys, Dies at 81, American Icon, Five Star Composer, Singer** **Exclusive: Don’t Expect $40 Mil Melania Trump Documentary from Amazon Until January, Will Definitely Skip Awards Season** **Trump Parade: Forecast Calls for Pain, and Rain, Thunderstorms, But Smooth Sailing for the Pope in Chicago** Categories Celebrity7100 Movies6469 Music5573 Television3771 Business1440 Theater1372 Privacy Policy Sitemap © Showbiz411.com"}