{"id": 940, "name": "KIDY - Fox West Texas", "domain": "myfoxzone.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.myfoxzone.com/article/news/crime/tom-green-county-sheriffs-identifies-deceased-man-found-near-mineral-wells-crossing/504-4cf64b3d-6702-4512-95f4-72fcbef05535", "title": "Tom Green County Sheriffs Identifies Deceased Man Found Near Mineral Wells Crossing", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalHealthNear MeNation WorldInvestigationsEducationEntertainmentMoneyPoliticsCrimeLatest News StoriesBudding artist PHNX shines bright with 'Amy's Back in Austin' remake collaborationHardin-Simmons University names Jill Jumper as dean of College of Health Professions Back Local Health Near Me Nation World Investigations Education Entertainment Money Politics Crime Budding artist PHNX shines bright with 'Amy's Back in Austin' remake collaboration Hardin-Simmons University names Jill Jumper as dean of College of Health Professions Back Local Health Near Me Nation World Investigations Education Entertainment Money Politics Crime Budding artist PHNX shines bright with 'Amy's Back in Austin' remake collaboration Hardin-Simmons University names Jill Jumper as dean of College of Health Professions WeatherBackForecastRadar10-DayHourlyMapsTrafficLatest Weather StoriesWest Texas Weather with Britton Musall: Storms possible Wednesday afternoonStorm rips through Fisher County Back Forecast Radar 10-Day Hourly Maps Traffic West Texas Weather with Britton Musall: Storms possible Wednesday afternoon Storm rips through Fisher County Back Forecast Radar 10-Day Hourly Maps Traffic West Texas Weather with Britton Musall: Storms possible Wednesday afternoon Storm rips through Fisher County SportsBackHigh School SportsCollege SportsNFL FootballMLB BaseballLocked On Podcast NetworkLatest StoriesA look at Sean Miller, the 20-year head coaching veteran aiming to elevate Texas basketballMock draft Monday: Is a wideout in round one the play for Cowboys? Back High School Sports College Sports NFL Football MLB Baseball Locked On Podcast Network A look at Sean Miller, the 20-year head coaching veteran aiming to elevate Texas basketball Mock draft Monday: Is a wideout in round one the play for Cowboys? Back High School Sports College Sports NFL Football MLB Baseball Locked On Podcast Network A look at Sean Miller, the 20-year head coaching veteran aiming to elevate Texas basketball Mock draft Monday: Is a wideout in round one the play for Cowboys? SearchSearch:Search Advertise With Us In Case You Missed It FOX Football Live Jobs TV Listings **Tom Green County Sheriff's Office identifies deceased man that was found near Mineral Wells Crossing** TOM GREEN COUNTY, Texas — Authorities have identified a body found last Thursday near Mineral Wells Crossing as a Christoval man reported missing days earlier. The Tom Green County Sheriff's Office confirmed the deceased is Abram David Clark, 39. Deputies were notified around 12:22 p.m. last Thursday of a body discovery. Responding deputies located a deceased male with an apparent gunshot wound and a firearm nearby. Clark had been reported missing from the Christoval area several days before his body was found. An autopsy was conducted by the Texas Panhandle Forensics office. The investigation remains ongoing. The Tom Green County Sheriff's Office is asking anyone with information to contact them at 325-655-8111. Update: Tom Green County Sheriff's Office identifies deceased individual found near Mineral Wells Crossing The Tom... **Related Articles** Commissioner talks speed limit drop on Schwartz Road Suspect still at large after leading law enforcement on high speed chase High-risk arrest of fugitive executed by San Angelo sheriff's office **** To stream FOX WEST TEXAS on your phone, you need the FOX WEST TEXAS app. **** **Download the FOX WEST TEXAS app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video In Other News **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}