{"id": 111, "name": "Autistic Self Advocacy Network (ASAN)", "domain": "autisticadvocacy.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://autisticadvocacy.org/2025/05/crisis-of-confidence-robert-f-kennedy-jr-continues-to-use-his-position-at-hhs-to-promote-lies-about-autism-public-health/", "title": "Crisis Of Confidence Robert F Kennedy Jr Continues To Use His Position At Hhs To Promote Lies About Autism Public Health", "content": "AboutAbout ASANWho We AreWhat We DoWhat We BelieveEquity and Strategic PlansFAQs About ASAN Who We Are What We Do What We Believe Equity and Strategic Plans FAQs About ASAN Who We Are What We Do What We Believe Equity and Strategic Plans FAQs Action CenterAction CenterAction AlertsFind My OfficialsIssue Tracker Action Center Action Alerts Find My Officials Issue Tracker Action Center Action Alerts Find My Officials Issue Tracker ResourcesResource LibraryAbout AutismIdentity-First LanguageAccessibility ResourcesTeighlor McGee Grassroots Mini Grants Resource Library About Autism Identity-First Language Accessibility Resources Teighlor McGee Grassroots Mini Grants Resource Library About Autism Identity-First Language Accessibility Resources Teighlor McGee Grassroots Mini Grants Browse by Get InvolvedAffiliate GroupsGet our NewsletterRun for Team ASANVolunteerFollow UsBecome a Member Affiliate Groups Get our Newsletter Run for Team ASAN Volunteer Follow Us Become a Member Affiliate Groups Get our Newsletter Run for Team ASAN Volunteer Follow Us Become a Member Donate AboutAbout ASANWho We AreWhat We DoWhat We BelieveEquity and Strategic PlansFAQs About ASAN Who We Are What We Do What We Believe Equity and Strategic Plans FAQs About ASAN Who We Are What We Do What We Believe Equity and Strategic Plans FAQs Action CenterAction CenterAction AlertsFind My OfficialsIssue Tracker Action Center Action Alerts Find My Officials Issue Tracker Action Center Action Alerts Find My Officials Issue Tracker ResourcesResource LibraryAbout AutismIdentity-First LanguageAccessibility ResourcesTeighlor McGee Grassroots Mini Grants Resource Library About Autism Identity-First Language Accessibility Resources Teighlor McGee Grassroots Mini Grants Resource Library About Autism Identity-First Language Accessibility Resources Teighlor McGee Grassroots Mini Grants Browse by Get InvolvedAffiliate GroupsGet our NewsletterRun for Team ASANVolunteerFollow UsBecome a Member Affiliate Groups Get our Newsletter Run for Team ASAN Volunteer Follow Us Become a Member Affiliate Groups Get our Newsletter Run for Team ASAN Volunteer Follow Us Become a Member Donate Home Latest Posts Statement Crisis of confidence: Robert F Kennedy Jr. continues to use his position at HHS to promote lies about autism & public health. **Crisis of confidence: Robert F Kennedy Jr. continues to use his position at HHS to promote lies about autism & public health.** May 15, 2025 The Autistic Self Advocacy Network is alarmed at Robert F Kennedy (RFK) Jr.’s continued choice to prioritize unethical junk science and dangerous misinformation about the autistic community in his role as head of the Department of Health and Human Services (HHS). His actions continue to harm our community and those working to improve our lives. Yesterday, during a Senatehearing, Secretary Kennedy continued to promotefalse claims about vaccinesthat are intended todiscourage vaccination. He continued to display ignorance of the operations of his own department. He repeatedly promotedfalse theories and harmful “cures” for autism. Secretary Kennedy claimed in the hearing that theplanned autism registrywill anonymize private data, be voluntary, and allow people to opt out, the first time that this latter claim has been made. We will hold the administration accountable on this front, and alert the community if autistic people’s privacy rights are at risk. However, the biggest threat posed by this project appears to be that it will be used to support medical experimentation on autistic individuals, done by quacks likethe Geiers. During the hearing, Kennedy specifically mentioned using the registry to evaluate dangerous psuedo-therapies like chelation. Chelation is a treatment for heavy metal poisoning whose inappropriate use as an autism treatment hasalready killed one child in the past. These quack experiments ignore safety, existing science, and ethical standards of medicine meant to protect us. One Senator at the hearing described Secretary Kennedy as taking a “compassionate” approach to autistic people and our families. But a truly compassionate approach would focus on meeting autistic people where we are and giving us the supports we need to thrive. Instead, it is clear that Secretary Kennedy sees us as experimental subjects whose health and safety from abusive medical treatment is secondary to vindicatinghis own views on vaccines and autism. He is determined to try to find a“cure” for autismdespite the discredited methods he mentions beingrepeatedly disproven. He also continued to defend thehiring of David Geier, claiming that the judgment of the Maryland medical board that fined him for practicing medicine without a license was later overturned and that Geier had been vindicated. This is a lie. David Geier never had a medical license. His father Mark Geierused to, before he lost it forconducting unethical medical experiments on autistic people using high amounts of a cancer treatment drug(with David’s help). While there was some litigation over whether Maryland released private medical information about the Geiers, the Maryland State Board of Physicians’ decisions about Mark and David Geier were not overturned. None of this changes the facts of theabuses he committedor the fact he was practicing medicine without a medical license. Kennedy claims that Geier’s role at HHS is focused on investigating a vaccine safety database he hadpreviously had access to in the early 2000s. During this time, the Geiers were accused of improperly accessing this data to pursue their claims about vaccines and autism, misusing it in ways that threatened patient privacy, and trying to walk off with the data. The Geiers had their access removed because of this misconduct, and this database has remained a focal point of anti-vaccine conspiracy theorists, including Secretary Kennedy, ever since. This past week, ASAN, along with other organizations, extended to RFK anopportunity to listen to our community, learn what our concerns and priorities are, and have his own misconceptions and misunderstandings about autistic people corrected. Kennedy refused to attend. We regret the missed opportunity for him to learn from us. This, sadly, is not the first such missed opportunity. His department has refused to meet with our and other organizations that advocate for the rights of autistic people since the start of this administration, evencancelling routine community updates from the Centers for Disease Control’s Human Development and Disability section. RFK has cancelled a number of programs. He notably does not know what many of the programs he has cut do. This includes the HHS closing its Long COVID office, despite RFK Jr. having a son with Long COVID and the National Institutes of Health, which study neurodegenerative disease — something he claims to care about. He claims that cuts to research funding are not impacting clinical trials. This is demonstrably false. During the hearing, one of the Senators shared the story of a woman whose participation in a clinical trial was delayed due to a lack of staffing. This was a result of cuts to NIH. In the last ten minutes of the hearing, RFK repeatedly failed to identify where programs and agencies within HHS were located, including those named after his relatives. At an earlier hearing yesterday before the House of Representatives,RFK Jr said that he should not be trusted for medical advice.We agree. Unfortunately, this fact also means that he is wholly unqualified to continue to serve as the top public health official in the United States of America. Americans need health officials who we can trust to give sound advice. We need health officials who will not cast doubt on or undermine proven and essential public health practices such as vaccination. We need health officials who will not actively promote unfounded and harmful “treatments” to communities such as ours, who have long been abused and treated as experimental subjects by the charlatans that Kennedy surrounds himself with. For the health and safety of the autistic community, as well as the American public as a whole, RFK Jr. must resign or be removed from office. Statement PO Box 66122Washington, DC 20035 Contact Us Find a broken link or other site issue? Email[email protected] Sitemap Shop Action Alerts FAQs Issue Tracker Become a Member"}