{"id": 1158, "name": "Lake County Record-Bee", "domain": "record-bee.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.record-bee.com/2025/06/11/as-feds-resume-student-loan-collections-states-try-to-catch-borrowers-before-they-sink/", "title": "As Feds Resume Student Loan Collections States Try To Catch Borrowers Before They Sink", "content": "e-Edition e-Edition NewsNewsLocal NewsCrime and Public SafetyCourtsMarijuanaBusinessBest ReviewsHealthTraffic News Local News Crime and Public Safety Courts Marijuana Business Best Reviews Health Traffic News Local News Crime and Public Safety Courts Marijuana Business Best Reviews Health Traffic SportsSportsLocal SportsHigh School SportsFishing the North CoastOakland AthleticsRaidersSan Francisco 49ersSan Francisco GiantsSan Jose SharksGolden State Warriors Sports Local Sports High School Sports Fishing the North Coast Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors Sports Local Sports High School Sports Fishing the North Coast Oakland Athletics Raiders San Francisco 49ers San Francisco Giants San Jose Sharks Golden State Warriors EntertainmentEntertainmentLifestyleComicsPuzzlesEvents Entertainment Lifestyle Comics Puzzles Events Entertainment Lifestyle Comics Puzzles Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsLetters to the EditorCommentary Opinion Editorials Letters to the Editor Commentary Opinion Editorials Letters to the Editor Commentary AdvertisingAdvertise with UsAdvertising ArticlesClassifiedsPublic Notices Advertise with Us Advertising Articles Classifieds Public Notices Advertise with Us Advertising Articles Classifieds Public Notices Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters to submit an obituary Please emailobits@record-bee.comor call 707-380-1152. Please include your name, mailing address, and phone number along with the copy and photo. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Subscribe Login Sign up for email newsletters Subscribe Login e-Edition e-Edition News Sports Entertainment Obituaries Opinion Advertise e-Edition Special Sections Trending: PG&E monitored landfill, safeguarded against danger Musk is about to find out what $130 million for Trump gets him **As feds resume student loan collections, states try to catch borrowers before they sink** **States can’t cancel the debt, but they are filling gaps in information.** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print By Robbie Sequeira, Stateline.org Over the past few months, Celina Damian’s phone has been ringing off the hook with one bewildered, anxious question after another: “What kind of loan is this?” “Am I in default?” “Will the government really take my wages?” “Sometimes they just don’t know where to start,” said Damian, California’s student loan servicing ombudsperson. “I’m talking to borrowers from all ages, from new borrowers to — I have 80-, 90-year-old borrowers,” she said. The federal government last month restarted collections on defaulted loans. State student loan ombudspersons such as Damian have become some of the only sources of contact for worried borrowers lost in a tangle of conflicting information at the federal level about their loan status and repayment options. The U.S. Department of Education began collecting on defaulted student loans in May for the first time since the beginning of the COVID-19 pandemic in March 2020. Federal student loans issued by the U.S. Department of Education come withfixed rates, set repayment plans and borrower protections. Private servicers handle billing, repayment-plan enrollments and defaults. More than 5 million borrowers are in delinquency, and nearly 10 million — about 25% of the federal student loan portfolio — are at risk of default within months, according to data from the U.S. Department of Education. States can’t cancel that debt, but they do register and oversee servicers operating in their states, run ombuds offices, tweak tax rules and offer outreach or limited grants — actions aimed at reducing defaults and the economic fallout. When borrowers default, states will likely feel the economic impact. They might lose tax revenue as home buying stalls. They could end up paying more for Medicaid and social services if borrowers need to rely on them. And students with loan debt may be reluctant to go into lower-paying public-sector work, leading to staffing shortages at state agencies. A borrower is considered delinquent after missing a payment to the servicing companies that handle billing, repayment plan enrollments, and defaults. Damian’s office, established under California’s Student Borrower Bill of Rights, began as a narrow statutory role but now serves as a hub for outreach, “Student Loan 101” workshops and escalated complaints to federal agencies. Roughly16 statesplus the District of Columbia have followed suit, creating ombuds offices to guide borrowers through confusing paperwork and misinformation. Damian believes these ombuds offices should be in every state, as borrowers across the country will likely have similar questions and little help at the federal level. “If you don’t have an ombudsperson or even just a person at the state level who can educate borrowers, that will make a difference,” Damian told Stateline. “These borrowers are trying to pay, but the system is broken. No other financial product works this way.” Student loans became a key issue during last year’s election race, with President Joe Biden blocked by the U.S. Supreme Court in his effort to offer relief to 40 million Americans. In its waning days, his administration did forgive loans for some 150,000 borrowers under previous programs. But President Donald Trump opposes most loan forgiveness programs, and in May, the U.S. Education Department issued a“Dear Colleague” letter to higher education institutions, reminding them of their legal obligations to help former students understand repayment responsibilities and access support. **Related Articles** Disney and Universal sue AI firm Midjourney for copyright infringement Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty Inflation barely rose last month as cheaper gas and cars offset some costlier imports Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% US stocks drift near their record following an encouraging inflation update Some conservative economistssaythat federal loan forgiveness and financial aid hurt all students, offering colleges an incentive to raise tuition or lower their own institutional aid. Winston Berkman-Breen, the legal director at the Student Borrower Protection Center, a nonprofit aimed at protecting borrowers and improving the repayment system, said that more than 2 million borrowers are stuck in a backlog ofunprocessed applicationsforincome-driven repayment, orIDR, plans— calculated pay structures meant to keep payments affordable based on a borrower’s income. Other borrowers have called federal agencies for help only to find that U.S. Education Department staff,including servicer-oversight teams, have been laid off as the Trump administration works toward dismantling the department entirely. “There was an expectation to repay,” Berkman-Breen said. “But there was also an expectation that people would have access to affordable plans. That promise has broken down.” States now have three primary tools to address student loan debt, Berkman-Breen said: enforcement actions to protect consumers, such as the39-state lawsuitagainst servicer Navient; legal oversight by suing to uphold or challenge federal policy; and direct outreach to help public servants access Public Service Loan Forgiveness and similar programs. Nineteen states now require registration for companies that service student loans, he said. And more than a dozen states align with federal policy to exempt forgiven loan balances from state income taxes. Connecticut state Rep. Eleni Kavros DeGraw, a Democrat, calls student debt “a drag on the economy,” and said states can’t afford to wait for Congress — mired in partisan gridlock over student loan forgiveness — to find common ground. “(Student debt) is stopping people from buying homes, starting families and fully participating in the economy,” she told Stateline. “That hurts us as a state, as a city, and we can’t wait for Washington to figure it out.” Last year, Connecticut created a bipartisanreimbursement programthat provides up to $20,000 for graduates of local colleges who make payments and complete community service. The state has distributed more than $2 million so far. Kavros DeGraw hopes the program can serve as a model, and has already talked with lawmakers in other states on possibly developing their own versions of it. “These were people who were already paying,” Kavros DeGraw said. “It just made sense. I think it’s something that other states could explore this session, and it would provide an immense deal of relief.” Lawmakers in other states also have considered student loan legislation. This year, New Jersey introduced bills toregister education lendersand cap interest rates. Lawmakers inNew Mexico,New YorkandNorth Carolinahave proposed Borrower Bill of Rights legislation. Arizona has a registration bill for private servicers. None of these measures has advanced far. According to the National Conference of State Legislatures, more than 20 states have enacted laws expanding loan forgiveness, repayment programs and servicer oversight in recent years. Several states are also investing directly in workforce-aligned loan forgiveness: Georgia expanded its service-cancelable loanprogramto cover dental students working in rural areas. Idaho created a loan repaymentincentivefor rural nurses. Kentucky now offers $5,000stipendsto attract new teachers. Maryland authorized Anne Arundel County to launch a localforgivenessprogram for public school educators. Student loan stress is notevenly distributed. Seven states, all with Republican‐controlled legislatures, report delinquency rates above 30% among borrowers required to make payments. Mississippi leads the nation with a conditional delinquency rate of nearly 45% — meaning borrowers who should be making payments are late. That’s just ahead of Alabama, West Virginia, Kentucky, Oklahoma, Arkansas and Louisiana, all of which have rates above 31%, according to recent data from the Federal Reserve Bank of New York. By contrast, Illinois, Massachusetts, Connecticut, Vermont and New Hampshire maintain delinquency rates below 15%. Experts say this chasm reflects deeper systemic differences, such as lower median incomes in higher delinquency states, along with weaker consumer protections and a higher share of students attending for-profit institutions or leaving college without a degree. States also have promoted the federal Public Service Loan Forgiveness program, established in 2007, that offers help to public service professionals. New Mexico has an outreach campaign that includesprospective teachersand health care workers. Maine has providedguidanceto public defenders on how they can take advantage of the Public Service Loan Forgiveness Program and touts a related state tax credit on a marketingsiteto lure new residents. “States can regulate and enforce, but they can’t fix the structural problems in how repayment is administered,” said Michele Zampini, senior director of college affordability at The Institute for College Access & Success, a research organization that advocates for students. “They’re helping around the edges, but the core system is still broken.” A Novemberreportfrom the Consumer Finance Protection Bureau found at least 3.9 million borrowers received misleading or inaccurate bills from servicing companies. “The repayment system is not in a good place to provide the services and repayment options borrowers are legally entitled to,” Zampini said. The Student Loan Borrower Survey, conducted between October 2023 and January 2024, found that 61% of borrowers who received debt relief made a beneficial life change earlier than they otherwise could have. Yet borrower awareness remains dangerously low: Nearly 42% of federal borrowers have only been on the standard repayment plan, and 31% of those didn’t know other options, such as an income-based plan, existed. In California, a major part of Damian’s job in the past few months has been to help borrowers access existing forgiveness programs. Meanwhile, new federal policy proposals could reshape repayment entirely. The Trump-backedOne Big Beautiful Bill Actwould consolidate existing IDR plans into a single tiered structure, with lower-income borrowers paying flat monthly rates and higher earners contributing 8% of their income. The bill also proposes extending standard repayment terms to 30 years — raising concerns it could delay forgiveness and inflate total interest costs. The bill passed the U.S. House and is pending in the Senate. Andrew Gillen, a Cato Institute research fellow who recently testified before Congress, argues that any meaningful fix must address the incentives driving rising tuition — namely, federal aid being tied directly to college sticker prices. “The link between rising tuition and increasing aid is what drives the Bennett Hypothesis, where federal student aid, in the form of loans, can lead to higher tuition costs at colleges and universities,” Gillen said in an interview. “If we instead use the median cost of attendance to calculate aid eligibility, we remove colleges’ incentive to hike prices just to capture more aid.” Even without agreement on blanket forgiveness, experts agree on smaller bipartisan steps: streamlined repayment, stronger servicer oversight and targeted help for borrowers with the greatest need. “We don’t want people defaulting. We don’t want payments that are too high for people just out of school. That should be the bipartisan starting point,” Zampini said. ©2025 States Newsroom. Visit at stateline.org. Distributed by Tribune Content Agency, LLC. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to print (Opens in new window)Print **RevContent Feed** **Most Popular** Trump’s feud with California moves to the streets of LATrump’s feud with California moves to the streets of LA **Trump’s feud with California moves to the streets of LA** **Trump’s feud with California moves to the streets of LA** Lucas Russell sentenced to 50 years in child rape caseLucas Russell sentenced to 50 years in child rape case **Lucas Russell sentenced to 50 years in child rape case** **Lucas Russell sentenced to 50 years in child rape case** Judge says US effort to deport Mahmoud Khalil on foreign policy grounds is likely unconstitutionalJudge says US effort to deport Mahmoud Khalil on foreign policy grounds is likely unconstitutional **Judge says US effort to deport Mahmoud Khalil on foreign policy grounds is likely unconstitutional** **Judge says US effort to deport Mahmoud Khalil on foreign policy grounds is likely unconstitutional** Homeowners spend on renovations and repairs despite the uncertain economy and higher pricesHomeowners spend on renovations and repairs despite the uncertain economy and higher prices **Homeowners spend on renovations and repairs despite the uncertain economy and higher prices** **Homeowners spend on renovations and repairs despite the uncertain economy and higher prices** News BriefsNews Briefs **News Briefs** **News Briefs** Are you still searching for ways to deal with stress and anxiety?Are you still searching for ways to deal with stress and anxiety? **Are you still searching for ways to deal with stress and anxiety?** **Are you still searching for ways to deal with stress and anxiety?** Prosecutor in Trump classified files case takes 5th Amendment in private interview with CongressProsecutor in Trump classified files case takes 5th Amendment in private interview with Congress **Prosecutor in Trump classified files case takes 5th Amendment in private interview with Congress** **Prosecutor in Trump classified files case takes 5th Amendment in private interview with Congress** Over 1,000 students participate in graduation ceremony in Lower LakeOver 1,000 students participate in graduation ceremony in Lower Lake **Over 1,000 students participate in graduation ceremony in Lower Lake** **Over 1,000 students participate in graduation ceremony in Lower Lake** **More in Business** Disney and Universal sue AI firm Midjourney for copyright infringement **Disney and Universal sue AI firm Midjourney for copyright infringement** **Disney and Universal sue AI firm Midjourney for copyright infringement** Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty **Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty** **Google offers buyouts to more workers amid AI-driven tech upheaval and antitrust uncertainty** Inflation barely rose last month as cheaper gas and cars offset some costlier imports **Inflation barely rose last month as cheaper gas and cars offset some costlier imports** **Inflation barely rose last month as cheaper gas and cars offset some costlier imports** Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% **Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%** **Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55%** 2025 June 11 Subscribee-EditionSign Up For Newsletters e-Edition Sign Up For Newsletters e-Edition Sign Up For Newsletters Contact UsLake County DestinationsWork With UsPrivacy PolicyAccessibilitySitemap Lake County Destinations Work With Us Privacy Policy Accessibility Sitemap Lake County Destinations Work With Us Privacy Policy Accessibility Sitemap Advertise With UsPlace an AdMediaNews Group AdvertisingToday’s Ads Place an Ad MediaNews Group Advertising Today’s Ads Place an Ad MediaNews Group Advertising Today’s Ads ClassifiedsLocal GuideJobsReal Estate Local Guide Jobs Real Estate Local Guide Jobs Real Estate Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}