{"id": 608, "name": "GQ Magazine", "domain": "gq.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.gq.com/story/jacques-marie-mage-the-sunglasses-that-are-changing-the-face-of-pop-culture#intcid=_gq-verso-hp-trending_30593947-92ab-4de4-8c56-d18c14c602fc_popular4-2", "title": null, "content": "**Jacques Marie Mage: The Sunglasses That Are Changing the Face of Pop Culture** When I leftmy Jacques Marie Mage sunglasses in the back of a cab on a late night out in 2022, the loss hit hard. The rounded tortoiseshell Akira frames were perfect, with dusky purple lenses and an elegant proportion inspired—like many JMM designs are—by a guy who looked iconic in sunglasses (in this case, Kurosawa). They were also incredibly expensive. Jacques Marie Mage (or JMM to fans), founded by an eccentric French expat named Jérôme Mage in 2014, makes eyewear that is extravagant in every way. Prices for the frames range from around $800 to north of $2,000, and they feel like it: JMMs are constructed with thick, glossy acetate or sleek beta titanium, colorful lenses, and flashy hardware, giving them a deeply satisfying heft. You’re paying for the quality but also for the exclusivity. Each drop is limited to small quantities and never reissued. Which is cool when you’re wearing them, but a bit maddening when you lose them. Even if I could afford to replace my pair, I never saw another Akira again. Unlike, say, wristwatches, sunglasses aren’t typically considered a particularly rarefied good. Unless you’re fond of fly fishing, most of us don’t keep our sunglasses attached to our person, which means we regard our shades as easy come, easy go. For years, innovations in the eyewear space have been focused on the disposable end of the market, with startups like Goodr dining out on $25 frames that you won’t mourn when you sit on them (not because the plastic frames won’t break, but because the idea is to stock up on several pairs for such contingencies). Even the classics—Wayfarers, Eye Jackets—feel on some level like they come with a time limit, and a replica can be easily sourced. Jacques Marie Mage, on the other hand, proposes that sunglasses should be regarded more like luxury heirlooms. So far, it’s catching on. In the years since I lost my pair of Akiras, JMM has proliferated in spaces frequented by the bicoastal elite. You can see bright JMM lenses gleaming in the low lighting of the Delta One Lounge, the distinctive hard-candy frames sparkling in Paris Fashion Week street-style photographs. And as JMMs have steadily multiplied on tight and well--moisturized faces, I’ve noticed something else happening: usually unflappable men of taste are going nuts over their sunglasses. Talk to any JMM wearer and they’ll focus their obsession on the top-tier quality of their frames, which are made in Japan through an artisanal process that caps off with several hours of painstaking acetate polishing. Fans commonly ascribe a “warmth” or “soulfulness” to the tactile frames. Some have collections numbering in the hundreds. There is a thriving subreddit dedicated to the brand, Instagram fan accounts that document JMM celeb sightings, and a network of independent optometrist-fluencers who film TikToks fanning out over new releases. JMM admirers swear that putting on a pair for the first time is like making the switch from a cheapo quartz watch to a Swiss-made mechanical wonder. The watch comparison comes up frequently in Jacques Marie Mage–land, where sunglasses are treated like precious objets d’art that just so happen to have a functional utility. JMM lenses aren’t especially dark, making them more practical for a candlelit dinner at Tower Bar than poolside at high noon. Yet unlike luxury watches, which are increasingly viewed by casual and serious collectors alike as investment vehicles or swappable status symbols, JMM shades encourage a stronger attachment. Anyone can post a clout-y watch on Instagram before returning it to their safe, but JMMs take on a deeply personal quality the minute you put them on your face. “They’ve enhanced my life a hundredfold,” Jeff Goldblum says. “I’m crazy about them.” Goldblum, a Hollywood eyewear touchstone whose best-known role features him outrunning dinosaurs in proto-JMM sunglasses, first wore Jacques Marie Mage in 2017 and never looked back. It’s perhaps no coincidence that this period corresponds with the 72-year-old actor’s reemergence as an object of internet thirst. During the filming ofJurassic World Dominion,Goldblum asked Jérôme Mage to re-create Goldblum’s iconic rectangular specs from the original film. It was the second collab between the two; the first, the eponymous Jeff, quickly became a bestseller. He describes them as “me, as a pair of glasses,” so when photographers ask him to remove his shades, he usually says no. Goldblum was an early adopter, but these days the Hollywood JMM fan club could fill the Chateau Marmont. A short list of perfect situations where other A-listers have stepped out wearing JMMs: Daniel Craig at Wimbledon, Cillian Murphy at the Oscars, LeBron James in the NBA tunnel, Timothée Chalamet at an airport in Tokyo, Jacob Elordi on a boat in Venice, Ashley Olsen taking a smoke break, Rihanna leaving Giorgio Baldi, Lewis Hamilton at many grands prix, Jude Law running errands, Pete Davidson atSNL50,Denzel Washington arriving to set, Ryan Reynolds taking a selfie with Blake Lively. JMM has even converted dark-tint OGs like Jack Nicholson and Stevie Wonder, as well as fashion designers who have made a lot of money selling their own eyewear like Tom Ford and Pharrell. Though they certainly trend elite, the sunglasses also cross political divides and cultural hierarchies, representing a rare point where Kendrick Lamar and Lady Gaga might agree with Kid Rock and Joe Rogan, the latter of whom appeared last year onstage for a live podcast taping at Madison Square Garden wearing a pair of dark rectangular shades with delicate turquoise inlays at the temples. As Redditors quickly confirmed, they were Jacques Marie Mage Thunderclouds, which come in editions as low as 25 and retail for around $2,000. Not since the Birkin hit Calabasas has a status symbol so thoroughly captivated the celebrity class. JMM sunglasses make anyone look movie-starry— but especially movie stars.From left:Jacob Elordi in the Grand Prix. Jack Nicholson in the Dealan. Timothée Chalamet in the Dealan. Bad Bunny in the Duke. Tom Ford in the Enzo. There’s certainly an element of follow--the-leader at play here, but the more JMM devotees you talk to, the more an extraordinary emotional dynamic emerges. After the LA wildfires, a Jacques Marie Mage customer whose house burned down showed up to one of the stores and declared that while he could handle the loss of his house and everything in it, he couldn’t stomach losing his JMMs. He left with about a dozen replacements. A friend of mine I’ve never known to be hyperbolic recently described buying his own Clark Kent–esque JMM specs as the best decision he ever made, besides getting married. “I feel incomplete without them,” he says. When I lost my Akiras, I was bummed—butincomplete?What is going on here? On a blusteryafternoon in January, I met Jérôme Mage, the enigmatic founder and designer, for coffee at the Four Seasons in Milan, a short walk from a brand-new Jacques Marie Mage store, the first in a global expansion that has landed a JMM boutique in London and will soon include Paris, Tokyo, and Austin, and eventually New York. (In JMM parlance, the stores are “galleries,” suggesting the product inside is as much art as fashion.) “I just had lunch across the street, and the couple next to me were both wearing sunglasses.Insidethe restaurant!” Mage remarked with some surprise as he downed a double espresso. Mage has lived in Southern California since 1996, but he still has the snobbish sophistication of a Frenchman who studied industrial design and sculpture at a design school in Paris. In the Paris of his youth, he explained, only people like Serge Gainsbourg wore sunglasses inside—or Americans. I asked if the couple had been wearing Jacques Marie Mage. “No, they were not,” he said, sounding mildly relieved. “One was wearing a pair of Prada. And the other guy was wearing what looked like Oliver Peoples. Which is fine! I don’t want everyone to wear it, right?” I should note that Mage put his own large JMM shades on the table as soon as he sat down in the bustling hotel lobby. Mage looks every bit the swaggering Franco-Angeleno sunglasses-slinger that he is, trim and fastidiously mannered, with the rangy alertness of someone who doesn’t like to sit still for too long. He wears razor-sharp suits and exotic reptilian boots and keeps his hair in a tight mohawk that he sweeps back with a pompadour flourish. Behind his smoky glasses is a sharp face and dark eyes that Goldblum describes as “wildly, fiercely intelligent.” I can see why Mage is obsessed with wolves, a hard-core passion that inspired him to hire a director of stewardship and live part-time in Wyoming. “I’m pretty intense as a person,” he said at one point. His friends say that the designer has always been earnestly animated by his multifarious interests, which also include Native American art and culture, motorsports, New Wave cinema, the work of Parisian fashion designers like Yves Saint Laurent and Hedi Slimane, and the First French Empire, all of which winds its way into the business in some form or another. (“I’m a big Napoleonic fan,” said Mage, who named a pair of round opticals after the French general’s favorite architect.) Want to channelTransformer-era Lou Reed? JMM has you covered. “Jérôme follows his obsessions and is, in both his life and his work, passionate, authentic, and sophisticated,” says Jeremy Strong, who has forged a bond with Mage over multiple collaborative projects, including a custom pair stamped with Kendall Roy’s initials that he wore in season four ofSuccession.“For him, a pair of sunglasses are never just a pair of sunglasses; they are representative of a vision of lived life.” The actor clearly sees Mage as a fellow creative warrior rather than simply a guy who makes awesome shades. “He is constantly drawing from other disciplines, other sources of inspiration, whether it is2001: A Space Odyssey,or Pueblo art in New Mexico, the work of Yukio Mishima, or the Battle of Borodino, he is trying to forge his work out of deep impulses.” It takes a certain conviction to try to break into the luxury eyewear business. Though there are hundreds of stylish sunglasses brands out there, the vast majority roll up to a handful of conglomerates (EssilorLuxottica, Safilo, Kering Eyewear, LVMH-owned Thélios) that control practically the entire market from production to point of sale. But to Mage, the idea wasn’t so quixotic. “I never really quite thought about it, or I never was scared or impressed,” he said. “I just kind of did what I knew I could do.” Growing up in the small city of Clermont-Ferrand in central France, Mage was an action-sports junkie, and Southern California was the center of his world. He landed in LA in 1996 fresh out of design school and steadily built a successful creative studio that designed apparel and accessories—including goggles and other technical eyewear—for outdoor brands like Burton and Quiksilver. In an industry that tends to attract ski bums and Subaru drivers, Mage was a renegade force of Gallic refinement, a history buff who collected vintage YSL Rive Gauche suits and raced moto bikes on the weekends. From Top:Yves, Jagger, 2001, Cliff, Bogart, Fellini, Dasan. But the call came to leave the action-sports world when Mage discovered a glaring gap in the luxury category. In the early 2010s, he recalled, he took his young son to the venerable Silver Lake boutique Mohawk General Store, where they browsed the array of fashiony sunglasses: “I asked my son, ‘Which one do you like?’ And he told me something that was so true. He was like,I don’t know; everything looks the same.” At the time, the trend in sunglasses was for thin, minimal interpretations of classic mid-century shapes. Mage wore bold vintage frames from the ’70s. “I couldn’t see in the market anything that I liked personally.” Mage moved fast, calling in every favor he had with suppliers in Japan to make the first pairs of JMMs on a shoestring budget. “When you start and you have no money, in a weird way things are very simple,” he said. “I was just hoping a couple of people would buy the glasses I was designing. There was no grand plan of reinventing the way the eyewear market was structured or defined.” That part, he added, “became apparent as I was doing it.” Mage regards the growing popularity of JMM with a mixture of pride and mild apprehension. “There’s a bit of a slightcult,I think,” he said, shifting in his seat. At least for now, his customers’ desire still collides with the brand’s rarity such that particularly coveted designs can change hands on thesecondary market for over $5,000. But as he prepares to double JMM’s retail footprint, he’s wary of the cult letting in too many members. Ofeveryonewearing them. “I think that’s a dilemma of fashion and luxury: The harder it is to get, the more desirable it is. But as it becomes more desirable and you see more of it, then the less desirable it becomes.” At one point, Mage told me that in his day-to-day he generally doesn’t see anyone wearing JMM. Which means that he must not check Instagram very often. Or hang around with stylist George Cortina, who has a rakish JMM collaboration to his name. “I was at a barbecue the other night,” Cortina tells me, “and Dan Levy was like,Hello, you’re not going to say anything? I’m wearing your sunglasses!” Cortina is well aware of the brand’s VIP boom, seeing as he’s introduced JMM to the likes of Jacob Elordi and Brad Pitt, the latter of whom, Cortina says, proceeded to immediately purchase 10 pairs. (It should be noted these intros happened atGQcover shoots.) Pieces from his extensive collection of Native American artifacts hang in Mage's Venice studio. “I think there’s a sharpness to the way I do things,” Mage responded when I asked him about his brand’s starry following. His fans, he added, tend to have “a sharp idea of their taste, a sharp idea of the construction of themselves and their own aesthetic. Jeremy [Strong] and Tom [Ford], obviously they don’t have the same style, but I think they have a certain appreciation for philosophy, literature, fashion, aestheticism, furniture, craftsmanship, and then that becomes a catalyst. They are both interested in a certain amount of excellence.” Of course, if there’s one thing that unites the entire JMM ecosystem, it’s an interest in looking cool. Recently, Harry Styles and James Corden met up for a coffee in London behind their big JMM frames. But they weren’t actually going incognito. As Cortina puts it, “These sunglasses definitely say,Look at me.” Jacques Marie Mage HQis hidden behind the Hollywood store, through a door that takes you past the brand’s securely locked archive and into a bright concrete space where a few staffers are at their computers wearing sunglasses fit for a nightclub. Mage, a can of Red Bull in hand, talks me through a list of upcoming collaborative projects as we pass by crowded mood boards and stacks of 3D-printed prototypes. I spot frames scrawled with the names of Kim Gordon, Ayrton Senna, Muhammad Ali, and Patti Smith. Smith, Mage says, was already wearing JMM before they got in touch: “I think maybe what she recognized in us is that true love for art and authenticity.” We step into Mage’s bookshelf-lined office, which has a vitrine holding Napoleon figurines in one corner and several shelves of merchandise from the Formula 1 legend Senna in another. On his artfully cluttered desk there’s a needle-sharp pencil next to a tidy sketch of a squarish frame with pleasantly tapered arms, a new design for an unspecified forthcoming collaboration. With a touch of steeliness in his voice, Mage hints at a looming deadline. “I’ve got a bunch of sketches to do in the next two days,” he says, taking a sip of his energy drink. Mage’s bucket-list-caliber lineup of collaborations is a testament to JMM’s current cool factor but also to the immense pressure he’s under to constantly come up with fresh ideas. After all, the engine of the brand’s growth can only be fueled by pile after pile of small-batch frames. “When we get to our size, it becomes a bit more complicated,” he says of JMM’s commitment to limited-edition drops. And there are plenty of people waiting for the JMM phenomenon to falter. “I have a huge target on my back,” Mage acknowledges. “They all know everything we do,” he adds of the big guys. “They buy everything we do to try to copy it.” (At least one prominent luxury brand recently introduced a new line of obvious JMM dupes.) Mage in Venice Beach with his vintage Buick Regal. One potential way of staving off—or at least profiting from—the inevitability of other players copying the independent brand of the moment would be for JMM to make as many pairs as customers want to buy. “Everyone wants me to make 5,000 pairs of black Dealans. Right now. Make50,000pairs! Everyone wants that,” Mage says. “But I don’t,” he says, his voice lowering to a soft growl. “I mean, it would kill this project. It would kill us. It would killme.” Over lunch at a local French bistro, Mage expands on his strategy, using a favorite metaphor. “The wolf is a great teacher,” he offers. “There are qualities I recognize in wolves in terms of leadership, social behavior, so many things. Lead from compassion, stay on the offensive, you can never take anything for granted. If a wolf takes things for granted, he’ll lose his territory, he’ll lose his food, he’ll die.” In the face of growing competition, and growing ubiquity, Mage is leaning into his own intensity. As the business keeps growing, he says, “I want to create even more rarity.” What that will look like, practically speaking, is more buzzy collaborations, an über-luxe offering of frames made of genuine horn, and many more new shapes yet to be sketched. Plus plenty of new personal accessories that have a way of captivating men of a certain taste. Mage is planning to launch a new fine jewelry collection in June with the opening of his Paris store, and to expand the brand’s existing offering of wallets and small leather goods. He also hints that a major new obsession could be on the horizon. “I already know what I want to do in watches,” he tells me. “I know it’s a very difficult industry to break into, but it doesn’t necessarily scare me.” As for the brand’s existing fans, I’m not sure anything can turn them off from their beloved specs. A couple of weeks after seeing Mage in LA, I met with a French fashion designer who has been wearing JMMs since 2018. Recently, the designer updated their prescription and went to their local high-end optician to get new frames. “I said, I don’t want Jacques Marie Mage because all of my customers wear Jacques Marie Mage,” they told me. They tried on everything else in the shop. “At the end of the day,” the designer said with a shrug, “I left with two more Jacques Marie Mage glasses, because he is the best.” Samuel HineisGQ’s global fashion correspondent. A version of this story originally appeared in the June/July 2025 issue of GQ with the title “The Sunglasses That Are Changing the Face of Pop Culture” PRODUCTION CREDITS:Photographs byMichael SchmellingHair byAgnes Cabalausing House of SkuffSkin byMr. Sarahusing Dior X Instagram CultureIs It Better to Get Famous in Your 50s?ByEsther Zuckerman StyleNew Balance’s Mysterious Japanese Design Team Just Dropped an Elite Summer SneakerByTres Dean WatchesInside the Rebirth of a Legendary 250-Year-Old Watch BrandByCam Wolf StyleJacques Marie Mage: The Sunglasses That Are Changing the Face of Pop CultureBySamuel Hine Instagram YouTube Facebook X Tiktok More From GQ About GQ Newsletter Sign-Up Subscribe to the Magazine Wardrobe Essentials Best Cologne for Men Best Beard Trimmers Best Electric Shavers Best Body Hair Trimmers Best Loafers Best Shampoo for Men Connect Manage Account Careers Public Relations Media Kit Masthead RSS Feeds Accessibility Help Condé Nast Store User Agreement Privacy Policy Your California Privacy Rights ©2025Condé Nast. All rights reserved.GQmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices U.K. Korea Germany Mexico Taiwan Turkey China Italy South Africa Portugal Brazil France Australia Spain India Japan Thailand Middle East"}