{"id": 1591, "name": "WJBC - 1230AM - Bloomington", "domain": "wjbc.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.wjbc.com/2025/06/10/mclean-county-executive-committee-approves-1-34-million-grant-for-non-congregate-shelter-village/", "title": "Mclean County Executive Committee Approves 1 34 Million Grant For Non Congregate Shelter Village", "content": "On AirThe Scott Miller ShowThe Ramsey ShowThe Rich Eisen ShowBlake HaasWJBC PodcastsWJBC Full Show Lineup The Scott Miller Show The Ramsey Show The Rich Eisen Show Blake Haas WJBC Podcasts WJBC Full Show Lineup The Scott Miller Show The Ramsey Show The Rich Eisen Show Blake Haas WJBC Podcasts WJBC Full Show Lineup NewsLocal News ->Police and FireRoad ReportsHometown Military NewsWeather ->Local WeatherRoad ConditionsCancellationsState NewsAgribusiness Local News ->Police and FireRoad ReportsHometown Military News Police and Fire Road Reports Hometown Military News Weather ->Local WeatherRoad Conditions Local Weather Road Conditions Cancellations State News Agribusiness Local News ->Police and FireRoad ReportsHometown Military News Police and Fire Road Reports Hometown Military News Police and Fire Road Reports Hometown Military News Weather ->Local WeatherRoad Conditions Local Weather Road Conditions Local Weather Road Conditions Cancellations State News Agribusiness SportsSports ScoreboardLocal SportsHigh School SportsIllinois State RedbirdsIllinois Wesleyan TitansSt. Louis CardinalsWJBC.com Exclusive Webcasts Sports Scoreboard Local Sports High School Sports Illinois State Redbirds Illinois Wesleyan Titans St. Louis Cardinals WJBC.com Exclusive Webcasts Sports Scoreboard Local Sports High School Sports Illinois State Redbirds Illinois Wesleyan Titans St. Louis Cardinals WJBC.com Exclusive Webcasts Features“Craft Beer Thursday” with Fiala Brothers Brewery & Beer HallTax TipsDonate to St. Jude “Craft Beer Thursday” with Fiala Brothers Brewery & Beer Hall Tax Tips Donate to St. Jude “Craft Beer Thursday” with Fiala Brothers Brewery & Beer Hall Tax Tips Donate to St. Jude Events ContestsWJBC Text ClubWJBC Contest Rules WJBC Text Club WJBC Contest Rules WJBC Text Club WJBC Contest Rules Sweet Deals Advertising **McLean County Executive Committee approves $1.34 million grant for non-congregate shelter village** BLOOMINGTON, Ill. (WMBD) — On Tuesday, Home Sweet Home Ministries is one step closer to helping the unhoused in McLean County. The McLean County Executive Committee unanimously approved a proposal for grant funding for the non-congregate shelter village project. The $1.34 million will go towards The Bridge shelter village. The committee sat through a presentation showcasing the plan for The Bridge. There will be 48 units, 40 for single occupancy and eight for double occupancy. Residents will also have a clubhouse with a kitchen, gathering spaces and an off-leash dog area for pets. Pets and sobriety will not be barriers. Matt Burgess, CEO, said whether it’s a dog, cat or turtle, pets will be allowed. He also said sobriety is not a requirement but people will have to place their drugs in an amnesty bin. “We will not be permitting drug and alcohol use on the premises. But we will not be requiring sobriety as a condition of seeking our services,” Burgess said. “That kind of comes hand in hand with lowering barriers. That if people are under the influence, we will still allow them to go to their sleeping units as long as they are not an unsafe individual either to themselves or to somebody else at that time.” The Bridge will be staffed around the clock with a minimum of two people. There will be offices for community partners to offer services for behavioral health. Burgess said they have commitments from most non-profit providers in the area, including Chestnut Health Systems, Project Oz, Mid-Central Community Action, The Center for Human Services, PATH, The Salvation Army, Center for Youth and Family Solutions. “Those are all the ones I can readily rattle off the top of my head and they are prepared to come in and be scheduled for regularly occurring onsite services within The Bridge, within the clubhouse,” he said. “We think this is an innovation in offering services to people because we are not requiring them to go from the shelter where they are residing to across town to go to The Center for Human Services for their psychiatric care. We will be able to provide on-site mental health services and probably telehealth psychiatric care out of those offices for folks. So, eliminating transportation barriers and those referral falls by the wayside occurrences.” Burgess said the proposal was created with the direct input of the population they want to serve. “That’s a key dynamic that we have maintained at Home Sweet Home for a number of years now. We don’t want to do things to people. We want to do things with people. We don’t want to do things for people. We want to do things walking alongside people,” he said. “And so asking for their real-life perspective informs us and enriches what we then can turn around and say, this is what we can do to provide help.” Burgess said Home Sweet Home is still working on a purchasing agreement with Connect Transit who owns the land at the corner of Main Street and Oakland Avenue in Downtown Bloomington. The proposal will go before the McLean County Board on June 12. Burgess said he hopes to have the shovels hit the ground in early July. WMBD TV can be reached at[email protected]. **Blogs** **Labor Day – Expanding voting rights for all** By Mike Matejka Because of COVID, there is no Labor Day Parade this year. It’s always a great event for our everyday workers to march proudly down the street and enjoys the festive crowd. If there had been a parade, this year’s Labor Day theme was to be “150 years of struggle: your right to vote.” … **Is federal mobilization the answer?** By Mike Matejka As President Donald Trump threatens to send federal marshals into Chicago, over the objections of Illinois Governor J.B. Pritzker, recall another Illinois Governor who protested the incursion of armed federal personnel into the city. Those federal troops, rather than calming, escalated the situation, leading to deaths and violence. Illinois poet Vachel Lindsay… **In these troubled times, to my fellow white Americans** By Mike Matejka Our nation is at a unique watershed in human relations. African-Americans have been killed too many times in the past before George Floyd, but the response to this man’s death is international and all-encompassing. I was a grade-schooler during the Civil Rights 1960s. I watched Birmingham demonstrators hosed and the Selma – Montgomery… **Workers’ Memorial Day – Remember those whose job took their life** Looking around our community, when we say employer, most will respond to State Farm, Country, or Illinois State University. We too often forget those who are building our roads, serving our food, or our public employees. COVID-19 has made us more aware of the risk. Going to work every day for some people means… Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information Public File EEO Report Employment Opportunities Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}