{"id": 880, "name": "The Maui News", "domain": "mauinews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mauinews.com/news/local-news/2025/05/king-kekaulike-softball-makes-division-i-state-tournament-for-first-time-in-programs-history/", "title": "King Kekaulike Softball Makes Division I State Tournament For First Time In Programs History", "content": "NewsLocal NewsHawaii NewsNational NewsInternational News Local News Hawaii News National News International News Local News Hawaii News National News International News SportsLocal SportsNational Sports Local Sports National Sports Local Sports National Sports OpinionEditorialLetters to the EditorColumns Editorial Letters to the Editor Columns Editorial Letters to the Editor Columns Entertainment Obituaries Memoriams Jobs Classifieds TV Public NoticesBrowse noticesPlace a notice Browse notices Place a notice Browse notices Place a notice Contact InformationContact UsAdvertiseStatement of ValuesTerms of Service Contact Us Advertise Statement of Values Terms of Service Contact Us Advertise Statement of Values Terms of Service Submit News News Sports Opinion Obituaries Jobs Classifieds Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe **King Kekaulike softball makes Division I state tournament for first time in program’s history** **** May 22, 2025 King Kekaulike junior Hilina‘i Kuala‘au-Abbey hits the ball while batting in the Hawaii High School Athletic Association’s Division I Softball State Championships at Rainbow Wahine Stadium at UH Mānoa campus. The King Kekaulike softball team made history in the 2025 season, earning their first-ever berth in the Hawaii High School Athletic Association’s Division I State Championships. It was a season defined by growth, elevated goals and a drive to push new boundaries — as King Kekaulike softball continues to build, travel and compete in Division I. From Upcountry Maui to Mānoa Valley, the Nā Ali’i embraced the opportunity to take the field May 6-9 at the University of Hawai’i — playing in the same stadium as the Rainbow Wahine. For a team from a small-town community, stepping onto the state’s biggest stage brought a mix of excitement and nerves. It was an eye-opening experience for these young athletes and a special opportunity with the UH athletic department opening its facilities to high school players from across the islands. Playing in a college stadium served as a powerful source of inspiration for the girls, highlighting their aspirations to compete at the next level. Helping each athlete prepare for that next step is a core focus for coach Kylie Asher, who is dedicated to instilling the mindset and skills needed to pursue their dreams beyond high school. “I say pressure is a privilege — it means you are playing for something bigger,” Asher said. “We have two seniors who are playing college ball next year. Maile Garcia will be playing at the University of Puget Sound, and Hulali Williams will be playing at Lewis and Clark College. Most of if not all of our juniors and sophomores are hoping to play collegiate as well.” The King Kekaulike softball team finished runner-up in the MIL this season and qualified for state. Courtesy photo Earning their way to the state tournament took more than just hard work; it required dedication, focus and a commitment to keeping things simple at the plate. Coach Asher reflected on how playing at Rainbow Wahine Stadium for the first time was an adjustment, but emphasized the importance of taking each game as it came. By trusting their preparation and staying connected to the love of the game, the team was able to play with confidence and composure. “A lot of the time players will put pressure on themselves to get a big hit, but what we worked on this year is getting base hits and to keep the inning going or ‘pass the bat,'” Asher said. “When we keep things simple and don’t overdo it, those big hits eventually come.” With a shared sense of purpose both on and off the field, this Nā Ali’i team has embraced the power of connection, communication, and support. They know that softball is a team sport — and reaching individual or collective goals isn’t possible without cohesion. This season marked a major milestone: King Kekaulike’s first appearance at the state tournament since 2006 — and their first ever at the Division I level. Stepping beyond the familiarity of playing only Maui teams, the experience was new and unfamiliar, but King K took that leap — and rose to the occasion. Along the way, King Kekaulike built more than wins. From the coaching staff to the athletes themselves, Nā Aliʻi softball is creating a strong, united team that’s helping shape the future of the sport for young female athletes on Maui. **Newsletter** **Local News** **Local News** **​​Valley Isle Community FCU holds school supply drive for MEO Head Start** **​​Valley Isle Community FCU holds school supply drive for MEO Head Start** Valley Isle Community Federal Credit Union is holding its annual preschool supply drive for the children of Maui ... **Nolan Aguinaldo named GM of Castle Kama‘ole Sands** **Nolan Aguinaldo named GM of Castle Kama‘ole Sands** Castle Resorts & Hotels has appointed Nolan Aguinaldo as general manager of Castle Kama‘ole Sands. In this ... **Hāna metals and electronics recycling event June 20-21** **Hāna metals and electronics recycling event June 20-21** East Maui residents can drop off appliances, auto batteries, tires, propane tanks, scrap metals and electronics ... **MEO seeking more responses to survey on causes of poverty in county** **MEO seeking more responses to survey on causes of poverty in county** Maui Economic Opportunity has been gathering community’s input on the “causes that could lead to poverty” in ... **State to close part of bike path near Kahului Airport** **State to close part of bike path near Kahului Airport** The Hawai‘i Department of Transportation will close a portion of the North Shore Greenway bike and pedestrian ... **Maui County mayor signs $1.56B budget into law** **Maui County mayor signs $1.56B budget into law** MOST READ **Kenneth Gricus** **Kenneth Gricus** **Letter: Hawaii’s lodging tax unfair burden on tourists** **Letter: Hawaii’s lodging tax unfair burden on tourists** **​​Valley Isle Community FCU holds school supply drive for MEO Head Start** **​​Valley Isle Community FCU holds school supply drive for MEO Head Start** **Letter: Urgent support needed to save vital Job Corps** **Letter: Urgent support needed to save vital Job Corps** **Groups weigh in on proposed short-term rental ban in Maui’s apartment districts** **Groups weigh in on proposed short-term rental ban in Maui’s apartment districts** **Maui County mayor signs $1.56B budget into law** **Maui County mayor signs $1.56B budget into law** **Newsletter** **Starting at $4.62/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsObituariesBusiness Local News Obituaries Business Local News Obituaries Business SportsLocal SportsSports SpotlightHawaii SportsNational Sports Local Sports Sports Spotlight Hawaii Sports National Sports Local Sports Sports Spotlight Hawaii Sports National Sports OpinionEditorialLetters to the EditorColumns Editorial Letters to the Editor Columns Editorial Letters to the Editor Columns ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Maui News Publishing Company, LTD | https://www.mauinews.com | 100 Mahalani Street, Wailuku, HI 96793 | 808-242-6363"}