{"id": 1813, "name": "The Highwire", "domain": "thehighwire.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://thehighwire.com/news/cdc-advised-health-care-providers-not-to-test-east-palestine-residents-for-chemical-illnesses-lawsuit-alleges/", "title": "Cdc Advised Health Care Providers Not To Test East Palestine Residents For Chemical Illnesses Lawsuit Alleges", "content": "Watch News Editorials Resources Community Shop Contact **Resource Links** Jaxen Report Tracy Beanz The Informant The HighWire Protocol Privacy Policy **Newsletter** Sign up to become a HighWire Insider Today! **CDC Advised Health Care Providers Not to Test East Palestine Residents for Chemical Illnesses, Lawsuit Alleges** Updated7:38 AM EDT, Tue June 3, 2025 BySteven Middendorp **More from the HighWire** Secretary Kennedy Removes All Members of ACIP, Vaccine Recommendation Committee Keto Study Challenges Cholesterol-Heart Disease Link New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost Analysis Newsnation reported this week that the CDCadvisedlocal health care providers in East Palestine, OH, not to testlocalresidents for chemical illnesses after the townwas exposedto a toxic plume from a “controlled burn” after the Norfolk Southern train derailment in 2023. A lawsuit has been filed against Norfolk Southern and more than 50 other defendants by 793 residents of East Palestine, alleging a conspiracy by Vanguard, BlackRock, Mercy Health, and Quest to deny health care to the East Palestine residents. In addition, FOIA documents from 2024 show FEMA official Jim McPherson stating, “The occurrence of a cancer-cluster in EP is not zero.” This acknowledgment by McPherson contradicts the statements of other officials in the Biden administration, including EPA coordinator Michael Regan and Emergency Response Official Mark Durno, who both downplayed the seriousness of the harm caused to the residents exposed to toxic levels of dioxins and other chemicals. Scott Smith, a whistleblower client of the Government Accountability Project, toldThe HighWirelast year about an EPA cover-up in East Palestine, includingcherry-pickedtesting locations and operating as the “public relations arm of Norfolk Southern.” Smith has visited East Palestine 27 times and conducted 31 rounds of testing independent of the EPA and Norfolk Southern.The latest revelations about the CDCguidinghealthcare providers not to test residents add moreleverageto the argument that officials within the government have aided the railroad company indiminishingreal harms and cancers.On the day a “controlled burn” was conducted in 2023, a toxic plumewas releasedover16 states andpartof Canada. On February 3, 2023,thetrain operated by Norfolk Southernwithvinyl chloride and other toxic chemicals derailed in East Palestine.On February 6, “officials released toxicchemicals” asreportedby CBS News, otherwise known as the “controlled burn.” On February 8, the evacuation orderwas lifted. NPRreportedthat residents could “safely return” to their homes following air quality testing and statements by East Palestine Fire Chief Keith Drabick and EPA official James Justice. “It was not acute exposure; it was chronic exposure,” Smith said in aninterviewwith News Nation’s Elizabeth Vargas on Friday. “It was ongoing exposure with the remediation and the cleanup. You hear shelter-in-place, that’sjust not true. It’s called forced exposure in place.They should havepermanentlybeenevacuated,or at leastbeengiventhe option.Instead, it was forced exposure over time courtesy of the very own government that is supposed to protect its citizens.” In February, resident Krissy HyltontoldThe HighWirethat she knows 60 people who experience symptoms whenever they are in the East Palestine area two years after the toxic chemical plume swept over the region. She also knows four people who developed lung cancer: one man with breast cancer in both breasts, two people in their 50s with dementia, and one with brain tumors. A baby was born without sinus cavities. Alawsuitwas filedearlier this year alleging seven wrongful deaths caused by the chemical exposure. Anotherlawsuitby dog breeders alleged the incident caused 119 dog deaths and several severebirth defects, including a dog born with two heads attached to one body. Hylton was the same resident who canbeheardon an audio recording with Durnoreleasedby Status Coup News last November. In the recording, Durno admits mistakes by the EPA in response to the chemical disaster but downplayed the causality of long-term health issues. “They came back into town, and they smelled chemicals, right?” Durno said.“Well, if you smell chemicals, then you’re exposed to chemicals, right?Even though they’re well below our action levels, they’re still there, and you’re still exposed, right?If I could go back and change one thing – when we set up the temporary relocation program, which we did a month after the derailment, I wish we would have done that earlier on.” Durno acknowledged that Norfolk Southern should not have claimed the area was safe even though the EPA testing showed levels below the agency’s “actionable levels.” When Hylton told Durno that residents were not sick before being exposed to these chemicals, he said there was no validated link. “Well, that’s what you said, right?” Durno said.“But again, you need to be able to – there needs to be a validated link, right?And wejustdon’t have it.” These are not the first admissions that the unprecedented stew of chemicals unleashed on the small village had significant health effects. CDC Official Dr. Arthur Changtoldresidents in a 2023 town hall that there is no way to remove dioxins or vinyl chloride from the body. “We may not know how to treat to get rid of vinyl chloride from the body, but we know how to treat those cancers,” Chang said. Residents have advocated for more assistance with chronic health conditions and relocation expenses. The Biden administration hasbeen criticizedfor the actions by officials to downplay concerns and not provide adequate resources to support the community in the aftermath of a controlled burn.The HighWirereportedabout NGOs connected to the Biden administration thatwere brought forthwith selectedresidentswhile other residents have said they were not being heard by the administration. Still, the Trump administration hasn’t fared any better in the eyes of the residents despite claims by EPA administration Lee Zeldin and Vice President J.D. Vance thatthe residents would not be forgotten. They both visited East Palestine in February on thetwo-yearanniversary of the derailment. Residents are still living in East Palestine without the means to relocate and obtain the health care they need for the chronic conditions that developed in the aftermath of the disaster. Vargas of News Nation asked Smith if Vance and Zeldin have made good on their promise to hold Norfolk Southern accountable and push for improved rail safety. “No, they haven’t, but I’m always optimistic to give people a chance and sit down with them,” Smith said. “I would love to sit down with administrator Zeldin. I don’t think he knows 5% of the EPA manipulation and deception that went on, and I would loveto directly inform him.” **Steven Middendorp** Steven Middendorp is an investigative journalist, musician, and teacher. He has been a freelance writer and journalist for over 20 years. More recently, he has focused on issues dealing with corruption and negligence in the judicial system. He is a homesteading hobby farmer who encourages people to grow their own food, eat locally, and care for the land that provides sustenance to the community. **Other Headlines** **ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine InjuriesThe Informed Consent Action Network (ICAN) and REACT 19 held a joint press conference today to reveal a trove of secret recordings and FOIA documents of Peter Marks, the former Director of the Center for Biologics Evaluation and Research. The press conference included ICAN Founder Del Bigtree, Attorney Aaron Siri, and REACT 19’s Brianne Dressen.…Continue reading ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine InjuriesMore news about CoronavirusYale Study Finds Post-Vaccine Syndrome Shares Symptoms with Long COVIDTrump Withdraws U.S. From World Health Organization Over COVID-19 MismanagementDr. Anthony Fauci Receives Blanket Preemptive Pardon; Claims No Crimes Committed** The Informed Consent Action Network (ICAN) and REACT 19 held a joint press conference today to reveal a trove of secret recordings and FOIA documents of Peter Marks, the former Director of the Center for Biologics Evaluation and Research. The press conference included ICAN Founder Del Bigtree, Attorney Aaron Siri, and REACT 19’s Brianne Dressen.…Continue reading ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries Yale Study Finds Post-Vaccine Syndrome Shares Symptoms with Long COVID Trump Withdraws U.S. From World Health Organization Over COVID-19 Mismanagement Dr. Anthony Fauci Receives Blanket Preemptive Pardon; Claims No Crimes Committed The Informed Consent Action Network (ICAN) and REACT 19 held a joint press conference today to reveal a trove of secret recordings and FOIA documents of Peter Marks, the former Director of the Center for Biologics Evaluation and Research. The press conference included ICAN Founder Del Bigtree, Attorney Aaron Siri, and REACT 19’s Brianne Dressen.…Continue reading ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries Yale Study Finds Post-Vaccine Syndrome Shares Symptoms with Long COVID Trump Withdraws U.S. From World Health Organization Over COVID-19 Mismanagement Dr. Anthony Fauci Receives Blanket Preemptive Pardon; Claims No Crimes Committed **New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost AnalysisA new fluoride study has been criticized for being a tool of the industry to promote continued water fluoridation following the banning of the practice in Utah and Florida. The authors conducted a simulation model and cost-effectiveness analysis with data from 8484 children with a mean age of 9.6 years. The authors concluded eliminating fluoride…Continue reading New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost AnalysisMore news about Health & NutritionFDA Begins Process to Remove Unapproved Fluoride Drugs for ChildrenFederal Charges Dropped Against Small Farmers as USDA Launches Portal for Victims of “Lawfare”Florida Becomes Second State to Ban Water Fluoridation** A new fluoride study has been criticized for being a tool of the industry to promote continued water fluoridation following the banning of the practice in Utah and Florida. The authors conducted a simulation model and cost-effectiveness analysis with data from 8484 children with a mean age of 9.6 years. The authors concluded eliminating fluoride…Continue reading New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost Analysis FDA Begins Process to Remove Unapproved Fluoride Drugs for Children Federal Charges Dropped Against Small Farmers as USDA Launches Portal for Victims of “Lawfare” Florida Becomes Second State to Ban Water Fluoridation A new fluoride study has been criticized for being a tool of the industry to promote continued water fluoridation following the banning of the practice in Utah and Florida. The authors conducted a simulation model and cost-effectiveness analysis with data from 8484 children with a mean age of 9.6 years. The authors concluded eliminating fluoride…Continue reading New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost Analysis FDA Begins Process to Remove Unapproved Fluoride Drugs for Children Federal Charges Dropped Against Small Farmers as USDA Launches Portal for Victims of “Lawfare” Florida Becomes Second State to Ban Water Fluoridation **HHS Terminates Moderna Contract For Bird Flu Vaccine; Calls mRNA Technology “Under-Tested”HHS has terminated a $766 million contract with Moderna to develop an mRNA bird flu vaccine. HHS spokesman Andrew Nixon said the decision is about “safety, integrity, and trust.” He added that “mRNA technology remains under-tested, and we are not going to spend taxpayer dollars repeating the mistakes of the last administration, which concealed legitimate…Continue reading HHS Terminates Moderna Contract For Bird Flu Vaccine; Calls mRNA Technology “Under-Tested”More news about VaccinesThe FDA Will No Longer Routinely Approve COVID-19 Vaccinations for Healthy Individuals Under Age 65ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine InjuriesCleveland Clinic Preprint: Flu Shot Recipients 27% More Likely to Catch Flu** HHS has terminated a $766 million contract with Moderna to develop an mRNA bird flu vaccine. HHS spokesman Andrew Nixon said the decision is about “safety, integrity, and trust.” He added that “mRNA technology remains under-tested, and we are not going to spend taxpayer dollars repeating the mistakes of the last administration, which concealed legitimate…Continue reading HHS Terminates Moderna Contract For Bird Flu Vaccine; Calls mRNA Technology “Under-Tested” The FDA Will No Longer Routinely Approve COVID-19 Vaccinations for Healthy Individuals Under Age 65 ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries Cleveland Clinic Preprint: Flu Shot Recipients 27% More Likely to Catch Flu HHS has terminated a $766 million contract with Moderna to develop an mRNA bird flu vaccine. HHS spokesman Andrew Nixon said the decision is about “safety, integrity, and trust.” He added that “mRNA technology remains under-tested, and we are not going to spend taxpayer dollars repeating the mistakes of the last administration, which concealed legitimate…Continue reading HHS Terminates Moderna Contract For Bird Flu Vaccine; Calls mRNA Technology “Under-Tested” The FDA Will No Longer Routinely Approve COVID-19 Vaccinations for Healthy Individuals Under Age 65 ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries Cleveland Clinic Preprint: Flu Shot Recipients 27% More Likely to Catch Flu **Humanoid Robots Malfunction and Attack; Sparks Debate Over AI Safety and LiabilityA viral video released from an undisclosed Chinese factory shows a humanoid robot malfunctioning and attacking the factory workers. The Unitree H1, a product of the Chinese company Unitree Robotics, can be seen flailing its arms as workers move away to protect themselves. The robot was hung on a crane, and the workers were not…Continue reading Humanoid Robots Malfunction and Attack; Sparks Debate Over AI Safety and LiabilityMore news about Science & Tech23andMe Files for Chapter 11 Bankruptcy; Genetic Data of 15 Million Users at Risk of SaleWhite Coat Waste Project Uncovers $10 Million in Taxpayer-Funded Transgender Animal ExperimentsNearly Three-Quarters of Immunologist Peer Reviewers Receive Payments From Industry** A viral video released from an undisclosed Chinese factory shows a humanoid robot malfunctioning and attacking the factory workers. The Unitree H1, a product of the Chinese company Unitree Robotics, can be seen flailing its arms as workers move away to protect themselves. The robot was hung on a crane, and the workers were not…Continue reading Humanoid Robots Malfunction and Attack; Sparks Debate Over AI Safety and Liability 23andMe Files for Chapter 11 Bankruptcy; Genetic Data of 15 Million Users at Risk of Sale White Coat Waste Project Uncovers $10 Million in Taxpayer-Funded Transgender Animal Experiments Nearly Three-Quarters of Immunologist Peer Reviewers Receive Payments From Industry A viral video released from an undisclosed Chinese factory shows a humanoid robot malfunctioning and attacking the factory workers. The Unitree H1, a product of the Chinese company Unitree Robotics, can be seen flailing its arms as workers move away to protect themselves. The robot was hung on a crane, and the workers were not…Continue reading Humanoid Robots Malfunction and Attack; Sparks Debate Over AI Safety and Liability 23andMe Files for Chapter 11 Bankruptcy; Genetic Data of 15 Million Users at Risk of Sale White Coat Waste Project Uncovers $10 Million in Taxpayer-Funded Transgender Animal Experiments Nearly Three-Quarters of Immunologist Peer Reviewers Receive Payments From Industry **CDC Advised Health Care Providers Not to Test East Palestine Residents for Chemical Illnesses, Lawsuit AllegesNewsnation reported this week that the CDC advised local health care providers in East Palestine, OH, not to test local residents for chemical illnesses after the town was exposed to a toxic plume from a “controlled burn” after the Norfolk Southern train derailment in 2023. A lawsuit has been filed against Norfolk Southern and more…Continue reading CDC Advised Health Care Providers Not to Test East Palestine Residents for Chemical Illnesses, Lawsuit AllegesMore news about EnvironmentBioLab Ends Manufacturing in Conyers After Chemical Fire Exposed Thousands to Toxic ContaminationGeorgia Governor Signs Bill Granting Immunity for Harms Caused by Pesticides and FertilizersNew Study Links GM Crops to Higher Pesticide Use, Defying Industry Claims** Newsnation reported this week that the CDC advised local health care providers in East Palestine, OH, not to test local residents for chemical illnesses after the town was exposed to a toxic plume from a “controlled burn” after the Norfolk Southern train derailment in 2023. A lawsuit has been filed against Norfolk Southern and more…Continue reading CDC Advised Health Care Providers Not to Test East Palestine Residents for Chemical Illnesses, Lawsuit Alleges BioLab Ends Manufacturing in Conyers After Chemical Fire Exposed Thousands to Toxic Contamination Georgia Governor Signs Bill Granting Immunity for Harms Caused by Pesticides and Fertilizers New Study Links GM Crops to Higher Pesticide Use, Defying Industry Claims Newsnation reported this week that the CDC advised local health care providers in East Palestine, OH, not to test local residents for chemical illnesses after the town was exposed to a toxic plume from a “controlled burn” after the Norfolk Southern train derailment in 2023. A lawsuit has been filed against Norfolk Southern and more…Continue reading CDC Advised Health Care Providers Not to Test East Palestine Residents for Chemical Illnesses, Lawsuit Alleges BioLab Ends Manufacturing in Conyers After Chemical Fire Exposed Thousands to Toxic Contamination Georgia Governor Signs Bill Granting Immunity for Harms Caused by Pesticides and Fertilizers New Study Links GM Crops to Higher Pesticide Use, Defying Industry Claims **HHS and CMS Urge Changes to Gender-Affirming Care for Minors; Clinics Face Potential Loss of Federal FundingHHS Secretary Robert F. Kennedy Jr. wrote a letter addressed to healthcare providers saying he expects them to update their “treatment protocols and training to ensure that care for children with gender dysphoria is evidence-based.” The letter was also addressed to healthcare risk managers and state medical boards. The letter refers to the report published…Continue reading HHS and CMS Urge Changes to Gender-Affirming Care for Minors; Clinics Face Potential Loss of Federal FundingMore news about PolicySenate Hearing Alleges Government and Industry Corruption Over COVID-19 VaccinesICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine InjuriesHHS Releases 400-page Gender Affirming Care Report Citing Weak Evidence For Medical Interventions in Minors** HHS Secretary Robert F. Kennedy Jr. wrote a letter addressed to healthcare providers saying he expects them to update their “treatment protocols and training to ensure that care for children with gender dysphoria is evidence-based.” The letter was also addressed to healthcare risk managers and state medical boards. The letter refers to the report published…Continue reading HHS and CMS Urge Changes to Gender-Affirming Care for Minors; Clinics Face Potential Loss of Federal Funding Senate Hearing Alleges Government and Industry Corruption Over COVID-19 Vaccines ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries HHS Releases 400-page Gender Affirming Care Report Citing Weak Evidence For Medical Interventions in Minors HHS Secretary Robert F. Kennedy Jr. wrote a letter addressed to healthcare providers saying he expects them to update their “treatment protocols and training to ensure that care for children with gender dysphoria is evidence-based.” The letter was also addressed to healthcare risk managers and state medical boards. The letter refers to the report published…Continue reading HHS and CMS Urge Changes to Gender-Affirming Care for Minors; Clinics Face Potential Loss of Federal Funding Senate Hearing Alleges Government and Industry Corruption Over COVID-19 Vaccines ICAN Releases Recordings of FDA’s Peter Marks; Vaccine Official Dismissed Vaccine Injuries HHS Releases 400-page Gender Affirming Care Report Citing Weak Evidence For Medical Interventions in Minors **Recent Posts** Schara v. Ascension Health: The Tragic Death of Grace Schara Secretary Kennedy Removes All Members of ACIP, Vaccine Recommendation Committee Keto Study Challenges Cholesterol-Heart Disease Link New Fluoride Study Ignores Neurotoxicity and Sugar Intake in Cost Analysis Kennedy and Milei Begin New Path to Replace the WHO **Newsletter** Sign up to become a HighWire Insider Today! © Copyright The HighWire 2025 Privacy Policy The HighWire Protocol"}