{"id": 1863, "name": "American Institute for Economic Research", "domain": "aier.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://aier.org/event/the-parent-revolution-rescuing-your-kids-from-the-radicals-ruining-our-schools-houston/", "title": "The Parent Revolution Rescuing Your Kids From The Radicals Ruining Our Schools Houston", "content": "AboutPeopleGovernanceCareersAISFinancialsContact People Governance Careers AIS Financials Contact People Governance Careers AIS Financials Contact ResearchEveryday Price IndexMonetary EconomicsEconomic FreedomCombatting CollectivismPublic Choice and Public Policy ProjectSound Money ProjectLibrary and ArchivesCost of Living Calculator Everyday Price Index Monetary Economics Economic Freedom Combatting Collectivism Public Choice and Public Policy Project Sound Money Project Library and Archives Cost of Living Calculator Everyday Price Index Monetary Economics Economic Freedom Combatting Collectivism Public Choice and Public Policy Project Sound Money Project Library and Archives Cost of Living Calculator PublicationsBookstoreAIER PapersExplainersPodcastsNewslettersFusionBusiness ConditionsThe Daily Economy Bookstore AIER Papers Explainers Podcasts Newsletters Fusion Business Conditions The Daily Economy Bookstore AIER Papers Explainers Podcasts Newsletters Fusion Business Conditions The Daily Economy ProgramsHarwood SalonsCharlestonDallas-Fort WorthNashvilleRaleighVisiting FellowshipsGraduate FellowshipsStudent InternshipsSeminarsHarwood Graduate ColloquiaDouglas B. Rogers Essay Competition Harwood SalonsCharlestonDallas-Fort WorthNashvilleRaleigh Charleston Dallas-Fort Worth Nashville Raleigh Visiting Fellowships Graduate Fellowships Student Internships Seminars Harwood Graduate Colloquia Douglas B. Rogers Essay Competition Harwood SalonsCharlestonDallas-Fort WorthNashvilleRaleigh Charleston Dallas-Fort Worth Nashville Raleigh Charleston Dallas-Fort Worth Nashville Raleigh Visiting Fellowships Graduate Fellowships Student Internships Seminars Harwood Graduate Colloquia Douglas B. Rogers Essay Competition DonateGive TodayThe 1933 ClubPlanned Giving Give Today The 1933 Club Planned Giving Give Today The 1933 Club Planned Giving **The Parent Revolution: Rescuing Your Kids from the Radicals Ruining Our Schools (Houston)** Google Calendar iCalendar Outlook 365 Outlook Live **Date** June 26, 202511:30am – 1:30pm **Venue** Guard and Grace Houston, 500 Dallas St Suite 100, Houston, TX 77002 **Join us in Houston for an event with Corey DeAngelis, senior fellow at the American Culture Project and visiting fellow at the American Institute for Economic Research.** It’s no secret that our government-run public education system has held generations of Americans hostage. The teachers unions—the government’s stormtroopers—have been hard at work running a mass misinformation campaign to convince parents that because this is how it has always been, this is how it has to be. But here’s what you may not realize: the parents are winning, and we have entered the death spiral of the education dictatorship. The school choice revolution is here, and moms and dads are successfully restoring parental rights in education, one state, one school district at a time. InThe Parent Revolution, Dr. Corey A. DeAngelis–public enemy #1 of the teachers’ unions – takes readers inside this movement like no one else can. As Vox reported in late 2023, DeAngelis has become “the public face” of the effort, “traveling from state to state, holding rallies, making media appearances, and tweeting constantly.” Or as another education voice put it, “No one in education policy, advocacy, or activism has ever lived rent-free in more heads at once than Corey DeAngelis. As America’s most prominent and influential advocate of school choice, DeAngelis unapologetically argues why parents and political leaders must lean into the culture war taking place in schools. He exposes the hypocritical elites who are content to hold other people’s children captive to poorly run government schools while sending their own children to the best private and charter schools out there. And most importantly, he equips readers with the ability to make sure the potent forces of the educational industrial complex don’t regain their footing. Harwood Salons are made possible through the generosity of supporters like you. We encourage you to make a donation to support the American Institute for Economic Research to help ensure the continuation of these important events. All donations are tax-deductible and directly contribute to sustaining AIER’s Harwood Salons. This event is at full capacity. To join the waitlist in the event that a spot becomes available, please email[email protected]. Donate **About the Speaker** Corey A. DeAngelis is a senior fellow at the American Culture Project and a visiting fellow at the American Institute for Economic Research. He has been labeled the “school choice evangelist” and called “the most effective school choice advocate since Milton Friedman.” He is a regular on Fox News and frequently appears in The Wall Street Journal. DeAngelis is also the executive director at Educational Freedom Institute, a senior fellow at Reason Foundation, an adjunct scholar at Cato Institute, a board member at Liberty Justice Center, and a senior advisor at Accuracy in Media. He holds a Ph.D. in education policy from the University of Arkansas. He is the national bestselling author ofThe Parent Revolution: Rescuing Your Kids from the Radicals Ruining Our Schools(Center Street, 2024). Guard and Grace Houston, 500 Dallas St Suite 100, Houston, TX 77002 View on Google Maps **Register Here** 250 Division StreetPO Box 1000Great Barrington, MA 01230888-528-1216[email protected] Sign upfor updates on research, projects, events, and general news from AIER. Email* The Daily Economy Example: Yes, I would like to receive emails from AIER. (You can unsubscribe anytime) About About Us People Careers AIS Financials Contact Research Issues Monetary Economics Economic Freedom Combatting Collectivism Sound Money Project Library and Archives Publications AIER Papers Explainers Podcasts Newsletters Fusion Harwood Economic Review The Daily Economy Programs Events Student Internships Seminars Fellowships Donate 1933 Club Give Online Planned Giving ©2024 American Institute for Economic Research. AIER is a 501(c)(3) Nonprofit registered in the US under EIN: 04-2121305 Privacy Policy| Designed byBeck&Stone"}