{"id": 1535, "name": "Villages-News", "domain": "villages-news.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.villages-news.com/2025/06/10/resident-of-historic-side-of-the-villages-arrested-in-attempted-burglary-at-wawa/", "title": "Resident Of Historic Side Of The Villages Arrested In Attempted Burglary At Wawa", "content": "Home NewsOpen dropdown menuSubmit News Submit News Submit News Business Crime LettersOpen dropdown menuSubmit a Letter Submit a Letter Submit a Letter Opinions Obits Classifieds Photos Health Sports Contact Us Home About Us Contact Us Privacy Policy Terms of Service Facebook Twitter Instagram YouTube Home About Us Contact Us Privacy Policy Terms of Service Facebook Twitter Instagram YouTube Villages-News.com News, photos, events in The Villages, FL Home NewsOpen dropdown menuSubmit News Submit News Submit News Business Crime LettersOpen dropdown menuSubmit a Letter Submit a Letter Submit a Letter Opinions Obits Classifieds Photos Health Sports Contact Us **Resident of Historic Side of The Villages arrested in attempted burglary at Wawa** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X A resident of the Historic Side of The Villages arrested in an attempted burglary at Wawa also threatened harm to a deputy who transported him to jail. Deputies responded to Wawa, located at 13535 U.S. Hwy. 441, Lady Lake, regarding a suspicious person who was trying to open an exterior locked door around 5:40 a.m. Saturday, according to an arrest report from the Sumter County Sheriff’s Office. Dispatch advised that a shirtless man, later identified as 44-year-old Ryan Bernie Leclerc, had an object in his hand, trying to pick the lock of the outside door, as well as using a flashlight. Upon arrival, the deputies immediately found Leclerc standing near the door in question. He was sweating, moving around erratically and putting things inside a green backpack. He was detained, and one of the deputies noticed two hypodermic needles inside the top portion of the backpack, the report said. A subsequent search of the backpack revealed a blue cut straw with a white powdery substance, which tested positive for fentanyl. In one of the needles, there was a clear liquid that also tested positive for fentanyl. The other needle seemed to have been used, as the plunger was pushed down with dried blood on the base of the needle, the report said. Inside the backpack was Leclerc’s Florida ID card which further established the backpack as his, along with the flashlight, magnifying glass and screwdriver. These were later described by an eyewitness as the objects he was holding earlier, the report said. A deputy spoke to the eyewitness, who is a Wawa employee, who advised that he saw Leclerc jiggling the door handle while holding the objects from the backpack. He believed Leclerc was trying to break into the business. He then saw Leclerc move to the other side of the door and shine the flashlight through the magnifying glass, the report said. While still at the scene, the witness pointed out Leclerc as the man he saw. He further advised that the door he was trying to open led to the manager’s office where express permission is needed to enter. Leclerc did not have permission to enter that room, the report said. Leclerc was extremely irate, yelled curses and screamed.He was subsequently placed under arrest. However, while being put in the back of a patrol car, he voiced suicidal thoughts, the report said. Leclerc proceeded to kick, scream and headbutt the rear partition in the patrol vehicle, the report said. One of the deputies decided to put a hobble restraint around his legs. While enroute to the detention center, he stated once he got released, he would find out where one of the deputies lived. He also stated, “I got something for you, dog.” Leclerc also called the deputy an idiot, a scumbag and various profanities. He stated, “One of these days, I’m gonna run into you. I’m gonna find you.” The deputy asked if he was threatening him, to which he replied, “You take it how you will, bro.” He continued to be verbally abusive and hit his head against the partition, creating a red raised bump on his forehead, the report said. The Vermont native was charged with burglary of a structure (attempted), possession of drug paraphernalia, possession of burglary tools and threat to law enforcement officer. He was transported to the Sumter County Detention Center with bond set at $13,000. Leclerc was also arrested inOct. 2023for stealing a GPS watch at a golf store in The Villages, inJuly 2023for shoplifting a sandwich and dental floss from Publix, inOct. 2022with fentanyl at the Spanish Springs Town Square, and inNov. 2021for allegedly prowling with a flashlight in The Villages. **Related** **Undocumented teen from Guatemala arrested on suspicion of forcing boy into sex** **Ecuadorian restaurant server with expired visa arrested on way home from work** **Slow down on the multi-modal paths before someone gets hurt!** **Social Security is not a handout** **Golf cart rally in The Villages will celebrate Trump’s birthday** **U.S. has repeatedly dismissed evidence of genocide in Gaza** Facebook Twitter Instagram YouTube **** **** ****"}