{"id": 1174, "name": "Relevant Magazine", "domain": "relevantmagazine.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://relevantmagazine.com/culture/movies/the-chosen-season-6-finale-will-be-released-as-a-feature-film-in-theaters-but-youll-have-to-wait-til-2027/", "title": "The Chosen Season 6 Finale Will Be Released As A Feature Film In Theaters But Youll Have To Wait Til 2027", "content": "SUBSCRIBE NOW LOGIN FaithMainGrowthChurchDeeper Walk Main Growth Church Deeper Walk Main Growth Church Deeper Walk LifeMainNew You—Special SeriesRelationshipsCareer & MoneyLeadershipCollegeGraduateNon-TraditionalSeminaryUndergradWellnessYou Just Graduated College. Now What?6 Ways to Waste Your College EducationLiberty University Fined a Record-Setting $14 Million by the Department of EducationThe U.S.’s Largest Christian University Is Facing Yet Another Government Lawsuit for FraudScientists Says AI May Be Better at Therapy Than Humans — Here’s WhyAre You ‘Protecting Your Peace’ or Just Avoiding Conflict?What Your Therapist Can’t Tell YouHow Can We Actually Turn the Corner on Mental Health? Main New You—Special Series Relationships Career & Money Leadership CollegeGraduateNon-TraditionalSeminaryUndergrad Graduate Non-Traditional Seminary Undergrad Wellness Main New You—Special Series Relationships Career & Money Leadership CollegeGraduateNon-TraditionalSeminaryUndergrad Graduate Non-Traditional Seminary Undergrad Graduate Non-Traditional Seminary Undergrad Wellness CultureMainBooksMoviesMusicSportsTechTVMavis Staples Completely Reimagined Frank Ocean’s ‘Godspeed’Watch Jim Carrey Get Really, Really Vulnerable About Trauma and IdentityHow ‘Romanticizing Your Life’ Became Gen Z’s Favorite Coping MechanismChristian Entertainment Is Getting Better—And People Are NoticingWe’ve Reached Peak Content. Now What?8 Books That Will Inspire You This Black History Month8 Devotionals to Try in 2025 That Have Depth12 Books to Read to Complete Your Year-End Reading GoalChristian Entertainment Is Getting Better—And People Are Noticing10 Faith-Fueled Biopics Definitely Worth Your TimeThe Gospel According to Wes Anderson: Beauty, Brokenness and the Need to BelongDaniel Craig Investigates a Miracle in New Knives Out TeaserMavis Staples Completely Reimagined Frank Ocean’s ‘Godspeed’Christian Entertainment Is Getting Better—And People Are NoticingMichael Tait Breaks His Silence on Abuse Allegations: ‘I Will Simply Call It What God Calls It—Sin’Kirk Franklin Wins the BET Ultimate Icon Award and Then Takes the Show to ChurchJets Head Coach Aaron Glenn Introduces Bible Study as Part of Team ProgramTyrese Haliburton’s Faith Is ‘The Most Important Thing In My Life’10 Celebrities Who Grew Up as Pastors’ KidsPittsburgh Steeler Draftee Kaleb Johnson Gets Baptized: ‘This Is One of the Most Powerful Moments of My Life’The Loneliness Epidemic: How Digital Friendships Are (and Aren’t) Filling the GapScientists Says AI May Be Better at Therapy Than Humans — Here’s WhyThe Internet Can’t Decide If These AI Bible Vlogs Are Brilliant or Blasphemous85% of Gen Z Thinks the Internet Is Ruining Their Soul—and They’re RightChristian Entertainment Is Getting Better—And People Are Noticing‘The Chosen’ Season 6 Will End With a Movie — But You’ll Have to Wait til 2027The Christian Film Boom Is Officially HereZach Braff Is Scrubbing Back In for the ABC Reboot Main Books Movies Music Sports Tech TV Main Books Movies Music Sports Tech TV JusticeMainEnvironmentLife and Human DignitySocial Justice5 Nonprofit Organizations Who Could Really Use Your Support Right NowWhy Don’t More Christians Care About Climate Change?Five Years After George Floyd’s Death, Most Americans Think Nothing Has ChangedRich Villodas on Being a Peacekeeper vs. a Peacemaker5 Nonprofit Organizations Who Could Really Use Your Support Right NowWhy Don’t More Christians Care About Climate Change?10 Documentaries That Will Challenge the Way You See the WorldClimate Anxiety Is Real. How Should Christians Respond?5 Nonprofit Organizations Who Could Really Use Your Support Right NowDavid Platt: We’re Called to Serve Immigrants10 Documentaries That Will Challenge the Way You See the WorldJust a Reminder: Jesus Lifted Women’s Voices5 Nonprofit Organizations Who Could Really Use Your Support Right Now10 Documentaries That Will Challenge the Way You See the WorldWhy We Need Black History MonthJesus Flipped Tables—So Why Are We Afraid to Call Out Injustice? Main Environment Life and Human Dignity Social Justice Main Environment Life and Human Dignity Social Justice CurrentMainBuzzworthyNationOpinionWorldNew Report: Islam’s Growth Is Outpacing Christianity WorldwideWhat Would the Big Beautiful Bill Mean for Our Generation?Tim Allen Is Reading Through the Entire Bible and Is Loving Him Some RomansThe Internet Can’t Decide If These AI Bible Vlogs Are Brilliant or BlasphemousFrancis Chan Explains Why He Had to Walk Away From the Megachurch That Made Him FamousThe Definitive Ranking of Easter CandyRanking the Spiritual Gifts by How Much Drama They Cause in Small GroupA Japanese Company Now Gives Paid Leave When Your Favorite Pop Star Gets Married or Group Breaks UpWhat Would the Big Beautiful Bill Mean for Our Generation?Five Years After George Floyd’s Death, Most Americans Think Nothing Has ChangedChristians Have to Keep Politics in the Right PlaceGOP Lawmakers Introduce Bill to Make Pornography a Federal Crime85% of Gen Z Thinks the Internet Is Ruining Their Soul—and They’re RightWhy So Many Young Men Are Suddenly All In on FaithWhat Solo Travel Taught Me About Myself, God and Getting LostWhat’s Driving the Tradwife Movement?New Report: Islam’s Growth Is Outpacing Christianity WorldwideThe ‘Quiet Revival’: How Gen Z Is Reversing the Church Decline in the UKDavid Platt: We’re Called to Serve ImmigrantsSolo Travel Changed My Life: Here Are 5 Tips for You to Do it Too Main Buzzworthy Nation Opinion World Main Buzzworthy Nation Opinion World Slices Mag Podcast R+ Advertise NowWeekMonthMichael Tait Breaks His Silence on Abuse Allegations: ‘I Will Simply Call It What God Calls It—Sin’Why Millennials and Gen Z Are Ditching Denominations—and What Happens NextThe Unexpected Rise of Clean ComedyAnd the BET Award For Best Gospel/Inspirational Song Goes to… GloRilla?Report: 3 Porn Sites Are Now More Popular Than Instagram, Wikipedia, Twitter and Netflix **‘The Chosen’ Season 6 Will End With a Movie — But You’ll Have to Wait til 2027** In a first-of-its-kind move for a faith-based series,The Chosenis heading back to the big screen in a major way. Amazon MGM Studios and 5&2 Studios announced today that the Season 6 finale ofThe Chosenwill be released as a theatrical feature film on March 12, 2027—depicting the crucifixion of Jesus. Then, to close out the series, Season 7 will kick off with another theatrical release focusing on the resurrection, premiering March 31, 2028. Both films are being developed as standalone theatrical experiences designed specifically for the big screen, a sign of just how muchThe Chosenhas grown. While it started with crowdfunding roots, the series has since become a global phenomenon. The show’s previous theatrical releases—special event episodes from Seasons 3 through 5—have pulled inmore than $140 million globally. Streaming fans don’t need to panic, though. Season 6 will still be available on Prime Video before the crucifixion film drops in theaters, and Season 7 will stream after the resurrection film’s theatrical run. Season 5 ofThe Chosendrops on Prime Video on June 15, 2025. June 10, 2025 January 10, 2019 June 9, 2025 June 2, 2025 June 9, 2025 Marketing Newsletter RELEVANT+ RELEVANT Store RELEVANT Podcast Customer Support About Us Write for RELEVANTAdvertise With Us Advertise With Us Advertise With Us Contact Us Privacy Policy © 2023 RELEVANT Media Group, Inc. All Rights Reserved. FaithMainGrowthChurchDeeper Walk Main Growth Church Deeper Walk Main Growth Church Deeper Walk LifeMainNew You—Special SeriesRelationshipsCareer & MoneyLeadershipCollegeGraduateNon-TraditionalSeminaryUndergradWellness Main New You—Special Series Relationships Career & Money Leadership CollegeGraduateNon-TraditionalSeminaryUndergrad Graduate Non-Traditional Seminary Undergrad Wellness Main New You—Special Series Relationships Career & Money Leadership CollegeGraduateNon-TraditionalSeminaryUndergrad Graduate Non-Traditional Seminary Undergrad Graduate Non-Traditional Seminary Undergrad Wellness CultureMainBooksMoviesMusicSportsTechTV Main Books Movies Music Sports Tech TV Main Books Movies Music Sports Tech TV JusticeMainEnvironmentLife and Human DignitySocial Justice Main Environment Life and Human Dignity Social Justice Main Environment Life and Human Dignity Social Justice CurrentMainBuzzworthyNationOpinionWorld Main Buzzworthy Nation Opinion World Main Buzzworthy Nation Opinion World Slices Mag Podcast R+ Advertise Faith Life Culture Justice Current Slices Mag Podcast R+ Advertise June 11, 2025 June 11, 2025 June 11, 2025 June 11, 2025 That's ours."}