{"id": 1021, "name": "Norman Transcript", "domain": "normantranscript.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.normantranscript.com/news/listen-the-transcript-debuts-protected-a-podcast-exploring-rebecca-hogues-case/article_aedaa844-b054-11ec-ba80-97de731b8b70.html", "title": "Listen The Transcript Debuts Protected A Podcast Exploring Rebecca Hogues Case", "content": "Newsletter Facebook Local News Nation Education Business Turnpike News High School Sports OU Sports Thunder National Sports Editorials Columns Letters Comics Puzzles Games Celebrations Anniversary Engagements Weddings Births Events Photos Live Norman Jobs Autos Homes Place An Ad Garage Sales Business and Services Your Ad Your Way Public Notices State Public Notices Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Weekly Ads Newspaper Ads Buy Our Photos Search Search Search Contact UsPurchase PhotosSubmit a Letter to the EditorSubmit a News TipPlace an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary Purchase Photos Submit a Letter to the Editor Submit a News Tip Place an Obituary SUBSCRIBEStart a SubscriptionManage My SubscriptionE-PaperApp DownloadsNewsletterText Alerts Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Text Alerts Start a Subscription Manage My Subscription E-Paper App Downloads Newsletter Text Alerts Login E-Paper News Sports Local EventsSee All EventsAdd Your Event See All Events Add Your Event See All Events Add Your Event Obituaries Public NoticesTranscript Public NoticesState Public Notices Transcript Public Notices State Public Notices Transcript Public Notices State Public Notices Turnpike News 75°Norman, OK(73069)TodayCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%..TonightCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.Updated: June 11, 2025 @ 4:46 pmFull Forecast Norman, OK(73069)TodayCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%..TonightCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.Updated: June 11, 2025 @ 4:46 pm Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.. Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%. Updated: June 11, 2025 @ 4:46 pm Full Forecast Norman, OK(73069)TodayCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%..TonightCloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.Updated: June 11, 2025 @ 4:46 pm Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.. Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%. Updated: June 11, 2025 @ 4:46 pm Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%.. Cloudy this evening with showers after midnight. Low 67F. Winds SE at 10 to 15 mph. Chance of rain 50%. Updated: June 11, 2025 @ 4:46 pm Full Forecast Print Edition Newsletter Facebook Protected, a new podcast from The Norman Transcript. **LISTEN: The Transcript releases final episode of 'Protected,' a podcast exploring Rebecca Hogue's case** Transcript Staff May 25, 2022 May 25, 2022 Protected, a new podcast from The Norman Transcript. Join host Emma Keith in exploring the criminal justice system that convicted and sentenced Rebecca Hogue, the Norman, Oklahoma mother found guilty of first-degree murder in the death of her son. Over five episodes, released every other week, The Transcript will explore Hogue's case, Oklahoma's Failure to Protect statue, the stories of other women like Rebecca and more. Hear insight from advocates, experts, reporters and more about the Oklahoma law and the policy decisions that have made a case like Rebecca's — and Oklahoma's legal treatment of women and mothers — possible. Javascript is required for you to be able to read premium content.Please enable it in your browser settings. Rebecca Hogue Oklahoma Criminal Law Law Crime Criminal Justice System Norman Insight First-degree Murder Decision Transcript Episode **Trending Video** **Trending Recipes** **Obituaries** More Obituaries **Most Popular** Articles Images Videos Commented Tornado touches down in Norman Commissioner accuses sheriff of using cameras to spy Sheriff gets no increase in Cleveland County Budget Board battle LSU pitcher Sydney Berzon becomes Sooners' first transfer portal addition of 2025 Norman has always been a railroad town Norman Regional Hospital begins layoffs Norman Regional’s clinic closures leaves questions in its wake Heart patient dies at county jail after allegedly being denied medication \"This is our time\": Catching up with OKC superfan Garrett 'Thundor' Haviland ahead of the NBA Finals Summer camps kick off at The Sooner Theatre Sorry, there are no recent results for popular commented articles. **Featured Local Savings** Sign up now to get our FREE breaking news coverage delivered right to your inbox. First Amendment:Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances. About Us Advertise with Us Contact Us Subscriber Services Submission Forms Store Locations Cookie Preferences Home News Sports Photos Community Opinion Obituaries Comics Puzzles Video Gallery Weather Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}