{"id": 387, "name": "Economics.Help", "domain": "economicshelp.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.economicshelp.org/blog/217534/economics/uk-house-prices-are-rising-how-long-will-it-last/", "title": "Uk House Prices Are Rising How Long Will It Last", "content": "Home Shop Economics A – Z Blog Contact 0 Home Shop Economics A – Z Blog Contact 0 **UK House Prices are Rising: How Long Will it Last?** In the past 12 months, UK house prices have once again started to rise, with house price inflation reaching 6%. Even the end of stamp duty in April, did not prevent prices rising by £3,000 in May, according to the Nationwide. It means prices have regained their previous peak of 2022. However, the rise in prices is not evenly distributed across the country. Since mid 2022. House prices have risen 13% in Northern Ireland, 4% in the north but have fallen in the South and London. This is not surprising since there is wide disparity in housing affordability across the country. According to nationwide, house prices are 9 times income in London compared to just 4 times income in Scotland and the north. It means that those buying in the south and London have to pay a much bigger share of their income in mortgage payments. In London Nationwide mortgage payments are 57% of take home pay, compared to just 22% in the north and 21% in Scotland. If you are really desperate to get on the housing ladder, Zoopla reports there are some towns which are still highly affordable. Glenrothes in Wales has an average house price of £136,000, giving a price-to-earnings ratio of 1.8. Surprisingly, a town in the south East of Dartford makes the list because average earnings are boosted by proximity to London, and relatively cheap values still give a reasonable price to earnings of 4.7. And this shows that even within regions there can be a big disparity over prices and inflation. The fastest house price inflation is currently in cities like Belfast, Liverpool and Glasgow, all relatively cheap cities compared to the south. Even within London there is a big contrast. Expensive areas like Kensington and Chelsea are down 15%, Westminster down 20%, whilst Lewisham and Redbridge are rising by 8%. The fall in expensive areas is a reflection of several factors. Higher interest rates have bigger effect on expensive are. The abolition of non-dom status is seeing a fall in overseas buying and exodus of wealthy buyers. Also high stamp duty has a much bigger effect on expensive London prices, which in theory could mean taxes on a second home could reach £100,000. It is also interesting to note councils which are putting double council tax rates on second homes are seeing falling house prices in tourist hotspots like Cornwall and parts of Wales. **New Stress Tests Relaxed** Demand, especially in expensive areas, has been curtailed by rising mortgage payments and high deposits. But, is this set to change? Firstly earlier this year the Bank of England relaxed stress tests for mortgage borrowers. It means mortgage companies can lend more than previously. For example, Santander immediately changed affordability criteria, meaning a couple earning £63,500 can now borrow £305,326 on a five year fixed rate mortgage – that’s £21,000 more than previously. This is a game changer for people wanting to buy and estimates suggest it could add £19,000 to the average house price over the next fiver years. Given that rents have risen faster than inflation and are currently very unaffordable, it is very likely people will respond to weaker stress tests by borrowing more and trying to buy. One interesting aside. Remember when interest rates rose from 1% to 5% around 2022, it was expected house prices would fall, and they did fall in real terms by 18%. But, we might have expected bigger falls, why not? One reason is that stress tests introduced in 2008, did a very good job in preventing mortgage owners from falling behind payments. This shows mortgage repossessions in the UK. You can see 2024, was nothing like the real crisis of 1991 and 2008. Because of stress tests, there was very little selling due to repossession. **Interest Rates** Also, what of interest rates? It’s a mixed bag, with the Bank of England MPC divided themselves. Some look to stubborn inflation rising to 3.5% last month. Others argue this just reflects higher gas and water prices. Energy prices are already set to fall in July. With economic growth weaker, predicted to fall to just 1% this should enable some interest rate cuts later in the year. The IMF suggest three cuts could take place later in the year, which again would be a big boon to house prices, should they materialise. What about the impact of trade war, falling dollar and bond market woes on the UK housing market? Just yesterday I looked at darkening economic outlook in the US and the potential risk of new kind of financial crisis. It is fair to say there is a lot of uncertainty. But, if anything a trade war and uncertainty is causing a slowdown in global economic growth, and this is likely to cause deflationary pressures and make it easier to cut interest rates. A weaker dollar also might make it a bit easier to cut UK rates. What would really hit the UK housing market is a very sharp rise in unemployment or an unexpected inflationary shock like 2022, which would necessitate higher rates. At least from what we can see, this is hard to see. Yes, tariffs put up prices, but the UK is not too affected by US tariffs, Europe will probably respond to US tariffs by importing more from China. And tariffs don’t tend to cause the runaway inflation from rising oil prices. In fact, oil, gas and other commodity prices have come down quite a lot. A bigger factor on UK house prices will be what happens in the UK economy. One reason for the recovery in UK house prices has actually been the rise in real wages in the past two years. Wage growth is the biggest factor determining house prices. When incomes rise, we tend to spend it on housing. The big question is can the UK can maintain strong real wage growth, given very poor economic performance in past 16 years. It’s really hard to see a large sustained rise in real wages, so this will remain a drag on affordability. It’s worth pointing out that house sales are still relatively low compared to previous years. But, going back to 2022, another important lesson is that it is a mistake to only focus on income in determining house prices. Wealth, gifts from parents, is a big factor in propping up high house prices. When house prices surged in covid, so did the amount of wealth offered to first-time buyers. In other words, the recycling of wealth is a factor in supporting higher price-to-income multiples. You can see long-term rise in house price to income ratios since the early 1980s. but, it’s not just parental wealth. Institutional demand for homes. E.g. Llloyds and Blackstone all buying homes to rent. Other long-term factors, include more people living in smaller households, more old people living alone. Also, a rise in population and number of households, despite the stock of private rented accommodation staying fairly constant. Even with immigration coming down, from very high levels of 2023, it is still very high by historical standards, and the UK population is set to keep rising, which will put more upward pressure on demand. Also, since the 1980s, women are more likely to be working, causing households to have relatively more income. All these factors are still there. It is why comparing house price to income ratios are not strictly comparable to say the 1970s. The government are aiming to build homes, but will struggle to get close to their target, and even if successful, it won’t massively effect prices anyway. By the way some comment on how QE fuelled asset price inflation in the 2010s, which it did to some extent, but so far reversing QE by almost a third has failed to cause the reverse effect. **Where will prices rise the most?** So where will prices rise the most? Since the 1980s, house prices rose in London and the South much more than in other parts of the country. But, in recent years, this gap has started to narrow very slightly. This is due to more people working from home, and the impact of higher rates having a bigger effect. There is certainly more potential for house prices to rise in less expensive areas. Savills predict the north west will see the biggest price rises with a near 30% increase by 2029 However, the UK economy is still fairly London-centric, if anything, it has become more London-centric in recent years, with graduate postings still dominated by London. Efforts to level up the north and left-behind cities are regions have not amounted to much. Also, if interest rates do come down, it will be the expensive areas who benefit the most. In terms of house price predictions, the OBR predict just 13% rise over the next five years. These predictions were in the March Economic outlook and doesn’t include the relaxation of stress tests. Savills have very recently upgraded their inflation forecast by 5% – 7% over the next five years. Sources https://www.zoopla.co.uk/discover/property-news/rental-market-report/ https://www.independent.co.uk/money/house-prices-uk-london-mortgages-b2761857.html https://www.telegraph.co.uk/money/property/house-prices/new-mortgage-rule-add-19k-to-average-house-price/https://www.thisismoney.co.uk/money/mortgageshome/article-14771663/House-prices-rise-3-000-month-despite-stamp-duty-rise-says-Nationwide.html https://www.cnbc.com/2024/09/20/britains-ultra-wealthy-exit-ahead-of-proposed-non-dom-tax-changes-.html https://www.thetimes.com/business-money/economics/article/north-to-lead-rise-in-house-prices-over-next-five-years-sj6t5t7mb https://www.buyassociationgroup.com/en-gb/news/housing-market-strong-5-yea/ https://www.ft.com/content/119b79e9-5446-4a31-a8d7-ab10b57cbc67 https://www.lbc.co.uk/news/cost-living/mortgage-rules-deposits-house-prices/ https://www.knightfrank.com/research/article/2025-05-12-uk-housing-market-forecast-may-2025 **Leave a commentCancel reply** Comment View: all Revision Guides A-Level revision guide£8.95A-Level Model Essays£9.00 A-Level revision guide£8.95 A-Level Model Essays£9.00 A-Level Model Essays£9.00 A-Level revision guide£8.95 A-Level Model Essays£9.00 A-Level Model Essays£9.00 A-Level Model Essays£9.00 **Recent Posts** UK House Prices are Rising: How Long Will it Last? Warnings of Financial Crisis 2025 The 1980s The Decade That Divided Britain Could UK Economy Make An Unexpectedly Strong Recovery? Why are Bond Yields Rising Everywhere? **Selected Posts** Causes of Wall Street Crash 1929 Causes of Great Depression UK economy in 1920s Keynesian Economics The problem of printing money The importance of economics Understanding exchange rates 10 reasons for studying economics Impact of immigration on UK economy **Random Glossary term** Consumer sovereignty UK economy stats Twitter YouTube RSS Feed **Shop** Get Revision Help. Study Guides for Exams **About**"}