{"id": 2091, "name": "Palladium Magazine", "domain": "palladiummag.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.palladiummag.com/2025/03/21/the-safest-path-to-stable-climate-is-designing-new-plants/", "title": "The Safest Path To Stable Climate Is Designing New Plants", "content": "**Palladium** About Contact Subscribe Newsletter **The Safest Path to Stable Climate is Designing New Plants** In Nicolas Poussinâ\u0080\u0099s 1638 paintingThe Arcadian Shepherds, orEt in Arcadia Ego, unsettled shepherdsgather arounda starkly cut stone tomb, while one of them traces with his finger the inscription; â\u0080\u009cand [yet] in Arcadia, [here too] I am.â\u0080\u009d They are accompanied by an imposing female figure, stylistically based on the Juno Cesi statue currently in the Capitoline Museum. With her diadem, blue and yellow clothing, and hand on the back of the shepherd pointing at the letter â\u0080\u009cRâ\u0080\u009d on the inscription, she most likely represents the personification of Reason, offering some form of comfort or interpretation of their disruptive discovery. A laurel tree rises behind the tomb, and the shepherds are wearing laurel wreaths. The line is adapted from Virgilâ\u0080\u0099s fifth Eclogue, where two shepherds lament the death of Daphnis, son of Hermes, lover of Pan, and follower of Artemis, joined in mourning by the whole of the natural world. Daphnis was a mythical hero of pastoral culture. Raised by Sicilian shepherds on the slopes of Mount Etna, he was said to have sung the first pastoral poems. He lived in prototypical pastoral fashion: tending herds, composing songs, and dancing with Pan and Artemis. His death was brought about after he fell in love with Aphrodite herself, wasting away with the withering vegetation in the heat of summer and entrusting his pipes to Pan as he was hauled off to Hades by Erosâ\u0080\u0094the general fate of any mortal lover of the goddess. While Daphnis was Sicilian, the essential concept of the lost pastoral idyll that he represented became associated with the province of Arcadia in the central Peloponnese of Greece, hence the location of his tomb. Many of the specific features of the Arcadian idealâ\u0080\u0094rolling hills, misty sun-dappled valleys, scattered groves of oak and poplar treesâ\u0080\u0094derive from actual landscapes. As a landlocked and mountainous interior region unsuitable for large-scale crop agriculture, much of Arcadia was indeed sparsely inhabited by pastoralists, said by classical urbanites to have their own distinctive mythology and to preserve ways of life long lost in teeming cities like Athens and Alexandria. Before there was Arcadia, there was Eden and any number of myths of lost harmony with nature and the origin of alienation. Human cultural traditions seem to universally produce these stories, and our modern civilization has proved no differentâ\u0080\u0094from the Industrial-era English preoccupation with preserving the beatific countryside to todayâ\u0080\u0099s environmentalist assumptions, both popular and academic. But Arcadia contains cadavers rather than world trees. The image of a pastoral landscape as homeostatic is only possible due to a severe lack of temporal perspective. Rather than a timeless refuge, pastoral systems are one of the first results of the transformations of nature by human beings. Historically, they were its leading edge. The foundational image of ancient Arcadia was â\u0080\u009cthe hills in which herdsmen summer their flocksâ\u0080\u0094in the classical world, the border between tilled land and wilderness.â\u0080\u009d These borderlands could be located along the expansion front of an agrarian society or form pockets â\u0080\u009cleft behindâ\u0080\u009d for reasons of climate or topography. Evan Eisenberggoes onto note that â\u0080\u009c[this] setting is especially apt in that pastoralism is in the short run the easiest and pleasantest, in the long run the most destructive of ancient ways of life.â\u0080\u009d Ancient Arcadia itself was not spared from widespread erosion and deforestation due to relentless goat browsing pressure, which also has some responsibility for maintaining the parkland-like landscape associated with the concept. The currently somewhat improved ecological state of the region is due to ongoing state-imposed goat population reduction. This started with the Metaxas regimeâ\u0080\u0099s 1937 declaration of â\u0080\u009cwar against the goat,â\u0080\u009d featuring compulsory slaughter of goats that entered designated forest areas and forcing shepherds to move to cities or switch to field agriculture. Ancient authors were well aware of the damage caused by overgrazing and of the instability of pastoral systems. Throughout classical discourse, a dialectic developed between the positions that the observed deterioration of Mediterranean ecology under human exploitation was an inherent result of the general aging of the earth, as posited most notably by Seneca, or that it was caused by human mismanagement and excess. Plinylamentsthat â\u0080\u009c[we] blame the barrenness of the earth on its age, as if it were growing old and exhausted. But it is our own faultsâ\u0080\u0094our excessive greed for pasture, the trampling of flocks, and the constant burden of agricultureâ\u0080\u0094that have drained the earth of its strengthâ\u0080\u009d. The corollary that deterioration caused by human mismanagement should be modifiable by improved management was generally not drawn at societal scale. Classical agricultural manuals certainly give descriptions of practices which would preserve soil structure and fertility, but these are couched in terms of individual ethics to be followed by the virtuous farmer, and they address crop agriculture more than pastoralism. By the late 4th century, classical society was suffering from structural problems of sufficient severity to render the question of an organized response moot andAmbroserails that, â\u0080\u009cThe flocks consume all in their path, leaving the earth as if it were plundered. How will the earth yield her fruits when she is stripped bare by the appetite of beasts and the folly of men?â\u0080\u009d (Hexaemeron, Book 3, Chapter 16). Given that disharmony and destruction were apparent and that ancient Mediterranean society did not generally see itself as capable of competent ecological managementâ\u0080\u0094because it could not conceive of itself as a system able to offer such a coordinated homeostatic responseâ\u0080\u0094there had to be a reason for this obvious relational rupture. Something had to have died. And here we find the body of Daphnis of the forest, the representation of this loss and alienation, who could feed his â\u0080\u009cfair flocksâ\u0080\u009d in harmony with Pan and Artemis. Daphnis was tricked by Aphrodite into falling for a city-dwelling princess as part of the arc toward his demise. This is no accident. But, as his inscription implies in its switch to direct address in the penultimate line, perhaps Daphnis is alive and can be found from the forest to the stars, if only we can see past his tomb. Though our understanding of ecology and biology today is far deeper and more granular than the classical worldâ\u0080\u0099s, we are strikingly similar to them in one key respect: we too fail to notice our full ability not just to negatively affect but also to heal and to steward the natural world. Since the Industrial Revolution, our release of long-trapped carbon into the atmosphere has made us, whether we like it or not, geoengineers. We should not try to ameliorate this outcome with half-measures, but rise to meet our newfound responsibility with the full breadth of our technological tools and in cooperation with natureâ\u0080\u0099s own gatekeepers of carbon: plants. **The Amazon Was Created By a Lost Civilization of Gardeners** There is no intrinsically correct form of the concepts a society uses to structure its relationship between matters seen as internal to its processes and those seen as forming the external frame of the world within which it is contextualized. Concepts such as Daphnis dead in Arcadia, or the formation and separation of ideas of the â\u0080\u009chumanâ\u0080\u009d and â\u0080\u009cnaturalâ\u0080\u009d worlds, come about to explain observed patterns, events, and causes. The entirety of any human societal processes is as fully dependent energetically on plant photosynthetic production as all other parts of the heterotrophic biosphere. As such, accounts of separate and uncontrollable natural forcesâ\u0080\u0094and of changes in the complexity of the internal processes and productions of a human societyâ\u0080\u0094are part of the formation of a societal self-concept, rather than accurate descriptions of energy and influence. Much can be learned by examining which elements of the world a society decides to define as outside of its domain of responsibility and the ways that this patterns its engagement with reality. In 1998, Betty Meggers, one of the leading American archaeologists studying Amazonia, wrote thatterra preta, the dark, fertile soil that is curiously found in the Amazon, â\u0080\u009cis unlikely to have been cultivated indigenously because habitation sites are also burial grounds.â\u0080\u009d Meggers wrote within an intellectual tradition that was incapable of understanding the evidence before its eyes of large-scale human engagement with the biosphere outside of the familiar frames of field agriculture, pastoralism, and urbanism. In Amazonia, humans created and lived within a managed forest over thousands of years and miles, in a manner invisible to Western lenses. Additionally, Meggers was predominantly responsible for propagating the standard view held by Western anthropologists and archeologists in the mid-twentieth century: that indigenous Amazonians were, at best, agriculturalists of opportunity, scraping a meager harvest from nutrient-depleted tropical soils, which are famous for their lack of fertility. Her 1971 bookAmazonia: Man and Culture in a Counterfeit Paradise, introduces the trope that seemingly paradisical Amazonia was a place where nature imposed harsh and intrinsic limits on human habitation. This view became untenable after the demonstration in the last decades that legends of lost garden cities of Amazonia were in large part historically accurate. This was a result of many avenues of evidence, most compellingly in the last few years with the large-scale use of lidar to uncover remnant structures beneath the forest canopy. A 2022 study in southwestern Amazoniafoundthat â\u0080\u009clarge settlement sites are surrounded by ranked concentric polygonal banks and represent central nodes that are connected to lower-ranked sites by straight, raised causeways that stretch over several kilometres. Massive water-management infrastructure, composed of canals and reservoirs, complete the settlement system in an anthropogenically modified landscape.â\u0080\u009d Amazonia was the domestication site for many of our currently dominant cultivated plants, including cacao, peppers, pineapple, sweet potato, and tobacco. Out of the roughly 16,000 known Amazonian tree species, 50% of the total forest cover is composed of only 227 species, just 1.4% of the total diversityâ\u0080\u0094yet these species are overwhelmingly those useful to humans or species that modify their local ecology in a direction favorable to humans. The scale of human management suggests a pre-Columbian population of around 10 million. Previous estimates under the Meggers hypothesis ranging as low as 500,000 are now discredited. But the fundamental issue remains that freshly cleared rainforest soil is extremely infertile. In a high-energy, high-diversity system such as a tropical forest, the vast majority of available nutrients spend almost all their time rapidly exchanging between the bodies of living organisms, which are specialized to quickly absorb decomposition products, leaving little to accumulate as a soil reservoir. So how were all these people fed? In much of Amazonia, the lower populations in recent centuries allowed a form of shifting cultivation that is often termed â\u0080\u009cslash and burnâ\u0080\u009d or swidden agriculture. A plot is cleared of forest, and the felled vegetation is burned on the site, forming a surface layer of soil enriched with nutrients in which crops can be grown for a few years before fertility declines. After this, humans move on to a new plot, allowing the first to recover through natural regenerative succession. Assuming no banking of nutrients, this method does impose limits on population density according to the recovery time, and is only sustainable at low density. In the Brazilian Amazon, freshly-cleared forest soil in an area without a history of human cultivation is known asterra comum, common soil. Repeated cycles of swidden agriculture result in an accumulation of carbon and other combustion products in the soil, somewhat improving its fertility; this soil is then known asterra mulata, brown earth. The most fertile soil,terra preta, is enriched in carbon to a greater degree thanterra mulata, also containing a mixture of compost products, animal bones and feces, pottery shards, and other evidence of human modification. This is the soil that Meggers mistook as residue from burial grounds and middens. But these soils cover between three to ten percent of the total forest areaâ\u0080\u0094far more than could be accounted for through funerary practices or as the unintentional remnant of a low-density population. In Bolivia, the majority of the forested area surrounding watercourses in the llanos is likely anthropogenic, as nearly all of it is underlain by highly human-modifiedterra preta. Carbon as a soil additive has several unique properties; most importantly, it â\u0080\u009cadsordsâ\u0080\u009d or adheres charged particles onto its charged surface, and is porous with a vast surface area when the feedstocks producing it are burned in the right way. These advantages accrue to the current use of biochar in soil, in addition to it being a fixed and extremely stable form of carbon with negligible atmospheric return. Amazonia, then, is an example of a highly human-modified systemâ\u0080\u0094in no sense an untouched wilderness or counterfeit paradise. This was invisible to Western archeologists because the boundaries they expected to see were not present, and the cultivated species were intermixed with the wild ones.Eduardo Neves, a Brazilian archeologist at the forefront of the reevaluation of the history of Amazonia, notes that â\u0080\u009c[the] Indigenous worldview does not differentiate between the domain of culture and the domain of nature. The diversity of the Amazon, the presence of many large nut trees and fruit-bearing palm trees, is a result of Indigenous practices.â\u0080\u009d These indigenous practices also increased the amount of carbon held in the land as charcoal many times over what it would have been without human management. What appeared as wilderness is in reality a garden forest shaped to human design, and certainly not an Arcadian edge. Deforestation for monocultures of soy or cattle pasture is destroying an interwoven artifact of human action as part of the biosphereâ\u0080\u0094not a pristine system alienated from human influenceâ\u0080\u0094and replacing it with a simpler, energetically less favorable one. Once we can see the relational system connecting the structure of the forest system to the human activities that modified it, conceiving of a system like Amazonia as separate from its human inhabitants becomes erroneous. Here, cultural blindness and essentialization lead to a failure to recognize the evidence before our eyes of long-term, intentional human management. Similarly, our understanding of phenomena like anthropogenic climate destabilization is bounded by the extent of our contextual knowledge, since the Earth system as a whole is also not energetically separable from its human inhabitants. **Arcadian Thinking Limits Our Responses to Climate Change** Just as the human influence on Amazonia flew under the radar of Western agriculturalists and anthropologists, so too often does the energetic reality of the climate crisis escape adequate understanding when viewed through eyes determined to separate the cultivated from the wild. All of thegeoengineering methodsthat have the potential to enable homeostatic regulation of the climate system lie across this boundary because they all involve targeted interventions to change the parameters of planetary-scale processes. In this way, a small energetic input can have an exponentially greater effect or, in other words, an intended consequence. Ethics that place these methodsa prioriout of bounds will hobble our ability to respond as a species to the problem our own success has presented to us, because systemic changes are appraised indistinguishably from highly negative unintended consequences. Often, in a specific instance, the problem space is comparatively limited. For example,Populus tremula x alba 717, or â\u0080\u009cDeerâ\u0080\u009d for short, is a well-known variety of hybrid aspen that exhibits a more rapid carbon assimilation and, therefore, growth rate by a novel and evolutionarily innovative mechanism. Yes, this would result in forests in which this was the dominant species ofPopulusshowing a faster overall growth rate. Therefore, the forests would not exactly match the properties of a preindustrial forest. Still, we must be free to question why improving the carbon removal capacity of the terrestrial biosphere should be equated with returning it to whatever form it was in at whatever time slice our society derives its Arcadian ideal fromâ\u0080\u0094or to some notion of a wild uncontaminated by human influence. Every open system drawdown approach suffers from its own version of this image problem. In the case of oceanic iron fertilization, an equation with â\u0080\u009cdumpingâ\u0080\u009d and assumption of the inevitability of toxic algal blooms and some combination of zero effect and systemic breakdown has limited experimentation for decades. Too often, the methods of carbon removal companies are dictated by the idiosyncratic preferences of carbon markets built to reward comparatively minuscule scale removals by closed system approaches such as direct air capture. This method is widely known not to be scalable in a relevant time frame to remove carbon at anywhere near the rate we need, but it has the advantage of producing a product (compressed carbon dioxide gas) usable by the fossil fuel industry at rates sufficient to offset the emissions of software companies. Concepts are imported which make sense in a business context but which are entirely inadequate to the task at hand, that is, altering the control parameters of a continuous planetary flux process. A focus on permanence and traceability of specific removals to specific customers only makes sense if equal weight is given to scalability and the percentage of energy input under direct human management. Even some open system approaches have become elaborately baroque in their attempts to satisfy the demands of myopic and largely image-driven carbon credit issuance registries. Behind all of this lies the simultaneous anxiety and reassurance of the availability of solar radiation management as a comparatively low-cost solution, of a sort, should the situation continue to deteriorate without sufficient near-term carbon removal. But solar radiation management solves the temperature increase problem in the near term while making other problems worse. It will not prevent ocean acidification and it will reduce incident solar radiation in photosynthetic wavelengths, while also removing the temperature rise control signal for carbon accumulation. At high atmospheric carbon dioxide levels, the therapeutic index of solar radiation management is narrowâ\u0080\u0094that is, the required annual aerosol dose falls between narrow bounds. In particular, the consequence of underdosing in a given year would be wide swings in average global surface temperature, since the underlying climatic forcing is counterbalanced by the dimming sulfur dioxide. Humans have the potential to be the first species in the history of the biosphere to enable homeostatic regulation of the carbon dioxide concentration in the atmosphereâ\u0080\u0094if we abandon our desire to alienate nature from human influence. This requires recognizing that the alienation is a consequence of our countervailing desire to act without consideration for the presence of living ecological systems throughout even the most human-dominated environments, and to ignore our dominant influence on planetary energy flux. The only long-term solution to our spiraling negative impacts on the climate system and the functional connectivity of the global ecosystem is to work with the rest of the biosphere to create ecologies which assume human influence as a given factor. This is how weâ\u0080\u0094the only species yet produced by the Earth system to understand our own originsâ\u0080\u0094can open our eyes to the threads connecting us to the whole. In doing so, we can awaken from our Arcadian dreams to create new forests and regenerate waterways in partnership with the species surrounding us. The only ethic that should apply here is that of systemic functional improvement in retention of energy and communication between living systems. This requires that we work with boldness in cooperation and restraint from alienation anda prioricategorization. These attitudes have been in eclipse recently in many different contexts, but the rewards are great, no less than bringing Gaia to life through discovering and applying control inputs to planetary carbon metabolism. We would be functioning as the eyes of the biosphere seeing itself for the first time. Yes, we must decarbonize our energy production, but this will not serve to remove what has accumulated over the last several centuries or to reduce our global ecological dominance as energy-intensive heterotrophs. We need to go talk with the autotrophsâ\u0080\u0094the plantsâ\u0080\u0094and empower them to remove the carbon we have emitted, for both our sakes, but especially for our own. We must ask them to increase their rate of drawdown, and reduce the rate of return of the carbon they fix. They will not do this without being asked. Increased atmospheric carbon dioxide deselects plants for efficiency of carbon removal; while it does stimulate growth rate, it makes metabolically expensive carbon capture optimizations less likely to evolve and spread. Increased temperature accelerates the rate of respiration-mediated decay of biomass and liberation of fixed carbon into the atmosphere so, likewise, the autotrophs will not pull this lever for us. Thankfully, most of the words are already written, and we can cut and paste most of our messages together. The human discipline devoted to facilitating genetic communication between organisms is called biotechnology, and if harmony is found in communication, it is here where we will discover Daphnis alive. **Conceptually Confused Regulation is Blocking Biotechnology Progress** The African iroko tree isoxalogenic: the tree secretes oxalic acid from its roots. Over time, this oxalic exudate accumulates and decomposes to calcium carbonate, or limestone, with the accompanying liberation of half its carbon as carbon dioxide. Therefore, the soils surrounding the roots of an oxalogenic tree become enriched in fixed carbon at a ratio of half the carbon in the oxalate secreted. Oxalogenic trees are rare. Iroko is one of the only well-known examples, and it has a restricted distribution and a slow growth rate; it takes over a century of growth for the stem of an iroko tree to approach a meter in diameter. Genetic biotechnology could enable the elucidation of the oxalate secretion pathway in iroko and the introduction of this pathway into faster-growing tree species with broader climatic tolerance bands. The introduction of these trees into areas where they effectively integrate into local ecologiesâ\u0080\u0094likely those that match the ancestral range of the recipient species chosenâ\u0080\u0094would enable an increase in the rate of carbon removal in the forests of the regions in which they were planted. Because these trees would still perform their original role, including reproducing on their own, as well as removing more carbon from the atmosphere, this would enable a significant shift in global carbon flux toward drawdown. No method like this will be sufficient alone, but integrating genetic biotechnology with open system drawdown holds significant potential to meaningfully contribute to carbon removal. But unfortunately, under our current regulatory framework, such methods are almost impossible to test, even on a small scale. Creation of a fast-growing, oxalogenic tree could proceed within the walled garden of academia, but widespread deployment even of a method with demonstrable promise is almost impossible. The Salk Institute, an organization named after the creator of the first polio vaccine, and soâ\u0080\u0094one would thinkâ\u0080\u0094committed to significantly impacting global human problems, has spent close to two decades researching a genetic biotechnology innovation that increases soil carbon storage by upregulating suberin (cork) production by the roots of grasses. Field trial after field trial has been run, success has been demonstrated, but no deployment has occurred. The institute has a division dedicated to this work, the Harnessing Plants Initiative, who narrate that they have â\u0080\u009cmade significant progress in the labâ\u0080\u009d and have registered the trademark Ideal Plants. All this seeming progress obscures the fact that there is almost no viable regulatory route to widespread adoption. The Salk Ideal Plants only differ in specific respects from other varieties; in the case of the Salk plants, the root system is larger, and the cork wall of each root is thicker. These differences, while specific to unusual anatomical regions, are no larger in scale than those between many horticultural varieties. They are certainly less than those between, say, domesticated maize and its wild progenitor teosinte. However, the status of biotechnology regulation is such thathowa thing is done carries far more weight thanwhatit is. It is no accident that most genetically modified organisms with legal approval for unrestricted use are bulk foods. Only agricultural-chemical conglomerates have historically had the financial and legal resources to shepherd an innovation through the arduous approval process, which can easily take over a decade, while organizations such as the Salk Institute provide demonstrations but do not assume the responsibility for deployment. Meanwhile, genetic modification of bacteria and fungi to produce drugs and foods proceeds apace and arouses little protest, and the idea that the leakage of these organisms into the environment is an existential risk is hardly acknowledged. Beyond the specific regulatory issue is market-driven adoption. Concern for mitigating anthropogenic carbon emissions has resulted in the issuance of carbon credits and the development of systems of carbon accounting, mostly on a voluntary basis but with increasing governmental support globally. These credits are associated with determinants of quality which stipulate conditions beyond removal of carbon. Because participation in carbon markets and the purchase of carbon credits are generally voluntary acts associated with the environmental movement, the determinants of stipulative quality of a given carbon removal tonnage include many conditions beyond verification of the removal itself. The two dominant carbon credit registries in the United States both include a stipulation that the use of genetically modified organisms (GMOs) for removal be prohibited for credits issued. In the baseline public consciousness, despite a little recent progress, â\u0080\u009cGMOsâ\u0080\u009d are still often considered a simple bad, and their avoidance is an obvious necessity for the ecologically literate, especially GMOs placed in natural environments such as forests. So biotechnological methods, such as that of the Salk Institute, that have shown efficacy but would only ever work if a significant portion of photosynthetic carbon, either in agricultural or wildland systems, were fixed by their plants, are unlikely to be viable without changes in public understanding. The idea of GMOs as a special danger, and the intrinsic stigma it generates, compounds on top of the general difficulty of open system approaches in gaining acceptance. The idea that organisms produced by genetic biotechnology represent the possibility of catastrophic contamination of a previously pure biosphere has caused a strange Arcadian fixation, seen both in perception and regulation, on ranking the techniques used in their production on a scale of how much impurity they introduce. The rest of the biosphere, however, continues to communicate for its own purposes, neglecting to respect any such rules. There are currently three dominant methods of introducing novel genetic script to a eukaryotic organismâ\u0080\u0099s genome: particle bombardment (adhering DNA sequences to physical carriers such as gold nanoparticles to provide mass to shoot directly into a cell), transformation using a living mediator (using the pre-existing ability of organisms to integrate sequences into a host genome), and a class of enzyme-mediated methods such as CRISPR often collectively termed â\u0080\u009cgene editing.â\u0080\u009d These have all been developed since the 1980s. The division of the U.S. Department of Agriculture (USDA) responsible for biotechnology regulation is known as Animal and Plant Health Inspection Service (APHIS). In 1987, APHIS established regulations for â\u0080\u009cthe safe movement and importation of genetically engineered organisms,â\u0080\u009d simultaneously with its publication of regulations aimed to control species that spread disease. These regulations specified thatAgrobacterium, the major organism used in plant genetic transformation, was a plant pest and regulated any genetic sequence identifiable as deriving fromAgrobacteriumas being a â\u0080\u009cplant pest sequence.â\u0080\u009d APHIS went on to establish severe restrictions on the import, export, trade, and movement of all organisms containing â\u0080\u009cplant pest sequences.â\u0080\u009d Because genetically-transformed organisms can be identified by the presence of flanking sequences derived from theAgrobacteriumvector used in their transformation, any product ofAgrobacteriumtransformation was regulated in this way. This introduced a fixation on â\u0080\u009cgenetic purityâ\u0080\u009d into the legal structure dealing with the entire nascent field of plant biotechnology. Other methods of transformation, such as particle bombardment, were not regulated in any way by the USDA, as long as they too did not involve the introduction of â\u0080\u009cplant pest sequences.â\u0080\u009d Although the intent was to regulate the products of biotechnology in themselves, the letter of the law portrayed the introduction of minute genetic sequences from disease-causing organisms used in transformation as somehow capable of introducing the contaminating essence of the pest into the organism hosting them. The regulatory superstructure which developed, therefore, could be imported wholesale from existing rule systems serving to reduce the risk of the spread of infectious diseases, but with a whole class of organisms transformed via non-vector mediated methods being excluded. There are very few examples of ecological problems caused by genetically modified plants. Those that have happened underline the importance of separating our evaluations of technique and application. To much of society, genetically modified plants as a class are synonymous with the specific example of glyphosate-resistant crops, with the added conceptual confusion of the actual useâ\u0080\u0094enabling spraying of glyphosate to kill weeds in the crop without harming itâ\u0080\u0094being conflated with nebulous ideas including the production of glyphosate by the plants themselves, or simply an unknown and therefore uncanny enhancement that could escape and dominate. The problems caused by these plants are part of the general problem inherent in managing large areas of land in a manner that progressively depletes the soil biome, reduces mineral nutrients, and prevents carbon sequestration. That is, they are the problems of industrial agriculture itself. Nonetheless, the historical domination of the regulatory system by the concerns of the purveyors of these plants has led to patterns of decisions by the USDA illustrating the incoherence of its legislative approach. In 2003, a creeping bentgrass variety (Agrostis stolonifera), transformed by Monsanto to be resistant to glyphosateâ\u0080\u0094for intended use on golf coursesâ\u0080\u0094escaped from a field trial in Oregon. The grass has since spread widely through multiple habitats across the state, and will likely continue to expand. In 2016, APHIS approved glyphosate (brand name Roundup) resistant creeping bentgrass, claiming that it did not have enhanced weediness potential, long after it had escaped from cultivation. Creeping bentgrass is a Eurasian species brought to North America during European colonization and had already shown itself capable of establishing itself in place of native grasses in disturbed areas, with a history of â\u0080\u009cnoxious weedâ\u0080\u009d classification. The intended use case for the grass was to improve the ease of weed control with Roundup on golf courses. APHIS noted that â\u0080\u009c[a] primary herbicide used to eliminate [creeping bentgrass] where it is not desired is glyphosate,â\u0080\u009d but that alternate herbicides were available. Glyphosate is indeed the dominant herbicide used by ecological restorationists seeking to remove invasive plants such as bentgrass, so it seems bizarre that the USDA could claim that a bentgrass variety specifically engineered to be resistant to this herbicide did not have increased weediness potential. Noting the incoherence, the fact remains that Roundup-resistantAgrostisremains identical to conventionalAgrostisin all but one troublesome aspect, and a minor threat at best. The voluminous field trial data and long timeline required for the approval stem from the intensive investigation of properties of the plant, triggered by the presence of â\u0080\u009cplant pest sequencesâ\u0080\u009d in the construct, although the grass was transformed via biolistics. Theseincludedâ\u0080\u009cagronomic, compositional, disease and insect evaluationsâ\u0080\u009d for â\u0080\u009c65 field releases in 20 states and 40 counties performed between 1999 and 2002.â\u0080\u009d Unsurprisingly, none of these properties differed from conventional bentgrass. Glyphosate-resistant creeping bentgrass spreading from highly managed and intensively irrigated golf courses is hardly a poster child for integrative biotechnology, but is more annoyance than danger. The vast expense poured into gathering evidence to support the approval of such a marginal candidate, which was already causing problems in the wild when the decision was made, while organizations like the Salk Institute write letters to congresspetitioningfor funding to run the same exhaustive field trials required for approval of their plants, makes clear some of the processes retarding the balanced development of plant biotechnology. The Scotts-Miracle Gro company had already abandoned commercialization of the grass when approval was granted, and the only mention on their website now is a brief historical account and a phone number to report the grass for eradication. After over thirty years, APHIS updated its regulations in 2020 in a piece of legislation termed the SECURE (Sustainable, Ecological, Consistent, Uniform, Responsible, Efficient) rule, replacing the determinant of regulability from â\u0080\u009cplant pest sequencesâ\u0080\u009d to whether a given transformation â\u0080\u009ccould have happened in nature.â\u0080\u009d The implication now was that â\u0080\u009cunnatural transformationsâ\u0080\u009d were more dangerous and thus more regulatable than those that could have occurred without human intervention. Because living organisms exist in a context where high energy particles occasionally collide with the nucleotides in their genomes, and because the replication of these chains of nucleotides is not absolutely perfect every time, changes in individual nucleotides, including deletions, additions, and replacement of one of the four by another, are common events. These are known as point mutations. Also common are transpositions of sections of the chains, changing the order of the sequence within an organism. The framers of the SECURE rule classified these as natural transformations and applied minimal regulation to human methods that mimic them, known collectively as gene editing. Regulation increases as more nucleotides are changed, the reasoning being that every additional nucleotide transformed takes us further from the state of nature. Regulation is most stringent in instances where sequences from one species are introduced into another, being that this is seen as the least likely scenario to occur in nature. The organisms created by these methods are termedtransgenic, as opposed to thecisgenicproducts of gene editing. The recent advent of CRISPR and other methods allowing targeted single nucleotide changes at specific points in the genome has made anthropogenic point mutation relatively simple, and a gene can often be rendered inactive, more active, or have the properties of its protein product modified, by one or only a few nucleotide changes. The text of the regulation allows the stacking of repeated single nucleotide changes so long as each stage of the project is given individual approval. But gene editing is not capable of introducing entire new metabolic pathways to an organism. These need genetic constructs enabling the production of novel proteins, either in code written by humans or taken from a donor organism, creating a transgenic synthesis. Gene editing is not, as usually portrayed, simply a technological advance in bioengineering that facilitates easier and safer application; it is rather a specific method that allows targeted genetic changes to small numbers of nucleotides. CRISPR will therefore never replace transgenic transformation, but rather is a complementary method. Even in instances where metabolic transformations could be achieved by specific patterns of gene editing, this would be slower and clumsier than simply introducing a construct. This is not to imply that the results of gene editing are generally less major in their effect on the organism, only that it is incomplete as a transformation toolkit. Taking a step back, we can see that what APHIS did with the SECURE ruling was to replace one criterion of purity with another. The plant biotechnology industry reoriented itself around the new measure and immediately began producing literature that emphasized the safety and technological advancement of CRISPR, positioning it as a replacement for the supposedly clumsier and more dangerous older transgenic methods. Unfortunately for the framers, there is very little that does not happen in nature, and naturally transgenic organisms are relatively common. Like other methods before, gene editing is now often used for specifically regulatory reasons, not because it is better and safer, but because it does not produce a GMO as defined by APHIS. In December 2024, a Northern California district court vacated the SECURE rule in its entirety, granting that both the gene editing exemption and a failure to incorporate noxious weed authority were â\u0080\u009carbitrary and capriciousâ\u0080\u009d decisions by APHIS. The judge argued that there was no basis to assume all conventionally-bred plants were risk-free, and therefore that it did not make sense to use them as a baseline to determine the scope of regulatory oversight. With this decision, APHIS has currently reverted to the pre-SECURE rule regulatory structure, although this situation is widely considered unsatisfactory, and further revision is expected. Given that it took fifteen years to update the original regulation, significant delay is likely. The products of plant genetic engineering do not present a unique risk. Instances of them becoming noxious weeds are possible but rare, and if this happens, these weeds can and should be managed. But a regulatory mindset deriving from ideals of purity and contamination has greatly inhibited the development of a field of knowledge and practice that represents unprecedented biospheric integration and is one of our best hopes for near-term carbon drawdown. Many find this a scary proposal, but it already happens in nature all the time without our knowledge or involvement. **Nature Recognizes No Difference Between Its and Our Interventions** The black cottonwood (Populus trichocarpa) is a deciduous poplar tree common to the Pacific Northwest. A variant of it contains the composite gene BSTR, composed of three sections pasted together: the first codes for a portion of the enzyme glycosyltransferase from the bacteriumStreptomyces, which lives symbiotically within poplar trees as an endophyte; the second, for part of a DNA-binding protein from an ant,Trachymyrmex septentrionalis. This specific ant is a farmer, cultivating a fungus in subterranean galleries, which it feeds with poplar wood and leaf litter. The third portion of BSTR is a significant chunk of the coding sequence for RuBisCo, the carbon-fixing protein in photosynthesis and the most abundant enzyme on Earth, deriving from the cottonwoodâ\u0080\u0099s own chloroplast. These three sections, when joined together in this specific pattern, form a gene whose protein product enables the photosynthetic apparatus of the tree to adapt more rapidly to changes in light intensity, leading to significant gains in its carbon fixation rate. BSTR black cottonwood is a compelling example of the deep contingency and synthetic power of nature. That two enzyme fragments, from a prokaryote and an animal, can combine with a portion of chloroplastic RuBisCo to form a composite gene integrated into the plantâ\u0080\u0099s nuclear genome is already bizarre. That such a gene could be transcribed is improbable. That its transcript could be translated to a functional protein stretches credulity. That the function of this protein should be to improve the efficiency of photosynthesis itself is outside of any interpretation in probabilistic terms. With this being said, the organism is also obviously highly transgenic and born full-leafed from natureâ\u0080\u0099s face. What can be interpreted probabilistically is the time frame when the event occurred. The first wild tree discovered is almost certainly not the mother of the whole line. Black cottonwood, like most poplars, is proficient in asexual reproduction. Adventitious roots sprout easily from stem cuttings, the root system is laden with dormant buds, and regrowth from stumps and branches is rapid. Given this ability, the frequency of the tree in Pacific Northwest forests, and the comparatively recent development of human survey and sequencing techniques, the transformation event is likely to have occurred several millennia ago, assuming that the enhanced growth rate increases the likelihood of encountering a BSTR cottonwood over time. We also do not know whether the tree represents an ongoing replacement of unboosted cottonwoods, or if there are physiological costs we are as yet unaware of which select against BSTR in some environments, limiting its spread. The question of how the event occurred must, at this point, be answered speculatively, but there are clues. A scenario involving shed cells in the salivary glands of ants harvesting living poplar stems or roots hostingStreptomycescomes to mind. Then the release of fragmented sequences during concurrent lysis of bacterial and ant cells, mixed with damaged chloroplasts, and all this happening while the genome of the tree was being actively read, perhaps during an immune response to these insect predators. Most improbable, but at least possible if repeated billions of times over millions of years, which the ongoing use of cottonwood as an ant agricultural feedstock certainly provides. Human transformation techniques such as particle bombardment, with no method to ensure genomic integration other than physically shooting the construct into the nucleus, similarly rely on this â\u0080\u009claw of large numbers,â\u0080\u009d but even biolistics is likely far more efficient than whatever happened several thousand years ago somewhere near what is now Seattle. There is no essential difference between the creation of a genetically engineered plant and a naturally occurring event such as BSTR cottonwood. While acting as agents of change should correctly lead us to a sense of responsibility for the consequences of such change, there should be no wholesale abandonment of what, from my perspective, is our duty. As the bearers of intentionality and concentration of energy flux in service of this intentionality, we must integrate living systems in directions that move the system as a whole toward homeostasis. While wholesale abandonment may seem a strong term, it accurately names the central human tendency to avoid direct perception of sources of shame. If we consider shame to be an essentializing abandonment of our self-perception, avoiding perceptions that cause this becomes a survival strategy. Thinking about a constructed human world abutting a given natural world, without considering their inevitable intermingling, allows us to cognitively and emotionally withdraw from our contextual reality. This framing also makes it easier to externalize costs, and neglect to register energetic dependencies, while causing action paralysis even in cases of clear necessity. This shame also bears significant responsibility for a lacuna in ecological science regarding the study of directed human improvement of ecosystemic function. Practices such as permaculture and agroforestry give hints of such a science of applied ecology, but most ecological theory still categorizes human activity as a disturbance outside the system, rather than as an inevitable component of any modern ecology that could be actively beneficial to both us and the system as a whole when managed correctly. While properties such as biodiversity are correctly seen as important to protect and restore, there is a surprising lack of theoretical undergirding to give quantitative descriptions of their benefits as general properties or with predictive power regarding the effects of changes. We need general measures of ecological functionality and responses to degradation that restore functionality. However, in order to derive these, we must release the common assumption that restoration of function is synonymous with the restoration of some prior Arcadian state of affairs. In the world as we find it, the boundaries of entire climatic zones are shifting, and the effects of humans are ubiquitous. Human assistance could enable many organisms to persist through these centuries, leveraging our intentionality in service of accelerating the evolutionary process. For example, increasing the thickness of the bark of forest trees would increase carbon storage while reducing mortality from wildfires. Enhancing the downy layer on the underside of many leaves would reduce the transpiration rate and improve drought tolerance. As a sketch of what such a theoretical and regulatory environment would look like for synthetic biology, imagine a world in which we had derived stable metrics of ecological functionality using standardized data collection and measures of energetic flux. In this world, genetically modified plants would be regulated on the level of practices rather than around speculative catastrophic contamination risks. Regulatory approval could be necessary for increments of area planted, or for commercial use or use above certain production thresholdsâ\u0080\u0094use that would have an energetic impact. Noxious weed regulation could remain intact, and apply regardless of the construct inserted, at the level of the species worked with. Unlike many pressing issues of our time, this is one where the financial and regulatory obstacles are identifiable and clear, and scientific experimentation and iteration can be conducted immediately and rapidly. In fact, I have been doing so for the last five years: my public benefit corporation successfully bred and planted hybrid poplar trees that assimilated carbon from the atmosphere thirty to fifty percent faster than normal, work for which we wereprofiledinThe New York Times. I am continuing to work with these trees, answering basic research questions about their behavior and carbon removal rate in various contexts, as one branch of the nonprofit organizationCarbocene Industries. For those who wish to help rebalance planetary carbon flux and become technological gardeners of our Earth, I invite you to join me. The whole Earth is already our garden; it is high time we recognize this and treat it so. Patrick Mellor works to address the problem of CO2 accumulation in the atmosphere from a paleobiologically informed perspective. He is a co-founder of the company Living Carbon, and founder of the nonprofit Carbocene Industries. You can follow him at@resinoptes.bsky.social. **Related** Contact"}