{"id": 39, "name": "ABC News", "domain": "abcnews.go.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abcnews.go.com/Technology/wireStory/emperor-penguins-show-dramatic-decline-region-antarctica-satellite-122684176", "title": "Emperor Penguins Show Dramatic Decline Region Antarctica Satellite 122684176", "content": "**ABC News** **Video** **Video** **Live** **Live** **Shows** **Shows** **Shop** **Shop** **Stream on** **Stream on** **Emperor penguins show dramatic decline in region of Antarctica, satellite photos show** Satellite photos show emperor penguins in one region of Antarctica declined 22% in the past 15 years WASHINGTON --The population ofemperor penguinsin one part of Antarctica appears to be declining faster than previously thought, according to a new analysis of satellite imagery released Tuesday. Theestimated populationof 16 penguin colonies — visible in satellite photos taken between 2009 and 2024 – had declined 22% during that period mainly because of climate change that's shrinking the amount of availablesea ice. It's unclear whether this drop is seen across the continent, scientists said. “Sea ice is very important for the penguins because they breed on sea ice and forage on sea ice,” said Peter Fretwell with British Antarctic Survey, who helped analyze the data. Scientists previously estimated that the total emperor penguin population declined about 10% across all of Antarctica over the past decade and a half. The latest survey included a region covering the Antarctic Peninsula, Weddell Sea and Bellingshausen Sea. “It’s absolutely alarming that the numbers are so much worse than predicted,” said Daniel Zitterbart, a penguin researcher at the Woods Hole Oceanographic Institution, who was not involved in the study. There are uncertainties in the latest estimate. The analysis relies on a calculation of how densely the penguins are clustered in each area where they're detected in a single satellite photo taken each year. The colonies studied represent about 30% of the total emperor penguin population, which lives only in Antarctica. The loss of stable sea ice may be affecting the penguins in ways beyond shrinking their breeding grounds. “More predators like leopard seals and orcas may be able to come in closer to the colonies if sea ice breaks up earlier in the year,” said Fretwell. Warming ocean temperatures and changing rainfall patterns may also impact the survival of penguin chicks, he added. ___ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content. **Related Topics** Climate Change Animals **Sponsored Content by Taboola** **Popular Reads** **What to know about rare brain-eating amoeba after Texas woman dies** Jun 9, 12:44 PM **What to know about rare brain-eating amoeba after Texas woman dies** Jun 9, 12:44 PM **Peanuts or almonds? Rice or millet? Planet-friendly grocery picks beyond nixing meat** Jun 11, 9:00 AM **Peanuts or almonds? Rice or millet? Planet-friendly grocery picks beyond nixing meat** Jun 11, 9:00 AM **French authorities say student stabbed a school employee to death during a bag check** Jun 10, 6:35 AM **French authorities say student stabbed a school employee to death during a bag check** Jun 10, 6:35 AM **What to know about South Korea’s approval of new probes into ousted leader Yoon** Jun 10, 5:09 AM **What to know about South Korea’s approval of new probes into ousted leader Yoon** Jun 10, 5:09 AM **ABC News Live** 24/7 coverage of breaking news and live events"}