{"id": 1161, "name": "Washington C H Herald", "domain": "recordherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.recordherald.com/2025/06/10/la-police-swiftly-enforce-downtown-curfew-as-protests-against-trumps-immigration-crackdown-continue/", "title": "La Police Swiftly Enforce Downtown Curfew As Protests Against Trumps Immigration Crackdown Continue", "content": "E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsLatest NewsArchivesSpecial SectionsSubmit News Tip Latest News Archives Special Sections Submit News Tip Latest News Archives Special Sections Submit News Tip 2024 Fair SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionSubmit Letter To The Editor Latest Opinion Submit Letter To The Editor Latest Opinion Submit Letter To The Editor Life & CultureEntertainmentLocal FeaturesCalendarSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit WeddingBusinesses Entertainment Local Features Calendar Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Businesses Entertainment Local Features Calendar Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Businesses ClassifiedsJob Match OhioOhio Public Notices Job Match Ohio Ohio Public Notices Job Match Ohio Ohio Public Notices Connect With UsAbout UsAdvertiseContact UsRecord Herald on FacebookRecord Herald on TwitterReader Services About Us Advertise Contact Us Record Herald on Facebook Record Herald on Twitter Reader Services About Us Advertise Contact Us Record Herald on Facebook Record Herald on Twitter Reader Services E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsLatest NewsArchivesSpecial SectionsSubmit News Tip Latest News Archives Special Sections Submit News Tip Latest News Archives Special Sections Submit News Tip 2024 Fair SportsLatest SportsSubmit ScoresSubmit Sports News Latest Sports Submit Scores Submit Sports News Latest Sports Submit Scores Submit Sports News Obituaries OpinionLatest OpinionSubmit Letter To The Editor Latest Opinion Submit Letter To The Editor Latest Opinion Submit Letter To The Editor Life & CultureEntertainmentLocal FeaturesCalendarSubmit AnniversarySubmit BirthSubmit BirthdaySubmit EngagementSubmit WeddingBusinesses Entertainment Local Features Calendar Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Businesses Entertainment Local Features Calendar Submit Anniversary Submit Birth Submit Birthday Submit Engagement Submit Wedding Businesses ClassifiedsClassified AdsJob Match OhioOhio Public Notices Classified Ads Job Match Ohio Ohio Public Notices Classified Ads Job Match Ohio Ohio Public Notices Connect With UsAbout UsAdvertiseContact UsRecord Herald on FacebookRecord Herald on TwitterReader Services About Us Advertise Contact Us Record Herald on Facebook Record Herald on Twitter Reader Services About Us Advertise Contact Us Record Herald on Facebook Record Herald on Twitter Reader Services News **LA police swiftly enforce downtown curfew as protests against Trump’s immigration crackdown continue** Protesters gather to denounce ICE, U.S Immigration and Customs Enforcement, operations Tuesday, June 10, 2025, in Los Angeles. (AP Photo Damian Dovarganes) By Jake Offenhartz, Jaimie Ding, Lolita C. Baldor and Tara Copp Associated Press LOS ANGELES (AP) — Los Angeles police swiftly enforced a downtown curfew, making arrests moments after it took effect, while deploying officers on horseback and using crowd control projectiles to break up a group of hundreds demonstrating against President Donald Trump’s immigration crackdown. Members of the National Guard stood watch behind plastic shields, but did not appear to participate in the arrests Tuesday night. Hours later, many of the protesters had dispersed, although sporadic confrontations continued that were much smaller than in previous nights. Officials said the curfew was necessary to stop vandalism and theft by agitators looking to cause trouble. The demonstrations have been mostly concentrated downtown and the curfew covers a 1-square-mile (2.5-square-kilometer) section that includes an area where protests have occurred since Friday in the sprawling city of 4 million. The city of Los Angeles encompasses roughly 500 square miles (1,295 square kilometers). Democratic Gov. Gavin Newsom earlier accused Trump of drawing a “military dragnet” across the nation’s second-largest city with his escalating use of the National Guard. He also deployed Marines, though none were seen on the streets Tuesday. Newsom asked a court to put an emergency stop to the military helping federal immigration agents, with some guardsmen now standing in protection around agents as they carried out arrests. He said it would only heighten tensions and promote civil unrest. The judge set a hearing for Thursday, giving the administration several days to continue those activities. The change moves troops closer to engaging in law enforcement actions like deportations as Trump has promised as part of his administration’s immigration crackdown. The Guard has the authority to temporarily detain people who attack officers but any arrests ultimately would be made by law enforcement. Trump has activated more than 4,000 National Guard members and 700 Marines over the objections of city and state leaders. They were originally deployed to protect federal buildings. Demonstrations have spread to other cities nationwide, including Dallas and Austin, Texas, Chicago and New York, where thousands rallied and multiple arrests were made. New York City police said they took 86 people into custody during protests around lower Manhattan’s Foley Square against federal immigration enforcement actions Tuesday evening into Wednesday morning. Police Commissioner Jessica Tisch said the vast majority of demonstrators were peaceful. In Texas, where police in Austin used chemical irritants to disperse several hundred demonstrators Monday, Republican Gov. Greg Abbott’s office said Texas National Guard troops were “on standby” in areas where demonstrations are planned, Abbott spokesperson Andrew Mahaleris said Tuesday evening. Guard members were deployed to San Antonio, according to assistant police chief Jesse Salame. He said he did not know how many were sent or details on the deployment. LA mayor puts curfew in place Los Angeles Mayor Karen Bass declared a local emergency on the fifth day of protests and said the curfew would run from 8 p.m. Tuesday until 6 a.m. Wednesday. She said it was expected to last for several days. “We reached a tipping point” after 23 businesses were looted, Bass said during a news conference Tuesday. The curfew doesn’t apply to residents who live in the designated area, people who are homeless, credentialed media or public safety and emergency officials, according to Los Angeles Police Chief Jim McDonnell. McDonnell said “unlawful and dangerous behavior” had been escalating since Saturday. “The curfew is a necessary measure to protect lives and safeguard property following several consecutive days of growing unrest throughout the city,” McDonnell said. Trump says he’s open to using Insurrection Act Trump left open the possibility of invoking the Insurrection Act, which authorizes the president to deploy military forces inside the U.S. to suppress rebellion or domestic violence or to enforce the law in certain situations. It’s one of the most extreme emergency powers available to a U.S. president. “If there’s an insurrection, I would certainly invoke it. We’ll see,” he said from the Oval Office. Later the president called protesters “animals” and “a foreign enemy” in a speech at Fort Bragg ostensibly to recognize the 250th anniversary of the U.S. Army. Trump has described Los Angeles in dire terms that Bass and Newsom say are nowhere close to the truth. In a public address Tuesday evening, Newsom called Trump’s actions the start of an “assault” on democracy. “California may be first, but it clearly will not end here. Other states are next,” he said. Newsom warned people against inciting violence, but urged them to stand up to the president’s actions. “What Donald Trump wants most is your fealty, your silence. To be complicit in this moment,” he said. “Do not give it to him.” The protests began Friday after federal immigration raids arrested dozens of workers in Los Angeles. Protesters blocked a major freeway and set cars on fire over the weekend, and police responded with tear gas, rubber bullets and flash-bang grenades. The demonstrations have been mostly concentrated downtown in the city of 4 million. Thousands of people have peacefully rallied outside City Hall and hundreds more protested outside a federal complex that includes a detention center where some immigrants are being held following workplace raids. Despite the protests, immigration enforcement activity has continued throughout the county, with city leaders and community groups reporting U.S. Immigration and Customs Enforcement present at libraries, car washes and Home Depots. School graduations in Los Angeles have increased security over fears of ICE action and some have offered parents the option to watch on Zoom. McDonnell said that police had made 197 arrests on Tuesday, including 67 who were taken into custody for unlawfully occupying part of the 101 freeway. Several businesses were broken into Monday, though authorities didn’t say if the looting was tied to the protests. The vast majority of arrests have been for failing to disperse, while a few others were for assault with a deadly weapon, looting, vandalism and attempted murder for tossing a Molotov cocktail. Seven police officers were reportedly injured, and at least two were taken to a hospital and released. Defense Secretary Pete Hegseth suggested Tuesday that the use of troops inside the U.S. will continue to expand. The Pentagon said deploying the National Guard and Marines costs $134 million. **No posts to display**"}