{"id": 2092, "name": "Palmer Report", "domain": "palmerreport.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.palmerreport.com/analysis/donald-trump-and-elon-musk-are-trying-to-destroy-each-other-today-and-its-a-sight-to-see/60983/", "title": "Donald Trump And Elon Musk Are Trying To Destroy Each Other Today And Its A Sight To See", "content": "Home Bill Palmer Politics Analysis Mailing List Facebook Twitter About and Contact **Donald Trump and Elon Musk are trying to destroy each other today – and it’s a sight to see** Palmer Report»Analysis Earlier this week I wrote that we had scored a victory against the Trump regime. Elon Musk, the world’s wealthiest man, had been handed the keys to the entire federal government. But we fought him at every turn, made his life miserable, and ultimately helped force him to quit in disgrace while whining on his way out the door. After quitting the Trump regime, Musk initially limited his public attacks to his own Republican Party. The question was whether (or more accurately when) Musk would turn his frustrations toward Donald Trump himself. The answer has turned out to be “today.” Musk is badly wounded right now, and he’s mentally unstable to begin with. So the attacks are about as unhinged as you might have expected. So far today Musk has used Twitter to accuse Trump of suppressing the Jeffrey Epstein files because of what the files say about Trump. Trump used Truth Social (yes, these morons both own their own social networks) to announce that he had taken Musk’s electric vehicle contracts away. In response Musk threatened to shut down his company’s flights to the International Space Station, seemingly implying that he was going to leave the astronauts stranded up there. Musk ended up calling for Trump to be impeached, while Trump ally Steve Bannon called for Musk to be deported. This is all getting incredibly ugly at a faster speed than even I would have expected. The kicker is that this is still day one of the Musk-Trump public feud. Given that these two men are both mentally unstable malignant narcissists, this should get uglier by the hour. That’s a good thing. The more Trump and Musk publicly beat each other up, the harder it’ll be for either of them to focus on their evil agendas. Bill Palmer is the publisher of the political news outlet Palmer Report"}