{"id": 685, "name": "InSight Crime", "domain": "insightcrime.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://insightcrime.org/investigations/arevalo-one-year-on-is-guatemalas-president-losing-the-fight-against-corruption/", "title": "Arevalo One Year On Is Guatemalas President Losing The Fight Against Corruption", "content": "About Us Newsletter Donate Investigations Countries Criminal Economies Criminal Dynamics Public Policy Criminal Profiles English Español Facebook Page Twitter Username Linkedin YouTube English Español Investigations News Analysis Special Series Multimedia Audio About Us Work With Us Events **Countries:** Mexico Colombia Guatemala Honduras El Salvador See All **Topics:** Criminal Profiles Criminal Economies Criminal Dynamics Public Policy **Other InSight Resources** Venezuela Organized Crime Observatory Please Support Our Mission: LinkedIn Facebook Twitter YouTube English Español Investigations News Analysis Special Series Multimedia Audio About Us Work With Us Events **Countries:** Mexico Colombia Guatemala Honduras El Salvador See All **Topics:** Criminal Profiles Criminal Economies Criminal Dynamics Public Policy **Other InSight Resources** Venezuela Organized Crime Observatory Please Support Our Mission: LinkedIn Facebook Twitter YouTube InSight Crime INVESTIGATION AND ANALYSIS OF ORGANIZED CRIME About Us Newsletter Donate Investigations Countries Criminal Economies Criminal Dynamics Public Policy Criminal Profiles English Español **Arévalo, One Year On: Is Guatemala’s President Losing the Fight Against Corruption?** Inside a tumultuous year for Guatemala’s anti-graft administration One year ago, anti-corruption crusader Bernardo Arévalo was sworn in as president of Guatemala. Elected on a promise to revive Guatemala’s perpetual battle with graft, Arévalo has spent his first year in power battling to advance his anti-corruption agenda in a country where corruption is the norm. Today, all the main branches of government remain compromised, and the administration is yet to articulate a coherent plan for tackling corruption or enacting meaningful reforms. Meanwhile, Arévalo and his allies have been relentlessly attacked by political mafias determined to sink the government. Is Guatemala’s anti-corruption president losing the fight against corruption? **Explore the investigation** **The PDF Report** Read InSight Crime’s full report on the many dilemmas facing Arévalo’s anti-corruption agenda, including an in-depth exploration of how state-embedded political mafias are conspiring to derail meaningful reform. **Case Studies** Explore InSight Crime’s cases studies on how entrenched corruption has scuppered Arévalo’s anti-graft plans across the main branches of government. **What Happened When Guatemala’s Interior Ministry Tried to Fire 102 Prison Guards It Accused of Corruption?** **Arévalo’s Budget Increase: Is the Guatemalan Government’s Search for Congressional Support Fueling Local Corruption?** **President Arévalo’s Counterproductive Stand-Off With Guatemala’s Attorney General** **Cementing Judicial Power: The Case of Néster Vásquez and Guatemala’s High Courts** **Listen | Case Study 01.** **Related Content** **Power, Impunity, and the 2023 Guatemala Elections** **GameChangers 2023: Guatemala Election Upset Sparks Establishment Meltdown** **Anti-Corruption Commission Confronts Guatemala’s ‘Continuum of Impunity’** **100 Days In, Guatemala President Locks Horns with Corruption and Crime** **Credits:** Written by:Alex Papadovassilakis Investigation: Alex Papadovassilakis, Jody García, Cindy Espina Edited by:Steven Dudley Additional reporting and fact-checking:Sam Woolston Translated by:Jody García and Martín Franco Creative direction:Elisa Roldán Restrepo Graphics:Ana Isabel Rico, Juan José Restrepo, María Isabel Gaviria PDF layout:Ana Isabel Rico Social Media:Camila Aristizábal, Paula Rojas, Sam Woolston **Stay Informed With InSight Crime** Subscribe to our newsletter to receive a weekly digest of the latest organized crime news and stay up-to-date on major events, trends, and criminal dynamics from across the region. Donate today to empower research and analysis about organized crime in Latin America and the Caribbean, from the ground up. We go into the field to interview, report,and investigate. We then verify, write, and edit, providing the tools to generate real impact. Our work is costly and high risk. Please support our mission investigating organized crime. About Us Work With Us Investigations Latest News Analysis Special Series Multimedia Audio Events Countries Criminal Economies Criminal Dynamics Public Policy Criminal Profiles Information Processing Policies Privacy policy Refund policy Contact us Sponsored by Member of Facebook Page Twitter Username Linkedin YouTube"}