{"id": 636, "name": "The Herald-Dispatch", "domain": "herald-dispatch.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.herald-dispatch.com/reprints/page-reprints-marshall-championship-reprints/collection_d1d3221e-a9cd-5f51-b55f-0d9d48f00f33.html", "title": "Page Reprints Marshall Championship Reprints", "content": "Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Newsletters Outside the Echo Chamber Spotlight on Business High School Gameday Parades News Elections Election Candidate Profiles Tri-State Weather Wayne County News Ohio News Putnam News Marshall University Submit News Digital Archives Newsletters Polls Sports Marshall Sports Marshall Men's Soccer 1970 Marshall Plane Crash High School Sports Marshall Championship Reprint MU Football Through the Years High School Championship Reprints Youth Sports WVU Sports Features/Entertainment Calendar Promote Your Event Celebrations Dining Guide Health Source Kid Scoop Kentucky Ohio West Virginia Send a Letter to the Editor Photo Galleries News Photos Historical Photos Sports Gallery Marshall Sports Photos Youth Sports Gallery Local Videos In Their Words Photo and Page Reprints HD on Instagram My Story - Living with Addiction 100 Years With The H-D Lost Huntington The 1937 Flood Hatfields and McCoys Discover Communities Visitors Guide Barksmadness Jobs Cars Homes Classifieds Health SourceHealth Source 2025Health Source Podcast Health Source 2025 Health Source Podcast Health Source 2025 Health Source Podcast Public Notice 88°SunnyHuntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pmFull Forecast Huntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Full Forecast Huntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Full Forecast Search Search Search Open user controlsLog In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today Log In Using Your AccountLog InDon't have an account?Sign Up Today My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Buy & SellClassifiedsService DirectoryTri-State DigitalHD HomesHerald-Dispatch Jobs Classifieds Service Directory Tri-State Digital HD Homes Herald-Dispatch Jobs Classifieds Service Directory Tri-State Digital HD Homes Herald-Dispatch Jobs My Account Subscribe HomeSupport Local JournalismSubscribeContact UsContestsAdvertisee-EditionAbout UsSign Up for Our Email Newsletters Support Local Journalism Subscribe Contact Us Contests Advertise e-Edition About Us Sign Up for Our Email Newsletters Support Local Journalism Subscribe Contact Us Contests Advertise e-Edition About Us Sign Up for Our Email Newsletters Marketplace E-Edition Obituaries Newsletters ContestsBarksmadness Barksmadness Barksmadness 88°SunnyHuntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pmFull Forecast Huntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Full Forecast Huntington, WV(25701)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 4:52 pm Full Forecast **Page Reprints: Marshall Championship Reprints** Jun 17, 2018 Jun 17, 2018UpdatedMar 12, 2024 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Herald-Dispatch pages from various Marshall championships and bowl wins. Professionally framed prints are $140, and unframed prints are $25. If you are in a rush, our office at 5192 Braley Road in Huntington keeps some framed reprints in stock, as well as the Marshall University Bookstore on campus. To inquire what reprints are available, please call our office at 304-526-4468 during regular business hours. Prints currently available include the 2022 upset of Notre Dame, 2020-21 NCAA College Cup Soccer, 2019 CIT Victory/Jon Elmore Reprint, 2018 Bad Boy Mowers Gasparilla Bowl, 2018 1st Round men's basketball win at NCAA tourney, 2018 Men's Basketball C-USA Championship, 2015 St. Petersburg Bowl, 2014 Boca Raton Bowl, 2014 C-USA Championship, 2013 Military Bowl, 2009 Little Caesars Pizza Bowl, 2002 GMAC Bowl, 2002 MAC Championship, 2001 GMAC Bowl, 2000 Motor City Bowl, 2000 MAC Championship, 1999 Motor City Bowl, 1999 MAC Championship, 1999 Perfect Season, 1998 Motor City Bowl, 1998 MAC Championship, 1997 MAC Championship, 1996 NCAA Division I-AA extra, 1996 NCAA Division I-AA and 1992 NCAA Division I-AA. Page 1B March 11, 2024 -- Marshall Women SBC Champs. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Sept. 10, 2022 -- Marshall beats No. 8 Notre Dame in Notre Dame's home opener. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Page 1B Sept. 11, 2022 -- Marshall beats No. 8 Notre Dame. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Page 4B Sept. 11, 2022 -- Marshall beats No. 8 Notre Dame. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Indiana, 2020-2021 NCAA College Cup national championship, May 18, 2021. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Indiana, 2020-2021 NCAA College Cup national championship, May 18, 2021. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save 2019 Celebrating Jon Elmore's Record-Breaking Career at Marshall University, 2015-2019. 12x18 size Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. South Florida, 2018 Gasparilla Bowl, Dec. 21, 2018. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. South Florida, 2018 Gasparilla Bowl, Dec. 21, 2018. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. WKU, 2018 Conference USA men's basketball championship, March 11, 2018. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. WKU, 2018 Conference USA men's basketball championship, March 11, 2018. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Wichita St, 2018 NCAA Tournament, March 17, 2018. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. UConn, 2015 St. Petersburg Bowl. Dec. 27, 2015. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Maryland, 2013 Military Bowl. Dec. 28, 2013. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Ohio, 2009 Little Caesars Pizza Bowl. Dec. 27, 2009. Size: 12x24 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Louisville, 2002 GMAC Bowl game. Dec. 19, 2002. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Toledo, 2002 MAC Championship game. Dec. 8, 2002, sports front. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Toledo, 2002 MAC Championship game. Dec. 8, 2002. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. East Carolina, 2001 GMAC Bowl game. Dec. 21, 2001. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. East Carolina, 2001 GMAC Bowl game. Dec. 20, 2001. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Cincinnati, 2000 Motor City Bowl game. Dec. 28, 2000. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Western Michigan, 2000 MAC Championship game. Dec. 3, 2000. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Collage of Marshall University football championships from the 1990s. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Brigham Young, 1999 Motor City Bowl. Dec. 28, 1999. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Western Michigan, 1999 MAC Championship. Dec. 4, 1999. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Ohio, 1999 perfect season. Nov. 26, 1999. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Louisville, 1998 Motor City Bowl. Dec. 24, 1998. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Toledo, 1998 MAC Championship game. Dec. 5, 1998. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Toledo, 1997 MAC Championship game. Dec. 6, 1997. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Montana, 1996 NCAA Division I-AA Championship. Dec. 22, 1996. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Montana, 1996 NCAA Division I-AA Championship. Dec. 22, 1996. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save Marshall vs. Youngstown State, 1992 NCAA Division I-AA Championship. Dec. 20, 1992. Size: 12x18 Facebook Twitter WhatsApp SMS Email Print Copy article link Save **More like this...** Page 1B March 11, 2024 -- Marshall Women SBC Champs. Size: 12x24 Sept. 10, 2022 -- Marshall beats No. 8 Notre Dame in Notre Dame's home opener. Size: 12x24 Page 1B Sept. 11, 2022 -- Marshall beats No. 8 Notre Dame. Size: 12x24 Page 4B Sept. 11, 2022 -- Marshall beats No. 8 Notre Dame. Size: 12x24 Marshall vs. Indiana, 2020-2021 NCAA College Cup national championship, May 18, 2021. Size: 12x24 Marshall vs. Indiana, 2020-2021 NCAA College Cup national championship, May 18, 2021. Size: 12x24 2019 Celebrating Jon Elmore's Record-Breaking Career at Marshall University, 2015-2019. 12x18 size Marshall vs. South Florida, 2018 Gasparilla Bowl, Dec. 21, 2018. Size: 12x24 Marshall vs. South Florida, 2018 Gasparilla Bowl, Dec. 21, 2018. Size: 12x24 Marshall vs. WKU, 2018 Conference USA men's basketball championship, March 11, 2018. Size: 12x24 Marshall vs. WKU, 2018 Conference USA men's basketball championship, March 11, 2018. Size: 12x24 Marshall vs. Wichita St, 2018 NCAA Tournament, March 17, 2018. Size: 12x18 Marshall vs. UConn, 2015 St. Petersburg Bowl. Dec. 27, 2015. Size: 12x24 Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Marshall vs. Northern Illinois, 2014 Boca Raton Bowl. Dec. 24, 2014. Size: 12x24 Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Marshall vs. Louisiana Tech, 2014 Conference USA Championship game. Dec. 7, 2014. Size: 12x24 Marshall vs. Maryland, 2013 Military Bowl. Dec. 28, 2013. Size: 12x24 Marshall vs. Ohio, 2009 Little Caesars Pizza Bowl. Dec. 27, 2009. Size: 12x24 Marshall vs. Louisville, 2002 GMAC Bowl game. Dec. 19, 2002. Size: 12x18 Marshall vs. Toledo, 2002 MAC Championship game. Dec. 8, 2002, sports front. Size: 12x18 Marshall vs. Toledo, 2002 MAC Championship game. Dec. 8, 2002. Size: 12x18 Marshall vs. East Carolina, 2001 GMAC Bowl game. Dec. 21, 2001. Size: 12x18 Marshall vs. East Carolina, 2001 GMAC Bowl game. Dec. 20, 2001. Size: 12x18 Marshall vs. Cincinnati, 2000 Motor City Bowl game. Dec. 28, 2000. Size: 12x18 Marshall vs. Western Michigan, 2000 MAC Championship game. Dec. 3, 2000. Size: 12x18 Collage of Marshall University football championships from the 1990s. Size: 12x18 Marshall vs. Brigham Young, 1999 Motor City Bowl. Dec. 28, 1999. Size: 12x18 Marshall vs. Western Michigan, 1999 MAC Championship. Dec. 4, 1999. Size: 12x18 Marshall vs. Ohio, 1999 perfect season. Nov. 26, 1999. Size: 12x18 Marshall vs. Louisville, 1998 Motor City Bowl. Dec. 24, 1998. Size: 12x18 Marshall vs. Toledo, 1998 MAC Championship game. Dec. 5, 1998. Size: 12x18 Marshall vs. Toledo, 1997 MAC Championship game. Dec. 6, 1997. Size: 12x18 Marshall vs. Montana, 1996 NCAA Division I-AA Championship. Dec. 22, 1996. Size: 12x18 Marshall vs. Montana, 1996 NCAA Division I-AA Championship. Dec. 22, 1996. Size: 12x18 Marshall vs. Youngstown State, 1992 NCAA Division I-AA Championship. Dec. 20, 1992. Size: 12x18 **More like this...** **Welcome to the discussion.** Keep it Clean.Please avoid obscene, vulgar, lewd, racist or sexually-oriented language.PLEASE TURN OFF YOUR CAPS LOCK.Don't Threaten.Threats of harming another person will not be tolerated.Be Truthful.Don't knowingly lie about anyone or anything.Be Nice.No racism, sexism or any sort of -ism that is degrading to another person.Be Proactive.Use the 'Report' link on each comment to let us know of abusive posts.Share with Us.We'd love to hear eyewitness accounts, the history behind an article. Page Reprints: High School Championships Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter Instagram Contact Us Rack Locations Search Advertising Information Subscribe Customer Service Classifieds Newsletters Public Notices Home News Sports Features/Entertainment Business Opinion Obituaries Multimedia Events Calendar e-Edition Digital Archives **** Sorry, an error occurred. **** Already Subscribed! Cancel anytime **Sign Up** Account processing issue - the email address may already exist The latest in news, sports and opinion delivered directly to your inbox The weekend's biggest headlines in one convenient package Stay informed with the latest on WVU and Marshall sports Comprehensive coverage of high school sports in West Virginia and beyond Your go-to source for local arts, entertainment and eats Stay up to date with the latest news from the state Capitol, including Phil Kabler's Statehouse Beat column Explore Appalachia with the latest in travel and recreation Sign up with **You're all set!** Thank you. Your account has been registered, and you are now logged in. Check your email for details. **Log In** Invalid password or account does not exist Sign in with **Reset Password** Submitting this form below will send a message to your email with a link to change your password. **Forgot Password** An email message containing instructions on how to reset your password has been sent to the email address listed on your account. **Email me a log in link** **Promotional Offers** No promotional rates found. **Purchase GiftPurchase Access** Secure & Encrypted Secure transaction.Secure transaction. Cancel anytime. **You're all set!** Thank you. Your gift purchase was successful!Your purchase was successful, and you are now logged in. A receipt was sent to your email. **An error occurred**"}