{"id": 1118, "name": "Positive News", "domain": "positive.news", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.positive.news/environment/resurgent-tuna-and-rebounding-elephants-the-dogged-conservation-efforts-bearing-fruit/", "title": "Resurgent Tuna And Rebounding Elephants The Dogged Conservation Efforts Bearing Fruit", "content": "SectionsSocietyEnvironmentLifestyleScienceEconomicsOpinionUKWorldPartnersAll articles Society Environment Lifestyle Science Economics Opinion UK World Partners All articles Society Environment Lifestyle Science Economics Opinion UK World Partners All articles Support Positive News Magazine Log InNewsletter sign-up Log In Newsletter sign-up Log In Newsletter sign-up Newsletter sign-up Log In **Resurgent tuna and rebounding elephants: the dogged conservation efforts bearing fruit** When science meets with international co-operation, wildlife populations get a precious chance to recover When science meets with international co-operation, wildlife populations get a precious chance to recover It’s not easy being green these days, as Kermit once put it. If the climate crisis doesn’t get you down, then ‘drill baby drill’ surely will – plumbing the depths, as it were, of sheer insanity. Then there’s the wave of extinction threatening wildlife across the globe, from polar bears to honey bees, and Britain, to its shame, languishing in the bottom 10% of countries when it comes to the intactness of its biodiversity. Enough already: where exactly in this little lot, I hear you ask, are the silver linings? One answer – or rather, dozens of them – came courtesy of the Rewilding Futures conference in Cambridge earlier this year. Organised by a group of young conservationists calledCitizen Zoo(CZ), it sparkled with success stories in which the tide of destruction has been halted and turned – and not just among the usual suspects. Take Mozambique. Ravaged by civil war in the 80s, landmines and poaching had taken a devastating toll on its elephants, hippos and zebras. But now a sustained conservation programme, including protected corridors that straddle national borders, has seen wildlife recover to above pre-war numbers. Part of the secret lies in tying the programme to local development schemes such as those for girls’ education, helping bring communities on side. The huge, fat-bodied angel shark – once seen as severely threatened – is beginning to bounce back. Image: ScubaDiverse Or take South America, where a remarkable initiative backed by the Conservation Land Trust is buying up vast tracts of land from ranchers, merging them with other protected areas to create an astonishing 19 million sq km devoted to nature. Crucially, it allows local people access in order to reap economic benefits – not least from tourism tied to the revival of the jaguar. This is ecological restoration, as one speaker put it, “with teeth”. Even beleaguered Britain is doing its bit, said CZ’s director of rewilding, Elliot Newton, pointing out that the UK has more nature reserves than McDonalds restaurants. “If you think there isn’t enough space, remember that the Scottish Highlands [hardly a haven of productive agriculture, and now home to some of the country’s most ambitious rewilding at scale] has a lower population density than Montana.” That’s just on land: even more remarkable progress is happening in a very different kind of wide open space – the sea. The transformation here is one of the great unsung stories of conservation, and it was summed up by Charles Clover, veteran environmental journalist and co-founder of the Blue Marine Foundation. The Rewilding Futures conference sparkled with success stories in which the tide of destruction has been halted and turned – and not just among the usual suspects Twenty years ago, he said, there was only one story here, and it was summed up by the title of his 2005 book, The End of the Line. This charted decades of over-fishing, which had seen stocks plummet to the verge of extinction. It seemed irredeemable. But now a combination of pressure from NGOs, fishers themselves, and that rare thing – government action – has rewritten the script, as summed up in the title of his latest book, Rewilding the Sea. Clover points to a rise in marine protected areas (MPAs) under UK control, which is giving stocks a chance to recover. Some of them are close to hand, like the Dogger Bank – now closed to trawling. Others are far-flung, like the ocean around Ascension Island. International co-operation, with the EU and elsewhere, has reaped rewards too. “Take the Atlantic bluefin tuna – a fish once thought so valuable that fishing would go on until the last one was caught,” said Clover. Following a sustained campaign, there are now 400% more bluefin, he points out. “We have bluefin popping up in places where they haven’t been seen for 60 years, all because the right, scientifically based management decisions were finally taken.” Atlantic blue fin tuna numbers have recovered well in recent years. Image: DeepAqua It’s the same story closer to home in Lyme Bay, off the coast of east Devon and west Dorset – “known as England’s coral garden” – where a ban on the trawling practices that had literally scraped the sea bare of almost all life has led to an astonishing recovery. Sixteen years on from the ban, said Clover, there are “four times the overall number of species, four times the number of commercially valuable fish”. The ban’s since been replicated off the Sussex coast, with similarly promising results, and the idea’s being picked up by fishing communities in the Ionian islands of Greece, too. In all these cases, fish once seen as severely threatened – from bream to angel shark – are bouncing back. Clover sums it up. “Conservation works: economically as well as ecologically – if you just let it.” It’s not the end of the story – industrial fishing still threatens swathes of sea life around the world. But it’s far from the end of the line. Martin Wright is a director of Positive News Main image: DeepAqua **Be part of the solution** Positive News is helping more people than ever to get a balanced and uplifting view of the world. While doom and gloom dominates other news outlets, our solutions journalism exists to support your wellbeing and empower you to make a difference towards a better future. But our reporting has a cost and, as an independent, not-for-profit media organisation, we rely on the financial backing of our readers. If you value what we do and can afford to, please get behind our team with a regular or one-off contribution. Give once from just £1, or join 1,500+ others who contribute an average of £3 or more per month. You’ll be directly funding the production and sharing of our stories – helping our solutions journalism to benefit many more people.Join our community today, and together, we’ll change the news for good. Support Positive News **Related articles** Conservation fish fishing Ocean rewilding Wildlife Society Environment Lifestyle Science Economics Opinion About Positive News Contact us Customer FAQs Our policies Terms and conditions Rules of the society Partners Become a supporter Positive News magazine My account Stock magazine Careers Website:Atomic Smash At Positive News, we tell stories of progress and possibility — for your wellbeing and the world’s. If our journalism makes a difference to you, help us keep it going with a one-off or regular contribution."}