{"id": 450, "name": "Fluids and Barriers of the CNS", "domain": "fluidsbarrierscns.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fluidsbarrierscns.biomedcentral.com/articles/supplements/volume-20-supplement-1", "title": "Volume 20 Supplement 1", "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Submission Guidelines **Articles** Collections Supplements Reviewer acknowledgements Volume 20 Supplement 1 **Abstracts from the International Symposium “Signal Transduction at the Blood-Brain Barriers” 2022** **Meeting abstracts** Publication of this supplement was funded by the Department of Translational Biomedicine and Neuroscience, University of Bari School of Medicine. Bari, Italy21-23 September 2022 Conference website Abstracts from the International Symposium “Signal Transduction at the Blood–Brain Barriers” 2022Authors:Citation:Fluids and Barriers of the CNS202320(Suppl 1):26Content type:Meeting AbstractsPublished on:19 April 2023ViewFull TextViewPDF **Abstracts from the International Symposium “Signal Transduction at the Blood–Brain Barriers” 2022** ViewFull Text ViewPDF **Abstracts from the International Symposium “Signal Transduction at the Blood–Brain Barriers” 2022** ViewFull Text ViewPDF Editorial Board Manuscript editing services Instructions for Editors Sign up for article alerts and news from this journal ISSN: 2045-8118 (electronic) Advertisement ISSN: 2045-8118 Submission enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}