{"id": 1297, "name": "StateScoop", "domain": "statescoop.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://statescoop.com/bead-uncertainty-state-broadband-chiefs-advancing-slowly-cautiously/", "title": "Bead Uncertainty State Broadband Chiefs Advancing Slowly Cautiously", "content": "StateScoop AIScoop FedScoop DefenseScoop CyberScoop EdScoop TopicsBackCybersecurityModernizationAIEmerging TechData & AnalyticsDigital Services Cybersecurity Modernization AI Emerging Tech Data & Analytics Digital Services Cybersecurity Modernization AI Emerging Tech Data & Analytics Digital Services Special Reports Events Podcasts Videos Insights AI StateScoop 50 Subscribe to Newsletters Advertise StateScoop AIScoop FedScoop DefenseScoop CyberScoop EdScoop Broadband **BEAD uncertainty has state broadband chiefs advancing slowly, cautiously** ByKeely Quinlan June 3, 2025 In the face of looming changes to the federalBroadband Equity, Access, and Deployment program, and headwinds created by uncertainty, several state broadband chiefs said their offices are cautiously moving ahead in their planning. At the Fiber Broadband Association’s FiberConnect conference in Nashville this week, several state broadband chiefs shared both their frustration and trepidation regarding anticipated changes to the $42.45 billion program. Commerce Secretary Howard Lutnick in March announced intentions to “revamp” the program, including “to cut government red tape that slows down infrastructure construction.” Lutnick also signaled his intention to remove the program’s “fiber first” stipulation, which would allow states to give more of their BEAD funding to alternative technology providers, such assatellite internet service providers— a move some states are also pushing for. However, in some states, these yet-to-be-seen changes have had the opposite of Lutnick’s intended effect to speed things along. Some state broadband leaders said the uncertainty has forced them to slow down their BEAD projects. And, while the states were expecting these changes to be released by the National Telecommunications and Information Administration last month, the guidancemay not even appear until July. Sally Doty, director of the Office of Broadband Expansion and Accessibility of Mississippi, said her office currently has its BEAD application window open, though she said she was not sure when it was going to close because they are awaiting the NTIA’s guidance to see if any adjustments will be necessary to the program. Bree Maki, executive director of the Minnesota Office of Broadband Development, said her state, too, pumped the brakes on BEAD. Her office wrapped its first round of the BEAD subgrantee selection process — which includes gathering proposals from internet service providers — last April, she said, but moving onto the second round has been slowed so as not to create duplicative work for vendor applicants. “It’s more complicated than it appears on the paper,” Maki said. “But also, you know, elephant in the room, we all know that guidance is coming. So, one thing that we really considered in the state was not to move forward too fast and put our ISPs through another grant application that might have to be redone to the beginning.” Michigan Chief Connectivity Officer Eric Fredrick said his state — which has the country’s third largest number of BEAD-eligible locations — has also wrapped its first round of gathering proposals. He said that while the process was a great success, “we’re waiting for that policy news [from the NTIA] to see how much of that we’re going to have to redo or not.” Despite the imminent changes, other states are proceeding with BEAD planning. Rebecca Dilg, director of the Utah Broadband Center, said her state has completed its first round of gathering proposals from ISPs and hopes the center will open the required second round in “the next couple of days.” She added that despite the anticipated changes to BEAD, Utah is “not stopping.” “I will say that we have decided to not pause. We are actually not delayed. We’re right in the timeline of where we have projected that we would be. In July is when we need to have everything wrapped up and turned in. We’ll be close to that, granted that there’s not massive changes to the [BEAD] policy,” Dilg said. “Which, rumor has it, that that’ll be out any day now. That rumor has been out there for quite awhile.” Meanwhile, in neighboring Nevada, Brian Mitchell, director of the Governor’s Office of Science, Innovation and Technology, said Monday that as one of the three states that has received final approval from the NTIA, the looming changes have not yet impacted how the state intends to proceed. “We’re just waiting on some final paperwork from the Department of Commerce before we can get started with our program — unless, of course, something else happens, so I’ll leave it there,” Mitchell said. In April, the NTIAgranted states a 90-day extensionto submit their final proposals. Mitchell said the extension didn’t do much for Nevada, mainly because the state had already moved through the majority of the process. Utah’s Dilg said the extension means nothing without having the official programs changes released in the form of new guidance. “Even though we are given 90 days — I know the other state broadband leaders are with me on this — we are waiting when it comes to the policy,” she said. “There was a period of time when NTIA had just gone quiet for months and months.” Dilg urged other state broadband leaders and internet providers to contact elected officials and the NTIA to be included in the upcoming policy changes. “This has got to a point, and it might be with many of you,” Dilg said to the conference, “it’s been very frustrating as you think, ‘Well, I guess we’re not doing anything. We better wait until we wait and see what the policy is.’ It’s like, no, we don’t want to wait to see what the policy is. We want to be part of forming that policy. So I’d say that’s one more thing that we are doing during this 90-day pause, is we’re making sure we are reaching out or involve letters from our governors, senators, whatnot, that are going to the NTIA and having lots of conversations with them.” Broadband Broadband Equity Access and Deployment (BEAD) Howard Lutnick NTIA State & Local News Facebook LinkedIn Twitter Copy Link **More Like This** Hawaii to create statewide broadband officeByKeely Quinlan **Hawaii to create statewide broadband office** **Hawaii to create statewide broadband office** Commerce Sec. Lutnick releases new BEAD guidance, with ‘tech-neutral approach’ByKeely Quinlan **Commerce Sec. Lutnick releases new BEAD guidance, with ‘tech-neutral approach’** **Commerce Sec. Lutnick releases new BEAD guidance, with ‘tech-neutral approach’** North Carolina’s new CIO says she runs ‘at the speed of business’BySophia Fox-Sowell **North Carolina’s new CIO says she runs ‘at the speed of business’** **North Carolina’s new CIO says she runs ‘at the speed of business’** **Top Stories** States are picking sides as competing election integrity efforts move aheadByColin Wood **States are picking sides as competing election integrity efforts move ahead** **States are picking sides as competing election integrity efforts move ahead** **More Scoops** **Maine lawmakers urge Trump admin to unfreeze ‘essential’ Digital Equity Act funds** **Trump proposal to end Digital Equity Act is ‘serious setback,’ says state broadband chief** **Trump vows to end Biden’s ‘unconstitutional’ Digital Equity Act** **At least half of BEAD locations no longer eligible for funding, report claims** **States get 90-day extension for final BEAD proposals** **Amid federal pushes away from fiber broadband, Texas kicks off satellite pilot program** **Federal digital equity grants frozen days after California opens applications** **Latest Podcasts** **State** Staffing cuts to FEMA, NOAA will impair disaster response, says alerts expert New York State lags on next-generation 911 transition, audit shows Utah doesn't issue identities anymore — it 'endorses' them California launches heat-ranking tool and $32M program to combat extreme heat **City** Report: Chinese hackers used Cityworks vulnerability to deliver malware AI to speed building permits in L.A. after wildfires Texas governor declares disaster after water system failure in Marlin CIO of Texas-Mexico border city named 2025 technology champion **Cybersecurity** February phishing campaign compromised Illinois health data, department says Texas governor signs bill for statewide Cyber Command Ohio secretary of state pushes new security directive for county election boards Nebraska's joint security operations center is filling gaps left by federal cuts **Modernization** Virginia DMV selects vendor for IT overhaul One-stop licensing portal project comes with challenges, says West Virginia's CIO California's extended pause on next-generation 911 project raises concerns Next-generation 911 funding omitted from House budget markup FedScoop DefenseScoop CyberScoop StateScoop EdScoop AIScoop Newsletters Advertise with us Ad Specs (202) 887-8001 hello@statescoop.com FB TW LI Instagram YT"}