{"id": 2168, "name": "Vibe", "domain": "vibe.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.vibe.com/lists/jamie-foxx-mariah-carey-kirk-franklin-snoop-dogg-honored-with-2025-bet-ultimate-icon-award-best-moments/", "title": "Jamie Foxx Mariah Carey Kirk Franklin Snoop Dogg Honored With 2025 Bet Ultimate Icon Award Best Moments", "content": "**site categories** News Music Features Movies & TV Lifestyle **Diddy’s ‘Monster’s Ball’ Inmate Costume Sold For Over $24,000** Home News Events **Jamie Foxx, Mariah Carey, Kirk Franklin, Snoop Dogg Honored With 2025 BET Ultimate Icon Award: Best Moments** The four groundbreaking musicians were praised with help from special guests like Stevie Wonder, Busta Rhymes, and more. ByRegina Cho **Regina Cho** Disney, Universal File First Major Studio Copyright Lawsuit Against A.I. Company: “Piracy Is Piracy” How To Watch 2025 BET Awards Online For Free Judge Warns Diddy He Could Be Kicked Out Of Court For His “Absolutely Unacceptable” Behavior Share this article on Facebook Share this article on Twitter Share this article on Flipboard Share this article on Pinit + additional share options added Print this article Print this article Print this article Print this article Print this article Share this article on Print Print this article The 2025BET Awardshad plenty to celebrate tonight (June 9), including its 25th anniversary and the comeback oflegendary music video countdown show106 & Park.This year, the program also had a stacked line-up of legends who were presented with the BET Ultimate Icon Award. The honorees areMariah Carey, one of the best-selling female artists of all time;Jamie Foxx, the Oscar, Grammy, Golden Globe, and BAFTA-winning entertainer;Kirk Franklin, gospel superstar and 20-time Grammy Award winner; andSnoop Dogg, the iconic rapper, producer. Hosted by Kevin Hart,“Culture’s Biggest Night”put the spotlight on the four to commemorate their “decades of groundbreaking contributions to music, entertainment, advocacy, and community impact” with the award. The “Always Be My Baby” singer performed her latest single “Type Dangerous,” while Stevie Wonder surprised Foxx during his segment. The Long Beach rapper delivered a medley of his greatest hits after being introduced by Dr. Dre, and Kirk Franklin brought the house down with his powerful grand finale. Other performers who took the stage tonight were 5x GRAMMY Award-winningicon Lil Wayne, Leon Thomas, and Rayven Lenae. For the106tribute, stars from the early aughts reunited to recreate the staple show including Amerie, B2K, Jim Jones, and Bow Wow. In terms of nominations, Kendrick Lamar led the pack this year with 10 total nods. Following that, Drake,Doechii,Future, and GloRilla were tied with six nominations each. Check out a recap of the BET Ultimate Icon Award segments below. Mariah CareyImage Credit: Christopher Polk/Billboard via Getty ImagesDJ D-Nice kicked things off by warming up the crowd and welcoming them to “Club Mariah.” Surrounded by partygoers on stage, he took everybody down memory lane by running through some of theDaydreamsinger’s top hits like “Fantasy,” “Honey,” and more.The stage design matched Carey’s signature glamorous aura as a plethora of enormous “MC” monograms illuminated all around her. She sauntered down the stairs in an all-gold sequin mini dress and performed “Type Dangerous,” the lead single from her forthcoming project. “I’m lookin’ for the dangerous type/ I said I like ’em dangerous, dangerous/ Fresh outta Sing Sing, nah, I’m just playin’,” she sang in perfect pitch as Anderson .Paak killed it on the drums. She kept her movements to a minimum, emphasizing that her presence itself is the present.[youtube https://www.youtube.com/watch?v=235UP8V_wLk?feature=oembed&w=500&h=281]Toward the end of the show, Busta Rhymes had the honor of bringing Mimi back on stage to present her with the award and speak about their relationship. He recalled how Mariah graciously collaborated with him on “I Know What You Want” and embraced him putting features on it, a moment he says makes him feel forever indebted to her.The woman of the hour spoke briefly, acknowledging it’s her first-ever BET Award, but “if you’re going to get one, might as well start with the ultimate icon award!” She added, “I decided to own who I am. My extra-ness, my fabulous-ness, and my iconic-ness. I appreciate it and I’m so grateful for all of you celebrating with me tonight.” **Mariah Carey** DJ D-Nice kicked things off by warming up the crowd and welcoming them to “Club Mariah.” Surrounded by partygoers on stage, he took everybody down memory lane by running through some of theDaydreamsinger’s top hits like “Fantasy,” “Honey,” and more. The stage design matched Carey’s signature glamorous aura as a plethora of enormous “MC” monograms illuminated all around her. She sauntered down the stairs in an all-gold sequin mini dress and performed “Type Dangerous,” the lead single from her forthcoming project. “I’m lookin’ for the dangerous type/ I said I like ’em dangerous, dangerous/ Fresh outta Sing Sing, nah, I’m just playin’,” she sang in perfect pitch as Anderson .Paak killed it on the drums. She kept her movements to a minimum, emphasizing that her presence itself is the present. Toward the end of the show, Busta Rhymes had the honor of bringing Mimi back on stage to present her with the award and speak about their relationship. He recalled how Mariah graciously collaborated with him on “I Know What You Want” and embraced him putting features on it, a moment he says makes him feel forever indebted to her. The woman of the hour spoke briefly, acknowledging it’s her first-ever BET Award, but “if you’re going to get one, might as well start with the ultimate icon award!” She added, “I decided to own who I am. My extra-ness, my fabulous-ness, and my iconic-ness. I appreciate it and I’m so grateful for all of you celebrating with me tonight.” **Mariah Carey** DJ D-Nice kicked things off by warming up the crowd and welcoming them to “Club Mariah.” Surrounded by partygoers on stage, he took everybody down memory lane by running through some of theDaydreamsinger’s top hits like “Fantasy,” “Honey,” and more. The stage design matched Carey’s signature glamorous aura as a plethora of enormous “MC” monograms illuminated all around her. She sauntered down the stairs in an all-gold sequin mini dress and performed “Type Dangerous,” the lead single from her forthcoming project. “I’m lookin’ for the dangerous type/ I said I like ’em dangerous, dangerous/ Fresh outta Sing Sing, nah, I’m just playin’,” she sang in perfect pitch as Anderson .Paak killed it on the drums. She kept her movements to a minimum, emphasizing that her presence itself is the present. Toward the end of the show, Busta Rhymes had the honor of bringing Mimi back on stage to present her with the award and speak about their relationship. He recalled how Mariah graciously collaborated with him on “I Know What You Want” and embraced him putting features on it, a moment he says makes him feel forever indebted to her. The woman of the hour spoke briefly, acknowledging it’s her first-ever BET Award, but “if you’re going to get one, might as well start with the ultimate icon award!” She added, “I decided to own who I am. My extra-ness, my fabulous-ness, and my iconic-ness. I appreciate it and I’m so grateful for all of you celebrating with me tonight.” Jamie FoxxImage Credit: Christopher Polk/Billboard via Getty ImagesTo doJamie Foxx’s illustrious legacy justice, BET phoned in several other legendary names to tribute his multifaceted career.Stevie Wonderhandled introduction duties, charming the crowd with his wit and humor. “Jamie and I go way back… Just because you play a blind man, doesn’t mean we’re besties,” he said as the crowd roared with laughter. “Just remember, I spent tireless hourswatchingand editing the footage for tonight.”Craig Robinson wove in and out of the tribute by introducing the artists who surprised Foxx one by one, starting with Babyface and Ludacris together. Then, they ushered in his “Oscar era” with Tank and Jennifer Hudson blowing the roof off of the venue with moments fromRay.By this time, Foxx was in tears as he watched with awe from the crowd. The performance couldn’t end without doing his 2008 smash hit “Blame It.” Doug E. Fresh, T-Pain, and Teddy Riley took over for the song and ended the tribute with a bang.[youtube https://www.youtube.com/watch?v=LRrsr0hmaZ0?feature=oembed&w=500&h=281]TheJamie Foxx Showstar’s emotional acceptance speech was filled with gratitude for his journey and the people who have supported him throughout it. He spoke about hishealth scare from last year,saying, “When I saw the memoriam, I was like man, that could have been me. I don’t know why I went through what I went through, but I know my second chance, I’m not gonna turn down. I have so much love to give.” He also emphasized how honored he was to receive such a prestigious award from BET, adding, “The icon award means the most because it comes from us.” **Jamie Foxx** To doJamie Foxx’s illustrious legacy justice, BET phoned in several other legendary names to tribute his multifaceted career.Stevie Wonderhandled introduction duties, charming the crowd with his wit and humor. “Jamie and I go way back… Just because you play a blind man, doesn’t mean we’re besties,” he said as the crowd roared with laughter. “Just remember, I spent tireless hourswatchingand editing the footage for tonight.” Craig Robinson wove in and out of the tribute by introducing the artists who surprised Foxx one by one, starting with Babyface and Ludacris together. Then, they ushered in his “Oscar era” with Tank and Jennifer Hudson blowing the roof off of the venue with moments fromRay. By this time, Foxx was in tears as he watched with awe from the crowd. The performance couldn’t end without doing his 2008 smash hit “Blame It.” Doug E. Fresh, T-Pain, and Teddy Riley took over for the song and ended the tribute with a bang. TheJamie Foxx Showstar’s emotional acceptance speech was filled with gratitude for his journey and the people who have supported him throughout it. He spoke about hishealth scare from last year,saying, “When I saw the memoriam, I was like man, that could have been me. I don’t know why I went through what I went through, but I know my second chance, I’m not gonna turn down. I have so much love to give.” He also emphasized how honored he was to receive such a prestigious award from BET, adding, “The icon award means the most because it comes from us.” **Jamie Foxx** To doJamie Foxx’s illustrious legacy justice, BET phoned in several other legendary names to tribute his multifaceted career.Stevie Wonderhandled introduction duties, charming the crowd with his wit and humor. “Jamie and I go way back… Just because you play a blind man, doesn’t mean we’re besties,” he said as the crowd roared with laughter. “Just remember, I spent tireless hourswatchingand editing the footage for tonight.” Craig Robinson wove in and out of the tribute by introducing the artists who surprised Foxx one by one, starting with Babyface and Ludacris together. Then, they ushered in his “Oscar era” with Tank and Jennifer Hudson blowing the roof off of the venue with moments fromRay. By this time, Foxx was in tears as he watched with awe from the crowd. The performance couldn’t end without doing his 2008 smash hit “Blame It.” Doug E. Fresh, T-Pain, and Teddy Riley took over for the song and ended the tribute with a bang. TheJamie Foxx Showstar’s emotional acceptance speech was filled with gratitude for his journey and the people who have supported him throughout it. He spoke about hishealth scare from last year,saying, “When I saw the memoriam, I was like man, that could have been me. I don’t know why I went through what I went through, but I know my second chance, I’m not gonna turn down. I have so much love to give.” He also emphasized how honored he was to receive such a prestigious award from BET, adding, “The icon award means the most because it comes from us.” Snoop DoggImage Credit: Kevin Winter/Getty ImagesDr. Dre took the stage to introduceSnoop Dogg, highlighting their decades worth of friendship and collaboration throughout the years. His speech focused on Snoop’s incomparably vast career, poking fun at how he would make a hit or star in a mainstream movie and then suddenly “do sh*t like this,” as the screen pulled up arandom side questthe “Gin And Juice” rapper has completed.He began by shouting out his fellow honorees, praising Franklin for singing at his mother’s funeral, Foxx for being down with him since before their fame, and MC for lighting up his life when he was in jail in the ‘90s. TheDoggystylecreator also mentioned people who were instrumental in his career, Nate Dogg, Warren G, his Death Row family, his wife Shante and kids, and others. He credited Charlie Wilson as his “life coach” who “taught him how to get his wife back, and get his life back.”[youtube https://www.youtube.com/watch?v=ZU7xNmseSsw?feature=oembed&w=500&h=281]“Being an icon ain’t about fame, it’s about legacy. It’s about what you build, what you leave behind, and who you lift up along the way,” he said. He walked off but returned shortly after to perform his greatest hits like “Drop It Like It’s Hot,” “Nuthin’ but a G’thang,” “It Ain’t No Fun” with Warren G and Kurupt, and “Beautiful” with Charlie Wilson. **Snoop Dogg** Dr. Dre took the stage to introduceSnoop Dogg, highlighting their decades worth of friendship and collaboration throughout the years. His speech focused on Snoop’s incomparably vast career, poking fun at how he would make a hit or star in a mainstream movie and then suddenly “do sh*t like this,” as the screen pulled up arandom side questthe “Gin And Juice” rapper has completed. He began by shouting out his fellow honorees, praising Franklin for singing at his mother’s funeral, Foxx for being down with him since before their fame, and MC for lighting up his life when he was in jail in the ‘90s. TheDoggystylecreator also mentioned people who were instrumental in his career, Nate Dogg, Warren G, his Death Row family, his wife Shante and kids, and others. He credited Charlie Wilson as his “life coach” who “taught him how to get his wife back, and get his life back.” “Being an icon ain’t about fame, it’s about legacy. It’s about what you build, what you leave behind, and who you lift up along the way,” he said. He walked off but returned shortly after to perform his greatest hits like “Drop It Like It’s Hot,” “Nuthin’ but a G’thang,” “It Ain’t No Fun” with Warren G and Kurupt, and “Beautiful” with Charlie Wilson. **Snoop Dogg** Dr. Dre took the stage to introduceSnoop Dogg, highlighting their decades worth of friendship and collaboration throughout the years. His speech focused on Snoop’s incomparably vast career, poking fun at how he would make a hit or star in a mainstream movie and then suddenly “do sh*t like this,” as the screen pulled up arandom side questthe “Gin And Juice” rapper has completed. He began by shouting out his fellow honorees, praising Franklin for singing at his mother’s funeral, Foxx for being down with him since before their fame, and MC for lighting up his life when he was in jail in the ‘90s. TheDoggystylecreator also mentioned people who were instrumental in his career, Nate Dogg, Warren G, his Death Row family, his wife Shante and kids, and others. He credited Charlie Wilson as his “life coach” who “taught him how to get his wife back, and get his life back.” “Being an icon ain’t about fame, it’s about legacy. It’s about what you build, what you leave behind, and who you lift up along the way,” he said. He walked off but returned shortly after to perform his greatest hits like “Drop It Like It’s Hot,” “Nuthin’ but a G’thang,” “It Ain’t No Fun” with Warren G and Kurupt, and “Beautiful” with Charlie Wilson. Kirk FranklinImage Credit: Christopher Polk/Billboard via Getty ImagesFor the show’s grand finale, T.I. spoke to the bridge between gospel music and other genres, a skillKirk Franklinmastered throughout the years. Praising him for being at the forefront of “combining the hood with hymns,” Franklin’s influence was honored for being a transformative force in the industry.When theGod’s Propertysinger stepped on stage, he delivered a powerful speech thanking all the people who helped him get to where he is today, including family members, teachers, and collaborators. “I’m not person. I fail, I sin, I’m not a perfect Christian, I’m not a perfect husband, and we all know I’m not a perfect father. I’m not even a perfect artist, which makes this award even more amazing, because what I do don’t even make sense,” he said as the crowd clung onto his words.“And if you’re listening to this, that’s how you know it’s God, when it don’t makes sense.”Franklin closed out the show by taking the crowd to church and performing hits like “Stomp,” “Silver & Gold,” “Melodies From Heaven,” and more, with D.C. Young Fly even joining him for a remix of “Revolution.” **Kirk Franklin** For the show’s grand finale, T.I. spoke to the bridge between gospel music and other genres, a skillKirk Franklinmastered throughout the years. Praising him for being at the forefront of “combining the hood with hymns,” Franklin’s influence was honored for being a transformative force in the industry. When theGod’s Propertysinger stepped on stage, he delivered a powerful speech thanking all the people who helped him get to where he is today, including family members, teachers, and collaborators. “I’m not person. I fail, I sin, I’m not a perfect Christian, I’m not a perfect husband, and we all know I’m not a perfect father. I’m not even a perfect artist, which makes this award even more amazing, because what I do don’t even make sense,” he said as the crowd clung onto his words. “And if you’re listening to this, that’s how you know it’s God, when it don’t makes sense.” Franklin closed out the show by taking the crowd to church and performing hits like “Stomp,” “Silver & Gold,” “Melodies From Heaven,” and more, with D.C. Young Fly even joining him for a remix of “Revolution.” **Kirk Franklin** For the show’s grand finale, T.I. spoke to the bridge between gospel music and other genres, a skillKirk Franklinmastered throughout the years. Praising him for being at the forefront of “combining the hood with hymns,” Franklin’s influence was honored for being a transformative force in the industry. When theGod’s Propertysinger stepped on stage, he delivered a powerful speech thanking all the people who helped him get to where he is today, including family members, teachers, and collaborators. “I’m not person. I fail, I sin, I’m not a perfect Christian, I’m not a perfect husband, and we all know I’m not a perfect father. I’m not even a perfect artist, which makes this award even more amazing, because what I do don’t even make sense,” he said as the crowd clung onto his words. “And if you’re listening to this, that’s how you know it’s God, when it don’t makes sense.” Franklin closed out the show by taking the crowd to church and performing hits like “Stomp,” “Silver & Gold,” “Melodies From Heaven,” and more, with D.C. Young Fly even joining him for a remix of “Revolution.” Get weekly rundowns straight to your inbox BET Awards Jamie Foxx Kirk Franklin Mariah Carey Snoop Dogg **The Vibe Newsletter** Get weekly rundowns straight to your inbox **Most Popular** 50 Cent Reacts To Cam’ron Asking Male Sex Worker About His Son’s Mother, Daphne Joy **50 Cent Reacts To Cam’ron Asking Male Sex Worker About His Son’s Mother, Daphne Joy** **50 Cent Reacts To Cam’ron Asking Male Sex Worker About His Son’s Mother, Daphne Joy** **50 Cent Reacts To Cam’ron Asking Male Sex Worker About His Son’s Mother, Daphne Joy** 50 Cent Questions If Ex Daphne Joy Is “Jane Doe” In Diddy Sex… **50 Cent Questions If Ex Daphne Joy Is “Jane Doe” In Diddy Sex…** **50 Cent Questions If Ex Daphne Joy Is “Jane Doe” In Diddy Sex…** **50 Cent Questions If Ex Daphne Joy Is “Jane Doe” In Diddy Sex…** Cam’ron Questions Male Escort, The Punisher, About Diddy’s Alleged “Freak-Offs&#8221… **Cam’ron Questions Male Escort, The Punisher, About Diddy’s Alleged “Freak-Offs&#8221…** **Cam’ron Questions Male Escort, The Punisher, About Diddy’s Alleged “Freak-Offs&#8221…** **Cam’ron Questions Male Escort, The Punisher, About Diddy’s Alleged “Freak-Offs&#8221…** How To Watch 2025 BET Awards Online For Free **How To Watch 2025 BET Awards Online For Free** **How To Watch 2025 BET Awards Online For Free** **How To Watch 2025 BET Awards Online For Free** Judge Warns Diddy He Could Be Kicked Out Of Court For His “Absolutely Unacceptable&#8221… **Judge Warns Diddy He Could Be Kicked Out Of Court For His “Absolutely Unacceptable&#8221…** **Judge Warns Diddy He Could Be Kicked Out Of Court For His “Absolutely Unacceptable&#8221…** **Judge Warns Diddy He Could Be Kicked Out Of Court For His “Absolutely Unacceptable&#8221…** **On Instagram** A post shared by VibeMagazine (@vibemagazine) **You may also like** **Horacio Rodríguez lanza Fundamentals, un startup de servicios para artistas y sellos** **Horacio Rodríguez lanza Fundamentals, un startup de servicios para artistas y sellos** **Indie Basketball GM Video Game Spikes in Wake of Doncic Trade** **Indie Basketball GM Video Game Spikes in Wake of Doncic Trade** **A Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million** **A Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million** **Darren Criss Scores Third Straight Tony for ‘Glee’ Stars but Will ‘Chess’ Make It Four?** **Darren Criss Scores Third Straight Tony for ‘Glee’ Stars but Will ‘Chess’ Make It Four?** About Us Advertise Contact Us Accessibility Privacy Policy California Privacy Rights Terms and Conditions Privacy Preferences AdChoices Your Privacy Choices News Music Features Lifestyle **Connect with Us** Get our latest stories in the feed of your favorite networks facebook instagram pinterest twitter youtube **Have a Tip?** We want to hear from you! Send us a tip using our anonymous form. **Stay in the Know** Sign up for our weekly newsletter Vibe is a part of Penske Media Corporation. © 2025 Vibe Media, LLC. All Rights Reserved. **optional screen reader** Art in America Artforum ARTnews BGR Billboard BlogHer Deadline Flow Space Gold Derby IndieWire LA3C Life is Beautiful Robb Report Rolling Stone SheKnows Soaps Sourcing Journal Sportico Spy StyleCaster The Hollywood Reporter TVLine Variety Vibe WWD NewsExpand news menuMovies & TVEntertainmentNationalSportsPoliticsEvents **NewsExpand news menu** Movies & TV Entertainment National Sports Politics Events **NewsExpand news menu** Movies & TV Entertainment National Sports Politics Events MusicExpand music menuMusic NewsVideosMusic PremieresReviewsInterviews **MusicExpand music menu** Music News Videos Music Premieres Reviews Interviews **MusicExpand music menu** Music News Videos Music Premieres Reviews Interviews FeaturesExpand features menuPhotosListsOpinionDigital CoversVIBE VivaVIBE VixenArchives **FeaturesExpand features menu** Photos Lists Opinion Digital Covers VIBE Viva VIBE Vixen Archives **FeaturesExpand features menu** Photos Lists Opinion Digital Covers VIBE Viva VIBE Vixen Archives LifestyleExpand lifestyle menuFashionStyleTech **LifestyleExpand lifestyle menu** Fashion Style Tech **LifestyleExpand lifestyle menu** Fashion Style Tech **Follow Us** Follow Vibe on facebook Follow Vibe on instagram Follow Vibe on pinterest Follow Vibe on twitter Follow Vibe on youtube **Alerts & Newsletters** **optional screen reader** About Us Advertise Contact Us Accessibility"}