{"id": 2069, "name": "NGO Monitor", "domain": "ngo-monitor.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://ngo-monitor.org/reports/funding-for-terror-linked-ngos-through-us-registered-charities-and-financial-service-providers/", "title": "Funding For Terror Linked Ngos Through Us Registered Charities And Financial Service Providers", "content": "TwitterFacebookYoutubeInstagram En De Fr ע PublicationsReportsKey IssuesBooksAcademic PublicationsSubmissions and StatementsNGO Monitor CorrespondencesIn The MediaBlog Reports Key Issues Books Academic Publications Submissions and Statements NGO Monitor Correspondences In The Media Blog Reports Key Issues Books Academic Publications Submissions and Statements NGO Monitor Correspondences In The Media Blog NGOs & FundersNGOsGovernment FundersPrivate Funders NGOs Government Funders Private Funders NGOs Government Funders Private Funders Funding DatabasesIsraeli NGO Funding Database – Annual ReportsIsraeli NGO Funding Database – Quarterly ReportsConsolidated Palestinian NGO Funding Database Israeli NGO Funding Database – Annual Reports Israeli NGO Funding Database – Quarterly Reports Consolidated Palestinian NGO Funding Database Israeli NGO Funding Database – Annual Reports Israeli NGO Funding Database – Quarterly Reports Consolidated Palestinian NGO Funding Database NGO Campaigns DatabasesMapping the anti-Israel NGO Network in the USThe NGO Campaign to Discredit the IHRA DefinitionPalestinian Minors involved in Terror2021 Gaza Conflict: Turning Terrorists into Civilians Mapping the anti-Israel NGO Network in the US The NGO Campaign to Discredit the IHRA Definition Palestinian Minors involved in Terror 2021 Gaza Conflict: Turning Terrorists into Civilians Mapping the anti-Israel NGO Network in the US The NGO Campaign to Discredit the IHRA Definition Palestinian Minors involved in Terror 2021 Gaza Conflict: Turning Terrorists into Civilians Who Funds Us AboutFAQsStaffBoardsContact FAQs Staff Boards Contact FAQs Staff Boards Contact Donate **Funding for Terror-Linked NGOs through US-Registered Charities and Financial Service-Providers** Terror-linked organizations – including groups with ties to US-designated terrorist groups Hamas, Hezbollah, and the Popular Front for the Liberation of Palestine (PFLP) – are raising funds in the United States. These NGOs receive donations in the US from tax-exempt 501c3 charities, as well as through donor-advised and financial service providers. Others use US-based companies to process donations. Some of these NGOs – Union of Agricultural Work Committees (UAWC), Al-Haq, and Defense for Children International-Palestine (DCI-P) – are designated as terrorist entities by Israel citing their ties to the PFLP. Palestinian Centre for Human Rights (PCHR) is also linked to the PFLP, and members of Al Mezan are tied to both Hamas and the PFLP. In another example, Hind Rajab Foundation, whose founder and director, Dyab Abou Jahjah, has boasted of his Hezbollah ties and isreportedly on a US “no-fly” list, uses US-registered Stripe Inc. to process donations. **US Tax-Exempt Organizations Providing and Enabling Funding for Terror-linked NGOs** **Foundation for Middle East Peace(FMEP) (2023 revenue–$1.5 million)** According to its website, in2025FMEP provides funding to Al-Haq, Al-Haq Europe, Al Mezan, Defense for Children International – Palestine (DCI-P), and Palestinian Centre for Human Rights (PCHR). FMEP does not state how much each NGO is receiving. (See below for details of these NGOs’ terror ties.) According toFMEP’s 2023 IRS filings(latest available), it granted $10,000 to Al Mezan and $58,000 to Al-Haq in that year. In addition to terror-linked NGOs, FMEP also funds NGOs engaged in antisemitic campaigns in the US, including on campuses, such as Jewish Voice for Peace (JVP), IfNotNow, and Palestine Legal. **Open Society Foundation(OSF) (2023 revenue-$840million)** According toOpen Society’s grant database, OSF has provided grants to Al-Haq ($800,000 in 2020-2023), Al-Haq Europe ($250,000 in 2023-2025), and Al Mezan ($170,000 in 2023; $450,000 in 2021-2024). OSF also funds NGOs engaged in antisemitic campaigns in the US, including on campuses, such as JVP and the US Campaign for Palestinian Rights (under the name of Education for Just Peace in the Middle East). **Grassroots International(2023 revenue –$13 million)** In 2023-2025, Grassroots Internationalsolicited donationsto the Palestinian Centre for Human Rights (PCHR), though it is unclear how much money PCHR received. In 2024, Grassroots International referred to PCHR as a “long-term partner.” **Rockefeller Brothers Fund(RBF) (2023 revenue –$118 million)** In 2020-2022, RBF granted$100,000to Defense for Children International – Palestine (DCI-P). RBFalso funds organizations engaged in antisemitic campaigns in the US, including on campuses,such asJVP, Palestine Legal, IfNotNow, and the US Campaign for Palestinian Rights (under the name of Education for Just Peace in the Middle East). In December 2023, theNew York Postpublished an articleaccusing RBF of “shell[ing] out more than $2.6 million since 2018 directly or indirectly to at least six anti-Israel organizations, several of which openly celebrated Hamas’ Oct 7 terrorist attack on the Jewish state.” In astatement, RBF defended the grants claiming, “We categorically reject any claim that our grantee organizations support, materially or ideologically, acts of terrorism… We conduct robust due diligence to ensure our grantees comply with all U.S. laws and regulations.” **Cultures of Resistance Network (2022 revenue –$31,258)** According to the Cultures of Resistance Network, it has funded Al-Haq (2024, unknown amount) and DCI-P (2021-2024, unknown amount). According to its2022 IRS filings, Cultures of Resistance Network granted $20,000 to Charities Aid Foundation America for DCI-P. (See more on CAF America below.) Cultures of Resistance Network haspreviously provided fundingto Al Mezan, Al-Awda, BADIL, Holy Land Trust, International Solidarity Movement (ISM), Jewish Voice for Peace, Medical Aid for Palestinians, Palestine Children’s Relief Fund, Palestine Medical Relief Society, Stop the Wall, Students for Justice in Palestine (SJP), and the Union of Agricultural Work Committees (UAWC). **Donor-Advised Funds and Financial Service Providers** **Charities Aid Foundation America(CAF America)** Headquartered in Alexandria, Virginia, CAF America facilitatesdonor-advised grantmaking, offeringmultipledonor-advisedplatforms. It lists DCI-P as a member of a “vetted network” of “charitable organizations” to whichcontributions can be made. **Stripe, Inc.** Stripe is a multinational financial services companyregistered in Delaware, with US headquarters in San Francisco.Stripe processes donations for Al-Haq EuropeandHind Rajab.1 **Terror-linked NGOs Named in this Report** **Hind Rajab Foundation** Founded in Belgium in 2024, theHind Rajab Foundation (HRF)initiates legal proceedings seeking the arrest of Israelis who have served in the IDF, including US citizens. It has also provided material to the International Criminal Court (ICC), demanding arrest warrants for former US President Joe Biden, former Secretary of State Antony Blinken, and former Secretary of Defense Lloyd Austin. Dyab Abou Jahjah –HRF Chair In a 2003 New York Times article, Abou Jahjah claimed he had “joined the Hezbollah resistance against Israel” and“had some military training, I’m still very proud of that.”In a 2024eulogyfor Hassan Nasrallah,Jahjah claimed he met the Hezbollah leader in 2001. According toinformation provided by Israeli security officials to theJerusalem Postin February 2025, Abou-Jahjah is linked, by family and business ties, to several actors designated as part of Hezbollah’s vast terror funding network. According to this report, Abou-Jahjah is also included in the US government’s “No Fly” list. On September 25, 2024, Jahjahstatedthat “in 2009, as director of the International Union of Parliamentarians for Palestine, I organized visits for Hezbollah’s political leadership to several European countries, including the UK… We met with various prominent figures in the UK, including an important Conservative MP representing Shadow Foreign Secretary at the time, William Hague.” On October 7, 2023, Jahjahposted: “These Palestinian resistance fighters entering these settlements are all refugees whose parents were ethnically cleansed from these villages in 1948/1967. Anyone neglecting this fact is not seriously engaging in a conversation but is spreading Israeli propaganda, whether willfully or not.” In November 2001, Jahjah described the 9/11 attacks as “sweet revenge.” In 2005, Jahjahdefendedformer Iranian President Mahmoud Ahmadinejad for calling for Israel to be wiped off the map,writingthat “his position on this matter is the only possible moral one.” In 2017, Jahjah who then served as a columnist for Belgian outlet De Standaard, wasfiredafter he praised a terror attack that killed four Israelis, saying that “liberation of Palestine by any means necessary needs to take place.” **Al Mezan** Al Mezan Center for Human Rights is highly active inanti-Israel lawfare campaignsand hasadvocated for arrest warrantsagainst Israeli officials for alleged “war crimes.” Al Mezan has submittednumerous documentsto the International Criminal Court (ICC) demanding prosecution of Israeli officials. Al Mezan has partnered with Palestinian terrorist organizations in these efforts. For instance, on April 9, 2015, Al-Mezanhosted a conference in Gazaabout prosecuting Israelis at the ICC, featuring representatives from Hamas, PIJ, and the PFLP. **Al Mezan Staff’s Links to the PFLP and Hamas** **Issam Younis –Al Mezan Director** In 2017, Al-Mezan director Issam Younis participated in a panel discussion on “The requirement for supporting and the success of the national [Palestinian internal] reconciliation,” alongside Hamas leader Yahya Sinwar. Representatives from other US-designated terrorist organizations – including Palestinian Islamic Jihad (PIJ) Political Bureau member Khaled Al-Batsh and Popular Front for the Liberation of Palestine (PFLP) Political Bureau member Kayed Al- Ghoul – also participated in the conference. Al-Mezan director Issam Younis (on the right)addressinga 2017 panel with Hamas leader Yahya Sinwar (on the left). **Nafiz Al-Madhoun –Al Mezan Board Member** Al-Madhoun has held a seat on Al-Mezan’s board (from at leastJanuary 2015and at least untilFebruary 2025). Al-Madhoun is the formerDirector-General of the Hamas-controlled Palestinian Legislative Council. He served in this role from at least2010through at leastJune 2022. Nafez al-Madhoun (2nd from left)participatingin an October 2010 Hamas workshop alongside Hamas spokesperson Taher al-Nunu (far right), Hamas co-founder Mahmoud al-Zahar (2nd from right), and senior Hamas official Mohammad al-Ghoul (center). In March 2023, Al-Madhoun participated in the “Jurists Confronting the Occupier” event, alongside leading Hamas officials. Al-Madhoun (circled in red)participatingin an event hosted by the Hamas-affiliated International Center for Law Studies. To his right, Hamas legislator Faraj al-Ghoul; to his left, Hamas Political Bureau member Muhammed Al-Zahar. For more information on Al Mezan staff links to the PFLP and Hamas, see NGO Monitor’s report, “Al Mezan Center For Human Rights’ Ties to the PFLP Terror Group.” **Union of Agricultural Work Committees (UAWC)** The Union of Agricultural Work Committee (UAWC) is identified by Fatah as an official “affiliate” and by aUSAID-engaged auditas the “agricultural arm” of the PFLP. In 2022, theDutch government announcedthe results of an 18-month audit conducted by a Dutch firm that identified 34 individuals who held positions in both UAWC and the PFLP between 2007-2020. As a result,the Netherlands canceled its contract with UAWC. On October 22, 2021, the Israeli Ministry of Defense declared UAWC a “terror organization” because it is part of “a network of organizations” that operates “on behalf of the ‘Popular Front’.” Two UAWC financial officers were arrested in 2019 for leading a PFLPterror cellthat perpetrated the August 2019 murder of a 17-year-old Israeli in a bombing. The PFLP claimed responsibility for the attack and has identified both men –Samer ArbidandAbdel Razeq Farraj– as group members. For more information on UAWC’s links to the PFLP, see NGO Monitor’s report, “Union of Agricultural Work Committees’ Ties to the PFLP Terror Group.” **Al-Haq & Al-Haq Europe** Al-Haq leads anti-Israel efforts at the ICC, and related BDS efforts, by claiming Israeli international law violations. On October 22, 2021, the Israeli Ministry of DefensedesignatedAl-Haq a terrorist entity, identifying it as operating “ “on behalf of the Popular Front [for the Liberation of Palestine].” Moreover, in May 2018, Visa, Mastercard, and American Expressshut downonline credit card donations to Al-Haq due to the group’s ties to the PFLP. Ramallah-based Al-Haq established a European entity, “Al-Haq Human Rights Organisation Europe (Al-Haq Europe),”registeredon September 27, 2022, by the Business Court of Brussels. As detailed by NGO Monitor, Al-Haq Europe appears to be closely linked to Ramallah-based Al-Haq. (For more information on Al-Haq Europe, see NGO Monitor’s report, “Potential Circumvention of Terror-Finance Sanctioned Palestinian NGO.”) Al-Haq has lobbied on behalf of Palestinian terrorist organizations: In March 2024, Al-Haqpublished a reportasserting that Palestinian terrorism does not exist: “Even if individual acts of struggle [terrorism] breach provisions of international humanitarian law in bello, never should the Israeli colonial power or the international community categorise the collective resistance of the Palestinian people in pursuit of their inalienable jus cogens right to self-determination as ‘terrorism’, and justify its policy of suppression accordingly.” In aJuly 2023 letterto members of the European Parliament, Al-Haq insisted that “by keeping democratically elected political parties on the EU terrorist list, the EU is perpetuating the denial of self-determination of the Palestinian people.Hamas needs to be removed from the terrorist list” (emphasis added). Al-Haq Staff’s Links to the PFLP and Hamas Shawan Jabarin–Al-Haq General Director The Israeli Supreme Court has identified Jabarin as a leading PFLP member on multiple occasions: In2007, the Court identified Jabarin as “apparently acting as a manner of Doctor Jekyll and Mister Hyde, acting some of the time as the CEO of a human rights organization, and at other times as an activist in a terror organization which has not shied away from murder and attempted murder, which have nothing to do with rights…” In 2008, the Israeli Supreme Courtnotedthat Jabarin is “among the senior activists of the Popular Front [for the Liberation of Palestine] terrorist organization.” Additionally, other sources have noted Jabarin’s participation in PFLP-related events, as well as liaising with members of Hamas and other terror groups: In February 2019, Jabarinparticipatedin an event hosted by the PFLP in memory of “comrade fighter” Maher Al-Yamani. Al-Yamani was a PFLP “founder,” a “member of the Central Committee and one of its most prominent military commanders,” and “coordinated special operations…in particularthe operation against an aircraft of the Israeli company El Al in July 1968 in Greece.” In May 2019, Jabarinattended a memorial event organized by the PFLP. Itcenteredon PFLP political bureau member Rabah Muhanna, who, according to information posted by the PFLP, “contributed to the establishment” of several PFLP-affiliated NGOs. The hall was decorated with PFLP paraphernalia. In 2017, Jabarin participated in a panel discussion on “The requirement for supporting and the success of the national [Palestinian internal] reconciliation.” Jabarin joined the panel, which included Hamas leaderYahya Sinwar, via video. According tomultipleArabic-languagemediasources, Jabarin represented the PFLP at a December 2011 meeting of the Follow-Up Committee for Issues of Public Liberties and Trust Building. This body served as areconciliatory bodybetween Hamas, Fatah, PIJ, the PFLP, and other Palestinian factions. Al-Haq director Shawan Jabarin (far right on screen) remotelyaddressing a panelwith Hamas leader Yahya Sinwar (far right on dais). For more information on additional Al-Haq staff members’ links to the PFLP, seeNGO Monitor’s report. **Palestinian Centre for Human Rights (PCHR)** PFLP-linked PCHR engages in international anti-Israel advocacy campaigns, influencing and providing numerous materials to the International Criminal Court (ICC), as well as biased UN bodies. PCHR Links to the PFLP Raji Sourani – PCHR Founder and Director Raji Sourani is PCHR’sfounderand director. According to a1995 article in theWashington Report, he served “a three-year sentence [1979-1982] imposed by an Israeli court which convicted him of membership in the illegal Popular Front for the Liberation of Palestine…” He was alsodenied a US entry visain 2012. In February 2014, the PFLP organized aceremonyin Gaza honoring Sourani, featuring a speech by PFLP Politburo member,Rabah Muhana.During the eventSourani stated that “I was in the ranks of the Popular Front, and there were comrades who taught us with their own hands. This organization has given us much more. We hope that the direction and the sense of belonging that were planted inside us will remain in our minds. We don’t apologize and don’t regret our past,we are proud that once we were members of this organization and we fought in its ranks” (emphasis added). Tellingly, in May 2023, as Palestinian Islamic Jihad (PIJ) was bombarding Israel with barrages of rockets from Gaza, PCHR published a statement (on file with NGO Monitor) in which it “affirms the right of the Palestinian people to resist the occupation by all available means,including armed struggle…” (emphasis added). After criticism, and under pressure from European government donors, this text wasamended. For more information on PCHR’s PFLP ties, read NGO Monitor’s report “Palestinian Centre for Human Rights’ Ties to the PFLP Terror Group.” **Defense for Children International – Palestine (DCI-P)** The Palestinian NGO Defense for Children International-Palestine (DCI-P) engages in anti-Israel advocacy campaigns, alleging Israeli law violations. In October 2021,Israel designatedDCI-P as a terrorist entity, identifying it as part of “a network of organizations” that operates “on behalf of the ‘Popular Front [for the Liberation of Palestine].’” Relatedly, on June 26, 2018, UK Lawyers for Israel (UKLFI)announcedthat, after presenting evidence of the close ties between DCI-P and the PFLP to Citibank and Arab Bank PLC, “these banks no longer provide banking services to the terror-linked NGO.” The US-Based Global Giving crowdfunding resource alsoremoved DCI-Pfrom its website. Moreover, numerous individuals with alleged ties to the PFLP have been employed and appointed as board members at DCI-P. For more information on DCI-P’s links to the PFLP, see NGO Monitor’s report, “Defense for Children International – Palestine’s Ties to the PFLP Terrorist Organization.” **** **Appendix – NGO Officials Glorifying and Justifying Violence, and Reacting to October 7th** **Al-Haq** Aseel Al-Bajeh– FormerAl-Haq Legal Researcher and Advocacy Officer. According toAl-Bajeh’s LinkedIn profile, she had various roles at Al-Haq in March 2018- November 2023. On October 7, 2023, Al-Bajehtweeted by quoting Hamas head Ismail Haniyeh, “Leave our land, get out of our faces.” On October 12, 2023, Al-Bajehtweeted, “We don’t need to speak ofour right to resist, for it is not a right, but a way of being & survival for Palestinians. We don’t demand our right to narrate. Our ability to narrate was never out of our hands & resistance doesn’t need the pre- approval of static int’l law codes. Its (sic) not ‘our duty to exposethe bloody barbarism of zionism, their actions as afascist state & a ruthless armyare more than sufficient to undertake this task. We remain attached to our land & in our humanity, as Pal Arabs no need to prove our humanity to those who have lost it.” (emphases added) On January 28, 2023, the day after seven Israeli civilians were murdered by a Palestinian gunmen outside of a Jerusalem synagogue,Al-Bajeh tweeted, “More context: why are settlers allowed to be in occupied Jerusalem, a war crime that the world recognises?” – suggesting that the murders were justified. On January 29, 2023,Al-Bajeh tweeted, “Forcing Palestinians to Defend their Right to Resist is Another Complicity with Israel’s Colonialism.” On June 21, 2021,Al-Bajeh shared a collageof several Palestinians killed in clashes with the IDF and tweeted, “Shedding Palestinian blood & destructing (sic) entire families and futures is Zionism!”Among those featured in Al-Bajeh’s post were Palestinian Islamic Jihad (PIJ) and Al-Aqsa Martyrs’ Brigades members who hadperpetrated several shooting attacks in the West Bank. Al-Bajeh also included photos oftwo Hamas memberswhomurdered four Israeli civilians, including two minors, and wounded four others in a June 2023 shooting.Other Palestinians featured in Al-Bajeh’s tweet wereinvolved in violent riots and shooting attacksonIsraeli forces carrying out arrests in Jeninon June 19, 2023. Among those featured in Al-Bajeh’s post were Palestinian Islamic Jihad (PIJ) and Al-Aqsa Martyrs’ Brigades members who hadperpetrated several shooting attacks in the West Bank. Al-Bajeh also included photos oftwo Hamas memberswhomurdered four Israeli civilians, including two minors, and wounded four others in a June 2023 shooting. Other Palestinians featured in Al-Bajeh’s tweet wereinvolved in violent riots and shooting attacksonIsraeli forces carrying out arrests in Jeninon June 19, 2023. Among those featured in Al-Bajeh’s post were Palestinian Islamic Jihad (PIJ) and Al-Aqsa Martyrs’ Brigades members who hadperpetrated several shooting attacks in the West Bank. Al-Bajeh also included photos oftwo Hamas memberswhomurdered four Israeli civilians, including two minors, and wounded four others in a June 2023 shooting. Other Palestinians featured in Al-Bajeh’s tweet wereinvolved in violent riots and shooting attacksonIsraeli forces carrying out arrests in Jeninon June 19, 2023. On May 16, 2021,Al-Bajehposted onFacebookandTwitter, writing, “Resistance in its straightforward meaning is the only legitimate representative of the Palestinian people…” Ziad Hmaidan– Al-HaqHead of Training and Capacity Building On October 9, 2023, Hmaidanwroteon Facebook, “It is written in the Hadith: ‘You must wage jihad. The best jihad is preparing for war, and it is best to prepare for war in Ashkelon’.” In October 2023, Hmaidanshared a picture on Facebook of a Palestinian terrorist Ibrahim Nabulsi aiming a gun, and wrote, “A message of intense love. The picture of one of the men of the ‘flood’ [referring to the name ‘the flood of Al-Aqsa’ given by Hamas to the murderous October 7 attacks], during a confrontation in one of the [Israeli] bases that was stormed [by Palestinian terrorists]. This picture carries a thousand signs and meanings. Observe the picture that the sniper of the flood stuck on his rifle. Do you recognize who is in the picture? This intense love is for Ibrahim [Nabulsi]. For more information seeNGO Monitor’s report. **Palestinian Centre for Human Rights (PCHR)** PCHR staff and board members have consistently celebrated and justified violence against Israeli civilians. Yasser Abdel Ghafour–PCHR Deputy Director of Field Research On October 7, 2023, Ghafourshareda picture of Gazans celebrating on a looted IDF vehicle, and wrote, “Long live the heroes.” On October 7, 2023, Ghafourwrote, “This is an action done by a group which has been besieged for 17 years in a catastrophic state. One can only think what would have been if the decision to go to confrontation was collective in which all the [Muslim] nation and the arenas are a part of. In short, in spite of all their breakthroughs which they publicize and the technology they possess, they were still taken by surprise, by Allah’s favor. Peace be upon you heroes, you, and all of the people in Gaza that are supporting and aiding and joyous whatever the hurdles are. #Al-Aqsa_Flood.” For more information, see NGO Monitor’s report, “PCHR Board Members Call for Violence Against Israelis” **DCI-P** Miranda Cleland–DCI-P Advocacy Officer On October 8, 2023, the mayor of Washington DC published a statement announcing heightened security at “our synagogues, houses of worship, and embassies.” Clelandresponded, “It is beyond insulting and blatantly racist to assumePalestinians resisting Israeli colonization & trying to take back their landwill result in anti-Semitic attacks in DC. What a joke” (emphasis added). For more information, see NGO Monitor’s report, “DCI-P’s New Board: Celebrating Terrorists” **Footnotes** In September 2023,Stripesevered ties with Alliance for Global Justice (AFGJ) following severalWashington Examinerreportsthat exposed the links between Samidoun, one of AFGJ’s fiscally-sponsored NGOs, and the PFLP. Samidoun wasdesignated by the Treasury Departmentin October 2024. Share: Twitter Facebook LinkedIn Print: Print **Contents** **Topics in this Report** Popular Front for the Liberation of Palestine (PFLP) Terrorism United States All Topics **NGOs in this Report** Al-Haq Al Mezan Center for Human Rights Defense for Children International - Palestine Foundation for Middle East Peace (FMEP) Hind Rajab Foundation Union of Agricultural Work Committees (UAWC) All NGOs **Funders in this Report** Open Society Foundations (OSF) Rockefeller Brothers Fund United States All Funders ReportsBlog TwitterFacebookYoutubeInstagram Privacy Policy Contact עברית Deutsch Français English Copyright 2025 Institute for NGO Research - R.A. 58-0465508. All Rights Reserved."}