{"id": 1043, "name": "New York Magazine", "domain": "nymag.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://nymag.com/intelligencer/article/la-ice-protests-trump-vs-california-newsom-national-guard-updates.html", "title": "La Ice Protests Trump Vs California Newsom National Guard Updates.html", "content": "Intelligencer The Cut Vulture The Strategist Curbed Grub Street MagazineSubscribe to the MagazineGive a Gift SubscriptionBuy Back IssuesCurrent Issue ContentsNew YorkShop Subscribe Sign In AccountProfileSaved for laterSign Out Politics Business Technology Ideas About Intelligencer Newsletters New York App NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed **Search** Politics Business Technology Ideas About Intelligencer Newsletters New York App NYMag.com New York Magazine Intelligencer Vulture The Cut The Strategist Grub Street Curbed **Search** **ICE Expands Raids, Backed by U.S. Troops: Live Updates** Save this article to read it later. Find this story in your account’s‘Saved for Later’section. ICEraids in Los Angeles on Friday provoked days of unrest in the city as scores of protesters assembled to oppose them andPresident Trump’s crackdown on migrants. Some demonstrations have turned violent as protesters clashed with police, and in an extraordinary series of moves, Trump has deployed 4,000 National Guard members and 700 U.S. Marines to the city — all in opposition to requests by California governorGavin Newsomnot to interfere. It’s the first time since the civil-rights era that a president has activated the National Guard in defiance of a governor’s wishes, and the troops have begun taking part in ICE operations. Now, as law scholars fear the president’s overreach, Californiais attempting to stop Trumpin court, and demonstrations are continuing in L.A. and other cities around the country. Here’s the latest. **National Guard members have been trained to join ICE raids, and they have detained people** Major General Scott Sherman of the U.S. Army said Wednesday that about 500 members of the California National Guard had been trained to accompany ICE agents during their operations and that troops have temporarily detained civilians as part of those raids. Read the Associated Press reporthere. **A quota-driven crackdown** TheWashingtonPostreportsthat ICE isn’t just trying to make three times as many daily arrests but chasing inspection quotas too: The Immigration and Customs Enforcement division has ordered its 30 regional offices to meet quotas oninspections of employers’ documentation of their workers’ immigration status, according to three immigration lawyers and a former Department of Homeland Security government official familiar with the agency’s operations. The number of notices of inspection, known as I-9 audits, has increased “tenfold” since January, three lawyers said. The inspections can be a precursor to workplace raids and have recently been used by the Trump administration as a method for detaining undocumented workers without judicial warrants, according to immigration advocates and lawyers. Often, undocumented workers never return to work after ICE agents serve an employer an inspection notice. The directives have resulted in an explosion of immigration enforcement across industries and regions, according to four immigration lawyers. And this has prompted a shiftawayfrom targeting criminals: The former DHS official, who spoke on the condition of anonymity to describe private conversations about the quotas, said that agents were being “pushed for this weeks ago” but that the pressure to investigate workplaces has increased recently. Quotas may vary by region, the official added. As part of this effort, DHS has also recently reassigned more law enforcement agents from human trafficking and other transnational crime investigations to target U.S. employers, according to the former DHS official and two of the immigration attorneys. “They’re being pushed to basically work civil immigration and not do any criminal work,” the former DHS official said. **ICE is hitting L.A. car washes, too** A local labor group says the agency has targeted at least five car washes in Los Angeles and Orange counties in recent days.Reports the L.A.Times: Westchester Hand Wash, Culver City Express Hand Car Wash and Detail, Crenshaw Imperial Car Wash, Touch and Glow Car Wash in Whittier and Magnolia Car Wash in Orange County were among the businesses targeted. Flor Melendrez, executive director of [the labor advocacy group] CLEAN, said her organization has been able to verify these raids through community reports and footage on social media. The vast majority were workers, although one customer was picked up at Culver City Car Wash during a Sunday raid. “The agents are armed. They are grabbing people and putting them in vehicles, which is why we are calling them ‘kidnappings’ because they are not identifying themselves,” Melendrez said. Fox 11 reportsthat one customer was detained by ICE agents as they conducted a raid at a car wash in Culver City while his two distraught children watched: Seven-year-old Jorge Vasquez cried out uncontrollably as he watchedICE agentstake his father away in handcuffs. The child’s 15-year-old brother, Brian, yelled, “I’ll see you soon, Dad.” It happened on Sunday, June 8, around 2:25 p.m. Arturo Vasquez was with his wife and two sons at theCulver CityCar Wash. He does not work there; he was simply there to wash the family car. Brian says his father panicked when he saw ICE agents arrive and tried to leave, but agents stopped him and placed him under arrest. A TikTok video shows witnesses at the car wash visibly upset. Some shouted that they couldn’t believe agents would do that in front of a child who was overcome with emotion. Brian confirmed his father is undocumented and says he worked two jobs to support the family. **Trump-cheering soldiers at Fort Bragg were handpicked** Military.com reportsthat the abnormally partisan event at the U.S. Army base in North Carolina on Tuesday was designed to be a Trump rally: Internal 82nd Airborne Division communications reviewed by Military.com reveal a tightly orchestrated effort to curate the optics of Trump’s recent visit, including handpicking soldiers for the audience based on political leanings and physical appearance. One unit-level message bluntly saying: “No fat soldiers.” “If soldiers have political views that are in opposition to the current administration and they don’t want to be in the audience then they need to speak with their leadership and get swapped out,” another note to troops said. Service officials declined to comment when asked about the extent to which troops were screened, whether soldiers displaying partisan cheers on television – a violation of long-standing Pentagon rules – would be disciplined or if soldiers who objected to participating in the event, citing disagreements with the administration, would be disciplined or admonished in any way. “This has been a bad week for the Army for anyone who cares about us being a neutral institution,” one commander at Fort Bragg told Military.com on the condition of anonymity to avoid retaliation. “This was shameful. I don’t expect anything to come out of it, but I hope maybe we can learn from it long term.” **Gavin Newsom, opposition leader?** Iwrote about the governor’s big opportunityin a new post today: Most recently, California’s budget problems have forced Newsom to reverse his state’s long march toward expansion of health care and other progressive initiatives. A month ago, he looked a lot like a former political star beginning to fade from sight. All that was changed by the Trump administration’s decision to go nuclear on California on a broad range of policy disputes. Even as the presidentthreatened to eliminate all federal assistanceto the state to punish it for its alleged “wokeness” and incompetence, ICE launched widespread raids in and near the heavily Latino city of Los Angeles, and then Trump poured gasoline on small protest fires byfederalizing National Guard unitsand deploying U.S. Marines. For all the world, it looked like the federal government wasdeclaring war on the Golden State and its governor, whom itthreatened to arrest and jail. And now Newsom is rising to the occasion, delivering the best opposition speech of Trump’s second term. In a Tuesday evening address, Newsom said that the president sending the military to Los Angeles is just the first step in a broader move toward authoritarianism. Read the resthere. **86 protesters detained in New York City on Tuesday night** Hundredsgathered for a demonstrationoutside an ICE facility in downtown Manhattan; police arrested 34 people and detained another 52, then released them after issuing court summonses. Policearrested 17 people on Tuesday in Chicago, where thousands protested against ICE and Trump and some ultimately clashed with police. There was also a scary incident in which a hit-and-run driver drove through a crowd of protesters, injuring a 66-year-old woman. It’s not yet clear what motivated the driver. In Philadelphia on Tuesday,hundreds staged a protest against ICE outside the city’s Federal Department of Corrections. There were some clashes with police, who arrested 15 people. **ICE set to deploy tactical teams to more Democrat-led cities, including New York** According to NBC News: Special Response Teams (SRTs) are tactical units under ICE that use BearCat tracked vehicles, long guns and tactical vests in operations considered high risk. They were used in the raid on Sean “Diddy” Combs’ home, for example. They were most recently used in Los Angeles and are seen as among the reasons protests began. The sources said the SRTs have been ordered to deploy in Seattle, Chicago, Philadelphia, northern Virginia and New York. It is not clear that the raids in those cities will begin immediately, but all SRT units in those areas have been told to be ready to deploy, the sources said. **Bondi says Insurrection Act is still on the table** “Right now in California, we’re at a good point,”Trump’s attorney general told reporters on Wednesday. “We’re not scared to go further. We’re not frightened to do something else if we need to.” **Looks like the Marines are delayed** They’re still training for the deployment,reports CNN’s Natasha Bertrand: The 700 Marines mobilized to the LA area on Monday night are still undergoing training as of Wednesday morning, and it is not yet clear when they will be employed onto the streets to help with protests, according to a US Northern Command spokesperson. The spokesperson told CNN that as of this morning, the Marines “have NOT completed their [Standing Rules for the Use of Force] and nonlethal weapons training, and I do not have an estimate of when they will be employed by Task Force 51.” **The latest on California’s court battle with Trump** U.S. District Judge Charles R. Breyer denied the state’s emergency request for a restraining order on Tuesday and granted the Trump administration’s request for another day to respond to it. From theWashingtonPost: The Trump administration’s response to California’s motion is due by 11 a.m. Wednesday, and California will have until 9 a.m. Thursday to respond, Breyer ordered. The U.S. District Court for the Northern District of California will hold a hearing on the motion later that day. Newsom’s request appears to be based on limiting the role of the military if President Donald Trump were to invoke the Insurrection Act, which is supposed to be used in cases of armed rebellion, riots or other extreme circumstances. Unless Trump invokes the act, the Marines and National Guard sent to Los Angelescannot perform law enforcement tasks, like detaining people or dispersing protesters on the street, said David Janovsky, acting director of the Constitution Project at the nonprofit Project on Government Oversight. Speaking to reporters at the White House on Tuesday, the president signaled he is willing to consider it. “If there’s an insurrection, I would certainly invoke it,” he said. **Other Democratic governors see California as a potential preview** ReportsCNN’s Edward-Isaac Dovere: Allies and opponents agree how Newsom handles the protests – including Trump’s calling in the National Guard and sending in active-duty Marines over the governor’s objections – will reverberate far beyond California, and long after this week. That’s how Newsom is approaching what has become a fight on the streets and in the courts, only a few days after he was responding to aTrump administration effort to identify federal grantsgoing to the state that can be canceled. Other Democratic governors have been calling Newsom, checking in, ticking through scenarios in their minds of how what’s happened in California could play out at home for them, according to multiple people briefed on the conversations. **Curfew tamps down overnight protests and clashes in Los Angeles** At least 25 people were arrested in for violating last night’s curfew in downtown L.A. — the first overnight curfew since protests began late last week. There was also less destruction,per the L.A.Times. The curfew will likely remain in place for several more nights, according to Mayor Karen Bass. **Greg Abbott calls up the National Guard in Texas** In response to immigration-related protests, the Texas governor is taking a dramatic step: Texas National Guard will be deployed to locations across the state to ensure peace & order.Peaceful protest is legal.Harming a person or property is illegal & will lead to arrest.@TexasGuardwill use every tool & strategy to help law enforcement maintain order.https://t.co/rS8b5zgE3T San Antonio mayorRon Nirenbergsaysthe troops aren’t necessary, telling reporters on Wednesday that “we have the best police department in the country,” and adding that, “Much of this federal administration’s work, in my opinion, has been geared toward theater and provocation.” “I think the Trump administration, Abbott, and the folks in Austin have been intent on really amplifying these tensions.” **National Guard now backing up ICE, providing security for operations** The National Guard members that President Trump called in over the objections of Governor Newsom aren’t just protecting federal buildings, they’re now providing backup to ICE agents as they make immigration arrests in Los Angeles — the kind of arrests that sparked the current protests in the first place. From theAP: ICE said in a statement that the troops were “providing perimeter and personnel protection for our facilities and officers who are out on daily enforcement operations.” The change moves troops closer to engaging in law enforcement actions like deportations asTrump has promised. Assistant Homeland Security secretary Tricia McLaughlinalso saidthat “if any rioters attack ICE law enforcement officers, military personnel have the authority to temporarily detain them until law enforcement makes the arrest.” **Marines will deploy in L.A. today** Seven hundred Marines arrived in Los Angeles on Tuesday, over the objections of California governor Gavin Newsom and Mayor Karen Bass. The New YorkTimesreportedthat, per a spokesperson, “they have been receiving training in de-escalation, crowd control, and the rules for the use of force.” They are expected to hit the streets on Wednesday, joining the 2,000-plus National Guard members already on the ground. **Newsom on Trump in televised address: The ‘moment we have feared has arrived’** The governor delivereda big speechto Californians (and the rest of the country) on Tuesday night in which he explained his opposition to Trump’s actions in Los Angeles and warned that the U.S. is now on a path to authoritarianism: This isn’t just about protests here in Los Angeles. When Donald Trump sought blanket authority to commandeer the National Guard. he made that order apply to every state in this nation. This is about all of us. This is about you. California may be first, but it clearly will not end here. Other states are next. Democracy is next. Democracy is under assault right before our eyes, this moment we have feared has arrived. He’s taking a wrecking ball, a wrecking ball to our founding fathers’ historic project: three coequal branches of independent government. There are no longer any checks and balances. Congress is nowhere to be found. Speaker Johnson has completely abdicated that responsibility. The rule of law has increasingly been given way to the rule of Don. He then ended his speech with a call to “stand up”: At this moment, at this moment, we all need to stand up and be held to account, a higher level of accountability. If you exercise your First Amendment rights, please, please do it peacefully. I know many of you are feeling deep anxiety, stress, and fear. But I want you to know that you are the antidote to that fear and that anxiety. What Donald Trump wants most is your fealty, your silence, to be complicit in this moment. Do not give into him. If you want to watch the whole speech: [FULL ADDRESS] Governor Newsom addresses Californians in response to President Trump’s assault on democracy and the President’s illegal militarization of Los Angeles.pic.twitter.com/8Md1TFJbRm **ICE expands raids to California’s farming communities** The Los AngelesTimesreports: Alarm spread through California agricultural centers Tuesday as panicked workers reported that federal immigration authorities — who had largely refrained from major enforcement action in farming communities in the first months of the Trump administration — were showing up at farm fields and packinghouses from the Central Coast to the San Joaquin Valley. “Today we are seeing an uptick in the chaotic presence of immigration enforcement, particularly the Border Patrol,” said Elizabeth Strater, vice president of the United Farm Workers. “We’re seeing it in multiple areas.” … In Tulare County, near the community of Richgrove, immigration agents emerged near a field where farm laborers were picking blueberries, causing some workers to flee. In Fresno County, workers reported federal agents, some in Border Patrol trucks, in the fields near Kingsburg. And in Oxnard in Ventura County, organizers responded to multiple calls of federal immigration authorities staging near fields and entering a packinghouse at Boskovich Farms. Hazel Davalos of the group Cause, said there were reports of Immigration and Customs Enforcement agents trying to access multiple farms in Oxnard, but that in many cases, they were denied entry. **L.A. mayor imposes overnight curfew** Mayor Karen Bass hasannouncedthat there will be a curfew from 8 p.m. to 6 a.m. PT in a square mile of downtown Los Angeles. It’s the first overnight curfew imposed in the city due to protests since 2020 at the height of the nationwide George Floyd demonstrations. Residents of the area will be exempt from the curfew, as will journalists. Bass blamed overnight vandalism and looting: “Clearly after the violence that took place last night — 23 businesses looted — and just the extensive widespread nature of the vandalism, we reached a tipping point,” she said. The mayor also stressed that the recent unrest has only had an impact on a small part of the city, and a citywide curfew was thus unnecessary: I think it is important to point this out, not to minimize the vandalism and violence that has taken place there, it has been significant. But it is extremely important to know that what is happening in this one square mile is not affecting the city. Some of the imagery of the protests and the violence gives the appearance as though this is a citywide crisis and it’s not. Arrests have increased significantly in recent days, according to Los Angeles Police Department chief Jim McDonnell.He said on Tuesday eveningthat 114 people were arrested on Monday and 197 on Tuesday, including nearly 70 protesters who disrupted traffic on the 101 freeway. **ICE shares photos of National Guard members apparently taking part in agency operations** 📷Photos from today’s ICE Los Angeles immigration enforcement operation.pic.twitter.com/fb1AGH0qcx It’s not clear if the troops actually assisted with what appear to be arrests, or if they simply stood guard. **Is this Trump’s Reichstag fire?** I consider that possibility inmy new post: Perhaps it’s coincidental that the Los Angeles saga started witharrests in the parking lot of a Home Depotwhere day laborers often assemble to find work, or that it happened in Miller’s own Southern California stomping grounds. And maybe Trump’s quickdecisionto federalize California National Guard units and then deploy U.S. Marines to deal with protests that state and local law enforcement appear to have had under control was an improvisation as well, based on his hatred of Golden State leadership and hisregretsfor having failed to send in troops to quell racial-justice protests in his first term. Rhetorical overkill and excessive use of force on the immigration front have already been an abiding theme in Trump’s second term. It’s clear the White House sees immigration as“home turf” for Trumpand a much stronger issue than tariffs or Medicaid cuts. As a presidential staffertoldNBC News soon after taking over Gavin Newsom’s Guard units, “We’re happy to have this fight.” And some Democrats arecalling ita “distraction” from the debate over the Big Beautiful Bill and the bad publicity from Trump’snasty fight with Elon Musk. The more ominous possibility is that this is Trump’sReichstag fire(when a lone-wolf communist burned down Germany’s parliamentary building in 1933, the legitimately established Nazi government used the moment to assume authoritarian power). In this scenario, the Trump administration seizes on the images of violence in Los Angeles (real, if exaggerated, at least so far) to claim the right to deploy armed forces or other extreme measures more generally to implement its agenda in the face of public protest. According to this theory, the administration may be quickly escalating the conflict over ICE-raid protests in order to set a pretext for suspending legal limitations over its future plans within and beyond the mass-deportation initiative. Read the resthere. **Newsom’s request for a restraining order is denied by federal judge** California’s case against Trump, which aims to block the president’s deployment of troops in the state, was assigned to U.S. District Judge Charles Breyer, a former Watergate prosecutor who is the brother of retired Supreme Court Justice Stephen Breyer. Heset a Thursday hearingbut denied California’semergency motionfor a restraining order to prevent National Guard members and U.S. Marines from executing law enforcement in the state. BREAKING: Judge Breyer declines California request for immediate restraining order but sets a Thursday hearing:pic.twitter.com/6Ab24sR3o4 **Trump still saying L.A. would now be rubble without his intervention** This time, for an audience of cheering soldiers at Fort Bragg on Monday afternoon: TRUMP: Los Angeles would be burning today, just like their houses were burning months ago. Generations of Army heroes did not shed their blood on distant shores only to watch our country be destroyed by invasion ... as commander in chief, I will not let that happen FORT BRAGG TROOPS: *Hurrrraa!* He also called the city a “trash heap”: Trump: \"Within the span of a few decades, Los Angeles has gone from being one of the cleanest, safest, most beautiful cities on earth to being a trash heap with entire neighborhoods under the control of transnational gangs.\"pic.twitter.com/XxKNIhHEya **Guess who’s thrilled about sending in the troops?** Senator Tom Cotton has revamped his notorious op-ed,this time forTheWall Street Journal: The threat from the radical left is clear: Don’t enforce immigration laws. If you do, left-wing street militias will burn down cities, and Democratic politicians will back the rioters. The president is absolutely right to reject this threat, enforce immigration laws, and restore civil order. At the risk of again sending liberals to theirfainting couches, it may indeed be time to send in the troops. **Trump plans to send thousands of migrants to Guantánamo** Politico reportsthe plans aren’t finalized, but here’s where they stand at the moment: The Trump administration is planning to dramatically ramp up sending undocumented migrants to Guantanamo Bay starting this week, with at least 9,000 people being vetted for transfer, according to documents obtained by POLITICO. That would be an exponential increase from the roughly 500 migrants who have been held for short periods at the base since February and a major step toward realizing a plan President Donald Trump announced in January to use the facility to hold as many as 30,000 migrants. The transfers to Guantanamo could start as soon as Wednesday, the documents state. The expectation is that the detainees would be at the facility temporarily before being deported to their countries of origin. **Hegseth says L.A. troop deployment is part of new ‘phase’** The Defense secretary testified before the House Appropriations Committee on Monday and was grilled by Democrats. He made a troubling comment about the future use of the National Guard,per the New YorkTimes: I think we’re entering another phase, especially under President Trump with his focus on the homeland, where the National Guard and Reserves become a critical component of how we secure that homeland. **Trump threatens crackdown on anti-parade protesters, too** Trump on his parade this weekend: “If there's any protester that wants to come out, they will be met with very big force. For those people that want to protest, they're going to be met with very big force.”pic.twitter.com/xUqWdXfFIy **Your tax dollars at work** The estimated cost of deploying the NationalGuard and the Marines to the Los Angeles area is $134 million, according to the top Pentagon official (Bryn MacDonnell) testifying before the House. **Some migrants detained in last week’s L.A. raids have already been deported** Per theWashingtonPost: Asprotests over workplace raids in California’s largest citycontinued Monday and thePentagon announced it would be sending 700 Marinesto backstop National Guard troops, immigration lawyers, advocates and relatives were scrambling to find information about those detained. Mexico’s foreign minister said four immigrants detained in the raid had already been removed from the United States, a speed that some advocates said was unusual. The Trump administration has not released a total count of how many immigrants have been picked up in the raids that sparked a wave of unrest in Los Angeles and demonstrations around the country. But as the protests continued, a picture of who was detained was slowly coming together. The Department of Homeland Security released information on 16 people who they said had criminal histories that included charges or convictions of crimes including robbery, sexual battery and drug possession, according to the agency. DHS Assistant Secretary Tricia McLaughlin told Fox News on Monday that those picked up in the raids represent the “worst of the worst.” But immigrant advocacy groups say they have collected information indicating that more than 200 people were detained and that many do not have criminal records. **Can or will the Marines use force?** TheAssociated Press got a lookat the use-of-force draft that the Pentagon drew up for the deployment: According to a U.S. official, troops will be armed with their normal service weapons but will not be carrying tear gas. They also will have protective equipment such as helmets, shields and gas masks. When troops are overseas, how they can respond to threats is outlined by the rules of engagement. At home, they are guided by standing rules for the use of force, which have to be set and agreed to by Northern Command, and then each Marine should receive a card explaining what they can and cannot do, another U.S. official said. For example, warning shots would be prohibited, according to use-of-force draft documents viewed by The Associated Press. Marines are directed to deescalate a situation whenever possible but also are authorized to act in self-defense, the documents say. The Pentagon also is working on a memo with clarifying language for the Marines that will lay out the steps they can take to protect federal personnel and property. Those guidelines also will include specifics on the possibility that they could temporarily detain civilians if troops are under assault or to prevent harm, the first U.S. official said. **On Stephen Miller’s orders** The Wall Street Journalreportson the May meeting that seems to have prompted last week’s raids: [I]n late May, Stephen Miller, a top White House aide and the architect of the president’s immigration agenda, addressed a meeting at the headquarters of Immigration and Customs Enforcement, known as ICE. The message was clear: The president, who promised todeport millionsof immigrants living in the country illegally, wasn’t pleased. The agency had better step it up. Gang members and violent criminals, what Trump called the “worst of the worst,” weren’t the sole target of deportations. Federal agents needed to “just go out there and arrest illegal aliens,” Miller told top ICE officials, who had come from across the U.S., according to people familiar with the meeting. Agents didn’t need to develop target lists of immigrants suspected of being in the U.S. illegally, a longstanding practice, Miller said. Instead, he directed them to target Home Depot, where day laborers typically gather for hire, or 7-Eleven convenience stores. Miller bet that he and a handful of agents could go out on the streets of Washington, D.C., and arrest 30 people right away. “Who here thinks they can do it?” Miller said, asking for a show of hands. ICE agents appeared to follow Miller’s tip and conducted an immigration sweep Friday at the Home Depot in the predominantly Latino neighborhood of Westlake in Los Angeles, helping set off a weekend of protests around Los Angeles County, including at the federal detention center in the city’s downtown. **Protests continue beyond Los Angeles** Anti-ICE and pro-immigration demonstrations continued throughout the country on Monday, an extension of the protests that began in Los Angeles over the weekend. In Washington, D.C., protesters gathered outside the Justice Department headquarters in support of David Huerta, the California labor leader arrested by federal agents on Friday. He was ultimately released from custody on Monday. HAPPENING NOW: Hundreds of union members and allies are outside the Department of Justice to demand#FreeDavidNOW.pic.twitter.com/PMebVgfn6q Similar gatherings formed outside ofBoston City Hall, Texas’s state Capitol in Austin, and anICE field officein Atlanta, Georgia. **Mayor Bass: Stop the raids** During a press conference Monday evening, Los Angeles mayor Karen Bass urged the Trump administration to halt the immigration raids at the center of the ongoing unrest in the city and the region. “I am hopeful that the federal government will hear our plea: Stop the raids,” Bass said, perABC News. “This is creating fear and chaos in our city, and it is unnecessary. And I hope that we will be heard because our city is trying to move forward, and I believe that the federal government should be supportive of us moving forward.” The mayor said the government’s involvement in the city’s protests is likely a sign of what’s to come for other municipalities down the line. “It makes me feel like our city is actually a test case, a test case for what happens when the federal government moves in and takes the authority away from the state or away from local government,” she said. “I don’t think that our city should be used for an experiment.” **Trump vs. L.A. was inevitable** Kristi Noem on LA: \"They're not a city of immigrants. They're a city of criminals.\" The Bulwark’sAdrian Carrasquillo writesthat “the White House wanted this to be their staging ground”: The first reason for this belief is historical: Los Angeles has for decades been a frequent site of major civil rights–related protests, from the1968 East L.A. walkouts, when thousands of Chicano students protested inequality and prejudice in the public education system; to theriots in 1992over the acquittal of police officers involved in the beating of Rodney King; to historicprotest marches in 2006for immigration reform. The second point has to do with demographics. In covering that rollout so far, I’ve often written about Louisiana’s detention centers, which have come to be known for human rights abuses and for making detainees inaccessible to their lawyers and families. In such deep-red states, there’s also a sense among undocumented people that they are clearly, vastly outnumbered — and also with fewer allies. In that context, it makes sense to try to evade any kind of public scrutiny, to keep your head down and your profile low to try to keep your family together. But Los Angeles? It’salmost halfLatino; immigrants really are, as [journalist Ryanne] Mena said, the lifeblood of the city and the state. In L.A., nearlyhalf a million peoplelive in mixed-status families. Paramount — where agents sought out day laborers outside Home Depot after Stephen Miller suggestedmore Home Depot raids were needed— is 82 percent Latino, according tocensus figures. Once reports spread of the ICE offensive, it was only a matter of time before people took to the streets to defend their families, friends, and neighbors. Carrasquillo adds that the events in L.A. also indicate the overall opposition to Trump’s crackdown is crystalizing and intensifying: We are long past the phase of “mass deportation” in which bad actors or those with scary rap sheets are the main focus. Real, hard-working people — taken from the L.A. garment district or in front of a Home Depot while trying to find work — are being targeted. Americans were promised a crackdown on criminals and are instead watching masked peopledestroy families. Some were pleased to hear this. But others either did not believe Trump when he said he would do this or did believe him and opposed him — and it’s many of those people who now are rising up to say no. **Noem asked Hegseth to detain protesters** TheSan FranciscoChroniclereportsDHS Secretary Kristi Noem asked Defense Secretary Pete Hegseth to direct military forces to detain “lawbreakers”: A letter sent Sunday from Noem to Hegseth, obtained by the Chronicle, requested that the Pentagon give “Direction to DoD forces to either detain, just as they would at any federal facility guarded by military, lawbreakers under Title 18 until they can be arrested and processed by federal law enforcement, or arrest them.” The military is generally barred under federal laws from taking part in domestic law enforcement. Noem’s request may be a step toward the administration sidestepping those laws by invoking the Insurrection Act, two legal experts said in interviews. Noem also asked Hegseth for “drone surveillance support” as well as weapons and logistics assistance in Los Angeles … Stephen Dycus, an expert in national security law and the Insurrection Act, called the requests in the memo extraordinary given that local authorities appeared to be in control of the protests. In the rare cases that such military force has been used in the past, the Vermont Law and Graduate School professor emeritus said, local law enforcement had either lost control or was refusing to act. **Newsom ‘surges’ more law enforcement to Los Angeles, attacks Hegseth** The governorannounced on Monday nightthat he was sending in more than 800 additional officers from surrounding counties and the California Highway Patrol, though he framed the effort in part as to “clean up President Trump’s mess.” He also called the deployment of U.S. Marines to L.A. a “blatant abuse of power”: U.S. Marines serve a valuable purpose for this country -- defending democracy. They are not political pawns.The Secretary of Defense is illegally deploying them onto American streets so Trump can have a talking point at his parade this weekend.It’s a blatant abuse of power.… **So far, smaller L.A. protests with fewer clashes with police** TheLos AngelesTimesreportsthat at around 6 p.m. local time in L.A., police moved to break up a downtown protest: For most of the afternoon, National Guard and Border Patrol officers had stood guard in front of the building, which houses offices for Immigrations and Customs Enforcement and other agencies, as protesters milled around chanting. The crowd, smaller and quieter than the group on Sunday, was concentrated mainly in a one-block area. At one point, a water bottle was lobbed from deep within the crowd at police officers. Immediately, other protesters began to yell, “Peaceful protest!” One protester in a keffiyeh shouted, “No throwing water! It’s for the protesters.” But the damage had been done. Police were on the move. They rushed into the plaza with less-lethal weapons drawn. They routed several dozen protesters down a side street as fireworks and flash-bangs filled the air. Some of the protesters raised their hands in the air and continued chanting, “Peaceful protests” as they backed away from the building and toward Temple and Los Angeles streets. Others began to hurl bottles toward the line of law enforcement officers holding batons and launchers. An NBC4 News van was spray-painted in graffiti and anti-ICE messages. Two protesters were seen hurling skateboards at the van windows. At 7 p.m., the LAPD advised the public to avoid the Civic Center area of downtown L.A., as protesters had moved into surrounding streets. By 8:30 p.m., officers had winnowed the protest down to a group of around 50 contained on Alameda and Third Streets and were threatening to make arrests. **Trump orders another 2,000 National Guard members to Los Angeles** The Pentagonannouncedthe new order Monday night. That doubles the California National Guard presence in the city and brings the total number of federally deployed troops to 4,700, including U.S. Marines. It’s not clear when the additional troops will arrive or why they are even needed at this point.There was evidence on Mondaythat the National Guard members already deployed to L.A. were not well organized and didn’t have much to do. **Pentagon deploys 700 Marines to L.A.** Over the weekend, Defense Secretary Pete HegsethsuggestedU.S. Marines outside Los Angeles were on high alert and could be mobilized to quell the unrest in the city. NowCNNandThe Wall Street Journalreport that roughly 700 Marines will soon head to L.A., though CNNnotes“it is still unclear what their specific task will be”: One of the people familiar with the Marine mobilization said they will be augmenting the guard presence on the ground in L.A. Over 2,000 members of the California National Guard have been activated by the president, but only about 300 have been deployed to the streets of L.A. so far. Those initial 300 people were on a routine National Guard drill weekend when they were mobilized, which is why they were able to arrive so quickly, the person familiar said; it can take up to 72 hours for other guardsmen to be mobilized. The Marines are expected to bolster some of the guard members who have been deployed to L.A. in the last two days, this person said. And while the person familiar stressed that the Marines were being deployed only to augment the forces already there, the image of US Marines mobilizing inside the United States will stand in contrast to National Guardsmen who more routinely respond to domestic issues. While some Marines have been assisting in border security at the southern border, one US official said Marines have not been mobilized within the US like they are in California now since the 1992 riots in Los Angeles. While the Marines’ tasks have not been specified publicly, they could include assignments like crowd control or establishing perimeter security. Lawyers within the Defense Department are also still finalizing language around the use-of-force guidelines for the troops being mobilized, but the person familiar said it will likely mirror the military’s standing rules of the use of force. TheJournaladdsthat U.S. Northern Command said in a statement that the Marines will not engage with protesters: It is unclear how long the Marines will deploy, what kind of weapons they are authorized to carry or their specific orders. A statement by the U.S. Northern Command said that 2,100 National Guard soldiers and 700 Marines will protect federal personnel and property under the command of Task Force 51, the headquarters that has been assigned the mission. The forces have been trained in de-escalation, crowd control, and standing rules for the use of force, the command said. A presidential order issued Saturday by Trump directed the Pentagon to use the National Guard and “other members of the Regular Armed Forces as necessary” to protect federal “functions and property.” The last time Marines deployed to quell civil unrest was during the 1992 Los Angeles riots, which erupted after four police officers were acquitted in the beating of Rodney King. Late Monday afternoon, a reporter asked President Trump if he would deploy U.S. Marines to Los Angeles, andhis response was noncommittal: We’ll see what happens. I mean, I think we have it very well under control. I think it would have been a very bad situation. It was heading in the wrong direction, now it’s heading in the right direction. **Union leader David Huerta has been released on bail** The SEIU California president was detained and injured while attempting to record an ICE workplace raid in Los Angeles on Friday and held at the Metropolitan Detention Center in Downtown L.A. over the weekend. On Monday,he was charged with conspiracy to impede a federal officer, then released on a $50,000 bond under the condition that he not come with 100 yards of federal agents or operations. **No more Waymo near San Francisco protests, either** The Alphabet-owned robot-taxi companyannounced Mondaythat in light of Los Angeles protesters torching five of its $100,000 self-driving vehicles over the weekend, it was also suspending service in any areas of San Francisco where anti-ICE protests happen. **Trump is talking about insurrection** While speaking with reporters on Monday afternoon, the president called the L.A. protesters “insurrectionists.” A few hours later, he told reporters, “I wouldn’t call it quite an insurrection. But it could have led to insurrection.” **What Trump sees as rebellion** As I wrote today, comparing Trump’s National Guard deployment with how presidents once deployed it in the civil-rights era is instructive: From Team Trump’s point of view, states like California are in full revolt against its immigration plans. Newsom (or as Trump referred to him in aTruth Social postjustifying his call up, “Newscum”) is the Orval Faubus or George Wallace of the 21st century, fighting legitimate federal policies and all but forcing the president to send in the troops. Thespecific legal authority Trump citedfor his action was one that refers to a “rebellion or danger of a rebellion against the authority of the Government of the United States.” No one with a straight face could describe the scattered protests in L.A. as a full-on “rebellion.” The “rebels” Trump has in mind are more likely California’s state and local elected officials. Read the resthere. **Trump says Newsom should be arrested** A reporter asked Trump about the Newsom-Homan spat on Monday afternoon: \"I would do it if I were Tom. I think it's great\" -- Trump endorses the arrest of Gov. Gavin Newsom Earlier on Monday, Homan had walked back his threat to arrest Newsom, suggestingduring aFox & Friendsappearancethat his comments over the weekend were taken out of context and that there had been no discussions about arresting the governor. NBC Newsreportsthat two White House officials say, as of Monday afternoon, there were no serious plans to arrest Newsom or L.A. mayor Karen Bass. **Yeah, legal scholars are worried about Trump’s National Guard deployment** Politicoreports: Trump’s stated rationale, legal scholars say, appears to be a flimsy and even contrived basis for such a rare and dramatic step. The real purpose, they worry, may be to amass more power over blue states that have resisted Trump’s deportation agenda. And the effect, whether intentional or not, may be toinflame the tension in L.A., potentially leading to a vicious cycle in which Trump calls up even more troops or broadens their mission. “It does appear to be largely pretextual, or at least motivated more by politics than on-the-ground need,” said Chris Mirasolo, a national security law professor at the University of Houston … “The laws in this area are somewhat unsettled and untested,” said Rosa Brooks, a Georgetown University law professor who served as a counselor to the undersecretary of defense for policy under President Barack Obama. “Federalizing Guard troops in this situation — and raising the specter of also sending in active duty military personnel — is a political stunt, and a dangerous one.” Experts are also eyeing whether the Guard members accompany immigration authorities when they venture away from federal buildings — a move that could signal a willingness to use troops to actively aid immigration enforcement, rather than simply protect agents from protesters. Georgetown University Law Center professor Steve Vladeckargued over the weekendthat Trump’s order is limited but nonetheless worrisome: [N]othing that the President did Saturday night would, for instance, authorize these federalized National Guard troops to conduct their own immigration raids; make their own immigration arrests; or otherwise do anythingother than, to quote the President’s own memorandum, “those military protective activities that the Secretary of Defense determines are reasonably necessaryto ensure the protection and safety of Federal personnel and property.” On its face, then, the memorandum federalizes 2,000 California National Guard troops for the sole purpose of protecting the relevant DHS personnelagainstattacks. That’s a significant (and, in my view, unnecessary) escalation of events in a context in which no local or state authorities have requested such federal assistance. But by itself, this isnotthe mass deployment of troops into U.S. cities that had been rumored for some time. He also listed three reasons Trump’s order is concerning: First, there is the obvious concern that, even as they are doing nothing more than “protecting” ICE officers discharging federal functions, these federalized troopswillend up using force — in response to real or imagined violence or threats of violence against those officers. In other words, there’s the very real possibility that having federal troops on the ground will only raise the risk of escalating violence — not decrease it. Second, and related, there is the possibility that that’s a feature, and not a bug — that this is meant as a precursor, with federalizing a modest number of National Guard troops today invoked, some time later, as a justification for more aggressive responses to anti-ICE protests, including, perhaps invocation of the Insurrection Act. In other words, it’s possible that this step is meant to bothbeandlookmodest so that, if and when it “fails,” the government can invoke its failure as a basis for a more aggressive domestic deployment of troops. What happens in and around Los Angeles in the next few days will have a lot to say about this. Third, and perhaps most significantly, as I wrote in April, “domestic use of the military can nevertheless be corrosive — to the morale of the troops involved, all of a sudden, in policing their own; to the relationship between local/state governments and the federal government; and to the broader relationship between the military and civil society.” Even uses of the military for relatively modest purposes can have those corrosive effects — especially where, as here, it seems so transparently in service of the President’s policy agenda, and not necessarily the need to restore law and order on the streets of America’s second largest city. **California is suing the Trump administration** Governor Newsom and state attorney general Rob Bonta announced Monday they are filing a lawsuit to block Trump’s mobilization of the California National Guard, arguing that the “unprecedented” deployment violates the U.S. Constitution and is an intrusion on state authority.Per the WashingtonPost: The lawsuit argues that President Donald Trump overstepped his authority when he called up by the National Guard in defiance of [Newsom], invoking a law that allows the president to do so under threat from a foreign “invasion” or “rebellion” against the U.S. government. “Let me be clear: There is no invasion. There is no rebellion,” [Bonta] said in a statement. “The President is trying to manufacture chaos and crisis on the ground for his own political ends.” The lawsuit contends that Trump’s move illegally infringed upon Newsom’s role as commander in chief of the California National Guard. “Federalizing the California National Guard is an abuse of the President’s authority under the law, and not one we take lightly,” Bonta said. **What happened over the weekend** On Friday, a series of raids on local businesses by federal immigration authorities prompted a wave of protests across Los Angeles that have continued across the region in the following days. TheLos AngelesTimesreports that at least 44 people were “administratively arrested” by agents that day with one additional arrest for obstruction. Protesters then gathered at the sites of the raids as well as the downtown federal building and detention center housing some of those arrested, prompting standoffs between them and law enforcement. David Huerta, the president of SEIU California, wasarrested Fridaywhile observing one of the raids and remains in custody. Though the vast majority of the protests have been peaceful, clashes have sparked between protesters and authorities throughout the weekend, with reports of officers deploying tear gas and rubber bullets against demonstrators as well as instances of protesters throwing rocks and other objects at law enforcement. In addition, severalWaymo cars, the self-driving vehicles that are a frequent sight in L.A., were also set on fire as protesters took to the 101 freeway on Sunday. In response to the protests, President Trumpmobilized2,000 members of the National Guard to Los Angeles over the objections of California governor Gavin Newsom and Los Angeles mayor Karen Bass. To justify the deployment, Trump made a legal leap by citing a section of U.S. code that allows the president to federalize the National Guard in the event of foreign invasion or when “there is a rebellion or danger of a rebellion against the authority of the Government of the United States,” or when “the President is unable with the regular forces to execute the laws of the United States.” ﻿He also attempted to paint the local Democratic leadership as inadequate in the crisis. “If Governor Gavin Newscum, of California, and Mayor Karen Bass, of Los Angeles, can’t do their jobs, which everyone knows they can’t, then the Federal Government will step in and solve the problem, RIOTS & LOOTERS, the way it should be solved!!!,” he wrote Saturday night onTruth Social. Also on Saturday, Trump “border czar” Tom Homanthreatened to arrestanyone, including Bass and Newsom, if they obstruct ICE operations. “You cross that line, it’s a felony to knowingly harbor and conceal an illegal alien. It’s a felony to impede law enforcement doing their job,” Homan said. Speaking with reporters on Sunday, Trump vowed “justice” for any “officials who stand in the way of law and order.” During a Sunday nightMSNBC interview, Newsom effectively dared Homan to go through with it. “He’s a tough guy. Why doesn’t he do that?” the governor said. “He knows where to find me. That kind of bloviating is exhausting. So, Tom, arrest me. Let’s go.” This post has been updated. **Sign Up for the Intelligencer Newsletter** By submitting your email, you agree to ourTermsandPrivacy Noticeand to receive email correspondence from us. **More politics** Ramaswamy’s Comparison of Newsom to George Wallace Is Ludicrous Trump Wants to Make U.S. Armed Forces His Partisan Militia After All That, Donald Trump and Elon Musk Are Friends Again? **Tags:** remove interruptions liveblog california ice protests ice gavin newsom los angeles donald trump tom homan politics we'll do it live More Things you buy through our links may earnVox Mediaa commission. **Most Popular** I Became Fixated on My Oura Ring Even Though It Did Nothing to Help MeByTom Scocca Donald Trump Has a Bad Case of Hurt FeelingsByBenjamin Hart Meghan Markle Thinks Americans Loved Her Pregnancy Dance VideoByMargaret Hartmann It’s Looking More and More Like a Two-Person Race for MayorByNia Prater ICE Expands Raids in California, Backed by U.S. Troops: Live UpdatesByIntelligencer Staff I Became Fixated on My Oura Ring Even Though It Did Nothing to Help MeByTom Scocca Donald Trump Has a Bad Case of Hurt FeelingsByBenjamin Hart ICE Expands Raids in California, Backed by U.S. Troops: Live UpdatesByIntelligencer Staff It’s Looking More and More Like a Two-Person Race for MayorByNia Prater Meghan Markle Thinks Americans Loved Her Pregnancy Dance VideoByMargaret Hartmann **** **** **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **What is your email?** This email will be used to sign into allNew Yorksites. By submitting your email, you agree to ourTermsandPrivacy Policyand to receive email correspondence from us. **Sign In To Continue Reading** **Create Your Free Account** Password must be at least 8 characters and contain: Lower case letters (a-z) Upper case letters (A-Z) Numbers (0-9) Special Characters (!@#$%^&*) **You’re in!** As part of your account, you’ll receive occasional updates and offers fromNew York, which you can opt out of anytime. **** **** **** * please try a longer search **** Have an Account? About Intelligencer About New York Magazine Newsletters Help Contact Press Media Kit We’re Hiring Privacy Terms Ad Choices Accessibility Do not sell or share my personal data"}