{"id": 50, "name": "Successful Farming Magazine", "domain": "agriculture.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.agriculture.com/yamaha-motor-launches-yamaha-agriculture-investing-in-automation-for-specialty-crop-growers-11738280", "title": "Yamaha Motor Launches Yamaha Agriculture Investing In Automation For Specialty Crop Growers 11738280", "content": "SearchPlease fill out this field. MagazineSubscribeManage Your SubscriptionGet Help Subscribe Manage Your Subscription Get Help Subscribe Manage Your Subscription Get Help Newsletters Subscribe NewsNewsBusiness NewsCrop NewsLivestock NewsMachinery NewsProfilesTechnology NewsWeather NewsView All Business News Crop News Livestock News Machinery News Profiles Technology News Weather News View All Business News Crop News Livestock News Machinery News Profiles Technology News Weather News View All MarketsMarketsCommodity PricesNewswireMarket AnalysisView All Commodity Prices Newswire Market Analysis View All Commodity Prices Newswire Market Analysis View All MachineryMachineryAll Around the FarmHarvestingPlantingRepair and MaintenanceTechnologyToolsTop ShopsTractorsUsed Farm EquipmentView All All Around the Farm Harvesting Planting Repair and Maintenance Technology Tools Top Shops Tractors Used Farm Equipment View All All Around the Farm Harvesting Planting Repair and Maintenance Technology Tools Top Shops Tractors Used Farm Equipment View All CropsCropsCarbon MarketsConservationCornCover CropsCrop ProtectionFertilizersHempSoil HealthSoybeansWheatView All Carbon Markets Conservation Corn Cover Crops Crop Protection Fertilizers Hemp Soil Health Soybeans Wheat View All Carbon Markets Conservation Corn Cover Crops Crop Protection Fertilizers Hemp Soil Health Soybeans Wheat View All Farm ManagementFarm ManagementBeginning FarmersCrop InsuranceEstate PlanningFarmlandFinancesPrograms and PoliciesView All Beginning Farmers Crop Insurance Estate Planning Farmland Finances Programs and Policies View All Beginning Farmers Crop Insurance Estate Planning Farmland Finances Programs and Policies View All LivestockLivestockCattleDairyHogsPoultryView All Cattle Dairy Hogs Poultry View All Cattle Dairy Hogs Poultry View All FamilyFamilyEducationFarm HumorHealth and SafetyMental HealthRecipesRural LifestyleWomen in AgView All Education Farm Humor Health and Safety Mental Health Recipes Rural Lifestyle Women in Ag View All Education Farm Humor Health and Safety Mental Health Recipes Rural Lifestyle Women in Ag View All About Us Subscribe MagazineMagazineSubscribeManage Your SubscriptionGet Help Subscribe Manage Your Subscription Get Help Subscribe Manage Your Subscription Get Help Newsletters NewsBusiness NewsCrop NewsLivestock NewsMachinery NewsProfilesTechnology NewsWeather News Business News Crop News Livestock News Machinery News Profiles Technology News Weather News Business News Crop News Livestock News Machinery News Profiles Technology News Weather News MarketsCommodity PricesNewswireMarket Analysis Commodity Prices Newswire Market Analysis Commodity Prices Newswire Market Analysis MachineryAll Around the FarmHarvestingPlantingRepair and MaintenanceTechnologyToolsTop ShopsTractorsUsed Farm EquipmentView All All Around the Farm Harvesting Planting Repair and Maintenance Technology Tools Top Shops Tractors Used Farm Equipment View All All Around the Farm Harvesting Planting Repair and Maintenance Technology Tools Top Shops Tractors Used Farm Equipment View All CropsCarbon MarketsConservationCornCover CropsCrop ProtectionFertilizersHempSoil HealthSoybeansWheat Carbon Markets Conservation Corn Cover Crops Crop Protection Fertilizers Hemp Soil Health Soybeans Wheat Carbon Markets Conservation Corn Cover Crops Crop Protection Fertilizers Hemp Soil Health Soybeans Wheat Farm ManagementBeginning FarmersCrop InsuranceEstate PlanningFarmlandFinancesPrograms and Policies Beginning Farmers Crop Insurance Estate Planning Farmland Finances Programs and Policies Beginning Farmers Crop Insurance Estate Planning Farmland Finances Programs and Policies LivestockCattleDairyHogsPoultry Cattle Dairy Hogs Poultry Cattle Dairy Hogs Poultry FamilyEducationFarm HumorHealth and SafetyMental HealthRecipesRural LifestyleWomen in Ag Education Farm Humor Health and Safety Mental Health Recipes Rural Lifestyle Women in Ag Education Farm Humor Health and Safety Mental Health Recipes Rural Lifestyle Women in Ag News Machinery News **Yamaha Motor Launches Yamaha Agriculture, Investing in Automation for Specialty Crop Growers** Western Growers Association Welcomes New Company Specialty Growers Share Excitement for Yamaha Agriculture Automation Tools Bring Many Wins for Specialty Crops Yamaha Agriculture’s Involvement Can Get Tools to Growers Data-Driven Approach to Solve Labor Shortage Concerns Yamaha In late February, Yamaha Motor announced the launch ofYamaha Agriculture, a new company that focuses on delivering autonomous equipment and AI-powered digital solutions to help specialty crop growers become more sustainable, profitable, and resilient. As part of Yamaha Agriculture’s launch, the company acquired Robotics Plus and The Yield.Robotics Plusis a New Zealand-based agritech company that specializes in the design and build of robotics, AI, and autonomous machines that reduce reliance on labor and provide data-driven insights for growers. The Yield is a precision yield management company focused on specialty crops that claims to transform precision agriculture practices and outcomes through scalable, AI-based technologies. “We believe meaningful innovation in agriculture emerges through close collaboration with growers and industry partners,”Nolan Paul, CEO of Yamaha Agriculture said. “The capabilities of Robotics Plus in robotics and automation and The Yield in AI-powered analytics represent two important building blocks in addressing these challenges.” **Western Growers Association Welcomes New Company** Walt Duflock, senior vice president of innovation at the Western Growers Association (WGA), said his team “will be working with the Yamaha Agriculture team to try and get the products from Robotics Plus and The Yield vetted and in trials and case studies with our members.” Increasing labor costs are one of the reasons that WGA is so focused on automation, Duflock said WGA and Cal Poly Professor Lynn Hamilton worked together on research regarding the labor inputs for selected specialty crops. “California farmers spent $16.3 billion on 850 million hours of farm labor in 2023,” Duflock said. “Roughly two-thirds of those hours are on harvesting crops; the other one-third are for non-harvest activities (weeding, thinning, planting, spraying).” As a result, Duflock said, “it’s good for the space that Yamaha is taking startup investments and launching a platform to help them get traction in the U.S. and other specialty crop markets.” Yamaha’s involvement in improving automations in the specialty crop industry “helps increase the chances that Robotics Plus, The Yield, and any other acquisitions have a better shot at having adequate capital to get to scale,” Duflock said. **Specialty Growers Share Excitement for Yamaha Agriculture** Jeff Cleveringa, the head of orchard operations at Columbia Fruit Packers in Wenatchee, Washington, said automation is a relatively new aspect of the specialty crop industry. “The industrial revolution left us behind,” Cleveringa said. “We got the tractor and that was it.” Now, though, Cleveringa said it’s an exciting time to explore automations in the specialty crop industry. He said Yamaha’s involvement in automation is “the missing link in specialty crops.” This is because an industry partner like Yamaha Agriculture brings the ability to scale automation tools for the industry as a whole, Cleveringa said. **Automation Tools Bring Many Wins for Specialty Crops** On the farms that Columbia Fruit Packers manages, Cleveringa said they invested in Robotics Plus’ Prospr machines in 2024. Prospr is an autonomous, multi-purpose hybrid vehicle designed to perform a range of orchard and vineyard tasks. It was built to tackle labor shortages and is capable of multiple activities including spraying and weed control, with additional attachments such as mowing in development. Cleveringa said Columbia Fruit Packers decided to invest in Prospr because “it’s a modular system so we can add other attachments.” The Prospr machines have helped the team at Columbia Fruit Packers with spraying their orchards with “a lot of cost savings in diesel fuel burn,” Cleveringa said. The investment into Prospr has been a win-win for his operation, Cleveringa said, not only from a cost-savings standpoint, but also regarding environmental and worker safety concerns. **Yamaha Agriculture’s Involvement Can Get Tools to Growers** Overall, Cleveringa said he’s excited that Yamaha Agriculture can bring the tools Robotics Plus needs to get Prospr into the hands of the growers. “We hope that this is just the first step for Yamaha Agriculture,” Cleveringa said, “and that they will continue with other companies. We hope this is the first step to work together to identify pain points and opportunities [for the industry].” Yamaha **Data-Driven Approach to Solve Labor Shortage Concerns** Matt Miles, the process improvement manager at Allen Brothers Fruit in Naches, Washington, said “Yamaha is going to be a great partner. I’m excited about collaborating with them.” One of the reasons that Miles said he’s so excited about the financial backing Yamaha Agriculture brings to companies like The Yield, a company his team at Allen Brothers Fruit has been working closely with to develop data-driven automations, is because there’s a massive labor shortage impacting specialty crop growers. “People used to want to do this work,” Miles said. “There’s a big disconnect between the folks that want to do the work and the work that needs to be done. We’ve been reliant on a low-cost and available work force.” Automations will not only ease labor dynamics, Miles said, but they’ll allow companies like Allen Brothers Fruit to make the jobs of the people in the fields and packhouses easier “so we can maintain or increase productivity.” **Related Articles** **Follow Us** News Markets Machinery Crops Farm Management Livestock Family About Us Subscribe Editorial Process Advertise Privacy Policy Careers Terms of Service Contact Us Your Privacy Choices"}