{"id": 1238, "name": "San Gabriel Valley Tribune", "domain": "sgvtribune.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sgvtribune.com/2025/06/03/baldwin-park-man-accused-of-killing-police-officer-is-charged-with-1st-degree-murder-special-circumstances/", "title": "Baldwin Park Man Accused Of Killing Police Officer Is Charged With 1st Degree Murder Special Circumstances", "content": "e-Edition e-Edition NewsNewsCrime and Public SafetyInvestigative ReportingElectionPoliticsHealthEnvironmentBusinessBest ReviewsHousingJobsWeather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Housing Jobs Weather News Crime and Public Safety Investigative Reporting Election Politics Health Environment Business Best Reviews Housing Jobs Weather Local NewsLocal NewsCovinaWest CovinaBaldwin ParkEl MonteSouth El MonteSan GabrielGlendoraAzusaMonroviaCity of IndustryIrwindaleArcadiaDiamond BarWalnutAlhambraPasadenaLa PuenteMontebelloLos Angeles County Local News Covina West Covina Baldwin Park El Monte South El Monte San Gabriel Glendora Azusa Monrovia City of Industry Irwindale Arcadia Diamond Bar Walnut Alhambra Pasadena La Puente Montebello Los Angeles County Local News Covina West Covina Baldwin Park El Monte South El Monte San Gabriel Glendora Azusa Monrovia City of Industry Irwindale Arcadia Diamond Bar Walnut Alhambra Pasadena La Puente Montebello Los Angeles County SportsSportsHigh School SportsChargersRamsLakersClippersDodgersAngelsCollege SportsUCLA SportsUSC SportsKingsDucksOlympicsBoxing/MMASoccerHorse Racing Sports High School Sports Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Sports High School Sports Chargers Rams Lakers Clippers Dodgers Angels College Sports UCLA Sports USC Sports Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Things To DoThings To DoRestaurants Food and DrinkAmusement ParksMoviesMusic + ConcertsTheaterTV and StreamingHome + GardenTravelComicsEvents Things To Do Restaurants Food and Drink Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events Things To Do Restaurants Food and Drink Amusement Parks Movies Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnsCommentaryLetters to the EditorEditorial BoardEndorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements SCNG Premium Sponsored Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint The T.E.A. Subscribe Tribune Store Log In Logout Get the latest news delivered daily! **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Log In Get the latest news delivered daily! Subscribe Log In e-Edition e-Edition Crime Investigative Reporting Election Politics Environment Business Housing Jobs Weather Trending: ICE protests 🎓 2025 Graduations Man charged in officer's death Crime news Free and cheap things to do **Baldwin Park man accused of killing police officer is charged with 1st degree murder, could face death penalty** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print A 22-year-old man accused ofgunning down a Baldwin Park police officer and a civilianbefore he was shot was charged Tuesday, June 3, with first-degree murder with special circumstances in the deaths of the officer, Samuel Riveros, and a civilian, Darius Wong of Walnut. The special circumstances charges could open up the accused shooter, Eduardo Roberto Medina-Berumen, to a possible death sentence if convicted. The charges were announced by Los Angeles County District Attorney Nathan Hochman at a news conference attended by Baldwin Park police and Los Angeles County Sheriff’s officials. Among those present was Baldwin Park police officer Anthony Pimentel, who had been shot late Saturday night and released from the hospital on Sunday. Medina-Berumen is also charged with the attempted murders of Pimentel and Baldwin Park police officer Alfredo Leal, who was not shot. The defendant, who was hospitalized after he was shot by at least one other officer, was arrested the night of the shooting, and was being held on a $4 million bail. He remained in the hospital on Tuesday. Hochman and Los Angeles County Sheriff Robert Luna said an assault rife, two high-capacity magazines and 40-60 expended casings were recovered at the crime scene. The DA’s office will decide later whether to seek capital punishment, Hochman said. In the days since the shooting, Hochman said, he met with the families of Riveros and Wong. Wong, 43, was a husband and a father of two young girls, Luna said. Investigators said they don’t yet know a motive for the shooting or the exact circumstances that led to it. “He was a kind soul with so much more life ahead of him,” his brother Victor Vuong, of Anaheim, wrote onGoFundMe. Wong’s family asked to extend their thanks to Riveros’ family for his stepping in as the shooting continued, Hochman said. “We don’t need to talk about superheroes and comic book heroes,” the DA said, “because we have heroes in this exact situation.” Police were initially called just after 7:10 p.m. about a man shooting a rifle in the 4200 block of Filhurst Avenue on Saturday night, said Lt. Michael Modica with the Los Angeles County Sheriff’s Department. Wong was on his way to a party, Modica said. Medina-Berumen lived on the street with his mother, Modica said. At the front of the home was a sign that read “Never mind the dog. Beware of owner!” along with an image of a hand holding a gun. WhenRiveros and Pimentelarrived, Medina-Berumen immediately fired at them, Sheriff Robert Luna said. Riveros and Pimentel weren’t able to fire back, Modica said, but he didn’t specify how many other officers shot back at Medina-Berumen. After the shooting, Riveros, Pimentel and Medina-Berumen were taken to a hospital. Riveros, 35, of Pasadena, died of a gunshot wound to the head. Riveros worked for the Baldwin Park Police Department for nine years. He was on the SWAT team and became a field training officer last July. He loved snowboarding, and was an avid Dodgers fan who traveled to stadiums around the country to watch the team play, police officials said. He graduated from UC Irvine, Baldwin Park police Chief Robert Lopez said. “He was a part of our family,” Lopez said, “and it’s hard to express what a tremendous loss this is for our department and Baldwin Park.” Medina-Berumen is expected to be arraigned sometime this week, officials said. Staff writer Ruby Gonzales contributed to this report. **Related Articles** LA County sheriff’s deputy wounded, robbery suspect killed in Lancaster shootout Baldwin Park shootings leave police officer and another victim dead, 2nd officer wounded CHP officer shoots woman with knife walking on 71 freeway in Chino Hills ‘Please don’t shoot me,’ Fountain Valley officer pleads after suspect wrestles away her gun San Gabriel police thought driver pointed weapon at them before fatal shooting, according to video **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Newsroom Guidelines News Tips Contact Us Report an Error **RevContent Feed** **Most Popular** San Dimas woman accused of killing wife with sword had served victim with divorce papersSan Dimas woman accused of killing wife with sword had served victim with divorce papers **San Dimas woman accused of killing wife with sword had served victim with divorce papers** **San Dimas woman accused of killing wife with sword had served victim with divorce papers** Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho CucamongaFrito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** Death row inmate from Riverside County killed in prison attack; mob attacks suspectDeath row inmate from Riverside County killed in prison attack; mob attacks suspect **Death row inmate from Riverside County killed in prison attack; mob attacks suspect** **Death row inmate from Riverside County killed in prison attack; mob attacks suspect** California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearingCalifornia judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalismLA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism **LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism** **LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism** Remembering how Rick Dees turned KIIS-FM into a radio powerhouseRemembering how Rick Dees turned KIIS-FM into a radio powerhouse **Remembering how Rick Dees turned KIIS-FM into a radio powerhouse** **Remembering how Rick Dees turned KIIS-FM into a radio powerhouse** FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protestFBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** An empty chair at Azusa High School’s upcoming graduation, for ‘everyone’s Angel’An empty chair at Azusa High School’s upcoming graduation, for ‘everyone’s Angel’ **An empty chair at Azusa High School’s upcoming graduation, for ‘everyone’s Angel’** **An empty chair at Azusa High School’s upcoming graduation, for ‘everyone’s Angel’** Anti-ICE protesters take their outrage to crowded Whittier City Council meetingAnti-ICE protesters take their outrage to crowded Whittier City Council meeting **Anti-ICE protesters take their outrage to crowded Whittier City Council meeting** **Anti-ICE protesters take their outrage to crowded Whittier City Council meeting** Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assistProtesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist **Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist** **Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist** **More in Crime and Public Safety** San Dimas woman accused of killing wife with sword had served victim with divorce papers **San Dimas woman accused of killing wife with sword had served victim with divorce papers** **San Dimas woman accused of killing wife with sword had served victim with divorce papers** LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach **LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach** **LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach** National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** 2025 June 3 SubscribeSign Up For Newsletterse-EditionBreaking News Sign Up For Newsletters e-Edition Breaking News Sign Up For Newsletters e-Edition Breaking News Contact UsCorrectionsWork With UsNewspapers in EducationTribune Store Corrections Work With Us Newspapers in Education Tribune Store Corrections Work With Us Newspapers in Education Tribune Store About SGV TribuneAbout Southern California News GroupMediaNews GroupPartnersLive Traffic MapPrivacy PolicyAccessibilityNews ArchiveReader’s Choice About Southern California News Group MediaNews Group Partners Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice About Southern California News Group MediaNews Group Partners Live Traffic Map Privacy Policy Accessibility News Archive Reader’s Choice MarketplaceClassifiedLocal Job BoardObituaryLegals Classified Local Job Board Obituary Legals Classified Local Job Board Obituary Legals Advertising SolutionsGet in Touch with a Marketing StrategistRequest Media KitCreative Services Get in Touch with a Marketing Strategist Request Media Kit Creative Services Get in Touch with a Marketing Strategist Request Media Kit Creative Services Reader RewardsPhoto ReprintsSponsored AccessSponsor a Student Photo Reprints Sponsored Access Sponsor a Student Photo Reprints Sponsored Access Sponsor a Student Content Marketing Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}