{"id": 1865, "name": "Aish.com", "domain": "aish.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://aish.com/i-was-fired-from-the-columbia-universitys-newspaper-for-being-an-orthodox-jew/", "title": "I Was Fired From The Columbia Universitys Newspaper For Being An Orthodox Jew", "content": "**I Was Fired from the Columbia University’s Newspaper for Being an Orthodox Jew** **TRENDING** Issues Issues 6min read Issues Issues 4min read Issues Issues 10min read Arts Arts 7min read 5min read After graduating from Columbia this spring, Eliana is now coming forward with her story. For two years, Eliana Goldin wrote for Columbia University’s student newspaper, the Columbia Daily Spectator. She rose through the ranks to become a senior staff writer for the university news section and had close relationships with everyone on the team. Right before October 7th, she happened to take a break from writing. When it occurred, she started advocating for Israel, which took up her time. In February of 2024, she was finally ready to get back into writing and was hired for the Spec as a columnist to discuss the common ground between Israelis and Palestinians. After her first column came out, the trouble began, asEliana posted on her X accountthis past May 20. “People dug up my old social media posts to find something they could use to bully me, and they found a poll I had asked my Instagram followers months before October 7th,” she wrote. “The poll said, ‘Would you k*ll someone from Amalek?’ Immediately, tons of Columbia students posted on their social media platforms that I had called for the death of Palestinians because of that poll. SJP posted it on their Instagram, and it received 18,000 likes and had a ton of scary death threats asking about my identity.” Just a few days later, the head of the opinion section called Eliana and fired her. “In the time when I needed support the most, the Columbia Daily Spectator — people I had once been friends with — left me to fend for myself,” she wrote. “And the thing is, Amalek has nothing to do with Palestinians. I explained that the question of Amalek is akin to the Binding of Isaac — a Jewish thought experiment on whether you would go against your own personal morality to follow God’s morality — but they didn’t care.” She kept trying to explain that she was in no way comparing Palestinians toAmalek, the biblical nation that was a hereditary arch-enemy of the Israelites. No one would listen. “Judaism was whatever they wanted it to be,” she wrote. “Just as it is Islamophobic to define Islam based off of extremists who take the religion out of pocket and use it for their own racist aims, so too is it antisemitic to do the very same thing with Judaism. But that’s what Spec did. They defined my Judaism based on extremists.” And then, the editors turned the heat up even more, publishing an op-ed saying a Columbia student was calling for the deaths of Palestinians. They linked it to her Instagram poll. She got mean looks on campus, and a peer DMed her, calling her vile and disgusting. I went out of my way to engage in dialogue with people who disagreed with me. And yet when it came down to it, all people saw was what they wanted to see. “As a Jewish leader on campus, I spent my entire tenure trying to make more room for alternative viewpoints within the Zionist community,” she wrote. “I went out of my way to engage in dialogue with people who disagreed with me, even when it was uncomfortable. And yet when it came down to it, all people saw was what they wanted to see: that Orthodox Jews are racist to their very core because of their religious beliefs, and that Zionists have no room for Palestinians in their narrative. Antisemites see what they want to see.” **Coming Forward with the Truth** Eliana waited until May 20 of this year, after she graduated, to go public with her story on X. She told Aish she’s not sure where she will go from here, as it’s been a difficult time. “It’s taken this huge mental and emotional toll on me,” she said. “As soon as you speak out against antisemitism, there is always this huge backlash that occurs. It’s hard to roll with that. It takes a lot just to begin fighting.” So far, no one from Columbia has contacted her about the incident. Her post went live the same week that the Trump Administration claimed thatColumbia violated Jewish students’ rightsand is now in violation of the standards set by Middle States Commission on Higher Education, which is Columbia's accreditor. “Maybe [Columbia is] worried about a lawsuit and that’s why they haven’t reached out, but it’s really sad that that hasn’t happened,” Eliana said. Additionally, her former colleagues haven’t been in touch either. “No one on the newspaper staff has reached out to apologize, which makes me think they are not capable of making requisite changes that are needed to make in order to combat the antisemitism in their staff and that’s systemically embedded into the newspaper. That makes me think a lawsuit might be the only option.” **Should Jewish Students Stay at These Universities?** Though Eliana had negative experiences at Columbia, including at the newspaper, she also had positive ones: for the first time in her life, the practicing Jew and day school graduate went outside of her bubble and felt even more secure in her identity. “Being in an environment where not everyone his like you is how you really clarify your beliefs and values and practice,” she said. “It’s been really enriching to be an Orthodox Jew at Columbia.” Eliana believes that Jewish students should still go to secular universities if they want to. After all, universities hold tremendous power in society and if we don’t have a stake, we could be left out entirely. “Separate but equal is not equal,” she said. “If we retreat and lose our position in Ivy League universities, I imagine it’ll be incredibly difficult to regain. Jews used to not be allowed into many Jewish universities and then there were Jewish activists who fought to allow them to be able to attend. We can’t back down now.” More About The Author Kylie Ora Lobell Kylie Ora Lobell is a Los Angeles-based writer as well as president ofKOL Digital Marketing, where she does publicity and marketing and helps clients share their unique stories with the world. **RECOMMENDED NEXT READ** Funny that they automatically equate the Palestinians with Amalek. Now why would that be so? And would they have the same reaction if the subject was killing Hitler or Stalin and not Amalek? \"Would you k*ll someonefromAmalek?\" Ask today: \"would you kill someonefromGermany?\" As I understand Eliana's question: \"Would you carry out a genocide if you believed you were commanded to by God?\" Whatever Eliana's intention was, this is not a question to put out into a public forum without adequate context. Because you were fired based on what you claim is discrimination for being Jewish, did you file an Equal Employment Opportunities claim (EEOC) against the university? I am not sure of the statute of limitations in filing but it might be worth looking into. I think you have learned a valuable lesson regarding social media...it is poisonous and ruining our youth. I wish you well and hope that this does not follow you throughout your life or career. \"a Jewish thought experiment on whether you would go against your own personal morality to follow God’s morality\" Eliana, you were fired for being incredibly insensitive and naive. Your excuse does not make it any better. People of different faiths justify their actions as \"following God's morality\". Many people, including many Palestinians, commit immoral acts in God's name. I hope that the outcome of your poll was a resounding \"no, I would treat all people justly and not blindly follow authoritarian commandments\". After all, it isn't the question you asked that's problematic, but the way it was answered. Right? We're taught that G-d is the ultimate morality in the world. In Ethics of the Fathers is says (2:4): \"Make His will like your will so that He will make His will like your will. Nullify your will before His will so that He will nullify His will before you will\". We have the case of Saul who didn't completely wipe out Amalek as he was commanded and therefore lost the crown. Abraham is praised for being willing to sacrifice Isaac even though it went against his own morality/feelings and even though G-d didn't want him to literally do it (Abraham didn't know that). I also take exception to the phrase \"blindly follow authoritarian commandments\". Why is it always a binary between unthinking obedience or rebellion, which is somehow inherently rational/moral? Some people can choose to obey after thinking it over. Some people also inherently choose to disregard someone's authority due to personal reasons, even if what they're asking you to do is reasonable/correct. In a way, you are hitting the nail on the head, but it is Eliana who is framing Torah-observance as a binary. I take exception to calling push-back against this binary view \"antisemitism\". Most people recognize that the prohibition on homicide has exceptions, and most Jews agree that there are circumstances when the Sabbath may need to be broken. So it is with all of the commandments in the Torah. What does \"Torah-observant\" even mean if we are all expected to think it over? If Saul thought it over and decided not to completely wipe out Amalek, isn't that what was expected of him? Even though we may make the wrong decision, we are expected to use our own judgement. This is not \"rebellion\". Eliana’s story, sadly, is no surprise. An Ivy League education isn’t what it used to be; quite frankly, I doubt any school has maintained its standards or value.If every Jewish student & supporter of Israel left Ivy schools, and alums stopped donations, maybe the schools would get the message; maybe. (I don’t actually expect any of that to happen.)Mazal tov to Eliana on her graduation. She managed to survive the meat grinder that is the Ivy League - that will only make her stronger as a proud Jewish woman and in whatever her chosen field is. Qatar is apparently outdoing Jews in the monetary donations department. Too bad that’s all they have to offer. Please send this story to the New York Times or NPR. Mainstream needs to cover it. No way either touch this great story. NYT? They are as anti-Semitic as they come. They’re complicit and not mainstream. Brava to Eilana for her words, bravery and faith. Needs a slight correction\"Jews used to not be allowed into many **Jewish** universities and then there were Jewish activists who fought to allow them to be able to attend. We can’t back down now.” Most universities are more focused on foreign students because those students are charged full tuition. It is no surprise. According to 2023 data published by Columbia, out of 36,649 students, 20,347 were foreigners. That's 55%. (https://cis.org/Feere/Schools-Highest-Foreign-Student-Populations) It's no surprise that American students with inconvenient viewpoints are marginalized and shunned like this. Whether or not to attend schools like Columbia that have shown a clear bias against Jews is a personal choice, but it is a choice that should be made with the full knowledge that attending is providing cover to antisemitism. The paper is independently owned and operated and is not affiliated with Columbia University. An important point. I have fought for so many but none for me Oct.7th. I will be there for my fellow Jews from now on and the rest can go jump in a lake. I personally know Christian pastors that are fighting for the Jews and are pro Zionist. You are a Force.Am Israel Hai.Force! DON'T ever back down.We need you,and many more like you. Current Current History History Jewlish Jewlish Judaism 101 Judaism 101 Human Interest Human Interest Holidays Holidays Torah Portion Judaism 101 Courses Ways to Wisdom Holocaust Studies Prayer & Kabbalah Shabbat Ask the Rabbi Donate Wallcam Legacy Giving Shabbat Times Kaddish Calendar Aish World Center Israel Programs About Aish Current Current History History Jewlish Jewlish Judaism 101 Judaism 101 Human Interest Human Interest Holidays Holidays Torah Portion Judaism 101 Courses Ways to Wisdom Holocaust Studies Prayer & Kabbalah Shabbat Ask the Rabbi Donate Wallcam Legacy Giving Shabbat Times Kaddish Calendar Aish World Center Israel Programs About Aish Current History Food Human Interest Holidays Judaism 101 Weekly Torah Portion Courses Ways to Wisdom Holocaust Studies Prayer and Kabbalah Shabbat Ask the Rabbi Western Wall Camera Jewish Name & Birthday Kaddish Candle Lighting Times Calendar Mobile App Archives One-on-One Learning Israel Programs Submit Articles Contact Us Contact Aish About Aish Privacy Policy Advertise Donate Legacy Giving Spanish Hebrew"}