{"id": 1574, "name": "WFSU - NPR - Tallahassee", "domain": "wfsu.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wfsu.org/support/donate-your-vehicle-how-it-works", "title": "Donate Your Vehicle How It Works", "content": "NewsLatest NewsLocal NewsState NewsLatest NewsGovernmentEducationEnvironmentCriminal JusticeBusiness & DevelopmentHealth & SciencePoliticsPeople & CommunityArts & CultureLocal WeatherLatest Local NewscastWatchWFSUPassportWhat to WatchWhere to WatchLocal RoutesMore in TV Latest News Local News State News Latest News Government Education Environment Criminal Justice Business & Development Health & Science Politics People & Community Arts & Culture Local Weather Latest Local Newscast WFSUPassport What to Watch Where to Watch Local Routes More in TV Latest News Local News State News Latest News Government Education Environment Criminal Justice Business & Development Health & Science Politics People & Community Arts & Culture Local Weather Latest Local Newscast WFSUPassport What to Watch Where to Watch Local Routes More in TV WatchWhat to WatchWhere to WatchWFSU-TV (Live)WFSU KIDS 360 (Live)Local Streams (Live)FSU College of Music (Live)WFSUPassport Info & Access (VOD)WFSU VideoAll TV StreamsLocal RoutesWFSU Ecology BlogThe Florida ChannelTelevision SchedulesTelevision Program GuideMore in TV What to Watch Where to Watch WFSU-TV (Live) WFSU KIDS 360 (Live) Local Streams (Live) FSU College of Music (Live) WFSUPassport Info & Access (VOD) WFSU Video All TV Streams Local Routes WFSU Ecology Blog The Florida Channel Television Schedules Television Program Guide More in TV What to Watch Where to Watch WFSU-TV (Live) WFSU KIDS 360 (Live) Local Streams (Live) FSU College of Music (Live) WFSUPassport Info & Access (VOD) WFSU Video All TV Streams Local Routes WFSU Ecology Blog The Florida Channel Television Schedules Television Program Guide More in TV ListenListen LiveLocal Radio ProgramsVoices that InspireMinutes and MomentsRadio SchedulesLatest Local NewscastEducation HomeParentsEducatorsSummer or Anytime Listen Live Local Radio Programs Voices that Inspire Minutes and Moments Radio Schedules Latest Local Newscast Parents Educators Summer or Anytime Listen Live Local Radio Programs Voices that Inspire Minutes and Moments Radio Schedules Latest Local Newscast Parents Educators Summer or Anytime EducationEducation HomeKids: Watch Now!Resources for ParentsSummer or AnytimeEducation WorkshopsEdScoop Blog Education Home Kids: Watch Now! Resources for Parents Summer or Anytime Education Workshops EdScoop Blog Education Home Kids: Watch Now! Resources for Parents Summer or Anytime Education Workshops EdScoop Blog WFSU Ecology BlogSupportBecome a MemberBecome a SponsorReal Estate DonationDonate Your VehiclePhilanthropyWFSU Travel ClubVolunteerMember LoginMore in Support Become a Member Become a Sponsor Real Estate Donation Donate Your Vehicle Philanthropy WFSU Travel Club Volunteer Member Login More in Support Become a Member Become a Sponsor Real Estate Donation Donate Your Vehicle Philanthropy WFSU Travel Club Volunteer Member Login More in Support AboutMissionWFSU PressLocal Content & Service ReportStaff ListContact UsCareersCommunity CalendarMore in About Mission WFSU Press Local Content & Service Report Staff List Contact Us Careers Community Calendar More in About Mission WFSU Press Local Content & Service Report Staff List Contact Us Careers Community Calendar More in About Television SchedulesRadio SchedulesLocal WeatherCommunity CalendarTV ServicesWFSU Ecology BlogAboutLocal Content & Service ReportWFSU Press NewsLatest NewsLocal NewsState NewsLatest NewsGovernmentEducationEnvironmentCriminal JusticeBusiness & DevelopmentHealth & SciencePoliticsPeople & CommunityArts & CultureLocal WeatherLatest Local NewscastWatchWFSUPassportWhat to WatchWhere to WatchLocal RoutesMore in TV Latest News Local News State News Latest News Government Education Environment Criminal Justice Business & Development Health & Science Politics People & Community Arts & Culture Local Weather Latest Local Newscast WFSUPassport What to Watch Where to Watch Local Routes More in TV Latest News Local News State News Latest News Government Education Environment Criminal Justice Business & Development Health & Science Politics People & Community Arts & Culture Local Weather Latest Local Newscast WFSUPassport What to Watch Where to Watch Local Routes More in TV WatchWhat to WatchWhere to WatchWFSU-TV (Live)WFSU KIDS 360 (Live)Local Streams (Live)FSU College of Music (Live)WFSUPassport Info & Access (VOD)WFSU VideoAll TV StreamsLocal RoutesWFSU Ecology BlogThe Florida ChannelTelevision SchedulesTelevision Program GuideMore in TV What to Watch Where to Watch WFSU-TV (Live) WFSU KIDS 360 (Live) Local Streams (Live) FSU College of Music (Live) WFSUPassport Info & Access (VOD) WFSU Video All TV Streams Local Routes WFSU Ecology Blog The Florida Channel Television Schedules Television Program Guide More in TV What to Watch Where to Watch WFSU-TV (Live) WFSU KIDS 360 (Live) Local Streams (Live) FSU College of Music (Live) WFSUPassport Info & Access (VOD) WFSU Video All TV Streams Local Routes WFSU Ecology Blog The Florida Channel Television Schedules Television Program Guide More in TV ListenListen LiveLocal Radio ProgramsVoices that InspireMinutes and MomentsRadio SchedulesLatest Local NewscastEducation HomeParentsEducatorsSummer or Anytime Listen Live Local Radio Programs Voices that Inspire Minutes and Moments Radio Schedules Latest Local Newscast Parents Educators Summer or Anytime Listen Live Local Radio Programs Voices that Inspire Minutes and Moments Radio Schedules Latest Local Newscast Parents Educators Summer or Anytime EducationEducation HomeKids: Watch Now!Resources for ParentsSummer or AnytimeEducation WorkshopsEdScoop Blog Education Home Kids: Watch Now! Resources for Parents Summer or Anytime Education Workshops EdScoop Blog Education Home Kids: Watch Now! Resources for Parents Summer or Anytime Education Workshops EdScoop Blog WFSU Ecology BlogSupportBecome a MemberBecome a SponsorReal Estate DonationDonate Your VehiclePhilanthropyWFSU Travel ClubVolunteerMember LoginMore in Support Become a Member Become a Sponsor Real Estate Donation Donate Your Vehicle Philanthropy WFSU Travel Club Volunteer Member Login More in Support Become a Member Become a Sponsor Real Estate Donation Donate Your Vehicle Philanthropy WFSU Travel Club Volunteer Member Login More in Support AboutMissionWFSU PressLocal Content & Service ReportStaff ListContact UsCareersCommunity CalendarMore in About Mission WFSU Press Local Content & Service Report Staff List Contact Us Careers Community Calendar More in About Mission WFSU Press Local Content & Service Report Staff List Contact Us Careers Community Calendar More in About Television SchedulesRadio SchedulesLocal WeatherCommunity CalendarTV ServicesWFSU Ecology BlogAboutLocal Content & Service ReportWFSU Press **Donating a Vehicle - How it Works** Home Ways to Support Donating a Vehicle - How it Works WFSU is now accepting vehicle donations. Have an old car taking up space in your driveway? Donate it to WFSU! Simply fill out ouronline formor call one of our friendly operators seven days a week, toll free at855-WFSU-123or855-937-8123. (Se habla español.)We'll take care of the rest.We'll pick up your donation when it's most convenient, at home or work; we issue you with a tax receipt for your records; and we take care of all additional paperwork.Why Donate?Help your public broadcasting station, WFSUAvoid the hassles of selling a carNo need to pay hefty repair billsFree up space in your garage100% tax deductibleMaking a donation is EASY!It's as easy as filling out theonline formorpicking up a phoneand speaking to a live operator.If you have any questions just call one of our friendly operators toll-free at855-WFSU-123or 855-937-8123 seven days a week. You can donate your car, boat, truck, motor home, or airplane. We'll pick up your donation when it's most convenient, at home or work; we issue you with a tax receipt for your records; and we take care of all additional paperwork. Help your public broadcasting station, WFSUAvoid the hassles of selling a carNo need to pay hefty repair billsFree up space in your garage100% tax deductible Help your public broadcasting station, WFSU Avoid the hassles of selling a car No need to pay hefty repair bills Free up space in your garage 100% tax deductible It's as easy as filling out theonline formorpicking up a phoneand speaking to a live operator. If you have any questions just call one of our friendly operators toll-free at855-WFSU-123or 855-937-8123 seven days a week. You can donate your car, boat, truck, motor home, or airplane. We'll pick up your donation when it's most convenient, at home or work; we issue you with a tax receipt for your records; and we take care of all additional paperwork. Help your public broadcasting station, WFSUAvoid the hassles of selling a carNo need to pay hefty repair billsFree up space in your garage100% tax deductible Help your public broadcasting station, WFSU Avoid the hassles of selling a car No need to pay hefty repair bills Free up space in your garage 100% tax deductible Help your public broadcasting station, WFSU Avoid the hassles of selling a car No need to pay hefty repair bills Free up space in your garage 100% tax deductible It's as easy as filling out theonline formorpicking up a phoneand speaking to a live operator. If you have any questions just call one of our friendly operators toll-free at855-WFSU-123or 855-937-8123 seven days a week. You can donate your car, boat, truck, motor home, or airplane. Ways to Support [Home] MembershipDonateSustaining MembershipsUpdate Payment InformationWFSU PassportHonor and Memorial GivingGifts of Stock or IRA Donate Sustaining Memberships Update Payment Information WFSU Passport Honor and Memorial Giving Gifts of Stock or IRA Donate Sustaining Memberships Update Payment Information WFSU Passport Honor and Memorial Giving Gifts of Stock or IRA Sponsorship & UnderwritingLetter from Development DirectorOnlineTelevisionRadioStatewideList of Current Sponsors and Donors Letter from Development Director Online Television Radio Statewide List of Current Sponsors and Donors Letter from Development Director Online Television Radio Statewide List of Current Sponsors and Donors Real Estate Donation Vehicle DonationHow it WorksFAQDonate Now How it Works FAQ Donate Now How it Works FAQ Donate Now PhilanthropySound Vision SocietyPlanned Giving Sound Vision Society Planned Giving Sound Vision Society Planned Giving WFSU Travel ClubTravel Club Information Travel Club Information Travel Club Information VolunteerVolunteering OpportunitiesOn-Air Fundraising Drives Volunteering Opportunities On-Air Fundraising Drives Volunteering Opportunities On-Air Fundraising Drives Member Login 1600 Red Barber Plaza Tallahassee, FL 32310 850-645-7200 mail@wfsu.org Search About Staff List Careers Directions Privacy Public Files PBS PBS KIDS PBS Learning Media NPR NETA Corporation for Public Broadcasting Daily News Email Community Events Calendar Education Newsletters All Newsletters"}