{"id": 1693, "name": "The Corbett Report", "domain": "corbettreport.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://corbettreport.com/the-strange-but-true-story-of-how-smoking-bans-paved-the-way-for-global-government/", "title": "The Strange But True Story Of How Smoking Bans Paved The Way For Global Government", "content": "Shop Membership Log In Profile New? Start Here! Home About AudioPodcastsInterviewsSolutions WatchQuestions For CorbettPropaganda WatchFilm, Literature & The New World OrderThe Well-Read AnarchistRadio Podcasts Interviews Solutions Watch Questions For Corbett Propaganda Watch Film, Literature & The New World Order The Well-Read Anarchist Radio Podcasts Interviews Solutions Watch Questions For Corbett Propaganda Watch Film, Literature & The New World Order The Well-Read Anarchist Radio Videos Newsletter Membership Shop Contact RSS Home About Shop AudioPodcastsArticlesInterviewsPropaganda WatchRadioSolutions Watch Podcasts Articles Interviews Propaganda Watch Radio Solutions Watch Podcasts Articles Interviews Propaganda Watch Radio Solutions Watch Videos Newsletter MembershipProfileLog In Profile Log In Profile Log In Contact RSS **The Strange But True Story of How Smoking Bans Paved the Way for Global Government** byCorbett|May 18, 2025|Newsletter|28 comments After years of scamdemic hype and veiled threats, the World Health Organization (WHO) havefinalized their pandemic treaty. Formally referred to as the “WHO Pandemic Agreement,” the document reflects years of wrangling, cajoling and horse trading among the globalist technocrats. And now that the negotiations are over, their control over the global health space can now be hardwired into international law. There are reasons to be relieved that the document is not as bad as it could have been. As some are pointing out, the latest draft of the agreement has been significantly defanged, with the most egregious language about mandatory enforcement and WHO sovereignty having been removed. Even better, the relevance of this agreement to Americans has been lessened by therecent executive orderwithdrawing the US from the WHO. But for those of us concerned about the establishment of world government, we are not out of the woods yet. There are provisions in this agreement that will allow the would-be global health tyrants to expand beyond the boundaries of the current draft text and to assume the dictatorial powers that their critics (like yours truly) have been warning the treaty would bestow on the WHO. What’s worse, what can be undone with the stroke of Trump’s presidential pen (or robopen) can beredone with the stroke of a presidential pen (or robopen), and it would be the height of naïveté to assume that the next puppet to occupy the Oval Office won’t immediately sign the US back on to the agreement. So, is this the start of a global governmental system of technocratic health control? And, if it is, what does that mean for the future of humanity? In order to answer that question, we’re going to have to go back to the roots of the WHO’s power grab. Andthatstory, it turns out, starts in a most unexpected place . . . Not a Corbett Report member yet? Sign up toBECOME A MEMBERof the website and read the full newsletter orACCESS THE EDITORIAL FOR FREEon my Substack. **28 Comments** jeffs17on 05/19/2025 at 12:31 amThanks James, another great articleBeing on of the “Long-Winded” tribe I must needs split my comment into two posts…While I was at the Brownstone Institute, following your article’s link to “The City That Treats Adults Like Children.”, I came across this article that’s germane to the topic at hand:There Will Always Be ‘Trouble in River City’ –https://brownstone.org/articles/there-will-always-be-trouble-in-river-city/… snake oil salesmenAnd, speaking of smoking tobacco, something near and dear to my heart as a life long (60 years) puffer, I’ve had a long time to ponder the pros and cons. While I naively smoked ‘commercial’ cigarettes for way too long, about 30 years ago I started ‘rolling my own’ using tobacco and papers without additives. I was going thru about three packs a day !! by the time I was in the Navy (*); these days I average 6.5 cigs a day (based on a nine month ‘butt count” log I kept in 2023)(*) a lot of that went up in smoke in the ashtray thanks to the ‘additives’ in commercial cigarettes that kept cigarettes burning even without active puffing since “that’s what consumers wanted” (and what started fires!! e.g., ‘smoking in bed’)… unlike unadulterated cigarettes and cigars that stop burning when not actively being puffed.… ahhh, but I digressSome food for thought:– When I first started smoking (1960’s), and was considering the health effects, that “still small voice” advised if I got plenty of aerobic exercise it should ‘blow out the carbon” (similar to revving car engines, in the day, to do the same) – I still consider that good advice for smokers and non-smokers alike– There’s no doubt in my mind most mainstream commercial cigarettes adversely affect one’s health. Consider the hundreds of chemicals added to the tobacco, the papers, and filters are a toxic assault that should give anyone pause to consider such misbehavior.– BUT, also consider tobacco is one of nature’s gifts and, as some say “There is no lie in Nature”. Consider the following:– Unadulterated tobacco has been used as a ceremonial connection with Mother Earth and the Creator in many cultures for a very long time.– Anecdotally I’ve observed numerous reports, over many years, on those still alive over 100 years who’ve been life long smokers– Tobacco is recognized as an expectorant, among other properties. Lord knows, in these times of highly polluted air, we can use some assistance expelling inhaled pollutants from our bodies. In my experience and observation, tobacco smoke does just that. Inhaling Mary Jane has a similar effect…[Continued in Part 2 of my post]Log in to Reply Thanks James, another great article Being on of the “Long-Winded” tribe I must needs split my comment into two posts… While I was at the Brownstone Institute, following your article’s link to “The City That Treats Adults Like Children.”, I came across this article that’s germane to the topic at hand: There Will Always Be ‘Trouble in River City’ –https://brownstone.org/articles/there-will-always-be-trouble-in-river-city/… snake oil salesmen And, speaking of smoking tobacco, something near and dear to my heart as a life long (60 years) puffer, I’ve had a long time to ponder the pros and cons. While I naively smoked ‘commercial’ cigarettes for way too long, about 30 years ago I started ‘rolling my own’ using tobacco and papers without additives. I was going thru about three packs a day !! by the time I was in the Navy (*); these days I average 6.5 cigs a day (based on a nine month ‘butt count” log I kept in 2023)(*) a lot of that went up in smoke in the ashtray thanks to the ‘additives’ in commercial cigarettes that kept cigarettes burning even without active puffing since “that’s what consumers wanted” (and what started fires!! e.g., ‘smoking in bed’)… unlike unadulterated cigarettes and cigars that stop burning when not actively being puffed.… ahhh, but I digress Some food for thought: – When I first started smoking (1960’s), and was considering the health effects, that “still small voice” advised if I got plenty of aerobic exercise it should ‘blow out the carbon” (similar to revving car engines, in the day, to do the same) – I still consider that good advice for smokers and non-smokers alike – There’s no doubt in my mind most mainstream commercial cigarettes adversely affect one’s health. Consider the hundreds of chemicals added to the tobacco, the papers, and filters are a toxic assault that should give anyone pause to consider such misbehavior. – BUT, also consider tobacco is one of nature’s gifts and, as some say “There is no lie in Nature”. Consider the following:– Unadulterated tobacco has been used as a ceremonial connection with Mother Earth and the Creator in many cultures for a very long time.– Anecdotally I’ve observed numerous reports, over many years, on those still alive over 100 years who’ve been life long smokers– Tobacco is recognized as an expectorant, among other properties. Lord knows, in these times of highly polluted air, we can use some assistance expelling inhaled pollutants from our bodies. In my experience and observation, tobacco smoke does just that. Inhaling Mary Jane has a similar effect… [Continued in Part 2 of my post] Thanks James, another great article Being on of the “Long-Winded” tribe I must needs split my comment into two posts… While I was at the Brownstone Institute, following your article’s link to “The City That Treats Adults Like Children.”, I came across this article that’s germane to the topic at hand: There Will Always Be ‘Trouble in River City’ –https://brownstone.org/articles/there-will-always-be-trouble-in-river-city/… snake oil salesmen And, speaking of smoking tobacco, something near and dear to my heart as a life long (60 years) puffer, I’ve had a long time to ponder the pros and cons. While I naively smoked ‘commercial’ cigarettes for way too long, about 30 years ago I started ‘rolling my own’ using tobacco and papers without additives. I was going thru about three packs a day !! by the time I was in the Navy (*); these days I average 6.5 cigs a day (based on a nine month ‘butt count” log I kept in 2023)(*) a lot of that went up in smoke in the ashtray thanks to the ‘additives’ in commercial cigarettes that kept cigarettes burning even without active puffing since “that’s what consumers wanted” (and what started fires!! e.g., ‘smoking in bed’)… unlike unadulterated cigarettes and cigars that stop burning when not actively being puffed.… ahhh, but I digress Some food for thought: – When I first started smoking (1960’s), and was considering the health effects, that “still small voice” advised if I got plenty of aerobic exercise it should ‘blow out the carbon” (similar to revving car engines, in the day, to do the same) – I still consider that good advice for smokers and non-smokers alike – There’s no doubt in my mind most mainstream commercial cigarettes adversely affect one’s health. Consider the hundreds of chemicals added to the tobacco, the papers, and filters are a toxic assault that should give anyone pause to consider such misbehavior. – BUT, also consider tobacco is one of nature’s gifts and, as some say “There is no lie in Nature”. Consider the following:– Unadulterated tobacco has been used as a ceremonial connection with Mother Earth and the Creator in many cultures for a very long time.– Anecdotally I’ve observed numerous reports, over many years, on those still alive over 100 years who’ve been life long smokers– Tobacco is recognized as an expectorant, among other properties. Lord knows, in these times of highly polluted air, we can use some assistance expelling inhaled pollutants from our bodies. In my experience and observation, tobacco smoke does just that. Inhaling Mary Jane has a similar effect… [Continued in Part 2 of my post] jeffs17on 05/19/2025 at 12:31 am[Continued from Part 1 of my post]– As regular Corbett-teers are probably aware, whenever something is demonized by lame-stream sources, widely blathered with great fervor, the Truth probably lies 180º in the other direction – and tobacco has certainly been the subject of such misdirection. Anecdotally:(1) reports and studies suggested tobacco smokers were less susceptible to the effects of COVIDious Stupidous(2) In 2003 Joe Vialls published an article “Smoking Helps Protect Against Lung Cancer” wherein, among other things, he illustrated how ‘the US government’, fearing public backlash regarding increasing adverse health consequences of all the atmospheric nuclear tests (fallout) they’d conducted, determined to misdirect the public into thinking the expected uptick in cancer and the like, was caused by the lying-thru-their-teeth tobacco industry… the “lone gunmen”One version of Joe’s article is here:https://web.archive.org/web/20050214135605/http://vialls.net/transpositions/smoking.html… same as it ever was – “We’ve( still) got trouble… right here in River City…”Thanks, James, for your continuing diligence revealing the man behind the curtain, as, indeed, the emperor has no clothesLog in to ReplyDuckon 05/19/2025 at 4:46 amI like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing.It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use.Log in to Reply [Continued from Part 1 of my post] – As regular Corbett-teers are probably aware, whenever something is demonized by lame-stream sources, widely blathered with great fervor, the Truth probably lies 180º in the other direction – and tobacco has certainly been the subject of such misdirection. Anecdotally: (1) reports and studies suggested tobacco smokers were less susceptible to the effects of COVIDious Stupidous (2) In 2003 Joe Vialls published an article “Smoking Helps Protect Against Lung Cancer” wherein, among other things, he illustrated how ‘the US government’, fearing public backlash regarding increasing adverse health consequences of all the atmospheric nuclear tests (fallout) they’d conducted, determined to misdirect the public into thinking the expected uptick in cancer and the like, was caused by the lying-thru-their-teeth tobacco industry… the “lone gunmen”One version of Joe’s article is here:https://web.archive.org/web/20050214135605/http://vialls.net/transpositions/smoking.html … same as it ever was – “We’ve( still) got trouble… right here in River City…” Thanks, James, for your continuing diligence revealing the man behind the curtain, as, indeed, the emperor has no clothes Duckon 05/19/2025 at 4:46 amI like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing.It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use.Log in to Reply I like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing. It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use. [Continued from Part 1 of my post] – As regular Corbett-teers are probably aware, whenever something is demonized by lame-stream sources, widely blathered with great fervor, the Truth probably lies 180º in the other direction – and tobacco has certainly been the subject of such misdirection. Anecdotally: (1) reports and studies suggested tobacco smokers were less susceptible to the effects of COVIDious Stupidous (2) In 2003 Joe Vialls published an article “Smoking Helps Protect Against Lung Cancer” wherein, among other things, he illustrated how ‘the US government’, fearing public backlash regarding increasing adverse health consequences of all the atmospheric nuclear tests (fallout) they’d conducted, determined to misdirect the public into thinking the expected uptick in cancer and the like, was caused by the lying-thru-their-teeth tobacco industry… the “lone gunmen”One version of Joe’s article is here:https://web.archive.org/web/20050214135605/http://vialls.net/transpositions/smoking.html … same as it ever was – “We’ve( still) got trouble… right here in River City…” Thanks, James, for your continuing diligence revealing the man behind the curtain, as, indeed, the emperor has no clothes Duckon 05/19/2025 at 4:46 amI like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing.It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use.Log in to Reply I like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing. It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use. I like smoking too, and agree that commercial chemicals and paper in cigarettes are probably very bad for you…..and tobbacin cigars or pipes is probably a LOT safer.:…..but no way am I gonna think it’s in anyway good for you except that it is pleasing and relaxing. It’s pretty obvious that sucking smoke into your yt lungs is BAD for your health- wood smoke is as much natures gift as tobacco (or cyanide in apple pups, lol) but no one says that’s good to breathe in. Nicotine is a useful drug , esp for schizophrenia and possibly ADHD , and pleasant to use. taxpayeron 05/19/2025 at 2:00 amThe article on the “little-known French literary critic” has the wrong year for Vance’s Senate campaign. Even if everything else in it is true, figuring out what to do with the information is work for a pay grade higher than mine.Log in to Reply The article on the “little-known French literary critic” has the wrong year for Vance’s Senate campaign. Even if everything else in it is true, figuring out what to do with the information is work for a pay grade higher than mine. The article on the “little-known French literary critic” has the wrong year for Vance’s Senate campaign. Even if everything else in it is true, figuring out what to do with the information is work for a pay grade higher than mine. ARon 05/19/2025 at 3:55 amI had no clue you were such a dangerous self actualised right-wing extremist, Ice-Pick!Log in to Reply I had no clue you were such a dangerous self actualised right-wing extremist, Ice-Pick! I had no clue you were such a dangerous self actualised right-wing extremist, Ice-Pick! Lauraon 05/19/2025 at 7:58 amThank you, James. I’ve been looking forward to your take on this. The smoking angle is certainly interesting …Log in to Reply Thank you, James. I’ve been looking forward to your take on this. The smoking angle is certainly interesting … Thank you, James. I’ve been looking forward to your take on this. The smoking angle is certainly interesting … jo-annon 05/19/2025 at 11:26 amHere in the USA, many states have already written the WHO’s desired pandemic action plans into the state health code. Where I live, the officials can take anyonesuspectedof having been exposed to a contagion and put them in isolation for an undefined length of time, and force them to undergo any type of “remedy” they see fit. A challenge of this unconstitutional health regulation has already been heard by the state supreme court and LOST.There’s a level of hidden actors rolling out the plan long before the WHO vote.Log in to Reply Here in the USA, many states have already written the WHO’s desired pandemic action plans into the state health code. Where I live, the officials can take anyonesuspectedof having been exposed to a contagion and put them in isolation for an undefined length of time, and force them to undergo any type of “remedy” they see fit. A challenge of this unconstitutional health regulation has already been heard by the state supreme court and LOST.There’s a level of hidden actors rolling out the plan long before the WHO vote. Here in the USA, many states have already written the WHO’s desired pandemic action plans into the state health code. Where I live, the officials can take anyonesuspectedof having been exposed to a contagion and put them in isolation for an undefined length of time, and force them to undergo any type of “remedy” they see fit. A challenge of this unconstitutional health regulation has already been heard by the state supreme court and LOST.There’s a level of hidden actors rolling out the plan long before the WHO vote. hankyon 05/19/2025 at 1:19 pmHoly Smokes Batman!WHO’s gonna start the next pandemic?Well, WHO’s gonna start the next plandemic.Bat or man? Blame China or Iran?Log in to Reply Holy Smokes Batman!WHO’s gonna start the next pandemic?Well, WHO’s gonna start the next plandemic.Bat or man? Blame China or Iran? Holy Smokes Batman!WHO’s gonna start the next pandemic?Well, WHO’s gonna start the next plandemic.Bat or man? Blame China or Iran? Analog Manon 05/19/2025 at 7:57 pmNew Zealand implemented a “Generational Smoking Ban” in 2022 when Ardern was still in power. It was overturned a year later when a new government was selected primarily because it would result in the loss of substantial tax receipts. It’s all about health then eh?A similar piece of legislation is passing through the UK Parliament. It sailed through the Commons and is now being considered by their Lords and Ladies in the upper house. If passed, this will make it illegal to sell tobacco to anyone born after January 2009. I doubt that it will work.Isn’t it remarkable that Governments love to ban things which are supposedly bad for their populations whilst at the same time coercing and encouraging their populations into bags full of dangerous harmaceuticals?Log in to Reply New Zealand implemented a “Generational Smoking Ban” in 2022 when Ardern was still in power. It was overturned a year later when a new government was selected primarily because it would result in the loss of substantial tax receipts. It’s all about health then eh? A similar piece of legislation is passing through the UK Parliament. It sailed through the Commons and is now being considered by their Lords and Ladies in the upper house. If passed, this will make it illegal to sell tobacco to anyone born after January 2009. I doubt that it will work. Isn’t it remarkable that Governments love to ban things which are supposedly bad for their populations whilst at the same time coercing and encouraging their populations into bags full of dangerous harmaceuticals? New Zealand implemented a “Generational Smoking Ban” in 2022 when Ardern was still in power. It was overturned a year later when a new government was selected primarily because it would result in the loss of substantial tax receipts. It’s all about health then eh? A similar piece of legislation is passing through the UK Parliament. It sailed through the Commons and is now being considered by their Lords and Ladies in the upper house. If passed, this will make it illegal to sell tobacco to anyone born after January 2009. I doubt that it will work. Isn’t it remarkable that Governments love to ban things which are supposedly bad for their populations whilst at the same time coercing and encouraging their populations into bags full of dangerous harmaceuticals? Voluntaryiston 05/20/2025 at 2:58 amThe subject of which drugs are good or bad is a distraction from “striking at the root of the problem of institutionalized right’s violations”. It’s rampant worldwide, e.g., “The Most Dangerous Superstition” by Larken Rose. Especially rule by majority consensus, i.e., democracy, the form of authoritarianism that ended Socrates.To oppose democracy is sacrilegious, the flaw of “immoral” selfishness. Reason be damned! Why? ‘Cause, “We all know it”, even if we can’t conjure up a rational defense. It’s common to “justify” beliefs with “I feel X”, the stronger the feeling, the more the certainty. Thus, superstitions rule, while science based on reason is “just another religion”. Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian.Log in to ReplyDuckon 05/20/2025 at 6:21 am“….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….”That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else.“….Thus, superstitions rule, while science based on reason is “just another religion”….”That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking.Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid.Log in to ReplyVoluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply The subject of which drugs are good or bad is a distraction from “striking at the root of the problem of institutionalized right’s violations”. It’s rampant worldwide, e.g., “The Most Dangerous Superstition” by Larken Rose. Especially rule by majority consensus, i.e., democracy, the form of authoritarianism that ended Socrates.To oppose democracy is sacrilegious, the flaw of “immoral” selfishness. Reason be damned! Why? ‘Cause, “We all know it”, even if we can’t conjure up a rational defense. It’s common to “justify” beliefs with “I feel X”, the stronger the feeling, the more the certainty. Thus, superstitions rule, while science based on reason is “just another religion”. Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian. Duckon 05/20/2025 at 6:21 am“….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….”That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else.“….Thus, superstitions rule, while science based on reason is “just another religion”….”That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking.Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid.Log in to ReplyVoluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply “….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….” That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else. “….Thus, superstitions rule, while science based on reason is “just another religion”….” That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking. Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid. Voluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply “Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”? “Science is not really based on reason, 90% of the time.” Can you site a survey or study? “Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation. How do you define “actual science”? Duckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to Reply “….How does withdrawn from a dystopian society “get rid of everybody else”…..” What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version. What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature. While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are. Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake. That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real life Duckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to Reply “…..For a scientist it should be previous evidence, …..” Ought and Is are not the same thing…. That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo. You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind. However objective TRUTH is human UNDERSTANDING of that truth is limited and framed. Duckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply Also“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..” https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/ And https://corbettreport.com/openscience/ Both talk about how science works today…. And i see no evidence its ever worked differently in the past The subject of which drugs are good or bad is a distraction from “striking at the root of the problem of institutionalized right’s violations”. It’s rampant worldwide, e.g., “The Most Dangerous Superstition” by Larken Rose. Especially rule by majority consensus, i.e., democracy, the form of authoritarianism that ended Socrates.To oppose democracy is sacrilegious, the flaw of “immoral” selfishness. Reason be damned! Why? ‘Cause, “We all know it”, even if we can’t conjure up a rational defense. It’s common to “justify” beliefs with “I feel X”, the stronger the feeling, the more the certainty. Thus, superstitions rule, while science based on reason is “just another religion”. Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian. Duckon 05/20/2025 at 6:21 am“….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….”That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else.“….Thus, superstitions rule, while science based on reason is “just another religion”….”That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking.Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid.Log in to ReplyVoluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply “….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….” That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else. “….Thus, superstitions rule, while science based on reason is “just another religion”….” That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking. Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid. Voluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply “Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”? “Science is not really based on reason, 90% of the time.” Can you site a survey or study? “Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation. How do you define “actual science”? Duckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to Reply “….How does withdrawn from a dystopian society “get rid of everybody else”…..” What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version. What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature. While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are. Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake. That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real life Duckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to Reply “…..For a scientist it should be previous evidence, …..” Ought and Is are not the same thing…. That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo. You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind. However objective TRUTH is human UNDERSTANDING of that truth is limited and framed. Duckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply Also“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..” https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/ And https://corbettreport.com/openscience/ Both talk about how science works today…. And i see no evidence its ever worked differently in the past “….Not many would read, “The Virtue of Selfishness” by Ayn Rand, the Objectivist Aristotelian….” That is mainly because she is pretty awful IMO. If you think about it “Atlas Shrugged” is the ultimate Elite fantasy where they get rid of everyone else. “….Thus, superstitions rule, while science based on reason is “just another religion”….” That is a rather idealized version of science- science is not really based on reason 90 % of the time.Scientists are human beings and are just as prone to letting their own emotions and emotionally based presuppositions shape their thinking. Add in that 99% of people have no clue about the actual science, not could they recreate the experiments themselves……an example is evolution which is VERY full of BS stories that are passed thru the Midwits whi accept them like religious acceptance of religious myths.An example was a famous education YTber who told the story of “seeing” speciation wiyh Galapagos finches where some went nocturnal and the others didn’t and in 40 years were “different species” …… which is utter BS if only because my ancestors and Australian Aborigies didn’t inter breed for more then 40 generations and are not “different species” lolol I definitely was one of those people who thought science was better and different when I was a kid. Voluntaryiston 05/21/2025 at 2:23 am“Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”?“Science is not really based on reason, 90% of the time.” Can you site a survey or study?“Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation.How do you define “actual science”?Log in to ReplyDuckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to ReplyDuckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to ReplyDuckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply “Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”? “Science is not really based on reason, 90% of the time.” Can you site a survey or study? “Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation. How do you define “actual science”? Duckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to Reply “….How does withdrawn from a dystopian society “get rid of everybody else”…..” What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version. What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature. While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are. Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake. That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real life Duckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to Reply “…..For a scientist it should be previous evidence, …..” Ought and Is are not the same thing…. That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo. You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind. However objective TRUTH is human UNDERSTANDING of that truth is limited and framed. Duckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply Also“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..” https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/ And https://corbettreport.com/openscience/ Both talk about how science works today…. And i see no evidence its ever worked differently in the past “Atlas Shrugged” is the most purchased book, worldwide, after the Bible, which is purchased in bulk for placement in hotels. “If you think about it…”? I’ve read it 3 times since 1966, thought about it. How does withdrawn from a dystopian society “get rid of everybody else”? “Science is not really based on reason, 90% of the time.” Can you site a survey or study? “Scientists are…prone to letting their emotions…based on presuppositions shape their thinking.” Do you know what “presuppositions” are based on? For a scientist it should be previous evidence, as discovered when investigating reality. Knowledge is not a mysterious invention of the mind, Plato/Kant notwithstanding, it is a product of reasoned observation. How do you define “actual science”? Duckon 05/21/2025 at 2:41 am“….How does withdrawn from a dystopian society “get rid of everybody else”…..”What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version.What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature.While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are.Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake.That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real lifeLog in to Reply “….How does withdrawn from a dystopian society “get rid of everybody else”…..” What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version. What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature. While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are. Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake. That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real life “….How does withdrawn from a dystopian society “get rid of everybody else”…..” What happens to “everyone else” when the productive folks “withdraw” ???? The productive people are not different from the real world oligarchs, just heroified so as to be more attractive then the real life version. What about the blue collar worker ? His wife and his baby? Just because their suffering and death is off page doesn’t mean it’s not a feature. While I get the urge to see “looters” starve in the dark as civilization collapses that does not negate that their children and women would die too….. not to mention the pensioners and sickly…..and who exactly is going to RUN a the post collapse Utopia?? In world versions of Jeff Bezos and Elon Musk and Bill Gates…..so YES it’s kinda a fantasy of the ruling class and thise who imagine they WOULD be the ruling class if only everyone realized how special they are. Rand is just giving a Jewish version of the heroic will to power and domination- not that that will to power is not an effective tool but it leaves a horrible mess in its wake. That said you could actually argue the current crisis is actually a deliberate acceleration in the Atlas Shrugged vein, let’s see if it’s as much fun in real life Duckon 05/21/2025 at 2:51 am“…..For a scientist it should be previous evidence, …..”Ought and Is are not the same thing….That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo.You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind.However objective TRUTH is human UNDERSTANDING of that truth is limited and framed.Log in to Reply “…..For a scientist it should be previous evidence, …..” Ought and Is are not the same thing…. That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo. You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind. However objective TRUTH is human UNDERSTANDING of that truth is limited and framed. “…..For a scientist it should be previous evidence, …..” Ought and Is are not the same thing…. That’s why the scientific establishment of their day called sammelweiss (hand washing) a nut and got the Church to persecute Galileo. You can only make “reasoned observations THROUGH the lens of your own knowledge (right or wrong as it may be) and thru the model of the world in your mind. However objective TRUTH is human UNDERSTANDING of that truth is limited and framed. Duckon 05/21/2025 at 2:56 amAlso“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..”https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/Andhttps://corbettreport.com/openscience/Both talk about how science works today…. And i see no evidence its ever worked differently in the pastLog in to Reply Also“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..” https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/ And https://corbettreport.com/openscience/ Both talk about how science works today…. And i see no evidence its ever worked differently in the past Also“…..Science is not really based on reason, 90% of the time.” Can you site a survey or stud…..” https://plato.stanford.edu/archIves/sum2024/entries/scientific-reproducibility/ And https://corbettreport.com/openscience/ Both talk about how science works today…. And i see no evidence its ever worked differently in the past David Bon 05/20/2025 at 3:09 pmThe goal of the ones designing our world is like always more power which implicates more control on people.As the control is always more based on alternative pleasure distribution and fear propagation it is important for them to let us be pleased by remote controlled means and smoking is exactly the opposite.Frustrating us from all “natural” pleasures is a general policy/strategy for years.Log in to Reply The goal of the ones designing our world is like always more power which implicates more control on people. As the control is always more based on alternative pleasure distribution and fear propagation it is important for them to let us be pleased by remote controlled means and smoking is exactly the opposite. Frustrating us from all “natural” pleasures is a general policy/strategy for years. The goal of the ones designing our world is like always more power which implicates more control on people. As the control is always more based on alternative pleasure distribution and fear propagation it is important for them to let us be pleased by remote controlled means and smoking is exactly the opposite. Frustrating us from all “natural” pleasures is a general policy/strategy for years. paul823on 05/21/2025 at 6:29 amAnd right on cue: Singapore’s Draconian Vaccine Mandate: Citizens Face Jail Time for Refusing FORCED Medical Procedures That Do HARM.In a shocking move that tramples on fundamental human rights, Singapore has amended its Infectious Diseases Act (IDA) to force medical procedures on its citizens under threat of imprisonment. The amendments, enacted in 2023 and 2024, grant the Director-General of Health unchecked power to mandate vaccines — even in the absence of an active outbreak — while stripping citizens of legal protections against government overreach.Under Sections 47, 65, and 67 of the IDA, Singaporeans who refuse government-ordered vaccinations can be fined up to 10,000 (SGD) or jailed for six months for a first “offense.”Repeat offenders face double the penalties, with fines up to 20,000 and a year behind bars. Worse yet, Section 67 absolves government officials of all liability, meaning citizens harmed by forced medical interventions have no legal recourse.https://www.lifesitenews.com/news/amendments-to-singapore-law-could-see-citizens-jailed-for-refusing-vaccination/Log in to Reply And right on cue: Singapore’s Draconian Vaccine Mandate: Citizens Face Jail Time for Refusing FORCED Medical Procedures That Do HARM. In a shocking move that tramples on fundamental human rights, Singapore has amended its Infectious Diseases Act (IDA) to force medical procedures on its citizens under threat of imprisonment. The amendments, enacted in 2023 and 2024, grant the Director-General of Health unchecked power to mandate vaccines — even in the absence of an active outbreak — while stripping citizens of legal protections against government overreach. Under Sections 47, 65, and 67 of the IDA, Singaporeans who refuse government-ordered vaccinations can be fined up to 10,000 (SGD) or jailed for six months for a first “offense.” Repeat offenders face double the penalties, with fines up to 20,000 and a year behind bars. Worse yet, Section 67 absolves government officials of all liability, meaning citizens harmed by forced medical interventions have no legal recourse. https://www.lifesitenews.com/news/amendments-to-singapore-law-could-see-citizens-jailed-for-refusing-vaccination/ And right on cue: Singapore’s Draconian Vaccine Mandate: Citizens Face Jail Time for Refusing FORCED Medical Procedures That Do HARM. In a shocking move that tramples on fundamental human rights, Singapore has amended its Infectious Diseases Act (IDA) to force medical procedures on its citizens under threat of imprisonment. The amendments, enacted in 2023 and 2024, grant the Director-General of Health unchecked power to mandate vaccines — even in the absence of an active outbreak — while stripping citizens of legal protections against government overreach. Under Sections 47, 65, and 67 of the IDA, Singaporeans who refuse government-ordered vaccinations can be fined up to 10,000 (SGD) or jailed for six months for a first “offense.” Repeat offenders face double the penalties, with fines up to 20,000 and a year behind bars. Worse yet, Section 67 absolves government officials of all liability, meaning citizens harmed by forced medical interventions have no legal recourse. https://www.lifesitenews.com/news/amendments-to-singapore-law-could-see-citizens-jailed-for-refusing-vaccination/ mkeyon 05/21/2025 at 7:46 pmThe one thing that needs to happen to subvert all of this nonsense is for people to ask themselves “how the hell am I bound by something that some clown somewhere put on paper”. This is the only long term fix.Log in to ReplyVoluntaryiston 05/22/2025 at 2:54 amIt won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all.Log in to ReplyDuckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers.Duckon 05/22/2025 at 3:53 amMkey“..how the hell am I bound by something that some clown somewhere put on pape……”You’re NOT, your bound by what the guys who own the cops say.The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper.The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled.Log in to Reply The one thing that needs to happen to subvert all of this nonsense is for people to ask themselves “how the hell am I bound by something that some clown somewhere put on paper”. This is the only long term fix. Voluntaryiston 05/22/2025 at 2:54 amIt won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all.Log in to ReplyDuckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. It won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all. Duckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. What happened to the levellers? The real ones ( the band used to rock but their kinda rubbish now) And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power. “…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..” That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it. Voluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. The Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that. Duckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Duckon 05/22/2025 at 3:53 amMkey“..how the hell am I bound by something that some clown somewhere put on pape……”You’re NOT, your bound by what the guys who own the cops say.The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper.The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled.Log in to Reply Mkey“..how the hell am I bound by something that some clown somewhere put on pape……” You’re NOT, your bound by what the guys who own the cops say. The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper. The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled. The one thing that needs to happen to subvert all of this nonsense is for people to ask themselves “how the hell am I bound by something that some clown somewhere put on paper”. This is the only long term fix. Voluntaryiston 05/22/2025 at 2:54 amIt won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all.Log in to ReplyDuckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. It won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all. Duckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. What happened to the levellers? The real ones ( the band used to rock but their kinda rubbish now) And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power. “…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..” That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it. Voluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. The Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that. Duckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. It won’t take everyone, or even a majority, to start a revolution that will defeat the authoritarians. The American Revolt was started by a few free thinkers who published evolving political ideas that inspired more & more over the decades, as they had been inspired by previous generations of political thinkers, e.g., “The Levelers”, “The Magna Carta”, John Locke.First, the ideas, then the means of applying them, must be compatible. Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the same. But how?Instead of apposing oligarchs using their means, e.g., coercion, deadly threats, fraud, propaganda, secede with non-violent governance, e.g., private charter cities, sovereign jurisdictions governed by sovereign individuals. Argue by setting an example for all. Duckon 05/22/2025 at 3:47 amWhat happened to the levellers?The real ones ( the band used to rock but their kinda rubbish now)And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power.“…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..”That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it.Log in to ReplyVoluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. What happened to the levellers? The real ones ( the band used to rock but their kinda rubbish now) And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power. “…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..” That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it. Voluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. The Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that. Duckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. What happened to the levellers? The real ones ( the band used to rock but their kinda rubbish now) And the Magna Carta is misrepresented today – it was NOT a document of popular sovereignty or even intended to create equality under law….. it was an aristocratic pushback to protect the rights of the Aristocracy from central power. “…..Equal rights for all must be achieved by recognizing, respecting the rights of others to dissent, as long as they do the sam…..” That is a Nobel aim , but the issue with it is that at some point on some issues there has to be a decision. That means that at some point the right of dissent becomes “the right to whine about what’s going to happen whatever you think of it”I really don’t see a way around that issue, because some things exclude each other…. If you can tellMe a way round that I would be honestly interested in hearing it. Voluntaryiston 05/23/2025 at 2:24 amThe Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that.Log in to ReplyDuckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. The Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that. Duckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. The Magna Carta opened the door for the evolution of rights, unintentionally. The aristocracy wanted to establish a limit on the monarch, starting with a duty to pay for his support by acknowledging he couldn’t run amok. Once they got that, it spread all the way down to the surf. For centuries the logic of universal sovereignty evolved into British Common Law, e.g., “a man’s home is his castle”, a jury of peers, presumed innocent until proved otherwise, i.e., “due process”.Left to survive on their own, the American colonists became independent. They didn’t let the distant British Empire threaten, tax, lie, defraud them. They had become sovereign, brave, self-governing. Not all, just about one third. When they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereignty, for everybody, everywhere. Most of the other Americans joined them. Some, like you Duck, couldn’t see it. That sounds like a personal problem. Good luck with that. Duckon 05/23/2025 at 3:59 amVoluntaryistYes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol)But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in.B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…”You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth.Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs.Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..”I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically.But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBHLog in to ReplyVoluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Voluntaryist Yes, the Magna Carta did as you say, though I would argue that process was part of the English culture… it was the peculiar English way of doing things to pass political privileges down to the next lowest level in society. (The reason gentlemen’s clubs had such a blow up in numbers is funny- when they granted the vote to the middle class lots of men suddenly thought they must be “gentlemen” and wanted clubs. lol) But the thing isA) slow steady expansion of rights was NOT seen elsewhere- because it was derived IMO from the Saxon culture that settled England, mixed in with the Norse culture. These cultures were inherently prone to push personal rights because of the places they evolved in. B) when you say“… For centuries the logic of universal sovereignty evolved into British Common Law…” You are wrong- Common Law was in the culture of the saxons, because freemen were armed and fought against encroachment on their behavior. The common law was what the Normans had to work around when they took over England, 200 yrs before the maga carta…the Norman couldn’t just do whatever they liked without having more trouble then it was worth. Also rights can’t evolve unless they are an artificial construct of society…either rights are objectively real (and thus fixed) or they are fluid and social contracts or constructs. Also “….. they stood up against the most powerful empire in the world, it was a beacon for liberty, individual sovereign…..” I am pretty sure that’s the Boomer Truth take, since they still had slavery, and punished sodomites via law…..the real truth is the founders wanted THEIR rights respected, and gave not a fig for “the rights of man” in general. The reason “most Americans” joined the winners is because if they did not they would get tarred and feathered or people would burn their house down…. 20% imposed their will on the rest, had loyalists won the Americans would have “joined them” just as enthusiastically. But my rambling aside I asked if you had a solution to the fact that in society it is not always possible to “have it both ways” – you can’t have pro and anti slavery people agree to disagree, for example- and how you think that issue can be solved without one side winning and imposing its will on the other the way things have always been…. It’s a serious question because I have not found an answer myself which makes me a bit sad TBH Voluntaryiston 05/23/2025 at 4:48 amA. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy.Log in to ReplyDuckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time.Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. A. “…inherently prone…” is not the same as putting it in writing and codifying it. It becomes “more real”. It’s evolution of ideas.B. So, the whining is not always in vain, and sometimes changes things? Why? Could it be a recognization of humanity’s unique method of survival, thinking? Could that be objective reality?It would not be rational to expect everyone to respect your rights if you didn’t respect their rights. Eventually, that irrationality would lose out to rationality, e.g., equal respect, as stated in the “DOI”. Slavery did lose to equality without war. The “war against state sovereignty” was about Northern “industrial/banking complex” exploitation of Souther states. Generals Lee and Jackson were against slavery.As for “The Most Dangerous Superstition” (authoritarianism) being forced on dissenters by its supporters just because they are in the majority today, but would scream/resist if they were not, yes, sad hypocrisy. Duckon 05/23/2025 at 5:10 amA. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment.B.“… So, the whining is not always in vain, and sometimes changes things?…”Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive??Who do you think is easier to remove the “rights” from???Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised.https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass“……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..”Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. A. Putting it writing is IRRELEVANT if the idea is not held deep in people themselves-Soviet Russia had a wonderful constitution that was ignored from the start.True writing does codify and fix the law, but it does not ALTER it except possibly to put rights into the hands of judges and lawyers and thus Weaken the people’s belief in their own rights….. a Saxon with an ax did not need to think much about what his rights were ,and would hit you with that ax if you violated them, not wait ten years for a final court judgment. B.“… So, the whining is not always in vain, and sometimes changes things?…” Not really- whi do you think has more chance of having rights- a person who is dependent on handouts and physically cowardly, or a person with independent income and physically aggressive?? Who do you think is easier to remove the “rights” from??? Franklin was wrong the vote IS “in the ass” (or the rather the independence it gives) unless you’re going to explain where your platonic ideal of “inherent rights” comes from? I can argue they come from God, but that also limits them in some ways as to how they can be excercised. https://en.m.wikipedia.org/wiki/Franklin%27s_Jackass “……. Why? Could it be a recognization of humanity’s unique method of survival, thinking?…..” Thinking is just one of humans tools, it’s not much use without the others. It’s not even the MAIN tool humans use most of the time. Duckon 05/23/2025 at 5:31 amOn thinkingI think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there.Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions.Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. On thinking I think the first time I heard of the elephant metaphor was in haidts book (happiness hypothesis iirc) – people are mostly the rider who believe they are telling the elephant they sit in where to go. In reality most of the time the elephant (our emotions) actually decide where to go and then the rational part of your mind (the rider) makes up a reason why they steered the elephant over there. Most of the time people DONT think (not would they always get better results if they did) they rationalize their emotional driven actions. Also CS Lewis did say (abolition of man) that just THINKING about doing the good is almost powerless to resist the animal urges UNLESS the good actions are backed up by emotional sentiments- I think the example he used was that he would rather play cards with a guy brought up to think gentlemen dont cheat then a trained moral philosopher brought up by poker hustlers. Duckon 05/22/2025 at 3:53 amMkey“..how the hell am I bound by something that some clown somewhere put on pape……”You’re NOT, your bound by what the guys who own the cops say.The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper.The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled.Log in to Reply Mkey“..how the hell am I bound by something that some clown somewhere put on pape……” You’re NOT, your bound by what the guys who own the cops say. The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper. The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled. Mkey“..how the hell am I bound by something that some clown somewhere put on pape……” You’re NOT, your bound by what the guys who own the cops say. The paper exists to make the use of cops less necessary….. but it ALSO can be useful to the plebs, since it means that the government has to at least pretend to follow what’s on the paper. The fact that they are no longer pretending very hard to care about what the law is ,is a sign of their difficulties (not their strength) and they are loosing legitimacy in the eyes of the ruled. OlgaVitaon 05/30/2025 at 6:03 pmHey guys! Has anyone looked into the strange, improbably dizzying rocket launch of the Means siblings? Smells fishy and swampy (overnight business success of their glucose monitoring, aka digital surveillance, company; super bestselling first book etc.). Everything about them reeks of Cabal grooming. Even the reversal of genders in their names is a bit strange. Well, anyway. I have been wondering about their out-of-nowhere-to-White-House-inner-circles overnight appearance. Who is behind? I have just finished watching Toxic Nation film. It is co-produced by Joe Polish, self described on his website “the most sought after marketers alive today”. In the film Joe tells the story of advising Calley Means to connect Donald Trump and RFK Jr to win the elections and create MAHA. Why is Joe in the position to co-ordinate it? What is his agenda and background? I wonder… Any thoughts? TOXIC NATION documentaryhttps://play.mahafilms.com/watch-toxic-nation?cf_uvid=abd610a07eaa19385cf0c22add0a23dcLog in to Reply Hey guys! Has anyone looked into the strange, improbably dizzying rocket launch of the Means siblings? Smells fishy and swampy (overnight business success of their glucose monitoring, aka digital surveillance, company; super bestselling first book etc.). Everything about them reeks of Cabal grooming. Even the reversal of genders in their names is a bit strange. Well, anyway. I have been wondering about their out-of-nowhere-to-White-House-inner-circles overnight appearance. Who is behind? I have just finished watching Toxic Nation film. It is co-produced by Joe Polish, self described on his website “the most sought after marketers alive today”. In the film Joe tells the story of advising Calley Means to connect Donald Trump and RFK Jr to win the elections and create MAHA. Why is Joe in the position to co-ordinate it? What is his agenda and background? I wonder… Any thoughts? TOXIC NATION documentaryhttps://play.mahafilms.com/watch-toxic-nation?cf_uvid=abd610a07eaa19385cf0c22add0a23dc Hey guys! Has anyone looked into the strange, improbably dizzying rocket launch of the Means siblings? Smells fishy and swampy (overnight business success of their glucose monitoring, aka digital surveillance, company; super bestselling first book etc.). Everything about them reeks of Cabal grooming. Even the reversal of genders in their names is a bit strange. Well, anyway. I have been wondering about their out-of-nowhere-to-White-House-inner-circles overnight appearance. Who is behind? I have just finished watching Toxic Nation film. It is co-produced by Joe Polish, self described on his website “the most sought after marketers alive today”. In the film Joe tells the story of advising Calley Means to connect Donald Trump and RFK Jr to win the elections and create MAHA. Why is Joe in the position to co-ordinate it? What is his agenda and background? I wonder… Any thoughts? TOXIC NATION documentaryhttps://play.mahafilms.com/watch-toxic-nation?cf_uvid=abd610a07eaa19385cf0c22add0a23dc inisfadon 06/02/2025 at 11:58 pmSmoking: Aside from the fact that Ireland is probably the #1 ‘sheep’ that follows globalist directives without any thought, and will probably be the last country attached to the EU, you have to wonder…..Exactly when did the WHO ever decide to prohibit something that was actually bad for you? Instead, we see the reverse….the WHO insisting that covid vaxes are ‘safe and effective’ and everyone from infancy to the most elderly, should take them. It is interesting to note that, despite smoking being reduced to about 25% of the global population, lung disease and lung cancer has continued to rise. It’s just as interesting to note that not only do we have nicotine receptors in our brains, but that nicotine also enhances testosterone. Why would the WHO want to reduce testosterone globally? I wonder.Log in to Reply Smoking: Aside from the fact that Ireland is probably the #1 ‘sheep’ that follows globalist directives without any thought, and will probably be the last country attached to the EU, you have to wonder…..Exactly when did the WHO ever decide to prohibit something that was actually bad for you? Instead, we see the reverse….the WHO insisting that covid vaxes are ‘safe and effective’ and everyone from infancy to the most elderly, should take them. It is interesting to note that, despite smoking being reduced to about 25% of the global population, lung disease and lung cancer has continued to rise. It’s just as interesting to note that not only do we have nicotine receptors in our brains, but that nicotine also enhances testosterone. Why would the WHO want to reduce testosterone globally? I wonder. Smoking: Aside from the fact that Ireland is probably the #1 ‘sheep’ that follows globalist directives without any thought, and will probably be the last country attached to the EU, you have to wonder…..Exactly when did the WHO ever decide to prohibit something that was actually bad for you? Instead, we see the reverse….the WHO insisting that covid vaxes are ‘safe and effective’ and everyone from infancy to the most elderly, should take them. It is interesting to note that, despite smoking being reduced to about 25% of the global population, lung disease and lung cancer has continued to rise. It’s just as interesting to note that not only do we have nicotine receptors in our brains, but that nicotine also enhances testosterone. Why would the WHO want to reduce testosterone globally? I wonder. **Submit a CommentCancel reply** You must belogged into post a comment. **BOOK** **RECENT POSTS** Interview 1953 – Bracing for Bilderberg with Jacob Nordangård Opting Out of Technocracy – #SolutionsWatch In Praise of Sheep Interview 1952 – Israeli Mossad Funding Gaza Humanitarian Foundation (NWNW #592) Episode 479 – Mission Un-Accomplished? The Corbett Report Back on YouTube **RECENT COMMENTS** rosemonIn Praise of Sheep limeyonInterview 1953 – Bracing for Bilderberg with Jacob Nordangård limeyonInterview 1953 – Bracing for Bilderberg with Jacob Nordangård thompsonEpisode 479 – Mission Un-Accomplished? The Corbett Report Back on YouTube ronOpting Out of Technocracy – #SolutionsWatch **ARCHIVES** This work is licensed under a Creative Commons Attribution-nonCommercial 4.0 International License"}