{"id": 1382, "name": "The Hindu", "domain": "thehindu.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sportstar.thehindu.com/cricket/ipl/ipl-news/rcb-vs-pbks-live-score-ipl-final-updates-royal-challengers-bengaluru-punjab-kings-highlights-streaming-info-june-3-2025/article69652045.ece", "title": "Rcb Vs Pbks Live Score Ipl Final Updates Royal Challengers Bengaluru Punjab Kings Highlights Streaming Info June 3 2025", "content": "Cricket Football IPL 2025 French Open 2025 PKL Auction Highlights rcb vs pbks final live Shorts Cricket Football IPL 2025 French Open 2025 PKL Auction Highlights rcb vs pbks final live Shorts **PREMIUM** Magazine Posters Columns Special Editions Star Life Statsman **PLAYGROUNDS** Archery Athletics Badminton Basketball Boxing Chess Cricket Cue Sport ESPORTS Football Golf Hockey Kabaddi MMA Motorsport Shooting Squash Swimming Table Tennis Tennis Volleyball Wrestling **MULTIMEDIA** Videos Gallery Podcast Sportoon **ON STAGE** ACES Awards Sportstar Conclave Latest News **PREMIUM** Magazine Posters Columns Special Editions Star Life Statsman **PLAYGROUNDS** Archery Athletics Badminton Basketball Boxing Chess Cricket Cue Sport ESPORTS Football Golf Hockey Kabaddi MMA Motorsport Shooting Squash Swimming Table Tennis Tennis Volleyball Wrestling **MULTIMEDIA** Videos Gallery Podcast Sportoon **ON STAGE** ACES Awards Sportstar Conclave Latest News Subscribers OnlyHave you subscribed yet? Buy Print CONNECT WITH US Get sportstar app on Home Cricket IPL IPL News **IPL Final HIGHLIGHTS, RCB vs PBKS: Royal Challengers Bengaluru beats Punjab Kings by 6 runs, wins maiden trophy** **RCB vs PBKS Highlights: Catch the score and updates from the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 Final played at the Narendra Modi Stadium in Ahmedabad.** Updated : Jun 04, 2025 01:16 IST Comments Follow Us SHARE Copy link Email Facebook Twitter Telegram LinkedIn WhatsApp Reddit READ LATER Follow Royal Challengers Bengaluru vs Punjab Kings live score and updates. Welcome to Sportstar’s HIGHLIGHTS of the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 Final being played at the Narendra Modi Stadium in Ahmedabad. Sahil Mathur, Pranay Rajiv and Abhishek Saini brought you the updates from the game. Full list of Player of the Tournament winners in IPL Sai Sudharsan wins IPL Emerging Player of the Year 2025 Full list of Player of the Match winners in IPL Finals Prasidh Krishna wins Purple Cap Here’s what Kohli said on RCB’s title drought ending RCB wins first IPL title Sai Sudharsan wins Orange Cap Impact Player options Playing XIs Toss - PBKS Ahmedabad LIVE weather updates June 04, 2025 00:42How much do the IPL winner and runner-up win?IPL 2025 Prize money: All you need to know about how much money RCB receivedRoyal Challengers Bengaluru has received Rs 20 crores as IPL 2025 prize money after winning its maiden title, beating Punjab Kings in Ahmedabad on Tuesday. **IPL 2025 Prize money: All you need to know about how much money RCB received** Royal Challengers Bengaluru has received Rs 20 crores as IPL 2025 prize money after winning its maiden title, beating Punjab Kings in Ahmedabad on Tuesday. **IPL 2025 Prize money: All you need to know about how much money RCB received** Royal Challengers Bengaluru has received Rs 20 crores as IPL 2025 prize money after winning its maiden title, beating Punjab Kings in Ahmedabad on Tuesday. June 04, 2025 00:34Full list of Player of the Tournament winners in IPLIPL 2025: Full list of Player of the Tournament winners from 2008Sunil Narine has bagged this honour most number of times, being named the Player of the Tournament in 2024, 2018 and 2012. **IPL 2025: Full list of Player of the Tournament winners from 2008** Sunil Narine has bagged this honour most number of times, being named the Player of the Tournament in 2024, 2018 and 2012. **IPL 2025: Full list of Player of the Tournament winners from 2008** Sunil Narine has bagged this honour most number of times, being named the Player of the Tournament in 2024, 2018 and 2012. June 04, 2025 00:30Suryakumar Yadav wins Player of the Tournament awardIPL 2025: Suryakumar Yadav wins Most Valuable Player awardMumbai Indians’ Suryakumar Yadav was declared the Most Valuable Player of the Indian Premier League 2025 season. **IPL 2025: Suryakumar Yadav wins Most Valuable Player award** Mumbai Indians’ Suryakumar Yadav was declared the Most Valuable Player of the Indian Premier League 2025 season. **IPL 2025: Suryakumar Yadav wins Most Valuable Player award** Mumbai Indians’ Suryakumar Yadav was declared the Most Valuable Player of the Indian Premier League 2025 season. June 04, 2025 00:19Sai Sudharsan wins IPL Emerging Player of the Year 2025IPL 2025: Sai Sudharsan wins Emerging Player of the Year awardSai Sudharsan of Gujarat Titans on Tuesday was named the Emerging Player of the Year for the Indian Premier League 2025 season. **IPL 2025: Sai Sudharsan wins Emerging Player of the Year award** Sai Sudharsan of Gujarat Titans on Tuesday was named the Emerging Player of the Year for the Indian Premier League 2025 season. **IPL 2025: Sai Sudharsan wins Emerging Player of the Year award** Sai Sudharsan of Gujarat Titans on Tuesday was named the Emerging Player of the Year for the Indian Premier League 2025 season. June 04, 2025 00:14Full list of Player of the Match winners in IPL FinalsPlayer of the Match in IPL Finals: List of all POTM winners in Indian Premier League historyList of all IPL Finals Player of the Match award winners after Krunal Pandya wins POTM in the IPL 2025 summit clash. **Player of the Match in IPL Finals: List of all POTM winners in Indian Premier League history** List of all IPL Finals Player of the Match award winners after Krunal Pandya wins POTM in the IPL 2025 summit clash. **Player of the Match in IPL Finals: List of all POTM winners in Indian Premier League history** List of all IPL Finals Player of the Match award winners after Krunal Pandya wins POTM in the IPL 2025 summit clash. June 04, 2025 00:13Krunal Pandya wins Player of the Match in the final2/17 from his four overs win Krunal Pandya the Player of the Match award.Krunal Pandya adjudged Player of the Match in IPL 2025 finalKrunal Pandya was adjudged Player of the Match in the IPL 2025 final after Royal Challengers Bengaluru defeated Punjab Kings to win its maiden title on Tuesday. 2/17 from his four overs win Krunal Pandya the Player of the Match award. **Krunal Pandya adjudged Player of the Match in IPL 2025 final** Krunal Pandya was adjudged Player of the Match in the IPL 2025 final after Royal Challengers Bengaluru defeated Punjab Kings to win its maiden title on Tuesday. 2/17 from his four overs win Krunal Pandya the Player of the Match award. **Krunal Pandya adjudged Player of the Match in IPL 2025 final** Krunal Pandya was adjudged Player of the Match in the IPL 2025 final after Royal Challengers Bengaluru defeated Punjab Kings to win its maiden title on Tuesday. June 04, 2025 00:10Prasidh Krishna wins Purple Cap​IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple CapGujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season.​ ​IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple CapGujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season.​ **IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple Cap** Gujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season. ​IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple CapGujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season.​ **IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple Cap** Gujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season. **IPL 2025: Prasidh Krishna off Gujarat Titans wins Purple Cap** Gujarat Titans pacer Prasidh Krishna won the Purple Cap title for IPL 2025, after emerging as the highest wicket-taker of the season. June 03, 2025 23:50Here’s what Kohli said on RCB’s title drought endingVirat Kohli after winning IPL 2025: I have given RCB my youth, prime and experienceVirat Kohli admitted that the Indian Premier League 2025 title win will go down as a highlight of his illustrious career. **Virat Kohli after winning IPL 2025: I have given RCB my youth, prime and experience** Virat Kohli admitted that the Indian Premier League 2025 title win will go down as a highlight of his illustrious career. **Virat Kohli after winning IPL 2025: I have given RCB my youth, prime and experience** Virat Kohli admitted that the Indian Premier League 2025 title win will go down as a highlight of his illustrious career. June 03, 2025 23:48Virat Kohli after the winThis win is as much for the fans as it is for the team. I’ve given this team my youth and my prime. Tried to win it every season, gave it everything. Never thought this day would come, was overcome with emotion after we won. What ABD has done for the franchise is tremendous, told him ‘this is as much yours as it is ours’. He deserves to be on the podium, lifting the cup. This win is right up there, I’ve stayed loyal to this team. I had moments otherwise, but I stayed with them and them with me. My heart is with Bangalore, my soul is with Bangalore. God’s blessed me with perspective and talent. Just put my head down and worked as heart as I can. This win is as much for the fans as it is for the team. I’ve given this team my youth and my prime. Tried to win it every season, gave it everything. Never thought this day would come, was overcome with emotion after we won. What ABD has done for the franchise is tremendous, told him ‘this is as much yours as it is ours’. He deserves to be on the podium, lifting the cup. This win is right up there, I’ve stayed loyal to this team. I had moments otherwise, but I stayed with them and them with me. My heart is with Bangalore, my soul is with Bangalore. God’s blessed me with perspective and talent. Just put my head down and worked as heart as I can. This win is as much for the fans as it is for the team. I’ve given this team my youth and my prime. Tried to win it every season, gave it everything. Never thought this day would come, was overcome with emotion after we won. What ABD has done for the franchise is tremendous, told him ‘this is as much yours as it is ours’. He deserves to be on the podium, lifting the cup. This win is right up there, I’ve stayed loyal to this team. I had moments otherwise, but I stayed with them and them with me. My heart is with Bangalore, my soul is with Bangalore. God’s blessed me with perspective and talent. Just put my head down and worked as heart as I can. June 03, 2025 23:36Dinesh Karthik after RCB’s winMassive. It’s a team that’s waited 18 years, had to wait a long time. ABD, Kohli, all tried their hearts out. We believed from the start we were good. We scored above par tonight, batters felt it wasn’t easy. But final wasn’t about the pitch, we needed fire in the belly and had it. Massive. It’s a team that’s waited 18 years, had to wait a long time. ABD, Kohli, all tried their hearts out. We believed from the start we were good. We scored above par tonight, batters felt it wasn’t easy. But final wasn’t about the pitch, we needed fire in the belly and had it. Massive. It’s a team that’s waited 18 years, had to wait a long time. ABD, Kohli, all tried their hearts out. We believed from the start we were good. We scored above par tonight, batters felt it wasn’t easy. But final wasn’t about the pitch, we needed fire in the belly and had it. June 03, 2025 23:26RCB wins first IPL titleRCB wins maiden Indian Premier League title after beating Punjab Kings in IPL 2025 finalRoyal Challengers Bengaluru claimed its maiden Indian Premier League title after it beat Punjab Kings in the IPL 2025 final in Ahmedabad on Tuesday. **RCB wins maiden Indian Premier League title after beating Punjab Kings in IPL 2025 final** Royal Challengers Bengaluru claimed its maiden Indian Premier League title after it beat Punjab Kings in the IPL 2025 final in Ahmedabad on Tuesday. **RCB wins maiden Indian Premier League title after beating Punjab Kings in IPL 2025 final** Royal Challengers Bengaluru claimed its maiden Indian Premier League title after it beat Punjab Kings in the IPL 2025 final in Ahmedabad on Tuesday. June 03, 2025 23:206PBKS 184/7 in 20 overs29 off 6.Hazlewood to Shashank. Misses a full toss on the first. The second is a wide yorker, Shashank hits to long off, denies a single.29 off 4! If all goes right, RCB has won the IPL.SIX!A full toss on his pads, whacks this over square leg.FOUR!A top edge off a pull shot, flies over the keeper. SIX! A slot ball, pace off but Shashank reads this and smokes this over midwicket.ASIXover covers but that hardly matters, RCB has won the match.RCB beats PBKS by 6 runs. 29 off 6. Hazlewood to Shashank. Misses a full toss on the first. The second is a wide yorker, Shashank hits to long off, denies a single. 29 off 4! If all goes right, RCB has won the IPL. SIX!A full toss on his pads, whacks this over square leg.FOUR!A top edge off a pull shot, flies over the keeper. SIX! A slot ball, pace off but Shashank reads this and smokes this over midwicket. ASIXover covers but that hardly matters, RCB has won the match. RCB beats PBKS by 6 runs. 29 off 6. Hazlewood to Shashank. Misses a full toss on the first. The second is a wide yorker, Shashank hits to long off, denies a single. 29 off 4! If all goes right, RCB has won the IPL. SIX!A full toss on his pads, whacks this over square leg.FOUR!A top edge off a pull shot, flies over the keeper. SIX! A slot ball, pace off but Shashank reads this and smokes this over midwicket. ASIXover covers but that hardly matters, RCB has won the match. RCB beats PBKS by 6 runs. June 03, 2025 23:176PBKS 162/7 in 19 overs42 needed off 12 now.Bhuvneshwar to Shashank,SIX, a full toss, Shashank picks this away over long on. Bhuvneshwar nails the yorker, dot ball. Shashank denies singles on the second and third deliveries.FOUR!A scoop from Shashank through fine leg, this should have been fielded but the spin takes it away from the fielder and to the boundary. A perfect yorker to finish the over, Shashank picks a single to keep strike. 42 needed off 12 now. Bhuvneshwar to Shashank,SIX, a full toss, Shashank picks this away over long on. Bhuvneshwar nails the yorker, dot ball. Shashank denies singles on the second and third deliveries. FOUR!A scoop from Shashank through fine leg, this should have been fielded but the spin takes it away from the fielder and to the boundary. A perfect yorker to finish the over, Shashank picks a single to keep strike. 42 needed off 12 now. Bhuvneshwar to Shashank,SIX, a full toss, Shashank picks this away over long on. Bhuvneshwar nails the yorker, dot ball. Shashank denies singles on the second and third deliveries. FOUR!A scoop from Shashank through fine leg, this should have been fielded but the spin takes it away from the fielder and to the boundary. A perfect yorker to finish the over, Shashank picks a single to keep strike. June 03, 2025 23:12WPBKS 149/7 in 18 oversShashank against Dayal, on the pads from around the wicket, a leg bye.WICKET! Omarzai wants a big heave over the off side, slices to point.Azmatullah Omarzai c (sub) Bhandage b Dayal 1(2)Kyle Jamieson gets a leg bye. Shashank nearly holes out, flicks a full toss off his pads, Shepherd gets a hand to it at square leg, cannot hold on, two runs taken. A pull to deep midwicket for one. Shashank against Dayal, on the pads from around the wicket, a leg bye. WICKET! Omarzai wants a big heave over the off side, slices to point. Azmatullah Omarzai c (sub) Bhandage b Dayal 1(2) Kyle Jamieson gets a leg bye. Shashank nearly holes out, flicks a full toss off his pads, Shepherd gets a hand to it at square leg, cannot hold on, two runs taken. A pull to deep midwicket for one. Shashank against Dayal, on the pads from around the wicket, a leg bye. WICKET! Omarzai wants a big heave over the off side, slices to point. Azmatullah Omarzai c (sub) Bhandage b Dayal 1(2) Kyle Jamieson gets a leg bye. Shashank nearly holes out, flicks a full toss off his pads, Shepherd gets a hand to it at square leg, cannot hold on, two runs taken. A pull to deep midwicket for one. June 03, 2025 23:05WPBKS 144/6 in 17 oversBhuvneshwar to bowl his third now. He starts with a yorker to Wadhera, dot ball.OUT!A wide yorker and Wadhera slices this to deep cover.Nehal Wadhera c Pandya b Bhuvneshwar 15(18)Marcus Stoinis is the new batter.SIX!Outside the off stump, picks it over covers.WICKET!Stoinis departs! He edges to short third man.Marcus Stoinis c Dayal b Bhuvneshwar 6(2)Azmatullah Omarzai gets a single to deep covers. Shashank drives to long off for another single. Bhuvneshwar to bowl his third now. He starts with a yorker to Wadhera, dot ball.OUT!A wide yorker and Wadhera slices this to deep cover. Nehal Wadhera c Pandya b Bhuvneshwar 15(18) Marcus Stoinis is the new batter.SIX!Outside the off stump, picks it over covers.WICKET!Stoinis departs! He edges to short third man. Marcus Stoinis c Dayal b Bhuvneshwar 6(2) Azmatullah Omarzai gets a single to deep covers. Shashank drives to long off for another single. Bhuvneshwar to bowl his third now. He starts with a yorker to Wadhera, dot ball.OUT!A wide yorker and Wadhera slices this to deep cover. Nehal Wadhera c Pandya b Bhuvneshwar 15(18) Marcus Stoinis is the new batter.SIX!Outside the off stump, picks it over covers.WICKET!Stoinis departs! He edges to short third man. Marcus Stoinis c Dayal b Bhuvneshwar 6(2) Azmatullah Omarzai gets a single to deep covers. Shashank drives to long off for another single. June 03, 2025 22:586PBKS 136/4 in 16 oversShashank to face Hazlewood, at a hard length, pulls to long on for one. Wadhera tries to scoop over short fine by moving to his off side, Hazlewood follows him and forces a miscue, just one.SIX!Shashank gets across the line, hooks this slower delivery over fine leg. Appeals for leg before as Shashank tries to flick this behind square, that’s hit the pad for sure and RCB goes for a review. Ball tracker shows this to be going down leg and RCB has used up both its reviews.A wide to Wadhera down leg. A single on the legitimate fifth delivery to deep covers. SIX makes that 17 off this over. A full delivery, hit down the ground by Shashank. Shashank to face Hazlewood, at a hard length, pulls to long on for one. Wadhera tries to scoop over short fine by moving to his off side, Hazlewood follows him and forces a miscue, just one. SIX!Shashank gets across the line, hooks this slower delivery over fine leg. Appeals for leg before as Shashank tries to flick this behind square, that’s hit the pad for sure and RCB goes for a review. Ball tracker shows this to be going down leg and RCB has used up both its reviews. A wide to Wadhera down leg. A single on the legitimate fifth delivery to deep covers. SIX makes that 17 off this over. A full delivery, hit down the ground by Shashank. Shashank to face Hazlewood, at a hard length, pulls to long on for one. Wadhera tries to scoop over short fine by moving to his off side, Hazlewood follows him and forces a miscue, just one. SIX!Shashank gets across the line, hooks this slower delivery over fine leg. Appeals for leg before as Shashank tries to flick this behind square, that’s hit the pad for sure and RCB goes for a review. Ball tracker shows this to be going down leg and RCB has used up both its reviews. A wide to Wadhera down leg. A single on the legitimate fifth delivery to deep covers. SIX makes that 17 off this over. A full delivery, hit down the ground by Shashank. June 03, 2025 22:556PBKS 119/4 in 15 oversShepherd to Shashank,FOUR, too full and Shashank picks this over the bowler’s head. A single to square leg with a pull shot.SIX!Wadhera finally gets the big hit. He shuffles to his off side, whacks this over midwicket. Shepherd takes the pace off on the fourth, Wadhera wants to pull but misses the timing, settles for a single.Another slower to Shashank too, tries to cut this, cannot beat the point fielder. A single to end the over. Shepherd to Shashank,FOUR, too full and Shashank picks this over the bowler’s head. A single to square leg with a pull shot. SIX!Wadhera finally gets the big hit. He shuffles to his off side, whacks this over midwicket. Shepherd takes the pace off on the fourth, Wadhera wants to pull but misses the timing, settles for a single. Another slower to Shashank too, tries to cut this, cannot beat the point fielder. A single to end the over. Shepherd to Shashank,FOUR, too full and Shashank picks this over the bowler’s head. A single to square leg with a pull shot. SIX!Wadhera finally gets the big hit. He shuffles to his off side, whacks this over midwicket. Shepherd takes the pace off on the fourth, Wadhera wants to pull but misses the timing, settles for a single. Another slower to Shashank too, tries to cut this, cannot beat the point fielder. A single to end the over. June 03, 2025 22:49PBKS 106/4 in 14 oversSuyash starts his second over with a wide, the batters sneak a bye too. RCB reviews this and the ball indeed flicks the pad. The call changes to a leg bye. Wadhera misses a reverse sweep.Wadhera clips through midwicket on the third, runs two. Wadhera tries a reverse sweep yet again, misses again. A cut to deep point on the fifth. A single to long off for Shashank. Suyash starts his second over with a wide, the batters sneak a bye too. RCB reviews this and the ball indeed flicks the pad. The call changes to a leg bye. Wadhera misses a reverse sweep. Wadhera clips through midwicket on the third, runs two. Wadhera tries a reverse sweep yet again, misses again. A cut to deep point on the fifth. A single to long off for Shashank. Suyash starts his second over with a wide, the batters sneak a bye too. RCB reviews this and the ball indeed flicks the pad. The call changes to a leg bye. Wadhera misses a reverse sweep. Wadhera clips through midwicket on the third, runs two. Wadhera tries a reverse sweep yet again, misses again. A cut to deep point on the fifth. A single to long off for Shashank. June 03, 2025 22:41WPBKS 101/4 in 13 oversWICKET!Krunal Pandya has removed Josh Inglis. He tries to charge down and clear mid on, holes out to Livingstone inches inside the boundary. That was the big wicket RCB needed.Josh Inglis c Livingstone b Pandya 39(23)Shashank Singh is the new batter. He gets off the mark off his third delivery with a single to long off. Wadhera miscues his pull, gets just one run to square leg. Shashank pushes the last delivery towards long off, Krunal gets a hand to it but cannot prevent the run. WICKET!Krunal Pandya has removed Josh Inglis. He tries to charge down and clear mid on, holes out to Livingstone inches inside the boundary. That was the big wicket RCB needed. Josh Inglis c Livingstone b Pandya 39(23) Shashank Singh is the new batter. He gets off the mark off his third delivery with a single to long off. Wadhera miscues his pull, gets just one run to square leg. Shashank pushes the last delivery towards long off, Krunal gets a hand to it but cannot prevent the run. WICKET!Krunal Pandya has removed Josh Inglis. He tries to charge down and clear mid on, holes out to Livingstone inches inside the boundary. That was the big wicket RCB needed. Josh Inglis c Livingstone b Pandya 39(23) Shashank Singh is the new batter. He gets off the mark off his third delivery with a single to long off. Wadhera miscues his pull, gets just one run to square leg. Shashank pushes the last delivery towards long off, Krunal gets a hand to it but cannot prevent the run. June 03, 2025 22:376PBKS 98/3 in 12 oversShepherd for his second over. Inglis picks a single to square leg on the first delivery. Wadhera tries to work the second delivery through the on side, gets it off his inside of the bat to midwicket, no run. A wide from Shepherd next.Wadhera comes across his stumps and clips to midwicket for one.SIX!This is not even shot, but Inglis pulls this off his back foot and clears deep midwicket. A single to third man to end the over. 10 runs from that over. Shepherd for his second over. Inglis picks a single to square leg on the first delivery. Wadhera tries to work the second delivery through the on side, gets it off his inside of the bat to midwicket, no run. A wide from Shepherd next. Wadhera comes across his stumps and clips to midwicket for one.SIX!This is not even shot, but Inglis pulls this off his back foot and clears deep midwicket. A single to third man to end the over. 10 runs from that over. Shepherd for his second over. Inglis picks a single to square leg on the first delivery. Wadhera tries to work the second delivery through the on side, gets it off his inside of the bat to midwicket, no run. A wide from Shepherd next. Wadhera comes across his stumps and clips to midwicket for one.SIX!This is not even shot, but Inglis pulls this off his back foot and clears deep midwicket. A single to third man to end the over. 10 runs from that over. June 03, 2025 22:336PBKS 88/3 in 11 oversKrunal to Inglis,SIX! Too short and Inglis goes into his crease and pummels this over Virat Kohli at deep midwicket. The second delivery is fuller and quicker, takes an inside edge and hits his front foot.Inglis makes room and hits to deep cover for one. Wadhera tries to sweep but misses, hits him on the pad but this one pitches outside the leg-stump line. Three dots to finish the over. Krunal to Inglis,SIX! Too short and Inglis goes into his crease and pummels this over Virat Kohli at deep midwicket. The second delivery is fuller and quicker, takes an inside edge and hits his front foot. Inglis makes room and hits to deep cover for one. Wadhera tries to sweep but misses, hits him on the pad but this one pitches outside the leg-stump line. Three dots to finish the over. Krunal to Inglis,SIX! Too short and Inglis goes into his crease and pummels this over Virat Kohli at deep midwicket. The second delivery is fuller and quicker, takes an inside edge and hits his front foot. Inglis makes room and hits to deep cover for one. Wadhera tries to sweep but misses, hits him on the pad but this one pitches outside the leg-stump line. Three dots to finish the over. June 03, 2025 22:27WPBKS 81/3 in 10 oversRomario Shepherd into the attack. Four! Inglis begins the over with pull towards midwicket. OUT!! Iyer is gone. Tries to work one towards the deep third, gets an outside edge. Big, big wicket for RCB! He falls for 1 off 2 balls.Nehal Wadhera in at five. Off the mark with a single. Seven runs and a huge wicket in that over. Romario Shepherd into the attack. Four! Inglis begins the over with pull towards midwicket. OUT!! Iyer is gone. Tries to work one towards the deep third, gets an outside edge. Big, big wicket for RCB! He falls for 1 off 2 balls. Nehal Wadhera in at five. Off the mark with a single. Seven runs and a huge wicket in that over. Romario Shepherd into the attack. Four! Inglis begins the over with pull towards midwicket. OUT!! Iyer is gone. Tries to work one towards the deep third, gets an outside edge. Big, big wicket for RCB! He falls for 1 off 2 balls. Nehal Wadhera in at five. Off the mark with a single. Seven runs and a huge wicket in that over. June 03, 2025 22:21WPBKS 74/2 in 9 oversKrunal continues. Two singles off first two balls. OUT! Prabhsimran is gone. Comes down the track, gets a leading edge towards point and is caught. He falls for 26 off 22 balls.Shreyas Iyer in at four. Gets a single off first ball. Four singles and a wicket in that over. Krunal continues. Two singles off first two balls. OUT! Prabhsimran is gone. Comes down the track, gets a leading edge towards point and is caught. He falls for 26 off 22 balls. Shreyas Iyer in at four. Gets a single off first ball. Four singles and a wicket in that over. Krunal continues. Two singles off first two balls. OUT! Prabhsimran is gone. Comes down the track, gets a leading edge towards point and is caught. He falls for 26 off 22 balls. Shreyas Iyer in at four. Gets a single off first ball. Four singles and a wicket in that over. June 03, 2025 22:156PBKS 70/1 in 8 oversSuyash Sharma, impact sub, into the attack. Prabhsimran gets a single off the first ball. SIX! Googly on the length, Inglis goes on backfoot and pulls it over midwicket. Much-needed shot. Single, the next ball. SIX! This time Prabhsimran. Flighted ball, half volley and Prabhsimran sends the ball straight. 15 runs from the over. Suyash Sharma, impact sub, into the attack. Prabhsimran gets a single off the first ball. SIX! Googly on the length, Inglis goes on backfoot and pulls it over midwicket. Much-needed shot. Single, the next ball. SIX! This time Prabhsimran. Flighted ball, half volley and Prabhsimran sends the ball straight. 15 runs from the over. Suyash Sharma, impact sub, into the attack. Prabhsimran gets a single off the first ball. SIX! Googly on the length, Inglis goes on backfoot and pulls it over midwicket. Much-needed shot. Single, the next ball. SIX! This time Prabhsimran. Flighted ball, half volley and Prabhsimran sends the ball straight. 15 runs from the over. June 03, 2025 22:10PBKS 55/1 in 7 oversKrunal Pandya into the attack. A single off the second ball. Two singles in first four balls. Prabhsimran moves towards offside, goes for slog sweep but is beaten. No wide given. Just three runs from the over. Krunal Pandya into the attack. A single off the second ball. Two singles in first four balls. Prabhsimran moves towards offside, goes for slog sweep but is beaten. No wide given. Just three runs from the over. Krunal Pandya into the attack. A single off the second ball. Two singles in first four balls. Prabhsimran moves towards offside, goes for slog sweep but is beaten. No wide given. Just three runs from the over. June 03, 2025 22:10Sai Sudharsan wins Orange Cap​IPL 2025: Sai Sudharsan becomes youngest to win Orange CapSudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties.​ ​IPL 2025: Sai Sudharsan becomes youngest to win Orange CapSudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties.​ **IPL 2025: Sai Sudharsan becomes youngest to win Orange Cap** Sudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties. ​IPL 2025: Sai Sudharsan becomes youngest to win Orange CapSudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties.​ **IPL 2025: Sai Sudharsan becomes youngest to win Orange Cap** Sudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties. **IPL 2025: Sai Sudharsan becomes youngest to win Orange Cap** Sudharsan ended his campaign with 759 runs from 15 innings. He scored at an average of 54.21 and struck one century and six fifties. June 03, 2025 22:046PBKS 52/1 in 6 oversJosh Inglis is the new man in.Dayal is back. Inglis pulls in the vacant midwicket region and gets a double. Inglis looks to ramp but is beaten. RCB fielders think Inglis has edged it and have reviewed. A huge gap between ball and bat. Not out. SIX! Inglis pulls and goes over midwicket! Lovely shot. Nine runs from the over. Josh Inglis is the new man in. Dayal is back. Inglis pulls in the vacant midwicket region and gets a double. Inglis looks to ramp but is beaten. RCB fielders think Inglis has edged it and have reviewed. A huge gap between ball and bat. Not out. SIX! Inglis pulls and goes over midwicket! Lovely shot. Nine runs from the over. Josh Inglis is the new man in. Dayal is back. Inglis pulls in the vacant midwicket region and gets a double. Inglis looks to ramp but is beaten. RCB fielders think Inglis has edged it and have reviewed. A huge gap between ball and bat. Not out. SIX! Inglis pulls and goes over midwicket! Lovely shot. Nine runs from the over. June 03, 2025 21:57WPBKS 43/1 in 5 oversHazlewood. Starts off with a wide. Four! Short ball and Arya goes over short third. Another four! In the same region. Another top edge that goes past short third. Already 11 runs from first five balls. OUT!! A terrific catch at the deep midwicket by Salt. Arya picks the ball and Salt grabs it and then throws it in the air before grabbing it again. Lovely catch. Arya falls 24 off 19 balls. Hazlewood. Starts off with a wide. Four! Short ball and Arya goes over short third. Another four! In the same region. Another top edge that goes past short third. Already 11 runs from first five balls. OUT!! A terrific catch at the deep midwicket by Salt. Arya picks the ball and Salt grabs it and then throws it in the air before grabbing it again. Lovely catch. Arya falls 24 off 19 balls. Hazlewood. Starts off with a wide. Four! Short ball and Arya goes over short third. Another four! In the same region. Another top edge that goes past short third. Already 11 runs from first five balls. OUT!! A terrific catch at the deep midwicket by Salt. Arya picks the ball and Salt grabs it and then throws it in the air before grabbing it again. Lovely catch. Arya falls 24 off 19 balls. June 03, 2025 21:53PBKS 32/0 in 4 oversBhuvneshwar. Prabhsimran slaps it away towards covers but Hazlewood’s terrific effort keeps it down to just two runs. Good running between the wickets by these two. Arya drives straight, Bhuvi gets a finger on it and the ball hits the stumps. Umpire has gone for the third umpire to check. Not out. Arya pushes the ball towards midwicket and takes a single. Four runs from the over. Bhuvneshwar. Prabhsimran slaps it away towards covers but Hazlewood’s terrific effort keeps it down to just two runs. Good running between the wickets by these two. Arya drives straight, Bhuvi gets a finger on it and the ball hits the stumps. Umpire has gone for the third umpire to check. Not out. Arya pushes the ball towards midwicket and takes a single. Four runs from the over. Bhuvneshwar. Prabhsimran slaps it away towards covers but Hazlewood’s terrific effort keeps it down to just two runs. Good running between the wickets by these two. Arya drives straight, Bhuvi gets a finger on it and the ball hits the stumps. Umpire has gone for the third umpire to check. Not out. Arya pushes the ball towards midwicket and takes a single. Four runs from the over. June 03, 2025 21:48PBKS 28/0 in 3 oversJosh Hazlewood into the attack. Tap and run by Prabhsimran off the second ball. Two runs off first three balls. DROPPED! Prabhsimran pulls straight to deep fine leg and Shepherd spills it. How much will it cost RCB? Now Arya lofts towards midwicket and gets a double. Five runs from the over. Josh Hazlewood into the attack. Tap and run by Prabhsimran off the second ball. Two runs off first three balls. DROPPED! Prabhsimran pulls straight to deep fine leg and Shepherd spills it. How much will it cost RCB? Now Arya lofts towards midwicket and gets a double. Five runs from the over. Josh Hazlewood into the attack. Tap and run by Prabhsimran off the second ball. Two runs off first three balls. DROPPED! Prabhsimran pulls straight to deep fine leg and Shepherd spills it. How much will it cost RCB? Now Arya lofts towards midwicket and gets a double. Five runs from the over. June 03, 2025 21:434PBKS 23/0 in 2 oversYash Dayal from the other end. Arya slashes and the ball goes past short third for four! PBKS has started well here. Takes a quick single off the next ball. Four! Leg byes. Six runs off first five balls but Dayal bowls a down the leg delivery to make it 10 off the over. Yash Dayal from the other end. Arya slashes and the ball goes past short third for four! PBKS has started well here. Takes a quick single off the next ball. Four! Leg byes. Six runs off first five balls but Dayal bowls a down the leg delivery to make it 10 off the over. Yash Dayal from the other end. Arya slashes and the ball goes past short third for four! PBKS has started well here. Takes a quick single off the next ball. Four! Leg byes. Six runs off first five balls but Dayal bowls a down the leg delivery to make it 10 off the over. June 03, 2025 21:396PBKS 13/0 in 1 overPrabhsimran Singh and Priyansh Arya come out to open the innings. Chahal has been subbed out. Bhuvneshwar Kumar to take the new ball.Four! Down the leg first up and Arya just guides it towards fine leg for four. Follows it up with a single. Prabhsimran is off the mark with a single as well. Arya chips and the ball falls just short of the mid off! SIX!! Prabhsimran upper cuts JUST over deep third. Risky hit but he gets the reward. 13 runs from first over. Prabhsimran Singh and Priyansh Arya come out to open the innings. Chahal has been subbed out. Bhuvneshwar Kumar to take the new ball. Four! Down the leg first up and Arya just guides it towards fine leg for four. Follows it up with a single. Prabhsimran is off the mark with a single as well. Arya chips and the ball falls just short of the mid off! SIX!! Prabhsimran upper cuts JUST over deep third. Risky hit but he gets the reward. 13 runs from first over. Prabhsimran Singh and Priyansh Arya come out to open the innings. Chahal has been subbed out. Bhuvneshwar Kumar to take the new ball. Four! Down the leg first up and Arya just guides it towards fine leg for four. Follows it up with a single. Prabhsimran is off the mark with a single as well. Arya chips and the ball falls just short of the mid off! SIX!! Prabhsimran upper cuts JUST over deep third. Risky hit but he gets the reward. 13 runs from first over. June 03, 2025 21:30Target for PBKS - 191RCB ends with 190/9 following a topsy-turvy innings. For a while it looked like RCB won’t get close to 200. But then Jitesh and Shepherd and Livingstone played quick-fire cameos to re-energise the innings. But, PBKS, powered by Arshdeep’s three-wicket punch, ensured RCB didn’t touch 200. RCB ends with 190/9 following a topsy-turvy innings. For a while it looked like RCB won’t get close to 200. But then Jitesh and Shepherd and Livingstone played quick-fire cameos to re-energise the innings. But, PBKS, powered by Arshdeep’s three-wicket punch, ensured RCB didn’t touch 200. RCB ends with 190/9 following a topsy-turvy innings. For a while it looked like RCB won’t get close to 200. But then Jitesh and Shepherd and Livingstone played quick-fire cameos to re-energise the innings. But, PBKS, powered by Arshdeep’s three-wicket punch, ensured RCB didn’t touch 200. June 03, 2025 21:25In case you are wondering!RCB vs PBKS: What is the highest successful run chase in an IPL Final?Punjab Kings needed 191 runs against Royal Challengers Bengaluru to win the IPL 2025. **RCB vs PBKS: What is the highest successful run chase in an IPL Final?** Punjab Kings needed 191 runs against Royal Challengers Bengaluru to win the IPL 2025. **RCB vs PBKS: What is the highest successful run chase in an IPL Final?** Punjab Kings needed 191 runs against Royal Challengers Bengaluru to win the IPL 2025. June 03, 2025 21:17WRCB 190/9 in 20 oversArshdeep to close it off for PBKS. Fuller one to start. Cracked to long on for a single by Krunal.Arshdeep fires in yorker from over the wicket. Shepherd can’t get his bat on it. Trapped in front. Given out. Shepherd reviews it, just for the sake of it. All three reds.Romario Shepherd lbw b Arshdeep Singh 17 (9b 1x4 1x6)Full again from Arshdeep. Krunal can’t clear long on.Krunal Pandya c Iyer b Arshdeep Singh 4 (5b 0x4 0x6)Arshdeep isn’t done. He nabs Bhuvneshwar off the last ball to finish up the innings.Bhuvneshwar Kumar c Arya b Arshdeep Singh 1 (2b 0x4 0x6) S Arshdeep to close it off for PBKS. Fuller one to start. Cracked to long on for a single by Krunal. Arshdeep fires in yorker from over the wicket. Shepherd can’t get his bat on it. Trapped in front. Given out. Shepherd reviews it, just for the sake of it. All three reds. Romario Shepherd lbw b Arshdeep Singh 17 (9b 1x4 1x6) Full again from Arshdeep. Krunal can’t clear long on. Krunal Pandya c Iyer b Arshdeep Singh 4 (5b 0x4 0x6) Arshdeep isn’t done. He nabs Bhuvneshwar off the last ball to finish up the innings. Bhuvneshwar Kumar c Arya b Arshdeep Singh 1 (2b 0x4 0x6) S Arshdeep to close it off for PBKS. Fuller one to start. Cracked to long on for a single by Krunal. Arshdeep fires in yorker from over the wicket. Shepherd can’t get his bat on it. Trapped in front. Given out. Shepherd reviews it, just for the sake of it. All three reds. Romario Shepherd lbw b Arshdeep Singh 17 (9b 1x4 1x6) Full again from Arshdeep. Krunal can’t clear long on. Krunal Pandya c Iyer b Arshdeep Singh 4 (5b 0x4 0x6) Arshdeep isn’t done. He nabs Bhuvneshwar off the last ball to finish up the innings. Bhuvneshwar Kumar c Arya b Arshdeep Singh 1 (2b 0x4 0x6) S June 03, 2025 21:13RCB 187/6 in 19 oversOmarzai goes short straight away. Shepherd guides it for a single to the leg side. Krunal Pandya is the new batter for RCB. He gets off the mark with a single.Short from Omarzai again. Shepherd with a wild swing and gets enough bat on it to get it over fine leg for a four.He closes off the over with a massive six, crashing a fuller one over long on. Omarzai goes short straight away. Shepherd guides it for a single to the leg side. Krunal Pandya is the new batter for RCB. He gets off the mark with a single. Short from Omarzai again. Shepherd with a wild swing and gets enough bat on it to get it over fine leg for a four. He closes off the over with a massive six, crashing a fuller one over long on. Omarzai goes short straight away. Shepherd guides it for a single to the leg side. Krunal Pandya is the new batter for RCB. He gets off the mark with a single. Short from Omarzai again. Shepherd with a wild swing and gets enough bat on it to get it over fine leg for a four. He closes off the over with a massive six, crashing a fuller one over long on. June 03, 2025 21:07RCB 173/6 in 18 oversDROPPED!! Shepherd skies a length delivery from Vyshak and Pravin Dubey makes good ground to get under the ball. But the ball slips out of his grip.What a chance!!Vyshak beats Jitesh off a good length. Gentle appeal from Inglis and the umpire gives him out. Immediate review from Jitesh and he strikes.Vyshak though isn’t to be denied. He fires one in straight to clatter Jitesh’s stumps.Jitesh Sharma b Vyshak 24 (10b 2x4 2x6) DROPPED!! Shepherd skies a length delivery from Vyshak and Pravin Dubey makes good ground to get under the ball. But the ball slips out of his grip.What a chance!! Vyshak beats Jitesh off a good length. Gentle appeal from Inglis and the umpire gives him out. Immediate review from Jitesh and he strikes. Vyshak though isn’t to be denied. He fires one in straight to clatter Jitesh’s stumps. Jitesh Sharma b Vyshak 24 (10b 2x4 2x6) DROPPED!! Shepherd skies a length delivery from Vyshak and Pravin Dubey makes good ground to get under the ball. But the ball slips out of his grip.What a chance!! Vyshak beats Jitesh off a good length. Gentle appeal from Inglis and the umpire gives him out. Immediate review from Jitesh and he strikes. Vyshak though isn’t to be denied. He fires one in straight to clatter Jitesh’s stumps. Jitesh Sharma b Vyshak 24 (10b 2x4 2x6) June 03, 2025 20:57WRCB 168/5 in 17 oversShot of the final? Has to be.Jitesh has just sweep-scooped a back of a length from delivery from Jamieson over the keeper and past the fence for a six.Full now from Jamieson and Jitesh jumps out of the crease and slams it straight down the ground for a six. RCB is back.Livingstone joins in on the fun now. He picks a slower one from Jamieson early and slams it over deep mid wicket for a six.Jamieson goes pace on now. Straightish full toss and Livingstone swings over it. Trapped in front.Liam Livingstone lbw b Jamieson 25 (15b 0x4 2x6) Shot of the final? Has to be.Jitesh has just sweep-scooped a back of a length from delivery from Jamieson over the keeper and past the fence for a six. Full now from Jamieson and Jitesh jumps out of the crease and slams it straight down the ground for a six. RCB is back. Livingstone joins in on the fun now. He picks a slower one from Jamieson early and slams it over deep mid wicket for a six. Jamieson goes pace on now. Straightish full toss and Livingstone swings over it. Trapped in front. Liam Livingstone lbw b Jamieson 25 (15b 0x4 2x6) Shot of the final? Has to be.Jitesh has just sweep-scooped a back of a length from delivery from Jamieson over the keeper and past the fence for a six. Full now from Jamieson and Jitesh jumps out of the crease and slams it straight down the ground for a six. RCB is back. Livingstone joins in on the fun now. He picks a slower one from Jamieson early and slams it over deep mid wicket for a six. Jamieson goes pace on now. Straightish full toss and Livingstone swings over it. Trapped in front. Liam Livingstone lbw b Jamieson 25 (15b 0x4 2x6) June 03, 2025 20:534RCB 145/4 in 16 oversArshdeep starts the over with a couple of short balls. This has been a consistent strategy from Punjab Kings. Jitesh Sharma, the new batter, nearly perishes while trying to take on a bouncer. Top edges it and it is just over a flying Inglis.Width now from Arshdeep Singh. Jitesh flays at it. Over covers and it zooms to the fence. And just like that, RCB breaks free again. Arshdeep starts the over with a couple of short balls. This has been a consistent strategy from Punjab Kings. Jitesh Sharma, the new batter, nearly perishes while trying to take on a bouncer. Top edges it and it is just over a flying Inglis. Width now from Arshdeep Singh. Jitesh flays at it. Over covers and it zooms to the fence. And just like that, RCB breaks free again. Arshdeep starts the over with a couple of short balls. This has been a consistent strategy from Punjab Kings. Jitesh Sharma, the new batter, nearly perishes while trying to take on a bouncer. Top edges it and it is just over a flying Inglis. Width now from Arshdeep Singh. Jitesh flays at it. Over covers and it zooms to the fence. And just like that, RCB breaks free again. June 03, 2025 20:43WRCB 132/4 in 15 oversOmarzai with his third. Back of a length to start with. Flicked away for a single by Kohli. He gives away a wide, down the off side. Two more singles follow.Omarzai now goes short. Too short says the umpire. Wide.The medium pacer keeps the length short. Kohli top edges it and Omarzai chases it down.BRILLIANT CATCH!!!Virat Kohli c & b Azmatullah Omarzai 43 (35b 3x4 0x6) Omarzai with his third. Back of a length to start with. Flicked away for a single by Kohli. He gives away a wide, down the off side. Two more singles follow. Omarzai now goes short. Too short says the umpire. Wide. The medium pacer keeps the length short. Kohli top edges it and Omarzai chases it down.BRILLIANT CATCH!!! Virat Kohli c & b Azmatullah Omarzai 43 (35b 3x4 0x6) Omarzai with his third. Back of a length to start with. Flicked away for a single by Kohli. He gives away a wide, down the off side. Two more singles follow. Omarzai now goes short. Too short says the umpire. Wide. The medium pacer keeps the length short. Kohli top edges it and Omarzai chases it down.BRILLIANT CATCH!!! Virat Kohli c & b Azmatullah Omarzai 43 (35b 3x4 0x6) June 03, 2025 20:396RCB 125/3 in 14 oversLivingstone breaks the rut. Reaches out to launch Chahal inside out, wide of long off for a six. Pushes the next one to long on for a single.Full again from Chahal and Kohli slogs sweeps it for a four, over mid wicket. Brilliant timing there. Couple of singles follow and RCB consolidates. This was just the over RCB needed. 14 runs from it. Livingstone breaks the rut. Reaches out to launch Chahal inside out, wide of long off for a six. Pushes the next one to long on for a single. Full again from Chahal and Kohli slogs sweeps it for a four, over mid wicket. Brilliant timing there. Couple of singles follow and RCB consolidates. This was just the over RCB needed. 14 runs from it. Livingstone breaks the rut. Reaches out to launch Chahal inside out, wide of long off for a six. Pushes the next one to long on for a single. Full again from Chahal and Kohli slogs sweeps it for a four, over mid wicket. Brilliant timing there. Couple of singles follow and RCB consolidates. This was just the over RCB needed. 14 runs from it. June 03, 2025 20:30RCB 111/3 in 13 oversShort from Vyshak to start with. Kohli flat bats it to long on for a single. Length ball now. Punched through covers for a single by Livingstone.Vyshak keeps it short and wide against Kohli. Swatted to long on for a single, again. Vyshak gives away a wide down the leg side.Once again, RCB batters fail to break the shackles. Another boundaryless over for RCB. Short from Vyshak to start with. Kohli flat bats it to long on for a single. Length ball now. Punched through covers for a single by Livingstone. Vyshak keeps it short and wide against Kohli. Swatted to long on for a single, again. Vyshak gives away a wide down the leg side. Once again, RCB batters fail to break the shackles. Another boundaryless over for RCB. Short from Vyshak to start with. Kohli flat bats it to long on for a single. Length ball now. Punched through covers for a single by Livingstone. Vyshak keeps it short and wide against Kohli. Swatted to long on for a single, again. Vyshak gives away a wide down the leg side. Once again, RCB batters fail to break the shackles. Another boundaryless over for RCB. June 03, 2025 20:29RCB 103/3 in 12 oversLiam Livingstone is the new batter for RCB. He starts with a couple of singles.Chahal continues with his wily ways. Gives away nothing for the RCB batters. Kohli cracks one to the leg side and scampers in a double. PBKS gaining control of this game. Liam Livingstone is the new batter for RCB. He starts with a couple of singles. Chahal continues with his wily ways. Gives away nothing for the RCB batters. Kohli cracks one to the leg side and scampers in a double. PBKS gaining control of this game. Liam Livingstone is the new batter for RCB. He starts with a couple of singles. Chahal continues with his wily ways. Gives away nothing for the RCB batters. Kohli cracks one to the leg side and scampers in a double. PBKS gaining control of this game. June 03, 2025 20:21WRCB 97/3 in 11 oversJamieson returns. Kohli tucks one away from his pads for a single. Slower short ball from the Kiwi pacer. Patidar pulls it behind deep fine leg. Great effort by Vyshak to prevent a four.Full from Jamieson now. Patidar slams it through the line. Over long off for a six.Jamieson slides in a slow yorker. Patidar goes across the line now. Misses the ball completely. Strikes the pads and is given LBW immediately.PLUMB!!Rajat Patidar lbw b Jamieson 26 (16b 1x4 2x6) Jamieson returns. Kohli tucks one away from his pads for a single. Slower short ball from the Kiwi pacer. Patidar pulls it behind deep fine leg. Great effort by Vyshak to prevent a four. Full from Jamieson now. Patidar slams it through the line. Over long off for a six. Jamieson slides in a slow yorker. Patidar goes across the line now. Misses the ball completely. Strikes the pads and is given LBW immediately.PLUMB!! Rajat Patidar lbw b Jamieson 26 (16b 1x4 2x6) Jamieson returns. Kohli tucks one away from his pads for a single. Slower short ball from the Kiwi pacer. Patidar pulls it behind deep fine leg. Great effort by Vyshak to prevent a four. Full from Jamieson now. Patidar slams it through the line. Over long off for a six. Jamieson slides in a slow yorker. Patidar goes across the line now. Misses the ball completely. Strikes the pads and is given LBW immediately.PLUMB!! Rajat Patidar lbw b Jamieson 26 (16b 1x4 2x6) June 03, 2025 20:164RCB 87/2 in 10 oversOmarzai back for his second. He bowls in a bouncer to Kohli, who pulls and gets a single to long on. A slower bouncer to Patidar, he tries to ramp this over the keeper, misses.Omarzai does not offer pace on the third delivery, Patidar pulls from outside off to square leg, one run.FOUR!Kohli expects this to come slow and short, upper cuts this over the keeper.A single to long on off the fifth delivery. Omarzai back for his second. He bowls in a bouncer to Kohli, who pulls and gets a single to long on. A slower bouncer to Patidar, he tries to ramp this over the keeper, misses. Omarzai does not offer pace on the third delivery, Patidar pulls from outside off to square leg, one run.FOUR!Kohli expects this to come slow and short, upper cuts this over the keeper. A single to long on off the fifth delivery. Omarzai back for his second. He bowls in a bouncer to Kohli, who pulls and gets a single to long on. A slower bouncer to Patidar, he tries to ramp this over the keeper, misses. Omarzai does not offer pace on the third delivery, Patidar pulls from outside off to square leg, one run.FOUR!Kohli expects this to come slow and short, upper cuts this over the keeper. A single to long on off the fifth delivery. June 03, 2025 20:106RCB 80/2 in 9 oversChahal again. A short delivery outside off to Kohli, who fires it back at the bowler and Chahal saves it with a dive to his left. A single to long on on the second ball.Chahal to Patidar.SIX!A straight delivery, comes in with the angle and Patidar lofts this over long on with the angle. Two runs off the fourth delivery to deep square leg.A single to long on, Patidar punches off his back foot to long on. Another single to long on for Kohli, one run. Chahal again. A short delivery outside off to Kohli, who fires it back at the bowler and Chahal saves it with a dive to his left. A single to long on on the second ball. Chahal to Patidar.SIX!A straight delivery, comes in with the angle and Patidar lofts this over long on with the angle. Two runs off the fourth delivery to deep square leg. A single to long on, Patidar punches off his back foot to long on. Another single to long on for Kohli, one run. Chahal again. A short delivery outside off to Kohli, who fires it back at the bowler and Chahal saves it with a dive to his left. A single to long on on the second ball. Chahal to Patidar.SIX!A straight delivery, comes in with the angle and Patidar lofts this over long on with the angle. Two runs off the fourth delivery to deep square leg. A single to long on, Patidar punches off his back foot to long on. Another single to long on for Kohli, one run. June 03, 2025 20:074RCB 69/2 in 8 oversVyshak to Patidar,FOUR!At a hard length and angling away, Patidar waits for it and punches through point. Patidar tries to run the second ball down to third man, gets it off the under edge, no run.The third delivery is run down to fine leg, one run. Kohli punches the fourth to deep cover from outside the off stump, another single.Another slower delivery from Vyshak, Patidar taps it with soft hands through the off side, gets a run. A slower bouncer to Kohli, pulls to deep square leg for a single. Vyshak to Patidar,FOUR!At a hard length and angling away, Patidar waits for it and punches through point. Patidar tries to run the second ball down to third man, gets it off the under edge, no run. The third delivery is run down to fine leg, one run. Kohli punches the fourth to deep cover from outside the off stump, another single. Another slower delivery from Vyshak, Patidar taps it with soft hands through the off side, gets a run. A slower bouncer to Kohli, pulls to deep square leg for a single. Vyshak to Patidar,FOUR!At a hard length and angling away, Patidar waits for it and punches through point. Patidar tries to run the second ball down to third man, gets it off the under edge, no run. The third delivery is run down to fine leg, one run. Kohli punches the fourth to deep cover from outside the off stump, another single. Another slower delivery from Vyshak, Patidar taps it with soft hands through the off side, gets a run. A slower bouncer to Kohli, pulls to deep square leg for a single. June 03, 2025 20:02WRCB 61/2 in 7 oversYuzvendra Chahal to Kohli, a leg break on the middle stump line, Kohli pushes this to long on for one.WICKET!Chahal does the trick! Mayank’s eyes light up at the short-lengthed delivery, goes for a sweep, but this goes on straight, leading him to top edge to deep square leg.Mayank Agarwal c Arshdeep b Chahal 24 (18)Chahal starts with a wrong one to Rajat Patidar, hits to long on for one. Kohli goes onto his back foot on the fourth, cuts this to deep point for two runs.Kohli again plays off his back foot, this one comes straight from a length, flicks it to deep square for another single. Patidar pushes the final delivery through midwicket with soft hands, gets one. Yuzvendra Chahal to Kohli, a leg break on the middle stump line, Kohli pushes this to long on for one.WICKET!Chahal does the trick! Mayank’s eyes light up at the short-lengthed delivery, goes for a sweep, but this goes on straight, leading him to top edge to deep square leg. Mayank Agarwal c Arshdeep b Chahal 24 (18) Chahal starts with a wrong one to Rajat Patidar, hits to long on for one. Kohli goes onto his back foot on the fourth, cuts this to deep point for two runs. Kohli again plays off his back foot, this one comes straight from a length, flicks it to deep square for another single. Patidar pushes the final delivery through midwicket with soft hands, gets one. Yuzvendra Chahal to Kohli, a leg break on the middle stump line, Kohli pushes this to long on for one.WICKET!Chahal does the trick! Mayank’s eyes light up at the short-lengthed delivery, goes for a sweep, but this goes on straight, leading him to top edge to deep square leg. Mayank Agarwal c Arshdeep b Chahal 24 (18) Chahal starts with a wrong one to Rajat Patidar, hits to long on for one. Kohli goes onto his back foot on the fourth, cuts this to deep point for two runs. Kohli again plays off his back foot, this one comes straight from a length, flicks it to deep square for another single. Patidar pushes the final delivery through midwicket with soft hands, gets one. June 03, 2025 19:574RCB 55/1 in 6 oversVyshak V. to bowl now. A length ball on off stump, Kohli drives to mid off, no run. On the pads on the second, Kohli puts it away through fine leg where Chahal saves three runs with a diving save inside the circle.A slower ball at hard length, Mayank makes room and lifts it over the circle, gets two runs.FOUR!Half-a-chance that, again makes room to loft this over covers, gets it off the toe end, but it still gets enough to go well clear of the circle. Arshdeep chases this from mid off, the ball lands inside the boundary but Arshdeep cannot control his momentum and parries this over the rope.A pull to deep midwicket for two runs. Vyshak V. to bowl now. A length ball on off stump, Kohli drives to mid off, no run. On the pads on the second, Kohli puts it away through fine leg where Chahal saves three runs with a diving save inside the circle. A slower ball at hard length, Mayank makes room and lifts it over the circle, gets two runs.FOUR!Half-a-chance that, again makes room to loft this over covers, gets it off the toe end, but it still gets enough to go well clear of the circle. Arshdeep chases this from mid off, the ball lands inside the boundary but Arshdeep cannot control his momentum and parries this over the rope. A pull to deep midwicket for two runs. Vyshak V. to bowl now. A length ball on off stump, Kohli drives to mid off, no run. On the pads on the second, Kohli puts it away through fine leg where Chahal saves three runs with a diving save inside the circle. A slower ball at hard length, Mayank makes room and lifts it over the circle, gets two runs.FOUR!Half-a-chance that, again makes room to loft this over covers, gets it off the toe end, but it still gets enough to go well clear of the circle. Arshdeep chases this from mid off, the ball lands inside the boundary but Arshdeep cannot control his momentum and parries this over the rope. A pull to deep midwicket for two runs. June 03, 2025 19:53RCB 46/1 in 5 oversAzmatullah Omarzai into the attack. Kohli drives the first delivery to deep cover for a single. The second delivery tails in to Mayank, he tries to swipe at it, gets an inside edge through square leg, just one run.The third delivery is at a length, Kohli waits for it to come on and tucks it away through fine leg, one run. Another single for Mayank, this time to deep covers with a cut shot.Kohli punches the fifth delivery on the up through covers, gets two runs. A pull to deep midwicket for another single. Just seven runs from that over. Azmatullah Omarzai into the attack. Kohli drives the first delivery to deep cover for a single. The second delivery tails in to Mayank, he tries to swipe at it, gets an inside edge through square leg, just one run. The third delivery is at a length, Kohli waits for it to come on and tucks it away through fine leg, one run. Another single for Mayank, this time to deep covers with a cut shot. Kohli punches the fifth delivery on the up through covers, gets two runs. A pull to deep midwicket for another single. Just seven runs from that over. Azmatullah Omarzai into the attack. Kohli drives the first delivery to deep cover for a single. The second delivery tails in to Mayank, he tries to swipe at it, gets an inside edge through square leg, just one run. The third delivery is at a length, Kohli waits for it to come on and tucks it away through fine leg, one run. Another single for Mayank, this time to deep covers with a cut shot. Kohli punches the fifth delivery on the up through covers, gets two runs. A pull to deep midwicket for another single. Just seven runs from that over. June 03, 2025 19:484RCB 39/1 in 4 oversJamieson to Kohli,FOUR, on the pads, the fine leg is square and Kohli tucks it away to the fence. A single through point on the second delivery.FOURfor Mayank now, back of a length delivery, waits for it to arrive and glides it through backward point, just wide enough to beat the fielder in the deep. Tries to charge the next delivery, misses.Another play and a miss, wide of off, Mayank tries to cut but the bounce is too much for his attempted cut. A dot to end the over. Jamieson to Kohli,FOUR, on the pads, the fine leg is square and Kohli tucks it away to the fence. A single through point on the second delivery. FOURfor Mayank now, back of a length delivery, waits for it to arrive and glides it through backward point, just wide enough to beat the fielder in the deep. Tries to charge the next delivery, misses. Another play and a miss, wide of off, Mayank tries to cut but the bounce is too much for his attempted cut. A dot to end the over. Jamieson to Kohli,FOUR, on the pads, the fine leg is square and Kohli tucks it away to the fence. A single through point on the second delivery. FOURfor Mayank now, back of a length delivery, waits for it to arrive and glides it through backward point, just wide enough to beat the fielder in the deep. Tries to charge the next delivery, misses. Another play and a miss, wide of off, Mayank tries to cut but the bounce is too much for his attempted cut. A dot to end the over. June 03, 2025 19:436RCB 30/1 in 3 oversArshdeep for his second.Mayank goes on his front foot and chips his drive over covers, does not middle which gets him just two runs. A dot to follow, outside off, moves just a hint into the batter, tries to play square but misses.A short delivery outside off, Mayank slashes but there’s deep point in place to cut that off, just one. Full and on the off stump to Kohli, who drives to mid off and completes a quick single.Arshdeep to Mayank again. A bouncer around the middle-and-leg stump line, too high and given a wide. On the pads on the fifth delivery, clips to midwicket, no run.SIX!In the slot, and gets the treatment, Mayank clears his front foot and whacks this down the ground. Arshdeep for his second. Mayank goes on his front foot and chips his drive over covers, does not middle which gets him just two runs. A dot to follow, outside off, moves just a hint into the batter, tries to play square but misses. A short delivery outside off, Mayank slashes but there’s deep point in place to cut that off, just one. Full and on the off stump to Kohli, who drives to mid off and completes a quick single. Arshdeep to Mayank again. A bouncer around the middle-and-leg stump line, too high and given a wide. On the pads on the fifth delivery, clips to midwicket, no run.SIX!In the slot, and gets the treatment, Mayank clears his front foot and whacks this down the ground. Arshdeep for his second. Mayank goes on his front foot and chips his drive over covers, does not middle which gets him just two runs. A dot to follow, outside off, moves just a hint into the batter, tries to play square but misses. A short delivery outside off, Mayank slashes but there’s deep point in place to cut that off, just one. Full and on the off stump to Kohli, who drives to mid off and completes a quick single. Arshdeep to Mayank again. A bouncer around the middle-and-leg stump line, too high and given a wide. On the pads on the fifth delivery, clips to midwicket, no run.SIX!In the slot, and gets the treatment, Mayank clears his front foot and whacks this down the ground. June 03, 2025 19:37WRCB 19/1 in 2 oversKyle Jamieson to Virat Kohli, back of a length outside off, Kohli punches to deep point for one. Jamieson to Salt,FOUR!A length ball that swing into the batter, hoists it over mid on.A dot ball, another one swinging in, this is slightly shorter, gets Salt’s inside egde and hits his pad.WICKET!Salt goes for another heave over the on side, gets it off the toe end, comes off the toe end, Shreyas Iyer tracks back from mid on and grabs this.Phil Salt c Shreyas b Jamieson 16(9)Mayank Agarwal starts with a jab outside off, misses. Edge off the final delivery, falls short of Priyansh Arya at first slip, one run. Kyle Jamieson to Virat Kohli, back of a length outside off, Kohli punches to deep point for one. Jamieson to Salt,FOUR!A length ball that swing into the batter, hoists it over mid on. A dot ball, another one swinging in, this is slightly shorter, gets Salt’s inside egde and hits his pad.WICKET!Salt goes for another heave over the on side, gets it off the toe end, comes off the toe end, Shreyas Iyer tracks back from mid on and grabs this. Phil Salt c Shreyas b Jamieson 16(9) Mayank Agarwal starts with a jab outside off, misses. Edge off the final delivery, falls short of Priyansh Arya at first slip, one run. Kyle Jamieson to Virat Kohli, back of a length outside off, Kohli punches to deep point for one. Jamieson to Salt,FOUR!A length ball that swing into the batter, hoists it over mid on. A dot ball, another one swinging in, this is slightly shorter, gets Salt’s inside egde and hits his pad.WICKET!Salt goes for another heave over the on side, gets it off the toe end, comes off the toe end, Shreyas Iyer tracks back from mid on and grabs this. Phil Salt c Shreyas b Jamieson 16(9) Mayank Agarwal starts with a jab outside off, misses. Edge off the final delivery, falls short of Priyansh Arya at first slip, one run. June 03, 2025 19:316RCB 13/0 in 1 overArshdeep Singh with the new ball. Salt on strike. Starts with a wide down leg. The first legitimate delivery shapes away to Salt, drives it to mid off, no run. The second is full and tails into the off stump, driven to short extra covers, no run.SIX!Slightly short and on the body to Salt, hooks it away just over fine leg. The fourth is on the pads, Arshdeep misses the line again, Salt flicks to deep midwicket and runs two.FOUR now!Another wayward delivery, down leg and Salt swivels in a flash and sends this down to fine leg. A bouncer to end the over, Salt lets it fly to the keeper. Arshdeep Singh with the new ball. Salt on strike. Starts with a wide down leg. The first legitimate delivery shapes away to Salt, drives it to mid off, no run. The second is full and tails into the off stump, driven to short extra covers, no run. SIX!Slightly short and on the body to Salt, hooks it away just over fine leg. The fourth is on the pads, Arshdeep misses the line again, Salt flicks to deep midwicket and runs two. FOUR now!Another wayward delivery, down leg and Salt swivels in a flash and sends this down to fine leg. A bouncer to end the over, Salt lets it fly to the keeper. Arshdeep Singh with the new ball. Salt on strike. Starts with a wide down leg. The first legitimate delivery shapes away to Salt, drives it to mid off, no run. The second is full and tails into the off stump, driven to short extra covers, no run. SIX!Slightly short and on the body to Salt, hooks it away just over fine leg. The fourth is on the pads, Arshdeep misses the line again, Salt flicks to deep midwicket and runs two. FOUR now!Another wayward delivery, down leg and Salt swivels in a flash and sends this down to fine leg. A bouncer to end the over, Salt lets it fly to the keeper. June 03, 2025 19:30Kohli, Salt to open for RCBOut comes Virat Kohli, closely behind is Phil Salt. The pair that has worked so well for RCB this season will back itself to deliver in the big game too. Out comes Virat Kohli, closely behind is Phil Salt. The pair that has worked so well for RCB this season will back itself to deliver in the big game too. Out comes Virat Kohli, closely behind is Phil Salt. The pair that has worked so well for RCB this season will back itself to deliver in the big game too. June 03, 2025 19:28Time for the first ballThe National Anthem is complete. Time for the IPL 2025 Final to get underway. The National Anthem is complete. Time for the IPL 2025 Final to get underway. The National Anthem is complete. Time for the IPL 2025 Final to get underway. June 03, 2025 19:12Pitch reportSquare boundaries are 64 metres on either side. 72m down the ground. Looks like a belter of a wicket. It looks great, consistent and will be really flat. Don’t think 200 is enough on this wicket. Back of length and using those square boundaries will be key. This is a 25 percent black soil and 75 percent red soil surface. 6 of the 8 games here have been won by teams batting first here, reckon Murali Kartik and Michael Clarke. Square boundaries are 64 metres on either side. 72m down the ground. Looks like a belter of a wicket. It looks great, consistent and will be really flat. Don’t think 200 is enough on this wicket. Back of length and using those square boundaries will be key. This is a 25 percent black soil and 75 percent red soil surface. 6 of the 8 games here have been won by teams batting first here, reckon Murali Kartik and Michael Clarke. Square boundaries are 64 metres on either side. 72m down the ground. Looks like a belter of a wicket. It looks great, consistent and will be really flat. Don’t think 200 is enough on this wicket. Back of length and using those square boundaries will be key. This is a 25 percent black soil and 75 percent red soil surface. 6 of the 8 games here have been won by teams batting first here, reckon Murali Kartik and Michael Clarke. June 03, 2025 19:08Impact Player optionsRCB - Rasikh Salam, Manoj Bhandage, Tim Seifert, Swapnil Singh, Suyash SharmaPBKS - Prabhsimran Singh, Praveen Dubey, Suryansh Shedge, Xavier Bartlet, Harpreet Brar RCB - Rasikh Salam, Manoj Bhandage, Tim Seifert, Swapnil Singh, Suyash Sharma PBKS - Prabhsimran Singh, Praveen Dubey, Suryansh Shedge, Xavier Bartlet, Harpreet Brar RCB - Rasikh Salam, Manoj Bhandage, Tim Seifert, Swapnil Singh, Suyash Sharma PBKS - Prabhsimran Singh, Praveen Dubey, Suryansh Shedge, Xavier Bartlet, Harpreet Brar June 03, 2025 19:05Playing XIsRoyal Challengers Bengaluru: Philip Salt, Virat Kohli, Mayank Agarawal, Rajat Patidar(c), Liam Livingstone, Jitesh Sharma(w), Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Yash Dayal, Josh HazlewoodPunjab Kings: Priyansh Arya, Josh Inglis(w), Shreyas Iyer(c), Nehal Wadhera, Shashank Singh, Marcus Stoinis, Azmatullah Omarzai, Kyle Jamieson, Vijaykumar Vyshak, Arshdeep Singh, Yuzvendra Chahal Royal Challengers Bengaluru: Philip Salt, Virat Kohli, Mayank Agarawal, Rajat Patidar(c), Liam Livingstone, Jitesh Sharma(w), Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Yash Dayal, Josh Hazlewood Punjab Kings: Priyansh Arya, Josh Inglis(w), Shreyas Iyer(c), Nehal Wadhera, Shashank Singh, Marcus Stoinis, Azmatullah Omarzai, Kyle Jamieson, Vijaykumar Vyshak, Arshdeep Singh, Yuzvendra Chahal Royal Challengers Bengaluru: Philip Salt, Virat Kohli, Mayank Agarawal, Rajat Patidar(c), Liam Livingstone, Jitesh Sharma(w), Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Yash Dayal, Josh Hazlewood Punjab Kings: Priyansh Arya, Josh Inglis(w), Shreyas Iyer(c), Nehal Wadhera, Shashank Singh, Marcus Stoinis, Azmatullah Omarzai, Kyle Jamieson, Vijaykumar Vyshak, Arshdeep Singh, Yuzvendra Chahal June 03, 2025 19:01Toss - PBKSShreyas Iyer calls tails and Punjab Kings has won the toss. PBKS will bowl first.“Not just another game. It’s a big final. Going to be a tremendous feeling,” says Iyer. Punjab Kings will play the same team.Rajat Patidar says he too wanted to bowl first. “Just another game for us, we will try give our best,” Patidar says. RCB is also going with the same team. Shreyas Iyer calls tails and Punjab Kings has won the toss. PBKS will bowl first. “Not just another game. It’s a big final. Going to be a tremendous feeling,” says Iyer. Punjab Kings will play the same team. Rajat Patidar says he too wanted to bowl first. “Just another game for us, we will try give our best,” Patidar says. RCB is also going with the same team. Shreyas Iyer calls tails and Punjab Kings has won the toss. PBKS will bowl first. “Not just another game. It’s a big final. Going to be a tremendous feeling,” says Iyer. Punjab Kings will play the same team. Rajat Patidar says he too wanted to bowl first. “Just another game for us, we will try give our best,” Patidar says. RCB is also going with the same team. June 03, 2025 18:36Hopeful for a timely startNo rain, clear skies. Hoping for timely start, says on ground reporter Ashwin Achal No rain, clear skies. Hoping for timely start, says on ground reporter Ashwin Achal No rain, clear skies. Hoping for timely start, says on ground reporter Ashwin Achal June 03, 2025 18:32UpdateThe closing ceremony is underway at the Narendra Modi Stadium. The closing ceremony is underway at the Narendra Modi Stadium. The closing ceremony is underway at the Narendra Modi Stadium. June 03, 2025 18:28Latest weather updateIt is overcast in Ahmedabad but not raining. It is overcast in Ahmedabad but not raining. It is overcast in Ahmedabad but not raining. June 03, 2025 18:19RCB vs PBKS H2H recordMatches played: 36RCB won: 18PBKS won: 18 Matches played: 36 RCB won: 18 PBKS won: 18 Matches played: 36 RCB won: 18 PBKS won: 18 June 03, 2025 17:49Only two players have scored a century in an IPL FinalWill we see another century in a final?Full list of players to hit century in Indian Premier League final ahead of RCB vs PBKS IPL 2025 summit clashRCB vs PBKS, IPL 2025 Final: There have only been two instances of a player scoring a hundred in an IPL final. Here are the two. Will we see another century in a final? **Full list of players to hit century in Indian Premier League final ahead of RCB vs PBKS IPL 2025 summit clash** RCB vs PBKS, IPL 2025 Final: There have only been two instances of a player scoring a hundred in an IPL final. Here are the two. Will we see another century in a final? **Full list of players to hit century in Indian Premier League final ahead of RCB vs PBKS IPL 2025 summit clash** RCB vs PBKS, IPL 2025 Final: There have only been two instances of a player scoring a hundred in an IPL final. Here are the two. June 03, 2025 17:41Dream11 PredictionWICKETKEEPERSJosh InglisBATTERSShreyas Iyer (c), Virat Kohli, Priyansh Arya, Rajat Patidar (vc), Nehal WadheraALL-ROUNDERSMarcus Stoinis, Azmatullah OmarzaiBOWLERSJosh Hazlewood, Arshdeep Singh, Yuzvendra ChahalTeam Composition: RCB 3-8 PBKS | Credits Left: 11 WICKETKEEPERS Josh Inglis BATTERS Shreyas Iyer (c), Virat Kohli, Priyansh Arya, Rajat Patidar (vc), Nehal Wadhera ALL-ROUNDERS Marcus Stoinis, Azmatullah Omarzai BOWLERS Josh Hazlewood, Arshdeep Singh, Yuzvendra Chahal Team Composition: RCB 3-8 PBKS | Credits Left: 11 WICKETKEEPERS Josh Inglis BATTERS Shreyas Iyer (c), Virat Kohli, Priyansh Arya, Rajat Patidar (vc), Nehal Wadhera ALL-ROUNDERS Marcus Stoinis, Azmatullah Omarzai BOWLERS Josh Hazlewood, Arshdeep Singh, Yuzvendra Chahal Team Composition: RCB 3-8 PBKS | Credits Left: 11 June 03, 2025 17:37What to expect from the pitchThe pitch in Ahmedabad has favoured batters this season. The average first-innings score is 219, with teams scoring 200 or more in 11 out of 16 innings. While sides batting first have won six of the eight matches played here in 2025, PBKS’s successful chase in the second Qualifier has shown that chasing remains a viable option.PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult.In terms of bowling, spinners have had marginally better returns. Pacers have taken 65 wickets at an average of 35 and an economy rate of 10, while spinners have claimed 29 wickets at an average of 31, with an economy just under 10. The pitch in Ahmedabad has favoured batters this season. The average first-innings score is 219, with teams scoring 200 or more in 11 out of 16 innings. While sides batting first have won six of the eight matches played here in 2025, PBKS’s successful chase in the second Qualifier has shown that chasing remains a viable option. PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult. In terms of bowling, spinners have had marginally better returns. Pacers have taken 65 wickets at an average of 35 and an economy rate of 10, while spinners have claimed 29 wickets at an average of 31, with an economy just under 10. The pitch in Ahmedabad has favoured batters this season. The average first-innings score is 219, with teams scoring 200 or more in 11 out of 16 innings. While sides batting first have won six of the eight matches played here in 2025, PBKS’s successful chase in the second Qualifier has shown that chasing remains a viable option. PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult. In terms of bowling, spinners have had marginally better returns. Pacers have taken 65 wickets at an average of 35 and an economy rate of 10, while spinners have claimed 29 wickets at an average of 31, with an economy just under 10. June 03, 2025 17:34Toss factor at AhmedabadMatches: 44Won the toss and chose to bat: 12 (5W; 7L)Won the toss and chose to field: 32 (15W; 16L, 1T) Matches: 44 Won the toss and chose to bat: 12 (5W; 7L) Won the toss and chose to field: 32 (15W; 16L, 1T) Matches: 44 Won the toss and chose to bat: 12 (5W; 7L) Won the toss and chose to field: 32 (15W; 16L, 1T) June 03, 2025 17:29Ahmedabad LIVE weather updatesAhmedabad Weather Forecast LIVE today, IPL 2025 final: Rain threatens to delay RCB vs PBKS tossFollow for all weather updates from Ahmedabad, with rain threatening to disrupt the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final. **Ahmedabad Weather Forecast LIVE today, IPL 2025 final: Rain threatens to delay RCB vs PBKS toss** Follow for all weather updates from Ahmedabad, with rain threatening to disrupt the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final. **Ahmedabad Weather Forecast LIVE today, IPL 2025 final: Rain threatens to delay RCB vs PBKS toss** Follow for all weather updates from Ahmedabad, with rain threatening to disrupt the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final. June 03, 2025 17:26IPL match stats at Narendra Modi StadiumMatches: 44Batting first won: 21Batting second won: 22Tied: 1Highest score: Punjab Kings 243/5 vs Gujarat Titans (2025)Lowest score: Gujarat Titans 87 (17.3) vs Delhi Capitals (2024)Highest target chased: Kolkata Knight Riders 207/7 [T: 205] vs Gujarat Titans (2023)Lowest total defended: Delhi Capitals 130/8 vs Gujarat Titans (2023) Matches: 44 Batting first won: 21 Batting second won: 22 Tied: 1 Highest score: Punjab Kings 243/5 vs Gujarat Titans (2025) Lowest score: Gujarat Titans 87 (17.3) vs Delhi Capitals (2024) Highest target chased: Kolkata Knight Riders 207/7 [T: 205] vs Gujarat Titans (2023) Lowest total defended: Delhi Capitals 130/8 vs Gujarat Titans (2023) Matches: 44 Batting first won: 21 Batting second won: 22 Tied: 1 Highest score: Punjab Kings 243/5 vs Gujarat Titans (2025) Lowest score: Gujarat Titans 87 (17.3) vs Delhi Capitals (2024) Highest target chased: Kolkata Knight Riders 207/7 [T: 205] vs Gujarat Titans (2023) Lowest total defended: Delhi Capitals 130/8 vs Gujarat Titans (2023) June 03, 2025 17:16Good images coming from AhmedabadWhatsApp Image 2025-06-03 at 5.13.58 PM.jpegCredit: Vijay Soneji WhatsApp Image 2025-06-03 at 5.13.58 PM.jpeg Credit: Vijay Soneji WhatsApp Image 2025-06-03 at 5.13.58 PM.jpeg Credit: Vijay Soneji June 03, 2025 17:06Live visuals from the groundWhatsApp Image 2025-06-03 at 4.50.23 PM.jpegCredit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.50.23 PM.jpeg Credit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.50.23 PM.jpeg Credit: Vijay Soneji June 03, 2025 17:05Advantage for PBKS at Narendra Modi Stadium?`PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult.PBKS won both those games, beating Gujarat Titans and Mumbai Indians. PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult. PBKS won both those games, beating Gujarat Titans and Mumbai Indians. PBKS may hold a slight advantage, having already played twice at the venue this season. In contrast, RCB’s last outing here was back in 2024, which could make assessing conditions more difficult. PBKS won both those games, beating Gujarat Titans and Mumbai Indians. June 03, 2025 16:54Here’s how the two teams have fared at the Narendra Modi StadiumRCBPlayed: 5 | Won: 2 | Lost: 3PBKSPlayed: 6 | Won: 4 | Lost: 2 RCB Played: 5 | Won: 2 | Lost: 3 PBKS Played: 6 | Won: 4 | Lost: 2 RCB Played: 5 | Won: 2 | Lost: 3 PBKS Played: 6 | Won: 4 | Lost: 2 June 03, 2025 16:38PBKS in IPL Finals2014: lost to Kolkata Knight Riders by 3 wickets 2014: lost to Kolkata Knight Riders by 3 wickets 2014: lost to Kolkata Knight Riders by 3 wickets June 03, 2025 16:36Rain stays away but skies overcast in AhmedabadWhatsApp Image 2025-06-03 at 4.32.19 PM.jpegCredit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.32.19 PM.jpeg Credit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.32.19 PM.jpeg Credit: Vijay Soneji June 03, 2025 16:33RCB in IPL Finals2009: lost to Deccan Chargers by 6 runs2011: lost to Chennai Super Kings by 58 runs2016: lost to Sunrisers Hyderabad by 8 runs 2009: lost to Deccan Chargers by 6 runs 2011: lost to Chennai Super Kings by 58 runs 2016: lost to Sunrisers Hyderabad by 8 runs 2009: lost to Deccan Chargers by 6 runs 2011: lost to Chennai Super Kings by 58 runs 2016: lost to Sunrisers Hyderabad by 8 runs June 03, 2025 16:25RCB vs PBKS at Narendra Modi StadiumThis will be the second meeting between RCB and PBKS at the Narendra Modi Stadium; the last encounter at the venue was in 2021, when PBKS defeated RCB by 34 runs. This will be the second meeting between RCB and PBKS at the Narendra Modi Stadium; the last encounter at the venue was in 2021, when PBKS defeated RCB by 34 runs. This will be the second meeting between RCB and PBKS at the Narendra Modi Stadium; the last encounter at the venue was in 2021, when PBKS defeated RCB by 34 runs. June 03, 2025 16:22The job is not yet done for Shreyas IyerPBKS vs RCB, IPL 2025 Final: For Shreyas Iyer, job is only half doneAfter securing the win against Mumbai Indians in the IPL Qualifier 2 in Ahmedabad on Sunday, Punjab Kings captain Shreyas Iyer walked off without much celebration. Shreyas, who played out of his skin to guide PBKS home, shifted his focus immediately to the next task - the grand final on Tuesday. **PBKS vs RCB, IPL 2025 Final: For Shreyas Iyer, job is only half done** After securing the win against Mumbai Indians in the IPL Qualifier 2 in Ahmedabad on Sunday, Punjab Kings captain Shreyas Iyer walked off without much celebration. Shreyas, who played out of his skin to guide PBKS home, shifted his focus immediately to the next task - the grand final on Tuesday. **PBKS vs RCB, IPL 2025 Final: For Shreyas Iyer, job is only half done** After securing the win against Mumbai Indians in the IPL Qualifier 2 in Ahmedabad on Sunday, Punjab Kings captain Shreyas Iyer walked off without much celebration. Shreyas, who played out of his skin to guide PBKS home, shifted his focus immediately to the next task - the grand final on Tuesday. June 03, 2025 16:16Raining in AhmedabadSportstar’s correspondent, Shayan Acharya, pings a piece of information most cricket fans would not want to hear today. “It’s raining in Ahmedabad,” he says. Sportstar’s correspondent, Shayan Acharya, pings a piece of information most cricket fans would not want to hear today. “It’s raining in Ahmedabad,” he says. Sportstar’s correspondent, Shayan Acharya, pings a piece of information most cricket fans would not want to hear today. “It’s raining in Ahmedabad,” he says. June 03, 2025 16:13Rain threat looms over IPL FinalWhatsApp Image 2025-06-03 at 4.12.00 PM.jpegCredit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.12.00 PM.jpeg Credit: Vijay Soneji WhatsApp Image 2025-06-03 at 4.12.00 PM.jpeg Credit: Vijay Soneji June 03, 2025 16:10For Rajat Patidar, it’s all about staying in the presentRajat Patidar led RCB to the final in his first season as captain. But the daunting task of clearing the final hurdle does not bother him.PBKS vs RCB, IPL 2025 Final: Rajat Patidar staying in present despite high expectationsRoyal Challengers Bengaluru fans are a patient and loyal lot. 17 IPL editions have gone without the ultimate prize, but the support base has remained hopeful and enthusiastic. Rajat Patidar led RCB to the final in his first season as captain. But the daunting task of clearing the final hurdle does not bother him. **PBKS vs RCB, IPL 2025 Final: Rajat Patidar staying in present despite high expectations** Royal Challengers Bengaluru fans are a patient and loyal lot. 17 IPL editions have gone without the ultimate prize, but the support base has remained hopeful and enthusiastic. Rajat Patidar led RCB to the final in his first season as captain. But the daunting task of clearing the final hurdle does not bother him. **PBKS vs RCB, IPL 2025 Final: Rajat Patidar staying in present despite high expectations** Royal Challengers Bengaluru fans are a patient and loyal lot. 17 IPL editions have gone without the ultimate prize, but the support base has remained hopeful and enthusiastic. June 03, 2025 16:06RCB vs PBKS head-to-head record in IPLMatches played: 36RCB won: 18PBKS won: 18Last result: Royal Challengers Bengaluru won by eight wickets (May, 2025) Matches played: 36 RCB won: 18 PBKS won: 18 Last result: Royal Challengers Bengaluru won by eight wickets (May, 2025) Matches played: 36 RCB won: 18 PBKS won: 18 Last result: Royal Challengers Bengaluru won by eight wickets (May, 2025) June 03, 2025 16:04RCB holds the edge in IPL 2025The two sides have played three times this season, and RCB has won two of those while PBKS secured a win at the M. Chinnaswamy Stadium. The two sides have played three times this season, and RCB has won two of those while PBKS secured a win at the M. Chinnaswamy Stadium. The two sides have played three times this season, and RCB has won two of those while PBKS secured a win at the M. Chinnaswamy Stadium. June 03, 2025 15:59RCB predicted playing XIBatting 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Mayank Agarwal, Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal.Bowling 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal, Suyash Sharma.Impact Player options:Suyash Sharma/Mayank Agarwal, Swastik Chikara, Swapnil Singh, Mohit Rathee. Batting 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Mayank Agarwal, Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal. Bowling 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal, Suyash Sharma. Impact Player options:Suyash Sharma/Mayank Agarwal, Swastik Chikara, Swapnil Singh, Mohit Rathee. Batting 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Mayank Agarwal, Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal. Bowling 1st:Phil Salt, Virat Kohli, Rajat Patidar (c), Jitesh Sharma (wk), Tim David, Romario Shepherd, Krunal Pandya, Bhuvneshwar Kumar, Josh Hazlewood, Yash Dayal, Suyash Sharma. Impact Player options:Suyash Sharma/Mayank Agarwal, Swastik Chikara, Swapnil Singh, Mohit Rathee. June 03, 2025 15:54PBKS predicted playing XIBatting 1st:Priyansh Arya, Prabhsimran Singh, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Marcus Stoinis, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson.Bowling 1st:Priyansh Arya, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Azmatullah Omarzai, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson, Yuzvendra Chahal.Impact Player Options:Prabhsimran Singh/Yuzvendra Chahal, Vijaykumar Vyshak, Azmatullah Omarzai, Yash Thakur, Pravin Dubey. Batting 1st:Priyansh Arya, Prabhsimran Singh, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Marcus Stoinis, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson. Bowling 1st:Priyansh Arya, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Azmatullah Omarzai, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson, Yuzvendra Chahal. Impact Player Options:Prabhsimran Singh/Yuzvendra Chahal, Vijaykumar Vyshak, Azmatullah Omarzai, Yash Thakur, Pravin Dubey. Batting 1st:Priyansh Arya, Prabhsimran Singh, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Marcus Stoinis, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson. Bowling 1st:Priyansh Arya, Shreyas Iyer (c), Josh Inglis (wk), Nehal Wadhera, Azmatullah Omarzai, Shashank Singh, Azmatullah Omarzai, Harpreet Brar, Arshdeep Singh, Kyle Jamieson, Yuzvendra Chahal. Impact Player Options:Prabhsimran Singh/Yuzvendra Chahal, Vijaykumar Vyshak, Azmatullah Omarzai, Yash Thakur, Pravin Dubey. June 03, 2025 15:45Match PreviewIPL 2025 Final: History beckons as Punjab Kings, Royal Challengers Bengaluru eye maiden titleHistory beckons as Royal Challengers Bengaluru and Punjab Kings attempt to break new ground in Ahmedabad on Tuesday. **IPL 2025 Final: History beckons as Punjab Kings, Royal Challengers Bengaluru eye maiden title** History beckons as Royal Challengers Bengaluru and Punjab Kings attempt to break new ground in Ahmedabad on Tuesday. **IPL 2025 Final: History beckons as Punjab Kings, Royal Challengers Bengaluru eye maiden title** History beckons as Royal Challengers Bengaluru and Punjab Kings attempt to break new ground in Ahmedabad on Tuesday. June 03, 2025 15:42SquadsRoyal Challengers Bengaluru:Rajat Patidar (c), Virat Kohli, Yash Dayal, Josh Hazlewood, Phil Salt, Jitesh Sharma, Liam Livingstone, Rasikh Dar, Suyash Sharma, Krunal Pandya, Bhuvneshwar Kumar, Swapnil Singh, Tim David, Romario Shepherd, Nuwan Thushara, Manoj Bhandage, Jacob Bethel, Mayank Agarwal, Swastik Chhikara, Lungi Ngidi, Abhinandan Singh, Mohit Rathee.Punjab Kings: Shreyas Iyer (c), Yuzvendra Chahal, Arshdeep Singh, Marcus Stoinis, Shashank Singh, Prabhsimran Singh, Harpreet Brar, Vijaykumar Vyshak, Yash Thakur, Josh Inglis, Azmatullah Omarzai, Harnoor Pannu, Kuldeep Sen, Priyansh Arya, Aaron Hardie, Musheer Khan, Suryansh Shedge, Xavier Bartlett, Pyla Avinash, Pravin Dubey, Nehal Wadhera, Mitchell Owen, Kyle Jamieson, Vishnu Vinod. Royal Challengers Bengaluru:Rajat Patidar (c), Virat Kohli, Yash Dayal, Josh Hazlewood, Phil Salt, Jitesh Sharma, Liam Livingstone, Rasikh Dar, Suyash Sharma, Krunal Pandya, Bhuvneshwar Kumar, Swapnil Singh, Tim David, Romario Shepherd, Nuwan Thushara, Manoj Bhandage, Jacob Bethel, Mayank Agarwal, Swastik Chhikara, Lungi Ngidi, Abhinandan Singh, Mohit Rathee. Punjab Kings: Shreyas Iyer (c), Yuzvendra Chahal, Arshdeep Singh, Marcus Stoinis, Shashank Singh, Prabhsimran Singh, Harpreet Brar, Vijaykumar Vyshak, Yash Thakur, Josh Inglis, Azmatullah Omarzai, Harnoor Pannu, Kuldeep Sen, Priyansh Arya, Aaron Hardie, Musheer Khan, Suryansh Shedge, Xavier Bartlett, Pyla Avinash, Pravin Dubey, Nehal Wadhera, Mitchell Owen, Kyle Jamieson, Vishnu Vinod. Royal Challengers Bengaluru:Rajat Patidar (c), Virat Kohli, Yash Dayal, Josh Hazlewood, Phil Salt, Jitesh Sharma, Liam Livingstone, Rasikh Dar, Suyash Sharma, Krunal Pandya, Bhuvneshwar Kumar, Swapnil Singh, Tim David, Romario Shepherd, Nuwan Thushara, Manoj Bhandage, Jacob Bethel, Mayank Agarwal, Swastik Chhikara, Lungi Ngidi, Abhinandan Singh, Mohit Rathee. Punjab Kings: Shreyas Iyer (c), Yuzvendra Chahal, Arshdeep Singh, Marcus Stoinis, Shashank Singh, Prabhsimran Singh, Harpreet Brar, Vijaykumar Vyshak, Yash Thakur, Josh Inglis, Azmatullah Omarzai, Harnoor Pannu, Kuldeep Sen, Priyansh Arya, Aaron Hardie, Musheer Khan, Suryansh Shedge, Xavier Bartlett, Pyla Avinash, Pravin Dubey, Nehal Wadhera, Mitchell Owen, Kyle Jamieson, Vishnu Vinod. June 03, 2025 15:37Live Streaming InfoAt what time will the Royal Challengers Bengaluru vs Punjab Kings IPL final start?The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will start at 7:30 PM IST.At what time will the toss for the Royal Challengers Bengaluru vs Punjab Kings IPL final take place?The toss for the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will take place at 7:00 PM IST.Which TV channel will broadcast the Royal Challengers Bengaluru vs Punjab Kings IPL final?The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be televised live on theStar SportsNetworkin India.How can one watch the live streaming of Royal Challengers Bengaluru vs Punjab Kings IPL final online?The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be streamed live on theJioHotstarapp and website. At what time will the Royal Challengers Bengaluru vs Punjab Kings IPL final start? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will start at 7:30 PM IST. At what time will the toss for the Royal Challengers Bengaluru vs Punjab Kings IPL final take place? The toss for the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will take place at 7:00 PM IST. Which TV channel will broadcast the Royal Challengers Bengaluru vs Punjab Kings IPL final? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be televised live on theStar SportsNetworkin India. How can one watch the live streaming of Royal Challengers Bengaluru vs Punjab Kings IPL final online? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be streamed live on theJioHotstarapp and website. At what time will the Royal Challengers Bengaluru vs Punjab Kings IPL final start? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will start at 7:30 PM IST. At what time will the toss for the Royal Challengers Bengaluru vs Punjab Kings IPL final take place? The toss for the Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will take place at 7:00 PM IST. Which TV channel will broadcast the Royal Challengers Bengaluru vs Punjab Kings IPL final? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be televised live on theStar SportsNetworkin India. How can one watch the live streaming of Royal Challengers Bengaluru vs Punjab Kings IPL final online? The Royal Challengers Bengaluru vs Punjab Kings IPL 2025 final will be streamed live on theJioHotstarapp and website. June 03, 2025 15:33One team will end its title droughtAfter 18 seasons without a taste of silverware, either Punjab Kings or Royal Challengers Bengaluru will end its wait for the coveted IPL trophy. RCB has been at this stage thrice, losing the final in 2009, 2011, and 2016. For PBKS, this will be its second shot at the elusive trophy, and its first since 2014. After 18 seasons without a taste of silverware, either Punjab Kings or Royal Challengers Bengaluru will end its wait for the coveted IPL trophy. RCB has been at this stage thrice, losing the final in 2009, 2011, and 2016. For PBKS, this will be its second shot at the elusive trophy, and its first since 2014. After 18 seasons without a taste of silverware, either Punjab Kings or Royal Challengers Bengaluru will end its wait for the coveted IPL trophy. RCB has been at this stage thrice, losing the final in 2009, 2011, and 2016. For PBKS, this will be its second shot at the elusive trophy, and its first since 2014. Comments **Related Topics** IPL 2025/ Punjab Kings/ Royal Challengers Bengaluru **Latest on Sportstar** Ahmedabad Weather Forecast, IPL 2025 final: No rain ahead of RCB vs PBKS tossTeam Sportstar IPL: Orange Cap winners list in Indian Premier League from 2008 to 2025; Sai Sudharsan joins elite batting groupTeam Sportstar IPL 2025: Sai Sudharsan wins Emerging Player of the Year awardTeam Sportstar **Off-side: Remembering Brian Glanville, India’s window to the beautiful game** **EXCLUSIVE — Ravi Shastri: Virat is the most influential cricketer of the last decade** **More on IPL News** RCB vs PBKS IPL Final: Bowlers’ efforts secure maiden title for Royal Challengers BengaluruAshwin Achal IPL 2025 Prize money: All you need to know about how much money RCB receivedTeam Sportstar IPL 2025: Full list of Player of the Tournament (MVP) winners from 2008Team Sportstar **Latest on Sportstar** Ahmedabad Weather Forecast, IPL 2025 final: No rain ahead of RCB vs PBKS tossTeam Sportstar IPL: Orange Cap winners list in Indian Premier League from 2008 to 2025; Sai Sudharsan joins elite batting groupTeam Sportstar IPL 2025: Sai Sudharsan wins Emerging Player of the Year awardTeam Sportstar SportstarAbout usArchivesNews ArchiveSitemapPrint SubscriptionDigital SubscriptionStudent AccessCorporate/Enterprise AccessRss FeedsContact UsCareers About us Archives News Archive Sitemap Print Subscription Digital Subscription Student Access Corporate/Enterprise Access Rss Feeds Contact Us Careers About us Archives News Archive Sitemap Print Subscription Digital Subscription Student Access Corporate/Enterprise Access Rss Feeds Contact Us Careers Group News SitesThe HinduBusiness LIneFrontlineஇந்து தமிழ் திசைThe Hindu Centre for Politics and Public PolicyYoung World ClubThe Hindu E-PaperBusinessLine E-PaperCrossword+ \"Free Games\" The Hindu Business LIne Frontline இந்து தமிழ் திசை The Hindu Centre for Politics and Public Policy Young World Club The Hindu E-Paper BusinessLine E-Paper Crossword+ \"Free Games\" The Hindu Business LIne Frontline இந்து தமிழ் திசை The Hindu Centre for Politics and Public Policy Young World Club The Hindu E-Paper BusinessLine E-Paper Crossword+ \"Free Games\" Other ProductsSTEPImagesClassifieds - PrintSpecial Publications STEP Images Classifieds - Print Special Publications STEP Images Classifieds - Print Special Publications Popular SectionsCricket World Cup 2023IPL 2024CricketFootballTennisWTCF1Basketball Cricket World Cup 2023 IPL 2024 Cricket Football Tennis WTC F1 Basketball Cricket World Cup 2023 IPL 2024 Cricket Football Tennis WTC F1 Basketball RCB vs PBKS Live, IPL 2025 Final IPL 2025 Cricket Chess Football News Stock Market Today Hexaware Share Price RBI MPC Meet 2025 Business News Live Delhi election LIVE BJP is back to its favourite bogey Explore Frontline Packages Stock Market Top Gainers Today Gold Rate Today Silver Rate Today TERMS OF USE PRIVACY POLICY BACK TO TOP Get notified on top games and events Save stories to read later Access to comment on every story Sign up / manage to our newsletters with a single click Get notified by email for early bird access to discounts & offers to our products Log out Terms & conditions|Institutional Subscriber **Comments** Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide to our communityguidelinesfor posting your comment"}