{"id": 545, "name": "Frontiers in Electronic Materials", "domain": "frontiersin.org/journals/electronic-materials", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/electronic-materials/articles/10.3389/femat.2025.1572940/full", "title": "Electronic Materials", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Dielectric and Ferroelectric Materials Optoelectronic Materials Piezoelectric Materials Semiconducting Materials and Devices Superconducting Materials Thermoelectric Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Dielectric and Ferroelectric Materials Optoelectronic Materials Piezoelectric Materials Semiconducting Materials and Devices Superconducting Materials Thermoelectric Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Dielectric and Ferroelectric Materials Optoelectronic Materials Piezoelectric Materials Semiconducting Materials and Devices Superconducting Materials Thermoelectric Materials Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Electron. Mater Sec. Superconducting Materials Volume 5 - 2025 |doi: 10.3389/femat.2025.1572940 This article is part of the Research TopicUnveiling Strongly Correlated Materials with Resonant Inelastic X-ray ScatteringView all 4 articles **Characterizing sample degradation from synchrotron based X-ray measurements of ultra-thin exfoliated flakes** 1Brown University, Providence, United States 2Columbia University, New York City, New York, United States 3Technical University of Denmark, Kongens Lyngby, Denmark 4National Synchrotron Light Source II, Brookhaven National Laboratory (DOE), Upton, New York, United States 5Boston College, Chestnut Hill, Massachusetts, United States The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here It is undeniable that novel 2D devices and heterostructures will have a lasting impact on the advancement of future technologies. However, the inherent instability of many exfoliated van der Waals (vdW) materials is a well-known hurdle yet to be overcome. Thus, the sustained interest in exfoliated vdW materials underscores the importance of understanding the mechanisms of sample degradation to establish proactive protective measures. Here, the impact of prolonged synchrotronbased X-ray beam exposure on exfoliated flakes of two contemporary vdW materials, NiPS3 and α-RuCl3, is explored using resonant inelastic X-ray scattering (RIXS) and total fluorescence yield X-ray absorption spectroscopy (XAS). In NiPS3, the resulting RIXS and XAS spectra show a suppression, then vanishing, of NiS6 multiplet excitations coupled with an upward shift of the peak energy of the XAS as a function of X-ray dose. In α-RuCl3, the signs of beam damage from the RIXS spectra are less evident. However, the post-experiment characterization of both materials using Raman spectroscopy exhibits signals of an amorphous and disordered system compared to pristine flakes; in addition, energy-dispersive X-ray spectroscopy of NiPS3 shows evidence of ligand vacancies. As synchrotron radiation is fast becoming a required probe to study 2D vdW materials, these findings lay the groundwork for the development of future protective measures for synchrotronbased prolonged X-ray beam exposure, as well as for X-ray free electron laser. Keywords:resonant inelastic soft X-ray scattering (RIXS), 2D magnetism, Magnetism - prospects, van der Waals (vdW), NiPS3, RuCl3, Graphene Received:07 Feb 2025;Accepted:14 May 2025. Copyright:© 2025DiScala, Jessen, Hsieh, Gu, Rizzo, Amontree, Yan, Wang, Kapfer, Kim, Geiwitz, Natale, Pelliciari, Hone, Burch, Basov, Dean, Bisogni and Plumb. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Cory R. Dean, Columbia University, New York City, 10027, New York, United StatesValentina Bisogni, National Synchrotron Light Source II, Brookhaven National Laboratory (DOE), Upton, 11973-5000, New York, United StatesKemp W. Plumb, Brown University, Providence, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}