{"id": 1871, "name": "American Alliance for Equal Rights", "domain": "americanallianceforequalrights.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://americanallianceforequalrights.org/american-alliance-for-equal-rights-files-request-to-irs-to-examine-racial-practices-at-three-tax-exempt-foundations-gates-foundation-lagrant-foundation-and-creative-capital-foundation/", "title": "American Alliance For Equal Rights Files Request To Irs To Examine Racial Practices At Three Tax Exempt Foundations Gates Foundation Lagrant Foundation And Creative Capital Foundation", "content": "The American Alliance for Equal Rights **Become a Member** **Donate** Home About Our Cases Tell Us Your Story Newsroom The American Alliance for Equal Rights Home About Our Cases Tell Us Your Story Newsroom **American Alliance for Equal Rights Files Request to IRS to Examine Racial Practices at Three Tax-Exempt Foundations: Gates Foundation, Lagrant Foundation and Creative Capital Foundation** Apr 1, 2025|Blog Press Release: April 1, 2025 Contact: Edward Blum edwardjayblum@gmail.com 703-505-1922 **American Alliance for Equal Rights Files Request to IRS to Examine Racial Practices at Three Tax-Exempt Foundations: Gates Foundation, Lagrant Foundation and Creative Capital Foundation** AUSTIN, Texas,April 1, 2025/PRNewswire/ — Today, the American Alliance for Equal Rights (AAER) announced that it has formally requested the Internal Revenue Service (IRS) open investigations into the racially discriminatory practices of three prominent tax-exempt organizations: the Lagrant Foundation, the Gates Foundation, and the Creative Capital Foundation. In three separate letters sent to Mr. Robert Malone of the IRS’s Exempt Organizations and Government Entities division, AAER presents evidence that these nonprofits have engaged in practices that categorically exclude white Americans from benefits and opportunities based solely on race—practices that, AAER alleges, are incompatible with longstanding public policy and Supreme Court precedent governing tax-exempt status under 26 U.S.C. §501(c)(3). According to AAER’s letter, the Lagrant Foundation offers scholarships, mentorships, and career development opportunities exclusively to applicants who are African American/Black, Alaska Native/Native American, Asian American/Pacific Islander, or Hispanic/Latino. White students and professionals are excluded, in direct violation, the letter argues, of the Supreme Court’s decision in Bob Jones University v. United States, 461 U.S. 574 (1983), which held that organizations practicing racial discrimination are not eligible for tax-exempt status. AAER also challenges the Gates Foundation’s college funding initiative, the Gates Scholarship. The program provides full tuition, mentoring, and leadership development—but only to individuals who identify as racial or ethnic minorities, with white students ineligible to apply. The letter to the IRS notes that these practices contradict both the IRS’s own guidance and recent Supreme Court precedent from Students for Fair Admissions v. Harvard (2023), in which the justices reaffirmed that “racial discrimination is invidious in all contexts.” Finally, AAER asserts the Creative Capital Foundation’s “Creative Capital Forward Fund” provided up to $700,000 in grants and extensive career support solely to Asian, Black, Indigenous, and Latinx creators—explicitly excluding white artists. AAER’s letter asserts that this race-based exclusion also runs afoul of IRS rules and federal civil-rights laws. Across all three letters, AAER cites Bob Jones University v. United States, the IRS’s Exempt Organizations Technical Guide, and multiple executive orders issued by President Trump in early 2025—including Executive Order 14173, which explicitly directs federal agencies to eliminate private-sector programs that implement “race- and sex-based preferences.” AAER’s actions follow its broader mission to eliminate racial and ethnic distinctions from American law and public policy. Edward Blum, president of AAER said, “These organizations are free to operate as they wish—but not with the public subsidy that tax-exempt status provides. Racial discrimination—whether in scholarships, professional development, or artistic grants—violates public policy and must not be underwritten by American taxpayers.” Blum added, “Organizations that discriminate based on race—whether their intentions are benevolent or not—are not eligible for public subsidies through the tax code. The IRS must act to uphold the law.” The letters to the IRS are attached. The American Alliance for Equal Rights Home About Our Cases Tell Us Your Story Newsroom Contact Us"}