{"id": 762, "name": "KJRH - Tulsa News", "domain": "kjrh.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kjrh.com/science-and-tech/animals-and-insects/man-gored-by-bison-at-yellowstone-national-park-second-incident-this-year", "title": "Man Gored By Bison At Yellowstone National Park Second Incident This Year", "content": "Menu WeatherSevere Weather AlertsSevere WeatherClosing & DelaysHourly ForecastDaily ForecastAsk a MetWeather CamerasInteractive RadarWeather Maps Severe Weather Alerts Severe Weather Closing & Delays Hourly Forecast Daily Forecast Ask a Met Weather Cameras Interactive Radar Weather Maps Severe Weather Alerts Severe Weather Closing & Delays Hourly Forecast Daily Forecast Ask a Met Weather Cameras Interactive Radar Weather Maps VideosLive Video Live Video Live Video NewsAccountability30 Years Later: OKC BombingLocalNational/World Accountability 30 Years Later: OKC Bombing Local National/World Accountability 30 Years Later: OKC Bombing Local National/World Consumer Problem Solvers We're Listening Oklahoma’s Cold Case Files Project Safe SchoolsTPS Accreditation FightMental Health Resources TPS Accreditation Fight Mental Health Resources TPS Accreditation Fight Mental Health Resources Positively Oklahoma SportsPlayer of the Week AnnualThe Program Player of the Week Annual The Program Player of the Week Annual The Program TrafficGas Prices Gas Prices Gas Prices 2 News En Espanol 2 Cares for the Community Read 2 Lead EntertainmentTrending NowTV Listings Trending Now TV Listings Trending Now TV Listings LifestyleTulsa Living Tulsa Living Tulsa Living 2 Cares for Pets The Underdogs 2Day's HomePros About UsStaff70 Years in TVRemoving Content RequestContests Staff 70 Years in TV Removing Content Request Contests Staff 70 Years in TV Removing Content Request Contests Contact Us Sign In Newsletters Sign Out Manage Emails Apps Careers Search Local News Problem Solvers National News America Votes Contact Us **Actions** Facebook Tweet Email **Man gored by bison at Yellowstone National Park, second incident this year** A 30-year-old man from New Jersey was gored by a bison at Yellowstone National Park on June 10, according to National Park Officials. This is the second goring incident this year. The man was among a group of visitors at the park that approached the animal too closely, officials said. The incident happened around 9:45 a.m. in the Upper Geyser Basin at Old Faithful. Officials said the man was treated by local medics and his injuries were not life-threatening. The incident is still under investigation. RELATED STORY |Invasive Asian needle ants with potentially deadly sting spreading across multiple states Another individual, a 47-year-old Florida man, was gored by a bison on May 4 in the Lake Village area of the park. His injuries were also minor. On May 4, 2025, a 47-year-old man from Cape Coral, Florida, was injured by a bison in Yellowstone National Park. Officials said there were two reported goring incidents in 2024 and one in 2023. National Park Service officials said bison are territorial and have injured more people in Yellowstone than any other animal. \"They are unpredictable and can run three times faster than humans,\" officials said. Visitors are supposed to stay more than 25 yards away from all large animals — including bison, elk, bighorn sheep, deer, moose, and coyotes — and at least 100 yards away from bears, wolves and cougars. **Sign up for theDaily Headlinesand receive up to date information.** **now signed up to receive theDaily Headlines.** Traffic News Consumer Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact kjrhtv 2newsok 2worksforyou/ KJRH2HD"}