{"id": 2097, "name": "Permaculture Magazine", "domain": "permaculture.co.uk", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.permaculture.co.uk/articles/celebrating-activists-voices-permaculture-prize-for-projects-transforming-lives-and-landscapes/", "title": "Celebrating Activists Voices Permaculture Prize For Projects Transforming Lives And Landscapes", "content": "What is Permaculture? All ArticlesArticlesSolutionsReviewsVideos Articles Solutions Reviews Videos Articles Solutions Reviews Videos Magazine Issues Courses Classifieds Contribute Permaculture Magazine AwardPermaculture Magazine Award – JudgesSolutions from our Global RegeneratorsFunding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025Permaculture Magazine Award 2023 – shortlistGlobal Climate Change Solutions: Hope and inspiration from around the world (2022)Permaculture Magazine Award 2022Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020)£30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019)£25,000 Permaculture Magazine Prize Announces Winners (2018) Permaculture Magazine Award – Judges Solutions from our Global Regenerators Funding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025 Permaculture Magazine Award 2023 – shortlist Global Climate Change Solutions: Hope and inspiration from around the world (2022) Permaculture Magazine Award 2022 Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020) £30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019) £25,000 Permaculture Magazine Prize Announces Winners (2018) Permaculture Magazine Award – Judges Solutions from our Global Regenerators Funding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025 Permaculture Magazine Award 2023 – shortlist Global Climate Change Solutions: Hope and inspiration from around the world (2022) Permaculture Magazine Award 2022 Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020) £30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019) £25,000 Permaculture Magazine Prize Announces Winners (2018) Shop Subscribe **Topics** **Topics** What is Permaculture? All ArticlesArticlesSolutionsReviewsVideos Articles Solutions Reviews Videos Articles Solutions Reviews Videos Magazine Issues Courses Classifieds Contribute Permaculture Magazine AwardPermaculture Magazine Award – JudgesSolutions from our Global RegeneratorsFunding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025Permaculture Magazine Award 2023 – shortlistGlobal Climate Change Solutions: Hope and inspiration from around the world (2022)Permaculture Magazine Award 2022Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020)£30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019)£25,000 Permaculture Magazine Prize Announces Winners (2018) Permaculture Magazine Award – Judges Solutions from our Global Regenerators Funding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025 Permaculture Magazine Award 2023 – shortlist Global Climate Change Solutions: Hope and inspiration from around the world (2022) Permaculture Magazine Award 2022 Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020) £30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019) £25,000 Permaculture Magazine Prize Announces Winners (2018) Permaculture Magazine Award – Judges Solutions from our Global Regenerators Funding for Permaculture Projects and Regenerative Practitioners – how to apply for 2025 Permaculture Magazine Award 2023 – shortlist Global Climate Change Solutions: Hope and inspiration from around the world (2022) Permaculture Magazine Award 2022 Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020) £30,000 Permaculture Magazine Prize Celebrates Climate Change Solutions (2019) £25,000 Permaculture Magazine Prize Announces Winners (2018) Shop Subscribe **Celebrating Activists Voices: permaculture prize for projects transforming lives and landscapes (2020)** Permaculture Magazineare pleased to announce the winners and runners up of the 2020 Permaculture Magazine Prize. Now in its third year, the Permaculture Magazine Prize and Youth in Permaculture Prize are sharing a magnificent £25,000 between eight worldwide projects, which are regenerating landscapes and communities with natural farming techniques, permaculture methods and collaboration. **The Main Winner of £5,000** Guatemala’sContour Lines Corpfor its work in educating local farmers in regenerative farming methods, moving them away from highly destructive slash and burn agriculture to thriving local landscapes. Over 35 Q’echi villages were reliant on this method, but Contour Lines provided fruit trees, equipment and training to help transition communities towards resilient income streams. These farmers now grow diverse food forests with a wide range of crops to ensure greater food security, income and nutrition – whilst also creating wildlife habitat. The perennial tree systems are more resistant to droughts, strong winds and disease (which are becoming more frequent), enhancing the communities’ climate resilience. Sean Dixon-Sullivan and team heading up river to visit a potential new site ©Sean Dixon-Sullivan The four runners, who each receive £2,500, are: EcoHub (Sporos Regeneration Institute), a therapeutic, educational and integration-focused permaculture project in Lesvos, Greece. This project emerged from a need to heal trauma for locals and the fleeing Syrian refugees that arrived in 2015, with over a million to date. The EcoHub centre creates symbiotic relationships between locals and refugees, educates in regenerative growing practices and land stewardship. Locals and refugees learn how they can work together while creating healthy food systems for all.http://sporosinstitute.org Kilombo Tenodé, in the Atlantic Rainforest on the Eastern coastline of Valença in Brazil, brings permaculture and Afro-Brazilian perspectives together (named Permangola), educating locals and global visitors in community resilience, permaculture food growing techniques and the Afro-Brazilian art form of Capoeira Angola, originating from the descendants of African self-sustaining communities who hid in the jungle, opposing slavery and the colonial system. The onsite syntropic rainforest is an educational tool for visitors and local farmers, teaching the importance of crop diversity, rainwater harvesting techniques, waste management methods such as the banana circle, how to grow medicinal plants for consumption and profit and much more.www.kilombotenonde.net Friends of the Environmentin Northern Sierra Leone is working with the local community, especially children, to integrate the knowledge and need for sustainable farming methods. Until recently slash and burn was common place, drastically deforesting native forest. Five school-based clubs teach children about conservation and how to protect their environment, including permaculture ethics, how to regenerate forests, and food growing. This information is disseminated through families and the wider community, creating a culture that wants to protect the local landscape and work with it to create more resilient futures. An agroforestry nursery will help reforest the local area and classes in propagation, agroforestry and edible crops allow farmers to create their own sustainable incomes.www.facebook.com/Friends-of-the-Environment-11489275036846 Swayyamis in the southwest of India, on the borders of Karnataka and Bandipur Tiger Reserve, which is part of the largest protected area in southern India, supporting one of the biggest tiger populations in the world. It is home to over 200 villages around the periphery of the forest and climate change induced erratic weather has moved the traditional farming and cattle herding livelihoods towards dangerous ventures into the reserve, bringing with it wildlife conflict and risk of life. The number of farmers, cowherds and shepherds attacked by tigers, leopards, elephants and wild boars is constantly on the rise. Swayyam is a demonstration centre for local farmers, transforming a degraded and eroded landscape into a buzzing food and medicinal forest – an example of what can be done in the area. Their 1000 Tree Project is a rural initiative to increase forest cover, restore biodiversity and ensure food, fodder and livelihood security through regenerative practices.https://swayyam.org **Youth in Permaculture Prize** The Youth in Permaculture Prize is organised by Permaculture Magazine in partnership with Abundant Earth Foundation. The Prize of £10,000 is shared between three winners, with one Grand Prize winner of £5,000 and two runners up, each receiving £2,500. The Grand Prize winner isYar Dau Dengand theVijana Twaweza Club(VTC). Set up by refugee youths, they work to combat extreme poverty and environmental degradation in Kakuma Refugee Camp and Kalobeyei Settlement in Kenya. Sustainability and permaculture are at the core of everything VTC do, whether it is teaching sustainable growing techniques, enabling and empowering young girls to receive an education or creating examples of indigenous food ecosystem restoration. VTC are transforming landscapes, lives and people’s futures through education and nutritious food, creating sustainable livelihoods and communities in an incredibly tough landscape.www.facebook.com/VijanaTwawezaClub Runners up: Ola Tom Lakereworks withRefarmersand the Grandmother’s Kitchen Garden project in Uganda. The nutritious kitchen gardens bring food and sustainable livelihoods to the most vulnerable – the elderly, child mothers and child-headed families. The project has reached a wide audience through local media, and Ola is putting himself through a permaculture course to better understand food growing and nutrition. He is turning his home into a mini learning centre to pass on his permaculture knowledge to other young people, hoping these important tools will ripple into the wider community.https://refarmers.org/grandmothers-kitchen-garden-project Permayouthis a global initiative led by and for people around 11-16 years of age. It connects young people who are curious about positive solutions and passionate about the future of our planet. The monthly global festivals bring young people together from around the world, including Permayouth teams in refugee camps in Kenya and Uganda. The weekly Permayouth meet-ups online teach about permaculture, from gardening and natural dyes, to zero waste, ethics, and designing. These young people are stepping up to the challenge of climate change and learning how to use permaculture as the solutions to a better world.www.permayouth.org **Related Articles** **Further Resources** **DIY Self-watering Container Garden** **DIY Self-watering Container Garden** **Drying Herbs for Herbal Recipes with Glennie Kindred** **Drying Herbs for Herbal Recipes with Glennie Kindred** **How to Grow Your Own Mulch** **How to Grow Your Own Mulch** **Comfrey: Its History, Uses & Benefits** **Comfrey: Its History, Uses & Benefits** **The Many Benefits of Hugelkultur** **The Many Benefits of Hugelkultur** **Thistles: A Highly Nutritious and Medicinal Weed** **Thistles: A Highly Nutritious and Medicinal Weed** **Benefits of Common Mallow (Malva sylvestris)** **Benefits of Common Mallow (Malva sylvestris)** **Community Conservation – become a swift street** **Community Conservation – become a swift street** **Solutions from our Global Regenerators** **Solutions from our Global Regenerators** **While Politicians Wait, We Regenerate – inspiring stories from the changemakers** **While Politicians Wait, We Regenerate – inspiring stories from the changemakers** **How to Sharpen a Scythe** **How to Sharpen a Scythe** About UsThe TeamPrivacyContact UsRefunds The Team Privacy Contact Us Refunds The Team Privacy Contact Us Refunds SupportDonateHow you can support usSubmit an Article Donate How you can support us Submit an Article Donate How you can support us Submit an Article SubscribePrintDigital OnlyInstitutions Print with DigitalInstituitions Digital Only Print Digital Only Institutions Print with Digital Instituitions Digital Only Print Digital Only Institutions Print with Digital Instituitions Digital Only AdvertiseMedia Pack Media Pack Media Pack DistributionUK StockistsUS StockistsDistributions UK. Europe, RoW & USA UK Stockists US Stockists Distributions UK. Europe, RoW & USA UK Stockists US Stockists Distributions UK. Europe, RoW & USA SocialFacebookYouTubeInstagramTwitterPinterest Facebook YouTube Instagram Twitter Pinterest Facebook YouTube Instagram Twitter Pinterest"}