{"id": 521, "name": "Frontiers in Chemical Engineering", "domain": "frontiersin.org/journals/chemical-engineering", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/chemical-engineering/articles/10.3389/fceng.2025.1605037/full", "title": "Chemical Engineering", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Biochemical Engineering Catalytic Engineering Chemical Reaction Engineering Computational Methods in Chemical Engineering Electrochemical Engineering Environmental Chemical Engineering Materials Process Engineering Microfluidic Engineering and Process Intensification Mixing and Particle Technology Separation Processes Surface and Interface Engineering Sustainable Process Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Biochemical Engineering Catalytic Engineering Chemical Reaction Engineering Computational Methods in Chemical Engineering Electrochemical Engineering Environmental Chemical Engineering Materials Process Engineering Microfluidic Engineering and Process Intensification Mixing and Particle Technology Separation Processes Surface and Interface Engineering Sustainable Process Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Biochemical Engineering Catalytic Engineering Chemical Reaction Engineering Computational Methods in Chemical Engineering Electrochemical Engineering Environmental Chemical Engineering Materials Process Engineering Microfluidic Engineering and Process Intensification Mixing and Particle Technology Separation Processes Surface and Interface Engineering Sustainable Process Engineering Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office REVIEW article Front. Chem. Eng., 20 May 2025 Sec. Environmental Chemical Engineering Volume 7 - 2025 |https://doi.org/10.3389/fceng.2025.1605037 This article is part of the Research TopicTrends and Developments in Algal Biofuels, Biorefinery and BioremediationView all articles **Environmental sustainability indicators applied to bioprocesses: a bibliometric analysis (2005–2024)** 1Nanomaterials and Computer Aided Process Engineering Research Group (NIPAC), Chemical Engineering Department, Universidad de Cartagena, Cartagena, Colombia 2Institutos y Centros de Investigación, Universidad Cesar Vallejo, Trujillo, Peru This study analyzes, quantifies, and maps, from a bibliometric perspective, the scientific production around environmental sustainability indicators used in bioprocesses covering the timeframe 2005–2024 in Scopus. Biblioshiny software in RStudio was used to categorize and evaluate the contributions of authors, countries, institutions, and journals. Their collaborative networks were also visualized using VOSviewer. The need to incorporate quantitative, qualitative, and descriptive indicators that comprehensively capture the environmental impacts of biotechnological processes led us to compile thirty diversified indices. The relevance of life cycle analysis as a fundamental tool is highlighted and triggered by integrating multicriteria analysis methods, optimization algorithms, and artificial intelligence. This combination of approaches allows for addressing the inherent complexity of evaluating systems that involve technical, environmental, economic, and social dimensions. Emerging trends point to a paradigm oriented towards the circular bioeconomy, where the diversification of flows in biorefineries and microalgae use are presented as key strategies to maximize efficiency and minimize environmental impacts. The synergy between traditional methodologies and advanced computational approaches constitutes the ideal framework to optimize the sustainability of bioprocesses, establishing a solid base for future research in this field. **1 Introduction** Integrating environmental sustainability into industrial development has become a topic of scientific interest, particularly in areas such as biorefineries and bioprocesses, where integrating environmental indicators and metrics is essential to assess the impact of processes. Biorefineries, defined as facilities that convert biomass into high-value-added products, have gained importance due to their potential to reduce dependence on fossil resources and minimize greenhouse gas emissions. However, the environmental assessment of these systems requires robust methodologies to quantify their performance in terms of sustainability, including technical, economic, and social dimensions (Ianda et al., 2024;Giwa et al., 2018). Several studies have addressed the need to establish and apply environmental sustainability indicators in bioprocesses. For instance,Van Schoubroeck et al. (2018)suggest using indicators for climate change, clean and efficient energy use, resource management, and ecosystem care to quantify the environmental sustainability of producing biobased chemicals. Numerous research works converge on the importance of exploring the water footprint, quantifying water use, acidification, and eutrophication potential, reflecting the pollution in aquatic ecosystems (Giwa et al., 2018;Shahid et al., 2021). Other authors highlight the need for indicators to estimate land use efficiency and measure food waste use’s benefits and environmental offsets (Sandoval-Contreras et al., 2023). In addition, several researchers agree that life cycle sustainability analysis (LCSA) is one of the integrative methodologies to assess the environmental, social, and economic dimensions of multiple processes (Junqueira et al., 2017;Solarte-Toro and Cardona Alzate, 2023;Tuomisto et al., 2022). Likewise, the overall sustainability performance of processes is measured using indicators such as the weighted return on investment metric (SWROIM) to combine environmental and economic issues in a simple approach (González-Delgado et al., 2021). Meanwhile, approaches such as the Waste Reduction Algorithm (WAR) only quantify potential environmental impacts, identifying the process streams that potentially affect it (Moreno-Sader et al., 2020). However, as mentioned bySolarte-Toro et al. (2023), integrating all indicators and dimensions into a holistic framework is an urgent need to assess any industrial process sustainability appropriately. It will not only facilitate the identification of critical areas for improvement but also guide the construction of public policies to optimize bioprocesses. On the other hand, bibliometric research can lead to the development and discovery of trends in a research field. It can help the scientific community identify new hotbeds of innovation based on a desired observation window (Donthu et al., 2021). This sector has not been elusive to bibliometrics, so the following lines show the studies published to date. Ellili (Ould et al., 2023) conducted a mixed analysis of articles on environment, development and sustainability, identifying thematic trends dominated by sustainable development goals, climate change, and the circular economy, highlighting the weak integration of social indicators in developing regions.Nobanee et al. (2021)explored the intersection between sustainability and risk management, pointing out the dominance of scenario-analysis tools and quantitative models while demonstrating the lack of unified frameworks.Sneegas et al. (2021)combined bibliometric analysis with Q-methodology, prioritizing stakeholder perspectives in critical areas such as water, energy, and land use. This expresses the need to merge qualitative and quantitative methods.Meseguer-Sánchez et al. (2021)examined the relationship between corporate social responsibility and sustainability, finding that only 12% of studies included rigorous environmental metrics. Given the above, these bibliometric studies have not properly studied environmental indicators in bioprocesses nor their integration with social and economic aspects as part of unified frameworks—an active research need. Hence, this research aims to provide a broader and more complete scientometric vision of the biobased sustainable industry by considering the period 2005-2024, retrieving original articles published in Scopus, and using the bibliometrics of RStudio for data mining, while VOSviewer is used for the analysis of collaborations and co-occurrences. The following research questions were considered: Q1: How many research articles around environmental sustainability indicators were published annually between 2005 and 2024? Q2: Who are the most cited authors in these research areas? Q3: What are the most cited papers? Q4: Which journals publish the most papers? Q5: What are the leading institutions in the focused research area? Q6: Which are the most active funding institutions in the selected period? Q7: Which are the top ten countries publishing on the topic? Q8: What are the thematic trends in these fields? **2 Materials and methods** **2.1 Study design** This study used bibliometric analysis, a tool commonly used to map research in fuzzy scientific fields. Scientometric—bibliometry—uses mathematics and statistics to describe scientific activity and relevance over some time in numerical terms (Donthu et al., 2021). Typically, bibliometric analyses are multidisciplinary, providing a quantitative view of a field of study. They use metrics and knowledge graphs to map the scientific evolution related to some field of knowledge, providing objective evidence of recent advances and trends. **2.2 Data source** Scopus was chosen for its wide range of high-quality journals and research documents (Zhu and Liu, 2020). Institutional access was required to download and confirm the content of the study files. **2.3 Search strategy** We introduced a comprehensive list of keywords, covering environmental sustainability indices and bioprocesses, compiling a database of 360 documents (Figure 1). The search equation used was the following: TITLE-ABS-KEY [(biorefin* OR “bio-refin*” OR “bio refinery” OR “bio-refinery” OR bioprocess* OR “bio-process*” OR “bio-based process*”) AND (indicator* OR metric* OR “performance indicator*” OR “kpi*” OR index OR indices) AND (environmental OR ecologic* OR “environmental sustainab*” OR “ecological sustainab*”)]. On behalf of environmental sustainability indices, the words used were the following: indicator, metric, performance indicator, kpi, index, indices, environmental, ecologic, environmental sustainability, and ecological sustainability. Representing biobased processes, the selected words were biorefinery, bio-refinery, bioprocess, bio-process, and bio-based process. These keywords were obtained in a cyclical process, starting with the articles returned by the databases and adding more words to cover the initially unforeseen topics. The timeframe used covered data from 2005 to 2024. The search was reduced to titles and keywords to increase the effectiveness of the equation for collecting papers from the target areas (Camargo et al., 2023;Alviz-Meza et al., 2023). The selection of the time window was made concerning the number of articles found using the search equation, where it was determined that a time frame of 20 years would be appropriate to cover the genesis of the selected topic and its evolution until 2024 (Figure 2). Only original articles were considered as document types, guaranteeing exclusive access to the original findings and thus avoiding reworkings and biases that could be introduced by secondary documents such as reviews. The Scopus web page was consulted for the last time on 4 February 2025. Figure 1. Flowchart of used bibliometric methodology. Figure 2. Annual trend of publication from Scopus in the 2005-2024 timeframe. **2.4 Bibliometric analysis** Charts and tables were created from the database data downloaded in BibTeX and CSV formats. The Biblioshiny application from RStudio was useful for obtaining and organizing the compiled database before manual manipulation. It provides data on the most productive countries, institutions, authors, research areas, journals, subject headings, h-index, impact factors, total citations, and so on (Aria and Cuccurullo, 2017). In addition, VOSviewer was used for data mining, mapping, and visualization of collaborative networks (Karahan and Gül, 2021). **2.5 Limitations** The Scopus database is not perfectly suited to bibliometric analyses, so it often yields some erroneous data (e.g., duplicates), potentially limiting the reliability of the extracted metrics and findings. Also, qualitative statements can be subjective since—originally—this type of study is quantitative (Gaur and Kumar, 2018). Moreover, this academic exercise only offers a short-term forecast of the area under investigation (Wallin, 2005). **3 Results and discussion** **3.1 Trends in the annual production of original papers** Figure 2shows that the interest in the research on the environmental sustainability index applied to bioprocesses has followed an exponential growth from 2005 to 2024 —coefficient of determination equal to 0.934— reaching its highest peak in 2024. Furthermore, the annual growth rate in the observed period was found to be 23.48%. The exponential growth of scientific production is encouraged by a greater global concern about the environmental impacts of industrial activities. The possible driving factors are the increasing demand for energy efficiency, reducing polluting emissions, and the search for minimizing waste processes (Basanta et al., 2007). Likewise, integrating life cycle analysis and environmental assessment tools in biotechnological processes has become a priority research field (Sánchez et al., 2012;Saling, 2020). This convergence has promoted the apparition of new methodologies and assessment approaches to quantify the environmental impacts of bioprocesses, integrating environmental, economic, and social parameters (Chisti, 2008;Amaro et al., 2011). It is also important to highlight the evolution of international regulations—e.g., ISO 14000 standards—and governmental policies to make industry adopt circular economy practices: a tailwind to generate the observed exponential growth (Loayza and Silva, 2013;García-Silvera et al., 2023;Karaeva et al., 2023). Added to all this, we found the increased accessibility of advanced analytical tools and open access to large volumes of data, triggering scientific collaborations in this field (Monroy and Diaz, 2018). The average total citation per year in the studied timeframe is 3.82, while the average citation per document is 28.78. According to a recent study, biorefinery publications have superior citation characteristics compared to other research areas (Kokorevics, 2022). This gives context to the average citation data of this work and reflects the relevance and impact of research in this sector. Average total annual citations peaked in 2010 and 2013, after which they began to decline (Figure 3). This decline can be explained, among other things, by the time it takes researchers to identify newly published works, by their accessibility, by their novelty, and by the dissemination of science (Saberi and Abedi, 2012;Parolo et al., 2015;Repiso et al., 2021). Figure 3. Mean total citation per year from Scopus in the 2005-2024 timeframe. **3.2 Most cited authors and their collaborations** The Scopus retrieved data highlight Cardona-Alzate CA as the most productive researcher in environmental sustainability indexes linked to bioprocesses (Table 1). However, El-Halwagi MM and Moreira MT possess the highest total citations received and h-index, respectively. Meanwhile, as shown inFigure 4, Solarte-Toro JC is the leader in the collaboration metric with a total link strength of 26 (Supplementary Appendix Table A1). Therefore, all these authors share the leadership in this research field. In some of the most cited papers, coauthored by El-Halwagi, the Mixed Integer Linear Programming (MILP) model is proposed to plan sustainable distributed biorefinery supply chains, simultaneously integrating economic, environmental (LCA-based Eco-indicator-99), and social objectives—number of jobs created. The model considers factors such as seasonal and geo-graphical availability of biomass, choice of processing technologies, economies of scale, and strategic location of plants to optimize transport costs and covers different raw materials and products—exemplifying the need for sustainability indicators in bioprocesses (Santibañez-Aguilar et al., 2014;Santibañez-Aguilar et al., 2011). Table 1. Top 10 most productive and cited authors. Table 2. Top 10 most cited articles. Figure 4. Most collaborative authors, considering a minimum of one document in VOSviewer. It should be noted thatFigure 4is not fully adapted to the data inTable 1since the graphs of these networks focus on the search for collaborations—total link strength—which depends on the minimum number of articles per author and the decision to display the interconnection of the nodes. In this case, the size of the nodes is proportional to the number of links per author. The same logic applies to the following VOSviewer figures and their interpretation. On the other hand, Lotka’s law suggests that 3 articles are the critical limit of published documents, under which the number of authors with more documents gets below 1.7%. Finally, the international co-authorship and the coauthors per doc in the studied areas are 31.94% and 4.9, respectively. **3.3 Most cited research articles** The use of environmentally sustainable indicators has been studied in multiple research works due to its potential in industrial applications.Table 2presents the ten most cited articles, offering a comprehensive overview of the use of environmental sustainability indicators in biorefineries, waste valorization, and process optimization. Some of these researchers have used LCA methodologies to assess the environmental impact of ethanol compared to gasoline, considering greenhouse gas emissions and energy efficiency (Cavalett et al., 2013;Liska et al., 2009). Santibañez-Aguilar and coworkers demonstrated that optimizing a biorefinery through environmental, economic, and social indicators within the biofuels industry is feasible, resulting in cost-effective, environmentally friendly, and job-creating solutions (Santibañez-Aguilar et al., 2014). Other works highlight the potential of lignocellulosic biomass and agro-industrial waste for renewable chemical production, assessing their impact using sustainability criteria such as waste reduction and resource efficiency (Xiong et al., 2019;Cherubini and Strømman, 2011). Likewise, Posada and Lari have applied sustainability approaches to assess bioethanol and glycerol environmental and economic viability as key products in biorefineries, measuring factors such as energy consumption and carbon emissions (Posada et al., 2013;Lari et al., 2018). Rashad and collaborators highlight compost stability and maturity as key indicators for the bioconversion of agricultural residues into organic amendments (Rashad et al., 2010). Patra research initiatives integrate remote sensing and multicriteria analysis tools to delineate groundwater zones, ensuring their sustainable use (Patra et al., 2018). Finally, Moncada’s study complements these perspectives with design strategies that maximize biomass utilization and minimize environmental impacts (Moncada et al., 2016). **3.4 Journals that host the highest number of articles** Table 3shows that theJournal of Cleaner Production, Biofuels, BioproductsandBiorefining, and Biomass and Bioenergyare the principal journals associated with environmentally sustainable indices in bioprocesses. The cumulative proportion of research papers published in these three journals is approximately 57.6%, indicating a considerable diversity of journals (over 40%) that publish articles related to these issues. According to Bradford’s law, it is viable to classify sources into core areas, related areas, and non-relevant areas regarding the field targeted by the papers hosted in the journals—Equation 1. wherer0represents the number of journals that belong to the core area, γ is Euler’s constant ∼0.577, andYis the number of articles published in the journal with more hosted documents (Zhu et al., 2022). For this case,Y= 31; thereforer0≅8. As a result, the sources below thejournal ProcessesinTable 3are out of the core collection. Also, it is noteworthy that theJournal of Cleaner Productionis the preferred journal to publish in these fields. Table 3. Top 10 journal hosting papers of the studied research field. **3.5 Most productive institutions and their collaborations** The top three universities in the research field studied are the Universidade Estadual de Campinas and the Universidad Nacional de Colombia Manizales (Table 4). From the collaborative perspective, the University of California places number one with a betweenness (number of collaborations) of 32, as shown inFigure 5;Supplementary Appendix Table B1. The University of California could be the epicenter of several scientific collaborations due to its technological developments and environmental sustainability initiatives. For instance, the Sustainability Indicator Framework (SIF) would be one of their proposed models to assess sustainability, integrating environmental, economic, and social indicators (Shilling et al., 2015). Although its main focus is on watershed assessment, its principles could be applied to industrial bioprocesses’ sustainability analysis. In addition, this institution has developed tools such as CalEnviroScreen, an assessment methodology that identifies communities impacted by multiple sources of pollution in California (Greenfield et al., 2017). As for the participation of South American countries, Colombia and Brazil have focused their efforts on the environmental sustainability of bioprocesses because of their exceptional biodiversity, exemplified by critical ecosystems such as the Amazon, which provide a basis for reducing their dependence on fossil fuels and reducing greenhouse gas emissions (Bossa-Benavidez et al., 2023;Flórez-Zapata et al., 2022). Moreover, both countries have implemented innovative public policies and promoted international cooperation: Colombia, through its National Bioeconomy Plan and regional workshops with international actors, and Brazil, through the ABC Plan, promoting low-emission agricultural practices and industrial processes (Bossa-Benavidez et al., 2023;de Ciencia and Tecnología e Innovación Colombia, 2023). Table 4. Top 10 most productive institutions. Figure 5. Most collaborative institution clusters obtained from collaboration networks in Bibliometrix. **3.6 Most participative funding agencies** TheConselho Nacional de Desenvolvimento Científico e Tecnológicoandthe Coordenação de Aperfeiçoamento de Pessoal de Nível Superior from Brazilas much as theEuropean Commissionfrom the European Union were found to be the main funding agencies (Table 5). These institutions are essential for developing scientific research in Brazil, funding a wide range of studies in various fields, including agricultural research, such as those related to environmental issues. These agencies fund nearly 70% of Brazilian research, including projects focused on agriculture and sustainability (McManus and Baeta Neves, 2021). For Latin America, theConsejo Nacional de Ciencia y Tecnologíafrom Mexico is also a public entity that plays an important role in funding research in these subjects. For European countries, theEuropean Commissionis the provider of most of the funding for research in this area. Through programs such asHorizon 2020and theSeventh Framework Program (FP7), the Commission has provided significant funding for scientific research ranging from agricultural biotechnology to food sustainability (Hoekman et al., 2013). In the United States, theNational Science Foundationremains the agency that funds much of the country’s scientific research, including agriculture and biotechnology (Robertson et al., 2001). Finally, theNational Natural Science Foundation of Chinasupports research on environmental sustainability through various programs. The most prominent is perhaps the General Programme, which supports basic and applied research in various disciplines, including environmental assessment and life cycle assessment methodologies for biological processes (Leng et al., 2017). Table 5. Top 10 most participative funding agencies. **3.7 Most contributing countries and their collaborations** The notable presence of the United States in environmental sustainability research, reflected in the highest frequencies, citations, and collaborations (Figure 6;Table 6;Supplementary Appendix Table C1), is due to its leading role in innovative policies and technological innovation. TheNational Science Foundationand other U.S. funding agencies, such as theDepartment of Energy, have also played a key role in these metrics. The United States leads in advanced technology, with institutions such as MIT and the University of California promoting circular economy projects and industrial bioprocesses, supported by federal investments in clean energy and regulatory frameworks such as theGlobal Reporting Initiative (GRI)to standardize sustainable practices (Mougenot and Doussoulin, 2024). In Brazil, the Amazon is a natural laboratory for bioeconomy studies, with projects such as biofuel production from sugar cane, supported by policies such as the ABC Plan based on low-carbon agriculture (Piao et al., 2021). Mexico, for its part, has strengthened its leadership based on the uniqueness of its biodiversity and a tradition of exploiting indigenous biological resources. Initiatives such as theLaw for the Promotion and Production of Bioenergyand the active involvement of universities and research institutions have encouraged the development of technologies that optimize biomass conversion into high-performance energy and biochemical products (Paredes-Cervantes et al., 2020). These countries also participate in international networks, such as theParis Agreement, where technologies and methodologies to reduce emissions in critical sectors such as agriculture and mining are explored. Their focus on integrating social and environmental indicators, such as theSustainable Development Goals, positions them as global leaders in transitioning to low-carbon economic models. Figure 6. Most collaborative countries, considering a minimum of 5 documents in VOSviewer. Table 6. Top 10 countries. **4 Environmental sustainability applied to bioprocesses and trending topics** **4.1 Environmental sustainability** Over the last few decades, there has been a growing need for tools that allow the objective and systematic measurement of the environmental performance of processes or human activities. This gave rise to the so-called environmental sustainability indicators, which emerged in response to the inadequacy of traditional economic models (e.g., GDP) to reflect the complexity of the interaction between human activities and natural systems. Several historical and conceptual moments have triggered the evolution of environmental indicators. The first efforts are appreciated in articles from the 1970s and 1980s, where the concept of sustainable development was introduced (Latina and Estenssoro, 2015;Vargas, 2016). These publications promoted the need to assess not only economic growth but also the capacity of the environment to sustain such growth. In more recent perspectives, the Organization for Economic Co-operation and Development (OECD) has contributed significantly to the development and systematization of environmental indicators, proposing a classification that allows for a clear articulation of the dimensions of environmental assessment. According to the OECD, these indicators can be grouped into three main categories: quantitative, qualitative, and descriptive (Donnelly et al., 2007). Quantitative indicators include emission reduction, energy efficiency, and the amount of waste generated. Qualitative indicators highlight environmental governance, the perception of environmental quality by communities, and the effectiveness of environmental policies. Descriptive indicators highlight perceptions based on environmental conditions, such as biodiversity, air quality, water quality, and soil quality. This classification, which in some aspects is aligned with the DPSIR (Driving forces, Pressures, State, Impact, Response) approach, has been adopted and adapted by OECD member countries’ environmental performance evaluation at the national level (Niemeijer and de Groot, 2008). **4.2 Environmental sustainability indices in bioprocesses** The selection and application of sustainability indicators in bioprocesses are essential to capture the complexity of the environmental impacts associated with each bioprocess stage—production and use.Table 7shows the indicators that we found relevant and worthy of discussion for this literature review, covering economic and social dimensions as part of unified frameworks in which they coexist with environmental sustainability. Table 7. Environmental sustainability indicators. Concerning air pollution, evaluating the Photochemical Ozone Creation Potential allows measuring contributions to the formation of tropospheric ozone by volatile organic compounds and other precursors (Jenkin et al., 2017). The Suspended Particulate Matter Emissions and Acidification Potential measurements allow for assessing the deterioration of air quality, human health, and the possible increase in the environmental acidity of soils and water bodies (Shaltout et al., 2019;Provolo et al., 2018). These indicators, when combined, offer a solid overview for planning strategies to reduce pollutants. They also allow categorizing bioprocesses between less and more aggressive with the atmosphere. Regarding the circular economy and waste minimization, using the Circularity Index or the Material Recycling Rate makes it possible to quantify the recirculation of inputs and the real reduction of waste in bioprocesses (Garrido et al., 2023;Hotta et al., 2016). The E-Factor—widely studied in green chemistry—considers the overall efficiency of transforming raw materials into the final product, relating the waste mass to the product mass (Sheldon, 2017). These metrics, integrated with the Global Warming Potential or the Carbon Footprint (Müller et al., 2020;Santoyo-Castelazo and Azapagic, 2014), generate holistic diagnoses that facilitate the evaluation of both the contribution to global warming and the potential circularity of the process. However, there is a methodological debate in the literature about how to weigh each of these indicators when comparing them since the synergistic or compensatory effects of the processes—for example, recycling vs. energy demand—complicate the development of a unified index. Energy efficiency and process performance can also be addressed by monitoring the Cumulative Energy Demand or Non-Renewable Energy Use ratio (Frischknecht et al., 2015;Nguyen et al., 2015). These parameters, together with Energy Return on Investment, provide an integrated view of energy sustainability, as they allow for identifying how much net energy is gained or lost by developing a given bioprocess (Murphy et al., 2022). It should be noted that these energy elements are often intrinsically intertwined with land use and soil health so that indicators such as Soil Erosion Potential and Indirect Land Use Change become relevant in agricultural systems or those that rely on large areas for biomass cultivation (Panagos et al., 2020;Broch et al., 2013). Careless soil management can increase CO2emissions and biodiversity loss—Biodiversity Footprint (Marques et al., 2021). The analysis is strengthened by including environmental costs and benefits—Environmental Cost Indicator and Eco-Efficiency Ratio—and global sustainability indicators—Sustainable Process and Environmental Sustainability Indexes—since these synthesize the balance between profitability, operational performance, and environmental externalities (Caiado et al., 2017;Hellweg et al., 2005;Maier et al., 2017;Ezeonu et al., 2012). However, such indices face the challenge of aggregating multiple dimensions into a single value, which could oversimplify the complex interaction of factors such as toxicity, water scarcity, or energy demand. Among the water-related indicators, the Water Footprint or the Water Scarcity Footprint are critical indicators in areas with water stress. Moreover, Eutrophication or Ecotoxicity Potentials are essential for establishing the risk of ecological imbalances in surface and groundwater (Vanham and Bidoglio, 2013;Jaibumrung et al., 2023;Xue et al., 2015;Su et al., 2019). Therefore, compatibility between various indicators and their prudent selection constitutes one of the most notable challenges of comprehensive environmental sustainability assessment. On the other hand, another important group of environmental sustainability indicators is covered by the GREENSCOPE framework, which compiles 139 indicators in four key metrics: mass efficiency (Saling, 2020), environment (Shaltout et al., 2019), energy (Nobanee et al., 2021), and economy (Kokorevics, 2022). Its applicability covers the analysis of alternatives in biorefineries, chemical production, and process optimization through energy integration and material recycling. GREENSCOPE can be complemented with multi-criteria analysis (MCDA) methods such as Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS) and Analytic Hierarchy Process, with TOPSIS being the most effective in minimizing the deviation from an ideal case, facilitating the selection of sustainable alternatives (Dias et al., 2024). The main contribution of these indicators lies in their ability to offer a multifaceted view of the environmental impact of bioprocesses, from emissions into the atmosphere and toxicity to the efficiency of resource use. Despite their usefulness, they should be used under multicriteria assessment schemes that recognize trade-offs and their synergies, avoiding the error of simplifying the complexity inherent to sustainability. Only a holistic and dynamic approach, supported by life cycle analysis, will allow prioritizing, based on quantitative and qualitative indicators, those bioprocesses that maximize economic profitability and, at the same time, minimize environmental degradation and risk to human health. **4.3 Environmental sustainability methodologies** One of the most widely used approaches is LCA, which has allowed for a holistic assessment of everything from the extraction of raw materials to the final disposal of waste. LCA has been adapted for use in bioprocesses, where the flows of energy, material, and emissions are modeled, allowing for the identification of environmental bottlenecks and opportunities for improving process efficiency (Wowra et al., 2023). However, LCA alone may not address the complexity inherent in bioprocesses, given that the interrelations between technical, economic, and environmental variables require an analysis that combines multiple dimensions. In this regard, MCDA techniques have been incorporated since they integrate different indicators into a decision framework to simultaneously weigh factors such as resource consumption, emissions, and energy efficiency (Colapinto et al., 2020). These methodologies allow the evaluation of environmental performance and the prioritization of improvement interventions according to relevance and feasibility criteria. Furthermore, advances in artificial intelligence and optimization algorithms—e.g., genetic algorithms or artificial neural networks—are beginning to be applied to predict the behavior of biological systems as much as to optimize operating parameter configurations based on sustainability objectives (Nishant et al., 2020). Combining dynamic process simulations with optimization approaches allows for exploring broad solution spaces and identifying operating conditions that minimize environmental impact without sacrificing productivity (Nishant et al., 2020). As a result, it is inferred that bioprocesses environmental sustainability assessment is evolving towards a multidimensional paradigm in which LCA works with multi-criteria analysis techniques, optimization methods, and predictive algorithms. This approach brings the following advantage: LCA provides a comprehensive life cycle view while MCDA and artificial intelligence-based methodologies allow for more agile and resource-optimized decisions. The convergence of these tools represents the current state of the art, suggesting future lines of research focused on integrating hybrid models to capture the biological systems’ complexity—robustly and scalably. **4.4 Trending topics** Keywords are faithful representations of scientific articles, whose frequent use can reflect the hotspots of a particular field of study. The visualization of the Scopus keywords’ clusters and trend topics chart (Figures 7,8,) outlines the most relevant research fields regarding environment-sustainable indexes for bioprocesses. We highlight the keywords biorefineries, biomass, sustainability, environmental impact, LCA, bio-energies, bioconversion, bioremediation, municipal solid wastes, and techno-economic analysis (Supplementary Appendix Table D1;Supplementary Appendix Figure E1). The integration of these words suggests that the scientific community is moving towards integrated systems development that sustainably converts renewable resources—biomass and its derivatives—into products and energy. For instance, recent studies highlight the importance of integrated techno-economic and environmental assessments (ETEA) in biorefineries (Avila et al., 2024). A review of the last decade underlines the strategic importance of biorefineries in achieving circular economy and sustainability goals, emphasizing the need for holistic assessments to inform decision-making processes (Pérez-Almada et al., 2023). These authors found that most researchers are involved in second-generation biomass studies (65%), followed by the third, first, and fourth generations (16, 12, and 1%, respectively). Biochemical—fermentation and anaerobic digestion—are the main concerns while bioethanol is the most pursued product. However, biogas, biomethane, and biodiesel are still considered relevant for the scientific community. Moreover, the combined application of LCA and Techno-Economic Analysis (TEA) has been fundamental in assessing the sustainability of bioenergy production, since LCA evaluates the environmental impacts (greenhouse gases, land use, water consumption, etc.) of products throughout their life cycle—from biomass production to final disposal—while the techno-economic analysis allows for the economic feasibility of implementing conversion and upgrading technologies (Osman et al., 2024). This combination of approaches is essential to ensure that bioconversion processes are environmentally sustainable and economically competitive. Lastly, in more recent trends, joint uses are being proposed for microalgae and municipal wastes for bioenergy production, taking advantage of microalgae’s bioremediation capabilities and potential conversion into value-added products (Kim et al., 2023;El-Sheekh et al., 2025). Below, we present a more detailed discussion of the growing contributions around environmental-sustainability indices applied to bioprocesses, as suggested by the four clusters ofFigure 8. Figure 7. Trend topics obtained through the software Bibliometrix. Figure 8. Keywords most used by authors, considering a minimum of 5 occurrences in VOSviewer. The circular bioeconomy focuses on closing carbon cycles and transforming biological waste into high-value products through disruptive technologies (Tan and Lamers, 2021). Integrating processes such as anaerobic digestion, biogas production, and converting agricultural waste into bioethanol are relevant for transitioning to bioeconomy models. For instance, through a life cycle analysis of bioethanol production from agricultural waste, it has been concluded that greenhouse gas emissions can be significantly reduced, and the energy efficiency of the processes can be improved (Singh et al., 2016). Furthermore, anaerobic digestion, processed in municipal facilities and rural-scale biogas systems, offers an additional way to valorize organic waste, generating biogas with a lower carbon footprint and producing digestate that can be used as a fertilizer (Slorach et al., 2019;Ali et al., 2023). The concept of circular bioeconomy involves replacing fossil resources with bioproducts and optimizing processes to maximize environmental and economic benefits. Biorefineries have evolved from traditional models based on a single biomass flow to more flexible facilities that integrate multiple streams, allowing the production of a wide range of biofuels and high-value products. This diversification translates into a paradigm shift in which lignocellulosic waste and other biomass sources generate bioethanol, bio-diesel, biogas, microalgae, specialized chemical compounds, and so forth (Ianda et al., 2024). This integration requires more robust environmental assessment methods, such as LCA, capturing the complexity and inherent variability of systems that operate with heterogeneous feedstocks and that seek to optimize energy efficiency and reduce the carbon footprint. Other authors argue that the diversification of feedstocks and the adoption of mass-energy integration strategies have important implications for biorefinery sustainability and environmental performance (Shahid et al., 2021;Solarte-Toro and Cardona Alzate, 2023;Solarte-Toro et al., 2023). Although lignocellulosic biomass use adds complexity to the design of the pretreatment and conversion stages, this complexity is offset by reductions in greenhouse gas emissions and improved overall process efficiency. It is concluded that the evaluation of the environmental sustainability of biorefineries must also consider technical and economic aspects, promoting process resilience and bioeconomy. Microalgae have shown remarkable potential as feedstock in the context of biorefineries, not only due to their high growth rate and content of lipids, proteins, pigments, and so forth but also due to their flexibility in terms of cultivation since waste effluents or even CO2from industrial sources can be used to stimulate their growth (Giwa et al., 2018). This versatility makes their integration into biorefinery schemes attractive for producing biofuels, bioplastic, and high-value additives, aiming at circular economy strategies (Kim et al., 2023). The use of LCA and environmental performance indicators in this context is also critical to validate the sustainability of these technological routes. These approaches allow quantifying the carbon footprint, energy demand, and potential impacts on eutrophication, ecotoxicity, and water consumption throughout the production process (Deprá et al., 2020). Moreover, biological remediation technologies, through the co-cultivation of microalgae with liquid waste streams, reinforce the efficient use of nutrients and reduce operating costs, simultaneously generating environmental benefits by recycling and valorizing organic by-products (El-Sheekh et al., 2025). The synergy with other valorization technologies, such as fermentation, thermochemical conversion, or extraction of biocompounds, increases the diversity of products with higher added value, such as natural pigments, essential fatty acids, or biofertilizers, consolidating the concept of integrated biorefinery. However, there are challenges to its commercial scaling, including the reduction of energy costs in the harvesting and drying stages, the optimization of photobioreactors, and the guarantee of CO2and nutrient supply in large volumes (Giwa et al., 2018;Kim et al., 2023). Diverse methodologies and algorithms in the literature allow for an integrated assessment of environmental and economic aspects. These include the previously mentioned SWROIM, which weighs the return on investment by incorporating environmental and economic indicators. It is complemented by approaches based on LCA with Life Cycle Costing or Techno-Economic Analysis (González-Delgado et al., 2021;Ögmundarson et al., 2020;Petrescu and Cormos, 2015). These methodologies combine the assessment of environmental impacts throughout the life cycle with the analysis of economic costs and benefits, offering a holistic view of sustainability. Also noteworthy are tools such as the expanded Total Cost Assessment (Curkovic and Sroufe, 2007), which incorporates environmental externalities into financial analyses; and eco-efficiency analysis, which compares the environmental impact per unit of economic production; methods based on MCDA (Colapinto et al., 2020) and extended Data Envelopment Analysis (Andrés et al., 2021), which allow for the weighing of multiple criteria (environmental, economic and social) to optimize processes. Finally, methodologies such as the Economic Input-Output Life Cycle Assessment (EIO-LCA) (Hendrickson et al., 2002) and the Social Return on Investment (S-ROI) —when adapted to include environmental dimensions—offer additional frameworks for quantifying integrated impacts (Corvo et al., 2022). These methodologies present a basis for sustainable process design and decision-making in industrial and investment settings. Including optimization tools in sustainability projects has taken a decisive role in balancing economic, environmental, and social dimensions in decision-making. For instance, multi-objective algorithms simultaneously weigh aspects such as financial profitability, emissions reduction, and social justice, seeking compromise solutions that satisfy multiple stakeholders and guarantee the proposals’ technical viability. These techniques can range from evolutionary approaches, such as genetic algorithms applied to resource management, to specific methodologies to assess environmental impact, such as WAR, focused on quantifying and minimizing the production of polluting emissions (Moreno-Sader et al., 2020;Herrera et al., 2022;Petrescu and Cormos, 2014). Several methods have been developed that integrate ecological indicators (carbon and water footprint), social criteria (local employment, inclusion, etc.), and economic parameters (return on investment, the total cost of ownership, and so on) to quantify sustainability in comprehensive projects. A good example is the Sustainability-Based Optimization Algorithm (SBOA), which simultaneously seeks to reduce adverse impacts while maintaining technical and economic efficiency (Barkdoll, 2019). This methodology uses a single objective function to determine configurations that minimize the overall project impact, giving the same initial weight to each dimension (social, environmental, economic, and technical), and then applying an algorithm such as gradient descent that optimizes the sustainability function. In addition, the availability of quality data, the standardization of indicators, and the training of technical teams are important factors for the rigorous use of advanced approaches, such as those based on metaheuristics or recently emerging multi-objective methodologies (Sadollah et al., 2020). However, a crucial challenge lies in the regulatory and technological barriers that hinder the systematic adoption of these optimization tools (Almalki et al., 2020). It is necessary to strengthen the articulation between public policies and industrial actors to align incentives and promote standards for measuring and certifying sustainability. Finally, the Motor themes in this study are given by the environmental indicators and LCA integration to optimize biorefineries or bioprocesses, as suggested by the thematic map shown inSupplementary Appendix Figure E1. These areas influence the theoretical and methodological configuration of the field and have a consolidated research base. In contrast, the Niche themes, such as specific bioconversion methodologies, are found within specialized lines of work. The Emerging themes could be certain studies of microalgae, which have not yet been explored in depth. Finally, the Basic themes fit indicators such as carbon footprint or energy efficiency, so they are transversal in many works, but they are not yet as deeply developed; that is, although they are essential for the evaluation of sustainability, a greater degree of methodological or empirical maturity is lacking in their usability. **5 Conclusion** This review is a response to the recent growing interest of institutions, journals, researchers, countries, and funding agencies in environmental sustainability. The main conclusions delivered by responding to each one of the settled research questions are the following. The production of original papers on this topic is facing exponential growth. To become one of the most cited authors, 5 published papers are needed. The most cited articles in this research field are diversified, covering different initiatives in environmental sustainability applied to biorefineries. The top journals preferred to spread environmental sustainability-based research works with an SJR higher than 0.258, with the Journal of Cleaner Production as the preferred journal. The most productive institutions deliver at least 7 documents to be part of the top 10. The top ten funding agencies sponsor a minimum of 8 papers. The United States and Brazil are the most active countries in these subjects. Regarding our novel findings in the research trend, we compiled thirty indices to exemplify the complexity of integrating multiple and diverse indicators to assess the environmental sustainability of bioprocesses. The diversity of indicators, ranging from parameters related to air quality, circularity, and greenhouse gas emissions to energy efficiency, impact on land use, resource consumption, and toxicity, shows that no single index can capture the plurality of technical, environmental, economic, and social dimensions. The synergy between life cycle analysis, multi-criteria analysis techniques, optimization algorithms, and artificial intelligence-based tools allows this complexity to be addressed in a comprehensive and scalable way. This convergence of traditional methodologies and advanced computational approaches establishes a solid framework for optimizing the sustainability of bioprocesses and for the foundation for future research and developments in environmental policies. **Author contributions** AA-M: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Resources, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. SR-F: Formal Analysis, Funding acquisition, Writing – review and editing. ÁG-D: Conceptualization, Formal Analysis, Project administration, Supervision, Writing – review and editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by the Colombian Ministry of Science, Technology and Innovation MINCIENCIAS through the project “Sustainable Use of Avocado (Laurus Persea L) Produced in the Montes de María to obtain Value Added Products under the Biorefinery Concept in the Department of Bolívar” and “Evaluation of the sustainability of a cascade biorefinery topology for the use of Hass avocado seeds cultivated in the Amazon region,” Codes BPIN 2020000100325 and SIGP 100307. Alviz-Meza A. was funded by the same call through budget record 147. **Acknowledgments** The authors thank the Universidad de Cartagena for technical support and for providing databases, equipment, and software to conclude this research successfully. Alviz-Meza A. gratefully acknowledges his wife, Erika Quintero, and daughter, Annia Katarina, for their unwavering support and love throughout the writing of this paper. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/fceng.2025.1605037/full#supplementary-material **References** Ali, S., Yan, Q., Razzaq, A., Khan, I., and Irfan, M. (2023). Modeling factors of biogas technology adoption: a roadmap towards environmental sustainability and green revolution.Environ. Sci. Pollut. Res.30 (5), 11838–11860. doi:10.1007/s11356-022-22894-0 PubMed Abstract|CrossRef Full Text|Google Scholar Almalki, S. M. O., Zhuo, Z., Almalki, O., Siyal, Z. A., Hashmi, H., and Shah, S. A. A. (2020). A fuzzy multi-criteria analysis of barriers and policy strategies for small and medium enterprises to adopt green innovation.Symmetry12 (1), 116. doi:10.3390/sym12010116 CrossRef Full Text|Google Scholar Alviz-Meza, A., Orozco-Agamez, J., Quiñayá, D. C., and Alviz-Amador, A. (2023). Bibliometric analysis of the Fourth Industrial Revolution applied to material sciences (2017-2021).Chem Engineering7 (1), 2. CrossRef Full Text|Google Scholar Amaro, H. M., Guedes, A. C., and Malcata, F. X. (2011). Advances and perspectives in using microalgae to produce biodiesel.Appl. Energy88 (10), 3402–3410. doi:10.1016/j.apenergy.2010.12.014 CrossRef Full Text|Google Scholar Andrés, C., Henao, R., Lucía, O., and Serna, L. (2021). Análisis envolvente de datos y sostenibilidad.Ingeniare17 (31), 11–19. Google Scholar Aria, M., and Cuccurullo, C. (2017). Bibliometrix: an R-tool for comprehensive science-mapping analysis.J. Informetr.11 (4), 959–975. doi:10.1016/j.joi.2017.08.007 CrossRef Full Text|Google Scholar Avila, A., Caltzontzin, V., Martínez, S., and Gutiérrez, C. (2024). Life-cycle assessment of biodiesel from waste feedstocks: a review.Perspect. Cienc. Tecnol.7 (13), 8–25. Google Scholar Barkdoll, H. T. (2019). Sustainability-based optimisation algorithm.Int. J. Environ. Sci. Technol.doi:10.1007/s13762-019-02535-9 CrossRef Full Text|Google Scholar Basanta, R., Delgado, M. A. G., Cervantes Martínez, J. E., Mata Vázquez, H., and Bustos Vázquez, G. (2007). Sostenibilidad del reciclaje de residuos de la agroindustria azucarera: una revisión.CYTA J. Food5 (4), 293–305. Available online at:https://www.tandfonline.com/doi/abs/10.1080/11358120709487704. CrossRef Full Text|Google Scholar Bossa-Benavidez, J., Meza, J. D., Ramos-Franco, D., and Cohen-Padilla, H. (2023). La sostenibilidad en Colombia frente al desarrollo sostenible en el mundo: una revisión bibliométrica.Rev. Univ. Empres.25 (44), 1–29. Available online at:http://www.scielo.org.co/scielo.php?script=sci_arttext&pid=S0124-46392023000100008. Google Scholar Broch, A., Hoekman, S. K., and Unnasch, S. (2013). Variability in indirect land-use-change assessment and modelling in biofuel policy: a review.Environ. Sci. Policy29, 147–157. doi:10.1016/j.envsci.2013.02.002 CrossRef Full Text|Google Scholar Caiado, R. G. G., Dias, R. F., Mattos, L. V., Quelhas, O. L. G., and Leal Filho, W. (2017). Towards sustainable development through the lens of eco-efficiency: a systematic literature review.J. Clean. Prod.165, 890–904. Google Scholar Camargo, L., Comas, D., Escorcia, Y. C., Alviz-Meza, A., Carrillo Caballero, G., and Portnoy, I. (2023). Bibliometric analysis of global trends around hydrogen production based on the Scopus database in the period 2011–2021.Energies16 (1), 87. doi:10.3390/en16010087 CrossRef Full Text|Google Scholar Cavalett, O., Chagas, M. F., Seabra, J. E. A., and Bonomi, A. (2013). Comparative LCA of ethanol versus gasoline in Brazil using different LCIA methods.Int. J. Life Cycle Assess.18 (3), 647–658. doi:10.1007/s11367-012-0465-0 CrossRef Full Text|Google Scholar Cherubini, F., and Strømman, A. H. (2011). Chemicals from lignocellulosic biomass: opportunities, perspectives, and potential of biorefinery systems.Biofuels Bioprod. Biorefin. 5 (5), 548–561. doi:10.1002/bbb.297 CrossRef Full Text|Google Scholar Chisti, Y. (2008). Biodiesel from microalgae beats bioethanol.Trends Biotechnol.26 (3), 126–131. doi:10.1016/j.tibtech.2007.12.002 PubMed Abstract|CrossRef Full Text|Google Scholar Colapinto, C., Jayaraman, R., Ben Abdelaziz, F., and La Torre, D. (2020). Environmental sustainability and multifaceted development: multi-criteria decision models with applications.Ann. Oper. Res.293 (2), 405–432. doi:10.1007/s10479-019-03403-y CrossRef Full Text|Google Scholar Corvo, L., Pastore, L., Mastrodascio, M., and Cepiku, D. (2022). The social return on investment model: a systematic literature review.Meditari Acc. Res.30 (7), 49–86. doi:10.1108/medar-05-2021-1307 CrossRef Full Text|Google Scholar Curkovic, S., and Sroufe, R. (2007). Total quality environmental management and total cost assessment: an exploratory study.Int. J. Prod. Econ.105 (2), 560–579. doi:10.1016/j.ijpe.2006.04.021 CrossRef Full Text|Google Scholar de Ciencia, M.Tecnología e Innovación (Colombia) (2023). Colombia lidera taller internacional que ubica a la bioeconomía como eje central de la sostenibilidad en América Latina. Available online at:https://minciencias.gov.co/sala_de_prensa/colombia-lidera-taller-internacional-que-ubica-la-bioeconomia-como-eje-central-la. Google Scholar Deprá, M. C., Severo, I. A., dos Santos, A. M., Zepka, L. Q., and Jacob-Lopes, E. (2020). Environmental impacts on commercial microalgae-based products: sustainability metrics and indicators.Algal Res.51, 102056. doi:10.1016/j.algal.2020.102056 CrossRef Full Text|Google Scholar Dias, R. N., Filipe, R. M., and Matos, H. A. (2024). Decision-making based on sustainability analysis using GREENSCOPE.Clean. Technol. Environ. Policy26 (3), 755–770. doi:10.1007/s10098-023-02647-4 CrossRef Full Text|Google Scholar Donnelly, A., Jones, M., O’Mahony, T., and Byrne, G. (2007). Selecting environmental indicator for use in strategic environmental assessment.Environ. Impact Assess. Rev.27 (2), 161–175. doi:10.1016/j.eiar.2006.10.006 CrossRef Full Text|Google Scholar Donthu, N., Kumar, S., Mukherjee, D., Pandey, N., and Lim, W. M. (2021). How to conduct a bibliometric analysis: an overview and guidelines.J. Bus. Res.133, 285–296. doi:10.1016/j.jbusres.2021.04.070 CrossRef Full Text|Google Scholar El-Sheekh, M. M., El-Kassas, H. Y., and Ali, S. S. (2025). Microalgae-based bioremediation of refractory pollutants.Microb. Cell Fact.24, 1–28. PubMed Abstract|Google Scholar Ezeonu, C. S., Tagbo, R., Anike, E. N., Oje, O. A., and Onwurah, I. N. E. (2012). Biotechnological tools for environmental sustainability: prospects and challenges for environments in Nigeria-a standard review.Biotechnol. Res. Int.2012, 450802. doi:10.1155/2012/450802 PubMed Abstract|CrossRef Full Text|Google Scholar Flórez-Zapata, N. M. V., López, M. A. M., and Castellanos, L. P. A. (2022). Bioeconomía y transiciones hacia la sostenibilidad.Biodivers. Pract.7 (1), e1119. doi:10.21068/26193124.1119 CrossRef Full Text|Google Scholar Frischknecht, R., Wyss, F., Büsser Knöpfel, S., Lützkendorf, T., and Balouktsi, M. (2015). Cumulative energy demand in LCA: the energy-harvested approach.Int. J. Life Cycle Assess.20 (7), 957–969. doi:10.1007/s11367-015-0897-4 CrossRef Full Text|Google Scholar García-Silvera, E. E., Meléndez-Mogollón, I. C., Pérez-Arias, A., and Camero-Solorzano, Y. B. (2023). Tendencias del procesamiento de alimentos en el contexto de la COVID-19 y la globalización mundial.Biotecnol. Sect. Agropecu. Agroindustrial21 (2), 195–210. Available online at:http://www.scielo.org.co/scielo.php?script=sci_arttext&pid=S1692-35612023000200195. CrossRef Full Text|Google Scholar Garrido, S., Rodríguez-Antón, J., Amado, C. A. F., Santos, S., and Dias, L. C. (2023). Development and application of a composite circularity index.J. Environ. Manage337, 117752. doi:10.1016/j.jenvman.2023.117752 PubMed Abstract|CrossRef Full Text|Google Scholar Gaur, A., and Kumar, M. (2018). A systematic approach to conducting review studies: an assessment of content analysis in 25 years of IB research.J. World Bus.53 (2), 280–289. doi:10.1016/j.jwb.2017.11.003 CrossRef Full Text|Google Scholar Giwa, A., Adeyemi, I., Dindi, A., Lopez, C. G. B., Lopresto, C. G., Curcio, S., et al. (2018). Techno-economic assessment of the sustainability of an integrated biorefinery from microalgae and Jatropha: a review and case study.Renew. Sustain Energy Rev.88, 239–257. doi:10.1016/j.rser.2018.02.032 CrossRef Full Text|Google Scholar González-Delgado, A. D., Barajas-Solano, A. F., León-Pulido, J., González-Delgado, C., Barajas-Solano, A. D., and León-Pulido, A. F. (2021). Evaluating the sustainability and inherent safety of a crude-palm-oil production process in North Colombia.Appl. Sci.11 (3), 1046. doi:10.3390/app11031046 CrossRef Full Text|Google Scholar Greenfield, B. K., Rajan, J., and McKone, T. E. (2017). A multivariate analysis of CalEnviroScreen: comparing environmental and socioeconomic stressors with chronic disease.Environ. Health16, 1–16. Available online at:https://link.springer.com/articles/10.1186/s12940-017-0344-z. Google Scholar Guilford, M. C., Hall, C. A. S., O’Connor, P., and Cleveland, C. J. (2011). Long-term energy-return assessment for US oil and gas.Sustainability3 (10), 1866–1887. Google Scholar Hashim, I. J. (2021). “A new renewable-energy index,” inProc 6th int conf renewable energy: generation and applications (ICREGA 2021), 229–232. Google Scholar Hellweg, S., Doka, G., Finnveden, G., and Hungerbühler, K. (2005). Assessing the eco-efficiency of end-of-pipe technologies with the environmental cost-efficiency indicator.J. Ind. Ecol.9 (4), 189–203. doi:10.1162/108819805775247864 CrossRef Full Text|Google Scholar Hendrickson, C., Horvath, A., Joshi, S., Juarez, O., Lave, L., Matthews, F. C., et al. (2002).Economic input–output life-cycle assessment (EIO-LCA). Pittsburgh:Carnegie Mellon University. Google Scholar Herrera, T., Parejo, V., and González-Delgado, Á. (2022). Environmental analysis of avocado-oil production in North Colombia via WAR algorithm.Chem. Eng. Trans.91, 235–240. Google Scholar Hoekman, J., Scherngell, T., Frenken, K., and Tijssen, R. (2013). Acquisition of European research funds and its effect on international scientific collaboration.J. Econ. Geogr.13 (1), 23–52. doi:10.1093/jeg/lbs011 CrossRef Full Text|Google Scholar Hotta, Y., Visvanathan, C., and Kojima, M. (2016). Recycling rate and target setting: challenges for standardized measurement.J. Mater Cycles Waste Manag.18 (1), 14–21. doi:10.1007/s10163-015-0361-3 CrossRef Full Text|Google Scholar Ianda, T. F., Kalid, R. A., Pessoa, F. L. P., Medeiros, D. L., Santos, D. S., and Padula, A. D. (2024). A systematic review of approaches developed and used for the environmental assessment of biorefineries [Preprint].Res. Square. Available online at:https://www.researchsquare.com. Google Scholar Jaibumrung, K., Nilsalab, P., Gheewala, S. H., and Musikavong, C. (2023). Ecological footprint, water scarcity footprint, and benefit to cost ratio analysis towards sustainable rice production in Thailand.Sustain Prod. Consum.39, 79–92. doi:10.1016/j.spc.2023.04.019 CrossRef Full Text|Google Scholar Jenkin, M. E., Derwent, R. G., and Wallington, T. J. (2017). Photochemical ozone-creation potentials for volatile organic compounds: rationalization and estimation.Atmos. Environ.163, 128–137. doi:10.1016/j.atmosenv.2017.05.024 CrossRef Full Text|Google Scholar Junqueira, T. L., Chagas, M. F., Gouveia, V. L. R., Rezende, MCAF, Watanabe, M. D. B., Jesus, C. D. F., et al. (2017). Techno-economic analysis and climate change impacts of sugarcane biorefineries considering different time horizons.Biotechnol. Biofuels10, 50. doi:10.1186/s13068-017-0722-3 PubMed Abstract|CrossRef Full Text|Google Scholar Karaeva, A., Tolkou, A., Cioca, L. I., and Lakatos, E. S. (2023). Family ISO 14000 standards as a tool of achieving environmental sustainability of enterprises.IOP Conf. Ser. Earth Environ. Sci.1126, 012036. doi:10.1088/1755-1315/1126/1/012036 CrossRef Full Text|Google Scholar Karahan, S., and Gül, L. F. (2021). “Mapping current trends on gamification of cultural heritage,” inGame + design education(Cham:Springer International Publishing), 281–293. doi:10.1007/978-3-030-65060-5_23 CrossRef Full Text|Google Scholar Kim, K., Hourfar, F., Razik, A., Rizwan, A. H., Almansoori, M., Fowler, A., et al. (2023). Integration of biorefineries for microalgae and municipal-waste processing: a review.Energies16 (17), 6361. Google Scholar Kniss, A. R., and Coburn, C. W. (2015). Quantitative evaluation of the environmental impact quotient (EIQ) for comparing herbicides.PLoS One10 (6), e0131200. doi:10.1371/journal.pone.0131200 PubMed Abstract|CrossRef Full Text|Google Scholar Kokorevics, A. (2022). The research landscape of biorefinery: a scientometrics viewpoint.Mater Sci. Forum1071, 155–165. doi:10.4028/p-9e1389 CrossRef Full Text|Google Scholar Lari, G. M., Pastore, G., Haus, M., Ding, Y., Papadokonstantakis, S., Mondelli, C., et al. (2018). Environmental and economical perspectives of a glycerol biorefinery.Energy Environ. Sci.11 (5), 1012–1029. doi:10.1039/c7ee03116e CrossRef Full Text|Google Scholar Latina, E. A., and Estenssoro, F. (2015). El ecodesarrollo como concepto precursor del desarrollo sustentable y su influencia en América Latina.Univers. (Talca)30 (1), 81–99. doi:10.4067/s0718-23762015000100006 CrossRef Full Text|Google Scholar Leng, S., Lin, C., Yang, Y., Guo, Z., Zheng, Y., Yang, L., et al. (2017). “Environmental geography,” inEnvironmental geography(Singapore:Springer), 167–202. CrossRef Full Text|Google Scholar Liska, A. J., Yang, H. S., Bremer, V. R., Klopfenstein, T. J., Walters, D. T., Erickson, G. E., et al. (2009). Improvements in life-cycle energy efficiency and greenhouse-gas emissions of corn-ethanol.J. Ind. Ecol.13 (1), 58–74. doi:10.1111/j.1530-9290.2008.00105.x CrossRef Full Text|Google Scholar Loayza, J., and Silva, V. (2013). Los procesos industriales sostenibles y su contribución en la prevención de problemas ambientales.Ind. Data16 (1), 108–117. Available online at:https://www.redalyc.org/pdf/816/81629469013.pdf. Google Scholar Maier, S., Szerencsits, M., and Shahzad, K. (2017). Ecological evaluation of biogas from catch crops with the Sustainable Process Index.Energy Sustain Soc.7 (1), 1–12. Google Scholar Marques, A., Robuchon, M., Hellweg, S., Newbold, T., Beher, J., Bekker, S., et al. (2021). A research perspective towards a more complete biodiversity footprint: a report from the World Biodiversity Forum.Int. J. Life Cycle Assess.26 (2), 238–243. doi:10.1007/s11367-020-01846-1 CrossRef Full Text|Google Scholar McManus, C., and Baeta Neves, A. A. (2021). Funding research in Brazil.Scientometrics126 (1), 801–823. doi:10.1007/s11192-020-03762-5 CrossRef Full Text|Google Scholar Medrano, H., Tomás, M., Martorell, S., Flexas, J., Hernández, E., Rosselló, J., et al. (2015). From leaf to whole-plant water-use efficiency in complex canopies.Crop J.3 (3), 220–228. CrossRef Full Text|Google Scholar Meseguer-Sánchez, V., Gálvez-Sánchez, F. J., López-Martínez, G., and Molina-Moreno, V. (2021). Corporate social responsibility and sustainability: a bibliometric analysis of their interrelations.Sustainability13 (4), 1636. doi:10.3390/su13041636 CrossRef Full Text|Google Scholar Moncada, B. J., Aristizábal, M. V., and Cardona, C. A. (2016). Design strategies for sustainable biorefineries.Biochem. Eng. J.116, 122–134. doi:10.1016/j.bej.2016.06.009 CrossRef Full Text|Google Scholar Monroy, S. E., and Diaz, H. (2018). Time series-based bibliometric analysis of the dynamics of scientific production.Scientometrics115 (3), 1139–1159. doi:10.1007/s11192-018-2728-4 CrossRef Full Text|Google Scholar Moreno-Sader, K., Meramo-Hurtado, S. I., and González-Delgado, A. D. (2020). Environmental-sustainability analysis of chitosan microbeads production for pharmaceutical applications via computer-aided simulation, WAR and TRACI assessments.Sustain Chem. Pharm.15, 100212. doi:10.1016/j.scp.2020.100212 CrossRef Full Text|Google Scholar Mougenot, B., and Doussoulin, J. P. (2024). A bibliometric analysis of the Global Reporting Initiative (GRI): global trends in developed and developing countries.Environ. Dev. Sustain26 (3), 6543–6560. doi:10.1007/s10668-023-02974-y PubMed Abstract|CrossRef Full Text|Google Scholar Müller, L. J., Kätelhön, A., Bringezu, S., McCoy, S., Suh, S., Edwards, R., et al. (2020). The carbon footprint of the carbon feedstock CO2.Energy Environ. Sci.13 (9), 2979–2992. doi:10.1039/d0ee01530j CrossRef Full Text|Google Scholar Murphy, D. J., Raugei, M., Carbajales-Dale, M., and Estrada, B. R. (2022). Energy return on investment of major energy carriers: review and harmonization.Sustainability14 (12), 7098. doi:10.3390/su14127098 CrossRef Full Text|Google Scholar Nguyen, T. T. H., Kikuchi, Y., Noda, M., and Hirao, M. (2015). A new approach for the design and assessment of bio-based chemical processes toward sustainability.Ind. Eng. Chem. Res.54 (20), 5494–5504. doi:10.1021/ie503846q CrossRef Full Text|Google Scholar Niemeijer, D., and de Groot, R. S. (2008). A conceptual framework for selecting environmental indicator sets.Ecol. Indic.8 (1), 14–25. doi:10.1016/j.ecolind.2006.11.012 CrossRef Full Text|Google Scholar Nishant, R., Kennedy, M., and Corbett, J. (2020). Artificial intelligence for sustainability: challenges, opportunities, and a research agenda.Int. J. Inf. Manage.53, 102104. doi:10.1016/j.ijinfomgt.2020.102104 CrossRef Full Text|Google Scholar Nobanee, H., Al Hamadi, F. Y., Abdulaziz, F. A., Abukarsh, L. S., Alqahtani, A. F., Alsubaey, S. K., et al. (2021). A bibliometric analysis of sustainability and risk management.Sustainability13 (6), 3277. doi:10.3390/su13063277 CrossRef Full Text|Google Scholar Ögmundarson, Ó., Sukumara, S., Herrgård, M. J., and Fantke, P. (2020). Combining environmental and economic performance for bioprocess optimization.Trends Biotechnol.38 (11), 1203–1214. doi:10.1016/j.tibtech.2020.04.011 PubMed Abstract|CrossRef Full Text|Google Scholar Osman, A. I., Fang, B., Zhang, Y., Liu, Y., Yu, J., Farghali, M., et al. (2024). Life cycle assessment and techno-economic analysis of sustainable bioenergy production: a review.Environ. Chem. Lett.22 (3), 1115–1154. doi:10.1007/s10311-023-01694-z CrossRef Full Text|Google Scholar Ould, N., Ellili, D., and Ellili, N. (2023). Bibliometric analysis of sustainability papers: evidence from Environment, Development and Sustainability.Environ. Dev. Sustain26 (4), 8183–8209. doi:10.1007/s10668-023-03067-6 CrossRef Full Text|Google Scholar Panagos, P., Ballabio, C., Poesen, J., Lugato, E., Scarpa, S., Montanarella, L., et al. (2020). A soil-erosion indicator for supporting agricultural, environmental and climate policies in the European Union.Remote Sens.12 (9), 1365. doi:10.3390/rs12091365 CrossRef Full Text|Google Scholar Paredes-Cervantes, S. A., Barahona-Pérez, L. F., Barroso-Tanoira, F. G., and Ponce-Marbán, D. V. (2020). Biofuels and their potential in the Mexican energy market.Rev. Econ.37 (94), 35–56. Available online at:http://www.scielo.org.mx/scielo.php?script=sci_arttext&pid=S2395-87152020000100035. Google Scholar Parolo, P. D. B., Pan, R. K., Ghosh, R., Huberman, B. A., Kaski, K., and Fortunato, S. (2015). Attention decay in science.J. Informetr.9 (4), 734–745. doi:10.1016/j.joi.2015.07.006 CrossRef Full Text|Google Scholar Patra, S., Mishra, P., and Mahapatra, S. C. (2018). Delineation of groundwater potential zone for sustainable development: a case study from Ganga Alluvial Plain covering Hooghly district of India using remote sensing, geographic information system and analytic hierarchy process.J. Clean. Prod.172, 2485–2502. doi:10.1016/j.jclepro.2017.11.161 CrossRef Full Text|Google Scholar Pérez-Almada, D., Galán-Martín, Á., Contreras, M. M., and Castro, E. (2023). Integrated techno-economic and environmental assessment of biorefineries: a review.Sustain Energy Fuels7 (17), 4031–4050. CrossRef Full Text|Google Scholar Petrescu, L., and Cormos, C. (2014). Waste-reduction (WAR) algorithm for coal-gasification CCS: LCA study.J. Clean. Prod., 1–16. Google Scholar Petrescu, L., and Cormos, C. C. (2015). Waste-reduction algorithm for coal-gasification CCS: environmental impact.J. Clean. Prod.104, 220–235. doi:10.1016/j.jclepro.2014.08.064 CrossRef Full Text|Google Scholar Piao, R. S., Silva, V. L., Del Aguila, I. N., and de Burgos Jiménez, J. (2021). Green growth and agriculture in Brazil.Sustainability13 (3), 1162. doi:10.3390/su13031162 CrossRef Full Text|Google Scholar Posada, J. A., Patel, A. D., Roes, A., Blok, K., Faaij, A. P. C., and Patel, M. K. (2013). Potential of bioethanol as a chemical building block for biorefineries: preliminary sustainability assessment of 12 bioethanol-based products.Bioresour. Technol.135, 490–499. doi:10.1016/j.biortech.2012.09.058 PubMed Abstract|CrossRef Full Text|Google Scholar Provolo, G., Mattachini, G., Finzi, A., Cattaneo, M., Guido, V., and Riva, E. (2018). Global-warming and acidification-potential assessment of a collective manure-management system for bioenergy production and nitrogen removal in Northern Italy.Sustainability10 (10), 3653. doi:10.3390/su10103653 CrossRef Full Text|Google Scholar Rashad, F. M., Saleh, W. D., and Moselhy, M. A. (2010). Bioconversion of rice straw and certain agro-industrial wastes to amendments for organic farming systems: 1. Composting, quality, stability and maturity indices.Bioresour. Technol.101 (15), 5952–5960. doi:10.1016/j.biortech.2010.02.103 PubMed Abstract|CrossRef Full Text|Google Scholar Repiso, R., Moreno-Delgado, A., and Aguaded, I. (2021). Factors affecting the frequency of citation of an article.Iberoam. J. Sci. Meas. Commun.1 (1), 007. doi:10.47909/ijsmc.08 CrossRef Full Text|Google Scholar Robertson, G. P., Barry, P. J., Busta, F. F., Collier, R. J., Keen, N. T., Sederoff, R. R., et al. (2001). Moribund funding in agricultural research.Science291 (5511), 2089–2090. doi:10.1126/science.291.5511.2089c PubMed Abstract|CrossRef Full Text|Google Scholar Rohmanna, N. A., and Maharani, D. M. (2022). Waste-reduction performance of black soldier fly larvae on domestic waste.Biotropika10 (2), 141–145. Google Scholar Saberi, M. K., and Abedi, H. (2012). Accessibility and decay of web citations in five open-access ISI journals.Internet Res.22 (2), 234–247. doi:10.1108/10662241211214584 CrossRef Full Text|Google Scholar Sadollah, A., Nasir, M., and Geem, Z. W. (2020).Sustainability and optimization: from conceptual fundamentals to applications. Singapore:Springer. Google Scholar Saling, P. (2020). Assessing industrial biotechnology products with LCA and eco-efficiency.Adv. Biochem. Eng. Biotechnol.173, 325–357. doi:10.1007/10_2019_102 PubMed Abstract|CrossRef Full Text|Google Scholar Sánchez, O. J., Cardona, C. A., and Sánchez, D. L. (2012). Análisis de ciclo de vida y su aplicación a la producción de bioetanol: una aproximación cualitativa.Rev. Univ. EAFIT43 (146), 59–79. Available online at:http://publicaciones.eafit.edu.co/index.php/revista-universidad-eafit/article/view/773. Google Scholar Sandoval-Contreras, T., González Chávez, F., Poonia, A., Iñiguez-Moreno, M., and Aguirre-Güitrón, L. (2023). Avocado waste biorefinery: towards sustainable development.Recycl.8 (5), 81. CrossRef Full Text|Google Scholar Santibañez-Aguilar, J. E., González-Campos, J. B., Ponce-Ortega, J. M., Serna-González, M., and El-Halwagi, M. M. (2011). Optimal planning of a biomass conversion system considering economic and environmental aspects.Ind. Eng. Chem. Res.50 (14), 8558–8570. doi:10.1021/ie102195g CrossRef Full Text|Google Scholar Santibañez-Aguilar, J. E., González-Campos, J. B., Ponce-Ortega, J. M., Serna-González, M., and El-Halwagi, M. M. (2014). Optimal planning and site selection for distributed multiproduct biorefineries involving economic, environmental and social objectives.J. Clean. Prod.65, 270–294. doi:10.1016/j.jclepro.2013.08.004 CrossRef Full Text|Google Scholar Santoyo-Castelazo, E., and Azapagic, A. (2014). Sustainability assessment of energy systems: integrating environmental, economic and social aspects.J. Clean. Prod.80, 119–138. doi:10.1016/j.jclepro.2014.05.061 CrossRef Full Text|Google Scholar Saurat, M., and Ritthoff, M. (2013). Calculating MIPS 2.0.Resources2 (4), 581–607. doi:10.3390/resources2040581 CrossRef Full Text|Google Scholar Schoer, K., Weinzettel, J., Kovanda, J., Giegrich, J., and Lauwigi, C. (2012). Raw-material consumption of the European Union: concept and results.Environ. Sci. Technol.46 (16), 8903–8909. doi:10.1021/es300434c PubMed Abstract|CrossRef Full Text|Google Scholar Shahid, M. K., Batool, A., Kashif, A., Nawaz, M. H., Aslam, M., Iqbal, N., et al. (2021). Biofuels and biorefineries: development, application and future perspectives emphasizing the environmental and economic aspects.J. Environ. Manag.297, 113268. doi:10.1016/j.jenvman.2021.113268 PubMed Abstract|CrossRef Full Text|Google Scholar Shaltout, A. A., Hassan, S. K., Alomairy, S. E., Manousakas, M., Karydas, A. G., and Eleftheriadis, K. (2019). Correlation between inorganic pollutants in the suspended particulate matter (SPM) and fine particulate matter (PM2.5) collected from industrial and residential areas in Greater Cairo, Egypt.Air Qual. Atmos. Health12 (2), 241–250. doi:10.1007/s11869-018-0645-6 CrossRef Full Text|Google Scholar Sheldon, R. A. (2017). The E-factor 25 years on: the rise of green chemistry and sustainability.Green Chem.19 (1), 18–43. doi:10.1039/c6gc02157c CrossRef Full Text|Google Scholar Shilling, F., Khan, A., Juricich, R., Fong, V., and Hodge, D. (2015). “Water-sustainability indicators for California water management,” inWorld environmental and water resources congress 2015: floods, droughts, and ecosystems, 2341–2349. Available online at:https://ascelibrary.org/doi/10.1061/9780784479162.230. Google Scholar Singh, R., Srivastava, M., and Shukla, A. (2016). Environmental sustainability of bioethanol production from rice straw in India: a review.Renew. Sustain Energy Rev.54, 202–216. doi:10.1016/j.rser.2015.10.005 CrossRef Full Text|Google Scholar Slorach, P. C., Jeswani, H. K., Cuéllar-Franca, R., and Azapagic, A. (2019). Environmental sustainability of anaerobic digestion of household food waste.J. Environ. Manage236, 798–814. doi:10.1016/j.jenvman.2019.02.001 PubMed Abstract|CrossRef Full Text|Google Scholar Sneegas, G., Beckner, S., Brannstrom, C., Jepson, W., Lee, K., and Seghezzo, L. (2021). Using Q-methodology in environmental-sustainability research: a bibliometric analysis and systematic review.Ecol. Econ.180, 106864. doi:10.1016/j.ecolecon.2020.106864 CrossRef Full Text|Google Scholar Solarte-Toro, J. C., and Cardona Alzate, C. A. (2023). Sustainability of biorefineries: challenges and perspectives.Energies16 (9), 3786. doi:10.3390/en16093786 CrossRef Full Text|Google Scholar Solarte-Toro, J. C., Ortiz-Sanchez, M., and Cardona Alzate, C. A. (2023). Sustainability analysis of biorefineries based on country socio-economic and environmental context: a step-by-step way for the integral analysis of biomass-upgrading processes.Renew. Energy206, 1147–1157. doi:10.1016/j.renene.2023.02.065 CrossRef Full Text|Google Scholar Su, X., Chiang, P., Pan, S., Chen, G., Tao, Y., Wu, G., et al. (2019). Systematic approach to evaluating environmental and ecological technologies for wastewater treatment.Chemosphere218, 778–792. doi:10.1016/j.chemosphere.2018.11.108 PubMed Abstract|CrossRef Full Text|Google Scholar Tan, E. C. D., and Lamers, P. (2021). Circular-bioeconomy concepts: a perspective.Front. Sustain2, 1–8. doi:10.3389/frsus.2021.701509 CrossRef Full Text|Google Scholar Tuomisto, H. L., Allan, S. J., and Ellis, M. J. (2022). Prospective life-cycle assessment of a bioprocess design for cultured-meat production in hollow-fiber bioreactors.Sci. Total Environ.851, 158051. doi:10.1016/j.scitotenv.2022.158051 PubMed Abstract|CrossRef Full Text|Google Scholar Vanham, D., and Bidoglio, G. (2013). A review on the indicator water footprint for the EU28.Ecol. Indic.26, 61–75. doi:10.1016/j.ecolind.2012.10.021 CrossRef Full Text|Google Scholar Van Oers, L., Guinée, J., Giurco, D., and Schmidt, M. (2016). The abiotic-depletion potential: background, updates and future.Resources5 (1), 16. doi:10.3390/resources5010016 CrossRef Full Text|Google Scholar Van Schoubroeck, S., Van Dael, M., Van Passel, S., and Malina, R. (2018). A review of sustainability indicators for biobased chemicals.Renew. Sustain Energy Rev.94, 115–126. doi:10.1016/j.rser.2018.06.007 CrossRef Full Text|Google Scholar Vargas, Y. L. (2016). De los límites del crecimiento al desarrollo sostenible.Negonotas Docentes(8), 45–53. Google Scholar Wallin, J. A. (2005). Bibliometric methods: pitfalls and possibilities.Basic Clin. Pharmacol. Toxicol.97 (5), 261–275. doi:10.1111/j.1742-7843.2005.pto_139.x PubMed Abstract|CrossRef Full Text|Google Scholar Wowra, K., Hegel, E., Scharf, A., Grünberger, A., and Rosenthal, K. (2023). Estimating environmental impacts of early-stage bioprocesses.Trends Biotechnol.41 (9), 1199–1212. doi:10.1016/j.tibtech.2023.03.011 PubMed Abstract|CrossRef Full Text|Google Scholar Xiong, X., Yu, I. K. M., Tsang, D. C. W., Bolan, N. S., Ok, Y. S., Igalavithana, A. D., et al. (2019). Value-added chemicals from food-supply-chain wastes: state-of-the-art review and future prospects.Chem. Eng. J.375, 121983. doi:10.1016/j.cej.2019.121983 CrossRef Full Text|Google Scholar Xu, Q., Wang, Z., Dai, Y., Zhao, Q., Li, Y., Cui, P., et al. (2022). Economy, Exergy, energy consumption and environmental human toxicity potential assessment of vacuum extractive distillation coupled pervaporation process for separating Acetone/Isopropanol/Water Multi-azeotropes system.Sep. Purif. Technol.300, 121834. doi:10.1016/j.seppur.2022.121834 CrossRef Full Text|Google Scholar Xue, X., Hawkins, T. R., Ingwersen, W. W., and Smith, R. L. (2015). Demonstrating an approach for including pesticide use in life-cycle assessment: estimating human and ecosystem toxicity of pesticide use in Midwest corn farming.Int. J. Life Cycle Assess.20 (8), 1117–1126. doi:10.1007/s11367-015-0902-y CrossRef Full Text|Google Scholar Zhu, J., and Liu, W. (2020). A tale of two databases: the use of Web of Science and Scopus in academic papers.Scientometrics123 (1), 321–335. doi:10.1007/s11192-020-03387-8 CrossRef Full Text|Google Scholar Zhu, Z., Yao, X., Qin, Y., Lu, Z., Ma, Q., Zhao, X., et al. (2022). Visualization and mapping of literature on the scientific analysis of wall paintings: a bibliometric analysis from 2011 to 2021.Herit. Sci.10, 105–113. doi:10.1186/s40494-022-00735-0 PubMed Abstract|CrossRef Full Text|Google Scholar Keywords:environmental indicators, biorefinery, bioprocesses, Scopus, bibliometrix, VOSviewer Citation:Alviz-Meza A, Rojas-Flores S and González-Delgado ÁD (2025) Environmental sustainability indicators applied to bioprocesses: a bibliometric analysis (2005–2024).Front. Chem. Eng.7:1605037. doi: 10.3389/fceng.2025.1605037 Received:02 April 2025;Accepted:08 May 2025;Published:20 May 2025. Edited by: Reviewed by: Copyright© 2025 Alviz-Meza, Rojas-Flores and González-Delgado. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY).The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Ángel Darío González-Delgado,YWdvbnphbGV6ZDFAdW5pY2FydGFnZW5hLmVkdS5jbw== Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract 1 Introduction 2 Materials and methods 3 Results and discussion 4 Environmental sustainability applied to bioprocesses and trending topics 5 Conclusion Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher’s note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}