{"id": 2176, "name": "WBAP - 820AM - Dallas", "domain": "wbap.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.wbap.com/2025/06/09/ice-dallas-deports-122-chinese-nationals-including-convicted-murderers-and-human-smugglers-agency-says/", "title": "Ice Dallas Deports 122 Chinese Nationals Including Convicted Murderers And Human Smugglers Agency Says", "content": "WeekdayScheduleWBAP’s Morning News with Ernie, Carla and Hal JayThe Casey Bartholomew ShowThe VINCE ShowJames ParkerMark LevinThe Joe Pags ShowWBAP Night ShowRed Eye Radio Schedule WBAP’s Morning News with Ernie, Carla and Hal Jay The Casey Bartholomew Show The VINCE Show James Parker Mark Levin The Joe Pags Show WBAP Night Show Red Eye Radio Schedule WBAP’s Morning News with Ernie, Carla and Hal Jay The Casey Bartholomew Show The VINCE Show James Parker Mark Levin The Joe Pags Show WBAP Night Show Red Eye Radio WeekendWeekend ScheduleBill Kinder Hunting ShowWBAP’s Saturday Morning NewsCowley FinancialCar Pro ShowThe Retire Simply Radio ShowTexas Home Improvement Show with Jim DuttonDFW Retirement RadioDFW Real Estate Weekly with Todd TramonteNetWorth Radio with Spencer McGowanDisrupt the Norm RadioThe Best of Chris PlanteAmerica At Night with Rich ValdésRed Eye RadioNeil Sperry’s Texas GardeningCommon Sense InvestingLifestyles UnlimitedDeWitt & Dunn Financial HourNobodybeatsmyrates.com ShowTotal Wealth AcademyReal Estate TodaySell your CompanyBen Ferguson Weekend Schedule Bill Kinder Hunting Show WBAP’s Saturday Morning News Cowley Financial Car Pro Show The Retire Simply Radio Show Texas Home Improvement Show with Jim Dutton DFW Retirement Radio DFW Real Estate Weekly with Todd Tramonte NetWorth Radio with Spencer McGowan Disrupt the Norm Radio The Best of Chris Plante America At Night with Rich Valdés Red Eye Radio Neil Sperry’s Texas Gardening Common Sense Investing Lifestyles Unlimited DeWitt & Dunn Financial Hour Nobodybeatsmyrates.com Show Total Wealth Academy Real Estate Today Sell your Company Ben Ferguson Weekend Schedule Bill Kinder Hunting Show WBAP’s Saturday Morning News Cowley Financial Car Pro Show The Retire Simply Radio Show Texas Home Improvement Show with Jim Dutton DFW Retirement Radio DFW Real Estate Weekly with Todd Tramonte NetWorth Radio with Spencer McGowan Disrupt the Norm Radio The Best of Chris Plante America At Night with Rich Valdés Red Eye Radio Neil Sperry’s Texas Gardening Common Sense Investing Lifestyles Unlimited DeWitt & Dunn Financial Hour Nobodybeatsmyrates.com Show Total Wealth Academy Real Estate Today Sell your Company Ben Ferguson PodcastsWBAP Morning News PodcastThe Casey Bartholomew PodcastThe James Parker PodcastImpact TexasThe Car Pro ShowTravel With HawkeyeAudio On-Demand WBAP Morning News Podcast The Casey Bartholomew Podcast The James Parker Podcast Impact Texas The Car Pro Show Travel With Hawkeye Audio On-Demand WBAP Morning News Podcast The Casey Bartholomew Podcast The James Parker Podcast Impact Texas The Car Pro Show Travel With Hawkeye Audio On-Demand News24/7 Newsroom NewsWBAP News Staff 24/7 Newsroom News WBAP News Staff 24/7 Newsroom News WBAP News Staff WeatherDaily ForecastRadar Daily Forecast Radar Daily Forecast Radar ContestsContests – Text to WinListen to WinLocal Contest Rules Contests – Text to Win Listen to Win Local Contest Rules Contests – Text to Win Listen to Win Local Contest Rules EventsPet of the Week Pet of the Week Pet of the Week ConnectStation InformationStation HistoryAdvertising Station Information Station History Advertising Station Information Station History Advertising **ICE Dallas deports 122 Chinese Nationals, including convicted murderers and human smugglers, agency says** From Media Partner WFAA News 8: The group included 96 men and 26 women, from across the U.S., many with criminal convictions and final orders of removal, ICE Dallas said. Credit: ICE Dallas ICE Dallas leads DHS’s effort to remove 122 illegal aliens aboard a Special High Risk Charter flight, the agency said. Author: Krista Summerville Published: 4:24 PM CDT June 9, 2025 Updated: 4:24 PM CDT June 9, 2025 DALLAS — In a large-scale operation on June 3, U.S. Immigration and Customs Enforcement (ICE) put 122 Chinese nationals on a flight back to China — part of a nationwide push by the Department of Homeland Security to remove people living in the country illegally. The group included 96 men and 26 women, ranging in age from 19 to 68, from across the U.S., many with criminal convictions and final orders of removal, ICE Dallas said in a news release. “Through our interagency partnerships and coordination across ICE field offices, we have successfully removed these individuals, many who were convicted of egregious crimes,” said ICE Enforcement and Removal Operations Dallas acting Field Office Director Josh Johnson. The deportees were detained at ICE facilities across the country and had received final removal orders for violating U.S. immigration laws, the agency said. Credit: ICE Dallas ICE Dallas leads DHS effort removing 122 illegal aliens aboard a Special High Risk Charter flight. “Our colleagues at ICE come to work every day to identify, arrest and remove illegal aliens who attempt to circumvent our nation’s immigration laws,” Johnson said. ICE Dallas said among those aboard were individuals convicted of serious crimes, including murder, rape, human smuggling, drug trafficking, and lewd acts with a minor. Notable removals include: A 47-year-old male with a conviction for murder. A 49-year-old male with a conviction for drug trafficking. A 27-year-old male with a conviction for rape. A 50-year-old female with a conviction for bribery. A 55-year-old male with a conviction for human smuggling. “This operation not only enhances the public safety of our communities across the U.S. but also strengthens national security,” Johnson said. (Copyright 2025 WBAP/KLIF Newsroom News. All rights reserved. Contains material from the Associated Press.) WBAP News Listener PollWill Russia go Nuclear in the war against Ukraine? **WBAP News Listener Poll** **WBAP News Listener Poll** Privacy Policy Terms of Service General Contest Rules Advertise With Us Employment Opportunities Station Information FCC Public File FCC Applications EEO Public File Report Cumulus Media Corporate Copyright 2019 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}