{"id": 1547, "name": "Wall Street on Parade", "domain": "wallstreetonparade.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wallstreetonparade.com/2025/02/in-trump-1-0-the-state-department-used-taxpayer-money-to-publish-a-book-elevating-elon-musk-to-a-superhero-it-was-funded-by-usaid-the-agency-musk-wants-to-quickly-shut-down/", "title": "In Trump 1 0 The State Department Used Taxpayer Money To Publish A Book Elevating Elon Musk To A Superhero It Was Funded By Usaid The Agency Musk Wants To Quickly Shut Down", "content": "Home About/Contact/ Books **In Trump 1.0, the State Department Used Taxpayer Money to Publish a Book Elevating Elon Musk to a Superhero; It Was Funded by USAID, the Agency Musk Wants to Quickly Shut Down** ByPam Martens andRuss Martens: February 25, 2025 ~ During Donald Trump’s first term as president, while Mike Pompeo was serving as his Secretary of State, the State Department authorized a government contract on September 23, 2019 to translate and publish a book for young people that lavished praise on Elon Musk as an inspiring role model. The book’s title was: “Elon Musk and the Quest for a Fantastic Future, Young Readers Edition.” It was authored by then Bloomberg/Businessweek writer, Ashlee Vance, and based on his New York Times bestseller for adults, “Elon Musk: Tesla, SpaceX and The Quest for a Fantastic Future.” Curiously, however, the book wasn’t for U.S. children or even children on the same continent. The State Department award went to an organization called Steps to Success Public Association in Karakol, Kyrgyzstan. Thefederal account from which the $17,054 contract came was USAID, the federal agency that has been gutted and reputationally savaged as riddled with fraud, waste and abuse by Elon Musk. The Associated Press, which is now banned from White House press conferences by the Trump administration,reported on February 3that Musk had said this recently about USAID: “It became apparent that it’s not an apple with a worm in it. What we have is just a ball of worms. You’ve got to basically get rid of the whole thing. It’s beyond repair. We’re shutting it down.” The U.S. State Department carries this statement on Kyrgyzstan: “The United States established diplomatic relations with Kyrgyzstan in 1991 following the nation’s independence from the Soviet Union. The United States supports Kyrgyzstan in its development of an inclusive democracy based upon the rule of law and respect for human rights. Kyrgyzstan’s 2017 presidential election marked the first peaceful transfer of presidential power from one democratically-elected president to another in post-Soviet Central Asia. Significant impediments to Kyrgyzstan’s development include corruption, aging infrastructure, high unemployment that fuels labor migration and dependence on remittances, and endemic poverty. Kyrgyzstan, however, benefits from a robust civil society and a relatively free media sector.” Despite Musk receiving billions of dollars in classified federal contracts through his rocket and satellite company, SpaceX, the Wall Street Journal broke the bombshell news in the fall of last year that Musk has been secretly speaking with Vladimir Putin since 2022 – despite Putin being on a U.S. sanction list and Musk holding classified information about U.S. technology development. The speed at which Musk has endeavored to get into the computer systems of USAID, shut it down, and even strip its name from its building – raises the question as to what exactly resides in those files that Musk and/or Trump are so hell bent on keeping from the American people. Musk may rue the day that he and his chainsaw came into the crosshairs of Senator Elizabeth Warren (D-MA), the former Harvard Law Professor who is the ranking member of the U.S. Senate Banking Committee. Warren and Senator Ron Wyden (D-OR), ranking member of the Senate Finance Committee, have received acknowledgement from the Government Accountability Office (GAO), thatit has opened an investigationinto Musk’s Department of Government Efficiency (DOGE) for it tapping into the computers that run the payment system of the U.S. Treasury. Today, at 2 p.m., Warren has convened a forum in the Senate Dirksen Office Building in Washington, D.C. to investigate the consequences of President Trump’s and Elon Musk’s efforts to eliminate the Consumer Financial Protection Bureau (CFPB), the federal agency that has returned over $21 billion to Americans who have been scammed by mortgage lenders, credit card companies, megabanks and other financial predators. You canwatch the livestream of the forum here. Comments are closed. © 2025 Wall Street On Parade. Wall Street On Parade ® is registered in the U.S. Patent and Trademark Office. WallStreetOnParade.com is a financial news website operated by Russ and Pam Martens to help the investing public better understand systemic corruption on Wall Street. Ms. Martens is a former Wall Street veteran with a background in journalism. Mr. Martens' career spans four decades in printing and publishing management. Dow Jones Industrial Average Intraday Trading Level, Stock Quotes and Breaking Market News Recent PostsSenator Chris Murphy Charges that Trump “Has Opened a Channel for Bribery”Congressman Casten: Trump’s Assault on the Rule of Law Is Causing Capital Flight Out of U.S. by Foreign InvestorsTrump’s Approval Rating Drops to 80-Year Low; IMF Says U.S. Tariffs Now Exceed the Highs During the Great DepressionNasdaq Has Lost More than 3,000 Points Since Trump’s First Full Day in Office in 2025; the Pain Has Barely BegunThe Bond Crisis Last Week Was a Global No-Confidence Vote in U. S. President Donald TrumpTrump’s Tariff Plan Guts $5 Trillion in Stock Value in Two Days; Senator Warren Calls for Emergency Action Before Markets Open on MondayTrump’s Attacks on Big Law, Universities, and the Media Have a Common Goal: Silence Dissent Against Authoritarian RuleTrump Administration Gives All Clear to Laundering Money through Shell Companies and Bribing Foreign OfficialsFour Megabanks on Wall Street Hold $3.2 Trillion in Uninsured Deposits – Which May Explain Senator Schumer’s Pivot to the GOP to Stop a Government ShutdownHere’s What Came Crashing Down Yesterday for Trump’s “Genius” Guy, Elon Musk: Tesla Stock, Access to Twitter (X), His Years of Secret Calls with PutinAfter Banning the Associated Press, Trump Is Now Targeting Specific Journalists That He Wants to See FiredClosely Watched Atlanta Fed Model Predicts Negative U.S. Growth in First QuarterTrump’s Gangster Diplomacy Makes Front Page Headlines Around the GlobeWho Benefits Alongside Elon Musk If He Succeeds in Killing the CFPB: the Megabanks on Wall Street that Underwrite His Tesla Stock OfferingsIn Trump 1.0, the State Department Used Taxpayer Money to Publish a Book Elevating Elon Musk to a Superhero; It Was Funded by USAID, the Agency Musk Wants to Quickly Shut DownNews Host Joy Reid Raises Threat of Trump Selling U.S. to Putin; Ten Days Later Her Show Is CancelledElon Musk’s DOGE Appears to Be Violating a Court Order; It Has Taken Down Hundreds of YouTube Videos that Educate Americans on How to Avoid Being SwindledBarron’s Releases Audio of Jamie Dimon Cursing Out His Workers at a Town Hall, as Dimon Plans to Dump Another One Million JPM SharesThere’s One Federal Investigative Agency that Neither Trump nor Elon Musk Can Touch: It Just Opened an Investigation into DOGEElon Musk’s Companies Were Under Investigation by Five Inspectors General When the Trump Administration Fired Them and Made Musk the InvestigatorDonald Trump Gives the Greenlight to Goldman Sachs and JPMorgan Chase to Return to Bribing Foreign OfficialsAfter Tech Geeks Built a Back Door to Loot Billions from FTX, Republicans Refuse to Investigate What Elon Musk’s Tech-Squad Did Inside the U.S. Treasury’s Payment SystemFormer Prosecutor, Now U.S. Senator, Informs Tesla That CEO Musk May Be Violating Federal Law and to “Preserve All Records”Trump’s Hedge Fund Guy Is Now Overseeing the U.S. Treasury, IRS, OCC, U.S. Mint, FinCEN, F-SOC, and the Consumer Financial Protection BureauAs Elon Musk Begins Shutting Down Payments to Federal Contractors, a Strange Money Trail Emerges to His Operatives Inside the U.S. Treasury’s Payment SystemJPMorgan Chase Charged by Yet Another Internal Whistleblower with Cooking the BooksWe Asked Google’s AI Search Model, Gemini, Questions About the Fed and Wall Street Megabanks: It Got the Answers Dead WrongWith Trump and Melania’s Crypto Coins Likely to Raise Legal Challenges, Why Didn’t Trump Fire the SEC’s Inspector General in His Purge of IGs?Fossil Fuel Industry Could End Up Paying Tens of Billions for LA Wildfires and Deceiving the Public on Climate Change for DecadesIt’s Being Called the Biggest Grift by a President in U.S. History: Trump and First Lady Launch their Own Crypto CoinsTrump Plans to Install a Fracking CEO to Head the Energy Department and Declare a National Emergency on Energy to Gain Vast PowersFossil Fuel Money Played a Role in the Los Angeles Fires and the Push to Install Pete Hegseth as Secretary of DefenseWhen It Comes to Wealth Retention in Retirement, Concrete May Be the New GoldWall Street Watchdog Warns “Clock Is Ticking on a Coming Catastrophic Financial Crash”Wall Street Is Sending the Same Message to Americans on Fossil Fuel Financing that It Sent on Cigarettes: Drop DeadIn a Six-Week Span, this Dark Pool with a Curious Past Traded 3.7 Billion SharesWall Street’s Lobby Firm Hired Eugene Scalia of Gibson Dunn to Sue the Fed for Jamie DimonPostmaster General Louis DeJoy Made $561,051 in Compensation in 2024, as Mail Costs Spiked and Delivery DeterioratedFed Chair Jay Powell Sends a Bold Message to Trump and Tanks the Dow by 1123 PointsThe Head of Fixed Income at T. Rowe Price Makes the Scary Case for the 10-Year Treasury to Spike to 6 Percent$663 Billion in Cash Assets Have Gone Poof at the Largest U.S. BanksDonald Trump to Ring Bell at New York Stock Exchange Today as Hit List Posters Appear in Manhattan Targeting Wall Street CEOsTrump Has a Slush Fund to Prop Up the Dollar – Will He Use It to Prop Up Bitcoin Instead?A CEO Assassination; a Billionaire Heiress/NYPD Commissioner; a Secret Wall Street Spy Center – Here’s How They’re ConnectedDespite More than 1600 Tech Scientists Signing a Letter Calling Crypto a Sham, Trump Names a Crypto Cheerleader for SEC ChairThe Fed Rings a Warning Bell: Hedge Funds and Life Insurers Are Reporting Historic LeverageTrump’s Nominee for FBI Director, Kash Patel, Has Businesses Financially Intertwined with TrumpDonald Trump Is at Risk of Getting Named in a Fossil Fuels Conspiracy LawsuitTrump Is Having Difficulty Getting a Lawyer to Accept the Nomination for SEC Chair: Here’s WhyDonald Trump’s Treasury Nominee Made Big Bets this Year on Chinese Stocks and a Big Short on the U.S. Market **Recent Posts** Senator Chris Murphy Charges that Trump “Has Opened a Channel for Bribery” Congressman Casten: Trump’s Assault on the Rule of Law Is Causing Capital Flight Out of U.S. by Foreign Investors Trump’s Approval Rating Drops to 80-Year Low; IMF Says U.S. Tariffs Now Exceed the Highs During the Great Depression Nasdaq Has Lost More than 3,000 Points Since Trump’s First Full Day in Office in 2025; the Pain Has Barely Begun The Bond Crisis Last Week Was a Global No-Confidence Vote in U. S. President Donald Trump Trump’s Tariff Plan Guts $5 Trillion in Stock Value in Two Days; Senator Warren Calls for Emergency Action Before Markets Open on Monday Trump’s Attacks on Big Law, Universities, and the Media Have a Common Goal: Silence Dissent Against Authoritarian Rule Trump Administration Gives All Clear to Laundering Money through Shell Companies and Bribing Foreign Officials Four Megabanks on Wall Street Hold $3.2 Trillion in Uninsured Deposits – Which May Explain Senator Schumer’s Pivot to the GOP to Stop a Government Shutdown Here’s What Came Crashing Down Yesterday for Trump’s “Genius” Guy, Elon Musk: Tesla Stock, Access to Twitter (X), His Years of Secret Calls with Putin After Banning the Associated Press, Trump Is Now Targeting Specific Journalists That He Wants to See Fired Closely Watched Atlanta Fed Model Predicts Negative U.S. Growth in First Quarter Trump’s Gangster Diplomacy Makes Front Page Headlines Around the Globe Who Benefits Alongside Elon Musk If He Succeeds in Killing the CFPB: the Megabanks on Wall Street that Underwrite His Tesla Stock Offerings In Trump 1.0, the State Department Used Taxpayer Money to Publish a Book Elevating Elon Musk to a Superhero; It Was Funded by USAID, the Agency Musk Wants to Quickly Shut Down News Host Joy Reid Raises Threat of Trump Selling U.S. to Putin; Ten Days Later Her Show Is Cancelled Elon Musk’s DOGE Appears to Be Violating a Court Order; It Has Taken Down Hundreds of YouTube Videos that Educate Americans on How to Avoid Being Swindled Barron’s Releases Audio of Jamie Dimon Cursing Out His Workers at a Town Hall, as Dimon Plans to Dump Another One Million JPM Shares There’s One Federal Investigative Agency that Neither Trump nor Elon Musk Can Touch: It Just Opened an Investigation into DOGE Elon Musk’s Companies Were Under Investigation by Five Inspectors General When the Trump Administration Fired Them and Made Musk the Investigator Donald Trump Gives the Greenlight to Goldman Sachs and JPMorgan Chase to Return to Bribing Foreign Officials After Tech Geeks Built a Back Door to Loot Billions from FTX, Republicans Refuse to Investigate What Elon Musk’s Tech-Squad Did Inside the U.S. Treasury’s Payment System Former Prosecutor, Now U.S. Senator, Informs Tesla That CEO Musk May Be Violating Federal Law and to “Preserve All Records” Trump’s Hedge Fund Guy Is Now Overseeing the U.S. Treasury, IRS, OCC, U.S. Mint, FinCEN, F-SOC, and the Consumer Financial Protection Bureau As Elon Musk Begins Shutting Down Payments to Federal Contractors, a Strange Money Trail Emerges to His Operatives Inside the U.S. Treasury’s Payment System JPMorgan Chase Charged by Yet Another Internal Whistleblower with Cooking the Books We Asked Google’s AI Search Model, Gemini, Questions About the Fed and Wall Street Megabanks: It Got the Answers Dead Wrong With Trump and Melania’s Crypto Coins Likely to Raise Legal Challenges, Why Didn’t Trump Fire the SEC’s Inspector General in His Purge of IGs? Fossil Fuel Industry Could End Up Paying Tens of Billions for LA Wildfires and Deceiving the Public on Climate Change for Decades It’s Being Called the Biggest Grift by a President in U.S. History: Trump and First Lady Launch their Own Crypto Coins Trump Plans to Install a Fracking CEO to Head the Energy Department and Declare a National Emergency on Energy to Gain Vast Powers Fossil Fuel Money Played a Role in the Los Angeles Fires and the Push to Install Pete Hegseth as Secretary of Defense When It Comes to Wealth Retention in Retirement, Concrete May Be the New Gold Wall Street Watchdog Warns “Clock Is Ticking on a Coming Catastrophic Financial Crash” Wall Street Is Sending the Same Message to Americans on Fossil Fuel Financing that It Sent on Cigarettes: Drop Dead In a Six-Week Span, this Dark Pool with a Curious Past Traded 3.7 Billion Shares Wall Street’s Lobby Firm Hired Eugene Scalia of Gibson Dunn to Sue the Fed for Jamie Dimon Postmaster General Louis DeJoy Made $561,051 in Compensation in 2024, as Mail Costs Spiked and Delivery Deteriorated Fed Chair Jay Powell Sends a Bold Message to Trump and Tanks the Dow by 1123 Points The Head of Fixed Income at T. Rowe Price Makes the Scary Case for the 10-Year Treasury to Spike to 6 Percent $663 Billion in Cash Assets Have Gone Poof at the Largest U.S. Banks Donald Trump to Ring Bell at New York Stock Exchange Today as Hit List Posters Appear in Manhattan Targeting Wall Street CEOs Trump Has a Slush Fund to Prop Up the Dollar – Will He Use It to Prop Up Bitcoin Instead? A CEO Assassination; a Billionaire Heiress/NYPD Commissioner; a Secret Wall Street Spy Center – Here’s How They’re Connected Despite More than 1600 Tech Scientists Signing a Letter Calling Crypto a Sham, Trump Names a Crypto Cheerleader for SEC Chair The Fed Rings a Warning Bell: Hedge Funds and Life Insurers Are Reporting Historic Leverage Trump’s Nominee for FBI Director, Kash Patel, Has Businesses Financially Intertwined with Trump Donald Trump Is at Risk of Getting Named in a Fossil Fuels Conspiracy Lawsuit Trump Is Having Difficulty Getting a Lawyer to Accept the Nomination for SEC Chair: Here’s Why Donald Trump’s Treasury Nominee Made Big Bets this Year on Chinese Stocks and a Big Short on the U.S. Market **Recent Posts** Senator Chris Murphy Charges that Trump “Has Opened a Channel for Bribery” Congressman Casten: Trump’s Assault on the Rule of Law Is Causing Capital Flight Out of U.S. by Foreign Investors Trump’s Approval Rating Drops to 80-Year Low; IMF Says U.S. Tariffs Now Exceed the Highs During the Great Depression Nasdaq Has Lost More than 3,000 Points Since Trump’s First Full Day in Office in 2025; the Pain Has Barely Begun The Bond Crisis Last Week Was a Global No-Confidence Vote in U. S. President Donald Trump Trump’s Tariff Plan Guts $5 Trillion in Stock Value in Two Days; Senator Warren Calls for Emergency Action Before Markets Open on Monday Trump’s Attacks on Big Law, Universities, and the Media Have a Common Goal: Silence Dissent Against Authoritarian Rule Trump Administration Gives All Clear to Laundering Money through Shell Companies and Bribing Foreign Officials Four Megabanks on Wall Street Hold $3.2 Trillion in Uninsured Deposits – Which May Explain Senator Schumer’s Pivot to the GOP to Stop a Government Shutdown Here’s What Came Crashing Down Yesterday for Trump’s “Genius” Guy, Elon Musk: Tesla Stock, Access to Twitter (X), His Years of Secret Calls with Putin After Banning the Associated Press, Trump Is Now Targeting Specific Journalists That He Wants to See Fired Closely Watched Atlanta Fed Model Predicts Negative U.S. Growth in First Quarter Trump’s Gangster Diplomacy Makes Front Page Headlines Around the Globe Who Benefits Alongside Elon Musk If He Succeeds in Killing the CFPB: the Megabanks on Wall Street that Underwrite His Tesla Stock Offerings In Trump 1.0, the State Department Used Taxpayer Money to Publish a Book Elevating Elon Musk to a Superhero; It Was Funded by USAID, the Agency Musk Wants to Quickly Shut Down News Host Joy Reid Raises Threat of Trump Selling U.S. to Putin; Ten Days Later Her Show Is Cancelled Elon Musk’s DOGE Appears to Be Violating a Court Order; It Has Taken Down Hundreds of YouTube Videos that Educate Americans on How to Avoid Being Swindled Barron’s Releases Audio of Jamie Dimon Cursing Out His Workers at a Town Hall, as Dimon Plans to Dump Another One Million JPM Shares There’s One Federal Investigative Agency that Neither Trump nor Elon Musk Can Touch: It Just Opened an Investigation into DOGE Elon Musk’s Companies Were Under Investigation by Five Inspectors General When the Trump Administration Fired Them and Made Musk the Investigator Donald Trump Gives the Greenlight to Goldman Sachs and JPMorgan Chase to Return to Bribing Foreign Officials After Tech Geeks Built a Back Door to Loot Billions from FTX, Republicans Refuse to Investigate What Elon Musk’s Tech-Squad Did Inside the U.S. Treasury’s Payment System Former Prosecutor, Now U.S. Senator, Informs Tesla That CEO Musk May Be Violating Federal Law and to “Preserve All Records” Trump’s Hedge Fund Guy Is Now Overseeing the U.S. Treasury, IRS, OCC, U.S. Mint, FinCEN, F-SOC, and the Consumer Financial Protection Bureau As Elon Musk Begins Shutting Down Payments to Federal Contractors, a Strange Money Trail Emerges to His Operatives Inside the U.S. Treasury’s Payment System JPMorgan Chase Charged by Yet Another Internal Whistleblower with Cooking the Books We Asked Google’s AI Search Model, Gemini, Questions About the Fed and Wall Street Megabanks: It Got the Answers Dead Wrong With Trump and Melania’s Crypto Coins Likely to Raise Legal Challenges, Why Didn’t Trump Fire the SEC’s Inspector General in His Purge of IGs? Fossil Fuel Industry Could End Up Paying Tens of Billions for LA Wildfires and Deceiving the Public on Climate Change for Decades It’s Being Called the Biggest Grift by a President in U.S. History: Trump and First Lady Launch their Own Crypto Coins Trump Plans to Install a Fracking CEO to Head the Energy Department and Declare a National Emergency on Energy to Gain Vast Powers Fossil Fuel Money Played a Role in the Los Angeles Fires and the Push to Install Pete Hegseth as Secretary of Defense When It Comes to Wealth Retention in Retirement, Concrete May Be the New Gold Wall Street Watchdog Warns “Clock Is Ticking on a Coming Catastrophic Financial Crash” Wall Street Is Sending the Same Message to Americans on Fossil Fuel Financing that It Sent on Cigarettes: Drop Dead In a Six-Week Span, this Dark Pool with a Curious Past Traded 3.7 Billion Shares Wall Street’s Lobby Firm Hired Eugene Scalia of Gibson Dunn to Sue the Fed for Jamie Dimon Postmaster General Louis DeJoy Made $561,051 in Compensation in 2024, as Mail Costs Spiked and Delivery Deteriorated Fed Chair Jay Powell Sends a Bold Message to Trump and Tanks the Dow by 1123 Points The Head of Fixed Income at T. Rowe Price Makes the Scary Case for the 10-Year Treasury to Spike to 6 Percent $663 Billion in Cash Assets Have Gone Poof at the Largest U.S. Banks Donald Trump to Ring Bell at New York Stock Exchange Today as Hit List Posters Appear in Manhattan Targeting Wall Street CEOs Trump Has a Slush Fund to Prop Up the Dollar – Will He Use It to Prop Up Bitcoin Instead? A CEO Assassination; a Billionaire Heiress/NYPD Commissioner; a Secret Wall Street Spy Center – Here’s How They’re Connected Despite More than 1600 Tech Scientists Signing a Letter Calling Crypto a Sham, Trump Names a Crypto Cheerleader for SEC Chair The Fed Rings a Warning Bell: Hedge Funds and Life Insurers Are Reporting Historic Leverage Trump’s Nominee for FBI Director, Kash Patel, Has Businesses Financially Intertwined with Trump Donald Trump Is at Risk of Getting Named in a Fossil Fuels Conspiracy Lawsuit Trump Is Having Difficulty Getting a Lawyer to Accept the Nomination for SEC Chair: Here’s Why Donald Trump’s Treasury Nominee Made Big Bets this Year on Chinese Stocks and a Big Short on the U.S. Market receive free wall street on parade emailed news alerts once dailyLeave This Blank:Leave This Blank Too:Do Not Change This:Your email: **receive free wall street on parade emailed news alerts once daily** Your email: **receive free wall street on parade emailed news alerts once daily** Your email: Important: Important: Important: To make certain that your email provider does not block emails fromWall Street On Parade, or place them in your spam folder, please put alerts@wallstreetonparade.com in your email contact list or address book before you subscribe. To make certain that your email provider does not block emails fromWall Street On Parade, or place them in your spam folder, please put alerts@wallstreetonparade.com in your email contact list or address book before you subscribe. To make certain that your email provider does not block emails fromWall Street On Parade, or place them in your spam folder, please put alerts@wallstreetonparade.com in your email contact list or address book before you subscribe. From December 2007 through July 2010, the Federal Reserve secretly funneled $16.1 trillion in emergency revolving loans to the megabanks on Wall Street and their foreign counterparts at below-market interest rates. The Fed took this action without a single vote in Congress. The Fed then battled in court for more than two years to keep these unprecedented giveaways a secret from the American people. It lost on its arguments for secrecy at both the U.S. District and Appellate Court level. The U.S. Supreme Court declined to hear a related case advocating secrecy that was brought by a megabank front group, the Clearing House Association.Instead of punishment for their corrupt actions that crashed the U.S. economy in 2008, the Wall Street megabanks were rewarded with secret bailouts.The Dodd-Frank financial reform legislation of 2010 was supposed to stop these trillion-dollar giveaways from the Fed to the one percent on Wall Street. But the trillion-dollar bailouts at the Fed started up again on September 17, 2019 in the form of emergency repo loans.The Fed’s emergency repo loan operations came months before the COVID-19 virus had emerged in China or anywhere else in the world. That strongly suggests to us that Wall Street megabanks had a serious problem independent of the virus outbreak.Mainstream media refused to cover the repo loan bailouts in any depth, and censored the details when the Fed was forced under law to reveal that it had, once again, funneled trillions of dollars in revolving loans to Wall Street in the fourth quarter of 2019 and beyond.The Fed’s multi-trillion-dollar emergency bailout programs from 2008 were reactivated again for the COVID-19 pandemic in 2020, marking the third massive bailout of Wall Street by the Fed in a dozen years.This is unprecedented in the 111-year history of the Fed, meaning the financial system of the U.S. is dramatically on the wrong course.Wall Street On Paradeviews these Fed bailouts as an integral part of an institutionalized wealth transfer system from the 99 percent to the 1 percent.For our ongoing archive of articles on the Fed’s unprecedented bailouts, click on this text.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ From December 2007 through July 2010, the Federal Reserve secretly funneled $16.1 trillion in emergency revolving loans to the megabanks on Wall Street and their foreign counterparts at below-market interest rates. The Fed took this action without a single vote in Congress. The Fed then battled in court for more than two years to keep these unprecedented giveaways a secret from the American people. It lost on its arguments for secrecy at both the U.S. District and Appellate Court level. The U.S. Supreme Court declined to hear a related case advocating secrecy that was brought by a megabank front group, the Clearing House Association. Instead of punishment for their corrupt actions that crashed the U.S. economy in 2008, the Wall Street megabanks were rewarded with secret bailouts. The Dodd-Frank financial reform legislation of 2010 was supposed to stop these trillion-dollar giveaways from the Fed to the one percent on Wall Street. But the trillion-dollar bailouts at the Fed started up again on September 17, 2019 in the form of emergency repo loans. The Fed’s emergency repo loan operations came months before the COVID-19 virus had emerged in China or anywhere else in the world. That strongly suggests to us that Wall Street megabanks had a serious problem independent of the virus outbreak. Mainstream media refused to cover the repo loan bailouts in any depth, and censored the details when the Fed was forced under law to reveal that it had, once again, funneled trillions of dollars in revolving loans to Wall Street in the fourth quarter of 2019 and beyond. The Fed’s multi-trillion-dollar emergency bailout programs from 2008 were reactivated again for the COVID-19 pandemic in 2020, marking the third massive bailout of Wall Street by the Fed in a dozen years.This is unprecedented in the 111-year history of the Fed, meaning the financial system of the U.S. is dramatically on the wrong course. Wall Street On Paradeviews these Fed bailouts as an integral part of an institutionalized wealth transfer system from the 99 percent to the 1 percent.For our ongoing archive of articles on the Fed’s unprecedented bailouts, click on this text. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ From December 2007 through July 2010, the Federal Reserve secretly funneled $16.1 trillion in emergency revolving loans to the megabanks on Wall Street and their foreign counterparts at below-market interest rates. The Fed took this action without a single vote in Congress. The Fed then battled in court for more than two years to keep these unprecedented giveaways a secret from the American people. It lost on its arguments for secrecy at both the U.S. District and Appellate Court level. The U.S. Supreme Court declined to hear a related case advocating secrecy that was brought by a megabank front group, the Clearing House Association. Instead of punishment for their corrupt actions that crashed the U.S. economy in 2008, the Wall Street megabanks were rewarded with secret bailouts. The Dodd-Frank financial reform legislation of 2010 was supposed to stop these trillion-dollar giveaways from the Fed to the one percent on Wall Street. But the trillion-dollar bailouts at the Fed started up again on September 17, 2019 in the form of emergency repo loans. The Fed’s emergency repo loan operations came months before the COVID-19 virus had emerged in China or anywhere else in the world. That strongly suggests to us that Wall Street megabanks had a serious problem independent of the virus outbreak. Mainstream media refused to cover the repo loan bailouts in any depth, and censored the details when the Fed was forced under law to reveal that it had, once again, funneled trillions of dollars in revolving loans to Wall Street in the fourth quarter of 2019 and beyond. The Fed’s multi-trillion-dollar emergency bailout programs from 2008 were reactivated again for the COVID-19 pandemic in 2020, marking the third massive bailout of Wall Street by the Fed in a dozen years.This is unprecedented in the 111-year history of the Fed, meaning the financial system of the U.S. is dramatically on the wrong course. Wall Street On Paradeviews these Fed bailouts as an integral part of an institutionalized wealth transfer system from the 99 percent to the 1 percent.For our ongoing archive of articles on the Fed’s unprecedented bailouts, click on this text. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"}