{"id": 1138, "name": "The Progressive", "domain": "progressive.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://progressive.org/latest/this-is-starvation-palestinian-family-survives-on-salt-and-water-as-gaza-food-crisis-deepends-shnino-20250610/", "title": "This Is Starvation Palestinian Family Survives On Salt And Water As Gaza Food Crisis Deepends Shnino 20250610", "content": "The LatestPolitics & GovernmentImmigrationActivism & DissentLabor & EconomyClimateMiddle East Politics & Government Immigration Activism & Dissent Labor & Economy Climate Middle East Politics & Government Immigration Activism & Dissent Labor & Economy Climate Middle East MagazineDigital Magazine LoginRecent Past Issues Digital Magazine Login Recent Past Issues Digital Magazine Login Recent Past Issues Public Schools AdvocateAbout Public Schools AdvocateMeet Our Fellows About Public Schools Advocate Meet Our Fellows About Public Schools Advocate Meet Our Fellows Op-EdsAbout Progressive PerspectivesOp-Ed Writing Workshops About Progressive Perspectives Op-Ed Writing Workshops About Progressive Perspectives Op-Ed Writing Workshops About UsOur TeamInternshipsContactWays to GiveJob OpportunitiesPitching Guidelines Our Team Internships Contact Ways to Give Job Opportunities Pitching Guidelines Our Team Internships Contact Ways to Give Job Opportunities Pitching Guidelines Shop SubscribeSingleCopyGift SubscriptionRenew Subscription SingleCopy Gift Subscription Renew Subscription SingleCopy Gift Subscription Renew Subscription DonateDonate a vehicleMore ways to give Donate a vehicle More ways to give Donate a vehicle More ways to give Politics & Government Immigration Activism & Dissent Labor & Economy Climate Middle East Anas-Mohammed/Shutterstock **‘This Is Starvation’: Palestinian Family Survives on Salt and Water as Gaza Food Crisis Deepens** As the government of Israel starves the people of Gaza, families are struggling to survive. byNourdine Shnino June 10, 2025 6:39 PM Every morning, Sami stands in front of a cracked mirror in the dim corner of his damaged house, splashing cold water on his face to wake himself from what feels like a never-ending nightmare. Sami, whose last name we are withholding to protect his security, stares into his own eyes and whispers the same question: “How will I feed my children today?” It’s a question no parent should ever have to ask. But for Sami, a father of six from central Gaza, it’s become his cruel daily ritual. Ever since Israel fullyclosed the blockadeof Gaza in early March, humanitarian aid organizations have been completely shut out of the region, leaving no way to deliver crucial supplies such asfood, medicine, and fuel. The United Nations has called this aman-madefamine. Families like Sami’s are living it. Sami used to be a taxi driver, making a stable living that enabled his family to live a joyful and dignified life in Gaza City. But in April 2024, his taxi’s engine gave out after weeks of fleeing from one neighborhood to another under bombardment. Sami says repairs are far beyond what he can afford—if the spare parts are even available in the region anymore—leaving him with no source of income. Now, Sami and his family of eight—including a six-month-old baby boy—are living on meals of salt dissolved in warm water. “We boil water and add salt to it,” he tells me, his voice cracking. “It tricks our stomachs into thinking we’ve eaten something. We do this to survive.” As I speak to Sami, his daughters, Sama, Soud, and Noura, sit quietly in a corner, too weak to complain. His older sons, Mohammed and Rezek, take turns searching for any leftover scraps from previous aid distributions by humanitarian organizations like the United Nations Relief and Works Agency for Palestine Refugees (UNRWA). But those rations ran out weeks ago. His wife, Mariam, tries to keep hope alive with whatever is left in their house. “I make a pot of soup—just water with a little spice or rice if we’re lucky,” she says. “We stretch it the whole day for everyone. It’s not food. It’s survival.” The couple’s youngest son, Abdel-Rahman, is just six months old. He depends on formula to survive, but the baby formula shelves have long been empty, and Mariam, weakened by hunger herself, can’t produce enough milk to breastfeed him. More than 2,700 children in Gaza under the age of five werediagnosedwith acute malnutrition in the second half of May alone. According to the Integrated Food Security Phase Classification (IPC),more than halfof Gaza’s population—around 1.1 million people—is facing “emergency” level food insecurity, while 22 percent face “catastrophe,” which is the highest level of hunger classified by the United Nations. That includes more than3,500 childrenunder the age of five at immediate risk of dying from starvation-related causes, according to Gaza’s Government Media Office. Fifty-seven children have alreadydiedfrom starvation. Yet, the borders remain closed. Before the war, Gaza’s aid and goodsflowed throughthe Kerem Shalom and Rafah crossings. Since March, Israeli military orders havesealed both shut. International aid convoys have beenblocked or bombedand U.N. warehouses have beenlooted or destroyed. The U.N. World Food Programmewarnedin mid-May that if access is not restored immediately, “famine will become widespread, and irreversible damage will be done to the people of Gaza—especially children.” Sami sees that damage unfolding right in front of him. “This isn’t war. This is starvation as a weapon,” he says. “We are being sentenced to death in silence.” In April, Human Rights Watch accused Israel ofusing starvationas a method of warfare, a potential war crime under international law. Still, political negotiations stall, and the blockade tightens. “We feel forgotten,” Mariam says. “But we are still here, trying to stay alive, trying to keep our children breathing.” As we speak, Abdel-Rahman stirs in her arms, his cheeks pale and his tiny lips trembling. She rocks him gently and hums a lullaby—one she barely has the strength to sing. **Tags** **Nourdine Shnino** Nourdine Shnino is a news editor, feature story writer, and freelance journalist from the Gaza Strip. A native of Gaza City, he earned a bachelor's in English Language and Literature from Al-Azhar University in 2013. June 10, 2025 6:39 PM **Get the latest Progressive news** Sign-up for our free weekly e-mail newsletter. **Get the latest Progressive news** Sign up for our free email newsletter! Advertise Address Change Current Issue Gift Subscription Subscriber Services Subscription Renewal More Ways to Give Donate a car or other vehicle Public Schools Advocate > About > Our Education Fellows Progressive Perspectives > About > Clinics About Us Contact Us Donate Privacy Policy Jobs Internships Writers Guidelines The Progressive Inc. publishesThe Progressivemagazine plus Progressive.org and Public Schools Advocate. © 2025 • The Progressive, Inc. • 931 E. Main Street, Suite 10 • Madison, Wisconsin 53703 • (608) 257-4626"}