{"id": 1556, "name": "WCPO - Cincinnati News", "domain": "wcpo.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wcpo.com/news/local-news/hamilton-county/cincinnati/over-the-rhine/this-was-not-a-tragedy-this-was-negligence-wife-of-man-killed-in-otr-demands-answers-from-city-leaders", "title": "This Was Not A Tragedy This Was Negligence Wife Of Man Killed In Otr Demands Answers From City Leaders", "content": "Menu NewsLocal NewsNorthern KentuckyOhioKentuckyIndianaNational NewsGalleries Local News Northern Kentucky Ohio Kentucky Indiana National News Galleries Local News Northern Kentucky Ohio Kentucky Indiana National News Galleries WeatherDaily ForecastHourly ForecastWeather RadarWeather AlertsClosings Daily Forecast Hourly Forecast Weather Radar Weather Alerts Closings Daily Forecast Hourly Forecast Weather Radar Weather Alerts Closings Traffic Videos24/7 News Livestream 24/7 News Livestream 24/7 News Livestream Don't Waste Your Money I-Team Homefront Positively Cincinnati Finding Solutions SportsRedsBengalsFC CincinnatiCollege SportsHigh School Sports Reds Bengals FC Cincinnati College Sports High School Sports Reds Bengals FC Cincinnati College Sports High School Sports Arts & EntertainmentFood & Dining Food & Dining Food & Dining Government & PoliticsLocal Politics Local Politics Local Politics Cincy Lifestyle MarketplaceOhio LotteryBrand SpotlightMercy HealthMDInsiderBHMK Law Ohio Lottery Brand Spotlight Mercy Health MDInsider BHMK Law Ohio Lottery Brand Spotlight Mercy Health MDInsider BHMK Law About UsBiosContact UsTV ListingsWCPO 9 GivesJobs at WCPO 9ContestsRSS FeedsVideo LicensingCorrectionsUnpublishAdvertise with usTrustKelly Clarkson Show Bios Contact Us TV Listings WCPO 9 Gives Jobs at WCPO 9 Contests RSS Feeds Video Licensing Corrections Unpublish Advertise with us Trust Kelly Clarkson Show Bios Contact Us TV Listings WCPO 9 Gives Jobs at WCPO 9 Contests RSS Feeds Video Licensing Corrections Unpublish Advertise with us Trust Kelly Clarkson Show Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Traffic I-Team Sports Don't Waste Your Money Finding Solutions Homefront WCPO 9 Gives Contests **Actions** Facebook Tweet Email **'This was not a tragedy. This was negligence' | Wife of man killed in OTR demands answers from city leaders** CINCINNATI — The wife of a man who was fatally stabbed in his Over-the-Rhine home is calling on Cincinnati leaders, specifically Mayor Aftab Pureval, for answers — even threatening legal action if need be. Sarah Heringerposted to Facebook on Sunday, saying her husband, Patrick Heringer, was killed due to \"negligence.\" Patrick Heringer, 46, was killed around 4 a.m. Wednesday, June 4,at his home in the 100 block of McMicken Avenue. Cincinnati police have charged Mordecia Black, 38, with murder and aggravated burglary after he allegedly stabbed Patrick Heringer in the neck. According to Black's attorney, he was released from prison in January on parole, but prosecutors said just a month after his release, he cut off his ankle monitor. Court records show Black was convicted by a jury on one count of felonious assault and one count of aggravated rioting in 2015. He \"struck, choked and kicked\" a man multiple times, per court documents. The victim suffered a broken nose, a concussion, multiple contusions and several stitches, according to court records. RELATED:'It could've been anyone' | Over-the-Rhine community grapples with murder of gym owner, increase in crime \"Let's be clear: this was not a tragedy. This was negligence,\" Sarah Heringer wrote on Facebook. \"Negligence from the Ohio Adult Parole Authority, from the Cincinnati Police Department, and from the elected leaders who now speak of safety as if it's something they've earned the right to claim.\" Prosecutors also said that Black was already involved in a burglary in May, weeks before Patrick Heringer's death. A warrant was issued for Black on May 15 for the burglary, but he was not arrested for that case until June 5, when police charged him with the murder of Patrick Heringer. In her post, Sarah Heringer called back to a recent comment about crime from Pureval, where he said \"public safety is and will always be (the city's) first, second and third priority.\" \"Mr. Mayor, if public safety were your top priority, Patrick would still be alive,\" Sarah Heringer wrote. \"You acknowledged the pain, but you have failed to acknowledge your own role in this system's failure. You speak to the problem but refuse to name a solution. You've offered no public action plan. No reforms. No measurable change.\" You can read Sarah Heringer's full post from her public Facebook page below: \"You haven't stopped violence — you've stopped at optics. And the city sees through it,\" Sarah Heringer continued. Sarah Heringer, who co-owns Findlay Movement with her late husband, also addressed CPD Chief Teresa Theetge in her post, reprimanding her for the fact that she's remained silent regarding her husband's death and the community's unease since. \"Your silence is not professionalism,\" Sarah Heringer wrote. \"It's cowardice disguised as protocol.\" Sarah Heringer also made several different demands of city leaders, including: A full public timeline of what each agency did when Black's monitor went dark A statement from the mayor naming specific solutions to be enacted A public response from Theetge explaining why CPD took no action between February and June An audit of current police staffing in high-crime zones with a plan to fix it Public release of communication between CPD and parole enforcement In a follow-up Facebook post, Sarah Heringer said if she doesn't get answers by June 14, she plans to take legal action. Sarah Heringer also addressed other Cincinnati residents. \"This isn't just about Patrick. This is about you,\" she wrote. \"Your safety. Your families. Your city. They think you'll forget. They think I'll back down. They think words are enough. Let's show them they're wrong.\" Hear from a friend of Patrick Heringer in the video below: **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** Traffic News Money Sports Entertainment Life Marketplace Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Corrections Policy Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WCPO9 wcpo9_news wcpo @wcpo9news"}