{"id": 1875, "name": "The American Mind", "domain": "americanmind.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://americanmind.org/features/from-illegal-immigrants-to-republican-voters/on-immigration-neither-cruelty-nor-capitulation-is-warranted/", "title": "On Immigration Neither Cruelty Nor Capitulation Is Warranted", "content": "From the Editors Salvos Memos Features Podcast Media About **On Immigration, Neither Cruelty nor Capitulation Is Warranted** **Addressing a problem that has haunted our national life for decades.** It’s not often that an opinion writer has the good fortune to elicit serious commentary from respondents of the caliber of Christopher Caldwell, David P. Goldman, Helen Andrews, John DiIulio, and Jeremy Carl. I’ve read with admiration the work of all five commentators for many years and have books by four of them on my shelves. I’m grateful to them for taking the time to respond and share their knowledge and practical wisdom. Christopher Caldwell, I take it, isgenerally favorableto the idea of granting legal status to the millions of illegals in the country who do not have criminal records. But he worries, and rightly so, that the compromise I propose would be unable to clear the hurdles presented by the U.S.’s existing civil rights regime—hurdles that activist judges would likely multiply. In practice, legal residence combined with amnesty for past misdemeanors would turn into “a euphemism for a program of settlement,” or “an immigration program that dare not speak its name.” Caldwell thinks that, to be successful, my compromise would have to offer some assurance that existing laws to limit immigrant labor would be enforced with rigor. Recent history warns that rigorous enforcement of immigration laws is not something the U.S. government does well, or even wants to do well. Aside from H1-A and H1-B visa programs, both narrowly conceived, we have never had a true “guest worker” program in the U.S. But the Germans have, Caldwell writes, and their experience withgästarbeiteris not encouraging. I agree with Caldwell that German guest worker programs, after some initial successes when most workers were Italians, went bad for the reasons he outlines. But the compromise I propose is not really a guest worker program (my mistake for using that expression), because it would only apply to persons who arealreadypresent in the U.S., not to new entrants. I applaud President Trump’s successful efforts to control the border, but I recognize the risk that some future Democratic administration would fling wide the gates again. I agree with Caldwell that the program I propose would have to be limited so as not to provide a pretext, at some point in the future, for settling more potential Democratic voters in swing states. One possible solution to Caldwell’s worries would be to start small and test the idea first with anumerusclausus. Offer legal residence to, say, 500,000 undocumented (sit venia verbis) workers on the condition they comply with the Alien Registration Act of 1940, which is still in effect. Kristi Noem as Secretary of Homeland Security, backed by an executive order, recentlywarnednon-citizens resident in the U.S. for more than 30 days that they must register by April 11. I doubt that warning yielded many new registrations. But the deadline could be extended by a year, and a new incentive to register added: those who comply would be offered a legal residence card. It would come with all the conditions as outlined in my previousApril 1 feature articleon this site. It would in effect be the equivalent of asine diework visa and, like all visas, it could be revoked for cause. The experiment, if it produced satisfied customers, might spread trust among the illegal population and mollify skeptics on the Right. It could be extended gradually so as to provide legal status to other persons currently unlawfully present in the country. I emphasize, again, the wordcurrently.Persons who applied for the card would have to prove that they were present in the country before, say, January 20, 2025 (or perhaps six months before November 5, 2024, to exclude those who flooded through the border before the last election). Otherwise the program would just set off another rush for our southern border. Undoubtedly the program would have to run the gauntlet of activist judges, which is a good reason why the administration should seek authorization from Congress. David P. Goldman’sresponseto my proposal, focusing on the issue of U.S. productivity, is perhaps the most positive. The U.S. needs immigrants to prevent us from suffering the same fate as Europe, Japan, and China—namely, a crippling lack of younger workers. Owing to falling fertility, we too need new taxpayers to support the social services promised to our aging populations. Goldman points out that Hispanics, who constitute the largest ethnicity among illegals, are excellent workers, and their labor force participation rate is the highest of all U.S. ethnic groups. I would add that harboring millions of undocumented persons who are limited in their educational opportunities and whose upward mobility is stifled by their illegal status imposes a huge opportunity cost on the U.S. economy. A population of immigrants eager to better their lot in life, if permitted to work legally, is bound to produce a good many business success stories, like all the other immigrant populations that have come to our shores in the past. Professor John DiIulioalso supports, in principle, issuing legal residence permits to the undocumented: “This argument for measured, not mass, deportations needs to be amended and refined—but it should not be rejected.” His hesitations have to do with how MAGA will respond to suspending mass deportations on compassionate grounds. He detects among three of his pro-Trump acquaintances a range of views. One was willing for compassionate exceptions to be made; another reserved judgment; and a third worried that any weakening of resolve about exporting illegals might cause “the whole thing to fall apart.” The last reaction is surely a legitimate concern. In addition, DiIulio wants readers to be aware of what his experience and long study of American government has taught him: how difficult it is to do anything about immigration policy given the “hot administrative mess” that is the Department of Homeland Security. DHS is constrained by over 400 federal statutes governing immigration policy, and who knows how many administrative rules and guidances. It has limited resources, a 3.6 million case backlog, less than full cooperation from state and local governments, and—I would add—a workforce honeycombed withresistersto the administration’s policy. It plans to deport a half million illegals in the current year, a tall order. Any new program is likely doomed to failure, even in the unlikely event it could win support from the GOP Congress and President Trump. The Road from Serfdom The last two respondents to my argument,Jeremy CarlandHelen Andrews, are far more critical of my proposal. They think it should be rejected with prejudice. Here I need to confess that the principal reason I am opposed to mass deportations of illegals is that they would be heartless and cruel. Mass deportations are bound to cause misery to millions of people, maybe 3.3% of the U.S. population, who will be forcibly uprooted from the lives they have made in our country. Many would be separated from their children. I do not want my country to be shamed by such an atrocity, which will be worse by an order of magnitude than the forcible incarceration of 120,000 persons of Japanese descent during World War II. At least in 1942 there was some excuse for that action: we were at war. In the present case we are talking about wrecking the lives of millions of people who could be productive residents doingwork that we need to have done. Forgive me for believing that a policy of mass deportations, which would require turning the country into a police state, is simply evil. It must be rejected, even if it worsens the electoral prospects of the Republican Party. I continue to believe, however, for the reasons stated in my April 1 article, that Republicans would benefit from a program to regularize the legal status of current illegals. Both Carl and Andrews believe I am naïve and misinformed (as is only to be expected of a professor) if I think my proposed compromise will not cost the Republican Party votes. Reason and historical precedent, they say, show I am wrong, and anything resembling an amnesty program must be rejected if we want to avoid permanent reconfiguration of the electorate in favor of the Democratic Party. Let me make another confession: I agree with both writers that the primary political goal of reform-minded persons in this country must be to prevent illiberal progressives, a.k.a. the wokerati, from ever returning to power in D.C. Much of the corruption of our cultural, educational, and business institutions since 2009 has been supercharged by the regulatory, surveillance, and enforcement mechanisms put in place by the Obama and Biden administrations. I agree with Carl that such an outcome really is an existential threat to our country’s traditions, and to government by the people and for the people. However, I don’t believe either Carl or Andrews is correct to describe what I am proposing as “amnesty” in the sense that that word has been used in U.S. politics over the last half century. First of all, immigrants who have crossed our borders unlawfully have committed a misdemeanor, not a crime. Illegal presence becomes a felony only when someone re-enters the country illegally after being deported. Persons who have overstayed their work or study visas—a sizeable portion of the undocumented population—have not committed even a misdemeanor. Overstaying a visa is a civil violation with penalties that may include deportation, bars on re-entry, or ineligibility for future visas. We need to remember too the distinction between illegality and culpability. The Biden Administration did everything but hang out the welcome sign to encourage foreigners to cross our borders illegally. No one was punished, NGOs (often funded, we now learn, by our tax dollars) created pipelines to facilitate border crossings, teams of liberal lawyers offered illegals free legal counsel, andthe Roman Catholic Church(my own church), rejoicing in its new parishioners, presumably forgave them for any sins they might have committed in breaking the law. The Biden Administration treated our immigration laws in effect as a dead letter, and who was a mere immigrant, often speaking little English, to challenge the authorities? So I agree with David Goldman that the proper punishment for persons unlawfully present is for them to plead guilty to a misdemeanor charge and pay a fine. That could be part of an application for legal residence in the program I have proposed. Carl and Andrews both believe that any program allowing persons illegally present in the country to remain as legal residents is bound to help the Democrats win elections. Carl’s information about immigrants’ electoral preferences comes from dated surveys; he mentions a 2016 study by the American National Election Studies. I would draw his attention to the recentarticleby Ruy Teixeira inCommonplace(where Helen Andrews is feature editor) describing the huge gap that has opened up between the attitudes of non-white working-class voters and the ideology of elites within the Democratic Party. Carl is concerned that history will repeat itself, as when the Immigration Control and Reform Act of 1986 turned California into the bluest of blue states. But history has moved on, and the Democrats’ grip on the Hispanic vote—even in California where 60% of Hispanic voters still favor Democrats —is slipping. The progressive Left just doesn’t appeal to Hispanics any more, especially young Hispanics. Astudypublished in 2020 by the Public Policy Institute of California, a progressive think tank, shows that “among Latino likely voters, 37% identify as liberal, 32% as moderate, and 31% as conservative, showing a more balanced ideological spread than other groups.” On the other hand, as the recent shift in voting patterns shows, the Republican Party as reshaped by President Trump is far more attractive to Hispanics than the party of Ronald Reagan, or even George W. Bush. Helen Andrews believes that the proposed compromise will not appeal to Democrats in Congress, whose votes would probably be needed to have the proposal passed. They will reject it, she says, because it rules out amnesty, which they would require as part of any compromise solution. That may be the attitude of Democratic leaders in Congress, but I doubt the great mass of Democratic voters, driven as always by free-floating moral emotions, will favor electoral calculation over the chance to confer a real benefit on a population they have always regarded as their protégés. Democratic leaders will find themselves once again on the wrong side of an 80/20 issue, but this time that split will be within their own party. I would like to see them run for office against Republicans who supported the reform. Andrews also believes I am unaware that illegals already have access to education and government benefits. She is mistaken: any resident of Massachusetts such as myself is all too aware of the state’s misplaced generosity with our tax dollars, and the huge burden illegals place on services. In Boston public schools, some 31% of K-12 students are classified as “English learners.” (Another 13% are classified as “former English learners” who have achieved proficiency.) Even the head-in-the-sand Left is aware that our public schools, which are required to take in illegals, are overwhelmed. But as I stated in my article, this is a problem for the states to resolve. Giving legal status to illegals who are already present is not going to make the problem worse, and may even make it better. Andrews misunderstands my proposal when she supposes that I expect it to solve the problem of birthright citizenship or reduce the percentage of Hispanics in America. I don’t. She also is worried that Hispanics bring with them the dysfunctional political culture, poverty, and crime of the countries in Central and South America they’ve left. Some of them no doubt do, and I am glad to see Tom Homan getting rid of them. But she seems not to take seriously the possibility that many, perhaps even most, illegals come to America precisely to get away from such conditions. They may well be prepared to love our country for its relative freedom from the socialist pathologies of their home countries. The precariousness and danger of their old life in the south, moreover, is likely to make them resistant to the siren call of a political party that wants to defund the police, raise energy costs, hobble the economy with endless regulations, and trans their kids. The fact that 83% of illegals are Protestant evangelicals or Roman Catholics is not irrelevant to the cultural homogeneity of our country in the future. President Trump’s first months in office have given many of us hope that government can work for the people again, that it doesn’t have to be big to be powerful, and that “you can just do stuff.” Let’s do something about this miserable situation that has haunted our national life for half a century. The mission of America is to make people free and give them dignity and opportunity. We shouldn’t allow our country to exploit indefinitely a population of serfs, millions of them, who live among us without hope and with too little charity. The American Mind presents a range of perspectives. Views are writers’ own and do not necessarily represent those of The Claremont Institute. The American Mind is a publication of the Claremont Institute, a non-profit 501(c)(3) organization, dedicated to restoring the principles of the American Founding to their rightful, preeminent authority in our national life. Interested in supporting our work?Gifts to the Claremont Instituteare tax-deductible. **Solving the Immigration Contradiction** Laws that limit immigrant labor must be followed—and rigorously. **Prudential Immigration** Prof. Hankins’s plan has merit, but we should err on the side of caution. **A Bad Bargain** Hankins’s proposal would be disastrous for the Right. **Measured, Not Mass, Deportations** It’s not as easy as it sounds. **Amnesty By Another Name** Far too much carrot, far too little stick. **From Illegal Immigrants to Republican Voters** Deporting criminals is the easy part. **Topics** Administrative State & ProgressivismLaw Enforcement Law Enforcement Law Enforcement Arts & Education CCJ Townhall Civics & Citizenship Claremont Hot Takes Claremont Institute Fellowship Alumni Claremont Thanksgiving Congress & Presidency Education Electoral politics Elites & Populists Events Family & Marriage Founders & Lincoln From the Editor From the Publisher Guest Appearances (Audio) Guest Appearances (Video) Health History & Culture Immigration Law & Judiciary Markets & Economics Media & Technology Men and Masculinity Multiculturalism Progressive Politics Race and Politics Realignment Religion & Political Philosophy Roundups Sex and Gender Statesmanship & War Technology and Humanity The American Mind Podcast The American Mind with Charles Kesler The Conservative Movement Women Youth culture Home From the Editors Salvos Memos Features Podcast Media Δ Subscribeto the newsletter Subscribe to our editors’ newsletter,The Roundupfor notes and guidance to fight regime failure. Δ"}