{"id": 824, "name": "Law for Palestine", "domain": "law4palestine.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://law4palestine.org/from-impunity-to-accountability-the-role-of-asp-member-states-in-supporting-the-iccs-response-to-the-situation-in-palestine-side-event-at-the-iccs-23rd-session-of-the-assembly-of-states/", "title": "From Impunity To Accountability The Role Of Asp Member States In Supporting The Iccs Response To The Situation In Palestine Side Event At The Iccs 23rd Session Of The Assembly Of States", "content": "Our Activities Contact us Donate Our Activities Contact us Donate Our Activities Contact us Donate Our Activities Contact us Donate Who We AreAbout UsOur philosophyBoard of TrusteesStaff About Us Our philosophy Board of Trustees Staff About Us Our philosophy Board of Trustees Staff Legal sceneWeekly report PDFAcademic research and studiesUpcoming human rights eventsArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Weekly report PDF Academic research and studies Upcoming human rights events ArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events Weekly report PDF Academic research and studies Upcoming human rights events ArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events ICC – PalestineThe official court records translation (Arabic)Explanatory Articles The official court records translation (Arabic) Explanatory Articles The official court records translation (Arabic) Explanatory Articles Jurists ForumForum ActivitiesBecome a member Forum Activities Become a member Forum Activities Become a member Int’l Law & Palestine BlogOur ArticlesBook Reviews on PalestineJudgments on PalestineLegal CompendiumsUN resolutions about Palestine Our Articles Book Reviews on Palestine Judgments on Palestine Legal CompendiumsUN resolutions about Palestine UN resolutions about Palestine Our Articles Book Reviews on Palestine Judgments on Palestine Legal CompendiumsUN resolutions about Palestine UN resolutions about Palestine UN resolutions about Palestine Join UsJurists for Palestine ForumGet involved Jurists for Palestine Forum Get involved Jurists for Palestine Forum Get involved Who We AreAbout UsOur philosophyBoard of TrusteesStaff About Us Our philosophy Board of Trustees Staff About Us Our philosophy Board of Trustees Staff Legal sceneWeekly report PDFAcademic research and studiesUpcoming human rights eventsArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Weekly report PDF Academic research and studies Upcoming human rights events ArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events Weekly report PDF Academic research and studies Upcoming human rights events ArchiveOfficial Palestinian decisions and positionsOfficial Israeli decisions and positionsRegional & international decisions & positionsPublications of human rights organizationsHuman rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events Official Palestinian decisions and positions Official Israeli decisions and positions Regional & international decisions & positions Publications of human rights organizations Human rights conferences and events ICC – PalestineThe official court records translation (Arabic)Explanatory Articles The official court records translation (Arabic) Explanatory Articles The official court records translation (Arabic) Explanatory Articles Jurists ForumForum ActivitiesBecome a member Forum Activities Become a member Forum Activities Become a member Int’l Law & Palestine BlogOur ArticlesBook Reviews on PalestineJudgments on PalestineLegal CompendiumsUN resolutions about Palestine Our Articles Book Reviews on Palestine Judgments on Palestine Legal CompendiumsUN resolutions about Palestine UN resolutions about Palestine Our Articles Book Reviews on Palestine Judgments on Palestine Legal CompendiumsUN resolutions about Palestine UN resolutions about Palestine UN resolutions about Palestine Join UsJurists for Palestine ForumGet involved Jurists for Palestine Forum Get involved Jurists for Palestine Forum Get involved ع ع November 30, 2024 Announcements,Upcoming human rights events From Impunity to Accountability: The Role of ASP Member States in Supporting the ICC ‘s Response to the Situation in Palestine Side Event at the ICC’s 23rd Session of the Assembly of States Parties, The Hague 6th December 2024 || at 13:15 – 14:15 local time || World Forum,Oceania room,The Hague Sponsored by:State of Palestine, and Republic of Colombia. Organised by:The Independent Commission for Human Rights-Palestine,Law for Palestine. The situation in Palestine remains one of the most formidable challenges in the history of the International Criminal Court (ICC). It is marked by an unprecedented scale of atrocities that shock the conscience of humanity, includingwell-documentedwar crimes, crimes against humanity, and evengenocide. Since June 2014, the period under the Court’s jurisdiction, these grave violations have been met with pervasive impunity. However, on 21 November 2024, the Pre-Trial Chamber took a historic and decisive step by rejecting Israeli objections to the Court’s jurisdiction and issuing arrest warrants in the Situation in the State of Palestine, six months after the Prosecutor’srequestin May 2024. This landmark decision represents a significant advancement on the long road towards justice and accountability. This critical step, however, has been taken in the face of mountingpolitical pressure and threatsdirected at theProsecutorand the Court itself, aimed at obstructing the issuance of arrest warrants so desperately sought by victims. These threats have only intensified following the Pre-Trial Chamber’s decision to issue the warrants. The current session of the Assembly of States Parties (ASP) presents a crucial opportunity to demonstrate solidarity with victims by amplifying their calls for justice and to support the Court in upholding its mandate with integrity and impartiality. The ICC embodies a legacy built upon the enduring pain of countless victims worldwide, serving as a beacon for humanity and ensuring accountability, irrespective of who the perpetrators are. Given these pressures and the ICC’s lack of an enforcement mechanism beyond the compliance of States Parties to the Rome Statute, it is imperative that States ensure the Court’s orders are respected and its mandate to end impunity is robustly supported. Beyond their legal obligations to cooperate with the ICC, States Parties need to provideemphatic political and diplomatic backingand adopt measures that extend beyond the arrest of suspects upon entry into their territories. Such measures includeidentifying potential leverageto ensure the continued visibility of the warrants on the agenda of all relevant fora and facilitating the timelyprovision of information. The arrest warrants also demand that States assess their international obligations, including ensuring that their actions -such as arms transfers- do not contribute to the commission of crimes identified by the Court. The Pre-Trial Chamber has alsonotedthat conduct similar to the crimes listed in the arrest warrants “appears to be ongoing.” Concurrently, the Office of the Prosecutor hasindicatedthat additional lines of inquiry are being pursued in light of “reports of escalating violence, further shrinking humanitarian access, and continued expansion of allegations of international crimes in Gaza and the West Bank.” This vital side event, hosted by States Parties and human rights organisations, will bring together distinguished experts, legal professionals, and victims’ representatives to address these pressing issues. The event will amplify the urgent appeals for justice from victims in Palestine, examine the challenges confronting the Court in this situation, and discuss the essential steps ASP Member States must take to secure accountability and strengthen the ICC’s capacity to respond decisively to grave violations of international law. Opening remarks: Ambassador Ammar Hijazi,Palestinian Representative to the Kingdom of the Netherlands, and Ambassador of Palestine to International Organisations in The Hague. Ambassador Juan Jose Quintana,Deputy Permanent Representative of the Colombian Mission in New York. Ammar Dwaik,Director General, ICHR. Panellists:accountability Palestine ICC impunity Ahmed Mokhallalati:Palestinian Surgeon, Head of Burns and Plastic Surgery Department at Al-Shifa Hospital in Gaza. Chantal Meloni, Legal Representative of Victims of Gaza at the ICC. Kenneth Roth,Visiting Professor at Princeton School of Public and International Affairs and Former Executive Director of Human Rights Watch. Hassan Ben Imran,Governing Council Member at Law for Palestine, PhD researcher. Giulia Pinzauti, Expert in International Criminal Law and International Tribunals. Moderator: Anisha Patel,Governing Council Member at Law for Palestine, PhD researcher The event will be recorded and made publicly available **Beschwerde in Deutschland gegen Axel Springer wegen Förderung illegaler Landnahme in Palästina durch Yad2 eingereicht** **Beschwerde in Deutschland gegen Axel Springer wegen Förderung illegaler Landnahme in Palästina durch Yad2 eingereicht** **Palestine’s Legal Scene | Issue. 256 | 24 – 30 Nov . 2024** **Palestine’s Legal Scene | Issue. 256 | 24 – 30 Nov . 2024** **Latest News** **Law for Palestine publishes a study outlining the economic obligations of third states towards ending complicity in Israel’s Illegal Occupation on the Palestinian territory** **Genocide as colonial erasure || Summary of the UN Special Rapporteur’s report on Israel’s settler-colonial genocide** **Thematic organisation of the International Court of Justice Advisory Opinion of 19 July 2024** **Rethinking International Law After Gaza Symposium: Unlawful Occupation as Ongoing Aggression – Rethinking Legal Responses in the Context of Palestine** **Follow us:** 8.8KFans8.8KFans 10.6KFollowers10.6KFollowers 3.3KSubscribers3.3KSubscribers **Related** About us Palestine’s Legal Scene Join Our Mailing List Our Activities Contact us Donate Our Activities Contact us Donate Our Activities Contact us Donate Our Activities Contact us Donate © Law for Palestine – all rights are reserved 2025 **For the latest updates on Palestine’s Legal Scene - Subscribe now**"}