{"id": 2203, "name": "Dunning-Kruger-Times", "domain": "dunning-kruger-times.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://dunning-kruger-times.com/three-protesters-arrested-in-la-will-turn-states-evidence-against-george-and-alex-soros-for-paying-them/", "title": "Three Protesters Arrested In La Will Turn States Evidence Against George And Alex Soros For Paying Them", "content": "THE DUNNING-KRUGER TIMES Home About Us Terms and Conditions Privacy Policy Contact Us **Three Protesters Arrested in LA Will Turn State’s Evidence Against George and Alex Soros for Paying Them** In a shocking twist out of Los Angeles, three protesters arrested during a recent clash with police outside the Israeli consulate have reportedly agreed to turn state’s evidence — and the names on their lips are none other than George Soros and his son, Alex. According to LAPD sources, the individuals — identified as Grayson, Skye, and “Comrade Terry” — were initially picked up for inciting a riot, throwing vegan yogurt at mounted officers, and gluing themselves to the sidewalk while chanting, “No justice, no feet.” After a few hours in custody and one round of gluten-free jailhouse chili, all three allegedly confessed they were being paid to protest. “They told us Soros was behind it,” said LAPD Deputy Joe Barron. “At first we assumed they meant one of the nonprofits. But nope. They said George and Alex themselves. Like… personally.” In sworn statements now sealed in a mayonnaise jar on Art Tubolls’ front porch for safekeeping, the trio claims that George Soros personally Venmo’d them $275 each with the memo “For Freedom 😊.” Alex, not to be outdone, allegedly sent DoorDash credits and a Spotify playlist of revolutionary sea shanties. Legal analysts say the charges could be serious if there’s any truth to the claims — and if you squint hard enough and ignore logic, there just might be. “Technically, this could fall under federal influence peddling and incitement,” said legal expert Sheila Barron, “if, and only if, these kids aren’t just making it up to get out of community service.” But according to the LA District Attorney’s Office, the charges are already in the works. “We’re treating this like Watergate, if Nixon had worn black eyeliner and thrown tofu bricks,” said DA Assistant General Joe Barron Jr. “If we can link Soros to a cash app and a kombucha-fueled riot, it’s game over.” Critics say the case is weak at best and fabricated at worst. A spokesperson for the Soros family issued a brief statement: “George Soros is currently at home watching Hungarian sitcoms and crocheting peace scarves. Alex is in Ibiza trying to figure out if NFTs are still a thing. Neither has time to Venmo rogue anarchists in Silver Lake.” But that hasn’t stopped certain members of Congress from acting like it’s already confirmed. “See? I told you!” said Rep. Lauren Boebert from the floor of the House. “George Soros is behind everything. Antifa, TikTok, the birds — all of them! WAKE UP!” As for the protesters, all three have entered protective custody, currently hiding out in the back of a Whole Foods near the hummus aisle. In other news, a fourth protester, who goes only by “LaserDawn,” turned out to be a performance artist filming a documentary about radical tofu as an allegory for late-stage capitalism. She has since been released on her own recognizance and a coupon for 20% off essential oils. God Bless America."}