{"id": 2065, "name": "WOKI - 98.7 - Knoxville", "domain": "newstalk987.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.newstalk987.com/2025/06/11/an-investigation-is-underway-after-a-knoxville-police-officer-is-accused-of-shoplifting-from-a-west-knoxville-store/", "title": "An Investigation Is Underway After A Knoxville Police Officer Is Accused Of Shoplifting From A West Knoxville Store", "content": "SchedulePhil WilliamsBob YarbroughVince CoglianeseHallerin Hilton HillSean HannityMark LevinWeekend Shows Phil Williams Bob Yarbrough Vince Coglianese Hallerin Hilton Hill Sean Hannity Mark Levin Weekend Shows Phil Williams Bob Yarbrough Vince Coglianese Hallerin Hilton Hill Sean Hannity Mark Levin Weekend Shows PodcastsNewsTalk 98.7 WOKI All Audio Main ChannelNewsTalk 98.7 Individual Show Podcasts NewsTalk 98.7 WOKI All Audio Main Channel NewsTalk 98.7 Individual Show Podcasts NewsTalk 98.7 WOKI All Audio Main Channel NewsTalk 98.7 Individual Show Podcasts NewsLocal NewsNational NewsWorld NewsHealth NewsEntertainment Local News National News World News Health News Entertainment Local News National News World News Health News Entertainment WeatherWVLT First Alert WeatherSevere Weather InformationSchool Closings and Delays WVLT First Alert Weather Severe Weather Information School Closings and Delays WVLT First Alert Weather Severe Weather Information School Closings and Delays SportsVols NewsUT FootballUT BasketballUT BaseballLady VolsLady Vols BasketballLady Vols SoftballSchedulesUT 2025 Football Schedule/PrintableUT 2025 Basketball Schedule/PrintableUT 2025 Baseball Schedule/PrintableLady VOLS 2025 Basketball Schedule/PrintableLady VOLS 2025 Softball Schedule/PrintableTitans NewsHardin Valley Aca. & HS Football Vols NewsUT FootballUT BasketballUT Baseball UT Football UT Basketball UT Baseball Lady VolsLady Vols BasketballLady Vols Softball Lady Vols Basketball Lady Vols Softball SchedulesUT 2025 Football Schedule/PrintableUT 2025 Basketball Schedule/PrintableUT 2025 Baseball Schedule/PrintableLady VOLS 2025 Basketball Schedule/PrintableLady VOLS 2025 Softball Schedule/Printable UT 2025 Football Schedule/Printable UT 2025 Basketball Schedule/Printable UT 2025 Baseball Schedule/Printable Lady VOLS 2025 Basketball Schedule/Printable Lady VOLS 2025 Softball Schedule/Printable Titans News Hardin Valley Aca. & HS Football Vols NewsUT FootballUT BasketballUT Baseball UT Football UT Basketball UT Baseball UT Football UT Basketball UT Baseball Lady VolsLady Vols BasketballLady Vols Softball Lady Vols Basketball Lady Vols Softball Lady Vols Basketball Lady Vols Softball SchedulesUT 2025 Football Schedule/PrintableUT 2025 Basketball Schedule/PrintableUT 2025 Baseball Schedule/PrintableLady VOLS 2025 Basketball Schedule/PrintableLady VOLS 2025 Softball Schedule/Printable UT 2025 Football Schedule/Printable UT 2025 Basketball Schedule/Printable UT 2025 Baseball Schedule/Printable Lady VOLS 2025 Basketball Schedule/Printable Lady VOLS 2025 Softball Schedule/Printable UT 2025 Football Schedule/Printable UT 2025 Basketball Schedule/Printable UT 2025 Baseball Schedule/Printable Lady VOLS 2025 Basketball Schedule/Printable Lady VOLS 2025 Softball Schedule/Printable Titans News Hardin Valley Aca. & HS Football MoneyMarketsEconomyPersonal FinanceInvesting and Analysis Markets Economy Personal Finance Investing and Analysis Markets Economy Personal Finance Investing and Analysis What’s HappeningWhat’s HappeningCommunityPhoto Galleries – WOKIVideosOfficial Contest Rules What’s Happening Community Photo Galleries – WOKI Videos Official Contest Rules What’s Happening Community Photo Galleries – WOKI Videos Official Contest Rules ConnectSend Press Release to NewsTalk 98.7Social MediaFacebookInstagramTwitter (X)You TubeSign Up For “The Daily Morning News Update”Sign Up For “The Newsroom” Send Press Release to NewsTalk 98.7 Social MediaFacebookInstagramTwitter (X)You Tube Facebook Instagram Twitter (X) You Tube Sign Up For “The Daily Morning News Update” Sign Up For “The Newsroom” Send Press Release to NewsTalk 98.7 Social MediaFacebookInstagramTwitter (X)You Tube Facebook Instagram Twitter (X) You Tube Facebook Instagram Twitter (X) You Tube Sign Up For “The Daily Morning News Update” Sign Up For “The Newsroom” Sweet Deals AdvertisingAdvertise With UsRADIO + DIGITAL Advertise With Us RADIO + DIGITAL Advertise With Us RADIO + DIGITAL **An Investigation is Underway After a Knoxville Police Officer is Accused of Shoplifting from a West Knoxville Store** Knoxville, TN (KPD/WOKI)On Monday morning, the Knoxville Police Department received a report that a uniformed KPD officer had shoplifted from a convenience store on Kingston Pike. Upon receipt of that report, an on-duty West District Lieutenant immediately responded to the scene to conduct a preliminary investigation. The preliminary investigation, including a review of security footage, revealed that at around 10 p.m. on Saturday, June 7, 2025, KPD Officer Tyler Wheeler entered the store while on duty, went behind the counter, took multiple pouches of Kratom and concealed them in his pocket before leaving the store. The pouches were valued at approximately $30 per pouch. KPD Property Crimes Unit detectives continued the investigation and following consultation with the Knox County District Attorney’s Office, Wheeler was issued a misdemeanor citation for theft on Tuesday night. Officer Wheeler has been placed on administrative re-assignment with his police powers suspended. The Office of Professional Standards has opened an internal investigation. Wheeler was sworn in as a KPD officer in September 2023 and was assigned to the West District at the time of the incident. The following is a statement from Chief of Police Paul Noel: “Once we were made aware of the accusation, we acted quickly and unambiguously. Based on our investigation, Officer Wheeler’s actions completely disgrace his oath of office and tarnish the reputation of the many men and women of the KPD who serve with integrity. We demand accountability at all levels of our organization and expect our officers to hold themselves to a higher standard. Officer Wheeler’s actions fell woefully short of those expectations and will not be tolerated.” **Headlines** **What's happening** **Old South Candy Job Fair- 6/13-6/14** Old South Candy is Growing – Join Their Sweet Team! Friday, June 13th & Saturday, June 14th- 7146 Maynardville Pike, Knoxville, TN **SportsFest 2025 – Saturday, June 28th** Join us on Saturday, June 28th at the Knoxville Expo Center for SportsFest! This indoor festival celebrates all things sports! **12th Annual Covenant Health Big Kahuna Labor Day Festival 8/31/25** The 12th Annual Big Kahuna Wing Festival returns to World’s Fair Park on Sunday, August 31st from 3pm to 9pm! **Painting with a Purpose! (with McLain’s Painting Service)** Nominate your favorite Non-profit organization to get a fresh coat of paint up to $10,000 provided by Sherwin Williams! Nominations for Painting With A Purpose 2025 open on April 28th, 2025 and ends the first week of June. The winner will be announced in July. **The Vince Show- Weekdays 12p-3p** Tune into The Vince Show weekdays from 12p-3p on NewsTalk 98.7! **Free Apps** Privacy Policy Terms of Service General Contest Rules Station Information Advertise With Us EEO Report Employment Opportunities Join Our Team Cumulus Media Corporate FCC Public File FCC Applications Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}