{"id": 1485, "name": "Journal of Translational Medicine", "domain": "translational-medicine.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://translational-medicine.biomedcentral.com/articles/sections/translational-signaling-and-system-biology", "title": "Translational Signaling And System Biology", "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Submission Guidelines **Articles** SectionsCancer MetabolismCancer MicroenvironmentCardiovascular, Metabolic and Lipoprotein TranslationCell Death and SenescenceCell, Tissue and Gene TherapyCellular MetabolismClinical TranslationCombination StrategiesComputational Modelling and EpidemiologyData-driven Clinical Decision ProcessesDisease BiomarkersEmerging TherapeuticsFibrosisHot TopicsIllnesses of Unknown EtiologyImmune RadioBiologyImmunobiology and ImmunotherapyImmunoVirology and ImmunoOncologyMedical BoinformaticsMolecular PathologyNanobiomaterials & NanomedicineNetwork MedicinesNeuroscienceNutrition & MetabolismPain, Critical Care and AnesthesiaPatient-targeted Molecular TherapiesPersonalized MedicineRegenerative MedicineReproductive Medicine & Clinical Reproductive SciencesTranslational Cancer BiologyTranslational Craniofacial and Dental MedicineTranslational Genomics and GeneticsTranslational HematologyTranslational ImagingTranslational Medicines ‘Ecosystem’Translational MetagenomicsTranslational OphthalmologyTranslational ProcessTranslational Signaling and System Biology Cancer Metabolism Cancer Microenvironment Cardiovascular, Metabolic and Lipoprotein Translation Cell Death and Senescence Cell, Tissue and Gene Therapy Cellular Metabolism Clinical Translation Combination Strategies Computational Modelling and Epidemiology Data-driven Clinical Decision Processes Disease Biomarkers Emerging Therapeutics Fibrosis Hot Topics Illnesses of Unknown Etiology Immune RadioBiology Immunobiology and Immunotherapy ImmunoVirology and ImmunoOncology Medical Boinformatics Molecular Pathology Nanobiomaterials & Nanomedicine Network Medicines Neuroscience Nutrition & Metabolism Pain, Critical Care and Anesthesia Patient-targeted Molecular Therapies Personalized Medicine Regenerative Medicine Reproductive Medicine & Clinical Reproductive Sciences Translational Cancer Biology Translational Craniofacial and Dental Medicine Translational Genomics and Genetics Translational Hematology Translational Imaging Translational Medicines ‘Ecosystem’ Translational Metagenomics Translational Ophthalmology Translational Process Translational Signaling and System Biology Cancer Metabolism Cancer Microenvironment Cardiovascular, Metabolic and Lipoprotein Translation Cell Death and Senescence Cell, Tissue and Gene Therapy Cellular Metabolism Clinical Translation Combination Strategies Computational Modelling and Epidemiology Data-driven Clinical Decision Processes Disease Biomarkers Emerging Therapeutics Fibrosis Hot Topics Illnesses of Unknown Etiology Immune RadioBiology Immunobiology and Immunotherapy ImmunoVirology and ImmunoOncology Medical Boinformatics Molecular Pathology Nanobiomaterials & Nanomedicine Network Medicines Neuroscience Nutrition & Metabolism Pain, Critical Care and Anesthesia Patient-targeted Molecular Therapies Personalized Medicine Regenerative Medicine Reproductive Medicine & Clinical Reproductive Sciences Translational Cancer Biology Translational Craniofacial and Dental Medicine Translational Genomics and Genetics Translational Hematology Translational Imaging Translational Medicines ‘Ecosystem’ Translational Metagenomics Translational Ophthalmology Translational Process Translational Signaling and System Biology Supplements Collections Reviewer acknowledgements **Translational Signaling and System Biology** **Section edited by Marcello Maggiolini** **** The Translational Signaling and System Biology section aims to uncover pivotal transduction signaling involved in pathophysiological processes toward a translational impact on the discovery of novel targets and therapeutics. The section welcomes research and review articles providing new mechanistic insights on a broad range of fields such as cancer, cardiovascular biology, neuroscience, metabolism, inflammation, immunology, microbiology, drug action also through new formulations and delivery methods, novel cellular and animal models, computational and systems biology, innovative laboratory concepts fostering translational research from the bench to the bedside. Page 1 of 4 LINC02888 promotes HGSOC progression and immune evasion via PPIB-mediated stabilization of LAPTM5 mRNA and inhibition of RIG-I-like receptor signalingHigh-grade serous ovarian cancer (HGSOC) remains highly lethal due to late diagnosis and chemoresistance. Long noncoding RNAs (lncRNAs) have emerged as critical regulators of tumor progression. This study inve...Authors:BingJie Rui, YanFeng Yang, DanBo Geng, ZiTeng Kuang, TianLi Mu, YuXi Liu, Bo Ren, RunZe He, XiaoWei Zhang, YuCi Zhang and Min WangCitation:Journal of Translational Medicine202523:640Content type:ResearchPublished on:11 June 2025ViewFull TextViewPDF **LINC02888 promotes HGSOC progression and immune evasion via PPIB-mediated stabilization of LAPTM5 mRNA and inhibition of RIG-I-like receptor signaling** High-grade serous ovarian cancer (HGSOC) remains highly lethal due to late diagnosis and chemoresistance. Long noncoding RNAs (lncRNAs) have emerged as critical regulators of tumor progression. This study inve... ViewFull Text ViewPDF **LINC02888 promotes HGSOC progression and immune evasion via PPIB-mediated stabilization of LAPTM5 mRNA and inhibition of RIG-I-like receptor signaling** High-grade serous ovarian cancer (HGSOC) remains highly lethal due to late diagnosis and chemoresistance. Long noncoding RNAs (lncRNAs) have emerged as critical regulators of tumor progression. This study inve... ViewFull Text ViewPDF Targeting inflammasomes as an immunotherapeutic strategy for cancerInflammasomes are essential regulators of innate immunity, inflammation, and cellular apoptosis, and they have surfaced as significant modulators of cancer progression and regulation. Inflammasomes are macromo...Authors:Luanluan Huang, Xiaoyan Chen, Ruiqi Liu, Ding Nan, Wenxuan Bao, Lixian Yang, Xiaomeng Dai, Jianming Tang, Haibo Zhang and Yanwei LuCitation:Journal of Translational Medicine202523:634Content type:ReviewPublished on:8 June 2025ViewFull TextViewPDF **Targeting inflammasomes as an immunotherapeutic strategy for cancer** Inflammasomes are essential regulators of innate immunity, inflammation, and cellular apoptosis, and they have surfaced as significant modulators of cancer progression and regulation. Inflammasomes are macromo... ViewFull Text ViewPDF **Targeting inflammasomes as an immunotherapeutic strategy for cancer** Inflammasomes are essential regulators of innate immunity, inflammation, and cellular apoptosis, and they have surfaced as significant modulators of cancer progression and regulation. Inflammasomes are macromo... ViewFull Text ViewPDF Unraveling the role of M2 TAMs in ovarian cancer dynamics: a systematic reviewTumor-associated macrophages (TAMs) represent the dominant immune cell subset within the ovarian tumor microenvironment, which exhibits remarkable plasticity. They can readily undergo polarization toward an im...Authors:Yaping Wang, Caixia Ma, Xiabing Li, Fangfang Yang, Na Wang, Gaili Ji, Qing Liu, Hai Zhu, Shengnan Xu and Hongyu LiCitation:Journal of Translational Medicine202523:623Content type:ReviewPublished on:3 June 2025ViewFull TextViewPDF **Unraveling the role of M2 TAMs in ovarian cancer dynamics: a systematic review** Tumor-associated macrophages (TAMs) represent the dominant immune cell subset within the ovarian tumor microenvironment, which exhibits remarkable plasticity. They can readily undergo polarization toward an im... ViewFull Text ViewPDF **Unraveling the role of M2 TAMs in ovarian cancer dynamics: a systematic review** Tumor-associated macrophages (TAMs) represent the dominant immune cell subset within the ovarian tumor microenvironment, which exhibits remarkable plasticity. They can readily undergo polarization toward an im... ViewFull Text ViewPDF Macrophages in prostate cancer: dual roles in tumor progression and immune evasionProstate malignant tumors are notably common within the male urinary tract and present significant challenges in medical treatment. A crucial aspect of understanding the progression of these tumors involves ex...Authors:Ruihong Liu, Jianxin Lu, Jun Liu, Yilei Liao, Yinuo Guo, Peiqi Shi, Ziqiang Wang, Han Wang and Jingling LaiCitation:Journal of Translational Medicine202523:615Content type:ReviewPublished on:2 June 2025ViewFull TextViewPDF **Macrophages in prostate cancer: dual roles in tumor progression and immune evasion** Prostate malignant tumors are notably common within the male urinary tract and present significant challenges in medical treatment. A crucial aspect of understanding the progression of these tumors involves ex... ViewFull Text ViewPDF **Macrophages in prostate cancer: dual roles in tumor progression and immune evasion** Prostate malignant tumors are notably common within the male urinary tract and present significant challenges in medical treatment. A crucial aspect of understanding the progression of these tumors involves ex... ViewFull Text ViewPDF SLIT3-mediated intratumoral crosstalk induces neuroblastoma differentiation via a spontaneous regression-like programNeuroblastoma, the most common pediatric extracranial solid tumor, has heterogeneous clinical outcomes ranging from malignant progression to spontaneous regression. With the highest frequency of the elusive sp...Authors:Meiling Liu, Dekang Lv, Wenjing Yan, Yi Wu, Shulan Wang, Luoxuan Wang, Jie Lei, Deshun Zeng, Zifeng Wang, Fang Liu, Bing Deng, Quentin Liu, Bin He and Min YanCitation:Journal of Translational Medicine202523:598Content type:ResearchPublished on:30 May 2025ViewFull TextViewPDF **SLIT3-mediated intratumoral crosstalk induces neuroblastoma differentiation via a spontaneous regression-like program** Neuroblastoma, the most common pediatric extracranial solid tumor, has heterogeneous clinical outcomes ranging from malignant progression to spontaneous regression. With the highest frequency of the elusive sp... ViewFull Text ViewPDF **SLIT3-mediated intratumoral crosstalk induces neuroblastoma differentiation via a spontaneous regression-like program** Neuroblastoma, the most common pediatric extracranial solid tumor, has heterogeneous clinical outcomes ranging from malignant progression to spontaneous regression. With the highest frequency of the elusive sp... ViewFull Text ViewPDF The human RNASET2 alarmin-like molecule differentially affects prostate cancer cells behavior in both cell autonomous and non-cell autonomous mannersThe identification of molecules that make cancer cells detectable by the immune system represents a major challenge in tumor immunology. Alarmins, endogenous, stress-induced molecules, serve as early warning s...Authors:Rossella Roncoroni, Denisa Baci, Martina Cucchiara, Annarosaria de Vito, Matteo Gallazzi, Maria Teresa Palano, Francesca Olmeo, Cristian Rubuano, Alessandra Giannatiempo, Laura Monti, Raffaella Bombelli, Daniele Mercatelli, Giovanna Finzi, Francesca Franzi, Stefano La Rosa, Douglas M. Noonan…Citation:Journal of Translational Medicine202523:560Content type:ResearchPublished on:19 May 2025ViewFull TextViewPDF **The human RNASET2 alarmin-like molecule differentially affects prostate cancer cells behavior in both cell autonomous and non-cell autonomous manners** The identification of molecules that make cancer cells detectable by the immune system represents a major challenge in tumor immunology. Alarmins, endogenous, stress-induced molecules, serve as early warning s... ViewFull Text ViewPDF **The human RNASET2 alarmin-like molecule differentially affects prostate cancer cells behavior in both cell autonomous and non-cell autonomous manners** The identification of molecules that make cancer cells detectable by the immune system represents a major challenge in tumor immunology. Alarmins, endogenous, stress-induced molecules, serve as early warning s... ViewFull Text ViewPDF Invadopodia in cancer metastasis: dynamics, regulation, and targeted therapiesPseudopodia and invadopodia are dynamic, actin-rich membrane structures extending from the cell surface. While pseudopodia are found in various cell types, invadopodia are exclusive to tumor cells and play a k...Authors:Zhixiong Hao, Manru Zhang, Yao Du, Jiaxing Liu, Guolong Zeng, Hangyu Li and Xueqiang PengCitation:Journal of Translational Medicine202523:548Content type:ReviewPublished on:16 May 2025ViewFull TextViewPDF **Invadopodia in cancer metastasis: dynamics, regulation, and targeted therapies** Pseudopodia and invadopodia are dynamic, actin-rich membrane structures extending from the cell surface. While pseudopodia are found in various cell types, invadopodia are exclusive to tumor cells and play a k... ViewFull Text ViewPDF **Invadopodia in cancer metastasis: dynamics, regulation, and targeted therapies** Pseudopodia and invadopodia are dynamic, actin-rich membrane structures extending from the cell surface. While pseudopodia are found in various cell types, invadopodia are exclusive to tumor cells and play a k... ViewFull Text ViewPDF Rasal2 inhibits autophagic-exosomes secretion via regulating Rab27a in triple-negative breast cancer progressionTriple-negative breast cancer (TNBC) is a subtype with the worst prognosis and there is still a lack of effective treatment. Exosomes (Exos) secreted by cancer cells to tumor microenvironment play an important...Authors:Xuan Wang, Guocui Qi, Kunning Yang, Linlin Ma, Yuansai Kang, Xiaojing Tang and YanTao HanCitation:Journal of Translational Medicine202523:544Content type:ResearchPublished on:14 May 2025ViewFull TextViewPDF **Rasal2 inhibits autophagic-exosomes secretion via regulating Rab27a in triple-negative breast cancer progression** Triple-negative breast cancer (TNBC) is a subtype with the worst prognosis and there is still a lack of effective treatment. Exosomes (Exos) secreted by cancer cells to tumor microenvironment play an important... ViewFull Text ViewPDF **Rasal2 inhibits autophagic-exosomes secretion via regulating Rab27a in triple-negative breast cancer progression** Triple-negative breast cancer (TNBC) is a subtype with the worst prognosis and there is still a lack of effective treatment. Exosomes (Exos) secreted by cancer cells to tumor microenvironment play an important... ViewFull Text ViewPDF Role of tumor microenvironment in ovarian cancer metastasis and clinical advancementsOvarian cancer (OC) is the most lethal gynecological malignancy worldwide, characterized by heterogeneity at the molecular, cellular and anatomical levels. Most patients are diagnosed at an advanced stage, cha...Authors:Yang Wang, Na Zhu, Jing Liu, Fang Chen, Yang Song, Yue Ma, Zhuo Yang and Danbo WangCitation:Journal of Translational Medicine202523:539Content type:ReviewPublished on:14 May 2025ViewFull TextViewPDF **Role of tumor microenvironment in ovarian cancer metastasis and clinical advancements** Ovarian cancer (OC) is the most lethal gynecological malignancy worldwide, characterized by heterogeneity at the molecular, cellular and anatomical levels. Most patients are diagnosed at an advanced stage, cha... ViewFull Text ViewPDF **Role of tumor microenvironment in ovarian cancer metastasis and clinical advancements** Ovarian cancer (OC) is the most lethal gynecological malignancy worldwide, characterized by heterogeneity at the molecular, cellular and anatomical levels. Most patients are diagnosed at an advanced stage, cha... ViewFull Text ViewPDF Tertiary lymphoid structures in gliomas: impact on tumour immunity and progressionTertiary lymphoid structures (TLSs) are ectopic lymphoid formations that develop in chronically inflamed tissues, including various solid tumours. In the context of gliomas, the presence of TLSs has recently a...Authors:Jiatong Chen, Yuechao Yang, Shuang Luan, Wenhao Xu and Yang GaoCitation:Journal of Translational Medicine202523:528Content type:ReviewPublished on:9 May 2025ViewFull TextViewPDF **Tertiary lymphoid structures in gliomas: impact on tumour immunity and progression** Tertiary lymphoid structures (TLSs) are ectopic lymphoid formations that develop in chronically inflamed tissues, including various solid tumours. In the context of gliomas, the presence of TLSs has recently a... ViewFull Text ViewPDF **Tertiary lymphoid structures in gliomas: impact on tumour immunity and progression** Tertiary lymphoid structures (TLSs) are ectopic lymphoid formations that develop in chronically inflamed tissues, including various solid tumours. In the context of gliomas, the presence of TLSs has recently a... ViewFull Text ViewPDF PD-1 regulates the anti-tumor immune function of macrophages through JAK2-STAT3 signaling pathway in colorectal cancer tumor microenvironmentTumor-associated macrophages (TAMs), as key immune components of the TME, play a pivotal role in tumor progression by fostering an immunosuppressive environment. Programmed death 1 (PD-1), a critical immune ch...Authors:Han Jiang, Jingjing Pang, Tengyue Li, Atitso Akofala, Xiaoxi Zhou, Changhua Yi, Shangwei Ning, Xu Gao, Yu Qiao and Jiayuan KouCitation:Journal of Translational Medicine202523:502Content type:ResearchPublished on:2 May 2025ViewFull TextViewPDF **PD-1 regulates the anti-tumor immune function of macrophages through JAK2-STAT3 signaling pathway in colorectal cancer tumor microenvironment** Tumor-associated macrophages (TAMs), as key immune components of the TME, play a pivotal role in tumor progression by fostering an immunosuppressive environment. Programmed death 1 (PD-1), a critical immune ch... ViewFull Text ViewPDF **PD-1 regulates the anti-tumor immune function of macrophages through JAK2-STAT3 signaling pathway in colorectal cancer tumor microenvironment** Tumor-associated macrophages (TAMs), as key immune components of the TME, play a pivotal role in tumor progression by fostering an immunosuppressive environment. Programmed death 1 (PD-1), a critical immune ch... ViewFull Text ViewPDF Reproducible extracellular matrices for tumor organoid culture: challenges and opportunitiesTumor organoid models have emerged as valuable 3D in vitro systems to study cancer behavior in a physiologically relevant environment. The composition and architecture of the extracellular matrix (ECM) play cr...Authors:Kan Li, Yibo He, Xue Jin, Ketao Jin and Jun QianCitation:Journal of Translational Medicine202523:497Content type:ReviewPublished on:1 May 2025ViewFull TextViewPDF **Reproducible extracellular matrices for tumor organoid culture: challenges and opportunities** Tumor organoid models have emerged as valuable 3D in vitro systems to study cancer behavior in a physiologically relevant environment. The composition and architecture of the extracellular matrix (ECM) play cr... ViewFull Text ViewPDF **Reproducible extracellular matrices for tumor organoid culture: challenges and opportunities** Tumor organoid models have emerged as valuable 3D in vitro systems to study cancer behavior in a physiologically relevant environment. The composition and architecture of the extracellular matrix (ECM) play cr... ViewFull Text ViewPDF Unleashing the therapeutic potential of tumor-draining lymph nodes: spotlight on bladder cancerTumor-draining lymph nodes (TDLNs) are often involved during the metastasis of bladder cancer (BC), which is associated with a poor prognosis. Recent studies have shown that TDLNs are a major source of host an...Authors:Xin Yang, Xiangyu Wu, Xuyang Hao, Tianhang Li, Hongqian Guo and Rong YangCitation:Journal of Translational Medicine202523:489Content type:ReviewPublished on:29 April 2025ViewFull TextViewPDF **Unleashing the therapeutic potential of tumor-draining lymph nodes: spotlight on bladder cancer** Tumor-draining lymph nodes (TDLNs) are often involved during the metastasis of bladder cancer (BC), which is associated with a poor prognosis. Recent studies have shown that TDLNs are a major source of host an... ViewFull Text ViewPDF **Unleashing the therapeutic potential of tumor-draining lymph nodes: spotlight on bladder cancer** Tumor-draining lymph nodes (TDLNs) are often involved during the metastasis of bladder cancer (BC), which is associated with a poor prognosis. Recent studies have shown that TDLNs are a major source of host an... ViewFull Text ViewPDF Recent advances in TAM mechanisms in lung diseasesTYRO3, MERTK, and AXL receptor tyrosine kinases, collectively known as TAM receptors, play a vital role in maintaining lung tissue homeostasis by regulating integrity and self-renewal. These receptors activate...Authors:Jiaqi Ban, Jiayi Qian, Chi Zhang and Jun LiCitation:Journal of Translational Medicine202523:479Content type:ReviewPublished on:26 April 2025ViewFull TextViewPDF **Recent advances in TAM mechanisms in lung diseases** TYRO3, MERTK, and AXL receptor tyrosine kinases, collectively known as TAM receptors, play a vital role in maintaining lung tissue homeostasis by regulating integrity and self-renewal. These receptors activate... ViewFull Text ViewPDF **Recent advances in TAM mechanisms in lung diseases** TYRO3, MERTK, and AXL receptor tyrosine kinases, collectively known as TAM receptors, play a vital role in maintaining lung tissue homeostasis by regulating integrity and self-renewal. These receptors activate... ViewFull Text ViewPDF Advances in tumor subclone formation and mechanisms of growth and invasionTumor subclones refer to distinct cell populations within the same tumor that possess different genetic characteristics. They play a crucial role in understanding tumor heterogeneity, evolution, and therapeuti...Authors:Yuhong Zhang and Weidong WangCitation:Journal of Translational Medicine202523:461Content type:ReviewPublished on:21 April 2025ViewFull TextViewPDF **Advances in tumor subclone formation and mechanisms of growth and invasion** Tumor subclones refer to distinct cell populations within the same tumor that possess different genetic characteristics. They play a crucial role in understanding tumor heterogeneity, evolution, and therapeuti... ViewFull Text ViewPDF **Advances in tumor subclone formation and mechanisms of growth and invasion** Tumor subclones refer to distinct cell populations within the same tumor that possess different genetic characteristics. They play a crucial role in understanding tumor heterogeneity, evolution, and therapeuti... ViewFull Text ViewPDF Malignant mesothelioma-associated inflammatory microenvironment promotes tumor progression via GPNMBTumor-Associated Macrophages (TAMs) are the main immune component of the tumor stroma with heterogeneous functional activities, predominantly suppressing the immune response and promoting tumor progression, al...Authors:Cristina Belgiovine, Elisabeth Digifico, Marco Erreni, Anna Rita Putignano, Laura Mannarino, Sonia Valentino, Fabio Grizzi, Fabio Pasqualini, Camilla Recordati, Luca Bertola, Paolo Zucali, Daniela Pistillo, Valentina Paleari, Alberto Mantovani, Maurizio D’Incalci, Federica Marchesi…Citation:Journal of Translational Medicine202523:454Content type:ResearchPublished on:18 April 2025ViewFull TextViewPDF **Malignant mesothelioma-associated inflammatory microenvironment promotes tumor progression via GPNMB** Tumor-Associated Macrophages (TAMs) are the main immune component of the tumor stroma with heterogeneous functional activities, predominantly suppressing the immune response and promoting tumor progression, al... ViewFull Text ViewPDF **Malignant mesothelioma-associated inflammatory microenvironment promotes tumor progression via GPNMB** Tumor-Associated Macrophages (TAMs) are the main immune component of the tumor stroma with heterogeneous functional activities, predominantly suppressing the immune response and promoting tumor progression, al... ViewFull Text ViewPDF CAFs activated by YAP1 upregulate cancer matrix stiffness to mediate hepatocellular carcinoma progressionThe stiffness of the matrix is closely related to the progression of hepatocellular carcinoma (HCC). Although direct targeting of stromal rigidity in HCC remains a clinical challenge, cancer-associated fibrobl...Authors:Wei Yan, Guo-hui Xiao, Li-juan Wang, Yan Zhou, Fa Yang and Kuan-hou MouCitation:Journal of Translational Medicine202523:450Content type:ResearchPublished on:16 April 2025ViewFull TextViewPDF **CAFs activated by YAP1 upregulate cancer matrix stiffness to mediate hepatocellular carcinoma progression** The stiffness of the matrix is closely related to the progression of hepatocellular carcinoma (HCC). Although direct targeting of stromal rigidity in HCC remains a clinical challenge, cancer-associated fibrobl... ViewFull Text ViewPDF **CAFs activated by YAP1 upregulate cancer matrix stiffness to mediate hepatocellular carcinoma progression** The stiffness of the matrix is closely related to the progression of hepatocellular carcinoma (HCC). Although direct targeting of stromal rigidity in HCC remains a clinical challenge, cancer-associated fibrobl... ViewFull Text ViewPDF Application of EGFR-TKIs in brain tumors, a breakthrough in future?Brain tumors, both primary and secondary, represent a significant clinical challenge due to their high mortality and limited treatment options. Primary brain tumors, such as gliomas and meningiomas, and brain ...Authors:Shiying Feng, Huiqin Liu, Cuilan Yun, Wei Zhu and Yuanming PanCitation:Journal of Translational Medicine202523:449Content type:ReviewPublished on:16 April 2025ViewFull TextViewPDF **Application of EGFR-TKIs in brain tumors, a breakthrough in future?** Brain tumors, both primary and secondary, represent a significant clinical challenge due to their high mortality and limited treatment options. Primary brain tumors, such as gliomas and meningiomas, and brain ... ViewFull Text ViewPDF **Application of EGFR-TKIs in brain tumors, a breakthrough in future?** Brain tumors, both primary and secondary, represent a significant clinical challenge due to their high mortality and limited treatment options. Primary brain tumors, such as gliomas and meningiomas, and brain ... ViewFull Text ViewPDF Matrix metalloproteinase-driven epithelial-mesenchymal transition: implications in health and diseaseEpithelial–mesenchymal transition (EMT) is a process in which epithelial cells, defined by apical–basal polarity and tight intercellular junctions, acquire migratory and invasive properties characteristic of m...Authors:Ghazaleh Khalili-Tanha, Evette S. Radisky, Derek C. Radisky and Alireza ShoariCitation:Journal of Translational Medicine202523:436Content type:ReviewPublished on:11 April 2025ViewFull TextViewPDF **Matrix metalloproteinase-driven epithelial-mesenchymal transition: implications in health and disease** Epithelial–mesenchymal transition (EMT) is a process in which epithelial cells, defined by apical–basal polarity and tight intercellular junctions, acquire migratory and invasive properties characteristic of m... ViewFull Text ViewPDF **Matrix metalloproteinase-driven epithelial-mesenchymal transition: implications in health and disease** Epithelial–mesenchymal transition (EMT) is a process in which epithelial cells, defined by apical–basal polarity and tight intercellular junctions, acquire migratory and invasive properties characteristic of m... ViewFull Text ViewPDF Targeting PRDX2 to inhibit tumor growth and metastasis in triple-negative breast cancer: the role of FN1 and the PI3K/AKT/SP1 pathwayTriple-negative breast cancer (TNBC) is characterized by high invasiveness, high potential for metastasis, easy recurrence, and poor prognosis. There is an urgent need to develop new clinical treatments.Authors:Jiawei Zhou, Anqi Cheng, Jianqiang Guo, Yafeng Liu, Xuan Li, Maoqian Chen, Dong Hu and Jing WuCitation:Journal of Translational Medicine202523:434Content type:ResearchPublished on:11 April 2025ViewFull TextViewPDF **Targeting PRDX2 to inhibit tumor growth and metastasis in triple-negative breast cancer: the role of FN1 and the PI3K/AKT/SP1 pathway** Triple-negative breast cancer (TNBC) is characterized by high invasiveness, high potential for metastasis, easy recurrence, and poor prognosis. There is an urgent need to develop new clinical treatments. ViewFull Text ViewPDF **Targeting PRDX2 to inhibit tumor growth and metastasis in triple-negative breast cancer: the role of FN1 and the PI3K/AKT/SP1 pathway** Triple-negative breast cancer (TNBC) is characterized by high invasiveness, high potential for metastasis, easy recurrence, and poor prognosis. There is an urgent need to develop new clinical treatments. ViewFull Text ViewPDF Vorinostat impairs the cancer-driving potential of leukemia-secreted extracellular vesiclesLeukemia-secreted extracellular vesicles (EVs) carry biologically active cargo that promotes cancer-supportive mechanisms, including aberrant proliferative signaling, immune escape, and drug resistance. Howeve...Authors:Crescenzo Massaro, Giulia Sgueglia, Annamaria Muro, Damiana Pieragostino, Paola Lanuti, Maria Concetta Cufaro, Cristina Giorgio, Erika D’Agostino, Laura Della Torre, Serena Rubina Baglio, Marinella Pirozzi, Mariacarla De Simone, Lucia Altucci and Carmela Dell’AversanaCitation:Journal of Translational Medicine202523:421Content type:ResearchPublished on:10 April 2025ViewFull TextViewPDF **Vorinostat impairs the cancer-driving potential of leukemia-secreted extracellular vesicles** Leukemia-secreted extracellular vesicles (EVs) carry biologically active cargo that promotes cancer-supportive mechanisms, including aberrant proliferative signaling, immune escape, and drug resistance. Howeve... ViewFull Text ViewPDF **Vorinostat impairs the cancer-driving potential of leukemia-secreted extracellular vesicles** Leukemia-secreted extracellular vesicles (EVs) carry biologically active cargo that promotes cancer-supportive mechanisms, including aberrant proliferative signaling, immune escape, and drug resistance. Howeve... ViewFull Text ViewPDF SORBS3-β suppresses lymph node metastasis in cervical cancer by promoting the ubiquitination of β-cateninCervical cancer (CC) is a prevalent gynecological malignancy, with lymph node metastasis (LNM) serving as a critical factor influencing patient prognosis. SORBS3, an adaptor protein with two known isoforms (α ...Authors:Huating Sun, Yinghui Zhang, Fang Wang, Zizhao Wang, Yuhong Zhang, Youguo Chen, Li Wang and Jinhua ZhouCitation:Journal of Translational Medicine202523:406Content type:ResearchPublished on:8 April 2025ViewFull TextViewPDF **SORBS3-β suppresses lymph node metastasis in cervical cancer by promoting the ubiquitination of β-catenin** Cervical cancer (CC) is a prevalent gynecological malignancy, with lymph node metastasis (LNM) serving as a critical factor influencing patient prognosis. SORBS3, an adaptor protein with two known isoforms (α ... ViewFull Text ViewPDF **SORBS3-β suppresses lymph node metastasis in cervical cancer by promoting the ubiquitination of β-catenin** Cervical cancer (CC) is a prevalent gynecological malignancy, with lymph node metastasis (LNM) serving as a critical factor influencing patient prognosis. SORBS3, an adaptor protein with two known isoforms (α ... ViewFull Text ViewPDF The NcRNA/Wnt axis in lung cancer: oncogenic mechanisms, remarkable indicators and therapeutic targetsEarly diagnosis of lung cancer (LC) is challenging, treatment options are limited, and treatment resistance leads to poor prognosis and management in most patients. The Wnt/β-catenin signaling pathway plays a ...Authors:Yang Zhong, Jia-Wei He, Chun-Xia Huang, Heng-Zhou Lai, Xue-Ke Li, Chuan Zheng, Xi Fu, Feng-Ming You and Qiong MaCitation:Journal of Translational Medicine202523:326Content type:ReviewPublished on:14 March 2025ViewFull TextViewPDF **The NcRNA/Wnt axis in lung cancer: oncogenic mechanisms, remarkable indicators and therapeutic targets** Early diagnosis of lung cancer (LC) is challenging, treatment options are limited, and treatment resistance leads to poor prognosis and management in most patients. The Wnt/β-catenin signaling pathway plays a ... ViewFull Text ViewPDF **The NcRNA/Wnt axis in lung cancer: oncogenic mechanisms, remarkable indicators and therapeutic targets** Early diagnosis of lung cancer (LC) is challenging, treatment options are limited, and treatment resistance leads to poor prognosis and management in most patients. The Wnt/β-catenin signaling pathway plays a ... ViewFull Text ViewPDF Notch signaling in the tumor immune microenvironment of colorectal cancer: mechanisms and therapeutic opportunitiesColorectal cancer (CRC) remains a leading cause of cancer-related morbidity and mortality worldwide, driven by a complex interplay of genetic, environmental, and immune-related factors. Among the pivotal pathw...Authors:Jiachun Sun, Yi Chen, Ziyi Xu, Weizheng Wang and Penghui LiCitation:Journal of Translational Medicine202523:315Content type:ReviewPublished on:12 March 2025ViewFull TextViewPDF **Notch signaling in the tumor immune microenvironment of colorectal cancer: mechanisms and therapeutic opportunities** Colorectal cancer (CRC) remains a leading cause of cancer-related morbidity and mortality worldwide, driven by a complex interplay of genetic, environmental, and immune-related factors. Among the pivotal pathw... ViewFull Text ViewPDF **Notch signaling in the tumor immune microenvironment of colorectal cancer: mechanisms and therapeutic opportunities** Colorectal cancer (CRC) remains a leading cause of cancer-related morbidity and mortality worldwide, driven by a complex interplay of genetic, environmental, and immune-related factors. Among the pivotal pathw... ViewFull Text ViewPDF The impact of dysregulation SUMOylation on prostate cancerProstate cancer (PCa) remains one of the most common malignancies in men, with its development and progression being governed by complex molecular pathways. SUMOylation, a post-translational modification (PTM)...Authors:Kailang Li, Haifeng Wang, Bitao Jiang and Xiaofeng JinCitation:Journal of Translational Medicine202523:286Content type:ReviewPublished on:6 March 2025ViewFull TextViewPDF **The impact of dysregulation SUMOylation on prostate cancer** Prostate cancer (PCa) remains one of the most common malignancies in men, with its development and progression being governed by complex molecular pathways. SUMOylation, a post-translational modification (PTM)... ViewFull Text ViewPDF **The impact of dysregulation SUMOylation on prostate cancer** Prostate cancer (PCa) remains one of the most common malignancies in men, with its development and progression being governed by complex molecular pathways. SUMOylation, a post-translational modification (PTM)... ViewFull Text ViewPDF Targeting PI3K signaling in Lung Cancer: advances, challenges and therapeutic opportunitiesLung cancer remains the leading cause of cancer-related mortality globally, necessitating the continual exploration of novel therapeutic targets. The phosphoinositide 3-kinase (PI3K) signaling pathway plays a ...Authors:Bitian Zhang, Ping-Chung Leung, William Chi-Shing Cho, Chun-Kwok Wong and Dongjie WangCitation:Journal of Translational Medicine202523:184Content type:ReviewPublished on:14 February 2025ViewFull TextViewPDF **Targeting PI3K signaling in Lung Cancer: advances, challenges and therapeutic opportunities** Lung cancer remains the leading cause of cancer-related mortality globally, necessitating the continual exploration of novel therapeutic targets. The phosphoinositide 3-kinase (PI3K) signaling pathway plays a ... ViewFull Text ViewPDF **Targeting PI3K signaling in Lung Cancer: advances, challenges and therapeutic opportunities** Lung cancer remains the leading cause of cancer-related mortality globally, necessitating the continual exploration of novel therapeutic targets. The phosphoinositide 3-kinase (PI3K) signaling pathway plays a ... ViewFull Text ViewPDF Role of CD4+T cells in cancer immunity: a single-cell sequencing exploration of tumor microenvironmentRecent oncological research has intensely focused on the tumor immune microenvironment (TME), particularly the functions of CD4 + T lymphocytes. CD4+T lymphocytes have been implicated in antigen presentation, cy...Authors:Qi An, Li Duan, Yuanyuan Wang, Fuxin Wang, Xiang Liu, Chao Liu and Qinyong HuCitation:Journal of Translational Medicine202523:179Content type:ReviewPublished on:14 February 2025ViewFull TextViewPDF **Role of CD4+T cells in cancer immunity: a single-cell sequencing exploration of tumor microenvironment** Recent oncological research has intensely focused on the tumor immune microenvironment (TME), particularly the functions of CD4 + T lymphocytes. CD4+T lymphocytes have been implicated in antigen presentation, cy... ViewFull Text ViewPDF **Role of CD4+T cells in cancer immunity: a single-cell sequencing exploration of tumor microenvironment** Recent oncological research has intensely focused on the tumor immune microenvironment (TME), particularly the functions of CD4 + T lymphocytes. CD4+T lymphocytes have been implicated in antigen presentation, cy... ViewFull Text ViewPDF Targeting ferroptosis in prostate cancer management: molecular mechanisms, multidisciplinary strategies and translational perspectivesProstate cancer (PCa) is a kind of malignant solid tumor commonly observed among males worldwide. The dilemma of increasing incidence with therapeutic resistance has become the leading issue in PCa clinical ma...Authors:Hubo Yang, Xuefeng Zhang, Zongming Jia, He Wang, Jixiang Wu, Xuedong Wei, Yuhua Huang, Wenying Yan and Yuxin LinCitation:Journal of Translational Medicine202523:166Content type:ReviewPublished on:7 February 2025ViewFull TextViewPDF **Targeting ferroptosis in prostate cancer management: molecular mechanisms, multidisciplinary strategies and translational perspectives** Prostate cancer (PCa) is a kind of malignant solid tumor commonly observed among males worldwide. The dilemma of increasing incidence with therapeutic resistance has become the leading issue in PCa clinical ma... ViewFull Text ViewPDF **Targeting ferroptosis in prostate cancer management: molecular mechanisms, multidisciplinary strategies and translational perspectives** Prostate cancer (PCa) is a kind of malignant solid tumor commonly observed among males worldwide. The dilemma of increasing incidence with therapeutic resistance has become the leading issue in PCa clinical ma... ViewFull Text ViewPDF Long non-coding RNA MIR4435-2HG modulates pancreatic cancer stem cells and chemosensitivity to gemcitabine by targeting the miR-1252-5p/STAT1Cancer stem cells (CSCs) are key drivers of cancer progression and therapeutic resistance. Long non-coding RNAs (lncRNAs) have emerged as critical regulators of CSC properties. The aim of this study was to inv...Authors:Baocheng Xie, Peishan Wu, Hongyu Liu, XiangDi Yang and Linxuan HuangCitation:Journal of Translational Medicine202523:165Content type:ResearchPublished on:7 February 2025TheCorrection to this articlehas been published inJournal of Translational Medicine202523:526ViewFull TextViewPDF **Long non-coding RNA MIR4435-2HG modulates pancreatic cancer stem cells and chemosensitivity to gemcitabine by targeting the miR-1252-5p/STAT1** Cancer stem cells (CSCs) are key drivers of cancer progression and therapeutic resistance. Long non-coding RNAs (lncRNAs) have emerged as critical regulators of CSC properties. The aim of this study was to inv... TheCorrection to this articlehas been published inJournal of Translational Medicine202523:526 ViewFull Text ViewPDF **Long non-coding RNA MIR4435-2HG modulates pancreatic cancer stem cells and chemosensitivity to gemcitabine by targeting the miR-1252-5p/STAT1** Cancer stem cells (CSCs) are key drivers of cancer progression and therapeutic resistance. Long non-coding RNAs (lncRNAs) have emerged as critical regulators of CSC properties. The aim of this study was to inv... TheCorrection to this articlehas been published inJournal of Translational Medicine202523:526 ViewFull Text ViewPDF Wnt signaling as a translational target in rheumatoid and psoriatic arthritisRheumatoid arthritis (RA) and Psoriatic arthritis (PsA) are chronic inflammatory diseases mainly affecting joints. RA primarily targets the synovial joints and is characterized by cartilage and bone erosion, w...Authors:Gloria Riitano, Francesca Spinelli, Valeria Manganelli, Daniela Caissutti, Antonella Capozzi, Cristina Garufi, Tina Garofalo, Roberta Misasi, Maurizio Sorice, Fabrizio Conti, Agostina Longo and Cristiano AlessandriCitation:Journal of Translational Medicine202523:158Content type:ResearchPublished on:4 February 2025ViewFull TextViewPDF **Wnt signaling as a translational target in rheumatoid and psoriatic arthritis** Rheumatoid arthritis (RA) and Psoriatic arthritis (PsA) are chronic inflammatory diseases mainly affecting joints. RA primarily targets the synovial joints and is characterized by cartilage and bone erosion, w... ViewFull Text ViewPDF **Wnt signaling as a translational target in rheumatoid and psoriatic arthritis** Rheumatoid arthritis (RA) and Psoriatic arthritis (PsA) are chronic inflammatory diseases mainly affecting joints. RA primarily targets the synovial joints and is characterized by cartilage and bone erosion, w... ViewFull Text ViewPDF Tumor-derived exosomal lncRNA-MIR193BHG promotes bone metastasis of breast cancer by targeting the miR-489-3p/DNMT3A signaling axis in osteoclastsBreast cancer exhibits high incidence and mortality among women, with distant metastasis, especially bone metastasis, being the leading cause of death. Despite advances in adjuvant therapies, bone metastasis r...Authors:Xiaoya Liu, Rui Ma, Feng Wei, Maihuan Wang, Yiwei Jiang, Peng Zheng and Zhen CaoCitation:Journal of Translational Medicine202523:142Content type:ResearchPublished on:31 January 2025ViewFull TextViewPDF **Tumor-derived exosomal lncRNA-MIR193BHG promotes bone metastasis of breast cancer by targeting the miR-489-3p/DNMT3A signaling axis in osteoclasts** Breast cancer exhibits high incidence and mortality among women, with distant metastasis, especially bone metastasis, being the leading cause of death. Despite advances in adjuvant therapies, bone metastasis r... ViewFull Text ViewPDF **Tumor-derived exosomal lncRNA-MIR193BHG promotes bone metastasis of breast cancer by targeting the miR-489-3p/DNMT3A signaling axis in osteoclasts** Breast cancer exhibits high incidence and mortality among women, with distant metastasis, especially bone metastasis, being the leading cause of death. Despite advances in adjuvant therapies, bone metastasis r... ViewFull Text ViewPDF UBE2J1 is identified as a novel plasma cell-related gene involved in the prognosis of high-grade serous ovarian cancerImmune cells within tumor tissues play important roles in remodeling the tumor microenvironment, thus affecting tumor progression and the therapeutic response. The current study was designed to identify key ma...Authors:Yunjie Tian, Ruoyu Dong, Yingxia Guan, Ying Wang, Wei Zhao, Jun Zhang and Shan KangCitation:Journal of Translational Medicine202523:129Content type:ResearchPublished on:28 January 2025ViewFull TextViewPDF **UBE2J1 is identified as a novel plasma cell-related gene involved in the prognosis of high-grade serous ovarian cancer** Immune cells within tumor tissues play important roles in remodeling the tumor microenvironment, thus affecting tumor progression and the therapeutic response. The current study was designed to identify key ma... ViewFull Text ViewPDF **UBE2J1 is identified as a novel plasma cell-related gene involved in the prognosis of high-grade serous ovarian cancer** Immune cells within tumor tissues play important roles in remodeling the tumor microenvironment, thus affecting tumor progression and the therapeutic response. The current study was designed to identify key ma... ViewFull Text ViewPDF Endogenous peptide CBDP1 inhibits clear cell renal cell carcinoma progression by targeting USP5/YTHDF2/TRPM5 axisBackground: Clear cell renal cell carcinoma (ccRCC) has a high incidence rate and poor prognosis, and currently lacks effective therapies. Recently, peptide-based drugs have shown promise in cancer treatment. ...Authors:Yang Zhang, Wei Zhu, Ruijie Tao, Weijian Li, Chunming Jiang and Xiang YanCitation:Journal of Translational Medicine202523:116Content type:ResearchPublished on:25 January 2025ViewFull TextViewPDF **Endogenous peptide CBDP1 inhibits clear cell renal cell carcinoma progression by targeting USP5/YTHDF2/TRPM5 axis** Background: Clear cell renal cell carcinoma (ccRCC) has a high incidence rate and poor prognosis, and currently lacks effective therapies. Recently, peptide-based drugs have shown promise in cancer treatment. ... ViewFull Text ViewPDF **Endogenous peptide CBDP1 inhibits clear cell renal cell carcinoma progression by targeting USP5/YTHDF2/TRPM5 axis** Background: Clear cell renal cell carcinoma (ccRCC) has a high incidence rate and poor prognosis, and currently lacks effective therapies. Recently, peptide-based drugs have shown promise in cancer treatment. ... ViewFull Text ViewPDF Single-cell profiling of SLC family transporters: uncovering the role of SLC7A1 in osteosarcomaOsteosarcoma is the most common malignant bone tumor in children and adolescents, characterized by high disability and mortality rates. Over the past three decades, therapeutic outcomes have plateaued, undersc...Authors:Yan Liao, Junkai Chen, Hao Yao, Ting Zheng, Jian Tu, Weidong Chen, ZeHao Guo, Yutong Zou, Lili Wen and Xianbiao XieCitation:Journal of Translational Medicine202523:103Content type:ResearchPublished on:22 January 2025ViewFull TextViewPDF **Single-cell profiling of SLC family transporters: uncovering the role of SLC7A1 in osteosarcoma** Osteosarcoma is the most common malignant bone tumor in children and adolescents, characterized by high disability and mortality rates. Over the past three decades, therapeutic outcomes have plateaued, undersc... ViewFull Text ViewPDF **Single-cell profiling of SLC family transporters: uncovering the role of SLC7A1 in osteosarcoma** Osteosarcoma is the most common malignant bone tumor in children and adolescents, characterized by high disability and mortality rates. Over the past three decades, therapeutic outcomes have plateaued, undersc... ViewFull Text ViewPDF Modulation of DAPK1 expression by its alternative splice variant DAPK1-215 in cancerDeath-Associated Protein Kinase 1 (DAPK1) family members are calcium/calmodulin-regulated serine/threonine kinases implicated in cell death, normal development, and human diseases. However, the regulation of D...Authors:QingShui Wang, ShuYun Weng, WenTing Zhong, YouYu Lin, Yan Yu, YiMin Huang, LiLin Ge, XiuLi Zhang, FangQin Xue, Yehuda G. Assaraf and Yao LinCitation:Journal of Translational Medicine202523:85Content type:ResearchPublished on:20 January 2025ViewFull TextViewPDF **Modulation of DAPK1 expression by its alternative splice variant DAPK1-215 in cancer** Death-Associated Protein Kinase 1 (DAPK1) family members are calcium/calmodulin-regulated serine/threonine kinases implicated in cell death, normal development, and human diseases. However, the regulation of D... ViewFull Text ViewPDF **Modulation of DAPK1 expression by its alternative splice variant DAPK1-215 in cancer** Death-Associated Protein Kinase 1 (DAPK1) family members are calcium/calmodulin-regulated serine/threonine kinases implicated in cell death, normal development, and human diseases. However, the regulation of D... ViewFull Text ViewPDF The role of laminins in cancer pathobiology: a comprehensive reviewLaminins (LMs) are a family of heterotrimeric glycoproteins that form the structural foundation of basement membranes (BM). By acting as molecular bridges between cells and the extracellular matrix (ECM) throu...Authors:Elena Nonnast, Emilia Mira and Santos MañesCitation:Journal of Translational Medicine202523:83Content type:ReviewPublished on:17 January 2025ViewFull TextViewPDF **The role of laminins in cancer pathobiology: a comprehensive review** Laminins (LMs) are a family of heterotrimeric glycoproteins that form the structural foundation of basement membranes (BM). By acting as molecular bridges between cells and the extracellular matrix (ECM) throu... ViewFull Text ViewPDF **The role of laminins in cancer pathobiology: a comprehensive review** Laminins (LMs) are a family of heterotrimeric glycoproteins that form the structural foundation of basement membranes (BM). By acting as molecular bridges between cells and the extracellular matrix (ECM) throu... ViewFull Text ViewPDF Lactate accumulation promotes immunosuppression and fibrotic transformation of bone marrow microenvironment in myelofibrosisClonal myeloproliferation and fibrotic transformation of the bone marrow (BM) are the pathogenetic events most commonly occurring in myelofibrosis (MF). There is great evidence indicating that tumor microenvir...Authors:Mariarita Spampinato, Cesarina Giallongo, Sebastiano Giallongo, Enrico La Spina, Andrea Duminuco, Lucia Longhitano, Rosario Caltabiano, Lucia Salvatorelli, Giuseppe Broggi, Elisabetta P. Pricoco, Vittorio Del Fabro, Ilaria Dulcamare, Antonio Massimo DI Mauro, Alessandra Romano, Francesco Di Raimondo, Giovanni Li Volti…Citation:Journal of Translational Medicine202523:69Content type:ResearchPublished on:14 January 2025ViewFull TextViewPDF **Lactate accumulation promotes immunosuppression and fibrotic transformation of bone marrow microenvironment in myelofibrosis** Clonal myeloproliferation and fibrotic transformation of the bone marrow (BM) are the pathogenetic events most commonly occurring in myelofibrosis (MF). There is great evidence indicating that tumor microenvir... ViewFull Text ViewPDF **Lactate accumulation promotes immunosuppression and fibrotic transformation of bone marrow microenvironment in myelofibrosis** Clonal myeloproliferation and fibrotic transformation of the bone marrow (BM) are the pathogenetic events most commonly occurring in myelofibrosis (MF). There is great evidence indicating that tumor microenvir... ViewFull Text ViewPDF High interstitial fluid pressure enhances USP1-dependent KIF11 protein stability to promote hepatocellular carcinoma progressionHCC is characterized by a high interstitial fluid pressure (HIFP) environment, which appears to support cancer cell survival. However, the mechanisms behind this phenomenon are not fully understood.Authors:Zhengyi Wu, Chao Li, Shouhua Zhang, Liang Sun, Junwen Hu, Bingbing Qiu, Shuiqiu Liu, Yiran Hong, Tianxiang Chen, Kai Wang, Xiangbao Yin and Jinlong YanCitation:Journal of Translational Medicine202523:66Content type:ResearchPublished on:14 January 2025ViewFull TextViewPDF **High interstitial fluid pressure enhances USP1-dependent KIF11 protein stability to promote hepatocellular carcinoma progression** HCC is characterized by a high interstitial fluid pressure (HIFP) environment, which appears to support cancer cell survival. However, the mechanisms behind this phenomenon are not fully understood. ViewFull Text ViewPDF **High interstitial fluid pressure enhances USP1-dependent KIF11 protein stability to promote hepatocellular carcinoma progression** HCC is characterized by a high interstitial fluid pressure (HIFP) environment, which appears to support cancer cell survival. However, the mechanisms behind this phenomenon are not fully understood. ViewFull Text ViewPDF Cancer-associated fibroblasts in carcinogenesisIn contemporary times, cancer poses the most significant threat to human life and safety. Scientists have relentlessly pursued the intricacies of carcinogenesis and explored ways to prevent and treat cancer. C...Authors:Shufen Zhou, Zekun Zhao, Zhaojun Wang, Hanzheng Xu, Yijie Li, Ke Xu, Wei Li and Jiahua YangCitation:Journal of Translational Medicine202523:50Content type:ReviewPublished on:13 January 2025ViewFull TextViewPDF **Cancer-associated fibroblasts in carcinogenesis** In contemporary times, cancer poses the most significant threat to human life and safety. Scientists have relentlessly pursued the intricacies of carcinogenesis and explored ways to prevent and treat cancer. C... ViewFull Text ViewPDF **Cancer-associated fibroblasts in carcinogenesis** In contemporary times, cancer poses the most significant threat to human life and safety. Scientists have relentlessly pursued the intricacies of carcinogenesis and explored ways to prevent and treat cancer. C... ViewFull Text ViewPDF Hypoxic BMSC-derived exosomal miR-210-3p promotes progression of triple-negative breast cancer cells via NFIX-Wnt/β-catenin signaling axisBone marrow mesenchymal stem cells (BMSCs) are a crucial component of the tumor microenvironment (TME), with hypoxic conditions promoting their migration to tumors. Exosomes play a vital role in cell-to-cell c...Authors:Meng Wang, Yi Zheng, Qian Hao, Guochao Mao, Zhijun Dai, Zhen Zhai, Shuai Lin, Baobao Liang, Huafeng Kang and Xiaobin MaCitation:Journal of Translational Medicine202523:39Content type:ResearchPublished on:9 January 2025ViewFull TextViewPDF **Hypoxic BMSC-derived exosomal miR-210-3p promotes progression of triple-negative breast cancer cells via NFIX-Wnt/β-catenin signaling axis** Bone marrow mesenchymal stem cells (BMSCs) are a crucial component of the tumor microenvironment (TME), with hypoxic conditions promoting their migration to tumors. Exosomes play a vital role in cell-to-cell c... ViewFull Text ViewPDF **Hypoxic BMSC-derived exosomal miR-210-3p promotes progression of triple-negative breast cancer cells via NFIX-Wnt/β-catenin signaling axis** Bone marrow mesenchymal stem cells (BMSCs) are a crucial component of the tumor microenvironment (TME), with hypoxic conditions promoting their migration to tumors. Exosomes play a vital role in cell-to-cell c... ViewFull Text ViewPDF CXCL14 in prostate cancer: complex interactions in the tumor microenvironment and future prospectsCXCL14 is a highly conserved chemokine expressed in various cell types, playing crucial roles in both physiological and pathological processes, including immune regulation and tumorigenesis. Recently, the role...Authors:Lei Tang, Xin Chen, Jianquan Hou and Xuedong WeiCitation:Journal of Translational Medicine202523:9Content type:ReviewPublished on:4 January 2025ViewFull TextViewPDF **CXCL14 in prostate cancer: complex interactions in the tumor microenvironment and future prospects** CXCL14 is a highly conserved chemokine expressed in various cell types, playing crucial roles in both physiological and pathological processes, including immune regulation and tumorigenesis. Recently, the role... ViewFull Text ViewPDF **CXCL14 in prostate cancer: complex interactions in the tumor microenvironment and future prospects** CXCL14 is a highly conserved chemokine expressed in various cell types, playing crucial roles in both physiological and pathological processes, including immune regulation and tumorigenesis. Recently, the role... ViewFull Text ViewPDF RBM47 promotes cell proliferation and immune evasion by upregulating PDIA6: a novel mechanism of pancreatic cancer progressionPancreatic cancer (PC) is a lethal malignancy characterized by poor prognosis and high mortality. We found the highly expressed RNA-binding motif protein 47 (RBM47) in PC progression. The RBM47 expression was ...Authors:Yihui Ma, Enjie Liu, Huijie Fan, Chenfei Li, Pei Huang, Meiying Cui, Zhengyang Wang, Jing Zhou and Kuisheng ChenCitation:Journal of Translational Medicine202422:1164Content type:ResearchPublished on:31 December 2024ViewFull TextViewPDF **RBM47 promotes cell proliferation and immune evasion by upregulating PDIA6: a novel mechanism of pancreatic cancer progression** Pancreatic cancer (PC) is a lethal malignancy characterized by poor prognosis and high mortality. We found the highly expressed RNA-binding motif protein 47 (RBM47) in PC progression. The RBM47 expression was ... ViewFull Text ViewPDF **RBM47 promotes cell proliferation and immune evasion by upregulating PDIA6: a novel mechanism of pancreatic cancer progression** Pancreatic cancer (PC) is a lethal malignancy characterized by poor prognosis and high mortality. We found the highly expressed RNA-binding motif protein 47 (RBM47) in PC progression. The RBM47 expression was ... ViewFull Text ViewPDF YY1 drives PARP1 expression essential for PARylation of NONO in mRNA maturation during neuroblastoma progressionNeuroblastoma (NB), the most prevalent solid tumor in children, arises from sympathetic nervous system and accounts for 15% of pediatric cancer mortality. This malignancy exhibits substantial genetic and clini...Authors:Chunhui Yang, Jiaying Qu, Yang Cheng, Minxiu Tian, Zhijie Wang, Xiaolin Wang, Xinyue Li, Shunchen Zhou, Bosen Zhao, Yanhua Guo, Liduan Zheng and Qiangsong TongCitation:Journal of Translational Medicine202422:1153Content type:ResearchPublished on:27 December 2024ViewFull TextViewPDF **YY1 drives PARP1 expression essential for PARylation of NONO in mRNA maturation during neuroblastoma progression** Neuroblastoma (NB), the most prevalent solid tumor in children, arises from sympathetic nervous system and accounts for 15% of pediatric cancer mortality. This malignancy exhibits substantial genetic and clini... ViewFull Text ViewPDF **YY1 drives PARP1 expression essential for PARylation of NONO in mRNA maturation during neuroblastoma progression** Neuroblastoma (NB), the most prevalent solid tumor in children, arises from sympathetic nervous system and accounts for 15% of pediatric cancer mortality. This malignancy exhibits substantial genetic and clini... ViewFull Text ViewPDF The role of MAPK pathway in gastric cancer: unveiling molecular crosstalk and therapeutic prospectsGastric cancer remains a significant health burden globally, especially prevalent in Asian and European regions. Despite a notable decline in incidence in the United States and Western Europe over recent decad...Authors:Weiwei Yuan, Yin Shi, Shiping Dai, Mao Deng, Kai Zhu, Yuanmin Xu, Zhangming Chen, Zhou Xu, Tianlong Zhang and Song LiangCitation:Journal of Translational Medicine202422:1142Content type:ReviewPublished on:24 December 2024ViewFull TextViewPDF **The role of MAPK pathway in gastric cancer: unveiling molecular crosstalk and therapeutic prospects** Gastric cancer remains a significant health burden globally, especially prevalent in Asian and European regions. Despite a notable decline in incidence in the United States and Western Europe over recent decad... ViewFull Text ViewPDF **The role of MAPK pathway in gastric cancer: unveiling molecular crosstalk and therapeutic prospects** Gastric cancer remains a significant health burden globally, especially prevalent in Asian and European regions. Despite a notable decline in incidence in the United States and Western Europe over recent decad... ViewFull Text ViewPDF C3+cancer-associated fibroblasts promote tumor growth and therapeutic resistance in gastric cancer via activation of the NF-κB signaling pathwayGastric cancer (GC) remains one of the most lethal malignancies globally, with limited therapeutic options. Cancer-associated fibroblasts (CAFs), a diverse population of stromal cells within the tumor microenv...Authors:Zhenxiong Zhao, Si Xiong, Jianpeng Gao, Yingjing Zhang, Ergang Guo and Yakai HuangCitation:Journal of Translational Medicine202422:1130Content type:ResearchPublished on:20 December 2024ViewFull TextViewPDF **C3+cancer-associated fibroblasts promote tumor growth and therapeutic resistance in gastric cancer via activation of the NF-κB signaling pathway** Gastric cancer (GC) remains one of the most lethal malignancies globally, with limited therapeutic options. Cancer-associated fibroblasts (CAFs), a diverse population of stromal cells within the tumor microenv... ViewFull Text ViewPDF **C3+cancer-associated fibroblasts promote tumor growth and therapeutic resistance in gastric cancer via activation of the NF-κB signaling pathway** Gastric cancer (GC) remains one of the most lethal malignancies globally, with limited therapeutic options. Cancer-associated fibroblasts (CAFs), a diverse population of stromal cells within the tumor microenv... ViewFull Text ViewPDF miR-122/NEGR1 axis contributes colorectal cancer liver metastasis by PI3K/AKT pathway and macrophage modulationColorectal cancer (CRC) is a prevalent malignant tumor in the gastrointestinal tract, with around 50% of patients experiencing distant metastases, predominantly to the liver. Colorectal cancer liver metastasis...Authors:Shipeng Dai, Haiwen Zhuang, Zhuozheng Li, Zhongda Chen, Yue Chai and Qing ZhouCitation:Journal of Translational Medicine202422:1060Content type:ResearchPublished on:25 November 2024ViewFull TextViewPDF **miR-122/NEGR1 axis contributes colorectal cancer liver metastasis by PI3K/AKT pathway and macrophage modulation** Colorectal cancer (CRC) is a prevalent malignant tumor in the gastrointestinal tract, with around 50% of patients experiencing distant metastases, predominantly to the liver. Colorectal cancer liver metastasis... ViewFull Text ViewPDF **miR-122/NEGR1 axis contributes colorectal cancer liver metastasis by PI3K/AKT pathway and macrophage modulation** Colorectal cancer (CRC) is a prevalent malignant tumor in the gastrointestinal tract, with around 50% of patients experiencing distant metastases, predominantly to the liver. Colorectal cancer liver metastasis... ViewFull Text ViewPDF N6-methyladenosine modification of circular RNA circASH2L suppresses growth and metastasis in hepatocellular carcinoma through regulating hsa-miR-525-3p/MTUS2 axisCircRNAs have been demonstrated to play a crucial role in regulating the growth and progression of various cancers, including hepatocellular carcinoma (HCC). Nevertheless, the circRNA's expression pattern and ...Authors:Dafeng Xu, Yachong Liu, Qiumeng Liu, Ganxun Li, Lu Zhang, Chengpeng Yu, Huifang Liang, Xiaoping Chen, Jinfang Zheng and Jia SongCitation:Journal of Translational Medicine202422:1026Content type:ResearchPublished on:14 November 2024ViewFull TextViewPDF **N6-methyladenosine modification of circular RNA circASH2L suppresses growth and metastasis in hepatocellular carcinoma through regulating hsa-miR-525-3p/MTUS2 axis** CircRNAs have been demonstrated to play a crucial role in regulating the growth and progression of various cancers, including hepatocellular carcinoma (HCC). Nevertheless, the circRNA's expression pattern and ... ViewFull Text ViewPDF **N6-methyladenosine modification of circular RNA circASH2L suppresses growth and metastasis in hepatocellular carcinoma through regulating hsa-miR-525-3p/MTUS2 axis** CircRNAs have been demonstrated to play a crucial role in regulating the growth and progression of various cancers, including hepatocellular carcinoma (HCC). Nevertheless, the circRNA's expression pattern and ... ViewFull Text ViewPDF SLC38A5 suppresses ferroptosis through glutamine-mediated activation of the PI3K/AKT/mTOR signaling in osteosarcomaSolute carrier family 38 member 5 (SLC38A5) is an amino acid transporter that plays a significant role in various cellular biological processes and may be involved in regulating the progression of tumors Howev...Authors:Xinghan Huang, Kezhou Xia, Zhun Wei, Wenda Liu, Zicheng Wei and Weichun GuoCitation:Journal of Translational Medicine202422:1004Content type:ResearchPublished on:7 November 2024ViewFull TextViewPDF **SLC38A5 suppresses ferroptosis through glutamine-mediated activation of the PI3K/AKT/mTOR signaling in osteosarcoma** Solute carrier family 38 member 5 (SLC38A5) is an amino acid transporter that plays a significant role in various cellular biological processes and may be involved in regulating the progression of tumors Howev... ViewFull Text ViewPDF **SLC38A5 suppresses ferroptosis through glutamine-mediated activation of the PI3K/AKT/mTOR signaling in osteosarcoma** Solute carrier family 38 member 5 (SLC38A5) is an amino acid transporter that plays a significant role in various cellular biological processes and may be involved in regulating the progression of tumors Howev... ViewFull Text ViewPDF Ubiquitination regulates autophagy in cancer: simple modifications, promising targetsAutophagy is an important lysosomal degradation process that digests and recycles bio-molecules, protein or lipid aggregates, organelles, and invaded pathogens. Autophagy plays crucial roles in regulation of m...Authors:Yihui Wu, Yifei Chen, Xianyan Tian, Genbao Shao, Qiong Lin and Aiqin SunCitation:Journal of Translational Medicine202422:985Content type:ReviewPublished on:31 October 2024ViewFull TextViewPDF **Ubiquitination regulates autophagy in cancer: simple modifications, promising targets** Autophagy is an important lysosomal degradation process that digests and recycles bio-molecules, protein or lipid aggregates, organelles, and invaded pathogens. Autophagy plays crucial roles in regulation of m... ViewFull Text ViewPDF **Ubiquitination regulates autophagy in cancer: simple modifications, promising targets** Autophagy is an important lysosomal degradation process that digests and recycles bio-molecules, protein or lipid aggregates, organelles, and invaded pathogens. Autophagy plays crucial roles in regulation of m... ViewFull Text ViewPDF N6-Methyladenosine methylation modification in breast cancer: current insightsBreast cancer is the most common cancer type among women. Despite advanced treatment strategies, some patients still face challenges in disease control, prompting the exploration of new therapeutic approaches.N6...Authors:Guangwen Zhang, Chen Cheng, Xinle Wang and Shiming WangCitation:Journal of Translational Medicine202422:971Content type:ReviewPublished on:28 October 2024ViewFull TextViewPDF **N6-Methyladenosine methylation modification in breast cancer: current insights** Breast cancer is the most common cancer type among women. Despite advanced treatment strategies, some patients still face challenges in disease control, prompting the exploration of new therapeutic approaches.N6... ViewFull Text ViewPDF **N6-Methyladenosine methylation modification in breast cancer: current insights** Breast cancer is the most common cancer type among women. Despite advanced treatment strategies, some patients still face challenges in disease control, prompting the exploration of new therapeutic approaches.N6... ViewFull Text ViewPDF Previouspage 1 2 3 4 Nextpage Advertisement ISSN: 1479-5876 Submission enquiries:Access here and click Contact Us General enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}