{"id": 142, "name": "Blueprint Newspaper", "domain": "blueprint.ng", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://blueprint.ng/tinubu-orders-mdas-to-pay-for-abuja-international-conference-centre-services-charges-wike-on-focus/", "title": "Tinubu Orders Mdas To Pay For Abuja International Conference Centre Services Charges Wike On Focus", "content": "Home Blueprint Corporate Profile About UsBlueprint Online TeamMission Statement Blueprint Online Team Mission Statement Blueprint Online Team Mission Statement Contact Us Online Advert Rates Privacy Policy Home Blueprint Corporate Profile About Us Contact Us Online Advert Rates Privacy Policy Blueprint Newspapers Limited Blueprint gives you the latest Nigerian news in one place. Read the news behind the news on burning National issues in Nigeria and the world, Kannywood, Videos and the Military Home Top StoriesEditor’s PicksBlueprint Newspaper Headlines TodayBreaking NewsEducationMetroArts & BooksNigerian News Editor’s Picks Blueprint Newspaper Headlines Today Breaking News Education Metro Arts & Books Nigerian News Editor’s Picks Blueprint Newspaper Headlines Today Breaking News Education Metro Arts & Books Nigerian News BusinessAgricultureICT Agriculture ICT Agriculture ICT Arts & Books Editorial OpinionColumnsLettersFeaturesInterviewReligionWomen Columns Letters Features Interview Religion Women Columns Letters Features Interview Religion Women Entertainment Health Judiciary Politics Security & Crime Sports World Stage Photo Story Video News **Tinubu orders MDAs to pay for Abuja International Conference Centre services, charges Wike on focus** President Bola Ahmed Tinubu Tuesday reopened the renovated Abuja International Conference Centre (ICC) in Abuja and directed all Ministries, Departments, and Agencies (MDAs) to pay for the use of the facility to ensure its upkeep and long-term sustainability. At the event, Federal Capital Territory Minister Nyesom Wike announced renaming the Centre, which opened in 1991, as the Bola Ahmed Tinubu International Conference Centre. Recalling his previous visit to the Centre during the 2024 ECOWAS Parliament conference, President Tinubu recounted his shock at its poor state. “When I attended the ECOWAS Parliament conference, the environment was dirty, disorganised, and uninhabitable. I turned to Mr. Wike and said, ‘This Conference Centre does not reflect who we are. Have we sunk this low?’ He replied, ‘No, bear with us. We will do whatever we can to transform the place.’ Today, I am very happy. “The International Conference Centre is part of our country’s larger vision to become a hub for regional diplomacy, continental trade discussions, global partnerships, and other thoughtful, well-outlined goals that reflect our ‘Nigeria First’ principle,” President Tinubu said. He praised Julius Berger Nigeria Plc, the original contractor for delivering a high-quality renovation, adding that the quality reflects what Julius Berger has been known for in this country for years. Under the Renewed Hope Agenda, President Tinubu further assured Nigerians of his administration’s determination to revitalise infrastructure across key sectors, including transportation, healthcare, education, energy, and urban development. He commended the minister for completing the renovation within one year of the Centre’s closure. Applauding Wike for his vision and execution, President Tinubu said: “Do not pay attention to the busybodies and bystanders. Whatever they say, continue your good work. You are a transformational leader with foresight, vision, and determination.” Also speaking at the event, Senate President Godswill Akpabio commended the FCT Administration for naming halls at the Centre after Senate President, Speaker House of Representatives, and the Chief Justice of Nigeria. He lauded the collaborative spirit between the executive, legislature, and judiciary under President Tinubu’s leadership. Wike said the FCT transformed the facility within eight months after the president’s directive. “Mr. President, this transformation would not have been possible without your leadership. Many presidents have come here, but none said this was not what Nigeria needed because they lacked your courage and vision,” he said. Wike stressed the need for financial discipline in maintaining the newly upgraded facility. “Whether you are a ministry or an agency, you must pay something to use this facility. That is the only way we can sustain it. No such thing as ‘my brother’ or ‘my sister’ wants to use it for a wedding. If you want to use a beautiful place like this, you must pay something,” he said. The Bola Ahmed Tinubu International Conference Centre is among several capital projects scheduled for commissioning by President Tinubu in the Federal Capital Territory (FCT) as part of activities marking his second anniversary in office. The FCT Administration is implementing the projects under Barrister Wike’s leadership. **Post navigation** **Trending** Abuja International Conference Centre: Tinubu hails Julius Berger’s quality work deliveryJune 11, 2025 Peter Obi, Otti reason for Labour Party crisis – FactionJune 11, 2025 2025 Anambra governorship election: Soludo, others to pay N50m on advert as campaign kicks offJune 11, 2025 Air Peace ‘extortion drive’: My story – OshiomholeJune 11, 2025 Uba Sani reads riot act to criminal gangs in KadunaJune 11, 2025 NIS: Shaibu assumes duty as DG, meets Dikko, othersJune 11, 2025 FCT coaches: NFCA chapter set to stage electionJune 11, 2025 Osayi-Samuel agrees move to Turkish Club BesiktasJune 11, 2025 CDS Democracy Day Basketball: 16 teams, academies jostle for honours in AbujaJune 11, 2025 June 12: Collaborate with progressives to deepen democracy, Afenifere tells CSOsJune 11, 2025 CUPP urges Tinubu to focus on healthcare, education, othersJune 11, 2025 8th Assembly: Enugu lawmakers pass 23 executive bills, 14 motionsJune 11, 2025 2027: Northern Yoruba group vows to give 10m votes to TinubuJune 11, 2025 June 12: UNYF urges electoral reforms for national developmentJune 11, 2025 FCCPC inaugurates joint market monitoring taskforce in 4 FCT marketsJune 11, 2025 BBNJ: Nigeria wants increased funding for blue economy initiativesJune 11, 2025 NRC affirms safety of rail tracks on Warri-Itakpe corridorJune 11, 2025 FG moves to be self-sufficient in sugar productionJune 11, 2025 TotalEnergies profit plunges 93% in Q1 2025June 11, 2025 NDIC begins payment of liquidation dividends to Premier Commercial Bank creditorsJune 11, 2025 Dangote Cement opens N100bn commercial papers for subscriptionJune 11, 2025 World Bank maintains Nigeria’s economic growth outlook at 3.6%June 11, 2025 First China bishop appointed under Pope LeoJune 11, 2025 June 12: Tinubu cancels broadcast, to address National Assembly on Democracy DayJune 11, 2025 SEC speaks on ‘CBEX resuming operation in Nigeria’June 11, 2025 Ehije Ukaki: Sheffield United sign Nigeria’s wingerJune 11, 2025 Immigration rule: Protests spread across US despite Trump threatsJune 11, 2025 Ponzi: CBEX remains banned in Nigeria, SEC warns investorsJune 11, 2025 Fire guts filling station in LagosJune 11, 2025 5-man US team in Nigeria for Lagos int’l airport evaluationJune 11, 2025 **Opinion** **Column** Blueprint Newspapersis a Nigerian daily print newspaper founded and published in Abuja,Nigeria. Whilehttps://blueprint.ngis the online version Managing Director & CEO:Salisu Umar,[email protected] Vice Chairman & CEB:Zainab Suleiman Okino,[email protected] Executive Director-Finance & Accounts:Ajibola Oyetubo Editorial Director:Clem Oluwole Associate Director-Administration & HR:Nuhu Sani Associate Director, Southern Operations:Vera Chidi Maha Associate Director, Letters, Opinions & Pages:Chamba Simeh General Manager, Business and Strategy: Aminu Ado Ibrahim Editor (Daily): Abdulrahman A. Abdulrauf,[email protected] Editor(Weekend):Adoyi M. Aba Online Editor:Ikenna Okonkwo,[email protected] Tel:+234803 348 9034, +234 806 413 5603 or +2348101737507"}