{"id": 1801, "name": "SGT Report", "domain": "sgtreport.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.sgtreport.com/2025/06/leftists-are-learning-to-their-dismay-that-being-a-judge-doesnt-mean-you-get-a-free-pass-to-break-the-law/#respond", "title": "Leftists Are Learning To Their Dismay That Being A Judge Doesnt Mean You Get A Free Pass To Break The Law", "content": "Tyranny Corruption Deep State BUY GOLD & SILVER Tyranny Corruption Deep State BUY GOLD & SILVER Big Brother Corruption Deep State News NWO Politics Tyranny **Leftists Are Learning to Their Dismay That Being a Judge Doesn’t Mean You Get a Free Pass to Break the Law** by Bob Unruh,The Liberty Daily: Prosecutors in Wisconsin have just filed an unusual document with a court: They explained that just because a person is a judge, that doesn’t mean she gets a free pass to break the law. That earlier was the stunning claim from Hannah Dugan, a now-suspended judge, arguing that prosecutors weren’t even allowed to bring a case against her after evidence showed she distracted federal agents, then let an illegal alien criminal walk out of the courthouse. Dugan’s claim was that she has absolutely immunity for whatever she does in her courtroom – even in the courthouse building. TRUTH LIVES on athttps://sgtreport.tv/ Dugan’s claim was that she has absolutely immunity for whatever she does in her courtroom – even in the courthouse building. A reportat Fox News now explains that prosecutors disagree. Federal prosecutors argued Monday that a court should reject a Wisconsin judge’s attempt to have the obstruction case against her dismissed based on judicial immunity. Milwaukee County Circuit Court Judge Hannah Dugan, 65, was arrested by the FBI on April 25 and is charged with…pic.twitter.com/dVslgVPHGa — Melissa Hallman (@dotconnectinga)June 10, 2025 Prosecutors now have responded to her claim, explaining “the Supreme Court has made clear that judges are not immune from criminal liability.” Their filing said, “In the end, Dugan asks for this Court to develop a novel doctrine of judicial immunity from criminal prosecution, and to apply it to the facts alleged in the indictment, all without reasonable basis—directly or indirectly—in the Constitution, statutes, or case law. … In her lengthy memorandum, Dugan concedes that ‘[j]udges, like legislators and executive officials, are not above the law.’ Dugan’s desired ruling would, in essence, say that judges are ‘above the law,’ and uniquely entitled to interfere with federal law enforcement.” Prosecutors have accused the Milwaukee Circuit Court judge of personally escorting Mexican illegal immigrant and domestic battery suspect Eduardo Flores-Ruiz out of the courthouse. That was after Dugan directed ICE agents to go consult with the chief judge and they left the hallway in front of the courtroom. Read More @ TheLibertyDaily.com **💥The Kickoff For The 2nd American Civil War Has Begun!!!** **Lavrov: “The British Are 100%” Behind Ukraine’s Terror Spree** **the Rioting has Just begun** **LEAVE A REPLYCancel reply** Log in to leave a comment Tyranny Corruption Deep State BUY GOLD & SILVER"}