{"id": 350, "name": "Delfi", "domain": "delfi.lt", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.delfi.lt/multimedija/aistros-apakinti-keisciausios-ldk-meiles-istorijos/kaip-rusu-cariene-is-atr-ispranasavo-baisu-romanovu-dinastijos-gala-prakeikimas-issipilde-paraidziui-120116171", "title": "Kaip Rusu Cariene Is Atr Ispranasavo Baisu Romanovu Dinastijos Gala Prakeikimas Issipilde Paraidziui 120116171", "content": "Multimedija Aistros apakinti: keisčiausios LDK meilės istorijos **Kaip rusų carienė iš ATR išpranašavo baisų Romanovų dinastijos galą: prakeikimas išsipildė paraidžiui** Labai didelė naujiena užsienietis ar užsienietė Maskvos caro soste nebuvo. Jei jau labai pedantiškai skaičiuoti valdovų genus, tai rusai buvo įpratę, kad juos valdytų kas nors iš užsienio. Štai Romanovų dinastija savo valdymo pabaigoje buvo 90 procentų vokiškos kilmės, o ir kelios kitos didžios rusų carienės buvo, atleisk Viešpatie, jeigu sąžiningai – visiškos vokietės. Na, bet tai vokiečiai. Universalūs vadovai, mechanikai ir šiaip darbštūs žmonės. Tačiau, kai į Maskvos caro sostą sėdaAbiejų Tautų Respublikosžmonės, tai jau šioks toks skandalas ir nesusipratimas. Maskvėnai neturėjo renkamų karalių tradicijos kaipATR. Tačiau kartais jų valdose įsisiautėdavo tokia anarchija, kad carai atsirasdavo tarsi pilypai iš kanapių iš labiausiai abejotinų maskvėnams vietų. Štai ir vienas mūsų valdovų Vladislovas Vaza jaunystėje buvo kviečiamas karūnuotis Maskvos caru. Bet apdairus jo tėvas, mūsų karalius Žygimantas Vaza, įvertinęs visus galimus pavojus, nesutiko išsiųsti sūnaus carauti. Bet mūsų istorijoje buvo dar šaunesnių veikėjų, kurie iš ATR pateko į Maskvos sostą. Štai viena kartą ATR didžiūnui Višniaveckiui buvo prastai paruošta vonia ir jis įsiutęs keikė savo tarną. Ūmai tarnas puolė ant kelių ir ašarodamas prisipažino. Sunku jam gerai suruošti vonią. Jis ne tarnas. Jis esąs iš tikrųjų Maskvos caro Ivano Rūsčiojo sūnus Dmitrijus. Žygimantas Augustas Abiejų Tautų Respublika ATR Regimantas Dima Reklama Kontaktai Prenumerata Naudojimosi taisyklės Karjera Atšaukti savo sutikimą Privatumo politika © 2025 UAB DELFI info@delfi.lt"}