{"id": 802, "name": "KXLY - Spokane News", "domain": "kxly.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kxly.com/news/local-news/university-of-idaho-murders/", "title": "University Of Idaho Murders", "content": "About Us Meet the Team Email & Alerts Apps Jobs with KXLY Submit a News Tip Report a Typo or Error 920 News Now Radio Stations Survey Northwest Job Scout Advertise Local News Teens In Crisis Education Politics Child Care Crisis Firewatch Expo '74 Inland Northwest Housing Crisis Health #4ThePeople Elections Coverage Election Results National & World News Radar Forecast Weather Alerts Closings & Delays Coats 4 Kids High School WSU Cougars Eastern Washington University Eagles Idaho Vandals Sports Gonzaga Bulldogs Seattle Seahawks Seattle Mariners Spokane Chiefs Whitworth Pirates Washington Huskies TV Shows Contests Events Get Outside Family Pets & Animals Holidays Air 4 Adventures Miracle Monday Extreme Team Look Who's 4 Coats 4 Kids Facebook Twitter LinkedIn YouTube Instagram iOS App Android App Live stream 84° Site searchSearch Site searchSearch Site searchSearch Spokane Coeur dAlene News Weather Sports Obituaries Newsletters Watch KXLY+ **Local news coverage from KXLY+** Live updates all day, breaking news as it happens and weather every 10 minutes Resize: **WATCH: Actor Victor Wallace (Sam Carmichael) of Mamma Mia! on KXLY** **WATCH: Actor Victor Wallace (Sam Carmichael) of Mamma Mia! on KXLY** **BECU with Fantastic Fathers** **BECU with Fantastic Fathers** **AMC to have new ads** **AMC to have new ads** **University-of-idaho-murders** 33 mins ago SPOKANE, Wash. -- Here we go again! 'Mamma Mia!' is coming to Spokane as part of the Best of Broadway season.Read More'Mamma Mia!' the musical coming to Spokane this month Updated25 mins ago MOSCOW, Idaho -- Moscow will see bright orange e-scooters available to use starting Friday, June 13, 2025.Read MoreCity of Moscow lands contract for community use e-scooters Updated7 mins ago AIRWAY HEIGHTS, Wash. -- Federal funding cuts at the Department of Defense are forcing local military families out of child care at Fairchild Air Force Base.Read MoreFairchild Air Force Base axes child care for two dozen families due to federal funding cuts Updated35 mins ago SPOKANE VALLEY, Wash. -- Investigators have arrested a 13-year-old boy for an arson at JCPenney at the Spokane Valley Mall last month.Read MoreArson investigators arrest 13-year-old for fire at JCPenney Updated48 mins ago SPOKANE, Wash. -- A 19-year-old woman was arrested for multiple suspected DUI hit and run crashes that sent two people to the hospital including a pedestrian who tried…Read MoreTeen driver arrested for DUI, hit-and-run crash severely injuring two people **Most Popular** Law enforcement believes tracking team helicopter may have spotted accused killer Travis Decker hiking in Enchantments One person shot and killed in Kettle Falls Lewiston teen crushed by boulder while camping Four-day week boosts attendance and mental health in Kellogg School District Report details what went wrong in accident that killed three climbers in the Washington Cascades UpdatedJun 10, 2025 BOISE, Idaho - Prosecutors in the Bryan Kohberger capital murder case say it is time to try the case and urged the judge to request the defense team's motion to put the upcoming trial on hold. UpdatedJun 5, 2025 BOISE, Idaho - The State of Idaho won't execute any condemned inmates until at least July 2026, as the state reinstates the firing squad as an option for execution. UpdatedMay 25, 2025 The family and friends of one of the University of Idaho murder victims are honoring their loved one's memory with acts of kindness on Sunday. UpdatedJun 6, 2025 BOISE, Idaho -- Attorneys for the man accused of killing four University of Idaho students are asking a judge to delay his scheduled murder trial while apparent leaks are investigated. UpdatedMay 14, 2025 BOISE, Idaho - The man charged with killing four University of Idaho students will be in court Thursday for the last scheduled hearing before his August trial. UpdatedMay 7, 2025 BOISE, Idaho -- Family members of the man accused of killing four University of Idaho students will be allowed to be in the courtroom for the entirety of the trial beyond witness testimony. UpdatedApr 29, 2025 BOISE, Idaho -- Prosecutors who are putting Bryan Kohberger on trial for the murder of four University of Idaho students want to evaluate his mental health, but want to keep secret the tests and other information for Kohberger's privacy. UpdatedApr 29, 2025 BOISE, Idaho - As the state moves closer to putting accused quadruple killer Bryan Kohberger on trial for the murder of four University of Idaho students, the judge in the case again denied the defense team's request to take the death penalty… **Latest News** Former city councilman staging protest at Spokane ICE office 'Mamma Mia!' the musical coming to Spokane this month City of Moscow lands contract for community use e-scooters Fairchild Air Force Base axes child care for two dozen families due to federal funding cuts Arson investigators arrest 13-year-old for fire at JCPenney More News UpdatedJan 23, 2025 BOISE, Idaho -- Bryan Kohberger's team was back in court Thursday and argued against what they called 'false information' and the prosecution's use of DNA evidence. Reporter/Weekend Anchor UpdatedJan 23, 2025 BOISE, Idaho - Some of the key evidence that investigators used to arrest a man suspected of killing four University of Idaho college students will come under fire Thursday at a court hearing in Boise. News Director UpdatedJan 1, 2025 BOISE, Idaho - Attorneys for accused quadruple killer Bryan Kohberger say the prosecution is withholding information that would help prepare his defense. News Director UpdatedNov 22, 2024 BOISE, Idaho - A new ruling in the University of Idaho student murder case shows shows the new judge will likely not be patient with court filings that are cumbersome or incomplete. News Director UpdatedNov 13, 2024 MOSCOW, Idaho -- The Vandal community came together Wednesday night to remember the four University of Idaho students murdered in their off-campus home two years ago. Reporter UpdatedNov 6, 2024 BOISE, Idaho - Attorneys for accused quadruple murderer Bryan Kohberger will argue before a judge Thursday in Boise to try and remove the death penalty as a punishment if he's convicted. News Director UpdatedOct 25, 2024 BOISE, Idaho - Attorneys for the man accused of killing four University of Idaho students in 2022 want the possibility of the death penalty taken off the table, specifically citing what it believes is the ambiguous methods Idaho could use to … News Director UpdatedOct 23, 2024 BOISE, Idaho -- Bryan Kohberger's defense team hired a defense witness who worked on the OJ Simpson murder trial to participate in the University of Idaho murder trial. Digital Content Producer Dec 31, 1969 1 min to consume {{summary}} {{title}} Facebook Twitter LinkedIn YouTube Instagram Email iOS App Android App OTT Live stream Watch Now! Video Archive Advertise Email Alerts Submit a tip Contests Search News Weather Sports Obituaries Entertainment Lifestyle Features Watch KXLY+ Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}