{"id": 1873, "name": "Center of the American Experiment", "domain": "americanexperiment.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.americanexperiment.org/federal-law-enforcement-seizes-900-pounds-of-methamphetamine-from-cartel-while-local-leaders-focus-on-feelings/", "title": "Federal Law Enforcement Seizes 900 Pounds Of Methamphetamine From Cartel While Local Leaders Focus On Feelings", "content": "About NewsCultureEconomyEducationEnergy & EnvironmentGovernanceHealth CarePublic SafetySpending & TaxesTransportationUnions Culture Economy Education Energy & Environment Governance Health Care Public Safety Spending & Taxes Transportation Unions Culture Economy Education Energy & Environment Governance Health Care Public Safety Spending & Taxes Transportation Unions Reports Events PodcastVideosRadioPodcast Videos Radio Podcast Videos Radio Podcast Magazine Take Action Subscribe Donate Economy Economy Economy Economy Education Education Education Education Energy & Environment Energy & Environment Energy & Environment Energy & Environment Governance Governance Governance Governance Health Care Health Care Health Care Health Care Public Safety Public Safety Public Safety Public Safety Spending & Taxes Spending & Taxes Spending & Taxes Spending & Taxes **Federal law enforcement seizes 900 pounds of methamphetamine from cartel while local ‘leaders’ focus on feelings** Last week, investigators from a federal law enforcement task force that included local detectives from the Hennepin County Sheriff’s Office conducted high-risk search warrants at eight locations around the Twin Cities metro area. The operation was part of what has been described as an investigation into a cartel run, transnational human trafficking and drug distribution network. Despite multiple efforts by Hennepin County Sheriff Dawanna Witt and others to get accurate information out as to the nature of the investigation, anti-ICE activists descended upon the scene of one of the search warrants on Lake Street in Minneapolis and violently interfered with investigators trying to do their jobs. One of the reasons the anti-ICE activists became so emboldened was theinaccurate messagescoming from people in political leadership positions who stoked the flames of those who believed, or wanted to believe, the operation was some type of ICE raid for illegal aliens. Those leaders quickly trotted out, and have stubbornly stuck to the narrative that ICE is evil and the ICE mission of enforcing our nation’s immigration laws is “harmful.” Leaders, including Governor Tim Walz, Attorney General Keith Ellison, Hennepin County Board Chair Irene Fernando, Hennepin County Attorney Mary Moriarty, Minneapolis City Council members Jeremiah Ellison (the Attorney General’s son) and Jason Chavez have made statements during and/or after the operation that each of them should know were wrong to make — calling it chaotic, militaristic, harmful, dangerous, and designed to “illicit fear,” etc. They have allowed themselves to be painted into a corner by activists on the issue of immigration enforcement, and as such, we should expect continued erroneous, ill-timed, and harmful messages coming from these leaders. What we should also expect is that not a single one is likely to show true leadership and walk back their statements or offer an apology — even in light of the most recent information. Late yesterday,reportsbegan surfacing that the eight search warrants executed last week came in response to the seizures of 900 pounds of methamphetamine in a Burnsville storage locker. Authorities valued the seizure at $25 million dollars. This seizure easily ranks among the biggest seizures of controlled substances in state history. By comparison, I took part in an investigation of Mexican methamphetamine trafficking in Minneapolis in the early 1990s. We intercepted the “load car” and recovered 7 pounds of methamphetamine secreted in the car’s roof panels. At the time, the seizure was one of the biggest ever in the state, and was a major case prosecuted by the U.S. Attorney’s Office in federal court. The 900 pounds seized recently is mind-boggling and speaks to just how entrenched we have allowed cartel operations to get in our state. The eight search warrants that authorities executed last week were conducted at businesses and homes in Minneapolis, Bloomington, Inver Grove Heights, Burnsville, Lakeville and Northfield. “Relevant evidence” was seized at each location, including gold-plated guns and portraits of fictional character Tony Montana from “Scarface.” Why is this important? Because it speaks to the scale of the operation and the resources available to the cartel under investigation. Those who can’t understand just how dangerous such investigations can be, need to step aside. Their inability to grasp the threat that such a cartel organization represents to officers and agents involved in these investigations makes their work even more dangerous. One only needs to search forreportsof the many cartel shootouts with Mexican authorities to grasp that this is a whole different level of threat — one that mandates a strong show of force to prevent the same level of violence from occurring in Minneapolis. For any of the “leaders,” who have gone out of their way to criticize the federal law enforcement authorities by suggesting that last week’s operation was “too militarized” or “tone deaf” as Minneapolis Police Chief O’Hara stated, it represents examples of poor leadership, and requires a retraction and an apology. Apparently, the agents, knowing what they were potentially up against, were supposed to call ahead to multiple Minneapolis authorities, the very authorities who have demonized these agents, and then arrive in two unmarked Ford Taurus’s with four agents dressed in sport coats, so as not to trigger the “community?” This is the insanity our law enforcement is up against in 2025 — sadly, some of it self-imposed. Nowhere does this insanity shine more intensely than in the statement issued by Hennepin County Attorney Mary Moriarty following last week’s search warrants. Despite being told of the nature of the operation, Moriarty put out anofficial statementcritical of the action, focusing not on the public safety benefit of investigating human trafficking and drug distribution, but rather on the fact the ICE agents were part of the operation. Moriarty stated, in part,“My singular focus is on the safety of the people who live here, and I want to be very clear that ICE showing up in the heart of one of our vibrant immigrant communities alongside local law enforcement causes grievous and irreparable harm.” Now that it is known that these same agents removed nearly a half ton of deadly methamphetamine from our metropolitan area, does anyone believe Mary Moriarty, or any of the other leaders, will show the sense to acknowledge the error in their statements, and apologize for making them? Don’t bet on it. Maybe the newpublic relations firmMoriarty hired to combat misinformation (at a cost of $150,000 to the county) will help her see the forest for the trees. I wouldn’t bet on that either. When the chief prosecutor in the most populated county in the state has alienated herself to the point that law enforcement no longer trusts her with information, or to appropriately prosecute legitimate offenders, that is a big problem — one that serves not only Hennepin County residents poorly, but all Minnesotans poorly. **David Zimmer** David Zimmer is a Public Safety Policy Fellow at Center of the American Experiment.[email protected] **Related Content** **Feds charge 2 in high school grad shootings, plural** The U.S. Attorney announced machine gun possession charges against two men in connection with the shootings at Mariucci Arena in Minneapolis last month outside of the Wayzata High School graduation… **Feds charge 2 in high school grad shootings, plural** The U.S. Attorney announced machine gun possession charges against two men in connection with the shootings at Mariucci Arena in Minneapolis last month outside of the Wayzata High School graduation… **Shots fired at Burnsville graduation, no injuries** Another suburban high school graduation, another incident involving guns. Late last month, it was the Wayzata High School ceremony, held at the University of Minnesota’s Mariucci hockey arena. This weekend,… **Shots fired at Burnsville graduation, no injuries** Another suburban high school graduation, another incident involving guns. Late last month, it was the Wayzata High School ceremony, held at the University of Minnesota’s Mariucci hockey arena. This weekend,… **Violence interrupters indicted on gun charges** Ironies abound. The acting U.S. Attorney, Joseph Thompson, announced yesterday that two men were indicted on gun charges who had been employed by a Minneapolis-based violence interruption nonprofit called 21… **Violence interrupters indicted on gun charges** Ironies abound. The acting U.S. Attorney, Joseph Thompson, announced yesterday that two men were indicted on gun charges who had been employed by a Minneapolis-based violence interruption nonprofit called 21… **Derrick Thompson: guilty on all 15 counts** After two days of deliberations, a jury in Minneapolis found Derrick John Thompson guilty on all counts. Thompson, now age 29, was charged with 15 felonies, including 3rd-degree murder, from… **Derrick Thompson: guilty on all 15 counts** After two days of deliberations, a jury in Minneapolis found Derrick John Thompson guilty on all counts. Thompson, now age 29, was charged with 15 felonies, including 3rd-degree murder, from… **Now trending** **Minnesota loses residents of all age groups and incomes over $25,000 annually to other parts of the country** Net domestic migration — whether more people are moving to Minnesota from other parts of the United States than are moving from it to other parts of the United States… **Minnesota loses residents of all age groups and incomes over $25,000 annually to other parts of the country** Net domestic migration — whether more people are moving to Minnesota from other parts of the United States than are moving from it to other parts of the United States… **Feeding Our Future fugitive nabbed** It’s a tale as old as time itself: a last-minute ticket purchased to Dubai, another airport arrest. Lou Raguse of KARE-11 TV reported on the 6 p.m. news this evening… **Feeding Our Future fugitive nabbed** It’s a tale as old as time itself: a last-minute ticket purchased to Dubai, another airport arrest. Lou Raguse of KARE-11 TV reported on the 6 p.m. news this evening… **Feeding Our Future: a New Vision rises** Media reports indicate that another nonprofit was searched by the FBI yesterday in connection with the sprawling Feeding Our Future scandal. Please note that no person or company named below… **Feeding Our Future: a New Vision rises** Media reports indicate that another nonprofit was searched by the FBI yesterday in connection with the sprawling Feeding Our Future scandal. Please note that no person or company named below… **DHS removes its list of sanctuary jurisdictions** Last week the Department of Homeland Security (DHS) issued a press release entitled “DHS Exposes Sanctuary Jurisdictions Defying Federal Immigration Law.” As Center of the American Experiment reported here, the… **DHS removes its list of sanctuary jurisdictions** Last week the Department of Homeland Security (DHS) issued a press release entitled “DHS Exposes Sanctuary Jurisdictions Defying Federal Immigration Law.” As Center of the American Experiment reported here, the… **Minnesota sanctuaries put on notice** Today, the U.S. Dept. of Homeland Security (DHS) published: a comprehensive list of sanctuary jurisdictions including cities, counties, and states that are deliberately obstructing the enforcement of federal immigration laws… **Minnesota sanctuaries put on notice** Today, the U.S. Dept. of Homeland Security (DHS) published: a comprehensive list of sanctuary jurisdictions including cities, counties, and states that are deliberately obstructing the enforcement of federal immigration laws… **Links** About Issues Multimedia Magazine Events Get Involved Contact Donate **Newsletter** **Social** This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}