{"id": 859, "name": "Lowell Sun", "domain": "lowellsun.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lowellsun.com/2025/06/10/local-towns-give-mixed-reaction-to-court-ruling-mbta-communities-law-is-not-an-unfunded-mandate/", "title": "Local Towns Give Mixed Reaction To Court Ruling Mbta Communities Law Is Not An Unfunded Mandate", "content": "E-Edition E-Edition NewsNewsThe Sun Santa FundLocal NewsCrime and Public SafetyPoliticsEducationHealthBusinessBest ReviewsCar SmartContact UsPurchase PhotosWorld News News The Sun Santa Fund Local News Crime and Public Safety Politics Education Health Business Best Reviews Car Smart Contact Us Purchase Photos World News News The Sun Santa Fund Local News Crime and Public Safety Politics Education Health Business Best Reviews Car Smart Contact Us Purchase Photos World News SportsSportsHigh School SportsCollegeBoxing/MMABoston Red SoxNew England PatriotsBoston CelticsBoston BruinsGolfFishing Sports High School Sports College Boxing/MMA Boston Red Sox New England Patriots Boston Celtics Boston Bruins Golf Fishing Sports High School Sports College Boxing/MMA Boston Red Sox New England Patriots Boston Celtics Boston Bruins Golf Fishing EntertainmentEntertainmentComicsPuzzlesLotteryEventsFun and GamesSpecial SectionsContests & Promotions Entertainment Comics Puzzles Lottery Events Fun and Games Special Sections Contests & Promotions Entertainment Comics Puzzles Lottery Events Fun and Games Special Sections Contests & Promotions LifestyleLifestyleMy SunWeekenderDream RetrieverAsk the PsychicThe Z ListDaley Decor Lifestyle My Sun Weekender Dream Retriever Ask the Psychic The Z List Daley Decor Lifestyle My Sun Weekender Dream Retriever Ask the Psychic The Z List Daley Decor ObituariesObituariesNews ObituariesPlace an ObituaryMemoriams Obituaries News Obituaries Place an Obituary Memoriams Obituaries News Obituaries Place an Obituary Memoriams OpinionOpinionEditorialsLettersThe ColumnSend Letter to the Editor Opinion Editorials Letters The Column Send Letter to the Editor Opinion Editorials Letters The Column Send Letter to the Editor Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log in Sign up for email newsletters Subscribe Log in E-Edition E-Edition Local Crime Politics Education Business Car Smart Contact Us Purchase Photos Sun Santa Fund **Local towns give mixed reaction to court ruling MBTA Communities Law is not an unfunded mandate** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Voters at Wilmington's special Town Meeting May 3, 2025 hold up their voting cards for the town's MBTA Communities zoning article, which was once again rejected 152 in favor, 165 against. (Peter Currier/Lowell Sun) Part of the huge crowd that showed up for the June 2, 2025 Dracut Town Meeting waits in a hallway at Dracut High School. Town Meeting started almost an hour and a half late due to the large turnout. (Courtesy Chris Tierney) Tewksbury Select Board member Mark Kratman advocated against the MBTA Communities zoning overlay article during the May 8, 2024 annual Town Meeting in the Tewksbury Memorial High School gymnasium. The article was rejected by the voters in a 565-142 vote. (Peter Currier/Lowell Sun) Officials in Greater Lowell towns still resisting the requirements of the MBTA Communities Law gave mixed reactions to last week’s decision by Plymouth Superior Court Justice Mark Gildea against nine towns that had claimed the law to be an unfunded mandate. “At this point, we are mostly still digesting it … That decision was a fairly strong indication the court is not going to entertain claims of an unfunded mandate,” Wilmington Town Manager Eric Slagle said Tuesday. On Friday,Gildea ruled againstthe argument that the law is an unfunded mandate as contended in lawsuits by the towns of Duxbury, Hanson, Holden, Marshfield, Middleton, Wenham, Weston, and Wrentham, and in a taxpayer suit brought by Hamilton residents. Gildea’s ruling followed anearlier decisionby the Massachusetts Supreme Judicial Court that the law is constitutional, thus nullifying claims to the contrary by the town of Milton, which is now trying to negotiate an agreement with the state before its upcoming Town Meeting. The MBTA Communities Law — Chapter 40A Section 3A of Massachusetts General Laws, and often referred to simply as 3A — requires 177 communities in Eastern Massachusetts to create zones allowing multifamily housing by right. Most communities are in compliance. In this area, only Dracut, Tewksbury and Wilmington are not. The town of Wilmington had filed a similar lawsuit June 3, but Slagle said Tuesday that at the time they did not know a decision for the other towns was going to come so soon. Wilmington had requested a court hearing in its case for Wednesday, but in the wake of Gildea’s decision, Slagle said the town has sought to postpone that hearing while the Select Board schedules an executive session with the town’s legal counsel to consider the next steps. Wilmington hadrejectedthe proposed MBTA Communities zonseleing for the town during Town Meeting this spring, as well aslast winter. In Tewksbury, where the zoning wasrejected last yearand wasremoved from considerationin Town Meeting this year, Select Board Chair Mark Kratman said Tuesday the town had been waiting to see how the lawsuits from other towns played out. “There were so many lawsuits filed, we figured we would just be another one in the cog,” said Kratman. Rather than a lawsuit of its own, Kratman said Tewksbury is waiting for a determination from State Auditor Diana DiZoglio that the law is anunfunded mandate. In February DiZoglio had sent a letter to the town of Wrentham, one of the nine towns whose lawsuit was just dismissed, making such a determination. “This decision is not deterring anybody in this town,” said Kratman, referring to Gildea’s ruling. Kratman said he had felt it was unlikely for the courts to side with the towns over the state, but said perhaps things could change if the whole issue somehow made it to federal court. For Dracut, the Friday ruling was the second devastating blow in a week for the town’s prospects for winning any fight with the state over the MBTA Communities Law. The first occurred just a few days earlier when Town Meetingrefused to rescindthevote it took last Novemberagainst the bill. The consequences of the Town Meeting vote are likely to add to the critical budget problems the town already has. Town leaders and opponents of the law seem agreed that events last week were not good for the town. At Town Meeting, voters essentially chose to break the law by not reconsidering their vote last November. The voters followed up the vote against reconsideration with a vote not to refer the issue back to the Board of Selectmen, despite the advice of legal counsel that the state would see this as a “negative action.” In a statement to The Sun regarding Dracut’s actions, Board of Selectmen Chair Josh Taylor warned, “Voting has consequences. The position Dracut residents took at Town Meeting is well within their rights. They spoke loud and clear that they did not want to move towards compliance with the MBTA 3A law. “ Taylor said, “The motion was made to refer to the selectmen for further action. On two occasions, I spoke at the podium, asking voters to support sending the article to the selectmen, stating I could create an ad hoc committee to look at all options, including filing suit for this unfunded mandate. The legislative body of the town chose to deny that request.” Taylor expressed concern that the vote on the MBTA law and a vote on another article could have dire financial consequences for the town. Failing to comply with the MBTA law will disqualify the town for state grants that could total more than $3 million, according to some estimates. In Article 14, voters approved the purchase of 41 acres on Methuen Road for $750,000 for open space purposes, thus removing that land from the tax rolls in perpetuity. “That area will now never contribute to the tax base,” Taylor said. With action on the MBTA law currently at a standstill, Taylor said, “As of now, I need to shift my focus to what I feel is best for the community.” Without passing a Proposition 2½ override for fiscal 2027, Taylor said, “we will be facing massive cuts to every department at a time when citizens need it most and wish to have stronger schools and services. We simply can’t have it both ways without looking into other funding sources.” Selectman Tony Archinski recalled his comments at the November Town Meeting: “Dracut needs to comply with the law until a court ruling determines otherwise or face possible grant funding cuts and eligibility.” Those remarks, he said, “are as true now as they were then.” Archinski continued, “Simply stated, ‘Milton’ (the case brought by that town) determined that 3A was a valid law and must be complied with, and the ‘Wenham’ case (dismissed last week in Plymouth County) determined that 3A does not constitute an Unfunded Mandate, despite the Massachusetts Auditor’s recent conclusion to the contrary.” He added, “The ‘No means No’ group has successfully convinced a lot of people that if you squeeze your eyes closed really tight, the elephant in the room will go away. I wish that were true, but right now the score is State 2, Opponents 0.” MBTA law opponent Liz Foster, who has attended many meetings of the Dracut Board of Selectmen in recent months to urge opposition, called the court decision “disappointing.” She said the court “has wrongly determined that zoning will not lead to construction. We are seeing this to be true in community after community that have complied with 3A. In the case of Dracut, this will have a devastating impact on our schools, infrastructure, and public safety in a very short time.” Foster asked, “If they don’t anticipate development, then why impose such heavy-handed tactics to impose this? I look forward to learning what the next steps will be for towns that want to challenge the unfunded mandate and the state’s overreach in overriding the will of local residents in towns across the commonwealth regarding 3A.” **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Public health nurses cut from Lowell’s budgetPublic health nurses cut from Lowell's budget **Public health nurses cut from Lowell’s budget** **Public health nurses cut from Lowell’s budget** Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic deathChelmsford man killed in late-night crash, nearly 2 decades after son's tragic death **Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic death** **Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic death** Police surveillance leads to cocaine trafficking arrest in LowellPolice surveillance leads to cocaine trafficking arrest in Lowell **Police surveillance leads to cocaine trafficking arrest in Lowell** **Police surveillance leads to cocaine trafficking arrest in Lowell** City spends almost $1M to market, promote LowellCity spends almost $1M to market, promote Lowell **City spends almost $1M to market, promote Lowell** **City spends almost $1M to market, promote Lowell** CTI to open women’s shelter in LowellCTI to open women's shelter in Lowell **CTI to open women’s shelter in Lowell** **CTI to open women’s shelter in Lowell** Arrest logArrest log **Arrest log** **Arrest log** Loaded gun found during traffic stop in LowellLoaded gun found during traffic stop in Lowell **Loaded gun found during traffic stop in Lowell** **Loaded gun found during traffic stop in Lowell** Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thrillerKassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller **Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller** **Kassidy Carmichael, Westford girls upset Wellesley in 11-10 thriller** Matt Stuart gem lifts Chelmsford past Wellesley in 1-0 thrillerMatt Stuart gem lifts Chelmsford past Wellesley in 1-0 thriller **Matt Stuart gem lifts Chelmsford past Wellesley in 1-0 thriller** **Matt Stuart gem lifts Chelmsford past Wellesley in 1-0 thriller** ‘A really great group of kids’: Tyngsboro High School’s Class of 2025 graduates'A really great group of kids': Tyngsboro High School's Class of 2025 graduates **‘A really great group of kids’: Tyngsboro High School’s Class of 2025 graduates** **‘A really great group of kids’: Tyngsboro High School’s Class of 2025 graduates** **More in Local News** SUBSCRIBER ONLYMassachusetts girls flag football soars to new heights **SUBSCRIBER ONLY** **Massachusetts girls flag football soars to new heights** **SUBSCRIBER ONLY** **Massachusetts girls flag football soars to new heights** Merrimack Valley Conference honors top boys, girls tennis players **Merrimack Valley Conference honors top boys, girls tennis players** **Merrimack Valley Conference honors top boys, girls tennis players** Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic death **Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic death** **Chelmsford man killed in late-night crash, nearly 2 decades after son’s tragic death** SUBSCRIBER ONLYRourke Bridge site investigation work to begin next week **SUBSCRIBER ONLY** **Rourke Bridge site investigation work to begin next week** **SUBSCRIBER ONLY** **Rourke Bridge site investigation work to begin next week** 2025 June 10 Subscribee-EditionSign Up For NewslettersMobile Apps e-Edition Sign Up For Newsletters Mobile Apps e-Edition Sign Up For Newsletters Mobile Apps Contact UsContestsPurchase PhotosWork With UsPrivacy PolicyAccessibilitySitemap Contests Purchase Photos Work With Us Privacy Policy Accessibility Sitemap Contests Purchase Photos Work With Us Privacy Policy Accessibility Sitemap ClassifiedsToday’s Print AdsPublic NoticesLocal Guide Today’s Print Ads Public Notices Local Guide Today’s Print Ads Public Notices Local Guide MNG Network AdvertisingSpecial SectionsAdtaxi SolutionsHomesJobs Special Sections Adtaxi Solutions Homes Jobs Special Sections Adtaxi Solutions Homes Jobs Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Informatio Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}