{"id": 976, "name": "Champaign News-Gazette", "domain": "news-gazette.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.news-gazette.com/site/article_lookup_service.html", "title": "Www.news Gazette.com", "content": "Site searchSearch Site searchSearch Site searchSearch About Us Contact Us Forms Newsroom Directory Subscribe Where to Buy Local Our Communities Kathy's #Mailbag State Weather Illini Sports Prep Sports Community Colleges People's Choice Central Illinois Business Magazine Local Offers Agriculture Banking Economy Employment Entrepreneurs Restaurants Retail At Home Milestones Church Directory Family Food Gardening Health & Fitness Pets Religion Travel Calendar Art Books Film & Television Music Theater Editorials Columns Guest Commentary Letters to the Editor Submit a Letter Photo Galleries Podcasts Videos Submit an obit Request a reprint Obit Archive Marketplace Directory Real Estate Business Services Jobs Garage Sales Merchandise Transportation Submit a Classified Legal Announcements Login Contact Us Marketplace Local Offers Newsletters Forms Facebook Twitter LinkedIn Instagram iOS App Android App Central Illinois Radio NetworkWDWS 1400/93.9 - News/Talk/SportsWHMS 97.5 - Lite RockWKIO 105.5 - Classic RockThe Rooster 107.9- Hot CountryD102 - Adult ContemporaryWDAN 1490 - News/Talk/SportsKROCK 94.9 - Classic Rock95Q - CountryY103 - Top 40WSOY 1340/103.3 - News/Talk/SportsFox Sports 1050 - Sports WDWS 1400/93.9 - News/Talk/Sports WHMS 97.5 - Lite Rock WKIO 105.5 - Classic Rock The Rooster 107.9- Hot Country D102 - Adult Contemporary WDAN 1490 - News/Talk/Sports KROCK 94.9 - Classic Rock 95Q - Country Y103 - Top 40 WSOY 1340/103.3 - News/Talk/Sports Fox Sports 1050 - Sports WDWS 1400/93.9 - News/Talk/Sports WHMS 97.5 - Lite Rock WKIO 105.5 - Classic Rock The Rooster 107.9- Hot Country D102 - Adult Contemporary WDAN 1490 - News/Talk/Sports KROCK 94.9 - Classic Rock 95Q - Country Y103 - Top 40 WSOY 1340/103.3 - News/Talk/Sports Fox Sports 1050 - Sports 89°SunnyChampaign, IL(61820)TodayPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph..TonightPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:02 pmFull Forecast Champaign, IL(61820)TodayPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph..TonightPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:02 pm Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.. Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:02 pm Full Forecast Champaign, IL(61820)TodayPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph..TonightPartly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.Updated: June 11, 2025 @ 5:02 pm Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.. Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:02 pm Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph.. Partly to mostly cloudy. Low 64F. Winds SSW at 10 to 15 mph. Updated: June 11, 2025 @ 5:02 pm Full Forecast Site searchSearch Site searchSearch Site searchSearch HomeAbout UsContact UsFormsNewsroom DirectorySubscribeWhere to Buy About Us Contact Us Forms Newsroom Directory Subscribe Where to Buy About Us Contact Us Forms Newsroom Directory Subscribe Where to Buy NewsLocalUniversity of IllinoisCourts, Police & FirePolitics & GovernmentEducationEnvironmentHealth CareHousingHistoryKeeping WatchMilitaryParks & RecreationScience & TechnologySocial ServicesTransportationRoad ConstructionSpecial ReportsOur CommunitiesRantoulDouglas CountyFord CountyPiatt CountyVermilion CountyKathy's #MailbagStateWeather LocalUniversity of IllinoisCourts, Police & FirePolitics & GovernmentEducationEnvironmentHealth CareHousingHistoryKeeping WatchMilitaryParks & RecreationScience & TechnologySocial ServicesTransportationRoad ConstructionSpecial Reports University of Illinois Courts, Police & Fire Politics & Government Education Environment Health Care Housing History Keeping Watch Military Parks & Recreation Science & Technology Social Services Transportation Road Construction Special Reports Our CommunitiesRantoulDouglas CountyFord CountyPiatt CountyVermilion County Rantoul Douglas County Ford County Piatt County Vermilion County Kathy's #Mailbag State Weather LocalUniversity of IllinoisCourts, Police & FirePolitics & GovernmentEducationEnvironmentHealth CareHousingHistoryKeeping WatchMilitaryParks & RecreationScience & TechnologySocial ServicesTransportationRoad ConstructionSpecial Reports University of Illinois Courts, Police & Fire Politics & Government Education Environment Health Care Housing History Keeping Watch Military Parks & Recreation Science & Technology Social Services Transportation Road Construction Special Reports University of Illinois Courts, Police & Fire Politics & Government Education Environment Health Care Housing History Keeping Watch Military Parks & Recreation Science & Technology Social Services Transportation Road Construction Special Reports Our CommunitiesRantoulDouglas CountyFord CountyPiatt CountyVermilion County Rantoul Douglas County Ford County Piatt County Vermilion County Rantoul Douglas County Ford County Piatt County Vermilion County Kathy's #Mailbag State Weather Election 2025 SportsIllini SportsFootballMen's BasketballWomen's BasketballVolleyballRecruitingBaseballCross-CountryGolfGymnasticsSoccerSoftballSwimming & DIvingTennisTrack & FieldWrestlingPrep SportsFootballBoys' BasketballGirls' BasketballBaseballSoftballBoys' GolfGirls' GolfBoys' SoccerGirls' SoccerCross-CountrySwimming and DivingTennisTrack and FieldVolleyballWrestlingAthletes of the WeekTeam of the WeekFeaturesHighlightsOtherCommunity Colleges Illini SportsFootballMen's BasketballWomen's BasketballVolleyballRecruitingBaseballCross-CountryGolfGymnasticsSoccerSoftballSwimming & DIvingTennisTrack & FieldWrestling Football Men's Basketball Women's Basketball Volleyball Recruiting Baseball Cross-Country Golf Gymnastics Soccer Softball Swimming & DIving Tennis Track & Field Wrestling Prep SportsFootballBoys' BasketballGirls' BasketballBaseballSoftballBoys' GolfGirls' GolfBoys' SoccerGirls' SoccerCross-CountrySwimming and DivingTennisTrack and FieldVolleyballWrestlingAthletes of the WeekTeam of the WeekFeaturesHighlightsOther Football Boys' Basketball Girls' Basketball Baseball Softball Boys' Golf Girls' Golf Boys' Soccer Girls' Soccer Cross-Country Swimming and Diving Tennis Track and Field Volleyball Wrestling Athletes of the Week Team of the Week Features Highlights Other Community Colleges Illini SportsFootballMen's BasketballWomen's BasketballVolleyballRecruitingBaseballCross-CountryGolfGymnasticsSoccerSoftballSwimming & DIvingTennisTrack & FieldWrestling Football Men's Basketball Women's Basketball Volleyball Recruiting Baseball Cross-Country Golf Gymnastics Soccer Softball Swimming & DIving Tennis Track & Field Wrestling Football Men's Basketball Women's Basketball Volleyball Recruiting Baseball Cross-Country Golf Gymnastics Soccer Softball Swimming & DIving Tennis Track & Field Wrestling Prep SportsFootballBoys' BasketballGirls' BasketballBaseballSoftballBoys' GolfGirls' GolfBoys' SoccerGirls' SoccerCross-CountrySwimming and DivingTennisTrack and FieldVolleyballWrestlingAthletes of the WeekTeam of the WeekFeaturesHighlightsOther Football Boys' Basketball Girls' Basketball Baseball Softball Boys' Golf Girls' Golf Boys' Soccer Girls' Soccer Cross-Country Swimming and Diving Tennis Track and Field Volleyball Wrestling Athletes of the Week Team of the Week Features Highlights Other Football Boys' Basketball Girls' Basketball Baseball Softball Boys' Golf Girls' Golf Boys' Soccer Girls' Soccer Cross-Country Swimming and Diving Tennis Track and Field Volleyball Wrestling Athletes of the Week Team of the Week Features Highlights Other Community Colleges BusinessPeople's ChoiceCentral Illinois Business MagazineLocal OffersAgricultureBankingEconomyEmploymentEntrepreneursRestaurantsRetail People's Choice Central Illinois Business Magazine Local Offers Agriculture Banking Economy Employment Entrepreneurs Restaurants Retail People's Choice Central Illinois Business Magazine Local Offers Agriculture Banking Economy Employment Entrepreneurs Restaurants Retail LivingAt HomeMilestonesChurch DirectoryFamilyFoodGardeningHealth & FitnessPetsReligionTravel At Home Milestones Church Directory Family Food Gardening Health & Fitness Pets Religion Travel At Home Milestones Church Directory Family Food Gardening Health & Fitness Pets Religion Travel A&ECalendarPromote Your EventArtBooksFilm & TelevisionMusicTheater CalendarPromote Your Event Promote Your Event Art Books Film & Television Music Theater CalendarPromote Your Event Promote Your Event Promote Your Event Art Books Film & Television Music Theater OpinionEditorialsColumnsGuest CommentaryLetters to the EditorSubmit a Letter Editorials Columns Guest Commentary Letters to the Editor Submit a Letter Editorials Columns Guest Commentary Letters to the Editor Submit a Letter MultimediaPhoto GalleriesPodcastsInside Illini BasketballInside Illini FootballExtra PrepPenny for Your ThoughtsLocalsYouth BaseballVideos Photo Galleries PodcastsInside Illini BasketballInside Illini FootballExtra PrepPenny for Your ThoughtsLocalsYouth Baseball Inside Illini Basketball Inside Illini Football Extra Prep Penny for Your Thoughts Locals Youth Baseball Videos Photo Galleries PodcastsInside Illini BasketballInside Illini FootballExtra PrepPenny for Your ThoughtsLocalsYouth Baseball Inside Illini Basketball Inside Illini Football Extra Prep Penny for Your Thoughts Locals Youth Baseball Inside Illini Basketball Inside Illini Football Extra Prep Penny for Your Thoughts Locals Youth Baseball Videos ObitsSubmit an obitRequest a reprintObit Archive Submit an obit Request a reprint Obit Archive Submit an obit Request a reprint Obit Archive ClassifiedsMarketplace DirectoryReal EstateBusiness ServicesJobsGarage SalesMerchandiseTransportationSubmit a ClassifiedLegal Announcements Marketplace Directory Real Estate Business Services Jobs Garage Sales Merchandise Transportation Submit a Classified Legal Announcements Marketplace Directory Real Estate Business Services Jobs Garage Sales Merchandise Transportation Submit a Classified Legal Announcements Jobs Games **Article Lookup Service** In 2020, after the completion of the sale of The News-Gazette to Champaign Multimedia Group, its archives were donated to the Champaign County Historical Archives at the Urbana Free Library. Staff there are in the process of digitizing the collection. They can also search the collection and pull files for viewing. The library hasa website dedicated to the collection at https://urbanafreelibrary.org/local-history/collections/news-gazette-archives. The News-Gazette does maintain a limited digital database dating to 1995. Because of limited time and staff, results may take extra time. Please be patient. COPY/SENDING FEES:These fees cover the cost of copying and sending the articles from your search. You may choose what you want copies of and how you want it sent. For questions, e-mail us atlibrary@news-gazette.com Home News Sports Illini Sports Business Arts & Entertainment Local Events Announcements Obituaries Opinion Multimedia Subscription Services & FAQs Self-Service Subscription System Info Change of Address Delivery Issues Pay Bill Vacation Stop/Restart Advertise with Us Classifieds Employee Directory Forms Library Lookup Service Marketplace Directory Promote Your Event Search Website Search Archives Submit a Classified Weather Where to Buy Facebook Twitter LinkedIn Instagram iOS App Android App Illinois Hancock Journal-Pilot Iroquois Times-Republic Journal-Republican The News-Gazette Indiana Fountain Co. Neighbor Herald Journal KV Post News Newton Co. Enterprise Rensselaer Republican Review-Republican Iowa Atlantic News Telegraph Audubon Advocate-Journal Barr's Post Card News Burlington Hawk Eye Collector's Journal Fayette County Union Ft. Madison Daily Democrat Independence Bulletin-Journal Keokuk Daily Gate City Oelwein Daily Register Vinton Newspapers Waverly Newspapers Michigan Iosco County News-Herald Ludington Daily News Oceana's Herald-Journal Oscoda Press White Lake Beacon New York Finger Lakes Times Olean Times Herald Salamanca Press Pennsylvania Bradford Era Clearfield Progress Courier Express Free Press Courier Jeffersonian Democrat Leader Vindicator Potter Leader-Enterprise The Wellsboro Gazette Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}