{"id": 2190, "name": "WVNN - 92.5 FM - Huntsville", "domain": "wvnn.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.wvnn.com/the-daily-controversy-with-christopher-reid-mon-fri-8pm-10pm/", "title": "The Daily Controversy With Christopher Reid Mon Fri 8pm 10pm", "content": "ShowsRED EYE RADIO – M-F – 12AM-5AMDALE JACKSON – M-F – 5AM-9AMDALE JACKSON’S WEBSITETHE YAFFEE PROGRAM – M-F – 9AM-11AMTHE VINCE SHOW – M-F – 11AM-2PMRIGHTSIDE RADIO – M-F – 2PM-5PMMARK LEVIN – M-F – 5PM-8PMTHE DAILY CONTROVERSY WITH CHRISTOPHER REID – MON-FRI – 8PM-10PMRICH VALDÉS AMERICA AT NIGHT – M-F – 10PM-12PMTHE VALLEY LABOR REPORT – SAT – 9:30-11 AMPOLITICS AND MOORE – SAT – 11AM-12PMFULL PROGRAMMING SCHEDULE RED EYE RADIO – M-F – 12AM-5AM DALE JACKSON – M-F – 5AM-9AMDALE JACKSON’S WEBSITE DALE JACKSON’S WEBSITE THE YAFFEE PROGRAM – M-F – 9AM-11AM THE VINCE SHOW – M-F – 11AM-2PM RIGHTSIDE RADIO – M-F – 2PM-5PM MARK LEVIN – M-F – 5PM-8PM THE DAILY CONTROVERSY WITH CHRISTOPHER REID – MON-FRI – 8PM-10PM RICH VALDÉS AMERICA AT NIGHT – M-F – 10PM-12PM THE VALLEY LABOR REPORT – SAT – 9:30-11 AM POLITICS AND MOORE – SAT – 11AM-12PM FULL PROGRAMMING SCHEDULE RED EYE RADIO – M-F – 12AM-5AM DALE JACKSON – M-F – 5AM-9AMDALE JACKSON’S WEBSITE DALE JACKSON’S WEBSITE DALE JACKSON’S WEBSITE THE YAFFEE PROGRAM – M-F – 9AM-11AM THE VINCE SHOW – M-F – 11AM-2PM RIGHTSIDE RADIO – M-F – 2PM-5PM MARK LEVIN – M-F – 5PM-8PM THE DAILY CONTROVERSY WITH CHRISTOPHER REID – MON-FRI – 8PM-10PM RICH VALDÉS AMERICA AT NIGHT – M-F – 10PM-12PM THE VALLEY LABOR REPORT – SAT – 9:30-11 AM POLITICS AND MOORE – SAT – 11AM-12PM FULL PROGRAMMING SCHEDULE PODCASTS Videos Sweet Deals CONTACT US Advertising Contests **THE DAILY CONTROVERSY WITH CHRISTOPHER REID – MON-FRI – 8PM-10PM** -mail:[email protected] Bio Christopher Reid grew up in Dothan, Alabama, and graduated from Samford University with a degree in political science. Prior to attending law school, he worked at The Heritage Foundation in Washington, D.C., as well as Republican leadership. Reid has clerked for the attorney general, been a policy advisor to the governor, and worked for the Alabama Policy Institute under the leadership of now-U.S. Representative Gary Palmer. Reid spent 11 years as a general practice attorney before retiring and pursuing a career in media. He has co-hosted many radio shows throughout the years. He has also appeared on Newsmax and been published by The Hill, Washington Examiner, Yellowhammer News and more. **Headlines** **Free Apps** Privacy Policy Terms of Service General Contest Rules Station Information Advertise With Us WVNN-FM FCC Public File WVNN-AM FCC Public File EEO Report Employment Opportunities Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}