{"id": 303, "name": "Cullman Times", "domain": "cullmantimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cullmantimes.com/2025/05/27/with-no-liability-insurance-for-department-hanceville-city-council-to-liquidate-hpd-assets-insurance-company-may-reconsider-coverage-in-july-2026/", "title": "With No Liability Insurance For Department Hanceville City Council To Liquidate Hpd Assets Insurance Company May Reconsider Coverage In July 2026", "content": "Home Subscriptions Newsletter signup E-edition News Obituaries Opinion Sports Classifieds Public Notices ServicesContact UsAbout Us Contact Us About Us Contact Us About Us Home News Sports Obituaries Opinion Classifieds Best of the Best 2025 Public Notices E-Edition **With no liability insurance for department, Hanceville City Council to liquidate HPD assets; Insurance company may reconsider coverage in July 2026** Published 2:48 pm Tuesday, May 27, 2025 ByPatrick Camp HANCEVILLE — With the city of Hanceville’s insurance provider no longer offering liability insurance for the police department, the council has decided to liquidate all HPD assets, including the now unused fleet of vehicles. Although, the provider recently informed the council the HPD’s liability coverage could be restored with caveats, that decision would not be considered until the next policy renewal date in July 2026. Proceeds from the sales will be added to the city’s general fund. The announcement came during the Thursday, May 22 council meeting when an update was provided regarding a search for a new police chief. The city has been in the process of overhauling its policy manual to create, what officials hope will be, a more transparent and publicly accountable police department. Councilmember John Stam said he asked the insurance agent if the provider would reconsider police coverage after a review of the updated policies, following the hiring of a new chief. He said the initial response was that the decision was final, but that during a more recent conversation, he was informed that the company would be willing to review the policies and reconsider coverage in 2026. **Email newsletter signup** Stam said the committee tasked with hiring a new police chief, was considering three individuals for the chief position, but being unable to establish the department for more than a year could cause some hesitation for the candidates. He said the committee was planning to meet with each of the applicants on June 2 to gauge their thoughts on being hired as a Public Safety Coordinator who would be tasked with overseeing policy revisions until the department could be restored. The former Hanceville Police Department was disbanded after charges against former HPD officers were announced in February. Former chief Jason Marlin was charged alongside several other officers for misconduct, primarily focused on mishandling evidence. Twelve employees, who were not charged, were placed on paid administrative leave, but were officially terminated in March. Stam — who has acted as the city’s representative on the committee — said that the city’s primary liability insurance provider had walked back a letter of non-renewal for the city. However, the company has remained steadfast in its refusal to cover any resemblance to a municipal police department. “We wouldn’t have a police department … ,” Stam said. “He or she would review what we’ve got, all of our policies and procedures, and looking at the recommendations of what the insurance company would want to see before they would agree to allow us to operate a police department. That’s where we are at. I know it’s not what a lot of us want, but it is what it is. We’ve got to have our liability insurance policy.” The council said the Cullman County Sheriff’s Office would continue patrolling the area. **You Might Like** **CCBOE announce new principals** **CCBOE announce new principals** **CCBOE announces teacher, staff member of the month for May** **CCBOE announces teacher, staff member of the month for May** **SBP announces key academic leadership roles, new ACT prep initiative** **SBP announces key academic leadership roles, new ACT prep initiative** **(Book recommendations) Packing for the beach? You’ll need a bigger bag** **(Book recommendations) Packing for the beach? You’ll need a bigger bag** News Sports Opinion Obituaries Newsletter signup e-Edition Subscriptions Classifieds Public Notices About Us Contact Us"}