{"id": 1288, "name": "De Standaard", "domain": "standaard.be", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.standaard.be/buitenland/het-leven-in-oekrane-ik-schreef-naar-mijn-man-ik-leef-nog.-ik-wacht-op-je-.-ik-heb-twee-uur-gehuild-toen-ik-hoorde-dat-hij-die-brief-kreeg/70523936.html", "title": "Het Leven In Oekrane Ik Schreef Naar Mijn Man Ik Leef Nog. Ik Wacht Op Je . Ik Heb Twee Uur Gehuild Toen Ik Hoorde Dat Hij Die Brief Kreeg", "content": "**Het leven in Oekraïne: “Ik schreef naar mijn man: ‘Ik leef nog. Ik wacht op je’. Ik heb twee uur gehuild toen ik hoorde dat hij die brief kreeg”** Samira Ataei 23:59PremiumZara leek lang onoverwinnelijk, maar ziet verkoop nu tegenvallen 23:59PremiumUltraorthodoxe partijen brengen Netanyahu aan het wankelen 23:59PremiumVruchtbaarheidsartsen uit hele wereld, behalve België, op kinderwensbeurs in Brussel 23:59PremiumHuisartsen genuanceerder over plan Vandenbroucke 23:59PremiumDe Palestijnen hebben vrede nodig, geen jihad columnPremiumU bent werkloos? Dat hebt u dan aan uzelf te wijtenDat ook oudere werklozen straf verdienen, stond al in het regeerakkoord. Pas nu, schrijft Marc Reynebeau, groeit het inzicht dat het sociaal beleid van Arizona stoelt op een moraal van schuld en boete. Dat ook oudere werklozen straf verdienen, stond al in het regeerakkoord. Pas nu, schrijft Marc Reynebeau, groeit het inzicht dat het sociaal beleid van Arizona stoelt op een moraal van schuld en boete. Dat ook oudere werklozen straf verdienen, stond al in het regeerakkoord. Pas nu, schrijft Marc Reynebeau, groeit het inzicht dat het sociaal beleid van Arizona stoelt op een moraal van schuld en boete. Dat ook oudere werklozen straf verdienen, stond al in het regeerakkoord. Pas nu, schrijft Marc Reynebeau, groeit het inzicht dat het sociaal beleid van Arizona stoelt op een moraal van schuld en boete. PremiumTrump wil duizenden mensen zonder papieren vasthouden in Guantanamo, onder wie ook BelgenDe regering-Trump wil duizenden mensen zonder geldige papieren opsluiten in Guantanamo Bay. Ook Belgen zouden in aanmerking komen voor detentie in de beruchte Amerikaanse militaire basis op Cuba. De regering-Trump wil duizenden mensen zonder geldige papieren opsluiten in Guantanamo Bay. Ook Belgen zouden in aanmerking komen voor detentie in de beruchte Amerikaanse militaire basis op Cuba. De regering-Trump wil duizenden mensen zonder geldige papieren opsluiten in Guantanamo Bay. Ook Belgen zouden in aanmerking komen voor detentie in de beruchte Amerikaanse militaire basis op Cuba. De regering-Trump wil duizenden mensen zonder geldige papieren opsluiten in Guantanamo Bay. Ook Belgen zouden in aanmerking komen voor detentie in de beruchte Amerikaanse militaire basis op Cuba. reportagePremiumOpstand in Schildestrand: “Als ze mij onteigenen, zet ik mijn caravan voor het gemeentehuis”In Schildestrand, de wijk aan het fort van ’s Gravenwezel, moeten de bungalows binnenkort wijken voor een natuur- en recreatiepark. De inwoners protesteren: “Schildestrand is een doorn in het oog van het mooie Schilde.” In Schildestrand, de wijk aan het fort van ’s Gravenwezel, moeten de bungalows binnenkort wijken voor een natuur- en recreatiepark. De inwoners protesteren: “Schildestrand is een doorn in het oog van het mooie Schilde.” In Schildestrand, de wijk aan het fort van ’s Gravenwezel, moeten de bungalows binnenkort wijken voor een natuur- en recreatiepark. De inwoners protesteren: “Schildestrand is een doorn in het oog van het mooie Schilde.” In Schildestrand, de wijk aan het fort van ’s Gravenwezel, moeten de bungalows binnenkort wijken voor een natuur- en recreatiepark. De inwoners protesteren: “Schildestrand is een doorn in het oog van het mooie Schilde.” OpiniePremiumTrump doet wat hij beloofd heeft. De wreedheid daarvan choqueert nu zelfs zijn kiezersHet beleid van Donald Trump is louter gebaseerd op haat en afkeer, schrijft Frans Verhagen. Hij kan niet geloven dat de Amerikanen hun president daarin blijven steunen. Het beleid van Donald Trump is louter gebaseerd op haat en afkeer, schrijft Frans Verhagen. Hij kan niet geloven dat de Amerikanen hun president daarin blijven steunen. Het beleid van Donald Trump is louter gebaseerd op haat en afkeer, schrijft Frans Verhagen. Hij kan niet geloven dat de Amerikanen hun president daarin blijven steunen. Het beleid van Donald Trump is louter gebaseerd op haat en afkeer, schrijft Frans Verhagen. Hij kan niet geloven dat de Amerikanen hun president daarin blijven steunen. PremiumAvondklok laat rust even weerkeren in Los Angeles, maar verzet groeit in de hele VSTerwijl het door de avondklok in Los Angeles opvallend rustig bleef, stomen demonstranten over het hele land zich klaar voor een nieuwe protestronde tegen de razzia’s van de Amerikaanse immigratiedienst. De komst van marines in L.A. doet het verzet niet afnemen, integendeel. Terwijl het door de avondklok in Los Angeles opvallend rustig bleef, stomen demonstranten over het hele land zich klaar voor een nieuwe protestronde tegen de razzia’s van de Amerikaanse immigratiedienst. De komst van marines in L.A. doet het verzet niet afnemen, integendeel. Terwijl het door de avondklok in Los Angeles opvallend rustig bleef, stomen demonstranten over het hele land zich klaar voor een nieuwe protestronde tegen de razzia’s van de Amerikaanse immigratiedienst. De komst van marines in L.A. doet het verzet niet afnemen, integendeel. Terwijl het door de avondklok in Los Angeles opvallend rustig bleef, stomen demonstranten over het hele land zich klaar voor een nieuwe protestronde tegen de razzia’s van de Amerikaanse immigratiedienst. De komst van marines in L.A. doet het verzet niet afnemen, integendeel. **PremiumVan Valeri Gergiëv tot Anna Netrebko: zijn gecancelde Russische muzikanten weer welkom in Europa?** Na de Russische inval in Oekraïne regende het in de westerse concerthuizen afzeggingen en annulaties van Russische muzikanten die zich achter Poetin schaarden. Houdt die boycot nog stand? **PremiumVan Valeri Gergiëv tot Anna Netrebko: zijn gecancelde Russische muzikanten weer welkom in Europa?** Na de Russische inval in Oekraïne regende het in de westerse concerthuizen afzeggingen en annulaties van Russische muzikanten die zich achter Poetin schaarden. Houdt die boycot nog stand? **PremiumRechtstreeks treinen van Moskou naar Pyongyang kan straks weer** Het is de langste rechtstreekse treinverbinding ter wereld, die van Moskou naar Pyongyang, en vanaf deze maand is ze weer operationeel. Dat past helemaal in de verhoogde samenwerking tussen Rusland en Noord-Korea. **PremiumRechtstreeks treinen van Moskou naar Pyongyang kan straks weer** Het is de langste rechtstreekse treinverbinding ter wereld, die van Moskou naar Pyongyang, en vanaf deze maand is ze weer operationeel. Dat past helemaal in de verhoogde samenwerking tussen Rusland en Noord-Korea. **Veel meer geld naar de Navo: compleet crazy of de logica zelve?** Navo-baas Mark Rutte stelt voor dat alle Navo-landen 5 procent van hun bbp aan hun leger of defensiegerelateerde zaken uitgeven. De beslissing daarover valt over twee weken op een Navo-top in Den Haag. Wat eerst nog “compleet crazy” was, is nu plots “onvermijdelijk” en “de logica zelve”. Maar hoe realistisch is die nieuwe norm? En zal het genoeg zijn om ons te kunnen verdedigen als de Amerikanen besluiten om zich uit Europa terug te trekken? **Veel meer geld naar de Navo: compleet crazy of de logica zelve?** Navo-baas Mark Rutte stelt voor dat alle Navo-landen 5 procent van hun bbp aan hun leger of defensiegerelateerde zaken uitgeven. De beslissing daarover valt over twee weken op een Navo-top in Den Haag. Wat eerst nog “compleet crazy” was, is nu plots “onvermijdelijk” en “de logica zelve”. Maar hoe realistisch is die nieuwe norm? En zal het genoeg zijn om ons te kunnen verdedigen als de Amerikanen besluiten om zich uit Europa terug te trekken? **Premium“Elon wil gewoon zelf president zijn”** Iedereen voorspelde het: deze bromance zou niet blijven duren. Maar dat Elon Musk het aandurft Trump zo openlijk aan te vallen, doet vragen rijzen. Wat bezielt hem om zulke risico’s te nemen? **Premium“Elon wil gewoon zelf president zijn”** Iedereen voorspelde het: deze bromance zou niet blijven duren. Maar dat Elon Musk het aandurft Trump zo openlijk aan te vallen, doet vragen rijzen. Wat bezielt hem om zulke risico’s te nemen? **PremiumNederlanders vragen om strengere asielwetten, maar heeft het land eigenlijk wel een asielprobleem?** Nu de Nederlandse regering is gevallen, wil een meerderheid van de Tweede Kamer de strenge asielwetten alsnog goedkeuren. De kiezers vragen erom, maar heeft Nederland een acuut asielprobleem? **PremiumNederlanders vragen om strengere asielwetten, maar heeft het land eigenlijk wel een asielprobleem?** Nu de Nederlandse regering is gevallen, wil een meerderheid van de Tweede Kamer de strenge asielwetten alsnog goedkeuren. De kiezers vragen erom, maar heeft Nederland een acuut asielprobleem? **PremiumIk woon in Brussel en ik kan het niet langer aanzien** Dieter Leyssen, inwoner van Kuregem, luidt de alarmbel. Hij ziet elke dag menselijke drama’s gebeuren, maar er zijn blijkbaar “onvoldoende middelen” om er iets aan te doen. **PremiumIk woon in Brussel en ik kan het niet langer aanzien** Dieter Leyssen, inwoner van Kuregem, luidt de alarmbel. Hij ziet elke dag menselijke drama’s gebeuren, maar er zijn blijkbaar “onvoldoende middelen” om er iets aan te doen. **PremiumMet Operatie Spinnenweb tonen de Oekraïners hoe ze het draaiboek voor de oorlog veranderen** Goedkope drones, gratis besturingssoftware, gehuurde vrachtwagens: de actie van Oekraïne tot diep in Rusland bevestigt hoe innovatief het belegerde land oorlogvoering invult. “Dit is wereldwijd een wake-upcall.” **PremiumMet Operatie Spinnenweb tonen de Oekraïners hoe ze het draaiboek voor de oorlog veranderen** Goedkope drones, gratis besturingssoftware, gehuurde vrachtwagens: de actie van Oekraïne tot diep in Rusland bevestigt hoe innovatief het belegerde land oorlogvoering invult. “Dit is wereldwijd een wake-upcall.” **PremiumDe mismatch tussen praktijkonderwijs en de arbeidsmarkt: “Een opleiding schrappen waar economisch nood aan is, dat zou toch niet mogen?”** Een gezamenlijk actieplan met de kloof tussen de arbeidsmarkt en het onderwijs dichten. Het Kempense maakbedrijf Stubbe nv merkt hoe nodig dat is. “Scholen in de buurt hebben een opleiding stopgezet voor profielen waar ik om smeek.” **PremiumDe mismatch tussen praktijkonderwijs en de arbeidsmarkt: “Een opleiding schrappen waar economisch nood aan is, dat zou toch niet mogen?”** Een gezamenlijk actieplan met de kloof tussen de arbeidsmarkt en het onderwijs dichten. Het Kempense maakbedrijf Stubbe nv merkt hoe nodig dat is. “Scholen in de buurt hebben een opleiding stopgezet voor profielen waar ik om smeek.” **PremiumLandbouwer haalt slag thuis in verzet tegen golfresort: “Als je geld hebt, kan in Knokke alles”** Voor de aanleg van een groots golfterrein met aanpalend bos wil de gemeente Knokke landbouwer Ronny Van Belleghem onteigenen. “Onwettig”, oordeelde een Brugse rechter. Het gemeentebestuur onderzoekt “verdere juridische stappen”. **PremiumLandbouwer haalt slag thuis in verzet tegen golfresort: “Als je geld hebt, kan in Knokke alles”** Voor de aanleg van een groots golfterrein met aanpalend bos wil de gemeente Knokke landbouwer Ronny Van Belleghem onteigenen. “Onwettig”, oordeelde een Brugse rechter. Het gemeentebestuur onderzoekt “verdere juridische stappen”. **PremiumWaarom “koploper in waterkwaliteit” Leuven zulke vervuilde waterlopen heeft** Leuven voert een ambitieus beleid rond leefbaarheid. Waarom scoort de stad dan zo slecht in Watermonsters, het burgeronderzoek naar waterkwaliteit? “Waterlopen stoppen niet aan de gemeentegrenzen.” **PremiumWaarom “koploper in waterkwaliteit” Leuven zulke vervuilde waterlopen heeft** Leuven voert een ambitieus beleid rond leefbaarheid. Waarom scoort de stad dan zo slecht in Watermonsters, het burgeronderzoek naar waterkwaliteit? “Waterlopen stoppen niet aan de gemeentegrenzen.” **Burgeronderzoek Watermonsters geeft zwemmers hoop: grote waterlopen schoner dan verwacht** Onze rivieren en kanalen zijn opmerkelijk schoon, leert Watermonsters, het burgeronderzoek van De Standaard naar de waterkwaliteit in Vlaanderen en Brussel. Dat biedt kansen voor zwemmen in open water, wat in ons land nog altijd grotendeels verboden is. Tegelijkertijd zijn onze kleinere waterlopen er erg slecht aan toe. **Burgeronderzoek Watermonsters geeft zwemmers hoop: grote waterlopen schoner dan verwacht** Onze rivieren en kanalen zijn opmerkelijk schoon, leert Watermonsters, het burgeronderzoek van De Standaard naar de waterkwaliteit in Vlaanderen en Brussel. Dat biedt kansen voor zwemmen in open water, wat in ons land nog altijd grotendeels verboden is. Tegelijkertijd zijn onze kleinere waterlopen er erg slecht aan toe. **PremiumDe Molenbeek is exemplarisch voor heel Vlaanderen: “Veel burgers zien het directe nut van waterzuivering niet in”** Twaalf procent van alle Vlaamse huishoudens loost zijn afvalwater nog ongezuiverd in een waterloop. Vooral de kleine waterlopen zijn er slecht aan toe. Zoals de Molenbeek in Sint-Genesius-Rode, die “exemplarisch is voor zoveel plaatsen in Vlaanderen”. **PremiumDe Molenbeek is exemplarisch voor heel Vlaanderen: “Veel burgers zien het directe nut van waterzuivering niet in”** Twaalf procent van alle Vlaamse huishoudens loost zijn afvalwater nog ongezuiverd in een waterloop. Vooral de kleine waterlopen zijn er slecht aan toe. Zoals de Molenbeek in Sint-Genesius-Rode, die “exemplarisch is voor zoveel plaatsen in Vlaanderen”. **Het loon in de elektronica & technologische industrie?** De elektronica en technologische industrie is de 5de best betaalde sector in België. Zo blijkt uit het Jobat Salarisrapport. Maar wat betekent dat concreet? **Het loon in de elektronica & technologische industrie?** De elektronica en technologische industrie is de 5de best betaalde sector in België. Zo blijkt uit het Jobat Salarisrapport. Maar wat betekent dat concreet? **Dit zijn de grootste misverstanden bij het kopen van een woning** Een huis kopen is meer dan een louter financiële transactie. Het is een lang proces met details, bochten en verrassingen. Om onaangename verrassingen te vermijden, is goed voorbereid zijn noodzakelijk. Ontdek de grootste misverstanden waarop mensen botsen bij aankoop van een woning. **Dit zijn de grootste misverstanden bij het kopen van een woning** Een huis kopen is meer dan een louter financiële transactie. Het is een lang proces met details, bochten en verrassingen. Om onaangename verrassingen te vermijden, is goed voorbereid zijn noodzakelijk. Ontdek de grootste misverstanden waarop mensen botsen bij aankoop van een woning. **En plots weet ik als jonge vrouw hoe het voelt om de oudere cisman op de dansvloer te zijn** Dansen met je vader kan je begrip voor de witte hetero cisman stevig aanzwengelen, weet Marie Dejonghe. Noem het een lesje empathie voor beginners. **En plots weet ik als jonge vrouw hoe het voelt om de oudere cisman op de dansvloer te zijn** Dansen met je vader kan je begrip voor de witte hetero cisman stevig aanzwengelen, weet Marie Dejonghe. Noem het een lesje empathie voor beginners. **PremiumHoe houd ik mijn huis koel tijdens de hitte? En drink ik beter koude of warme drank?** De tropische temperaturen die eraan komen, doen u misschien dromen van zwembaden en ijsjes, maar misschien bent u er ook wel wat beducht voor. Want: zult u ’s nachts wel vlot de slaap vinden? En zal de kaas niet van tussen uw boterhammen wegsmelten? Laat staan dat u zomaar weet hoe u in een menigte het pinguïneffect vermijdt. Een gids in tien antwoorden. **PremiumHoe houd ik mijn huis koel tijdens de hitte? En drink ik beter koude of warme drank?** De tropische temperaturen die eraan komen, doen u misschien dromen van zwembaden en ijsjes, maar misschien bent u er ook wel wat beducht voor. Want: zult u ’s nachts wel vlot de slaap vinden? En zal de kaas niet van tussen uw boterhammen wegsmelten? Laat staan dat u zomaar weet hoe u in een menigte het pinguïneffect vermijdt. Een gids in tien antwoorden. **PremiumKledingstress bij zomerse temperaturen: hoe luchtig mag je er op het werk bij lopen?** Heel wat bedrijven hanteren geen formele dresscode. Maar als de thermometer stijgt, daalt de duidelijkheid: wat is gepast om te dragen op het werk? “Comfort en authenticiteit winnen terrein.” **PremiumKledingstress bij zomerse temperaturen: hoe luchtig mag je er op het werk bij lopen?** Heel wat bedrijven hanteren geen formele dresscode. Maar als de thermometer stijgt, daalt de duidelijkheid: wat is gepast om te dragen op het werk? “Comfort en authenticiteit winnen terrein.” **Lectrr, cartoon van de dag** Elke dag brengt De Standaard nieuwe cartoons van huiscartoonist Lectrr. **Lectrr, cartoon van de dag** Elke dag brengt De Standaard nieuwe cartoons van huiscartoonist Lectrr. **Humor als zalf voor de ziel: de beste voorstellingen van het moment** In donkere tijden breekt de zon ook door in het theater. Humor verlicht en lucht op in de beste voorstellingen die u momenteel kan zien. **Humor als zalf voor de ziel: de beste voorstellingen van het moment** In donkere tijden breekt de zon ook door in het theater. Humor verlicht en lucht op in de beste voorstellingen die u momenteel kan zien. **PremiumMet deze foundation is het liefde op het eerste gezicht: hij doorstaat zelfs de spiegeltest in de lift** Zelden verlaat Lieve Van de Velde het huis zonder foundation. Toch duurde het tot 2 jaar geleden voor ze Het Spul vond: een flesje Super Serum van het merk Ilia. Liefde op de eerste aanraking was het. **PremiumMet deze foundation is het liefde op het eerste gezicht: hij doorstaat zelfs de spiegeltest in de lift** Zelden verlaat Lieve Van de Velde het huis zonder foundation. Toch duurde het tot 2 jaar geleden voor ze Het Spul vond: een flesje Super Serum van het merk Ilia. Liefde op de eerste aanraking was het. **PremiumDe Palestijnen hebben vrede nodig, geen jihad** Meer dan van Israël zijn de Palestijnen het slachtoffer van de Arabische landen, schrijft Mia Doornaert. Die willen hen niet opnemen, en zijn evenmin bereid en in staat tot vrede. **PremiumDe Palestijnen hebben vrede nodig, geen jihad** Meer dan van Israël zijn de Palestijnen het slachtoffer van de Arabische landen, schrijft Mia Doornaert. Die willen hen niet opnemen, en zijn evenmin bereid en in staat tot vrede. **PremiumWaar houden de studiediensten van de politieke partijen zich eigenlijk mee bezig?** Het debat over de beperking van de werkloosheidsuitkeringen tot twee jaar blijft de gemoederen verhitten. **PremiumWaar houden de studiediensten van de politieke partijen zich eigenlijk mee bezig?** Het debat over de beperking van de werkloosheidsuitkeringen tot twee jaar blijft de gemoederen verhitten. **Premium‘Forever’ op Netflix: vijftig jaar oude schandaalroman wordt frisse, ontroerende tienerreeks ★★★★☆** Vlinders in de buik gaan even snel weer over naar een knoop in de maag. De liefde tussen twee zwarte tieners is er een van het allesverterende soort in Forever op Netflix. **Premium‘Forever’ op Netflix: vijftig jaar oude schandaalroman wordt frisse, ontroerende tienerreeks ★★★★☆** Vlinders in de buik gaan even snel weer over naar een knoop in de maag. De liefde tussen twee zwarte tieners is er een van het allesverterende soort in Forever op Netflix. Het salaris van een functional software test engineer? Dit zijn de 10 best betaalde sportmannen De 20 meest én 20 minst aantrekkelijke beroepen Voka maakt zich grote zorgen over te weinig STEM-opleidingen Bezieler van betonbedrijf is overleden Alibaba doet grot van Jacobs groeien 6 to-do’s voor je een woning verhuurt Een huis kopen met een huurder erin: wat nu? Mag je (ver)bouwen op zon- en feestdagen? Digitale krant Digitale krant Privacy Links Klantenservice Standaard.be"}