{"id": 942, "name": "Naked Capitalism", "domain": "nakedcapitalism.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nakedcapitalism.com/2025/06/ice-raids-and-crackdowns-on-anti-genocide-speech-are-a-threat-to-all-workers.html#comment-4228408", "title": "Ice Raids And Crackdowns On Anti Genocide Speech Are A Threat To All Workers.html#comment 4228408", "content": "Home About Archives Bloggers Policies DocumentsLimited Partnership Agreements Limited Partnership Agreements Limited Partnership Agreements Contact **Fearless commentary on finance, economics, politics and power** Follow yvessmith on Twitter Feedburner RSS Feed RSS Feed for Comments Subscribe via Email SUBSCRIBE **Menu** Home About Archives Bloggers Policies DocumentsLimited Partnership Agreements Limited Partnership Agreements Limited Partnership Agreements Contact **Recent Items** Coffee Break: Trump Deploys National Guard to LA- 06/11/2025 - Nat Wilson Turner Coffee Break: Trump Deploys National Guard to LA- 06/11/2025 - Nat Wilson Turner Coffee Break: Trump Deploys National Guard to LA- 06/11/2025 - Nat Wilson Turner The Projected Death Count from Trump’s One Big Beautiful Bill- 06/11/2025 -Yves Smith The Projected Death Count from Trump’s One Big Beautiful Bill- 06/11/2025 -Yves Smith The Projected Death Count from Trump’s One Big Beautiful Bill- 06/11/2025 -Yves Smith Links 6/11/2025- 06/11/2025 - Conor Gallagher Links 6/11/2025- 06/11/2025 - Conor Gallagher Links 6/11/2025- 06/11/2025 - Conor Gallagher How the ICE Raids and Crackdowns on Anti-Genocide Speech Are A Threat to All American Workers- 06/11/2025 - Conor Gallagher How the ICE Raids and Crackdowns on Anti-Genocide Speech Are A Threat to All American Workers- 06/11/2025 - Conor Gallagher How the ICE Raids and Crackdowns on Anti-Genocide Speech Are A Threat to All American Workers- 06/11/2025 - Conor Gallagher “You’ve Lost That Lovin’ Feeling”: Why Are Young Men Giving Up on Sex?- 06/11/2025 -Yves Smith “You’ve Lost That Lovin’ Feeling”: Why Are Young Men Giving Up on Sex?- 06/11/2025 -Yves Smith “You’ve Lost That Lovin’ Feeling”: Why Are Young Men Giving Up on Sex?- 06/11/2025 -Yves Smith Do AI Models Think?- 06/11/2025 -Yves Smith Do AI Models Think?- 06/11/2025 -Yves Smith Do AI Models Think?- 06/11/2025 -Yves Smith Coffee Break: Armed Madhouse – Implausible Deniability and the Deep State- 06/10/2025 - Haig Hovaness Coffee Break: Armed Madhouse – Implausible Deniability and the Deep State- 06/10/2025 - Haig Hovaness Coffee Break: Armed Madhouse – Implausible Deniability and the Deep State- 06/10/2025 - Haig Hovaness “Is the US on the Path to Becoming a Failed State?”- 06/10/2025 -Yves Smith “Is the US on the Path to Becoming a Failed State?”- 06/10/2025 -Yves Smith “Is the US on the Path to Becoming a Failed State?”- 06/10/2025 -Yves Smith Links 6/10/2025- 06/10/2025 -Yves Smith Links 6/10/2025- 06/10/2025 -Yves Smith Links 6/10/2025- 06/10/2025 -Yves Smith **How the ICE Raids and Crackdowns on Anti-Genocide Speech Are A Threat to All American Workers** David Huerta, president of SEIU California and SEIU-United Service Workers West,was injured and then arrestedwhile documenting a raid by Immigration and Customs Enforcement (ICE) agents on Friday. He is now facing a felony charge of conspiracy to impede an officer with the the Los Angeles native’s detention the latest example of how organized labor is being hit hard from the raids by masked ICE agents. Not only is the Trump administration not going after the employers of undocumented labor, but it is instead targeting union members whowerelegally living and working in the US. Team Trump is doing so bycancelling humanitarian parole,revoking the visasof many graduate student union members, and other ICE actions that target individuals in the wrong place at the wrong time with the wrong skin color and potentially the wrong outlook on capital-labor relations. Unions are increasingly sounding the alarm that the ICE agents snatching people off the street is part of the administration’s wider crackdown on organized labor. The AFL-CIO’s Department of People Who Work for a Living (DPWL) recently held a series of hearings across the country to provide a platform for working people and local communities to express their views on the current administration’s policies. Summarized in thisreport, they argue that the Trump administration’s mass deportation program, with its disregard for due process, threatens the constitutional rights of every worker and poses serious disruptions in key industries and local economies. Let’s take a look at what they’re saying and how this is playing out. Far from focusing immigration enforcement efforts on people who pose a public safety risk, Trump has taken active steps to strip status and work authorization away from millions of working people,many of whom have been members of our workforce and our unions for decades. These enormous populations have all had their status terminated and are now fighting in the courts to preserve their ability to live and work here: Nearly 1 million workers with Temporary Protected Status due to unsafe conditions in Afghanistan, Cameroon, Haiti and Venezuela. More than 1.5 million workers with Humanitarian Parole (an unfortunately named form of protection that has nothing to do with the criminal justice system) who were invited here with sponsors from Afghanistan, Cuba, Haiti, Nicaragua and Venezuela. More than 1.5 million workers with Humanitarian Parole (an unfortunately named form of protection that has nothing to do with the criminal justice system) who were invited here with sponsors from Afghanistan, Cuba, Haiti, Nicaragua and Venezuela. More than 1.5 million workers with Humanitarian Parole (an unfortunately named form of protection that has nothing to do with the criminal justice system) who were invited here with sponsors from Afghanistan, Cuba, Haiti, Nicaragua and Venezuela. Note that all these countries have in recent years—and in some cases, dating back much further—been on the receiving end of US invasions, “counterterrorism” operations, sanctions, regime change efforts, and other modes of violence and plunder. In return, some lucky few get to live the American dream working long hours for low pay and have had the temerity to try to better their lot by joining unions here in the US. Their reward? Like our federal workforce, hundreds of thousands of these immigrant workers received notice through harshly worded form letters that their status, and therefore their ability to work, was being terminated. Some were given as few as seven days to pack up and leave the country, and told that failure to do so would result in criminal prosecution.64 These callous terminations are effectively resulting in mass layoffs of workers across the country, causing massive disruptions in key industries, local economies and union membership. Larger Plan at Work Whilemilitarized ICE agents sweeping into communities across the country might appease some of Trump’s MAGA supporters and provide the illusion of doing something about the exploitation of foreign workers, a closer look shows that it is part of a coordinated attack on all of labor. How so? Let’s start with Donald himself and go from there. Trump’s businesses rely on andcontinue to seekH-2B non-agricultural “guest” workers. A crucial difference between the H-2B and H-2A—covering agricultural workers—and individuals who worked in the US under temporary protected status or humanitarian parole is that the latter two categories didn’t have their ability to stay in the country legally tied to their work. That made them less exploitable. They were free to change jobs and unionize. Guest workers, on the other hand, are loved by Trump and many employers because they are basically indentured servants. Even the Departments of Labor and Homeland Security“acknowledgethat H-2B workers face structural disincentives to reporting or leaving abusive conditions, and often lack power to exercise their rights in the face of exploitative employment situations.” H2-A guest workers also faced a major setback in their fight to organize last year when a District Court Judge issued aninjunctionin August that blocked them from unionizing in 17 states. Meanwhile, the guest worker program featureslabor trafficking, and rampant wage fraud, illegal recruitment fees, wage theft, and illegalthreats of retaliation. Abuse ismade easyby the fact that it’s almost impossible for workers to quit their jobs since their visas are tied to a single employer. Mike Rios, a DOL regional agricultural enforcement coordinator,describesthe H2 program as the “literal purchase of humans.” As of 2024 there were 384,900 H2-A and 215,217 H2-B workers in the US. About 40 percent of U.S. farmworkersare undocumented, and as of 2020 there were more than 406,000 individuals with Temporary Protected Status, which allows them to reside and work legally in the US due to unsafe conditions in their home country. The similar humanitarian parole covered another 530,000-plus. Trump is trying to end Temporary Protected Status, and on May 30 the Supreme Courtallowedthe administration to pause humanitarian parole. Notably, Trump and his ICE goons are not going after H2 workers, but they are targeting those who try to organize them. In March, ICE agents smashed his car window and detained Alfredo “Lelo” Juarez, who began working as a berry picker at the age 14 and helped foundFamilias Unidas Por La Justicia, an independent farmworker union in Washington State. He advocated around issues like overtime pay, heat protections for farmworkers and criticized the exploitative nature of theH-2A program. A Seattle immigration judge had ordered Juarez Zeferino’s removal in 2018. Edgar Franks, the political director of Familias Unidas,tells Truthoutthat the view from the ground makes the Trump administration’s aims fairly obvious. It’s not about ridding the country of immigrant workers nor even prioritizing the white working class. It’s about making all of labor more easily exploitable: It was meant to silence the organizing, deport as many people as possible, and to bring in a captive workforce through the H-2A program. We think that might be the ultimate plan: to get rid of all the immigrant workers who are organizing and fighting back for better conditions, and to bring in a workforce that’s under the complete control of their employer with basically no rights. It’ll make it even harder to organize with farmworkers if more H-2A workers come. It wouldn’t be impossible, but it’ll be more difficult. A White House official told NBC News that Trump wants to “improve” the H-2A andH-2Bprograms, although it’s unclear what exactly that means. If his first term is any indication, it means “improve” for the employers. During Trump 1.0 the temporary work visa programssteadily grewa total of 13 percent larger, and he used the Covid emergency tohelp make it happen: During the pandemic, his administration issued a series of emergency measures that made H-2A and H-2B visasmoreflexibleand employer-friendly. Workers were allowed to stay in the country for longer periods of time, in part because they had been deemed “essential workers,” and wages for H-2A workerswere effectively frozen. With more emergencies arriving on multiple fronts, it wouldn’t be surprising to see a replay. Should the Trump administration succeed in replacing temporary protected status, humanitarian parole, and others with guest workers, it would make it that much harder to organize. As Noah Zatz, a law professor at UCLAnotes: …work under threat of incarceration outside of criminal punishment, or racialized state violence outside incarceration—also highlight continuity withimmigration detentionand deportation. This continuity is particularly important because labor advocates and the labor movement have come to understand—through a long and still-contested process—howemployers gain powerto intimidate, retaliate against, and divide workers when the state’s deportation threat hangs over them and can be invoked by employers. Labor Needs Due Process and Free Speech The AFL-CIO also notes how the disregard for due process and crackdowns on speech hurt immigrant workers now and will do doubt be turned on all workers down the line: In another alarming development, immigrant workers, including green card holders and work visa holders, have faced arrest, detention, revocation of status and deportation with a complete lack of due process. These attacks are affecting more and more of our union siblings, including: SMART Brother Kilmar Abrego Garcia, who was deported to a Salvadoran mega-prison in what the Department of Justice has admitted was a mistake. The administration is refusing to comply with a unanimous Supreme Court order to facilitate his return. Former UAW Brother Mahmoud Khalil, a green card holder with a pregnant U.S. citizen wife, who is being detained without charge and told his green card will be revoked for criticizing U.S. foreign policy. SEIU Sister Rümeysa Öztürk, a grad student worker, was being detained, and was just recently released, for the offense of writing an op-ed in the Tufts University Law School Journal. Hundreds of other higher education student workers around the country from a wide range of unions have had their visas revoked for reasons ranging from the exercise of free speech to being from countries now being considered for new travel bans. The quickly escalating efforts to deny due process, define what constitutes acceptable speech, and arbitrarily strip workers of their visas and work permits creates a climate of fear and sets a dangerous precedent for the rights of all working people, whether they are citizens or not. Despite all the masked ICE agents ripping people out of Home Depots and actions and“ICE Barbie”parachuting in for photo ops, the administration hasyet togo after employers of illegals, which is the easiest and most effective way to stop their hiring—but that’s not the goal here. Here’s the AFL-CIO with a fine example: As an indication of what this imbalance in spending and priorities looks like in practice, ICE reported that it conducted a recent raid at a Philadelphia car wash because it had reports that workers were being exploited. The consequence, however, fell to the seven immigrant workers who were arrested, rather than the employer who was violating their rights. In a country where we rely on workers to report violations to enforce our labor laws, inappropriate enforcement responses such as this risk chilling the exercise of workplace rights, making all workplaces less safe and undermining our organizing efforts. Moreover, these misplaced worksite enforcement priorities incentivize predatory employer behavior that will fuel a race to the bottom in wages and working conditions in major industries around the country. At the same time, the Trump administration is gutting the Department of Labor that wasalreadywoefully understaffed (750 investigators overseeing fair labor standards at 11 million workplaces) and unserious about penalties anyways (maximum penalty per child laborer is $15,000). It has been a bipartisan effort to continually torch it with Trump now acting as an accelerant. As the administration continues to dismantle the federal agencies charged with enforcing our labor and employment laws, the investment in immigration enforcement continues to increase. Our nation already spends 14 times more on immigration enforcement than it does to enforce all the laws to protect more than 165 million workers in job sites around the country. Gutting our government’s resources and capacity to enforce labor standards and protections while stripping immigrant workers of rights and ramping up immigration enforcement is a core part of the anti-union, anti-worker playbook that will enable employers to violate worker rights with impunity. This is a toxic formula that will drive down standards for all workers in key industries and increase wage theft, child labor violations, and preventable workplace injuries and fatalities. Indeed, that appears to be the plan. With Trump and DOGE’sguttingof the National Labor Relations Board, attacks on federal workers unions, selective deportations, Gold Cards, and promotion of H-2 workers, the goal is to make all workers more like the undocumented ones. Here’sMichael Macher: …the US immigration system runs not on the enforcement of immigration laws, but on their selective nonenforcement. Employers have relied on the state to ignore the exploitation of undocumented labor while holding the credible threat of deportation over workers. This has had the effect of strengthening employer bargaining power generally against all workers—lowering wages, weakening unions, and shifting the politics of work away from collective bargaining and wage-and-hour regulation. The interest in labor that is weak and disorganized has driven US politicians, consciously or not, to adopt the role of petty bosses, threatening the deportation of significant portions of the US workforce. But if Trump can afford to blow up this arrangement, it is because the precarity of the undocumented worker represents the future of labor relations in the US, not its past. **Post navigation** **Subscribe to Post Comments30 comments** tJune 11, 2025 at 7:00 amExcellent summary.Reply↓chukjonesJune 11, 2025 at 8:58 amYes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely.Reply↓ Excellent summary. chukjonesJune 11, 2025 at 8:58 amYes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely.Reply↓ Yes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely. Excellent summary. chukjonesJune 11, 2025 at 8:58 amYes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely.Reply↓ Yes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely. Yes, thx Conner. Excellent work connecting ICE, Labor, and Federal HB2 program to employee abuse. That must be the part of Waste Fraud Abuse they were going on about, surely. AGJune 11, 2025 at 7:20 amExcellent. Thanks. A take I had been waiting for.Now I would be interested how those conversations between union leaders who supported Trump and Trump in the WH wind down now. And what A Team Vought and a Team UAW would have to say to each other. 😂 (nothing?!) (I am picturing a scene where the two delegations cross paths in the lobby.)The Canadian labour representative already pointed at the contradictions of US labour´s position during the election here (knowing how difficult it is for them):Doug Henwood´s podcast:part 1) Jason Wade of the UAW explains the union’s endorsement of Trump’s auto tariffspart 2) Sam Gindin, author of this article and former long-time adviser to what used to be known as the Canadian Autoworkers Union, on what issues the tariff controversy obscuresApril 3, 2025https://shout.lbo-talk.org/lbo/RadioArchive/2025/25_04_03.mp3p.s. What is another take on the realities at (Ivy League) universities? I already asked this. And “my sources” from Harvard say there is “fear” on campuses to speak out freely. I do not know however how many and who in particular is “in fear” and whether justified or not. It´s just surreal to me.On the one hand I have to think back at that idiotic NYT video with Stanley and Snyder and I get the feeling the gap between the so-called intelligentsia and the real “forces of production” is widening.On the other hand I haven´t looked up what Stanley is now teaching sitting in Canada and I have no clue what he might be doing behind the scenes to support labour in the US.Reply↓ Excellent. Thanks. A take I had been waiting for. Now I would be interested how those conversations between union leaders who supported Trump and Trump in the WH wind down now. And what A Team Vought and a Team UAW would have to say to each other. 😂 (nothing?!) (I am picturing a scene where the two delegations cross paths in the lobby.) The Canadian labour representative already pointed at the contradictions of US labour´s position during the election here (knowing how difficult it is for them): Doug Henwood´s podcast: part 1) Jason Wade of the UAW explains the union’s endorsement of Trump’s auto tariffspart 2) Sam Gindin, author of this article and former long-time adviser to what used to be known as the Canadian Autoworkers Union, on what issues the tariff controversy obscuresApril 3, 2025https://shout.lbo-talk.org/lbo/RadioArchive/2025/25_04_03.mp3 p.s. What is another take on the realities at (Ivy League) universities? I already asked this. And “my sources” from Harvard say there is “fear” on campuses to speak out freely. I do not know however how many and who in particular is “in fear” and whether justified or not. It´s just surreal to me. On the one hand I have to think back at that idiotic NYT video with Stanley and Snyder and I get the feeling the gap between the so-called intelligentsia and the real “forces of production” is widening. On the other hand I haven´t looked up what Stanley is now teaching sitting in Canada and I have no clue what he might be doing behind the scenes to support labour in the US. Excellent. Thanks. A take I had been waiting for. Now I would be interested how those conversations between union leaders who supported Trump and Trump in the WH wind down now. And what A Team Vought and a Team UAW would have to say to each other. 😂 (nothing?!) (I am picturing a scene where the two delegations cross paths in the lobby.) The Canadian labour representative already pointed at the contradictions of US labour´s position during the election here (knowing how difficult it is for them): Doug Henwood´s podcast: part 1) Jason Wade of the UAW explains the union’s endorsement of Trump’s auto tariffspart 2) Sam Gindin, author of this article and former long-time adviser to what used to be known as the Canadian Autoworkers Union, on what issues the tariff controversy obscuresApril 3, 2025https://shout.lbo-talk.org/lbo/RadioArchive/2025/25_04_03.mp3 p.s. What is another take on the realities at (Ivy League) universities? I already asked this. And “my sources” from Harvard say there is “fear” on campuses to speak out freely. I do not know however how many and who in particular is “in fear” and whether justified or not. It´s just surreal to me. On the one hand I have to think back at that idiotic NYT video with Stanley and Snyder and I get the feeling the gap between the so-called intelligentsia and the real “forces of production” is widening. On the other hand I haven´t looked up what Stanley is now teaching sitting in Canada and I have no clue what he might be doing behind the scenes to support labour in the US. ambritJune 11, 2025 at 7:28 amAs I have suggested before, the logical next step for Unions in general in America is the resurrection of the old- style physical violence campaigns against the employer groups. This usually takes the form of bombing campaigns against physical items like employer association structures, physical job sites, and materials warehouses. This may seem extreme, as in being very close to “asymmetric warfare” during wartime, but this is a war.Previously, as Warren Buffet famously quipped, the war between the “rich” and the “poor” is being “won” by the “rich” on legal and financial fronts. It has become obvious now that the legal and financial systems in America have been captured by the Elites and work for their benefit. This comes as no surprise. The trend in this has been obvious in general for as long as America has been a country. The “new” aspect of this struggle is that the systems now actively work to the detriment of the working classes. Since the soft power “system” has now obviously and actively become “weaponized” against the working classes, the Class War, for it is nothing less, must go “kinetic.”There, I’ve said it. G– help us. Hard times are coming for us all.Stay safe.Reply↓CarolinianJune 11, 2025 at 8:41 amWell he did promise to take us back to the 1890s. Pinkerton’s next?As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them.Reply↓ As I have suggested before, the logical next step for Unions in general in America is the resurrection of the old- style physical violence campaigns against the employer groups. This usually takes the form of bombing campaigns against physical items like employer association structures, physical job sites, and materials warehouses. This may seem extreme, as in being very close to “asymmetric warfare” during wartime, but this is a war.Previously, as Warren Buffet famously quipped, the war between the “rich” and the “poor” is being “won” by the “rich” on legal and financial fronts. It has become obvious now that the legal and financial systems in America have been captured by the Elites and work for their benefit. This comes as no surprise. The trend in this has been obvious in general for as long as America has been a country. The “new” aspect of this struggle is that the systems now actively work to the detriment of the working classes. Since the soft power “system” has now obviously and actively become “weaponized” against the working classes, the Class War, for it is nothing less, must go “kinetic.”There, I’ve said it. G– help us. Hard times are coming for us all.Stay safe. CarolinianJune 11, 2025 at 8:41 amWell he did promise to take us back to the 1890s. Pinkerton’s next?As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them.Reply↓ Well he did promise to take us back to the 1890s. Pinkerton’s next? As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them. As I have suggested before, the logical next step for Unions in general in America is the resurrection of the old- style physical violence campaigns against the employer groups. This usually takes the form of bombing campaigns against physical items like employer association structures, physical job sites, and materials warehouses. This may seem extreme, as in being very close to “asymmetric warfare” during wartime, but this is a war.Previously, as Warren Buffet famously quipped, the war between the “rich” and the “poor” is being “won” by the “rich” on legal and financial fronts. It has become obvious now that the legal and financial systems in America have been captured by the Elites and work for their benefit. This comes as no surprise. The trend in this has been obvious in general for as long as America has been a country. The “new” aspect of this struggle is that the systems now actively work to the detriment of the working classes. Since the soft power “system” has now obviously and actively become “weaponized” against the working classes, the Class War, for it is nothing less, must go “kinetic.”There, I’ve said it. G– help us. Hard times are coming for us all.Stay safe. CarolinianJune 11, 2025 at 8:41 amWell he did promise to take us back to the 1890s. Pinkerton’s next?As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them.Reply↓ Well he did promise to take us back to the 1890s. Pinkerton’s next? As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them. Well he did promise to take us back to the 1890s. Pinkerton’s next? As for unions in general, their decline has long preceded Trump. It’s an interesting stat that Biden was deporting more than Trump so perhaps all of this is for the Fox News cameras and about keeping the MAGA on board as Trump’s other policies go against them. DJG, Reality CzarJune 11, 2025 at 8:11 amNoting: ‘Mike Rios, a DOL regional agricultural enforcement coordinator, describes the H2 program as the “literal purchase of humans.”’Hmmm. I am detecting a theme of purchase of human beings throughout U.S. history.Then, at the end of the article, Michael Macher: “This has had the effect of strengthening employer bargaining power generally against all workers—lowering wages, weakening unions, and shifting the politics of work away from collective bargaining and wage-and-hour regulation. The interest in labor that is weak and disorganized has driven US politicians, consciously or not, to adopt the role of petty bosses, threatening the deportation of significant portions of the US workforce.”It is truly this simple — ending attitudes of slavery and forcing the issue: I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions. That’s the liberal gumming, and the Republican Party gumming.Repeal the Taft-Hartley act.Reply↓AGJune 11, 2025 at 8:35 am“I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍Reply↓Henry Moon PieJune 11, 2025 at 8:59 amTime to call onSabo-tabby?The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs:The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work.The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW.The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith:A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.”To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract.One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead.Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made.Reply↓AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Noting: ‘Mike Rios, a DOL regional agricultural enforcement coordinator, describes the H2 program as the “literal purchase of humans.”’ Hmmm. I am detecting a theme of purchase of human beings throughout U.S. history. Then, at the end of the article, Michael Macher: “This has had the effect of strengthening employer bargaining power generally against all workers—lowering wages, weakening unions, and shifting the politics of work away from collective bargaining and wage-and-hour regulation. The interest in labor that is weak and disorganized has driven US politicians, consciously or not, to adopt the role of petty bosses, threatening the deportation of significant portions of the US workforce.” It is truly this simple — ending attitudes of slavery and forcing the issue: I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions. That’s the liberal gumming, and the Republican Party gumming. Repeal the Taft-Hartley act. AGJune 11, 2025 at 8:35 am“I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍Reply↓ “I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍 Henry Moon PieJune 11, 2025 at 8:59 amTime to call onSabo-tabby?The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs:The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work.The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW.The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith:A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.”To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract.One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead.Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made.Reply↓AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Time to call onSabo-tabby? The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs: The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work. The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW. The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith: A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.” To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract. One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead. Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made. AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ thanks for the info hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Same here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up. Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. Noting: ‘Mike Rios, a DOL regional agricultural enforcement coordinator, describes the H2 program as the “literal purchase of humans.”’ Hmmm. I am detecting a theme of purchase of human beings throughout U.S. history. Then, at the end of the article, Michael Macher: “This has had the effect of strengthening employer bargaining power generally against all workers—lowering wages, weakening unions, and shifting the politics of work away from collective bargaining and wage-and-hour regulation. The interest in labor that is weak and disorganized has driven US politicians, consciously or not, to adopt the role of petty bosses, threatening the deportation of significant portions of the US workforce.” It is truly this simple — ending attitudes of slavery and forcing the issue: I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions. That’s the liberal gumming, and the Republican Party gumming. Repeal the Taft-Hartley act. AGJune 11, 2025 at 8:35 am“I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍Reply↓ “I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍 “I have to admit to losing patience with the endless analyses that want to gum the problem to death, in hopes of never solving problems of the status of immigrants, of working people, and of unions.”👍 Henry Moon PieJune 11, 2025 at 8:59 amTime to call onSabo-tabby?The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs:The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work.The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW.The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith:A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.”To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract.One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead.Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made.Reply↓AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Time to call onSabo-tabby? The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs: The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work. The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW. The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith: A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.” To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract. One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead. Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made. AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ thanks for the info hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Same here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up. Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. Time to call onSabo-tabby? The courts interpreted the Wagner Act in a way thatdoes not protectthe most effective forms of concerted action like sit-down strikes that prevent the employer from replacing striking workers with scabs: The U.S. Supreme Court has ruled that a “sitdown” strike, when employees simply stay in the plant and refuse to work is not protected by the law. The NLRB has also held that workers who engage in intermittent strikes, or strikes that involve “a plan to strike, return to work, and strike again” are not protected, though the NLRB General Counsel is urging the NLRB to reconsider this area of law. The NLRB has also held that the NLRA does not protect strikers who fail to take “reasonable precautions” to protect their employer’s property from foreseeable, aggravated, and imminent danger due to the sudden cessation of work. The famousBattle of Flintwas a pre-Wagner sit-down strike that broke GM’s resistance to bargaining with the young UAW. The late Staughton Lynd advocated forSolidarity Unionism. Lynd recognized that Taft-Hartley wasn’t the only problem. Things went deeper, all the way to the Wagner Act itself, which Lynd saw as a way of corralling a militant and growing labor movement in the 1930s. The burden on would-be organizers under the NLRB’s election framework is daunting enough, but even if a union wins a certification election,employers refuse to bargain in good faith: A more recent study by John Kallas, Dongwoo Park, and Rachel Aleks reviewed 226 NLRB representation elections that occurred in 2018 and found that 63% of unions failed to reach a first contract within one year of winning their election. After two years, 43% were still working without a first contract. The study also found that employer use of legally prohibited “unfair labor practices” was “associated with a significant delay” in first contracts, leading the researchers to conclude that “employers can—and do—actively undermine bargaining.” To even have a chance of getting a contract, the union will have to agree to two clauses that render it nearly impotent: the “management rights” clause that restricts the union’s power to bargain about anything beyond wages and benefits; and a no-strike clause for the duration of the contract. One problem with unions having success in lifting its members to the “middle class” is that those workers have a lot to lose in a labor action that does not follow the intricate rules of American labor law, and with Taft-Hartley, so does the union bureaucracy. This has created a very meek labor movement that would rather let politicians do the fighting for them with the result that the labor movement is all but dead. Fain at the UAW has had some good ideas about how to break out of that, but even he is still committed to “playing by the rules” by lining up contract termination dates so that no-strike clauses are not violated if a “general strike” is called. While clever, I suspect that, in the end, it will be impossible for any participating unions to be both effective and within the rules. A choice will have to be made. AGJune 11, 2025 at 9:22 amthanks for the infoReply↓hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ thanks for the info hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Same here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up. Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. thanks for the info hemeantwellJune 11, 2025 at 10:52 amSame here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up.Reply↓Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Same here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up. Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. Same here. This is quite a good article + comments labor lode. Might be a good idea to give a collection of labor-related material at NC more prominence.I looked at the topics list on the right of the site page and labor doesn’t show up. Conor GallagherPost authorJune 11, 2025 at 2:11 pmThanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment.Reply↓ Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. Thanks, hemeantwell. I imagine labor-related material will be getting more prominence here moving forward. We include a lot of other coverage via links but they’re frequently too narrow, sunshine pumping, and lacking acknowledgement of obstacles like Henry Moon Pie provides in above comment. AGJune 11, 2025 at 9:02 amNot quiet sure what´s the sense behind Taibbi´s comment.I only saw the preview:The “Mostly Peaceful” RevolutionThe Los Angeles riots are reviving the revolting homages to Marx and socialist revolution that helped elect Donald Trump in the first placehttps://www.racket.news/p/the-mostly-peaceful-revolutionBlaiming people who go to the streets for the inequality that did get Trump elected?(Actually the term “get Trump elected” is very much not good, it doesn´t do justice to the true nature of the problem.)And what is the point of critcising MSM for not calling the protest violent and trying to point at the larger context?“(…)“FIERY BUT MOSTLY PEACEFUL PROTESTS AFTER POLICE SHOOTING.” CNN posterized Jimenez twice, as he was also onscreen with Wolf Blitzer when the word “violent” disappeared from a tagline mid-broadcast. Most mainstream observers defended the oxymoronic approach, hailing a September 2020 study that mathematically characterized the mostly-peacefulness of that summer’s protests (93%!) while arguing the public should be focused on greater violence-s of racism, colonialism, police brutality, etc.(…)”I doubt he would disagree with Conor´s piece.But then why hit on “revolting homages to Marx and socialist revolution”?Taibbi must be aware of how workers´ rights were achieved in the US.The space for serious media criticism without siding with the protest in contrast to do biased political commentary is at times so narrow, it´s almost invisible and his point might lack merit. A bit only as if doing it for the sake of it.What would he be doing if people got shot? Would he still try to find the “wrinkle”, because it was Chinese-produced bullets, not American?Which is why diverting to real entertainment via book review appears to be right reaction to preserve artistic independence from the turmoil.(a little Andy Kaufman?)p.s. I don´t understand the last phrase:“anyone who’s been to college knows what this is, and we should stop trying to hide it:”Reply↓BoshkoJune 11, 2025 at 10:19 amI find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line.I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst.He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example.After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days.Reply↓CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓floraJune 11, 2025 at 10:25 amFrom Taibbi’s longer article. (He’s not wrong, imo.):This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit.—Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.Reply↓CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓floraJune 11, 2025 at 10:36 amThe last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo.Reply↓hemeantwellJune 11, 2025 at 11:08 amHenwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right.A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved.Reply↓KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Not quiet sure what´s the sense behind Taibbi´s comment.I only saw the preview: The “Mostly Peaceful” RevolutionThe Los Angeles riots are reviving the revolting homages to Marx and socialist revolution that helped elect Donald Trump in the first placehttps://www.racket.news/p/the-mostly-peaceful-revolution Blaiming people who go to the streets for the inequality that did get Trump elected?(Actually the term “get Trump elected” is very much not good, it doesn´t do justice to the true nature of the problem.) And what is the point of critcising MSM for not calling the protest violent and trying to point at the larger context?“(…)“FIERY BUT MOSTLY PEACEFUL PROTESTS AFTER POLICE SHOOTING.” CNN posterized Jimenez twice, as he was also onscreen with Wolf Blitzer when the word “violent” disappeared from a tagline mid-broadcast. Most mainstream observers defended the oxymoronic approach, hailing a September 2020 study that mathematically characterized the mostly-peacefulness of that summer’s protests (93%!) while arguing the public should be focused on greater violence-s of racism, colonialism, police brutality, etc.(…)” I doubt he would disagree with Conor´s piece. But then why hit on “revolting homages to Marx and socialist revolution”?Taibbi must be aware of how workers´ rights were achieved in the US. The space for serious media criticism without siding with the protest in contrast to do biased political commentary is at times so narrow, it´s almost invisible and his point might lack merit. A bit only as if doing it for the sake of it. What would he be doing if people got shot? Would he still try to find the “wrinkle”, because it was Chinese-produced bullets, not American? Which is why diverting to real entertainment via book review appears to be right reaction to preserve artistic independence from the turmoil.(a little Andy Kaufman?) p.s. I don´t understand the last phrase: “anyone who’s been to college knows what this is, and we should stop trying to hide it:” BoshkoJune 11, 2025 at 10:19 amI find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line.I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst.He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example.After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days.Reply↓CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ I find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line. I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst. He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example. After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days. CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ Kirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old. lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ And I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days. floraJune 11, 2025 at 10:25 amFrom Taibbi’s longer article. (He’s not wrong, imo.):This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit.—Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.Reply↓CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓ From Taibbi’s longer article. (He’s not wrong, imo.): This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit. — Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office. CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓ Yes it’s political but so is Trump’s immigration theater. JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓ I don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees. We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS. And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans? Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓ “Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.” Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence. floraJune 11, 2025 at 10:36 amThe last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo.Reply↓ The last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo. hemeantwellJune 11, 2025 at 11:08 amHenwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right.A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved.Reply↓KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Henwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right. A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved. KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓ I still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous. JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Taibbi is scrambling to maintain his eyeball count by pandering to the right. That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo. The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income) Not quiet sure what´s the sense behind Taibbi´s comment.I only saw the preview: The “Mostly Peaceful” RevolutionThe Los Angeles riots are reviving the revolting homages to Marx and socialist revolution that helped elect Donald Trump in the first placehttps://www.racket.news/p/the-mostly-peaceful-revolution Blaiming people who go to the streets for the inequality that did get Trump elected?(Actually the term “get Trump elected” is very much not good, it doesn´t do justice to the true nature of the problem.) And what is the point of critcising MSM for not calling the protest violent and trying to point at the larger context?“(…)“FIERY BUT MOSTLY PEACEFUL PROTESTS AFTER POLICE SHOOTING.” CNN posterized Jimenez twice, as he was also onscreen with Wolf Blitzer when the word “violent” disappeared from a tagline mid-broadcast. Most mainstream observers defended the oxymoronic approach, hailing a September 2020 study that mathematically characterized the mostly-peacefulness of that summer’s protests (93%!) while arguing the public should be focused on greater violence-s of racism, colonialism, police brutality, etc.(…)” I doubt he would disagree with Conor´s piece. But then why hit on “revolting homages to Marx and socialist revolution”?Taibbi must be aware of how workers´ rights were achieved in the US. The space for serious media criticism without siding with the protest in contrast to do biased political commentary is at times so narrow, it´s almost invisible and his point might lack merit. A bit only as if doing it for the sake of it. What would he be doing if people got shot? Would he still try to find the “wrinkle”, because it was Chinese-produced bullets, not American? Which is why diverting to real entertainment via book review appears to be right reaction to preserve artistic independence from the turmoil.(a little Andy Kaufman?) p.s. I don´t understand the last phrase: “anyone who’s been to college knows what this is, and we should stop trying to hide it:” BoshkoJune 11, 2025 at 10:19 amI find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line.I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst.He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example.After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days.Reply↓CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ I find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line. I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst. He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example. After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days. CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ Kirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old. lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ And I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days. I find Taibbi to have become too engrossed on the hopium that Trump would burn it all down (i.e., drain the swap, purge the looters and congress critters, etc etc) and start anew. Alas, he seems to have been fooled like the rest who swallowed this line. I also find his own economics questionable. Despite his in depth coverage of the banksters during the GFC and infamous “vampire squid” depiction of Goldman Sachs, he seems to always regress to the tropey, “but how will they pay for it all [these delusional and naive socialists]?!” critique. His own understanding of finance, payments, accounting is not at all convincing in his reporting at best, and seriously flawed at worst. He’s strongest in, as he does in the piece you cite, jumping on the endless hypocrisy of corporate media and thus its failure to correctly assess the political zeitgeist. (He loves to thump his chest and constantly recall how he was the lone reporter in the press pool back in 2015 to take Trump the heel as a serious political force.) It was useful to point out red maga vs blue maga as a through the looking glass experience in the political landscape, but he was quite gullible, I find, to take Trump II seriously as a reformer. He was gobsmacked to find Trump II trampling over first amendment rights, for example. After nearly 15+ years of reading him, I’m still not sure what to make of Taibbi. Muckracking intrepid journalist, or journalist bro with a self righteous passport stamp from the real-deal kremlin days. CarolinianJune 11, 2025 at 10:34 amKirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old.Reply↓lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ Kirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old. lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ And I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days. Kirn, who leans conservative, pulls him to the right. I like Kirn but the Trump excuses get old. lyman alpha blobJune 11, 2025 at 11:44 amAnd I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days.Reply↓ And I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days. And I have noticed Taibbi trying to pull Kirn back from the brink a number of times lately when he starts getting a little too crazy. I’m not sure how in depth they go over what they’ll be talking about on the podcasts ahead of time, but I get the impression that Kirn likes to get a little loose during the show and then give off the cuff hot take riffs, particularly ones that “own” what passes for “the libs” these days. floraJune 11, 2025 at 10:25 amFrom Taibbi’s longer article. (He’s not wrong, imo.):This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit.—Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.Reply↓CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓ From Taibbi’s longer article. (He’s not wrong, imo.): This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit. — Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office. CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓ Yes it’s political but so is Trump’s immigration theater. JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓ I don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees. We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS. And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans? Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓ “Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.” Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence. From Taibbi’s longer article. (He’s not wrong, imo.): This is the moment when the previously disinterested voter looks up, notices governors and mayors and congresspersons expressing apparently limitless support for illegal immigration, tax evasion, even crime, and wonders what the deal is. As in, a civilian protester can hold signs saying “No one is illegal” or “Abolish ICE Now” or even wave the Mexican flag on seized highways, but officials who command police forces or are charged with immigration enforcement probably shouldn’t cheer — unless they harbor utopian notions about a borderless world, which they inevitably do because they went to college in America. This zone of realization is where Trump cleans up every time. I used to think it was unfortunate, now I think it’s deserved. These idiots can’t muster the energy to even pretend to care at even a baseline level about mundane patriotic concerns like not letting absolutely everyone over the border, or drawing some kind of line when it comes to vandalism or school standards. Even the most liberal voter reaches a moment of exhaustion with this bullshit. — Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office. CarolinianJune 11, 2025 at 10:43 amYes it’s political but so is Trump’s immigration theater.Reply↓ Yes it’s political but so is Trump’s immigration theater. Yes it’s political but so is Trump’s immigration theater. JonnyJamesJune 11, 2025 at 12:49 pmI don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees.We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS.And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans?Reply↓ I don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees. We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS. And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans? I don’t agree, Taibbi is being superficial, IMO. It’s all bullshit. There is no democracy, there is no patriotism. No one gives a toss about the USA, or immigrants, they are political footballs and an instrument of “distract and divide”. (plus a source of cheap labor, wage theft etc.)The oligarchy have the plebs fighting among themselves, while they loot and pillage. The gullible plebs do as they are instructed by the MassMediaMonopoly Techno-Feudal overlords. And even very informed, intelligent people fall for the emotional manipulation and distractions and get lost in the forest for the trees. We have had successive US regimes and virtually every single member of the House and Senate voting to violate their own laws to send Israel billions upon billions of OUR public resources, weapons etc. to mass murder children. And both the phony liberals and pony conservative crowd say this is “patriotic”? WTF? The lawless rot and corruption should be the focus, not superficial BS. And the DT regime says anyone who criticizes the crimes of a FOREIGN country is “anti-Semitic” and should be deported. That’s “patriotic”? Free speech? Constitutional liberties? Persecuting Americans on behalf of a foreign nation is a form of treason, IMO. What happened to the Ron Paul republicans? Christopher SmithJune 11, 2025 at 12:59 pm“Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.”Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence.Reply↓ “Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.” Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence. “Me now: if Dems made this effort when C and W and O and B were in office and ICE was doing the same stuff, that would be one thing. But no, it’s only when T is in office.” Same here. Compare the way Pelosi, et a;. caved to W versus the way they have sometimes stood up to Trump (even if superfically). I wonder if Trump’s last name were Bush if we would see even more acquiescence. floraJune 11, 2025 at 10:36 amThe last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo.Reply↓ The last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo. The last phrase about college is reference to US colleges embrace of woke and DEI , often times at the expense of critical thinking in classrooms. imo. hemeantwellJune 11, 2025 at 11:08 amHenwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right.A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved.Reply↓KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Henwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right. A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved. KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓ I still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous. JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Taibbi is scrambling to maintain his eyeball count by pandering to the right. That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo. The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income) Henwood interviewed Eoin Higginsre his bookOwned: “How Tech Billionaireson the Right Bought the Loudest Voices on the Left.”In sum, Taibbi is scrambling to maintain his eyeball count by pandering to the right. A few months ago I dropped my sub and left a few lines to the effect of “whatever happened to vampire squid journalism? These days you sound like a spinoff of FOX.” I think others were conveying the same because I’ve noticed some resumption of anti-corporate coverage. You’ll notice that in his critical line cited by AG he’s arguing for the first impression a viewer might have if they see rioting. Good journalism amounts to encouraging the amendment of first impressions, not caving to them. On occasion he’s come up with good material to inform left social movements, but has no conception of them as a messy process and no patience for the turmoil involved. KLGJune 11, 2025 at 1:22 pmI still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous.Reply↓ I still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous. I still have my subscription (and my copy of the Vampire Squid issue of Rolling Stone and all of his books), but AFAIK Taibbi and Kirn (the much more risible of the pair) still believe Jay Bhattacharya MD was “censored” over the Great Barrington Declaration. Taibbi has referred to Bhattacharya as a physician and/or scientist. Nope. He is a glibertarian economist who went straight from his Stanford MD graduation to the Stanford economics department for that second doctoral postnomial abbreviation. Taibbi cannot or will not understand the GBD for what it is: A not-so-soft eugenicist manifesto with no scientific foundation and the product of one our most effective Merchants of Doubt. To wit, there can be no herd immunity to a virus for which durable immunity, through previous infection or vaccination, is a unicorn. This fact of vertebrate virology, vaccinology, and epidemiology has been known for about 80 years. But I repeat myself. Again. Oh, and that Jay Bhattacharya MD-PhD is now Director of the National Institutes of Health is, well, ridiculous. JonnyJamesJune 11, 2025 at 1:50 pmTaibbi is scrambling to maintain his eyeball count by pandering to the right.That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo.The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income)Reply↓ Taibbi is scrambling to maintain his eyeball count by pandering to the right. That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo. The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income) Taibbi is scrambling to maintain his eyeball count by pandering to the right. That sums it up. Wittingly or not, he has become part of superficial distract and divide “journalism”. Anyone who still believes in US democracy, “liberals and conservatives” and D and R “choice” is either gullible, in deep denial, or deliberately pandering to the partisan satus-quo. The problems we face have a long history, and the corruption is not only illegal, much of it is institutionalized. That much oughta be clear by now. Few want to look behind the curtain and see the ugliness and smell the stench – it’s not pleasant and it does not attract subscribers (and thus “generate” income) AGJune 11, 2025 at 10:04 amAn example of what is odd and what is wise about the left currently in one text.The term Democratic Party is not mentioned a single time.The only politician named is Trump (Hegseth once because of his Marines comment).I call this inappropriate pathos.LA Protests Signal Public’s Readiness to Rebel Against Anti-Immigrant FascismBy Chris Newmanvia TRUTHOUThttps://znetwork.org/znetarticle/la-protests-signal-publics-readiness-to-rebel-against-anti-immigrant-fascism/“(…)The late Mike Davis, the historian, activist, and keeper of all truths about L.A., was still writing and giving interviews as he was dying. It was during the worst of the pandemic. He worried that fascism was setting in because people on the left had sheltered in place, done what they were told, retreated into Zoom and abandoned the public square.“It’s one of the Ten Commandments of the left,” he told The Dig podcast in 2020. “Maybe it’s the First Commandment. You never relinquish the streets.”He was right: Nonviolent public protests are our sword and shield. We need to use them. Davis, who wrote about L.A.’s history from the bottom up, saw its future as well as anyone. The cover of his 1990 book, City of Quartz, shows the Metropolitan Detention Center, ground zero for today’s protests.If you’re still looking for a sign, here’s another one: June 15 is the 10th anniversary of when the fascist descent began. We’ve been living with the MAGA nightmare for exactly a decade.On that day in 2015, Trump rode down his golden escalator to announce his bid for President. We all know what he said about crime, drugs, and “rapists” from Mexico. But he prefaced his dehumanizing language more broadly: “The U.S.,” he said, “has become a dumping ground for everybody else’s problems.”He was being perfectly clear, but many didn’t take it seriously. Soon after in The New York Times, Ross Douthat wrote, “There’s something that’s joyfully ridiculous about his candidacy.” In August, Maureen Dowd welcomed Trump into the race: “Sometimes you need a showman in the show.”Another Times writer, though, came to a different conclusion after Trump repeated his “dumping ground” line at a rally that month in Dallas:The problem with this particular clown is that his words are not clownish. The language he uses about immigrants is dehumanizing and vile. The audiences that adore him are animated not just by infatuation, but by the age-old catalysts of fear, resentment and hate. This is what moves the Trump effect into the realm of the frightening, rather than amusing or fascinating.That was years before “shithole countries.” Before the mass kidnapping of migrant children and the massacre of Latinos at Walmart in El Paso. Before the lies about immigrants eating cats and dogs, the killing of Temporary Protected Status, the massive use of feds and cops in renewed workplace raids. Before the regime started sending busloads and planeloads of migrants into gulags foreign and domestic, and the Supreme Court gave its blessing to wild abuses of power.Before Justice Sonia Sotomayor had to write, in dissent: “History is no stranger to such lawless regimes, but this Nation’s system of laws is designed to prevent, not enable, their rise.”(…)Mike Davis is gone. But you and I aren’t. All of us are lucky to still be alive in these times. We’ve been given the opportunity to live out our ideals, to fight for our values, to be the community and the people we always said we were.(…)”Reply↓David in Friday HarborJune 11, 2025 at 11:56 amTerrific comment on a terrific post by Connor. Mike Davis saw this coming.H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people.The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?Reply↓AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ An example of what is odd and what is wise about the left currently in one text.The term Democratic Party is not mentioned a single time.The only politician named is Trump (Hegseth once because of his Marines comment). I call this inappropriate pathos. LA Protests Signal Public’s Readiness to Rebel Against Anti-Immigrant FascismBy Chris Newmanvia TRUTHOUThttps://znetwork.org/znetarticle/la-protests-signal-publics-readiness-to-rebel-against-anti-immigrant-fascism/ “(…)The late Mike Davis, the historian, activist, and keeper of all truths about L.A., was still writing and giving interviews as he was dying. It was during the worst of the pandemic. He worried that fascism was setting in because people on the left had sheltered in place, done what they were told, retreated into Zoom and abandoned the public square. “It’s one of the Ten Commandments of the left,” he told The Dig podcast in 2020. “Maybe it’s the First Commandment. You never relinquish the streets.” He was right: Nonviolent public protests are our sword and shield. We need to use them. Davis, who wrote about L.A.’s history from the bottom up, saw its future as well as anyone. The cover of his 1990 book, City of Quartz, shows the Metropolitan Detention Center, ground zero for today’s protests. If you’re still looking for a sign, here’s another one: June 15 is the 10th anniversary of when the fascist descent began. We’ve been living with the MAGA nightmare for exactly a decade. On that day in 2015, Trump rode down his golden escalator to announce his bid for President. We all know what he said about crime, drugs, and “rapists” from Mexico. But he prefaced his dehumanizing language more broadly: “The U.S.,” he said, “has become a dumping ground for everybody else’s problems.” He was being perfectly clear, but many didn’t take it seriously. Soon after in The New York Times, Ross Douthat wrote, “There’s something that’s joyfully ridiculous about his candidacy.” In August, Maureen Dowd welcomed Trump into the race: “Sometimes you need a showman in the show.” Another Times writer, though, came to a different conclusion after Trump repeated his “dumping ground” line at a rally that month in Dallas: The problem with this particular clown is that his words are not clownish. The language he uses about immigrants is dehumanizing and vile. The audiences that adore him are animated not just by infatuation, but by the age-old catalysts of fear, resentment and hate. This is what moves the Trump effect into the realm of the frightening, rather than amusing or fascinating. That was years before “shithole countries.” Before the mass kidnapping of migrant children and the massacre of Latinos at Walmart in El Paso. Before the lies about immigrants eating cats and dogs, the killing of Temporary Protected Status, the massive use of feds and cops in renewed workplace raids. Before the regime started sending busloads and planeloads of migrants into gulags foreign and domestic, and the Supreme Court gave its blessing to wild abuses of power. Before Justice Sonia Sotomayor had to write, in dissent: “History is no stranger to such lawless regimes, but this Nation’s system of laws is designed to prevent, not enable, their rise.”(…)Mike Davis is gone. But you and I aren’t. All of us are lucky to still be alive in these times. We’ve been given the opportunity to live out our ideals, to fight for our values, to be the community and the people we always said we were.(…)” David in Friday HarborJune 11, 2025 at 11:56 amTerrific comment on a terrific post by Connor. Mike Davis saw this coming.H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people.The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?Reply↓AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Terrific comment on a terrific post by Connor. Mike Davis saw this coming. H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people. The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords? AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓ “TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?” May be you are right and itisthat simple. JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Great points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death. It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change… David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Jerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem. As all of what passes for entertainment in AmericaThe Cruelty is the Point. An example of what is odd and what is wise about the left currently in one text.The term Democratic Party is not mentioned a single time.The only politician named is Trump (Hegseth once because of his Marines comment). I call this inappropriate pathos. LA Protests Signal Public’s Readiness to Rebel Against Anti-Immigrant FascismBy Chris Newmanvia TRUTHOUThttps://znetwork.org/znetarticle/la-protests-signal-publics-readiness-to-rebel-against-anti-immigrant-fascism/ “(…)The late Mike Davis, the historian, activist, and keeper of all truths about L.A., was still writing and giving interviews as he was dying. It was during the worst of the pandemic. He worried that fascism was setting in because people on the left had sheltered in place, done what they were told, retreated into Zoom and abandoned the public square. “It’s one of the Ten Commandments of the left,” he told The Dig podcast in 2020. “Maybe it’s the First Commandment. You never relinquish the streets.” He was right: Nonviolent public protests are our sword and shield. We need to use them. Davis, who wrote about L.A.’s history from the bottom up, saw its future as well as anyone. The cover of his 1990 book, City of Quartz, shows the Metropolitan Detention Center, ground zero for today’s protests. If you’re still looking for a sign, here’s another one: June 15 is the 10th anniversary of when the fascist descent began. We’ve been living with the MAGA nightmare for exactly a decade. On that day in 2015, Trump rode down his golden escalator to announce his bid for President. We all know what he said about crime, drugs, and “rapists” from Mexico. But he prefaced his dehumanizing language more broadly: “The U.S.,” he said, “has become a dumping ground for everybody else’s problems.” He was being perfectly clear, but many didn’t take it seriously. Soon after in The New York Times, Ross Douthat wrote, “There’s something that’s joyfully ridiculous about his candidacy.” In August, Maureen Dowd welcomed Trump into the race: “Sometimes you need a showman in the show.” Another Times writer, though, came to a different conclusion after Trump repeated his “dumping ground” line at a rally that month in Dallas: The problem with this particular clown is that his words are not clownish. The language he uses about immigrants is dehumanizing and vile. The audiences that adore him are animated not just by infatuation, but by the age-old catalysts of fear, resentment and hate. This is what moves the Trump effect into the realm of the frightening, rather than amusing or fascinating. That was years before “shithole countries.” Before the mass kidnapping of migrant children and the massacre of Latinos at Walmart in El Paso. Before the lies about immigrants eating cats and dogs, the killing of Temporary Protected Status, the massive use of feds and cops in renewed workplace raids. Before the regime started sending busloads and planeloads of migrants into gulags foreign and domestic, and the Supreme Court gave its blessing to wild abuses of power. Before Justice Sonia Sotomayor had to write, in dissent: “History is no stranger to such lawless regimes, but this Nation’s system of laws is designed to prevent, not enable, their rise.”(…)Mike Davis is gone. But you and I aren’t. All of us are lucky to still be alive in these times. We’ve been given the opportunity to live out our ideals, to fight for our values, to be the community and the people we always said we were.(…)” David in Friday HarborJune 11, 2025 at 11:56 amTerrific comment on a terrific post by Connor. Mike Davis saw this coming.H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people.The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?Reply↓AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Terrific comment on a terrific post by Connor. Mike Davis saw this coming. H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people. The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords? AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓ “TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?” May be you are right and itisthat simple. JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Great points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death. It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change… David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Jerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem. As all of what passes for entertainment in AmericaThe Cruelty is the Point. Terrific comment on a terrific post by Connor. Mike Davis saw this coming. H-1b and H-2b immigration were off the hook under Trump 1 and he deported far fewer migrants and refugees than did Strom Thurmond’s protegé Genocide Joe. Trump’s demonization of immigrants is simply more of his performative kicking down and class hatred toward working people. The man’s mother didn’t love him (through no fault of her own — she once asked if she had created a monster) and he must always play the bully until even Elon is groveling before him for forgiveness. TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords? AGJune 11, 2025 at 2:07 pm“TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?”May be you are right and itisthat simple.Reply↓ “TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?” May be you are right and itisthat simple. “TV sitcoms and reality shows are full of kicking down and cruelty presented as entertainment. Why should we expect better of our Billionaire Overlords?” May be you are right and itisthat simple. JonnyJamesJune 11, 2025 at 2:21 pmGreat points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death.It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change…Reply↓David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Great points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death. It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change… David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Jerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem. As all of what passes for entertainment in AmericaThe Cruelty is the Point. Great points AG and David. The end result: Cruelty as entertainment is now live-streamed from Palestine. And no one gives a toss about thousands of kids being blown to bits and/or starved to death. It’s a modern version of the Flavian Amphiteater. The myth of human progress…Plus ça change… David in Friday HarborJune 11, 2025 at 5:44 pmJerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem.As all of what passes for entertainment in AmericaThe Cruelty is the Point.Reply↓ Jerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem. As all of what passes for entertainment in AmericaThe Cruelty is the Point. Jerry Seinfeld is today a snidely vocal supporter of the Jabotinskyite fascist regime and their Gaza and West Bank genocide campaigns. Jerry wasn’t laughingwithKramer, George, Elaine, Newman, J. Peterman, or the Soup Nazi; he was laughingatthem. As all of what passes for entertainment in AmericaThe Cruelty is the Point. John SteinbachJune 11, 2025 at 12:12 pmShort anecdote: about 15 years ago a friend & I took 2 Zapotec Indians who were separated from their community of tomato pickers to reunite with them in the Southern Eastern Shore. When we arrived at an isolated rural compound, we were met by a heavily armed guard to mad us drop them off at the entrance.It was explained to us that recruiters would go to isolated Indigenous communities in Central Mexico where Spanish is the second language, and literally recruit the entire community. In arrival their passports were taken & they followed the Eastern seaboard from Florida to Maine, picking tomatoes as the season progressed. They were held a gunpoint & forced to purchase food & personal items at the “Company Store.” Their lack of Spanish & English made them easy to control.Reply↓ Short anecdote: about 15 years ago a friend & I took 2 Zapotec Indians who were separated from their community of tomato pickers to reunite with them in the Southern Eastern Shore. When we arrived at an isolated rural compound, we were met by a heavily armed guard to mad us drop them off at the entrance. It was explained to us that recruiters would go to isolated Indigenous communities in Central Mexico where Spanish is the second language, and literally recruit the entire community. In arrival their passports were taken & they followed the Eastern seaboard from Florida to Maine, picking tomatoes as the season progressed. They were held a gunpoint & forced to purchase food & personal items at the “Company Store.” Their lack of Spanish & English made them easy to control. Short anecdote: about 15 years ago a friend & I took 2 Zapotec Indians who were separated from their community of tomato pickers to reunite with them in the Southern Eastern Shore. When we arrived at an isolated rural compound, we were met by a heavily armed guard to mad us drop them off at the entrance. It was explained to us that recruiters would go to isolated Indigenous communities in Central Mexico where Spanish is the second language, and literally recruit the entire community. In arrival their passports were taken & they followed the Eastern seaboard from Florida to Maine, picking tomatoes as the season progressed. They were held a gunpoint & forced to purchase food & personal items at the “Company Store.” Their lack of Spanish & English made them easy to control. GulagJune 11, 2025 at 6:02 pmThe real threat to, and then defeat of, American workers took place from 70 to 120 years ago.First there was the scientific management movement, then the creation of the assembly line system after 1910.Beginning in the early 1930s, national industrial mobilization mandated collective bargaining legislation which introduced American workers to the growing federal administration of their lives. Passage of the Norris-LaGuardia Act, the National Industrial Recovery Act, the Wagner Act, the Public Contracts Act, and the Fair Standards Act made possible “rational” administration of labor’s hours, hiring, firing, compensation, and contract bargaining as set by federal bureaucratic rules, the large corporations, and increasingly corrupt national labor unions.Still later came the National War Labor Board, the Employment Act of 1946, and the Labor Management Relations or Taft-/Hartley Act of 1947.By 1948, one in three workers in the United States were affiliated with corporate-modeled, administratively “rational” unions as well as the spreading death of labor militancy.That anyone sees the SEIU of 2025 as some beacon for renewed labor militancy, or even as some kind of model for a new associational structure that should be duplicated, strikes me as a bad, bad joke.Reply↓ The real threat to, and then defeat of, American workers took place from 70 to 120 years ago. First there was the scientific management movement, then the creation of the assembly line system after 1910. Beginning in the early 1930s, national industrial mobilization mandated collective bargaining legislation which introduced American workers to the growing federal administration of their lives. Passage of the Norris-LaGuardia Act, the National Industrial Recovery Act, the Wagner Act, the Public Contracts Act, and the Fair Standards Act made possible “rational” administration of labor’s hours, hiring, firing, compensation, and contract bargaining as set by federal bureaucratic rules, the large corporations, and increasingly corrupt national labor unions. Still later came the National War Labor Board, the Employment Act of 1946, and the Labor Management Relations or Taft-/Hartley Act of 1947. By 1948, one in three workers in the United States were affiliated with corporate-modeled, administratively “rational” unions as well as the spreading death of labor militancy. That anyone sees the SEIU of 2025 as some beacon for renewed labor militancy, or even as some kind of model for a new associational structure that should be duplicated, strikes me as a bad, bad joke. The real threat to, and then defeat of, American workers took place from 70 to 120 years ago. First there was the scientific management movement, then the creation of the assembly line system after 1910. Beginning in the early 1930s, national industrial mobilization mandated collective bargaining legislation which introduced American workers to the growing federal administration of their lives. Passage of the Norris-LaGuardia Act, the National Industrial Recovery Act, the Wagner Act, the Public Contracts Act, and the Fair Standards Act made possible “rational” administration of labor’s hours, hiring, firing, compensation, and contract bargaining as set by federal bureaucratic rules, the large corporations, and increasingly corrupt national labor unions. Still later came the National War Labor Board, the Employment Act of 1946, and the Labor Management Relations or Taft-/Hartley Act of 1947. By 1948, one in three workers in the United States were affiliated with corporate-modeled, administratively “rational” unions as well as the spreading death of labor militancy. That anyone sees the SEIU of 2025 as some beacon for renewed labor militancy, or even as some kind of model for a new associational structure that should be duplicated, strikes me as a bad, bad joke. **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* **Tip Jar** **Search** **Recent Comments** karenincaon“You’ve Lost That Lovin’ Feeling”: Why Are Young Men Giving Up on Sex?My 17 year old niece (who was adopted... GulagonHow the ICE Raids and Crackdowns on Anti-Genocide Speech Are A Threat to All American WorkersThe real threat to, and then defeat of,... BugsonCoffee Break: Trump Deploys National Guard to LAThey're justifying it with the legal exception to... amfortas the hippieon“You’ve Lost That Lovin’ Feeling”: Why Are Young Men Giving Up on Sex?when our boys inevitably obtained smart fones...we kept... AGonLinks 6/11/2025indeed, back when they were funny!!! Didn´t know... **Topics** Africa(219) Australia(195) Auto industry(247) Banana republic(5,091) Banking industry(5,389) Brexit(355) CalPERS(355) Carbon credits(50) CEO compensation(284) China(1,246) Coffee Break(38) Commodities(692) Corporate governance(581) Credit cards(208) Credit markets(4,090) Curiousities(416) Currencies(1,202) Derivatives(744) Documents(7) Doomsday scenarios(3,927) Dubious statistics(1,484) ECONNED(104) Economic fundamentals(4,803) Energy markets(1,443) Environment(1,785) Europe(1,822) Federal Reserve(1,578) Free markets and their discontents(3,846) Garrulous insolence(118) Global warming(1,471) Globalization(2,283) Guest Post(16,908) Health care(1,613) Hedge funds(528) Income disparity(3,009) India(215) Infrastructure(335) Investment banks(769) Investment management(909) Investment outlook(1,102) Japan(261) Legal(3,188) Links(6,004) Macroeconomic policy(1,495) Market inefficiencies(443) Media appearances(78) Media watch(1,598) Middle East(697) Moral hazard(439) New McCarthyism(51) New York Magazine articles(4) New Zealand(83) Notices(710) OCC(17) Pandemic(1,068) Payment system(251) Permaculture(134) Politics(10,224) Private equity(864) Privatization(287) Real estate(1,787) Regulations and regulators(5,337) Ridiculously obvious scams(1,690) Risk and risk management(993) Russia(1,100) Science and the scientific method(543) Social policy(2,520) Social values(3,094) Species loss(128) Student loans(119) Summer rerun(54) Sunday morning Antidote movie(9) Surveillance state(385) Taxes(579) Technology and innovation(1,261) The destruction of the middle class(3,033) The dismal science(2,109) TPP(99) Turkey(62) Uber(64) UK(567) Water Cooler(2,646) **Blogroll** Alex Christoforou Alexander Mercouris Angry Bear Automatic Earth BIG, by Matt Stoller Bill Mitchell – billy blog Common Dreams Credit Slips Drop Site News Jomo Kwame Sundaram (Challenging Development) Matt Taibbi (Racket News) Michael Hudson Moon of Alabama OilPrice Rajiv Sethi (Imperfect Information) Richard Murphy (Funding the Future) System Update with Glenn Greenwald The City Thomas Neuburger (God’s Spies) Wolf Richter (WolfStreet) Yale Climate Connections Yanis Varoufakis"}