{"id": 2210, "name": "Gomer Blog", "domain": "gomerblog.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://gomerblog.com/2020/05/hospitals-forced-to-tap-their-strategic-reserves-of-breast-augmentation-supplies/#respond", "title": "Hospitals Forced To Tap Their Strategic Reserves Of Breast Augmentation Supplies", "content": "SpecialtiesEditor’s PicksAnesthesiologyEmergency MedicineFamily MedicineInternal MedicineNursingNursingNursing StudentOB-GYNPathologySurgeryMedical ResidentsMedical StudentsPediatricsPharmacyPsychiatryRadiologyRespiratory TherapyForums Editor’s Picks Anesthesiology Emergency Medicine Family Medicine Internal Medicine NursingNursingNursing Student Nursing Nursing Student OB-GYN Pathology Surgery Medical Residents Medical Students Pediatrics Pharmacy Psychiatry Radiology Respiratory Therapy Forums Editor’s Picks Anesthesiology Emergency Medicine Family Medicine Internal Medicine NursingNursingNursing Student Nursing Nursing Student Nursing Nursing Student OB-GYN Pathology Surgery Medical Residents Medical Students Pediatrics Pharmacy Psychiatry Radiology Respiratory Therapy Forums QuizzesQuiz: What Organ or Body Part Are YOU?CME: Do You Know the Laws of the House of God?What Character from Scrubs are You?CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me?CME: Are You Having a Pseudoseizure?USMLE Review Questions: Internal MedicineAre you invited to Nurse Patty’s pot luck? Quiz: What Organ or Body Part Are YOU? CME: Do You Know the Laws of the House of God? What Character from Scrubs are You? CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me? CME: Are You Having a Pseudoseizure? USMLE Review Questions: Internal Medicine Are you invited to Nurse Patty’s pot luck? Quiz: What Organ or Body Part Are YOU? CME: Do You Know the Laws of the House of God? What Character from Scrubs are You? CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me? CME: Are You Having a Pseudoseizure? USMLE Review Questions: Internal Medicine Are you invited to Nurse Patty’s pot luck? ContactContact GomerBlogAbout UsDisclaimerPrivacy Policy Contact GomerBlog About Us Disclaimer Privacy Policy Contact GomerBlog About Us Disclaimer Privacy Policy SpecialtiesEditor’s PicksAnesthesiologyEmergency MedicineFamily MedicineInternal MedicineNursingNursingNursing StudentOB-GYNPathologySurgeryMedical ResidentsMedical StudentsPediatricsPharmacyPsychiatryRadiologyRespiratory TherapyForums Editor’s Picks Anesthesiology Emergency Medicine Family Medicine Internal Medicine NursingNursingNursing Student Nursing Nursing Student OB-GYN Pathology Surgery Medical Residents Medical Students Pediatrics Pharmacy Psychiatry Radiology Respiratory Therapy Forums Editor’s Picks Anesthesiology Emergency Medicine Family Medicine Internal Medicine NursingNursingNursing Student Nursing Nursing Student Nursing Nursing Student OB-GYN Pathology Surgery Medical Residents Medical Students Pediatrics Pharmacy Psychiatry Radiology Respiratory Therapy Forums QuizzesQuiz: What Organ or Body Part Are YOU?CME: Do You Know the Laws of the House of God?What Character from Scrubs are You?CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me?CME: Are You Having a Pseudoseizure?USMLE Review Questions: Internal MedicineAre you invited to Nurse Patty’s pot luck? Quiz: What Organ or Body Part Are YOU? CME: Do You Know the Laws of the House of God? What Character from Scrubs are You? CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me? CME: Are You Having a Pseudoseizure? USMLE Review Questions: Internal Medicine Are you invited to Nurse Patty’s pot luck? Quiz: What Organ or Body Part Are YOU? CME: Do You Know the Laws of the House of God? What Character from Scrubs are You? CME: So I’m Reading Your Note, Can You Explain a Few Abbreviations to Me? CME: Are You Having a Pseudoseizure? USMLE Review Questions: Internal Medicine Are you invited to Nurse Patty’s pot luck? ContactContact GomerBlogAbout UsDisclaimerPrivacy Policy Contact GomerBlog About Us Disclaimer Privacy Policy Contact GomerBlog About Us Disclaimer Privacy Policy **Hospitals forced to tap their strategic reserves of breast augmentation supplies** For the past several weeks, the Covid 19 pandemic has had a devastating affect on the citizens of the entire world. No one has been more negatively impacted than our nations celebrities. Without access to much needed rhinoplasties, breast augmentations, liposuction, and facelifts, these grotesque celebrities have had to suffer through massive reductions in their monthly cosmetic routines. Procedures ranging from Brazilian butt-lifts to hyaluronic acid lip fillers have been delayed indefinitely forcing celebrities to live with their hideously average features. Sadly, botox injections have been delayed as well, forcing these disenfranchised stars to endure mild furrowing of their brows, crows feet and drooping eyelids. Many have resorted to unapproved home remedies such as DIY chemical peels and exfoliants. A spokesman for the Kardashians told reporters on Tuesday that this is a travesty of the highest order. As quarantine guidelines are relaxed across the country, bereft unsightly celebrities have been storming local cosmetic surgery centers at an alarming rate. LA, Hollywood, and Miami have been the hardest hit. These hideously average looking celebrities are demanding complete overhauls of their physical attributes. President Trump has declared a second state of emergency and is mandating that hospitals, dermatologists and cosmetic surgery centers send their extra supplies and personnel to these hot spots. A team of rapid response aestheticians is being mobilized and will be deployed to Los Angeles which has been the hardest hit area so far. Trained triage personnel will be able to quickly determine which individuals have the most urgently horrific physical deformities and which individuals have no hope of improvement. Sadly, these individuals will be left to wallow in their mediocrity. While the rest of the country starts to feel comfortable enough to doff their PPE, Celebrities must remain in full face cover so as to not create panic in the public. The public is advised that if they should come in contact with an unmasked celebrity, to not look directly at them as they may burn their retinas. **Mayim Bialik causes The American Society of Anesthesiologists to Quit and Rebrand** **Doctor’s Day Shortened to a “Heartfelt Doctor’s Minute” in Name of Efficiency** **Amazing! This surgeon thinks he can start a case at 3pm!** **Tinder Profiles By Specialty** **A Side-by-Side Look: COVID-19 Vaccines vs. Super Mario Invincibility Star** **‘Twas the Night Before Christmas: ‘Rona Version**"}