{"id": 1278, "name": "South Missourian News", "domain": "southmissouriannews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.southmissouriannews.com/joe-barnes-of-baldwin-wallace-university-named-to-2025-spring-academic-all-ohio-athletic-conference-team-2/", "title": "Joe Barnes Of Baldwin Wallace University Named To 2025 Spring Academic All Ohio Athletic Conference Team 2", "content": "Home News Sports Opinion Obituaries ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Login Contact Us Subscribe Login Home News Sports Opinion Obituaries ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Subscribe Login **Joe Barnes of Baldwin Wallace University named to 2025 Spring Academic All-Ohio Athletic Conference Team** June 9, 2025 Sports Login Sign Up Now OzSBI Client Conjure House Coffee to host soft opening at new location June Fee-Free Days on Mark Twain National Forest MU Extension offers online NRUP applicator training June 18 Missouri’s Mild Winter Sets the Stage for a ‘Perfect Storm’ of Summer Pests, Expert Warns. 2025 William Owens Fraley Memorial Scholarship was awarded to Amick Caleb Deshane named to Spring 2025 Chancellor’s List at UA Little Rock Encouraging reading through Happy McReaders Summer Program MU Extension to offer “Tech Tips for Disaster Preparedness” Samaritan’s Purse Operation Christmas Child welcomes Full Circle Speaker Yuri Lopez MDC Ozark Regional Office to host prescribed fire workshop **Other News** June 9, 2025 June 9, 2025 June 9, 2025 Home About Accessibility Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 South Missourian News, aCherryRoad MediaNewspaper. All rights reserved."}