{"id": 777, "name": "KRIS 6 News - Corpus Christi", "domain": "kristv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kristv.com/news/local-news/in-your-neighborhood/nueces-county/nueces-county-commissioners-pass-resolution-supporting-building-a-state-veterans-nursing-home-to-the-coastal-bend", "title": "Nueces County Commissioners Pass Resolution Supporting Building A State Veterans Nursing Home To The Coastal Bend", "content": "Menu NewsLocal News6 InvestigatesFacing DangerTexas NewsNational NewsWorld News Local News 6 Investigates Facing Danger Texas News National News World News Local News 6 Investigates Facing Danger Texas News National News World News KRIS 6 WeatherInteractive RadarHurricane CenterDaily ForecastHourly ForecastRadar and Forecast InformationWeather Cameras Interactive Radar Hurricane Center Daily Forecast Hourly Forecast Radar and Forecast Information Weather Cameras Interactive Radar Hurricane Center Daily Forecast Hourly Forecast Radar and Forecast Information Weather Cameras SportsHigh School SportsKRIS 6 SportsGame Night South TexasHooksIslandersJavelinasFNF on Facebook High School Sports KRIS 6 Sports Game Night South Texas Hooks Islanders Javelinas FNF on Facebook High School Sports KRIS 6 Sports Game Night South Texas Hooks Islanders Javelinas FNF on Facebook Troubleshooters Kitchen Cops Veterans in Focus Consumer Coastal Bend Weekend Buc Days Coastal Bend History EntertainmentOn KDFOn KRIS On KDF On KRIS On KDF On KRIS CommunityVeterans in FocusBreaking BarriersKRIS 6 AngelsAAPIHome ProsFlag for a FlagCoastal Bend Health Veterans in Focus Breaking Barriers KRIS 6 Angels AAPI Home Pros Flag for a Flag Coastal Bend Health Veterans in Focus Breaking Barriers KRIS 6 Angels AAPI Home Pros Flag for a Flag Coastal Bend Health About UsNews TeamAdvertise with KRIS CommunicationsOn KRISOn KDFThe CW South TexasJobsTelemundo Corpus ChristiKRIS 6 Apps News Team Advertise with KRIS Communications On KRIS On KDF The CW South Texas Jobs Telemundo Corpus Christi KRIS 6 Apps News Team Advertise with KRIS Communications On KRIS On KDF The CW South Texas Jobs Telemundo Corpus Christi KRIS 6 Apps Sign In Newsletters Sign Out Manage Emails Apps Careers Search Corpus Christi Nueces County San Patricio County Jim Wells County Kleberg County Bee County Refugio County Aransas County Kenedy County Brooks County Rockport Three Rivers George West Live Oak County **Actions** Facebook Tweet Email **Nueces Co. Commissioners pass resolution supporting building a State Veterans Nursing Home in the Coastal Bend** Veronica \"Ronnie\" Flores-Herrera is the Real-Time Desk Manager for KRIS 6 News, Action 10 News, and Telemundo C.C. The Emmy-nominated journalist has been covering news in the Coastal Bend since 1997. NUECES COUNTY, Tx — Plans to try to bring a Texas State Veterans Home to the Coastal Bend has taken its first step forward. As KRIS 6 reported Tuesday, Nueces County Commissioners were scheduled to vote on a resolution to support a Veterans' Nursing home in Robstown on Wednesday. Currently, the two closest State Veterans Homes are in McAllen and Floresville. Both are about a two-hour drive away from the Coastal Bend. The Texas Veterans Land Board runs the Texas State Veterans Homes Programs. They provide high-quality long-term care to qualified Texas veterans, their spouses, and Gold Star parents. According to the agenda, the item was placed on the agenda because the need for accessible and affordable long-term care options for aging and disabled veterans continues to grow in South Texas. The Veterans Administration would cover 65 percent of the construction costs, and the Texas Veterans Land Board would cover 35 percent. Nueces County would only have to provide 25 acres of property. The land offered doesn't have to be located within the county. The county must provide a location for the proposed home before an application can be submitted. \"We wanted to try to utilize the Robstown area because it's a hub for the other rural communities. You have Kleberg County, Jim Wells County, and San Patricio County. We want to make it accessible for every single veteran out there,\" Nueces County Director of Veterans and Social Services and Veterans Services Officer J.J. De La Cerda said. He told Commissioners that they thought building the home in Robstown could be an economic boost for the Robstown area. \"We're trying to use the Fairgrounds area. If there's any land, we'd like to build in that area if possible,\" De La Cerda said. He explained Nueces County is competing with San Antonio for this home. \"If we don't move on this now, we won't get a (state-funded veterans) nursing home for the next 10 to 15 years,\" De La Cerda said, \"We are a priority because we don't have access to a state-veterans nursing home within two hours of our location,\" De La Cerda said. The county would not have to fund the home. The application must be submitted by April 2026, but De La Cerda said the county should get ahead of that deadline. To do so, he needed to provide documentation stating local delegation supported bringing a state-funded veterans home to our area. Commissioner Brent Chesney agreed Robstown would be a good location, but he wanted six or eight proposed locations and more specific details to be presented to the court. In the end, the commissioners removed Robstown from the resolution since the land Nueces County offers the board doesn't have to be in our County. Soon after, the commissioners passed the resolution unanimously. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking News Newsletter.** **Flag for a Flag** **Flag for a Flag** News KRIS 6 Weather Sports Community News Team Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact KRIS6News kris6news KRIS6News"}