{"id": 1156, "name": "Realm of History", "domain": "realmofhistory.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.realmofhistory.com/2023/07/02/banquet-of-blood-abbasids-wipe-out-their-opponents-in-a-single-night-of-feasting-and-gore/", "title": "Banquet Of Blood Abbasids Wipe Out Their Opponents In A Single Night Of Feasting And Gore", "content": "Contact Us Submit a Tip About Us Facebook Twitter Pinterest Instagram **REALM OF HISTORY** **The Future Lies in the Past** **REALM OF HISTORY** **The Future Lies in the Past** HOME CULTURE MILITARY ARCHITECTURE MYTHOLOGY August 11, 2023|Powerful Types Of Warships From History: 7th Century BC – 17th Century AD August 11, 2023|The Epic of Gilgamesh Presented Through Animation and Songs July 28, 2023|Ancient Pompeii: History and Reconstruction July 27, 2023|The Short History of the Caribbean Pirates: Freedom and Slavery July 17, 2023|Ur: Reconstruction of the Remarkably Rich Ancient Sumerian City **Banquet of Blood: Abbasids Wiped Out Their Opponents in a Feast** Posted By:Dattatreya MandalJuly 2, 2023 **Introduction** From the other side of the silver screen, many of us gasped at the fictional atrocities committed at the unraveling event of theRed Weddingin theGame of Thrones(and in theSong of Ice and Fire). But as G.R.R Martin would be among the first to admit – many of his mind-concocted chapters are in fact inspired by real-life historical scenarios. And while we are not exactly sure about the inspiration for the Red Wedding, in terms of ‘real’ history, it was the Abbasids who brought upon the aptly named ‘Banquet of Blood’. As can be gathered from the moniker, this episode pertained to an especially damning yet calculative ploy that wiped out around 80 family members of the preceding ruling house of the Umayyads at one go – after they were invited to a royal feast at abu-Futrus, near Jaffa on June 22, 750 AD. **Contents** Introduction The Start Of An Empire The Brewing Chaos The Coming Of The Abbasids The Banquet Of Blood **The Start Of An Empire** The Umayyads took over the Islamic Caliphate by deposing the great and pious Caliph Ali in 657 AD, as a result of succession troubles that plagued the inheritors of Prophet Muhammed’s burgeoning realm. In fact, by doing so, their first Caliph Muawiya also inadvertently started out the very first Muslim dynasty. Suffice it to say, the rise of the Umayyad dynasty paralleled other important developments in the Islamic world, namely the transfer of the caliphate’s capital from holy Medina to the strategic Damascus (in present-day Syria). This symbolic change in turn had much deeper consequences, with the ruling class once again relying on the long-urbane population of the Levant Arabs (many of whom were stillChristians), as opposed to the loose tribal confederations of the ‘backwater’ of Arabia. Now while the gargantuan Islamic empire under a single banner stretched from Iran to Spain, the practicality of the Umayyad power base had always been confined toBilad al-Sham, a ‘metropolitan’ province (roughly corresponding to Syria) backed by theahl al-Sham, the elite Syrian army largely composed of Arabs. Consequently, Syria and Damascus became the center of attention and architecture for the ritzy Umayyad family members, who were already known for their extravagance and partiality to the Arabic ethnicity. Thus numerous mosques were constructed, and along with them sprang the contrastingdecadentside of the ruling class, with ritzy ‘desert palaces’ and ‘retiringmansions’ being incessantly built for the elite members. **The Brewing Chaos** Unfortunately, for the Umayyads, their focus on both ethnocentrism and extravagance backfired in the long run. Concerning the first point, Islam by this time had started to spread beyond the borders of traditional Arabia and the Levant, with the religion especially catching up among adherents on the eastern side of the burgeoning realm – with regions like Iran and Transoxania being conquered by the superbly successful Muslim armies. However, most of these newly converted Muslims (known asmawalis) – ranging from Persians, and Azeris to Turks, were considered second-class citizens within the empire, in spite of their advanced cultural legacy and norms. In essence, the Umayyads tended to favor the rights and (government) positions of the old Arab families based in the Levant, as opposed to the initially universalist concept of Islam. Such measures gradually transformed the caliphate from a religious institution to an expansive dynastic territory ruled by a hereditary ruling class composed of ethnic (and favored) Arabs. The other part of the predicament was related to the Umayyad obsession with their kingship over themulkor empire. So, while their ritzy measures took the form ofsplendid buildingsand opulent court lives within Syria, the Umayyads also had to face frequent conflicts and civil wars – including one that changed the entire branch of the ruling family from Sufyanid to the Marwanid. Such chaotic upheavals and inappropriate military endeavors started to chronically drain the Caliphate’s seemingly inexhaustible resources. **The Coming Of The Abbasids** Deriving their name from that of Abbas ibn Abd al-Muttalib, the uncle of the Prophet Muhammad, the Abbasids challenged the Umayyad rule by flaunting their lineage from the Hāshimite clan of the Quraysh tribe in Mecca. Ironically, while their claim pertained to a closer bloodline to Muhammad and thus related to being ‘purer’ Arabs in nature, the Abbasid propaganda started in the distant oasis city of Marv in northern Khorasan (located near today’s Mary in Turkmenistan) – which was far away from the regions of Syria and Arabia. In fact, the revolt was mainly supported by the Khurasani Arabs who had been living in distant Iran and Transoxania for almost a generation after the first Arab armies conquered the regions in the 7th century AD. Suffice it to say, the Abbasids also appealed to the non-Arab Muslims (ormawalis), especially the culturally advanced Persians, who had generally been sidelined by the ruling Umayyads when it came to core government and military positions. The opposition to the Umayyad rule culminated in a rebellion instigated by Ibrahim the Imam, who was fourth in descent from Abbas. And with the insurrections gaining momentum in the eastern parts of the Umayyad realm (along with Yemen), the scope quickly escalated into an open revolt under the leadership of the charismatic Abu Muslim, who was possible of Persian origin. Thus tens of thousands of followers, with some experienced soldiers in their midst, thronged to the Black Standard of the Abbasids – and their armies swept across the Umayyad lands from the east. After a string of victorious engagements, the war was carried forth into the plains of Iraq. And the outnumbered Abbasids finally delivered a momentous defeat on the opposing Umayyad forces at the Battle of Zab (in January of 750 AD), thus effectively claiming the caliphate for themselves. **The Banquet Of Blood** It was Abu al-‘Abbas as-Saffah, a descendant of al-ʿAbbās, who was proclaimed as the first Abbasid Caliph. And in spite of their initially peaceful claims, the Abbasids were not above bloodshed tactics when it came to political maneuvers. So after the rebels triumphantly stormed Damascus, as a result of their convincing victory at the decisive Battle of Zab, thousands were arrested and held in prisons on charges of subversion, while many of the Umayyad partisans were summarily executed in the coming months. The last Umayyad caliph Marwan II had already fled to Egypt, and he was also probably assassinated (or executed) shortly afterward. However, by the middle of 750 AD, there were still remnants of the Umayyad ruling family members residing in their strongholds around the Levant. But as proven by the Abbasid track record, moral scruples took a back seat when it came to consolidating power – and thus the plan for the ‘Banquet of Blood’ was hatched. Although not much is known about the exact machinations of this bloody event, it is generally believed that over 80 Umayyad family members were invited to a grand feast on the pretext of reconciliation. Given their desperate status and hope for fair surrendering terms, apparently, (almost) all of the inviteesceremoniouslymade their way to the Palestinian town of Abu-Futrus. But once the feasting and festivities were done, most of the princes were remorselessly clubbed to death by the Abbasid followers – thus eliminating the possibility of Umayyad’s return to caliphate power. Intriguingly enough, the Abbasids just about failed in their cold-blooded endeavor to completely wipe out the Umayyads, with a certain Rahman ibn Mu’awiya making his daring escapade all the way to distant Spain, where he declared himself as anindependent Umayyad governorin 756 with his capital established at the majestic city of Cordoba. But the “game of thrones” ended on a grisly note, with the largest land-based empire (up till then) being usurped almost overnight by a singular episode that involved both feasting and blood. Sources:San.Beck/History of Islam/IranicaOnline/Quatr Previous post Next post MYTHOLOGY **The Most Enigmatic Slavic Gods and Goddesses** MILITARY **The Roman Praetorian Guard: From Elite Units to Kingmakers** MILITARY **Battle of Thermopylae: 10 Misconceptions You Should Know** ARCHITECTURE **10 Tallest Architectural Triumphs From The Ancient World** **Leave a commentCancel reply** Your email address will not be published. Comment Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ August 11, 2023 **Powerful Types Of Warships From History: 7th Century BC – 17th Century AD** August 11, 2023 **The Epic of Gilgamesh Presented Through Animation and Songs** July 28, 2023 **Ancient Pompeii: History and Reconstruction** July 27, 2023 **The Short History of the Caribbean Pirates: Freedom and Slavery** July 17, 2023 **Ur: Reconstruction of the Remarkably Rich Ancient Sumerian City** July 17, 2023 **Ancient Mesopotamian Inventions You Should Know About** July 16, 2023 **Visual Reconstruction of 5 Roman Cities You Should Know About** July 14, 2023 **Mycenaeans: Origins and Military of the Bronze Age ‘Greeks’** July 12, 2023 **The Short History Of Soap – From Ancient Mesopotamia To Proctor & Gamble** July 10, 2023 **Incredible Ancient Egyptian Inventions You Should Know About** June 16, 2023 **12 Major Japanese Gods and Goddesses You Should Know About** September 7, 2015 **Workmanship Beyond Warfare: The Fascinating Case Of Scythian Gold Artifacts** November 13, 2015 **10 Tallest Architectural Triumphs From The Ancient World** November 25, 2015 **Vikings And Their Warfare: 10 Things You Should Know** February 24, 2016 **Assyrians: The ‘Ruthless’ Superpower of the Ancient World** April 14, 2016 **Hypatia: The Great Philosopher Who Was Also A Mathematician Extraordinaire** May 3, 2016 **The English Longbowman: 10 Things You Should Know** June 20, 2016 **Animation Showcases the Roman Maniple Army Formation ‘Triplex Acies’ in Action** September 8, 2016 **10 of the Greatest Ancient Warrior Cultures You Should Know About** November 11, 2016 **10 Roman Military Innovations You Should Know About** PRIVACY POLICY Contact Us REALMOFHISTORY(C)2023. ALL RIGHTS RESERVED."}