{"id": 620, "name": "Haaretz", "domain": "haaretz.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.haaretz.com/haaretz-explains/2023-10-19/ty-article-magazine/israels-dead-the-names-of-those-killed-in-hamas-massacres-and-the-israel-hamas-war/0000018b-325c-d450-a3af-7b5cf0210000", "title": "Israels Dead The Names Of Those Killed In Hamas Massacres And The Israel Hamas War", "content": "**Israel's Dead: The Names of Those Killed in Hamas Attacks, Massacres and the Israel-Hamas War** Approximately 1,200 Israelis, civilians and soldiers were killed in their homes, communities and in confronting Hamas terrorists. Here are the officially confirmed names of Israel's dead in the atrocities of October 7 and the subsequent Israel-Hamas war **In the News** **ICYMI** **Louis Theroux's New Film Captures the Mundanity of Israel's Extreme Settler Movement** **40% of Israelis Say They Consider Leaving the Country. This Is What Keeps Them Here** **How the Netanyahu Government's War on Gaza Is Killing Israel's Future** **What Would 'Victory' for Israel in Gaza Really Look Like?** **'Depopulation' and 'Kill Zone': Brutality Lexicon Exposes How Israelis Talk About the War** **Knesset Debate Reveals Not Everyone Thinks Starving Gazan Children Is a Bad Thing** Facebook Twitter Android Apple Email RSS Subscribe Newsletters Terms Contact Us My Cookies Advertise AccessibilityReport an issueAccessibility manifest Report an issue Accessibility manifest Report an issue Accessibility manifest Subscribe Contact us Terms and conditions Privacy policy Cancellation of digital subscriptions Editorial Newsletters Accessibility Advertise on Haaretz.com About Haaretz Jobs **News** Israel News U.S. News Middle East Jewish World World News Tech News Business **Life and Culture** Archaeology Life Science Sports Culture Books Travel in Israel Television Food Sports Converting to Judaism **Columnists and Opinion** Chemi Shalev Allison Kaplan Sommer Anshel Pfeffer David Rosenberg Opinion Haaretz Editorial Haaretz Cartoon Letters to the Editor Special Coverage **Haaretz Hebrew and TheMarker** וורדעל מדויקת רפיח מיליציה חמושה שמות החטופים אזרבייג'אן - ישראל סדרות מומלצות סרטים חדשים בקולנוע מפלס הכנרת יהודה משי זהב הסכתוס - פודקאסט לילדים **Partnerships** Haaretz Labels Home for Sale in Israel"}