{"id": 930, "name": "Mother Jones", "domain": "motherjones.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.motherjones.com/politics/2025/05/memorial-day-military-museums-air-shows-july-pentagon-vintage-aircraft-wwii-wwi-vietnam-korea-weapons-fatalities-american-heritage-collings-foundation/", "title": "Memorial Day Military Museums Air Shows July Pentagon Vintage Aircraft Wwii Wwi Vietnam Korea Weapons Fatalities American Heritage Collings Foundation", "content": "Share on Facebook Share on Twitter Share on Bluesky Email Comments Donate Donate Subscribe Trump ICE Agents Trump’s Tariffs LA Protests Newsletters Politics Environment Criminal Justice Guns Race Gender + Sexuality Food Podcast Video Magazine The Big Feature **Inside the Curious, and Dangerous, World of US Military Museums** **“These are not toys, they are weapons. And yet there’s no accountability.”** Jasper CravenMay 26, 2025 Tank demonstration weekend at the American Heritage Museum in Hudson, MassachusettsCourtesy American Heritage Museum Tank demonstration weekend at the American Heritage Museum in Hudson, MassachusettsCourtesy American Heritage Museum Share on Facebook Share on Twitter Share on Bluesky Email Comments It’s Memorial Dayweekend, and I’m hung over in the hull gunner of an M36 Jackson tank. This green, mean fighting machine once killed its fair share of Nazis. Decades later, its engine still roars with a fresh ferocity, though its cannon is a couple of firing pins short of battle-ready. That’s fine by me. I’m no soldier but a civilian, a queasy millennial tourist cosplaying as a member of the Greatest Generation. For a $195 “donation,” I’ve secured a 10-minute ride in this 29-ton piece of history. My driver is a retired Army tank engineer named Mike. He gamely answers questions about the Jackson’s history before playfully navigating me and a few other patrons around a large dirt track, spitting up soil and making the earth shake. I think briefly of the terrified young GIs who navigated foggy European fields in this creaky armored beast. Then I take out my phone, stick out my tongue, and take a selfie. Such is the appeal of the American Heritage Museum in Hudson, Massachusetts, where war is at once hallowed and frivolous, immediate and totally removed. Its 113 acres provide a gauzy window into a mythic patriotic past, when America won wars, built things, and was united. The museum’s uncanny environment is the work of the Collings Foundation, a well-heeled nonprofit that is among the world’s biggest private holders of military armaments. On a short, steep hill overlooking the tank track stands CEO Rob Collings Jr., a tall, fit man with a wide smile and a penchant for aviator glasses. In advance of my ride, he talks up his impressive roster of equipment, spanning America’s wars, good and bad. “World War II is kind of our Super Bowl,” he says. A few yards away, Alfred P. Consigli, a 100-year-oldveteranof General George S. Patton’s “Blackcat” tank battalion, regales a mostly male crowd with war stories, toggling between valiant D-Day dispatches and blunt admissions of the conflict’s heavy toll. His mother was so racked with worry during his deployment, Consigli says, that it killed her. Listening intently are two young guys in US World War II fatigues and a third in a Nazi SS uniform, yawning. There’s also museum volunteer Leo Orsi, whose Hawaiian shirt depicts a hulking tank relaxing on a beach. I ask Orsi what draws him to all this military hardware. “The difference between men and boys is the size of the toys,” he quips. After Consigli is done speaking, an announcer heralds him and his compatriots as brave destroyers of tyranny and concludes by paraphrasing Winston Churchill: “If we forget our history, we are doomed to repeat it.” A warm round of applause fills the air. There may be no stronger tool for romanticizing America’s war machine than museums like this one. Museums, after all, are among the nation’smost trustedinstitutions, research shows, for liberals and conservatives alike. As such, the Department of Defense has created, per its 2009reportto Congress on the topic, a stable of 93 military museums that at the time were costing taxpayers $94 million a year to operate. (Subsequent numbers were unavailable, and a 2014 lawexplicitly repealedthe military’s financial reporting requirements for military museums.) This soft propaganda network frames the military’s work valiantly and helps attract new troops—the 2009 report, for example, noted that the Museum of Aviation at Robins Air Force Base in Georgia is “consistently used as a successful tool” for recruiters. The brass also provides exceptional support—and vintage firepower—to hundreds of private military museums, many of them pet projects of the ultra-wealthy. Major collectors include a Microsoft co-founder, a member of the Walmart dynasty, and the founder of the Jelly Belly company, who tried (and failed) to modify one of his tanks to fire jelly beans. The Collings stockpile was amassed through the largesse of Rob’s father, Bob, who invented and manufactured the first standaloneelectronic cash register. The various museums purport to provide accurate depictions of war—yet even the most clear-eyed exhibits cannot begin to effectively capture the thrumming violence of conflict. “War museums are like cloud chambers in particle physics,” Yale University history professor Jay Winter, now emeritus, argued in apaper. “They represent the traces and trajectories of collisions that happened a long time ago. They never describe war; they only tell us about its footprints on the map of our lives.” They also tell us how their founders—and funders, including the US government—would have us remember our battles. Surprisingly weak federal oversight, meanwhile, has allowed museum operators, perhaps hoping to hew closer to a soldier’s lived experience, to revive static artifacts like the Jackson tank. Time and again, the military has failed to properly track demilitarized equipment once it moves beyond the wire and into civilian life. This permissiveness, as we will see, has had deadly consequences. But collateral damage to civilians may be part of the risk analysis, an acceptable cost of reputational management. Military museums, after all, elevate and abstract our nation’s weaponry, machines that rip skin and shatter bones, into things of beauty and gravitas and totems of state power. Just ask President Donald Trump, who, to celebrate his birthday next month, is planning agrand military paradeof the kind one sees in totalitarian states such as China, North Korea, and Russia—and which is estimated to cost taxpayers up to$45 million. The American Heritage Museum knows its living exhibits can be perilous, as evidenced by the hardcore liability waiver I was presented for my tank experience. Signing it was probably the closest I’ve come to military service. My commitment was 10 minutes, not four years, but still I was relinquishing my wellbeing to an institution with its own motives, pledging not to seek compensation, even via “negligent acts or omissions,” in the event of gruesome injury or death. One frustrated former military official I interviewed places the blame squarely on the Pentagon: “They put these things on an altar, like they’re sanctified,” he told me. “These are not toys, they are weapons. And yet there’s no accountability. That’s the bottom line.” America got intoWorld War II late, as filmmaker Ken Burns emphasizes in one of his myriad historicaldocumentaries, but our industrial sector ramped up at lightning speed. The United States ranked 39th in the world in military preparedness in 1939, owing largely to its antiquated reliance on cavalry. By the cessation of hostilities, however, it had produced nearly two-thirds of all military equipment for the Allied forces, including nearly 90,000 tanks, 300,000 planes, and 2 million trucks. William Knudsen, then president of General Motors, was commissioned directly as a lieutenant general and tasked with overseeing this massive endeavor. “We won,” he later asserted, “because we smothered the enemy in an avalanche of production, the like of which [the Nazis] had never seen nor dreamed possible.” When peace came, the War Department found itself drowning in$50 billion worthof excess gear. The brass responded by creating the Foreign Liquidation Commission and War Assets Administration, which auctioned off equipment to allied militaries and civilian scrappers at 10 surplus offices across the country. The tools of war didn’t always make sense for civilian spaces, but the military made a hard sell, marketing flamethrowers, for instance, to farmers for weed control. The Pentagon also funneled equipment down a third path: nonprofit military museums, apparently for no other reason than to help burnish and mythologize the image of America and its burgeoning military industrial complex. One early critic of this sort of effort was anarcho-pacifist Ernst Friedrich, who in 1925 set up an anti-war museum in Berlin featuring grotesque images of military violence. (The Nazis later destroyed his creation.) Yale historian Winter endorsed a similarly visceral approach, suggesting in his essay that “for every weapon on display there is an image or an object pointing to the injury or mayhem that weapon causes to the human body.” As heavy military gearpoured intoall 50 states, the museums took the opposite approach. Their general ethos “emphasizes technology rather than the context in which the objects were used,” notes anarticlein theJournal of Conservation and Museum Studies. Consider the National WWII Museum in New Orleans, which emphasizes America’s “arsenal of democracy,” including warplanes and an operational Sherman tank. One of the most popular artifacts at the New York State Military Museum and Veterans Research Center is a World War II-era Jeep that visitors are invited to touch. “It’s an opportunity to make a physical connection with a part of American military history,” explained Richard Goldenberg, a retired colonel of the New York Army National Guard. The Jeep, he told me, represents America’s lineage and legacy of service: “It carries a sort of weight and emotional impact.” The Jeep, of course, is relatively harmless, unlike some items with which the public is allowed to interact. In July 1972, Democratic Sen. John McClellan of Arkansas delved into the Pentagon’s offloading of surplus equipment. He found “inexcusable” evidence that automatic weapons, missiles, and sensitive military technology had been sold to questionable figures, including weapons traffickers representing countries “whose national policies may not be in accord with our own.” The Pentagon, in response,pledgedto improve its transfer processes. Tanks on display at the American Heritage MuseumAmerican Heritage Museum The Collings Foundationwas born seven years later. Founder Bob Collings lived a relatively frugal life and had little taste for conventional luxury. Despite his wealth, the family lived in a modest house on the outskirts of Stow, Massachusetts, and he ran his company out of an old discount store in a shopping plaza. “We are not high‐living,” he told theNew York Timesin 1977. “We are not big on status symbols.” But Collingswasbig on machines and military history—interests for which he spared no expense. He’d moved to Stow in part because of its proximity to the Revolutionary War battlefields of Lexington and Concord. Not long after, he purchased a 44,000-foot hangar at a nearby airfield and made it his mission to stuff it with as much military equipment as the building could handle. Some pieces came directly from the Pentagon, others via far-flung sources. In 1986, CollingstoldtheHartford Courantthat he’d recently bought a B-24 bomber from an Englishman who’d acquired it from the Indian army. He also indicated that he’d salvaged planes the military had abandoned in the Arizona desert and entered into delicate negotiations with the Chinese government for US planes they’d used to fight the Japanese in World War II. The Jackson tank I rode in, driver Mike told me, was once owned by the Czechoslovakian government. In a written statement, Bob’s son, Rob Collings Jr., said, “We have no artifacts from China and never have.” He said the Collings Foundation had acquired the Jackson tank “from another museum who acquired it from yet another museum, and we were not part of its importation.” He insisted that all the foundation’s pieces had secured the proper government approvals. After the Cold War, the Pentagon again ramped up its offloading of surplus inventory, even as Congress slashed funding for that endeavor, reducing the number of oversight personnel by more than half. Amid the funding contraction, in 1993, Essam al-Ridi, an Egyptian associate of then-obscure al-Qaeda leader Osama bin Laden,purchased a training jetfrom an Air Force boneyard in Tucson, Arizona, for about $200,000. Its whereabouts remain unknown. Because most surplus military gear is damaged or in some way demilitarized, civilian rehab efforts have fallen to amateur mechanics like Steve Preston, a gearhead who, along with a fellow weapons enthusiast, was killed in a 2015freak accidentwhile attempting to fire a round from his 1944 Buick “Hellcat” tank. (He’d purchased it for $60,000,he toldtheWall Street Journalthat year, and had been donating tank rides for school and hospital fundraisers.) Another prominent fixer is “Dangerous” Bob Bigando, a former sheriff’s deputy and pyrotechnics expert who lost half a finger to a heavy machine gun in 2004. Among other projects, Bigando has helped revive an M60 tank with a fully functional cannon andmounteda six-barreled, Gatling-style Vulcan cannon on a Toyota Prius owned by theBlack Rifle Coffee Company. In 2007, according to the military news outletTask & Purposeand court documents, hewas indictedon federal charges of transporting illegal explosives, including 4 tons of an artillery propellant, to “unlicensed” buyers. A plea agreement reduced the charges to misdemeanors involving possession of the materials and temporarily curtailed Bigando’s right to bear arms, but he was deemed in violation the following year, after agents from the Department of Alcohol, Tobacco, Firearms, and Explosives caught him with an unlicensed howitzer he hoped to refurbish. (The howitzer was later returned to him, he toldTask & Purpose. Bigando did not respond to requests for comment.) Collings restored his own museum pieces himself with the assistance of knowledgeable veterans, such as former B-24 pilot Roland Stumpff, who in 1986 told aHartford Courantreporterthat the Collings planes “still smell the same and they still vibrate and rattle the same.” The Pentagon aided in the museum’s repair efforts, providing replacement parts, while the ATF granted the Collings Foundation alicenseto manufacture destructive devices legally. In 1996, a jointinvestigationby60 MinutesandUS News and World Reportbrought scrutiny upon the mechanics and scrap dealers “dumpster diving” for parts that weren’t properly demilitarized: “You can build yourself an army out of this stuff that’s miscoded,” a Pentagon investigator warned. The investigation showed that the military not only sold dangerous equipment, but also failed to monitor its whereabouts—in one case, an Air Force surplus office in Georgia lost track of $39 million worth of materiel. Foreign governments such as China, Iraq, and Iran took advantage of the weak oversight, as did backwoods operators like Montana helicopter mechanicRon Garlick, who used spare parts to build complex weapons systems, including a Cobra attack helicopter. “Mine was fully armed,” he boasted to a reporter. “I had rockets on it and machine guns. I was out there shooting coyotes with them.” The exposé prompted Sen. Chuck Grassley (R-Iowa) to revisit McClellan’s earlier hearings, and, in 1999, relitigate the issue during an appropriationsdebate. “Nothing has really changed,” he concluded, except that the equipment was now available via the internet. “Some of Saddam Hussein’s henchmen,” Grassley warned, “could be browsing this homepage, looking for spare parts or new weapons.” The Army vowed to improve its demilitarization processes, but created only one new position to do it. A bill calling for aggressive inspections and seizures of improperly demilitarized gear died amid fierce opposition from veterans groups, weapons enthusiasts, and the Aircraft Owners and Pilots Association. Garlickgot to keephis Cobra, which he rented to the TV showPensacola: Wings of Gold. (Garlick did not respond to a request for comment.) In the ensuing decades, federal watchdogs have issued a slew of reports on demilitarization lapses, including a 2006 analysis that said military museums writ large represented the most significant source of improper equipment “leakage” into the world. The surplus program, the reports note again and again, is plagued by confusing and inaccurate demilitarization codes, poor funding, and overlapping jurisdictions—problems that are likely to be exacerbated by the Trump administration’s budget cuts. The military museum network itself may be spared, however. While the White House moved to gut the Institute of Museum and Library Services, most military museums appear to fall under the purview of the Pentagon, which has faced relatively little budgetary scrutiny, despite being the largest—andmost famously inept—federal agency. Although the Pentagon did not respond to questions for this story, Defense Secretary Pete Hegseth has previously expressed support for military museums as a bulwark against supposed left-wing efforts to erase history. In April 2022, as a weekend anchor forFox & Friends,Hegseth venturedto the National Infantry Museum at Fort Benning, Georgia. Cameras rolling, he walked excitedly around an exhibit, pointing to a helicopter from Vietnam, a Bradley Fighting Vehicle from Iraq, and more. He hyped the museum as “incredibly accurate” and “larger than life.” His report concluded with a sales pitch: “It’s free of charge, it’s outside the post, it’s only an hour south of Atlanta.” As I completed my first bumpy loop in the Jackson tank, I spotted the American Heritage Museum’s heavy equipment garage and what appeared to be a shrink-wrapped fighter jet just outside. Air shows are a particularly lucrative revenue stream for military museums, with an estimated annual attendance of 10 to 12 million. These were once strictly spectator events, but the American Heritage Museum sought to offer its attendees a more visceral experience. The dangers were clear enough. In June 1993, a Collings pilot had crashed a World War II-era Douglas A-26 Invader in Kankakee, Illinois. (No one was hurt or killed in the crash, which was attributed toengine failure.) Three years later, the foundation securedits first waiverunder the Federal Aviation Administration’s fledgling Living History Flight Experience program to fly historic planes carrying members of the public. One of the two greenlit planes was the B-17 Flying Fortress, which dropped more Allied bombs during World War II than any other warbird. Collings then began pressing the military to give him an F-4 Phantom fighter jet. The Pentagon’s inspector general raisedurgent concerns, noting that a number of decommissioned jets had crashed in recent years, leaving dozens of people dead and injured. There were other red flags. For one, the Collings Foundation was not on the Air Force’s list of approved military museums. But Collings had connections. In 1998, Congress specifically granted the Air Force secretary authority to give the F-4 to his foundation, so long as it was incapable of firing munitions. Internal correspondence obtained byMother Jonesreveals that some Air Force officials were unsure how to proceed because there was “no regulatory guidance on ‘flyable demil.’” Others griped over the cost of the transfer, and Air Force lawyers were “reluctant from the beginning to put an aircraft out in the public due to concerns, if someone got hurt, there was no one to sue.” Compounding the concerns were indications that Collings wanted to fly the F-4 without ejection seats. He also pushed for swift delivery. “If Mr. Collings is pressuring [the government] based on his marketing and advertising commitments tell him to call me and I’ll deal with it,” one Air Force official replied to a colleague who’d indicated that he was under the gun to meet Collings’ delivery deadline for an air show. Rob Collings said his father had “no recollection” of this air show. He added that “we have always had ejection seats” and stressed that the process involved “no cost to the government,” as the foundation fully reimbursed the Pentagon for the plane’s regeneration. In Collings’ court was retired Brigadier GeneralStephen Ritchie, a decorated Vietnam War fighter pilot who later helped lead the Air Force’s recruitment efforts. At one point, Ritchie attempted to quell his colleagues’ concerns, writing to a fellow general on Collings letterhead that the F-4 would have “a very positive impact…given the need to recruit high caliber personnel into the Air Force.” Collingshad pledgedto use the jet in shows to commemorate the 50th anniversary of the Air Force and to memorialize Vietnam veterans. The foundation has since launched other explicitly pro-militaryexhibitsand events. In 2012, it would partner with theBoy Scoutson a program in which scouts helped restore armored vehicles and educated the public about their importance in military history. By the fall of 1999, Collings had the F-4 in hand. The next year, he struck asimilar dealwith the Navy and was deeded—thanks to another snippet of legislation—a McDonnell Douglas TA-4J Skyhawk, which the FAA ultimately blessed to fly. Collings continued pushing the FAA, mostly successfully, to exempt his foundation from regulations. In 2005, he got the green light to fly the old planes in reduced visibility conditions, in congested airways, and over more densely populated areas than federal standards typically allow. The agency also kept adding new flyable aircraft, 10 in all, to the Collings roster. Only once did the FAA, in 2011, give the foundation a hard no—in response to its campaign to let civilian passengers “manipulate the controls” of vintage warbirds during aerial maneuvers. Rob Collings, Bob’s son and CEO of the foundation, said that the Living History flights previously had allowed this activity and that “an appropriately rated pilot” would always be “in actual command of the aircraft.” Frustrated by the rejection, Rob Collings sent a message to the museum’s supporters asking them to deluge the government with letters and lamenting the “FAA and Department of Defensehostility.” As the Collings Foundation’sair fleet grew, so too did its ground arsenal. In 2013, itsecured, for free, 240 pieces of military equipment with an estimated value exceeding $38 million. The cache had belonged to Jacques Littlefield, an eccentric Silicon Valley engineer and scion of the construction family that built the Hoover Dam. Littlefield, whodied in 2009, was a pugnacious libertarian and member of the exclusive Bohemian Club, which has had many military commanders on its rolls. He was a reliable supporter of Republican political candidates, and his military hardware collection included pieces of both legitimate and illicit provenance. A 1994 shipping invoice shows that the Army sent him an M60 combat tank via railcar from its clearinghouse. He also secured a fully functionalGerman Panzer V Pantherfrom Poland. (Documents indicate that the Polish government requested FBI “assistance” with the tank around 2014, and the case was closed.) In the mid-1990s, Littlefield secured four other fully functioning combat vehicles, including an anti-tank personnel carrier with a missile launcher and a Sheridan tank. Unbeknownst to him, they’d allbeen stolenfrom Fort McCoy in Wisconsin. In 1996, FBI Agent Ted Warsky told theChicago Tribunethat the government had accounted for the $13 million in purloined equipment, but only one-third of it had been returned to the base. Thestolen Sheridanand thePolish Pantherultimately ended up in the Collings collection. “As you say, the FBI case was closed on the Panther,” Rob Collings said. “I have no knowledge of the Sheridan being ‘stolen.’” The McCoy carrier and its missile launcher were sold for $92,000 to a private bidder at a 2014Sotheby’s auction. That same year, a state-run military museum in California wasshut downafter an audit found that several key artifacts had disappeared, including “a Vietnam War-era helicopter, a couple of machine guns, and a Russian howitzer.” A similar phenomenon was playing out with smaller arms. According to anAssociated Press investigation, at least 1,900 US military firearms were lost or stolen during the 2010s. Some were later used in violent crimes. There have only been a few known instances of people rampaging with heavy military equipment. In 1974, an Army private stole a Bell UH-1B “Huey” Vietnam War-era helicopter and landed it on the South Lawn of the White House before he was wounded and taken into custody. In 1995, a mentally ill Army veteran stole a tank from a National Guard armory and tore through San Diego, crushing cars but killing no one. Far more common are injuries and deaths stemming from malfunctions or misuse of surplus equipment. The last decade or so has seen a string of accidents, including at leasttwofatalplane crashes last year. In 2015, the same year tinkerer Steve Preston and his colleague died in their Hellcat mishap, the husband of Jelly Belly’s CEOaccidentally crusheda man to death while driving one of their World War II-era tanks during a family reunion. In 2019, amateur pilot Joseph Masessa, a New Jersey dermatologist,diedwhen he crashed his Grumman OV-1 Mohawk at a Florida air show. But the worst accident that year involved the Collings Flying Fortress. On a chilly morningin October 2019, the American Heritage Museum’s annual 110-city Wings of Freedom tour landed at Bradley International Airport in Windsor Locks, Connecticut. By then, the museum had been taking passengers aloft for more than two decades. The main attraction was the Flying Fortress flown by Ernest “Mac” McCauley, considered the country’s most experienced B-17 pilot. He welcomed 10 passengers that day aboard the clunky plane, which had malfunctioned during previous flights and had, it turned out, spark plug issues and engine damage. McCauley struggled at first to get the plane off the ground, as the fourth engine wouldn’t start. “It’s nothing to worry about,” his co-pilot assured passengers, according to a since-settled lawsuit; this was “normal” under humid and wet conditions. Their pilot was a pro, after all, having logged more than 7,000 hours on this vintage craft. After about 40 minutes, McCauley finally got the B-17 purring. It revved down the runway, reaching for the sky. After the warbird was aloft, as detailed in a post-crashreportfrom the National Transportation Safety Board (NTSB), the “loadmaster”—the crew member who ensures the safe distribution of weight on an aircraft—let the passengers know they were free to get up and move around. Soon after, with the plane about 600 feet off the ground, one of the pilots alerted air traffic control that they were turning back to the airport “because of a rough magneto,” a generator that ensures proper firing of the spark plugs. The approach controller asked whether the pilot needed assistance. “Negative,” he replied. Upon realizing that the plane was no longer ascending, McCauley ordered his co-pilot to extend the landing gear, and the loadmaster went to tell the passengers to sit down and strap in. When the loadmaster returned to the cockpit, McCauley announced that the plane’s No. 4 engine was losing power. He then shut down that engine and feathered the propeller blades—turning the narrow edges into the wind to minimize drag. The B-17 came in toward the airport on a rightward tilt. It hit the approach lights 1,000 feet short of the runway and the ground 500 feet later. Veering onto the edge of the runway and then off to the right, it collided with vehicles and a de-icing tank before finally coming to a stop. “A postcrash fire ensued,” the report notes. The pilot, co-pilot, and five passengers were killed. The NTSB report pins much of the blame on pilot error but details a litany of contributing factors, including maintenance and training failures and “ineffective” oversight. It points out that the safety inspector the FAA deputized to oversee Collings had never conducted inspections, serving only as a point of contact for regulatory questions—and that when the inspector died in 2017, he was never replaced. The Collings Foundation expressed condolences to the families. Aweek later, it launched a campaign to pressure the FAA to let it keep its planes in the air. “We need to let federal agencies know that the [Living History] program is important to you and other American citizens as an educational tool,” Rob Collings wrote to supporters. It wasn’t enough. On March 25, 2020, the FAA revoked foundation’s ability to operate Living History flights. Collings is still accredited to train pilots on a pair of historic planes, even though, in September 2023, a “highly experienced pilot in a WWI aircraft” crashed the single-engine plane in Stow, near the American Heritage Museum. (No one was hurt.) In 2021, the Department of Transportation pledged “enhanced oversightof the Living History Flight Experience.” Almost exactly a year later, a different B-17 permitted under the program collided with another historic military aircraft at a Dallas air show, killingsix people.Both planes belonged to the Commemorative Air Force (formerly Confederate Air Force), anothermajor operatorof military museums with itsowncheckeredsafetyrecord. Earlier in 2022, another Huey helicopter—the same machine used in the filmsBaywatch,Die Hard, andThe Rock—hadcrashedduring a tourist flight in West Virginia, killing all six aboard. Aircraft inside the Collings Foundation's hangarDavid L. Ryan/The Boston Globe/Getty The planes thatflew in the Wings of Freedom tour are now on static display in the American Heritage Museum’s massive hangar. After my tank ride, I walk over to visit the old warbirds, stuffed between revisionist exhibits on the Vietnam War and 9/11. Afterward, in the gift shop, I strike up a conversation with Nolan and Owen, two 16-year-olds decked out in Army fatigues. They’d spent their day re-enacting a World War II battle as members of the 101st Airborne. And they had taken a spin in a Sherman tank. The boys told me their interest in re-enactments is motivated by a reverence for military service and because the cosplay evokes the mock battles they staged in their backyards as young kids—only, as Nolan notes, “with actual equipment and a bunch of older guys.” The romanticized and sanitized version of World War II that resonates with Nolan and Owen doesn’t translate to America’s more recent conflicts. “Nothing that we’re doing today is worth dying for, like World War II,” Nolan says. “Bombing a random village in Africa is not worth dying for.” Owen nods. He’s familiar with “realities of war,” like the veteran mental health crisis, he says. Still, he’s assembling a modern war re-enactmentkitwith period-appropriate fatigues and equipment. Nolan makes the case that very few post-9/11 battles are worth re-creating, thanks to their moral murkiness and the rise of drone warfare. “It’s less humane in some ways,” he says. “It feels like a war crime a little bit.” Hearing them talk makes me wonder whether Collings’ American Heritage Museum or some other military museum might one day get its hands on our current fleet of war machines—perhaps a fully functional MQ-9 Reaper drone. The thought sends a shiver down my spine. But I don’t deny that I’d donate $195 to fly one. Jasper Craven is a co-author of the 2022 bookOur Veterans: Winners, Losers, Friends, and Enemies on the New Terrain of Veterans Affairsand author of the upcoming titleGod Forgives, Brothers Don’t, to be published by Simon & Schuster in early 2026. **Looking for news you can trust?** Subscribe to theMother Jones Dailyto have our top stories delivered directly to your inbox. By signing up, you agree to ourprivacy policyandterms of use, and to receive messages fromMother Jonesand our partners. **BEFORE YOU CLICK AWAY!** “Lying.” “Disgusting.” “Scum.” “Slime.” “Corrupt.” “Enemy of the people.” Donald Trump has always made clear what he thinks of journalists.And it’s plain now that his administration intends to do everything it can to stop journalists from reporting things they don’t like—which is most things that are true. No one gets to tellMother Joneswhat to publish or not publish, becauseno one owns our fiercely independent newsroom. But that also means we need to directly raise the resources it takes to keep our journalism alive. There’s only one way for that to happen, and it’s readers like you stepping up.Please help with a donation today if you can—even a few bucks will make a real difference. A monthly gift would be incredible. **BEFORE YOU CLICK AWAY!** “Lying.” “Disgusting.” “Scum.” “Slime.” “Corrupt.” “Enemy of the people.” Donald Trump has always made clear what he thinks of journalists.And it’s plain now that his administration intends to do everything it can to stop journalists from reporting things they don’t like—which is most things that are true. No one gets to tellMother Joneswhat to publish or not publish, becauseno one owns our fiercely independent newsroom. But that also means we need to directly raise the resources it takes to keep our journalism alive. There’s only one way for that to happen, and it’s readers like you stepping up.Please help with a donation today if you can—even a few bucks will make a real difference. A monthly gift would be incredible. **Related** “Pure Ignorance”: Veterans Slam Trump’s Trans Military BanHenry Carnell **“Pure Ignorance”: Veterans Slam Trump’s Trans Military Ban** Henry Carnell **“Pure Ignorance”: Veterans Slam Trump’s Trans Military Ban** Henry Carnell **“Pure Ignorance”: Veterans Slam Trump’s Trans Military Ban** Henry Carnell Trump’s Defense Secretary Pick Hopes for a Christian CrusadeKiera Butler **Trump’s Defense Secretary Pick Hopes for a Christian Crusade** Kiera Butler **Trump’s Defense Secretary Pick Hopes for a Christian Crusade** Kiera Butler **Trump’s Defense Secretary Pick Hopes for a Christian Crusade** Kiera Butler From Eggs to Explosives: The Pentagon’s Long Shopping ListDave Gilson **From Eggs to Explosives: The Pentagon’s Long Shopping List** Dave Gilson **From Eggs to Explosives: The Pentagon’s Long Shopping List** Dave Gilson **From Eggs to Explosives: The Pentagon’s Long Shopping List** Dave Gilson For Those About to Salute, We Rock YouDave Gilson **For Those About to Salute, We Rock You** Dave Gilson **For Those About to Salute, We Rock You** Dave Gilson **For Those About to Salute, We Rock You** Dave Gilson **We Recommend** Trump’s Washington Is a Technofascist Fantasy—With or Without MuskTim Murphy **Trump’s Washington Is a Technofascist Fantasy—With or Without Musk** Tim Murphy **Trump’s Washington Is a Technofascist Fantasy—With or Without Musk** Tim Murphy **Trump’s Washington Is a Technofascist Fantasy—With or Without Musk** Tim Murphy Newsom Lays Bare Trump’s Authoritarian ThreatArianna Coghill **Newsom Lays Bare Trump’s Authoritarian Threat** Arianna Coghill **Newsom Lays Bare Trump’s Authoritarian Threat** Arianna Coghill **Newsom Lays Bare Trump’s Authoritarian Threat** Arianna Coghill RFK Jr. Fires the CDC Vaccine Experts—and the Anti-Vaxxers RejoiceKiera Butler **RFK Jr. Fires the CDC Vaccine Experts—and the Anti-Vaxxers Rejoice** Kiera Butler **RFK Jr. Fires the CDC Vaccine Experts—and the Anti-Vaxxers Rejoice** Kiera Butler **RFK Jr. Fires the CDC Vaccine Experts—and the Anti-Vaxxers Rejoice** Kiera Butler Will Trump Force America to Break Up?Bill McKibben **Will Trump Force America to Break Up?** Bill McKibben **Will Trump Force America to Break Up?** Bill McKibben **Will Trump Force America to Break Up?** Bill McKibben **Latest** What SCOTUS Actually Said About Workplace Fairness in This Year’s Big “Reverse Discrimination” CaseAbby Vesoulis **What SCOTUS Actually Said About Workplace Fairness in This Year’s Big “Reverse Discrimination” Case** Abby Vesoulis **What SCOTUS Actually Said About Workplace Fairness in This Year’s Big “Reverse Discrimination” Case** Abby Vesoulis **What SCOTUS Actually Said About Workplace Fairness in This Year’s Big “Reverse Discrimination” Case** Abby Vesoulis I’m a Farmer Who Voted for Trump. His Tariffs Are Stressing Me Out.Reveal **I’m a Farmer Who Voted for Trump. His Tariffs Are Stressing Me Out.** Reveal **I’m a Farmer Who Voted for Trump. His Tariffs Are Stressing Me Out.** Reveal **I’m a Farmer Who Voted for Trump. His Tariffs Are Stressing Me Out.** Reveal Trump’s “Big Beautiful” Energy Plan Will Burn Your WalletNaveena Sadasivam **Trump’s “Big Beautiful” Energy Plan Will Burn Your Wallet** Naveena Sadasivam **Trump’s “Big Beautiful” Energy Plan Will Burn Your Wallet** Naveena Sadasivam **Trump’s “Big Beautiful” Energy Plan Will Burn Your Wallet** Naveena Sadasivam Rep. Sarah McBride on GOP Attacks: “They’re Employing the Strategies of Reality TV.”Julianne McShane **Rep. Sarah McBride on GOP Attacks: “They’re Employing the Strategies of Reality TV.”** Julianne McShane **Rep. Sarah McBride on GOP Attacks: “They’re Employing the Strategies of Reality TV.”** Julianne McShane **Rep. Sarah McBride on GOP Attacks: “They’re Employing the Strategies of Reality TV.”** Julianne McShane **Sign up for our free newsletter** Subscribe to theMother Jones Dailyto have our top stories delivered directly to your inbox. By signing up, you agree to ourprivacy policyandterms of use, and to receive messages fromMother Jonesand our partners. **Get our award-winning magazine** Save big on a full year of investigations, ideas, and insights. **Support our journalism** HelpMother Jones' reporters dig deep with a tax-deductible donation. **Mag Promo** **Independent. In print. In your mailbox.** Inexpensive, too! Subscribe today and get a full year ofMother Jonesfor just $19.95. **Bold. Brave. Beautiful.** Award-winning photojournalism.Stunning video. Fearless conversations. **Looking for news you can trust?** Subscribe to theMother Jones Dailyto have our top stories delivered directly to your inbox. By signing up, you agree to ourprivacy policyandterms of use, and to receive messages fromMother Jonesand our partners. About Our Staff DEI&B Financials Careers Freelance Guidelines Contact Us Support Ways to Give Advertise With Us Licensing / Reprints Store Subscribe Magazine Subscriptions Give a Gift Subscription Email Newsletters Customer Service This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply.Privacy Manager Copyright © 2025 Mother Jones and the Center for Investigative Reporting. All Rights Reserved.Terms of ServicePrivacy Policy Terms of Service Privacy Policy Terms of Service Privacy Policy **We Noticed You Have An Ad Blocker On.** Can you pitch in a few bucks to help fundMother Jones'investigative journalism? We're a nonprofit (so it's tax-deductible), and reader support makes up about two-thirds of our budget. We noticed you have an ad blocker on.Can you pitch in a few bucks to help fundMother Jones'investigative journalism? We’re a nonprofit newsroom, because the truth-telling investigations we’re known for don’t happen under corporate ownership. We shine a bright light into the dark corners of power and report the facts other media are afraid to touch. The essential ingredient that makes this possible? Readers like you. Please stand withMother Jonesand make a donation today. These are dangerous times, and we’ve got a lot of hard, consequential work to do. But we can’t do it without reader support. We’re a nonprofit newsroom, because the truth-telling investigations we’re known for don’t happen under corporate ownership. We shine a bright light into the dark corners of power and report the facts other media are afraid to touch. The essential ingredient that makes this possible? Readers like you. Please stand withMother Jonesand make a donation today. These are dangerous times, and we’ve got a lot of hard, consequential work to do. But we can’t do it without reader support. **Don't let an algorithm decide what news you see.** Sign up for the freeMother Jones Dailynewsletter and follow the news that matters."}