{"id": 2215, "name": "Neutral Ground News", "domain": "neutralgroundnews.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://neutralgroundnews.com/sewerage-water-board-hires-new-executive-director-after-rigorous-process-of-asking-who-was-still-willing-to-take-the-job/", "title": "Sewerage Water Board Hires New Executive Director After Rigorous Process Of Asking Who Was Still Willing To Take The Job", "content": "About Alerts Archives Press Releases Facebook Instagram Pinterest YouTube Twitter About Advice Business Entertainment LagniappeGamesGulf Coast GuardianNOLA StoryNOLA CrosswordNOLA Word SearchNGN Junk ShopPress Releases GamesGulf Coast GuardianNOLA StoryNOLA CrosswordNOLA Word Search Gulf Coast Guardian NOLA Story NOLA Crossword NOLA Word Search NGN Junk Shop Press Releases GamesGulf Coast GuardianNOLA StoryNOLA CrosswordNOLA Word Search Gulf Coast Guardian NOLA Story NOLA Crossword NOLA Word Search Gulf Coast Guardian NOLA Story NOLA Crossword NOLA Word Search NGN Junk Shop Press Releases News Odds & Ends Politics Sci/Tech Sports June 11, 2025|Dishes Soaking in Sink for 6 Months ‘Still Not Quite There,’ Says Husband Watching Movie He’s Seen 44 Times June 7, 2025|Louisiana Politicians Quietly Preparing for ‘Productive’ Week as Saharan Dust Storm Approaches May 28, 2025|City to Preserve Damaged I-10 Ramp and Garbage Truck as ‘Modern Ruin’ for Future Generations May 27, 2025|“Catch Us at The Polls”: Two Remaining OPJC Escapees Jump into New Orleans Mayoral Race May 22, 2025|NOAA Says This Hurricane Season Could Bring 0 to 100 Storms **Sewerage & Water Board Hires New Executive Director After Rigorous Process of Asking Who Was Still Willing to Take The Job** Posted By:Don Kiebels In what city officials are calling “a proud moment for settling,” the New Orleans Sewerage & Water Board has officially named anew executive directorfollowing a months-long national search that concluded when one remaining applicant didn’t block their number. The identity of the new director has not been released, reportedly because their paperwork is currently buried somewhere in afiling systemmade up of unlabeled manila folders, index cards, and what investigators recently described as “a time capsule of 1983.” The unnamed candidate, whose résumé includes “some water stuff” and “a strong stomach,” emerged as the frontrunner after answering a call and not immediately hanging up—something the hiring committee described as “a rare and promising trait.” They’ll be stepping into the soggy shoes of outgoing director Ghassan Korban, The new director replaces Ghassan Korban, whoresignedafter finally admitting the pumps might not, in fact, be powered by hope alone. Sources close to the selection committee say the candidate first expressed interest after stumbling across anarticleabout former Sewerage & Water Board head Cedric Grant retiring with a six-figure pension despite a tenure marked by flooding and public outrage. “I knew right then,” the new hire allegedly said, “this was the place for me.” “This was a rigorous, transparent process,” said a city spokesperson. “We reached out to dozens of qualified individuals, and once they all declined, we regrouped and asked ourselves: ‘Who’s still picking up the phone?’” In a brief statement, the new director said, “Look, I may not know where the pumps are or how any of this works, but I amhere—and in this city, that counts forsomething.” The new executive director will begin immediately after signing the city’s traditionalwaiver of accountability. Previous post Next post Should Westbankers be allowed on the Eastbank? Yes, they're people just like anyone else. No, they're not people just like anyone else. Idk. I'm barely conscious. Can't we all just get along? View Results About Archives Contact Merchandise NGN in the… News? Press Releases Privacy Policy Satire Explained Subscribe © NEUTRAL GROUND NEWS"}