{"id": 592, "name": "Gephardt Daily", "domain": "gephardtdaily.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://gephardtdaily.com/local/actor-aaron-kaburick-helps-bring-the-beloved-tale-of-mrs-doubtfire-to-the-stage-in-salt-lake-city-this-week/#respond", "title": "Actor Aaron Kaburick Helps Bring The Beloved Tale Of Mrs Doubtfire To The Stage In Salt Lake City This Week", "content": "YOUR NEIGHBORHOOD NEWSOGDENST GEORGE OGDEN ST GEORGE OGDEN ST GEORGE NEWSTOP STORIESLOCALUS/WORLDBUSINESSGEPHARDT BUSINESS DIRECTORY TOP STORIES LOCAL US/WORLD BUSINESS GEPHARDT BUSINESS DIRECTORY TOP STORIES LOCAL US/WORLD BUSINESS GEPHARDT BUSINESS DIRECTORY ENTERTAINMENT PODCASTS MARKETPLACE SPORTS SPECIAL REPORTS TRAFFIC WEATHER GEPHARDT BUSINESS DIRECTORY YOUR NEIGHBORHOOD NEWSOGDENST GEORGE OGDEN ST GEORGE OGDEN ST GEORGE NEWSTOP STORIESLOCALUS/WORLDBUSINESSGEPHARDT BUSINESS DIRECTORY TOP STORIES LOCAL US/WORLD BUSINESS GEPHARDT BUSINESS DIRECTORY TOP STORIES LOCAL US/WORLD BUSINESS GEPHARDT BUSINESS DIRECTORY ENTERTAINMENT PODCASTS MARKETPLACE SPORTS Entertainment News Gephardt Originals Local Utah News Salt Lake **Actor Aaron Kaburick helps bring the beloved tale of ‘Mrs. Doubtfire’ to the stage in Salt Lake City this week** SALT LAKE CITY, Utah, Sept. 11, 2024 (Gephardt Daily) -- Actor Aaron Kaburick will be searching for the perfect cinnamon roll while he's here in Salt Lake City. Kaburick said in a phone interview with Gephardt Daily that is one of his quests while on tour with \"Mrs. Doubtfire,\" which is playing at the Eccles Theater downtown through Sunday. The show opened last night and there will be performances tonight and Thursday at 7 p.m., Friday and Saturday at 7:30 p.m. with a matinee Saturday at 1 p.m. and Sunday shows at 1 p.m. and 6:30 p.m. Tickets and more information are availablehere. Based on the beloved film and directed by four-time Tony Award® winner Jerry Zaks, the show tells the hysterical and heartfelt story of a struggling, out-of-work actor, Daniel Hillard, who will do anything for his kids. After losing custody in a messy divorce, he creates the kindly alter ego of Scottish nanny Euphegenia Doubtfire in a desperate attempt to stay in their lives. As his new character takes on a life of its own, Mrs. Doubtfire teaches Daniel more than he bargained for about how to be a father. Actor Rob McClure is reprising his Tony-nominated Broadway performance on tour; Kaburick plays Daniel Hillard's brother, Frank. Kaburick, who attended Boston University, is a veteran of Broadway musicals including \"Billy Elliot,\" \"Hello, Dolly!,\" \"Something Rotten!\" \"Motown: The Musical\" and \"Sister Act,\" and multiple national tours including \"The Full Monty,\" \"Billy Elliot,\" and the 30th Anniversary tour of \"Annie.\" He's also appeared in the TV shows \"Fosse/Verdon,\" \"The Marvelous Mrs. Maisel,\" \"Law & Order: SVU,\" and \"Girls5eva.\" He chatted with us from Reno, Nevada, which was the stop before Salt Lake City. Kaburick said the last time he was in Utah was with the 2003 tour of \"The Full Monty.\" He has said in the past that it was the latter show that gave him his big break, and we asked him to tell us more about that. \"I would do it again in a heartbeat,\" he said. \"It's hard for me to believe that it's over 20 years ago that I did it and made my professional debut, but I actually was working for a theater in St. Louis called the St. Louis Muny, that's like an 11,000 seat outdoor musical theater. And the producer at the time, who has been my sort of mentor throughout my career, knew that I was dipping my toe into acting. So, he was at dinner with a friend of his, and his friend was the producer of that tour, and he said: 'Well, why don't you just send him into audition for us, so at least he has, you know, a little experience,' and so I went in, and they called me back, and I was thinking, that is so nice of him for calling me back, because he didn't have to do that. And ironically, that producer is also the producer of 'Mrs. Doubtfire.' So I've had a, you know, a lovely career, thanks to him, and thanks to that conversation that got me the audition for that show.\" We asked him what the reception was like for \"The Full Monty\" here in Utah. \"Thrilling. We were all like: 'what's it going to be like here in Salt Lake?'\" he said. \"And the audience went nuts for it.\" Kaburick also told us more about his journey with \"Mrs. Doubtfire.\" \"I was part of the very first workshop of 'Mrs. Doubtfire' in the spring of 2019,\" he explained. \"That's just where we get together in a studio, a bunch of actors, read through the script, read through some changes, and we knew at that moment, we were like: 'this is special.' And we moved pretty quickly. So that was spring of 2019; we went to Seattle's 5th Avenue Theatre in the late fall of that year, we had an extended run at Seattle 5th Avenue and we closed early January 2020, moved straight to Broadway. And our first performance was, I think, March 10 of 2020. You can see the writing on the wall; we got, I think, three performances in before the shutdown happened. \"But fortunately, our producer was adamant that we would return after the pandemic, and we did. So I was with the Broadway run, and then when the tour went out, they asked if I would play the role of Frank on the tour, which is a role I understudied. I've had a career as an understudy and sometimes you cover roles that you know that you're not necessarily right for, but they need somebody to do it, so you step up to the plate and do it. This was one of those roles where I knew it was a good role for me, so I had a good feeling about the tour and playing the role. So it was all great. The New York company closed in June of 2022 and the tour started last September. So we've been going for about a year now, actually. So in between 'Mrs. Doubtfire' on Broadway and the tour, I did a little bit of TV and film. I work at Sacramento's Music Circus sometimes. So I did some work at other theaters, especially once I knew I had the tour coming up, I was able to do a little bit of work here and there.\" We also asked Kaburick to tell us more about the theater version of \"Mrs.Doubtfire,\" and how making it a musical enhances its content. \"Well they always say, when the emotions are too much for words, you sing, and if it's too much for singing, you dance, you know, some sort of phrase like that,\" he said. \"And I think that applies in this case here where you can really delve into these characters a little bit more, because you think about the addition of music into anything in life, it just stirs up more emotions. That's one thing that surprises people about 'Mrs. Doubtfire,' the musical, is that it has an incredible heart to it. And we think about the movie, we think, oh, it's so funny, Robin Williams is so funny, Sally Field is so great, but we forget that there's a lot of heart to it, there's a family that is trying to mend their broken pieces, and so the music in the musical can really help make it much more heartfelt. It also just allows for fun; you can have tap dancing, you can have a lot more silliness with music. \"There's also something very exciting, if you think about that iconic scene in the movie where Robin Williams is changing back and forth between Daniel and Mrs. Doubtfire, it's movie magic; they probably filmed that scene over the course of a week. And my character and Daniel have to do it on stage live in front of an audience. And so it's thrilling for the audience to see Rob McClure, who plays Daniel and Mrs. Doubtfire, go back and forth right in front of their eyes. It's the magic of theater, and it happens, and it works.\" We asked him if that section of the show has ever gone amiss on stage. \"It's been perfect every night,\" Kaburick joked. \"Rob is wearing like a onesie, so it looks like pants and a dress shirt, but it's all like sewn together, and it zips up the front, almost like coveralls. So last night, the zipper went up, and for whatever reason, the top third was zipped and the bottom third was zipped but the middle third popped open. But Rob is so smart, and so quick, he just covered. He just used his blazer to cover that area. Like yes, of course, little things happen with live theater. These zippers are zipped up and down very quickly all night long, it sets itself up for things to go wrong. But it rarely does, and usually the audience doesn't even notice.\" We also asked whether he enjoys touring with a cast that includes kids. \"I always say that one of the best things about having kids in a show, especially on tour, is that it forces you, and it forces the wrong word, but you can get caught in a bubble on tour,\" he said. \"And kids remind you of holidays and big events. So for example, if you're on tour and Halloween is happening, it might just be, maybe people throw a party in a hotel room or something to celebrate. And the minute you have kids, you go, well we have to have trick-or-treating. So like last year, we had trick-or-treating in our dressing rooms, and the kids came around to all of our dressing rooms in their costumes and trick-or-treated. Holidays are heightened because you feel a sense of responsibility. These kids are on the road, and they're doing something that's extraordinary but also takes them away from their normal lives. So you kind of want to do something to make it feel a little bit normal for them. They're just really good kids, they're just wonderful, and I love having them. No animals in the show, but we do have a lot of people that travel with pets. We've got a lot of doggies on our tour; at least five or six that I can think of. So that's also fun and makes it feel a little more homey.\" Kaburick will be with the tour until it concludes just before Thanksgiving; we asked him what the rest of the year looks like for him. \"Having been on the road for the past year, and as we close right before the holidays, I'm going to be fine if if I just sit at home and put up my Christmas decorations and enjoy them, and enjoy the holidays, then really start pounding the pavement in the New Year,\" he said. \"But as of right now, you know, I don't know what's next, but fingers crossed, it'll reveal itself quickly.\" Kaburick's husband is also an actor, and was the lead in the national tour of \"The Prom\" a couple of years ago. He is also a stage manager and sporadically subs for \"Mrs. Doubtfire;\" he will be with the tour for about the last six weeks with Kaburick. Finally, we asked Kaburick what he feels keeps him grounded on the road; he says in his Instagram bio that he is a baker, a quilter and a crafter. \"I love doing a puzzle on the road when I get home at night, because it keeps me grounded, it just calms me down,\" he said. \"There's something sort of soothing about that activity. I can put a TV show on, I can have a little snack, and I can just not be on my phone, you know, just sort of relax in a way. And yes, there's other things too, but I don't quilt so much on the road just because of carrying everything; traveling a sewing machine. I do bake, so I'll bake stuff to take into the cast as well, in fact one of my cast mates has a particular item that she loves and she's always like: 'when are you going to make it again?' I'm from the St. Louis area, and it's a St. Louis treat, a sort of chewy, almost like yellow cake brownie mixture. Of course, very healthy.\" We finally asked Kaburick if there's anything he particularly wants to see while he's in Salt Lake City; he said that he'd like to catch the Mormon Tabernacle Choir in performance, and also intends to go hiking and would like to make it up to the Park City area. \"Typically I get up in the mornings and go out for a jog, I'll explore Salt Lake, it's a good way to get around and see the city,\" he said. And while he's here, Kaburick will, of course, also be searching for that perfect cinnamon roll... For more information about \"Mrs. Doubtfire\" and for tickets, clickhere. TAGS Aaron Kaburick Eccles Theater Mrs. Doubtfire Salt Lake City **Update: Motorcyclist, 67, dead after hit-and-run incident in Liberty Wells neighborhood** **Chief Brian Redd reacts after arrest of SLCPD officer for allegedly stalking ex-girlfriend** **Girl, 14, struck, critically injured by vehicle near multi-stake dance at Lehi Rodeo grounds** **LEAVE A REPLYCancel reply** Save my name, email, and website in this browser for the next time I comment. Δ Multiple agencies respond to Dammeron Valley car rollover, fire Southern Baptists endorse repeal of gay marriage Man, 50, found dead in San Juan River Music icon Brian Wilson dead at 82 SLCPD: Motorcyclist seriously injured in collision, transported to hospital Multiple agencies respond to Dammeron Valley car rollover, fire Southern Baptists endorse repeal of gay marriage Man, 50, found dead in San Juan River Music icon Brian Wilson dead at 82 SLCPD: Motorcyclist seriously injured in collision, transported to hospital Roy police seek public’s help locating missing 65-year-old woman ‘Singo’ brings music, laughter, bingo to Redemption Bar & Grill in Herriman Curfew ordered for downtown LA to restrain violent protests, vandalism Orem man sentenced to 8 years in prison, lifetime of supervised release Kaysville Police Sgt. Jared Jensen dies after battle with brain cancer COVID-19 Fact-Checking Policy Code of Ethics Correction Policy Terms and Conditions Ownership and Funding Advertise with Us Privacy Policy Sitemap **Gephardt Daily | National and Utah News** COVID-19 Fact-Checking Policy Code of Ethics Correction Policy Terms and Conditions Ownership and Funding Advertise with Us Privacy Policy Sitemap"}