{"id": 1682, "name": "Breaking Wide", "domain": "breakingwide.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://breakingwide.com/category/learn-about-the-standard-reference-check-procedure-followed-by-united-nations-agencies-including-the-world-food-programme-unicef-unhcr-and-ocha-to-ensure-they-hire-the-most-qualified-and-ethical/", "title": "Learn About The Standard Reference Check Procedure Followed By United Nations Agencies Including The World Food Programme Unicef Unhcr And Ocha To Ensure They Hire The Most Qualified And Ethical", "content": "Home UN Jobs Career Advice Privacy Policy Terms and Conditions Question and Answer Contact Us **Category:Career Advice** **United Nations and UN agencies in Africa** Using its unique potential as a world center for international cooperation, the UN system plays an important role in coordinating all types of assistance to African countries so that they can act independently. In particular, the UN assists in theRead more… **UPD 2023. Young Professionals Programme Guide 2023 At** This article is updated for UN YPP 2023. For professionals under the age of 32, the YPP (United Nations Young Professionals Program ) Recruitment is an annual event. Invitations go to those UN Member States that are considered underrepresented, soRead more… **General Service Staff (G1 – G7)** NOTE: This article is updated for the 2023 requirements. The functions in the General Service and related categories include administrative, secretarial, and clerical support as well as specialized technical functions such as printing, security and buildings maintenance. There are jobsRead more… **​New IPSA and NPSA contracts in the UNDP and UN agencies. New IPSA and NPSA contracts in the UNDP and UN agencies. They will replace IC contracts.** UNDP: The IPSA and the NPSA will replace all international and local ICs as of 31 March 2022 (extended from 31 December 2021), except those which are of lumpsum deliverable-based arrangements. After this date, the use of ICs will beRead more… **National Professionals Officers (NO-A, NO-B, NO-C)** National Professional Officers (NPOs) National Professional Officers (NPOs) are locally recruited professionals in the United Nations system. They provide professional expertise at the national level and help in delivering program activities. NPO positions require a deep understanding of the localRead more… **How to write a CV with Sample** Introduction: Landing a job with a United Nations (UN) agency is a dream for many professionals. With the organization’s global reach and commitment to making a positive impact, it’s no wonder that competition for these positions is fierce. To standRead more… **How long does the UN recruitment process take?** The United Nations recruitment process can vary depending on the organization, the position, and the applicant pool. In general, the process can take anywhere from a few weeks to several months. Here’s a rough timeline for some of the UNRead more… **New Candidate Application Process in the UN Inspira from 2021 New Candidate Application Process in the United Nations Inspira** See below the changes you may notice when applying for a position effective from the 27th of September 2021. Changes are as follows: A resume-style profile with job-specific/personal information (~4 pages) will replace the Personal History Profile (~11 pages). ThisRead more… **United Nations competency based interview and STAR approach** Introduction: Competency-based interviews play a vital role in assessing candidates’ past performance and behavior to gauge their suitability for UN assignments. In this article, we delve into the significance of competency-based questions and provide valuable insights into optimizing the UN interviewRead more… **Understanding Danger Pay in the United Nations: Its Purpose and Value** The United Nations (UN) employs personnel in numerous locations worldwide, including areas where security and safety concerns are prevalent. To compensate staff members for the increased risks they face in these hazardous environments, the UN provides an additional payment knownRead more… **Guidelines on Recruitment and Selection of Short-Term Professional Staff.** Introduction: The United Nations (UN) agencies, including UNICEF, UNHCR, WFP, and IOM, are dedicated to addressing global challenges and providing humanitarian aid to vulnerable communities worldwide. As a result, they frequently hire short-term professional staff to meet their goals effectively.Read more… **How to get Paid internships in the UN?** We received hundreds of requests for paid internships. Unfortunately, some years ago the United Nations implemented not very sufficient policy that internships are not paid anymore. We disagree with such statements and requires because every job and internship should beRead more… **Your United Nations Career: Tips for Your First UN Job Application** Intro: As an aspiring professional in the impact sector, you may be considering a career with influential organizations such as the United Nations (UN), European Union (EU), Organization for Security and Co-operation in Europe (OSCE), or the Organisation for EconomicRead more… **What is the United Nations Volunteer Program and where can you volunteer with the United Nations?** A Step-by-Step Guide on How to Become a UN Volunteer: Join the Global Force for Change Introduction: United Nations Volunteers (UNV) are an integral part of the UN’s global mission, working tirelessly to promote peace and sustainable development. Becoming aRead more… **UN Volunteers Salary and Benefits: A Comprehensive Guide for Aspiring Candidates** Introduction: United Nations Volunteers (UNV) play a significant role in the success of humanitarian and development projects worldwide. If you’re considering becoming a UN Volunteer, understanding the salary and benefits involved can help you make an informed decision. In thisRead more… **Job offer in the UN agency.** Most suitable ways to Take, Refuse or Reach an agreement on an Employment Offer in the UN agency. Introduction Receiving a job offer from a United Nations (UN) agency is a significant achievement. However, before accepting the opportunity, it’s crucialRead more… **The World Bank Young Professionals Program 2022-2023** The World Bank launched Young Professionals Program 2023. We consolidate all information concerning World Bank 2023. This article is updated for 2023-2024 requirements. The Young Professionals Program 2023 (YPP) is a starting point for an exciting career in the WorldRead more… **UN Interview Guide Interview guide** NOTE: This article is adopted for 2022 requirements. The full description of hr process in the UN and other NGOs. I was present on a lot of interviews in UNDP, UNHCR, EU Council, Transparency International, OSCE. Sometimes my role wasRead more… **UN Salary Scale, Grades and Contracts UN SALARY SCALE** NOTE: This article is updated for the requirements UN Salary scale is a pretty difficult thing. A lot of international organizations (such as IOM – UN Migration ) linked their salaries with UN Salary Scale. It’s calculated individually for every countryRead more… **How to Fill in Personal History Form** Personal History Form is also called P-11 form. A good P-11 form with a cover letter is the shortest way for the interview. The UNDP Personal History Form (P.11) or e-Recruit online application is mandatory for all recruitments and selectionsRead more… **Posts pagination** **Like us on Facebook** **Join Now** **Search Jobs By Country** **List of Countries** Afghanistan(319) Albania(17) Algeria(19) Angola(37) Anguilla(1) Antigua and Barbuda(2) Argentina(9) Armenia(42) Aruba (The Netherlands)(1) Australia(123) Austria(19) Azerbaijan(4) Bahrain(5) Bangladesh(249) Barbados(9) Belarus(2) Belgium(181) Belize(8) Benin(80) Bhutan(5) Bolivia(7) Bolivia (Plurinational State of)(14) Bosnia(1) Bosnia and Herzegovina(27) Botswana(6) Brazil(35) British Virgin Islands(1) Bulgaria(7) Burkina Faso(247) Burundi(137) Cabo Verde(6) Cambodia(103) Cameroon(216) Canada(50) Career Advice(29) Central African Republic(335) Chad(302) chile(6) China(19) China – Hong Kong (Special Administrative Region)(11) Colombia(377) Comoros(13) Congo(53) Costa Rica(27) Côte d'Ivoire(131) Croatia(2) Cuba(2) Cyprus(8) czechia(13) Democratic Republic of the Congo(612) Denmark(87) Dili (East Timor)(1) Djibouti(32) Dominica(4) Dominican Republic(43) DR Congo(30) Ecuador(65) Egypt(155) El Salvador(124) Equatorial Guinea(2) Eritrea(4) Estonia(2) Eswatini(3) Ethiopia(413) Fiji(173) Finland(8) France(1,313) Gabon(12) Gambia(27) Georgia(24) Germany(162) Ghana(118) Greece(114) Grenada(3) Guadeloupe (France)(4) guam(1) Guatemala(151) Guinea(52) Guinea-Bissau(8) Guyana(8) Haiti(243) Honduras(127) Hungary(29) ILO(7) India(156) Indonesia(131) IOM(951) iran(7) Iran (Islamic Republic of)(5) Iraq(394) Ireland(77) Isle of Man (The United Kingdom of Great Britain and Northern Ireland)(8) Israel(30) Italy(236) Ivory Coast(55) Jamaica(10) Japan(10) JOBS(5) Jordan(935) Kazakhstan(9) Kenya(2,192) Kiribati(10) Kosovo(1) Kuwait(3) Kyrgyzstan(38) Lao People's Democratic Republic (the)(23) Lao people's democratic republic(the)(24) Latvia(1) Lebanon(289) Lesotho(20) Liberia(69) Libya(68) Lithuania(4) Loan(7) Logistics(1) Luxembourg(7) Madagascar(235) Malawi(88) Malaysia(51) Maldives(9) Mali(204) Malta(4) Marshall Islands(7) Mauritania(48) Mauritius(15) Mayotte(France)(25) Meeting ( France )(2) MEXICO(109) Micronesia (Federated States of)(12) Moldova(97) Mongolia(10) Monrovia(1) Montenegro(6) Morocco(102) Mozambique(197) Myanmar(162) Namibia(5) Nauru(2) Nepal(48) Netherlands(181) New calendonia(France)(42) New Zealand(2) Nicaragua(8) Niger(229) Nigeria(5,599) North Macedonia(2) Northern Mariana Islands (The United States of America)(1) Norway(46) Occupied Palestinian territory(662) OCHA(56) Pakistan(142) Palau(3) PANAMA(60) Papua New Guinea(38) Paraguay(9) Peru(65) Philipines(262) Philippines(384) Poland(59) Puerto Rico (The United States of America)(1) Qatar(77) Question and Answer(71) Remote(9) Republic of Korea(14) Réunion (France)(2) Reunion(France)(3) Romania(18) Rwanda(145) Saint Kitts and Nevis(3) Saint Lucia(4) Samoa(6) Sao Tome and Principe(6) Saudi Arabia(48) Senega(238) Senegal(131) Serbia(23) Seychelles(3) Sierra Leone(105) Singapore(11) Slovakia(9) Solomon Islands(26) Somalia(672) South Africa(129) South Korea(2) South Sudan(387) Spain(126) Sri Lanka(37) Sudan(455) Sweden(24) Switzerland(531) Syria(32) Syrian Arab Republic(647) Tajikistan(33) Tanzania(27) Thailand(341) The Republic of North Macedonia(15) The Savior(32) They had(36) Timor-Leste(47) Togo(29) Tonga(6) Travels(1) Trinidad and Tobago(2) Tunisia(128) Turkey(149) Türkiye(314) Turkmenistan(2) Tuvalu(8) Uganda(421) UK(31) Ukraine(1,013) UN Children's Fund(15) UN Jobs(6,160) UNHCR(159) UNICEF(11) UNIDO(1) United Arab Emirates(20) United Kingdom of Great Britain and Northern Ireland(534) United Republic of Tanzania(192) United States of America(502) UNOPS(74) Uruguay(1) USA(1,373) Uzbekistan(23) Vanuatu(16) Venezuela(56) Venezuela (Bolivarian Republic of)(300) Viet Nam(48) Wallis and Futuna (France)(2) Western Sahara(2) WFP(150) WHO(25) Yemen(273) Zambia(63) Zimbabwe(61) BreakingWide, All rights reserved. Terms of Use - Privacy Policy Breakingwide.com - not an official document of the United Nations"}