{"id": 2115, "name": "Red Youth", "domain": "redyouth.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://redyouth.org/ukraine-international-news/the-western-version-of-ukrainian-history-is-dishonest-to-say-the-least/#more-10272", "title": "The Western Version Of Ukrainian History Is Dishonest To Say The Least", "content": "Red Youth Each one, teach one! About Red YouthBuild the red bases!Who stole our future? Build the red bases! Who stole our future? Build the red bases! Who stole our future? Education1) Foundations: Our Beliefs and Values Outlined2) What Is The Dictatorship Of The Proletariat?3) Marxist Philosophy4) Marxist Economics5) Organisation6) History: world wars, revolutions and national-liberation struggles7) Roots of socialism8) On Britain9) Bourgeois trends in the working-class movement 1) Foundations: Our Beliefs and Values Outlined 2) What Is The Dictatorship Of The Proletariat? 3) Marxist Philosophy 4) Marxist Economics 5) Organisation 6) History: world wars, revolutions and national-liberation struggles 7) Roots of socialism 8) On Britain 9) Bourgeois trends in the working-class movement 1) Foundations: Our Beliefs and Values Outlined 2) What Is The Dictatorship Of The Proletariat? 3) Marxist Philosophy 4) Marxist Economics 5) Organisation 6) History: world wars, revolutions and national-liberation struggles 7) Roots of socialism 8) On Britain 9) Bourgeois trends in the working-class movement Further ReadingProletarianProletarian TVProletarian RadioLalkarKnow Your Rights! Proletarian Proletarian TV Proletarian Radio Lalkar Know Your Rights! Proletarian Proletarian TV Proletarian Radio Lalkar Know Your Rights! Donate Join Us **The western version of Ukrainian history is dishonest, to say the least…** A strange little online journal that calls itself ‘The Conversation’ with an intentionally mis-leading sub heading reading ‘Academic rigour, journalistic flair’ has weighed into the struggle of Western imperialism to demonise Russia, which is ultimately aimed at getting the massed populations of Britain, Europe and the USA to support any military adventurism that the leadership of said UK, EU and USA decide to partake in. In a heavily flawed and outrageously dishonest article (Famine, subjugation, and nuclear fallout: How Soviet experience helped sow resentment among Ukrainians toward Russia) published on 27thJanuary, 2022 by two American academics (Jacob Lassin and Emily Channell-Justice) posted in two US universities, one linked with payments from various reactionary organisations and bourgeois education while the other is linked to a Ukrainian nationalist organisation, the stall is set out to convince their readers of the nastiness of all things Soviet and Russian, and the innocence and victimhood of all those associated with contemporary Ukrainian nationalism. The two start off by digging deep into the already discredited and transparent lies of their infamous bourgeois journalistic predecessors (Robert Conquest, Anne Applebaum, and virtually any hack of the Hearst ‘yellow’ press) re the so-called Russian engineered Holodomor in Ukraine, an event built on pure fiction and shameless anti-Soviet bile which we have effectively disproved in very manyarticlesandother material. These two latest in a long line of anti-Russian ink-flingers then turn to the second World War, not a very bright thing to do if you are pushing Ukrainian nationalism but, let them hang themselves if they must. Lassin and Channell-Justice inform us that “the Ukrainian national movement was concentrated in the western parts of modern-day Ukraine, part of Poland, until the Nazi invasion in 1939.” Would that be why the Ukrainian nationalists under the leadership of Stepan Bandera, who to a man supported Hitler fascism, killed so many Poles of all ages in such vile and inhuman ways? They were also known for killing Ukrainians who married Poles, after making them watch their wives and families being tortured to death. Jews, gypsies and anyone suspected of any sympathy in the slightest with the Soviet Union were also targets of their bestial bloodlust. Then to add to the complete lack of journalistic honour that they have so-far displayed, our two ‘scribblers for Ukrainian nationalism’, drag out another tired old lie; “the Soviet Union and Nazi Germany entered into a secret agreement, under the guise of the Molotov-Ribbentrop nonaggression pact, which outlined German and Soviet spheres of influence over parts of central and east Europe.” The non-aggression pact which was signed by Molotov for the USSR and Ribbentrop for Nazi Germany on23 August 1939, was not a carve up of other states but, as the name suggests, a pact promising that neither would attack the other. Neither JV Stalin nor any other Soviet leader expected the Nazis to honour their promise but, this treaty gave the USSR time to build its forces, to organise its defence. This matter of fact understanding of the situation by the Soviet leadership is in marked contrast to the ‘piece of paper’ waving, smug relief that was displayed by Neville Chamberlain at Heston aerodrome, 11 months earlier, on 30 September 1938 when he reported the non-aggression agreement that he had signed with Hitler, proclaiming; “peace in our time!” The Soviets fought against the fascism of both the German state and the Ukrainian nationalists and were genuinely treated as heroes when they took Kiev from Nazi hands. When in 1986, a nuclear reactor at the Soviet-run Chernobyl nuclear power in the north of Ukraine went into partial meltdown it was broadcast as a disaster straight away, with Soviet fire and rescue personnel rushing to the scene from all over the Soviet Union, many giving their lives to avert a greater disaster. Nearly 200,000 people in the areas surrounding the power plant were evacuated away from the area and relief was made to all. This was a tragedy that could have happened anywhere but the Conversation’s Ukrainian nationalism supporting writers see only a chance to try to attack the Soviets, accusing them of not suppling proper equipment or training to deal with the nuclear material. Suggesting that because the site was in Ukraine it was only of secondary importance to the USSR leaders. Not only is that suggestion sickening it pours disdain of the thousands of Soviet workers who rushed there to help and on the many who also lost their lives caring not if they saved a Ukrainian or someone from another part of the USSR, these heroes saw only Soviet comrades in need of help. The wedge that has always been forced between Ukrainians and Russians always seems to come from the West and today is no different with UK and US imperialism trying its best to push the fascist government of Ukraine, that the West put in place, into military action against Russia. At the end of the article is written the following bare-faced twaddle; “If you are struggling to know who or what to trust, it’s little wonder. The consequences are real: democracy is threatened and, in some extreme cases, civil unrest and even armed conflict erupt. Now, more than ever, people need to be able to turn to reliable, evidence-based and non-partisan journalism. I help curate our daily email and this is what it offers: trusted news written by academics and experts.” This must surely bring Homeric laughter from our readers! **Related** **Post navigation** **Recent Posts** Iain Duncan Smith’s ‘Axis of Totalitarianism’ The western version of Ukrainian history is dishonest, to say the least… Biden blames weather for lack of Russian invasion of Ukraine If you believe “we may be sleepwalking towards a global war” it’s time to wake up “Memorial” fraudsters rebuffed by the Supreme Court **Archives**"}