{"id": 228, "name": "Christianity Today", "domain": "christianitytoday.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.christianitytoday.com/podcasts/the-russell-moore-show/moore-to-the-point-pepfar-and-the-uneasy-conscience-of-american-christianity/", "title": "Moore To The Point Pepfar And The Uneasy Conscience Of American Christianity", "content": "Donate Give a Gift Subscribe Log in arrow_down_plainGive a GiftSubscribeMy AccountLog Out News Ideas Theology Books Church Life Culture Magazine Podcasts Advancing the stories and ideas of the kingdom of God.About UsDonateTo search this site, enter a search termClear Search FieldsearchNewsIdeasTheologyBooksChurch LifeCulturePastorsHistoryOur LatestCurrent IssueArchivesPodcastsVideosTranslationsAll TopicsNewslettersSubscribeGive a GiftDonateHelp & FAQMy AccountLog InLog OutCT Store Advancing the stories and ideas of the kingdom of God. About Us Donate News Ideas Theology Books Church Life Culture Pastors History Our Latest Current Issue Archives Podcasts Videos Translations All Topics Newsletters Subscribe Give a Gift Donate Help & FAQ My Account Log In Log Out CT Store Advancing the stories and ideas of the kingdom of God. About Us Donate News Ideas Theology Books Church Life Culture Pastors History Our Latest Current Issue Archives Podcasts Videos Translations All Topics Newsletters Subscribe Give a Gift Donate Help & FAQ My Account Log In Log Out CT Store Podcast The Russell Moore Show Episode 180 | 8 min **Moore to the Point: PEPFAR and the Uneasy Conscience of American Christianity** The recent cuts may be shortsighted. June 9, 2025 ShareSharearrow_downfacebook_grayscaleFacebookx_grayscaleXwhatsapp_grayscaleWhatsApptelegram_grayscaleTelegramemailEmaillinkCopy LinkgiftGift Article **Share** facebook_grayscaleFacebook x_grayscaleX whatsapp_grayscaleWhatsApp telegram_grayscaleTelegram emailEmail linkCopy Link giftGift Article **Share** facebook_grayscaleFacebook x_grayscaleX whatsapp_grayscaleWhatsApp telegram_grayscaleTelegram emailEmail linkCopy Link giftGift Article **Subscribe to this Podcast** AppleApple SpotifySpotify MegaphoneMegaphone StitcherStitcher YoutubeYoutube RssRss American evangelical Christians ought to care about the dismantling of PEPFAR. Russell reads a piece from his newsletter every Monday on the podcast but there’s more to be found in the weekly email! Sign up⁠⁠⁠⁠here⁠⁠⁠⁠. **Sign up for The Daily Briefing** Get the most recent headlines and stories from Christianity Today delivered to your inbox daily. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Thanks for signing up. Please clickhereto see all our newsletters. Sorry, something went wrong. Please try again. giftGift This Article ShareSharearrow_downfacebook_grayscaleFacebookx_grayscaleXwhatsapp_grayscaleWhatsApptelegram_grayscaleTelegramemailEmaillinkCopy LinkgiftGift Article **Share** facebook_grayscaleFacebook x_grayscaleX whatsapp_grayscaleWhatsApp telegram_grayscaleTelegram emailEmail linkCopy Link giftGift Article **Share** facebook_grayscaleFacebook x_grayscaleX whatsapp_grayscaleWhatsApp telegram_grayscaleTelegram emailEmail linkCopy Link giftGift Article **Related** Episode 145 | 9 min **Moore to The Point: How a Book Club Helped Me to Live and to Die** Episode 143 | 12 min **Moore to The Point: Jimmy Carter at the Judgment Seat** Episode 179 | 1 hr 0 min **Andrew Peterson on the Authors Who Kept Us Christian** Aids and HIV Donald Trump Government International Politics United States **Our Latest** View All News **Southern Baptists Vote to Denounce Sports Betting, Endorse Bans on Online Porn** Kate Shellnutt Resolutions call for stronger government regulations on social issues. News **PCA Releases Results of Its ‘Jesus Calling’ Investigation** Emily Belz The denomination had ordered agencies to determine the “appropriateness” of the book for Christians. Wire Story **SBC Survivor Jennifer Lyell Left Behind Detailed Allegations of Abuse** Bob Smietana - Religion News Service In a deposition, Lyell alleged that her professor and mentor would coerce her into sexual activity, then tell her to repent and never speak of it. **The Injustice of Inconsistency** Carrie McKean The problem isn’t that South Africans are coming to America. It’s that the door is closed to Haitians, Burmese, Sudanese, Yemenis, Venezuelans, Ukrainians, and everyone else. News **Tablets Replace Textbooks in Kenya’s Village Schools** Harriet Chimea Nonprofits and a Christian university are bringing new technology to the country’s remotest areas. News **Hindu Groups Push Further Discrimination Against Christian Dalits** Vikram Mukka Converts need to choose between public faith and caste-based benefits. The Russell Moore Show **Gov. John Kasich on the Culture-Changing Power of Faith Communitiespodcast_grayscale** Former governor John Kasich talks about the vital role of faith communities and their unique impact on the world. Review **We Can Debate Women in Ministry. But Not the Historical Facts.** Kelley Mathews Beth Allison Barr challenges the narrative that women have never exercised church authority. You can help Christianity Today uplift what is good, overcome what is evil, and heal what is broken by elevating the stories and ideas of the kingdom of God. **Topics** News Ideas Books Theology Church Life Culture Pastors History **The Ministry** About Masthead Careers Donate Brand Standards **Help & Info** Terms Privacy & Cookies FAQ Site Map Contact My Account Log In Log Out **More** Advertise Media Room CT Translations Store CT Creative Studio Preaching Today © 2025 Christianity Today -a 501(c)(3) nonprofit organization“Christianity Today” and “CT” are the registered trademarks of Christianity Today International. All rights reserved. Seek the Kingdom."}