{"id": 1749, "name": "ACN Latitudes", "domain": "latitudes.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://latitudes.org/category/conditions/electrohypersensitivity/prevention-treatment-electrohypersensitivity/", "title": "Prevention Treatment Electrohypersensitivity", "content": "X Pinterest Facebook Youtube LinkedIn Shop Blog Members FAQs Contact HOME OUR MISSIONAbout UsMeet Our TeamVolunteerDonateStop Tics Today About Us Meet Our Team Volunteer Donate Stop Tics Today About Us Meet Our Team Volunteer Donate Stop Tics Today GET HELPBecome a MemberOur ProductsDiscussion BoardRead Our Testimonials Become a Member Our Products Discussion Board Read Our Testimonials Become a Member Our Products Discussion Board Read Our Testimonials HEALTH CONDITIONSAttention Deficit DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchTourette Syndrome & TicsSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchPANDAS & PANSSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchOCDSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchLearning DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchAutismSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchDepressionSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchElectrohypersensitivitySymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & ResearchOther ConditionsAnxietyLyme DiseaseSeizuresTrigeminal Neuralgia Attention Deficit DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Tourette Syndrome & TicsSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research PANDAS & PANSSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research OCDSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Learning DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research AutismSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research DepressionSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research ElectrohypersensitivitySymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Other ConditionsAnxietyLyme DiseaseSeizuresTrigeminal Neuralgia Anxiety Lyme Disease Seizures Trigeminal Neuralgia Attention Deficit DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Tourette Syndrome & TicsSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research PANDAS & PANSSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research OCDSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Learning DisordersSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research AutismSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research DepressionSymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research ElectrohypersensitivitySymptoms & DiagnosisPrevention & TreatmentFamilies Speak OutResources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Symptoms & Diagnosis Prevention & Treatment Families Speak Out Resources & Research Other ConditionsAnxietyLyme DiseaseSeizuresTrigeminal Neuralgia Anxiety Lyme Disease Seizures Trigeminal Neuralgia Anxiety Lyme Disease Seizures Trigeminal Neuralgia THERAPIESAllergy & ImmunotherapyBehavior ToolsBodywork ApproachesConventional MedicineDetoxificationDiet & NutrientsEnvironmental MedicineHomeopathyNeurofeedbackOther Approaches Allergy & Immunotherapy Behavior Tools Bodywork Approaches Conventional Medicine Detoxification Diet & Nutrients Environmental Medicine Homeopathy Neurofeedback Other Approaches Allergy & Immunotherapy Behavior Tools Bodywork Approaches Conventional Medicine Detoxification Diet & Nutrients Environmental Medicine Homeopathy Neurofeedback Other Approaches BEHAVIOR CHARTSParenting PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsChore ChartsDaily Routine ChartsFeelings ChartsParenting PrintablesHomework ChartsPet Care ChartsPotty Training ChartsReading ChartsReward CouponsSelf Care ChartsClassroom PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsFeelings ChartsHomework ChartsClassroom PrintablesPersonal Hygiene ChartsReading ChartsReward Coupons Parenting PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsChore ChartsDaily Routine ChartsFeelings Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Chore Charts Daily Routine Charts Feelings Charts Parenting PrintablesHomework ChartsPet Care ChartsPotty Training ChartsReading ChartsReward CouponsSelf Care Charts Homework Charts Pet Care Charts Potty Training Charts Reading Charts Reward Coupons Self Care Charts Classroom PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsFeelings ChartsHomework Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Feelings Charts Homework Charts Classroom PrintablesPersonal Hygiene ChartsReading ChartsReward Coupons Personal Hygiene Charts Reading Charts Reward Coupons Parenting PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsChore ChartsDaily Routine ChartsFeelings Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Chore Charts Daily Routine Charts Feelings Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Chore Charts Daily Routine Charts Feelings Charts Parenting PrintablesHomework ChartsPet Care ChartsPotty Training ChartsReading ChartsReward CouponsSelf Care Charts Homework Charts Pet Care Charts Potty Training Charts Reading Charts Reward Coupons Self Care Charts Homework Charts Pet Care Charts Potty Training Charts Reading Charts Reward Coupons Self Care Charts Classroom PrintablesAward CertificatesBehavior BucksBehavior ChartsBehavior ContractsFeelings ChartsHomework Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Feelings Charts Homework Charts Award Certificates Behavior Bucks Behavior Charts Behavior Contracts Feelings Charts Homework Charts Classroom PrintablesPersonal Hygiene ChartsReading ChartsReward Coupons Personal Hygiene Charts Reading Charts Reward Coupons Personal Hygiene Charts Reading Charts Reward Coupons BEHAVIOR TOOLSFor ParentsRecommendationsFree PrintablesHelpful ArticlesResourcesFor TeachersRecommendationsFree PrintablesHelpful ArticlesResources For ParentsRecommendationsFree PrintablesHelpful ArticlesResources Recommendations Free Printables Helpful Articles Resources For TeachersRecommendationsFree PrintablesHelpful ArticlesResources Recommendations Free Printables Helpful Articles Resources For ParentsRecommendationsFree PrintablesHelpful ArticlesResources Recommendations Free Printables Helpful Articles Resources Recommendations Free Printables Helpful Articles Resources For TeachersRecommendationsFree PrintablesHelpful ArticlesResources Recommendations Free Printables Helpful Articles Resources Recommendations Free Printables Helpful Articles Resources FORUMS Search MenuMenu **Archive for category: Electohypersensitivity Prevention & Treatment** **EMF Questions and Answers with Margaret Glaser: Updated** Our advisory board member Margaret Glaser, MA, served on the national EMR (Electromagnetic Radiation) Network board, which focused on a precautionary approach to wireless radiation. She also worked with an Underwriters Laboratories (UL) panel, with […] **18 Simple Ways to Limit Wireless Radiation Exposure** MARNE GLASER People are confused. On the one hand, they hear reports that there may be problems with cell phone radiation. On the other, they look around them and see excitement about every new wireless […] **Advice From Consumer Reports on Cell Phone Safety (Premium)** Adapted from a review by Joel Moskowitz, PhD, Director of the Prevention Research Center at the University of California/Berkeley School of Public Health. Consumer Reports published an article September 28, 2015: “Does Cell-Phone Radiation Cause Cancer?” […] **Does Your Child’s Brain Need to Be Reset?** Dr. Victoria Dunckley, an integrative psychiatrist in Los Angeles, says she’s helped more than five hundred children, teens, and young adults by “resetting” their brains. According to her, they needed this intervention because they all […] **Wi-Fi and the Internet Create Shallow Minds** CINDY RUSSELL, MD Dr. Cindy Russell is chair of the Environmental Health Committee for the Santa Clara County Medical Association. Most of us cannot live without our computers, text messaging, e-mail, and immediate access to the […] **Great Source of Info on Electromagnetic Radiation Now Free** EMR Australia has been publishing a quarterly report on electromagnetic radiation (EMR) for ten years. Their quarterly report is now available at no charge as a community service. The September issue brings you the latest […] **Why Children and Microwave Radiation Are a Dangerous Mix (Premium)** A sobering journal article explores why children absorb more microwave radiation than adults. It also explains that the fetus is in even greater danger than children from exposure. This article should be a game-changer for […] **Has Your Government Done This to Protect You and Your Family? (Premium)** More than 50 scientists from 18 nations called on governments to minimize the public’s exposure to the radiation emitted by wireless devices including cell and cordless phones, Wi-Fi, smart meters and baby monitors. Today, fifty-two […] **Membership Login** Login Password Signup HereLost Password **Parenting Tools** Parenting Home PageParenting PrintablesHelpful ResourcesRecommendationsTips and Articles **Teacher Tools** Teacher Home PageClassroom PrintablesHelpful ResourcesStudent Behavior ProductsTips and Articles"}