{"id": 2156, "name": "Times Now News", "domain": "timesnownews.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.timesnownews.com/viral/kerala-state-lottery-result-today-live-updates-june-11-2025-dhanalekshmi-dl-5-bumper-wednesday-lucky-draw-result-out-today-at-3-pm-check-full-winners-list-prize-list-liveblog-151850574", "title": "Kerala State Lottery Result Today Live Updates June 11 2025 Dhanalekshmi Dl 5 Bumper Wednesday Lucky Draw Result Out Today At 3 Pm Check Full Winners List Prize List Liveblog 151850574", "content": "Times Now Times Now Navbharat Zoom ET Now ET Now Swadesh Times Drive Health and Me Digit Marathi Telugu Tamil Bengali Kannada Malayalam Unilist Theme Live tv Latest Latest Latest Latest Entertainment Entertainment Entertainment Entertainment India India India India Sports Sports Sports Sports Business Business Business Business World World World World Lifestyle Lifestyle Lifestyle Lifestyle Tech Tech Tech Tech Education Education Education Education Viral Viral Viral Viral Cryptonow Cryptonow Cryptonow Cryptonow **Kerala Lottery Results Today 11-06-2025 Live: Dhanalekshmi DL-5 Bumper Wednesday Bumper Lottery Winning Numbers For June 11, 2025; Results OUT** Kerala Lottery Results Dhanalekshmi DL-5 Bumper Results Live: The first winner of today’s lottery game- Dhanalekshmi DL-5 Bumper lottery- will take home Rs 1 crore as a cash prize. The Kerala lottery is one of the most trusted games in the country. Updated Jun 11, 2025, 16:30 IST **Kerala Lottery Result 11 June 2025 Live** **Kerala Lottery Result 11-06-2025: 9th Prize winners are** **Kerala Lottery Result 11-06-2025: 8th Prize winners are** **Kerala Lottery Result 11-06-2025: 7th Prize winners are** **Kerala Lottery Result 11-06-2025: 6th Prize winners are** **Kerala Lottery Result 11-06-2025: 5th Prize winners are** **Kerala Lottery Results Wednesday Live: 4th Prize winners are** **Kerala Lottery Result Wednesday Live Updates: Consolation Prize winners are** **Kerala Lottery Live Result Today: 3rd Prize winners are** **Kerala Lottery Result Wednesday Live Updates: 2nd Prize winner is** **Kerala Lottery Result TODAY: 1st Prize winner is** **Kerala Lottery Result 11-06-2025: Prize Structure** **Kerala Lottery Result 11-06-2025: 2nd and 3rd winners will get…** **Kerala Lottery Result 11-06-2025: 1st winner will get…** **Kerala Lottery Result 11-06-2025: Where is the lucky draw held** **Kerala Lottery Result 11-06-2025: Where to check the updates** **Kerala Lottery Result 11-06-2025: Jurisdiction of Kerala lottery** **Kerala Lottery Result 11-06-2025: Where can the results be downloaded** **Kerala Lottery Results Today Live Updates:** **Kerala Lottery Results Today: First winner for today’s game** news news news news viral viral viral viral Related News Related News Indian Mr Bean! Fans Experience Nostalgia As Man Recreates Iconic Scenes From Childhood Show Indian Mr Bean! Fans Experience Nostalgia As Man Recreates Iconic Scenes From Childhood Show Before Checking Your Office Senior's LinkedIn Profile, Take A Look At What Happened With THIS Employee! Before Checking Your Office Senior's LinkedIn Profile, Take A Look At What Happened With THIS Employee! 'Sir, Main Handicapped Hoon': Zomato Delivery Agent’s Call Leaves Delhi Man In 'Guilt-Ridden Silence' 'Sir, Main Handicapped Hoon': Zomato Delivery Agent’s Call Leaves Delhi Man In 'Guilt-Ridden Silence' From ‘Pind’ To UK– Family Pays Rs 4.5 Lakh To Ship THIS From Punjab To England… From ‘Pind’ To UK– Family Pays Rs 4.5 Lakh To Ship THIS From Punjab To England… Optical Illusion: Can You Count The Number Of Circles In The Picture? Optical Illusion: Can You Count The Number Of Circles In The Picture? Follow us : © 2025 Bennett, Coleman & Company Limited"}