{"id": 2056, "name": "National Catholic Register", "domain": "ncregister.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.ncregister.com/commentaries/why-the-feast-of-mary-mother-of-the-church-fits-perfectly-with-60-years-of-liturgical-reform", "title": "Why The Feast Of Mary Mother Of The Church Fits Perfectly With 60 Years Of Liturgical Reform", "content": "EWTN News, Inc. is the world’s largest Catholic news organization, comprised of television, radio, print and digital media outlets, dedicated to reporting the truth in light of the Gospel and the Catholic Church. Newspaper National Catholic Register News Agencies Catholic News Agency CNA Deutsch ACI Africa ACI Afrique ACI Digital ACI Prensa ACI Stampa ACI Mena Digital Media ChurchPOP ChurchPOP Español ChurchPOP Italiano ChurchPOP Português TV & Radio EWTN News Indepth EWTN News Nightly EWTN Noticias EWTN Pro-life Weekly Register Radio Vaticano World Over Subscribe for just$49.95$32.50! **National Catholic Register Newshttps://www.ncregister.com/commentaries/why-the-feast-of-mary-mother-of-the-church-fits-perfectly-with-60-years-of-liturgical-reform** Marriage Special Report Jubilee 2025 Arts Blogs Vatican Register Radio Job Board --Home Home Home --Synod on SynodalityMost PopularPublisher’s NoteCollege GuideRegister Radio Synod on Synodality Most Popular Publisher’s Note College Guide Register Radio Synod on Synodality Most Popular Publisher’s Note College Guide Register Radio --NewsBlogsCommentariesFeaturesInterviewsAudioVideoCartoonsGalleries News Blogs Commentaries Features Interviews Audio Video Cartoons Galleries News Blogs Commentaries Features Interviews Audio Video Cartoons Galleries --NationWorldVaticanEducationCulture of LifeMoviesArts & EntertainmentTravelSaintsLiturgyBooksEditorialsPublisher's NoteLetters to the Editor Nation World Vatican Education Culture of Life Movies Arts & Entertainment Travel Saints Liturgy Books Editorials Publisher's Note Letters to the Editor Nation World Vatican Education Culture of Life Movies Arts & Entertainment Travel Saints Liturgy Books Editorials Publisher's Note Letters to the Editor --Contact UsSupport the RegisterPrint subscriptionsE-Newsletter Sign-upJob BoardAbout UsAdvertiseEWTN Religious Catalogue Contact Us Support the Register Print subscriptions E-Newsletter Sign-up Job Board About Us Advertise EWTN Religious Catalogue Contact Us Support the Register Print subscriptions E-Newsletter Sign-up Job Board About Us Advertise EWTN Religious Catalogue **Why the Feast of Mary, Mother of the Church Fits Perfectly With 60 Years of Liturgical Reform** COMMENTARY: Today’s feast is directly linked to the jubilee years of 1975 and 2000, making its observance this jubilee year a particular occasion for gratitude The feast of Mary, Mother of the Churchwas insertedinto the General Roman Calendar by Pope Francis in 2018, but has its roots in the reform of the liturgical calendar in 1969 and the Jubilee Year of 1975. Given her presence at Pentecost — the “birthday” of the Church — the celebration of Mary under the title Mother of the Church falls on the next day, the Monday after Pentecost — June 9 this year. Marian feast days have developed over the centuries, often with local customs or historical events taking on wider significance. Consider the feast of the Holy Name of Mary, now set for Sept. 12. It had some local observances in the 15th century, with the date set close to the Nativity of Mary (Sept. 8), as the bestowal of the name was proximate to the birth. After the victory of King Jan Sobieski of Poland over the Turks at Vienna on Sept. 12, 1683, Pope Innocent XI wished to commemorate the event with a feast. (Some have speculated that the 9/11 terrorists chose the date of their attack to coincide with this anniversary.) In 1684, Innocent established the feast of the Holy Name of Mary for the Sunday after the Nativity of Mary. In the 20th century, the date was fixed for Sept. 12 to avoid coinciding with a Sunday. The calendar reforms of 1969 eliminated the feast from the General Roman Calendar, which must be observed everywhere. It was returned in the revisions made in the Jubilee Year 2000. The feast of Mary, Mother of the Church is connected to the Jubilee Year 1975. After the Second Vatican Council, there was a burst of liturgical creativity. As one would expect, there were mixed results. On the positive side, it included the development of new sets of particular prayers (“propers”) for Masses on various occasions. Given that Pope St. Paul VI had formally declared Mary to be “Mother of the Church” on Nov. 21, 1964, during Vatican II, a suitable development was an optional Mass for Mary under that title. For the Jubilee Year 1975, the Holy See approved that particular set of Mass propers, but a priest would have to make a special search for the texts. In the Great Jubilee 2000, that votive Mass for Mary, Mother of the Church, was included in the Roman Missal used every day in every parish, so it became easily accessible. Thus, when Pope Francis inserted the feast into the universal calendar in 2018, priests already had the necessary prayers in the Missal. The date was fixed for Monday after Pentecost; the relevant decree stated that “as a caring guide to the emerging Church Mary had already begun her mission in the Upper Room, praying with the Apostles while awaiting the coming of the Holy Spirit (cf. Acts 1:14).” Thepreface for the Massis more comprehensive than was usually the case in prior centuries, a characteristic of the new Mass propers drawn up to honor the Blessed Mother. It gives a poetic panorama of the whole of Mary’s life, from “receiving [the] Word in her Immaculate Heart” to “giving birth to the Creator” as “she nurtured the beginnings of the Church.” The preface goes on to speak of Mary “standing beside the Cross” where she was given to the Apostle John as his mother, and accompanying “the Apostles [who] awaited the Spirit ... [joining] her supplication to the prayers of the disciples and so became the pattern of the Church at prayer.” The preface concludes with a reference to the Assumption and Mary’s role as powerful intercessor, who “accompanies [the] pilgrim Church with a mother’s love and watches in kindness over the Church’s homeward steps.” That preface is one of the richest in the Roman Missal, a crown of the new Mass propers developed for the Blessed Mother, one of the loveliest fruits of the post-conciliar liturgical renewal. The reform of the liturgical calendar brought a certain order to the Marian feasts, which Paul VI emphasized in his 1974 apostolic exhortation on Marian devotion,Marialis Cultus. By way of example, for centuries the Visitation was celebrated on July 2, the day after the octave of the Nativity of John the Baptist (June 24). That was odd, as the biblical account makes it clear that Mary departed from Elizabeth’s home before John was born (Luke 1:56-57). Paul VI put that right with his revision of the calendar in 1969, moving theFeast of the Visitation of the Blessed Virgin Maryto May 31, closing the Marian month and now falling between the Annunciation (March 25) and John’s birth, as happened in Luke’s Gospel. Previously, May 31 had been the feast of the Queenship of Mary, which was consequently moved to a much more fitting date, Aug. 22, the octave of the Assumption (Aug. 15). The fourth and fifth Glorious Mysteries now are set together liturgically. Other changes linked the cult of Mary in the calendar more closely to the mystery of Christ Jesus. The feast of the Immaculate Heart of Mary (previously in August) now follows the day after the solemn feast of the Sacred Heart of Jesus, uniting both the Sacred Heart and Immaculate Heart in the calendar. (The month of August is still dedicated to the Immaculate Heart of Mary, a relic of the earlier date of the feast.) Likewise, the feast of Our Lady of Sorrows now falls on Sept. 15, the day after the Exaltation of the Holy Cross. Previously that feast had been set for the Friday before Palm Sunday, indicating that Mary would accompany her Son through the Passion. Now, its date illustrates Mary’s fidelity to the end, standing at the foot of the Cross. Previously, the feast of the Divine Maternity of Mary was observed on Oct. 11. Pope St. John XXIII chose that date to open the Second Vatican Council in 1962, a concrete expression of his plea for Marian intercession for the work then beginning. The renewed calendar elevated the feast to the highest rank, renamed it Mary, Mother of God, and assigned it to Jan. 1, to complete the Christmas octave. The Christmas Octave now begins with the birth of the baby and concludes with honoring the mother. Incidentally, that left Oct. 11 free, and so it was assigned to John XXIII for his feast day, marking the day of his greatest preaching, the opening address to Vatican II,Gaudet Mater Ecclesia(Rejoice Mother Church). As an echo of that, Pope St. John Paul II’s feast day was set for Oct. 22, the date of his great “Be Not Afraid” homily. In the reform of 1969, the feast of St. Robert Bellarmine was moved from May 13 to Sept. 17. The former was the date of his beatification in 1923, emphasizing the juridical-legal declaration of his holiness, while the latter date was his death, hisdies natalis, date of his “birthday” in heaven. That left May 13 free, which is now observed as the feast of Our Lady of Fatima, the anniversary of the first apparition in 1917 and the miraculous survival by John Paul II of the assassination attempt in 1981. The Monday after Pentecost — now Mary, Mother of the Church — fits within nearly 60 years of liturgical reform, during which the Marian dimension has become better arranged and more profound. For the Marian year 1987, the Holy See prepared aCollection of Masses of the Blessed Virgin Mary, which contained 46 Masses with propers for various Marian titles. Today’s feast is also directly linked to the jubilee years of 1975 and 2000, making its observance this year of the Jubilee of Hope a particular occasion for gratitude. Mary, Mother of the Church, pray for us! Keywords: mary mother of the church blessed mother Father Raymond J. de SouzaFather Raymond J. de Souza is the founding editor ofConviviummagazine. Related Stories Latest News Blogs **5 Reasons to Go Big on Celebrating the Council of Nicaea’s 1,700th Anniversary** COMMENTARY: Each of us is called to stake our life on what we profess — just like the first Christians did. **Mother Seton, the Blessed Mother and Me** A mother's prayers, a daughter's healing, and the saints' Intercession... **What the Blessed Mother Teaches Us About Beauty and Wisdom** Reflect on Mary in a new, more personal way. **What Netflix’s ‘Mary’ Gets Right — and What It Gets Wrong** FILM REVIEW: New film portrays the Blessed Mother with reverence but takes troubling liberties with Catholic doctrine. **When It Comes to Comparisons With Father Rupnik, Think Cosby, not Caravaggio** COMMENTARY: Three aspects to consider: the process, the personage and the penalty. **School Founded by St. Augustine of Canterbury in 597 Succumbs to England’s Pride Month Fervor** COMMENTARY: The rainbow colors of LGBTQ ideology are conspicuous throughout the UK. But beyond the Pride pomp are signs of Catholic renewal. **Pope Leo XIV Receives UN Secretary-General António Guterres at the Vatican** Guterres, 76, is the ninth secretary-general of the United Nations, a position he assumed on Jan. 1, 2017. **Bishop of Graz in Austria ‘Stunned and Shaken’ After School Shooting Leaves 10 Dead** During his general audience on Wednesday, Pope Leo XIV prayed for the victims of the mass shooting. **Behold Your Mother: Why the Church Looks to Mary After Pentecost** SAINTS & ART: Two masterpieces, centuries apart, reflect a theological insight centuries old: Mary was given not only to John, but to the entire Church. **You Have the Gifts of Pentecost: A Letter to the Newly Confirmed** Your Confirmation is not the finish line — it’s the beginning of a lifelong journey with the Holy Spirit. **The Only Approved Marian Apparition in the US, a Guidebook to Hearing God’s Voice, A Wartime Encounter With Padre Pio, and More Great Links!** The Best In Catholic Blogging **‘Were Not Our Hearts Burning?’: App Offers Companionship in the Digital Desert** As loneliness spreads and spiritual confusion deepens, the Reviv3 app invites users to encounter Jesus on their own road to Emmaus. **Trending** Social mediaFacebookTwitterInstagramYoutube Facebook Twitter Instagram Youtube Facebook Twitter Instagram Youtube Tools & FeaturesE-NewslettersRSS FeedsRegister News WidgetRegister Radio PodcastCollege Guide E-Newsletters RSS Feeds Register News Widget Register Radio Podcast College Guide E-Newsletters RSS Feeds Register News Widget Register Radio Podcast College Guide Print SubscriptionsSubscribeManage a SubscriptionGive a SubscriptionOrder Bulk Subscriptions Subscribe Manage a Subscription Give a Subscription Order Bulk Subscriptions Subscribe Manage a Subscription Give a Subscription Order Bulk Subscriptions MarketplaceAdvertiseJob BoardEWTN Religious Catalogue Advertise Job Board EWTN Religious Catalogue Advertise Job Board EWTN Religious Catalogue MoreAbout UsContact UsSupport UsArchivesSubmissionsSubmit Letter to EditorReprints and PermissionsPrivacy Policy About Us Contact Us Support Us Archives Submissions Submit Letter to Editor Reprints and Permissions Privacy Policy About Us Contact Us Support Us Archives Submissions Submit Letter to Editor Reprints and Permissions Privacy Policy Copyright © 2025 EWTN News, Inc. All rights reserved. EIN 27-4581132Reproduction of material from this website without written permission, or unlicensed commercial use or monetization of National Catholic Register RSS feeds is strictly prohibited. **Subscription Options** Subscriber Service CenterAlready a subscriber? Renew or manage your subscription or gift subscription.My Account Subscriber Service CenterAlready a subscriber? Renew or manage your subscription or gift subscription. Subscriber Service CenterAlready a subscriber? Renew or manage your subscription or gift subscription. Subscribe for just$49.95$32.50!Start your Register subscription today.Subscribe Now Subscribe for just$49.95$32.50!Start your Register subscription today. Subscribe for just$49.95$32.50!Start your Register subscription today. Give a Gift SubscriptionBless friends, family or clergy with a gift of the Register.Order Now Give a Gift SubscriptionBless friends, family or clergy with a gift of the Register. Give a Gift SubscriptionBless friends, family or clergy with a gift of the Register. Order Bulk SubscriptionsGet a discount on 6 or more copies sent to your parish, organization or school.Order Now Order Bulk SubscriptionsGet a discount on 6 or more copies sent to your parish, organization or school. Order Bulk SubscriptionsGet a discount on 6 or more copies sent to your parish, organization or school. Sign-up for E-NewsletterGet Register Updates sent daily or weeklyto your inbox.Sign Up Sign-up for E-NewsletterGet Register Updates sent daily or weeklyto your inbox. Sign-up for E-NewsletterGet Register Updates sent daily or weeklyto your inbox."}