{"id": 983, "name": "Harvard Gazette", "domain": "news.harvard.edu", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://news.harvard.edu/gazette/story/2025/06/remember-when-corporate-america-steered-clear-of-politics-on-social-media/", "title": "Remember When Corporate America Steered Clear Of Politics On Social Media", "content": "Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy MenuSectionsFindingsCampus & CommunityHealthScience & TechNation & WorldArts & CultureWork & EconomyFeatured TopicsTariffsColdest quantum experimentCarbs and agingHarvard ReadsEventsFeatured seriesWonderingA series of random questions answered by Harvard experts.Explore the GazetteEventsArticle archiveAbout usNews+PodcastRead the latestEra of U.S. dollar may be winding downFunding today, entrepreneurship tomorrow. Or not.Rick Scott argues tariffs will level playing field, help U.S. workersFor Media & JournalistsAthletics News & ScoresDigital AccessibilityPrivacy PolicyTrademark **Sections** Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy **Featured Topics** Tariffs Coldest quantum experiment Carbs and aging Harvard Reads Events **Featured series** **Wondering** A series of random questions answered by Harvard experts. **Explore the Gazette** Events Article archive About us News+ Podcast **Read the latest** Era of U.S. dollar may be winding down **Era of U.S. dollar may be winding down** Funding today, entrepreneurship tomorrow. Or not. **Funding today, entrepreneurship tomorrow. Or not.** Rick Scott argues tariffs will level playing field, help U.S. workers **Rick Scott argues tariffs will level playing field, help U.S. workers** For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark **Sections** Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy **Featured Topics** Tariffs Coldest quantum experiment Carbs and aging Harvard Reads Events **Featured series** **Wondering** A series of random questions answered by Harvard experts. **Explore the Gazette** Events Article archive About us News+ Podcast **Read the latest** Era of U.S. dollar may be winding down **Era of U.S. dollar may be winding down** **Era of U.S. dollar may be winding down** Funding today, entrepreneurship tomorrow. Or not. **Funding today, entrepreneurship tomorrow. Or not.** **Funding today, entrepreneurship tomorrow. Or not.** Rick Scott argues tariffs will level playing field, help U.S. workers **Rick Scott argues tariffs will level playing field, help U.S. workers** **Rick Scott argues tariffs will level playing field, help U.S. workers** For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark SearchSearch the Harvard GazetteGo Tariffs Coldest quantum experiment Carbs and aging Harvard Reads Events **Remember when corporate America steered clear of politics on social media?** Elisabeth Kempf. Stephanie Mitchell/Harvard Staff Photographer Christina Pazzanese Harvard Staff Writer **Study finds Twitter surge starting in 2017, most of it Democratic-leaning by surprising range of firms, with negative effects on stock price** There was a time when corporate America was not very online. Most companies used social media for promoting products and services or engaging with consumers in a friendly fashion. Political posts on a company Twitter account were rare. That all changed between 2012 and 2022, when the volume of partisan speech on Twitter (now called X) from large corporations surged, more than doubling beginning in 2017, according to a new National Bureau of Economic Researchworking paper. Researchers said the spike was driven disproportionately by companies using language associated with Democratic politicians. The moves frequently had negative effects on company stock prices. In this edited conversation, the paper’s co-authorElisabeth Kempf, Jaime and Raquel Gilinski Associate Professor of Business Administration, explains corporate Twitter’s abrupt shift. It seems ubiquitous now, but corporations putting out partisan-sounding tweets is only a recent development. What did you find? Partisan speech was very rare for companies. Less than 1 percent of all the tweets they sent between 2012 and 2017 would constitute what was, according to our measures, very partisan speech. Wading into partisan, polarized issues can be tricky for companies. We saw the first big change in 2017 where both Democratic and Republican partisan speech picks up, and then this big asymmetry starting in 2019. That was the part that I found the most surprising. I was expecting to see some companies also start to use more Republican-sounding speech — to see, essentially, evidence of polarization. It was quite surprising to see that everybody seemed to adopt more Democratic speech after 2019 and that it was happening across the board, companies in blue states, red states, companies that are in consumer-facing businesses, also B2B [business to business]. “It was quite surprising to see that everybody seemed to adopt more Democratic speech after 2019 and that it was happening across the board, companies in blue states, red states.” How did you define partisan corporate speech? We built on previous work by Jesse Shapiro, my colleague at Harvard, and his co-authors. They developed this methodology to look at partisan speech in Congress that identifies phrases that allow you to correctly guess a speaker’s political party. We used their methodology and applied it to tweets sent by Democratic and Republican politicians. That allowed us to identify highly partisan phrases and then apply it to corporate speech. Essentially, phrases that sound like they could be coming from a Democratic or Republican politician is what we consider partisan speech. What did you learn about how partisan corporate speech has changed over time? The first fact is that partisan corporate speech has become more common over this time period, 2012 to 2022. The second fact is that this growth was really asymmetric. Starting in 2019, we see rapid growth in Democratic-sounding speech, while Republican-sounding speech stayed constant or, if anything, decreased toward the end. And third, when we look at stock returns around these partisan corporate statements, we see that they tend to be followed by negative abnormal stock returns. That said, we also see a lot of heterogeneity depending on the investor composition. For example, if there are more funds with ESG [environmental, social, and governance] objectives, then we see that the stock return after a Democratic-sounding statement tends to be less negative. Is it clear why these partisan Twitter statements suddenly escalated during this time? In 2017, we see both Democratic- and Republican-sounding speech go up for the first time. We don’t have so much to say on that. What we do have more to say on is when we start to see this divergence between Democratic- and Republican-sounding speech, which is in January 2019. That was when BlackRock chief executive Larry Fink put out a pretty influential letter, his “Dear CEOs” annual letter. He explicitly called on CEOs to be more vocal, take more stances on polarizing issues. This would be another potential piece of evidence to suggest that large institutional investors may have also played a role in this. BlackRock is the world’s largest asset manager so there was a lot of news reporting that this had kicked off a lot of discussion in the business world. Also in 2019, the Business Roundtable [a CEO lobbying association] came out saying shareholder value maximization should not be the sole purpose. So, I do think it was quite influential. We also see that 2019 was a massive growth in terms of the assets under management with a sustainability mandate. This is when a big shift happened in the investment industry. Recently, we’ve seen protest campaigns against Tesla and Bud Light spurred by perceived partisan corporate statements. Could robust consumer boycotts that threaten profits have contributed to declines in shares as opposed to just public or investor reaction to statements? This was the finding we struggled the most to make sense of. One possibility is, as you say, that maybe there could be facts of this partisan speech that affect what we would call the cash flows in finance or the profits that the companies make. For example, it might be losing employees or losing customers. We argue that partisan speech can affect a third potential stakeholder group — investors — and how much they are willing to hold the stock. We were looking at the 500 largest companies by market capitalization, so these are very big companies that need to raise capital from a pretty heterogeneous investor base. It’s hard for these large companies to raise capital only from Democrats or only from Republicans. And so, once you make a partisan statement that aligns with one group but not with the other, you might see precisely this negative stock price effect. It is also difficult to explain the growth in Democratic-sounding speech with consumer or employee preferences alone. To be clear: We wouldn’t want to conclude that investor or consumer preferences did not play a role at all. But we thought it was worth pointing out that it was hard to explain everything just with consumers or just with employees. Why is that? Because we see this rapid growth both for companies that are in consumer and non-consumer-facing industries. Boycotts could explain why maybe certain retail companies might adopt a certain speech, but we see it even in materials, which is a sector with companies that make metals, chemicals, coatings and things like this. It’s hard to think that there the consumer preferences for partisan speech would be super strong. I thought employees could be quite relevant, but we saw the same trend in companies with employees located in very Democratic areas versus Republican areas. We also didn’t see that labor market tightness played a role. You might imagine that if you’re really in desperate need of talent, maybe you would engage more in this partisan speech if you thought it would help in hiring. There were a couple of results that just made it hard to explain this with consumers or employees alone. Whereas, if you think about this investment channel, it could explain why we see it in companies that are based in blue areas, red areas. It could explain why this is such a broad-based phenomenon. Are there other aspects of corporate speech ripe for further research? Yes. I don’t think we have fully answered the question of why this big shift was happening then. We have suggestive evidence that investors could have played a role. But I don’t think there’s a full, causal relationship yet. So that is one big open question: How influential were investors versus consumers versus employees? The second question is what were the more long-term effects? We’re looking at stock prices over a relatively short window. What does this do in the longer run to companies, and potentially also to their relationship to politicians or how partisan speech by companies influences politics, I think, are exciting areas for future research. Share on Facebook Share on LinkedIn Email article Print/PDF **You might like** Work & EconomyEra of U.S. dollar may be winding downEconomist Kenneth Rogoff’s new book entwines currency’s ascension, his own experiences, and looks at what looms ahead8 min read **Era of U.S. dollar may be winding down** Economist Kenneth Rogoff’s new book entwines currency’s ascension, his own experiences, and looks at what looms ahead **Era of U.S. dollar may be winding down** Economist Kenneth Rogoff’s new book entwines currency’s ascension, his own experiences, and looks at what looms ahead Work & EconomyFunding today, entrepreneurship tomorrow. Or not.Threat to research is a threat to U.S. innovation and growth, HBS analyst says5 min read **Funding today, entrepreneurship tomorrow. Or not.** Threat to research is a threat to U.S. innovation and growth, HBS analyst says **Funding today, entrepreneurship tomorrow. Or not.** Threat to research is a threat to U.S. innovation and growth, HBS analyst says Work & EconomyRick Scott argues tariffs will level playing field, help U.S. workersRepublican senator also views China as nation’s most concerning competitor3 min read **Rick Scott argues tariffs will level playing field, help U.S. workers** Republican senator also views China as nation’s most concerning competitor **Rick Scott argues tariffs will level playing field, help U.S. workers** Republican senator also views China as nation’s most concerning competitor **Trending** HealthYoung researcher’s ALS attack plan is now a no-goCareer award among casualties of ‘terrifying’ cuts affecting lab of David Sinclair5 min read **Young researcher’s ALS attack plan is now a no-go** Career award among casualties of ‘terrifying’ cuts affecting lab of David Sinclair 5 min read **Young researcher’s ALS attack plan is now a no-go** Career award among casualties of ‘terrifying’ cuts affecting lab of David Sinclair 5 min read HealthSon’s diabetes diagnosis sent scientist on quest for cureDecades later, Doug Melton and team are testing treatment that could make insulin shots obsolete8 min read **Son’s diabetes diagnosis sent scientist on quest for cure** Decades later, Doug Melton and team are testing treatment that could make insulin shots obsolete 8 min read **Son’s diabetes diagnosis sent scientist on quest for cure** Decades later, Doug Melton and team are testing treatment that could make insulin shots obsolete 8 min read HealthWhat your brain score says about your bodySimple tool can be used to identify risk factors for cancer and heart disease too, says new study4 min read **What your brain score says about your body** Simple tool can be used to identify risk factors for cancer and heart disease too, says new study 4 min read **What your brain score says about your body** Simple tool can be used to identify risk factors for cancer and heart disease too, says new study 4 min read **Sections** Findings Campus & Community Health Science & Tech Nation & World Arts & Culture Work & Economy **Explore the Gazette** Events Article archive About us News+ Podcast **Our recent series** **Wondering** A series of random questions answered by Harvard experts. **Life | Work** A series focused on the personal side of Harvard research and teaching. **Follow us on** Instagram LinkedIn TikTok Facebook YouTube Email For Media & Journalists Athletics News & Scores Digital Accessibility Privacy Policy Trademark"}