{"id": 1897, "name": "Bounding Into Comics", "domain": "boundingintocomics.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://boundingintocomics.com/video-games/video-game-news/epic-games-ceo-ai-prompts-to-create-all-video-game-character-dialogue-in-the-next-few-years-empower-small-teams-to-make-breath-of-the-wild-sized-games/", "title": "Epic Games Ceo Ai Prompts To Create All Video Game Character Dialogue In The Next Few Years Empower Small Teams To Make Breath Of The Wild Sized Games", "content": "MoviesMovie Reviews Movie Reviews Movie Reviews TVTV Show Reviews TV Show Reviews TV Show Reviews Anime & MangaAnimeManga Anime Manga Anime Manga Comic BooksComic Book ReviewsDark Horse ComicsDC ComicsDynamite ComicsIDW ComicsImage ComicsMarvel ComicsCollectibles and Toys Comic Book ReviewsDark Horse ComicsDC ComicsDynamite ComicsIDW ComicsImage ComicsMarvel Comics Dark Horse Comics DC Comics Dynamite Comics IDW Comics Image Comics Marvel Comics Collectibles and Toys Comic Book ReviewsDark Horse ComicsDC ComicsDynamite ComicsIDW ComicsImage ComicsMarvel Comics Dark Horse Comics DC Comics Dynamite Comics IDW Comics Image Comics Marvel Comics Dark Horse Comics DC Comics Dynamite Comics IDW Comics Image Comics Marvel Comics Collectibles and Toys Video GamesTabletop Games & RPGsVideo Game Reviews Tabletop Games & RPGs Video Game Reviews Tabletop Games & RPGs Video Game Reviews Sports **Epic Games CEO: AI Prompts To Create All Video Game Character Dialogue In “The Next Few Years,” Empower Small Teams To Make ‘Breath Of The Wild’-Sized Games** SHARE Share on GabGab Share on FacebookFacebook Share on TwitterTwitter Share on FlipboardFlipboard Share on RedditReddit Share on NewsBreakNewsBreak Share via EmailEmail Epic Games’ CEO Tim Sweeney hasn’t been shy about his support of AI in games development. Recently, he has proposed the idea that within “the next few years,” it could be possible to feed an AI a character’s synopsis, and have it produce all their dialogue. He believes this would enable even a development team of just ten people to produce a game on the scale ofThe Legend of Zelda: Breath of the Wild. RELATED:SAG-AFTRA Files Unfair Labor Practice Charge Against Epic Games’ ‘Fortnite’ Over AI Darth Vader In an interview withIGNduring the Epic’s State of Unreal 2025 conference, Sweeney championed the idea that AI prompts will be “a fundamental part” of game engines, resulting in “entirely new genres of games invented that weren’t possible or practical before.” Sweeney went onto to elaborate on how far AI could go for games’ development. “Every significant advance in technology has led to the rise of new games. I remember 3D gaming just became possible, and thenDoomandWolfensteinintroduced the 3D shooter. The battle royale genre itself only became possible when you had enough performance on hardware and engines that you could have a hundred players in a single play space,” Sweeney recapped. “AI characters giving you the possibility of infinite dialogue with a really simple setup for creators means small teams will be able to create games with immense amounts of characters and immense and interactive worlds,” Sweeney proposed. “What would it take for a 10-person team to build a game likeZelda Breath of the Wild, in which the AI is just doing all the dialogue, and you’re just writing some character synopsis? That’s totally going to be within reach over the next few years.” Though the idea of a programmer or level-designer writing dialogue in a large-scale games studio seems silly, Sweeney’s comments do hold merit when considering developers in smaller teams have to take on more roles. If Sweeney’s idea works as he imagines, an indie developer could introduce as much dialogue into their project as they like. RELATED:After Five Year Ban, ‘Fortnite’ Finally Returns To Apple App Store Games that already utilize AI-generated dialogue includeSuck Up!, where players are vampires trying to convince NPCs with randomly generated personalities to let them into their home.AI Dungeonis effectively a text adventure game that can endlessly adapt to players’ responses (in theory). There’s also a demand for AI characters, as theMyRobotKickstarter campaignachieved 391% funding–to the tune of $78,000. The developers argued their game would be “the first good character simulator that uses AI.” AI-generated dialogue in its current form is far from perfect, however. While SAG-AFTRA demanded a cut fromAI Darth Vader inFortnite, the age rating of the game made it a necessity for the Sith Lord to be a bit nicer to players (and out of character). Players also delighted in tricking the NPC into swearing and other inappropriate comments. Others have cautioned against AI replacing human creativity, or seeing originality stamped out in the industry. Such calls have come fromLevel-5 CEO Akihiro Hino,NieRseries director Yoko Taro,Zero Escapeseries creator Kotaro Uchikoshi, andPlayStation boss Hermen Hulst. There’s also the ethical concerns of replacing writers–part of the reason theWriters Guild of AmericaandSAG-AFTRAwent on strike in 2023. Sweeney had confidence AI would be of benefit to the industry, however, despite how it could be abused. “I see AI as technology that’s ultimately there to empower human creators to create stuff more efficiently. I think that’s a good thing.” RELATED:Nintendo Denies Using AI-Generated Images For ‘Mario Kart World’ “It’s unfortunate that the advent of modern AI has been tainted by companies just ripping massive amounts of content off of other companies and individuals on the web. But as a base level technology, it should be a multiplying factor and multiplying force on our abilities,” Sweeney insisted. “Certainly enabling indie teams to build bigger and better games means also enabling AAA teams to build staggering, immense huge games and to polish it ever further,” Sweeney admitted. “So I think there’s going to be a massive evolution as everybody scrambles to learn new skills as you get on top of what’s possible here. But I think as with any other technology that’s improved our lives, the ultimate net opportunity for people is higher.” Sweeney and Epic Games are unlikely to relent from AI, and aren’t going to be hoarding their advances to themselves. “We’re taking what we learned from Darth Vader and sharing the underlying technology with the creator community,” Epic games stated, while revealing the “Persona Device.” This will be a feature of the Unreal Editor forFortnitefor developers and players tocreate NPCs with AI personalities that players can interact with. NEXT:Level-5 CEO Says “80-90% Of Games Are Already Created By AI”, But Need A Human’s “Aesthetic Eye” To Ensure Quality More About:Video Game News Movie NewsBatman NewsSuperman NewsX-Men News Batman News Superman News X-Men News Batman News Superman News X-Men News TV Show NewsDr Who NewsLOTR NewsStar Wars NewsStar Trek News Dr Who News LOTR News Star Wars News Star Trek News Dr Who News LOTR News Star Wars News Star Trek News Anime NewsManga NewsBook News Manga News Book News Manga News Book News Comic Book NewsWarner Bros NewsDisney NewsDC NewsMarvel News Warner Bros News Disney News DC News Marvel News Warner Bros News Disney News DC News Marvel News Comic Book ReviewsMovie ReviewsTV Show ReviewsVideo Game Reviews Movie Reviews TV Show Reviews Video Game Reviews Movie Reviews TV Show Reviews Video Game Reviews About Openings Contact Privacy"}