{"id": 325, "name": "Los Angeles Daily News", "domain": "dailynews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dailynews.com/2025/05/25/money-in-the-pockets-of-administrators-charter-network-steers-millions-in-taxpayer-money-to-opaque-firm-tied-to-execs/", "title": "Money In The Pockets Of Administrators Charter Network Steers Millions In Taxpayer Money To Opaque Firm Tied To Execs", "content": "e-Edition e-Edition NewsNewsCrime and Public SafetyElectionInvestigative ReportingPoliticsHealthEnvironmentBusinessBest ReviewsHousingJobsWeather News Crime and Public Safety Election Investigative Reporting Politics Health Environment Business Best Reviews Housing Jobs Weather News Crime and Public Safety Election Investigative Reporting Politics Health Environment Business Best Reviews Housing Jobs Weather Local NewsLocal NewsSan Fernando ValleyLos AngelesLos Angeles County Local News San Fernando Valley Los Angeles Los Angeles County Local News San Fernando Valley Los Angeles Los Angeles County SportsSportsHigh School SportsLakersClippersLA SparksDodgersAngelsCollege SportsUCLA SportsUSC SportsRamsChargersKingsDucksOlympicsBoxing/MMASoccerHorse Racing Sports High School Sports Lakers Clippers LA Sparks Dodgers Angels College Sports UCLA Sports USC Sports Rams Chargers Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Sports High School Sports Lakers Clippers LA Sparks Dodgers Angels College Sports UCLA Sports USC Sports Rams Chargers Kings Ducks Olympics Boxing/MMA Soccer Horse Racing Things To DoThings To DoRestaurants Food and DrinkMoviesAmusement ParksMusic + ConcertsTheaterTV and StreamingHome + GardenTravelComicsDaily News StoreEvents Things To Do Restaurants Food and Drink Movies Amusement Parks Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Daily News Store Events Things To Do Restaurants Food and Drink Movies Amusement Parks Music + Concerts Theater TV and Streaming Home + Garden Travel Comics Daily News Store Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnsCommentaryLetters to the EditorEditorial BoardEndorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements SCNG Premium Sponsored Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint The T.E.A. Subscribe Log In Logout Get the latest news delivered daily! **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Log In Get the latest news delivered daily! Subscribe Log In e-Edition e-Edition Crime Election Investigative Reporting Politics Health Environment Business Housing Jobs Weather Trending: ICE protests 🎓 2025 Graduations Boy killed in parking lot crash Immigration news Free and cheap things to do **‘Money in the pockets of administrators’: Charter network steers millions in taxpayer money to opaque firm tied to execs** **Elite charter schools' close relationship with a third-party provider raises questions about transparency and potential conflicts of interest.** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print For five years, Eric Shirley taught home-school students for a small California charter school network called Elite Academic Academy. He left in 2023, he said, because of several things he found fishy about Elite’s administration. Among them: Elite’s CEO Meghan Freeman lives in a mountain resort town in Montana and gets paid more than $380,000 in salary and benefits each year to serve 1,800 students. And when Elite first started in 2018 and served a few hundred students, its founder and then-CEO Brent Woodard made more than $400,000. But Shirley’s biggest concern was that Elite was paying millions of dollars a year to an obscure third-party corporation — one created by Woodard. This corporation not only employs family members of Elite administrators in high-level jobs but also has paid him six-figure sums each year as a consultant. “The intent of some of these programs is not to provide a better education,” Shirley said. “It’s to put money in the pockets of administrators.” Elite pulled in $31.7 million in public school funding last school year, according to audit reports for the network’s two schools. Shirley is one of three former Elite teachers who told The San Diego Union-Tribune they worry the charter network — which includes a school authorized out of San Diego County — is the latest in a string of examples of how operators of charter schools, which are independently run public schools, can exploit lax charter laws and oversight requirements to use taxpayer funds in questionable ways. Other examples include the now-defunctA3 charter network, whose leaders pleaded guilty to conspiracy for manipulating student enrollment to profit off of public school funding, and the Inspire charter network, whichstate auditors foundwas collecting millions in public school dollars without records to justify the collections. Elite is one of many California charter school networks that have close financial relationships with third-party, privately run corporations that have close ties to the charter’s own leaders — raising concerns from experts, educators and taxpayers about transparency and conflicts of interest in how millions of public school dollars are spent. Experts and former Elite teachers see similar practices happening at Elite. “At a bare minimum, it looks like cronyism,” said Sean McMorris, transparency, ethics and accountability program manager for California Common Cause, about Elite’s leadership structure and related-party ties. In recent years, revelations of such charter relationships have spurred calls for tougher charter auditing and oversight requirements from state lawmakers, state agency officials, local prosecutors and charter accountability advocates, but attempts to change charter laws have failed amid staunch resistance from charter schools. Two new bills, Assembly Bill 84 and Senate Bill 414, aim to improve accountability for charters and prevent future cases like A3 and Inspire. They propose, among other things, requiring increased transparency of relationships between charters and third parties and additional charter audit requirements. The Union-Tribune repeatedly tried to reach Elite officials for comment for this story, including emailing lists of questions to Woodard, Freeman and the members of Elite’s two school boards. On a Thursday afternoon visit to Elite’s headquarters in Temecula, its storefront office was locked. Nobody responded, despite repeat emails requesting comment. Before he started Elite, Woodard was the superintendent of Acton-Agua Dulce Unified, a small rural school district at the edge of the Mojave Desert that was facing declining enrollment and financial trouble. Freeman also worked there as an administrator. At Acton-Agua Dulce, Woodard pioneered what would become acontroversial revenue-generating schemeamong small school districts statewide: The district authorized many charter schools so that it could collect fees from the charters meant to pay for the costs of overseeing them. By 2017, Acton-Agua Dulce had 15 charter schools in its portfolio — including an A3 school — that together enrolled 8,900 students, dwarfing the district’s own three schools with 1,100 students, according to state data. State auditorslater concludedin October 2017 that the district, under Woodard’s leadership, had not only improperly authorized charter schools outside its boundaries but had conducted flawed oversight and reviews of charter petitions. By the time the audit’s findings were released, however, Woodard was nine months gone from the district. In 2017 and 2018, he filed petitions to create at least three Elite Academic Academy charter schools — one authorized by San Diego County’s Mountain Empire Unified School District, and two authorized by Lucerne Valley Unified, a rural district northeast of San Bernardino. (One of the Lucerne Valley-authorized schools later separated from Elite, changed its name and replaced its board members.) The mission of Elite, according to Woodard’s petitions, was to provide flexible and individualized programs for students who hadn’t succeeded in or didn’t want to attend traditional brick-and-mortar schools. “I truly believed in this model and that for children who are looking for an alternative — that together with a fantastic team, we could create something special,” Freeman said about Elite’s origins in anonline interview; she did not mention Woodard. “So that is how Elite was born.” Elite provides three schooling options for students: virtual school, hybrid school and home schooling. Most of its students are enrolled in its home-schooling model, where students are not taught directly by the school’s teachers but rather by parents and third-party vendors, under the teacher’s guidance. Like other home-schooling charters in California, Elite provides every student up to $3,700 in educational funds each year to spend on academic and enrichment activities of their parents’ choosing, provided their Elite teacher approves the expenditure. That could mean tutoring, curriculum materials, athletic training, lessons in dance, music or horseback riding, and even tuition at a private in-person academy. Elite public school dollars designated for educational services have gone to vendors including Universal Studios, Knott’s Berry Farm, San Diego Padres, Los Angeles Dodgers, Snow Valley Mountain Resort, a roller skating rink, a pottery studio, martial arts and gymnastics schools and “enrichment centers” that offer in-person instruction like schools do, Elite’s warrant registers show. Elite wasn’t the only organization Woodard created. In 2019, Woodard filed papers with the state to create a nonprofit corporation called Prime Educational Solutions that would go on to take millions of dollars of revenue annually from the Elite schools he had created. Prime is based in Temecula; the address listed on its tax filings is a UPS Store. Prime’s purpose as an organization is to provide services to Elite, according to Prime’sarticles of incorporationandtax filings. Elite is the sole client of Prime. Government accountability experts say the arrangement creates the potential for a conflict of interest. “On its face, it looks like self-enrichment,” McMorris said of the relationship between Prime and Elite. Prime handles or assists Elite with a wide range of services, including finance management, human resource management, record-keeping, IT, marketing and coordination of special education services. Prime even schedules Elite’s board meetings and prepares Elite’s board agendas, according toElite’scontractswith Prime. In return, the Elite schools have paid Prime 10% of their revenue, plus other fees, their contracts with Prime show. The Elite schools expect to pay at least $3.7 million to Prime this school year, according to the schools’ board documents. Prime was intended not only to provide services to Elite but to control Elite’s operations, Elite’s original bylaws show. In 2020, Elite’s bylaws had listed Prime as its sole controlling entity, meaning Prime could choose Elite’s board members and change Elite’s articles or bylaws. However, Elite’s two school boardschangedElite’s bylaws in June 2020 to remove Prime’s sole member title. Elite’s arrangement with Prime, as a private corporation, obscures details of how millions of its public school dollars are ultimately spent. By having a separate back-office provider handle operations, rather than the schools themselves, Elite’s public funding can be spent through an outside private corporation that is not held to public transparency laws the way charter schools are — even though Prime functions as an extension of Elite’s operations. “They’re basically one and the same, because the only revenue Prime receives is from Elite,” Shirley said. McMorris questions why Prime is handling many of the duties that the Elite schools could be handling themselves. “Why not just set up this operation within the school … rather than set up a separate entity to funnel state money from the school to this contractor, where there’s presumably less oversight and regulation?” he said. Shirley is concerned that Prime can act as a vehicle for Elite dollars to be spent in ways that are not allowable for public schools. He referenced an Elite-organized staff party at a Temecula winery in 2021, for which Prime provided alcohol, as an example. The few publicly available documents about Prime also show it spends a significant amount of its revenue on executive pay. About a third of the $2.4 million that Prime spent in fiscal 2023 went to compensation for Prime’s officers, according to the organization’stax filing. At the time, Prime employed just 17 people. Prime’s CEO Catherine Heredia was paid more than $295,000 in salary and benefits that year, and Chief Personnel Officer Tracy Hasper more than $243,000. And several of Prime’s executives are family members of Elite staff, according to Elite’s employee directory and public records. Adam Woodard is Prime’s finance director. Adam and Tracy Hasper are administrators for Elite and Prime, respectively, and each was a founding board member for the Elite schools. Sam Heredia works for Elite, and Vincent Heredia works for Prime. Two board members of Prime, Tony Jacob and Daniel Jacob, co-own an engineering company that has received contract work from Acton-Agua Dulce Unified, where Woodard was superintendent. When Elite opened in 2018, the Jacobs were listed as officers of Elite on state filings. Heredia and the Jacobs did not respond to multiple requests for comment. It’s not uncommon for a California charter network to have a close relationship with a third-party corporation; that was the case with both the A3 and Inspire charter networks. Such arrangements have raised concerns among government accountability advocates because these third-party corporations often havesignificant controlor influence over their respective charter school clients, which provide them revenue. And when charter schools have hired these corporations as vendors, they’ve often done so without soliciting bids,raising questionsabout whether the schools are getting the best deal on services. The people holding top leadership positions at the charter and the third-party entity are also often the same people or are related, raising concerns about conflicts of interest. In the cases of Inspire, A3 and Elite, the founders created the charter schools, then went on to create the corporations that would provide the charters’ back-office services in exchange for substantial, set percentages of the charters’ revenue. Such arrangements aren’t necessarily illegal in California or an improper use of public funds. Itis illegalfor public officials — including employees of charter schools and third-party corporations that manage charters — to make or influence any decision in which they have a financial interest. Whether or not an official took part in such a decision, any related-party transactions are required to be disclosed for charter schools per national nonprofit audit standards, which charters must follow per state law. “The auditor is supposed to test for … related parties,” said Michael Fine, the CEO of California’s Fiscal Crisis & Management Assistance Team, or FCMAT, the state’s school auditing agency. “It’s all a matter of arms-length transactions. You want full disclosure out there related to those kinds of things.” The last five annual audits for both Elite charter schools do not identify Prime as a related party for Elite and do not mention Prime at all. Ajoint report about charter schools last yearby the Legislative Analyst’s Office and FCMAT called for greater transparency about third-party entities required in charter school audits — including a schedule of the charter’s 25 largest payments or transfers to organizations. The report also said the state should develop a procedure for school auditors to find out whether a charter has a relationship with a third-party entity and to see if it constitutes a material relationship. “Although these types of contracts are not necessarily illegal or a poor use of funding, the conflicts of interest prevalent in these situations can raise questions about whether funds are being used properly for the benefit of students,” the LAO/FCMAT report stated. Some Elite teachers have criticized how much Elite’s top administrators are paid — figures far higher than most local charter leaders. Founding Elite gave Woodard an immediate 70% raise from what he was making as a superintendent. In Elite’s first year of operation, when it recorded a financial deficit and had just 389 students enrolled, Woodard was compensated more than $403,000 in salary and benefits, per Elite’stax filings. That’s significantly more than what most local charter leaders make, and more than what all but one San Diego County school districtsuperintendent madeat the time, including San Diego Unified’s Cindy Marten, who made $332,000 to oversee the county’s largest district, with more than 100,000 students. Elite’s executive compensation levels are not unprecedented for charters. For example, the former CEO of Classical Academies, which gets twice as much revenue as Elite, was compensated $380,000 in 2023; the CEO of Altus Schools made more than $483,000 in 2023, per tax filings. But it’s typical for leaders of local charters, which are nonprofit schools, to receive compensation more on par with that of high school principals or district superintendents. Woodard retired from Elite in 2020 after three years at Elite. Woodard’s contract gave him aretirement incentiveof $128,611 to be paid out over three years, the equivalent of three years of Elite’s contributions to his pension. Even after he left the schools, Woodard has been paid more than half a million dollars for Elite-related work. After he retired from Elite, Woodard was hired as a consultant for Prime — which he had also founded. Prime has paid him more than $556,000 for consulting during the 2021 to 2023 fiscal years, per Prime’s tax filings. Meanwhile Freeman, Woodard’s successor CEO, was paid more than $380,000 in pay and benefits during 2022-23, according to Elite’s most recenttax filing. That includes her salary, retirement benefits, stipends and payouts of unused vacation days. Freeman has received automatic annual 3% raises, according tohercontracts. McMorris and the former Elite teachers found the salaries to be over the top, especially considering Elite’s small size. “I think they would need to justify that type of salary for two charter schools. It’s higher than what the superintendent of San Diego schools was getting,” McMorris said. Charter executive compensation isn’t necessarily something that needs to be scrutinized in the course of charter oversight, particularly if the charter is producing good results, said Tom Hutton, executive director of California Charter Authorizing Professionals. And charters are meant to have more flexibility in how they approach school operations than district schools. At the same time, charter schools are still public agencies, Hutton said. “These are public institutions that are publicly funded, and the optics are things that public schools have to be sensitive to,” he said. In addition to having founded Elite together, Woodard and Freeman both have the same residential address in the resort town of Whitefish, Mont., according to Prime’s tax filings and Montana property records. Several other Elite administrators also don’t live in California, Elite employeerecords show. Elite’s chief student development officer and compliance liaison both live in Texas, its compliance coordinator lives in Utah, its creative music coordinator lives in Washington state and its home-school director lives in Michigan. “When these people are operating in all these other states … honestly, I think it’s not appropriate,” said Kath Gray, a former Elite teacher who said she left the school in 2023 because of concerns with Elite’s management and financial practices. “It just feels like they’re more out of touch with the students and the teachers.” There’s a way high school students across Southern California can attend cheerleading camp for free — they just have to sign up for a couple summer classes through Elite. That’s according to thewebsiteof Elite Spirit Cheer and Dance, a Southern California business that offers a three-day, overnight cheer camp at a DoubleTree hotel near Palm Springs. The camp typically costs hundreds of dollars per child. But Elite Spirit advertises to families that it will be free for youths if they enroll in and complete packets for two courses offered by the Elite charter school for the summer. “It’s a win/win!!” Elite Spirit says on itswebsite. It’s a practice that mirrors what other California charters, including the Inspire and former A3 schools, have done to get more public school funds from the state than they are allowed. Here’s how it works: Vendors like Elite Spirit recruit students across Southern California — including students enrolled in other schools besides Elite — into summer-only enrichment programs advertised as no-cost. The programs enroll students into Elite for about a month during the summer. In exchange for receiving the free summer program, those students have to complete two courses for credit through Elite. Meanwhile, students remain enrolled in their regular schools during the programs — Elite Spirit, for example, says on its website that students do not have to un-enroll from their current schools in order to do the cheer camp. Charter schools have then submitted those students’ attendance hours to the state to collect school funding, which is allocated based on average daily attendance. In itscontractswith Elite Spirit, the Elite charter schools have said their payments to Elite Spirit are based on student attendance records, and complete attendance reporting will ensure it can fully pay Elite Spirit. But such a practice is essentially double-dipping from the state, A3 prosecutors and state school auditors have said, because the state is paying for the same student who is enrolled in two schools at the same time. For any students a district or charter school enrolls, the school must provide a full 175 school days of instruction, per state education code — it cannot provide just a summer’s worth of instruction, as California does not provide funding for summer-only programs, said Fine of FCMAT. Elite says on its website that its summer program, called “Level Up,” is offered “within” a year-round school calendar. But the program only runs from July 1 to Aug. 2, and Elite acknowledges many students will choose to leave the school after Aug. 2. Cristina Planchon, the Elite teacher who owns and runs Elite Spirit, did not respond to repeated requests for comment. Multiple state-level task forces of school experts and state officials have concluded that California’s system of holding charters accountable has major weaknesses and gaps, which have made it easier for charters to conduct activities they find questionable. In California, charter schools must seek permission from a public education agency to open — most often a school district. Then that agency becomes responsible for holding the charter accountable. But with hundreds of school districts that have authorized charter schools, charter oversightvariesin quality and depth from district to district. Many California virtual or home-schooling chartershave flockedto small, rural districts to authorize them; as a result, the state often relies on these small districts to watchdog several charter schools at once. California’s charter laws require little from authorizers in terms of oversight. They arerequiredto designate a staff contact for the charter, visit the charter once a year, ensure the charter submits required reports, monitor the charter’s financial condition and notify the state promptly if the charter will close. State laws also don’t require oversight for outside entities, like Prime, that have close financial and personnel relationships with charters. Recent reports following the A3, Inspire and other charter scandals haverecommendedaslew of reformsto address gaps in oversight. They have called for more oversight duties forcharter authorizers, such as regular reviews of charter spending and attendance. The agencies in charge of overseeing the Elite schools are two small rural school districts: Mountain Empire Unified in San Diego’s far East County and Lucerne Valley Unified in San Bernardino County. In both districts, the numbers of students who attend their authorized charter schools far exceed the numbers of students the districts serve in their own schools. Mountain Empire Unified has 1,980 district students and more than 2,430 students enrolled in the five virtual charter schools it oversees; Lucerne Valley Unified serves 1,010 students with nearly 10 times as many in the six virtual charter schools it oversees. Charter oversight is one of a long list of responsibilities for Mountain Empire, which is working to address more immediate challenges of its own. It’s trying to raise money to replacecrumbling facilitiesthat pose safety hazards, and it’s dealing with a financial deficit, staffing shortages, student poverty,harsh weatherthat forces school closures and more. Mountain Empire Superintendent Patrick Keeley said he has not received any complaints or concerns about Elite’s activities discussed in this story. Keeley said in an email that, as part of the district’s oversight duties, he and other district administrators communicate regularly with charter schools, answer the charters’ questions, complete funding transfers, conduct site visits and more. He said the district reviews all of its charter schools’ periodic attendance reports and financial reports, and the district does not weigh in on issues like charter school staff’s salaries and living situations. Keeley became the district’s superintendent in 2020, after the district had authorized Elite. Lucerne Valley Superintendent Peter Livingston did not respond to multiple requests for comment. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Newsroom Guidelines News Tips Contact Us Report an Error **RevContent Feed** **Most Popular** LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalismLA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism **LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism** **LA mayor orders downtown curfew as city reaches ‘tipping point’ following days of violence, vandalism** Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assistProtesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist **Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist** **Protesters return for 4th day as anti-ICE demonstrations continue in LA; Marines deployed to assist** California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearingCalifornia judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** LAUSD amps up graduation security amid immigration raids, protestsLAUSD amps up graduation security amid immigration raids, protests **LAUSD amps up graduation security amid immigration raids, protests** **LAUSD amps up graduation security amid immigration raids, protests** FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protestFBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** Newsom urges Americans to ‘not give in to’ President Trump in livecastNewsom urges Americans to ‘not give in to’ President Trump in livecast **Newsom urges Americans to ‘not give in to’ President Trump in livecast** **Newsom urges Americans to ‘not give in to’ President Trump in livecast** LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coachLAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach **LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach** **LAUSD wins reversal of $30M verdict in Long Beach boy’s death at hands of Beyond the Bell coach** Can President Trump ban masks at protests?Can President Trump ban masks at protests? **Can President Trump ban masks at protests?** **Can President Trump ban masks at protests?** Here’s what you need to know about LA’s downtown curfewHere’s what you need to know about LA’s downtown curfew **Here’s what you need to know about LA’s downtown curfew** **Here’s what you need to know about LA’s downtown curfew** Graduation 2025 schedule: Dates, times for San Fernando Valley high schools and LA colleges and universitiesGraduation 2025 schedule: Dates, times for San Fernando Valley high schools and LA colleges and universities **Graduation 2025 schedule: Dates, times for San Fernando Valley high schools and LA colleges and universities** **Graduation 2025 schedule: Dates, times for San Fernando Valley high schools and LA colleges and universities** **More in Education** Trump administration weighs withholding education funding to California over transgender athletes **Trump administration weighs withholding education funding to California over transgender athletes** **Trump administration weighs withholding education funding to California over transgender athletes** How scammers are using AI to steal college financial aid **How scammers are using AI to steal college financial aid** **How scammers are using AI to steal college financial aid** HBCUs depend on federal funding. Their leaders are walking a tightrope on Trump’s DEI attacks **HBCUs depend on federal funding. Their leaders are walking a tightrope on Trump’s DEI attacks** **HBCUs depend on federal funding. Their leaders are walking a tightrope on Trump’s DEI attacks** Trump administration asks Supreme Court to leave mass layoffs at Education Department in place **Trump administration asks Supreme Court to leave mass layoffs at Education Department in place** **Trump administration asks Supreme Court to leave mass layoffs at Education Department in place** 2025 May 25 SubscribeSign Up For Newsletterse-EditionBreaking News Sign Up For Newsletters e-Edition Breaking News Sign Up For Newsletters e-Edition Breaking News Contact UsCorrectionsLocal Job BoardDaily News StorePrivacy PolicyAccessibility Corrections Local Job Board Daily News Store Privacy Policy Accessibility Corrections Local Job Board Daily News Store Privacy Policy Accessibility About Daily NewsAbout Southern California News GroupMediaNews GroupWork With UsNews ArchiveReader’s Choice About Southern California News Group MediaNews Group Work With Us News Archive Reader’s Choice About Southern California News Group MediaNews Group Work With Us News Archive Reader’s Choice PartnersLive Traffic MapNewspapers in EducationSponsor a Student Live Traffic Map Newspapers in Education Sponsor a Student Live Traffic Map Newspapers in Education Sponsor a Student MarketplaceClassifiedLegalsObituary Classified Legals Obituary Classified Legals Obituary Advertising SolutionsGet in Touch with a Marketing StrategistRequest Media KitCreative ServicesContent Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Reader RewardsPhoto ReprintsSponsored Access Photo Reprints Sponsored Access Photo Reprints Sponsored Access Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}