{"id": 2141, "name": "The Guardian", "domain": "theguardian.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.theguardian.com/australia-news/2025/jun/11/erin-patterson-murder-trial-death-cap-mushrooms-food-dehydrator-ntwnfb", "title": "Erin Patterson Murder Trial Death Cap Mushrooms Food Dehydrator Ntwnfb", "content": "US edition UK edition Australia edition Europe edition International edition News Opinion Sport Culture Lifestyle NewsView all NewsUS newsUS politicsWorld newsClimate crisisMiddle EastUkraineSoccerBusinessEnvironmentTechScienceNewslettersWellness View all News US news US politics World news Climate crisis Middle East Ukraine Soccer Business Environment Tech Science Newsletters Wellness View all News US news US politics World news Climate crisis Middle East Ukraine Soccer Business Environment Tech Science Newsletters Wellness OpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoons View all Opinion The Guardian view Columnists Letters Opinion videos Cartoons View all Opinion The Guardian view Columnists Letters Opinion videos Cartoons SportView all SportSoccerNFLTennisMLBMLSNBAWNBANHLF1Golf View all Sport Soccer NFL Tennis MLB MLS NBA WNBA NHL F1 Golf View all Sport Soccer NFL Tennis MLB MLS NBA WNBA NHL F1 Golf CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGames View all Culture Film Books Music Art & design TV & radio Stage Classical Games View all Culture Film Books Music Art & design TV & radio Stage Classical Games LifestyleView all LifestyleWellnessFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoney View all Lifestyle Wellness Fashion Food Recipes Love & sex Home & garden Health & fitness Family Travel Money View all Lifestyle Wellness Fashion Food Recipes Love & sex Home & garden Health & fitness Family Travel Money Search inputgoogle-searchSearch Support us Print subscriptions Newsletters Download the app Search jobsDigital ArchiveGuardian LicensingAbout UsThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsWordiplyCorrectionsTips Search jobs Digital Archive Guardian Licensing About Us The Guardian app Video Podcasts Pictures Inside the Guardian Guardian Weekly Crosswords Wordiply Corrections Tips Search jobs Digital Archive Guardian Licensing About Us The Guardian app Video Podcasts Pictures Inside the Guardian Guardian Weekly Crosswords Wordiply Corrections Tips Search inputgoogle-searchSearchSearch jobsDigital ArchiveGuardian LicensingAbout Us Search jobs Digital Archive Guardian Licensing About Us Search jobs Digital Archive Guardian Licensing About Us World Europe US Americas Asia Australia Middle East Africa Inequality Global development **‘The perfect dish for them’: Erin Patterson explains why she included dried mushrooms in fatal lunch** Triple-murder accused also denies foraging death caps hours before buying food dehydrator as trial continues Who are Erin Patterson and the other key figures in Australia’s mushroom trial? Who are Erin Patterson and the other key figures in Australia’s mushroom trial? Who are Erin Patterson and the other key figures in Australia’s mushroom trial? Erin Patterson has denied leading health officials on a “wild goose chase”, and that she foraged death cap mushrooms two hours before buying a food dehydrator, a Victorian court has heard. Patterson, 50,faces three charges of murder and one charge of attempted murderrelating to poisoning four lunch guests with beef wellington served at her house in Leongatha, Victoria, on 29 July 2023. Patterson has pleaded not guilty to murdering her estranged husband Simon Patterson’s parents, Don and Gail Patterson, and his aunt Heather Wilkinson, and attempting to murder Ian Wilkinson, Simon’s uncle and Heather’s husband. Lawyers for Patterson say the death cap mushroom poisoning was a tragic and terrible accident. In her seventh day in the witness box, Patterson was again asked repeatedly by Nanette Rogers SC, for the prosecution, whether she agreed with a series of suggestions about the lunch, and her behaviour in the weeks before and after it. Patterson denied that she lied when she told the jury she had an interest in foraging for wild mushrooms, that she told that lie to explain why she put foraged death cap mushrooms in the meal after realising that buying death cap mushrooms was unlikely, and that she changed her position, after telling police she never foraged for wild mushrooms, when she realised that didn’t “stack up”. “Foraging for non-toxic mushrooms was not something you did,” Rogers asked her. “Disagree,” Patterson replied. Patterson also denied that she had made up evidence about foraging for mushrooms with her children, despite them saying in interviews with police that they could not recall having done so. “This is a story you have made up for this jury, agree or disagree,” Rogers asked. “Disagree,” she responded. Patterson also denied that she deliberately bought separate eye fillet steaks as she wanted to make individual beef wellingtons and not because she could not source a single larger “log” of eye fillet, as the recipe had called for. She agreed that she may not have needed to put additional dried mushrooms in the dish, given she had bought enough mushrooms from the supermarket for the recipe, but denied that the dried mushrooms were too “overpowering” to be included in the “special” beef wellingtons. “I thought it was the perfect dish for them,” Patterson said. Patterson also denied she had been wrong to tell police she had been “very helpful” to health authorities who were trying to find an Asian grocer she had bought dried mushrooms from, nor that she lied about buying these mushrooms. Erin Patterson hosts lunch for estranged husband Simon’s parents, Don and Gail Patterson, and his aunt and uncle Heather and Ian Wilkinson. Patterson serves beef wellington. All four lunch guests are admitted to hospital with gastro-like symptoms. Gail Patterson and Heather Wilkinson die in hospital. Don Patterson dies in hospital. Victoria police search Erin Patterson’s home and interview her. Ian Wilkinson is discharged from hospital after weeks in intensive care. Police again search Erin Patterson’s home, and she is arrested and interviewed. She is charged with three counts of murder relating to the deaths of Don and Gail Patterson and Heather Wilkinson, and the attempted murder of Ian Wilkinson. Jury is sworn in. Murder trial begins. Jury hears that charges of attempting to murder her estranged husband Simon are dropped. “You sent them on a wild goose chase, trying to locate this Asian grocer, correct or incorrect?” Rogers asked. “Incorrect,” Patterson replied. She also said she did not know or suspect that Don and Gail were ill because of eating the beef wellington at the time she decided to feed leftovers of the dish to her children for dinner the night after the lunch. Rogers said it was alleged Pattersonvisited Loch in April and Outtrim in Mayafter posts were made on the website iNaturalist identifying sightings of death cap mushrooms in the nearby towns. Rogers said that Patterson picked death cap mushrooms in Loch on 28 April 2023, and within two hours of finding them went and bought a Sunbeam food dehydrator to dry them. Patterson denied that she had seen the iNaturalist posts, or deliberately visited the towns on the dates in which the prosecution alleges her phone data suggests she did so. The court has previously heard that Patterson dumped the food dehydrator at a local tip the week after the lunch. It was later recovered by police and a forensic examination uncovered her fingerprints and traces of death cap mushrooms. Patterson admits she dumped the food dehydrator, saying she did so in a panic about a visit child protection authorities were planning to make, and the fact she says Simon accused her of using it to poison his parents. Patterson’s supreme court trial at the Latrobe Valley law courts in Morwell will continue on Thursday, when she is expected to give evidence for an eighth day. It is the seventh week of a trial that had been estimated to last five to six weeks. Victoria news **More on this story** **More on this story** Moira Deeming offered John Pesutto chance to avoid bankruptcy on condition Liberal party assured her preselection11h ago **Moira Deeming offered John Pesutto chance to avoid bankruptcy on condition Liberal party assured her preselection** **Moira Deeming offered John Pesutto chance to avoid bankruptcy on condition Liberal party assured her preselection** While friends were partying, Conor was preparing for court. His case has now prompted Labor to act on family violence1d ago **While friends were partying, Conor was preparing for court. His case has now prompted Labor to act on family violence** **While friends were partying, Conor was preparing for court. His case has now prompted Labor to act on family violence** Monash IVF admits second bungled embryo implant, this time at Victorian clinic2d ago **Monash IVF admits second bungled embryo implant, this time at Victorian clinic** **Monash IVF admits second bungled embryo implant, this time at Victorian clinic** Thirteen people rescued after spending night in cars amid heavy snowfall across Victorian and NSW alps3d ago **Thirteen people rescued after spending night in cars amid heavy snowfall across Victorian and NSW alps** **Thirteen people rescued after spending night in cars amid heavy snowfall across Victorian and NSW alps** ‘I’m not done fighting’: diagnosed with MND, Victorian MP Emma Vulin still has a lot to achieve3d ago **‘I’m not done fighting’: diagnosed with MND, Victorian MP Emma Vulin still has a lot to achieve** **‘I’m not done fighting’: diagnosed with MND, Victorian MP Emma Vulin still has a lot to achieve** Foraged mushrooms, fatal doses and food binges: the week Erin Patterson told her story to triple murder trial6d ago **Foraged mushrooms, fatal doses and food binges: the week Erin Patterson told her story to triple murder trial** **Foraged mushrooms, fatal doses and food binges: the week Erin Patterson told her story to triple murder trial** Supporters of John Pesutto question Victorian Liberals’ priorities over reluctance to bail out former leader4 Jun 2025 **Supporters of John Pesutto question Victorian Liberals’ priorities over reluctance to bail out former leader** **Supporters of John Pesutto question Victorian Liberals’ priorities over reluctance to bail out former leader** Power to expel students for poor behaviour outside school criticised as adding to Victorian educators’ workload4 Jun 2025 **Power to expel students for poor behaviour outside school criticised as adding to Victorian educators’ workload** **Power to expel students for poor behaviour outside school criticised as adding to Victorian educators’ workload** Mushrooms, foraging and venting on Facebook: after weeks of silence, Erin Patterson begins to tell court her side of the story3 Jun 2025 **Mushrooms, foraging and venting on Facebook: after weeks of silence, Erin Patterson begins to tell court her side of the story** **Mushrooms, foraging and venting on Facebook: after weeks of silence, Erin Patterson begins to tell court her side of the story** Victorian man sentenced for attacks on men he met on Grindr says TikTok vigilante videos inspired him3 Jun 2025 **Victorian man sentenced for attacks on men he met on Grindr says TikTok vigilante videos inspired him** **Victorian man sentenced for attacks on men he met on Grindr says TikTok vigilante videos inspired him** **Most viewed** **Most viewed** World Europe US Americas Asia Australia Middle East Africa Inequality Global development News Opinion Sport Culture Lifestyle About us Help Complaints & corrections SecureDrop Work for us Privacy policy Cookie policy Terms & conditions Contact us All topics All writers Digital newspaper archive Tax strategy Facebook YouTube Instagram LinkedIn Newsletters Advertise with us Guardian Labs Search jobs Tips"}