{"id": 1806, "name": "Stillness in the Storm", "domain": "stillnessinthestorm.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://stillnessinthestorm.com/benjamin-fulford-april-1abenjamin-fulford-april-21st-2025-the-death-of-pope-francis-and-king-charles-means-western-satanic-rule-is-ending-4th-2025-khazarian-mafia-messiah-candidate-marco-returns/", "title": "Benjamin Fulford April 1abenjamin Fulford April 21st 2025 The Death Of Pope Francis And King Charles Means Western Satanic Rule Is Ending 4th 2025 Khazarian Mafia Messiah Candidate Marco Returns", "content": "Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Home About Donate StartContactWe Need Your Support (Donate)Newsletter SignupDailyWeeklyInto the Storm (Hosted by Justin Deschamps)Follow Our Social MediaBest Telegram Channels & GroupsDiscernment 101Media Archive (Shows, Videos, Presentations)Where’s The Hope Contact We Need Your Support (Donate) Newsletter SignupDailyWeekly Daily Weekly Into the Storm (Hosted by Justin Deschamps) Follow Our Social Media Best Telegram Channels & Groups Discernment 101 Media Archive (Shows, Videos, Presentations) Where’s The Hope Contact We Need Your Support (Donate) Newsletter SignupDailyWeekly Daily Weekly Daily Weekly Into the Storm (Hosted by Justin Deschamps) Follow Our Social Media Best Telegram Channels & Groups Discernment 101 Media Archive (Shows, Videos, Presentations) Where’s The Hope BrowseEditor’s Top Content (Start Here)Best CategoriesConsciousnessConspiracyDisclosureExtraterrestrialsHistoryHealthNWO Deep StatePhilosophyOccultSelf EmpowermentSpiritualityBy AuthorJustin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast)Adam AstroYogi SanchezAmber WheelerBarbara H Whitfield RT and Charles L Whitfield MDChandra LoveguardConscious OptimistMarko De FrancisLance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation ProtectionRyan DelarmeWill Justice Editor’s Top Content (Start Here) Best CategoriesConsciousnessConspiracyDisclosureExtraterrestrialsHistoryHealthNWO Deep StatePhilosophyOccultSelf EmpowermentSpirituality Consciousness Conspiracy Disclosure Extraterrestrials History Health NWO Deep State Philosophy Occult Self Empowerment Spirituality By AuthorJustin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast)Adam AstroYogi SanchezAmber WheelerBarbara H Whitfield RT and Charles L Whitfield MDChandra LoveguardConscious OptimistMarko De FrancisLance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation ProtectionRyan DelarmeWill Justice Justin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast) Articles Into The Storm (on EdgeofWonder.TV) Awarewolf Radio (Podcast) Adam AstroYogi Sanchez Amber Wheeler Barbara H Whitfield RT and Charles L Whitfield MD Chandra Loveguard Conscious Optimist Marko De Francis Lance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection Ryan Delarme Will Justice Editor’s Top Content (Start Here) Best CategoriesConsciousnessConspiracyDisclosureExtraterrestrialsHistoryHealthNWO Deep StatePhilosophyOccultSelf EmpowermentSpirituality Consciousness Conspiracy Disclosure Extraterrestrials History Health NWO Deep State Philosophy Occult Self Empowerment Spirituality Consciousness Conspiracy Disclosure Extraterrestrials History Health NWO Deep State Philosophy Occult Self Empowerment Spirituality By AuthorJustin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast)Adam AstroYogi SanchezAmber WheelerBarbara H Whitfield RT and Charles L Whitfield MDChandra LoveguardConscious OptimistMarko De FrancisLance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation ProtectionRyan DelarmeWill Justice Justin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast) Articles Into The Storm (on EdgeofWonder.TV) Awarewolf Radio (Podcast) Adam AstroYogi Sanchez Amber Wheeler Barbara H Whitfield RT and Charles L Whitfield MD Chandra Loveguard Conscious Optimist Marko De Francis Lance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection Ryan Delarme Will Justice Justin DeschampsArticlesInto The Storm (on EdgeofWonder.TV)Awarewolf Radio (Podcast) Articles Into The Storm (on EdgeofWonder.TV) Awarewolf Radio (Podcast) Articles Into The Storm (on EdgeofWonder.TV) Awarewolf Radio (Podcast) Adam AstroYogi Sanchez Amber Wheeler Barbara H Whitfield RT and Charles L Whitfield MD Chandra Loveguard Conscious Optimist Marko De Francis Lance SchuttlerEMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection Ryan Delarme Will Justice ProductsEMF Harmonized (Cell Phone, Wi-Fi, Radiation ProtectionEarth Science & EnergyFree EnergyAI and TranshumanismSpaceNikola TeslaETAncient TechnologyCrop CirclesUFOsConspiracyAnti NWO Deep StateDomestic SpyingFreemasonryLaw & Legal CorruptionMass Mind ControlNWO ConspiracyPolice State and CensorshipPropagandaSnowden ConspiracySocial EngineeringMisc.Council on Foreign RelationsMusic IndustryParanormalPedagate and PedophiliaQ AnonSecret Space ProgramWhite Hat EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection Earth Science & Energy Free Energy AI and Transhumanism Space Nikola Tesla ETAncient TechnologyCrop CirclesUFOs Ancient Technology Crop Circles UFOs ConspiracyAnti NWO Deep StateDomestic SpyingFreemasonryLaw & Legal CorruptionMass Mind ControlNWO ConspiracyPolice State and CensorshipPropagandaSnowden ConspiracySocial Engineering Anti NWO Deep State Domestic Spying Freemasonry Law & Legal Corruption Mass Mind Control NWO Conspiracy Police State and Censorship Propaganda Snowden Conspiracy Social Engineering Misc.Council on Foreign RelationsMusic IndustryParanormalPedagate and PedophiliaQ AnonSecret Space ProgramWhite Hat Council on Foreign Relations Music Industry Paranormal Pedagate and Pedophilia Q Anon Secret Space Program White Hat EMF Harmonized (Cell Phone, Wi-Fi, Radiation Protection Earth Science & Energy Free Energy AI and Transhumanism Space Nikola Tesla ETAncient TechnologyCrop CirclesUFOs Ancient Technology Crop Circles UFOs Ancient Technology Crop Circles UFOs ConspiracyAnti NWO Deep StateDomestic SpyingFreemasonryLaw & Legal CorruptionMass Mind ControlNWO ConspiracyPolice State and CensorshipPropagandaSnowden ConspiracySocial Engineering Anti NWO Deep State Domestic Spying Freemasonry Law & Legal Corruption Mass Mind Control NWO Conspiracy Police State and Censorship Propaganda Snowden Conspiracy Social Engineering Anti NWO Deep State Domestic Spying Freemasonry Law & Legal Corruption Mass Mind Control NWO Conspiracy Police State and Censorship Propaganda Snowden Conspiracy Social Engineering Misc.Council on Foreign RelationsMusic IndustryParanormalPedagate and PedophiliaQ AnonSecret Space ProgramWhite Hat Council on Foreign Relations Music Industry Paranormal Pedagate and Pedophilia Q Anon Secret Space Program White Hat Council on Foreign Relations Music Industry Paranormal Pedagate and Pedophilia Q Anon Secret Space Program White Hat Sign Up Election Fraud PartnersEMF HarmonizedAscent Nutrition EMF Harmonized Ascent Nutrition EMF Harmonized Ascent Nutrition Stillness in the Storm An Agent for Consciousness Evolution Our Story Support Us Contact Wednesday, June 11, 2025 Store Our SocialBitChuteCloutHubGabGab TVGettrMeWeMeWe GroupMindsRumbleSubscribeStarTelegramBest Telegram Channels and GroupsTwitter (Justin Duchamps)YouTube BitChute CloutHub Gab Gab TV Gettr MeWeMeWe Group MeWe Group Minds Rumble SubscribeStar TelegramBest Telegram Channels and Groups Best Telegram Channels and Groups Twitter (Justin Duchamps) YouTube BitChute CloutHub Gab Gab TV Gettr MeWeMeWe Group MeWe Group MeWe Group Minds Rumble SubscribeStar TelegramBest Telegram Channels and Groups Best Telegram Channels and Groups Best Telegram Channels and Groups Twitter (Justin Duchamps) YouTube **Benjamin Fulford — April 21st, 2025: The death of Pope Francis and King Charles means Western Satanic rule is ending.** Friday, April 25, 2025ByStillness in the Storm1 Comment (Stillness in the Storm Editor)Benjamin Fulford is the formerToyko Bureau Chief of Forbes Magazine, who claims to have insider connections. He issues weekly reports that Stillness in the Storm has been reposting for years. See the section below his newsletter for our commentary on his reports. The following is only half of the full report, in honor of Ben’s wishes. The remaining portion will be updated to this article on early Thursday morning, along with being posted as an independent article. Source – Benjamin Fulford byBenjamin Fulford, April 21st, 2025 **The Pope is dead** **They don’t want us to share the truth. We need your help to keep doing it anyway.** Buy us a coffee if you appreciate what we do. **(DonateHERE)** **No, Trump is not a clone or avatar.** Fulford is claiming Trump is an avatar or clone. I don’t think this is true. This is one of the many claims Fulford makes without any supporting evidence. Trump’s facial geometry and mannerisms suggest he hasn’t been replaced he has just gotten older. Similarly, Elon Musk is not an avatar. Videos edited to look like skin is pulled in strange ways are making the rounds to suggest or support the claim that some world figures are body doubles or masked. While there is a case to be made for the fact body doubles have been used most of these videos are not credible in my view. Additionally, there are AI videos making the rounds as well, one of which is of Ursula von der Leyen. Practice wise discernment, be vigilant. **Fulford’s Report:** The announced death of Pope Francis and the imminent announcement of the death of King Charles means the Satanic rule of the West is ending. P3 Freemasons say the new Pope is Cardinal Louis Antonio Tagle from the Philippines. https://en.wikipedia.org/wiki/Luis_Antonio_Tagle This is because the Philippines has gold to back the new financial system. These events may have been triggered by the death of Richard Armitage. The case of Richard Armitage, former number two at the US State Department, shows howliterallya Satanic cult took over governments in the West. This cult is also called the Nazis, the German DVD, Chabad, etc, and is what we call the Khazarian Mafia. Its roots date back to the ancient Satanic terror state of Assyria. It is now being dismantled by Western military intelligence white hats as the Armitage case shows. Armitage, who died on April 13th, was related to the notorious Satanist Aleister Crowley and was a cousin of Crowley’s daughter Barbara Bush. If you compare the pictures below of Armitage and Crowley the family resemblance is undeniable. Some sources say he was the top-ranking Satanist in the West. We cannot confirm this but, he has been the de facto ruler of Japan for over the past two decades. His case illustrates in detail how the Satanists use extreme terror to control the top levels of governments. In 2000, he had former Japanese Prime Minister Noboru Takeshita taken to Alaska where he was chased naked in the snow by a helicopter before being brutally beaten to death. A video of his murder has since been shown to top Japanese leadership as a warning of what would happen if they tried to disobey or sell Japan’s holdings of US Treasuries. This was told to me by both a member of the Japanese imperial family and a top Japanese military intelligence official who had been shown the video. I have repeatedly said this in public and Armitage never denied it. Following that event, Armitage becamedefacto dictator of Japan. His Armitage Nye reports have been the working orders for the Japanese government since 2000. https://www.csis.org/programs/japan-chair/projects/armitage-nye-reports-us-japan-alliance The result was Japan stopped being run by intelligent bureaucrats and instead was systematically looted by KM hedge funds. Our sources say Armitage died while being questioned by military white hats about his world-spanning satanic control network. He sang like a canary and it is now being dismantled. This is not just about Japan, it is about most Western countries, I remember asking George Soros and Paul Wolfowitz about the families that owned the Federal Reserve Board and each showed an expression of sheer terror before evading the question. This system of terror is still in place in the United States and other Western countries. Henry Makow -who has done a lot to expose this Satanic- cult says “I asked Mike Adams, Greg Hunter, and Candice Owens to interview me (Never mind Tucker Carlson, Stew PetersorJoe Rogan.)…No one wants the ugly truth. Trump, Putin & Netanyahu belong to Chabad, a Jewish supremacist cult that plans to genocide ‘non-Jews’ again under the guise of another world war.” https://www.henrymakow.com/ While I think he fails to understand Chabad uses avatars of Trump and Putin to make it look like they support genocide, he is right to assert most of the alternative media is controlled opposition. We have also contacted these and other prominent people for interviews and have been turned down. One of them, who is a household name, explained they would be killed if they agreed to an interview. These controlled opposition pundits have to operate within allowed talking points. For example, they all warn against real ID saying it will impinge on our freedoms. Guess what, real ID has existed for a long time. NSA people told me years ago that if you have a credit card, they can track you and listen in on you using it. Never mind that your mobile is a GPS-enabled listening device. So, these people are false, controlled opposition distracting us with a false issue to oppose. Makow is right to claim Chabad wants to kill 90% of humanity and then have each member of the KM control 2800 slaves in perpetuity. This is their planned new world order. To understand how pervasive their propaganda operations are, despite being around 0.12% of the world’s population, Israel accounted for … almost 50% of all 4chan posts; about 226 Million! They have a similar grip over other such media. To break free from this mind control we need a military attack on Chabad and families like the Rothschilds and Rockefellers. This is justified because they use terror against prominent peoplein order tocarry out a genocidal agenda. They also control the Federal Reserve Board but, not for long. British intelligence, the Russian FSBandDonald Trump are now part of an alliance that is taking down this Satanic cult. This process is now well underway. The attacks by Trump against FRB Chairman Jerome Powell are a case in point: “Oh he’ll leave if I tell him… If I want HIM out, he’ll be out of thereREAL fast.” This is not just about removing the Fed Chair, it is about seizing control of their magic money-printing machine. The head of British MI6 says Powell was involved in the “highly illegal” act ofhavingthe FRB fraudulently buy theirownTreasuries via the Cayman Islands, Luxembourgandcryptocurrency funds. “If the demand is being artificially kept up to suppress the yield and consequently the costs of the interest payment by the US Treasury then it amounts to fraud which is a crime. Irrespective of the jurisdictions of The Cayman Islands and Luxembourg the whole thing needs to be looked at.” He adds “This is the most serious indictment of a national treasury I have ever seen and far worse than the LIBOR [scandal].” The ongoingtakeover of the Fed is whatis behind news reports that Trump will not be meeting with the fake King Charles, whohas been used by the KMas a signatory for FRB fund releases. It may also be why Vice President JD Vance met the Pope during Easter. “Look carefully at the video. The guy in the mask looks totally out to lunch,” comments a Pentagon source. After the meeting and just before this report went live, the fake pope was pronounced dead. https://www.theepochtimes.com/world/pope-francis-dies-aged-88-after-suffering-long-illness-5844965?utm_medium=app&c=share_pos3&pid=iOS_app_share&utm_source=iOS_app_share What is now happening is that specialists are building the “future iteration” of the financial system andare going to“migrate the data sets etcetera etcetera.” This is needed because America’s savings rate has collapsed to0.6pcof GDP. The US treasury depends on foreign investors to fund a national debt rising higher than ever before. The treasury must roll over33pcof its $36 trillion federal debt over the next 12 months. No foreigners are buying which is why a deal is being reached with the Asians for a jubilee. US Treasury Secretary Scott Bessent is being kept out of the loop because “He failed our vetting on a phone call with someone else on Sunday night.” MI6 wasapparentlyreferring to a call Bessent made to Alex Soros.They suspect Alex is the heir to Soros Sr.whothey describe as “the Director General of the infamous DVD Dachau aka Fourth Reich.Bitof a bombshell but they all keep cropping up that whole bunch.” Here is a report by Gordon Duff outlining how Anglo Saxon five eyes intelligence sees the DVD: https://www.theinteldrop.org/2025/04/17/the-dvd-legacy-intelligence-infrastructure-of-the-postwar-reich/ As an example of their control network, here you can watch Pocahontas Senator Elizabeth Warren warn the stock market will crash if President Trump fires Fed Chair Jerome Powell. In addition to taking over the Fed, the alliance is now going after the Nazi regimes in Europe. There are many news reportstoback this claim.Last week the head of the Satanic Rothschild clan. Jean Michel de Rothschild (akaBrigitte Macron) had a conference in Paris with US leaders. After the meeting, Secretary of State Marco Rubio said, “If there is no compromise in the next few days, the US withdraws from the war in Ukraine, it is not our war…we just gonna walk away.” “Russia needs to move, too many people are dying,” U.S. President Donald Trump wrote on social media on Friday, referring to negotiations to end the war in Ukraine. https://kresy.pl/wydarzenia/regiony/ameryka/trump-apeluje-o-ruch-ze-ruch-ze-rosji-rso-rosji-ws-negocjac-musza-ruszyc/ What this means is that Trump hasbasicallygiven the Russians the go-ahead to clean up the EU. Without the US it is game over for Ukraine. This is why the “US Fox News Channel Calls Kyiv Part of Russia While Broadcasting Easter Service” https://sputnikglobe.com/20250420/us-fox-news-channel-called-kiev-part-of-russia-while-broadcasting-easter-service-1121898450.html White hat five-star general Douglas MacGregor explains why the US military is unwilling to fight for Vladimir Zelensky and his regime: “Zelensky is a criminal, he was a nothing comedian who spoke only Russian and had been raised in Russia had no real connection to Ukraine in any way shape or form and was picked by one of the oligarchs and Victoria Nuland and the rest of these people to be the puppet for Ukraine…. They are all part of the same cabal. Most of the people who want us to double down on Ukraine want us to expand the war in the Middle East and go to war with virtually everyone in the region until the entire Middle East is subjugated to Israeli dominance and hegemony so…we have either got to wake up and dispose of these people and get them out because they present a clear and present danger to the survival of our country or, we go under…People were surprised to hear we wereactuallysupporting Al Qaeda and ISIS against the Houthis.” MacGregor adds: “A friend of mine in the French army said Doug the only thing the French Army is organized to do right now is go on safari in Africa.” Polish intelligence also confirms Germany, the Baltic StatesandFrance could not hold out against Russia for more than a few weeks. https://futuredefensevisions.blogspot.com/ The Russians will now make their move. “It is, indeed, I’m not ironical now, incomprehensible how the European Union is openly willing to resume the European Nazi ideology…we will do everything to make sure that this ideology…is eliminated once and forever, and that Europe returns to its values,” Russian Foreign Ministry Sergey Lavrov promises https://tass.com/politics/1946483 The end of KM rule in Europeis coincidingwith the end of KM rule in the Middle East. In Afghanistan, Russia is now helping the Taliban dismantle KM heroin and terror networks. Russia’s government has now recognized Afghanistan’s Taliban government, opening the way for “large projects, including the trans-Afghan railway and…the Turkmenistan-Afghanistan-Pakistan-India gas pipeline project, on hold since the 2010s. https://tass.com/pressreview/1945531 Working with Russia, the Trump regime has rejected KM Israeli plans to attack Iran. This means the people who have been trying to start World War III by chanting “bomb, bomb, bomb, bomb Iran” for over thirty years have been sidelined. Iranian government sources say the KM agents in Iran who were part of this project to start an artificial Armageddon are being hunted down. They say an agreement with the US has led to the price of gold and the US dollar plummeting in Iran, bringing down the prices of all other goods: The Iranian bazaar and the middlemen are liberals and are in favor of KM and, therefore, against the Mullahs. These people took advantage of the devaluation of the Iranian currency against the US dollar and the US sanctions against Iran. They buy all goods from domestic producers, hoard them, and create an artificial shortage, which results in much higher prices than they would have been without hoarding. The Iranian Central Bank has drained liquidity from the system to a dangerous level, to a degree that people cannot afford to pay high prices anymore. When people don’t buy goods, the bazaar and middlemen will suffer. Any agreement between Iran and the US that lifts the sanctions and unblocks the massive Iranian foreign currency reserves will crash the US dollar and make these liberals run for cover. The sources say, in the most recent move, Trump has unblocked $12 billion frozen US dollars to let Iran buy Western Airplanes. The same people who have been trying to get us into war with Iran have subverted Christianity. White hat intelligence honcho Gordon Duff writes: The Rothschild financial network—ostensibly secular—has long been the silent funder of experimental technologies tied to control, not advancement. But more shocking is the religious subversion architecture that supports it. As outlined in the Schofield Reference Bible, a document funded and distributed by Zionist-aligned interests in the early 20th century, American evangelical Christianity was deliberately weaponized and inverted. The goal: reframe Christian theology into a militarized, Zionist-friendly, apocalyptic force that would both serve geopolitical agendas and spiritually sterilize the American conscience. The result? Christianity in the U.S. was satanized—its compassion redirected toward war, its mysticism gutted, its language hijacked by corporate prophecy networks. The Church, once a threat to technocratic occultism, became its useful host. [the_ad_group id=”25840″] https://www.theinteldrop.org/2025/04/01/on-emergent-ai-life-hidden-suffering-and-the-occult-architecture-of-shadow-47/ They enforced their messianic war-mongering propaganda with widespread murder. Here you can watch Colonel Gaddafi exposed live on CNN it wasn’t Osama Bin Laden who was responsible for the 9/11 attacks, it was America. He was then murdered. Syria is another example. Turkish commentator Yasin Aktay says Turkey overthrew Syrian dictator Bashar Assad because he secretly worked with Israel and the KM to depopulate Syria. He says the Israelis and Americans could have easily overthrown him but, instead watched silently as if he didn’t “kill the kids in Daraa, open fire on mourners, didn’t torture and massacre hundreds of thousands in Sednaya, didn’t bomb hisownpeople with artillery and barrel bombs, didn’t slaughter a million Syrians with help from Russia and Iran, didn’t displace 12 million people.” https://www.yenisafak.com/en/columns/yasin-aktay/assad-or-the-us-israel-axis-were-actually-saying-theyre-all-complicit-3701025 Think about that for a minute, there is all this media angst about 50,000 killed in Gaza and complete silence about millions murdered by the same people in Syria. Now that the US is withdrawing its troops from Syria under Turkish pressure, the US State Department is warning about terrorist attacks there. Translation: having lost the ground war in Syria, the Israelis are now resorting to terrorism. The real Jews of Israel (soon to be Judea) are now in open revolt against their terrorist government. In April the following groups signed various letters calling for an end to the genocide in Gaza and elsewhere: 970 Israeli Air Force reservists 150 retired naval officers 1,525 soldiers of the Armed Corps (armored cavalry) More than 250 veterans of Unit 8200, the electronic intelligence unit 1,500 veterans of IDF infantry units, paratroopersandspecial forces 100 alumni of the National Security College — where top military, defenseandgovernment officials continue their education Hundreds of Shin Bet veterans 3,000 education officials About 200 graduates of the prestigious Talpiot program, 200 police commissioners, commandersandofficers of the Israeli police About 250 veterans and reservists of the elite naval commando unit Shayet 13 About 500 graduates of the Israeli Navy’s elite officer course, including four former Israeli Navy commanders https://www.voltairenet.org/article222112.html What all this means is that Satanyahu is toast. Trump (the real one, not the Zionist fake) is now continuing to dismantle the KM network inside the US. Republican Senator Lisa Murkowski of Alaska -who once voted to convict Trump on the J6 false flag- says she is concerned about potential “retaliation” from President Donald Trump’s administration this week….. “We are all afraid,” Murkowski says https://www.newsweek.com/lisa-murkowski-donald-trump-retaliation-republican-2061115 Another prominent Nazi being taken down is John Ashcroft, attorney general under George W. Bush. Ashcroft was at the heart of the high-profile cover-up of the Oklahoma City bombing, according to attorney Jesse Trentadue https://kennethtrentadue.com/pdf/info1.pdf ABC News 20/20 reports on how someone called the Executive Secretariat in DC about a half hour before the OKC bombing and said “The Murrah building has just been bombed” https://x.com/okc_facts/status/1913635437945737222?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1913635437945737222%7Ctwgr%5E682b4dd6038b6fcc52bcad999ab6102a106f8b18%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.zerohedge.com%2Fpolitical%2Fokc-anniversary-bush-era-swamp-creature-revealed-be-key-figure-bombing-coverup The building was blown up to destroy evidence that would have incriminated the Clintons and the Bushes and their international narcotics network. Also, in a sign the few remaining brainwashed masses are being woken up, Tucker Carlson has begun exposing the 911 Bush/Nazi truth. https://tuckercarlson.com/tucker-show-curt-weldon We are also seeing a campaign against Nazi-compromised and blackmailed UK Prime Minister Keir Starmer. He just confirmed he got an HIV test. MI6 sources say Starmer was tested for AIDS because of CCTV footage allegedly showing him and Lord Alli (pictured below) in compromising positions inside a private office. In Canada meanwhile, the People’spartyis offering itself as an alternative to a Freemason government upcoming election. The removal of compromised politicians is likely to lead to much bigger things. Here is an example sent to us via Polish intelligence: The Chemtrail Task Force is ON. No more theories. No more denials. On President Trump’s direct orders, this elite unit is dismantling the Deep State’s weather warfare program, targeting rogue operations embedded within NOAA—the so-called “National Oceanic and Atmospheric Administration.” But NOAA was not protecting the climate. It was waging war on the American people. NOAA: The Trojan Horse of the Deep State What looked like a climate agency wasactuallya chemical weapons division, disguised as “climate research.” Inside sources now confirm: — The chemtrail flights were conducted from NOAA-controlled runways. — Internal data models tracked population response to chemical exposure — The secret group “Spray Chiefs” organized the entire operation This wasn’t research. This was biological experimentation. Population suppression. Atmospheric control. And the public was NEVER supposed to know. The silent war in the sky is over – and justice is coming Trump’s task force is naming names. Indictments are being filed. These Spray Chiefs—bureaucrats in lab coats—believed they were immune, protected by fake credentials and media silence. They were wrong. Evidencehas been intercepted. Communicationshave been intercepted. Criminalproceedings are ongoing.Some of these agents are already changing their minds to avoid treason charges. Betrayal from 30,000 feet. Now they’re falling. Total media blackout = total complicity Where is the press? Where is the outrage? NOWHERE. MSM silent. CNN, andNYT, areall silent. They are not ignoring the story because it is false, they are covering up the crime. Every time they remain silent, they prove they were involved. This is federal treason. And the media is guilty too. The reckoning has only just begun :white_check_mark: Pilots testify :white_check_mark: Servers are under attack :white_check_mark: More insiders are falling over And that’s just the beginning. Other agencies are next. The war in the sky was the first phase – the clean action came. In another sign some highly unusual announcements are coming up, Jeff Bezos has just carried out an occult ceremony with anobviouslyfake space journey to try to wake up the sleeping masses and promote his version of technocracy. More on the fake Blue Origin occult sex-magic ritual phallic flight can be seen from Greg Reese in the link below: https://gregreese.substack.com/p/occult-sex-magic-rituals-for-the?publication_id=706779&post_id=161627455&r=1dkxnn&triedRedirect=true Then we get this: The US possesses technology that can “manipulate” and “bend time and space,” White House innovation czar Michael Kratsios has claimed. “Our technologies permit us to manipulate time and space. They leave distance annihilated, cause things to grow, and improve productivity,” he stated, without elaborating. Later in his speech, Kratsios insisted that overcoming the “sclerosis of the state” would enable Americans to achieve “scientific discoveries that will bend time and space, make more with less, and drive us further into the endless frontier.” https://www.rt.com/news/615871-us-manipulates-time-space/ Could this be why Trump says “I think we’re gonna makea very gooddeal with China.” Trump sounds very confident, adding he’s certain “NOBODY can compete with us, nobody.” https://trump.news-pravda.com/world/2025/04/17/117054.html It sounds like Trump is counting on hitherto secret technology as his main bargaining chip in upcoming negotiations with China. It better be real because otherwise, the US does not have a strong hand. When he said he would raise tariffsupto 245% on imports to the U.S. from China, the Chinese dismissed the move as “meaningless.” The fact is exportsto the US are worth only 2.7% of Chinese GDP. Also, the US would go bankrupt before it could start making its’own stuff again. For example, if the US wanted to start making its’own iPhones again, the first deliveries would not start until 2028 and each phone would cost over $3000. The Chinese have a lot more gold than they have been saying.The CCP has accumulated 32,000 tons of gold, at least six times the official figureand nearlyfour times the fake gold reservespublicly reportedby the United States. Despite all this “If the U.S.reallywants to resolve the issue through dialogue and negotiation, it should stop exerting extreme pressure, stop threatening and blackmailing, and talk to Chinaon the basis ofequality, respect and mutual benefit,” Foreign Ministry spokesman Lin Jian said. “China’s position has beenvery clear. There is no winner in a tariff war or a trade war,” Lin said, adding: “China does not want to fight, but it is not afraid to fight.” The Chinese also point out the United States had a services trade surplus of $278 billion in 2023, so the situation is not as bad as Trump makes it seem. A deal with the Chinese over a new financial system will be worked out duringthe month ofMay, Asian secret society and Western intelligence sourcespromise. In the meantime, the KM is still waging a desperate rear guard action to prevent this from happening. Here is an example of them issuing fake news using a fake Trump: “The Trump administration has granted Fast Track designation to a groundbreaking — and controversial — self-amplifying mRNA (sa-mRNA) vaccine candidate targeting the H5N1 avian influenza virus.” https://www.thegatewaypundit.com/2025/04/trump-administration-fast-tracks-controversial-self-amplifying-mrna/ Guess who is involved: Arcturus Therapeutics controlled by none other than the Gates Foundation. Asian secret societies prevented the rollout of self-replicating vaccines in Japan by “removing” about a dozen key officials. The same will happen in the US. There is also a repeat threat of KM earthquake weapon attacks: Ryo Tatsuki, apsychic who “correctly predicted the deaths ofFreddie Mercury,PrincessDiana, along witha number ofmajor world events – including the Kobeearthquakein 2011 and even theCovid-19pandemic…is predicting a mega-tsunami will strike her native Japan in July…an undersea volcanic eruption that will impact multiple countries acrossAsia– withTaiwan,Indonesia, and the Northern Mariana Islands setbehit the hardest.” https://www.dailymail.co.uk/femail/article-14622159/Psychic-Baba-Vanga-issues-terrifying-prediction.html A senior member of the three-legged crow secret society that controls the Shinto religion and the royal family says it is this threat of an earthquake attack that forces Japan to obey the Satanic cabal. They are just a bunch of cowards who will face punishment for using this as an excuse to murder 500,000 Japanese with toxic vaccines. The fact is plansto destroy Tokyo by causing Mt. Fuji to erupt were cancelled after hundreds of earthquakes hit the Island of La Palma in the Atlantic. A giant crack runs through the middle of that Island and if an earthquake causes it to fall into the oceana 100 meter (or hundred yard) tall tsunami would hit the US East Coast and much of the European coastline. This is a Mexican standoff and the KM will not be able to avoid bankruptcy negotiations by threatening earthquake weapon attacks. Satan no longer rules the earth. [the_ad id=”85933″] Late 2024 SITS Statement about Fulford Reports These reports are shared as a service for the thousands of people that come to read them. However, I can’t in good conscience not say what I think about them, and I haven’t talked about why I do that in an update for sometime, so here it is. Julian and I began posting Fulford years ago as one of many sources to consider. As always, just because we post information doesn’t mean we believe it’s true. For years, I posted new sources that I knew were distorted but were nonetheless valuable to be informed about. As ever, disinformation is key information to a well-trained mind. Julian passed in 2015, and the site changed direction in 2021 when all our income sources were canceled as part of the censorship campaign that took out many content creators. When that happened, I had to make a decision: should I let the site go offline because we can’t pay server costs or do I post Fulford and allow the site to live on, albeit on life support? I decided to do the latter. It is my opinion that Fulford’s reports have fallen in quality and that while he enjoys celebrity, his efforts aren’t helping to make people more discerning or empower them to be a positive influence in the world. Does that mean his work is useless, worthy of contempt, or that he’s a negative actor? I’m not saying that. I believe that excellence is a ladder, and there are many rungs on that ladder for whomever is ready wherever they are to begin their ascent. No doubt Fulford has his own colorful opinions of me and SITS, which he has the right to have, and I honor that. Anyone who’s spent time on social media, especially Telegram, can see the legions of bots and other attention-grabbing schemes that cause distractions, disillusionment, and otherwise hamper what I believe to be more productive expenditures of time within the awakening community. Despite this, and within the spirit of the mission of SITS, I will continue to post his reports until I change my stance. In fulldisclosure, you know now the reason I do this and the thoughts I have about his reports and their quality and effect. As ever, you are encouraged to read his material and think what you like. And if you have any opinions for me you’re welcome to share them with me in the comments. Stillness General Comment on Fulford Reports I decided to add this general comment to all Fulford reports since I frequently receive the same questions about them. Commentary: In response to many questions and comments I receive from people wondering why I share these reports, I offer the following. Speaking as someone who has been following Fulford’s reports since 2011, reading them should probably be done with a large grain of salt. That is to say, he seems to share information directly from alleged sources within the Pentagon, CIA, White Dragon Society, and so on. Often the data presented is contradictory on the surface. The predictions and statements Fulford makes sometimes are highly accurate, whereas, in other instances, they are completely unfounded. Instead of looking to Fulford as one who is “tapped into” some greater truth, it would probably be more productive to consider his data as one possible perspective on what is happening on Earth at this time. This of course extends to all sources of information. Fulford, like all of us, is only human and can make mistakes. But that doesn’t detract from the work he has done to spread awareness and move things forward to a brighter future for humanity. Discernment is the process of understanding what something is, which in Fulford’s case, means entertaining his reports without believing them blindly, and then doing the follow-up research/fact-checking to determine what actually happened. In this way, it is a real-time discernment exercise. The fact that so many people continue to read his reports despite their sensational and wildly inaccurate nature at times—while also being accurate and poignant—means the people he receives information from are probably using him as a mouthpiece to speak to you—the reader who is on their awakening path. As such, blind belief or callous rejection are not our allies but critical thinking and open-mindedness are. As I have said before, if he is serving as a mouthpiece for various groups working to change the status quo or agents within the Cabal, we can decipher the data as if it is a form of awakening propaganda—information that certain players want to expose the masses to. What effect this has on your personal process is largely up to you. But I would suggest taking an active role in discernment and not falling into the trap of total acceptance or rejection. [Help support Benjaminby purchasing a subscription atbenjaminfulford.net] Benjamin Fulford Updates from the previous week: Benjamin Fulford — April 14th, 2025: Khazarian Mafia Messiah candidate “Marco” returns from Asia empty handed Not sure how to make sense of this? Want to learn how to discern like a pro?Read this essential guideto discernment, analysis of claims, and understanding the truth in a world of deception:4 Key Steps of Discernment – Advanced Truth-Seeking Tools. Stillness in the Storm Editor’s note:Did you find a spelling error or grammatical mistake? Send an email to[email protected],with the error and suggested correction, along with the headline and url. Do you think this article needs an update? Or do you just have some feedback? Send us an email at[email protected].Thank you for reading. Source: https://benjaminfulford.net/the-death-of-pope-francis-and-king-charles-means-western-satanic-rule-is-ending/ Filed Under:NewsTagged With:benjamin fulford **Notices and Disclaimers** We need $2000 per month to pay our costs.Help usone timeorrecurring.(DONATE HERE) To sign up for RSS updates, paste this link (https://stillnessinthestorm.com/feed/) into the search field of your preferred RSS Reader or Service (such as Feedly or gReader). Subscribe to Stillness in the Storm Newsletter “It is the mark of an educated mind to be able to entertain a thought without accepting it.” – Aristotle This website is supported by readers like you. If you find our work of value, consider making adonation. Stillness in the Storm DISCLAIMER: All articles, videos, statements, claims, views and opinions that appear anywhere on this site, whether stated as theories or absolute facts, are always presented by Stillness in the Storm as unverified—and should be personally fact checked and discerned by you, the reader. Any opinions or statements herein presented are not necessarily promoted, endorsed, or agreed to by Stillness, those who work with Stillness, or those who read Stillness. Any belief or conclusion gleaned from content on this site is solely the responsibility of you the reader to substantiate, fact check, and no harm comes to you or those around you. And any actions taken by those who read material on this site is solely the responsibility of the acting party. You are encouraged to think carefully and do your own research. Nothing on this site is meant to be believed without question or personal appraisal. Content Disclaimer:All content on this site marked with “source – [enter website name and url]” is not owned by Stillness in the Storm. All content on this site that is not originally written, created, or posted as original, is owned by the original content creators, who retain exclusive jurisdiction of all intellectual property rights. Any copyrighted material on this site was shared in good faith, under fair use or creative commons. Any request to remove copyrighted material will be honored, provided proof of ownership is rendered. Send takedown requests to[email protected]. What is our mission? Why do we post what we do? Our mission here is to curate (share) articles and information that we feel is important for the evolution of consciousness. Most of that information is written or produced by other people and organizations, which means itdoes notrepresent our views or opinions as managing staff of Stillness in the Storm. Some of the content is written by one of our writers and is clearly marked accordingly. Just because we share a CNN story that speaks badly about the President doesn’t mean we’re promoting anti-POTUS views. We’re reporting on the fact as it was reported, and that this event is important for us to know so we can better contend with the challenges of gaining freedom and prosperity. Similarly, just because we share a pro/anti-[insert issue or topic] content, such as a pro-second amendment piece or an anti-military video doesn’t mean we endorse what is said. Again, information is shared on this site for the purpose of evolving consciousness. In our opinion, consciousness evolves through the process of accumulating knowledge of the truth and contemplating that knowledge to distill wisdom and improve life by discovering and incorporating holistic values. Thus, sharing information from many different sources, with many different perspectives is the best way to maximize evolution. What’s more, the mastery of mind and discernment doesn’t occur in a vacuum, it is much like the immune system, it needs regular exposure to new things to stay healthy and strong. If you have any questions as to our mission or methods please reach out to us at[email protected]. **Reader Interactions** **Comments** aCluesaysMonday, April 28, 2025 at 13:21“They leave distance annihilated, cause things to grow, and improve productivity,””Thats why the real depopulation weapon was the “vaccine” labeled mRNA GENE THERAPY product they got people fear mongered into injecting into themselves. They flip the switch on the “cause things to grow” device and like teslaphoresis, the injected garbage starts to self assemble in the localities where those signals have been powered up!Better have a run at holding the criminals seated in willfully unaccountable positions of authority to account before the turbo cancers make the “vaccine injured” unable to Act to hold them to account!Reply aCluesays Monday, April 28, 2025 at 13:21 “They leave distance annihilated, cause things to grow, and improve productivity,”” Thats why the real depopulation weapon was the “vaccine” labeled mRNA GENE THERAPY product they got people fear mongered into injecting into themselves. They flip the switch on the “cause things to grow” device and like teslaphoresis, the injected garbage starts to self assemble in the localities where those signals have been powered up! Better have a run at holding the criminals seated in willfully unaccountable positions of authority to account before the turbo cancers make the “vaccine injured” unable to Act to hold them to account! aCluesays Monday, April 28, 2025 at 13:21 “They leave distance annihilated, cause things to grow, and improve productivity,”” Thats why the real depopulation weapon was the “vaccine” labeled mRNA GENE THERAPY product they got people fear mongered into injecting into themselves. They flip the switch on the “cause things to grow” device and like teslaphoresis, the injected garbage starts to self assemble in the localities where those signals have been powered up! Better have a run at holding the criminals seated in willfully unaccountable positions of authority to account before the turbo cancers make the “vaccine injured” unable to Act to hold them to account! **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website **Primary Sidebar** **Search Our Archives** **FUNDRAISER!** **Latest Videos** **From around the web** **News “they” don’t want you to see** You can unsubscribe anytime. For more details, review ourPrivacy Policy. You have successfully joined our subscriber list. **We Need Your Support** **Support our work!** **Weekly Newsletter Sign UP** Only want to see emails once a week?Sign up for the Weekly Newsletter here:SIGN UP. (Make sure you send an email to[email protected]to confirm the change or it won’t work). **Latest Videos** **Footer** Menus Internship Program RSS Social Media Media Privacy Policy Copyright © 2025 ·Privacy Policy·Log in· Built by This website wouldn't be the same without the ethical web hosting provided by Modern Masters. Modern Masters ethically serves small businesses in metaphysical, paranormal, healing, spirituality, homesteading, acupuncture and other related fields. Get the perfect website for your sacred work atModern Masters."}