{"id": 717, "name": "Jihadica", "domain": "jihadica.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jihadica.com/hamas-and-al-qaida-the-concerns-of-abu-muhammad-al-maqdisi/", "title": "Hamas And Al Qaida The Concerns Of Abu Muhammad Al Maqdisi", "content": "**ji·had·ica** Home About Archives Contact Home About Archives Contact **Hamas and al-Qaida: The Concerns of Abu Muhammad al-Maqdisi￼** Cole Bunzel June 10, 2024 Since Hamas’s “Operation al-Aqsa Flood” attack on Israel on October 7, 2023, the global jihadi movement has been divided over how to respond. While the Islamic State has reiterated its unequivocal stand against Hamas, al-Qaida has staked out a position of nearly unlimited support and sympathy. The contrast could not be starker. Al-Qaida, however, has a problem in taking this pro-Hamas stand. This is that some of the key jihadi ideologues who have long supported al-Qaida, and who command a certain following within al-Qaida’s global network, are deeply uncomfortable with it. The most noteworthy of these is Abu Muhammad al-Maqdisi (b. 1959), the Palestinian-Jordanian scholar whose many books, essays, and fatwas have profoundly shaped the ideological complexion of the jihadi movement, or “the jihadi current” (al-tayyar al-jihadi) as it is most commonly known in Arabic, going back to the 1980s. Al-Maqdisi has long served as something of the jihadi movement’s ideological standard-bearer, ensuring conformity with Salafi doctrinal principles that emphasize strict monotheism (tawhid) and condemnation and denunciation of all that goes again it, from supplicating saints at tombs to democracy and nationalism and failure to rule by God’s law. Unlike in previous years when al-Maqdisi used social media accounts and wrote frequently online, over the past year or so his social media usage and his writing have been restricted by the Jordanian authorities. Even so, a number of his messages have appeared online since October 7, and for the most part these have comprised severe criticism of al-Qaida. While al-Maqdisi is not as categorically anti-Hamas as the Islamic State, he has no tolerance for what he sees as al-Qaida’s unprincipled stand of all-out support for the Palestinian militant group, a stand that he sees as representing al-Qaida’s ongoing ideological evolution toward a more generic kind of Islamism. These concerns of al-Maqdisi go to the heart of what al-Qaida is trying to become in the present moment as it repositions itself as the more “moderate” alternative to the Islamic State—and the challenge that this intended makeover entails. Hamas between al-Qaida and al-Maqdisi The Islamic State, to reiterate, has nothing positive to say about Hamas whatsoever. Back in January, the Islamic State’s official spokesmanurgedHamas to “correct your path,” arguing that its “recent battle in Gaza” was not about “achieving the unity of God and making His word supreme” but rather about “the dirt and the land.” He went on to fault Hamas for failing to implement the Sharia in Gaza and for allying itself with Shiite Iran’s “axis of resistance,” noting that the “expansionary designs” of the “Rejectionists” (i.e., the Shia) are no less a threat to the Muslims than “the conspiracies and enmities of the Jews and the Crusaders.” The only way for Hamas to be worthy of the Islamic State’s support, in other words, was for it to abandon the resistance axis and transform itself into an extension of the Islamic State. Al-Qaida has also in the past condemned Hamas, but never so severely and never to the point of outright excommunication (takfir). In 2006 al-Qaida’s approach turned negative when Hamas pivoted from being principally a terrorist militia to being a political group as well. That year Hamas participated in the Palestinian legislative elections, and al-Qaida responded by condemning it for participating in these “polytheistic assemblies” and effectively recognizing the Oslo Accords. In 2007 Osama bin Laden famouslystatedthat Hamas had “forsaken their religion.” Al-Maqdisi was even more critical of Hamas in this period, writing extensively about its perceived transgressions from its embrace of the “polytheistic” religion of democracy to its failure to implement the Sharia in Gaza (after Hamas’s takeover there in 2007) and the nationalism underlying its jihad, among other things. More broadly he critiqued Hamas for not adhering to the correct path or methodology (manhaj), meaning the ideological path associated with the jihadi movement, or Jihadi Salafism, with its emphasis ontawhidand its commitment to overthrowing the “apostate” rulers of the Islamic world. It was in this context that al-Maqdisi came into conflict with the al-Qaida commander Mustafa Abu al-Yazid (d. 2010), who in a 2009interviewcasually stated that “we and Hamas share the same thinking and the samemanhaj.” Al-Maqdisi responded with a 20-page rebuttal setting out all the ways in which Hamas did not adhere to “themanhajof the Jihadi Salafi current” (manhaj al-tayyar al-salafi al-jihadi). Abu al-Yazid duly issued acorrection, explaining that he had misspoken (“the phrase was not precise”) and clarifying that al-Qaida’s position is one of distinguishing between the political wing of Hamas, which is deeply flawed, and Hamas’s military wing (i.e., the al-Qassam Brigades), which merits support as mujahidin fighting a shared enemy. Al-Maqdisi has sometimes indicated his agreement with this distinction between the political and the military wings of Hamas, though he has never been entirely comfortable with it. In any event, the episode with Abu al-Yazid demonstrated the kind of ideological authority that al-Maqdisi wielded within al-Qaida circles at this time. In recent years, however, this has changed, with al-Maqdisi finding himself critiquing what he sees as al-Qaida’s ideological drift and al-Qaida only drifting further. In 2021, for instance, during an earlier round of conflict between Israel and Hamas, al-Maqdisi rebuked al-Qaida’s official media agency, al-Sahab, for itsstatementmourning the death of a Hamas senior military commander. He framed his criticism as though reflecting the concerns of a great many erstwhile supporters of al-Qaida. “Many mujahid brothers, shaykhs, and preachers,” hewrote, were displeased by the al-Sahab statement’s exaltation of the al-Qassam leader who was killed in the recent war in Gaza, and they wondered astonishedly: “Are our brothers not aware of the deviation of Hamas and its leadership from the path oftawhidin favor of the path of democracy, and of their alignment with Hizbal-Lat[i.e., Hizbullah] and Bashar [al-Asad] and Iran?” … Has themanhajchanged?! Have the ranks of al-Qaida been penetrated by those who pay no heed to the purity of themanhaj?” This was a major escalation in al-Maqdisi’s occasional criticism of al-Qaida, which had earlier included reprimanding the group formourningthe late President Mohammed Morsi of Egypt. For the first time, al-Maqdisi had accused al-Qaida of turning its back on the jihadimanhajthat he and others had worked so hard to construct. Al-Qaida was from his perspective trying to remake itself into a more pan-Islamist group that could appeal to the global Muslim community, orumma, more broadly, and this meant dispensing with the jihadimanhajand all its ideological strictures. Since October 7, al-Maqdisi’s concerns about al-Qaida have only grown greater. Early reactions Al-Qaida would waste little time in publishing a statement of support for the Hamas operation. On October 13, the al-Qaida senior leadership, or “general command,” issued astatementtitled “But Surely God’s Help is Nigh” (Q. 2:214) in which it hailed the October 7 attack as “one of the most courageous of heroic acts in Islam in this modern time,” and “one of the most important Islamic strides that will lead to the liberation of all the land of Palestine.” Addressing “the knights of Palestine,” the statement declared that “your brothers in al-Qaida, and all the righteous mujahidin worldwide, stand together with you in a single column, in the same trench of battle.” It further called on Muslims around the world to wage jihad against the Jews and their allies, announcing that “we are upon a great transformation in the path of global jihad.” The October 13 statement was followed at the month’s end by the firstessayin a series by Sayf al-‘Adl, al-Qaida’s presumptive leader since the death of Ayman al-Zawahiri in summer 2022. Writing under the pseudonymSalim al-Sharif, al-‘Adl heaped similar praise on the October 7 operation, portraying it as a strategic marvel that heralded the beginning of the end for the Jewish state. Despite the pain and destruction now being visited upon the people of Gaza, he wrote, the operation was nonetheless necessary in order to achieve the ultimate objective of driving the Jews from Palestine. It would further have the effect of lifting the morale of theummaand of the Muslims of the Middle East in particular, leading them “to revolt against their kings and emirs and presidents” who had done nothing over the years to restore Muslim rule in Palestine. With these two statements, al-Qaida was practically claiming October 7 as its own, portraying the attack as both a part of and in furtherance of al-Qaida’s jihad against the standing regimes of the Middle East. Al-Maqdisi’s initial reaction was somewhat out of character. Rather than polemicizing against Hamas, he counseled restraint in condemning it at this sensitive time. In acommentrelayed via Telegram on October 12, he expressed exasperation at receiving numerous inquiries about his earlier writings concerning Hamas. “I have been troubled by the brothers’ repeated questioning concerning our previous well-known statements about Hamas at this time,” he wrote, suggesting that this was not the moment for dredging up this material. At the present time, he continued, “it is obligatory to work to support Gaza and its people by any means possible, by the hand and by the tongue and by beseeching God to support the people of Gaza over the nations of unbelief who have rallied against them,” and it is further obligatory “to avoid all that might be seen as forsaking [the people of Gaza] at this time.” This moratorium on Hamas-bashing was bound to be brief. Al-Maqdisi’s next comments on Hamas came in an issue of the jihadi magazineal-Mahajja, which appeared on November 6. In hisarticle, titled “Proud Gaza and the al-Aqsa Flood: Studies and Lessons,” he began by praising October 7, saying that “there is no believer of true faith in this world who did not feel joy at the al-Aqsa Flood operation.” Yet this praise soon was shown to be backhanded, as in the very same paragraph al-Maqdisi described Hamas’s jihad as “marked by corruption” as he pondered “what would be the case were it a jihad in the path of God and in the path of applying His law on earth, as our Lord wishes and desires?” From here he proceeded to reaffirm his earlier criticisms “of the deviations of Hamas and its government,” saying that no military operation, no matter how great, can erase these transgressions. “The crime of neglecting the Sharia,” he wrote, is not erased but by applying it; the sin of democracy is not erased but by dissociating from it; the veneration and adulation of the worst Rejectionist criminals and the showing of loyalty to the murderers of the Sunnis such as [Qasim] Sulaymani and his state and their satanic ayatollahs are not erased but by dissociating from them; and the praising and burnishing of Bashar [al-Asad], murderer of hundreds of thousands of Syrians, rapist of women, and destroyer of lands and persons, are not erased but by dissociating from him and his criminal regime. Al-Maqdisi went on to note that it was the Hamas government that had instituted a “truce” with Israel in the first place, stifling the efforts of the smaller militant groups in Gaza, including the “Jihadi Salafi” ones, from making war on the Jewish state. Here was al-Maqdisi returning to form. Whatever reservations he had about criticizing Hamas in the immediate aftermath of October 7 were gone. As al-Maqdisi announced of himself: I am not one who is deceived by that which is not real, who goes out beating the drum for Hamas and dressing it up and beautifying it, with all its vices and faults, because of a raid it successfully carried out. In this way are people misled and their creed diluted. A great many shaykhs and groups have ridden the wave of this flood such that they have nearly drowned their followers in the misconceptions of innovative groups and ensnared them in contradictions! As if all the grave offenses that the Hamas government has committed and continues to commit are excused so long as it is fighting Jews! As if fighting Jews has become an impediment to condemnation and totakfir! The criticism of certain unspecified “shaykhs” and “groups” here no doubt encompassed al-Qaida with its statement of unqualified pro-Hamas sentiment. Al-Maqdisi’s frustration with al-Qaida became even clearer in his next publicremarksconcerning Hamas. In this brief commentary, relayed via Telegram on November 15, he argued that there was a major difference between calling on God to support a flawed Islamic group such as Hamas and “misleading theumma” by endorsing it and exaggerating its merits. The former was perfectly in accordance with the Sharia, but the latter was not. Indeed, to take the latter course was “to destroy all that we have built before of doctrinal fortresses examining the deviation of those who fight in the path of democracy and rule by manmade laws.” “What the jihadi organizations and shaykhs are doing today,” he continued, naming al-Qaida, “is precisely this destruction and annihilation of the edifice that they had previously erected,” a structure that was built to show “the falsity of democracy and the blameworthiness of governments that refuse to apply the Sharia.” Al-Qaida and certain unnamed scholars, al-Maqdisi was thus saying, were “misleading theumma” and “destroying” the ideological edifice of Jihadi Salafism. This was heavy criticism indeed. “Don’t ride a wave that isn’t yours” It was not till early January 2024 that al-Maqdisi’s next words concerning al-Qaida and Hamas appeared online. What seems to have prompted him to write at this stage was the release by al-Qaida the previous month of a shortvideofeaturing footage of Hamas fighters squaring off against Israeli forces. The video, based on an earlier newsletter from November, urged Muslims to join the battle alongside “the heroes” of October 7 by waging jihad against the “Zionist” Arab regimes of the Middle East, in particular “Saudi Arabia, Jordan, Syria, Egypt, and Lebanon.” Once again, al-Qaida was presenting Hamas’s war on Israel and the regional agenda of al-Qaida as part of the same general jihad. Another al-Qaida media product from December did even more to portray Hamas and al-Qaida as being in perfect alignment. This was anewsletterreleased at the end of the month presenting the “the blessed al-Aqsa Flood operation” as the successor to 9/11, and predicting that this “the second September 11” would inevitably lead to “the third September 11.” Notably, the newsletter suggested that the perpetrators of this third 9/11 might even be “non-Muslims,” given how widespread the anger at America in the West had become. These attempts by al-Qaida to blur the distinction between Hamas’s and al-Qaida’s strategic agendas did not sit well with al-Maqdisi. In anessaypublished onJustpaste.iton January 8 and shared by followers on X and Telegram, he warned al-Qaida against trying to insert itself into a war it had no business being a part of. Hamas, he explained, “adheres to a Muslim Brotherhood, Islamo-democraticmanhaj, it rules according to manmade laws, and it does not fight to establish God’s law!” Implicitly addressing al-Qaida, only later identified by name, he wrote, “You are simply not a part of its [Hamas’s] direction … [and] you haven’t the least participation or say in its vital decisions.” Indeed, Hamas could end this war at any time on the orders of its foreign patrons and without consulting you. The Hamas leadership “disagrees with you in the foundations of belief (usul), not just in the branches (furu‘).You and they are not aligned either in direction or in means or in objectives.” The “Rejectionists” of Iran and Hezbollah are the more natural allies of them. “Therefore,” he concluded, “your enthusiasm for them [Hamas], and your words and your statements about them, as though you are speaking on their behalf, is to be considered fake wailing. Truly, your drumbeating for them without concern for their methodology is a mixture of stupidity and naiveté and foolishness.” It was at this point that al-Maqdisi finally mentioned al-Qaida by name, noting the fact that it has begun to draw in its videos from the videos of Hamas’s fighters in order to talk about the global jihad that the Hamas of the Resistance dissociates from, and indeed considers to be terrorism, or to incite through the clips of the al-Qassam fighters against idolatrous rulers and regimes that Hamas is loyal to in the first place! … So long as you have wasted the milk in the summer and have not prepared for this day in terms of men and capabilities and damaging targets, then don’t ride a wave that isn’t yours, and don’t beat the drum and dance to songs that don’t suit you. Not only was al-Maqdisi calling out al-Qaida’s “stupidity and naiveté and foolishness” in showering praise on Hamas and misrepresenting its loyalties and strategic aims, but he was also calling out al-Qaida’s irrelevance on the Palestinian scene, as an actor that had not mobilized and prepared for battle there. Simply put, this attempt at annexing Hamas’s war with Israel to al-Qaida’s global jihad was disingenuous nonsense. This was not to say that the only appropriate course of action was for al-Qaida, or other jihadis, to sit the war in Gaza out. But to the extent that one participated, al-Maqdisi counseled, one ought to have a clear-eyed view of what Hamas is and where one fits within the Hamas-dominated battle. “In the event that you must participate,” he wrote, “then participate as one who has become involved in a battle over which one exercises no control, but in which one sees a benefit for the Muslims and through which one aspires to an awakening of theummaand an igniting of the burning coal of jihad.” In other words, participation in Hamas’s jihad against Israel was allowed, but only participation in a supporting role aimed at “an awakening of theumma.” This was not the only comment by al-Maqdisi to appear on January 8. A secondessay, titled “The Spittle of the Stricken One,” also circulated on Telegram that day, though initially without attribution to al-Maqdisi—indeed with a deliberate attempt to mislead as to his authorship by referring to him in the third person. The writing, however, was unmistakably al-Maqdisi’s, and the attribution was soon clarified whenrepostedby a follower days later. Here al-Maqdisi presented the current controversy surrounding Hamas as the third “tribulation” (fitna) to afflict the jihadi movement in a series offitnas beginning with that of the Islamic State (too extreme) and that of Hay’at Tahrir al-Sham (too lax). He reminded readers of what Osama bin Laden and Ayman al-Zawahiri had said about Hamas’s deviations and pointed to his own older statements as well, asserting that Hamas is still Hamas—“a deviant and innovative nationalist group.” “We can take pleasure in their fighting the Jews,” he wrote, “just as we take pleasure in any innovative group’s fighting the Jews, but without endorsing it and deceiving and misleading people concerning itsmanhaj.” Rehashing many of the criticisms in the previous essay from the same day, al-Maqdisi concluded with the following admonition: “Do not mislead theumma, do not forsake your principles, and do not turn away from yourmanhajor corrupt your compass!” These words, one can safely assume, were directed first and foremost at al-Qaida. Dr. Tariq and al-Qaida’s “end” Since January, no new writings by al-Maqdisi have appeared online, even as al-Qaida has continued to release statements and essays supportive of Hamas. Al-Maqdisi’s criticisms of al-Qaida, however, continue to circulate and reverberate on jihadi Telegram, and other ideologues of his ilk have made similar al-Qaida-critical comments. Perhaps the most noteworthy of these is the Canadian-based Egyptian jihadi ideologue Tariq ‘Abd al-Halim (b. 1948). In April, Tariq, who holds a Ph.D. in engineering from the University of Birmingham, called attentiom to astatementissued by al-Qaida on April 22 offering condolences for Ismail Haniyeh, the head of Hamas’s political bureau in Qatar, on the death of several of his children and grandchildren in an Israeli strike in Gaza. This statement seemed to be a departure from al-Qaida’s previous stance of distinguishing between Hamas’s political and military wings, as here it was saluting Hamas’s political leader as “the honorable shaykh”—twice. On April 24, Tariqre-publishedal-Maqdisi’s essay “The Spittle of the Stricken One” on his Telegram channel, preceded by the words “The statement of the Shaykh Abu Muhammad al-Maqdisi,” as if to suggest that this was a response to al-Qaida. Minutes later, Tariq offered some criticalcommentaryof his own, lamenting al-Qaida’s descent into ideological disorder and organizational impotence. “There is no doubt that al-Qaida,” he wrote, “following the martyrdom of its two pioneers,” meaning Osama bin Laden and Ayman al-Zawahiri, “has passed into a state of manifest instability, confusion, and waywardness, as is perhaps apparent in its recent statement concerning the family members of Ismail Haniyeh who were assassinated by the hand of Zionist treachery.” Without elaborating, he attributed this “drumbeating” by al-Qaida for Hamas to Sayf al-‘Adl’s father-in-law,Mustafa Hamid, whom he described as carrying on close relations with Iran (where he and al-‘Adl both reside) and as the one in control of the al-Sahab media agency. As for al-Qaida’s health as an organization with real-world influence, Tariq offered a grim prognosis: “Perhaps the organization’s role on the ground has come to an end with the demise of its two pioneers.” Surely al-‘Adl and his colleagues in the al-Qaida leadership see things differently. For them it is the exclusivist ideology promoted by the likes of Tariq and al-Maqdisi that has run its course, not al-Qaida. In the present global environment, which is witnessing an unprecedented spike in anti-American sentiment driven by Washington’s continued support for Israel, the optimal course is to put exclusivist ideology aside and to unite theummaaround al-Qaida’s strategy of attacking the United States as the source of the Islamic world’s ills. Whether al-Qaida is wisely repositioning itself for future success, or whether its self-transformation reflects profound confusion and impotence, is a question that can only be answered in time. The U.S. intelligence community has beenadamantthat al-Qaida, at least in Afghanistan and Pakistan, is at its weakest point in decades and is unlikely to see a revival. That assessment would seem to support Tariq’s view that al-Qaida central may well have reached its end point as a force on the ground. In any event, what is clear beyond doubt is that al-Qaida’s pan-Islamic turn has grown increasingly visible since October 7, alienating some of the organization’s big-name scholarly proponents as never before. The controversy over Hamas and al-Qaida points to a crisis of identity on the non-Islamic State side of the global jihadi movement. AQ Central,AQ Leadership,Hamas,Ideological trends,Israel **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ **The Centrality of Iraq and Syria to the Islamic State’s Caliphate** **From Jihadi to Islamist: Ahmad al-Sharaa and His Critics** **Hamas and al-Qaida: The Concerns of Abu Muhammad al-Maqdisi￼** **Abbottabad Insights: How al-Qa‘ida in Iraq Was Formed (Part 2)** **The Jihadis and the Turkish Elections** **Copyright © 2025 Jihadica**"}