{"id": 1282, "name": "Spotlight Delaware", "domain": "spotlightdelaware.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://spotlightdelaware.org/2025/06/03/indian-river-schools-to-hold-referendum-thursday-three-months-after-a-failed-vote/", "title": "Indian River Schools To Hold Referendum Thursday Three Months After A Failed Vote", "content": "**Fuel Fact-Based Reporting** Spotlight Delaware produces quality local journalism, powered by members. We need your support to keep going. Will you help fuel our reporting today? **Fuel Fact-Based Reporting** Spotlight Delaware produces quality local journalism, powered by members. We need your support to keep going. Will you help fuel our reporting today? **Stay connected!** Get the latest Spotlight Delaware reporting delivered right to your inbox every weekday. Keep up with the issues impacting our Delaware neighbors and be inspired to drive change and improve Delaware, together. Newsletter Support Sign In Latest NewsOpen dropdown menuGovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal GovernmentEducationHealthLand UseCommunity GovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community GovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community Explained Our Delaware Podcasts Video EventsOpen dropdown menuA Free Press – April 8Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 AboutOpen dropdown menuWhy?Mission, Vision & HistoryOur TeamOur BoardsOur SupportersOur MembersOur Partners2024 Annual ReportSpotlight Delaware UpdatesJobs & CareersEthics PoliciesContact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Get InvolvedOpen dropdown menuYour NewsroomCommunity Information Hub PartnershipCommunity Listening TourPop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms Facebook x.com instagram linkedin BlueSky Latest NewsGovernmentState GovernmentCounty GovernmentMunicipal GovernmentFederal GovernmentEducationHealthLand UseCommunity GovernmentState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community GovernmentState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community Explained Our Delaware Podcasts Video EventsA Free Press – April 8Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 AboutWhy?Mission, Vision & HistoryOur TeamOur BoardsOur SupportersOur MembersOur Partners2024 Annual ReportSpotlight Delaware UpdatesJobs & CareersEthics PoliciesContact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Get InvolvedYour NewsroomCommunity Information Hub PartnershipCommunity Listening TourPop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms Facebook Instagram X LinkedIn Privacy Policy Terms & Conditions Ethics Policies Facebook x.com instagram linkedin BlueSky Spotlight Delaware Empowering Communities Through Independent Journalism Newsletter Support Sign In Latest NewsOpen dropdown menuGovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal GovernmentEducationHealthLand UseCommunity GovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community GovernmentOpen dropdown menuState GovernmentCounty GovernmentMunicipal GovernmentFederal Government State Government County Government Municipal Government Federal Government State Government County Government Municipal Government Federal Government Education Health Land Use Community Explained Our Delaware Podcasts Video EventsOpen dropdown menuA Free Press – April 8Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 A Free Press – April 8 Shifting Sands – April 23 AboutOpen dropdown menuWhy?Mission, Vision & HistoryOur TeamOur BoardsOur SupportersOur MembersOur Partners2024 Annual ReportSpotlight Delaware UpdatesJobs & CareersEthics PoliciesContact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Why? Mission, Vision & History Our Team Our Boards Our Supporters Our Members Our Partners 2024 Annual Report Spotlight Delaware Updates Jobs & Careers Ethics Policies Contact Us Get InvolvedOpen dropdown menuYour NewsroomCommunity Information Hub PartnershipCommunity Listening TourPop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms Your Newsroom Community Information Hub Partnership Community Listening Tour Pop-Up Newsrooms **Indian River schools to hold referendum Thursday, three months after a failed vote** **Share our story:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to share on WhatsApp (Opens in new window)WhatsApp Click to email a link to a friend (Opens in new window)Email Why Should Delaware Care?Delaware is one of just a few states that send school funding questions to voters through the referendum process. And with costs rising in Southern Delaware, one district says it will need more money to stem staffing cuts. The Indian River School District is asking residents in eastern Sussex County to vote to approve a nearly $23 million tax increase on Thursday, less than three months after a similar referendum failed. District Superintendent Jay Owens has said his schools need the new money to pay “increased operating costs and to maintain a competitive salary package.” The statement highlights the inflationary issues that have hit areas in and around the Delaware beaches particularly hard in recent years as retirees flooded into the region. Get the latest from Spotlight Delaware, with newsletters delivered right to your inbox every weekday. Keep up with the issues and be inspired to drive change and improve Delaware, together. Owens also has said the Board of Education quickly scheduled the new referendumshortly after one failed in Marchbecause the district would not have had immediate access to money generated by the tax if the vote occurred after June 30. The vote to approve the $22.5 million referendum will occur from 7 a.m. to 8 p.m. on Thursday,June 5. The district’s total budget in the fiscal year 2025, which ends on June 30, was nearly $240 million.Nearly 11,000 students were enrolledin district schools at the start of the 2024/2025 school year. Local opponents of the referendum have expressed frustration over the request for new public money, with some saying it points to a need for the county to instead impose additional fees on developers to support local schools. Millville Town Councilman Bob Wisgirda also told Spotlight Delaware in March that the district’s first referendum was unpopular among many residents because they were “very paranoid” about Sussex County’s recent property reassessments, and the increased tax payments that could come with them. Other school districts in the state, such as theChristina School District,chose to forgo a referendum this year. Instead, they are taking advantage of the tax reassessment process, which allows districts to stealthily raise local school tax rates by up to 10% without the approval of voters. Owens previously told Spotlight Delaware that the upcoming referendum package “far exceeds” the revenue the district would generate if the Board of Education chose to raise revenue through the reassessment process. Still, he said the board may consider raising revenue through the property tax reassessment, if Thursday’s referendum fails. “I’m not going to say that [the board] would not consider that moving forward,” he said. Board of Education members laid out the district’s fiscal woes during a board meeting last January when announcing the first planned referendum. At the time, they said that even a successful referendum may not eliminate the need to lay off staff to cut costs elsewhere, according to areport from Coastal Point. “A lot of the funding goes to our teachers, but as we continue to cut, class sizes go up and we aren’t able to maintain programs and services that we know our students need and deserve,” Owens said. **How to vote:** All residents of the Indian River School District are eligible to vote for the referendum. Voters have to be U.S. citizens and at least 18 years old, but do not have to own a home or have students in the district. Voters will need proof of address on the day of the polls, using a driver’s license, state ID card, passport, or utility bill. Polling places include the East Millsboro Elementary School, Georgetown Elementary School, Indian River High School, Long Neck Methodist Church, Lord Baltimore Elementary School, Millville Community Center, Selbyville Fire Hall, and Sussex Central High School. **** **Become a Spotlight Delaware Member** Strong, independent local journalism doesn’t just happen — it’s powered by people like you. By supporting Spotlight Delaware, you join a community of Delawareans who believe everyone deserves access to reliable, fact-based reporting. Even a small gift, as little as $1, connects you to a larger movement working to keep local news free, accessible and accountable to all. If you’re interested in making an even greater impact, Spotlight Delaware also welcomes gifts through Qualified Charitable Distributions (QCDs) from IRA withdrawals, as well as gifts of stock, life insurance, bequests, and more. Please contactAllison Taylor Levinewith any questions or to explore these giving options. **GIVE TODAY!** **Read more from Spotlight Delaware** **Julia Merola** Julia Merola graduated from Temple University, where she was the opinion editor and later the managing editor of the University’s independent, student-run newspaper, The Temple News. Have a question...More by Julia Merola Empowering Communities Through Independent Journalism About Support Newsletters Team Join Our Team Facebook Instagram X LinkedIn Privacy Policy Terms & Conditions Ethics Policies Facebook x.com instagram linkedin BlueSky **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. By signing up, you agree to our Privacy Policy.This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}