{"id": 363, "name": "Die Presse", "domain": "diepresse.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.diepresse.com/19783576/von-einem-grossen-qualitaetssprung-beim-textilrecycling-berichtet-ein-experte-ein-wendepunkt-ist-erreicht", "title": "Von Einem Grossen Qualitaetssprung Beim Textilrecycling Berichtet Ein Experte Ein Wendepunkt Ist Erreicht", "content": "NachrichtenAuslandAußenpolitikEUWeltjournalInnenpolitikChronikWienÖsterreichKlimawandelUkraine-KriegNahost-KonfliktWirtschaftÖsterreichInternationalEuropean VoicesGeld & FinanzenÜber Geld spricht manYoung FinanceSportWintersportFußballMotorsportTennisRechtspanoramaTechnik AuslandAußenpolitikEUWeltjournal Außenpolitik EU Weltjournal Innenpolitik ChronikWienÖsterreich Wien Österreich Klimawandel Ukraine-Krieg Nahost-Konflikt WirtschaftÖsterreichInternationalEuropean VoicesGeld & FinanzenÜber Geld spricht manYoung Finance Österreich International European Voices Geld & Finanzen Über Geld spricht man Young Finance SportWintersportFußballMotorsportTennis Wintersport Fußball Motorsport Tennis Rechtspanorama Technik AuslandAußenpolitikEUWeltjournal Außenpolitik EU Weltjournal Außenpolitik EU Weltjournal Innenpolitik ChronikWienÖsterreich Wien Österreich Wien Österreich Klimawandel Ukraine-Krieg Nahost-Konflikt WirtschaftÖsterreichInternationalEuropean VoicesGeld & FinanzenÜber Geld spricht manYoung Finance Österreich International European Voices Geld & Finanzen Über Geld spricht man Young Finance Österreich International European Voices Geld & Finanzen Über Geld spricht man Young Finance SportWintersportFußballMotorsportTennis Wintersport Fußball Motorsport Tennis Wintersport Fußball Motorsport Tennis Rechtspanorama Technik MeinungLeitartikelKommentareQuergeschriebenGastkommentareWirtschaftskolumnenDie BilanzKordikonomyLet's make moneyBlack MondayBitcoin & BlockchainKlima:WandelTV-NotizOffen gefragt Leitartikel Kommentare Quergeschrieben Gastkommentare WirtschaftskolumnenDie BilanzKordikonomyLet's make moneyBlack MondayBitcoin & BlockchainKlima:Wandel Die Bilanz Kordikonomy Let's make money Black Monday Bitcoin & Blockchain Klima:Wandel TV-Notiz Offen gefragt Leitartikel Kommentare Quergeschrieben Gastkommentare WirtschaftskolumnenDie BilanzKordikonomyLet's make moneyBlack MondayBitcoin & BlockchainKlima:Wandel Die Bilanz Kordikonomy Let's make money Black Monday Bitcoin & Blockchain Klima:Wandel Die Bilanz Kordikonomy Let's make money Black Monday Bitcoin & Blockchain Klima:Wandel TV-Notiz Offen gefragt MagazinKulturFeuilletonBühneKlassikKunstMedienFilmSerienPopLiteraturSpectrumZeitreiseMenschenLebenGefühlssacheReiseEssen & TrinkenRestaurantguideHobbysportWissenschaftMotorLifestyleModeUhrenSchmuckBeautyDesignRezepteBildungKarriereImmobilienQuiz KulturFeuilletonBühneKlassikKunstMedienFilmSerienPopLiteratur Feuilleton Bühne Klassik Kunst Medien Film Serien Pop Literatur Spectrum Zeitreise Menschen Leben Gefühlssache Reise Essen & Trinken Restaurantguide Hobbysport Wissenschaft Motor LifestyleModeUhrenSchmuckBeautyDesignRezepte Mode Uhren Schmuck Beauty Design Rezepte Bildung Karriere Immobilien Quiz KulturFeuilletonBühneKlassikKunstMedienFilmSerienPopLiteratur Feuilleton Bühne Klassik Kunst Medien Film Serien Pop Literatur Feuilleton Bühne Klassik Kunst Medien Film Serien Pop Literatur Spectrum Zeitreise Menschen Leben Gefühlssache Reise Essen & Trinken Restaurantguide Hobbysport Wissenschaft Motor LifestyleModeUhrenSchmuckBeautyDesignRezepte Mode Uhren Schmuck Beauty Design Rezepte Mode Uhren Schmuck Beauty Design Rezepte Bildung Karriere Immobilien Quiz **Von einem „großenQualitätssprung“beimTextilrecyclingberichtet ein Experte: „Ein Wendepunkt ist erreicht“** Seit sich in den 1990er-Jahren Fast Fashion etabliert hat, stiegen auch in Europa die Müllberge aus weggeworfener Kleidung. Versuche, der Situation Herr zu werden, gab es viele. Aber die technischen Hürden waren hoch. Doch nun bewegt sich etwas. Laut der EU-Kommission werfen die europäischen Verbraucher jedes Jahr rund 5,8 Millionen Tonnen Textilien weg. Weltweit sind es sogar 92 Millionen Tonnen. Laut Textile Exchange, einer gemeinnützigen Organisation, hat sich der Bekleidungsverbrauch zwischen 1975 und 2020 fast verdoppelt. Bis 2030 wird ein weiterer Anstieg um 25 Prozent prognostiziert. Doch wie gehen europäische Firmen dagegen vor? Wie treiben sie Mode-Recycling voran? Und was hat es mit dem „großen Qualitätssprung“, von dem ein österreichischer Wissenschaftler redet, auf sich? International Economist"}