{"id": 379, "name": "Earth & Sky", "domain": "earthsky.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://earthsky.org/astronomy-essentials/visible-planets-tonight-mars-jupiter-venus-saturn-mercury/", "title": "Visible Planets Tonight Mars Jupiter Venus Saturn Mercury", "content": "**Sign Up for Our Amazing Newsletter!** A daily update by email. Science news, great photos, sky alerts. **Visible planets and night sky guide for June** **June 11 and 12 late evenings: Moon visits the Teapot** Read more: Teapot of Sagittarius points to Milky Way Center Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **Evening sky drama! Don’t miss Mars and Regulus!** Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **A pair of planets in the June morning sky: Northern Hemisphere** Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **Planet forecast for June** See night sky expert Deborah Byrd’s planet forecast for June. Watch in the player above oron YouTube. **Farewell, Mr. Eclipse** If you watched the April 8, 2024, total solar eclipse in the North America, your experience was in part due to the work of one man, Fred Espenak. His friend and writing partner, Michael Zeiler, shares stories and memories of Fred. Watch in the player above oron YouTube. **June moon phases and alignments** EarthSky’s Marcy Curran created this short video preview of the moon phases for the month of June 2025. This month is the full Strawberry Moon – overnight on June 10-11 – near the bright star Antares. Plus the moon visits several other bright planets and stars. See what’s in store for June! **Mid-June evening planets** **Mid-June challenge: Can you spot this trio at the same time?** **What is the zodiac?** TwoOGastronomy educators come together to explain one of stargazing’s most important and useful concepts – that of the ecliptic, which creates the zodiac – in our night sky. JoinDeborah Byrdand Bob King (aka AstroBob) in the player above oron YouTube. **By mid-June, Mars-Regulus make a dynamic duo!** **June 18: Watch for the last quarter moon** The moment oflast quartermoon will fall at19:19 UTCon June 18, 2025. That’s 2:19 p.m. CDT. It’ll rise after midnight your local time and set around noon. Look for it high in the sky before dawn. Want more?Here are 4 keys to understanding the moon’s phases. **June 18 and 19 mornings: Moon and Saturn** Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **June solstice in 2025** **June 21 and 22 mornings: Moon and Venus** Read more: Venus reached itsgreatest distance from the morning sunon May 31-June 1. It’ll remain visible in the morning sky through October. **June 23: Moon reaches perigee** The moon will reachperigee– its closest point to us in itselliptical orbitaround Earth – at5 UTCon June 23, 2025, when it’s 225,668 miles (363,178 km) away. **June morning planets challenge** **June 24: Jupiter in conjunction with the sun** **June 24 evenings: Mercury, Pollux and Castor form a line** Read more: Mercury farthest from sunset on July 4 Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **June 25: New moon** The moment ofnew moonwill fall at10:32 UTCon June 25, 2025. That’s 5:32 a.m. CDT. New moons rise and set with the sun. It’s the last of 5 newsupermoonsin a row for 2025. Nights around the new moon are perfect for stargazing.See EarthSky’s best places to stargaze. See the moon phases from new to full inthis EarthSky community photo. Read more: What is a supermoon? Supermoons in 2025 **June 26 and 27 evenings: Moon, Mercury and twin stars** Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **June 28 and 29: Moon, Mercury, Mars and Regulus** **June stars** If you’re out stargazing on any June evening, look for these stars and constellations overhead in the evening sky. Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **June evening planets** Our charts are mostly set for the northern half of Earth. To see a precise view – and time – from your location,try Stellarium Online. **June morning planets** **Sky dome map for visible planets and night sky** Read more: Guy Ottewell explains sky dome maps. **Heliocentric solar system visible planets and more** Read more: Guy Ottewell explains heliocentric charts. **Some resources to enjoy** For more videos of great night sky events, visitEarthSky’s YouTube page. Don’t miss anything. Subscribe to daily emails from EarthSky. It’s free! Visit EarthSky’s Best Places to Stargaze to find a dark-sky location near you. Post your own night sky photos at EarthSky Community Photos. See the indispensable Observer’s Handbook, from the Royal Astronomical Society of Canada. Visit Stellarium-Web.org for precise views from your location. Almanac: Bright visible planets (rise and set times for your location). Visit TheSkyLive for precise views from your location. Bottom line: Visible planets and night sky guide. Tonight, the moon, just past full, visits the Teapot asterism in Sagittarius. When you look in that direction, you’re looking toward the center of the Milky Way galaxy. **Comments**"}