{"id": 732, "name": "KAAL - Austin News", "domain": "kaaltv.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kaaltv.com/ap-top-news/ap-top-news-us-headlines/iowa-governor-rejects-gop-bill-to-increase-regulations-of-summits-carbon-dioxide-pipeline/", "title": "Iowa Governor Rejects Gop Bill To Increase Regulations Of Summits Carbon Dioxide Pipeline", "content": "NewsTop NewsLocal News6 InsideAssignment EducationMinnesotaIowaUS HeadlinesInternational NewsPolitical NewsBusiness NewsSurveyUSA VideoABC News Live VideoLive StreamingKAAL TV 10PM NewscastLive EventsABC 6 News on RokuYouTube ProgrammingKAAL TV SchedulesStartTVChildren’s Programming ReportClosed Captioning WeatherWeatherWeather AlertsRadarTraffic CamsTower CamsMap RoomWatches and WarningsThe Ultimate Severe Weather GuideSevere Weather AwarenessWinter Hazard AwarenessWeather SpottersABC 6 Weather LabSpring into Action: An ABC 6 News Severe Weather SpecialSchool, Church, and Business Closings & DelaysSubmit Photos and Videos SportsSportsState SportsSportszoneGame of the WeekPrep of the WeekMSHSL Tournaments Features6 on Your SideAthens & Mediterranean Cruise with Ed-VenturesConsumer ConfidenceSpotlight on BusinessMental Health MattersAssignment EducationExcellent EducatorNominate an Excellent EducatorPet of the WeekWhat the Tech?SparkAg Report CommunityABC 6 Community Excellence AwardEat. Play. Shop.Events CalendarWeather Photo GalleryFeatured LinksThursdays DowntownSpotCrimeMorning TriviaABC 6 Birthday Club SponsoredABC 6 On DeckABCs of BBQDestination TailgateFather’s Day GiveawayMental Health MinuteSenior ShowcaseWarm Up with Energy Products and Design Work With US Contact UsNewsletterABC 6 News Mobile AppsNews TeamSales TeamMarketing & Advertising ServicesNewsletterSubmit a News TipContact Us **Iowa governor rejects GOP bill to increase regulations of Summit’s carbon dioxide pipeline** DES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds on Wednesday rejecteda billthat could have introduced more complications for a massivecarbon-capture pipelineproject routed across several Midwestern states, issuing a rare veto in the Republican-controlled statehouse.The legislation was designed by Iowa House Republicans to increase regulations of Summit Carbon Solutions’ estimated $8.9 billion, 2,500-mile (4,023-kilometer) project that cuts across Iowa and already has anapproved permitin the state.But the bill provoked loud opposition from members of Iowa’s powerful ethanol industry, which argued the project is essential for Iowa’s agricultural dominance, for farmers and for construction jobs. And it exposed a rift within the party over how to protect property rights.“While I shared the bill’s goal of protecting landowners, good policy should draw clear, careful lines. This bill doesn’t,” said Reynolds, a Republican, in the explanation of her veto. “It combines valid concerns with vague legal standards and sweeping mandates that reach far beyond their intended targets.”Even with the relief from Reynolds’ veto, Summit will likely have toreadjust plansafter South Dakota’s governorsigned a banon the use of eminent domain — the government seizure of private property with compensation — to acquire land for carbon dioxide pipelines. Summit’s permit application was also rejected inSouth Dakota.The project has permit approvals in Iowa, Minnesota andNorth Dakotabut faces various court challenges.The Iowa bill would have prohibited the renewal of permits for a carbon dioxide pipeline, limited the use of such a pipeline to 25 years and significantly increased the insurance coverage requirements for the pipeline company.Those provisions would likely have made it less financially feasible for a company to build a carbon dioxide pipeline.Despite her veto, Reynolds said she was “committed to working with the legislature to strengthen landowner protections, modernize permitting, and respect private property.”As the legislative session wound down, a dozen Republican senators insisted their leaders bring the House-approved bill to the floor for a vote after several years of inaction. The stalemate ended in a long and divisive debate among the Iowa Senate’s Republican supermajority, with senators openly criticizing one another and exposing the closed-door discussions that got them there.The pipeline’s many critics have for years begged lawmakers for action. They accuse Summit of stepping on their property rights and downplaying the safety risks of building the pipeline alongside family homes, near schools and across ranches.Lee Enterprises and The Associated Pressreviewed hundreds of casesthat reveal the great legal lengths the company went to to get the project built. In South Dakota, in particular, a slew of eminent domain legal actions to obtain land sparked a groundswell of opposition that was closely watched by lawmakers in Iowa as well.But as debate in the state Senate seemed inevitable, dozens of Summit employees and leaders and members of the Iowa Corn Growers Association, the Iowa Renewable Fuels Association and labor unions made a big showing as well.The pipeline was proposed to carry carbon emissions from ethanol plants in Iowa, Minnesota, Nebraska, North Dakota and South Dakota to be stored underground permanentlyin North Dakota.By lowering carbon emissions from the plants, the pipeline would lower their carbon intensity scores and make them more competitive in therenewable fuels market.The project would also allow ethanol producers and Summit to tap intofederal tax credits.Iowa Renewable Fuels Association Executive Director Monte Shaw immediately issued a statement Wednesday praising Reynolds’ veto. He had said in a May 12 statement after the vote that a majority of the Iowa Senate “turned their back on Iowa agriculture.” DES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds on Wednesday rejecteda billthat could have introduced more complications for a massivecarbon-capture pipelineproject routed across several Midwestern states, issuing a rare veto in the Republican-controlled statehouse. The legislation was designed by Iowa House Republicans to increase regulations of Summit Carbon Solutions’ estimated $8.9 billion, 2,500-mile (4,023-kilometer) project that cuts across Iowa and already has anapproved permitin the state. But the bill provoked loud opposition from members of Iowa’s powerful ethanol industry, which argued the project is essential for Iowa’s agricultural dominance, for farmers and for construction jobs. And it exposed a rift within the party over how to protect property rights. “While I shared the bill’s goal of protecting landowners, good policy should draw clear, careful lines. This bill doesn’t,” said Reynolds, a Republican, in the explanation of her veto. “It combines valid concerns with vague legal standards and sweeping mandates that reach far beyond their intended targets.” Even with the relief from Reynolds’ veto, Summit will likely have toreadjust plansafter South Dakota’s governorsigned a banon the use of eminent domain — the government seizure of private property with compensation — to acquire land for carbon dioxide pipelines. Summit’s permit application was also rejected inSouth Dakota. The project has permit approvals in Iowa, Minnesota andNorth Dakotabut faces various court challenges. The Iowa bill would have prohibited the renewal of permits for a carbon dioxide pipeline, limited the use of such a pipeline to 25 years and significantly increased the insurance coverage requirements for the pipeline company. Those provisions would likely have made it less financially feasible for a company to build a carbon dioxide pipeline. Despite her veto, Reynolds said she was “committed to working with the legislature to strengthen landowner protections, modernize permitting, and respect private property.” As the legislative session wound down, a dozen Republican senators insisted their leaders bring the House-approved bill to the floor for a vote after several years of inaction. The stalemate ended in a long and divisive debate among the Iowa Senate’s Republican supermajority, with senators openly criticizing one another and exposing the closed-door discussions that got them there. The pipeline’s many critics have for years begged lawmakers for action. They accuse Summit of stepping on their property rights and downplaying the safety risks of building the pipeline alongside family homes, near schools and across ranches. Lee Enterprises and The Associated Pressreviewed hundreds of casesthat reveal the great legal lengths the company went to to get the project built. In South Dakota, in particular, a slew of eminent domain legal actions to obtain land sparked a groundswell of opposition that was closely watched by lawmakers in Iowa as well. But as debate in the state Senate seemed inevitable, dozens of Summit employees and leaders and members of the Iowa Corn Growers Association, the Iowa Renewable Fuels Association and labor unions made a big showing as well. The pipeline was proposed to carry carbon emissions from ethanol plants in Iowa, Minnesota, Nebraska, North Dakota and South Dakota to be stored underground permanentlyin North Dakota.By lowering carbon emissions from the plants, the pipeline would lower their carbon intensity scores and make them more competitive in therenewable fuels market. The project would also allow ethanol producers and Summit to tap intofederal tax credits. Iowa Renewable Fuels Association Executive Director Monte Shaw immediately issued a statement Wednesday praising Reynolds’ veto. He had said in a May 12 statement after the vote that a majority of the Iowa Senate “turned their back on Iowa agriculture.” DES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds on Wednesday rejecteda billthat could have introduced more complications for a massivecarbon-capture pipelineproject routed across several Midwestern states, issuing a rare veto in the Republican-controlled statehouse. The legislation was designed by Iowa House Republicans to increase regulations of Summit Carbon Solutions’ estimated $8.9 billion, 2,500-mile (4,023-kilometer) project that cuts across Iowa and already has anapproved permitin the state. But the bill provoked loud opposition from members of Iowa’s powerful ethanol industry, which argued the project is essential for Iowa’s agricultural dominance, for farmers and for construction jobs. And it exposed a rift within the party over how to protect property rights. “While I shared the bill’s goal of protecting landowners, good policy should draw clear, careful lines. This bill doesn’t,” said Reynolds, a Republican, in the explanation of her veto. “It combines valid concerns with vague legal standards and sweeping mandates that reach far beyond their intended targets.” Even with the relief from Reynolds’ veto, Summit will likely have toreadjust plansafter South Dakota’s governorsigned a banon the use of eminent domain — the government seizure of private property with compensation — to acquire land for carbon dioxide pipelines. Summit’s permit application was also rejected inSouth Dakota. The project has permit approvals in Iowa, Minnesota andNorth Dakotabut faces various court challenges. The Iowa bill would have prohibited the renewal of permits for a carbon dioxide pipeline, limited the use of such a pipeline to 25 years and significantly increased the insurance coverage requirements for the pipeline company. Those provisions would likely have made it less financially feasible for a company to build a carbon dioxide pipeline. Despite her veto, Reynolds said she was “committed to working with the legislature to strengthen landowner protections, modernize permitting, and respect private property.” As the legislative session wound down, a dozen Republican senators insisted their leaders bring the House-approved bill to the floor for a vote after several years of inaction. The stalemate ended in a long and divisive debate among the Iowa Senate’s Republican supermajority, with senators openly criticizing one another and exposing the closed-door discussions that got them there. The pipeline’s many critics have for years begged lawmakers for action. They accuse Summit of stepping on their property rights and downplaying the safety risks of building the pipeline alongside family homes, near schools and across ranches. Lee Enterprises and The Associated Pressreviewed hundreds of casesthat reveal the great legal lengths the company went to to get the project built. In South Dakota, in particular, a slew of eminent domain legal actions to obtain land sparked a groundswell of opposition that was closely watched by lawmakers in Iowa as well. But as debate in the state Senate seemed inevitable, dozens of Summit employees and leaders and members of the Iowa Corn Growers Association, the Iowa Renewable Fuels Association and labor unions made a big showing as well. The pipeline was proposed to carry carbon emissions from ethanol plants in Iowa, Minnesota, Nebraska, North Dakota and South Dakota to be stored underground permanentlyin North Dakota.By lowering carbon emissions from the plants, the pipeline would lower their carbon intensity scores and make them more competitive in therenewable fuels market. The project would also allow ethanol producers and Summit to tap intofederal tax credits. Iowa Renewable Fuels Association Executive Director Monte Shaw immediately issued a statement Wednesday praising Reynolds’ veto. He had said in a May 12 statement after the vote that a majority of the Iowa Senate “turned their back on Iowa agriculture.” Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. News Video Programming Weather Sports Features Community Sponsored Work With US Contact Us FCC Applications Contest Rules Public Files KAAL DMCA Notice Terms of Use Children’s Programming Report FCC Public Inspection File Hubbard Television Group Privacy Policy Any person with disabilities who needs help accessing the FCC Public file should emailnews@kaaltv.comor call (507) 288-7555 This website is not intended for users located within the European Economic Area.©KAAL-TV, LLCA Hubbard Broadcasting Company ABC 6 News Follow ABC 6 News Follow **ABC 6 News Follow** ABC 6 News Follow **ABC 6 News Follow** **ABC 6 News Follow**"}