{"id": 1272, "name": "Sol Newspaper", "domain": "sol.sapo.pt", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://sol.sapo.pt/2025/06/10/marcelo-discursa-pela-ultima-vez-no-10-de-junho-nao-ha-quem-possa-dizer-que-e-mais-puro-e-mais-portugues-do-que-qualquer-outro/", "title": "Marcelo Discursa Pela Ultima Vez No 10 De Junho Nao Ha Quem Possa Dizer Que E Mais Puro E Mais Portugues Do Que Qualquer Outro", "content": "Amanhã Amanhã Política Sociedade Economia Internacional Opinião Cultura Desporto TemasGuerra na UcrâniaEducaçãoSaúdeEntrevistas Guerra na Ucrânia Educação Saúde Entrevistas Guerra na Ucrânia Educação Saúde Entrevistas Política Sociedade Economia Internacional Opinião Cultura Desporto TemasGuerra na UcrâniaEducaçãoSaúdeEntrevistas Guerra na Ucrânia Educação Saúde Entrevistas Guerra na Ucrânia Educação Saúde Entrevistas Amanhã Amanhã Jornal semanal de economia e questões estruturais para pensar o país a 20 anos. Temas Guerra na Ucrânia Educação Saúde Entrevistas Secções Política Sociedade Economia Internacional Opinião Cultura Desporto Full Power Vida&Lifestyle Edição Digital Edição Papel Siga-nos **Marcelo discursa pela última vez no 10 de junho. “Não há quem possa dizer que é mais puro e mais português do que qualquer outro”.** O Presidente da República tomou a deixa de Lídia Jorge e destacou a mistura de povos que são hoje os portugueses. No final da intervenção, o chefe de Estado condecorou Ramalho Eanes com o grande-colar da Ordem Militar de Avis. às Share on Facebook Share on Twitter Share on LinkedIn Share on WhatsApp Email this Page Marcelo Rebelo de Sousa discursou pela última vez no Dia de Portugal como Presidente da República, esta terça-feira. Numa intervenção com cerca de 10 minutos, o chefe de Estado destacou Lagos como “um lugar simbólico de história”, que leva a recordar “os quase 900 anos da pátria comum e o orgulho daqueles que a fizeram vindo de todas as partes”. O Presidente começou por agradecer a todos os povos que fizeram parte da pátria portuguesa, e afinou pelo mesmo diapasão do discurso de Lídia Jorge, que o antecedeu, ao dizer: “Não há quem possa dizer que é mais puro e mais português do que qualquer outro”. Portugal, sublinhou Marcelo Rebelo de Sousa, é uma “mistura” feita pela passagem de vários povos. “Nós somos portugueses, somos universais. E somos universais porque somos portugueses”, afirmou. Continuou no seu elogio aos portugueses, “experientes, resistentes, criativos, heróis nos momentos certos, capazes de falar línguas, de entender climas e usos, de conviver com todos, de fazer construindo dia a dia pontes”. Assim, e perante um “novo ciclo”, Marcelo Rebelo de Sousa defendeu que “temos o dever de nos recriar, de nos ultrapassar, de cuidar melhor da nossa gente. (…) cuidar do mar, dos oceanos, essa valia que é muito nossa, portuguesa e universal”. Para o Presidente da República, “recriar Portugal é, no fundo, ler os Lusíadas. Recordar o passado, mas apostar no futuro”. “Este recriar Portugal é a nossa obrigação primeira neste novo ciclo da nossa história, 50 anos depois de termos chegado á democracia, à liberdade”, disse ainda. A terminar, fez uma referência especial aos militares para destacar a condecoração ao general Ramalho Eanes, com o grande-colar da Ordem Militar de Avis. “Somos a pátria que vive em liberdade e democracia feita por esses soldados. É essa gratidão que queremos testemunhar, condecorado quem foi protagonista de Novembro, Capitão de Abril, combatente em África, Presidente da República”, destacou. **Temas** 1Aguiar-Branco lembra que Marcelo tem ainda seis meses muito importantes de mandato 1 1 2Sócrates e Santos Silva pronunciados por três crimes de branqueamento 2 2 3Ministério Público abre inquérito sobre agressão a ator 3 3 4Ministra da Cultura condena agressão contra companhia teatral ‘A Barraca’ 4 4 5‘Ter renováveis é sinal de independência energética’ 5 5 1Aguiar-Branco lembra que Marcelo tem ainda seis meses muito importantes de mandato 1 1 2Sócrates e Santos Silva pronunciados por três crimes de branqueamento 2 2 3Ministério Público abre inquérito sobre agressão a ator 3 3 4Ministra da Cultura condena agressão contra companhia teatral ‘A Barraca’ 4 4 5‘Ter renováveis é sinal de independência energética’ 5 5 **Leia também** Política“Hoje é um dos dias mais tristes da minha vida”, diz Gouveia e Melo **“Hoje é um dos dias mais tristes da minha vida”, diz Gouveia e Melo** **“Hoje é um dos dias mais tristes da minha vida”, diz Gouveia e Melo** PolíticaAssessor do Grupo Parlamentar do PS diz que Presidente “é um pulha” **Assessor do Grupo Parlamentar do PS diz que Presidente “é um pulha”** **Assessor do Grupo Parlamentar do PS diz que Presidente “é um pulha”** PolíticaPolítica 2015: A surpresa do ano: vitória da coligação PSD-CDS nas eleições **Política 2015: A surpresa do ano: vitória da coligação PSD-CDS nas eleições** **Política 2015: A surpresa do ano: vitória da coligação PSD-CDS nas eleições** Portugal Política Sociedade Economia Intervalo Cultura Desporto Vida&Lifestyle Siga-nos Facebook Twitter Instagram Youtube Google News Portugal Intervalo Ficha Técnica | Estatuto Editorial | Regras da Comunidade | Publicidade | Definições de Privacidade | Contactos Copyright SOL 2023. Todos os Direitos Reservados – Sol.Pt"}