{"id": 972, "name": "New Indian Express", "domain": "newindianexpress.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.newindianexpress.com/nation/2025/Jun/11/us-reaffirms-support-for-indias-anti-terror-fight-but-its-military-general-says-ties-with-pakistan-also-vital", "title": "Us Reaffirms Support For Indias Anti Terror Fight But Its Military General Says Ties With Pakistan Also Vital", "content": "E-PAPER NATION WORLD STATES OPINIONS CITIES BUSINESS SPORT GOOD NEWS MOVIES PHOTOS VIDEOS WEB SCRAWL NATION WORLD STATES OPINIONS CITIES BUSINESS SPORT GOOD NEWS MOVIES PHOTOS VIDEOS WEB SCRAWL **US reaffirms support for India’s anti-terror fight, but its Military General says ties with Pakistan also vital** Copied The US State Department reaffirmed its strong support for India in its fight against terrorism. At the same time, a senior US military official emphasised the importance of maintaining relations with Pakistan, citing its military’s role in countering the Islamic State – Khorasan Province (IS-KP). State Department spokesperson Tammy Bruce said on Tuesday that Deputy Secretary of State Christopher Landau “met with the Indian parliamentary delegation last week, and he also reaffirmed the United States’ strong support for India in the fight against terrorism, and the strategic partnership between the two countries.” The multi-party delegation, led by Congress MP Shashi Tharoor, visited Washington as part of India’s global outreach campaign followingOperation Sindoor. India launched this operation in response to the Pahalgam terror attack on April 22, which claimed 26 lives. Meanwhile, during aHouse Armed Services Committee hearing, General Michael Kurilla,chief of US Central Command, described Pakistan as “phenomenal partner” in counter-terrorism efforts. He highlighted Pakistan’s military and Army Chief Asim Munir for their work against IS-KP. “The actions of our Pakistani partners that led to the arrest and extradition of Mohammad Sharifullah, the IS-K planner behind the August 26, 2021 suicide attack at Abbey Gate that killed 13 US service members and approximately 160 civilians, underscore Pakistan’s value in countering global terror threats,” Kurilla said. “That’s why we need to maintain relationships with both Pakistan and India. I do not believe it’s a binary choice, you can’t choose one at the expense of the other,” he added. “We should evaluate these relationships based on their merits.” Bruce also confirmed that a Pakistani parliamentary delegation, led by Bilawal Bhutto Zardari, met with State Department officials, including Under Secretary for Political Affairs Allison Hooker, during their Washington visit. Hooker reiterated US support for the ongoing cessation of hostilities between India and Pakistan and emphasized discussions on counterterrorism cooperation. When asked whether Pakistan had committed to taking action against terrorists, Bruce declined to provide specifics about the conversation. Responding to a question aboutPresident Donald Trumpoffering to mediate on Kashmir, Bruce said, “I can’t speak to what’s on his mind or his plans. What I do know is that President Trump has consistently aimed to resolve generational conflicts between countries. While I can’t discuss details of any plans, it wouldn’t surprise anyone that he would be interested in addressing a conflict like that.” She described the current moment as “a very exciting time” for potential progress. India, however, has rejected any third-party mediation regarding Jammu and Kashmir, maintaining that the region is and will remain an integral part of the country. (With inputs from PTI) Follow The New Indian Express channel on WhatsApp Download the TNIE app to stay with us and follow the latest **Related Stories** Copyright - newindianexpress.com 2024. All rights reserved."}