{"id": 1060, "name": "Athens Banner-Herald", "domain": "onlineathens.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.onlineathens.com/story/news/2021/01/06/content-removal-policy/6562846002/", "title": "Content Removal Policy", "content": "**Athens Banner-Herald and OnlineAthens.com content removal policy** OnlineAthens.com is the web archive of the Athens Banner-Herald and, just like the printed publication, serves as a historical record of the community. Therefore, we have a strict policy against removing content from OnlineAthens.com. This includes (but isn’t limited to) news articles, blotter items written from police reports, photos, columns, announcements and letters to the editor. Occasionally, a report may have inaccuracies or other issues that need to be addressed. An inaccuracy could be described as a misspelling or a factual error at time of publication. We will consider updating our web archive if a criminal charge has been dropped or the charges lessened in the time since the initial item appeared in the Athens Banner-Herald or OnlineAthens.com and in our editorial judgment an update is warranted. We are unable to remove the item entirely, but upon verification of the proper documentation, we may make an editor’s note to describe the outcome of the matter reported on. To submit an item for consideration, please send the ABH a letter, with the appropriate URL address and a description of the article in question. If this is a criminal case, you must provide appropriate documentation (court records, etc.) proving charges were dropped or lessened. The ABH must receive submissions by certified mail at: Athens Banner-Herald One Press Place Athens, GA 30601 c/o Caitlyn Stroh-Page, Editor If the issue is unrelated to criminal charges or arrests, please emailcstroh-page@onlineathens.comwith complaint, URL address and a description. Please include ARCHIVE in the subject line. We are unable to respond to phone calls on these matters and all decisions will be made based on internal policies."}