{"id": 1773, "name": "NoTricksZone", "domain": "notrickszone.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://notrickszone.com/2025/06/06/new-study-europe-was-not-only-warmer-but-also-wetter-during-most-of-the-pre-industrial-holocene/comment-page-1/#comment-1357260", "title": "New Study Europe Was Not Only Warmer But Also Wetter During Most Of The Pre Industrial Holocene", "content": "**New Study: Europe Was ‘Not Only Warmer But Also Wetter During Most Of The Pre-Industrial Holocene’** ByKenneth Richardon6. June 2025 A new European Alps hydroclimate reconstruction spanning the years 8980 to 2014 CE has been derived from the stable isotopes of 192 trees (Arosio et al., 2025). The reconstruction clearly distinguishes centennial-scale warm periods such as the Medieval Warm Period (MWP), Roman Warm Period (RWP), and millennial-scale African Humid Period (when the Sahara was green, lake- and fauna-covered). These warmer centuries (millennia) were accompanied by wetter, much more humid climates. In contrast, the coldest centuries of the Holocene such as the Little Ice Age (18th and 19th centuries) and Late Antique Little Ice Age (6th century) had the driest hydroclimates with “the most severe summer droughts of the past 9000 years.” Mass migration punctuated these cold periods. Interestingly, the hydroclimate reconstruction shows the modern period (1900-2014) is no wetter (or warmer) than the 19th century’s Little Ice Age – the coldest, driest period of the last 9000 years. There has been no dramatic change or “uptick” in the last century. “We suggest that much of Europe was not only warmer but also wetter during most of the preindustrial Holocene.” Posted inCooling/Temperature,Little Ice Age,Medieval Warm Period,Paleo-climatology|4 Responses **4 responses to “New Study: Europe Was ‘Not Only Warmer But Also Wetter During Most Of The Pre-Industrial Holocene’”** kamir bouchareb st6. June 2025at6:45 PM|Permalink|Replythank you thank you thank you New Study: Europe Was ‘Not Only Warmer But Also Wetter During Most Of The Pre-Industrial Holocene’ – Climate- Science.press7. June 2025at5:51 PM|Permalink[…] From NoTrickZone […] […] From NoTrickZone […] […] From NoTrickZone […] Rehoboth8. June 2025at10:36 AM|Permalink|ReplyWonderful Wonderful Wonderful soundos9. June 2025at9:38 AM|Permalink|ReplyGreat post! The insights shared are incredibly helpful and provide a fresh perspective on the topic. Looking forward to more of your content!” Great post! The insights shared are incredibly helpful and provide a fresh perspective on the topic. Looking forward to more of your content!” Great post! The insights shared are incredibly helpful and provide a fresh perspective on the topic. Looking forward to more of your content!” **Leave a ReplyClick here to cancel reply.** Comment Name* Email* Website Δ **Search** **Politically Incorrect Guide To Climate Change** **Categories** Abnormal Climate Psych Activism Agriculture Alarmism Alternative Energy Antarctic Arctic Climate Bet For Charity Climate Politics Climate Sensitivity Cloud Climate Influence CO2 and GHG CO2 Greens the Earth Cooling/Temperature Coral Reefs Cryosphere Data Manipulation Drought and Deserts Emissions Fire Flood Glaciers Gore Green Follies Greenpeace Hockey Team Humour Hurricanes/Tornados Innovation IPCC Lifestyles of the Rich and Alarmist Little Ice Age Media / Bias Medieval Warm Period Misc. Models Monthly summaries Natural Oceanic Oscillations Natural Variability Nuclear energy Nutrition Ocean Acidification Oceans Ozone 'Hole' Paleo-climatology Pandemic Pollution Russian Climate Science Scepticism Sea Ice Sea Levels Solar Solar Sciences Stupid Predictions Tectonics/Volcanoes Temperature Bias/Urbanization Uncategorized Uncertainty Error Warming/CO2 Benefiting Earth Water Vapor We're To Blame Weather Wind Power **Pages** 1. About 1. Contact 1. Cookie Policy 1. Data Privacy / Datenschutz 1. Legal/Impressum 1. Rules For Reposting 100+ Papers – Sun Drives Climate 129 Climate Scandals 160 Papers: Low Sensitivity 285 Papers 70s Cooling 1 285 Papers 70s Cooling 2 285 Papers 70s Cooling 3 2m Higher Holocene Sea Levels 600 Non Warming Graphs (1) 600 Non Warming Graphs (2) 600 Non Warming Graphs (3) Climate Bet For Charity Climategate 2.0 Corona Diary: 2020s Germany German Professor, Leading Critic Of COVID Policies, Gets Picked Out By Hanover Police For Walking! Marcott et al Rebuttal (2013) PAGES 2k Rebuttal Skeptic Papers 2014 (251) Skeptic Papers 2015 Skeptic Papers 2016 Skeptic Papers 2016 (1) Skeptic Papers 2016 (2) Skeptic Papers 2016 (3) Skeptic Papers 2017 (1) Skeptic Papers 2017 (2) Skeptic Papers 2017 (3) Skeptic Papers 2018 (1) Skeptic Papers 2018 (2) Skeptic Papers 2018 (3) Skeptic Papers 2019 (1) Skeptic Papers 2019 (2) Skeptic Papers 2019 (3) Skeptic Papers 2020 (1) Skeptic Papers 2020 (2) Skeptic Papers 2021 (1) Skeptic Papers 2021 (2) Skeptic Papers 2023 Thank You! Who’s Who Guide In Germany? **Polar Bear Catastrophe Never Happened** **Videos** Climategate – English Climategate – German Dr Werner Kirstein Salby On CO2 vs Temp Meeresspiegel The Boy Who Cried Warming Baliunas on Weather Cooking NYT Fraud 2 NYT Fraud 1 Uncertainty Has Settled **Climatic Indicators** ENSO BoM Report ENSO 3.4 Chart ENSO Outlook 6 Months Sea Level – Global Sunspot Watch Temp Arctic DMI Temp Forecast Europe Temp Forecast Global Temp Surface AMSU Satellite Temp UAH Satellite Temp Forecast US/Canada Sunspot Tracking Graph Sea Ice Arctic View PDO Index PDO index graph Snow/ice Cover Surface Temp Global Snow and ice cover Global sea level Berkeley Earth Data German historical data Sea level rise AMSU Atmos temps Climate4you Temperature Satellite Series Temperature Earth SLR Tide Gauges **NoTricks Blogroll** Changement Climatique Climate Depot EIKE WUWT Wood for Trees Climategate.nl Nonoy Oplas PDO Index Chart CFACT Climategate 2 mails GWPF – Benny Peiser Die kalte Sonne 1000+ papers Tallbloke's Talkshop toryaardvark Judith Curry Kiwi Thinker Pop-Tech Resource Weather Action 66 hiatus excuses Climate Common Sense Climate Dispatch Wamists' View Of Dissenters Climate Change Predictions Wo bleibt Frojdh Sweden 22 Unangenehme Klimafakten 22 Inconvenient Climate Facts MWP Map NIPCC Energiefrage CO2 Science Lüdecke Prof. H.-J. Temperature Earth Zoe Phin Klimaschau Earthquake activity klimatupplysningen.se Zoe Phin Dams-Sauerland **Recent Comments** patrick healyonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit soundosonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit kamir bouchareb stonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit soundosonNew Study: North American Fires Were Four Times More Prevalent From 1600-1880 Than 1984-2022 soundosonHeat Hysteria In Germany: Authorities Recommend No Beer, Barbecues On Hot Days! soundosonNew Study: Europe Was ‘Not Only Warmer But Also Wetter During Most Of The Pre-Industrial Holocene’ kamir bouchareb stonIrony: German Town Cancels Climate Heat & Drought Event – Due To Cool, Wet Weather! **Archives** June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 April 2011 March 2011 February 2011 January 2011 December 2010 November 2010 October 2010 September 2010 August 2010 July 2010 June 2010 May 2010 April 2010 **The Neglected Sun** **Red Hot Lies** **Meta** Register Log in Entries feed Comments feed WordPress.org **Meta** Register Log in Entries feed Comments feed WordPress.org **Recent Comments** patrick healyonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit soundosonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit kamir bouchareb stonGermany’s Renewable Energy Overcapacity Is Pushing The Power Grid To The Limit soundosonNew Study: North American Fires Were Four Times More Prevalent From 1600-1880 Than 1984-2022 soundosonHeat Hysteria In Germany: Authorities Recommend No Beer, Barbecues On Hot Days! soundosonNew Study: Europe Was ‘Not Only Warmer But Also Wetter During Most Of The Pre-Industrial Holocene’ kamir bouchareb stonIrony: German Town Cancels Climate Heat & Drought Event – Due To Cool, Wet Weather! **Videos** Climategate – English Climategate – German Those Who Claim Absolute Knowledge Dr Werner Kirstein Salby On CO2 vs Temp Meeresspiegel The Boy Who Cried Warming Baliunas on Weather Cooking **NoTricks Blogroll** Bishop Hill Changement Climatique Climate Depot Dirk Maxeiner Donna Laframboise EIKE Lubos Motl Reader's Edition WUWT World Climate Report Wood for Trees Tom Nelson The Climate Scam Climategate.nl Der Wettermann China Climate Blog Science Skeptical Nonoy Oplas Nir Shaviv PDO Index Chart CFACT Climategate 2 mails GWPF – Benny Peiser Die kalte Sonne Matt Ridley 1000+ papers Bob Tisdale Tallbloke's Talkshop toryaardvark Judith Curry Klimazwieback Kiwi Thinker Skeptical Science Pop-Tech Resource Ice Age Cometh! Wheat Belly Blog Weather Action 38 pause excuses Polar Vortex Myth Climate Common Sense Climate Dispatch Wamists' View Of Dissenters Climate Change Predictions **Die kalte Sonne – German bestseller!** By continuing to use the site, you agree to the use of cookies.more informationAccept The cookie settings on this website are set to \"allow cookies\" to give you the best browsing experience possible. If you continue to use this website without changing your cookie settings or you click \"Accept\" below then you are consenting to this. More information at our Data Privacy Policy Close"}