{"id": 684, "name": "Insider.co.uk", "domain": "insider.co.uk", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.insider.co.uk/company-results-forecasts/scottish-woodlands-reports-rising-turnover-35297172#comments-wrapper", "title": "Scottish Woodlands Reports Rising Turnover 35297172#comments Wrapper", "content": "Economy Markets SectorsAll SectorsBanking & FinanceEnergyFood & DrinkRetail & ConsumerPropertyScience & TechnologyTourismTransportExpand All Sectors Banking & Finance Energy Food & Drink Retail & Consumer Property Science & Technology Tourism Transport All Sectors Banking & Finance Energy Food & Drink Retail & Consumer Property Science & Technology Tourism Transport EventsEvents ListingEvents NewsExpand Events Listing Events News Events Listing Events News Special Reports Deals and Dealmakers Sustainable Scotland Partner Stories Follow us About Us Contact Us Advertise with Us Newsletter Signup Contact Us About Us Work for us Competition Rules mynewsassistant How to Complain Corrections and Clarifications Terms and Conditions Privacy Notice AI Notice Cookie Notice Newsletter Signup Syndication & Licensing RSS feeds © 2025 Insider Publications Ltd Home Company Results & Forecasts **Scottish Woodlands reports rising turnover** **Recent acquisition takes the business to more than 300 employees and 20 offices across the UK** Bookmark Share Comments 08:33, 28 MAY 2025 Bookmark We have more newsletters We have more newsletters The UK’s largest forest management company has reported turnover of £118.2m in the year to 30 September 2024, up from £111.6m in the previous year. Scottish Woodlands, which is 80% owned by its employees, also revealed operating profits of £4.54m, down slightly from £4.61m year-on-year, with net assets increasing from £22.81m to £25.96m. Since the period covered by the results, parent company SWL has further expanded, with the acquisition of Crieff-based RTS Forestry. The combined group now has more than 300 employees and operates across all of Scotland, as well as in the north of England, Wales and Northern Ireland. Scottish Woodlands has 20 offices, in all four parts of the UK, and is headquartered at Riccarton, Edinburgh. It planted more than 3,000 hectares of new woodland in Scotland alone in 2023/24 - the most the company has planted in a year since the 1980s. A statement explained: “The UK remains in a housing crisis and with the welcome and ambitious new housebuilding targets and planning reforms set by the new government, should create the stimulus to boost the construction sector and therefore timber demand in 2025.” The commentary also noted the need for the UK to grow more of the timber it consumes. “Investment in the UK sawmilling industry continues and, with the UK back as the second largest net importer of timber in the world after China, this underlines the long-term need and demand for domestically produced softwood. “The company is well-placed to not only meet the requirements of improving markets and increasing demand, but also in delivering productive forests, something which is greatly needed to reduce the UK reliance on imported timber.” Ian Robinson, managing director of Scottish Woodlands, commented: “This is a strong set of results, demonstrating our continued ability to adapt to ever-changing and challenging market conditions. “Scottish Woodlands continues to be an industry leader in woodland creation and management, and in developing our workforce and using the latest equipment and technology. “Our carbon team is thriving, with an increasing focus on peatland restoration - and our utilities division, providing forestry services for utility and rail companies, remains a very strong part of the business.” He added: “The acquisition of RTS Forestry in December 2024 signals our desire for further growth, but above all else, our commitment to the continued provision of high-quality services to all our clients across the UK.” The company is also committed to growing its own future leaders and recruits an average of six young people per year onto its graduate programme. The new recruits this year will take the total number to more than 70 since the programme was launched in 2017. Don't miss the latest headlines with our twice-daily newsletter -sign up here for free. Heavy industry Agriculture Company Results & Forecasts all Most Read Most Recent Most Read Most Recent Economy Markets Sectors Events Special Reports Follow us Contact Us About Us Work for us Competition Rules mynewsassistant How to Complain Corrections and Clarifications Terms and Conditions Privacy Notice AI Notice Cookie Notice Newsletter Signup Syndication & Licensing RSS feeds © 2025 Insider Publications Ltd"}