{"id": 1355, "name": "Atlantic", "domain": "theatlantic.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theatlantic.com/podcasts/archive/2025/06/david-frum-show-trumps-plot-against-the-2026-elections/683107/", "title": "David Frum Show Trumps Plot Against The 2026 Elections", "content": "**Site Navigation** The Atlantic PopularLatestNewslettersSectionsPoliticsIdeasFictionTechnologySciencePhotoEconomyCulturePlanetGlobalBooksAudioHealthEducationProjectsFeaturesFamilyEventsWashington WeekProgressNewslettersExplore The Atlantic ArchivePlay The Atlantic crosswordListen to Podcasts and ArticlesThe Print EditionLatest IssuePast IssuesGive a Gift **Sections** Politics Ideas Fiction Technology Science Photo Economy Culture Planet Global Books Audio Health Education Projects Features Family Events Washington Week Progress Newsletters Explore The Atlantic Archive Play The Atlantic crossword Listen to Podcasts and Articles **The Print Edition** **Sections** Politics Ideas Fiction Technology Science Photo Economy Culture Planet Global Books Audio Health Education Projects Features Family Events Washington Week Progress Newsletters Explore The Atlantic Archive Play The Atlantic crossword Listen to Podcasts and Articles **The Print Edition** Search The AtlanticQuick LinksAudioCrossword PuzzleMagazine ArchiveYour Subscription Audio Crossword Puzzle Magazine Archive Your Subscription Audio Crossword Puzzle Magazine Archive Your Subscription Popular Latest Newsletters Sign In Subscribe **Democrats’ Male-Voter Problem** Plus: What Donald Trump is planning, and why Democrats aren’t ready for it Subscribe here:Apple Podcasts|Spotify|YouTube|Overcast|Pocket Casts On this episode ofThe David Frum Show,The Atlantic’s David Frum opens with a warning about President Donald Trump’s behind-the-scenes strategy to subvert the 2026 midterm elections, by creating chaos to justify his use of extreme executive power. David also discusses how Trump’s feud with Elon Musk reveals a deeper truth about power in the postdemocracy Republican Party. Then David is joined by Arizona Senator Ruben Gallego to discuss how Democrats can win the votes of young men, the importance of free trade and patriotism in today’s Democratic Party, and how Gallego has been so successful with Latino voters at a time when Latino men are trending so strongly Republican. The following is a transcript of the episode: David Frum:Hello, and welcome to another episode ofThe David Frum Show. I’m David Frum, a staff writer atThe Atlantic. My guest this week is Senator Ruben Gallego from Arizona, one of the rising stars of the Democratic Party. I recorded my interview with Senator Gallego on June 5, and at that time, I also recorded a monologue talking about the White House farce, tragedy, conflict between Elon Musk and Donald Trump—Elon Musk being the richest man in the world, the biggest contributor to the Trump campaign, the de facto chief of staff and vice president to Donald Trump; and Donald Trump, the president of the United States. But one of the lessons of the Trump years is: It never pays to do things early. You always want to leave things to the last minute because however outrageous the big story on Thursday is, there may be something that happens on the weekend that is even bigger. And so it is. So we’re topping that topper with another topper. Over the weekend, there was an outbreak of unruly protest, disorderly protest, and even violent protest in Los Angeles against immigration raids by the Trump administration. I’m at some distance; I wasn’t an eyewitness. I’m relying on news reports, and there’s some uncertainty about exactly what happened, but it looks like rocks were thrown at ICE vehicles. Protesters tried to impede ICE officers doing their duty. Fireworks were shot off. A car seems to have been set on fire. Now, all of this is illegal, disorderly, and must, of course, be met by the force of law. Fortunately, there are nearly 9,000 officers of the Los Angeles Police Department, uniformed officers with the right to arrest. And the state of California—in cities and counties and at the state level—deploys, altogether, more than 75,000 uniformed officers with arrest powers. So given the state of the situation, there looked to be nothing that the state of California couldn’t cope with on its own. Mercifully, at the time I record today, there were no reports of any injury to any law-enforcement personnel, which, if correct, gives you some idea of the disorderly and upsetting, but genuinely limited, nature of the lawbreaking on hand. Nevertheless, President Trump announced an intent to federalize California’s National Guard and send 2,000 military personnel into the state, and Secretary of Defense Pete Hegseth chimed in with an offer of sending actual Marines from bases in California. Now, this is being reported as, in some ways, an immigration story, but it’s really much, much more than that. By the way, as it happened, it looks like the National Guard was never sent (or certainly wasn’t sent in time), and the Marines also weren’t sent. I think a way to think about what happened in California this weekend is as a trial run, a test, a practice for things that Donald Trump has in mind in 2026. Observers of the Trump administration have noted a strange paradox. On the one hand, Donald Trump is doing one after another outrageous act of seeming violation of rules, seeming illegality, selling billions of dollars of coins to persons unknown, accepting foreign jets—things that, if he loses the protection of control of the House of Representatives and the Senate in 2026, portend a world of trouble and even legal jeopardy for him in the second two years of his administration. And yet, facing that danger, Donald Trump has blithely done one thing after another that seems guaranteed to lose him at least the House, and maybe both House and Senate, in 2026: the tariffs, this tax bill that offers very little to ordinary people, the economy slowly being ground into recession under the burden of all of his restrictive actions. I mean, to do tariffs and an immigration crackdown at the same time is really asking for an economic slowdown. So how do you make sense of this? Does Donald Trump not know that the elections are coming? Does he not sense the danger that he’s in, of what will happen to him, of what could happen to him should his party lose its ability to protect him in House and Senate? Well, I think the answer is: Donald Trumpdoesknow, and he does have a scheme to protect himself, but it’s not doing popular things to keep his majorities in Congress. It’s looking for ways to subvert the 2026 elections to prevent them from happening, or at least to control them so they don’t threaten him at all. Now, we have had some inklings of Donald Trump’s thinking along these lines. We saw them in 2020, when people close to Donald Trump—like his former national security adviser Michael Flynn—advised him to use the military to suppress the 2020 vote. But Flynn’s advice in 2020 came too late. The election had already happened. Flynn was looking to overturn an election in the past, not to prevent an election in the future. And that’s a big thing to do, especially when court after court after court has ruled that the president and his supporters’ claims against the 2020 election were utterly meritless. Also, Donald Trump in 2020 had a military around him that was not likely to obey illegal orders. Under Secretary of Defense [Mark] Esper and under chairman of the Joint Chiefs Mark Milley, the Defense Department had said,Look—we will follow any lawful order of the president. But when the president suggests shooting protesters—as he did during the George Floyd riots—we’re going say, “Mr. President, are you quite sure? I’m not gonna take a hint here. I need an order, and I need it maybe in writing, so that when I am court-martialed, I can show, ‘The president told me to shoot those people.’”And Donald Trump always backed down because he couldn’t rely on Esper and Milley to take the hint about what he wanted done. But here’s how his mind worked. We saw this in 2018. In October 2018, as Donald Trump was heading toward midterm elections that would cost him his majority in the House of Representatives, he began to get very upset about an immigration caravan that was supposedly—a so-called caravan that was—heading toward the border. And he began talking in October 2018 about needing a state of emergency to do something about this, to freeze the border, to militarize the southern states. Now, that didn’t go very far. In the first term, Trump’s talk was often much more radical than Trump’s actions. But you could see the way his mind was going. The president has very broad and quite messy emergency powers. He can do a lot of different things by invoking a state of emergency. He thought about it in 2018. He thought about it in 2020. He wasn’t able to do it either time. But in 2026, he’s going to have a very different kind of administration around him. He’s got a former talk-show host as a secretary of defense, one with a long list of allegations of heavy drinking and allegations of sexual abuse against him, who’s completely beholden to Donald Trump. There are similarly beholden people running the Department of Homeland Security and the FBI. There’s a striking lack of independent voices of people with substantial reputations and long-proven integrity—and, for that matter, proven loyalty to the law of the United States. He’s got the administration of his dreams, and he’s got the problem of a lifetime: the risk of losing the House of Representatives. So what’s the plan? The state of emergency. And that was tested in California. Now, how would this work? Theoretically, of course. We don’t know any of this. I’m just telling you how a criminally minded person might advise the president. The president doesn’t have a button he can press to stop elections. Elections are administered by the states. But what the president can do is put pressure on certain states, or delay or stop elections in certain states in order to convene the House of Representatives, which will be full of newly elected people from his states and vacancies from the other states. There’s some precedent for this. In 2018, the island of Saipan, which is a U.S. territory, was hit by a devastating typhoon, and the governor of the Commonwealth of the Northern Mariana Islands issued a series of emergency declarations—he’s acting under federal executive power; it’s not a state—including ordering postponing elections that were to be held in the territory for two weeks, including an election to the U.S. House of Representatives, where the Northern Marianas have a nonvoting delegate. No one questioned this. It’s a genuine typhoon, and things really were terribly, terribly disrupted. And two weeks is not so long to wait for the right to vote in the face of a genuine emergency. But that was a proof of the power to delay an election that could be wielded by a functionary of the executive branch. Back during Reconstruction, the Grant administration often sent federal troops into areas where there was Ku Klux Klan activity to postpone elections, reorganize elections, redo elections. Again, that was Reconstruction; they were facing terroristic violence that was threatening the rights of, in South Carolina, half the population of the state. But there are precedents here. Now, imagine this in 2026. President Trump provokes some kind of outbreak in California or in some other blue state. He declares a state of emergency. He sends the National Guard. And he says elections have to be postponed until order is restored. That may be weeks; it may be months. In the meantime, there are no representatives from California in the U.S. House of Representatives. With missing blue-state representatives, the red-state people will continue their majority, even though they would likely lose it in a free and fair election in 2026. I’m not saying this is something thatwillhappen, but it’s something thatcouldhappen, and I think it was something we just saw tested. So I think as President Trump’s mind wanders into places where no president’s mind has ever wandered before, it’s going to fall upon all of us to let our minds follow afterwards—to listen to the hints, to listen to things that sound crazy, to listen topeoplewho sound crazy, because they may be the prophets of what’s to come. And now some thoughts on the Elon Musk–Donald Trump dispute, and then my interview with Senator Ruben Gallego. [Music] Frum:Everyone’s talking about this. It’s hard to think of anything additional to say beyond what’s been said. But there’s a point that I’d like to flag that I think has not gone discussed enough, which is: It’s kind of insulting and kind of dangerous that American citizens have to care about this kind of personal dispute at the highest levels of government. The question of whose side you’re on in this kind of personality spat is not something you expect to see in a rule-of-law government. In an authoritarian regime, for sure. Presidents and secret-police chiefs fall out, and one will assassinate the other, send the other to prison. There will be coups and countercoups. But in a democratic rule-of-law system of government, personality is supposed to count not for nothing, but for a lot less. These are all functionaries. These are all servants of the people, highly replaceable. And when they dispute, historically, we expect their disputes to reflect something other than their mere selfish-ego needs. For example, at the beginning of the Biden administration, there was a big dispute between former Secretary of the Treasury Larry Summers, one of the most important outside advisers of the Biden administration, and many of the economic insiders in the Biden administration. Summers warned that the spending plans of the Biden administration were probably too big for the needs of the economy and were likely to generate inflation. As it happened, he was right, but that’s not the point. Others in the Biden administration said,No, we made a mistake in the Obama administration, not spending enough before we were out of the woods. And anyway, this is an opportunity to get done a lot of things that we and the Democratic Party think are important. So we want to proceed with these spending plans, even at the risk of inflation. And there was a big dispute about that. As I said, Summers was right, but that was hard to know in advance. The other people were certainly motivated by sincere concerns for their vision of the public good. And sometimes it got a little testy, and some personality issues did flare up, and people made ad hominem arguments, as they will. But what everyone understood was: This is not an argument about Summers trying to dominate the insiders, and the insiders trying to dominate Summers. They were talking about something important to the public well-being: How big should the Biden post-COVID recovery plans be? How much money should be spent? How much debt should be incurred? This was something that honest and intelligent people could have meaningful, impersonal disagreements about, even if, as I said, ego gets attached, tempers flare, and the unfortunate things are said. That’s the way it’s supposed to be. And you can find examples of this in many other administrations. Hawks during the Cold War days—there were always disputes between the hawks and the doves, between those who wanted to have a more forward policy toward the Soviet Union and those who wanted to try harder on detente, those who were more optimistic about China and those who were less optimistic. And always the question of: Where does the government spend its money? How? On what? All of these things cause tensions and disputes. And you’ll find them in back issues of old periodicals about the events of the day. But the theory was, and the practice usually was, that the issues drove the personalities, not the personalities drove the issues. It was not a question of personalities in dispute looking for reasons, looking for weapons to use against each other in the form of issues. It was a dispute about real issues: Should the government spend more after COVID? Should it spend less? How real is the risk of inflation in 2021, versus how real is the risk of persistent long-term unemployment? That’s the way it’s supposed to be. What’s going on between Trump and Elon Musk is like something out of (you’d read it in the pages of) Tacitus in the Roman empire, something out of postcolonial states, something you’d see in the Soviet Union when the secret police would dispute with the army. This is about egos and imperatives, about two people who see themselves as independent of anybody else and as principals, not as servants of the public. It’s a question of personalist government. I mean, think how weird and anomalous and really sinister the position of Elon Musk was. Elon Musk was the head of a government department. Now, formally, other people were named as the head of this DOGE—whatever, the Department of Government Efficiency—but Musk was given status as a special government employee. Everyone could see he was in charge. He hired other outside people and brought them in. All of this at the same time as he was one of the government’s largest contractors, and at the same time as he was an independent businessman who had not divested any of his companies. Normally, if you’re a business leader and you go into government, you have to sever yourself from your business interests to avoid conflict-of-interest rules, which are not just opinions in the government but are actually backed by the force of law, or used to be—that if someone in government employ uses his power or her power to do something that advantages his business interests or hers, or to disadvantage a competitor or hers, that’s against the law. And there are a variety of statutes that can catch you up. Musk every day was ignoring all of those practices and rules and legislation, some of them backed by the force of criminal sanction. And the people who he brought into government, again, they often had outside interests or had past concerns that would’ve subjected them to conflict-of-interest rules. All of that, ignored. They imposed big cuts in important areas of government—not just the tragedy of cutting the HIV program in Africa, PEPFAR, that saved tens of millions of lives since it was initiated by President George W. Bush, but Securities and Exchange Commission, Internal Revenue Service. Agencies that directly bore on the active business interests of Donald Trump and Elon Musk, these were shut down by Elon Musk. And maybe all those IRS employees who were in charge of auditing high-income individuals, maybe those SEC people who were dealing with allegations of SEC issues involving Musk, maybe they were all irrelevant and unnecessary and redundant and overstaffed. Or maybe they were just in the way, and somebody used personal power to get rid of them—personal power that was converted into state power to get rid of them. Now, Musk is not activated just by self-interest. He does have these weird ideological ticks that seem to be getting weirder. And those have been part of what has driven the United States government too. The United States is turning away refugees from everywhere, including people who serve the United States and Afghanistan, and it’s rolling out a red carpet for white Afrikaner farmers. I don’t know—maybe they’ve got a claim. I’m not hostile to the white Afrikaner farmers. But it is strange that there’s a locked door for everybody else and a red carpet for the people with whom Elon Musk identifies, as his family originally comes from South Africa. Again, this is a question of using state power for personal ends. Look—the statement that is supposed to define the United States government is that it’s a government of laws, not men. The rules and regulations, the government is always supposed to be more powerful, more enduring, more important than the people who work in it. And the people there are there to serve. But that idea really does seem to be jettisoned—not just abandoned, but actively jettisoned, repudiated—in the Trump years. And this dispute exemplifies it. Musk’s particular criticisms of Trump’s so-called big—what do you [call it]? Big, bouncing baby boy—whatever he calls that bill. Musk’s may well be valid. The billisirresponsible; it does add a lot of money to the debts and deficits in the out years. There’s a kind of card trick going on here, where, in 2017, when Trump passed his first tax cut or the tax cut of the first administration, the only reason it met the deficit-and-debt rules that it had to be passed under was by saying it would expire in 2025. Now that it is expiring in 2025, the Trump people say,Well, it doesn’t really cost anything, because we’re largely extending tax cuts that were passed in 2017. Yeah. But in 2017, you said they would expire, and that’s why they had one price. If theydon’texpire, they have a different price, and you’re engaged in a kind of hustle. And so Musk’s criticisms of this, they may well be true. But he’s not criticizing because he’s motivated by a disinterested concern for the public finances. Remember how his interests were exempted from all the budget cuts that were imposed on other people. He’s mad at Trump for his own reasons, and so he’s using a weapon at hand. In his case, at least one of the things he’s reaching for is true. The others—accusing Trump of being in the Epstein files—those may be more far-fetched. But he’s reaching for everything he can get—but not because he cares about these issues, but because he’s asserting his own ego to punish someone he’s mad at. And Trump is doing the same. Trump is threatening to withdraw government business from Elon Musk’s companies. And, again, look—there’s a strong case that Starlink and SpaceX should not be in private hands, the United States government should take them over. These are essential to national security. And if it’s true that Elon Musk turned off Starlink to disadvantage the Ukrainians, he was using his corporate power for personal, ideological, or other interests at the expense of the public welfare. So that has to be dealt with. But Donald Trump, again, is not motivated by impersonal concern for the public welfare. He’s punishing an opponent. And so suddenly, conflict-of-interest rules that didn’t interest him 15 minutes ago are suddenly the order of the day. We are having a breakdown of the rule-of-law system in the United States. I’ve often worried that you could have a Trump administration, or you could have the rule of law in the United States, but not both. You could have Elon Musk in government, or you could have government be pure of conflicts of interest, but not both. The law is the victim of both these men. And both of them need to be run out of town as fast as possible, after which, let the law take its course. And now my conversation with Senator Ruben Gallego. But first, a quick break. [Music] Frum:The story of Senator Ruben Gallego is both an amazing story of personal achievement and also a classic American narrative of what this country can deliver. A son of immigrants in this country from Latin America, Ruben Gallego grew up in Chicago in a single-parent home. He joined the Marine Corps while still an undergraduate at Harvard. He served in combat in Iraq in a unit fiercely engaged with the insurgency. He settled in Arizona after his military service, was elected to the state assembly as a Democrat, then defied the red wave of 2014 to win election to the U.S. House of Representatives in that difficult year. Here’s where the high political drama begins. In 2018, Arizona Democrats elected Kyrsten Sinema to the U.S. Senate. In office, Sinema became alienated from her party and ultimately declared herself an independent. Congressman Gallego emerged as the leading challenger to Sinema’s reelection. She decided not to run again, rather than face him. He then faced the ultra-Trumpy election denier Kari Lake in the general election of 2024, and beat her too. Along the way, Gallego’s own image as a fighting progressive has shifted toward the political center. He’s now regarded by many Democrats as one of their brightest future stars, and it’s a pleasure and honor to welcome him toThe David Frum Show. Senator, thank you for joining us today. Ruben Gallego:Gracias, David. Frum:I’m speaking to you from about as deep inside the beltway as you can get—like, almost the buckle of the beltway. And some of our viewers may share that same condition with me. So just to enlighten all of us, when you said your constituents want a “big-ass truck,” how big-ass is the truck they want? Gallego:(Laughs.) Well, big enough for them to feel like they’ve succeeded in life. And I think that’s, basically, what I’m trying to say. And when I joked about it, it really is somewhat true. Like, if you grow up, like I did, in a working-class Latino family, your measure of success was what people would consider artificial, but is actually real. It’s the real, tangible things: Buying a home, being able to get a nice truck that is responsive to the fact that you worked hard for this, and you took a lot of pride in that truck. You wash that truck on the driveway every weekend, with your kids. And when we can’t deliver that as a party—me and Democrats as a party—if these men feel that we’re not able to get them that future that can allow them to buy that “big-ass truck,” or take that vacation, or feel a little more comfortable, or buy that house, or start that business, then we’re going to lose their votes. Frum:Well, let me ask you about that lesson. So I was going through the leadership of both parties, House and Senate, and I’m struck that leader after leader comes from about as safe a state as you can get: South Dakota; Wyoming; or New York, New York. And that’s true, by the way, with the executive branch too. Donald Trump used to be a New Yorker, but he became a Floridian to run again in 2024. J. D. Vance comes from what used to be a swing state, Ohio—not a swing state anymore. You’re one of the very few people who’s in the national conversation who comes from a highly competitive state, possibly even the most competitive state. So as someone who’s won elections in a competitive state, what lessons do you think you have for the people who are looking at politics from the safety of the sidelines? Gallego:Well, I think one of the things that you could give the credit to, really, me and Mark Kelly, for example, my senior senator, is that we don’t have the luxury of being in anything safe. And one of the benefits about Arizona, too, is that there is no real bubble in Arizona. I guess you could be in a political bubble if you want, but, you know, Democrats and Republicans live next to each other. They’re still friends. They still hang out. They still work together. This is why you saw so many Gallego-Trump voters, right? Because these are the people that can make these nuanced separations of who they want, who they think best represents them. And it also means that you can’t avoid what is going on or what people’s fears are. You know, one of the things that I think was very instructive for us—at least, like, just generally for my campaign—is that one of the things that that helped us is that we were very realistic about what was happening out there, what people were feeling. And while everyone was trying to say that the economy was getting better—because I think I’m in a competitive state, and, generally, I don’t really live in an uppity area; I live in a working-class area in South Phoenix; I really get to touch real grass all the time—and I heard it from people at the grocery store, at the gas stations that they were just having a tough time making ends meet. And this isn’t 2022 when I’m hearing this. I’m hearing this in early 2024. I’m hearing the sense of desperation that they’re just working so hard, and they’re just not getting anywhere. Or these young men and women that are looking at the world that they don’t understand anymore, because, you know, for Arizona, four years ago, if you had a family making middle-class, middle-income salary, you could afford a house. Now the average house in Arizona is about $530,000. And good luck, you know, finding that house; it’s probably far out in the middle of nowhere and, on average, a 7.5 percent mortgage. And so we talked to the voter about what they wanted to hear and talk about and what they were worried about. When everyone was trying to deny that there was a problem at the border, every Democrat was trying to deny the problem at the border, we knew that that was just not the case. And people were still talking about the border. They were worried about it, and they were mad at Democrats for allowing this chaos to happen. Instead of running away from it, we ran right to the fight and brought the arguments about why we were better than our opponent on these issues. And I think that ended up being one of the saving graces, why we’re able to outperform really all Senate Democrats in the country, considering, especially, that Arizona does have about 300,000 more registered Republicans than Democrats. We have no choice as candidates—me, Mark Kelly, other statewide candidates—to make sure that we are actually figuring out a way to win in a bipartisan manner, by keeping our values also as Democrats but also delivering to Arizona. We have no choice. We have to do it. Frum:One of the things I noticed about Democrats from sort of the safer areas is: They attach a lot of importance to words, and often more importance to words rather than to things. And I’m struck here— Gallego:Or deeds, yeah. Frum:There’s been a project to evaluate why Democrats are doing poorly with men. And when you read the discussion about it, it’s all about changing the way we speak, changing the way we frame things. The idea that there might actually be something of substance that is the problem, that’s not something that seems to be very acceptable. Now, you don’t have that luxury. Gallego:I don’t have the luxury. But also, it’s like you don’t—the Democrats are all about data until they don’t like the data. The data for men is: They’re just not doing well. This is not just Black men, Latino men. This is all men, right? We have the lowest amount of college attainment. Salaries are going down. Life expectancies are going down. There’s just this general discontent within the male population. If you just look at the data, you would say,Hey—this population of the United States is not doing well. We should figure out what to do about it. Let’s have conversations. Let’s have town halls. Let’s have real studies about this. And what you see, and what I’ve seen in the past, is there’s this—I try not to exaggerate how sometimes the Democrats can be anti-male, but there is a certain amount of that that does happen. When you start talking about it, people are saying, like,Oh, you’re concentrating on males and forgetting X, Y, Z population,which I don’t think is the case. I think we care about Americans. We should care about all Americans. And if men aren’t doing well, us as a party who are supposed to care for the people that are not doing well, we should do something about it. And we could do, at the same time, making sure we’re protecting women’s rights, making sure that women are also at the forefront of everything, that we’re protecting the LBGTQ community, all these kinds of things, right? But the fact is, for some reason, Democrats have gotten sheepish about this. You know, there’s people that are involved in different types of think tanks about the status of men and boys, and they’re largely frozen out of the conversations around Democratic policy making, because what we want is: We want the male vote, but we want it cheaply. We want the male vote to come to us without us getting some other interest groups pissed off. And we also want the male vote to come with us, and we want it to be within our safe little tent of ideas and ideology, and we want them to be perfectly fine to fit with all of our other friends. Which, guess what? That’s just not how we’re going to win. We’re going to have to accept that some of these male voters are not going to be aligned with certain sectors of our tent if we want to win. If we don’t want to win, then fine. Accept that we’re going to be a small tent, and hopefully we win once in a while. But in reality: The Democrats want the male vote without actually having to work the male vote. And they think they can just throw a bunch of dudes on podcasts and, you know, bro it up, and that’s somehow going to solve the problem. It’s not going to solve the problem. Frum:One thing that has been attended in the Trump years—and you can say this is actually a good thing about America, and maybe even one of Donald Trump’s few positive legacies—is the American melting pot does continue to bubble along. You can see it as early as the 2010s, but you can really see it happening in the 2020s, that we are seeing a big decrease in race and ethnic polarization in the United States. But we’re paying for it by having this big increase in sex polarization. So men are men. Women are women. Wherever they come from, whatever the color of their skin, the women are voting more like each other; the men are voting more like each other. So the melting pot is bubbling, but the wall of separation between the sexes seems to be getting higher and higher. Gallego:Yeah, a hundred percent. And look—some of it is COVID-induced. Some of it is: They’re listening to different things. One of the things we knew instinctively, because growing up Latino and working class: Latino men do not intently watch Univision, Telemundo. They don’t intently follow politics. They largely are disconnected from the normal avenues of—well, I would say that normal people kind of consume news and political news. And one of the things that I emphasized on my campaign early on is a nontraditional way to reach these men, because you’ve got to understand the way these guys are. I mean, when I was in construction, I would wake up at 6 a.m., go to the site. Hopefully, it’d be done by 3 p.m. but probably not. So maybe you’re back at home by 5 p.m. You’re dirty as hell. You’re smelly as hell. You’re jumping in the shower, and then maybe, you know, you’re in time—you’ve made it home in time for dinner, right? You’re sitting down to dinner, and then you have probably a couple hours before you zonk out to start the next day. Do you want to spend that time watching the news? Do you want to spend that time talking politics? No. You want to spend time with your family or with your friends, because your day sucked, and it’s going to suck again tomorrow. And so you do this rinse and repeat, rinse and repeat. So where are they getting all their information from? Well, a couple places. Number one, they’re getting it from their other coworkers at worksites—which by the way, people forget when it comes to Latino men, the people they’re most likely to work with besides other Latino men are white working-class men, right? And white working-class men are very much politically involved and have a lot of political information that they’re getting. And they’re sharing it with their Latino coworkers, right? And number two, they’re living off their phones through different social media, whether it’s Instagram, Snapchat, or all this kind of stuff, Twitter. So one of the things that we emphasize is trying to figure out how to get a message, a vibe, about who I was to these Latino male voters early on, so that way they understood, like,Ruben Gallego is a Democrat. Ruben Gallego says he’s for the working class. But then we also had a very strong cultural attachment. Like,He understands me. He actually worked at factories, worked in construction, understands the dignity of work, the responsibility of a man to his family, to provide for his family, and how important that is to me as a man. And that kind of stuff, we are afraid to approach to get these men to start considering us as Democrats. And then, because we never talk about it, we never give them the dignity of allowing them to be family leaders and not making them feel bad about being family leaders. And then we’re surprised when, year after year, we don’t continue to have this conversation with us, they keep on moving away from us. And it’s a dumb trade-off, because we continue to do that because we think that somehow we’re going to piss off female voters. And I don’t think that’s the case. Female voters are worried about their sons or daughters and their husbands. They’re worried about the fact that they’re becoming less social. They’re worried about the fact that they’re not actually being productive in life. And they want to have good husbands—heck, they want to have goodex-husbands that are involved with their kids’ lives, and they’re making good pay and paying their child support, things of that nature. But for some reason, the Democrats have continued this trade-off, and it’s going to continue going until we realize: Making sure [of] people’s economic needs will cross all racial barriers and, if you do it rightly, will also cross these gender gaps that we’re seeing. Frum:Well, let me ask you: You’re famous for having banned the use of the termLatinxfrom any communication you do. But let me ask you about a term you’ve been using:Latino. You’re originally from Chicago. If someone practiced politics in Chicago 100 years ago and someone said there’s this thing called an Eastern Europeano—Croat, Serbs, they’re the same; Poles, Ukrainians are the same; everybody loves the Ashkenazi Jews—it’s just one thing. Gallego:I think if Chicago, like—if you weren’t Irish or Scottish or Polish, you were Bohemian. That’s the way they would describe any European that they couldn’t describe. Yeah. And then me, growing up, you were Spanish or Mexican, if you were lucky, or Puerto Rican. Frum:But let me ask you this: Is this concept of Latino helping anybody understand anything at all? And as particularly the Democratic Party, that a lot of Democratic Party politics has been driven over the past quarter century by the idea,Okay, there’s this new minority. They all come from the same continent and half a continent—because Mexico, of course, is in North America—and most of them speak Spanish, some speak Portuguese, some speak indigenous languages. But we’re going to group them into a thing, and we’re just going to assume we own them, and they’re going to naturally gravitate to voting for us. They’re going to be in opposition to the standard organization of American society, and they’re going to want minority set-asides. And that’s the way to talk to them. And the very invention of the concept of Latino has been a disabling—part of your family comes from Colombia; part of your family comes from Mexico. Those are very different historical experiences. Gallego:Oh, hell yeah. Frum:And with Eastern Europeans, we would understand if your father was Serbian and your mother was Croat, that didn’t make you an Eastern Europeano; that made you a person with two different heritages that you had to balance. Gallego:I think the mistake that happened, it’s like the names don’t matter so much. Now go back to whyLatinxmatters versusLatino: What happened within the progressive left, as well as the Democratic Party, is that you had all these Latinos that kept voting Democratic, right? Yeah, no matter what. And the difference was two things. Number one: There was discrimination against Latinos. I mean, you saw signs going into the 1970s, you know, no spics, no dogs allowed. In the Southwest, there was housing discrimination, there was educational discrimination. And of course, that drove those voters to the Democratic Party, because we were the only party, really, that was outright for equality. The level of income attainment was extremely low. So the Latino population on average was poorer than the Anglo population. And the Democrats were the party of the middle class, a working class of: Who’s going to protect your rights? Who’s going to protect your wages? Who’s going to give you an opportunity to go to a good school and live the American dream? That was the Democratic Party. What happened is: the Democratic Party kind of kept on evolving, and the Latino population kept growing bigger and bigger. The Latino population changed—and I don’t mean change, as in there was new populations that came in, except for the Cubans; that’s another tangent and a weird story there. But we got bigger, and we also got richer within our population. And even though, on average, Latinos are poorer, we have a lot of great success stories in America, right? If you look at the police forces in a lot of our big cities, you have a lot of Latino police forces. You have a lot of Latino firemen. So there’s been this—and this is a good story, by the way. This is a good story. This is what you want to happen to your immigrant communities, right? This is the story of the American dream. We are moving up to middle class; we’re moving everything else. And so the Democratic Party just never changed as the Latino population was changing, right? And if anything, it actually went further away from what they were, right? Focusing more on social issues and not so much on the economic issues that we were known for. And then also, just adopting things that the Latino community would naturally be against, right? Open borders, for example, was something that if you had Latino friends, they would’ve told you,Well, that’s dumb. Like, why? Why would you do that?Kind of the anti-police rhetoric. We live in neighborhoods where we want police to treat us well but also to be present, and this anti-police rhetoric that took off for many years affects them, especially, again, when we have so many people that are in the military—sorry, in the police force. And this kind of moving away from this idea of patriotism being a core value of the Democratic Party and understanding that America is an exceptional country and we should pride and value that, it goes against the grain of what Latinos know, right? Our kids serve in the military. We actually come here because we think it’s an exceptional country. And when Arizona—sorry, when Democrats are sheepish about talking about the country in that way, it does an impact. Frum:Well, let me ask you about the military. So you were in Iraq. You served with a unit that took a lot of casualties. You saw some hard things. Some of the people in your cohort who returned from Iraq, like the serving vice president, have been radicalized and embittered—or so they say that’s why they’ve been radicalized and embittered. He wasn’t radicalized and embittered. I knew him when he immediately came back from Iraq, and he wasn’t radicalized and embittered then, but the farther the experience recedes, the more embittered he becomes about it. Other people who have served in the post-9/11 wars—like your former House colleague Dan Crenshaw, like some of your Senate colleagues, Tammy Duckworth—they retain their faith in America’s purposes in the world, that American military power is a necessary thing and a force for good. How do you process your military experience, and how does it affect the way you think about America’s role in the world and America’s military in the world? Gallego:Yeah, I mean, for me, it’s pretty interesting just because, I mean, the vice president and I were actually in Iraq at the same time. He was serving on a base called Al Asad, and I was a frontline infantry unit that was never on base. And actually, my unit was from Ohio, so the Reserve unit I served with, Lima 3/25. And as you know, we ended up, unfortunately, seeing a lot of combat and lost a lot of men. And I actually did come back embittered. I came back embittered at the administration for sending me to a bogus war to begin with. And they sent me to a bogus war without the equipment that I needed, that got a lot of my men killed—and the manpower, by the way, because I was covering an area the size of West Virginia with only a company of men, or battalion, I should say. And so I was very embittered at our government about that. But it never made me an isolationist, because I think, looking at the world in a rational way, we can’t afford to be isolationist. I want security for the future of my kids, and I want economic security too. Part of that is going to be that we have to have friends, and we need strong friends. Because we don’t have the mass that China has. And I’m not talking about the military mass—because I don’t want to go to war with China—but we don’t actually have the actual manpower, economic leverage that we have, unless we have other friends, unless we have other allies. And when it comes to any kind of military support, having other friends that are with us. And I want to prevent wars. I think the best way for us to prevent wars is to have alliances, is to believe in actual treaty obligations, and also to find ways to prevent wars through multilateralism, through investments in bringing down, for example, poverty around the world. I mean, one of the reasons why I had such a hard time fighting over there is because everybody in western Iraq was trying to kill me, and some of these people weren’t even trying to kill me because they were idealogues, but because they were poor. Some insurgent was going to give him a hundred bucks just to drop an IED at the side of the road, right? Like, I saw the actual results of instability in the world. And yes, there was a lot of bad leadership decisions and somewhat criminal decisions that came from the Bush administration. But tearing down the system that has actually brought the longest amount of peace, in general, in the longest time since World War II is just plain dumb. And some of the things that I think actually motivates these people to actually try to destroy these institutions is because: If there’s less institutions that are connecting us, if there’s more isolationism, it actually empowers the most powerful people within this country, which I don’t think we want either. I see this as the opposite way. It doesn’t mean we have to be everywhere. I certainly have not supported engagements or potential engagements all around the world. I supported us, for example, when it came to the JCPOA, because I don’t want to go to war with Iran, under President Obama. I’ve been against some of our potential expeditions and longstanding, overstayed, and out of compliance with some of our rules and regulations in terms of operating overseas, like in Syria and other countries. And I think we should have deep oversight. But this idea that we’re just going to go to zero and close down the borders, I think is just not, when it comes to our alliances, is just not realistic. It’s not going to happen, and I think it’s going to make more unsafe than anything else, and I think will actually lead us to more of a situation in terms of a confrontation with China than less. Frum:You’re on the border, and the Trump administration, one of its areas of greatest military adventurism has been with increased military activity in Mexico. They’re overlying drones. They say the drones are unarmed, but they’re drones that are capable of being armed. It looks like they didn’t give the Mexican government advanced notice of all the drones that are flying. President Trump, the vice president, many others in the Republican Party have spoken about taking some kind of military action inside the territory of Mexico or on the seas that are just outside Mexico’s territorial waters. How do you think about that as someone who represents Arizona? Gallego:We want, and we do have, a good relationship with the Mexican government in Arizona. Our police forces will talk to their police forces. They have problems. There’s no doubt there’s corruption. There’s no doubt. But what you’ve seen is when some of the best outcomes have always been when we’ve actually worked with our friends and treated them like friends and allies, and helped them build their capability to fight back, fight corruption, fight these cartels, fight these terrorists. You’ve seen some of the best COIN operations in, for example, Colombia that were effective. And I think we could continue doing that. But if we decide to do these unilateral actions without working with these countries, without giving them some level of respect, we’re going to end up having less support from that government, but less support from the people who will continue to hide these horrible, horrible humans that are also terrorizing these communities. It’s also very insulting to a lot of—and this is something that I’ve seen that we’ve done, not just to them but to sort of Afghan allies we’re not rolling in. It’s insulting to them as if they don’t have some agency, right? Thousands and thousands of Mexican police officers, government workers die every year fighting these cartels. And the fact that we kind of give this whole broad brush and say they’re all corrupt, they’re all evil I think is something that’s going, again, to not help us make friends where we need friends to fight these organizations. Frum:Well, you mentioned Colombia. Until a little while ago, it looked like one of the big successes of American policy in the 21st century: Plan Colombia that restored order, the reorientation of the Colombian economy away from drugs to exporting agricultural goods that serve people rather than killed people. Colombia got hit with a wave of tariffs by the Trump administration. Now he’s helped to legitimate the far left that has come back into Colombian politics. Is that a situation that you follow, and what lessons do you see for countering surgency from the Colombian experience? Gallego:Yeah, I do follow it a lot. Look—you know, when President Petro of Colombia really used this opportunity to kind of create this jingoistic situation where you’re able to draw attention to the sins of what the United States is doing, and not necessarily the things that are occurring in Colombia, which economically aren’t great. And when you’re putting tariffs, you’re creating two things: Number one, for your kind of marginal farmer, especially out in rural Colombia, doing, you know—export farming is profitable, but not that much. And it is also fairly marginal, right? It is a lot more profitable for you to farm and harvest cocoa, right? And other, drug, products. And so you’re making an economic incentive for people to move away. You’re also messing with our economy, too (the United States economy), because talking to some of these big industries down there who import American flour, corn, soy—they’re right now looking for new partners anywhere else besides the United States because they don’t want to deal with the drama ofAm I under a tariff?versusAm I not under a tariff? You know, their biggest import from the United States is actually soy, which is ridiculous considering they’re essentially next to—they share a border with—Brazil. Now, you know, the Brazilian soy market is hunting around in Colombia, trying to basically say, like,We’re your better partner. They’re gonna—look: They’re gonna try to get flour from somewhere else. You know, the Colombian farmers, because it’s a very volcanic earth, really value American tractors and farm equipment because they’re solid. You know, they have a great reputation. They’re easy to fix. The parts are easy to get. And now they’re trying to get new products from Korea, from China, from Europe, because they don’t want to deal every year, again, with whether your tractor is going to end up having a 10 percent, 20 percent tariff or counter-tariffs. So this is the instability we’re causing. That what was essentially unnecessary instability, right? Because Colombia has always accepted Colombians that are being returned for deportation. All they were asking is, like,Hey—just don’t bring them in a military plane and we’re fine. And I think that’s some of the least thing we—one of the things we could do to keep relations, to keep the flow going, obviously, people that should be deported. But, you know, we end up, again, shooting ourselves in the foot because the way that this administration does security is they focus on being tough and not smart. They focus on showing, like,We’re gonna do these things, but at the end of the day, all they’re doing is causing more chaos. They were talking about criminals, and now they’re rounding up kids, rounding up parents, rounding up workers that we need, just so they could prove that they’re wrong, when the voter really did not ask for that. They didn’t ask for this, they asked for criminals. They asked for a tighter border; they got a tighter border. But now you’re deporting families just so you could say you’re hitting these arbitrary numbers that Stephen Miller wants. Frum:A lot of you—you talk about the harm of tariffs very eloquently. A lot of people in your party have been having a difficult time articulating a tariff message because they actually kind of like tariffs. If President Trump has been the most protectionist president since 1945, President Biden was the second-most. And so you hear a lot of Democrats saying things like,Well, I’m against dumb tariffs. I’m for smart tariffs, implying they’re for smart tariffs, implying that there is or could be such a thing as a smart tariff. And the result is you have a very narrow difference. And to your point just now, I mean, when Democrats say,I want to do the same thing as Donald Trump, but I want to do it smarter, what a lot of people hear is not,Well, you are smarter.[It’s]Oh, you’re the party of people who think they’re so smart, but you don’t actually have a principled criticism of what the president does. You’re just showing off that you think you’re better educated and more intelligent. But you want to do the same thing, only with fancier words, the way you always want to do it. So are there Democrats who are going to be able to say,You know what? Tariffs are just dumb. Don’t do them. We should trade in peace and freedom with the rest of the world? Gallego:Are there? —I mean, I’m not a miracle worker here, David. But look—what we’ve seen in terms of the turnaround in our economy, right? If you would’ve said eight years ago that the United States was gonna be able to manufacture the majority of the chips it needs within 10 years, we would’ve been like,You’re freaking nuts, right? Because all the chip manufacturing was being done overseas. And within that short time period, we were able to stand up and move U.S. manufacturing of advanced chips to a point where we’re going to be net exporters in the next couple years. That wasn’t from tariff policy; that was from an actual industrial policy about how we’re actually gonna brick this back, right? And we need to figure out how we can bring certain industries back and how we could do it smartly by competing, right? By having the best workers possible, by having the best industry possible, with having the best regulatory frameworks they could add to the tax policies, everything else. Like, that’s how you make it. So you could actually bring these middle-class jobs back. But the other thing that really annoys me is that, like, who do they think works these middle-class jobs? Who do you think works these factories? Right now they’re about, last I heard—I’d have to go back and check. But, you know, we’re probably close to a million—sorry, we’re at about a million factory jobs that are opening right now. Those are immigrants that work those jobs. When I was working at a meat factory, growing up, I got $1 more because I was the only one that spoke English—or, well,Ispoke English. I’m sure there’s others that spoke English too. But the people that worked at that factory were Mexican immigrants and Polish immigrants, right? So let’s say we do build that steel plant here. First of all, let’s find the investors that are willing to put in the seven to 10 years to build it. Like, the people that work in a lot of these places are the people that we’re trying to kick out of this country right now, or won’t let in. And so how are we—how is this smart in any way? Frum:You come from one of the most outward-facing states in America, in the country—a border state, a state with a dynamic economy, a state of entrepreneurship and immigration. If anyone’s gonna carry a flag for open trade, free trade, it’s gonna be a senator from Arizona. John McCain was a great free trader. Can we look to the senators from Arizona to lead the fight against tariffs and for free trade? Gallego:Yeah. No, like, I think I can’t speak for the other senator, but what we’ve seen is, like, Arizona is richer because of trade—and not just, by the way, [with] Mexico, which, by the way, has definitely been a big driver, besides the fact that everyone just focuses on the security side of it. We are actually a richer state, and the country would be much richer if we actually made our ports of entries faster, more aggressive, and predictable in some regards because some people don’t know when they’re gonna come in. But we are now trading with, you know, all around the world. We just opened up a direct airline route, or will be soon, from Phoenix to Taiwan. Our jobs, our high-skilled jobs, our highest-paying jobs are due to trade. And in some regard, if we actually want stability, especially in the Western hemisphere, we should embrace free trade that, you know, emphasizes our brothers and sisters south of the border getting good-paying jobs, getting those industry jobs that we don’t want to do in the United States, so they could stop the migrations that are moving here to the United States. There is a way for this all to be a win-win for the United States. And I think using our ability, in terms of our superpower—which I think our biggest superpower is actually human capital—where we can bring anyone from all around the world and use their drive, their brainpower and put it into this massive other amount of brainpower to experiences all around the world. We could outcompete anybody, but we actually have to believe in them. We have to make the investments in them. And I think that is going to be a better way to actually move the middle class, get them those jobs that they need, than these types of, like, ham-fisted tariff policies. Frum:Last question, because I know we have a hard out, and you’ve been very generous with your time. You came from a tough background. You had an astonishing career. Your talent was picked out early. You went to Harvard. You volunteered. You saw some dark things in combat. You came back. You chose politics after that background at a strikingly early age. You didn’t get rich first. You went into politics directly. Gallego:I did want to get rich first, to be honest. (Laughs.) Frum:(Laughs.) Why did you choose politics? Gallego:You know, I think it really chose me. I always wanted to do government service. I actually thought that I was going to end up in the State Department, or the FBI, or something of that nature. I got back from the war—I mean, I was fucked up, to be honest. You know, my best friend died. It was seven months of just hard, hard combat. And then we got back and, you know, we were Reservists, and they just let us go, right? So two weeks after I get back from Iraq, I am given my orders, I throw my stuff in my sea bag, and they’re,Right. You’re out; you’re gone.You know, no housing, nothing. And luckily, I had friends and family to fall upon. But then the stories started coming from my guys that they were having problems getting jobs. They were having problems getting VA treatments, getting into the VA—all these things that were just terrifying to me. And I was already pissed from the war because, again, they sent me to war without the proper armor on our vehicles, proper intelligence, without enough manpower, all this kind of stuff. And so I found myself talking more and more to these guys about—these guys, my brothers—trying to help them get into the VA, trying to help them get into school. You know, some of them were living on my couch for a little bit to keep them off the streets. And I started complaining to the state reps, to the state senators,Why can’t my guys have in-state tuition?Marines would be overseas for three years, and they’d come back to their home state or to another state, and they say, like,Well, you never lived here.Like,Yeah, well, I’ve been gone forever. And it just kept on coming back and forth, back and forth, and I just kept complaining to congressmen and to everybody. And I realized that, I mean, everyone talks a big game, but no one really gives anfabout us until they really need us. But I have a purpose here, and it’s going to continue to service. You know, my guys and I are going to have our 20-year reunion this year. I’m 45. I’m one of the older side of veterans, and if I’m not doing this right now, you know, who’s going to hold this administration to the fire? They want to cut 83,000 veteran—VA employees arbitrarily, right? And for me, I’m able to use my position as a veteran, as a combat veteran, and I’m pushing back on them. I’m not sure if I was here, would someone be doing as aggressively as I am? And I think that that tells me I’m doing something right. Frum:Thank you. Thank you for the time today. I’m really grateful. Thank you for the candor. It’s been an interesting conversation. I really appreciate you taking the time for us. Bye-bye. Gallego:Appreciate it. Adios. [Music] Frum:Thanks so much to Senator Gallego for joining me here onThe David Frum Show. Remember, if you enjoy this dialogue and similar content, please subscribe toThe Atlantic. That’s the best way to support the work ofThe David Frum Showand all of myAtlanticcolleagues. I’m going to close with some farewell thoughts about the weekend ahead. If you are planning to fly into Washington, D.C., over the weekend of June 14, be prepared for a lot of airplane closures. Reagan National Airport will be closed, and traffic at the other regional airports is likely to be disrupted. The reason for this is the big parade scheduled for June 14. Now, ostensibly, this is a parade to salute the 250th anniversary of the United States Army, founded in June of 1775. But we all know this story is not true. The Continental Navy was founded in the fall of 1775, and the Marines shortly thereafter. They, too, are celebrating 250th anniversaries this year. No parade for them, because their anniversaries do not coincide with the birthday of President Trump. President Trump is throwing a big birthday bash for himself at public expense, making a parade, which he has wanted for a long time. And the Army is his excuse but not his motive. As I say, if it were the real thing, you would find a way to honor the Army, the Navy, and the Marine Corps together, all of them celebrating their 250th anniversary this year. Now, President Trump has wanted a big military parade since he saw one in France in his first term, on Bastille Day. The Army and the other services, the Department of Defense, resisted this demand for a long time, and for three main reasons. The first was the reason of expense. The Trump birthday party, the military component of it, will cost, all in—both the cost of the parade and the cost of repaving the city streets afterwards—probably in the vicinity of $100 million. That’s a very large amount of money, even by military standards. And in the first term, at least, the money would’ve been spent at a time of general prosperity and pretty lax controls of spending. In the second term, President Trump is engaged in massive budget cuts throughout the rest of the government. We’ve eliminated the PEPFAR program for Africa that delivers anti-HIV drugs to Africans of all ages, and especially children. People’s lives are at risk to save the $7 billion that PEPFAR costs. It’s indecent to be cutting PEPFAR and throwing the president a $100 million birthday party. So the military has resisted on grounds of expense. They’ve also resisted on grounds of uselessness. Look—parades used to serve a purpose. The skills on display in a parade—marching in step, the cavalry trotting in line—those were highly relevant military skills in the days when armies fought in formation, when infantry formed into line, when cavalry moved at a trot. But in today’s world, the skills that you need to do at a parade have nothing to do with how armies fight. And the weeks and weeks of preparation that the units have to do in order to be ready for the parade is just a waste of time. And these are all, by the way, highly paid, highly skilled professionals. Their time is valuable. We want our war fighters, as Secretary of Defense Hegseth calls them, to be preparing to fight actual 21st-century war, not demonstrating their skill and readiness to fight the wars of the 18th and early 19th century. But there’s an even more fundamental reason that the Army resisted for such a long time, and that was: They sensed there was something political about these parades. Trump was not doing this, really, to salute the military. He was summoning the military to salute him. And the military, rightly, would never refuse an order, but they would point out,This is expensive. This is a distraction. And if you order us to do it, we will leak the details of how expensive and how useless it is to the newspapers, so that everyone will see what you are doing. That was the first term. But in this second term, the military is headed by people who—unlike the military leadership in the first term—under Secretary of Defense Pete Hegseth, pose no resistance to the orders and demands and wishes and imperatives and whims of President Trump. The Hegseth DOD is an arm of Trump’s PR politics. And so it’s all parade, all the time. There is no one now to advocate for the interests of the national defense against the whims of the president. I think this you’ve all heard before, but there’s something else I want to point out here. The idea that a president would cause massive inconvenience to the traveling public, disrupt the traffic of the District of Columbia, all to honor himself is a real slap in the face and a real denial of the fundamental relationship that the constitutional system envisions between the president and the people. The president is a public servant. He is the highest-ranking government employee. He’s not the master. He’s not the king. He’s not the emperor. Traditionally, presidents receive no honor of any kind in their own lifetimes. If they had distinguished themselves in office, after they had passed then they would be honored in all kinds of ways: the Lincoln Memorial, the Jefferson Monument. Everything’s the other way around. I think it’s the Lincoln Monument and the Jefferson Memorial. You’d issue postage stamps for them. The streets would be named for them, counties. There are Jackson Counties all over the United States. Presidents were honored after the end of their lifetime. But in their time, they were just another government employee, like the undersecretary of agriculture. And there certainly was no public commemoration of their birthdays. Donald Trump does not see himself as a public servant. He sees himself as a public master. That’s why he’s always demanding thanks for his allocation of government resources. When President Trump sends emergency assistance to a county that’s in need, it’s not his money. No one owes him any thank-you. He’s doing his job, sending the public’s money to the place where public law provides for it to go. And yet he thinks, because he is the president, he, therefore, is owed deference, he is owed obedience, he’s owed thanks, and he’s owed a parade. And this habit of thinking is spreading through his government. Other Cabinet secretaries have also given themselves birthday parties of public expense and have issued statements on Twitter saluting the Cabinet secretary for the birthday. It’s a habit that grows from the top down, and it’s a violation of the way that Americans used to conduct themselves. Look—in Britain, there’s a long and lively tradition of military parades on the monarch’s birthday. They troop the colors. In fact, this year, the trooping of the colors for King Charles’s birthday will be June 14. Charles’s birthday will be June 14, just like President Trump’s parade. But Charles’s parade is not on his actual birthday; his actual birthday is in November. but he’s going to have his parade on June 14 because that’s the best day for the public to watch it and enjoy it, and it’s also the easiest day for the troops to parade. If you know London, you’d much rather parade in the June sunshine than in the November gloom and rain. So Charles, the king of England, is thinking of others when he arranges the continuation of the long-established tradition of the trooping of the colors on the monarch’s birthday. President Trump, ostensibly a servant of the people, ostensibly a lowercaserRepublican official, ostensibly just the highest-ranking person in the government bureaucracy—he’s doing more than King Charles to honor himself at other people’s expense and other people’s inconvenience. It’s not the biggest scandal of the Trump administration by any means, but in some ways it’s the most revealing. Thanks so much for joining me today. I’m David Frum. I hope you’ll return next week for another episode. [Music] Frum:This episode ofThe David Frum Showwas produced by Nathaniel Frum and edited by Andrea Valdez. It was engineered by Dave Grein. Our theme is by Andrew M. Edwards. Claudine Ebeid is the executive producer ofAtlanticaudio, and Andrea Valdez is our managing editor. I’m David Frum. Thank you for listening. **About the Author**"}