{"id": 2082, "name": "Open Society Foundations", "domain": "opensocietyfoundations.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.opensocietyfoundations.org/what-we-do/regions/latin-america-and-the-caribbean", "title": "Latin America And The Caribbean", "content": "Who We Are Our History George Soros Leadership Board of Directors Financials Policies and Notices Offices How We Work How We Fund Grants and Fellowships Awarded Grants Who We Are How We Work What We Do What We Do Where We Work Africa Asia Pacific Europe and Central Asia Latin America and the Caribbean Middle East and North Africa United States Voices Events Newsroom Publications Employment Contact us **Subscribe to updates about Open Society’s work around the world** By entering your email address and clicking “Submit,” you agree to receive updates from the Open Society Foundations about our work. To learn more about how we use and protect your personal data, please view ourprivacy policy. **Latin America and the Caribbean** In Latin America and the Caribbean, the Open Society Foundations seek to bolster democratic change by transforming growing public concern about inequality, corruption, violence, and the climate crisis into powerful initiatives and alliances to build an open and safe society. Overview Our Work Our History **Offices** **Rio de Janeiro, Brazil** The Bogotá, Mexico City, and Rio de Janeiro offices work closely together on efforts to defend democracy, increase governmental transparency, protect minority rights, reduce homicides, and reform drug policy in Latin America and the Caribbean. Open Society Foundations **Bogota, Colombia** The Bogotá, Mexico City, and Rio de Janeiro offices work closely together on efforts to defend democracy, increase governmental transparency, protect minority rights, reduce homicides, and reform drug policy in Latin America and the Caribbean. Open Society Foundations **Mexico City, Mexico** The Bogotá, Mexico City, and Rio de Janeiro offices work closely together on efforts to defend democracy, increase governmental transparency, protect minority rights, reduce homicides, and reform drug policy in Latin America and the Caribbean. Open Society Foundations **Port-au-Prince, Haiti** Fondation Connaissance et Liberte Rio de Janeiro, Brazil Bogota, Colombia Mexico City, Mexico Port-au-Prince, Haiti **By the Numbers** **Expenditures by Year** **Our Work** We work to advance Open Society’s values in Latin America and the Caribbean through grant making, advocacy, network building, and collaboration with partners and stakeholders. Our strategy includes a focus on three priority countries: Brazil, Colombia, and Mexico. **Supporting Democratic Governance** Countries across Central and South America face enormous political pressure from deep-rooted financial, economic, and social challenges that have fueled the rise of authoritarian leaders willing to subvert democratic freedoms and rights to maintain power. Open Society is working with a range of local partners to develop policies and strategies that help democracies overcome these often-overlapping issues, which now include the intensifying impact of the climate crisis. This work seeks to connect democracies to people’s everyday needs. Our work includes funding groups that support political engagement by women, by communities of African descent, and by indigenous people that have been often left out of the democratic process. **Media Independence and Disinformation** In Latin America, the Open Society Foundations support efforts to protect journalists from threats and violence that they can face while doing their job. We also seek to sustain independent investigative reporting on issues that may be overlooked by the mainstream media for political or business reasons. Our efforts to combat disinformation include supporting fact-checking sites and efforts identify the sources. **Reducing Violence** Latin America’s cities have some of the world’s highest rates of violent crime, much of it linked to gang violence. We support groups that seek to improve public safety through a community-based approach that involves local youth groups and businesses, and goes beyond a reliance on punitive policing. **Climate Justice** From drought in Central America to the extreme weather threats in the Caribbean, the climate crisis is wreaking havoc in the region and intensifying displacement of people who do not have resources to adapt to, prepare for, and recover from climate change. Open Society is working to achieve transformational climate and economic policies centering the social dimensions of the transition and adapting to climate impacts that help bolster trust in democratic institutions and reduce inequality. **Drug Policy Reform** In Colombia, we have funded efforts to develop beneficial commercial uses for coca leaf that can benefit small-scale growers, as an alternative to crop eradication campaigns. In Bolivia, we advocate for a coca control model that allows farmers to legally grow a limited and regulated quantity of coca leaves—a mainstay of Andean life for 4,000 years. The model has reduced coca cultivation, decreased violence, and helped stabilize rural economies. **Our History** Open Society started supporting civil society groups in Latin America and the Caribbean in the 1990s. We have offices in Rio de Janeiro, Mexico City, and Bogotá. In 2022, our Haiti foundation, FOKAL, founded in 1995, became a fully independent entity. **Highlights of Our Work in Latin America and the Caribbean** **Helping Haiti Recover from a Devastating Earthquake** **Helping Haiti Recover from a Devastating Earthquake** **Supporting Justice for One of Central America’s Most Murderous Generals** **Supporting Justice for One of Central America’s Most Murderous Generals** **Expanding the Drug Policy Debate through Art** **Expanding the Drug Policy Debate through Art** **Read more** **The Fight for Abortion Rights in Colombia** Not long ago, Colombia had a total ban on abortions. A group of dedicated activists fought to end the criminalization and expand women’s rights. Their story—and what it means for reproductive justice around the world. **The Fight for Abortion Rights in Colombia** Not long ago, Colombia had a total ban on abortions. A group of dedicated activists fought to end the criminalization and expand women’s rights. Their story—and what it means for reproductive justice around the world. **Q&A: How One Colombian City Is Tackling Violent Crime** Palmira, Colombia, is one of the most violent cities in the world. But a prevention program focusing on youth has reduced crime significantly—and earned it an international peace prize. The city’s mayor on what’s working. **Q&A: How One Colombian City Is Tackling Violent Crime** Palmira, Colombia, is one of the most violent cities in the world. But a prevention program focusing on youth has reduced crime significantly—and earned it an international peace prize. The city’s mayor on what’s working. **How Impact Investment in a Digital Platform Can Advance Labor Rights for Domestic Workers in Latin America** Of Latin America’s 18 million domestic workers, most are informally employed. Our Soros Economic Development Fund is investing in a digital platform to legally employ domestic workers and improve labor rights. **How Impact Investment in a Digital Platform Can Advance Labor Rights for Domestic Workers in Latin America** Of Latin America’s 18 million domestic workers, most are informally employed. Our Soros Economic Development Fund is investing in a digital platform to legally employ domestic workers and improve labor rights. **Subscribe to updates about Open Society’s work around the world** By entering your email address and clicking “Submit,” you agree to receive updates from the Open Society Foundations about our work. To learn more about how we use and protect your personal data, please view ourprivacy policy. **Voices** Read the latest from our staff, grantees, and partners about how we’re working around the world to build vibrant and inclusive democracies whose governments are accountable and open to the participation of all people. **How We Fund** Every year the Open Society Foundations give thousands of grants to groups and individuals that work on issues we focus on—promoting justice, equity, and human rights. Who We Are Our History George Soros Leadership Board of Directors Financials Policies and Notices Offices How We Work How We Fund Grants and Fellowships Awarded Grants What We Do Where We Work Themes Events Newsroom Publications Employment Contact Us"}