{"id": 60, "name": "KSKA - NPR - Anchorage", "domain": "alaskapublic.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://alaskapublic.org/news/politics/alaska-legislature/2025-06-10/alaska-commercial-fishing-limits-present-a-crisis-many-coastal-residents-say", "title": "Alaska Commercial Fishing Limits Present A Crisis Many Coastal Residents Say", "content": "PBS Shows Live TV WATCHScheduleWatch KAKM LiveWatch KTOO 360TV LiveWatch PBS KIDS 24/7 LiveWays to WatchAK PassportAlaska InsightIndie AlaskaThere's Hope. There's Help.In My FamilyScheduleWatch KAKM LiveWatch KTOO 360TV LiveWatch PBS KIDS 24/7 LiveWays to WatchAK PassportAlaska InsightIndie AlaskaThere's Hope. There's Help.In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family LISTENKSKA SchedulePodcastsAll Radio ProgramsAddressing AlaskansAlaska Economic ReportAlaska Morning NewsAlaska News NightlyBlack History in the Last FrontierHometown, AlaskaIditapodLine OneMidnight OilOutdoor ExplorerState of ArtStoryCorpsTalk of AlaskaTraveling MusicKSKA SchedulePodcastsAll Radio ProgramsAddressing AlaskansAlaska Economic ReportAlaska Morning NewsAlaska News NightlyBlack History in the Last FrontierHometown, AlaskaIditapodLine OneMidnight OilOutdoor ExplorerState of ArtStoryCorpsTalk of AlaskaTraveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music NEWSLatest NewsAlaska DeskAnchorageEconomyEducationEnvironmentHealthIditarodNationalPoliticsPublic SafetySubscribe: Daily DigestMount SpurrLatest NewsAlaska DeskAnchorageEconomyEducationEnvironmentHealthIditarodNationalPoliticsPublic SafetySubscribe: Daily DigestMount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr LEARNCommunity Education EngagementLearning MediaMolly of DenaliParent ResourcesReady to LearnWatch PBS KIDSWorkforce DevelopmentCommunity Education EngagementLearning MediaMolly of DenaliParent ResourcesReady to LearnWatch PBS KIDSWorkforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development SUPPORTWays to GiveBenefits of MembershipCorporate SponsorshipAKPM MerchandiseWays to GiveBenefits of MembershipCorporate SponsorshipAKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise ABOUTAKPM AppCareersCommunityContactE-NewslettersEventsFundingPeoplePublic DocumentsPublic MeetingsAKPM AppCareersCommunityContactE-NewslettersEventsFundingPeoplePublic DocumentsPublic Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings BROADCAST STATUS DONOR PORTAL AK PASSPORT PBS Shows Live TV On AirNow PlayingKSKA 91.1 FM WATCHScheduleWatch KAKM LiveWatch KTOO 360TV LiveWatch PBS KIDS 24/7 LiveWays to WatchAK PassportAlaska InsightIndie AlaskaThere's Hope. There's Help.In My FamilyScheduleWatch KAKM LiveWatch KTOO 360TV LiveWatch PBS KIDS 24/7 LiveWays to WatchAK PassportAlaska InsightIndie AlaskaThere's Hope. There's Help.In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family Schedule Watch KAKM Live Watch KTOO 360TV Live Watch PBS KIDS 24/7 Live Ways to Watch AK Passport Alaska Insight Indie Alaska There's Hope. There's Help. In My Family LISTENKSKA SchedulePodcastsAll Radio ProgramsAddressing AlaskansAlaska Economic ReportAlaska Morning NewsAlaska News NightlyBlack History in the Last FrontierHometown, AlaskaIditapodLine OneMidnight OilOutdoor ExplorerState of ArtStoryCorpsTalk of AlaskaTraveling MusicKSKA SchedulePodcastsAll Radio ProgramsAddressing AlaskansAlaska Economic ReportAlaska Morning NewsAlaska News NightlyBlack History in the Last FrontierHometown, AlaskaIditapodLine OneMidnight OilOutdoor ExplorerState of ArtStoryCorpsTalk of AlaskaTraveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music KSKA Schedule Podcasts All Radio Programs Addressing Alaskans Alaska Economic Report Alaska Morning News Alaska News Nightly Black History in the Last Frontier Hometown, Alaska Iditapod Line One Midnight Oil Outdoor Explorer State of Art StoryCorps Talk of Alaska Traveling Music NEWSLatest NewsAlaska DeskAnchorageEconomyEducationEnvironmentHealthIditarodNationalPoliticsPublic SafetySubscribe: Daily DigestMount SpurrLatest NewsAlaska DeskAnchorageEconomyEducationEnvironmentHealthIditarodNationalPoliticsPublic SafetySubscribe: Daily DigestMount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr Latest News Alaska Desk Anchorage Economy Education Environment Health Iditarod National Politics Public Safety Subscribe: Daily Digest Mount Spurr LEARNCommunity Education EngagementLearning MediaMolly of DenaliParent ResourcesReady to LearnWatch PBS KIDSWorkforce DevelopmentCommunity Education EngagementLearning MediaMolly of DenaliParent ResourcesReady to LearnWatch PBS KIDSWorkforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development Community Education Engagement Learning Media Molly of Denali Parent Resources Ready to Learn Watch PBS KIDS Workforce Development SUPPORTWays to GiveBenefits of MembershipCorporate SponsorshipAKPM MerchandiseWays to GiveBenefits of MembershipCorporate SponsorshipAKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise Ways to Give Benefits of Membership Corporate Sponsorship AKPM Merchandise ABOUTAKPM AppCareersCommunityContactE-NewslettersEventsFundingPeoplePublic DocumentsPublic MeetingsAKPM AppCareersCommunityContactE-NewslettersEventsFundingPeoplePublic DocumentsPublic Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings AKPM App Careers Community Contact E-Newsletters Events Funding People Public Documents Public Meetings BROADCAST STATUS DONOR PORTAL AK PASSPORT **Alaska commercial fishing limits present a 'crisis,' many coastal residents say** Twitter LinkedIn Email Many coastal Alaskans say that a half-century of the state's limited-entry system for commercial fishing has resulted in an economic crisis for residents of small, often predominantly Native communities. That'saccording to the Northern Journal, which also found most state lawmakers disinterested in the topic of changing how Alaska's commercial fishing permitting works. Northern Journal reporter Nat Herz says, at the heart of it, are advocates who want more opportunities for rural, young Alaskans to fish for a living. Below is the transcript of an interview with Herz on Alaska News Nightly. It has been lightly edited for length and clarity. Nat Herz: If you're an 18-year-old and you're growing up in a Bristol Bay village, where do you get $250,000 for a permit, plus another couple $100,000 for a boat and nets and everything else? Like, it's not really feasible, and a lot of folks say, \"This system really isn't working. It's causing our coastal, rural, Gulf of Alaska economies to kind of shrivel up and die. Can we do something about it?\" Casey Grove: So they described it as a crisis. What did lawmakers in Juneau tell you when you asked them about this crisis? NH: I mean, I think it's kind of interesting. This is an issue, as one lawmaker who I spoke to about it described it, this is an issue that's been cooking for 50 years, right? So it's like it's a system failure, and it's a system failure that's been sort of slowly playing out over 50 years. And I think, like, if you're attuned to it, if you live in a village, you have ties to a village, you've been campaigning in a village, you'd be acutely aware of it. But most of the lawmakers in Juneau don't represent coastal, rural Alaska. They represent, like, urban Alaska, the Mat-Su, Anchorage, Fairbanks. They don't really have any idea that this is happening, because, again, it's like a small population of Alaska, a small number of people who don't have, like, a large lobbying presence in Juneau. And then the folks, also, who represent more rural Alaska areas, they also have this sort of countervailing constituency of folks who maybe bought permits or own permits and don't necessarily want to see the system kind of tinkered with, even around the edges. Because, as I think a lot of your listeners know, like, the fishing industry has been in real chaos over the past few years. Like people don't want anything to happen that's going to make even sort of a marginal negative impact on the number of fish they're allowed to catch, or the value of their permit or something like that. CG: I mean, is that to say that they are concerned that potentially adding more permits would dilute the value of the ones that they have? NH: Yeah, I think one of the issues here is that there isn't a consensus about what exactly do you do to fix this systemic failure? Like, do you create a new class of permits that's only accessible for people who live in these small, coastal, rural villages? Do you allow tribes to own permits and sort of manage them communally and fish them communally, which is something that isn't currently allowed, because there's sort of a fear of consolidation and non-individual ownership. I think right now there's much more of just this big question of, \"Oh, we need to fix the system.\" And I think people who are in the system hear, \"Fix the system,\" and they think, \"OK, this is code for taking it out of us.\" And I think, you know, certainly, you change the system, and it's going to impact existing players. But, you know, there's a lot of analysis and work and conceptualization that has to go into that that hasn't really happened, because lawmakers haven't been working on it intensively yet. And I think, you know, the one thing that they've made really clear — I went to a reception in Juneau, where the Sealaska Interim President Joe Nelson, who's also the co-chair of the Alaska Federation of Natives, he spoke — and the thing that he said is, like, \"We don't have a specific ask for you yet,\" but one thing he said was, \"We're not trying to, like, take it out of the highliners,\" right? And the highliners being kind of like the fishermen that make the most money and catch the most fish. I think he was really trying to communicate, \"OK, if you're in the fishing industry now, you shouldn't see this sort of effort and advocacy on our part as a threat to you.\" And I think that's groundwork that they're starting to lay and probably is going to take a lot more work to, like, convince other industry stakeholders that I heard from in my story, who I think were pretty leery, if not outright hostile, to the idea of messing with limited entry whatsoever. But I think that's sort of a challenge that the advocates who are working on this are aware of and kind of ready to work on. CG: And, you know, speaking of lawmakers and maybe a lack of will to even bring this up at the Capitol, you spoke broadly to legislators about this. It sounded like there wasn't a ton of interest. They were dealing with the budget and school funding. But in particular, you spoke with Senate President Gary Stevens, who is from Kodiak, who, you know, represents some of the folks that are concerned about this. And what did he tell you? NH: I mean, I'm not going to sugarcoat it. He was fairly extraordinarily dismissive. I think he was distracted. You know, there's a lot going on in Juneau right now, but he declined to participate in a panel. I sent out a survey to a bunch, all the coastal legislators, that nobody filled out, and he did not agree to be interviewed. And when I sort of approached him in the hallway, his response was basically like, \"Yeah, we're gonna work on this. We'll put some time and energy and into it. But I don't see any need to speak with you about this at all.\" And, you know, I think my reaction was like, \"I can write my story. I don't need his point of view.\" I think I was surprised that, given the sort of urgency and severity that many of his rural village, Indigenous constituencies are treating this issue, that he was not willing to engage with me on it. But that's, you know, totally within his rights not to participate. Twitter LinkedIn Email twitter instagram youtube facebook QUICK LINKSContact UsOrganizationCareersPeoplePublic DocumentsFCC ApplicationPublic MeetingsOur EventsE-NewsletterWays to Watch Contact Us Organization Careers People Public Documents FCC Application Public Meetings Our Events E-Newsletter Ways to Watch Contact Us Organization Careers People Public Documents FCC Application Public Meetings Our Events E-Newsletter Ways to Watch CONTRIBUTEDonate NowWays to GiveCorporate Sponsorship Donate Now Ways to Give Corporate Sponsorship Donate Now Ways to Give Corporate Sponsorship Accessibility Commitment"}