{"id": 729, "name": "JURIST", "domain": "jurist.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jurist.org/features/2025/05/30/voices-of-afghanistan-interview-series-i-dont-want-the-world-to-recognize-the-taliban-if-this-happens-womens-rights-will-be-forever-violated/", "title": "Voices Of Afghanistan Interview Series I Dont Want The World To Recognize The Taliban If This Happens Womens Rights Will Be Forever Violated", "content": "News▾All Legal NewsUS Legal NewsWorld Legal NewsThis Day @ Law All Legal News US Legal News World Legal News This Day @ Law All Legal News US Legal News World Legal News This Day @ Law Dispatches▾All DispatchesAfghanistanCanadaEUGhanaIndiaIranIsraelKazakhstanKenyaMyanmarPakistanPeruSri LankaUKUkraineUS All Dispatches Afghanistan Canada EU Ghana India Iran Israel Kazakhstan Kenya Myanmar Pakistan Peru Sri Lanka UK Ukraine US All Dispatches Afghanistan Canada EU Ghana India Iran Israel Kazakhstan Kenya Myanmar Pakistan Peru Sri Lanka UK Ukraine US Commentary▾All CommentaryFaculty CommentaryProfessional CommentaryStudent Commentary All Commentary Faculty Commentary Professional Commentary Student Commentary All Commentary Faculty Commentary Professional Commentary Student Commentary Features▾All FeaturesExplainersLong ReadsMultimediaInterviews All Features Explainers Long Reads Multimedia Interviews All Features Explainers Long Reads Multimedia Interviews Topics Rule of Law▾MaterialsPodcasts Materials Podcasts Materials Podcasts About▾FAQStaffAwardsApplyJournalist in ResidenceBoard of DirectorsContact Us FAQ Staff Awards Apply Journalist in Residence Board of Directors Contact Us FAQ Staff Awards Apply Journalist in Residence Board of Directors Contact Us Donate▾Why Support JURIST?DonateHonor Roll Why Support JURIST? Donate Honor Roll Why Support JURIST? Donate Honor Roll In August 2021, the world watched as the Taliban regained control of Afghanistan, sweeping away two decades of progress toward democracy, human rights and gender equality. While international headlines have since moved on to other crises, millions of Afghan women and girls continue to live under increasingly restrictive policies that have systematically stripped away their most fundamental rights. This series of anonymous interviews gives voice to those who have been deliberately silenced. Through intimate conversations with women and girls across Afghanistan, we document the profound human impact of the Taliban’s return to power. From students forced to abandon their education to professionals removed from public life, these firsthand accounts reveal the day-to-day reality behind the headlines—a reality of dreams deferred, freedoms revoked, and lives fundamentally altered. What emerges is not just a chronicle of loss, but a testament to extraordinary resilience. Despite facing restrictions on their movement, dress, education, and employment, Afghan women continue to resist in ways both large and small. Their stories demand our attention not as abstract victims of geopolitical circumstances, but as individuals with unique perspectives, aspirations, and undiminished dignity. In publishing these interviews, we honor the courage of those who have shared their experiences despite considerable personal risk. Their names have been changed and identifying details obscured, but their voices — clear, honest, and urgent — remain intact. As the international community’s focus wavers and diplomatic engagement with the Taliban regime increases, these testimonies stand as a powerful reminder: Afghanistan’s women and girls must not be forgotten, and their rights cannot be bargained away in the name of stability or expedience. This is the seventh in a series of interviews that will explore the many facets of the lives of Afghanistan’s women and girls under a resurgent Taliban. The first in the series can be found here:Voices of Afghanistan Interview Series: ‘We’ve been all but erased from public life’. The second can be found here:Voices of Afghanistan Interview Series: ‘We will continue to resist, to hope, and to fight for a better tomorrow’. The third can be found here:Voices of Afghanistan Interview Series: ‘We, Afghan girls and women, will call for freedom with every breath’. The fourth can be found here:Voices of Afghanistan Interview Series: ‘Afghan women are not just victims; we are strong, resilient, and capable’. The fifth can be found here:Voices of Afghanistan Interview Series: ‘If we don’t defend our rights, this could continue for generations to come. We won’t let it’. The sixth can be found here:Voices of Afghanistan Interview Series: ‘We, the female doctors—once symbols of women’s progress, ability, and independence—are now facing barriers, threats, and silence’. Tell us about your life before August 2021. After finishing my schooling in Kabul, I studied IT at an institute and graduated about six months later. When I graduated from my IT program, I applied to many schools to work as a teacher, but none accepted me because I lacked work experience. Finally, I went to one of the schools and said, “If you don’t accept me, how will I get work experience?” The school accepted me. I taught English, computer skills, and Dari. I taught for a year at that school, then went on to teach at another private school. When the school day ended, I taught at my home and in other people’s homes. After that, I worked as a manager in a private office. Then I moved on to working in the reception department of a private hospital. I then sat for my entrance exam at the academy and passed. Passing that exam opened up a whole new world for me. It was very difficult for me to study in an unfamiliar environment, but I tried my best to overcome the challenges ahead of me. I graduated with honors in the field of law, and won a presidential medal. After graduating from the university, I stayed home for a while during the pandemic and joined the duty shortly after. I was living a normal life like other people. I went to work and to the master’s department at Kardan University. Around that time, an opportunity presented itself for me to continue my master’s degree at a private university in Kabul. I took the exam on behalf of the Ministry of Defense and fortunately I passed at Kardan University. I was so happy. At that time, the idea of going abroad for my studies did not appeal to me. I didn’t want to move abroad because I was helping my family. Instead, I wanted to become either a Minister or Deputy Minister of Defense. But everything changed so abruptly. How did you learn about the events of August 2021, and what were your initial thoughts or reactions? I was on duty and walking to the office when my sister called to tell me to come home because the Taliban had come to power. I wasn’t sure what to do. Suddenly, the cars became very crowded on all the roads. My colleagues and I had no idea what to do. We all drove home in the same car. I got home that evening. I was very scared. The streets were so crowded. That night, there was no electricity, the phones didn’t work, and the internet was down. Everything was dark. Everyone was in a panic. It was a really bad day and night in my life. Which of the Taliban’s new policies concerning women has most significantly impacted you? What about your family and community? All the Taliban’s policies impacted us deeply. The policies restricted women in every way. People can no longer live according to our own wishes, especially us women and girls. It affected us all badly, and many of us were forced to leave our homeland. When we look at history, everything comes down to women. Women are always the most impacted by political strife. Women are always unable to achieve their dreams. This is a painful reality. This has profoundly affected my life in negative ways—and the lives of all Afghan girls. Can you share a story that illustrates how life has changed for women in Afghanistan? I will tell my story. I was an educated girl. I studied for four years in an environment that few people can tolerate. I continued studying until I reached my goal. In the end, I became an immigrant living on the Pakistan border. Every girl carries a story of shattered dreams—schools and universities closed to them, and doors to high-ranking positions firmly shut. The Taliban did whatever they could to hinder women’s progress. Here in Pakistan, I see people who have nothing to eat, living in great hardship. The heat is punishing, there are economic problems, and visa problems to name a few. All these problems contribute to a collective anxiety. I know people who have committed suicide because they believed there was no future waiting for them. I knew those people myself. What was the reason for all this? The lack of a good government. Can you describe a moment when you felt the impact of the new rules most strongly? I felt the impact most when the Taliban took away the military card that I worked so hard to earn. It took me four straight years to get that card. In the end, all my dreams and aspirations were shattered. It was a truly painful moment in my life. And when the doors closed to girls, I felt terrible. I felt alienated from my country. I was forced to leave my country. Alone. What would you like the world to understand about your current situation? What do you think is the most misunderstood aspect of your current situation? I would like the world to understand that girls who were on duty became immigrants, and no action was taken on their behalf. Schools and universities should be opened, and girls should have the right to live in their own country. Those who became immigrants in Pakistan and Iran should be given serious attention, especially military personnel, of whom I am one, and attention should be paid to immigration cases. I don’t want the world to recognize the Taliban. If this happens, women’s rights will be forever violated and unable to defend our rights ever again. What gives you hope or strength in these challenging times? For me personally, feeling hopeful is challenging right now. I always hope that the situation in my homeland will improve. I always hope we can leave this country. It is really hard to have hope when you don’t even know what the future holds. I have spent these past three years hoping that one day I would leave this place. It is really very challenging. Anyone who lives here in Pakistan understands and appreciates what I am saying. SCOTUS dispatch: justices grapple with nationwide injunctions blocking Trump’s birthright citizenship order Ghana dispatch: Supreme Court upholds suspension of the Chief Justice AI-Enabled Drones, State Responsibility, and the Rule of Law: Legal and Ethical imperatives ‘Cancer Alley’ Residents Win Petrochemical Suit Appeal: Opportunity for Justice Voices of Afghanistan Interview Series: ‘I don’t want the world to recognize the Taliban. If this happens, women’s rights will be forever violated’ Explainer: Imposing Sanctions on the International Criminal Court—A Wrong Move By the United States? University of Alabama desegregated after governor ends blockade On June 11, 1963, the University of Alabama desegregated when Governor George Wallace, facing Alabama National Guard troops federalized by President Kennedy, ended his blockade of the University of Alabama in Tuscaloosa and allowed two African-American students to enroll.WatchPresident Kennedy's Civil Rights speech, delivered on this day."}