{"id": 133, "name": "Big Think", "domain": "bigthink.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bigthink.com/the-long-game/the-tony-seba-and-james-arbib-interview-why-the-future-belongs-to-stellar-societies/", "title": "The Tony Seba And James Arbib Interview Why The Future Belongs To Stellar Societies", "content": "The Big Think Interview Your Brain on Money Playlists Explore the Library The Universe. A History. The Progress Issue A Brief History Of Quantum Mechanics 6 Flaws In Our Understanding Of The Universe Hindsight Game Change Michio Kaku Neil deGrasse Tyson Michelle Thaller Zena Hitz Steven Pinker Paul Bloom Ray Kurzweil Cornel West Helen Fisher Business Neuropsych Thinking Leadership Smart Skills High Culture The Past The Present The Future Life Health Hard Science Special Issues Big Think Books Starts With A Bang Mini Philosophy The Learning Curve The Long Game The Well Perception Box Strange Maps 13.8 Free Newsletters Memberships **The Tony Seba and James Arbib interview: Why the future belongs to “stellar societies”** In their latest book, Stellar, Tony Seba and James Arbib argue that the old system of “extraction” — reliance on land, labor, and capital — is over. Instead, we’re entering an age of abundance powered by technologies that need no external input to continue growing. Seba and Arbib consider how individuals and businesses alike can adapt — and thrive — in this unfolding future. I recently sat down with futurists Tony Seba and James Arbib, co-founders of the think tankRethinkX, to discuss their latest bookStellar. Known for their bold predictions about the disruption of industries like energy, food, and transportation, Seba and Arbib argue that humanity is undergoing a civilizational phase change. The core premise? We’re leaving behind the old system of “extraction” — reliance on land, labor, and capital — and entering a new world powered by technologies that need no external input to continue growing. This is a “stellar”world, and it’s one of abundance. In this wide-ranging conversation, we explore howStellarcame to be, what makes the current transformation different from anything before, and how individuals and businesses alike can adapt — and thrive — in this unfolding future. Eric Markowitz:Let’s go back to the beginning. How did this collaboration start? James Arbib:Well, before we met, Tony had already writtenClean Disruption of Energy and Transportation, and developed this whole framework around technological change. I came at this from an environmental background — I was investing in cleantech and trying to shift capital away from fossil fuels. One of the projects I was involved in led me to a meeting with the U.S. military, focused on the national security implications of transitioning to clean energy. They were holding a scenario planning day with the Military Advisory Board, and all these big names were there — BP, Exxon, the State Department — and they all had the same straight-line forecasts out to 2050. Maybe 30% adoption of solar and EVs by then. Tony Seba:And when it was my turn to speak at that event, I just said: “That’s not how disruptions happen. They’re not slow or linear — they’re nonlinear, exponential, and follow an S-curve. If you plan based on linear forecasts, you’re going to make catastrophic errors.” James Arbib:And I remember standing up and saying, “I agree with Tony.” We ended up getting coffee after the event, and what we discovered was that we were both asking the same core questions. Eric Markowitz:What were those questions? James Arbib:One was: What’s really at the root of climate change, inequality, and the major social problems we face? Because so much of the environmental discourse felt like it was treating symptoms, not causes. Carbon taxes, behavior change, subsidies — they’re Band-Aids. We were trying to get to the source. Tony Seba:And my version of that question was: How does change actually happen? Not just small, incremental change, but massive systemic transformation? And once it starts, what are the consequences? James Arbib:That led to the founding of RethinkX. We committed to offering free, public research that modeled how technological disruptions really unfold. We analyzed over 1,500 historical disruptions to understand what makes them go from fringe to dominant — and what happens next. Tony Seba:The idea was simple: if the U.S. military — the world’s largest organization — has a flawed view of the future, based on outdated models, then who can plan well? We wanted to create tools for better foresight. We argued the most disruptive tech wasn’t lab-grown meat or regenerative farming, but something most people hadn’t heard of: precision fermentation. Eric Markowitz:And that work led to your first book,Rethinking Humanity, right? James Arbib:Yes, though even before that we published sector-specific reports — on transportation, food, energy. In 2017, we said the disruption of transport would be autonomous, electric, and on-demand. Not a cleaner version of the gas car — but a complete transformation. Tony Seba:The same was true in food. We argued the most disruptive tech wasn’t lab-grown meat or regenerative farming, but something most people hadn’t heard of: precision fermentation. Making proteins with microbes on steep cost curves. That’s the kind of insight that came from asking: What enables new systems to flourish? Eric Markowitz:So how didStellarbuild on that? Tony Seba:WithRethinking Humanity, we realized we were still thinking in silos — energy, food, transport. But the bigger question was: What happens when all these systems change at once? We saw that these transformations were systemic, interlinked, and reinforcing. James Arbib:And it turns out, yes, there is historical precedent. Sumer, Egypt, Rome, the Industrial Revolution — whenever you have simultaneous, transformative changes in energy, food, materials, and information, society itself undergoes a phase change. But this time is different. Tony Seba:Because this time, we’re not just replacing old inputs with slightly better ones. We’re leaving the entire logic of extraction behind. These new technologies — solar, AI, robotics, fermentation — theyembodyland, labor, and capital. Once built, they keep producing with almost no additional input. That’s never happened before. These new technologies — solar, AI, robotics, fermentation —embodyland, labor, and capital. Once built, they keep producing with almost no additional input. That’s never happened before. Eric Markowitz:And that’s what you call the shift from “extraction flow” to a “stellar society.” James Arbib:Exactly. Extraction societies are built around managing inputs — land, labor, capital. That creates competition, hierarchy, and inevitably, exploitation. It’s why slavery, inequality, and environmental degradation have been constants in civilization. They were features, not bugs. Tony Seba:But in a stellar system, you don’t need continual input. The system is self-sustaining. The only input is sunlight. That breaks the growth imperative and flips the entire economic equation. Eric Markowitz:That’s a pretty radical statement. How do you see it playing out practically? James Arbib:Let’s take energy. Today, your business model is shaped by energy costs — how much you pay per unit, how much you waste. But if you suddenly have a superabundant energy system at zero marginal cost, everything changes. Entire industries will be reshaped. And new ones will emerge that we can’t yet imagine. Tony Seba:We’re not building the butterfly. We’re sticking wings on the caterpillar. We’re shoehorning solar and wind into centralized systems built for fossil fuels, and that’s why we’re hitting regulatory and economic bottlenecks. But a truestellarsystem — built from the ground up — unlocks radically different properties. James Arbib:And it’s not just technology. It’s governance, thought, institutions. In extraction, centralized hierarchies made sense. In a stellar world — made of distributed, self-sufficient nodes — they don’t. Everything from ownership to organizational design will be reimagined. Eric Markowitz:What about the human side? How do individuals adapt to this kind of systemic upheaval? James Arbib:That’s the heart of it. You have to developantifragility— the ability to lean into change and grow stronger. Because this is going to be the most profound shift in 10,000 years of civilization. And it’s not just external. It’s internal, too. Tony Seba:Extraction shaped our minds. We evolved to think linearly, mechanistically, because that’s what extraction rewarded. But now, holistic, systems thinking becomes valuable. Even our social sciences — economics, psychology, sociology — they were developed for humansin extraction. That’s why they so often fail us now. James Arbib:And there are signs of change. Consciousness movements, biohacking, decentralized communities — they’re all pieces of this transition. But we still lack a unifying vision that ties them together. You have to developantifragility— the ability to lean into change and grow stronger. Because this is going to be the most profound shift in 10,000 years of civilization. Eric Markowitz:Speaking of resistance — how do you think about the entrenched interests that want to maintain the current system? Tony Seba:We’re already in a dual economy. Part of the world is still playing by extraction rules. The other part — solar, AI, robotics — is moving fast. And the extractive side is collapsing under its own entropy. We don’t need everyone to agree. Just someone, somewhere, to make it work. James Arbib:And once that happens, others will follow. It’s a race to the top. Whoever gets there first — whether it’s a city, company, or country — will unlock outsized value and leapfrog the rest.Incumbents will resist, but they’ll be left behind. Eric Markowitz:What keeps you optimistic? Tony Seba:Stellar is a system of radiance. It gives back. It’s restorative. Extraction is high-entropy and self-destructive. Stellar is negative-entropy and regenerative. That’s not just better economics. That’s a better civilization. James Arbib:And I see it happening in pockets already. From spiritual exploration to technological experimentation, people are reaching beyond the extractive mindset. The seeds are there. We just need to nurture them. Eric Markowitz:I love that. And I’ll just say, from my end — this really connects with my own work. I’m writing a book calledOutlast, about long-term thinking and resilient systems. I’ve been interviewing companies that have lasted for centuries. What they all have in common is a non-extractive relationship with their communities. It’s mutual. It’s regenerative. It’s, well — stellar. Tony Seba:Amazing. Keep us posted. Stellaris availablehere. Learn more atRethinkX.com. **Footer** Business Neuropsych Thinking Leadership Smart Skills High Culture The Past The Present The Future Life Health Hard Science Special Issues Big Think Books Starts With A Bang Mini Philosophy The Learning Curve The Long Game The Well Perception Box Strange Maps 13.8 The Big Think Interview Your Brain on Money Playlists Explore the Library Our Mission Work With Us Contact Privacy Policy Terms of Use Accessibility Careers Free Newsletters Memberships The Weekly Crossword"}