{"id": 358, "name": "DeSmog", "domain": "desmog.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.desmog.com/2025/06/11/jordan-peterson-paul-marshall-alliance-for-responsible-citizenship-arc-project-receives-500000-from-ceo-disgraced-pharma-firm/", "title": "Jordan Peterson Paul Marshall Alliance For Responsible Citizenship Arc Project Receives 500000 From Ceo Disgraced Pharma Firm", "content": "**DeSmog** **DeSmog** NewsEnergyScience DenialAd & PRSocial JusticeAgriculturePolitics and PolicyFalse SolutionsActivismCanadaFinanceOpinion & AnalysisAll Articles Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion & Analysis All Articles Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion & Analysis All Articles DatabasesClimate DisinformationAgribusinessAd & PRKoch NetworkAir Pollution Lobbying Climate Disinformation Agribusiness Ad & PR Koch Network Air Pollution Lobbying Climate Disinformation Agribusiness Ad & PR Koch Network Air Pollution Lobbying SeriesAd & PR GreenwashingGas Lock-InClimate Change LawsuitsClimate-conflicted bank directorsLouisiana’s Cancer AlleyHistory Lessons#ShellKnewAntimicrobial Resistance Ad & PR Greenwashing Gas Lock-In Climate Change Lawsuits Climate-conflicted bank directors Louisiana’s Cancer Alley History Lessons #ShellKnew Antimicrobial Resistance Ad & PR Greenwashing Gas Lock-In Climate Change Lawsuits Climate-conflicted bank directors Louisiana’s Cancer Alley History Lessons #ShellKnew Antimicrobial Resistance MultimediaPhotosVideosCartoons Photos Videos Cartoons Photos Videos Cartoons MoreAbout UsContactJobs About Us Contact Jobs About Us Contact Jobs **Jordan Peterson’s ARC Project Receives $500,000 from CEO of Disgraced Pharma Firm** The Alliance for Responsible Citizenship(ARC), the radical right-wing network fronted byJordan Peterson, has accepted a large sum from a pharmaceutical executive whose firm was fined $47 million by the U.S. Department of Justice (DOJ) last year, DeSmog can reveal. A press release from QOL Medical on 18 Aprilannouncedthat its CEO Derick Cooper had given $500,000 to ARC, whose only previously known donor had beenGB Newsand Spectator ownerPaul Marshall. In November, QOL Medical and Cooper agreed to pay an eight-figure sum to the DOJ after admitting to healthcare fraud allegations. Namely, the company distributed free breath test kits to healthcare providers, claiming the tests diagnosed Congenital Sucrase-Isomaltase Deficiency (CSID), a rare genetic disorder. QOL Medical then used these test results to sell its CSID treatment, Sucraid, to the healthcare providers. However, in reality, the breath tests only measured low sucrase activity, which does not result exclusively from CSID. The DOJreportstates that Cooper “was aware of and approved the implementation and continuation of this marketing programme.“ **Subscribe to our newsletter** Stay up to date with DeSmog news and alerts Former financier Cooper has close ties to Peterson, the influential Canadian psychologist. Appearing on Peterson’s podcast in January 2024, Cooper extolled the morality of capitalism,saying: “there’s a distinct advantage in my mind of running an organisation that is for-profit, because it’s doing something that is actually good for people, so if you develop a drug that actually really helps people there’s an ethical exchange.” He added: “Yes it is costly for the patient or the insurance company to buy the product. [But] you’re actually doing something that can be transformative to that patient’s life.” The U.S. pharmaceutical industry has been widely criticised for charging high prices for basic medicines, particularlyin comparisonto other developed nations, andfor itsaggressive and often misleading marketing campaigns. Cooper alsolecturesat thePeterson Academy, the new online school created by Jordan Peterson, on “successful mistakes in business”. ARC preaches Christian moral virtues, rallying against many of the supposed liberal vices of the modern Western world. This was reflected by ARC CEO and Conservative peer Philippa Stroud during the group’s first annual gathering in 2023, who said: “we invite you to go on the journey from darkness, fragmentation, division, polarisation and intolerance to a better story – one that is rooted in the infinite value of every human being.” She said ARC’s mission was “built on the freedoms of freedom of conscience, freedom of speech, freedom of assembly, and woven together with kindness, faithfulness, gentleness and self-control by a responsible people.” Founded in June 2023, ARC organises an annual summit in London which plays host to talks and panels featuring influential right-wing and far-right figures. This year’s summit was attended by 4,000 people and featured speeches from Conservative leaderKemi Badenoch,Reform UKleaderNigel Farage, House of Representatives speaker Mike Johnson, and U.S. Energy Secretary Chris Wright. ARC has also amplified anti-climate figures and their talking points. During his address, fracking executive Wrightcalledthe UK’s 2050 net zero target “sinister”, and suggested that climate action was a plot to “shrink human freedom”. In his speech, Marshall claimed that the UK’s net zero policies are “leading the way in wrecking our industrial base”, “impoverishing people”, “sacrificing our energy security”, and “sacrificing our ancient rural landscape.” In reality, the UK’s net zero sector isgrowingat three times the rate of the rest of the economy, according to the Confederation of British Industry (CBI). During an interview with Peterson at the conference, Farage claimed it was “absolutely nuts” for CO2 to be considered to be a pollutant – whileadmittingthat he knows little about climate science. “At this pivotal moment, ARC is working to inspire citizens to take responsibility and actively contribute to the flourishing of their families, communities, and nations,” Cooper said when his donation to ARC was announced. “I am proud to support an organization that embraces optimism, fosters constructive dialogue, and seeks solutions to ensure continued growth and prosperity.” QOL Medical and Cooper did not respond to DeSmog’s request for comment. **The Alliance for Responsible Citizenship** Executives from some of the world’s biggest oil and gas companies attended ARC’s conference in February,according toa leaked list of participants obtained by DeSmog. Representatives of BP,Koch Inc., Valero Energy, Energy Transfer and other fossil fuel producers attended the three-day event alongside prominent climate science denial groups and far-right politicians from across Europe. Up to now, the only known public donation to ARC had been from British financier and media mogul Paul Marshall, who gave $1 million to the group via his charity Sequoia Trust in 2023. Marshall’s media outlets have refuted basic climate facts and attacked clean energy policies in recent years. DeSmogrevealedin April that GB News had provided a platform to 1,000 anti-climate attacks in the immediate run-up and aftermath of the 2024 UK general election. Marshall’s hedge fund had £1.8 billioninvestedin fossil fuels – including in oil and gas giants Chevron, Shell, and Equinor – as of June 2023. ARC’sadvisory boardalso features a number of individuals who have attacked climate action and denied climate science. This includes Republican politicianVivek Ramaswamy, who has called climate change a “hoax”; former Australian Prime MinisterTony Abbott, who hassaidthat “climate change is probably doing good”; and writer Douglas Murray, who hassuggestedthat climate policies will “impoverish” Britain. ARC did not respond to DeSmog’s request for comment. This article was produced with support from the European Media and Information Fund, managed by the Calouste Gulbenkian Foundation. The sole responsibility for any content supported by the European Media and Information Fund lies with the author(s) and it may not necessarily reflect the positions of the EMIF and the Fund Partners, the Calouste Gulbenkian Foundation and the European University Institute. **Subscribe to our newsletter** Stay up to date with DeSmog news and alerts From Colorado to Virginia, environmental groups are challenging legal barriers that prevent scientists and communities from seeing the full picture of fossil fuel harms. Kemi Badenoch’s party has been receiving money from fossil fuel interests while pursuing anti-climate policies. Reopening the legislation “would be like destroying a bridge [the EU] spent a lot of time building,” experts say. Yusuf’s new role contrasts markedly with his background in business. **DeSmog** Clearing the PR Pollution Sections News Databases Series Multimedia News Databases Series Multimedia Databases Climate Disinformation Database Agribusiness Database Koch Network Database Air Pollution Lobbying Database Climate Disinformation Database Agribusiness Database Koch Network Database Air Pollution Lobbying Database Topics Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion DeSmog About Us Contact Republishing Guidelines Media Resources Send Us Tips Donate to DeSmog Donate to DeSmog Jobs Privacy Policy Privacy Policy (UK) UK Edition Complaints About Us Contact Republishing Guidelines Media Resources Send Us Tips Donate to DeSmog Donate to DeSmog Jobs Privacy Policy Privacy Policy (UK) UK Edition Complaints Follow Newsletter **DeSmog** Clearing the PR Pollution News Databases Series Multimedia Climate Disinformation Database Agribusiness Database Koch Network Database Air Pollution Lobbying Database Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion About Us Contact Republishing Guidelines Media Resources Send Us Tips Donate to DeSmog Donate to DeSmog Jobs Privacy Policy Privacy Policy (UK) UK Edition Complaints Follow Newsletter Website bySeriousOtters **Subscribe to our newsletter** Stay up to date with DeSmog news and alerts **Subscribe to our newsletter** Stay up to date with DeSmog news and alerts NewsEnergyScience DenialAd & PRSocial JusticeAgriculturePolitics and PolicyFalse SolutionsActivismCanadaFinanceOpinion & AnalysisAll Articles Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion & Analysis All Articles Energy Science Denial Ad & PR Social Justice Agriculture Politics and Policy False Solutions Activism Canada Finance Opinion & Analysis All Articles DatabasesClimate DisinformationAgribusinessAd & PRKoch NetworkAir Pollution Lobbying Climate Disinformation Agribusiness Ad & PR Koch Network Air Pollution Lobbying Climate Disinformation Agribusiness Ad & PR Koch Network Air Pollution Lobbying SeriesAd & PR GreenwashingGas Lock-InClimate Change LawsuitsClimate-conflicted bank directorsLouisiana’s Cancer AlleyHistory Lessons#ShellKnewAntimicrobial Resistance Ad & PR Greenwashing Gas Lock-In Climate Change Lawsuits Climate-conflicted bank directors Louisiana’s Cancer Alley History Lessons #ShellKnew Antimicrobial Resistance Ad & PR Greenwashing Gas Lock-In Climate Change Lawsuits Climate-conflicted bank directors Louisiana’s Cancer Alley History Lessons #ShellKnew Antimicrobial Resistance MultimediaPhotosVideosCartoons Photos Videos Cartoons Photos Videos Cartoons MoreAbout UsContactJobs About Us Contact Jobs About Us Contact Jobs About Us Contact Republishing Guidelines Media Resources Send Us Tips Donate to DeSmog Donate to DeSmog Jobs Privacy Policy Privacy Policy (UK) UK Edition Complaints Subscribe Donate **Subscribe to our newsletter** Stay up to date with DeSmog news and alerts"}