{"id": 164, "name": "BreakingNews.ie", "domain": "breakingnews.ie", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.breakingnews.ie/ireland/yellow-thunderstorm-warning-in-place-for-four-counties-with-almost-entire-country-to-be-affected-1772371.html", "title": "Yellow Thunderstorm Warning In Place For Four Counties With Almost Entire Country To Be Affected 1772371.html", "content": "Ireland World Entertainment Lifestyle Sport Business MoreData trackerLottoWeatherDay At A GlanceHoroscopesQuizSpecial ReportSponsoredAdvertising Feature Data tracker Lotto Weather Day At A Glance Horoscopes Quiz Special Report Sponsored Advertising Feature Data tracker Lotto Weather Day At A Glance Horoscopes Quiz Special Report Sponsored Advertising Feature Jobs Property Explained Data tracker Quiz Climate **Thunderstorm warning in place for four counties with almost entire country to be affected** A status-yellow thunderstorm is in place for four counties, with more to come as the evening progresses. The warning is in place in the counties of Clare, Cork, Kerry and Limerick until 10pm on Wednesday night. By Friday, almost every county in the island of Ireland will have been under a thunderstorm warning. From 10pm on Wednesday until 3am on Thursday, Co Cork and Co Waterford will be under the yellow warning. Met Éireann have warned that there is a chance of spot flooding and lightening damage in those areas during the warnings. Leinster, Co Tipperary, and Co Waterford will be under a status yellow thunderstorm warning from midnight on Thursday until 2pm, with risks of localised flooding due to heavy showers, lightning damage, poor visibility and difficult travel conditions. Meanwhile, from 7am until 5pm on Thursday, the counties of Cavan, Donegal, Monaghan, Leitrim, Roscommon and Sligo will also be under a status yellow thunderstorm warning, with heavy showers and scattered thunderstorms expected. There will also be a yellow thunderstorm warning in place for all of Northern Ireland from 6am until 9pm on Thursday. For the remainder of Wednesday, scattered showers are expected in the south, some heavy and thundery. It will be drier in the east and north with a mix of cloud and sunny spells. The highest temperatures will be 16-21 degrees. Tonight, however, showers will spread from the south, with a spell of more persistent and heavy showers developing in Leinster and Ulster later. A mild and humid night is expected with temperatures not falling below 12 to 15 degrees and mist and fog developing in a light southeast breeze. Thursday is expected to start off wet across Leinster and Ulster, with outbreaks of heavy, thundery rain and a chance of spot flooding. Elsewhere, heavy showers and scattered thunderstorms will feed up from the south through the day. Rain in the north and east will clear by later afternoon, but nationally it is expected to be humid again with highest temperatures of 16 to 21 degrees in moderate southeasterly winds. Met Éireann, weather warning, thunderstorm warning, status yellow thunderstorm warning **Read More** **Fire at leisure centre on third night of disorder in Northern Ireland** **Fire at leisure centre on third night of disorder in Northern Ireland** **Tributes paid to ‘absolute gentleman’ (81) killed in Kerry cycle accident** **Tributes paid to ‘absolute gentleman’ (81) killed in Kerry cycle accident** **American woman dies following crash in Northern Ireland** **American woman dies following crash in Northern Ireland** **Years to ‘rebuild what has been broken’ after Ballymena unrest, warns minister** **Years to ‘rebuild what has been broken’ after Ballymena unrest, warns minister** **Most read** **Fire at leisure centre on third night of disorder in Northern Ireland** **Fire at leisure centre on third night of disorder in Northern Ireland** **Tributes paid to ‘absolute gentleman’ (81) killed in Kerry cycle accident** **Tributes paid to ‘absolute gentleman’ (81) killed in Kerry cycle accident** **American woman dies following crash in Northern Ireland** **American woman dies following crash in Northern Ireland** Message submitting... Thank you for waiting. Want us to email you top stories each lunch time? News Ireland World Business Weather Archive Entertainment Lifestyle Lotto Horoscopes SPORT News Soccer GAA Rugby Other Contact Us Our Content Advertise With Us Using the site Licence Our Content Terms and Conditions Privacy Policy Cookie Policy Privacy Settings"}