{"id": 569, "name": "Frontiers in Genome Editing", "domain": "frontiersin.org/journals/genome-editing", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/genome-editing/articles/10.3389/fgeed.2025.1579165/full", "title": "Genome Editing", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Genome Editing Tools and Mechanisms Genome Editing in Animals Genome Editing in Cancer and Immunology Genome Editing in Human Health and Disease Genome Editing in Plants Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Genome Editing Tools and Mechanisms Genome Editing in Animals Genome Editing in Cancer and Immunology Genome Editing in Human Health and Disease Genome Editing in Plants Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Genome Editing Tools and Mechanisms Genome Editing in Animals Genome Editing in Cancer and Immunology Genome Editing in Human Health and Disease Genome Editing in Plants Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office METHODS article Front. Genome Ed. Sec. Genome Editing in Plants Volume 7 - 2025 |doi: 10.3389/fgeed.2025.1579165 **Comprehensive approaches to design efficient gRNA for SDN1-CRISPR/Cas9 genome editing in wheat** 1Department of Genetics and Plant Breeding, Govind Ballabh Pant University of Agriculture and Technology, Pantnagar, Uttarakhand, India 2Indian Institute of Wheat and Barley Research (ICAR), Karnal, India The final, formatted version of the article will be published soon. Select one of your emails You have multiple emails registered with Frontiers: Notify me on publication Please enter your email address: If you already have an account, pleaselogin You don't have a Frontiers account ? You canregister here Background: CRISPR/Cas9 technology has gained popularity due to its efficient, widely applicable and relatively easy editing of genome. Further, the removal of regulation on Site Directed Nuclease1 (SDN1) and SDN2 developed products in many countries has made it more revolutionary technology for adoption in crop improvement. Designing the accurate guide RNA (gRNA) is the initial and most crucial step which decides the success of the gene editing. Though, the gene editing technique is widely used in crops, a detailed method on comprehensive designing of efficient gRNA in wheat is still lacking. By virtue of wheat being a hexaploid crop and having a large genome size with repetitive DNA, a tailor made strategy for designing the gRNA is very much crucial.The manuscript explains the comprehensive strategies and methods for efficient gRNA designing by considering physical, structural and expression of the target gene in genome and explains on-target and off-target effects of gRNA for its precise editing through CRISPR/Cas9 mediated SDN1 method of genome editing in wheat.The present manuscript is first of its kind to address the holistic approach starting from efficient gene selection, gRNA designing and post gRNA designing issues like gRNA stability, binding efficiency, and functionality for SDN1-CRISPR/Cas9 genome editing in wheat. This manuscript will acts as a ready reference for wheat researcher for effective gRNA designing for wheat improvement to meet the future food demand. Keywords:GRNA, CRISPR/Cas9, wheat, Genome editing, WheatCRISPR, SDN1 Received:18 Feb 2025;Accepted:02 Jun 2025. Copyright:© 2025Singh, HM, Singh, Jaiswal, Wadhwa, Kumar, Singh, Ahlawat and Tiwari. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) or licensor are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. * Correspondence:Mamrutha HM, Indian Institute of Wheat and Barley Research (ICAR), Karnal, IndiaRajinder Singh, Indian Institute of Wheat and Barley Research (ICAR), Karnal, India Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Share on Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}