{"id": 1985, "name": "Gript.ie", "domain": "gript.ie", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://gript.ie/rush-hour-dart-chaos-as-overhead-cable-accidentally-cut/", "title": "Rush Hour Dart Chaos As Overhead Cable Accidentally Cut", "content": "Rail services between Lansdowne Road and Dalkey have been suspended due to damage to overhead power lines, with disruption expected to continue through the evening rush hour. In a statement released this afternoon, Iarnród Éireann confirmed that the issue had originated in Blackrock, saying: “Rail services between Lansdowne Road and Dalkey are currently suspended due to damage to overhead lines.” Dublin Bus will be accepting rail tickets for affected DART customers, according to the company. Commuter delays are also expected on connected routes. “Dublin Bus are accepting rail tickets for DART customers affected,” the statement continued. “Bus transfers are in operation between Dublin Connolly and Bray for Dublin / Rosslare Europort services.” The company added that repairs are underway, but gave no estimate for full service restoration. “We are working to rectify the damage, but do not currently have a time for services to be restored,” Iarnród Éireann said. “Disruption is expected to continue throughout the evening peak.” The company apologised to customers for the inconvenience. “Iarnród Éireann apologises to customers for the inconvenience caused,” it stated. In an alert issued on social media shortly after 6pm, the company described the incident as a “major disruption to DART services” and confirmed that services were “suspended between Lansdowne Road and Dalkey until further notice” due to “an issue with the overhead lines at Blackrock.” Rail infrastructure in the Dublin area has faced recurring problems in recent years, particularly with overhead line equipment (OHLE), which supplies electric power to DART services. Similar issues caused temporary shutdowns on the southern coastal line in March of this year. The affected stretch includes key commuter stations such as Blackrock, Dún Laoghaire, and Dalkey, serving thousands of passengers daily during peak hours. Irish Rail’s track worker safety manual states that the overhead line equipment (OHLE) used to power the DART operates at 1,500 volts of direct current and is classified as “extremely dangerous.” The manual advises workers to “always consider the OHLE to be ‘live’,” warning that any contact with it “may result in death or serious injury.” Dear Reader, It is a simple statement of fact that if you are looking for diversity of thought in the Irish media, you will struggle to find it. That is why we founded Gript – to serve the gap in the market left by so many of our colleagues, when they decided that the job of journalists was not to challenge consensus thought, but to herd around it, and defend it fiercely. If you are looking for a media outlet that blames everything on the “far right” in Ireland, then you don’t have to go far to find one. If, by contrast, you are looking for a media outlet that looks beyond that cheap sloganeering, and tries to understand and report on the real concerns held by ordinary people – and a good few prominent people, albeit privately – then that is what we try to do here. But we cannot do it without your support, and your subscription. We reject Government funding, because, in our view, that would be the end of our independence. The moment we did so, we would begin looking over our shoulder, and wondering if our coverage of a particular issue might lead to that money being taken away. In time – not all at once, but slowly and inexorably – we would become just another safe, consensus, state-funded voice. But there’s a bargain to be struck here: If you value our independence, then you must support it. If you want us to be answerable to you, then you must take a stake in our work. What we try to do here is to be open, honest, and brave. That does not mean that you will always agree with us. It does mean that there will be times when we will annoy you, and publish things you disagree with: That’s part of the deal. We are independent, not servants of one cause, or another. That is what media is supposed to be, but too often in Ireland no longer is. We are trying to change that, and we need your help. I am, therefore, asking for it, and would deeply appreciate a subscription at the level you can afford. With gratitude, John Dear Reader, It is a simple statement of fact that if you are looking for diversity of thought in the Irish media, you will struggle to find it. That is why we founded Gript – to serve the gap in the market left by so many of our colleagues, when they decided that the job of journalists was not to challenge consensus thought, but to herd around it, and defend it fiercely. If you are looking for a media outlet that blames everything on the “far right” in Ireland, then you don’t have to go far to find one. If, by contrast, you are looking for a media outlet that looks beyond that cheap sloganeering, and tries to understand and report on the real concerns held by ordinary people – and a good few prominent people, albeit privately – then that is what we try to do here. But we cannot do it without your support, and your subscription. We reject Government funding, because, in our view, that would be the end of our independence. The moment we did so, we would begin looking over our shoulder, and wondering if our coverage of a particular issue might lead to that money being taken away. In time – not all at once, but slowly and inexorably – we would become just another safe, consensus, state-funded voice. But there’s a bargain to be struck here: If you value our independence, then you must support it. If you want us to be answerable to you, then you must take a stake in our work. What we try to do here is to be open, honest, and brave. That does not mean that you will always agree with us. It does mean that there will be times when we will annoy you, and publish things you disagree with: That’s part of the deal. We are independent, not servants of one cause, or another. That is what media is supposed to be, but too often in Ireland no longer is. We are trying to change that, and we need your help. I am, therefore, asking for it, and would deeply appreciate a subscription at the level you can afford. With gratitude, John Do you believe that the Carbon Tax makes a meaningful difference to making Ireland a greener and more climate-friendly place? YES NO View Results First Name Last Name Email Address Δ **Popular**"}