{"id": 455, "name": "Fortune Magazine", "domain": "fortune.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://fortune.com/2025/06/11/term-sheet-next-steven-lee-an-sv-angel-alum-launches-seven-stars-with-40-million-vc-fund-for-seed-and-pre-seed-ai-startups/", "title": "Term Sheet Next Steven Lee An Sv Angel Alum Launches Seven Stars With 40 Million Vc Fund For Seed And Pre Seed Ai Startups", "content": "Home News Fortune 500FORTUNE SEA 500Fortune 500 EuropeFortune Global 500Fortune China 500Great Place to WorkMore Rankings FORTUNE SEA 500 Fortune 500 Europe Fortune Global 500 Fortune China 500 Great Place to Work More Rankings FORTUNE SEA 500 Fortune 500 Europe Fortune Global 500 Fortune China 500 Great Place to Work More Rankings TechAIInnovationCybersecurity AI Innovation Cybersecurity AI Innovation Cybersecurity FinancePersonal FinanceReal EstateEconomyInvestingBankingCrypto Personal Finance Real Estate Economy Investing Banking Crypto Personal Finance Real Estate Economy Investing Banking Crypto LeadershipSuccessFuture of WorkWorkplace CultureC-SuiteCEO Initiative Success Future of Work Workplace Culture C-Suite CEO Initiative Success Future of Work Workplace Culture C-Suite CEO Initiative LifestyleArts & EntertainmentTravel & LeisureWellEducation Arts & Entertainment Travel & Leisure Well Education Arts & Entertainment Travel & Leisure Well Education MultimediaLive MediaMagazineNewslettersVideoPodcasts Live Media Magazine Newsletters Video Podcasts Live Media Magazine Newsletters Video Podcasts Home News FORTUNE 500 FORTUNE 500 FORTUNE SEA 500 Fortune 500 Europe Fortune Global 500 Fortune China 500 Great Place to Work More Rankings Tech Tech AI Innovation Cybersecurity Finance Finance Personal Finance Real Estate Economy Banking Investing Crypto Leadership Leadership Success Future of Work Workplace Culture C-Suite CEO Initiative Lifestyle Lifestyle Arts & Entertainment Travel & Leisure Well Education Multimedia Multimedia Live Media Magazine Newsletters Video Podcasts Asia Europe Analytics **Term Sheet Next: Steven Lee, an SV Angel alum, launches Seven Stars with $40 million VC fund for seed and pre-seed AI startups** Allie Garfinkle is a senior finance reporter forFortune, covering venture capital and startups. She authorsTerm Sheet,Fortune’s weekday dealmaking newsletter. 100 Best Companies Fortune 500 Global 500 Fortune 500 Europe Most Powerful Women Future 50 World’s Most Admired Companies See All Rankings Finance Leadership Success Tech Asia Europe Environment Fortune Crypto Health Well Retail Lifestyle Politics Newsletters Magazine Features Commentary MPW CEO Initiative Conferences Personal Finance Education Frequently Asked Questions Customer Service Portal Privacy Policy Terms of Use Single Issues for Purchase International Print Fortune Brand Studio Fortune Analytics Fortune Conferences Advertising Business Development About Us Editorial Calendar Press Center Work at Fortune Diversity and Inclusion Terms and Conditions Site Map © 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of ourTerms of UseandPrivacy Policy|CA Notice at Collection and Privacy Notice|Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."}