{"id": 814, "name": "La Nacion (Argentina)", "domain": "lanacion.com.ar", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://foodit.lanacion.com.ar/trucos/los-pastelitos-de-ximena-saenz-tips-de-experta-para-un-hojaldre-crocante-y-un-relleno-perfecto-nid25052025/", "title": "Los Pastelitos De Ximena Saenz Tips De Experta Para Un Hojaldre Crocante Y Un Relleno Perfecto Nid25052025", "content": "**Foodit** **Foodit** RecetasSaladasArrozTartasPolloPizzas y empanadasPastasEnsaladasPescadosHamburguesasCarnesSopasSalsasDulcesTortasPostresPanquequesBudinesTartasHeladosBatidosBebidasDietasVegetarianaSin glutenKetoSin lactosaVegana¿Qué cocinar hoy?Menú semanalDe autorFácilSaludableRápidaMeal prep Saladas Arroz Tartas Pollo Pizzas y empanadas Pastas Ensaladas Pescados Hamburguesas Carnes Sopas Salsas Dulces Tortas Postres Panqueques Budines Tartas Helados Batidos Bebidas Dietas Vegetariana Sin gluten Keto Sin lactosa Vegana ¿Qué cocinar hoy? Menú semanal De autor Fácil Saludable Rápida Meal prep Saladas Arroz Tartas Pollo Pizzas y empanadas Pastas Ensaladas Pescados Hamburguesas Carnes Sopas Salsas Dulces Tortas Postres Panqueques Budines Tartas Helados Batidos Bebidas Dietas Vegetariana Sin gluten Keto Sin lactosa Vegana ¿Qué cocinar hoy? Menú semanal De autor Fácil Saludable Rápida Meal prep DescubrirChefs protagonistasProtocolo en la mesaTendencias en la cocinaIngredientes de cocinaTips y secretos de cocinaRecomendaciones de chefsClub LA NACION Chefs protagonistas Protocolo en la mesa Tendencias en la cocina Ingredientes de cocina Tips y secretos de cocina Recomendaciones de chefs Club LA NACION Chefs protagonistas Protocolo en la mesa Tendencias en la cocina Ingredientes de cocina Tips y secretos de cocina Recomendaciones de chefs Club LA NACION Conocenos Masterclass de chefs Guías de cocina MIS RECETAS MI MENÚ SEMANAL LISTA DE COMPRAS NEWSLETTER Saladas Arroz Tartas Pollo Pizzas y empanadas Pastas Ensaladas Pescados Hamburguesas Carnes Sopas Salsas Dulces Tortas Postres Panqueques Budines Tartas Helados Batidos Bebidas Dietas Vegetariana Sin gluten Keto Sin lactosa Vegana ¿Qué cocinar hoy? Menú semanal De autor Fácil Saludable Rápida Meal prep Chefs protagonistas Protocolo en la mesa Tendencias en la cocina Ingredientes de cocina Tips y secretos de cocina Recomendaciones de chefs Club LA NACION Mi cuenta Mis recetas Mi menú semanal Lista de compras Newsletters ¿Cómo podemos ayudarte? Cerrar sesión **Los pastelitos de Ximena Sáenz: tips de experta para un hojaldre crocante y un relleno perfecto** **La cocinera Ximena Sáenz comparte todos sus consejos para preparar este típico pastel crocante** “Mi papá volaba planeadores. Cada sábado que el sol asomaba, él se iba a Cañuelas a volar. Y en ese ritual había una escala obligada: una panadería que, según él, hacíalos mejores pastelitosdel universo“,recuerda la cocinera Ximena Sáenz, que en su práctica promueve la cocina casera a través de recetas accesibles. Cada vez que volvía de volar, su papá llevaba a la casa una bandeja de esas delicias hojaldradas para compartir. “Yo no era fan delmembrillo—le ponía mucha voluntad—, pero me comía feliz lamasa frita y almibaraday dejaba ese centro brillante para algún hermano más valiente\", rememora. Ese gusto que en su mente sabe a familia y a la sonrisa de su papá fue uno que intentó replicar en su experiencia como cocinera. “En 2009, cuando arrancamosCocineros Argentinos, me tocó ser la pastelera del equipo. Y yo de pastelitos no tenía ni idea. Cada vez que se acercaba una fecha patria la producción me los pedía, así que me puse a estudiar como si tuviera un examen de ingreso a la argentinidad: Choly Berreteaga, Doña Petrona, aprendí de todas. Ahídescubrimos una receta quese hace con la máquina depastasy que hasta el día de hoy me sigue salvando\", cuenta. **Los tips para hacer pastelitos en casa** “Me salieron mal tantas veces que ya les hablaba como a personas: `¿Qué te pasa, pastelito? ¿Por qué no querés abrirte?´”, recuerda sus primeros intentos, y después de años de práctica da a conocer todos los consejos para lograr un pastelito digno en casa. **El hojaldre perfecto** Para la masa, Sáenz siempre usaharina 0000y no incluyenada de levaduraen su receta: “Acá no hay levante químico: todo se lo gana el hojaldre a puro mérito y fritura”. Elhojaldrees, quizás, la parte más desafiante para los primerizos que intentan cocinar pastelitos en casa. A ellos, la experta los invita a practicar y les resume en pocos pasos el secreto del éxito. “Mi receta es de señora práctica:masa estirada con máquina de pastas, pincelada con margarina, espolvoreada con fécula y enrollada como si fuera pionono. Después, palote y magia: aparecen las capas. Más fácil, imposible”, comparte Sáenz, quien trabajó en hoteles, restaurantes, televisión y escribió los librosTodos somos cocineros argentinosyLa cocina de todos los días. Un “error tremendo”, a su criterio, esusar tapas de empanadas compradasen lugar de hacer la masa desde cero. “No funciona”, advierte. **Los reyes del relleno** Los reyes del relleno son el membrillo y la batata. Sin embargo, en busca de aventurarse con otros gustos, Ximena revela unspoiler:el dulce de leche se escapa. Es por eso que recomienda usardulces firmes, como frutas en almíbar, tales como higos. Para los fanáticos de mezclar lo salado y lo dulce también hay opciones: “Inclusose puede hacer con queso-sí, queso- para lograr ese sabor agridulce que te hace fruncir la nariz y sonreír al mismo tiempo”. El dulce de leche no es el único escurridizo sino que también puede suceder también con otros ingredientes. ¿Cómo evitar que se escape el relleno? “Un poquito deagua para pegar las tapas bien y un relleno bien firme. No hace falta ponerle nada al membrillo”, aconseja Sáenz. **La clave está en la fritura** La fritura es un momento decisivo al hacer pastelitos, ya que es donde salen a flote los errores más comunes. En muchos lugares de la Argentina los pastelitos se fríen en grasa. Sin embargo, Sáenz dice que en su caso opta por usar aceite de girasol “y funciona bárbaro”. “El gran secreto es el aceite. O mejor dicho, los aceites:uno tibio y otro bien caliente. El tibio abre las capas como una flor. El caliente dora ycrocanteatodo. Nunca más los freí en una sola olla\", revela. En este paso, señala que el error más común es creer que cuanto más caliente está el aceite, mejor. “No es así,si freís a todo lo que da el hojaldre se asusta y no abre”. **El espacio para la imaginación** ¿Se puede innovar? “Estamos probando enCasa Sáenzhacer nuestrospropios cascos de membrillopara el relleno. Y también combinarlo conqueso azul de origen patagónico. No sé si a mi papá le gustaría… pero a mí me emociona tanto como a él sus pastelitos de Cañuelas\", concluye. **** Foodit >Trucos **Disfrutá las recetas de Foodit** **Chimichurri al limón** **Chimichurri al limón** **Buñuelos de manzana en freidora de aire** **Buñuelos de manzana en freidora de aire** **Pollo con salsa cremosa de limón** **Pollo con salsa cremosa de limón** **Budín de limón fácil y húmedo** **Budín de limón fácil y húmedo** **Torta chiffon con frutillas y crema** **Torta chiffon con frutillas y crema** **Pollo al curry fácil** **Pollo al curry fácil** **Quinoa bol con vegetales, palta y semillas** **Quinoa bol con vegetales, palta y semillas** **Tarta integral de brócoli y zanahoria** **Tarta integral de brócoli y zanahoria** **Sopa cremosa de calabaza, zanahoria y cúrcuma** **Sopa cremosa de calabaza, zanahoria y cúrcuma** **Salmón blanco al horno con oliva, limón y hierbas con vegetales asados** **Salmón blanco al horno con oliva, limón y hierbas con vegetales asados** **Wrap integral con hummus, espinaca, tomate cherry y zanahoria rallada** **Wrap integral con hummus, espinaca, tomate cherry y zanahoria rallada** **Kebab a la parrilla** **Kebab a la parrilla**"}