{"id": 1661, "name": "ADDitude Magazine", "domain": "additudemag.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.additudemag.com/video/an-adhd-guide-to-emotional-dysregulation-and-rejection-sensitive-dysphoria-w-william-dodson-m-d/", "title": "An Adhd Guide To Emotional Dysregulation And Rejection Sensitive Dysphoria W William Dodson M D", "content": "Join ADDitude|Sign In Search ADDitude SUBSCRIBE ADHDWhat Is ADHD?The ADHD BrainADHD SymptomsADHD in ChildrenADHD in AdultsADHD in WomenFind ADHD Specialists What Is ADHD? The ADHD Brain ADHD Symptoms ADHD in Children ADHD in Adults ADHD in Women Find ADHD Specialists What Is ADHD? The ADHD Brain ADHD Symptoms ADHD in Children ADHD in Adults ADHD in Women Find ADHD Specialists Symptoms & TestsSymptom Checker ToolSymptom TestsAnxietyAutismBipolarDepressionODDRSDMore in Mental Health Symptom Checker Tool Symptom Tests Anxiety Autism Bipolar Depression ODD RSD More in Mental Health Symptom Checker Tool Symptom Tests Anxiety Autism Bipolar Depression ODD RSD More in Mental Health TreatmentADHD MedicationsMedication ReviewsNatural ApproachesADHD TherapiesManaging TreatmentTreating Your ChildFind ADHD Specialists ADHD Medications Medication Reviews Natural Approaches ADHD Therapies Managing Treatment Treating Your Child Find ADHD Specialists ADHD Medications Medication Reviews Natural Approaches ADHD Therapies Managing Treatment Treating Your Child Find ADHD Specialists ADHD ParentingPositive ParentingBehavior & DisciplineSchedules & RoutinesOrganizing Your ChildHealth & NutritionTeens with ADHDFriendships & Activities Positive Parenting Behavior & Discipline Schedules & Routines Organizing Your Child Health & Nutrition Teens with ADHD Friendships & Activities Positive Parenting Behavior & Discipline Schedules & Routines Organizing Your Child Health & Nutrition Teens with ADHD Friendships & Activities School & LearningIEPs & 504 PlansAccommodationsHomework & StudyingSchool BehaviorLearning ChallengesFor TeachersHigh School IEPs & 504 Plans Accommodations Homework & Studying School Behavior Learning Challenges For Teachers High School IEPs & 504 Plans Accommodations Homework & Studying School Behavior Learning Challenges For Teachers High School ADHD AdultsDo I Have ADD?Getting Things DoneTime & ProductivityRelationshipsOrganizationHealth & Nutrition Do I Have ADD? Getting Things Done Time & Productivity Relationships Organization Health & Nutrition Do I Have ADD? Getting Things Done Time & Productivity Relationships Organization Health & Nutrition ADHD ResourcesFree WebinarsFree DownloadsNewslettersNews & ResearchGuest BlogsVideosADHD DirectoryThe ADDitude Store Free Webinars Free Downloads Newsletters News & Research Guest Blogs Videos ADHD Directory The ADDitude Store Free Webinars Free Downloads Newsletters News & Research Guest Blogs Videos ADHD Directory The ADDitude Store ADHD DIRECTORYSearch ListingsAdd a Listing Search Listings Add a Listing Search Listings Add a Listing For ProfessionalsFor CliniciansFor EducatorsResearch Updates For Clinicians For Educators Research Updates For Clinicians For Educators Research Updates MAGAZINENew Issue!SUBSCRIBEManage My SubscriptionGive a Gift Sub!Get Back IssuesDigital Issues New Issue! SUBSCRIBE Manage My Subscription Give a Gift Sub! Get Back Issues Digital Issues New Issue! SUBSCRIBE Manage My Subscription Give a Gift Sub! Get Back Issues Digital Issues Contact Us Privacy Policy Terms of Use Home **ADHD Science & Strategies** **ADHD Science & Strategies** Join ADDitude | Sign In ADHDADHD SymptomsADHD in ChildrenADHD in AdultsADHD in WomenThe ADHD BrainFind ADHD Specialists ADHD Symptoms ADHD in Children ADHD in Adults ADHD in Women The ADHD Brain Find ADHD Specialists ADHD Symptoms ADHD in Children ADHD in Adults ADHD in Women The ADHD Brain Find ADHD Specialists Symptoms & TestsSymptom Checker ToolSymptom TestsAnxietyAutismDepressionRSDODDMore in Mental Health Symptom Checker Tool Symptom Tests Anxiety Autism Depression RSD ODD More in Mental Health Symptom Checker Tool Symptom Tests Anxiety Autism Depression RSD ODD More in Mental Health TreatmentADHD MedicationsMedication ReviewsComplements to MedsADHD TherapiesManaging TreatmentTreating Your Child ADHD Medications Medication Reviews Complements to Meds ADHD Therapies Managing Treatment Treating Your Child ADHD Medications Medication Reviews Complements to Meds ADHD Therapies Managing Treatment Treating Your Child ADHD ParentingPositive ParentingBehavior & DisciplineSchedules & RoutinesSchool & LearningHealth & NutritionTeens with ADHD Positive Parenting Behavior & Discipline Schedules & Routines School & Learning Health & Nutrition Teens with ADHD Positive Parenting Behavior & Discipline Schedules & Routines School & Learning Health & Nutrition Teens with ADHD ADHD AdultsDo I Have ADD?Getting Things DoneTime & ProductivityOrganizationRelationshipsHealth & Nutrition Do I Have ADD? Getting Things Done Time & Productivity Organization Relationships Health & Nutrition Do I Have ADD? Getting Things Done Time & Productivity Organization Relationships Health & Nutrition ADHD RESOURCESFree WebinarsFree DownloadsNewslettersGuest BlogseBooks + More Free Webinars Free Downloads Newsletters Guest Blogs eBooks + More Free Webinars Free Downloads Newsletters Guest Blogs eBooks + More ADHD DIRECTORYSearch ListingsAdd a Listing Search Listings Add a Listing Search Listings Add a Listing For ProfessionalsNews & ResearchFor CliniciansFor EducatorsADHD Directory News & Research For Clinicians For Educators ADHD Directory News & Research For Clinicians For Educators ADHD Directory MAGAZINENew Issue!SubscribeGift SubscriptionRenew My SubscriptionManage My SubscriptionDigital Magazine New Issue! Subscribe Gift Subscription Renew My Subscription Manage My Subscription Digital Magazine New Issue! Subscribe Gift Subscription Renew My Subscription Manage My Subscription Digital Magazine ADHD & Symptom Tests The ADHD Brain **An ADHD Guide to Emotional Dysregulation and Rejection Sensitive Dysphoria** **People with ADHD feel emotions more intensely, more frequently, and more suddenly. In fact, one third of adults with ADHD say emotional dysregulation is the most impairing aspect of their ADHD, adversely affecting work performance and personal relationships. Among the biggest emotional challenges facing adults with ADHD is rejection sensitive dysphoria, an extreme sensitivity to criticism and judgment that seems to exist only in those diagnosed with the disorder. In this video, learn about emotional dysregulation and rejection sensitive dysphoria with William Dodson, M.D.** People with ADHD feel emotions more intensely, more frequently, and more suddenly. In fact, one third of adults with ADHD say emotional dysregulation is the most impairing aspect of their ADHD, adversely affecting work performance and personal relationships. Among the biggest emotional challenges facing adults with ADHD is rejection sensitive dysphoria, an extreme sensitivity to criticism and judgment that seems to exist only in those diagnosed with the disorder. In this video, learn about emotional dysregulation and rejection sensitive dysphoria with William Dodson, M.D. People with ADHD feel emotions more intensely, more frequently, and more suddenly. In fact, one third of adults with ADHD say emotional dysregulation is the most impairing aspect of their ADHD, adversely affecting work performance and personal relationships. Among the biggest emotional challenges facing adults with ADHD is rejection sensitive dysphoria, an extreme sensitivity to criticism and judgment that seems to exist only in those diagnosed with the disorder. In this video, learn about emotional dysregulation and rejection sensitive dysphoria with William Dodson, M.D. Print Facebook Twitter Instagram Pinterest ﻿ Facebook Twitter Instagram Pinterest Tags:emotional dysregulation,rejection sensitive dysphoria **Rejection Sensitive Dysphoria: Read These Next** **“We Are Negligent When We Overlook Emotional Dysregulation in ADHD”** **New Insights Into Rejection Sensitive Dysphoria** **Rejection Sensitivity Is Worse for Girls and Women with ADHD** **How Does RSD Really, Actually Feel?** **ADHD Newsletter** **For Adults with ADD** It appears JavaScript is disabled in your browser.Please enable JavaScript and refresh the page in order to complete this form. Symptom Tests ADHD Treatment Options ADHD Parenting Help School & Learning For Adults with ADHD For ADHD Professionals Facebook Twitter Pinterest Instagram LinkedIn TikTok"}