{"id": 1883, "name": "Armstrong Economics", "domain": "armstrongeconomics.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.armstrongeconomics.com/international-news/politics/every-single-democratic-governor-sided-with-the-professional-agitators/", "title": "Every Single Democratic Governor Sided With The Professional Agitators", "content": "About Us Contact Us 0 items$0.00 Cart (0Items) BlogPoliticsEconomicsInternational NewsEmerging MarketsEntertainmentEthicsEuropean UnionGermanyMarket TalkBrowse All Categories Politics Economics International NewsEmerging MarketsEntertainmentEthicsEuropean UnionGermany Emerging Markets Entertainment Ethics European Union Germany Market Talk Browse All Categories Politics Economics International NewsEmerging MarketsEntertainmentEthicsEuropean UnionGermany Emerging Markets Entertainment Ethics European Union Germany Emerging Markets Entertainment Ethics European Union Germany Market Talk Browse All Categories Events Shop Knowledge CenterModelsBasic ConceptsGlossary of TermsInterviews“The Forecaster” FilmTestimony & DebatesView All Interviews & PressLibrary & ResearchGoldThe EuroUSD – DollarDowHistoryTax ReformPoliticalSee Full LibraryBuy Special Reports ModelsBasic ConceptsGlossary of Terms Basic Concepts Glossary of Terms Interviews“The Forecaster” FilmTestimony & DebatesView All Interviews & Press “The Forecaster” Film Testimony & Debates View All Interviews & Press Library & ResearchGoldThe EuroUSD – DollarDowHistoryTax ReformPoliticalSee Full Library Gold The Euro USD – Dollar Dow History Tax Reform Political See Full Library Buy Special Reports ModelsBasic ConceptsGlossary of Terms Basic Concepts Glossary of Terms Basic Concepts Glossary of Terms Interviews“The Forecaster” FilmTestimony & DebatesView All Interviews & Press “The Forecaster” Film Testimony & Debates View All Interviews & Press “The Forecaster” Film Testimony & Debates View All Interviews & Press Library & ResearchGoldThe EuroUSD – DollarDowHistoryTax ReformPoliticalSee Full Library Gold The Euro USD – Dollar Dow History Tax Reform Political See Full Library Gold The Euro USD – Dollar Dow History Tax Reform Political See Full Library Buy Special Reports About **Every Single Democratic Governor Sided with the Professional Agitators** Every single Democratic Governor agrees: Donald Trump’s attempts to militarize California are an alarming abuse of power.pic.twitter.com/gmHuZpxWdc — Gavin Newsom (@GavinNewsom)June 8, 2025 “Every single Democratic governor agrees,” California Gov. Gavin Newsom posted on X along with a letter supporting the rioters. Every single Democrat received the memo that the plan to “fight Trump” entails permitting their minions to burn down another city. In addition to 4,000 National Guard troops, the White House has deployed a group of 700 Marines to save the city of Los Angeles. Yet, every single Democratic governor does not care about the welfare of our troops or legal citizens. Multiple police officers have sustained injuries after these political activists pelted them with rocks and bricks. Someone even attempted to set a police horse on fire. The scene is completely uncivilized, depraved chaos that not one Democratic governor will condemn. I reported how this isstate-funded chaoswith California paying NGOs millions to raise hell with taxpayer funds. We are witnessing the Black Lives Matter chaos repeat with precisely the same actors. We saw similar events at college campuses last year. Professional agitators are leading the riots and ensuring that they continue. A group of masked individualsdistributed riot shields and gas masksto the mostly peaceful protestors. Witnesses say that local law enforcement failed to intervene as the masked individuals distributed tactical gear. A group is arming “civilians” to fight back against the US military. This means that an outside influence, perhaps foreign in the case of Soros, has chosen to attack American forces. This is blatant terrorism at best, and an act of war at worst. #BREAKINGWe just saw people arrive in Downtown L.A. with truck loads of Bionic Face Shields that demonstrators quickly grabbed. It certainly seems like gear you'd wear if you're preparing for conflict with police. Who is funding this?pic.twitter.com/2hZphafOsi — Elex Michaelson (@Elex_Michaelson)June 10, 2025 LAPD Chief Jim McDonnell admitted that professional agitators are fueling the literal fires. “When I look at the people who are out there doing the violence, that’s not the people that we [see] during the day.” BREAKING: LAPD Chief Admits Professional Left-Wing Anarchists Are Fueling the Violence in Los Angeles Riots This reeks of a Soros op. LAPD Chief Jim McDonnell just exposed what many already suspected—the chaos unfolding in Los Angeles is being escalated by professional leftist…pic.twitter.com/7vx7lnoyfA — The Vigilant Fox ? (@VigilantFox)June 9, 2025 He continued to say that the LAPD is not battling the typical civilian. “These are people who are all hooded up. They’ve got a hoodie on. They’ve got face masks on. They’re people who do this all the time. Get away with whatever they can. Go out there from one civil unrest situation to another, using the same or similar tactics frequently. They are connected. Some would call them anarchists. They’re people that we run across routinely, city to city, and this is what they do. Many of the people who are doing this come in from other places just to hurt people and to cause havoc.” The people are not fighting back against Trump or ICE. Rather, a select group of paid actors has been incentivized and ordered to destroy a city for political purposes. Thousands of people did not simply take to the streets over deportation. This was a carefully planned and well-coordinated political movement. The Democrats are allowing it to happen and speaking favorably of the paid agitators who they want the public to believe are outraged liberal voters. FBI Director Kash Patel described the city of LA as “under siege,” and promised to hunt down the mostly peaceful protestors who are physically attacking federal officers and government buildings. Unlike the Black Lives Matter protests, we have some semblance of law and order across the Trump Administration, and those responsible will hopefully see their day in court. More importantly, those responsible for creating the event need to face their day in court. These are often foreign entities that are deliberately meddling in US politics. Imagine if this were the response to any conservative cause? It would never happen. The extremists on the left have been permitted to unleash terror when they feel they are losing power without repercussion. America’s enemies are watching with enthusiasm as they see how broken our system has become. One party in our two-party system is ready to wage war against the other and is counting on the situation to escalate. How far will they go? **Blog Alerts** Subscribe to alerts for each new postSubscribe for free to our daily news Δ June 10, 2025 June 9, 2025 June 9, 2025 June 7, 2025 June 6, 2025 Armstrong Economics 101AI ComputersAsset AllocateBasic ConceptsDeep StateECMEconomicsInflationMusicOpinionPolitically CorrectRegulationSocialistSportsTradingTraining ToolsUnderstanding CyclesVoting Elections AI Computers Asset Allocate Basic Concepts Deep State ECM Economics Inflation Music Opinion Politically Correct Regulation Socialist Sports Trading Training Tools Understanding Cycles Voting Elections AI Computers Asset Allocate Basic Concepts Deep State ECM Economics Inflation Music Opinion Politically Correct Regulation Socialist Sports Trading Training Tools Understanding Cycles Voting Elections Armstrong in the MediaArmstrong TrialThe Forecaster Armstrong Trial The Forecaster Armstrong Trial The Forecaster Behavioral Economics Books ForecastsECMForecast ArraysReversals ECM Forecast Arrays Reversals ECM Forecast Arrays Reversals Great Divide HistoryAmerica's Economic HistoryAncient EconomiesAncient HistoryEurope's Economic HistoryHoardsHyperinflationPanics America's Economic History Ancient Economies Ancient History Europe's Economic History Hoards Hyperinflation Panics America's Economic History Ancient Economies Ancient History Europe's Economic History Hoards Hyperinflation Panics Hong Kong Humor Immigration International NewsAfricaAustralia & OceaniaBigTechBRITAINCanadaCaribbeanCensorshipCentral AmericaChinaCollectiblesCrimeDemocracy CrisisDiseaseEast AsiaEastern EuropeEmerging MarketsEntertainmentEthicsEuropean UnionRefugeesFranceGermanyGreat ResetGreeceHongKongHungaryIndiaInsuranceIranIrelandIsraelItalyJapanLatin AmericaLock DownLockdaownMediamedicineMexicoMiddle EastMigractionMigrationNatureNorth America2016 U.S. Presidential ElectionUSA Current EventsNorth KoreaNorwayPolandPolicePoliticsRevolutionRomaniaRule of LawRussiaScandinaviaScienceSouth AmericaSouth AsiaSoutheast AsiaSPAINSwitzerlandTaiwanThailandTrade WarTurkeyUkraineVaccineWestern Europe Africa Australia & Oceania BigTech BRITAIN Canada Caribbean Censorship Central America China Collectibles Crime Democracy Crisis Disease East Asia Eastern Europe Emerging Markets Entertainment Ethics European UnionRefugees Refugees France Germany Great Reset Greece HongKong Hungary India Insurance Iran Ireland Israel Italy Japan Latin America Lock Down Lockdaown Media medicine Mexico Middle East Migraction Migration Nature North America2016 U.S. Presidential ElectionUSA Current Events 2016 U.S. Presidential Election USA Current Events North Korea Norway Poland Police Politics Revolution Romania Rule of Law Russia Scandinavia Science South America South Asia Southeast Asia SPAIN Switzerland Taiwan Thailand Trade War Turkey Ukraine Vaccine Western Europe Africa Australia & Oceania BigTech BRITAIN Canada Caribbean Censorship Central America China Collectibles Crime Democracy Crisis Disease East Asia Eastern Europe Emerging Markets Entertainment Ethics European UnionRefugees Refugees Refugees France Germany Great Reset Greece HongKong Hungary India Insurance Iran Ireland Israel Italy Japan Latin America Lock Down Lockdaown Media medicine Mexico Middle East Migraction Migration Nature North America2016 U.S. Presidential ElectionUSA Current Events 2016 U.S. Presidential Election USA Current Events 2016 U.S. Presidential Election USA Current Events North Korea Norway Poland Police Politics Revolution Romania Rule of Law Russia Scandinavia Science South America South Asia Southeast Asia SPAIN Switzerland Taiwan Thailand Trade War Turkey Ukraine Vaccine Western Europe Market Talk Markets by SectorAgricultureBondsCollectiblesEnergyForeign ExchangeA$C$Euro €PoundUSD $Yen ¥Yuan ¥Interest RatesPrecious MetalsBase MetalsCopperGoldSilverReal EstateStock IndiciesDAXDow JonesNASDAQNikkeiNYSES&P 500Shanghai CompositeTechnology Agriculture Bonds Collectibles Energy Foreign ExchangeA$C$Euro €PoundUSD $Yen ¥Yuan ¥ A$ C$ Euro € Pound USD $ Yen ¥ Yuan ¥ Interest Rates Precious MetalsBase MetalsCopperGoldSilver Base Metals Copper Gold Silver Real Estate Stock IndiciesDAXDow JonesNASDAQNikkeiNYSES&P 500Shanghai Composite DAX Dow Jones NASDAQ Nikkei NYSE S&P 500 Shanghai Composite Technology Agriculture Bonds Collectibles Energy Foreign ExchangeA$C$Euro €PoundUSD $Yen ¥Yuan ¥ A$ C$ Euro € Pound USD $ Yen ¥ Yuan ¥ A$ C$ Euro € Pound USD $ Yen ¥ Yuan ¥ Interest Rates Precious MetalsBase MetalsCopperGoldSilver Base Metals Copper Gold Silver Base Metals Copper Gold Silver Real Estate Stock IndiciesDAXDow JonesNASDAQNikkeiNYSES&P 500Shanghai Composite DAX Dow Jones NASDAQ Nikkei NYSE S&P 500 Shanghai Composite DAX Dow Jones NASDAQ Nikkei NYSE S&P 500 Shanghai Composite Technology Plagues Products and ServicesReports and DVDsSocrates Reports and DVDs Socrates Reports and DVDs Socrates Q&A Real Estate Uncategorized Upcoming EventsWorld Economic Conference World Economic Conference World Economic Conference webinars World EventsBanking CrisisBio TechnologyBRICSCapital FlowCENSORSHIPCentral BanksCivil UnrestCivilizationClimateConspiracyCorrectionCorruptionCryptocurrencyEducationFreedom of SpeechG7GeopoliticalGov't IncompetenceHuman RightsIMFImmigratinImmigrationInterest RatesMonetary ReformNATONeoconsNew NormPension CrisisPolice StatePopulationPressPrivate MoneyPropagandaReligionSeparatistsSovereign Debt CrisisStudent DebtTechnologyTerrorismThe Hunt for TaxesTradersTyrannyUnited NationsViolenceWarWEFWOKEWorld Health OrganizationWorld Trade Banking Crisis Bio Technology BRICS Capital Flow CENSORSHIP Central Banks Civil Unrest Civilization Climate Conspiracy Correction Corruption Cryptocurrency Education Freedom of Speech G7 Geopolitical Gov't Incompetence Human Rights IMF Immigratin Immigration Interest Rates Monetary Reform NATO Neocons New Norm Pension Crisis Police State Population Press Private Money Propaganda Religion Separatists Sovereign Debt Crisis Student Debt Technology Terrorism The Hunt for Taxes Traders Tyranny United Nations Violence War WEF WOKE World Health Organization World Trade Banking Crisis Bio Technology BRICS Capital Flow CENSORSHIP Central Banks Civil Unrest Civilization Climate Conspiracy Correction Corruption Cryptocurrency Education Freedom of Speech G7 Geopolitical Gov't Incompetence Human Rights IMF Immigratin Immigration Interest Rates Monetary Reform NATO Neocons New Norm Pension Crisis Police State Population Press Private Money Propaganda Religion Separatists Sovereign Debt Crisis Student Debt Technology Terrorism The Hunt for Taxes Traders Tyranny United Nations Violence War WEF WOKE World Health Organization World Trade Show All Categories PROMO **Market Talk** **Market Talk** PROMO **Models** **Models** PROMO **Events** **Events** PROMO **Socrates** **Socrates** June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 View All **Subscribe To Our Newsletter** Subscribe to alerts for each new postSubscribe for free to our daily news Δ **Quick Links** Blog Events Library & Research **Armstrong Economics** About Us Contact Shop **Members** ©2025 Terms and Conditions of Use Privacy Policy Accessibility Statement Sitemap"}