{"id": 1541, "name": "de Volkskrant", "domain": "volkskrant.nl", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.volkskrant.nl/volkskrant-magazine/in-het-weekend-nemen-we-het-leven-door-met-een-toevallige-passant-deze-week-jaysiderio-luan-en-roberto-zijn-close-sinds-de-eerste~bef47c2a6/", "title": "In Het Weekend Nemen We Het Leven Door Met Een Toevallige Passant Deze Week Jaysiderio Luan En Roberto Zijn Close Sinds De Eerste~bef47c2a6", "content": "InloggenU bent niet ingelogd InloggenU bent niet ingelogd InloggenU bent niet ingelogd ServiceKlantenserviceAntwoord op al uw vragenBezorgingUpdates, wijzigingen en klachten **Service** KlantenserviceAntwoord op al uw vragen BezorgingUpdates, wijzigingen en klachten **Service** KlantenserviceAntwoord op al uw vragen BezorgingUpdates, wijzigingen en klachten PersonaliserenMeldingenNieuwsbrievenData en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy **Personaliseren** Meldingen Nieuwsbrieven Data en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy Privacy-instellingen Cookiebeleid Privacy **Personaliseren** Meldingen Nieuwsbrieven Data en PrivacyData en PrivacyPrivacy-instellingenCookiebeleidPrivacy Privacy-instellingen Cookiebeleid Privacy Privacy-instellingen Cookiebeleid Privacy Meer VolkskrantWinkelPuzzels & Games **Meer Volkskrant** Winkel Puzzels & Games **Meer Volkskrant** Winkel Puzzels & Games Vragen & contactTip de redactieWat vindt u van deze website?Gebruikersvoorwaarden **Vragen & contact** Tip de redactie Wat vindt u van deze website? Gebruikersvoorwaarden **Vragen & contact** Tip de redactie Wat vindt u van deze website? Gebruikersvoorwaarden Voorpagina Columns Opinie Cartoons Podcasts Cultuur & Media Foto Puzzels **Ontdek** Bewaarde artikelenKrantNieuwsbrievenPuzzelsOverlijdensberichtenOver ons Bewaarde artikelen Krant Nieuwsbrieven Puzzels Overlijdensberichten Over ons Bewaarde artikelen Krant Nieuwsbrieven Puzzels Overlijdensberichten Over ons **Rubrieken** Beter LevenAuto en fietsKoken en EtenOpvoedenBinnenlandBuitenlandCartoonsColumnsCultuur & MediaBeeldende KunstBoekenFilmsGamesMuziekSeriesTheaterEconomieFotoMensenOpiniePodcastsPolitiekPuzzelsSportTechAIVoor abonnees: onze specialsWetenschap Beter LevenAuto en fietsKoken en EtenOpvoeden Auto en fiets Koken en Eten Opvoeden Binnenland Buitenland Cartoons Columns Cultuur & MediaBeeldende KunstBoekenFilmsGamesMuziekSeriesTheater Beeldende Kunst Boeken Films Games Muziek Series Theater Economie Foto Mensen Opinie Podcasts Politiek Puzzels Sport TechAI AI Voor abonnees: onze specials Wetenschap Beter LevenAuto en fietsKoken en EtenOpvoeden Auto en fiets Koken en Eten Opvoeden Auto en fiets Koken en Eten Opvoeden Binnenland Buitenland Cartoons Columns Cultuur & MediaBeeldende KunstBoekenFilmsGamesMuziekSeriesTheater Beeldende Kunst Boeken Films Games Muziek Series Theater Beeldende Kunst Boeken Films Games Muziek Series Theater Economie Foto Mensen Opinie Podcasts Politiek Puzzels Sport TechAI AI AI Voor abonnees: onze specials Wetenschap Home Krant Net binnen Rubrieken **In het weekend nemen we het leven door met een toevallige passant. Deze week: Jaysiderio, Luan en Roberto zijn close sinds de eerste** Wekelijks bezoekt Gidi Heesakkers een eetgelegenheid ergens in het land. Met een klant neemt ze het leven door, na haar vraag: hier opeten of meenemen? Vandaag: Jaysiderio Kind (20), Luan de Jesus Mendes Rodrigues (21) en Roberto Silva Ferreira (20), YoYo! Fresh Tea Bar, Designer Outlet Roermond. is verslaggever van de Volkskrant. Ze schrijft over stand-upcomedy & cabaret en populaire cultuur. Jaysiderio Kind (20), Luan de Jesus Mendes Rodrigues (21) en Roberto Silva Ferreira (20) uit Rotterdam hebben de zondagmiddag doorgebracht in Designer Outlet Roermond en lopen met een beker bubble tea terug naar de auto. L: ‘Ik weet het niet man, met die bubbeltjes. Ik ben meer van matcha. Ik zweer het, matcha is lekker.I’m a matcha boy.’ J: ‘We moesten shoppen. Of ‘moesten’...? Laten we niet overdrijven.’ L: ‘We hadden gewoon gepland om te gaan shoppen, precies dat. We hadden naar een plek dichter bij huis kunnen gaan, maar dit was even iets anders, even iets impulsiefs.’ J: ‘Ik heb trainingspakjes gekocht, een bodywarmer en een soort vest-jas-achtig iets. Niet voor eenspecial occasion, gewoon voor dagelijks. De meeste dingen zou ik ook naar mijn werk dragen.’ L: ‘Ik heb een Puma-outje, New Balance-broeken, Asics-trainingspakken, een Moncler-jasje-vestje. Ikloevdehet echt, dus toch wel gehaald.’ R: ‘Ik heb bij Under Armour een trainingspak gescoord en bij New Balance een zomeroutje.’ L: ‘Ik moet alleen nog eten, dan zit ik echt goed.’ J: ‘Wij kennen elkaar van de middelbare school, sinds de eerste. Na de middelbare deden we een jaar lang dezelfde opleiding, software development. Vonden we alle drie niet leuk, hebben we alle drie achter ons gelaten. Luan en ik zijn de maatschappelijke zorg in gedoken, hij ging verder met grafisch ontwerpen. We zijn nog steeds close.’ R: ‘Nog één week, dan diploma.’ J: ‘Hij wel, ja!’ R: ‘En dan lekker werken. Geld verdienen. Ik kan niet wachten.’ J: ‘Ik heb geen dure kledingsmaak, valt hartstikke mee. Ik vind het leuker als ik een goeie outfit heb die goedkoop is dan een dure outfit die er semi-goed uitziet.’ L: ‘Als je denkt ‘ik moet duur halen’, dan zit je daarmee te strijden. Een simpele, casual outfit voelt beter. Maar één keer in de zoveel tijd mag je jezelf verwennen, vind ik.’ R: ‘Vanaf 300 euro voor een trainingspak vind ik prijzig.’ J: ‘Sparen lukt beter als ik cash heb. Ik raak het dan minder snel aan. Ik vind het ook leuk om geld te bewaren, in een schoenendoos, en al die kleuren te zien. Mooi man.’ L: begint te lachen: ‘Wáár bewaar je het? Ik zou het niet zeggen hoor!’ J: ‘Kijk, ik zou hier nooit in m’n eentje naartoe gaan, veel geld uitgeven aan kleding en dan denken: zo, wat een leuke dag heb ik gehad. Het was een leuke dag omdat we met zijn drieën waren.’ **Volkskrant Magazine** Lees hier alle artikelen over dit thema **Wilt u belangrijke informatie delen met de Volkskrant?** Contact met de redactie Contact met de klantenservice Privacystatement Abonnementsvoorwaarden Gebruiksvoorwaarden Cookiebeleid Privacy-instellingen Auteursrecht Colofon Klantenservice Bezorgklacht indienen Bezorging pauzeren Bezorging wijzigen (Bezorg)adres wijzigen Adverteren Losse verkoop Over ons Abonneren Nieuwsbrieven Krant Webwinkel Puzzels RSS-feeds Facebook Twitter Android apps iOS apps Columnisten Recensies De Volkskeuken Archief Op alle verhalen vande Volkskrantrust uiteraard copyright.Wil je tekst overnemen of een video(fragment), foto of illustratie gebruiken, mail dan naarcopyright@volkskrant.nl. De Volkskrant is onderdeel van DPG Media. KvK Nummer: 34172906 | BTW Nummer: NL810828662B01 © 2025 DPG Media B.V. Alle rechten voorbehouden"}