{"id": 1396, "name": "The Local (Germany)", "domain": "thelocal.de", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thelocal.de/20240301/interview-the-biggest-hurdle-for-foreign-jobseekers-is-not-speaking-fluent-german/#article-comments", "title": "Interview The Biggest Hurdle For Foreign Jobseekers Is Not Speaking Fluent German", "content": "**Advertisement** NewsLatest newsBerlinMunichFrankfurtStuttgartDüsseldorfHamburgPoliticsTravel newsOpinion and Analysis Latest news Berlin Munich Frankfurt Stuttgart Düsseldorf Hamburg Politics Travel news Opinion and Analysis Latest news Berlin Munich Frankfurt Stuttgart Düsseldorf Hamburg Politics Travel news Opinion and Analysis Learn about GermanyLanguage LessonsLearning GermanGerman Word of the DayGermany ExplainedDiscover GermanyGerman traditionsGerman historyGerman habitsGerman CuisineQuiz Language Lessons Learning German German Word of the Day Germany Explained Discover Germany German traditions German history German habits German Cuisine Quiz Language Lessons Learning German German Word of the Day Germany Explained Discover Germany German traditions German history German habits German Cuisine Quiz EssentialsLiving in GermanyMoving to GermanyStudying in GermanyStudy in GermanyGerman citizenshipVisasResidency permitsTaxesPensionsFamilyCost of livingReader questions Living in Germany Moving to Germany Studying in Germany Study in Germany German citizenship Visas Residency permits Taxes Pensions Family Cost of living Reader questions Living in Germany Moving to Germany Studying in Germany Study in Germany German citizenship Visas Residency permits Taxes Pensions Family Cost of living Reader questions HomesPropertyRentingFind rentals Property Renting Find rentals Property Renting Find rentals JobsWorking in GermanyFind jobs in Germany Working in Germany Find jobs in Germany Working in Germany Find jobs in Germany Local Directory NewsLatest newsBerlinMunichFrankfurtStuttgartDüsseldorfHamburgPoliticsTravel newsOpinion and Analysis Latest news Berlin Munich Frankfurt Stuttgart Düsseldorf Hamburg Politics Travel news Opinion and Analysis Latest news Berlin Munich Frankfurt Stuttgart Düsseldorf Hamburg Politics Travel news Opinion and Analysis Learn about GermanyLanguage LessonsLearning GermanGerman Word of the DayGermany ExplainedDiscover GermanyGerman traditionsGerman historyGerman habitsGerman CuisineQuiz Language Lessons Learning German German Word of the Day Germany Explained Discover Germany German traditions German history German habits German Cuisine Quiz Language Lessons Learning German German Word of the Day Germany Explained Discover Germany German traditions German history German habits German Cuisine Quiz EssentialsLiving in GermanyMoving to GermanyStudying in GermanyStudy in GermanyGerman citizenshipVisasResidency permitsTaxesPensionsFamilyCost of livingReader questions Living in Germany Moving to Germany Studying in Germany Study in Germany German citizenship Visas Residency permits Taxes Pensions Family Cost of living Reader questions Living in Germany Moving to Germany Studying in Germany Study in Germany German citizenship Visas Residency permits Taxes Pensions Family Cost of living Reader questions HomesPropertyRentingFind rentals Property Renting Find rentals Property Renting Find rentals JobsWorking in GermanyFind jobs in Germany Working in Germany Find jobs in Germany Working in Germany Find jobs in Germany germanyAll EditionsAustriaDenmarkFranceGermanyItalyNorwaySpainSwedenSwitzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland All Editions Austria Denmark France Germany Italy Norway Spain Sweden Switzerland Become a member Newsletters Help Centre Gift Vouchers Educational Access Corporate Access About Us Contact Us News Archive Search articles All topics Advertise with us Local Directory Post a job ad The Local Europe ABVästmannagatan 43113 25 StockholmSweden **INTERVIEW: 'The biggest hurdle for foreign jobseekers is not speaking fluent German'** 1 comment Amid a sluggish economy, the job market in Germany is turbulent at the moment. We spoke to a career coach to find out the outlook for this year and the biggest challenges for foreign jobseekers. **Advertisement** With several companies announcing restructures and layoffs, the labour market in Germany may feel discouraging for those that are unemployed and searching for a job. READ ALSO:Which companies in Germany are planning to cut jobs? Adding to the volatile atmosphere is that many people in their jobs feel dissatisfied, resulting in a lot of applicants applying for the same role. Hamburg-based careers expert Kevin Kocher, managing director ofImmigrant Spirit- which helps foreign nationals find jobs - told The Local'sGermany in Focus podcastthere was \"turmoil\" and \"turnover in the job market\". \"There's a lot of people looking around, looking for something new,\" he said. \"And you combine that with the layoffs - this is making it a very competitive atmosphere right now.\" Kocher said that the high competition for roles currently is one of the big challenge for foreign jobseekers who are looking to settle in Germany this year. \"There's just a lot of cycling through to figure out what's what's the right fit, because there's a lot of change going on,\" he said. Requirements to speak fluent German Although English is spoken regularly at lots of firms in Germany, a recurring issue that international residents also face when applying for jobs is not being able to speak advanced fluent German. Just four percent of job postings in Germany are currently in English, according to experts. Kocher said most companies \"will not evaluate your candidacy\" if applicants don't have C1 level German skills. \"One of the biggest challenges is learning German to a point and getting up to speed where you can feel comfortable enough to be in an interview, and then actually secure a job and prove that you can be flexible, and still learn German on the job,\" said Kocher. READ ALSO:Better childcare to quicker visas - How Germany wants to attract more workers **Advertisement** Germany is struggling with a well-publicised labour shortage, with thousands of vacancies going unfulfilled. Many companies are looking for foreign talent to help fill positions, while visa rules are being eased by the German government. But as Chris Pyak, former head of Immigrant Spirit,told The Local's Germany in Focus podcast last year in an interview,recruiters and human resource departments in Germany are slow to adapt and still call for fluent German even when it is not always essential for the job in question. Kocher says he believes the situation is changing slightly as more bosses realise the extent of the worker shortage but that more flexibility could be offered. \"There's a need for international workers,\" said Kocher, citing the estimates that around 400,000 immigrants will be needed each year on average to fill jobs as older people in the German workforce retire. Kocher said foreign nationals may end up choosing another country to settle in if Germany doesn't become more flexible on this issue. Is it possible to get a job in Germany without advanced German skills - or even none at all? Yes, depending on the line of work and company you're applying at. For example, in many startup scenes, English is a commonly spoken language. There are plenty of startups offering a variety of jobs in Germany, particularly in Berlin, Munich and across the state of North Rhine-Westphalia. **Advertisement** Kocher said some well-known large firms are also a good option for English speakers. \"So you've got Zalando, a major company in Berlin - also highly competitive - always has English speaking roles,\" he said, adding: \"As well as Adidas (which has headquarters near Nuremberg) - those are two clear ones. \"There's some American companies that have presences here like FreshWorks in Berlin. You've got a NinjaOne in Berlin as well, I believe that recently was hiring English speakers.\" Kocher added that with around 350 companies in Germany regularly hiring English speakers or posting their job ads in English, \"it's very limited\". READ ALSO:Which Bavarian-based companies regularly hire English speakers? Seek support from professionals or common connections For anyone struggling to find work in Germany as an English speaker, Kocher recommends seeking a mentor or enlisting the help of a careers coach to . \"My tip would be: don't be afraid to find some help and find either a mentor or someone who has gone through the experience as well or is going through the experience right now so you can brainstorm, share ideas. **Advertisement** \"Two brains - at least - is always better than one. And this could also be finding resources online, you know, in your niche or, like I said, someone who's run a similar path or has a similar story to you.\" Kocher said networking and using sites like LinkedIn are also helpful. \"It's so valuable to dig deep into who's who in certain positions in the cities that that you want to live in. \"Is there any - one, two, three - common connection that I have, that I could search on these networks, that that could get me into a conversation with these people? Because if someone know someone that knows you, then this automatically boosts your credibility, that someone can vouch for you. And that's super important right now, that someone can speak for you, or you can get into the right conversation.\" **More** **Comments (1)** Join the conversation in our comments section below.Share your own views and experience and if you have a question or suggestion for our journalists then email us atnews@thelocal.de.Please keep comments civil, constructive and on topic – and make sure to read ourterms of usebefore getting involved. Please log inhereto leave a comment. **See Also** **Advertisement** The Local Europe ABVästmannagatan 43113 25 StockholmSweden By signing up you agree to ourTerms of UseandPrivacy Policy.We will use your email address to send you newsletters as well as information and offers related to your account. 2025 The Local, All Rights Reserved."}