{"id": 1130, "name": "Press Progress", "domain": "pressprogress.ca", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://pressprogress.ca/canadian-conservative-youtubers-claim-they-were-offered-russian-money-to-fund-their-videos-their-strange-story-raises-serious-questions/", "title": "Canadian Conservative Youtubers Claim They Were Offered Russian Money To Fund Their Videos Their Strange Story Raises Serious Questions", "content": "Photo credit: Northern Perspective (Facebook) **Canadian Conservative YouTubers Claim They Were Offered Russian Money to Fund Their Videos. Their Strange Story Raises Serious Questions.** Experts warn that content creators and social media influencers could be prime targets for foreign actors looking to interfere in Canada’s democracy Since quitting their day jobs and launching a YouTube channel in 2023, Ryan and Tanya Davies’ lives have taken a series of unexpected turns. After starting out making pro-Conservative videos reacting to parliamentary committee hearings, the husband-and-wife team has grown the audience for their Northern Perspective channel to 179,000 subscribers, and now land regular interviews with Conservative MPs and right-wing media personalities. “This has become an incredibly popular YouTube channel that provides something that I never would have expected a few years ago — colour commentary on the workings of parliamentary committees,” Conservative MP Garnett Genuisremarked on his podcastlast year. Ryan and Tanya have certainly become influential in Conservative circles. During the recent federal election, Ryan emceed a campaign event for Burlington Conservative candidate Emily Brown, where he and Tanya posed for photos with Andrew Scheer, now the interim Opposition leader. On the eve of the election, Ryan and Tanya even sat down with Pierre and Ana Poilievre for a two-on-two interview about the joys and struggles of parenthood. But the latest turn in the middle-aged couple’s second life as Conservative YouTube influencers was so unexpected it prompted them to call the RCMP, after they claim they were propositioned over email by an individual alleging he could connect them with money from a sanctioned Russian entity. “We received the unsolicited email shortly after the election and immediately reported it to the RCMP,” Ryan toldPressProgress. “We’ve since been contacted again by (the RCMP) for additional information and are cooperating fully.” Northern Perspective (YouTube) Ryan and Tanya first publicly shared those allegations in passing, in the middle of athree-hour livestreamearlier this month while refuting several election-denial narratives circulating online. “We were shocked when we got this email right after the election,” Ryan explained during the livestream. “In this email, this state actor asked us to, essentially, get paid by the Russian state media.” “Russia wants chaos,” Ryan stressed. “Now what type of chaos do they want? Russia specifically tries to undermine trust in democracy.” “If we got this email, who else is getting this email?” Tanya asked, to which Ryan agreed: “Who else is putting out content to try to undermine our democracy, that may have actually decided not to report this to the RCMP?” Be AWARE of what is being posted. We were PROPOSITIONED by a Russian Agent, WHO has since been reported to the RCMP, to pay us substantial sums for running content.pic.twitter.com/bZE3TkOKpI — Northern Perspective (@NorthrnPrspectv)May 5, 2025 According to a copy of the email shared in a laterYouTube video, Ryan and Tanya were contacted by an address associated with a Proton Mail account belonging to a user named “Макс Лебедев” (Max Lebedev), who appeared to communicate in broken English. “Agency under TASS have noted you have large community,” the email stated. “If interested in making extra income, let me know and I put you in touch with TASS representative. No need for changing content.” The email concludes: “RU 🤝CA” Northern Perspective (YouTube) Emails sent byPressProgressto the “maxim.lebedev1997” email account now result in an error message indicating that the “address does not exist.” Proton Mail, an encrypted email service based in Switzerland, said it is unable to comment on whether the address ever existed or if it was recently deactivated following communication from law enforcement. “We cannot comment on specific cases for privacy reasons, however abusers of Proton’s services have no place on Proton’s platforms,” a Proton Mail spokesperson toldPressProgress. “Our terms and conditions make it clear that using our products for illegal activity is a violation and those who use our services for such purposes are routinely removed.” “Address not found” (PressProgress) Ryan, who previously worked as an IT specialist for a federal agency before quitting his job to focus on YouTube full-time, toldPressProgresshe “absolutely considered the possibility that the email could be a hoax, scam or prank,” but concluded there were enough “red flags” to warrant taking it seriously. Those red flags include, in Ryan’s view, the fact that the email did not resemble a typical scam seeking money and that there were no apparent attempts to extract private information from him. He also found the tone of the email strange, since it begins by insulting him (“You said Piere would win. Why you say this when you don’t know result yet? Let it be lesson learned”) in an apparent effort to “provoke an emotional reaction.” Ryan said his suspicions about the email were further validated by the response he received from the RCMP’s National Security Information Network, warning him that the Russian state-owned media entity referenced in the email is named on Canada’sofficial list of sanctioned Russian entities. “Please be advised that, as per Justice Canada, ‘TASS’ is listed as an Entity under the Special Economic Measures (Russia) Regulations for Grave Breach of International Peace and Security,” the RCMP’s email to Ryan stated. “Authentic or not, this kind of contact doesn’t belong in the shadows,” Ryan toldPressProgress. “The public has a right to know when foreign-linked messaging shows up in Canadian media inboxes.” The RCMP said it is unable to confirm or deny the existence of an investigation unless it results in criminal charges. “Should there be criminal or illegal activities occurring in Canada that are found to have foreign state attribution, it would fall within the RCMP’s mandate to investigate it,” an RCMP spokesperson toldPressProgress. Northern Perspective (YouTube) Aengus Bridgman, a McGill University professor and director of theMedia Ecosystem Observatory, said that while it’s likely impossible to assess the veracity of the email, YouTubers like the Davies have good reason to be concerned about receiving messages like this. “Influencer capture is a genuine risk,” Bridgman toldPressProgress. Bridgman said although the tone of the email may sound “unprofessional” and “hoaxy,” the plan floated in the email is more sophisticated than its sender’s “level of clumsy” suggests. “This is the key vector of attack,” Bridgman said, noting malicious foreign actors could very plausibly “find influencers, support them materially and lift up voices” conducive to their “political objectives.” “Just provide them money, lift them up, buy small donations that are untraceable … a small amount of money can go much further in the Canadian context” compared to the United States. Last year, Tenet Media, afar-right alternative outlet run by Canadian influencers, was indicted by theUS Department of Justiceover allegations their content creators were covertly funded by a Russian state-run media outlet that was sanctioned following Russia’s 2022 invasion of Ukraine. Paid influencers were also central to thecontroversy over Romania’s recent presidential election, whose first-round results were later annulled by the country’s Constitutional Court. DeclassifiedRomanian intelligence documentsalleged hundreds of paid TikTok influencers, boosted by automated bots, made videos supporting afar-right, pro-Russian presidential candidate, after a number of them weresolicited directly over emailby a mysterious “affiliate marketing” agency based in South Africa. In December, the French newspaperLe Mondereported “thousands” of social media influencers in Europe had been approached by Russian proxies. “We have evidence that confirms that Russia is also trying to manipulate influencers in European countries,” French foreign minister Jean-Noël Barrot told aFrench parliamentary hearing. “We call on content creators and their subscribers to be extremely vigilant about these threats to our public debate.” Bridgman said the potential leveraging of domestic influencers by foreign actors would be a complex problem to solve, given the implications for privacy and free speech, but part of the solution is for audiences to start “encouraging a culture of accountability” from influencers. “The key is to try to figure out a transparency regime around this as much as possible, so that people can make informed decisions when they listen to content creators,” Bridgman said, adding he’s “pleased” the Davies are shining a light on this, even if it turns out the email was a hoax. “Even if it’s not true, sharing this information is useful because it alerts people to this possibility of foreign interference through influencers. And if it is true, it is also good because he’s calling it out.” Northern Perspective (Facebook) For his part, Ryan believes his actions posting videos on YouTube about this may have helped disrupt a Russian foreign-influence operation targeting Canadians. “I believe our responsible disclosure of the issue most likely dissuaded whomever this was from acting further,” the Conservative YouTuber toldPressProgress. “The number-one way to combat foreign interference is to shine sunlight on it.” Correction:An earlier version of this story identified Ryan and Tanya’s last name as “Mitchell.” In fact, their last name is Davies. Ryan Davies explained that he was mistakenly introduced with the wrong last name in an appearance on Conservative MP Garnett Genuis’ podcast last fall. Our journalism is powered by readers like you. We’re an award-winning non-profit news organization that covers topics like social and economic inequality, big business and labour, and right-wing extremism. Help us build so we can bring to light stories that don’t get the attention they deserve from Canada’s big corporate media outlets. **Report a Typo or Inaccuracy** We strive to avoid typos and inaccuracies. However, on occasion we make mistakes. We value your contributions and help in correcting them. We value accuracy. If you spot an error, use this form to notify our editorial team. Please see ourcorrections policyfor more info. Your Name Your Email City, Province and CountryTitle of Article Describe the typo or inaccuracy: **Most Shared** **Take Back Alberta Leaders are Training ‘Scrutineers’ to Infiltrate Campaigns and Act as ‘Security’ on Voting Day** 6 hours ago **Related Stories** **The Toronto Sun Acknowledges that the Fraser Institute’s ‘Tax Freedom Day’ May Be ‘Incorrect and Misleading’** 5 days ago **In Trying to Compete with Amazon, Canada Post is in a ‘Race to the Bottom’** 3 weeks ago **Danielle Smith’s Separatist Mess** 4 weeks ago **Public Service Unions Question Carney Government’s Plans for ‘AI’ and Hiring Caps on Federal Workforce** 4 weeks ago **Conservatives Missed All-Candidates Events at a Much Higher Rate Than Other Major Parties** 1 month ago **Many of Those Closest to Pierre Poilievre Have Ties to Canada’s Biggest Lobbying Firms** 1 month ago **PressProgress directly to your inboxNever miss a story. Stay connected with our award-winning non-profit journalism by signing up for our newsletter:SIGN UPSIGN UP** Never miss a story. Stay connected with our award-winning non-profit journalism by signing up for our newsletter: Never miss a story. Stay connected with our award-winning non-profit journalism by signing up for our newsletter: About Journalistic Standards Impact Trust Privacy Policy Contact Us Become a Member Newsletter Newsroom Updates Share Tips PressProgress is a news division of the Broadbent Institute PressProgress is a news division of the Broadbent Institute PressProgress journalists are proudly unionized with UFCW Canada Local 1006-A PressProgress Newsroom|Station B, PO Box 1273 Ottawa, Ontario K1P 5R3"}