{"id": 1526, "name": "Variety Magazine", "domain": "variety.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://variety.com/2025/artisans/news/the-pitts-medical-consultant-medical-jargon-and-medical-emergencies-the-show-gets-right-1236428081/", "title": "The Pitts Medical Consultant Medical Jargon And Medical Emergencies The Show Gets Right 1236428081", "content": "Plus IconFilm Plus IconTV Plus IconWhat To Watch Plus IconMusic Plus IconDocs Plus IconDigital & Gaming Plus IconGlobal Plus IconAwards Circuit Plus IconVideo Plus IconWhat To Hear VIP Got a Tip? Newsletters U.S. Asia Global Home Artisans News **‘The Pitt’s’ Medical Consultant on Coaching Actors Through Jargon and What Medical Emergencies the Show Gets Right** ByJazz Tangcay **Jazz Tangcay** Artisans Editor ‘Dying for Sex’s’ Jenny Slate on the Email She Sent Nikki Boyer As She Prepared to Play Her, and How They’ve Become Best Friends in Real Life4 hours ago Los Angeles Curfew Shuts Down Movies, Concerts in Downtown Area5 hours ago ‘The Pitt’s’ Medical Consultant on Coaching Actors Through Jargon and What Medical Emergencies the Show Gets Right5 hours ago Max’s “The Pitt”is considered to be medically accurate, and that’s thanks to the creative team.Dr. Lizzie Ferreira is a real-life emergency medicine physician and is one of the medical consultants on the show. “It starts with John Wells, Noah Wyle, Scott Gemmill. They created and cultivated a culture where it was absolutely imperative to get it right and to show it as accurate and as authentic and as messy as possible,” she says. Speaking with Variety‘s Artisans, presented by HBO, Ferreira explained that while the scenes begin in the writers’ room, those eventually trickle down to the medical consultants whose job it is to bring that authenticity. “When we were working through a scene with both the director and the cinematographer verbalizing what we’re anticipating the actresses or actors to do in that moment on what cued line, allows the DP to plan her shots and do her blocking so that way those very sensitive moments or emotional moments can be captured with the action of the medicine at the same time.”Related StoriesNITO’s Nathaniel Marro on Solutions for the Broken Ticketing Business: ‘The Harder You Make It to Buy Tickets, the Fewer You Will Sell'Zoe Saldaña Says Her Oscar Statue Is 'Trans' and 'Goes by They/Them' Pronouns: 'We Have It in My Office and My Oscar Is Gender Fluid' **Related Stories** **NITO’s Nathaniel Marro on Solutions for the Broken Ticketing Business: ‘The Harder You Make It to Buy Tickets, the Fewer You Will Sell'** **Zoe Saldaña Says Her Oscar Statue Is 'Trans' and 'Goes by They/Them' Pronouns: 'We Have It in My Office and My Oscar Is Gender Fluid'** **Related Stories** **NITO’s Nathaniel Marro on Solutions for the Broken Ticketing Business: ‘The Harder You Make It to Buy Tickets, the Fewer You Will Sell'** **Zoe Saldaña Says Her Oscar Statue Is 'Trans' and 'Goes by They/Them' Pronouns: 'We Have It in My Office and My Oscar Is Gender Fluid'** As a medical consultant on the show, another major part of her role is working with the cast. The show, which is set in real time, with 15 episodes covering a 15-hour workday, features over 300 background extras as well as its principals, Noah Wyle, Tracy Ifeachor, Patrick Ball, Katherine LaNasa, Taylor Dearden and Isa Briones. “It’s really the rehearsal and the education and teaching them the finesse and the refined movements.” By the end, the cast has natural movements as they intubate, put a cast on, or an IV. She also works with them on the technical jargon that again helps them speak with ease and emotion.” While there are countless medical emergencies throughout the day on the show, Ferreira reveals the scene that stuck most to real-life was in episode 4 when an older patient has multifocal pneumonia and sepsis. Ferreira says, “You see the struggle of what intubation looks like. The general audience learns what intubation looks like. And then going through the process of transitioning to comfort care to allow there to be dignity in death is actually one of the most common conversations we have both in the emergency medicine setting and the hospital and critical care unit.” She goes on to say, “I think it’s actually a really great educational moment to let people see that sometimes there is dignity in death. It’s a bit disturbing, but it gets all of it in one beautiful moment.” In another episode, an influencer gets mercury poisoning from makeup. How accurate is that? Ferreira says, “Mercury poisoning is, I wouldn’t say rare, but not as common. We do see a lot of toxicities from various household chemicals, various makeup products, or just exposures to general environmental things quite often.” The attack on Dana by a frustrated patient in episode 9 is something that reflects violence towards doctors and healthcare workers. But Ferreira clarifies, “I think the inspiration behind showing Dana get punched is one, there is an actual level of violence in the emergency department. I never call the ER a glamorous place. And it’s because we’re seeing all walks of life. We do not discriminate. So, whether it’s patients who are unfortunately under the influence of various drugs, if they have underlying psychiatric disorders, if they’ve gone through a very traumatic moment and coping mechanisms are not in place for them to tolerate any bad news.” She continues, “Sometimes it can be projected onto the healthcare worker who is either providing the bad news or somehow the system is failing the healthcare worker, which then fails the patient. And Dana is the perfect character to have this happen to because you see someone who’s been trying the entire season to move the department along, to get patients seen, to try her best to take care of not just the patients but her staff and acts as this mama bear to everyone.” Watch the video above. Artisans HBO, The Pitt **More from Variety** How VFX Masters Brought to Life Mutilated Ancestors on ’The Last of Us’ and Pulled Off a Massive Flood on ‘The Penguin’ **How VFX Masters Brought to Life Mutilated Ancestors on ’The Last of Us’ and Pulled Off a Massive Flood on ‘The Penguin’** **How VFX Masters Brought to Life Mutilated Ancestors on ’The Last of Us’ and Pulled Off a Massive Flood on ‘The Penguin’** All About the Mother: Cristin Milioti Looks Back, From ‘The Sopranos’ to ‘Black Mirror’ and ‘The Penguin’ **All About the Mother: Cristin Milioti Looks Back, From ‘The Sopranos’ to ‘Black Mirror’ and ‘The Penguin’** **All About the Mother: Cristin Milioti Looks Back, From ‘The Sopranos’ to ‘Black Mirror’ and ‘The Penguin’** Limited Series Writers on the Impact of Casting, Writing Emotional Journeys, and Finding a Tonal Balance **Limited Series Writers on the Impact of Casting, Writing Emotional Journeys, and Finding a Tonal Balance** **Limited Series Writers on the Impact of Casting, Writing Emotional Journeys, and Finding a Tonal Balance** **Most Popular** Scarlett Johansson Asked to Have ‘Thunderbolts*’ EP Credit Removed, Says Marvel Casts Get ‘So Enormous’ You Sometimes ‘Feel Like a Device’ to Move… **Scarlett Johansson Asked to Have ‘Thunderbolts*’ EP Credit Removed, Says Marvel Casts Get ‘So Enormous’ You Sometimes ‘Feel Like a Device’ to Move…** **Scarlett Johansson Asked to Have ‘Thunderbolts*’ EP Credit Removed, Says Marvel Casts Get ‘So Enormous’ You Sometimes ‘Feel Like a Device’ to Move…** R. Kelly’s Attorneys File for Immediate Release From Custody, Alleging Officials Solicited Inmate to Murder Him **R. Kelly’s Attorneys File for Immediate Release From Custody, Alleging Officials Solicited Inmate to Murder Him** **R. Kelly’s Attorneys File for Immediate Release From Custody, Alleging Officials Solicited Inmate to Murder Him** Brian Wilson, Beach Boys Co-Founder, Dies at 82 **Brian Wilson, Beach Boys Co-Founder, Dies at 82** **Brian Wilson, Beach Boys Co-Founder, Dies at 82** Glen Powell’s Ex Speaks Out on Actor Leaning Into Sydney Sweeney Romance Rumors to Boost ‘Anyone But You’ Publicity: ‘I Felt Like I Was Fed to the… **Glen Powell’s Ex Speaks Out on Actor Leaning Into Sydney Sweeney Romance Rumors to Boost ‘Anyone But You’ Publicity: ‘I Felt Like I Was Fed to the…** **Glen Powell’s Ex Speaks Out on Actor Leaning Into Sydney Sweeney Romance Rumors to Boost ‘Anyone But You’ Publicity: ‘I Felt Like I Was Fed to the…** Trump Military Parade May Not Get Much Coverage on CBS, NBC, ABC **Trump Military Parade May Not Get Much Coverage on CBS, NBC, ABC** **Trump Military Parade May Not Get Much Coverage on CBS, NBC, ABC** 'Steven Universe: Lars of the Stars' Unveiled in Annecy: Studios Sneak Peek New 'Regular Show,' 'Foster's,' 'Adventure Time,' 'Gumball' Series **'Steven Universe: Lars of the Stars' Unveiled in Annecy: Studios Sneak Peek New 'Regular Show,' 'Foster's,' 'Adventure Time,' 'Gumball' Series** **'Steven Universe: Lars of the Stars' Unveiled in Annecy: Studios Sneak Peek New 'Regular Show,' 'Foster's,' 'Adventure Time,' 'Gumball' Series** James Gunn Told Marvel He Would Not Put Thor in 'Guardians Vol. 3′ Despite ‘Avengers: Endgame’ Finale: ‘I Don’t Understand the Character That Much… **James Gunn Told Marvel He Would Not Put Thor in 'Guardians Vol. 3′ Despite ‘Avengers: Endgame’ Finale: ‘I Don’t Understand the Character That Much…** **James Gunn Told Marvel He Would Not Put Thor in 'Guardians Vol. 3′ Despite ‘Avengers: Endgame’ Finale: ‘I Don’t Understand the Character That Much…** 'Harry Potter' Star Nick Frost Disagrees With J.K. Rowling's Trans Views, Disabled Instagram Comments Amid Backlash to Working With Her: We 'Don't… **'Harry Potter' Star Nick Frost Disagrees With J.K. Rowling's Trans Views, Disabled Instagram Comments Amid Backlash to Working With Her: We 'Don't…** **'Harry Potter' Star Nick Frost Disagrees With J.K. Rowling's Trans Views, Disabled Instagram Comments Amid Backlash to Working With Her: We 'Don't…** Cartoon Network Studios Icons McCracken, Tartakovsky, Sugar, Quintel, Ward and Muto on The Studio, State of the Industry and What Inspires Them **Cartoon Network Studios Icons McCracken, Tartakovsky, Sugar, Quintel, Ward and Muto on The Studio, State of the Industry and What Inspires Them** **Cartoon Network Studios Icons McCracken, Tartakovsky, Sugar, Quintel, Ward and Muto on The Studio, State of the Industry and What Inspires Them** Netflix’s ‘Little House on the Prairie’ Reboot Begins Filming, Drops First Photos of the New Ingalls Family Cast Together **Netflix’s ‘Little House on the Prairie’ Reboot Begins Filming, Drops First Photos of the New Ingalls Family Cast Together** **Netflix’s ‘Little House on the Prairie’ Reboot Begins Filming, Drops First Photos of the New Ingalls Family Cast Together** **Must Read** TVACTORS ON ACTORS | Colin Farrell and Danny DeVitoBy Andrew Wallenstein1 week **ACTORS ON ACTORS | Colin Farrell and Danny DeVito** **ACTORS ON ACTORS | Colin Farrell and Danny DeVito** TV‘There Is No Feud’: Walton Goggins and Aimee Lou Wood Tell All on Their ‘White Lotus’ Connection, **‘There Is No Feud’: Walton Goggins and Aimee Lou Wood Tell All on Their ‘White Lotus’ Connection,** **‘There Is No Feud’: Walton Goggins and Aimee Lou Wood Tell All on Their ‘White Lotus’ Connection,** TVOnly Netflix’s Tudum Could Put Lady Gaga, ‘Stranger Things,’ Ben Affleck and ‘Love Is Blind’ on the Same Stage. It Was… **Only Netflix’s Tudum Could Put Lady Gaga, ‘Stranger Things,’ Ben Affleck and ‘Love Is Blind’ on the Same Stage. It Was…** **Only Netflix’s Tudum Could Put Lady Gaga, ‘Stranger Things,’ Ben Affleck and ‘Love Is Blind’ on the Same Stage. It Was…** TV‘It’s a Bit of a Suicide Mission’: How ‘Succession’ Creator Jesse Armstrong Made ‘Mountainhead’ in Six… **‘It’s a Bit of a Suicide Mission’: How ‘Succession’ Creator Jesse Armstrong Made ‘Mountainhead’ in Six…** **‘It’s a Bit of a Suicide Mission’: How ‘Succession’ Creator Jesse Armstrong Made ‘Mountainhead’ in Six…** Film‘Ma 2’ in Development: Octavia Spencer Returning for Horror Sequel From Blumhouse **‘Ma 2’ in Development: Octavia Spencer Returning for Horror Sequel From Blumhouse** **‘Ma 2’ in Development: Octavia Spencer Returning for Horror Sequel From Blumhouse** **Sign Up for Variety Newsletters** **Variety Confidential** A Variety and iHeartRadio Podcast **More From Our Brands** Rolling Stone5 Best All-Inclusive Destinations for An Unforgettable Milestone Birthday **5 Best All-Inclusive Destinations for An Unforgettable Milestone Birthday** **5 Best All-Inclusive Destinations for An Unforgettable Milestone Birthday** **5 Best All-Inclusive Destinations for An Unforgettable Milestone Birthday** Robb ReportA Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million **A Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million** **A Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million** **A Music Industry Exec’s Boldly Angled Santa Barbara Wine Country Estate Lists for $10 Million** SporticoIndie Basketball GM Video Game Spikes in Wake of Doncic Trade **Indie Basketball GM Video Game Spikes in Wake of Doncic Trade** **Indie Basketball GM Video Game Spikes in Wake of Doncic Trade** **Indie Basketball GM Video Game Spikes in Wake of Doncic Trade** WWDAddison Rae Dons Winged Eyeliner and Punk-inspired Shadow Makeup in her ‘Times Like These’ Music Video **Addison Rae Dons Winged Eyeliner and Punk-inspired Shadow Makeup in her ‘Times Like These’ Music Video** **Addison Rae Dons Winged Eyeliner and Punk-inspired Shadow Makeup in her ‘Times Like These’ Music Video** **Addison Rae Dons Winged Eyeliner and Punk-inspired Shadow Makeup in her ‘Times Like These’ Music Video** TVLineCasting News: black-ish Star Joins Boston Blue, Carrie TV Series Adds 14 and More **Casting News: black-ish Star Joins Boston Blue, Carrie TV Series Adds 14 and More** **Casting News: black-ish Star Joins Boston Blue, Carrie TV Series Adds 14 and More** **Casting News: black-ish Star Joins Boston Blue, Carrie TV Series Adds 14 and More** About Us Newsletter Variety Events Luminate - Film & TV Advertise Media Kit Careers Customer Service Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Subscribe Variety Digital Login Group Subscriptions Variety Archives Back Issues Help Subscribe Login Learn More FAQ Instagram Twitter YouTube Facebook LinkedIn The Business of Entertainment Expand the sub menuFilmNewsReviewsPodcastsBox OfficeEventsColumnsTrailers News Reviews Podcasts Box Office Events Columns Trailers News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menuTVNewsReviewsPodcastsRatingsPilot ScorecardColumnsTrailers News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menuWhat To WatchLists & Features Lists & Features Lists & Features Expand the sub menuMusicNewsAlbum ReviewsConcert ReviewsHitmakersMusic For ScreensGrammys News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menuDocsLists & Features Lists & Features Lists & Features Expand the sub menuTechFeaturesGlobalVIP+ Tech Features Global VIP+ Tech Features Global VIP+ Tech Expand the sub menuGlobalNewsAsiaMarkets & FestivalsFeatures News Asia Markets & Festivals Features News Asia Markets & Festivals Features Expand the sub menuAwards CircuitNewsFilm PredictionsTV PredictionsVideoArtisansColumnsAwards Circuit Podcast News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menuVideoPopularCover Shoots - Behind the ScenesActors on ActorsPower of WomenEventsArtisans Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menuWhat to HearLists & Features Lists & Features Lists & Features Expand the sub menuVIP+Daily CommentarySpecial ReportsVideo Daily Commentary Special Reports Video Daily Commentary Special Reports Video Expand the sub menuMore CoverageObituaries - submit obituaries to obits@variety.comPhotosPodcastsSceneVoicesTheater Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menuMore VarietyLive Media SummitsVscoreLuminate - Film & TVVariety ArchivesVariety500Industry Executives Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters U.S. Asia Global **Alerts and Newsletters** **Follow Us** Got a Tip? U.S. Asia Global Advertise About Contact Us"}