{"id": 1028, "name": "Netherlands Radio and Television Association", "domain": "nos.nl", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://over.nos.nl/uw-vragen-reacties/uw-vragen-of-reactie/", "title": "Uw Vragen Of Reactie", "content": "OrganisatieDirectie, toezicht en adviesOrganogramJaarverslagenMeldpunt ongewenst gedragMelden zwakke ICT-plekkenANBI publicatieplichtInformatieverzoek makersVoorwaardenGeschiedenisAbout NOS Directie, toezicht en advies Organogram Jaarverslagen Meldpunt ongewenst gedrag Melden zwakke ICT-plekken ANBI publicatieplicht Informatieverzoek makers Voorwaarden Geschiedenis About NOS Directie, toezicht en advies Organogram Jaarverslagen Meldpunt ongewenst gedrag Melden zwakke ICT-plekken ANBI publicatieplicht Informatieverzoek makers Voorwaarden Geschiedenis About NOS UitgangspuntenTaken & MissieProgrammastatuutBeleidsplanDiversiteit en inclusieProgramma- en evenementsponsoring Taken & Missie Programmastatuut Beleidsplan Diversiteit en inclusie Programma- en evenementsponsoring Taken & Missie Programmastatuut Beleidsplan Diversiteit en inclusie Programma- en evenementsponsoring IntegriteitGedragscode integriteitRegister nevenfunctiesRegister giften en uitnodigingen Gedragscode integriteit Register nevenfuncties Register giften en uitnodigingen Gedragscode integriteit Register nevenfuncties Register giften en uitnodigingen Privacy reglement Voor de persInterviewverzoekenContactpersonenPersdossier Interviewverzoeken Contactpersonen Persdossier Interviewverzoeken Contactpersonen Persdossier Ombudsman NOS.nl Nieuws over de NOS Journalistieke verantwoording Programma’s & platforms Onze mensen Uw vragen & reactiesVeelgestelde vragenUw vragen of reactieTip de redactieDe taal van de NOS Veelgestelde vragen Uw vragen of reactie Tip de redactie De taal van de NOS Veelgestelde vragen Uw vragen of reactie Tip de redactie De taal van de NOS NOS Innovaties OrganisatieDirectie, toezicht en adviesOrganogramJaarverslagenMeldpunt ongewenst gedragMelden zwakke ICT-plekkenANBI publicatieplichtInformatieverzoek makersVoorwaardenGeschiedenisAbout NOS Directie, toezicht en advies Organogram Jaarverslagen Meldpunt ongewenst gedrag Melden zwakke ICT-plekken ANBI publicatieplicht Informatieverzoek makers Voorwaarden Geschiedenis About NOS Directie, toezicht en advies Organogram Jaarverslagen Meldpunt ongewenst gedrag Melden zwakke ICT-plekken ANBI publicatieplicht Informatieverzoek makers Voorwaarden Geschiedenis About NOS UitgangspuntenTaken & MissieProgrammastatuutBeleidsplanDiversiteit en inclusieProgramma- en evenementsponsoring Taken & Missie Programmastatuut Beleidsplan Diversiteit en inclusie Programma- en evenementsponsoring Taken & Missie Programmastatuut Beleidsplan Diversiteit en inclusie Programma- en evenementsponsoring IntegriteitGedragscode integriteitRegister nevenfunctiesRegister giften en uitnodigingen Gedragscode integriteit Register nevenfuncties Register giften en uitnodigingen Gedragscode integriteit Register nevenfuncties Register giften en uitnodigingen Privacy reglement Voor de persInterviewverzoekenContactpersonenPersdossier Interviewverzoeken Contactpersonen Persdossier Interviewverzoeken Contactpersonen Persdossier Ombudsman NOS.nl **Uw vragen & reacties** Procedure Publieksreacties We waarderen het wanneer u met ons meedenkt over onze berichtgeving. Of dit een compliment, suggestie, vraag of klacht betreft. Het liefst reageren we op ieder bericht dat we ontvangen. Wel hanteren we enkele richtlijnen. We antwoorden niet op mails met scheldwoorden, beledigingen, bedreigingen, discriminatie, spam of reclame-uitingen. Wanneer wij een reactie van u ontvangen doen we ons best deze binnen twee dagen te beantwoorden. Soms kan dit langer duren. We ontvangen honderden reacties per dag, die we allemaal even aandachtig willen behandelen. Als wij een publieksreactie ontvangen waar wij niet direct het antwoord op weten, kan het zijn dat we deze eerst nog naar de redactie sturen die het artikel of item gemaakt heeft. In zo’n geval kan het voorkomen dat een reactie langer dan twee dagen op zich laat wachten. Mocht u van ons een antwoord ontvangen en van mening zijn dat de NOS niet voldaan heeft aan haar journalistieke uitgangspunten, dan kunt u zich wenden tot de NPO Ombudsman via:https://www.omroepombudsman.nl/ Vragenformulier Heeft u een vraag of opmerking over een van onze programma’s, NOS.nl, onze apps of NOS Teletekst? En staat het antwoord niet in de rubriekVeelgestelde vragen? Dan kunt u gebruikmaken van onderstaand vragenformulier. U krijgt een ontvangstbevestiging. U kunt ook een mailtje sturen naarreacties@nos.nl. Wilt u de redactie tippen over een nieuwsfeit of een persbericht sturen,dan kunt u hier terecht. Ook kunt u uw vraag stellen via X (@NOScommunicatie). Voor vragen en opmerkingen via WhatsApp zijn wij tijdens kantooruren bereikbaar op het nummer 06 25 10 40 38. Klachten die via derden binnenkomen behandelen wij niet. **Uw vraag of reactie** Naam* E-mailadres* Medium*Kies een mediumInternetMobielTeletekstTelevisieRadioOverig Soort reactie*Maak een keuzeVraagComplimentSuggestieKlacht Reactie gaat over*Maak een keuzeNieuwsSportEvenementen (bijv. Koningsdag)TechnischOverig Onderwerp* Uw vraag* CAPTCHA **Over de NOS** Programma’s & platforms Nieuws over de NOS Organisatie Onze mensen Journalistieke verantwoording Adres en Route **Uw vragen & reacties** Veelgestelde vragen Uw vragen & reacties Tip de redactie De taal van de NOS **Vacatures** Werken bij de NOS Voorwaarden Colofon"}