{"id": 1581, "name": "Government Accountability Project (GAP)", "domain": "whistleblower.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://whistleblower.org/press-release/oig-report-partially-supports-east-palestine-whistleblower-disclosure-but-fails-to-address-serious-allegations-in-the-complaint/", "title": "Oig Report Partially Supports East Palestine Whistleblower Disclosure But Fails To Address Serious Allegations In The Complaint", "content": "Sign Up For Our Newsletter Support UsDonate OnlineHow to Make a Donation of SecuritiesOther Ways to DonatePlanned GivingFarenthold Fellowship Donation Donate Online How to Make a Donation of Securities Other Ways to Donate Planned Giving Farenthold Fellowship Donation Donate Online How to Make a Donation of Securities Other Ways to Donate Planned Giving Farenthold Fellowship Donation Contact ABOUTOur StoryOur TeamBoard of DirectorsJoin the TeamAnnual ReportsContact Us Our Story Our Team Board of Directors Join the Team Annual Reports Contact Us Our Story Our Team Board of Directors Join the Team Annual Reports Contact Us ISSUESCorporate & Financial AccountabilityDemocracy Protection InitiativeEnvironment, Energy & Climate ChangeFood IntegrityGovernment AccountabilityImmigrationInternational Whistleblower RightsNational SecurityPublic Health Corporate & Financial Accountability Democracy Protection Initiative Environment, Energy & Climate Change Food Integrity Government Accountability Immigration International Whistleblower Rights National Security Public Health Corporate & Financial Accountability Democracy Protection Initiative Environment, Energy & Climate Change Food Integrity Government Accountability Immigration International Whistleblower Rights National Security Public Health WHAT WE DOEducation & PartnershipsLegislative InitiativesLitigationInvestigations Education & Partnerships Legislative Initiatives Litigation Investigations Education & Partnerships Legislative Initiatives Litigation Investigations NEWSNews HitsLettersPress ReleasesBlogPress Inquiries News Hits Letters Press Releases Blog Press Inquiries News Hits Letters Press Releases Blog Press Inquiries RESOURCES DONATE Take Action Search for: **“EPA OIG Report Validates Key Claims by East Palestine Whistleblower, While Leaving Critical Allegations Unresolved** June 3, 2025 EPA OIG Report Validates Key Claims by East Palestine Whistleblower, While Leaving Critical Allegations Unresolved WASHINGTON–Today, the Environmental Protection Agency (EPA) Office of Inspector General (OIG) released itsreporton its investigation into the Airborne Spectral Photometric Environmental Collection Technology (ASPECT) missions, policies, procedures, and quality assurance. On July 17, 2024, EPAopenedits initial investigation into the ASPECT flight mission over East Palestine, Ohio, following the toxic derailment in February 2023 and whistleblowerdisclosurefrom former ASPECT data quality manager and creator of the ASPECT software, Dr. Robert Kroutil. In the report, EPA OIG found the On-Scene Coordinators may have been unaware of the technology’s abilities and recommended the coordinators be trained on the plane’s capabilities. The report concluded that the procedures remain “largely unknown to all stakeholders” and there is a lack of clarity that could negatively impact emergency decision-making, leaving EPA without a formal deployment guide for ASPECT. However, parts of Dr. Kroutil’s disclosure were not addressed in the final report, including the incomplete data that was passed over for analysis and sensors being turned off during the flight. “While the EPA OIG report vindicates Dr. Kroutil by confirming systemic procedural deficiencies and knowledge gaps that supported his broader concerns about ASPECT program management, the investigation’s scope was too narrow, failing to address the most serious allegations about data collection practices, sensor shutdowns, and potential report manipulation,”Government Accountability Project’s Senior Environmental Officer, Lesley Pacey,commented. “Dr. Kroutil’s courage in coming forward has already led to meaningful policy improvements, but a more comprehensive investigation into the substantive allegations about data collection and analysis would better serve the public interest and ensure accountability for this critical environmental disaster response.” Government Accountability Project whistleblower client, Dr. Robert Kroutil, added, “I disagree with the assessment in the report that EPA followed established deployment protocols. The report noted that EPA officials believe that the on-ground monitoring equipment provided superior detection capabilities, which is incorrect. This demonstrates EPA’s complete lack of understanding of the ASPECT technology and how it works to protect chemically impacted sites.” Contact:[email protected] Government Accountability Project Government Accountability Project is the nation’s leading whistleblower protection organization. Through litigating whistleblower cases, publicizing concerns and developing legal reforms, Government Accountability Project’s mission is to protect the public interest by promoting government and corporate accountability. Founded in 1977, Government Accountability Project is a nonprofit, nonpartisan advocacy organization based in Washington, D.C. ### Good Government Coalition Calls for Schedule Policy/Career Propose Rule to be Rescinded The Times Leader: Emails obtained by watchdog led to more questions than answers Associated Press: Confusion on sensor plane’s abilities delayed response in Ohio train derailment, report says MENAFN: Report states White House hid chemical spill cancer hazard Business Journal Daily: “Government Failed Us”: East Palestine Health Concerns Validated Privacy Policy Financials Resources & Publications 1612 K St. NW, Suite #808Washington DC, 20006 (202) 457-0034 [email protected] [email protected]"}