{"id": 2105, "name": "Prime 9ja Online", "domain": "prime9ja.com.ng", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.prime9ja.com.ng/2025/05/ayra-starr-crosses-1-billion-on-youtube.html", "title": "Ayra Starr Crosses 1 Billion On Youtube.html", "content": "Subscribe to our newsletter and never miss our investigative stories, breaking news, podcasts etc.. Home Nigeria Politics Metro World Lifestlye Football 2023 Election Africa Business Football Metro Nigeria Opinion Politics Technology Categories _Football _Lifestyle _World _Metro _Politics _Nigeria Pages _About Us _Contact Us _Privacy Policy **Ayra Starr Crosses 1 Billion on YouTube** **LAGOS — Nigerian singer Ayra Starr has become the first female artist from the country to exceed one billion total views on YouTube, establ...** LAGOS —Nigerian singer Ayra Starr has become the first female artist from the country to exceed one billion total views on YouTube, establishing a new benchmark for Nigerian women in the global digital music space. With this feat, the 23-year-old performer has overtaken Yemi Alade, who previously held the record for the most viewed Nigerian female musician on the platform, amassing over 805 million views. According to verified data, Ayra Starr’s cumulative YouTube views have now crossed the one-billion threshold. A significant portion of this traffic is attributed to her Grammy-nominated singleRush, which alone has drawn over 450 million views on the video-sharing site. By reaching this milestone, Ayra Starr enters an elite group of Nigerian artists who have recorded over one billion views on the platform. That list includes Burna Boy, Wizkid, Davido, Rema, CKay, Flavour, Kizz Daniel, P-Square, Fireboy DML, Tekno, and Omah Lay. **Sign Up For Daily Newsletter** **You Might Also Like** Subscribe to our newsletter to receive our latest updates instantly on your email. About Us Privacy Policy Terms Disclaimer Fact-Checking Policy Code of Ethics Corrections and Correctives Editorial Integrity Ethical Conduct Funding Contact Us Advertise Submit a Tip © 2025 Prime 9ja Online Media - All Rights Reserved."}