{"id": 716, "name": "Jewish Press of Tampa", "domain": "jewishpresstampa.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.jewishpresstampa.com/articles/authorities-raid-michigan-homes-in-probe-of-pro-palestinian-vandalism-targeting-jewish-homes-and-institutions-university-officials/", "title": "Authorities Raid Michigan Homes In Probe Of Pro Palestinian Vandalism Targeting Jewish Homes And Institutions University Officials", "content": "Select Your Community▼Tampa EditionFlorida’s Gulf Coast Edition Tampa Edition Florida’s Gulf Coast Edition Tampa Edition Florida’s Gulf Coast Edition Front PageWorld NewsFederationSchoolsSocial ServicesOrganizationsCandlelighting TimesCongregationsRabbinically SpeakingReligious DirectoryBar/Bat MitzvahsSenior LivingObituariesCulture Front Page World News Federation Schools Social Services Organizations Candlelighting Times Congregations Rabbinically Speaking Religious Directory Bar/Bat Mitzvahs Senior Living Obituaries Culture Front Page World News Federation Schools Social Services Organizations Candlelighting Times Congregations Rabbinically Speaking Religious Directory Bar/Bat Mitzvahs Senior Living Obituaries Culture Jewish Press of Tampa BayGroup HomepageJP – Tampa EditionJP – Florida’s Gulf Coast Edition Group Homepage JP – Tampa Edition JP – Florida’s Gulf Coast Edition Group Homepage JP – Tampa Edition JP – Florida’s Gulf Coast Edition ArchivesPDF Archives PDF Archives PDF Archives Staff Login Wednesday, June 11, 2025 **Latest Edition** Home About Us AdvertiseMedia KitAd DeadlinesClassifiedsMechanicalsDesign Service Media Kit Ad Deadlines Classifieds Mechanicals Design Service Media Kit Ad Deadlines Classifieds Mechanicals Design Service PR InfoPress Release GuidelinesSubmit Press ReleasePress Release Deadlines Press Release Guidelines Submit Press Release Press Release Deadlines Press Release Guidelines Submit Press Release Press Release Deadlines Submission FormsSubmit Anniversary AnnouncementSubmit Bar/Bat MitzvahsSubmit Birth AnnouncementSubmit Letter to the EditorSubmit ObituarySubmit Press ReleaseSubmit Wedding/Engagement Announcement Submit Anniversary Announcement Submit Bar/Bat Mitzvahs Submit Birth Announcement Submit Letter to the Editor Submit Obituary Submit Press Release Submit Wedding/Engagement Announcement Submit Anniversary Announcement Submit Bar/Bat Mitzvahs Submit Birth Announcement Submit Letter to the Editor Submit Obituary Submit Press Release Submit Wedding/Engagement Announcement Delivery Contact UsStaff Directory Staff Directory Staff Directory ArchivesFlorida’s Gulf Coast EditionTampa Edition Florida’s Gulf Coast Edition Tampa Edition Florida’s Gulf Coast Edition Tampa Edition Print Edition ArchivesFlorida’s Gulf Coast EditionTampa Edition Florida’s Gulf Coast Edition Tampa Edition Florida’s Gulf Coast Edition Tampa Edition NewsFront PageWorld News Front Page World News Front Page World News CommunityFederationSchoolsSocial Services Federation Schools Social Services Federation Schools Social Services Organizations Columns Religious LifeCandlelighting TimesCongregationsRabbinically SpeakingReligious Directory Candlelighting Times Congregations Rabbinically Speaking Religious Directory Candlelighting Times Congregations Rabbinically Speaking Religious Directory LifecycleAnniversariesBar/Bat MitzvahsBar-Bat Mitzvah GuideSenior LivingBirthsObituariesWeddings and EngagementsWedding Guide 2024 Anniversaries Bar/Bat Mitzvahs Bar-Bat Mitzvah Guide Senior Living Births Obituaries Weddings and Engagements Wedding Guide 2024 Anniversaries Bar/Bat Mitzvahs Bar-Bat Mitzvah Guide Senior Living Births Obituaries Weddings and Engagements Wedding Guide 2024 Culture **Authorities raid Michigan homes in probe of pro-Palestinian vandalism targeting Jewish homes and institutions, university officials** Federal and state agents in Michigan raided at least three different home addresses connected to pro-Palestinian protesters last month, part of what authorities said was an ongoing investigation into more than a year of the group targeting homes and businesses including prominent Jewish locations. The raids — at homes in Ann Arbor, Ypsilanti and Canton — were not tied to immigration issues or on-campus demonstrations against Israel that have taken place over the last year and a half, according to a spokesman for Michigan Attorney General Dana Nessel. “These search warrants were not investigative of protest activity on the campus of the University of Michigan nor the Diag encampment,” the spokesman, Danny Wimmer, said in a statement, referring to the location of Michigan’s pro-Palestinian student encampment last year. “Today’s search warrants are in furtherance of our investigation into multi-jurisdictional acts of vandalism.” The raids — during which some people were detained but not arrested — follow acts of vandalism at the homes of members of the University of Michigan’s Board of Regents, whom pro-Palestinian activists want to cut university ties with Israel. Nessel’s office provided a list of the vandalism incidents the raids were investigating. The incidents included one in December, when a group of protesters threw rocks through the window of Jordan Acker, a Jewish regent, while he and his children were home in the heavily Jewish Detroit suburb of Huntington Woods, and left pro-Palestinian graffiti on his car. Another incident from June 2024 targeted Acker’s law office. Non-Jewish regents at the university, and the university president, have also been targeted by protesters in their own homes. Another incident, on the one-year anniversary of the Oct. 7 attacks, targeted the Jewish Federation of Metropolitan Detroit in Bloomfield Hills with graffiti reading “Intifada” and “F**k Israel.” Other graffiti, targeting a predominantly Jewish country club, made explicit references to Friends of the Israel Defense Forces, which had hosted an event at the space the day before. The oldest incidents dated back to February 2024; the most recent occurred in March of this year. A viral video showed officers breaking down the door of a home. Nessel’s office, on Thursday, said officers broke down the door “following more than an hour of police efforts to negotiate entry to satisfy the court-authorized search warrant.” Pro-Palestinian activists at the university have been engaged in extreme tactics to pressure its leadership to divest from Israel. Acker declined to comment on the raids Wednesday. He previously called the targeting of his own home “terrorism” and “Klan-like.” The involvement of federal agents in investigating local vandalism is unusual. An attorney representing several University of Michigan protesters told the Detroit Free Press that she believed the raids showed that Nessel’s office was collaborating with the Trump administration, which has cracked down on pro-Palestinian protesters and schools where they have been active and dispatched federal immigration authorities to arrest non-citizen student activists. “Everyone who was raided has taken part in protest and has some relationship to the University of Michigan,” said the attorney, Liz Jacob of the Sugar Law Center in Detroit. “We are totally convinced that, but for their viewpoints, these students would not have been targeted.” On Instagram, a pro-Palestinian collective at the university said they were being targeted by “zionist state AG Dana Nessel,” who they accused of working with Trump to “repress pro-Palestinian speech.” (Nessel is Jewish.) Online, other pro-Palestinian groups attempted to link the raids with the high-profile seizings of activists Mahmoud Khalil and Rumeysa Ozturk on other campuses. The University of Michigan, which has large Jewish and Arab American student populations, has taken more aggressive action against protesters since President Donald Trump’s reelection. In February, it suspended a leading pro-Palestinian student group for two years, in part over its demonstration at a regent’s home. Loading Comments **Latest Editions** Home Tampa JP Gulf Coast JP About Us Contact Us Privacy Policy Our HometownDMCA NoticesNewspaper website content management software and services"}