{"id": 212, "name": "Council on Foreign Relations", "domain": "cfr.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cfr.org/trade-tariffs-and-trumponomics", "title": "Trade Tariffs And Trumponomics", "content": "Foreign Affairs CFR Education Newsletters Related SitesCouncil of CouncilsThink Global HealthOnline Store Council of Councils Think Global Health Online Store Council of Councils Think Global Health Online Store Search Search Experts Trade and Tariffs TopicsFeaturedClimate ChangeGlobal Climate Agreements: Successes and FailuresIntroduction Over the last several decades, governments have collectively pledged to slow global warming. But despite intensified diplomacy, the world is already facing the consequences of climate…by Lindsay Maizland andClara FongJanuary 21, 2025Renewing AmericaDefense & SecurityDiplomacy & International InstitutionsEconomicsEnergy & EnvironmentHealthHuman RightsPolitics & GovernmentSocial Issues Climate Change Global Climate Agreements: Successes and Failures by Lindsay Maizland andClara FongJanuary 21, 2025Renewing America Defense & Security Diplomacy & International Institutions Economics Energy & Environment Health Human Rights Politics & Government Social Issues Climate Change Global Climate Agreements: Successes and Failures Global Climate Agreements: Successes and Failures by Lindsay Maizland andClara FongJanuary 21, 2025Renewing America Defense & Security Diplomacy & International Institutions Economics Energy & Environment Health Human Rights Politics & Government Social Issues RegionsFeaturedMyanmarMyanmar’s Troubled HistoryIntroduction Throughout its decades of independence, Myanmar has struggled with military rule, civil war, poor governance, and widespread poverty. A military coup in February 2021 dashed hopes for…by Lindsay MaizlandJanuary 31, 2022AmericasAsiaEurope & EurasiaGlobal CommonsMiddle East & North AfricaOceaniaSub-Saharan Africa Myanmar Myanmar’s Troubled History by Lindsay MaizlandJanuary 31, 2022 Americas Asia Europe & Eurasia Global Commons Middle East & North Africa Oceania Sub-Saharan Africa Myanmar Myanmar’s Troubled History Myanmar’s Troubled History by Lindsay MaizlandJanuary 31, 2022 Americas Asia Europe & Eurasia Global Commons Middle East & North Africa Oceania Sub-Saharan Africa ExplainersFeaturedHealthHow Tobacco Laws Could Help Close the Racial Gap on CancerDuring the 2020 presidential campaign, Joe Biden promised that his administration would make a “historic effort” to reduce long-running racial inequities in health. Tobacco use—the leading cause of p…by Olivia Angelino,Thomas J. Bollyky, Elle Ruggiero and Isabella TurilliFebruary 1, 2023Global Health ProgramBackgroundersIn BriefsPodcastsVideosTimelinesSpecial ProjectsInfoGuides Health How Tobacco Laws Could Help Close the Racial Gap on Cancer by Olivia Angelino,Thomas J. Bollyky, Elle Ruggiero and Isabella TurilliFebruary 1, 2023Global Health Program Backgrounders In Briefs Podcasts Videos Timelines Special Projects InfoGuides Health How Tobacco Laws Could Help Close the Racial Gap on Cancer How Tobacco Laws Could Help Close the Racial Gap on Cancer by Olivia Angelino,Thomas J. Bollyky, Elle Ruggiero and Isabella TurilliFebruary 1, 2023Global Health Program Backgrounders In Briefs Podcasts Videos Timelines Special Projects InfoGuides Research & AnalysisFeaturedChina Strategy InitiativeSecuring America: Key Authorities Under the Defense Production ActFour points framed Dr. Doshi’s remarks to the U.S. Senate Committee on Banking, Housing, and Urban Affairs. First, China is an ambitious and formidable competitor unlike any the United States h…TestimonybyRush DoshiMay 22, 2025China Strategy InitiativeExpertsCenters & ProgramsBooks & ReportsLatest CommentaryTask Force ProgramFellowships China Strategy Initiative Securing America: Key Authorities Under the Defense Production Act TestimonybyRush DoshiMay 22, 2025China Strategy Initiative Experts Centers & Programs Books & Reports Latest Commentary Task Force Program Fellowships China Strategy Initiative Securing America: Key Authorities Under the Defense Production Act Securing America: Key Authorities Under the Defense Production Act TestimonybyRush DoshiMay 22, 2025China Strategy Initiative Experts Centers & Programs Books & Reports Latest Commentary Task Force Program Fellowships CommunitiesFeaturedOil and Petroleum ProductsAcademic Webinar: The Geopolitics of OilPlayWebinarwith Carolyn Kissane andIrina A. FaskianosApril 12, 2023MembersMediaCongressStudents and EducatorsState & Local OfficialsReligion LeadersLocal Journalists Oil and Petroleum Products Academic Webinar: The Geopolitics of Oil Webinarwith Carolyn Kissane andIrina A. FaskianosApril 12, 2023 Members Media Congress Students and Educators State & Local Officials Religion Leaders Local Journalists Oil and Petroleum Products Academic Webinar: The Geopolitics of Oil Academic Webinar: The Geopolitics of Oil Webinarwith Carolyn Kissane andIrina A. FaskianosApril 12, 2023 Members Media Congress Students and Educators State & Local Officials Religion Leaders Local Journalists EventsFeaturedChinaDaughters and Sons Guest Event: Panda Diplomacy—China's Soft Power in Black and WhitePlayTRANSCRIPT SMITH: Excuse me, ladies and gentlemen. We’re going to get started. Thank you for being quiet so quickly. You guys are, like, the best behaved audience ever. I feel like if we nee…Virtual Eventwith Bryan Amaral,Rush Doshi, Melissa Songer, Jennifer Griffin and Brandie SmithMay 27, 2025Asia ProgramLectureship SeriesWebinars & Conference CallsSymposia China Daughters and Sons Guest Event: Panda Diplomacy—China's Soft Power in Black and White Virtual Eventwith Bryan Amaral,Rush Doshi, Melissa Songer, Jennifer Griffin and Brandie SmithMay 27, 2025Asia Program Lectureship Series Webinars & Conference Calls Symposia China Daughters and Sons Guest Event: Panda Diplomacy—China's Soft Power in Black and White Daughters and Sons Guest Event: Panda Diplomacy—China's Soft Power in Black and White Virtual Eventwith Bryan Amaral,Rush Doshi, Melissa Songer, Jennifer Griffin and Brandie SmithMay 27, 2025Asia Program Lectureship Series Webinars & Conference Calls Symposia Related SitesCouncil of CouncilsThink Global HealthOnline Store Council of Councils Think Global Health Online Store Council of Councils Think Global Health Online Store MoreResearch & AnalysisExpertsCenters & ProgramsBooks & ReportsLatest CommentaryTask Force ProgramFellowshipsCommunitiesMembersMediaCongressStudents and EducatorsState & Local OfficialsReligion LeadersLocal JournalistsEventsLectureship SeriesWebinars & Conference CallsSymposia Research & AnalysisExpertsCenters & ProgramsBooks & ReportsLatest CommentaryTask Force ProgramFellowships Experts Centers & Programs Books & Reports Latest Commentary Task Force Program Fellowships CommunitiesMembersMediaCongressStudents and EducatorsState & Local OfficialsReligion LeadersLocal Journalists Members Media Congress Students and Educators State & Local Officials Religion Leaders Local Journalists EventsLectureship SeriesWebinars & Conference CallsSymposia Lectureship Series Webinars & Conference Calls Symposia Research & AnalysisExpertsCenters & ProgramsBooks & ReportsLatest CommentaryTask Force ProgramFellowships Experts Centers & Programs Books & Reports Latest Commentary Task Force Program Fellowships Experts Centers & Programs Books & Reports Latest Commentary Task Force Program Fellowships CommunitiesMembersMediaCongressStudents and EducatorsState & Local OfficialsReligion LeadersLocal Journalists Members Media Congress Students and Educators State & Local Officials Religion Leaders Local Journalists Members Media Congress Students and Educators State & Local Officials Religion Leaders Local Journalists EventsLectureship SeriesWebinars & Conference CallsSymposia Lectureship Series Webinars & Conference Calls Symposia Lectureship Series Webinars & Conference Calls Symposia Newsletters CFR Education Foreign Affairs Member Login Global Trade Policy 2025, tariffs, trumponomics **Trade, Tariffs & Trumponomics** As President Donald Trump enters his second term, trade has become a central pillar of his foreign policy. CFR experts provide timely analysis on the trade-offs and costs involved as they explore the ripple effects on U.S. relations with allies and competitors alike and broader impact on the global economic system. **Framing The Debate** Expert Brief byMatthew P. Goodman Article byMarc L. Busch Article byMichael Froman **Can the President Actually Do That?** **Ways the President Can Raise Tariffs** **Our Trade Experts** Senior Fellow Senior Fellow President, Council on Foreign Relations Distinguished Fellow, Director of the Greenberg Center for Geoeconomic Studies, and Director of the CFR RealEcon Initiative Senior Fellow for Trade and International Political Economy Senior Fellow for Geoeconomics Maurice R. Greenberg Senior Fellow for China Studies Fellow for Trade Policy Senior Vice President, Director of Studies, and Maurice R. Greenberg Chair Whitney Shepardson Senior Fellow Senior Fellow and Director of International Economics **Tariffs Calendar** View the full calendar **Visualizing Trade** Article byRebecca Patterson Article byChristopher ShimandWill Merrow Article byWill MerrowandAndrew Huang **In Focus** **Donald Trump Wants Reciprocity in Trade: Here’s a Closer Look** Article byEdward Alden, Author andJennifer Hillman, Author **What Trump’s Trade War Would Mean, in Nine Charts** President Trump’s tariffs on Canada, China, and Mexico could upend U.S. trade. These nine charts show what’s at stake, what comes next, and why it matters. Article byShannon K. O'NeilandJulia Huesa **Explaining Trade** **What Are Tariffs?** Anshu SiripurapuandNoah Berman **Experts in the News** The Investors Who Prop Up America Won’t Soon Forget Thisvia The New York Times April 10, 2025 via The New York Times April 10, 2025 via The New York Times April 10, 2025 How other countries are trying to ‘weather the storm’ of Trump's tariff turmoilvia MSNBC Reports April 7, 2025 via MSNBC Reports April 7, 2025 via MSNBC Reports April 7, 2025 China’s retaliatory tariffs will encourage & give other countries cover to retaliateVia CNBC, April 4, 2025 Via CNBC, April 4, 2025 Via CNBC, April 4, 2025 Goodman: Tariffs Will Impact the Ordinary Consumervia BBC News April 4, 2025 via BBC News April 4, 2025 via BBC News April 4, 2025 How Are China, Other Asian Countries Responding to Trump's Tariff Plan?Via CBS News, April 2, 2025 Via CBS News, April 2, 2025 Via CBS News, April 2, 2025 Brad Setser on the Damage From Trump's Gigantic Tariff Shockvia Bloomberg Odd Lots Podcast April 5, 2025 via Bloomberg Odd Lots Podcast April 5, 2025 via Bloomberg Odd Lots Podcast April 5, 2025 Trump threatens China with combined tariff rate of 104%via CBC News: The National April 7, 2025 via CBC News: The National April 7, 2025 via CBC News: The National April 7, 2025 Froman: You can’t raise $6 trillion of revenue from tariffs & reindustrialize AmericaVia MSNBC, February 17, 2025 Via MSNBC, February 17, 2025 Via MSNBC, February 17, 2025 O'Neil: How Trump's Tariff Will Impact AmericansVia MSNBC, February 3, 2025 Via MSNBC, February 3, 2025 Via MSNBC, February 3, 2025 Bollyky: The Role of Importation in Remediating U.S. Generic Drug ShortagesVia New England Journal of Medicine, January 8, 2025 Via New England Journal of Medicine, January 8, 2025 Via New England Journal of Medicine, January 8, 2025 Media Briefing: Bracing for a Trade WarHeidi Crebo-Rediker, Zoe Liu, Inu Manak, and Benn Steil Heidi Crebo-Rediker, Zoe Liu, Inu Manak, and Benn Steil Heidi Crebo-Rediker, Zoe Liu, Inu Manak, and Benn Steil The U.S. Is Eroding Trade Rules It Helped Createvia BBC News April 8, 2025 via BBC News April 8, 2025 via BBC News April 8, 2025 **The Latest Trade News and Analysis** TradeTrade CalendarTrade and tariffs are a central part of President Donald Trump’s international economic policy. Stay up to date with the Council on Foreign Relation’s calendar of significant trade-related events.byAllison J. SmithJune 11, 2025RealEcon Trade Trade Calendar byAllison J. SmithJune 11, 2025RealEcon Trade Trade Calendar Trade Calendar byAllison J. SmithJune 11, 2025RealEcon RealEconBrussels Warns Trump About Tariffs and the Lobster TrapA trade war with the European Union could negatively impact many U.S. industries. The lobster trade provides a specific case study of how one significant industry could be severely harmed.by Marc L. BuschJune 10, 2025RealEcon RealEcon Brussels Warns Trump About Tariffs and the Lobster Trap by Marc L. BuschJune 10, 2025RealEcon RealEcon Brussels Warns Trump About Tariffs and the Lobster Trap Brussels Warns Trump About Tariffs and the Lobster Trap by Marc L. BuschJune 10, 2025RealEcon TradeTrump’s New Aluminum and Steel Tariffs Explained in Six ChartsPresident Trump doubled almost all aluminum and steel import tariffs, seeking to curb China’s growing dominance in global trade. These six charts show the tariffs’ potential economic effects.byShannon K. O'NeilandJulia HuesaJune 5, 2025Greenberg Center for Geoeconomic Studies Trade Trump’s New Aluminum and Steel Tariffs Explained in Six Charts byShannon K. O'NeilandJulia HuesaJune 5, 2025Greenberg Center for Geoeconomic Studies Trade Trump’s New Aluminum and Steel Tariffs Explained in Six Charts Trump’s New Aluminum and Steel Tariffs Explained in Six Charts byShannon K. O'NeilandJulia HuesaJune 5, 2025Greenberg Center for Geoeconomic Studies TradeWhere Does U.S. Trade Go From Here?PodcastGlobal trade tensions are boiling over and questions about the United States’ economic future are at the center of the debate. As trade experts question what comes next, it’s important to analyze how the United States got to this point. How have the current administration’s trade policies of today reshaped the global order of tomorrow?PodcastwithGabrielle Sierra,Michael FromanandShannon K. O'NeilJune 5, 2025Why It Matters Trade Where Does U.S. Trade Go From Here? PodcastwithGabrielle Sierra,Michael FromanandShannon K. O'NeilJune 5, 2025Why It Matters Trade Where Does U.S. Trade Go From Here? Where Does U.S. Trade Go From Here? PodcastwithGabrielle Sierra,Michael FromanandShannon K. O'NeilJune 5, 2025Why It Matters U.S. Trade DeficitMind the Trade GapPodcastThe United States has had a trade deficit, meaning we import more than we export, for the past fifty years. But recently the trade deficit has become a front-burner issue for President Donald Trump and a core reason for his administration’s sweeping tariff policy. When do trade deficits become a problem? Is the United States already at the tipping point?PodcastwithGabrielle Sierra,Brad W. Setserand Heather HurlburtJune 3, 2025Why It Matters U.S. Trade Deficit Mind the Trade Gap PodcastwithGabrielle Sierra,Brad W. Setserand Heather HurlburtJune 3, 2025Why It Matters U.S. Trade Deficit Mind the Trade Gap Mind the Trade Gap PodcastwithGabrielle Sierra,Brad W. Setserand Heather HurlburtJune 3, 2025Why It Matters TradeRelief and Realism: Global Reactions to U.S. Tariff RulingsThe U.S. federal court ruling that President Trump had overstepped his authority on imposing tariffs marked a clear setback for the administration. But any global cheering has been tempered by the recognition that U.S. officials have other tools for authorizing penalties, and that an appellate court has reinstated some tariffs.byBrad W. SetserMay 30, 2025Greenberg Center for Geoeconomic Studies Trade Relief and Realism: Global Reactions to U.S. Tariff Rulings byBrad W. SetserMay 30, 2025Greenberg Center for Geoeconomic Studies Trade Relief and Realism: Global Reactions to U.S. Tariff Rulings Relief and Realism: Global Reactions to U.S. Tariff Rulings byBrad W. SetserMay 30, 2025Greenberg Center for Geoeconomic Studies RealEconWhy India Needs to Move at the Pace that Washington wants on a Trade DealEditor's note: This article was originally published on May 22, 2025 and does not reflect developments post May 22. When Indian Prime Minister Narendra Modi met U.S. President Donald J. Trump at …byKenneth I. JusterMay 29, 2025RealEcon RealEcon Why India Needs to Move at the Pace that Washington wants on a Trade Deal byKenneth I. JusterMay 29, 2025RealEcon RealEcon Why India Needs to Move at the Pace that Washington wants on a Trade Deal Why India Needs to Move at the Pace that Washington wants on a Trade Deal byKenneth I. JusterMay 29, 2025RealEcon Richard HaassInternational Economic PolicyTrump’s Tariff Chaos Backfires: Richard Haass on Global Business FalloutLinkFeaturingRichard Haassvia Morning JoeMay 27, 2025 International Economic Policy Trump’s Tariff Chaos Backfires: Richard Haass on Global Business FalloutLink FeaturingRichard Haassvia Morning JoeMay 27, 2025 International Economic Policy Trump’s Tariff Chaos Backfires: Richard Haass on Global Business FalloutLink Trump’s Tariff Chaos Backfires: Richard Haass on Global Business FalloutLink FeaturingRichard Haassvia Morning JoeMay 27, 2025 RealEconThe Tariff Costs Are Worse Than You ThinkDespite recent trade deals with China and the UK, U.S. companies and consumers will face significant tariffs, compliance costs, and uncertainty without a more significant pivot from the Trump administration.by Jake ColvinMay 23, 2025RealEcon RealEcon The Tariff Costs Are Worse Than You Think by Jake ColvinMay 23, 2025RealEcon RealEcon The Tariff Costs Are Worse Than You Think The Tariff Costs Are Worse Than You Think by Jake ColvinMay 23, 2025RealEcon RealEconHow Trade Chaos Could Transform Into the Trump Round of Trade NegotiationsThe Trump administration’s upending of trade norms could help usher in a new economic order—but only if done right.by James WallarMay 20, 2025RealEcon RealEcon How Trade Chaos Could Transform Into the Trump Round of Trade Negotiations by James WallarMay 20, 2025RealEcon RealEcon How Trade Chaos Could Transform Into the Trump Round of Trade Negotiations How Trade Chaos Could Transform Into the Trump Round of Trade Negotiations by James WallarMay 20, 2025RealEcon Zongyuan Zoe LiuChinaWho Has the Upper Hand in the Trade War Between China and the U.S.? (in Swedish)LinkFeaturingZongyuan Zoe Liuvia KinamediaMay 18, 2025 China Who Has the Upper Hand in the Trade War Between China and the U.S.? (in Swedish)Link FeaturingZongyuan Zoe Liuvia KinamediaMay 18, 2025 China Who Has the Upper Hand in the Trade War Between China and the U.S.? (in Swedish)Link Who Has the Upper Hand in the Trade War Between China and the U.S.? (in Swedish)Link FeaturingZongyuan Zoe Liuvia KinamediaMay 18, 2025 Zongyuan Zoe LiuChinaTrump’s Truce With China on Tariffs Comes at a Cost to U.S. CredibilityLinkFeaturingZongyuan Zoe Liuvia PBS NewsMay 18, 2025 China Trump’s Truce With China on Tariffs Comes at a Cost to U.S. CredibilityLink FeaturingZongyuan Zoe Liuvia PBS NewsMay 18, 2025 China Trump’s Truce With China on Tariffs Comes at a Cost to U.S. CredibilityLink Trump’s Truce With China on Tariffs Comes at a Cost to U.S. CredibilityLink FeaturingZongyuan Zoe Liuvia PBS NewsMay 18, 2025 Load More About Member Programs Contact Support For Media Newsletters Membership Careers"}