{"id": 1359, "name": "Bulletin of Atomic Scientists", "domain": "thebulletin.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thebulletin.org/2025/06/a-nuclear-consortium-in-the-persian-gulf-as-a-basis-for-a-new-nuclear-deal-between-the-united-states-and-iran/", "title": "A Nuclear Consortium In The Persian Gulf As A Basis For A New Nuclear Deal Between The United States And Iran", "content": "About Magazine Events Contact Store My Account Login Donate Doomsday Clock Nuclear Risk Climate Change Disruptive Technologies Biosecurity Doomsday ClockOverviewDoomsday Clock StatementThe Clock SettersTimelineFAQVirtual TourDoomsday Clock Playlist Overview Doomsday Clock Statement The Clock Setters Timeline FAQ Virtual Tour Doomsday Clock Playlist Overview Doomsday Clock Statement The Clock Setters Timeline FAQ Virtual Tour Doomsday Clock Playlist TopicsNuclear RiskClimate ChangeDisruptive TechnologiesBiosecurityNuclear NotebookWhat’s new at theBulletin Nuclear Risk Climate Change Disruptive Technologies Biosecurity Nuclear Notebook What’s new at theBulletin Nuclear Risk Climate Change Disruptive Technologies Biosecurity Nuclear Notebook What’s new at theBulletin MagazineLoginCurrent Magazine IssueSubscribe to the MagazineMy AccountMagazine ArchiveMagazine FAQMagazine Covers Login Current Magazine Issue Subscribe to the Magazine My Account Magazine Archive Magazine FAQ Magazine Covers Login Current Magazine Issue Subscribe to the Magazine My Account Magazine Archive Magazine FAQ Magazine Covers Support Our WorkWays to GiveAnnual FundAnnual EventPlanned GiftsDonor RecognitionSpecial InitiativesGive NowStore Ways to Give Annual Fund Annual Event Planned Gifts Donor Recognition Special Initiatives Give Now Store Ways to Give Annual Fund Annual Event Planned Gifts Donor Recognition Special Initiatives Give Now Store About UsOur MissionLeadershipStaffEventsEditorial IndependenceAnnual ReportPathogens ProjectArts Science InitiativeNext Generation InitiativeOpen Positions Our Mission Leadership Staff Events Editorial Independence Annual Report Pathogens Project Arts Science Initiative Next Generation Initiative Open Positions Our Mission Leadership Staff Events Editorial Independence Annual Report Pathogens Project Arts Science Initiative Next Generation Initiative Open Positions Contact UsSend us a TipWrite for UsPermissions & CopyrightMedia InquiriesSupport Our WorkAdvertiseEmail Us Send us a Tip Write for Us Permissions & Copyright Media Inquiries Support Our Work Advertise Email Us Send us a Tip Write for Us Permissions & Copyright Media Inquiries Support Our Work Advertise Email Us Stay ConnectedNewsletterFacebookLinkedInBlueskyTwitterInstagramYouTube Newsletter Facebook LinkedIn Bluesky Twitter Instagram YouTube Newsletter Facebook LinkedIn Bluesky Twitter Instagram YouTube **A nuclear consortium in the Persian Gulf as a basis for a new nuclear deal between the United States and Iran** ByFrank von Hippel,Alexander Glaser,Zia Mian,Seyed Hossein Mousavian| June 2, 2025 Centrifuges used to enrich uranium at the Natanz nuclear facility in Iran as seen in 2019. Hundreds of these centrifuges were reportedly destroyed during an explosion in 2021 attributed to Israeli sabotage, prompting Iran to accelerate its enrichment program. (Credit: Atomic Energy Organization of Iran) Copy linkLinked copied Email Facebook Bluesky Twitter LinkedIn WhatsApp Reddit In the current talks between the United States and Iran, mediated by Oman, over the future of Iran’s uranium enrichment program, a regional nuclear consortium has been proposed by both Iran and the United States as a way to bridge the gap between US demands that Iran have no uranium enrichment and Iran’s insistence that it will not give up its rights and achievements regarding enrichment. Iran reportedly has offered a nuclear consortium including Saudi Arabia and the United Arab Emirates, for which Iran would enrich uranium at a large scale for commercial use under the oversight of these countries as well as International Atomic Energy Agency (IAEA) inspectors.[1]The United States meanwhile shared with Iran a bullet-point proposal for a regional nuclear consortium to include Iran, Saudi Arabia and other regional states, as well as the United States, in which Iran ends its uranium enrichment.[2]All or nothing approaches to enrichment in Iran may not present a model acceptable to both sides. Concerns about uranium-enrichment and related potential nuclear-weapons ambitions of both Iran and Saudi Arabia could be dealt with by a regional nuclear consortium within which enrichment-related activities would be spread across and shared among states, rather than be national nuclear programs. We sketch here a possible regional multinational nuclear consortium whose initial core partners are Iran, Oman, Saudi Arabia and the United Arab Emirates. Iran.The development, production and operation of centrifuges for uranium enrichment has been the focus of Iran’s program and of its technological accomplishments. In a regional multinational organization, it would be natural for Iran to continue that focus. Iran would maintain research, development, and manufacturing/production of centrifuges and operation of research and development test or pilot cascades. These activities could continue at its current nuclear complex. Over the years, Iran has developed and partly deployed multiple generations of centrifuges. By numbers installed, the first-generation IR-1 machine represents the largest share, but it is largely considered obsolete today. Given Iran’s achievement in developing advanced generations of centrifuges, it would only be natural that Iran would dismantle and dispose of its IR-1 machines as part of this agreement. More advanced machines that are currently deployed in larger numbers (IR-2, IR-4, IR-6) would be spun down and dismantled, along with the associated piping and electrical infrastructure, and placed in monitored storage until the consortium enrichment plant was ready for centrifuge installation. From a practical and economic perspective, it might be preferable to work with as few different types of centrifuges as possible. It would be left up to consortium partners to determine what centrifuges they want to rely on for deployment. Newly produced centrifuge components also would be stockpiled in monitored storage. These would be produced as needed and shipped out of Iran to the consortium’s enrichment plant, which would be in another country. There, the centrifuges would be assembled, set up in cascades, and operated by Iranian technicians. No centrifuge technology know-how would be transferred to other countries. As the technical lead of the consortium, Iran would also continue development of its IR-7, IR-8, IR-8B, IR-9, and possibly other advanced centrifuge designs. The IAEA report for May 2025 notes that Iran currently is testing single centrifuge machines of the IR-7, IR-8, IR-8B, and IR-9 designs at its Natanz Pilot Fuel Enrichment Plant, where it also runs centrifuge research and development lines with “small and intermediate cascades” of less than 100 centrifuges producing uranium enriched up to two percent U-235.[4]Continuing this practice would provide ongoing enrichment research and development in Iran while limiting the capacity of operating machines in the pilot plant to a mutually agreed but relatively small value, perhaps on the order of 1,000 separative work units per year.[5] The enriched product and depleted tails resulting from the operation of small and intermediate cascades for research and development would be blended back together upon leaving the machines or cascades, so no stocks of enriched uranium can build up—a common practice in centrifuge research and development operations that can be monitored using standard safeguards approaches. During the transitional period, if needed, Iran could retain stocks of uranium enriched below five percent, under IAEA supervision, in an amount sufficient for domestic needs. All other enriched uranium stocks in Iran would be blended down under IAEA oversight to below the five percent level and shipped to the consortium’s centralized storage outside Iran. Oman. An obvious candidate to host a new uranium enrichment plant for the regional consortium would be Oman, across the Gulf of Oman from Iran and bordering on both Saudi Arabia and the United Arab Emirates. Oman has repeatedly acted as a diplomatic intermediary and venue for discussions between Iran and the United States. The plant, financed by all the partners in the consortium, would be sized to meet the needs for low-enriched uranium (LEU) fuel for power reactors in the region that do not have other fuel supply arrangements. Based on the experience of the construction of the URENCO centrifuge enrichment plant in the United States, it may take three to four years to go from ground-breaking at a site in Oman to installing the first centrifuge and beginning production in the first cascade.[6] The consortium enrichment plant in Oman would be operated by Iranian technicians and safeguarded by the IAEA. There also could be an overlapping regional safeguards agency modeled partially on EURATOM and the Brazil-Argentine mutual nuclear monitoring agency, ABACC. The safeguards systems they have established work in tandem with the IAEA’s in checking national nuclear material accounting and control systems and conducting onsite inspection at nuclear facilities, even as each body draws its own independent conclusions. Enriched uranium product and depleted uranium tails from the consortium enrichment plant would be transferred out of Oman so that they could not be used as feed for further enrichment beyond the low enrichment levels required for power reactors. This would reduce any risk of the plant being used for covert enrichment to weapons levels. Saudi Arabia.Uranium mining and imports of uranium and uranium ore concentrate; conversion to uranium hexafluoride (UF6); the stockpiling of enriched uranium product and tails; and processing the enriched uranium back into uranium oxide for fabrication into fuel would all take place in Saudi Arabia. The stockpiles of low-enriched uranium could be made part of an IAEA-supervised uranium storage facility, similar to the one in Kazakhstan which holds 90 tons of LEU as uranium hexafluoride to allow blending to the enrichment requirements of different reactors.[7] The IAEA reports that Saudi Arabia has “initiated a strategic exploration programme for mineral resources including uranium … No uranium has been yet produced in Saudi Arabia” and a “supply and procurement strategy for uranium has not yet been finalised.”[8] As the richest country in the region, Saudi Arabia could become the primary financier and potentially a major customer for the output of the regional enrichment plant. Saudi Arabia has long had plans to buy a fleet of nuclear power plants.[9] United Arab Emirates.The management headquarters of the multinational consortium could be in the United Arab Emirates. The UAE also could be an early client for consortium uranium enrichment services and for fuel supply from the LEU fuel store in Saudi Arabia. The UAE’s Barakah Nuclear Energy Plant has four reactors built by South Korea between 2020 and 2024. The UAE has contracted on the international market for its fuel needs, procuring uranium concentrate from Uranium One of Russia and Australia’s Rio Tinto, and for enrichment services with Orano in France, Techsnabexport of Russia, and URENCO. The Korea Electric Power Corporation Nuclear Fuel manufactures the fuel assemblies for the reactors.[10] While ownership and operation of the consortium initially would lie in the hands of regional countries, it could keep the door open for participation by other nations in the Middle East. These might include Egypt and Turkey, each of which has four nuclear power reactors under construction by Russia.[11]It also might include countries with commercial-scale enrichment expertise—the United States, Russia, China, France, UK, Germany, and the Netherlands. Moving forward.Such a regional arrangement would need to be recognized and guaranteed by a UN Security Council resolution. It also would need approval by the US Congress to provide protection against a repeat of the experience with the Joint Comprehensive Plan of Action, which was agreed in 2015 by Iran and the United States, together with China, France, Russia, the UK, Germany, and the European Union, but disapproved by an overwhelming majority of Republicans and many Democrats in Congress and rejected by President Trump in 2018.[12]If a Republican president supports a treaty, it should be possible to achieve the two thirds majority vote in the Senate necessary for ratification. Similarly, Iran’s Parliament should also ratify such a treaty. The proposal sketched out here grows from a series of more detailed articles published between 2013 and 2025.[13]As envisioned in those articles, the regional body or a complementary organization could also be responsible for oversight of nuclear safety regulation and for verification in partnership with the IAEA, and could eventually become part of the infrastructure of a Middle East Nuclear Weapon Free Zone.[14]Through this initiative, nuclear-related sanctions against Iran could be lifted, Iran could be treated as a member in good standing of the IAEA, and Iran’s nuclear file at the UN Security Council could be closed. Editor’s note:All the authors are associated with Princeton University’s Program on Science and Global Security. Notes [1]Farnaz Fassihi, “Iran Proposes Novel Path to Nuclear Deal with U.S.”https://www.nytimes.com/2025/05/13/world/middleeast/iran-us-nuclear-talks.html. [2]David Sanger, Farnaz Fassihi, Maggie Haberman, “U.S. Sends Iran Proposal on Nuclear Deal, Amid Reports of Uranium Enrichment Ramp-Up,” New York Times, 31 May 2025,https://www.nytimes.com/2025/05/31/us/politics/iran-nuclear.html. [3]Centrifuge performance estimates are partly based on David Albright, Sarah Burkhard, and Spencer Faragasso,Updated Highlights of Comprehensive Survey of Iran’s Advanced Centrifuges, Institute for Science and International Security,Washington, DC, September 22, 2022, and are complemented with authors’ estimates. [4]Verification and monitoring in the Islamic Republic of Iran in light of United Nations Security Council resolution 2231 (2015), IAEA GOV/2025/24, 31 May 2025. [5]A separative work unit (SWU) is a measure of the amount of work that must be performed on an isotopic mixture of a given composition to produce from this feed material a specified amount of product enriched in a desired isotope (typically uranium 235) and corresponding depleted “tails.” For example, on the order of 1,000 SWU are required to produce 25 kilogram of weapon-grade uranium (90 percent uranium 235) when the feed material is pre-enriched to five percent in the isotope uranium 235. [6]Clint Williamson, URENCO USA: America’s Enrichment Plant, August 2016,https://www.nmlegis.gov/handouts/RHMC%20080216%20Item%207%20URENCO%20Status%20Report.pdf. [7]The IAEA LEU Bank: Assuring a supply of low enriched uranium (LEU) for Member States, Factsheet, International Atomic Energy Agency,https://www.iaea.org/sites/default/files/the-iaea-leu-bank.pdf [8]“Saudi Arabia” inUranium 2024: Resources, Production And Demand, Joint Report by the Nuclear Energy Agency and the International Atomic Energy Agency, NEA No. 7683, OECD 2025. [9]Edward Wong,Vivian Nereim and Kate Kelly, “Inside Saudi Arabia’s Global Push for Nuclear Power,”New York Times, April 1, 2023,https://www.nytimes.com/2023/04/01/us/politics/saudi-arabia-nuclear-biden-administration.html. Vivian Nereim, “U.S. Revives Talks With Saudi Arabia on Transfer of Nuclear Technology”New York Times, April 13, 2025,https://www.nytimes.com/2025/04/13/world/middleeast/saudi-arabia-nuclear-talks-trump.html. [10]Emirates Nuclear Energy Company, “Nuclear Fuel Assemblies for the UAE”,https://www.enec.gov.ae/discover/fueling-the-barakah-plant/nuclear-fuel-assemblies-for-the-uae/; Barakah Nuclear Power Plant, UAE,https://www.power-technology.com/projects/barakah-nuclear-power-plant-abu-dhabi. [11]IAEA, “Reactor status reports – Under Construction – By Country” ,Power Reactor Information System (PRIS) database,https://pris.iaea.org/pris/worldstatistics/underconstructionreactorsbycountry.aspx. [12]Ballotpedia, “Iran nuclear agreement: Congressional review,”https://ballotpedia.org/Iran_nuclear_agreement:_Congressional_review. [13]Frank N. von Hippel, Seyed Hossein Mousavian, Emad Kiyaei, Harold A. Feiveson and Zia Mian, “Fissile Material Controls in the Middle East: Steps Toward a Middle East Zone Free of Nuclear Weapons and All Other Weapons of Mass Destruction,” International Panel on Fissile Materials, October 2013,http://fissilematerials.org/library/rr11.pdf; Alexander Glaser, Zia Mian, Hossein Mousavian, and Frank von Hippel, “Agreeing on Limits for Iran’s Centrifuge Program: A Two-Stage Strategy,”Arms Control Today, July 2014,https://www.armscontrol.org/aca/411; Alexander Glaser, Zia Mian, Frank von Hippel, “After the Iran deal: Multinational enrichment”,Science, 19 June 2015,https://sgs.princeton.edu/sites/default/files/2020-01/glaser-mian-vonhippel-2015.pdf; Seyed Hossein Mousavian, Frank von Hippel “An alternative to the proliferation of uranium enrichment in the Middle East”,Bulletin of the Atomic Scientists, October 10, 2023,https://thebulletin.org/2023/10/an-alternative-to-the-proliferation-of-uranium-enrichment-in-the-middle-east. [14]Zia Mian, “Establishing Nuclear Weapons Obligations for a Middle East Zone Free of Nuclear Weapons and Other Weapons of Mass Destruction,”Journal for Peace and Nuclear Disarmament, 4(2), 295–308,https://doi.org/10.1080/25751654.2021.1993644; Seyed Hossein Mousavian, “Beyond Iran: a new nuclear doctrine for the Persian Gulf”Bulletin of the Atomic Scientists, May 13, 2025;https://thebulletin.org/2025/05/beyond-iran-a-new-nuclear-doctrine-for-the-persian-gulf. **Together, we make the world safer.** TheBulletinelevates expert voices above the noise. But as an independent nonprofit organization, our operations depend on the support of readers like you. Help us continue to deliver quality journalism that holds leaders accountable.Your support of our work at any level is important. In return, we promise our coverage will be understandable, influential, vigilant, solution-oriented, and fair-minded. Together we can make a difference. Keywords:Iran,United States,nuclear consortium,uranium enrichmentTopics:Analysis,Nuclear Energy,Nuclear Risk,Nuclear Weapons ShareCopy linkLinked copiedEmailFacebookBlueskyTwitterLinkedInWhatsAppReddit Copy linkLinked copied Email Facebook Bluesky Twitter LinkedIn WhatsApp Reddit Copy linkLinked copied Email Facebook Bluesky Twitter LinkedIn WhatsApp Reddit **** Δ Δ This is a good proposal. However, the authors should have mentioned that the original proposal for multinational enrichment involving Iran was proposed by then IAEA Director General in 2003-2004. And the IAEA launched a major project on multilateral approaches to the nuclear fuel cycle starting in 2005 that inspired 12 proposals including one by Germany on a multilateral enrichment sanctuary. I was the project coordinator till 2011 and three concepts were implemented: IAEA LEU Reserve in Angarsk, UK Enrichment Bond and IAEA LEU Bank. To conclude, this proposal is quite ambitious and also complex and will necessitate elaborate financial, management,…Read more » Frank N. von Hippel is a professor of Public and International Affairs emeritus, Princeton University, a co-founder of the Program on Science and...Read More Member, Science and Security BoardAlexander Glaser is an associate professor in the School of Public and International Affairs...Read More Zia Mian is a physicist and co-director of Princeton University's Program on Science and Global Security. A fellow of the American Physical Society,...Read More Ambassador (Ret.) Seyed Hossein Mousavian is a Middle East security and nuclear policy specialist at Princeton University and a former spokesman for...Read More **** **Trump’s AI gamble in the Gulf doesn’t put America first** **When Grok is wrong: The risks of AI chatbots spreading misinformation in a crisis** **Time for Congress to save American science … and the nation** **How philanthropy could help offset Trump cuts to disaster prevention and recovery** **Video: How many nuclear weapons does Russia have in 2025?** **Ukrainian attack on Russian bombers shows how cheap drones could upset global security** **RELATED POSTS** **When Grok is wrong: The risks of AI chatbots spreading misinformation in a crisis** **Time for Congress to save American science … and the nation** **Video: How many nuclear weapons does Russia have in 2025?** **Ukrainian attack on Russian bombers shows how cheap drones could upset global security** **Only irreversible changes in nuclear disarmament can lead to a world without nuclear weapons** **Tracker Update: Trump issues executive orders on nuclear power** **Receive EmailUpdates** **Recent Stories** **Trump’s AI gamble in the Gulf doesn’t put America first** BySteven Feldstein **When Grok is wrong: The risks of AI chatbots spreading misinformation in a crisis** ByKjølv Egeland **Time for Congress to save American science … and the nation** ByJohn P. Holdren,Neal Lane **How philanthropy could help offset Trump cuts to disaster prevention and recovery** ByTaylor Dimsdale **Video: How many nuclear weapons does Russia have in 2025?** ByErik English **Ukrainian attack on Russian bombers shows how cheap drones could upset global security** ByJulien de Troullioud de Lanversin **Only irreversible changes in nuclear disarmament can lead to a world without nuclear weapons** ByJoseph Rodgers,Diya Ashtakala **A nuclear consortium in the Persian Gulf as a basis for a new nuclear deal between the United States and Iran** ByFrank von Hippel,Alexander Glaser,Zia Mian,Seyed Hossein Mousavian **Don't miss an update** Doomsday Clock Doomsday Clock Statement The Clock Setters Timeline FAQ Virtual Tour Doomsday Clock Playlist Topics Nuclear Risk Climate Change Disruptive Technologies Biosecurity Nuclear Notebook What’s new at theBulletin Magazine Login Current Magazine Issue Subscribe to the Magazine My Account Magazine Archive Magazine FAQ Magazine Covers Support Our Work Ways to Give Annual Fund Annual Event Planned Gifts Donor Recognition Special Initiatives Store About Us Our Mission Leadership Staff Events Editorial Independence Policy Annual Report Pathogens Project Arts Science Initiative Next Generation Initiative Open Positions Contact Us Send us a Tip Write for Us Permissions & Copyrights Media Inquiries Support Us Advertise Email Us Stay Connected Get Our Newsletter Facebook Bluesky LinkedIn YouTube Instagram Twitter Copyright © 2025Bulletin of the Atomic Scientists. All rights reserved.Registered 501(c)(3). EIN: 36-2136497Terms of UsePrivacy Policy 1307 East 60th Street, Chicago, IL 60637 | 773.834.3779"}