{"id": 195, "name": "Capitol News Illinois", "domain": "capitolnewsillinois.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://capitolnewsillinois.com/news/despite-setbacks-gun-rights-groups-continue-push-to-overturn-illinois-assault-weapons-ban/", "title": "Despite Setbacks Gun Rights Groups Continue Push To Overturn Illinois Assault Weapons Ban", "content": "About Us Contact Us Privacy Policy Home NewsBusinessEconomyTechnologyCapitol BriefsCourtsLaw EnforcementCorruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones TrialEducationElectionsElection ResultsRESULTSVoter IssuesEnvironmentAgricultureEnergyGovernmentBudgetHealthImmigrationInfrastructure BusinessEconomyTechnology Economy Technology Capitol Briefs CourtsLaw Enforcement Law Enforcement Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Education ElectionsElection ResultsRESULTSVoter Issues Election ResultsRESULTS Voter Issues EnvironmentAgricultureEnergy Agriculture Energy GovernmentBudgetHealthImmigrationInfrastructure Budget Health Immigration Infrastructure BusinessEconomyTechnology Economy Technology Economy Technology Capitol Briefs CourtsLaw Enforcement Law Enforcement Law Enforcement Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Education ElectionsElection ResultsRESULTSVoter Issues Election ResultsRESULTS Voter Issues Election ResultsRESULTS Voter Issues EnvironmentAgricultureEnergy Agriculture Energy Agriculture Energy GovernmentBudgetHealthImmigrationInfrastructure Budget Health Immigration Infrastructure Budget Health Immigration Infrastructure InvestigationsPolice HiringNo SchoolersFuneral HomeCulture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty ProgramsPodcastsIllinois Lawmakers Podcasts Illinois Lawmakers Podcasts Illinois Lawmakers About UsThe News TeamEventsCareersSubscribePrivacy PolicyTerms of Use The News Team Events Careers Subscribe Privacy Policy Terms of Use The News Team Events Careers Subscribe Privacy Policy Terms of Use Media CenterPressroomEditorial IndependenceConflicts of InterestCode of EthicsSubmit a News TipContact Us Pressroom Editorial Independence Conflicts of Interest Code of Ethics Submit a News Tip Contact Us Pressroom Editorial Independence Conflicts of Interest Code of Ethics Submit a News Tip Contact Us Support UsSupportOur Donors Support Our Donors Support Our Donors Home NewsBusinessEconomyTechnologyCapitol BriefsCourtsLaw EnforcementCorruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones TrialEducationElectionsElection ResultsRESULTSVoter IssuesEnvironmentAgricultureEnergyGovernmentBudgetHealthImmigrationInfrastructure BusinessEconomyTechnology Economy Technology Capitol Briefs CourtsLaw Enforcement Law Enforcement Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Education ElectionsElection ResultsRESULTSVoter Issues Election ResultsRESULTS Voter Issues EnvironmentAgricultureEnergy Agriculture Energy GovernmentBudgetHealthImmigrationInfrastructure Budget Health Immigration Infrastructure BusinessEconomyTechnology Economy Technology Economy Technology Capitol Briefs CourtsLaw Enforcement Law Enforcement Law Enforcement Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Sam McCann Trial Emil Jones Trial Education ElectionsElection ResultsRESULTSVoter Issues Election ResultsRESULTS Voter Issues Election ResultsRESULTS Voter Issues EnvironmentAgricultureEnergy Agriculture Energy Agriculture Energy GovernmentBudgetHealthImmigrationInfrastructure Budget Health Immigration Infrastructure Budget Health Immigration Infrastructure InvestigationsPolice HiringNo SchoolersFuneral HomeCulture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty ProgramsPodcastsIllinois Lawmakers Podcasts Illinois Lawmakers Podcasts Illinois Lawmakers About UsThe News TeamEventsCareersSubscribePrivacy PolicyTerms of Use The News Team Events Careers Subscribe Privacy Policy Terms of Use The News Team Events Careers Subscribe Privacy Policy Terms of Use Media CenterPressroomEditorial IndependenceConflicts of InterestCode of EthicsSubmit a News TipContact Us Pressroom Editorial Independence Conflicts of Interest Code of Ethics Submit a News Tip Contact Us Pressroom Editorial Independence Conflicts of Interest Code of Ethics Submit a News Tip Contact Us Support UsSupportOur Donors Support Our Donors Support Our Donors **Despite setbacks, gun rights groups continue push to overturn Illinois assault weapons ban** **7th Circuit prepares to hear another appeal** Challenges to Illinois’ assault-style weapons ban continue to make their way through federal courts. (Capitol News Illinois photo by Andrew Campbell) Challenges to Illinois’ assault-style weapons ban continue to make their way through federal courts. (Capitol News Illinois photo by Andrew Campbell) Gun rights advocates once again are asking a federal appeals court in Chicago to overturn Illinois’ ban on assault-style firearms and large-capacity magazines in a case that may be destined for the U.S. Supreme Court. In briefs filed Friday with the 7thCircuit Court of Appeals, attorneys representing plaintiffs challenging the law urged the court to uphold thedecision of a lower court judge in East St. Louiswho said the law violates the Second Amendment because it bans weapons that are commonly used for lawful purposes like self-defense. **RelatedPosts** **Feds to retry Sen. Emil Jones after mistrial on bribery, lying to FBI charges** **Amid court battle, lawmakers look to push back ‘swipe fees’ ban** Illinois Attorney General Kwame Raoul’s office is appealing that decision, arguing that the weapons banned under the law such as the AK-47, AR-15 and other similar firearms are primarily military in nature and therefore are not protected by the Second Amendment. The state has until June 27 to file a response to the gun industry’s brief. The court is then expected to set a date for oral arguments, possibly later this year. The 7thCircuit has already been asked multiple times to block enforcement of the law while legal challenges made their way through the courts, and each time it has refused to do so. Most notably, in November 2023, the courtrefused to issue a preliminary injunctionto block enforcement of the state law along with local bans in Naperville and Cook County. Months later, the U.S. Supreme Court later declined to review that decision, thus sending those challenges back to district courts for trial. So far, the only cases that have gone to trial were a set of consolidated lawsuits in the Southern District of Illinois, where Judge Stephen McGlynn heard four days of testimony in September 2024 before ruling against the ban. His decision was ultimately put on hold as the case made its way to the 7thCircuit Court of Appeals. Two other sets of cases are still pending in the Northern District of Illinois in Chicago. **Other legal challenges** The cases now before the 7thCircuit are among several that have been making their way through the federal court system in recent years as states and local jurisdictions have enacted laws to restrict the availability of the type of weapons that have been used in mass shootings around the country. The Illinois law, known as the Protect Illinois Communities Act, or PICA, was enacted in 2023 following a mass shooting the previous summer at a Fourth of July parade in Highland Park that left seven people dead and dozens more injured. So far, federal appellate courts have been consistent in upholding the bans and the U.S. Supreme Court not yet stepped in to review any of those decisions. Most recently, on June 2, the Supreme Court declined to hear cases challenging Maryland’s ban on assault weapons and Rhode Island’s ban on large-capacity magazines. Maryland enacted its law in 2013in response to a mass shootingthe year before at Sandy Hook Elementary School in Connecticut. Rhode Island’s law was enacted in 2022,three weeks afteranother mass shooting at an elementary school in Uvalde, Texas. Four votes are needed for the Supreme Court to agree to take a case, but only three indicated they were willing to hear the Maryland case – Neil Gorsuch, Samuel Alito and Clarence Thomas, who wrote adissenting opinionsuggesting he believed the Maryland law is unconstitutional and that the court needs to take up the matter. But a fourth justice, Brett Kavanaugh, wrote separately to say he, too, questioned whether the Maryland law was constitutional but that the issue was not yet ripe for review. “Opinions from other Courts of Appeals should assist this Court’s ultimate decisionmaking on the AR–15 issue,” Kavanaugh wrote. “Additional petitions for certiorari will likely be before this Court shortly and, in my view, this Court should and presumably will address the AR–15 issue soon, in the next Term or two.” The court’s refusal to hear that appeal meant that a4thCircuit Court of Appeals decisionupholding Maryland’s law and a1stCircuit decisionrefusing to block Rhode Island’s law remain in place. Meanwhile, on the same day the Supreme Court declined to hear those cases, the 7thCircuit declined to reverse its own position on assault weapon bans when it rejected another challenge to Cook County’s local ordinance. “Each court of appeals that has taken up a challenge to a ban on assault weapons and high-capacity magazines has found these laws to be constitutional,” the Gun Violence Prevention PAC of Illinois, or G-PAC, said in a statement after the Supreme Court’s announcements. “These are lethal weapons designed for military purpose, not for self-defense.” But the decisions angered one of the gun rights legal advocacy groups that has helped spearhead many of the legal challenges around the country, theFirearms Policy Coalition. “Like millions of peaceable gun owners across the country, we are frustrated that the Court continues to allow lower courts to treat the Second Amendment as a second-class right,” the organization said in a statement. “But more than anything else, we are more resolved than ever to Fight Forward and eliminate these immoral bans throughout the nation, whatever and however long it takes.” **The arguments** Both sides have tailored their arguments around the standard that the Supreme Court laid out in its 2022 decision,New York State Rifle & Pistol Association v. Bruen, which was handed down less than two weeks before the Highland Park shooting that prompted passage of the Illinois ban. In that case, the court said the Second Amendment protects the right to keep and bear many types of arms for lawful purposes such as self-defense and that any restriction of that right must be “consistent with this Nation’s historical tradition of firearm regulation.” In its initial brief, the state argues that the weapons banned in Illinois are not “arms” protected under the Second Amendment but, rather, weapons more suitable for military purposes than for civilian self-defense. “The evidence showed that the regulated items are offensive, militaristic instruments that are not commonly used for individual self-defense, which is the “core” lawful purpose protected by the Second Amendment,” the state argues. Plaintiffs, by contrast, argue that the weapons banned under the law are not militaristic in nature but are, in fact, “many of the most popular self-defense weapons in America.” They argue that Judge McGlynn ruled correctly in finding them covered by the Second Amendment and that the 7thCircuit should uphold that ruling. Capitol News Illinoisis a nonprofit, nonpartisan news service that distributes state government coverage to hundreds of news outlets statewide. It is funded primarily by the Illinois Press Foundation and the Robert R. McCormick Foundation. **Peter Hancock** Peter was one of the founding reporters with Capitol News Illinois. He came to Springfield after many years working in Topeka, Kansas, where he covered the Kansas statehouse and other beats. He began his reporting career in 1989 at a small county weekly newspaper and has worked in a variety of settings including both daily and nondaily newspapers, online media and public radio. A native of the Kansas City area, he has degrees in political science and education from the University of Kansas. Republish This Story Republish our articles for free, online or in print, under a Creative Commons license. **Republish this article** This work is licensed under aCreative Commons Attribution-NoDerivatives 4.0 International License. **Despite setbacks, gun rights groups continue push to overturn Illinois assault weapons ban** by Peter Hancock, Capitol News IllinoisJune 10, 2025 About Us Contact Us Media Center Privacy Policy Terms of Use Capitol News Illinois is a nonprofit, nonpartisan news service covering state government. A service of the Illinois Press Foundation. More news from the Illinois Statehouse delivered to your inbox each Wednesday and Saturday. © 2025 Capitol News Illinois **Welcome Back!** Login to your account below Remember Me **Retrieve your password** Please enter your username or email address to reset your password. Home NewsBudgetCapitol BriefsCorruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewMadigan TrialSam McCann TrialEmil Jones TrialCourtsEducationGovernmentHealthLaw Enforcement Budget Capitol Briefs Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewMadigan TrialSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Madigan Trial Sam McCann Trial Emil Jones Trial Courts Education Government Health Law Enforcement Budget Capitol Briefs Corruption CasesMichael Madigan: The Rise and FallMadigan Trial in ReviewMadigan TrialSam McCann TrialEmil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Madigan Trial Sam McCann Trial Emil Jones Trial Michael Madigan: The Rise and Fall Madigan Trial in Review Madigan Trial Sam McCann Trial Emil Jones Trial Courts Education Government Health Law Enforcement InvestigationsPolice HiringNo SchoolersFuneral HomeCulture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty Police Hiring No Schoolers Funeral Home Culture of Cruelty ProgramsIllinois LawmakersPodcasts Illinois Lawmakers Podcasts Illinois Lawmakers Podcasts About Media Support © 2025 Capitol News Illinois"}