{"id": 1344, "name": "The American Interest", "domain": "the-american-interest.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.the-american-interest.com/2020/09/04/getting-a-grip-on-global-financial-infrastructure/", "title": "Getting A Grip On Global Financial Infrastructure", "content": "To fight kleptocracy, it’s time to make the privately-run plumbing of the global financial system more accountable to international institutions. When President Trump defied the international community and left the Iran nuclear deal in 2018, he had an unlikely partner: the Society for Worldwide Interbank Financial Telecommunication (SWIFT). The Belgian SWIFT provides the payments-messaging services that, in the words of Federal Reserve ChairmanBen Bernanke, are “part of almost every international money transfer.” So when SWIFT decided to ban certain Iranian banks from its services—over the protests of European governments—it packed a major punch to Tehran’s economy. Today, privately-controlled financial nodes like SWIFT are regular partners of U.S. foreign policy. This may soon change. As Washington focuses more on transnational economic threats like kleptocracy and tax evasion, infrastructure providers may consider their economic self-interest before eagerly cooperating. Public-private partnerships are a shaky foundation for U.S. foreign policy, and the United States should not let private actors control the plumbing of the international economy. Instead, it should seek global cooperation to create a better system. SWIFT is just one of the services that make up the international economy’s plumbing. To make metals trading easier, there is the London Metal Exchange (LME) that enables futures trading and licenses warehouses around the world. To ensure the smooth payment and tracking of securities, there are Clearstream and Euroclear. To make investing in emerging markets easier, J.P. Morgan created the Emerging Market Bond Index which brings together securities across a wide swath of countries. And the London Inter-bank Offering Rate (LIBOR), a changing interest rate based on a survey of bank employees, is calculated to ensure adjustable interest rates that mirror market conditions. These “infrastructures” started as ways to make commerce easier, then became central to the functioning of global finance, and now are key components of U.S. power. The SWIFT threat is one of the strongest weapons in the U.S. economic arsenal. Even major players likeRussiaandChinahave come to fear a cut-off. But SWIFT is not alone. The LMEmagnifiedthe effect of U.S. sanctions against Russian aluminum producer Rusal by suspending the company from its exchanges. Clearstream has blockedIranianandRussianassets, and J.P. Morganzeroed outVenezuela in its bond index, restricting capital flows to the country. While these infrastructures do further U.S. foreign policy, they further a limited vision of it: one where Washington enforces norms and goals against specific countries. But U.S. foreign policy is changing. During his campaign, Vice President Biden has promised a “foreign policy for the middle class,” one that unites foreign and domestic goals, that combines economic and security goals, and that targets tax havens and corruption as “drivers of inequality.” This would mean taking on a world where8 percentof global household wealth hides in tax havens. International financial infrastructures should be great partners in tackling these transnational problems. What better way to monitor and check international flows of money between shady jurisdictions than networks like SWIFT or ClearStream that make these flows possible? The NGO Tax Justice Network has called for “SWIFT statistics for all” to track financial flows and tax evasion, and Georgetown Professor Stefan Eich has argued SWIFT contains an “an untapped utopian promise” of “global monetary and financial regulation” due to the fact that all financial transactions need to flow through it. However, past cracks in U.S. cooperation with infrastructures suggest that leveraging these privately-controlled choke points might not be so easy. First, these nodes did not help Washington out of altruism. It took years of fines and enforcement by the United States to ensure cooperation. Clearstream paid$152 millionin fines over allegations that it held $2.8 billion in securities for the Central Bank of Iran. The board of SWIFT is made up of representatives for the world’s largest financial institutions, so it faced two layers of threats: enforcement against the board-member banks and against the company itself. This danger presented itself in 2018, when Iran hawksoutlined the optionof sanctioning member banks if SWIFT did not ban the Iranian banks. Even more pressure will be necessary in the future. Faced with these legal costs and compliance headaches, the infrastructures limited their risk by cutting off Iran. The countries that enable tax evasion, though, are far more plugged into the global financial system. It will be harder for enforcement actions to convince infrastructures to cut off or pressure these countries or banks. Prosecutors’ nerve may fail before taking on major European jurisdictions, and U.S. policymakers may choose transatlantic conciliation over more friction regarding tax enforcement. Plus, it will be harder to count on the self-interest of the private sector: their financial interests will be far more at stake with tax havens compared to Iran. Furthermore, successful coercion by the U.S. might not ensure consistent cooperation from these infrastructures. In the past, they have gone along with U.S. requests while also furthering other competing agendas. British banking giantHSBChas frozen the account of a Hong Kong pro-democracy activist and has come under fire, along with British bank Standard Chartered, for backing the region’s controversial national security law. These banks have acted even as U.S. sanctions forced financial services firms tocut tieswith pro-mainland Hong Kong government figures. In one extreme case these infrastructures enabled non-state actors to assert themselves over sovereign governments. Bond servicing infrastructures enabled hedge funds to enforce their will over the government of Argentina. Facing a court order, Buenos Aires discovered that it could not pay all other bondholders through the traditional payment infrastructures as long as it refused to pay the hedge funds. Privately-controlled infrastructures’ cooperation with competing agendas could harm U.S. anti-kleptocracy and anti-evasion goals. Countries that currently benefit from tax evasion and the unfair financial architecture of the global economy, whether by offering exceedingly low tax rates or allowing owners of ill-gotten wealth to shield their identities, would fight these U.S. measures and try to sway the infrastructure providers. In the past, countries have protested, refused to cooperate, and (often rightly so) complained about U.S. hypocrisy. In 2014, the United Kingdom opposed Russia sanctions that would haveharmed its financial sectorand spearheaded efforts tobuild a relationshipwith Chinese finance. Still, in most of these cases, U.S. threats have convinced recalcitrant countries. A transnational anti-evasion and anti-kleptocracy campaign would run into a new problem as well. The success of such an effort would depend on its ability to sway the private sector—giving added influence to the same entities it is trying to coerce. While a SWIFT board member or a securities processor is agnostic about Iran policy, as long as it does not have economic interests in play, it will have strong thoughts about continuing to serve the world’s wealthiest citizens—and in keeping its own tax rate low. This will make it more appealing for these infrastructures to form coalitions with like-minded countries bent on protecting their privileges in today’s unfair global financial system. Finally, these privately-run infrastructures can be outright corrupt, so even if they were to cooperate they would be unsteady partners. TheLIBOR scandalmakes this danger clearest. The LIBOR is a number that is central to the functioning of global credit markets. Lenders adjust the rates they offer borrowers based on LIBOR. According to theNew York Federal Reserve Board, there are about $1.3 trillion in consumer loans and $5.2 trillion in corporate loans and bonds based on LIBOR. The number, soon to be shelved in light of its legal problems, shifts daily based on surveys of bankers. Following a major investigation, the U.S. Department of Justice and the U.S. Commodity Futures Trading Commission found that traders were cooperating to game these surveys. They would adjust their responses in order to make money on their positions. In the process, they shaped the cost of borrowing for borrowers all over the world. The LIBOR case highlights the underlying peculiarity of the infrastructures: though they are faceless and globally influential, they are usually made up of just a few players who can tilt the playing field. The incentive to tilt the field toward the private sector would be even more pronounced in this new foreign policy context. Washington should not fight kleptocracy and tax evasion on such an unstable foundation. It should not rely on private partners that require constant coercion, that work with countries and private interests with competing agendas, and that allow corruption. Instead, Washington should ensure supranational control of these infrastructures so that they respond to the goals and wishes of the international community. Turning the infrastructures of global finance into international organizations will have its costs. Today, sanctions often allow Washington to gets what it wants quickly and unilaterally, avoiding the diplomatic headaches that come with multi-lateral decision making. And indeed, making bond-servicing or payment processing plumbing the joint responsibility of international governments might entail more of the gridlock and international squabbling associated with the United Nations and other international organizations. Still, this would be a far-sighted plan for the United States. States should not delegate key nodes of the global economy to private actors with their own agendas, particularly as they undermine states’ goals. As the undercutting of pro-democracy activists in Hong Kong suggests, private organizations can be untrustworthy partners. As the power-politics of the global financial system evolve, the United States might lose its uncontested influence as infrastructures hedge their bets by appeasing other countries. International control would therefore bring realipolitik as well as moral benefits. As long as states are in charge, Washington will have a seat at the table. From this seat, it will be able to carry out a far-reaching and innovative foreign policy aimed at righting an unfair financial system. Internationally-controlled financial infrastructures will ensure that it is public goals, not private interests, that set the agenda. tweet facebook google+ email print"}