{"id": 1039, "name": "New Ulm Journal", "domain": "nujournal.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nujournal.com/news/national-news-apwire/2025/06/11/us-rep-monica-mciver-indicted-on-federal-charges-from-skirmish-at-nj-immigration-center/", "title": "Us Rep Monica Mciver Indicted On Federal Charges From Skirmish At Nj Immigration Center", "content": "NewsLocal NewsCommunitiesNew UlmMonday BusinessMailbagPolice LogsCourt News and TicketsAgribusinessMN State NewsNational NewsInternational NewsPublic RecordsLegals Local News Communities New Ulm Monday Business Mailbag Police Logs Court News and Tickets Agribusiness MN State News National News International News Public Records Legals Local News Communities New Ulm Monday Business Mailbag Police Logs Court News and Tickets Agribusiness MN State News National News International News Public Records Legals SportsLocal SportsMN State SportsNational Sports Local Sports MN State Sports National Sports Local Sports MN State Sports National Sports OpinionColumnsEditorialsLetters Columns Editorials Letters Columns Editorials Letters LifeLifestyle ColumnsLifestyle FeatureEngagementsFood Lifestyle Columns Lifestyle Feature Engagements Food Lifestyle Columns Lifestyle Feature Engagements Food CORONAVIRUS Obituaries Classifieds Jobs Garage Sales New Ulm Community Guide Public NoticesBrowse NoticesPlace Notice Browse Notices Place Notice Browse Notices Place Notice Contact InformationContact UsSubmit NewsSubscribeAdvertiseOpen RoutesStatement of ValuesTerms of Service Contact Us Submit News Subscribe Advertise Open Routes Statement of Values Terms of Service Contact Us Submit News Subscribe Advertise Open Routes Statement of Values Terms of Service News Sports Opinion Life Obituaries Classifieds Jobs Garage Sales Place Notice SUBSCRIBE SUBSCRIBE June 11, 2025 | Today's Paper | Submit News | Subscribe Today Today's Paper | Subscribe Today **US Rep. Monica McIver indicted on federal charges from skirmish at NJ immigration center** **** Jun 11, 2025 TRENTON, N.J — U.S. Rep. LaMonica McIver was indicted Tuesday on federal charges alleging she impeded and interfered with immigration officers outside a New Jersey detention center while Newark’s mayor was being arrested after he tried to join a congressional oversight visit at the facility. Acting U.S. Attorney for New Jersey Alina Habba announced the grand jury indictment in a post on X. “While people are free to express their views for or against particular policies, they must not do so in a manner that endangers law enforcement and the communities those officers serve,” Habba said. McIver, a Democrat, had been charged in a complaint by Habba last month with two assault charges stemming from the May 9 visit to Newark’s Delaney Hall — a 1,000-bed, privately owned facility that Immigration and Customs Enforcement uses as a detention center. McIver disputed the allegations as baseless and defended her presence at the facility as part of her authorized role as a member of Congress. Her lawyer, former U.S. Attorney for New Jersey Paul Fishman, said in a statement that they would challenge the allegations “head-on” in court. “The legal process will expose this prosecution for what it truly is — political retaliation against a dedicated public servant who refuses to shy away from her oversight responsibilities,” Fishman said. Habba said two of the counts carry a maximum sentence of up to eight years in prison. A third has a maximum sentence of one year. She characterized the charges as “forcibly impeding and interfering with federal law enforcement officers.” The indictment is the latest development in a legal-political drama that has seen President Donald Trump’s administration take Democratic officials from New Jersey’s largest city to court, tapping into the president’s immigration crackdown and Democrats’ efforts to respond. The prosecution of McIver is a rare federal criminal case against a sitting member of Congress for allegations other than fraud or corruption. At the same visit that resulted in McIver’s charges, Newark Mayor Ras Baraka was arrested on a trespassing charge, which was later dropped. Baraka is suing Habba over what he said was a malicious prosecution. A nearly two-minute clip released by the Homeland Security Department shows McIver on the facility side of a chain-link fence just before the arrest of the mayor on the street side of the fence, where other people had been protesting. She and uniformed officials go through the gate, and she joins others shouting that they should circle the mayor. The video shows McIver in a tightly packed group of people and officers. At one point, her left elbow and then her right elbow push into an officer wearing a dark face covering and an olive green uniform emblazoned with the word “Police” on it. It isn’t clear from police bodycam video whether that contact was intentional, incidental or a result of jostling in the chaotic scene. The complaint says she “slammed” her forearm into an agent then tried to restrain the agent by grabbing him. New Jersey Reps. Bonnie Watson Coleman and Rob Menendez had joined McIver at the detention center that day. They and Democrats have criticized the arrest and disputed the charges as well. By law, members of Congress are authorized to go into federal immigration facilities as part of their oversight powers, even without notice. Congress passed a 2019 appropriations bill that spelled out the authority. **Newsletter** **National News** **National News** **US stocks drift closer to their record as Wall Street waits to see what US-China talks will bear** **US stocks drift closer to their record as Wall Street waits to see what US-China talks will bear** NEW YORK — U.S. stocks drifted closer to their all-time high on Tuesday as the wait continued to hear what ... **Trump’s tax bill could raise taxes on foreign companies, hurting investment from abroad** **Trump’s tax bill could raise taxes on foreign companies, hurting investment from abroad** WASHINGTON — President Donald Trump likes to say he’s bringing in trillions of dollars in investments from ... **National** **National** Federal immigration raid at Omaha food production plant sparks protests OMAHA, Neb. (AP) — Immigration ... **US Rep. Monica McIver indicted on federal charges from skirmish at NJ immigration center** **US Rep. Monica McIver indicted on federal charges from skirmish at NJ immigration center** TRENTON, N.J — U.S. Rep. LaMonica McIver was indicted Tuesday on federal charges alleging she impeded and ... **Newsom asks court to block Trump administration from using troops in immigration raids** **Newsom asks court to block Trump administration from using troops in immigration raids** LOS ANGELES — California Gov. Gavin Newsom filed an emergency request in federal court Tuesday to block the Trump ... **People in the News** **People in the News** Hegseth faces sharp questions from Congress on deploying troops to LA and Pentagon spending WASHINGTON (AP) — ... MOST READ **US Rep. Monica McIver indicted on federal charges from skirmish at NJ immigration center** **US Rep. Monica McIver indicted on federal charges from skirmish at NJ immigration center** **Johnson ‘furious’ about ‘big, beautiful bill’** **Johnson ‘furious’ about ‘big, beautiful bill’** **Four from New Ulm attend American Legion Boy’s State** **Four from New Ulm attend American Legion Boy’s State** **New Ulm Jr. Legion Gold battles back to top Sleepy Eye** **New Ulm Jr. Legion Gold battles back to top Sleepy Eye** **Sibley East’s McCue, LCWM/N’s Freyberg earn medals at state** **Sibley East’s McCue, LCWM/N’s Freyberg earn medals at state** **US stocks drift closer to their record as Wall Street waits to see what US-China talks will bear** **US stocks drift closer to their record as Wall Street waits to see what US-China talks will bear** **Newsletter** **Starting at $4.50/week.** **Subscribe Today** **Subscribe Today** NewsLocal NewsCommunitiesMonday BusinessObituaries Local News Communities Monday Business Obituaries Local News Communities Monday Business Obituaries SportsLocal SportsMN State SportsNational Sports Local Sports MN State Sports National Sports Local Sports MN State Sports National Sports OpinionColumnsEditorialsLetters Columns Editorials Letters Columns Editorials Letters LifeLifestyle ColumnsLifestyle FeatureEngagements Lifestyle Columns Lifestyle Feature Engagements Lifestyle Columns Lifestyle Feature Engagements ContactSubmit NewsAdvertiseContact Us Submit News Advertise Contact Us Submit News Advertise Contact Us Copyright © 2025 Ogden Newspapers of Minnesota, Inc. | https://www.nujournal.com | 303 N. Minnesota St., New Ulm, MN 56073 | 507-359-2911"}