{"id": 1898, "name": "Brownstone Institute", "domain": "brownstone.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://brownstone.org/event/brownstone-greater-boston-supper-club-july-1-2025-selena-fitanides/#tribe-tickets__tickets-form", "title": "Brownstone Greater Boston Supper Club July 1 2025 Selena Fitanides", "content": "Home AboutREPPARESocial MediaContributing AuthorsContact REPPARE Social Media Contributing Authors Contact REPPARE Social Media Contributing Authors Contact EventsReclaim Your IndependenceUpcoming EventsPast ConferencesMonthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar JournalBrownstone JournalBrownstone Journal: Most PopularBrownstone EspañaSearch BrownstonePublic HealthEconomicsGovernmentCensorshipSocietyTechnologyPhilosophyEducationHistoryPolicyLawMediaMasksVaccinesPharmaVideo/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Books Subscribe DonateDonate to BrownstoneDonate CryptocurrencyDonate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock ShopBrownstone MerchandiseBooksAccessoriesClothingCartCheckout Brownstone Merchandise Books Accessories Clothing Cart Checkout Brownstone Merchandise Books Accessories Clothing Cart Checkout Home AboutREPPARESocial MediaContributing AuthorsContact REPPARE Social Media Contributing Authors Contact REPPARE Social Media Contributing Authors Contact EventsReclaim Your IndependenceUpcoming EventsPast ConferencesMonthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar JournalBrownstone JournalBrownstone Journal: Most PopularBrownstone EspañaSearch BrownstonePublic HealthEconomicsGovernmentCensorshipSocietyTechnologyPhilosophyEducationHistoryPolicyLawMediaMasksVaccinesPharmaVideo/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Books Subscribe DonateDonate to BrownstoneDonate CryptocurrencyDonate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock ShopBrownstone MerchandiseBooksAccessoriesClothingCartCheckout Brownstone Merchandise Books Accessories Clothing Cart Checkout Brownstone Merchandise Books Accessories Clothing Cart Checkout Home AboutREPPARESocial MediaContributing AuthorsContact REPPARE Social Media Contributing Authors Contact REPPARE Social Media Contributing Authors Contact EventsReclaim Your IndependenceUpcoming EventsPast ConferencesMonthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar Reclaim Your Independence Upcoming Events Past Conferences Monthly Calendar JournalBrownstone JournalBrownstone Journal: Most PopularBrownstone EspañaSearch BrownstonePublic HealthEconomicsGovernmentCensorshipSocietyTechnologyPhilosophyEducationHistoryPolicyLawMediaMasksVaccinesPharmaVideo/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Brownstone Journal Brownstone Journal: Most Popular Brownstone España Search Brownstone Public Health Economics Government Censorship Society Technology Philosophy Education History Policy Law Media Masks Vaccines Pharma Video/Podcast Books Subscribe DonateDonate to BrownstoneDonate CryptocurrencyDonate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock Donate to Brownstone Donate Cryptocurrency Donate Wire and Stock ShopBrownstone MerchandiseBooksAccessoriesClothingCartCheckout Brownstone Merchandise Books Accessories Clothing Cart Checkout Brownstone Merchandise Books Accessories Clothing Cart Checkout **Brownstone Institute Events** « All Events **Brownstone Greater Boston Supper Club, July 1, 2025: Selena Fitanides** **July 1 @ 5:30 pm-8:30 pm** «Brownstone Supper Club, West Hartford, June 25, 2025: Jan Jekielek 2025 Polyface Retreat» Tuesday, July 1st, 5:30pm – 8:30pm$50 Tremezzo Ristorante,2 Lowell St, Wilmington, MA, United States Please join Brownstone Institute friends and supporters for an evening of lively conversation, intriguing speakers, and fun! This month we are pleased to welcome Selena Fitanides. About Selena FitanidesSelena is a Massachusetts-based, constitutional rights attorney focused on free speech, religious freedom, and due process rights. She has represented vaccine mandate protestors who faced criminal charges for exercising their free speech rights. Earlier in her career, she worked at the ACLU, at large law firms, and was a lecturer at BU Law School. In 2024, Selena served as the Volunteer Coordinator for the Kennedy campaign in Massachusetts. About the Talk:Unconstitutional Information Control during the COVID Operation. Selena will put into historical context her clients’ experiences battling censorship and propaganda during the COVID Operation, and will open up a discussion about what the government hoped to gain by its unconstitutional efforts to suppress and shape political speech. VenueTremezzo is a friendly, relaxed Italian eatery. We’ll enjoy appetizers, salad, all you can eat Neapolitan brick oven pizza (considered a healthier pizza!), including vegetarian, vegan, and gluten-free (cauliflower crust) options, and wine. Location & Parking2 Lowell St, Wilmington, MA 01887. Parking is free in the lot outside the restaurant. Free overflow parking is available across the street, at Colonial Park Plaza, which is next to the gas station. Registration$50 per person. Space is limited so secure you seat early! Registration closes @ midnight Sunday, June 29th. Please note: registration will be checked at the door. Where to StaySeveral hotels starting as low as $79 a night are located within a 4 mile radius of Tremezzo. For more information contact Brianne atBrianneKrupsaw@gmail.comPlease include “July supper club” in the subject line. Google Calendar iCalendar Outlook 365 Outlook Live **Details** **Organizers** **Venue** **Tickets** «Brownstone Supper Club, West Hartford, June 25, 2025: Jan Jekielek 2025 Polyface Retreat» Home About Events Journal Books Subscribe Donate Shop **follow brownstone** Brownstone Institute is a 501(c)(3) Nonprofit registered in the US under EIN: 87-1368060 BROWNSTONE INSTITUTE2028 E BEN WHITE BLVD, #240-3088AUSTIN, TX 78741+1-469-842-8976—WEST HARTFORD, CT Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Dissident Web Design, Development, and Hosting byShyfrog Media **Sign up for the FreeBrownstone Journal Newsletter**"}