{"id": 137, "name": "BioSpace", "domain": "biospace.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.biospace.com/drug-development/beyond-the-breakthrough-industry-leaders-address-key-hurdles-facing-cell-and-gene-therapies", "title": "Beyond The Breakthrough Industry Leaders Address Key Hurdles Facing Cell And Gene Therapies", "content": "NewsDrug DevelopmentFDAManufacturingDealsBusinessJob TrendsCell and Gene TherapyCancerOpinionsPress ReleasesAll News & Releases Drug Development FDA Manufacturing Deals Business Job Trends Cell and Gene Therapy Cancer Opinions Press Releases All News & Releases Drug Development FDA Manufacturing Deals Business Job Trends Cell and Gene Therapy Cancer Opinions Press Releases All News & Releases Podcasts Events Jobs Companies Hotbeds MoreReportsCareer AdviceNextGen: Top Startups to Watch40 Under 40Best Places to WorkEmployer Resources Reports Career Advice NextGen: Top Startups to Watch 40 Under 40 Best Places to Work Employer Resources Reports Career Advice NextGen: Top Startups to Watch 40 Under 40 Best Places to Work Employer Resources AdvertisePost JobsTalent SolutionsAdvertiseSubmit a Press Release Post Jobs Talent Solutions Advertise Submit a Press Release Post Jobs Talent Solutions Advertise Submit a Press Release NewsDrug DevelopmentFDAManufacturingDealsBusinessJob TrendsCell and Gene TherapyCancerOpinionsPress ReleasesAll News & Releases Drug Development FDA Manufacturing Deals Business Job Trends Cell and Gene Therapy Cancer Opinions Press Releases All News & Releases Drug Development FDA Manufacturing Deals Business Job Trends Cell and Gene Therapy Cancer Opinions Press Releases All News & Releases Podcasts Events Jobs Companies Hotbeds MoreReportsCareer AdviceNextGen: Top Startups to Watch40 Under 40Best Places to WorkEmployer Resources Reports Career Advice NextGen: Top Startups to Watch 40 Under 40 Best Places to Work Employer Resources Reports Career Advice NextGen: Top Startups to Watch 40 Under 40 Best Places to Work Employer Resources AdvertisePost JobsTalent SolutionsAdvertiseSubmit a Press Release Post Jobs Talent Solutions Advertise Submit a Press Release Post Jobs Talent Solutions Advertise Submit a Press Release **Beyond the Breakthrough: Industry Leaders Address Key Hurdles Facing Cell and Gene Therapies** Twitter LinkedIn Facebook Email Print Genetically engineered chimeric antigen receptor immune cell with implanted mrna gene strand - 3d illustration Christoph Burgstedt/Getty Images **At the GenScript Biotech Global Forum 2025, industry leaders celebrated CAR T cell therapy achievements while discussing ongoing challenges in manufacturing, distribution, treatment center capacity, and global payment structures for cell and gene therapies.** FDA approval for chimeric antigen receptor (CAR) T cell therapy occurred 30 years after the initial research began. Prior to the approval, the first successful treatment using CAR T cells was in 2010 for a retired Marine with chronic leukemia. Two years later, Emily Whitehead became the first child treated and cured. Key industry leaders came together to celebrate these and other CAR T cell achievements as well as discuss the therapy’s future at the2025 GenScript Biotech Global Forum. As one of the keynote speakers,Carl June, MD, professor and director of the Center for Cellular Immunotherapies at the University of Pennsylvania’s Perelman School of Medicine highlighted, “Since the first approval, approximately 50,000 patients have been treated with CAR T cells worldwide, primarily for blood cancers.” June stated that 2024 was a breakthrough year for cell and gene therapies (CGTs). He emphasized that CAR T cell therapies have made remarkable breakthroughs in glioblastoma treatments and early-stage treatments for autoimmune diseases.Alan Bash, president of Legend Biotech, seconded this opinion in a panel discussion following June’s remarks. Carl June, MD delivers one of the keynote speeches at the GenScript Biotech Global Forum 2025 “The products are delivering, and the products are demonstrating the innovation for patients,” Bash said. **CGT Therapy Hurdles** Discussions throughout the event focused on manufacturing, distribution and payer challenges. However, before diving into those insights,Michael Vreeland, US site head at ProBio, stressed an important element that is frequently left out, which is talent. “One of the things that’s often overlooked is the training piece, right?” Vreeland said. “How do we ensure consistent and repeatable training and execution?” As this article dives into the other challenges, it is worth remembering that talent and experience are two pieces that will influence how the CGT space overcomes current and future hurdles. Bash explained that the innovation continues “despite market and technological challenges.” However, he emphasized that the challenges are significant, noting that while regulatory hurdles have fallen, manufacturing and distribution still remain significant obstacles for the space. Rey Mali, chief business officer at Accellix, agreed that improvement is greatly needed in this area to influence both cost and access of CGTs. “Now, it’s about scale,” she said. “Now, it’s about distribution. That part really needs to improve.” It is not a simple task, asJonathan Esensten, senior advisor at Multiply Labs and director of the Advanced Biotherapy Center at Sheba Medical Center, pointed out. Panelists discuss the current CGT investment landscape at the GenScript Biotech Forum 2025. “Current manufacturing often relies on ‘classified clean rooms,’ where people with their hands are actually manufacturing these products,” he said. While automation and standardization will improve some tasks,Hari Pujar,operating partner at Flagship Pioneering, pointed out that there are limitations due to patient variability. “No matter how much you automate, how much you standardize, you end up in the ex vivo situation with one variable, which is the patient cell,” he said. Along these lines, Bash highlighted an increasingly limited factor, noting, “Challenges that we are experiencing are not the capacity constraints for internal manufacturing, but the capacity constraints of the treatment centers.” Investors agreed that the ability to get outside of major academic centers and use CGTs in less intense, medically intensive settings is a major focus for investors as they evaluate potential investment opportunities. Supply chain issues remain constant in the space. One of the main issues in the sector is that for many of the critical materials, reagents and equipment, there is a single supplier. This is especially concerning given these materials can be delayed. Additionally, starting material quality inconsistency is a significant challenge. Mali emphasized, “Your drug is only as good as what you start off with...The patient has been through many different therapies, so what they have left can vary drastically.” Panelists discuss the future of CGTs at the GenScript Biotech Global Forum 2025. The current economic market is an understandable challenge for the CGT space as it is for the entire industry. However,Massimiliano Paganelli, chief executive officer and co-founder at Morphocell Technologies, stated that the environment for CGT is worse off due to the initial excitement over cell and gene therapies. He noted that acquisitions of preclinical cell therapy companies for valuations that touched the billion-dollar mark have compounded the market challenges for CGTs. Deeper, high-value valuations have lended to a slowdown of investment for the last five years. However, Paganelli stressed that because of a better understanding of CGTs, things are getting better from an investment perspective. Amongst the existing challenges for the CGT space, the payer challenge is another hurdle some panelists, as investors, are grappling with currently. The panel highlighted that while the payment structure in the U.S. market is challenging, it is even more challenging abroad, with a focus on moving beyond Europe, the Middle East and Africa to the Asia-Pacific region (APAC). That being said,Louis Breton, chief executive officer and co-founder at Rampart Bioscience, specified, “Patient-reported outcomes are becoming more and more critical to the progression of the way that the payers think about CGTs.” Working with governments is only one part of the puzzle, the second being that research and development costs have to be lower. Panelists noted that CGT developers such as Legend Biotech, which can stand alone from a commercial standpoint, are of keen interest for investors. Even with all of the challenges facing CGTs, venture capital funding remains strong, focusing on fewer but larger deals. In 2024, there were 18 initial public offerings. This is a significant swing upward from the six in 2023. As technology and science continue to blend and evolve, unsurprisingly, all panelists agreed that this evolution is going to make a big impact. Automation and the use of robotic systems were highlighted as being the most impactful. Panelists also highlighted in vivo approaches, which offer significant mitigation for the challenges the sector faces. Pujar poised the question,“What if we could create the cell inside the body…in which case we kind of default all of the challenges that have been mentioned?” As a Field, We Need to Continue to Innovate. Global Innovation and CollaborationFrom a global perspective, a conversation regarding innovation is not complete without mentioning APAC.Caroline Stout, partner at EcoR1 Capital, emphasized, “The pace of innovation coming out of China and Japan is formidable.” Bin Li, founder and chief investment officer at Lake Bleu Capital, agreed, as China is becoming a significant source of innovation. “It’s not first in class, but it’s best in class [for them],” Li said. Cross-border collaboration and deals are of significant value despite geopolitical tensions.Josh Resnick, senior managing director at RA Capital Management, expressed hope that politics will not interfere with innovation. “We view the world as fundamentally an open source to solve really hard problems,” Resnick said. This is especially concerning for the CGTs space, as China has been the main source for many biospecifics and T cell engagers. **Conclusions** The CGT space is still new. The panelists agreed that much work needs to be done to educate investors and regulators. They emphasized the importance of communicating the value of innovation, highlighting that the industry can make sure to transmit that story to the general population. To watch the panel discussions, read summaries, and view more content, please go to theGenScript Biotech Global Forum 2025. This article was written in collaboration with GenScript Biotech. The insights team analyzes and comments on industry trends and creates thought leadership content forBioSpaceand clients. The head of insights, Lori Ellis, can be contacted vialori.ellis@biospace.com. Follow her onLinkedIn. Twitter LinkedIn Facebook Email Print LayoffsGenentech Lays Off 143 Employees in South San Francisco ReshuffleJune 11, 2025·1 min read·Dan Samorodnitsky PolicyMakary, Prasad Lay Out Mission for FDA in Journal Kennedy Called ‘Corrupt’June 11, 2025·3 min read·Heather McKenzie DealsBMS Expands Radiopharma Presence With $1.35B Biobucks Deal for PhilochemJune 11, 2025·2 min read·Tristan Manalac Layoff TrackerRecursion Cuts 20% of WorkforceJune 11, 2025·222 min read·BioSpace Editorial Staff FundingSpliceBio Nabs $135 Million Series B To Advance Protein Splicing MedicinesJune 11, 2025·2 min read·Dan Samorodnitsky DealsBiopharma Right of First Negotiation Not a Golden Ticket to M&A, Jefferies FindsJune 11, 2025·6 min read·Annalee Armstrong BusinessAs Gene Therapy Endures ‘Cold Winter,’ FDA Leaders Promise SupportJune 11, 2025·6 min read·Dan Samorodnitsky Drug developmentsiRNA on the Precipice as Candidates Reach Beyond the LiverJune 9, 2025·7 min read·Shawna Williams EditorialDesperate Times, Desperate Measures? RFK’s Vaccine Campaign Only Breeds More DistrustJune 6, 2025·8 min read·Jef Akst Huntington’s diseaseuniQure’s Regulatory Progress Sparks Optimism for ‘Desperate’ Huntington’s SpaceJune 5, 2025·6 min read·Heather McKenzie ExploreNewsInsightsJobsCareer AdviceNewslettersPodcastsWebinarsReportsCompaniesNextGen: Top Start Ups To WatchBest Places to WorkHotbeds News Insights Jobs Career Advice Newsletters Podcasts Webinars Reports Companies NextGen: Top Start Ups To Watch Best Places to Work Hotbeds News Insights Jobs Career Advice Newsletters Podcasts Webinars Reports Companies NextGen: Top Start Ups To Watch Best Places to Work Hotbeds AboutAbout BioSpaceEditorialJoin Our TeamSupportTerms & ConditionsPrivacy Policy About BioSpace Editorial Join Our Team Support Terms & Conditions Privacy Policy About BioSpace Editorial Join Our Team Support Terms & Conditions Privacy Policy MoreEmployer LoginEmployer ResourcesPost JobsTalent SolutionsAdvertiseSubmit a Press ReleaseRSS Feeds Employer Login Employer Resources Post Jobs Talent Solutions Advertise Submit a Press Release RSS Feeds Employer Login Employer Resources Post Jobs Talent Solutions Advertise Submit a Press Release RSS Feeds © 1985 - 2025 BioSpace.com. All rights reserved. twitter instagram facebook linkedin"}