{"id": 1891, "name": "Being Libertarian", "domain": "beinglibertarian.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://beinglibertarian.com/82-considering-voting-for-libertarian-jo-jorgensen-according-to-msnbc-poll/", "title": "82 Considering Voting For Libertarian Jo Jorgensen According To Msnbc Poll", "content": "Home News ArticlesPoliticsEconomicsPhilosophyScience & TechnologyComedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Rational Standard Books Multimedia Support AboutPrivacy Policy Privacy Policy Privacy Policy TeamAdam BarsoukBrandon KirbyDanny ChabinoLuke HendersonMartin van Staden (Editor)Nathan A. Kreider Adam Barsouk Brandon Kirby Danny Chabino Luke Henderson Martin van Staden (Editor) Nathan A. Kreider Adam Barsouk Brandon Kirby Danny Chabino Luke Henderson Martin van Staden (Editor) Nathan A. Kreider Contribute Support Our Work Supporter Hall of Fame Contact Home News ArticlesPoliticsEconomicsPhilosophyScience & TechnologyComedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Rational Standard Books Multimedia Support Featured Articles News Politics **82% Considering Voting For Libertarian Jo Jorgensen, According to MSNBC Poll** As of Tuesday night, 82% of 28,000 respondentsreportedthat they are considering voting for Libertarian Party presidential nominee Jo Jorgensen. This demonstrates that many are not satisfied with the options from the two major parties, and that what once seemed a giveaway now has some hope. The Libertarian ticket seemed to mostly be for maintaining this election cycle, but with continued dislike of incumbent Donald Trump and the multiple gaffs by Democratic nominee Joe Biden, a third party candidate could make a considerable dent this year. Incumbent presidents tend to win their reelections, only 10 presidents being the exception, but Trump has steadilymaintaineda disapproval rating of over 50%, and Biden has consistently hadunfavorable ratings. Hopefully, this early success marks the beginning of continued consideration for the Libertarian ticket. **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on Telegram (Opens in new window)Telegram Click to share on Tumblr (Opens in new window)Tumblr Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pocket (Opens in new window)Pocket Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print **Like this:** TAGS 2020 election 2020 presidential election election 2020 Jo Jorgensen libertarian party **Ron Paul Revolution Takes Over The Libertarian Party** **Secession: The Lost Aspect of Federalism** **Sympathy & Empathy & Hierarchy** Robert the LibertarianJune 17, 2020 at 6:42 pmLibertarian Poll Data on Facebook, the voice of the founders and leaders of world Libertarianism, have called this a ‘fun poll’ and beauty contest because it doesn’t meet science standards. It’s nice, but also keep in mind it’s been open since 2016… Libertarian Poll Data on Facebook, the voice of the founders and leaders of world Libertarianism, have called this a ‘fun poll’ and beauty contest because it doesn’t meet science standards. It’s nice, but also keep in mind it’s been open since 2016… Libertarian Poll Data on Facebook, the voice of the founders and leaders of world Libertarianism, have called this a ‘fun poll’ and beauty contest because it doesn’t meet science standards. It’s nice, but also keep in mind it’s been open since 2016… KarenJune 20, 2020 at 4:23 pmI agree. Sad to see something so misleading shared by Libertarians. It’s just an old poll between Hillary and Trump that was swamped by Jo supporters to show the results. Keep it real!KarenJune 20, 2020 at 4:25 pmSkew* not showJohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitterHeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9%Glen LewisJune 24, 2020 at 7:29 pmYou are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. I agree. Sad to see something so misleading shared by Libertarians. It’s just an old poll between Hillary and Trump that was swamped by Jo supporters to show the results. Keep it real! KarenJune 20, 2020 at 4:25 pmSkew* not showJohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitterHeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9% Skew* not show JohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter It was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter HeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9% I also participated in it and when I took it it was at 9% Glen LewisJune 24, 2020 at 7:29 pmYou are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. You are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. I agree. Sad to see something so misleading shared by Libertarians. It’s just an old poll between Hillary and Trump that was swamped by Jo supporters to show the results. Keep it real! KarenJune 20, 2020 at 4:25 pmSkew* not showJohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitterHeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9% Skew* not show JohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter It was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter HeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9% I also participated in it and when I took it it was at 9% Skew* not show JohnJune 24, 2020 at 12:49 pmIt was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter It was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter It was not an old Hillary poll 😂😂 I actually did participate in it, it was openly posted on their website and twitter HeatherJuly 9, 2020 at 4:20 pmI also participated in it and when I took it it was at 9% I also participated in it and when I took it it was at 9% I also participated in it and when I took it it was at 9% Glen LewisJune 24, 2020 at 7:29 pmYou are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. You are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. You are fake news! I participated in this poll! You should be happy that someone that actually cares about your liberty is doing well. Carlos RiosJune 22, 2020 at 9:40 amHello, if you guys doesn’t want to be like democrats and republicans, please don’t lie. I’m looking for honest people to vote for. I’m not looking for the trash we already have in our government. Make a difference.Glen LewisJune 24, 2020 at 7:32 pmI voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! Hello, if you guys doesn’t want to be like democrats and republicans, please don’t lie. I’m looking for honest people to vote for. I’m not looking for the trash we already have in our government. Make a difference. Glen LewisJune 24, 2020 at 7:32 pmI voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! I voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! Hello, if you guys doesn’t want to be like democrats and republicans, please don’t lie. I’m looking for honest people to vote for. I’m not looking for the trash we already have in our government. Make a difference. Glen LewisJune 24, 2020 at 7:32 pmI voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! I voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! I voted in this poll, so what exactly are you talking about? Get your fact together so you don’t post irresponsibly! WmJune 26, 2020 at 3:48 amJo Jorgensen helped double the membership of the Libertarian Party when she ran in 1996 as VP candidate of the LP. She could win this year drawing from both major parties and from independents. It will be crucial for Jorgensen to be included in the three presidential debates. Both major parties have excluded third party candidates from debates but if someone is on sufficient number of ballots to theoretically win in the Electoral College, most people think that should make them eligible for entry in the debates not the arbitrary 15% in selected polls demanded by the GOP and Dems.Jorgensen is articulate, educated, knowledgeable and motivated as a proponent of libertarian solutions to the problems facing our country. She should and could win this election and that would spare us the outcome of the failed policies of either major party which have brought us to this condition of failed public schools, failed public trade policies and foreign entanglements, exorbitant spending programs and giveaways with unsustainable national debt and destruction of the dollar.GOP and Dems pay lip service to the Constitution but ignore it whereas Jorgensen will restore the limits the Founders granted and enumerated in order to restrain government and assure individual freedom which enabled the country to prosper with abolition of slavery. Jo Jorgensen helped double the membership of the Libertarian Party when she ran in 1996 as VP candidate of the LP. She could win this year drawing from both major parties and from independents. It will be crucial for Jorgensen to be included in the three presidential debates. Both major parties have excluded third party candidates from debates but if someone is on sufficient number of ballots to theoretically win in the Electoral College, most people think that should make them eligible for entry in the debates not the arbitrary 15% in selected polls demanded by the GOP and Dems.Jorgensen is articulate, educated, knowledgeable and motivated as a proponent of libertarian solutions to the problems facing our country. She should and could win this election and that would spare us the outcome of the failed policies of either major party which have brought us to this condition of failed public schools, failed public trade policies and foreign entanglements, exorbitant spending programs and giveaways with unsustainable national debt and destruction of the dollar.GOP and Dems pay lip service to the Constitution but ignore it whereas Jorgensen will restore the limits the Founders granted and enumerated in order to restrain government and assure individual freedom which enabled the country to prosper with abolition of slavery. Jo Jorgensen helped double the membership of the Libertarian Party when she ran in 1996 as VP candidate of the LP. She could win this year drawing from both major parties and from independents. It will be crucial for Jorgensen to be included in the three presidential debates. Both major parties have excluded third party candidates from debates but if someone is on sufficient number of ballots to theoretically win in the Electoral College, most people think that should make them eligible for entry in the debates not the arbitrary 15% in selected polls demanded by the GOP and Dems.Jorgensen is articulate, educated, knowledgeable and motivated as a proponent of libertarian solutions to the problems facing our country. She should and could win this election and that would spare us the outcome of the failed policies of either major party which have brought us to this condition of failed public schools, failed public trade policies and foreign entanglements, exorbitant spending programs and giveaways with unsustainable national debt and destruction of the dollar.GOP and Dems pay lip service to the Constitution but ignore it whereas Jorgensen will restore the limits the Founders granted and enumerated in order to restrain government and assure individual freedom which enabled the country to prosper with abolition of slavery. OrvilleownexJune 30, 2020 at 7:21 pmover at this websitehttps://hydra20online.com over at this websitehttps://hydra20online.com over at this websitehttps://hydra20online.com Guy IncognitoJuly 4, 2020 at 4:35 pmNot a fan of Jorgensen. Jacob Hornberger would have been a better candidate. Trump 2020!slickJuly 20, 2020 at 11:09 amok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. Not a fan of Jorgensen. Jacob Hornberger would have been a better candidate. Trump 2020! slickJuly 20, 2020 at 11:09 amok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. ok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. Not a fan of Jorgensen. Jacob Hornberger would have been a better candidate. Trump 2020! slickJuly 20, 2020 at 11:09 amok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. ok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. ok so you are “not a fan” but pleeeeeeeeease don’t tell me a good libertarian like yourself would even consider voting for either Trump or Biden. It just isn’t possible. David Lee RothJuly 8, 2020 at 4:13 amFun Fact… you can vote in that poll multiple times and it’s not limited to geography either. Honestly this is about as reliable as a FB or Twitter poll. I purposely artificially inflated Jo’s numbers just to see if I could do it.. wasn’t hard at all. Really sad that an online poll is being taken seriously. Fun Fact… you can vote in that poll multiple times and it’s not limited to geography either. Honestly this is about as reliable as a FB or Twitter poll. I purposely artificially inflated Jo’s numbers just to see if I could do it.. wasn’t hard at all. Really sad that an online poll is being taken seriously. Fun Fact… you can vote in that poll multiple times and it’s not limited to geography either. Honestly this is about as reliable as a FB or Twitter poll. I purposely artificially inflated Jo’s numbers just to see if I could do it.. wasn’t hard at all. Really sad that an online poll is being taken seriously. Boaty McBoatfaceJuly 18, 2020 at 5:46 amPlease. This poll, like most Libertarians are posting right now, could just as easily show Boaty McBoatface in the lead. It’s the internet. If you want Jo to get traction you need to convince real people to vote for her.Also, Robert, no poll meets science standards. You can apply rigorous methods but it still isn’t science. Please. This poll, like most Libertarians are posting right now, could just as easily show Boaty McBoatface in the lead. It’s the internet. If you want Jo to get traction you need to convince real people to vote for her. Also, Robert, no poll meets science standards. You can apply rigorous methods but it still isn’t science. Please. This poll, like most Libertarians are posting right now, could just as easily show Boaty McBoatface in the lead. It’s the internet. If you want Jo to get traction you need to convince real people to vote for her. Also, Robert, no poll meets science standards. You can apply rigorous methods but it still isn’t science. KarenJuly 20, 2020 at 11:51 amI vote Boaty McBoatface! I vote Boaty McBoatface! I vote Boaty McBoatface! risquedjJuly 27, 2020 at 8:23 amThink about who is conducting this poll. They don’t want to advance the Libertarian agenda. They want Libertarians to take votes away from Trump. Listen, I have NEVER played the “lesser of two evils” game, but this election, that’s exactly what I am going to do. As much as it pains me to say it, I will be voting for Trump. Radical Socialists are making a BIG push, and they have the ear (and some of the minds) of the elite within the Democratic Party. A vote for Biden is not a vote for the status quo Democratic agenda, but one that is MUCH MORE radical!! Let’s put it this way, I don’t feel like Trump could destroy our Republic in the next 4 years, but I think this radical Leftist agenda could. It’s for that reason I am voting Trump. Then in 2024, I will be amongst the loudest people pushing the end of the two-party system via Libertarian principles again. Not that I wouldn’t continue to hold Trump to those same standards as well. Think about who is conducting this poll. They don’t want to advance the Libertarian agenda. They want Libertarians to take votes away from Trump. Listen, I have NEVER played the “lesser of two evils” game, but this election, that’s exactly what I am going to do. As much as it pains me to say it, I will be voting for Trump. Radical Socialists are making a BIG push, and they have the ear (and some of the minds) of the elite within the Democratic Party. A vote for Biden is not a vote for the status quo Democratic agenda, but one that is MUCH MORE radical!! Let’s put it this way, I don’t feel like Trump could destroy our Republic in the next 4 years, but I think this radical Leftist agenda could. It’s for that reason I am voting Trump. Then in 2024, I will be amongst the loudest people pushing the end of the two-party system via Libertarian principles again. Not that I wouldn’t continue to hold Trump to those same standards as well. Think about who is conducting this poll. They don’t want to advance the Libertarian agenda. They want Libertarians to take votes away from Trump. Listen, I have NEVER played the “lesser of two evils” game, but this election, that’s exactly what I am going to do. As much as it pains me to say it, I will be voting for Trump. Radical Socialists are making a BIG push, and they have the ear (and some of the minds) of the elite within the Democratic Party. A vote for Biden is not a vote for the status quo Democratic agenda, but one that is MUCH MORE radical!! Let’s put it this way, I don’t feel like Trump could destroy our Republic in the next 4 years, but I think this radical Leftist agenda could. It’s for that reason I am voting Trump. Then in 2024, I will be amongst the loudest people pushing the end of the two-party system via Libertarian principles again. Not that I wouldn’t continue to hold Trump to those same standards as well. Comments are closed. Email address: Official Twitter Account Notice Ron Paul Revolution Takes Over The Libertarian Party Secession: The Lost Aspect of Federalism Sympathy & Empathy & Hierarchy Biden Announces Treasury Will Print Other Countries’ Currencies **CNN Election Poll Excluded Millennials And Downplayed 3rd Party Votes** **82% Considering Voting For Libertarian Jo Jorgensen, According to MSNBC Poll** **Gary Johnson: Abolish The 17th Amendment** Featured Articles2062 Politics1302 Philosophy414 Economics407 Guest Opinions402 Culture352 News281 Activism171 Comedy & Satire98 Home News ArticlesPoliticsEconomicsPhilosophyScience & TechnologyComedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Politics Economics Philosophy Science & Technology Comedy & Satire Rational Standard Books Multimedia Support"}