{"id": 365, "name": "Digi24", "domain": "digi24.ro", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.digi24.ro/digieconomic/energie/ce-consumatori-vor-primi-sprijin-pentru-facturile-la-energie-dupa-1-iulie-ministerul-energiei-a-publicat-proiectul-57065", "title": "Ce Consumatori Vor Primi Sprijin Pentru Facturile La Energie Dupa 1 Iulie Ministerul Energiei A Publicat Proiectul 57065", "content": "Digi24 FM Digi FM Pro FM Dance FM News Financiar Macro Consumer Energie Digital Companii HOME DigiEconomic Energie Ce consumatori vor primi sprijin pentru facturile la energie după 1 iulie? Ministerul Energiei a publicat proiectul **Ce consumatori vor primi sprijin pentru facturile la energie după 1 iulie? Ministerul Energiei a publicat proiectul** Ministerul Energiei a publicat, miercuri seară, în transparență decizională proiectul privind o noua schemă de ajutor la plata facturilor de energie pentru consumatorii vulnerabili, odată cu eliminarea plafonării de la 1 iulie. Persoanele singure cu venit net lunar de maxim 2.574 lei, familiile cu venit net lunar/membru de cel mult 1.784 lei, persoanele cu handicap, precum și alte categorii de consumatori casnici vor beneficia de sprijin de la stat. Potrivit proiectului, măsurile de protecție socială se aplică în perioada 1 iulie 2025 - 31 martie 2026. Sprijinul este asimilat prestațiilor sociale, reprezintă venit neimpozabil și se acordă la solicitarea persoanei singure sau a unui membru major al familiei. Solicitarea poate fi depusă exclusiv online, într-o aplicație dezvoltată de Serviciul de Telecomunicații Speciale, dedicată implementării mecanismului de sprijin. „Pentru solicitanții care nu au posibilitatea să utilizeze această aplicație, se propune ca aceștia să fie ajutați de către autoritățile administrației publice locale, oficiile poștale sau furnizorii de energie electrică”, arată documentul. De asemenea, se menționează că sprijinul se acordă pentru un singur loc de consum, indiferent dacă solicitantul este sau nu este titular al contractului de furnizare de energie electrică, iar membrii familiei, declarați de solicitant, nu se regăsesc la alt loc de consum. **Cine ar putea beneficia de sprijin** Prin proiectul de act normativ se reglementează acordarea de sprijin pentru consumatorii casnici de energie electrică aflați în situația de sărăcie energetică: - persoană singură cu un venit net lunar de maxim 2.574 lei; - familii cu un venit net lunar/membru de maxim 1.784 lei; - persoană încadrată în grad grav, accentuat sau mediu de handicap, al cărui venit net lunar maxim luat în considerare este de 3.641 lei în cazul persoanelor care locuiesc singure și de 2.460 lei/membru în cazul familiilor; - persoană care, fie necesită echipamente medicale alimentate de la reţeaua electrică pentru menţinerea în viaţă sau pentru menţinerea stării de sănătate, fie prezintă probleme de sănătate care împiedică sau restricţionează mobilitatea şi/sau deplasarea acestora ori necesită modalităţi de informare şi comunicare adaptate nevoilor specifice, al cărui venit net lunar maxim luat în considerare este de 3.641 lei în cazul persoanelor care locuiesc singure și de 2.460 lei/membru în cazul familiilor. - familii care au în întreţinere cel puţin 3 copii cu vârsta de până în 18 ani, în baza unei declaraţii pe propria răspundere, al căror venit net lunar maxim luat în considerare este de 2.460 lei/membru; limita de vârstă se prelungeşte până la 26 de ani în cazul în care copilul major urmează o formă de învăţământ; - familii monoparentale, care au în întreţinere cel puţin un copil cu vârsta de până la 18 ani, în baza unei declaraţii pe propria răspundere, al căror venit net lunar maxim luat în considerare este de 2.460 lei/membru; limita de vârstă se prelungeşte până la 26 de ani în cazul în care copilul major urmează o formă de învăţământ. Sprijinul se acordă sub forma unui tichet fără valoare nominală, care va fi încărcat lunar, atât timp cât se mențin condițiile de eligibilitate. Emiterea, tipărirea, distribuirea tichetului și plata către furnizor a facturii de energie electrică prin serviciul de mandat poștal se va realiza prin intermediul Companiei Naționale Poșta Română SA (CNPR). Sumele reprezentând sprijinul acordat beneficiarilor, precum și cele necesare pentru plata contravalorii serviciilor prestate de CNPR vor fi suportate din bugetul Ministerului Muncii, Familiei, Tineretului și Solidarității Sociale, prin Agenția Națională pentru Plăți și Inspecție Socială. **Cine nu beneficiază** Nu vor beneficia de sprijin persoanele care, la data solicitării sprijinului, nu au domiciliul în România sau care nu fac dovada că locuiesc în România, potrivit legii, precum şi persoanele care execută pedepse privative de libertate ori beneficiază de servicii sociale în regim rezidenţial organizate ca structuri publice sau private. Etichete: energie romania consumatori consum energie electrica **Din categoria Energie** **Ministrul Energiei: „România NU (mai) este, de ani buni, un mare producător de energie”** **ANRE lansează o campanie de informare pentru consumatorii de energie electrică. Plafonarea prețurilor expiră curând** **Romgaz anunță că renunță la cererea de dizolvare a Greenpeace. Reacția organizației** **Numărul centralelor electrice de balcon din Germania s-a dublat în ultimul an. De ce au crescut în popularitate** **Burduja: Piaţa energetică europeană există doar în teorie. Este nevoie de infrastructură conectivă transfrontalieră** **Top articole** **Vești bune de la Comisia Europeană: România încasează aproape 1,3 miliarde euro din PNRR** **Antifrauda a descoperit tranzacții fictive în domeniul colectării deșeurilor: prejudiciu...** **RO e-Transport: Inspectorii antifraudă au verificat peste 1.600 de camioane. Ce au...** **Șomajul în Marea Britanie este la cel mai înalt nivel din ultimii 4 ani. Angajatorii...** **Ungaria a găsit soluția pentru a reduce deficitul bugetar: va majora emisiunile de...** **Ultimele Știri Digi24** **DNA: Aproape toți angajații ISCTR Timișoara au luat mită. Unele firme plăteau „abonamente” lunare...** **Nicușor Dan s-a întâlnit cu membrii comunității românești din zona Odesa: „Ne-am asumat că vom...** **Situaţie de urgenţă la Praid: Salinitatea apei în Târnava Mică e în creştere. Populaţia, sfătuită...** **Eșec al negocierilor de la Guvern asupra reducerii deficitului. USR vrea tăieri, PSD vrea taxe...** **Motivarea CCR privind declarațiile de avere: se încalcă dreptul la viață privată, dar e o...** Abonare Digi TV Politica de utilizare a modulelor cookie Codul Digi24"}