{"id": 1888, "name": "Attack the System", "domain": "attackthesystem.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://attackthesystem.com/2025/06/11/live-now-6-11-25-trump-insurrection-act-tanks-roll-into-dc-jon-stewart-vs-stephen-a-ai-goes-viral-more/#respond", "title": "Live Now 6 11 25 Trump Insurrection Act Tanks Roll Into Dc Jon Stewart Vs Stephen A Ai Goes Viral More", "content": "**Menu** Home RSS Statement of Purpose Kick the Puppy Books Links Contact Donate **Attack the System** **Anarcho-Pluralism & All the News That's Not Fit to Print** **Editors** academiccompositionab Empowerment Equalizer SSaragian Antony Sammeroff Ann Sterzinger Rodney RJ busterjames cainusmaxus Craig FitzGerald David Heleniak Caity & Dan Greene keirmartland Keith Preston Bill the Butcher ljp711 MRDA Jack Donovan Rachel Haywire comrade hermit Michael Vince Regan robertstark2014 Noonan S E Pearson Rachel Haywire Nexus X Humectress **Live now! 6/11/25: Trump Insurrection Act, Tanks Roll Into DC, Jon Stewart Vs Stephen A, AI Goes Viral & MORE!** Krystal and Emily discuss Trump preps for insurrection acts, tanks roll into DC for military parade, Jon Stewart shreds Stephen A, Greta Thunberg reveals Israel kidnapping details, AI LA video goes viral in dystopian preview. Taren Stinebrickner-Kauffman:https://x.com/TarenSK Timestamps: (00:00)Intro (4:47)Trump Preps INSURRECTION ACT As Protests Go NATIONWIDE (45:06)WATCH: TANKS Roll Into DC as Trump THREATENS Protesters (1:04:35)Jon Stewart SHREDS Stephen A Smith’s Lame Centrist Take (1:21:51)Greta Thunberg REVEALS Israel Flotilla Kidnapping Details (1:35:16)AI Cali Protest Video Goes VIRAL In Dystopian Preview (1:54:38)EoS Sign up for a PREMIUM Breaking Points subscriptions for full early access to uncut shows and LIVE interaction with the hosts every week:https://breakingpoints.locals.com/sup…For support connecting your locals account, contact us at breakingpoints.locals.com/contact Merch Store:https://shop.breakingpoints.com/Subscribe to Ryan’s DropSiteNews:https://www.dropsitenews.com/subscrib…To listen to Breaking Points as a podcast, check them out on Apple and Spotify Apple:https://podcasts.apple.com/us/podcast…Spotify:https://open.spotify.com/show/4Kbsy61…#news#politics#youtube **Attack the System** Tweet More Click to print (Opens in new window)Print Share on Tumblr Click to share on Reddit (Opens in new window)Reddit Categories:News Updates **Post navigation** **Leave a ReplyCancel reply** **Recent Comments** **Follow via email** Enter your email address to followAttack the Systemand receive notifications of new posts by email Email Address Follow **ATS Facebook Page** **Most Viewed Today** Rent is theft? Curtis Yarvin’s Plot Against America Why Gaza Matters to Trans Liberation The Argentine Zugzwang Los Angeles: Is the US headed to civil war? The Real Target Of The LA Protests: YOUR FREEDOMS Israel’s Mossad is everywhere and all over Ukraine, Russia has won! – Col. Lawrence Wilkerson A Review of Drink Your Future: Recursive Freedom in the Cybernetic Age L.A. Burns This Is What Authoritarian Creep Looks Like **Core Documents** A Call For Left/Right Anarchist Unity A Calm Anarchist Look at Race, Culture, and Immigration A Political Program for Anarchists After the Revolution Against Anarcho-Sectarianism: Why All Forms of Anti-Authoritarianism Should Be Embraced Against the State: Anarchist Meta-Politics and Meta-Strategy in the Twenty-First Century Always Critique the Dominant Ruling Class’s Ideological Superstructure Am I A Fascist?: An Open Letter to the Left-Wing Anarchist Movement America 2021: “Woke Capitalism” and Its Enemies America’s Abnormal Violence American Imperialism and the Identity of the World’s Peoples American Revolutionary Vanguard Twenty-Five Point Program Americans for Self-Determination An Alternative to the American Empire of the New World An Anarchist National Defense and Foreign Policy An Assessment of Trumponomics An Interview with Keith Preston An Interview with Keith Preston II Anarchism or Anarcho-Social Democracy Anarchism Without Hyphens Anarchists, Get Up Off Your Asses and Get Moving! Anarcho-Pluralism and Pan-Secessionism: What They Are and What They Are Not Anarcho-Populism: Not Economically Left/Culturally Right Anarchy: Law, Order, and Authority Anti-Imperialists of the World, Unite! Towards an Anarchist Theory of Geopolitics Antifa vs. Anarchism Antony Sammeroff Archives: Healthcare and Economics Are Pan-Anarchism and Pan-Secessionism Enough? The Case for Pan-Socratism Against Dogma Are Pan-Anarchism and Pan-Secessionism Enough? The Case for Pan-Socratism Against Dogma Are Startup Societies the Way Forward? Armed Revolution Possible and Not So Difficult Armed Struggle Against the State ATS Predictions That Have Actually Happened and/or Are Happening Attack the System: An Anthology & An Exhaustive Reading List For Mutualist Anarchism Attack the System’s new travel channel Be A Rebel Because Killing Them All Is Not An Option Benjamin Tucker’s Economic Thought Best Anarchism Blogs and Websites Beyond Conservatism: Reclaiming the Radical Roots of Libertarianism Books Can Anyone Define “Woke”? As in “Wokeness”? Canning Reactionary Leftism Communities, Immigration, and Decentralization Conservatism Is Not Enough: Reclaiming the Legacy of the Anti-State Left Crime and Conflict Theory Critique of the Americans For Self-Determination Plan for Separatism and Decentralism Cultural Revolution, Culture War by Dr. Sean Gabb Dealing with Crime in a Free Society Decentralist Anarchy versus World Domination Anarchism Deconstructing the \"Human Rights\" Ideology Follow Keith Preston on Substack and Social Media + 4 Hour Interview w/Keith Preston Forms of Pan-Secessionism That Are Actually Happening Forty Years in the Wilderness Free Enterprise: The Antidote to Corporate Plutocracy Growing the Numbers of Pan-Anarchists: Reflections on Propaganda Techniques How Pan is your Pan-Secessionism? How the World Works: Neema Parvini and The Populist Delusion How to Defeat the US Imperial Police State I’m Still Not a Cultural Conservative In Defense of Islamic Nations Israel Apologia Is One Big Fat Appeal To Emotion Fallacy Keith Preston vs. the System (and Right and Left Libertarianisms) Kevin A. Carson and The State: Theory and Praxis Law and Anarchism Leaderless Resistance Left and Right: The Prospects for Liberty Liberalism and Social Control: The New Class’ Will to Power Liberty and Populism: Building an Effective Resistance Movement for North America Mailer for Mayor Mass Immigration and Totalitarian Humanism Most “Radicals” Do Not Really Oppose “the System” Multipolarity, Super-Multipolarity, and Beyond National-Anarchism and the American Idea National-Anarchism: The Way of the Future Normalizing Anarchism in an Age of “Populism” and “Nationalist Strongmen” On Being an Empiricist Anarchist in an Era of Tribal-Sectarian Warfare On Building the Revolutionary Party: The Lumpenproletariat as Class Vanguard On Purging the Anarchist Movement of Reactionary Liberal Influences Operational Anarchism? Organizing the Urban Lumpenproletariat Our Struggle is Neither Moral nor Intellectual but Physical Pan-Secessionism is Now a Mainstream Idea Panarchies/Polyarchies Philosophical Anarchism and the Death of Empire Propaganda by the Deed, Fourth Generation, Warfare and the Decline of the State Ron Paul as a prototype for anarchists Sanctuary Cities: The Way Forward for Pan-Anarchism and Pan-Secessionism? Secessionists, Unite! Sheep, Wolves, and Owls Should Libertarianism be Cultural Leftism without the State? Smashing the State: Thoughts On Anarchist Strategy Startup Societies, Part One: Balaji Srinivasan and The Network State Startup Societies, Part Two: A Reflection on the Work of Fitzpatrick, O’Connor, Mayes, Widmer, Srinivasan, Crimethinc, and Block Subversive: An Interview with Keith Preston Summer of ’69 The Anatomy of the State The Atlanticist-Zionist-Wahhabi Axis The Five Dangers Facing the Lumpenproletariat The Five Dangers Facing the Lumpenproletariat The Ideology of Totalitarian Humanism The Limitations of the Conservative “Anti-Woke” Grift The Lumpenproletariat as Class Vanguard: Why Anarchists Must Attack the Left from the Left The New Totalitarianism The Next Radicalism: Rightism Without Jingoism, Leftism Without Political Correctness The Nietzschean Prophecies The NWO, turns out its Black Rock The Original Terrorists The Pan-Secessionist Meta-Party Would Now Have 100 Million Sympathizers The Rebellion in Los Angeles: The Context of a Proletarian Uprising The Red/Blue Tribal Civil War: Weimar Republic or Star Trek vs. Star Wars? The Rise and Fall of the Shining Path: Lessons for North American Insurgents The Seven Factions of the 2020 Street Battles? The State: Its Rise and Decline The System’s Neatest Trick The Ten Core Demographics of Alternative-Anarchism/Pan-Secessionism The Vaults Understanding the Divide Between Social Justice Advocates and the Left-Leaning “Anti-Woke” Community UNDERSTANDING THE TOTALITARIAN HUMANIST REVOLUTION Unity in Diversity and Against War and Statism Voltairine de Cleyre: Anarchist without Adjectives We’re Getting a Lot Closer We’re Much Closer to Many ATS Goals, But Is a Civil War on the Way? What is post-leftism? What really happened in Israel on Oct. 7? w/Max Blumenthal | The Chris Hedges Report What to Know if a Family Member or Friend Has Been Arrested When the American Empire Falls: How Anarchists Can Lead the 2nd American Revolution Who Is the State, Ruling Class, and Power Elite? Who Rules America? The Four Networks Theory of Power Why I Am an Anarcho-Pluralist Why I Am an Anarcho-Pluralist, Part Two Why I Am Not a Cultural Conservative Why I Choose to Collaborate with Racialists and Theocrats Why I Choose to Collaborate with the Criminal Underworld Why Libertarians Must Be Revolutionaries: A Call for a Revolutionary Libertarian Movement Why the Radical Left Should Consider Secession **Recommended** Nemesis: The Last Days of the American Republic by Chalmers Johnson Top categories:Culture Wars/Current ControversiesKyle Kulinski **Discover more from Attack the System** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}