{"id": 115, "name": "Baltimore Sun", "domain": "baltimoresun.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.baltimoresun.com/2022/11/30/baltimore-sun-media-summer-internships-current-opportunities-what-past-interns-have-done-and-how-to-apply/", "title": "Baltimore Sun Media Summer Internships Current Opportunities What Past Interns Have Done And How To Apply", "content": "Baltimore Sun eNewspaper Baltimore Sun eNewspaper Subscriber ServicesManage SubscriptionEZ PayVacation StopSun Insider Manage Subscription EZ Pay Vacation Stop Sun Insider Manage Subscription EZ Pay Vacation Stop Sun Insider eNewspaperDaily SunEvening EditionCarroll County TimesCapital GazetteThe Aegis Daily Sun Evening Edition Carroll County Times Capital Gazette The Aegis Daily Sun Evening Edition Carroll County Times Capital Gazette The Aegis Advertise with UsAdvertiseClassifiedHomesJobsSpecial Sections Advertise Classified Homes Jobs Special Sections Advertise Classified Homes Jobs Special Sections NewsNewsLatestCrime and Public SafetyEducationElectionsEnvironmentHealthLotteryMarijuanaNationPoliticsSun InvestigatesWorld News Latest Crime and Public Safety Education Elections Environment Health Lottery Marijuana Nation Politics Sun Investigates World News Latest Crime and Public Safety Education Elections Environment Health Lottery Marijuana Nation Politics Sun Investigates World Carroll County TimesCarroll County TimeseNewspaperEducationHigh School SportsNewsOpinionObituariesSubmit News Carroll County Times eNewspaper Education High School Sports News Opinion Obituaries Submit News Carroll County Times eNewspaper Education High School Sports News Opinion Obituaries Submit News The AegisThe AegiseNewspaperAegis OpinionAegis SportsHarford Magazine The Aegis eNewspaper Aegis Opinion Aegis Sports Harford Magazine The Aegis eNewspaper Aegis Opinion Aegis Sports Harford Magazine Local NewsLocal NewsMarylandAnne Arundel CountyBaltimore CityBaltimore CountyCarroll County TimesHarford County – The AegisHoward CountyEastern Shore Local News Maryland Anne Arundel County Baltimore City Baltimore County Carroll County Times Harford County – The Aegis Howard County Eastern Shore Local News Maryland Anne Arundel County Baltimore City Baltimore County Carroll County Times Harford County – The Aegis Howard County Eastern Shore SportsSportsBaltimore OriolesBaltimore RavensOlympicsHigh School SportsCollege SportsTerpsHorse Racing Sports Baltimore Orioles Baltimore Ravens Olympics High School Sports College Sports Terps Horse Racing Sports Baltimore Orioles Baltimore Ravens Olympics High School Sports College Sports Terps Horse Racing BusinessBusinessAutosBest ReviewsReal EstateTop Workplaces Business Autos Best Reviews Real Estate Top Workplaces Business Autos Best Reviews Real Estate Top Workplaces OpinionOpinionEditorialsOpinion ColumnistsDan RodricksOp-EdReaders RespondSubmit Letter to the EditorSubmit Op-Ed Opinion Editorials Opinion Columnists Dan Rodricks Op-Ed Readers Respond Submit Letter to the Editor Submit Op-Ed Opinion Editorials Opinion Columnists Dan Rodricks Op-Ed Readers Respond Submit Letter to the Editor Submit Op-Ed News ObituariesNews ObituariesDeath NoticesHow to submit a death notice News Obituaries Death Notices How to submit a death notice News Obituaries Death Notices How to submit a death notice Things To DoThings To DoArtsEntertainmentEventsFood and DrinkHome and GardenHoroscopesFun and GamesMoviesMusic Things To Do Arts Entertainment Events Food and Drink Home and Garden Horoscopes Fun and Games Movies Music Things To Do Arts Entertainment Events Food and Drink Home and Garden Horoscopes Fun and Games Movies Music Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Login Sign up for email newsletters Subscribe Login Baltimore Sun eNewspaper Baltimore Sun eNewspaper eNewspaper Latest Headlines Sports News Obituaries Death Notices Things To Do Opinion Weather Don't miss: 🏆 Women to Watch nominations 🏈 Ravens stadium poll 🚨 Search Baltimore crime data 🇺🇸 Army parade poll 🏆 Top Workplace nominations open 🏆 Best of Howard nominations **Baltimore Sun summer internships: Current opportunities, what past interns have done, and how to apply** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Every summer The Baltimore Sun offers journalism paid internships throughout the company including an internship commemorating the work of former Sun editorMary J. Corey. Our interns are treated like members of the full-time staff, win awards and go on to work for us and other media organizations. Baltimore Sun Media has one application for all its summer internships. Applicants not picked for the Mary J. Corey Journalism Internship will be considered for other positions. The people selected should have extensive journalism experience, either as a student journalist, or as an intern in a professional newsroom, or a combination of both. Internships will be open to undergraduate students who expect to graduate in 2026 or 2027 or to graduate students who have not worked professionally as a journalist for more than one year. Interns will work in the Sun newsroom for 10-12 weeks sometime between June 1, 2026, and Aug. 31, 2026. (Exact dates will be determined mutually by the intern and Sun editors). Interns will report to a specific editor during internship, though the intern will be given opportunity to work with multiple editors. Mary Corey, a Maryland native who died in 2013 after a long battle with breast cancer, started her career at The Sun as a college intern. Upon her graduation from what is now Notre Dame of Maryland University, she was immediately hired by The Sun as an editorial assistant. She rose through the ranks as a reporter, editor and national correspondent, and in 2010 was named senior vice president and director of content for The Baltimore Sun, making her the first woman in The Sun’s long history to lead the newsroom. During her tenure, Corey spearheaded new print and digital sections while building on The Sun’s long tradition of investigative journalism. By providing readers with well-reported stories, effective graphics and affecting photos, she led The Sun to regional Newspaper of the Year honors in 2011 and 2012. What do Baltimore Sun interns do all day? Interns have all the rights, and responsibilities, of a Baltimore Sun journalist. That means they are expected to come up with story ideas, keep up with the news on their beat, be willing to collaborate with other interns and reporters and file in a timely manner. There are also formal and informal opportunities for interns to interact with the broader newsroom staff. What are some examples of stories authored by interns? Recent interns havecataloged the status of challenged books, profiled afamily’s push for accountabilityin a fatal public transit crash, andexplored potential solutionsto a rise in pedestrian deaths, just to name a few examples. Which desk will I work on? Interns have worked on the following desks: Features, Politics, Metro, Emerging News, Visuals, Sports, Data and Audience Engagement. In addition, an intern is usually placed at The Capital Gazette in Annapolis. If you have a preference please indicate it on your application. How many stories am I expected to file? It depends on which desk you are on. Some desks, such as Emerging and Metro, tend to file more stories per week than others. What have interns done after working at The Sun? Some, such asTim Schwartz,Kiersten HackerandBridget Byrne,are currently working for the company. Others have gone on to news organizations near and far. What if I have a question that’s not covered here? Email internship coordinator Molly Fellin Spence at mspence@baltsun.com **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** From scuba to Airbnb: Military plane originally meant for scuba-diving site diverts Liberty Road trafficFrom scuba to Airbnb: Military plane originally meant for scuba-diving site diverts Liberty Road traffic **From scuba to Airbnb: Military plane originally meant for scuba-diving site diverts Liberty Road traffic** **From scuba to Airbnb: Military plane originally meant for scuba-diving site diverts Liberty Road traffic** Baltimore teacher sues Libs of TikTok, Moms for Liberty, Maryland delegates over social media postsBaltimore teacher sues Libs of TikTok, Moms for Liberty, Maryland delegates over social media posts **Baltimore teacher sues Libs of TikTok, Moms for Liberty, Maryland delegates over social media posts** **Baltimore teacher sues Libs of TikTok, Moms for Liberty, Maryland delegates over social media posts** Two-vehicle crash in Western Howard County leaves one in hospital, closes lanesTwo-vehicle crash in Western Howard County leaves one in hospital, closes lanes **Two-vehicle crash in Western Howard County leaves one in hospital, closes lanes** **Two-vehicle crash in Western Howard County leaves one in hospital, closes lanes** Baltimore County redistricting commission narrowly approves new 9-district mapBaltimore County redistricting commission narrowly approves new 9-district map **Baltimore County redistricting commission narrowly approves new 9-district map** **Baltimore County redistricting commission narrowly approves new 9-district map** Inside Kevin Willard’s and Damon Evans’ chaotic exits: ‘Maryland got screwed’Inside Kevin Willard's and Damon Evans' chaotic exits: 'Maryland got screwed' **Inside Kevin Willard’s and Damon Evans’ chaotic exits: ‘Maryland got screwed’** **Inside Kevin Willard’s and Damon Evans’ chaotic exits: ‘Maryland got screwed’** Broken glass, gasoline: Catonsville pool vandalized by group of youthsBroken glass, gasoline: Catonsville pool vandalized by group of youths **Broken glass, gasoline: Catonsville pool vandalized by group of youths** **Broken glass, gasoline: Catonsville pool vandalized by group of youths** Protests against ICE ramp up in Baltimore after unrest in LAProtests against ICE ramp up in Baltimore after unrest in LA **Protests against ICE ramp up in Baltimore after unrest in LA** **Protests against ICE ramp up in Baltimore after unrest in LA** 5 & Dine: 5 pit beef sandwiches in Baltimore area5 & Dine: 5 pit beef sandwiches in Baltimore area **5 & Dine: 5 pit beef sandwiches in Baltimore area** **5 & Dine: 5 pit beef sandwiches in Baltimore area** Former Terps star guard to take Maryland-partnered NIL collective to courtFormer Terps star guard to take Maryland-partnered NIL collective to court **Former Terps star guard to take Maryland-partnered NIL collective to court** **Former Terps star guard to take Maryland-partnered NIL collective to court** Baltimore Nobel Prize winner theorizes on the universe, dark matter and the RavensBaltimore Nobel Prize winner theorizes on the universe, dark matter and the Ravens **Baltimore Nobel Prize winner theorizes on the universe, dark matter and the Ravens** **Baltimore Nobel Prize winner theorizes on the universe, dark matter and the Ravens** **More in About Us** 188 years of local news coverage: Happy anniversary, Baltimore Sun! **188 years of local news coverage: Happy anniversary, Baltimore Sun!** **188 years of local news coverage: Happy anniversary, Baltimore Sun!** Meet The Baltimore Sun’s intern class for 2025 **Meet The Baltimore Sun’s intern class for 2025** **Meet The Baltimore Sun’s intern class for 2025** 2022 November 30 JTF Publications, LLCCapital GazetteStudio 1847 Capital Gazette Studio 1847 Capital Gazette Studio 1847 Company InfoAbout UsContactMary J. Corey InternshipsPhoto ReprintsArchivesPrivacy PolicyEn EspanolTag DisclosuresSitemap About Us Contact Mary J. Corey Internships Photo Reprints Archives Privacy Policy En Espanol Tag Disclosures Sitemap About Us Contact Mary J. Corey Internships Photo Reprints Archives Privacy Policy En Espanol Tag Disclosures Sitemap AdvertisingClassifiedPublic NoticesThe Sun Store Classified Public Notices The Sun Store Classified Public Notices The Sun Store Subscribe Now Subscriber Terms and Conditions Terms of Service Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Baltimore Sun"}