{"id": 288, "name": "KRCC - NPR - Colorado Springs", "domain": "cpr.org/krcc", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.cpr.org/krcc/featured-stories-from-storycorps-visit-to-colorado-springs/", "title": "Featured Stories From Storycorps Visit To Colorado Springs", "content": "News Classical Indie 102.3 KRCC Politics Environment Justice Arts MusicClassicalIndie 102.3 Classical Indie 102.3 Classical Indie 102.3 Economy Education Denver Southern Colorado Audio & RadioWays to ListenShows and PodcastsCPR News Radio ScheduleCPR ClassicalIndie 102.3 Ways to Listen Shows and Podcasts CPR News Radio Schedule CPR Classical Indie 102.3 Ways to Listen Shows and Podcasts CPR News Radio Schedule CPR Classical Indie 102.3 NewslettersAll NewslettersThe LookoutDenverite All Newsletters The Lookout Denverite All Newsletters The Lookout Denverite About CPRMission & VisionStaff & HostsCareersStaff DEI ReportRecent AwardsPress RoomContact Us Mission & Vision Staff & Hosts Careers Staff DEI Report Recent Awards Press Room Contact Us Mission & Vision Staff & Hosts Careers Staff DEI Report Recent Awards Press Room Contact Us Ways to supportAll the ways to give!Login to the Member CenterMake a donationDonate your carCorporate sponsorshipCPR Shop All the ways to give! Login to the Member Center Make a donation Donate your car Corporate sponsorship CPR Shop All the ways to give! Login to the Member Center Make a donation Donate your car Corporate sponsorship CPR Shop News Community Calendar Schedule Newsletter KRCC Giveaways About Ways to support **Featured stories from StoryCorps’ visit to Colorado Springs** StoryCorps, the national nonprofit organization dedicated to recording, preserving and sharing the stories of people from all backgrounds and beliefs, came to Colorado Springs in June 2023 to record interviews, in-person and virtually, as part of its Mobile Tour. During the residency, the StoryCorps team parked its mobile recording studio at Plaza of the Rockies next to the Colorado Springs Pioneers Museum in downtown Colorado Springs. All were welcome to make a reservation to record an interview. The interviews below represent a small handful of the dozens of stories recorded in June. The ones listed here were edited for length and broadcast on KRCC. **Dominique Robbins and Rockie Sanders** Dominique Robbins (32) and his husband Rockie Sanders (61) discuss their love story, coming out as gay, and living in eastern Colorado. (Aired June 17, 2023.) **Shirley Martinez and Anabela Crooks** Friends Shirley Martinez (63) and Anabela Crooks (70) discuss the power of friendship between people of different backgrounds and perspectives. (Aired June 24, 2023.) **Wylene Carol and Floyd Tunson** Wylene Carol (81) and Floyd Tunson (76) reflect on Floyd's journey as a Colorado-based artist and their work together over the past 45 years. (Aired July 1, 2023.) **Joanna Fix and Forrest Fix** Joanna Fix (54) and her husband Forrest Fix (66) reflect on Joanna's experience living with early-onset Alzheimer's, their love and support for one another, and their dedication to \"living well.\" (Aired July 8, 2023.) **John Suthers** Former Colorado Springs Mayor John Suthers (71) shares his experience in public service, reflections on leadership, and stories from his childhood growing up in Colorado Springs and his experience of being adopted. (Airing July 27, 2023.) **Nolan, Jason and Marissa Bovee** Nolan Bovee (12) interviews his parents Jason Bovee (46) and Marissa Bovee (41) about their childhoods, their role as parents, and their memories together as a family. **Victoria Rubio and Elise-Hanielette Wee** KRCC intern Elise-Hanielette Wee (19) and her friend Victoria Rubio (18) talk about what friendship means to them and what they wish older people understood about their generation. **Monserrat Macias Moreno and Jackie Jaramillo** Monserrat Macias Moreno and her friend and mentor Jackie Jaramillo talk about their shared identity and hopes as Latinas despite being from different generations. **Natalie Johnson and Mark Wong** Natalie Johnson and her friend, potter Mark Wong, share art studio stories and talk about how Mark became a potter. **Helene and Dave Van Manen** Helene and Dave Van Manen share stories of a life together that took them from Brooklyn, New York, to Beulah, Colorado. **Yolanda Avila and Jackie Lujan** City Councilperson Yolanda Avila and her friend and mentee Jackie Lujan talk about community in southeast Colorado Springs. The StoryCorps residency in Colorado Springs was supported by Norwood Development Group. **Latest From KRCC** **Camping, fishing or motorbiking? Public asked to weigh in on the future of popular recreation area on the north side of Pikes Peak** **Camping, fishing or motorbiking? Public asked to weigh in on the future of popular recreation area on the north side of Pikes Peak** **Church central to Southern Colorado’s Black history in ‘The Dry’ gains national recognition** **Church central to Southern Colorado’s Black history in ‘The Dry’ gains national recognition** **Check out a dozen new murals and sculptures around downtown Colorado Springs as part of a new exhibition** **Check out a dozen new murals and sculptures around downtown Colorado Springs as part of a new exhibition** **Work is underway to put out a mining fire that’s burned for more than 20 years in Southern Colorado** **Work is underway to put out a mining fire that’s burned for more than 20 years in Southern Colorado** **719 Day: Show us how you love southern Colorado** **719 Day: Show us how you love southern Colorado** **Peak Curiosity** Whether you've lived in the Southern Colorado region all your life or you're brand new to the area,tell us what stories deserve to be told. **Listen to a Colorado Postcard** **Listen to a Colorado Postcard** Colorado Postcards are snapshots of our colorful state in sound. They give brief insights into our people and places, our flora and fauna, and our past and present, from every corner of Colorado.Listen now. **Excerpts from StoryCorps** StoryCorps visited Colorado Springs for the month of June 2023 to record stories from members of the community. KRCC is airing excerpts of some of the interviews on the radio.Listen to the stories and see photos of the storytellers. **Sign Up For Our Newsletters** Our newsletters bring you a closer look at the Southern Colorado stories that affect you and the music that inspires you. KRCC's Weekly Newsletter A Newsletter From The Climate Team Contact KRCC FCC Applications & Files Facebook Instagram **News That Matters, Delivered To Your Inbox** Our Mission Staff and Hosts Careers at CPR General Contest Rules FCC Applications & Files Contact Us Member Support Connect With CPR Opt Out of Targeted Advertising Ways to Listen Listening Help On-Air Schedule Make a Donation Donate Your Car Become a Sponsor Corporate Supporters CPR Shop © 2025 Colorado Public Radio. All Rights Reserved.Privacy Policy."}