{"id": 1091, "name": "The Patriot-News", "domain": "pennlive.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pennlive.com/steelers/2025/06/arthur-smith-sends-blunt-message-on-steelers-offense-after-aaron-rodgers-signing-didnt-do-it-to-run-the-wishbone.html", "title": "Arthur Smith Sends Blunt Message On Steelers Offense After Aaron Rodgers Signing Didnt Do It To Run The Wishbone.html", "content": "Steelers Schedule Best Sportsbooks Steelers Breakdown Podcast Pittsburgh Steelers **Arthur Smith sends blunt message on Steelers offense after Aaron Rodgers signing: ‘Didn’t do it to run the Wishbone’** Published:Jun. 11, 2025, 3:00 p.m. Pittsburgh Steelers offensive coordinator Arthur Smith, during 2025 Pittsburgh Steelers - OTAs Kylee Surike | Special to PennLiveKylee Surike Nick Farabaugh | nfarabaugh@pennlive.com PITTSBURGH --ThePittsburgh Steelersadded a ton of talent for offensive coordinator Arthur Smith, trading forDK Metcalfand now signing quarterbackAaron Rodgers. Yet, Smith admits the team this year, while wanting to run the ball more efficiently, will have a more natural focus on passing the football. In his words, they did not make these moves to go out there and run the Wishbone, which is a popular formation that includes a running quarterback and two running backs and a fullback. “You don’t bring Aaron (Rodgers) in here and sign DK (Metcalf) for all that money to go run the Wishbone.” Rodgers had 28 touchdowns to 11 interceptions in 2024. He went just 5-12 in his starts with the Jets, and even after they acquired Davante Adams, went just 3-8. It was a tough season for Rodgers, who also had multiple leg injuries. The Steelers think something remains in the tank for the former four-time MVP. They zeroed in on him as their target, as a result, especially after missing on re-signingJustin Fields. Now, Rodgers will be with the Steelers on a deal that will not break the bank, and could still land them another wide receiver to help Rodgers. Even at this stage of his career, with things on the downswing, Rodgers’ offenses still have a ton of spread personnel and will focus on passing the ball heavily. It seems that could indicate a shift for the Steelers in their philosophy with the explosive playmakers they have. **More Pittsburgh Steelers News** Pittsburgh Steelers lowballing teams in trade talks for a top playmaker, insider says Arthur Smith fires back at supposed drama between himself and Russell Wilson: ‘Fantastical narrative’ Top free agent wide receiver not interested in playing for Steelers: ‘Pittsburgh? No.’ DK Metcalf reacts to Steelers trading George Pickens, signing Aaron Rodgers: ‘It’s been a lot’ Pittsburgh Steelers name blazing-fast playmaker their WR2 If you purchase a product or register for an account through a link on our site, we may receive compensation.By using this site, you consent to ourUser Agreementand agree that your clicks, interactions, and personal information may be collected, recorded, and/or stored by us and social media and other third-party partners in accordance with ourPrivacy Policy. **Footer Navigation** Contact Us Send Us a News Tip PA Media Group The Patriot-News Advertise with Us Career Opportunities PennLive Community Rules Accessibility Statement PennLive The Patriot-News Newsletters Manage your Subscription Place a Vacation Hold Make a Payment Delivery Feedback Business Obituaries Jobs Autos Real Estate Rentals Classifieds Home News Sports PSU Football High School Sports Betting Entertainment Pa. Life & Culture Pa. Food & Dining Opinion iPhone, Android Apps Tablet Apps Weather News Archives Post a Job Post a Classified Ad Sell your Car Sell/Rent your Home Sponsor Content Community Partners Twitter Facebook Instagram RSS Your Privacy Choices Privacy Policy |User Agreement |Ad Choices **Disclaimer** Use of and/or registration on any portion of this site constitutes acceptance of ourUser Agreement, (updated 8/1/2024) and acknowledgement of ourPrivacy Policy,andYour Privacy Choices and Rights(updated 1/1/2025). ©2025Advance Local Media LLC. All rights reserved (About Us).The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Advance Local. Community Rulesapply to all content you upload or otherwise submit to this site. YouTube's privacy policyis availablehereandYouTube's terms of serviceis availablehere. Ad Choices"}