{"id": 1524, "name": "News1130 & City News", "domain": "vancouver.citynews.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://vancouver.citynews.ca/video/2025/06/11/mcleod-the-architect-crown-begins-closing-argument-in-hockey-player-sex-assault-trial/", "title": "Mcleod The Architect Crown Begins Closing Argument In Hockey Player Sex Assault Trial", "content": "Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAbout UsOur TeamWhere to Find UsCareers About Us Our Team Where to Find Us Careers About Us Our Team Where to Find Us Careers ContactContact UsSubmit News TipAdvertise With Us Contact Us Submit News Tip Advertise With Us Contact Us Submit News Tip Advertise With Us Newsletters News Insiders NewsAllLocalCanadaWorldLifestyleBusinessEntertainmentSports Local Canada World Lifestyle Business Entertainment Sports Local Canada World Lifestyle Business Entertainment Sports WatchAllLivestreamLatest Videos Livestream Latest Videos Livestream Latest Videos ListenAllListen LiveLatest Traffic ReportLatest Business ReportThe Big Story PodcastSeekr Audio AppAll Shows Listen Live Latest Traffic Report Latest Business Report The Big Story Podcast Seekr Audio App All Shows Listen Live Latest Traffic Report Latest Business Report The Big Story Podcast Seekr Audio App All Shows Weather Traffic Contests & EventsAllContestsGeneral Contest RulesEvents Contests General Contest Rules Events Contests General Contest Rules Events VancouverAllVancouverCalgaryEdmontonHalifaxKitchenerMontrealOttawaTorontoVancouverWinnipeg Vancouver Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg Vancouver Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAllAbout UsOur TeamWhere to Find UsCareers About Us Our Team Where to Find Us Careers About Us Our Team Where to Find Us Careers ContactAllContact UsSubmit News TipAdvertise With Us Contact Us Submit News Tip Advertise With Us Contact Us Submit News Tip Advertise With Us Newsletters News Insiders **Live Streaming** **Live Streaming 24/7** **McLeod the 'architect': Crown begins closing argument in hockey player sex assault trial** **Live Streaming 24/7** The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. 17h ago The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. 17h ago **Latest Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago **Live Streaming 24/7** The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. 17h ago The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. 17h ago **Latest Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago **Latest Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 10m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 9m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 1h ago **Most Popular Today** A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 10m ago The District of Squamish issued a local state of emergency Tuesday as a wildfire continues to burn at the north end of the town. Firefighters believe the wildfire is human-caused. Cecilia Hua has the latest. 6h ago The District of Squamish issued a local state of emergency Tuesday as a wildfire continues to burn at the north end of the town. Firefighters believe the wildfire is human-caused. Cecilia Hua has the latest. 6h ago B.C. Ferries has selected a Chinese state-owned shipyard to build its next generation of major vessels. 20h ago B.C. Ferries has selected a Chinese state-owned shipyard to build its next generation of major vessels. 20h ago A number of school districts across B.C. are dealing with funding shortfalls and that’s forcing far too many classes into portables. The problem is a major concern for New Westminster in particular. Our Jack Rabb has the story. 20h ago A number of school districts across B.C. are dealing with funding shortfalls and that’s forcing far too many classes into portables. The problem is a major concern for New Westminster in particular. Our Jack Rabb has the story. 20h ago A wildfire in Squamish has triggered an evacuation alert to cover around 100 homes in the Brackendale neighbourhood. Monika Gul has the latest from the scene. 21h ago A wildfire in Squamish has triggered an evacuation alert to cover around 100 homes in the Brackendale neighbourhood. Monika Gul has the latest from the scene. 21h ago Get the CityNews AppNow New and Improved! Listen to NewsRadio Vancouver live anytime and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews Vancouver anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Listen to NewsRadio Vancouver live anytime and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews Vancouver anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Listen to NewsRadio Vancouver live anytime and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews Vancouver anywhere you are – across all Android and iOS devices. Apple Store Google Play About Us News Policy Contact Us Advertise With Us Watch Citytv Ad Choices Privacy Policy Accessibility Feedback Political Ads Registry Terms of Service"}