{"id": 646, "name": "The Hill Times", "domain": "hilltimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.hilltimes.com/story/2025/06/09/carney-trails-predecessors-in-initial-approval-ratings-but-angus-reid-says-its-a-good-start-six-months-ago-very-few-canadians-even-knew-who-he-was/462985/", "title": "Carney Trails Predecessors In Initial Approval Ratings But Angus Reid Says Its A Good Start Six Months Ago Very Few Canadians Even Knew Who He Was", "content": "Menu News Opinion Archives Politics Foreign Policy Lobbying Legislation Policy Hill Life & People Public Service News Opinion Archives Politics Foreign Policy Lobbying Legislation Policy Hill Life & People Public Service Free Trial Get free News Updates SIGN IN SUBSCRIBE Free Trial Get free News Updates SIGN IN SUBSCRIBE Get free News Updates {email}AdministrationAccount SettingsLogout Administration Account Settings Logout Administration Account Settings Logout SUBSCRIBE Get free News Updates {email}AdministrationAccount SettingsLogout Administration Account Settings Logout Administration Account Settings Logout SUBSCRIBE Menu Home Page News Opinion Foreign Policy Politics Policy Legislation Lobbying Procurement Public Service Hill Life & People Hill Climbers Heard On The Hill Civil Circles Podcast: The Hot Room Calendar Archives Home Page News Opinion Foreign Policy Politics Policy Legislation Lobbying Procurement Public Service Hill Life & People Hill Climbers Heard On The Hill Civil Circles Podcast: The Hot Room Calendar Archives Free Trial Sign in Free Trial Sign in Free Trial Sign in Free Trial Sign in Canada’s Politics and Government News Source Since 1989 TRENDING: Top 50 Driving Foreign Policy Pipelines Defence spending Tim Powers Kirsten Hillman Bill C-5 GC Strategies audit Calendar Top 50 Driving Foreign Policy Pipelines Defence spending Tim Powers Kirsten Hillman Bill C-5 GC Strategies audit Calendar **Carney trails predecessors in initial approval ratings, but Angus Reid says it’s a good start: ‘six months ago, very few Canadians even knew who he was’** **Mark Carney's first approval rating (57 per cent) falls six points behind his predecessor Justin Trudeau's (63 per cent) and four points below Stephen Harper's (61 per cent), but Angus Reid also says nobody knew who Carney was before March. Some 29 per cent disapprove of Carney, and 15 per cent are unsure.** Sponsored content Discover Domaine du Vieux-Port: a waterside community in the heart of Gatineau **Discover Domaine du Vieux-Port: a waterside community in the heart of Gatineau** **When grain farmers grow, Canada grows.** **Become a Political Insider** By entering your email address you consent to receive email from The Hill Times containing news, analysis, updates and offers.You may unsubscribe at any time.See ourprivacy policy FOLLOW THE HILL TIMES: LICENSING PODCAST ALERTS LICENSING PODCAST ALERTS Want to make sure your whole office has the fullHill Timesexperience? We have team plans available for companies, organizations, classes, Parliament Hill offices and more.Fill out this form and find out if your team is eligible for a discount. More News **‘These events are big challenges’: Carney faces tough road to G7 joint communiqué in Kananaksis** **Enlisting Coast Guard to buoy defence spending expected to hit choppy waters, say analysts** **All eyes on Trump: meet the top 50 foreign policy influencers navigating Canada’s role in a rocky world** **The art of the deal: Ambassador Kirsten Hillman a deft hand in navigating Canada’s relationship with Trump** **Bitumen skepticism not a blanket ‘no’ to pipelines, says B.C. Liberal MP Greaves** **Federal government doesn’t know how many offices sit empty: AG** Auditor General Karen Hogan’s report says departments need to accelerate their efforts to reduce office space, and PSPS needs better data on the number of public servants using office space on a daily basis. **Federal government doesn’t know how many offices sit empty: AG** Auditor General Karen Hogan’s report says departments need to accelerate their efforts to reduce office space, and PSPS needs better data on the number of public servants using office space on a daily basis. **Ottawa’s climate adaptation plans ‘incomplete,’ and ‘neither systematic nor comprehensive,’ says Environment Commissioner** **Highlights from ‘fast-track’ Carney’s major defence pledge** **Digging into the One Canadian Economy Act** Most POPULAR 1Liberals lose Throne Speech vote **1** **1** 2Liberals sneak privacy law exemption into tax cut bill **2** **2** 3PMO staffers no longer allowed inside national Liberal caucus meetings, say Liberal MPs: ‘that’s how it should be’ **3** **3** 4Some shut-out Conservative candidates plan to press national councillors over 2025 nominations at upcoming convention **4** **4** 5Conservatives need to do some serious soul-searching **5** **5** 6Return of P&P Cabinet Committee signals Carney’s ‘government by cabinet’ with an ‘inner circle,’ say strategists **6** **6** 7Five more cabinet chiefs of staff confirmed **7** **7** 8Election? What election? **8** **8** Related Stories **Sport Secretary van Koeverden settles his chief of staff** **The urgency of confronting a warming world remains** **How will the Carney government navigate between fighting climate change and bending to corporate priorities? Only time will tell** **PM Carney, Minister Valdez raise Pride flag** **More cabinet chiefs of staff confirmed, as other staff hires begin rolling in** **Canadians deserve more than economic explanation for questionable G7 invites** Prime Minister Mark Carney has been moving quickly to make major changes to Canada’s economic landscape. But the problem with looking at everything through that lens is that some of the human element gets overlooked. **Canadians deserve more than economic explanation for questionable G7 invites** Prime Minister Mark Carney has been moving quickly to make major changes to Canada’s economic landscape. But the problem with looking at everything through that lens is that some of the human element gets overlooked. **News** Politics Foreign Policy Lobbying Legislation Policy Briefings Politics This Morning Hill Climbers Civil Circles Heard On The Hill Election Finance and Budget Public Service Exclusive Lists Parliamentary Calendar Top 100 Lists and Exclusive Features Podcasts This Week's Paper Search Archives Digital Newspaper Archives **Get free news updates** **Opinion** Andrew Caddell Sheila Copps David Crane Jim Creskey Gwynne Dyer Matt Gurney Michael Harris Erica Ifill Scott Taylor Joe Jordan Rose LeMay Alex Marland Gerry Nicholls Gar Pardy Tim Powers Susan Riley Douglas Roche Ken Rubin Josie Sabatino Bhagwant Sandhu Les Whittington Nelson Wiseman **Submit a guest opinion article** **resources** The Wire Report Hill Times Research Health The Lobby Monitor Parliament Now Inside Ottawa Directory Hill Times Careers The Hill Times Store Digital Newspaper Archives **Follow us** X BlueSky LinkedIn Flipboard **Advertise** Media Kit **subscribe** Group subscriptions Reuse and permissions **get help** About us Contact us Privacy Policy Reset Password Account settings © The Hill Times 2025 Politics Foreign Policy Lobbying Legislation Policy Briefings Politics This Morning Hill Climbers Civil Circles Heard On The Hill Election Finance and Budget Public Service Exclusive Lists Parliamentary Calendar Top 100 Lists and Exclusive Features Podcasts This Week's Paper Search Archives Digital Newspaper Archives Get free news updates Andrew Caddell Sheila Copps David Crane Jim Creskey Gwynne Dyer Michael Harris Erica Ifill Scott Taylor Joe Jordan Rose LeMay Alex Marland Gerry Nicholls Gar Pardy Tim Powers Susan Riley Douglas Roche Ken Rubin Bhagwant Sandhu Les Whittington Submit a guest opinion article The Wire Report Hill Times Research Health The Lobby Monitor Parliament Now Inside Ottawa Directory Hill Times Careers The Hill Times Store Digital Newspaper Archives Media Kit Group subscriptions Reuse and permissions About us Contact us Privacy Policy Reset Password Account settings © The Hill Times 2024 X BlueSky LinkedIn Flipboard Home Page News Opinion Foreign Policy Politics Policy Legislation Lobbying Procurement Public Service Hill Life & People Hill Climbers Heard On The Hill Civil Circles Podcast: The Hot Room Calendar Archives Home Page News Opinion Foreign Policy Politics Policy Legislation Lobbying Procurement Public Service Hill Life & People Hill Climbers Heard On The Hill Civil Circles Podcast: The Hot Room Calendar Archives Inside Ottawa Directory Hill Times Store Hill Times Careers The Wire Report The Lobby Monitor Parliament Now Inside Ottawa Directory Hill Times Store Hill Times Careers The Wire Report The Lobby Monitor Parliament Now Reuse & Permissions Advertising Reuse & Permissions Advertising Contact Us Log In Logout Contact Us Log In Logout {email} Account Settings Logout {email} Account Settings Logout"}