{"id": 96, "name": "Arms Control Association", "domain": "armscontrol.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.armscontrol.org/act/2025-06/news/china-russia-sharpen-golden-dome-missile-defense-critique", "title": "China Russia Sharpen Golden Dome Missile Defense Critique", "content": "**User Menu** Log in AboutContact UsOur Staff and BoardOur Commitment to DEI50 Years of AccomplishmentsSpecial ProjectsCareersInternships Contact Us Our Staff and Board Our Commitment to DEI 50 Years of Accomplishments Special Projects Careers Internships Contact Us Our Staff and Board Our Commitment to DEI 50 Years of Accomplishments Special Projects Careers Internships Arms Control TodaySubscribeArchived IssuesSubmissions & LettersFocus EditorialsInterviewsBook ReviewsBooks of NoteAdvertise With UsPermissions & Re-Print Requests Subscribe Archived Issues Submissions & Letters Focus Editorials Interviews Book Reviews Books of Note Advertise With Us Permissions & Re-Print Requests Subscribe Archived Issues Submissions & Letters Focus Editorials Interviews Book Reviews Books of Note Advertise With Us Permissions & Re-Print Requests ResourcesFact SheetsIssue BriefsMultimedia ResourcesPolicy White PapersResearch & ReportsTreatiesCountry Profiles Fact Sheets Issue Briefs Multimedia Resources Policy White Papers Research & Reports Treaties Country Profiles Fact Sheets Issue Briefs Multimedia Resources Policy White Papers Research & Reports Treaties Country Profiles Stay InformedArms Control NOWTake Action for a Safer WorldInside the Arms Control AssociationNuclear Disarmament MonitorP4+1 and Iran Nuclear Deal AlertEmerging TechnologyNorth Korea Denuclearization Digest Arms Control NOW Take Action for a Safer World Inside the Arms Control Association Nuclear Disarmament Monitor P4+1 and Iran Nuclear Deal Alert Emerging Technology North Korea Denuclearization Digest Arms Control NOW Take Action for a Safer World Inside the Arms Control Association Nuclear Disarmament Monitor P4+1 and Iran Nuclear Deal Alert Emerging Technology North Korea Denuclearization Digest PressPress RoomACA In The NewsExperts AvailablePublished Op-edsEvents & Remarks Press Room ACA In The News Experts Available Published Op-eds Events & Remarks Press Room ACA In The News Experts Available Published Op-eds Events & Remarks Support UsBecome a MemberMake a GiftMore Ways to GiveSubscribe to ACTGet the LatestLegacy Society Become a Member Make a Gift More Ways to Give Subscribe to ACT Get the Latest Legacy Society Become a Member Make a Gift More Ways to Give Subscribe to ACT Get the Latest Legacy Society **Login/Logout** Log in \"Though we have acheived progress, our work is not over. That is why I support the mission of the Arms Control Association. It is, quite simply, the most effective and important organization working in the field today.\" **China, Russia Sharpen ‘Golden Dome’ Missile Defense Critique** June 2025ByXiaodon Liang In an extended criticism of the Trump administration’s “deeply destabilizing” plans for a homeland missile defense shield, Beijing and Moscow allege that Washington is deliberately acquiring a “first strike” capability that creates “hardly surmountable obstacles to the constructive consideration of nuclear arms control and nuclear disarmament initiatives.” The accusation, contained in a May 8 joint statement on global strategic stability, came shortly before U.S. President Donald Trump unveiled further details of his “Golden Dome” missile defense system (SeeACT, March 2025). The new system “will be capable of intercepting missiles even if they are launched from other sides of the world and even if they are launched from space,” Trump announced May 20 at a White House press conference. Gen. Michael Guetlein, the vice chief of operations at the U.S. Space Force, will lead the Golden Dome program, Trump said. His comments focused primarily on a system of space-based interceptors for boost-phase intercept of adversary missiles, which Trump says will cost $175 billion and three years to complete. But in a separate statement issued by the Defense Department following the press conference, Defense Secretary Pete Hegseth said the Golden Dome will be a “system of systems” that “is designed to leverage some past investments.” “All of the systems comprising the Golden Dome architecture will need to be seamlessly integrated,” Hegseth said. It “will be fielded in phases, prioritizing defense where the threat is greatest.” Andrea Yaffe, the acting principal deputy assistant secretary of defense for space policy, told senators May 13 that the department has developed several missile defense architecture options, which were then presented by Hegseth to Trump. Yaffe spoke in response to questioning by Sen. Mark Kelly (D-Ariz.) in a hearing before the Strategic Forces subcommittee of the Senate Armed Services Committee. Although that key subcommittee is split over the merits of the president’s missile defense plan, senators acknowledged that a full assessment of the architecture would require more detail when the full defense budget arrives. The “economics don’t work,” said Sen. Angus King (I-Maine), the subcommittee’s ranking member, pressing Yaffe and other officials to explain how a missile defense shield could defend against a Chinese or Russian strike involving hundreds or thousands of missiles. At the request of the subcommittee, the Congressional Budget Office (CBO) published estimates May 5 indicating that a system of space-based interceptors would cost between $161 billion and $542 billion over 20 years, depending on requirements and design decisions. The CBO cautioned, however, that these estimates were derived from plans originally formulated to address the threat of “one or two [intercontinental ballistic missiles] ICBMs fired by North Korea.” Asked May 15 about the upper estimate of $542 billion at the POLITICO 2025 Security Summit, Gen. B. Chance Saltzman, the chief of space operations, said, “I’ve never seen an early estimate that was too high.” In their May 8 statement, Chinese President Xi Jinping and Russian President Vladimir Putin characterized the Golden Dome project as a rejection of the “inseparable interrelationship between strategic offensive arms and strategic defensive arms, which is one of the central and fundamental principles of maintaining global strategic stability.” The statement was issued during a visit by Xi to Moscow to attend commemorations of the 80th anniversary of the end of the Second World War in Europe and the founding of the United Nations. In past joint statements, the two countries have expressed brief concerns about U.S. missile defense plans. For example, in a June 2019 statement on strengthening contemporary global strategic stability, the two sides said that U.S. missile defense plans would have an “extremely negative effect on international and regional strategic balance, security and stability.” But the new statement from May 2025 is more specific and much lengthier, outlining concerns that the United States is developing the capability to use “high-precision conventional weapons or a combination of nuclear and non-nuclear weapon systems” to launch a strike against the strategic nuclear forces of Beijing or Moscow. Golden Dome would then, in this hypothetical scenario, intercept a “radically weakened retaliatory strike with air and missile defense assets.” The aspiration of the United States to “ensure an overwhelming military superiority … fundamentally contradicts the logic underlying the maintenance of strategic balance,” the joint statement claims. Although China and Russia have missile defense capabilities, neither country has articulated plans for large-scale homeland strategic missile defense. China has tested its Chinese Dongneng-3 interceptor against an intermediate-range target, while Russia maintains a local missile defense system around Moscow that can intercept a limited number of intercontinental ballistic missiles. The most advanced Russian mobile air and missile defense system, the S-500, is designed to intercept intermediate-range ballistic missiles. As an Atlantic Council report in February noted, Russian missile defense investments are focused on “protecting Russian leadership, critical command and control, and nuclear forces.” **Footer Top** Resources Donate About Contact Us Email Updates **Join the Arms Control Association** The Arms Control Association depends on the generous contributions of individuals who share our goal of promoting public understanding of and support for effective arms control policies. ACA is a nonpartisan, nonprofit membership organization, and your financial support makes a difference. Your membership comes with a 12-month subscription to Arms Control Today. 1100 H Street NW, #520Washington, DC 20005Tel: (202) 463-8270 | Fax: (202) 463-8273 **Footer Bottom** PRIVACY RESOURCES ARMS CONTROL TODAY BLOG ABOUT JOIN DONATE"}