{"id": 1679, "name": "CultureWatch", "domain": "billmuehlenberg.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://billmuehlenberg.com/2025/05/31/seven-indications-that-you-might-be-in-the-wrong-church/#comments", "title": "Seven Indications That You Might Be In The Wrong Church", "content": "CultureWatch Bill Muehlenberg’s commentary on issues of the day… Home Christianity Culture Wars Ethics Theology Testimonials About **Seven Indications That You Might Be in the Wrong Church** **Learn to discern where you worship:** Not all churches are equal. There are good churches, not so good churches, and just plain awful ones (usually fake ones). The genuine disciple of Christ will take care to only attend and/or become a member of a church that is above all God-centred, biblically-based, and committed to truth. Not all of them are. The following list offers a few signs of what a questionable if not harmful church might look like. Other matters might be raised here, but these seven indicators can help us to determine if a church is to be embraced or if it is to be eschewed. Here they are in no particular order: One.A selective use of Scripture – ignoring the hard texts of the Bible Just this morning I was reading Psalm 5 and I thought to myself: ‘Wow, there would be plenty of churches that would never touch a text like this. It would never be read or preached on in some churches.’ Psalm 5:4-6 says this: For you are not a God who delights in wickedness;evil may not dwell with you.The boastful shall not stand before your eyes;you hate all evildoers.You destroy those who speak lies;the Lord abhors the bloodthirsty and deceitful man. Obviously those churches which only preach on the love of God but never mention his holiness and righteousness will avoid a text like this big time. And so many other hard passages could be mentioned. Here are just a few more: Isaiah 1:13-15 Bring no more vain offerings;incense is an abomination to me.New moon and Sabbath and the calling of convocations—I cannot endure iniquity and solemn assembly.Your new moons and your appointed feastsmy soul hates;they have become a burden to me;I am weary of bearing them.When you spread out your hands,I will hide my eyes from you;even though you make many prayers,I will not listen;your hands are full of blood. Jeremiah 5:7-9 How can I pardon you?Your children have forsaken meand have sworn by those who are no gods.When I fed them to the full,they committed adulteryand trooped to the houses of whores.They were well-fed, lusty stallions,each neighing for his neighbor’s wife.Shall I not punish them for these things?declares the Lord;and shall I not avenge myselfon a nation such as this? Galatians 1:6-9 I am astonished that you are so quickly deserting him who called you in the grace of Christ and are turning to a different gospel—not that there is another one, but there are some who trouble you and want to distort the gospel of Christ. But even if we or an angel from heaven should preach to you a gospel contrary to the one we preached to you, let him be accursed. As we have said before, so now I say again: If anyone is preaching to you a gospel contrary to the one you received, let him be accursed. Revelation 2:20-23 But I have this against you, that you tolerate that woman Jezebel, who calls herself a prophetess and is teaching and seducing my servants to practice sexual immorality and to eat food sacrificed to idols.I gave her time to repent, but she refuses to repent of her sexual immorality. Behold, I will throw her onto a sickbed, and those who commit adultery with her I will throw into great tribulation, unless they repent of her works, and I will strike her children dead. And all the churches will know that I am he who searches mind and heart, and I will give to each of you according to your works. See more on this matter here:https://billmuehlenberg.com/2007/09/27/on-delivering-a-hard-word/ Two. A selective use of Scripture – ignoring the hard saying of Jesus Anyone who has actually read the four gospels will know just how hard and cutting Jesus could be. His words were NOT all sweetness and light. Here are several such passages, just from the gospel of Matthew: Matthew 7:13-14 Enter through the narrow gate. For wide is the gate and broad is the road that leads to destruction, and many enter through it. But small is the gate and narrow the road that leads to life, and only a few find it. Matthew 10:13-15 If the house is worthy, give it your blessing of peace. But if it is not worthy, take back your blessing of peace. Whoever does not receive you, nor heed your words, as you go out of that house or that city, shake the dust off your feet. Truly I say to you, it will be more tolerable for the land of Sodom and Gomorrah in the day of judgment than for that city. Matthew 12:33-34 Either make the tree good and its fruit good, or make the tree bad and its fruit bad, for the tree is known by its fruit. You brood of vipers! How can you speak good, when you are evil? For out of the abundance of the heart the mouth speaks. Matthew 22:11-14 “But when the king came in to look at the guests, he saw there a man who had no wedding garment. And he said to him, ‘Friend, how did you get in here without a wedding garment?’ And he was speechless. Then the king said to the attendants, ‘Bind him hand and foot and cast him into the outer darkness. In that place there will be weeping and gnashing of teeth.’ For many are called, but few are chosen.” These (and other texts like them) are not exactly very comforting or “nice” words. See more on this here:https://billmuehlenberg.com/2022/10/08/the-hard-sayings-of-jesus/ Three.Pushing the world’s agendas Instead of concentrating on biblical imperatives such as evangelism and making disciples, teaching and preaching the Word, and being salt and light, many questionable churches spend all their time simply parroting the agenda items found in theNew York Timesor theGuardian. Secular left political action and woke agenda items have replaced the biblical gospel. In many of these churches it is all about hating the West, dumping on Trump, condemning the free market, demonising Israel, and waging war on marriage, family, and biblical notions of human sexuality. Inside and outside of these “churches” there will be plenty of Palestinian flags, homosexual flags, trans flags, and so on. They make it perfectly clear where their allegiances lie, and it is not with Scripture. It is the gospel according to Marx, not Mark. See this article for more on this:https://billmuehlenberg.com/2020/06/12/secular-humanists-pretending-to-be-christians/ Four. Over-emphasis on entertainment When you enter a place and you cannot tell if it is a Christian church or a disco or a rock concert, you might want to reconsider staying there. Transforming a church into a place with black walls, strobe lights, smoke machines and rock bands is of limited value. Perhaps it might work on a Saturday night for young people. But to make it a way of life is questionable. Too often it is where folks come mainly just to rock out and get an emotional high. Too often there is little or no sense of actually worshipping a holy God – something that should drive us to our knees in holy fear and trembling. I am not saying there is never a place for these sorts of services, but I have to go along with A. W. Tozer here: It is now common practice in most evangelical churches to offer the people, especially the young people, a maximum of entertainment and a minimum of serious instruction. It is scarcely possible in most places to get anyone to attend a meeting where the only attraction is God. One can only conclude that God’s professed children are bored with Him, for they must be wooed to attend a meeting with a stick of striped candy in the form of religious movies, games and refreshments. See more on this here:https://billmuehlenberg.com/2015/12/18/todays-churches-entertainment-heavy-holiness-light/ Five.Over-emphasis on money I was once part of a church that preached sermons on money – but basically just one Sunday out of the whole year! That is about the right balance. But at some churches it seems you hear about money incessantly – each and every week. And the emphasis is usually on pouring your money into that particular church or that particular leader. Often it becomes cult-like wherein guilt trips are thrown out at folks who might dare to be selective in where and how they share their finances for the Kingdom. If a pastor says you must give to him in order to be blessed, as with so much of the Prosperity Gospel preaching, then you are likely in the wrong place. See more on this here:https://billmuehlenberg.com/2015/03/14/fleecing-the-flock-of-god/ Six.Over-emphasis on the leader or head honchos The biblical leader is of course to be a servant leader. They are to model Christ, and they are to serve those they are ministering to. But we all know of leaders who like to lord it over others, who like the limelight and all the attention, and who basically want to be seen among men, as the Pharisees of old did. There are many faithful, humble and Christlike leaders – we need to go with them. But too often there are church leaders who run things like a secular business, employing secular models of getting things done. And too often they relish living a lavish lifestyle and expect to be treated like kings. That is not the sort of leadership that the Bible teaches. See more on this issue here:https://billmuehlenberg.com/2011/06/06/4670/ Seven.Over-emphasis on feelings and emotions with an underemphasis on teaching and doctrine We are whole persons so we are to love God with all of our being. That includes our minds as well as our emotions. But too often feelings trump facts and solid biblical teaching. Too often churches can seek to manipulate folks emotionally, instead of training them mentally and volitionally with sound doctrine. The importance of correct theology and regular biblical teaching is found throughout the New Testament, especially in the Pastoral Epistles. But too often in too many churches there is no solid meat, just sentimental storytelling, TED talks, self-help sermonettes, and feel-good moralising. If the Bible is not being taught carefully and consistently, including the various doctrinal truths that we need to know and understand, you might be in the wrong place. See more on this here:https://billmuehlenberg.com/2016/01/06/dealing-with-cults/ There would be many more tell-tale signs and indications that a church is to be avoided like the plague. Indeed, some of the signs I mention above can also be used to describe what a cult is like, and why it should be stayed well clear of. See more on this here:https://billmuehlenberg.com/2016/01/06/dealing-with-cults/ I am not saying we should avoid all churches until we find the perfect one. There is no perfect church. And as the old joke goes, as soon as you join a perfect church, it no longer will be! But a good, biblical church will seek to avoid at least most of the points I mentioned above. Sure, they may well still have issues in various ways. All churches do, because all believers do. But if too many of the warning signs start flashing, as per my seven signs above, you might need to reconsider if this is the right church for you and your family. [1896 words] **Related Posts:** Tozer on Worship, Part Two Christians and Personal Empire Building The Disco Church Churches and the Homeless Encouraging Bible Passages: 2 Chronicles 7:1-3 A Review of God vs Government. By Nathan Busenitz… Church: What Is It Good For? A Review of Double-Minded: How Sex is Dividing the… Three Cheers For Division How NOT To Help Others Theology, Worship and Devotion: A Package Deal Stockholm Syndrome Christianity You Might Not Be a Christian If… On Dependency and Need The Church and the Cult of Youth A Review of Five Lies of Our Anti-Christian Age. By… Theology, Prayer and Devotion Asbury, Revival and Jonathan Edwards Dumb Memes, Quotes and Posts, #17 Charles Colson and the Cultural Commission **Published byBill Muehlenberg** View all posts by Bill Muehlenberg **Post navigation** **5 Replies to “Seven Indications That You Might Be in the Wrong Church”** Annette Nestorsays:May 31, 2025 at 5:15 pmGreat article Bill. Do you have the book, “Churches that Abuse”, by Ronald M. Enroth? I’ve just finished reading that. What I found enlightening was that many of the cults started out as seemingly quite good churches, but when the leadership went off track it was difficult for the people to leave. Enroth uses specific case studies disclosing a number of reasons why the members stayed in them for far too long. A good read, but heartbreaking at the same time. Great article Bill. Do you have the book, “Churches that Abuse”, by Ronald M. Enroth? I’ve just finished reading that. What I found enlightening was that many of the cults started out as seemingly quite good churches, but when the leadership went off track it was difficult for the people to leave. Enroth uses specific case studies disclosing a number of reasons why the members stayed in them for far too long. A good read, but heartbreaking at the same time. Great article Bill. Do you have the book, “Churches that Abuse”, by Ronald M. Enroth? I’ve just finished reading that. What I found enlightening was that many of the cults started out as seemingly quite good churches, but when the leadership went off track it was difficult for the people to leave. Enroth uses specific case studies disclosing a number of reasons why the members stayed in them for far too long. A good read, but heartbreaking at the same time. Bill Muehlenbergsays:May 31, 2025 at 5:19 pmMany thanks Annette. Yes I do – I will have to dig it out and revisit it. Many thanks Annette. Yes I do – I will have to dig it out and revisit it. Many thanks Annette. Yes I do – I will have to dig it out and revisit it. Margaret Belousoffsays:May 31, 2025 at 9:51 pmGreat article thanks Bill! Great article thanks Bill! Great article thanks Bill! Bill Muehlenbergsays:May 31, 2025 at 10:09 pmThanks Margaret. Thanks Margaret. Thanks Margaret. Michael Weekssays:Jun 1, 2025 at 8:56 amAmen!We want to lead people, which means taking them from where they are with the huge immoral influence of the world and lead them into the glorious peace of Truth – not an easy task.When a person’s eyes are in darkness it is difficult for them to face the light, so there has to be time for people to adjust and we all come with baggage that we often do not want to leave behind.Patience is definitely necessary (thank God He has been patient with me) but Truth remains Truth and any effort to cherry-pick truth or mix it with worldly ideas is simply deceit and will inevitably foment evil.As far as entertainment goes I wish we could simply return to singing songs of rejoicingJames (Yacob) 5:13“Is any among you afflicted? Let him pray. Is any cheerful? Let him sing psalms.”These and of course praising God corporately and having teaching, are why we gather. When two or more are gathered there is God in the midst and this makes the prayer, teaching and praise more powerful as God joins with the synergy of people. Amen! We want to lead people, which means taking them from where they are with the huge immoral influence of the world and lead them into the glorious peace of Truth – not an easy task. When a person’s eyes are in darkness it is difficult for them to face the light, so there has to be time for people to adjust and we all come with baggage that we often do not want to leave behind. Patience is definitely necessary (thank God He has been patient with me) but Truth remains Truth and any effort to cherry-pick truth or mix it with worldly ideas is simply deceit and will inevitably foment evil. As far as entertainment goes I wish we could simply return to singing songs of rejoicing James (Yacob) 5:13 “Is any among you afflicted? Let him pray. Is any cheerful? Let him sing psalms.” These and of course praising God corporately and having teaching, are why we gather. When two or more are gathered there is God in the midst and this makes the prayer, teaching and praise more powerful as God joins with the synergy of people. Amen! We want to lead people, which means taking them from where they are with the huge immoral influence of the world and lead them into the glorious peace of Truth – not an easy task. When a person’s eyes are in darkness it is difficult for them to face the light, so there has to be time for people to adjust and we all come with baggage that we often do not want to leave behind. Patience is definitely necessary (thank God He has been patient with me) but Truth remains Truth and any effort to cherry-pick truth or mix it with worldly ideas is simply deceit and will inevitably foment evil. As far as entertainment goes I wish we could simply return to singing songs of rejoicing James (Yacob) 5:13 “Is any among you afflicted? Let him pray. Is any cheerful? Let him sing psalms.” These and of course praising God corporately and having teaching, are why we gather. When two or more are gathered there is God in the midst and this makes the prayer, teaching and praise more powerful as God joins with the synergy of people. **Leave a Reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Δ **LATEST VIDEO** **Related Posts** Theology, Worship and Devotion: A Package Deal A Review of God vs Government. By Nathan Busenitz… On Dependency and Need Encouraging Bible Passages: 2 Chronicles 7:1-3 Three Cheers For Division **Contribute** CultureWatch is a faith ministry and I get no salary. If you want to contribute financially, here are two methods: Donate with Paypal: Bank Deposit: For those wishing to contribute to this ministry by direct debit, here are our banking details: Westpac Banking CorporationRingwood Central, Vic.BSB #: 733349Account #: 613094Name: W J and A A Muehlenberg Many thanks for helping to make this ministry possible and helping it to continue. **About CultureWatch** We live in an age where we see evidence of cultural decline, the erosion of values, the decline of civility, the denial of truth and the elevation of unreason. Many people are asking, “Where is our culture heading?” This website is devoted to exploring the major cultural, social and political issues of the day. It offers reflection and commentary drawing upon the wealth of wisdom found in the Judeo-Christian tradition. It offers reflective and incisive commentary on a wide range of issues, helping to sort through the maze of competing opinions, worldviews, ideologies and value systems. It will discuss critically and soberly where our culture is heading.Happy reading! Bill Muehlenberg **Categories** Africa(40) Apologetics(902)Theodicy(145) Theodicy(145) Theodicy(145) Article Reviews(1,492) Asia(70) Bibliographies(110) Book Reviews(828) Books and Reading(36) Christianity(4,496)Missions and Evangelism(33)Notable Christians(212)Persecution(625)Revival(31) Missions and Evangelism(33) Notable Christians(212) Persecution(625) Revival(31) Missions and Evangelism(33) Notable Christians(212) Persecution(625) Revival(31) Culture Wars(2,572)Co-belligerency(17) Co-belligerency(17) Co-belligerency(17) Economics(233)Debt Relief(5)Foreign Aid(15)Woke Capitalism(23) Debt Relief(5) Foreign Aid(15) Woke Capitalism(23) Debt Relief(5) Foreign Aid(15) Woke Capitalism(23) Education(257)\"Safe Schools\"(48)Homeschooling(21) \"Safe Schools\"(48) Homeschooling(21) \"Safe Schools\"(48) Homeschooling(21) Ethics(2,218)Abortion(435)Bioethics(134)Capital Punishment(26)Drugs(36)Euthanasia(69)Homosexuality(1,017)Immigration, Asylum, Refugees(67)Polyamory(48)Pornography(72)Prostitution(28)Sex Education(60)Sexuality(336)Slavery(14)Transgenderism(297) Abortion(435) Bioethics(134) Capital Punishment(26) Drugs(36) Euthanasia(69) Homosexuality(1,017) Immigration, Asylum, Refugees(67) Polyamory(48) Pornography(72) Prostitution(28) Sex Education(60) Sexuality(336) Slavery(14) Transgenderism(297) Abortion(435) Bioethics(134) Capital Punishment(26) Drugs(36) Euthanasia(69) Homosexuality(1,017) Immigration, Asylum, Refugees(67) Polyamory(48) Pornography(72) Prostitution(28) Sex Education(60) Sexuality(336) Slavery(14) Transgenderism(297) Europe(302) Family(1,043)Childcare(24)Children and Young People(439)Divorce(38)Feminism(104)Marriage(469) Childcare(24) Children and Young People(439) Divorce(38) Feminism(104) Marriage(469) Childcare(24) Children and Young People(439) Divorce(38) Feminism(104) Marriage(469) Health and Medical Issues(494)Coronavirus(286)Vaccines(125) Coronavirus(286) Vaccines(125) Coronavirus(286) Vaccines(125) History(480)Colonialism(8) Colonialism(8) Colonialism(8) Interfaith Dialogue(74) International Relations(224) Islam(648)Chrislam(17) Chrislam(17) Chrislam(17) Israel and the Middle East(132) Law and Legal Issues(527)\"Conversion Therapy\"(31) \"Conversion Therapy\"(31) \"Conversion Therapy\"(31) Literature, the Arts, and Entertainment(231) Marxism, Communism, Socialism(268)Critical race theory(13) Critical race theory(13) Critical race theory(13) Media(298) Miscellany(89) Multiculturalism(90) New Age Movement and Eastern Religions(49) People(271) Philosophy(143) Political Correctness(693) Politics(1,254)Libertarianism(15)Resistance Theory(130)The Great Reset(50) Libertarianism(15) Resistance Theory(130) The Great Reset(50) Libertarianism(15) Resistance Theory(130) The Great Reset(50) Popular Culture(147) Population Issues(51) Postmodernism(18) Quotations(285) Science and the Environment(278)The Greens(55)Vegans(3) The Greens(55) Vegans(3) The Greens(55) Vegans(3) Sermons and Devotionals(1,551) Social Issues(1,788) Terrorism(328) The Church(1,183)The Emergent Church(42) The Emergent Church(42) The Emergent Church(42) The Puritans(23) Theology(1,558)Bible Study Tools(83)Christology(45)Common Grace and the Cultural Mandate(14)Cults and Aberrant Religious Groups(33)Difficult Bible Passages(179)Dumb Theology Posters(35)Encouraging Bible Passages(2)Eschatology(73)Hermeneutics(23)Openness Theism(10)Scripture(106)Soteriology(98)The Attributes of God(118)The Health and Wealth Gospel(99)The Hyper Grace Message(26) Bible Study Tools(83) Christology(45) Common Grace and the Cultural Mandate(14) Cults and Aberrant Religious Groups(33) Difficult Bible Passages(179) Dumb Theology Posters(35) Encouraging Bible Passages(2) Eschatology(73) Hermeneutics(23) Openness Theism(10) Scripture(106) Soteriology(98) The Attributes of God(118) The Health and Wealth Gospel(99) The Hyper Grace Message(26) Bible Study Tools(83) Christology(45) Common Grace and the Cultural Mandate(14) Cults and Aberrant Religious Groups(33) Difficult Bible Passages(179) Dumb Theology Posters(35) Encouraging Bible Passages(2) Eschatology(73) Hermeneutics(23) Openness Theism(10) Scripture(106) Soteriology(98) The Attributes of God(118) The Health and Wealth Gospel(99) The Hyper Grace Message(26) Transhumanism(31) War and Peace(145) Worldviews(514) **Commenting Rules** Readers are welcome to post comments on the material posted here, but some simple rules apply: No trolls allowed I reserve the right to refuse comments. This site is meant to express my point of view. If you are looking for a soapbox to promote your own views, create your own website or blog site. Comments should be brief (preferably under 100 words), polite, constructive and informed. Comments which are simply attacks on myself, or are done in bad taste, or use rude language, or are possibly defamatory will not be posted. You must state your full name to have your comments posted. I may reply to some of your comments but will not be able to respond to all. Needless to say, not everything found in the comments posted here are points of view I approve of or agree with. If you are happy to abide by these rules, then by all means, send in your comments.Happy writing! **Latest Books** Purchase from Bill Muehlenberg Purchase at Amazon.comPurchase at Koorong.com Purchase from Bill Muehlenberg Purchase at Amazon.comPurchase at Koorong.com Purchase from Bill Muehlenberg Purchase at Amazon.com Purchase at Koorong.com Purchase from Bill Muehlenberg Purchase at Amazon.comPurchase at Koorong.com **Copyright** Bill Muehlenberg. All rights reserved"}