{"id": 723, "name": "The Journal (West Virginia)", "domain": "journal-news.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.journal-news.net/classifieds/housing/rent/apartment/wesley-village-apts-accepting-applications-for-the-waitlist/ad_43a902b0-0ba1-5b68-b7a5-70e66aae89a3.html", "title": "Wesley Village Apts Accepting Applications For The Waitlist", "content": "Sign Up Log In Dashboard Logout My AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Home Business Local News Real Estate Life Multimedia Special Sections Weather forecast Read obituaries Place an Obituary (paid) Our View Editorial Cartoons Letters to the Editor Local columns National columns The Journal Junction Local Sports Sports Columns Search and browse events Post your event Classifieds Place a classified ad Yard Sales & Auctions Jobs Local Notices Place a Public Notice WV Legals About BOB Vote & Nominate See the Winners & Top 5 On Guru 2024 Winners 2023 Winners 2022 Winners 2021 Winners Staff Subscribe Today's Paper Submit News Login Notices 86°SunnyMartinsburg, WV(25404)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 5:38 pmFull Forecast Martinsburg, WV(25404)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 5:38 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 5:38 pm Full Forecast Martinsburg, WV(25404)TodayClear to partly cloudy. Low 61F. Winds light and variable..TonightClear to partly cloudy. Low 61F. Winds light and variable.Updated: June 11, 2025 @ 5:38 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 5:38 pm Clear to partly cloudy. Low 61F. Winds light and variable.. Clear to partly cloudy. Low 61F. Winds light and variable. Updated: June 11, 2025 @ 5:38 pm Full Forecast Sign Up Log In Dashboard Logout My AccountMy AccountDashboardProfileSaved itemsLogout My Account Dashboard Profile Saved items Logout My Account Dashboard Profile Saved items Logout Site searchSearch Site searchSearch Site searchSearch Login HomeHome Home Home NewsBusinessLocal NewsReal EstateLifeAnniversariesEngagementsFaithHealth and FitnessHome and GardenIn Our NeighborhoodReunionsSenior LivingSunday LivingWeddingsMultimediaSpecial SectionsWeather forecast Business Local News Real Estate LifeAnniversariesEngagementsFaithHealth and FitnessHome and GardenIn Our NeighborhoodReunionsSenior LivingSunday LivingWeddings Anniversaries Engagements Faith Health and Fitness Home and Garden In Our Neighborhood Reunions Senior Living Sunday Living Weddings Multimedia Special Sections Weather forecast Business Local News Real Estate LifeAnniversariesEngagementsFaithHealth and FitnessHome and GardenIn Our NeighborhoodReunionsSenior LivingSunday LivingWeddings Anniversaries Engagements Faith Health and Fitness Home and Garden In Our Neighborhood Reunions Senior Living Sunday Living Weddings Anniversaries Engagements Faith Health and Fitness Home and Garden In Our Neighborhood Reunions Senior Living Sunday Living Weddings Multimedia Special Sections Weather forecast ObituariesRead obituariesPlace an Obituary (paid) Read obituaries Place an Obituary (paid) Read obituaries Place an Obituary (paid) OpinionOur ViewEditorial CartoonsLetters to the EditorLocal columnsNational columnsThe Journal Junction Our View Editorial Cartoons Letters to the Editor Local columns National columns The Journal Junction Our View Editorial Cartoons Letters to the Editor Local columns National columns The Journal Junction SportsLocal SportsSports Columns Local Sports Sports Columns Local Sports Sports Columns EventsSearch and browse eventsPost your event Search and browse events Post your event Search and browse events Post your event Class & LegalsClassifiedsPlace a classified adYard Sales & AuctionsJobsLocal NoticesPlace a Public NoticeWV Legals Classifieds Place a classified ad Yard Sales & Auctions Jobs Local Notices Place a Public Notice WV Legals Classifieds Place a classified ad Yard Sales & Auctions Jobs Local Notices Place a Public Notice WV Legals Today's Paper Best of the BestAbout BOBVote & NominateSee the Winners & Top 5 On Guru2024 Winners2023 Winners2022 Winners2021 Winners About BOB Vote & Nominate See the Winners & Top 5 On Guru 2024 Winners 2023 Winners 2022 Winners 2021 Winners About BOB Vote & Nominate See the Winners & Top 5 On Guru 2024 Winners 2023 Winners 2022 Winners 2021 Winners Specials Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Wesley Village Apts Accepting applications for the waitlist** Facebook Twitter WhatsApp SMS Email Print Copy article link **Details forWesley Village Apts Accepting applications for the waitlist** 17 hrs ago Wesley Village 75 Jennings Drive Martinsburg WV 25404 Accepting applications for the waitlist 1BR including disabled apartments in Berkeley County Contact Site Manager at 304 267-3823 M-F 9am till 3:30pm TDD #711 Rents Income Based This is an Equal Housing Opportunity Provider and Employer. Info Bedrooms1 Apartment **Online Poll** **Local Events** Post community events for FREE from your user dashboard. No subscription required. Jun11Exercise at Anna Mae Reedy CenterWed, Jun 11, 2025Anna Mae Reedy CenterFree Jun11Cash BingoWed, Jun 11, 2025Anna Mae Reedy Senior Center13.00 Jun11Ice Cream Social with Tuscarora RuritanWed, Jun 11, 2025Tuscarora RuritanFree Jun12Berkeley Arts Council Juried Show \"Art and Earth\" OpenThu, Jun 12, 2025Cathy Maxwell- Berkeley Arts CouncilFree Jun12Spay/neutering offered for pets at Spay TodayThu, Jun 12, 2025Spay Today Jun12Wii Bowling ChampionshipThu, Jun 12, 2025Anna Mae Reedy CenterFree Jun12Inwood Chapter of “TOPS ClubThu, Jun 12, 2025St. Leo's Catholic Church$4 month >> More events >> Post an event **Most Popular Articles** EPTA releases plans for new routes coming 2026 Charles Town ready for annual WV Fest Richard Wayne Jenkins HD Media president, former lawmaker Doug Skaff dead at 48 Shepherdstown to Honor Beeline March, Celebrate Democracy on June 14 Berkeley County Crime Report George Karos June Dolores Welsh The Old Opera House prepares for an excited summer of performances Miscarriage of Justice: Prosecuting Attorney group comes out against criminal charges for miscarriages Home Corrections Life News Obituaries Opinion Special Sections Sports Online Features Subscribe Submission Forms Classifieds Place an Ad Business Directory Calendar Search Weather Advertising Terms and Policies Facebook Twitter Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: **Starting at $4.30/week.** **Subscribe Today** **Subscribe Today**"}