{"id": 2144, "name": "The Source Newspaper (La Source)", "domain": "thelasource.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://thelasource.com/cover-story/2025/05/27/circolo-abruzzese-celebrates-italian-heritage-month-preserving-cultural-identity-across-generations/", "title": "Circolo Abruzzese Celebrates Italian Heritage Month Preserving Cultural Identity Across Generations", "content": "Cover Stories Social Culture Events Columns Latest Digital Edition Français **Columns** Verbatim Behind the Media My Turn Spencie's View Issues & Ideas Left Bank Postcard Recipes Street Photography by Denis Bouvier Photo Mosaic Focus on Local Artist **Social** Community Economy Health Immigration International LGBTQ Local Obituary Religion Sports Transport **Culture** Art Comedy Dance Documentaries Festivals Literature Movies Music Political Theatre Facebook X Instagram YouTube **Circolo Abruzzese celebrates Italian Heritage Month – Preserving cultural identity across generations** Luc Mvono Luc Mvono Circolo Abruzzese’s Festa D’Autunno 2024. “When you meet someone from Abruzzo, you start talking about the cities around there and the events” says Sandro Federico, vice-president of Circolo Abruzzese. “It’s just a commonality that you have, and it [brings you back] to your [roots] a little bit more.” The Society is looking forward to celebratingFesta Della Repubblica(June 2), Italian Day on the Drive (June 8) and a Mother’s and Father’s Day celebration (June 20). For decades, Circolo Abruzzese has created opportunities to discover and reminisce their members’ roots in Abruzzo, which is often culturally considered as part of Southern Italy. Rooted in a desire to build strong intergenerational connections, the organization has hosted Christmas parties, summer picnics and mother day’s celebrations. “I remember growing up [and] going to these events and playing with my cousins and meeting friends,” recalls Federico. “I want to have that for my children. It just helps maintain our heritage.” In 1966, the organization – then known as ‘Abruzzese of Vancouver’ – was officially formed at the suggestion of Father Luigi Falone, an Abruzzese missionary vacationing in Vancouver. Prior to its formalization, Circolo Abruzzese was a simple gathering for a few Abruzzese immigrants in Vancouver seeking connection. “It started off as a social club, back in the 60s…for my dad and his friends just to stay in touch with his friends andpaisani(fellow Abruzzese),” recalls Federico. “My inspiration is giving back to my parents and showing that I want to continue their legacy.” Since its founding, the volunteer-supported organization has been active in the Lower Mainland to champion Abruzzese culture. Their work focuses on transmitting the culture’s values of resilience and togetherness. “It’s like being away from Vancouver and meeting someone who is from Vancouver… and that feeling of being connected, like they are your neighbour….” says Federico, explaining the significance of cultural connections. “And then, you’re raising children and when you have the same values, it just makes things easier.” The organization’s dual focus on cultural preservation and community support has been at the heart their work since its founding in the 1960s. They will celebrateFesta Della Repubblica(Republic Day) on June 2. Organized by Il Centro Italian Cultural Centre, the event marks an Italian national holiday commemorating the 1946 referendum that saw Italy’s transition from a monarchy to a republic. “We don’t actually host theFesta Della Repubblica; we just attend as a vendor,” Federico adds. “We go and we cook, we bake traditional cookies, and we give them away after the ceremony.” The ceremony will discuss Italian heritage, and the Centre plans to serve traditional Italian food, including pasta and risotto. The celebrations will continue June 8 at Italian Day on the Drive, an annual event featuring various communities of Vancouver’s Italian diaspora. Participants can look forward to diverse food, live music, fashion and family-friendly fun, including a pasta-eating contest and life-sized human foosball. Circolo Abruzzese will be among the many vendors enlivening the 15th edition of the festival, serving grilled Italian sausages andarrosticini(lamb skewers). The organization will also host a raffle for attendees to win a soccer jersey signed by Lorenzo Insigne, who represented Italy in the 2014 FIFA World Cup and the UEFA European Championships in 2016 and 2020. “We can get stuck working for [our] nine to five job every day, and [the] years will fly by,” Federico reflects. “But when you make it a point to show up once a month, show up to a picnic and set up the event, and thousands of people come to your booth to buy a sausage and are engaged; it makes you feel good.” To end the month of celebration, the Society is hosting an Abruzzese-style dinner (June 20), this time, for a combined celebration of Mother’s and Father’s Day. The dinner will be hosted at Trattoria on 3075 Slocan Street and welcomes members and non-members alike to celebrate family over an intimate meal. Circolo Abruzzese’s almost 60 years of engagement serve a purpose beyond social gatherings: they also reflect an enduring identity and values that have survived both time and distance. True to their vision of community, Circolo Abruzzese frequently collects funds in support of Vancouver-based charities, such as Canuck Place and Children’s Variety Club. “I want to grow the club so that my kids see how connected we are and how we can help volunteer and donate,” says Federico. The organization also awardsan annual scholarship for post-secondary students in B.C. with Abruzzese roots. Federico hopes to connect the organization with other similar groups and foster an environment for promoting Italians in business. They will host their annual picnic later in the summer at Burnaby’s Confederation Park. “We have games for kids, and we host a mini-soccer tournament for kids,” he shares. “We also do an alumni soccer game for the older guys, we do giveaways. A portion of the money we raise are donated to various charities that the club members vote on.” Leveraging his background in digital marketing, the vice-president also plans to lean into technology, building new partnerships and drawing in a new generation to champion Abruzzese culture in Vancouver. “I also want to support local businesses and grow the club with more active, younger members,” says Federico. “Our seniors are getting older, and they can’t do the things that they could do before.” For more information on Circolo Abruzzese of Vancouver, seewww.circoloabruzzese.ca/events For details on Italian Day on the Drive, seewww.italianday.ca **Content to Discover** **A Kitsilano tradition: Greek Day returns to Broadway with food, music and fun** **A Kitsilano tradition: Greek Day returns to Broadway with food, music and fun** **Circolo Abruzzese celebrates Italian Heritage Month - Preserving cultural identity across generations** **Circolo Abruzzese celebrates Italian Heritage Month - Preserving cultural identity across generations** **Calling for a better Canada MOSAIC’s passion for immigration positivity** **Calling for a better Canada MOSAIC’s passion for immigration positivity** **Art for the community: Co. ERASGA celebrates 25 years** **Art for the community: Co. ERASGA celebrates 25 years** **Most Popular** **Echoes of Home - Connecting with Girmitiya history** **Echoes of Home - Connecting with Girmitiya history** **More than employment, YWCA’s Believe program offers community** **More than employment, YWCA’s Believe program offers community** **A Kitsilano tradition: Greek Day returns to Broadway with food, music and fun** **A Kitsilano tradition: Greek Day returns to Broadway with food, music and fun** **Circolo Abruzzese celebrates Italian Heritage Month - Preserving cultural identity across generations** **Circolo Abruzzese celebrates Italian Heritage Month - Preserving cultural identity across generations** **Speak your mind** We welcome appropriate, unsolicited editorial submissions if accompanied by the author’s real name, address and telephone number.We also welcome your comments and suggestions, by mail or email. We welcome appropriate, unsolicited editorial submissions if accompanied by the author’s real name, address and telephone number. We also welcome your comments and suggestions, by mail or email. We welcome appropriate, unsolicited editorial submissions if accompanied by the author’s real name, address and telephone number. We also welcome your comments and suggestions, by mail or email. **About Us** The Team Contact Us The Newspaper **Mailing Address** Denman Place PO Box 47020,Vancouver BC V6G 3E Denman Place PO Box 47020,Vancouver BC V6G 3E Denman Place PO Box 47020,Vancouver BC V6G 3E **Telephone** 604-682-5545 604-682-5545 604-682-5545 **Email** [email protected] [email protected] [email protected] **Funded by the Government of Canada** Facebook X Instagram YouTube"}