{"id": 1906, "name": "Cambridge Analytica", "domain": "cambridgeanalytica.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://cambridgeanalytica.org/services/#predicitive-analysis", "title": "#predicitive Analysis", "content": "About Products Services Careers News Contact **Better audience targeting** Communication has changed. Blanket advertising no longer provides viable ROI for every campaign. Big data revolutionized the way organizations identify and locate their best prospects. But data alone isnï¿½t enough. Cambridge Analytica is building a future where every individual can have a truly personal relationship with their favorite brands and causes by showing organizations not just where people are, but what they really care about and what drives their behavior. **Powered by smarter data modeling** At Cambridge Analytica we use data modeling and psychographic profiling to grow audiences, identify key influencers, and connect with people in ways that move them to action. Our unique data sets and unparalleled modeling techniques help organizations across America build better relationships with their target audience across all media platforms. **OCEAN Personality Model** We use the established scientific OCEAN scale of personality traits to understand what people care about, why they behave the way they do, and what really drives their decision making. Understand your unique personality type: Take our test **Services** **Services** Our comprehensive range of analytics and engagement services are proven game changers that deliver smart solutions and produce real results. **DataAcquisition** **DataAcquisition** **Predictive Analytics** **Predictive Analytics** **Audience Insight** **Audience Insight** **Digital Marketing** **Digital Marketing** **Products** **Products** Our product set lets you control every aspect of your audience engagement by building crucial information flows and behavioral connections. **Careers** Weï¿½re always interested in hearing from people at all levels who think they have something unique to add to the Cambridge Analytica team. **HR Business Partner** The purpose of the role is to provide HR operational and strategic support to the New York & Washington, DC offices. **Senior Political and Corporate Communications Strategist (UK-based with frequent assignments overseas)** We are seeking senior full-time Corporate and Political Strategists to work in our London office. This is an opportunity for the right people to contribute their talents to a unique organisation working at the intersection of social science, public policy, opinion research, behavioural psychology, ï¿½big dataï¿½ and strategic communications. **Business Development Director** We are currently seeking experienced, highly motivated, tenacious and goal oriented business development professionals to join our Business Development team as Business Development Director. **Data Engineer** Weï¿½re looking for an experienced Data Engineer to join our team, working across a range of commercial and political projects. **Data Scientist** Weï¿½re looking for an experienced Data Scientist to join our team, working across our research and data modeling projects. Home About Products Services Careers Contact News medical recruit news HR Business Partner Senior Political and Corporate Communications Strategist (UK-based with frequent assignments overseas) Business Development Director Data Engineer Data Scientist 597 5th Avenue7th FloorNew York, NY 10017 ny@cambridgeanalytica.org Phone: +1 (646) 892 9591 1901 Pennsylvania Ave NWSuite 902Washington, DC 20006 dc@cambridgeanalytica.org Phone: +1 (703) 997 1812 55 New Oxford StreetLondon, WC1A 1BS london@cambridgeanalytica.org Phone: +44 (0)20 3828 7529 We've worked with brands, political organizations and advocacy groups all over the world, and our methodology has been approved by the UK Ministry of Defence, the US State Department, Sandia and NATO."}