{"id": 395, "name": "Education Week", "domain": "edweek.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://marketbrief.edweek.org/regulation-policy/if-the-feds-cut-funding-here-are-the-products-and-services-school-districts-say-are-most-vulnerable/2025/05", "title": "If The Feds Cut Funding Here Are The Products And Services School Districts Say Are Most Vulnerable", "content": "Education Market Financing & Investment Meeting District Needs Product Development Regulation & Policy Sales & Marketing Strategy & Operations Downloadable Guide Exclusive Data Industry Insight K-12 Dealmaking K-12 Insider K-12 Market News Market Analysis Purchasing Alert Special Report Terms of Use Privacy Policy Nov. 3-5 Summit Data & AnalysisExclusive DataIndustry InsightK-12 DealmakingK-12 InsiderMarket TrendsPurchasing AlertSpecial Report Exclusive Data Industry Insight K-12 Dealmaking K-12 Insider Market Trends Purchasing Alert Special Report Exclusive Data Industry Insight K-12 Dealmaking K-12 Insider Market Trends Purchasing Alert Special Report Events & WebinarsFall 2025 SummitWebinarsQuarterly BriefingsJune Virtual Forum Fall 2025 Summit Webinars Quarterly Briefings June Virtual Forum Fall 2025 Summit Webinars Quarterly Briefings June Virtual Forum TopicsEducation MarketFinancing & InvestmentMeeting District NeedsProduct DevelopmentRegulation & PolicySales & MarketingStrategy & OperationsAll Topics Education Market Financing & Investment Meeting District Needs Product Development Regulation & Policy Sales & Marketing Strategy & Operations All Topics Education Market Financing & Investment Meeting District Needs Product Development Regulation & Policy Sales & Marketing Strategy & Operations All Topics MoreEdBiz NewsletterK-12 Market NewsVideosDownloadable Guides EdBiz Newsletter K-12 Market News Videos Downloadable Guides EdBiz Newsletter K-12 Market News Videos Downloadable Guides Education Week **If the Feds Cut Funding, Here Are the Products and Services School Districts Say Are Most Vulnerable** Share article RemoveSave to favoritesSave to favorites Print District and school leaders are making plans for what products and services they may be forced to cut if the federal government slashes their funding. Among the areas they’re most likely to target for reductions are: professional development, computing devices, social-emotional learning, and social studies, a newEdWeek Market Briefsurvey finds. And some K-12 leaders say in interviews that they’re already choosing to end or pause these vendor contracts now, rather than wait to see what the Trump administration decides to do with the federal K-12 budget. “Assuming [they’ll receive] level funding is the best-case scenario,” said Noelle Ellerson-Ng, associate executive director for advocacy and governance atAASA, The Schools Superintendents Association. “What I’m hearing from superintendents, anecdotally, is they’re reading the tea leaves.” Uncertainty around the future of federal Title programs, as well as smaller grants, could have a significant impact on the K-12 marketplace, despite those dollars making up a relatively small amount — around 9% — of total education funding. **About This Series** Over the past few months the Trump administration has terminated hundreds ofgrants and contracts supporting teacher preparation and education and research; nixed the ability of districts and states to spend hundreds of millions of dollars in pandemic relief funds; andthreatened to withhold a pivotal source of federal funding — Title I money— to school districts that don’t comply with the White House’s preferred restrictions on DEI practices. More than two-thirds of education company officials, 68%, say their clients regularly use Title I dollars to pay for their products or services, a recent survey conducted forEdWeek Market Briefby the EdWeek Research Center survey found. Superintendents also generally look to protect staff and programs focused directly on students, leaving the less foundational products and services many vendors provide on the chopping block. Their instinct is to focus on scaling back “the areas that least directly impact student instruction,” said Ellerson-Ng, adding that “if you’re funded last, you’re probably one of the first things to cut.” EdWeek Market Briefis publishing the results of a nationally representative, online survey of 157 district leaders and 126 school leaders, conducted in March and April by the EdWeek Research Center, on which programs, specifically, are likely be targeted if federal support for K-12 is reduced. This story is the second in anongoing series of stories byEdWeek Market Brieflooking at the downstream impact of the Trump administration’s proposals on school district budgets and policy, and on the companies serving the nation’s school systems. The findings reveal that a wide range of programs and supports could be at risk, if the Trump administration takes an axe to federal K-12 spending. **Professional Development Is Vulnerable** The survey asked district and school leaders to select from a list of products and services that may see reductions if their federal funding is delayed or cut over the next year. Many of their choices were in areas that districts had invested heavily over the last few years using pandemic-era federal stimulus aid. Professional development rises to the top of that list, with 62% saying their district would cut that spending back if federal funding is delayed or cut over the next year. Reduced spending on computing devices and summer learning are each being considered by 44% of administrators. And 43% say their district would cut back on mental health and wellness resources. Tutoring — which boomed in recent years — would also see reduced spending, according to 39% of respondents. Lower on the list of reductions are learning management systems, with 16% of K-12 officials saying they will spend less on this product category, and parent/teacher communication tools, 13%. (Districts may not have the option to cut learning management systems — given the central role they play — even if they wanted to do so.) And fewer district and school leaders are considering cuts to vendor-provided assessments (11%), student information systems (11%), cybersecurity (11%), and student safety measures (11%). It’s not surprising that spending related to safety and digital access are less likely to see spending reductions, said Ellerson-Ng, from AASA. That’s become a baseline requirement for districts. “If you can’t safely get online, if you can’t safely protect your student data, you can’t run your system from day one,” she said. **‘An Inevitability’** Superintendents across the country have been trading ideas about what they would be forced to cut, if federal funding took a hit, said Quintin Shepherd, superintendent of Pflugerville Independent School District in Texas, who has been a district chief for more than two decades. His conversations generally align with the survey findings. His district, which serves around 25,000 students in the suburbs of Austin, has cut some contracts and paused others for now. “Until we get some verification that the funding is going to flow, we cannot, at this point in time and in good faith, move forward,” he said. The district is trying to protect early literacy and numeracy, Shepherd said, but other areas are likely to see spending reductions, including professional development. That’s a consequence of particular concern. School districts can do without some trainings, or fewer trainings, or fewer staff members focused on PD. But he cautions against only considering the short-term implications of those reductions. **Join Us for EdWeek Market Brief's Virtual Forum** “What happens to teachers who don’t have the level of professional development that they’ve had in the past?” Shepherd said. It will make it harder to recruit and retain teachers, he fears. If changes in federal funding means he has to cut spending on PD — while teachers’ needs remain the same — Shepherd said he will be looking to the market for solutions. These could include AI tools, so that teachers can still receive hands-on PD at a much lower cost, he said. “Districts are going to have to look at these options,” he said. “I’m just talking about an inevitability.” **Which Instructional Resources Are at Risk?** In a separate question, the survey asked about reductions to instructional resources and curricula, specifically. When it comes to those types of materials, the largest percentage of district and school leaders, 55%, say they would substantially reduce spending on social-emotional learning if their federal funding is delayed or cut over the next year. Nearly a third would cut back spending on social studies (32%) and science resources (31%). Cuts to foreign language and personal finance resources are also being eyed by 30% and 26% of administrators, respectively. About a quarter of K-12 officials say reading/English language arts resources would also see reduced spending — 25% at the secondary level and 24% for elementary schools, respectively. Roughly the same portion of respondents, 24%, see career-technical education as vulnerable. Lower on the list are cuts to math resources, with 22% of administrators saying those materials may face spending reductions at the secondary level and 19% saying the same for elementary schools. Only 19% of respondents say they wouldn’t expect to reduce spending on any vendor-provided instructional resource, if their federal funding is decreased or disrupted. **‘I’ll Believe it When I See it’** This list of items that may see cuts rings true to Rick Cobb, the superintendent of Mid-Del Schools in Oklahoma, which is already facing some of these decisions. It makes sense that spending on math is lower on the list of potential reductions than other items, like social studies and SEL, because math scores are a significant piece of how schools are evaluated by the public and state. The importance of those scores mean K-12 leaders will see math resources as something they need to protect, he said. Cobb’s district, which serves more than 12,000 students in Oklahoma City, receives a significant amount of federal funding, which represents about 18% of its overall budget. He’s watching to see what happens in Washington D.C. very closely. The Trump administration has said multiple times that major grants like Title I and IDEA, which supports special education, will be preserved despite its efforts to eliminate the federal education department and greatly reduce federal spending. But Cobb says so much has happened so quickly that his mindset is: “I’ll believe it when I see it.” “They haven’t taken it out from under us yet, but who is to say they won’t tomorrow?” he said. With that in mind, Cobb said district leadership is trying to hold off on some decisions. They’re not cutting anything at the moment, he said — but they aren’t making purchases either. “What we’re trying to do is make sure that we have a healthy fund balance to carry over into the next fiscal year, so that all of the unpredictability is calculated into our plan of operations,” Cobb said. “We’re not investing in a lot of new stuff right now.” If federal dollars are reduced or delayed, the district’s first priority will be saving as many of its federally funded staff positions as possible. Those roles make up about 20% of the district and range from counselors to lunch staff, Cobb said. “Any kind of ed-tech solution is probably going to be hard to justify when you’re cutting staff,” he said. Takeaways: A broad array of products and services — including instructional resources — could be at risk of getting cut if the Trump administration slashes federal funding. Vendors whose products are vulnerable — in areas like PD, summer learning, SEL, devices, and more — should be prepared to make their case. And, if there are alternate sources of money, it could be a good time to set in motion plans to direct schools to those resources. twitter email linkedin **Data Debrief: How the Trump Administration Is Changing the K-12 Market** **Most Popular** **Related** **Sign up for our EdW Market Brief Alerts** **Webinars & Quarterly Briefings** **EdWeek Market Brief offers actionable K-12 intel for business leaders powered by original data, research, and reporting.** **Read Next** About EdW Market Brief Contact Customer Service Get EdW Market Brief Do Business With Us Terms of Use Privacy Policy twitter linkedin"}