{"id": 1051, "name": "New York Observer", "domain": "observer.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://observer.com/2025/05/review-hugh-jackman-tells-tales-out-of-school-in-sexual-misconduct-of-the-middle-classes/", "title": "Review Hugh Jackman Tells Tales Out Of School In Sexual Misconduct Of The Middle Classes", "content": "Business Art Lifestyle Culture BusinessFinanceMediaTechnologyPolicyWealthInsightsInterviews Finance Media Technology Policy Wealth Insights Interviews Finance Media Technology Policy Wealth Insights Interviews ArtsArt FairsArt MarketArt ReviewsAuctionsGalleriesMuseumsInterviews Art Fairs Art Market Art Reviews Auctions Galleries Museums Interviews Art Fairs Art Market Art Reviews Auctions Galleries Museums Interviews CultureTheaterOperaDanceFilmInterviews Theater Opera Dance Film Interviews Theater Opera Dance Film Interviews LifestyleNightlife & DiningStyleTravelGift GuidesInterviews Nightlife & Dining Style Travel Gift Guides Interviews Nightlife & Dining Style Travel Gift Guides Interviews Power IndexNightlife & DiningBusiness of ArtA.I.PR Nightlife & Dining Business of Art A.I. PR Nightlife & Dining Business of Art A.I. PR AboutAbout ObserverAdvertise With Us About Observer Advertise With Us About Observer Advertise With Us **Review: Hugh Jackman Tells Tales Out of School in ‘Sexual Misconduct of the Middle Classes’** **A rare chance to see the movie star’s relaxed natural charm up close in the Minetta Lane Theatre as he plays a professor entangled with a young woman in Hannah Moscovitch’s engaging two-hander.** Hugh Jackman: Do Stand So Close to Me.Not a rejected title for the Wolverine actor’s residency atRadio City Music Hall. One would be hard-pressed to get within screaming distance of the star at that airplane hangar. Any fan of the Police will clock my allusion their 1980 hit, about a schoolteacher tormented by an affair with a student. InHannah Moscovitch’s engagingSexual Misconduct of the Middle Classes, Jackman does indeed play a professor entangled with a young woman enrolled in his lit class. Here’s the meta kicker, though: at the relatively teensy Minetta Lane Theatre, audiences can enjoy an intimate view of the Oz icon as he entertains 300-plus of us within leg-hugging distance. (Don’t hug his leg.) **Sign Up For Our Daily Newsletter** Thank you for signing up! By clicking submit, you agree to our <a href=\"http://observermedia.com/terms\">terms of service</a> and acknowledge we may use your information to send you emails, product samples, and promotions on this website and other properties. You can opt out anytime. After so many years shredding fasciae at the gym or scowling in front of green screens, Jackman must savor the chance to simply stroll onstage, not pause for an ovation, and act. His 11-month turn inThe Music Manon Broadway notwithstanding, it’s a relief to see the gifted actor use his soothing voice and agile body in the service of nuanced, adult storytelling. Canadian writer Moscovitch has structured her two-hander (which premiered in Toronto in 2020) primarily as a monologue delivered by successful novelist Jon Macklem (Jackman), interspersed with dialogues between him and 19-year-old Annie (Ella Beatty). Over the course of 85 minutes, Jon recalls a chapter in his life when he was teaching at an unnamed college while separated from his third wife. He’s struggling with his latest book (lumberjacks at the turn of the century) when the image of girl wearing a red coat pops into his head; he realizes this is Annie, a moon-faced nymph in his class who, it turns out, is a fan. First there’s a meet-weird on Jon’s front lawn as Annie interrupts his mowing of the grass with halting, elliptical small talk. Turns out her student housing is close enough to Jon’s house that he can see her window from his front porch (surely there’s a campus policy about that). Jon is charmed and perhaps a little annoyed by Annie’s spacey, deadpan speech, until she drops this confession: “I want the living version of the feeling I get when I read your work.” Speaking his love language—whether it’s a calculated seduction or simply the truth—Annie begins to chip away at the wall of propriety that Jon has maintained between himself and his students. That is, if we take him at word: He sees temptation, but has laughed it off in the past. Does Jackman play a reliable narrator? As Moscovitch’s story reveals itself as a series of authorial Russian dolls, we begin to question who’s telling this story, and whose story is being told. At first, we might assume that Jon is cannibalizing his experiences for fiction; he doesn’t describe his actions with “I did” but “he did,” as if shifting the voice to third person absolves him of responsibility for crossing an ethical line. His defining character trait is the desire to live a respectable, bourgeois life (hence the title) and not become a stereotypical reckless artist. Ian Ricksonhas directed Jackman before, notably in the atmospheric Jez Butterworth drama,The Riveron Broadway a decade ago, and he again brings out the movie star’s relaxed, natural charm and humor, in his native Aussie accent. Beatty has the harder task of bringing a naïve cipher to life, and her mannered deer-frozen-in-the-headlights affect can grow repetitive. Unless the character is medicated or neurodivergent or simply millennial, we could use more fleshing out from the playwright, or added quirk/warmth/slyness from the performer. The line-to-line writing is smart and self-aware, if also prone to purple passages—which we might blame on either Jon or Moscovitch. As they make love (a cruder expression is warranted) inside his parked car, Jon indulges in this sub-Rothian reflection: “Annie clutched him and the whole time she had dark life in her eyes—depth, depth—alongside a certain odd knowing look: the blankness was gone, and he suddenly wondered if that blankness had been…youth?” Blankness replaced by darkness: talk about an unsentimental education. In spite of the odd wince-inducing moments, the script moves fast and scores laughs, driven by genuine erotic heat between its attractive leads. The physical production looks tasteful and spare, with stylish wooden furnishings fromBrett J. BanakisandChristine Jones, flattering and oft-removed couture by Ásta Bennie Hostetter, and story-supporting lights and sound byIsabella ByrdandMikaal Sulaiman.Sexual Misconductruns in repertory with a new version of August Strindberg’sCreditors, also directed by Rickson, and also centered on the messy implosion of a relationship. Liev Schreiber and Maggie Siff star in that. Coproduced by Audible and the newly formed Together—a company that presents new work in intimate venues free of commercial expectations—the shows are drawing crowds, for obvious celebrity reasons. Let’s hope less famous names get the spotlight, once Jackman heads back to Radio City and the MCU. Sexual Misconduct of the Middle Classes| 1hr 25mins. No intermission. |Minetta Lane Theatre| 18 Minetta Lane |Buy Tickets Here SEE ALSO: Review: Not-Such-Happy Campers Vacation with Bereavement in ‘Grief Camp’ ARTSArt FairsArt MarketArt ReviewsAuctionsGalleriesMuseums Art Fairs Art Market Art Reviews Auctions Galleries Museums Art Fairs Art Market Art Reviews Auctions Galleries Museums BUSINESSEnergyFinanceMediaPolicyTechnologyClimate Energy Finance Media Policy Technology Climate Energy Finance Media Policy Technology Climate CULTUREBooksDanceFilmOperaTheater Books Dance Film Opera Theater Books Dance Film Opera Theater LIFESTYLEAutosHotelsNightlife & DiningRestaurantsStyleTravel Autos Hotels Nightlife & Dining Restaurants Style Travel Autos Hotels Nightlife & Dining Restaurants Style Travel WEALTHBillionairesPartiesPhilanthropyReal Estate Billionaires Parties Philanthropy Real Estate Billionaires Parties Philanthropy Real Estate EXPERT INSIGHTSA.I. ExpertsArt Market ExpertsClimate ExpertsFinance Experts A.I. Experts Art Market Experts Climate Experts Finance Experts A.I. Experts Art Market Experts Climate Experts Finance Experts POWER LISTSPR Power ListNightlife & DiningBusiness of ArtA.I. Power List PR Power List Nightlife & Dining Business of Art A.I. Power List PR Power List Nightlife & Dining Business of Art A.I. Power List INTERVIEWSArt WorldBusiness LeadersTastemakersEntertainers Art World Business Leaders Tastemakers Entertainers Art World Business Leaders Tastemakers Entertainers ABOUT ADVERTISE CONTACT NEWSLETTERS RSS FEEDS SITEMAP TERMS PRIVACY Privacy Terms Cookie Settings Do not sell my data **We noticed you're using an ad blocker.** We get it: you like to have control of your own internet experience.But advertising revenue helps support our journalism.To read our full stories, please turn off your ad blocker.We'd really appreciate it. **How Do I Whitelist Observer?** Below are steps you can take in order to whitelist Observer.com on your browser: **For Adblock:** Click the AdBlock button on your browser and selectDon't run on pages on this domain. **For Adblock Plus on Google Chrome:** Click the AdBlock Plus button on your browser and selectEnabled on this site. **For Adblock Plus on Firefox:** Click the AdBlock Plus button on your browser and selectDisable on Observer.com."}