{"id": 269, "name": "Consortium News", "domain": "consortiumnews.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://consortiumnews.com/2025/06/06/palantirs-value-soars-with-dystopian-spy-tool-that-will-centralize-data-on-americans/", "title": "Palantirs Value Soars With Dystopian Spy Tool That Will Centralize Data On Americans", "content": "**Main menu** AboutArchivesAssange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos ArchivesAssange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Assange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Bob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos CN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos ArchivesAssange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Assange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Bob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos CN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos Assange HearingsBob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Bob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos CN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos Bob Parry’s Weekly HighlightsCN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos CN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos CN Live!October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos October Surprise SeriesParry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos Parry Archives 2009-2018Parry Video InterviewsVIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos Parry Video InterviewsVIPS Memos VIPS Memos VIPS Memos **Palantir’s Value Soars With Dystopian Spy Tool that Will Centralize Data on Americans** By contracting the surveillance firm to agglomerate the U.S. population’s personal data across government agencies, the White House has turbo-charged the company’s value,Kit Klarenberg reports. (The Grayzone) ByKit KlarenbergThe Grayzone During an end-of-year investor call this February, Palantir CEO, co-founder and militant Zionist Alex Karpbraggedthat his company was making a financial killing by enabling mass murder. “Palantir is here to disrupt and make the institutions we partner with the very best in the world and, when it’s necessary, to scare enemies,” he stated, adding: “And on occasion, kill them.” CIA seed front company Palantir’s CEO Alex Karp brags about how good business is to shareholders while admitting .. “When it’s necessary to scare enemies and on occasion kill them .. And we hope you’re in favor of that” Right before he dumped $1.23 Billion in company stockpic.twitter.com/gLdiMLS4xj — Nightwatch N8 (@NightwatchN8)February 20, 2025 On this front, Karp claimed Palantir was “crushing it,” and he professed to be “super-proud of the role we play, especially in places we can’t talk about.” Karp went on to predict social “disruption” ahead that would be “very good for Palantir.” “There’s a revolution. Some people are going to get their heads cut off,” he warned, suggesting that his firm was producing the most vital technology enabling elites to restore control during the coming unrest. Denver-based Palantir [which specializes in software platforms for big-data analytics] is already playing a decisive role in the besieged Gaza Strip, whereits productsassist Israel’s application of a ferocious AI targeting system known asLavenderwhich directs its ongoing genocide. In the face of public protest, Karp hasacknowledgedthat he is directly involved in killing Palestinians in Gaza, but insisted the dead were “mostly terrorists.” Karp at the World Economic Forum in May 2022 in Davos-Klosters, Switzerland.(World Economic Forum / Flickr, CC BY-NC-SA 2.0 ) At the start of January, theovertly pro-Israelifirm’s board of directors gathered in Tel Aviv for its first meeting of the new year. Since then, its financial fortunes have improved dramatically. Throughout May, Palantir’s stockexploded, making it the S&P 500’s top-performing company. On June 2, Palantir’s share price hit anall-time high, a year-on-year jump of 512 percent, turbocharging the company’s market value to roughly $311 billion. Driving this abrupt burst of investor exuberance was a series of lucrative deals signed with multiple U.S. government agencies since Donald Trump took office, and the expectation Palantir will ink massive contracts going forward. Domestic Mass Surveillance & Pentagon Targeting OnMay 30,The New York Timespublished a lengthy probe linking these deals to anexecutive ordersigned by U.S. President Donald Trump in March, calling for seamless, mass sharing of data across government agencies through a Palantir application called Foundry. The report did not explain to readers how Palantir emerged as a small startup thanks to sponsorship from the C.I.A.’s venture capital wing,In-Q-Tel, which gifted Peter Thiel’s company $2 millionin 2004.Instead, the paper leaned in to a partisan angle playing on Democratic fears that Trump could abuse a unified database to target political foes. Thiel at the 2022 Converge Tech Summit in Scottsdale, Arizona.(Gage Skidmore, CC BY-SA 2.0) Nonetheless, theTimesprovided valuable insight into Palantir’s penetration of a vast array of U.S. government agencies, by raking in more than $113 million in federal government spending since Trump took office, on top of “additional funds from existing contracts as well as new contracts with the Department of Homeland Security and the Pentagon.” In late May, the company’s existing contract with the Department of Defense wasbeefed upby $795 million, bringing it to an eye-popping total award of $1.3 billion. Palantir currently provides the Pentagon with AI targeting software known asMaven, which it uses in battlefields from Syria to Yemen to Ukraine and beyond. The contract will last until at least May 2029. The Trump administration’s fondness for Palantir has placed its data analytics and storage toolFoundryin at least four federal agencies, including the DHS and Health and Human Services Department. Talks are also apparently ongoing with the Social Security Administration and Internal Revenue Service to adopt the resource. This would facilitate merging all these agencies’ datasets. PleaseDonatetothe SpringFundDrive! According to theTimes, Palantir was selected to deliver on Trump’s order to enhance intradepartmental data sharing by Elon Musk’s Department of Government Efficiency. At least three DOGE members previously worked at the company, while two others have worked at Thiel-funded firms. The outlet cited leaked screenshots indicating DHS officials exchanged emails with DOGE in February about merging citizen records, while quoting nameless Palantir employees worrying “about collecting so much sensitive information in one place,” particularly given the allegedly “sloppy” approach to security of “some DOGE employees.” Musk with Trump on May 30 at a departure ceremony for the DOGE adviser in the Oval Office.(White House/Molly Riley) While focusing heavily on the risks posed by Trump’s embrace of Palantir technology, theTimesacknowledged in passing the company “has long worked” with different branches of the U.S. federal government, including the Centers for Disease Control and Prevention. In February 2022, Palantir was enlisted by the Biden administration to manage Covid vaccine distribution. Meanwhile, in April, Immigration and Customs Enforcement’s “removal operations team”gave Palantir$30 million “to build a platform to track migrant movements in real time.” Karp, for his part, has infuriated Trump’s base by boasting during aninterview in Davos, Switzerland, in 2023 that he “singlehandedly stopped the rise of the far-right in Europe” through an application called PG. The following February, heclaimedbefore an audience at the Future Investment Initiative Institute that by supposedly stopping “innumerable terror attacks” across Europe, Palantir prevented the resurgence of fascism. “I love when I’m getting yelled at in cities in Europe,” Karp declared. “Keep yelling at me… the only reason why someone’s not goose-stepping between me and you is my product,” he laughed. CIA agent and head of Palantir Alex Karp says his company’s software “single-handedly” stopped the “far right” in Europe. Founded in 2003 with funding from the CIA’s In-Q-Tel program, Palantir’s only client before 2008 was the CIA.pic.twitter.com/Shq0uA5x16 — Reed Cooley (@ReedCooley)May 31, 2025 Privatized National Security State Backbone For years, Palantir has been at the heart of U.S.-led efforts to neutralize Iran’s alleged nuclear program. It has created a predictive analytical tool dubbed Mosaic for the purpose, used by the International Atomic Energy Agency and U.S. officials to visualize ties among the people, places and material involved in the Islamic Republic’s nuclear activities. Data harvested and pored over by the resource includes potentially tainted material supposedly stolen from Tehran by Mossad. Such work mimics the services Palantir has provided for U.S.government agenciessuch as the C.I.A., DHS, F.B.I. and Pentagon. These entities routinely turn over untold quantities of data to the firm to exploit for a variety of applications. For example, Palantir’sGothamtool has been weaponized by the U.S. military to supposedly predict insurgent attacks.In Afghanistan, it combined maps, intelligence briefings and incident reports for mission planning, leadingBloomberg to dubPalantir the “secret weapon” of the so-called war on terror. Meanwhile,documents leakedby National Security Agency whistleblower Edward Snowden indicate the U.S. signals intelligence giant and its British counterpart GCHQ have relied heavily on Palantir’s products. A leaked 2011 presentation connected the company’s wares to multiple secret Five Eyes spying operations, and provided glowing personal testimonials from the agencies’ analysts. One crowed: “[Palantir] is the best tool I have ever worked with. It’s intuitive, i.e. idiot-proof, and can do a lot you never even dreamt of doing.” Local law enforcement agencies are also making use of Gotham. The total number of forces worldwide using the technology is unknown, but leaked Los Angeles Police Department training documents on Gotham, including an “Intermediate Course” and an “Advance Course,” shed significant light on the tool’s internal workings. The sheer volume of data collected on citizens — whether they are law-abiding, are suspected of having committed a crime, or are simply connected to individuals accused of wrongdoing — is staggering. This includes sex, race, names, contact details, addresses, prior warrants, mugshots, surveillance photos, personal relationships, past and current employers, tattoos, scars, piercings and other identifying features. Such a cutting-edge service doesn’t come cheap, and Gotham subscriptions run to millions of dollars annually. The vast windfall reaped from multiple state entities since Palantir’s inception has made the firm’s founders very wealthy indeed —Karp’s personal worth alone iscurrently estimatedat $12.2 billion — and allowed the company to go public inSeptember 2020. On top of the privacy concerns raised by asecretivecompany with access to so much private data, thepractical efficacyof Palantir’s technology has also come under scrutiny since its Foundry applicationwas implantedin Britain’s National Health Service (NHS) in December 2020. That’s when Palantir was awarded a legally dubious no-bid contract to run the Service’s Covid-19 Data Store for two years despitewarningsthat the company could preside over “an ‘unprecedented’ transfer of citizens’ private health information” into its own database. Palantir stand at the NHS Confederation conference 2022.(Rathfelder / Wikimedia Commons / CC BY-SA 4.0) The following year,the NHS awarded Palantir a $447 million contract to build a “Federated Data Platform” combining the medical records of all British citizens. Next, the British government paid millions to a consultancy firm called KPMGto marketPalantir’s platform to local NHS Trusts, which oversee the administration of individual hospitals throughout the country. Since then, several senior medical officialshave warnedthat Palantir’s technology was inferior to current systems, and could actually hinder NHS work. Yet British Prime Minister Keir Starmer has continued his government’s cooperation with Palantir, even visiting the company’s offices in downtown Washington, D.C., immediately after meeting with Trump this February. Louis Mosley, the head of Palantir UK,cheered Starmer’s attitudeafter the visit: “You could see in his eyes that he gets it. The ambition is there — the will is there.” Palantir’s Mosley happens to be thegrandsonof Sir Oswald Mosley, the World War II-era Nazi sympathizer who led the British Union of Fascists. Keir Starmer made a special trip to Palantir while he was visiting the US at the end of February & apparently “enthused about how Britain wouldn’t over-regulate AI, instead seizing its opportunities in pursuit of ‘a new economic deal’ with advanced technology at its core.”pic.twitter.com/piC0vdL76b — 12 Ball (@BoltzmannBooty)March 21, 2025 While Thiel’s personal affinity for Trump and closerelationshipswith key members of the president’s cabinet may have eased Palantir’s entry into sensitive government areas, the company’s current trajectory has been years in the making. Having penetrated the national security state of countries across the West, the firm and its messianic CEO are working to consolidate a trans-Atlantic network of control with unprecedented powers, lucrative profits, and a growing body count. Kit Klarenberg is an investigative journalist exploring the role of intelligence services in shaping politics and perceptions. This article is fromThe Grayzone. Views expressed in this article may or may not reflect those ofConsortium News. PleaseDonatetothe SpringFundDrive! Tags:Alex KarpBritish Union of FascistsC.I.A.Centers for Disease Control and PreventionCovid vaccineDepartment of Government Efficiency (DOGE)Department of Homeland Security (DHS)Edward SnowdenElon MuskFoundryFuture Investment Initiative InstituteGotham AI toolHealth and Human Services DepartmentIn-Q-TelInternal Revenue ServiceInternational Atomic Energy Agency (IAEA)Iran's nuclear programKit KlarenbergKPMGLavender AILouis MosleyMavenNational Security Agency (NSA)NHSPalantirPeter ThielSir Oswald MosleySocial Security Administrationstock marketThe New York TimesU.K. Prime Minister Keir StarmerU.S. Immigration and Customs Enforcement (ICE)U.S. President Donald Trump **Post navigation** **6 comments for “Palantir’s Value Soars With Dystopian Spy Tool that Will Centralize Data on Americans”** ValerieJune 9, 2025 at 11:30“Louis Mosley, the head of Palantir UK, cheered Starmer’s attitude after the visit: “You could see in his eyes that he gets it. The ambition is there — the will is there.” ”And here’s the result:“Keir Starmer says technology can create a ‘better future’ as he addresses AI fears”“Prime minister announces funding to boost UK’s artificial intelligence infrastructure in speech at London Tech WeekAll civil servants in England and Wales to get AI trainingMon 9 Jun 2025 12.15 BST“Keir Starmer has said ministers should be able to “look every parent in the eye” and pledge that tech can create a “better future” for their children.The UK prime minister opened London Tech Week with a series of policy announcements on artificial intelligence, including a boost to AI infrastructure and a new AI tool to transform the planning system.Acknowledging a “social fear” around the impact of AI, Starmer said technology would benefit all of society.“By the end of this parliament we should be able to look every parent in the eye in every region in Britain and say ‘look what technology can deliver for you’,” said Starmer.He added: “We can put money in your pocket, we can create wealth in your community, we can create good jobs, vastly improve our public services, and build a better future for your children.“That, to me, is the opportunity we must seize. That’s what my plan for change will deliver and, today, I think we’re taking another big step towards it.”Addressing fears about the impact of AI on jobs and society, Starmer said: “AI and tech makes us more human.”Xxxx//www.theguardian.com/politics/2025/jun/09/keir-starmer-technology-better-future-artificial-intelligence-london-tech-weekMakes us more human? What a nonsensical statement. “Louis Mosley, the head of Palantir UK, cheered Starmer’s attitude after the visit: “You could see in his eyes that he gets it. The ambition is there — the will is there.” ” And here’s the result: “Keir Starmer says technology can create a ‘better future’ as he addresses AI fears” “Prime minister announces funding to boost UK’s artificial intelligence infrastructure in speech at London Tech Week All civil servants in England and Wales to get AI training Mon 9 Jun 2025 12.15 BST “Keir Starmer has said ministers should be able to “look every parent in the eye” and pledge that tech can create a “better future” for their children. The UK prime minister opened London Tech Week with a series of policy announcements on artificial intelligence, including a boost to AI infrastructure and a new AI tool to transform the planning system. Acknowledging a “social fear” around the impact of AI, Starmer said technology would benefit all of society. “By the end of this parliament we should be able to look every parent in the eye in every region in Britain and say ‘look what technology can deliver for you’,” said Starmer. He added: “We can put money in your pocket, we can create wealth in your community, we can create good jobs, vastly improve our public services, and build a better future for your children. “That, to me, is the opportunity we must seize. That’s what my plan for change will deliver and, today, I think we’re taking another big step towards it.” Addressing fears about the impact of AI on jobs and society, Starmer said: “AI and tech makes us more human.” Xxxx//www.theguardian.com/politics/2025/jun/09/keir-starmer-technology-better-future-artificial-intelligence-london-tech-week Makes us more human? What a nonsensical statement. “Louis Mosley, the head of Palantir UK, cheered Starmer’s attitude after the visit: “You could see in his eyes that he gets it. The ambition is there — the will is there.” ” And here’s the result: “Keir Starmer says technology can create a ‘better future’ as he addresses AI fears” “Prime minister announces funding to boost UK’s artificial intelligence infrastructure in speech at London Tech Week All civil servants in England and Wales to get AI training Mon 9 Jun 2025 12.15 BST “Keir Starmer has said ministers should be able to “look every parent in the eye” and pledge that tech can create a “better future” for their children. The UK prime minister opened London Tech Week with a series of policy announcements on artificial intelligence, including a boost to AI infrastructure and a new AI tool to transform the planning system. Acknowledging a “social fear” around the impact of AI, Starmer said technology would benefit all of society. “By the end of this parliament we should be able to look every parent in the eye in every region in Britain and say ‘look what technology can deliver for you’,” said Starmer. He added: “We can put money in your pocket, we can create wealth in your community, we can create good jobs, vastly improve our public services, and build a better future for your children. “That, to me, is the opportunity we must seize. That’s what my plan for change will deliver and, today, I think we’re taking another big step towards it.” Addressing fears about the impact of AI on jobs and society, Starmer said: “AI and tech makes us more human.” Xxxx//www.theguardian.com/politics/2025/jun/09/keir-starmer-technology-better-future-artificial-intelligence-london-tech-week Makes us more human? What a nonsensical statement. James KeyeJune 8, 2025 at 12:05A clear eyed reading of history shows that technology creations drive human social expectations and organization; there has never been a backing off from technologies that increase the power of the powerful….and the consequences to come have never been either actively considered or even realized: our species is driven by the capacity to make material the things that we imagine, and then to be changed in unforeseen ways. It is extremely unlikely, given our absolute dependence on functioning biological systems, that this will end well unless we somehow discover socially effective ways to evaluate our technological productions and reject those that damage our relationship with each outer and with the living world. A clear eyed reading of history shows that technology creations drive human social expectations and organization; there has never been a backing off from technologies that increase the power of the powerful….and the consequences to come have never been either actively considered or even realized: our species is driven by the capacity to make material the things that we imagine, and then to be changed in unforeseen ways. It is extremely unlikely, given our absolute dependence on functioning biological systems, that this will end well unless we somehow discover socially effective ways to evaluate our technological productions and reject those that damage our relationship with each outer and with the living world. A clear eyed reading of history shows that technology creations drive human social expectations and organization; there has never been a backing off from technologies that increase the power of the powerful….and the consequences to come have never been either actively considered or even realized: our species is driven by the capacity to make material the things that we imagine, and then to be changed in unforeseen ways. It is extremely unlikely, given our absolute dependence on functioning biological systems, that this will end well unless we somehow discover socially effective ways to evaluate our technological productions and reject those that damage our relationship with each outer and with the living world. Drew HunkinsJune 6, 2025 at 17:51The Zionist threat to the First Amendment is one of the biggest domestic dangers we’re facing today. Palantir and the ADL ultimately want to set up a grand database that’ll identify and monitor everyone who’s deemed anti-Israel or pro Palestinian. They’ll eventually debank us and could possibly even charge us criminally on trumped up charges. The fact that regular folks are slowly becoming enlightened to just how much influence the pro Israel power bloc has in Washington is terrifying to these people. They’re hysterical bc their narrative is failing.I don’t think many people quite understand the power and facility of Palantir/A.I. and how these tech tools will soon be able to narrow everybody down into specific silos of: apolitical moron, pro Israel, anti-Israel…Thiel and Karp are Mossad connected entrepreneurs who should be shunned by all working American citizens. They first utilized their “talents” in assisting the Israeli Defense (sic) Forces in targeting and killing thousands of innocent Palestinians in Gaza.Carolyn ZarembaJune 7, 2025 at 12:54I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer.ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses.Robert E. Williamson Jr.June 9, 2025 at 19:23I’m with You Drew, global society is making a big mistake by not clamping down on A I.The last time the civilization on earth encountered a similar threat was the discover of the atom bomb.Now the wealthiest will be only those who have unlimited funds. The Zionist threat to the First Amendment is one of the biggest domestic dangers we’re facing today. Palantir and the ADL ultimately want to set up a grand database that’ll identify and monitor everyone who’s deemed anti-Israel or pro Palestinian. They’ll eventually debank us and could possibly even charge us criminally on trumped up charges. The fact that regular folks are slowly becoming enlightened to just how much influence the pro Israel power bloc has in Washington is terrifying to these people. They’re hysterical bc their narrative is failing. I don’t think many people quite understand the power and facility of Palantir/A.I. and how these tech tools will soon be able to narrow everybody down into specific silos of: apolitical moron, pro Israel, anti-Israel… Thiel and Karp are Mossad connected entrepreneurs who should be shunned by all working American citizens. They first utilized their “talents” in assisting the Israeli Defense (sic) Forces in targeting and killing thousands of innocent Palestinians in Gaza. Carolyn ZarembaJune 7, 2025 at 12:54I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer.ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer. ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. Robert E. Williamson Jr.June 9, 2025 at 19:23I’m with You Drew, global society is making a big mistake by not clamping down on A I.The last time the civilization on earth encountered a similar threat was the discover of the atom bomb.Now the wealthiest will be only those who have unlimited funds. I’m with You Drew, global society is making a big mistake by not clamping down on A I. The last time the civilization on earth encountered a similar threat was the discover of the atom bomb. Now the wealthiest will be only those who have unlimited funds. The Zionist threat to the First Amendment is one of the biggest domestic dangers we’re facing today. Palantir and the ADL ultimately want to set up a grand database that’ll identify and monitor everyone who’s deemed anti-Israel or pro Palestinian. They’ll eventually debank us and could possibly even charge us criminally on trumped up charges. The fact that regular folks are slowly becoming enlightened to just how much influence the pro Israel power bloc has in Washington is terrifying to these people. They’re hysterical bc their narrative is failing. I don’t think many people quite understand the power and facility of Palantir/A.I. and how these tech tools will soon be able to narrow everybody down into specific silos of: apolitical moron, pro Israel, anti-Israel… Thiel and Karp are Mossad connected entrepreneurs who should be shunned by all working American citizens. They first utilized their “talents” in assisting the Israeli Defense (sic) Forces in targeting and killing thousands of innocent Palestinians in Gaza. Carolyn ZarembaJune 7, 2025 at 12:54I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer.ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer. ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I agree with you. I am actually glad I am old. I won’t have to live in this dystopia very much longer. ValerieJune 8, 2025 at 13:02I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. I never thought of it like that, but now you say it, it makes sense. Like Carolyn, i probably won’t live through it. But i’d like to be a fly on the wall when whatever happens, happens. Personally i think climate chaos/water shortages will be a big factor in our extinction. That, and AI taking over and becoming uncontrollable. (Water usage for these data bases is phenominal.) One thing’s for sure – they are afraid of the masses. Robert E. Williamson Jr.June 9, 2025 at 19:23I’m with You Drew, global society is making a big mistake by not clamping down on A I.The last time the civilization on earth encountered a similar threat was the discover of the atom bomb.Now the wealthiest will be only those who have unlimited funds. I’m with You Drew, global society is making a big mistake by not clamping down on A I. The last time the civilization on earth encountered a similar threat was the discover of the atom bomb. Now the wealthiest will be only those who have unlimited funds. I’m with You Drew, global society is making a big mistake by not clamping down on A I. The last time the civilization on earth encountered a similar threat was the discover of the atom bomb. Now the wealthiest will be only those who have unlimited funds. Comments are closed. Securely by check, credit card or on Patreon: TAX-DEDUCTIBLE Make your tax-deductible donation by clickinghere. KeepConsortium News going in the tradition of Bob Parry. Become aConsortium Newsmember! WatchConsortium NewsLive! **Search this Site** **CN v. USA & NewsGuard** **SUBSCRIBE to Our Free Email Newsletter** **Use Our RSS Feed:** **Martha Gellhorn Prize** WINNER OF THE 2017 MARTHA GELLHORN PRIZE FOR JOURNALISM **Winner of the 2015 I.F. Stone Medal from Harvard’s Nieman Foundation** Julian Assange Award 2023 In Memoriam:Robert Parry, 1949-2018 **American Dispatches: Collected Journalism of Robert Parry** **Archives** June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013 September 2013 August 2013 July 2013 June 2013 May 2013 April 2013 March 2013 February 2013 January 2013 December 2012 November 2012 October 2012 September 2012 August 2012 July 2012 June 2012 May 2012 April 2012 March 2012 February 2012 January 2012 December 2011 November 2011 October 2011 September 2011 August 2011 July 2011 June 2011 May 2011 August 2005 January 2004 October 2003 August 2003 July 2003 May 2003 April 2003 March 2003 February 2003 **Older Stories by Category** Advanced Technologies(207) American Empire(904) Analysis(691) Ancient World(20) Arts(359)Architecture(1)Books(213)Film(96)Humor(26)Music(19)Satire(9)Theater(6) Architecture(1) Books(213) Film(96) Humor(26) Music(19) Satire(9) Theater(6) Architecture(1) Books(213) Film(96) Humor(26) Music(19) Satire(9) Theater(6) Assange extradition(414) Bahrain(7) Ban Ki-Moon(3) Biden Administration(1,161) Campaign 2016(1,077) Campaign 2020(171) Campaign 2024(43) Censorship(337) Climate Change(261) CN Live!(277) CN Radio(6) CN Video(22) Cold War(126) Colonialism(70) Column(520) Commentary(3,862) Consortium News(47) Consortium News at 25(45) Consortium News at 30(1) Consortium News on Flash Points(9) Consortium News Radio(13) Consortiumnews.com(550) Constitution(994) COVID-19(369) Crimes Against Humanity(20) Dag Hammarskjold(5) Disinformation(50) Economy(323) Editorial(3) Election 2016(14) Election 2020(85) Election 2024(47) Environment(447) Fall Fund Drive(21) Foreign Policy(2,897) Free Speech(41) Gary Webb Freedom of the Press Award(11) Genocide(33) Gun Violence(56) Guns(16) Health Care(22) Health Reform(188) History(359) Human Rights(4,229)Civil Rights(372) Civil Rights(372) Civil Rights(372) Immigration(90) Income Inequality(159) Indigenous People(111) Intelligence(2,216) International(4,866)Afghanistan(330)Africa(199)Albania(2)Algeria(19)Argentina(40)Asia(44)Australia(281)Austria(2)Bahrain(14)Bangladesh(11)Belarus(14)Belgium(12)Bolivia(33)Brazil(98)BRICS(31)Britain(603)Burkina Faso(12)Cambodia(9)Canada(42)Central America(29)Chile(39)China(501)Colombia(8)Congo(14)Cuba(90)Cyprus(4)Czech Republic(3)Denmark(14)East Timor(7)Ecuador(89)Egypt(106)Ethiopia(10)Eurasia(10)Europe(184)European Union(86)Finland(12)France(175)Gabon(9)Gaza(133)Georgia(9)Germany(205)Ghana(11)Great Britain(31)Greece(17)Greenland(4)Guatemala(11)Gulf States(86)Haiti(10)Hungary(13)Iceland(9)India(122)Indonesia(26)International Criminal Court (ICC)(26)Iran(330)Iraq(341)Ireland(24)Israel(1,259)Italy(54)Japan(42)Jordan(26)Kazakhstan(4)Kenya(19)Korea Peninsula(20)Kuwait(2)Laos(6)Latin America(128)Lebanon(140)Liberia(2)Libya(85)Mali(32)Mexico(46)Middle East(391)Moldova(2)Montenegro(2)Morocco(3)NATO(222)Netherlands(14)New Zealand(18)Nicaragua(13)Niger(17)Nigeria(19)North Korea(47)Northern Rhodesia(3)Norway(15)Pakistan(43)Palestine(1,068)Panama(9)Philippines(16)Poland(31)Portugal(7)Qatar(27)Romania(9)Russia(1,138)Rwanda(24)Saudi Arabia(174)Scotland(26)Slovenia(5)Somalia(17)South Africa(84)South America(3)South Korea(30)Soviet Union(102)Spain(38)Sudan(18)Sweden(52)Switzerland(3)Syria(213)Taiwan(43)Thailand(6)Timor Leste(4)Tunisia(11)Turkey(87)Ukraine(844)Uruguay(1)United Arab Emirates(58)United Kingdon(481)United Nations(601)Venezuela(104)Vietnam(112)Yemen(106)Yugoslavia(17)Zambia(4) Afghanistan(330) Africa(199) Albania(2) Algeria(19) Argentina(40) Asia(44) Australia(281) Austria(2) Bahrain(14) Bangladesh(11) Belarus(14) Belgium(12) Bolivia(33) Brazil(98) BRICS(31) Britain(603) Burkina Faso(12) Cambodia(9) Canada(42) Central America(29) Chile(39) China(501) Colombia(8) Congo(14) Cuba(90) Cyprus(4) Czech Republic(3) Denmark(14) East Timor(7) Ecuador(89) Egypt(106) Ethiopia(10) Eurasia(10) Europe(184) European Union(86) Finland(12) France(175) Gabon(9) Gaza(133) Georgia(9) Germany(205) Ghana(11) Great Britain(31) Greece(17) Greenland(4) Guatemala(11) Gulf States(86) Haiti(10) Hungary(13) Iceland(9) India(122) Indonesia(26) International Criminal Court (ICC)(26) Iran(330) Iraq(341) Ireland(24) Israel(1,259) Italy(54) Japan(42) Jordan(26) Kazakhstan(4) Kenya(19) Korea Peninsula(20) Kuwait(2) Laos(6) Latin America(128) Lebanon(140) Liberia(2) Libya(85) Mali(32) Mexico(46) Middle East(391) Moldova(2) Montenegro(2) Morocco(3) NATO(222) Netherlands(14) New Zealand(18) Nicaragua(13) Niger(17) Nigeria(19) North Korea(47) Northern Rhodesia(3) Norway(15) Pakistan(43) Palestine(1,068) Panama(9) Philippines(16) Poland(31) Portugal(7) Qatar(27) Romania(9) Russia(1,138) Rwanda(24) Saudi Arabia(174) Scotland(26) Slovenia(5) Somalia(17) South Africa(84) South America(3) South Korea(30) Soviet Union(102) Spain(38) Sudan(18) Sweden(52) Switzerland(3) Syria(213) Taiwan(43) Thailand(6) Timor Leste(4) Tunisia(11) Turkey(87) Ukraine(844)Uruguay(1) Uruguay(1) United Arab Emirates(58) United Kingdon(481) United Nations(601) Venezuela(104) Vietnam(112) Yemen(106) Yugoslavia(17) Zambia(4) Afghanistan(330) Africa(199) Albania(2) Algeria(19) Argentina(40) Asia(44) Australia(281) Austria(2) Bahrain(14) Bangladesh(11) Belarus(14) Belgium(12) Bolivia(33) Brazil(98) BRICS(31) Britain(603) Burkina Faso(12) Cambodia(9) Canada(42) Central America(29) Chile(39) China(501) Colombia(8) Congo(14) Cuba(90) Cyprus(4) Czech Republic(3) Denmark(14) East Timor(7) Ecuador(89) Egypt(106) Ethiopia(10) Eurasia(10) Europe(184) European Union(86) Finland(12) France(175) Gabon(9) Gaza(133) Georgia(9) Germany(205) Ghana(11) Great Britain(31) Greece(17) Greenland(4) Guatemala(11) Gulf States(86) Haiti(10) Hungary(13) Iceland(9) India(122) Indonesia(26) International Criminal Court (ICC)(26) Iran(330) Iraq(341) Ireland(24) Israel(1,259) Italy(54) Japan(42) Jordan(26) Kazakhstan(4) Kenya(19) Korea Peninsula(20) Kuwait(2) Laos(6) Latin America(128) Lebanon(140) Liberia(2) Libya(85) Mali(32) Mexico(46) Middle East(391) Moldova(2) Montenegro(2) Morocco(3) NATO(222) Netherlands(14) New Zealand(18) Nicaragua(13) Niger(17) Nigeria(19) North Korea(47) Northern Rhodesia(3) Norway(15) Pakistan(43) Palestine(1,068) Panama(9) Philippines(16) Poland(31) Portugal(7) Qatar(27) Romania(9) Russia(1,138) Rwanda(24) Saudi Arabia(174) Scotland(26) Slovenia(5) Somalia(17) South Africa(84) South America(3) South Korea(30) Soviet Union(102) Spain(38) Sudan(18) Sweden(52) Switzerland(3) Syria(213) Taiwan(43) Thailand(6) Timor Leste(4) Tunisia(11) Turkey(87) Ukraine(844)Uruguay(1) Uruguay(1) Uruguay(1) United Arab Emirates(58) United Kingdon(481) United Nations(601) Venezuela(104) Vietnam(112) Yemen(106) Yugoslavia(17) Zambia(4) International Court of Justice (ICJ)(9) International News Analysis(121) InternationalCriminal Court (ICC)(4) Iran-Contra(17) Japan(25) Joe Lauria(8) Julian Assange(284) Labor(194) Legal(1,016) Letter from Britain(10) Letter From India(1) Letter from London(2) Letter to the Editor(1) Lobbying(12) Lost History(1,746) Madeleine Albright(3) Media(3,201) Middle East(287) Mike Pompeo(17) Militarism(854) Military(210) Military Industry(104) Nazism(38) Neoconservatism(3) New Zealand(7) News Analysis(51) Nigeria(1) Nuclear Weapons(179) Obama Administration(4,400) October Surprise(128) Opinion(24) Pentagon(202) Poland(4) Police Brutality(82) Politics(3,295) Press Freedom(190) Prisons(40) Propaganda(526) Protest(86) Protests(215) Public Health(7) Race Relations(54) Racism(140) Religion(456) Right Wing(2,873) Robert Parry(30) Russiagate(275) Science(12) Secrecy(1,510) Social Media(71) Sport(6) Spring Fund Drive(35) Summer Fund Drive(5) Surveillance(81) Susan Williams(1) Terrorism(70) The Bush-43 Administration(1,756) Torture(91) Trump Administration(1,722) U.N. General Assembly(44) U.N. Security Council(66) U.S.(2,666) U.S. Congress(334) U.S. Justice Dept.(130) U.S. State Department(76) U.S. Supreme Courrt(79) Uncategorized(155) Until This Day–Historical Perspectives on the News(787) VIPS(25) VIPS Memos(29) War Crimes(357) WikiLeaks(856) WikiLeaks Series(10) Winter Fund Drive(32) WMD(45) Women(65) Comment PolicyPrivacy PolicyContact Us Privacy PolicyContact Us Privacy PolicyContact Us Contact Us Contact Us Comment PolicyPrivacy PolicyContact Us Privacy PolicyContact Us Privacy PolicyContact Us Contact Us Contact Us Privacy PolicyContact Us Privacy PolicyContact Us Contact Us Contact Us Privacy PolicyContact Us Contact Us Contact Us Privacy PolicyContact Us Contact Us Contact Us Contact Us Contact Us Contact Us Contact Us Copyright © 2025Consortium News. All Rights Reserved.The Magazine Basic Theme bybavotasan.com. **Share** **Copy short link**"}