{"id": 289, "name": "Craig Press", "domain": "craigdailypress.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.craigdailypress.com/news/homeland-security-pulls-down-sanctuary-jurisdictions-list-identifying-several-colorado-municipalities-counties/", "title": "Homeland Security Pulls Down Sanctuary Jurisdictions List Identifying Several Colorado Municipalities Counties", "content": "NewsPoliticsBusiness & Real EstateCrime & CourtsEducationHealthWeatherCalendarAnnouncementsObituariesLatest ObituariesSubmit an ObituaryCelebrationsLatest CelebrationsSubmit CelebrationsSubmit an EventOpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Politics Business & Real Estate Crime & Courts Education Health Weather Calendar AnnouncementsObituariesLatest ObituariesSubmit an ObituaryCelebrationsLatest CelebrationsSubmit CelebrationsSubmit an EventOpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters ObituariesLatest ObituariesSubmit an Obituary Latest Obituaries Submit an Obituary CelebrationsLatest CelebrationsSubmit CelebrationsSubmit an Event Latest Celebrations Submit Celebrations Submit an Event OpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Columns Editorials Letters to the Editor Sports EntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Special Sections ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters Politics Business & Real Estate Crime & Courts Education Health Weather Calendar AnnouncementsObituariesLatest ObituariesSubmit an ObituaryCelebrationsLatest CelebrationsSubmit CelebrationsSubmit an EventOpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters ObituariesLatest ObituariesSubmit an Obituary Latest Obituaries Submit an Obituary CelebrationsLatest CelebrationsSubmit CelebrationsSubmit an Event Latest Celebrations Submit Celebrations Submit an Event OpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Columns Editorials Letters to the Editor Sports EntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Special Sections ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters ObituariesLatest ObituariesSubmit an Obituary Latest Obituaries Submit an Obituary Latest Obituaries Submit an Obituary CelebrationsLatest CelebrationsSubmit CelebrationsSubmit an Event Latest Celebrations Submit Celebrations Submit an Event Latest Celebrations Submit Celebrations Submit an Event OpinionColumnsEditorialsLetters to the EditorSportsEntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Columns Editorials Letters to the Editor Sports EntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Special Sections ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters Columns Editorials Letters to the Editor Sports EntertainmentSpecial SectionsClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Special Sections ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters Special Sections ClassifiedsJobsRentalsReal EstateAutosService DirectoryAll ClassifiedsPlace AdLegalsPlace Legal AdSearch Legal AdsMagazines and Special SectionsNewsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad LegalsPlace Legal AdSearch Legal Ads Place Legal Ad Search Legal Ads Place Legal Ad Search Legal Ads Magazines and Special Sections Newsletters **News** Politics Business & Real Estate Crime & Courts Education Health Weather **Calendar** **Announcements** Obituaries Celebrations **Opinion** Columns Editorials Letters to the Editor **Sports** **Entertainment** Special Sections **Classifieds** Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad Legals **Magazines and Special Sections** **Newsletters** Donate E-Edition| Submissions| Contact Us| Advertise with Craig Press| **Homeland Security pulls down ‘sanctuary jurisdictions’ list identifying several Colorado municipalities, counties** News|Jun 9, 2025 ateres-martinez@craigdailypress.com The Department of Homeland Security’s list of “sanctuary jurisdictions” — which listed several cities and counties on Colorado’s Western Slope —was pulled from its websiteon Sunday. The department published the list on May 29, citing its decision under President Donald Trump’sProtecting American Communities from Criminal Aliens executive order. The page claimed that “sanctuary jurisdictions undermine the rule of law and endanger the lives of Americans and law enforcement.” Of the 53 sanctuary jurisdictions identified for Colorado when the list was taken down, Western Slope counties included Eagle, Garfield, Pitkin, Rio Grande, Summit and Lake counties. Towns included Avon, Basalt, Carbondale, Dillion, Eagle and Vail. Routt County was not included on the list. Several Colorado countieshave declared themselves as “non-sanctuary,” including Garfield County.Despite commissioners signing a resolution in 2024declaring that it would not aid or provide shelter to undocumented migrants, the county was still included in the list. “As far as that whole list, it’s just kind of BS,” Garfield County Commissioner Tom Jankovsky said. “We have our resolution. The sheriff follows state laws. That’s kind of where we are.” Jankovsky said Garfield County commissioners passing a resolution stating it’s not a sanctuary county was “primarily in response to the Venezuelans who were camping out in Carbondale.” “We were stating that we were not going to provide assistance to undocumented immigrants as far as food and shelter,” he said. “If they got here, then they need to be able to take care of themselves.” Of the other Western Slope counties included in the department’s list, none have officially passed resolutions declaring themselves as sanctuary jurisdictions. Eagle County,while having passed a resolutionrelating to support for local immigrants,does not adopt the label. Several may have still been identified due to having policies that align with sanctuary principles. According to the Department of Homeland Security, criteria for a county or city to be designated as a sanctuary jurisdiction is based on multiple factors: “self-identification as a sanctuary jurisdiction, noncompliance with Federal law enforcement in enforcing immigration laws, restrictions on information sharing, and legal protections for illegal aliens.” Colorado itself was listed by the department as a sanctuary state based on “self-Identification as a state sanctuary jurisdiction.” Colorado Gov. Jared Polis has maintained that Colorado is not a sanctuary state, emphasizing its cooperation with federal law enforcement on criminal investigations. However, Colorado lawlimits how local law enforcement can cooperatewith U.S. Immigration and Customs Enforcement. In May,Polis also signed legislationprohibiting jails from delaying the release of individuals for immigration enforcement purposes and restricting local governments from sharing personal information with federal immigration agencies. These immigration policies have come under attack by the Trump administration, whichfiled a lawsuit against the state of Coloradoand the city of Denver in May seeking to remove local policies restricting cooperation between local law enforcement and federal immigration authorities. Colorado Attorney General Phil Weiser, along with a coalition of 19 attorneys general, responded byfiling two lawsuits against the Trump administrationclaiming its use of billions in emergency services and infrastructure projects to impose “illegal immigration conditions” is unlawful. The department said it notified each listed jurisdiction of its “non-compliance with Federal statutes” and demands that these jurisdictions “immediately review and revise their policies to align with Federal immigration laws and renew their obligation to protect American citizens, not dangerous illegal aliens.” The message has since been taken down along with the list. The National Sheriffs’ Association President Sheriff Kieran Donahue had publiclycriticized the listprior to Sunday for being created “without any input, criteria of compliance, or a mechanism for how to object to the designation.” “Sheriffs nationwide have no way to know what they must do or not do to avoid this arbitrary label,” Donahue said in a statement. Jun 11, 2025 Jun 11, 2025 Jun 11, 2025 Jun 11, 2025 Jun 11, 2025 Nov 20, 2018 Jun 4, 2025 Jun 9, 2025 Jun 3, 2025 May 28, 2025 **Support Local Journalism** **Support Local Journalism** Readers around Craig and Moffat County make the Craig Press’ work possible. Your financial contribution supports our efforts to deliver quality, locally relevant journalism. Now more than ever, your support is critical to help us keep our community informed about the evolving coronavirus pandemic and the impact it is having locally. Every contribution, however large or small, will make a difference. Each donation will be used exclusively for the development and creation of increased news coverage. Steamboat Pilot & Today AND Craig Press are hiring for a Multimedia Account Manager Are you great at customer… Steamboat Pilot & Today AND Craig Press are hiring for a Multimedia Account Manager Are you great at customer… Now Hiring Professional Drivers High Mountain Taxi is looking for reliable, professional drivers to join our team! Locations: Craig, Rangely,… Now Hiring Professional Drivers High Mountain Taxi is looking for reliable, professional drivers to join our team! Locations: Craig, Rangely,… JOIN OUR TEAM – Make a Difference in Northwest Colorado! At Northwest Colorado Health, we are driven by one powerful… JOIN OUR TEAM – Make a Difference in Northwest Colorado! At Northwest Colorado Health, we are driven by one powerful… **Daily Newsletter** Sign up for daily and breaking news headlines. Manage Subscriptions How would you direct Craig's next steps?Focus on entrepreneurship. We'll control our future.Do everything possible to attract some big employers.It'll work out — no need to be overly intentional.Can't see it working out, honestly.View ResultsLoading ... How would you direct Craig's next steps? Focus on entrepreneurship. We'll control our future. Do everything possible to attract some big employers. It'll work out — no need to be overly intentional. Can't see it working out, honestly. View Results How would you direct Craig's next steps? Focus on entrepreneurship. We'll control our future. Do everything possible to attract some big employers. It'll work out — no need to be overly intentional. Can't see it working out, honestly. View Results Home Trending Sections Classifieds Jobs Real Estate Rentals Autos Pets Recreation Merchandise Legals Place Legal Ad Search Legal Ads Contact Us Submissions Advertise Submit an Obituary Magazines and Special Sections Archives About Us Newsletters Commercial Print Sales RSS Cookie List Do not sell my personal information Steamboat-Routt County Aspen-Snowmass Glenwood Springs-Rifle Lake Tahoe - California Summit County Vail-Eagle Valley Winter Park-Granby-Grand County Printing Press Jobs About Us| Terms of Use| Privacy Policy| Terms and Conditions| Careers| ©2005 - 2025 Swift Communications, Inc."}