{"id": 609, "name": "Grand Forks Herald", "domain": "grandforksherald.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.grandforksherald.com/news/the-vault/they-thought-the-identity-of-the-severed-head-would-be-known-by-now-faulty-dna-samples-are-derailing-efforts", "title": "They Thought The Identity Of The Severed Head Would Be Known By Now Faulty Dna Samples Are Derailing Efforts", "content": "📣 Advertise With Us UND Hockey 50 Best Places to Work Bid and Buy Advertise With UsDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public NoticeGet Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Sponsored Content NewsLocalMinnesotaNorth DakotaSouth DakotaNationalWorldThe VaultAgweekWDAY LiveForum News Network Local Minnesota North Dakota South Dakota National World The Vault Agweek WDAY Live Forum News Network Local Minnesota North Dakota South Dakota National World The Vault Agweek WDAY Live Forum News Network Weather SportsPrepPrep standingsCollegeFCS StandingsUND HockeyProNorthland OutdoorsWDAY+ Prep Prep standings College FCS Standings UND Hockey Pro Northland Outdoors WDAY+ Prep Prep standings College FCS Standings UND Hockey Pro Northland Outdoors WDAY+ Obituaries Health BusinessAnnouncements Announcements Announcements OpinionEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters LifestyleArts / EntertainmentHome / GardenAstro BobComicsOn the Minds of MomsFree Games Arts / Entertainment Home / Garden Astro Bob Comics On the Minds of Moms Free Games Arts / Entertainment Home / Garden Astro Bob Comics On the Minds of Moms Free Games CommunityMilestonesCalendarContestsAnnouncements Milestones Calendar Contests Announcements Milestones Calendar Contests Announcements From The ArchivesToday In HistoryArchives FAQ Today In History Archives FAQ Today In History Archives FAQ Podcasts ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ Local InterestPrairie Business Prairie Business Prairie Business AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **They thought the identity of the severed head would be known by now. Faulty DNA samples are derailing efforts** **Bone Lake Jane Doe was among the cases of dismembered women of the 1990s, although her identity remains unknown.** SCANDIA, Minn. — The identity of a woman whose remains were found scattered in two Minnesota Lakes in the summer of 1993 is still unknown, despite recent attempts to create a DNA profile. The DNA Doe Project, a nonprofit organization that utilizes DNA analysis with investigative forensic genealogy to discover the identity of the unidentified, washopeful last summer that the identity of the woman, referred to as “Bone Lake Jane Doe,” was just a few lab tests away. ADVERTISEMENT Bone Lake Jane Doe’s remains were undergoing a critical step in the identification process: DNA extraction. Yet despite multiple attempts, results were unable to create a genetic profile. “Unfortunately, the sample did not successfully yield a DNA profile and the case is on hold while the agency tries to locate and acquire more DNA extract,” Pam Lauritzen, Executive Director of Media and Communications with DNA Doe Project, told Forum News Service. “We may have a couple of new lab options on the horizon to try, but we’ve made no progress yet.” The female head was discovered on June 12, 1993, by a man out for a walk along the shores of Bone Lake in Scandia, Minn., a rural community with a population of 4,000 residents near the Wisconsin border. At first glance, the man assumed he was staring at a mannequin’s head. A closer look revealed that the head, bluntly cut at the neck, belonged to a woman. With minimal days of exposure to the elements, the head remained somewhat intact. Bone Lake Jane Doe had brown eyes and dark, short hair. Her ears were pierced — three times over. The medical examiner’s report put her age between 30 and 65 years old, according to the DNA Doe Project. Her foot was later discovered in Pigs Eye Lake, a 628-acre shallow backwater lake on the southern end of St. Paul, roughly 35 minutes from Bone Lake. Investigators noted that two of her toes were painted with red nail polish. Because the head had been preserved in the waters of Bone Lake, an accurate sketch of the woman was used as an effort to discover her identity. The sketch was distributed throughout the country. Yet over the course of 30 years, it has not led investigators to her true identity. ADVERTISEMENT DNA analysis is, at this point, the last hope for answers. Bone Lake Jane Doe wasn’t the only woman whose remains were discovered in 1993 in rural Minnesota. Months after the discovery in Bone Lake, the remains of Martha Bacon were unearthed in rural Wright County, roughly 40 miles west of the Twin Cities. Bone Lake is located roughly 40 miles northeast of the Twin Cities. A year after Bacon was discovered, Wright County Sheriff's Office investigators came across the severed skull of 25-year-old Victoria Marie Morris. Each case remains unsolved. **Martha Bacon** Four months after Bone Lake Jane Doe’s head was found, a resident in Wright County’s Silver Creek Township watched as his dog returned to the yard with a human forearm and hand in its mouth. Through fingerprint analysis, the Minnesota Bureau of Criminal Apprehension identified the victim as31-year-old Martha Bacon. ADVERTISEMENT Bacon had been considered missing for one month before the dog’s discovery. She was last seen in North Minneapolis in the early hours of Sept. 27 or Sept. 28, 1993. In the wake of the discovery, the Wright County Sheriff’s Office executed an extensive search, covering two square miles over the course of several days. During that time, they were unable to locate additional remains. Ten months later, another dog returned to its owner with Bacon’s lower leg and foot. The discovery was made one-and-a-half miles from the area where Bacon’s forearm and hand were retrieved. Because Bacon’s remains were discovered submerged in water, they remained somewhat intact. The second discovery prompted another search, executed by the Wright County Sheriff’s Office — this time yielding results. The search uncovered a human head, severed at the neck. Dental records proved the remains belonged to Bacon. The discovery launched a wave of fear throughout Wright County, prompting residents to gather for a community meeting with the Wright County Sheriff’s Office. ADVERTISEMENT The meeting revealed Bacon was a sex worker in Minneapolis — and investigators theorized the person responsible was likely a customer. Law enforcement also indicated the suspect was likely someone familiar with the Silver Creek area, as Bacon’s remains were found scattered in swampy areas known mostly by locals. The investigative file related to thedisappearance of Belinda Van Lith,who went missing from Wright County in 1974, stated there was at least one suspect in Bacon's dismemberment:Timothy Crosby. Crosby had a family cabin in Wright County and a history of violent sexual assault and armed abduction. Crosby is civilly committed at the secure Moose Lake Sex Offender Treatment Program facility. In a January 2024 interview with Forum News Service, Crosby said he wasn’t a violent person in the 1980s or 1990s. Less than a year after Bacon was found, Wright County residents learned of yet another victim. **Victoria Morris** Victoria Marie Morris' skull was discovered alongside I-94, near St. Michael in Wright County on Oct. 8, 1994,according to the Minnesota BCA. ADVERTISEMENT Her body was discovered 10 feet away in a grassy ditch, wrapped in rope and tape. Investigators said marks around her neck indicated she had been strangled. The murder weapon was found by her side, but the Wright County Sheriff’s Office has not revealed the nature of the weapon. However, a cold case investigation into Morris’ death revealed unknown male DNA was discovered on the weapon, according to a 2009 St. Paul Pioneer Press article. Like Bacon, Morris was a sex worker in the Minneapolis area. Investigators theorized the perpetrator was also likely a customer familiar with the Wright County area. Crosby was also named a suspect in Morris' case at one point. However, his DNA did not match the male sample taken from the murder weapon. ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersE-PaperOur News Network Subscription Options Email Newsletters E-Paper Our News Network Subscription Options Email Newsletters E-Paper Our News Network ContactGet HelpContact UsAdvertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Instagram Facebook"}