{"id": 619, "name": "Guelph Mercury Tribune", "domain": "guelphmercury.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": " https://www.guelphmercury.com/things-to-do/ontario-travel-hidden-gem-food-road-trips-survey/article_a35da0e6-e67a-5c0b-8dcc-df750dfd28cb.html", "title": "Ontario Travel Hidden Gem Food Road Trips Survey", "content": "27°|Wednesday June 11 PLAY NOW! $28M Site searchSearch Site searchSearch Site searchSearch Business Council Crime Life Topics Indigenous Local Public Notices EventsEvents This WeekendArts and MusicAttractionsFestivals and FairsFood and DrinkLifestyleSports and OutdoorsCommunity Events This Weekend Arts and Music Attractions Festivals and Fairs Food and Drink Lifestyle Sports and Outdoors Community Events This Weekend Arts and Music Attractions Festivals and Fairs Food and Drink Lifestyle Sports and Outdoors Community Food and Drink Books Travel Columnists Contributors Readers' Choice Awards Retail Restaurants Services Activities Travel Sponsored Flyers Local Spotlight Classifieds 27°|Wednesday June 11 PLAY NOW! $28M Manage Profile Saved Articles Followed Authors and Searches Newsletters Sign out Newsletters Newsletters Newsletters Newsletters Manage Profile Saved Articles Followed Authors and Searches Newsletters Sign out Manage Profile Saved Articles Followed Authors and Searches Newsletters Sign out Site searchSearch Site searchSearch Site searchSearch HomeTariffs—Trade WarTravel Ontario Tariffs—Trade War Travel Ontario Tariffs—Trade War Travel Ontario NewsBusinessCouncilCrimeLifeTopicsIndigenous LocalPublic Notices Business Council Crime Life Topics Indigenous Local Public Notices Business Council Crime Life Topics Indigenous Local Public Notices Things to DoEventsEvents This WeekendArts and MusicAttractionsFestivals and FairsFood and DrinkLifestyleSports and OutdoorsCommunityFood and DrinkBooksTravel EventsEvents This WeekendArts and MusicAttractionsFestivals and FairsFood and DrinkLifestyleSports and OutdoorsCommunity Events This Weekend Arts and Music Attractions Festivals and Fairs Food and Drink Lifestyle Sports and Outdoors Community Food and Drink Books Travel EventsEvents This WeekendArts and MusicAttractionsFestivals and FairsFood and DrinkLifestyleSports and OutdoorsCommunity Events This Weekend Arts and Music Attractions Festivals and Fairs Food and Drink Lifestyle Sports and Outdoors Community Events This Weekend Arts and Music Attractions Festivals and Fairs Food and Drink Lifestyle Sports and Outdoors Community Food and Drink Books Travel OpinionColumnistsContributors Columnists Contributors Columnists Contributors Obituaries Volunteer Games Shopping and ServicesReaders' Choice AwardsRetailRestaurantsServicesActivitiesTravelSponsoredFlyersLocal SpotlightClassifieds Readers' Choice Awards Retail Restaurants Services Activities Travel Sponsored Flyers Local Spotlight Classifieds Readers' Choice Awards Retail Restaurants Services Activities Travel Sponsored Flyers Local Spotlight Classifieds Tariffs—Trade War Travel Ontario Many Canadians are looking to road trips for their summer travel plans. Let us know your favourite routes and hidden gems across Ontario. Dreamstime Facebook Twitter WhatsApp SMS Email Print Copy article link Home Things To Do **TRAVEL ONTARIO: Tell us the best road trips, day trips, hidden gems, and foodie spots we can’t miss** Fill out our Ontario travel reader survey to help us feature travel experiences that can’t be missed. Fill out our Ontario travel reader survey to help us feature travel experiences that can’t be missed. Fill out our Ontario travel reader survey to help us feature travel experiences that can’t be missed. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Many Canadians are looking to road trips for their summer travel plans. Let us know your favourite routes and hidden gems across Ontario. Facebook Twitter WhatsApp SMS Email Print Copy article link Save Summer is almost here. As part of our summer-long Travel Ontario series, we’re putting together stories to help travellers explore the beautiful province of Ontario — and discover the hidden gems along the way. Do you have a favourite Ontario road trip route, camping spot, restaurant or foodie spot everyone should check out? What about the stops along the way for a great day-trip adventure? Let us know. Whether it’s a patio with the best views, a unique or unusual experience, or a quirky shop in cottage country with the cutest finds, tell us where you go to escape the daily grind. Take our reader surveyto help us, help you make the best summer travel memories possible. Metroland news teams will consider your suggestions as part of our Travel Ontario coverage throughout the summer. Visit ourTravel Ontario page. Read moreTravel Ontario articles. Want more Ontario news? Sign up for ournewsletterto get news delivered straight to your inbox. Error!Sorry, there was an error processing your request. There was a problem with the recaptcha. Please try again. You may unsubscribe at any time. By signing up, you agree to ourterms of useandprivacy policy. This site is protected by reCAPTCHA and the Googleprivacy policyandterms of serviceapply. Want more of the latest from us? Sign up for more at ournewsletter page. **One of Canada’s biggest garage sales is happening this weekend in Ontario** May 22, 2025 **From dancing in the Barn to sleeping under stars. Here are some queer getaways to enjoy during Pride season — and beyond** Jun 4, 2025 Contact Metroland Staff at thenewsroom@metroland.com. Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Recommended For You** **Ready to ride the G2G Rail Trail from Guelph or Goderich? Vicky Rao can help** Article was updated56 mins ago **Craving spaghetti alla bolognese? This new Guelph restaurant is serving up favourite dishes** Jun 5, 2025 **Eager to get a glimpse of growing gardens in Guelph? It’s time for the Annual Garden Tour** Jun 6, 2025 **Rick Mercer’s ‘Stand-up for Canada’ comedy tour is coming to these Ontario cities** Jun 9, 2025 **Fake CAPTCHA scam downloads dangerous malware. Here’s how to spot it and protect your personal data** Jun 9, 2025 **Events this weekend in Guelph area from June 6 to June 8** Jun 5, 2025 **Toronto’s free ‘Soccer Day’ event kicks off countdown to Canada’s FIFA World Cup 2026** Article was updated1 hr ago **McDonald’s celebrates McFlurry’s 30th anniversary with new flavours, Canadian designs this summer** Article was updated6 hrs ago **Toronto Star bestsellers: Taylor Jenkins Reid goes to space and astronaut Chris Hadfield is back on the list** 7 hrs ago **Local Flyer** To join the conversation set a first and last name in your user profile. Sign in or register for free to join the Conversation Error!There was an error processing your request. There was a problem with the recaptcha. Please try again. You may unsubscribe at any time. By signing up, you agree to ourterms of useandprivacy policy. This site is protected by reCAPTCHA and the Googleprivacy policyandterms of serviceapply. Want more of the latest from us? Sign up for more at ournewsletter page. You may unsubscribe at any time. By signing up, you agree to ourterms of useandprivacy policy. This site is protected by reCAPTCHA and the Googleprivacy policyandterms of serviceapply. **Helpful Links** Contact Us Submit Content or Feedback Removal Request Sitemap GlobeNewswire **Become a Customer** Subscribe to Toronto Star Subscribe to Waterloo Region Record Signup for email newsletters **Advertising** Advertise with Us Advertising Standards Post an Obituary Post a Classified **About Us** About Us FAQs Join our team Facebook Twitter Instagram Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers: 100% Canadian Owned.© Copyright 2025 Metroland Media Group Ltd. All Rights Reserved8 Spadina Avenue, Suite 10A, Toronto, ON M5V 0S8 **** Sorry, an error occurred. **** **Sign Up** Sign up with **You're all set!** Thank you. Your account has been registered, and you are now logged in. Check your email for details. **Log In** Invalid password or account does not exist Sign in with **Reset Password** Submitting this form below will send a message to your email with a link to change your password. **Forgot Password** An email message containing instructions on how to reset your password has been sent to the email address listed on your account. **Email me a log in link** **Promotional Offers** No promotional rates found. **Purchase GiftPurchase Access** + Tax Secure & Encrypted Secure transaction.Secure transaction. Cancel anytime. **You're all set!** Thank you. Your gift purchase was successful!Your purchase was successful, and you are now logged in. You will also start receiving our free morning newsletter soon. A receipt was sent to your email. **An error occurred**"}