{"id": 1925, "name": "Commentary Magazine", "domain": "commentary.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.commentary.org/seth-mandel/road-map-for-peace-a-two-state-solution-to-californias-woes/", "title": "Road Map For Peace A Two State Solution To Californias Woes", "content": "Access yourCommentaryaccount. Lost your password? Please enter your email address. You will receive a link to create a new password via email. Home June 2025 ROAST Newsletter Archive Merch Donate Subscribe Contact Home June 2025 ROAST Newsletter Archive Merch Donate Subscribe Contact The monthly magazine of opinion. **Road Map for Peace: A Two-State Solution to California’s Woes** California Gov. Gavin Newsom and the entertainment industry are back to hectoring America from the Golden State. This time it’s about the “mostly peaceful” riots in Los Angeles, but I can’t help but recognize the tone of privileged condescension as the same one in which their party lectures our Israeli allies every time they are besieged by violent mobs. So what would it look like if we took them seriously and applied their own logic to the pickle they’ve got themselves in now?Yesterday, amid the demonstrations and riots in Los Angeles against federal immigration authorities, Newsom gave anemotional speechin which he told Californians the one thing they should never give President Trump: “Your silence.”I agree. After all, as the former astronaut Katy Perryposted, Los Angeles—“El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula,” as she so artfully calls it—“was once Mexican land.” So why should the protests stop at all, no matter what ICE does or does not do?Further, as Newsom himselfexplainedback in 2019, the State of California’s initial claim to sovereignty over those who lived there is sketchy at best and illegitimate at worst, according to California Executive Order N-15-19—and executive orders wouldn’t lie.Plenty of the progressive activists agree. This is a struggle against colonialism—as any congresswoman’s Ivy League-educated daughterwill tell you.Sure, the land was taken from the Spanish crown and sold legally to the United States, and therefore its identity as “Mexican land” is a bit of a stretch. We should respect each side’s own narrative and not deny anybody’s lived experience.Which is why I’ve got an idea.Does the U.S. really need all of California? Of course not. Think of all the problems that can be solved with that land. What we’ll again call Alto California—though only the part of the original Alto California that is within the current state’s borders—can be retroceded to Mexico. That way Southern California (or “Baja California”), the part of California that America seems to care about, can remain in the U.S. Would that make Mexico suddenly noncontiguous? Sure, but there’s no reason they can’t just build a tunnel connecting them.It’s not just about appeasing Mexico. Three years ago, the native Tongva—that would be the tribe that Newsom has been directing his apologies to—got their own acre of land in Los Angeles County. But one acre? California can do better than that. The Greater Los Angeles area is an enormous place, and the Tongva surely have claim to a fair share of it.But then again Malibu is a Chumash word,according to the state. Chumash is another tribe that doesn’t get as much attention as the Tongva, but that shouldn’t work against them. Meanwhile, Los Angeles carries a great deal of sentimental value for Mexicans as well, and it’d be a shame to force them to get a passport just to see it.Now I know what you’re thinking: It’s getting pretty crowded here in this hypothetical Greater Los Angeles now. But that’s OK—sometimes justice is crowded.And there’s an easy solution: Just make Los Angeles an international city! We’d put the greater metropolitan area of LA under a special international regime we could refer to as a Corpus Separatum. The area is home to many religions in addition to its national minorities, so all its holy places—Disneyland, the Staples Center, the Hollywood Bowl, that gas station shop on Pico Boulevard that carries kosher beef jerky—would be placed under a United Nations trusteeship.And yes, of course Oakland will be demilitarized.I know this all sounds like a lot, and obviously the devil is in the details, but if what California Democrats are saying about their own state is true, then simply having Donald Trump remove the National Guard from the site of conflict isn’t nearly enough. It doesn’t get at theroot causes, you see. Peace isn’t the same thing as justice.You might be thinking:This is all easy for you to say from thousands of miles away. And you’re right: It is easy for me to say this.It’s easy for me to say this because the Democratic-progressive one-size-fits-all solution to ethnic and national conflict is seared into my brain. I’ve been listening to it for decades. And what I’ve learned from watching progressives “solve” the Israeli-Palestinian conflict is that all conflicts are the same. That the historical record is a matter of opinion. That violence and mayhem should be rewarded. That in any conflict, the side wearing a uniform is the Bad Guy. That what is happening—whatever it is, wherever it is—simplyisn’t who we are. Finally,as a Jew, I just can’t stand by and watch it happen. It’s time to take Democrats’ advice and advance a two-state solution. You’re welcome, Gavin. Yesterday, amid the demonstrations and riots in Los Angeles against federal immigration authorities, Newsom gave anemotional speechin which he told Californians the one thing they should never give President Trump: “Your silence.” I agree. After all, as the former astronaut Katy Perryposted, Los Angeles—“El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula,” as she so artfully calls it—“was once Mexican land.” So why should the protests stop at all, no matter what ICE does or does not do? Further, as Newsom himselfexplainedback in 2019, the State of California’s initial claim to sovereignty over those who lived there is sketchy at best and illegitimate at worst, according to California Executive Order N-15-19—and executive orders wouldn’t lie. Plenty of the progressive activists agree. This is a struggle against colonialism—as any congresswoman’s Ivy League-educated daughterwill tell you. Sure, the land was taken from the Spanish crown and sold legally to the United States, and therefore its identity as “Mexican land” is a bit of a stretch. We should respect each side’s own narrative and not deny anybody’s lived experience. Which is why I’ve got an idea. Does the U.S. really need all of California? Of course not. Think of all the problems that can be solved with that land. What we’ll again call Alto California—though only the part of the original Alto California that is within the current state’s borders—can be retroceded to Mexico. That way Southern California (or “Baja California”), the part of California that America seems to care about, can remain in the U.S. Would that make Mexico suddenly noncontiguous? Sure, but there’s no reason they can’t just build a tunnel connecting them. It’s not just about appeasing Mexico. Three years ago, the native Tongva—that would be the tribe that Newsom has been directing his apologies to—got their own acre of land in Los Angeles County. But one acre? California can do better than that. The Greater Los Angeles area is an enormous place, and the Tongva surely have claim to a fair share of it. But then again Malibu is a Chumash word,according to the state. Chumash is another tribe that doesn’t get as much attention as the Tongva, but that shouldn’t work against them. Meanwhile, Los Angeles carries a great deal of sentimental value for Mexicans as well, and it’d be a shame to force them to get a passport just to see it. Now I know what you’re thinking: It’s getting pretty crowded here in this hypothetical Greater Los Angeles now. But that’s OK—sometimes justice is crowded. And there’s an easy solution: Just make Los Angeles an international city! We’d put the greater metropolitan area of LA under a special international regime we could refer to as a Corpus Separatum. The area is home to many religions in addition to its national minorities, so all its holy places—Disneyland, the Staples Center, the Hollywood Bowl, that gas station shop on Pico Boulevard that carries kosher beef jerky—would be placed under a United Nations trusteeship. And yes, of course Oakland will be demilitarized. I know this all sounds like a lot, and obviously the devil is in the details, but if what California Democrats are saying about their own state is true, then simply having Donald Trump remove the National Guard from the site of conflict isn’t nearly enough. It doesn’t get at theroot causes, you see. Peace isn’t the same thing as justice. You might be thinking:This is all easy for you to say from thousands of miles away. And you’re right: It is easy for me to say this. It’s easy for me to say this because the Democratic-progressive one-size-fits-all solution to ethnic and national conflict is seared into my brain. I’ve been listening to it for decades. And what I’ve learned from watching progressives “solve” the Israeli-Palestinian conflict is that all conflicts are the same. That the historical record is a matter of opinion. That violence and mayhem should be rewarded. That in any conflict, the side wearing a uniform is the Bad Guy. That what is happening—whatever it is, wherever it is—simplyisn’t who we are. Finally,as a Jew, I just can’t stand by and watch it happen. It’s time to take Democrats’ advice and advance a two-state solution. You’re welcome, Gavin. Yesterday, amid the demonstrations and riots in Los Angeles against federal immigration authorities, Newsom gave anemotional speechin which he told Californians the one thing they should never give President Trump: “Your silence.” I agree. After all, as the former astronaut Katy Perryposted, Los Angeles—“El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula,” as she so artfully calls it—“was once Mexican land.” So why should the protests stop at all, no matter what ICE does or does not do? Further, as Newsom himselfexplainedback in 2019, the State of California’s initial claim to sovereignty over those who lived there is sketchy at best and illegitimate at worst, according to California Executive Order N-15-19—and executive orders wouldn’t lie. Plenty of the progressive activists agree. This is a struggle against colonialism—as any congresswoman’s Ivy League-educated daughterwill tell you. Sure, the land was taken from the Spanish crown and sold legally to the United States, and therefore its identity as “Mexican land” is a bit of a stretch. We should respect each side’s own narrative and not deny anybody’s lived experience. Which is why I’ve got an idea. Does the U.S. really need all of California? Of course not. Think of all the problems that can be solved with that land. What we’ll again call Alto California—though only the part of the original Alto California that is within the current state’s borders—can be retroceded to Mexico. That way Southern California (or “Baja California”), the part of California that America seems to care about, can remain in the U.S. Would that make Mexico suddenly noncontiguous? Sure, but there’s no reason they can’t just build a tunnel connecting them. It’s not just about appeasing Mexico. Three years ago, the native Tongva—that would be the tribe that Newsom has been directing his apologies to—got their own acre of land in Los Angeles County. But one acre? California can do better than that. The Greater Los Angeles area is an enormous place, and the Tongva surely have claim to a fair share of it. But then again Malibu is a Chumash word,according to the state. Chumash is another tribe that doesn’t get as much attention as the Tongva, but that shouldn’t work against them. Meanwhile, Los Angeles carries a great deal of sentimental value for Mexicans as well, and it’d be a shame to force them to get a passport just to see it. Now I know what you’re thinking: It’s getting pretty crowded here in this hypothetical Greater Los Angeles now. But that’s OK—sometimes justice is crowded. And there’s an easy solution: Just make Los Angeles an international city! We’d put the greater metropolitan area of LA under a special international regime we could refer to as a Corpus Separatum. The area is home to many religions in addition to its national minorities, so all its holy places—Disneyland, the Staples Center, the Hollywood Bowl, that gas station shop on Pico Boulevard that carries kosher beef jerky—would be placed under a United Nations trusteeship. And yes, of course Oakland will be demilitarized. I know this all sounds like a lot, and obviously the devil is in the details, but if what California Democrats are saying about their own state is true, then simply having Donald Trump remove the National Guard from the site of conflict isn’t nearly enough. It doesn’t get at theroot causes, you see. Peace isn’t the same thing as justice. You might be thinking:This is all easy for you to say from thousands of miles away. And you’re right: It is easy for me to say this. It’s easy for me to say this because the Democratic-progressive one-size-fits-all solution to ethnic and national conflict is seared into my brain. I’ve been listening to it for decades. And what I’ve learned from watching progressives “solve” the Israeli-Palestinian conflict is that all conflicts are the same. That the historical record is a matter of opinion. That violence and mayhem should be rewarded. That in any conflict, the side wearing a uniform is the Bad Guy. That what is happening—whatever it is, wherever it is—simplyisn’t who we are. Finally,as a Jew, I just can’t stand by and watch it happen. It’s time to take Democrats’ advice and advance a two-state solution. You’re welcome, Gavin. Share via: More **Trending Now** **Road Map for Peace: A Two-State Solution to California’s Woes** **Nihilists on Parade** **Actually, Threatening Jewish Students Is Bad** **The Crypto Jew-Haters** **What Are the Democrats Doing?** **Fight the insanity. Subscribe to reason.** Start your risk free trial with unlimited access. **Listen to the bestpodcastanywhere, everywhere.** **What's in the latest issue?** Explore the scintillating June 2025 issue of Commentary. **Actually, Threatening Jewish Students Is Bad** **The Crypto Jew-Haters** **Free Palestine from ‘Free Palestine’** Scroll Down For the Next Article **Intelligent opinions since 1945.Subscribe and support our efforts.** About Us Privacy Policy Terms of Use Advertise with us Site design bybeck & stone Type and press enter Twitter Facebook WhatsApp LinkedIn Pinterest SMS Email Print Copy Link More Networks"}