{"id": 1141, "name": "The American Prospect", "domain": "prospect.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://prospect.org/labor/the-alt-labor-chronicles-america-s-worker-centers", "title": "The Alt Labor Chronicles America S Worker Centers", "content": "Manage A Print Subscription Manage a Recurring Donation DNC 2024 The Cold Civil War How Pricing Really Works Money, Politics and Power Economic Models Economic Policy Working in AmericaThe Alt-Labor Chronicles: America’s Worker Centers The Alt-Labor Chronicles: America’s Worker Centers The Alt-Labor Chronicles: America’s Worker Centers Energy and the EnvironmentClimate of Opportunity Climate of Opportunity Climate of Opportunity Housing and TransportationBuilding Back America Building Back America Building Back America Civil Rights in America Law and Justice Health and Social Policy America and the World Podcasts The Prospect Archive The Alt-Labor Chronicles: America’s Worker Centers **The Alt-Labor Chronicles: America’s Worker Centers** Jakub Porzycki/NurPhotoHow Gig Workers Are Bearing the Brunt of the Global Economic CrisisHigher prices, an imminent economic downturn, and the stock market turmoil have turned working conditions from bad to worse for on-demand workers.Jul 25, 2022Rachel Phua Jakub Porzycki/NurPhoto **How Gig Workers Are Bearing the Brunt of the Global Economic Crisis** Higher prices, an imminent economic downturn, and the stock market turmoil have turned working conditions from bad to worse for on-demand workers. Jul 25, 2022 Rachel Phua Jakub Porzycki/NurPhoto **How Gig Workers Are Bearing the Brunt of the Global Economic Crisis** Higher prices, an imminent economic downturn, and the stock market turmoil have turned working conditions from bad to worse for on-demand workers. Jul 25, 2022 Rachel Phua ⏩ Building a Just Economy: Insights from Worker Center LeadersA panel event on the past and future of workers’ rightsSep 3, 2021Prospect Staff **⏩ Building a Just Economy: Insights from Worker Center Leaders** A panel event on the past and future of workers’ rights Sep 3, 2021 Prospect Staff **⏩ Building a Just Economy: Insights from Worker Center Leaders** A panel event on the past and future of workers’ rights Sep 3, 2021 Prospect Staff AP PhotoHelping the Powerless Build PowerPablo Alvarado: An oral historyAug 31, 2021Harold Meyerson AP Photo **Helping the Powerless Build Power** Pablo Alvarado: An oral history Aug 31, 2021 Harold Meyerson AP Photo **Helping the Powerless Build Power** Pablo Alvarado: An oral history Aug 31, 2021 Harold Meyerson Hans Pennink/AP PhotoWorker Centers: Past, Present, and FutureHow a movement of the most vulnerable workers has won major social reforms—and how it can build on those going forwardAug 30, 2021Laine Romero-Alston,Sarita Gupta Hans Pennink/AP Photo **Worker Centers: Past, Present, and Future** How a movement of the most vulnerable workers has won major social reforms—and how it can build on those going forward Aug 30, 2021 Laine Romero-Alston,Sarita Gupta Hans Pennink/AP Photo **Worker Centers: Past, Present, and Future** How a movement of the most vulnerable workers has won major social reforms—and how it can build on those going forward Aug 30, 2021 Laine Romero-Alston,Sarita Gupta Mary Altaffer/AP PhotoHelping the Powerless Build PowerOral histories of five activists who’ve worked in and for worker centersApr 27, 2021Brittany Gibson,Jarod Facundo Mary Altaffer/AP Photo **Helping the Powerless Build Power** Oral histories of five activists who’ve worked in and for worker centers Apr 27, 2021 Brittany Gibson,Jarod Facundo Mary Altaffer/AP Photo **Helping the Powerless Build Power** Oral histories of five activists who’ve worked in and for worker centers Apr 27, 2021 Brittany Gibson,Jarod Facundo Jeff Martin/AP PhotoVoices to Votes: Worker Centers Meet the Political MomentHow—and why—worker centers expanded from providing services to engaging in electoral politicsApr 26, 2021Kim Fellner Jeff Martin/AP Photo **Voices to Votes: Worker Centers Meet the Political Moment** How—and why—worker centers expanded from providing services to engaging in electoral politics Apr 26, 2021 Kim Fellner Jeff Martin/AP Photo **Voices to Votes: Worker Centers Meet the Political Moment** How—and why—worker centers expanded from providing services to engaging in electoral politics Apr 26, 2021 Kim Fellner The Funding DilemmaUnlike unions, worker centers can’t be sustained by their members’ dues. So survival is an ongoing challenge.Apr 26, 2021Kim Fellner **The Funding Dilemma** Unlike unions, worker centers can’t be sustained by their members’ dues. So survival is an ongoing challenge. Apr 26, 2021 Kim Fellner **The Funding Dilemma** Unlike unions, worker centers can’t be sustained by their members’ dues. So survival is an ongoing challenge. Apr 26, 2021 Kim Fellner Stefano Paltera/AP PhotoEmbracing and Resisting: The Variable Relationships Between Worker Centers and UnionsIn some cities, the two kinds of worker organizations frequently collaborate. In other cities, not so much.Apr 22, 2021Steven Greenhouse Stefano Paltera/AP Photo **Embracing and Resisting: The Variable Relationships Between Worker Centers and Unions** In some cities, the two kinds of worker organizations frequently collaborate. In other cities, not so much. Apr 22, 2021 Steven Greenhouse Stefano Paltera/AP Photo **Embracing and Resisting: The Variable Relationships Between Worker Centers and Unions** In some cities, the two kinds of worker organizations frequently collaborate. In other cities, not so much. Apr 22, 2021 Steven Greenhouse CQ Roll Call via AP ImagesJohn Sweeney and Worker CentersThe AFL-CIO president who aligned the labor establishment with the women, immigrants, and minorities of alt-laborApr 22, 2021Steven Greenhouse CQ Roll Call via AP Images **John Sweeney and Worker Centers** The AFL-CIO president who aligned the labor establishment with the women, immigrants, and minorities of alt-labor Apr 22, 2021 Steven Greenhouse CQ Roll Call via AP Images **John Sweeney and Worker Centers** The AFL-CIO president who aligned the labor establishment with the women, immigrants, and minorities of alt-labor Apr 22, 2021 Steven Greenhouse Leila Navidi/Star Tribune via APWorker Centers: Where Causes Cohere, and Forge PowerAt the crossroads of diverse social movements and worker representation, many centers have become models of intersectionality.Apr 21, 2021Sarah Jaffe Leila Navidi/Star Tribune via AP **Worker Centers: Where Causes Cohere, and Forge Power** At the crossroads of diverse social movements and worker representation, many centers have become models of intersectionality. Apr 21, 2021 Sarah Jaffe Leila Navidi/Star Tribune via AP **Worker Centers: Where Causes Cohere, and Forge Power** At the crossroads of diverse social movements and worker representation, many centers have become models of intersectionality. Apr 21, 2021 Sarah Jaffe Black Worker Centers: Building Workplace Power in the CommunitiesEven in anti-union terrains, the centers have found ways to change public and corporate policies.Apr 20, 2021Matthew Cunningham-Cook **Black Worker Centers: Building Workplace Power in the Communities** Even in anti-union terrains, the centers have found ways to change public and corporate policies. Apr 20, 2021 Matthew Cunningham-Cook **Black Worker Centers: Building Workplace Power in the Communities** Even in anti-union terrains, the centers have found ways to change public and corporate policies. Apr 20, 2021 Matthew Cunningham-Cook J. Scott Applewhite/AP PhotoHow the Powerless Win PowerImmigrant workers—particularly the undocumented—are denied basic rights, but through worker centers, they’ve aggregated their strength and bettered their lives.Apr 19, 2021Michelle Chen J. Scott Applewhite/AP Photo **How the Powerless Win Power** Immigrant workers—particularly the undocumented—are denied basic rights, but through worker centers, they’ve aggregated their strength and bettered their lives. Apr 19, 2021 Michelle Chen J. Scott Applewhite/AP Photo **How the Powerless Win Power** Immigrant workers—particularly the undocumented—are denied basic rights, but through worker centers, they’ve aggregated their strength and bettered their lives. Apr 19, 2021 Michelle Chen The Alt-Labor Chronicles: America’s Worker CentersA Prospect series on how day laborers, domestics, fry cooks, and others have built institutions and won power to better their livesApr 19, 2021Harold Meyerson **The Alt-Labor Chronicles: America’s Worker Centers** A Prospect series on how day laborers, domestics, fry cooks, and others have built institutions and won power to better their lives Apr 19, 2021 Harold Meyerson **The Alt-Labor Chronicles: America’s Worker Centers** A Prospect series on how day laborers, domestics, fry cooks, and others have built institutions and won power to better their lives Apr 19, 2021 Harold Meyerson About the Prospect | Contact Info Careers|FAQ Newsletters Browse Archive / Back Issues Manage A Print Subscription Manage A Recurring Donation Privacy Policy DONATE TO THE PROSPECT Copyright 2025 | The American Prospect, Inc. | All Rights Reserved"}