{"id": 652, "name": "Hong Kong Free Press", "domain": "hongkongfp.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://hongkongfp.com/2025/05/25/victims-for-a-lifetime-refugees-in-hong-kong-tell-of-life-in-limbo-after-trump-suspension-of-resettlement-programme/", "title": "Victims For A Lifetime Refugees In Hong Kong Tell Of Life In Limbo After Trump Suspension Of Resettlement Programme", "content": "SUPPORT HKFP ETHICS ABOUT NEWSLETTER PODCAST FEATURES REGIONSOpen dropdown menuChinaHong KongMacauTaiwanWorld China Hong Kong Macau Taiwan World China Hong Kong Macau Taiwan World TOPICSOpen dropdown menu2014 Umbrella Movement2019 Protests2021 Legislative Election2022 Leadership Race2023 District Council Election47 Democrats TrialCovid-19Election OverhaulJimmy Lai TrialJohn LeeNational SecurityPress Freedom & CensorshipStand News trialTaiwan Election 2024 2014 Umbrella Movement 2019 Protests 2021 Legislative Election 2022 Leadership Race 2023 District Council Election 47 Democrats Trial Covid-19 Election Overhaul Jimmy Lai Trial John Lee National Security Press Freedom & Censorship Stand News trial Taiwan Election 2024 2014 Umbrella Movement 2019 Protests 2021 Legislative Election 2022 Leadership Race 2023 District Council Election 47 Democrats Trial Covid-19 Election Overhaul Jimmy Lai Trial John Lee National Security Press Freedom & Censorship Stand News trial Taiwan Election 2024 SECTIONSOpen dropdown menuAnimalsArts & LifestyleBusinessCommunity & EducationDomestic WorkersEnvironment & HealthHKFP FeaturesInterviewsLaw & CrimeLGBTQ & GenderPolitics & ProtestScience & TechnologySportTravel & Transport Animals Arts & Lifestyle Business Community & Education Domestic Workers Environment & Health HKFP Features Interviews Law & Crime LGBTQ & Gender Politics & Protest Science & Technology Sport Travel & Transport Animals Arts & Lifestyle Business Community & Education Domestic Workers Environment & Health HKFP Features Interviews Law & Crime LGBTQ & Gender Politics & Protest Science & Technology Sport Travel & Transport PROJECTSOpen dropdown menu2019 HKU Protest ArchiveCovid Children’s BookHong Kong HumansHong Kong OriginalsHong Kong’s Zine SceneHistory Museum ArchiveMonthly Security Law LogPartners in PridePlace Names SeriesPress Freedom TimelineShifting Narratives 2019 HKU Protest Archive Covid Children’s Book Hong Kong Humans Hong Kong Originals Hong Kong’s Zine Scene History Museum Archive Monthly Security Law Log Partners in Pride Place Names Series Press Freedom Timeline Shifting Narratives 2019 HKU Protest Archive Covid Children’s Book Hong Kong Humans Hong Kong Originals Hong Kong’s Zine Scene History Museum Archive Monthly Security Law Log Partners in Pride Place Names Series Press Freedom Timeline Shifting Narratives OPINION LENS SUPPORT AboutOpen dropdown menuAbout HKFPAdvertise with HKFPAnnual ReportAnnouncementsAwardsCareersCommunity GuidelinesDocumentaryFreelancer CharterPolicies, Ethics & Best PracticesPrivacy, T’s & C’sStoreStaffSupport HKFPThe Trust ProjectTransparency Report About HKFP Advertise with HKFP Annual Report Announcements Awards Careers Community Guidelines Documentary Freelancer Charter Policies, Ethics & Best Practices Privacy, T’s & C’s Store Staff Support HKFP The Trust Project Transparency Report About HKFP Advertise with HKFP Annual Report Announcements Awards Careers Community Guidelines Documentary Freelancer Charter Policies, Ethics & Best Practices Privacy, T’s & C’s Store Staff Support HKFP The Trust Project Transparency Report Advertise Contact Ethics Licensing Annual Report Transparency Apps Store Support us Facebook X Instagram Threads LinkedIn Bluesky YouTube Telegram Phone RSS **Categories** Animals Arts, Lifestyle & Events Business China Community & Education Defence & Foreign Policy Domestic Workers Environment & Health Hide HKFP Announcements HKFP Buzz HKFP Features HKFP Lens HKFP Reports HKFP Venture HKFP Voices Hong Kong Humour & Satire Interviews Law & Crime LGBTQ & Gender Macau Opinion Paid Content Politics & Protest Science & Technology Sport Taiwan TOP-LEVEL CAT (Pick 1) Travel & Transport Urban Exploring Video World AboutOpen dropdown menuAbout HKFPAdvertise with HKFPAnnual ReportAnnouncementsAwardsCareersCommunity GuidelinesDocumentaryFreelancer CharterPolicies, Ethics & Best PracticesPrivacy, T’s & C’sStoreStaffSupport HKFPThe Trust ProjectTransparency Report About HKFP Advertise with HKFP Annual Report Announcements Awards Careers Community Guidelines Documentary Freelancer Charter Policies, Ethics & Best Practices Privacy, T’s & C’s Store Staff Support HKFP The Trust Project Transparency Report About HKFP Advertise with HKFP Annual Report Announcements Awards Careers Community Guidelines Documentary Freelancer Charter Policies, Ethics & Best Practices Privacy, T’s & C’s Store Staff Support HKFP The Trust Project Transparency Report Advertise Contact Ethics Licensing Annual Report Transparency Apps Store Support us Facebook X Instagram Threads LinkedIn Bluesky YouTube Telegram Phone RSS Hong Kong Free Press HKFP Hong Kong news, breaking updates – 100% Independent, impartial, non-profit SUPPORT HKFP ETHICS ABOUT NEWSLETTER PODCAST FEATURES REGIONSOpen dropdown menuChinaHong KongMacauTaiwanWorld China Hong Kong Macau Taiwan World China Hong Kong Macau Taiwan World TOPICSOpen dropdown menu2014 Umbrella Movement2019 Protests2021 Legislative Election2022 Leadership Race2023 District Council Election47 Democrats TrialCovid-19Election OverhaulJimmy Lai TrialJohn LeeNational SecurityPress Freedom & CensorshipStand News trialTaiwan Election 2024 2014 Umbrella Movement 2019 Protests 2021 Legislative Election 2022 Leadership Race 2023 District Council Election 47 Democrats Trial Covid-19 Election Overhaul Jimmy Lai Trial John Lee National Security Press Freedom & Censorship Stand News trial Taiwan Election 2024 2014 Umbrella Movement 2019 Protests 2021 Legislative Election 2022 Leadership Race 2023 District Council Election 47 Democrats Trial Covid-19 Election Overhaul Jimmy Lai Trial John Lee National Security Press Freedom & Censorship Stand News trial Taiwan Election 2024 SECTIONSOpen dropdown menuAnimalsArts & LifestyleBusinessCommunity & EducationDomestic WorkersEnvironment & HealthHKFP FeaturesInterviewsLaw & CrimeLGBTQ & GenderPolitics & ProtestScience & TechnologySportTravel & Transport Animals Arts & Lifestyle Business Community & Education Domestic Workers Environment & Health HKFP Features Interviews Law & Crime LGBTQ & Gender Politics & Protest Science & Technology Sport Travel & Transport Animals Arts & Lifestyle Business Community & Education Domestic Workers Environment & Health HKFP Features Interviews Law & Crime LGBTQ & Gender Politics & Protest Science & Technology Sport Travel & Transport PROJECTSOpen dropdown menu2019 HKU Protest ArchiveCovid Children’s BookHong Kong HumansHong Kong OriginalsHong Kong’s Zine SceneHistory Museum ArchiveMonthly Security Law LogPartners in PridePlace Names SeriesPress Freedom TimelineShifting Narratives 2019 HKU Protest Archive Covid Children’s Book Hong Kong Humans Hong Kong Originals Hong Kong’s Zine Scene History Museum Archive Monthly Security Law Log Partners in Pride Place Names Series Press Freedom Timeline Shifting Narratives 2019 HKU Protest Archive Covid Children’s Book Hong Kong Humans Hong Kong Originals Hong Kong’s Zine Scene History Museum Archive Monthly Security Law Log Partners in Pride Place Names Series Press Freedom Timeline Shifting Narratives OPINION LENS SUPPORT New Article 23 Jimmy Lai Trial National Security 47 Democrats Trial Stand News Trial LGBTQ+ Taiwan Election 2019 Demos Press Freedom **‘Victims for a lifetime’: Refugees in Hong Kong tell of life in limbo after Trump’s suspension of resettlement programme** Click to share on Bluesky (Opens in new window)Bluesky Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Threads (Opens in new window)Threads Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Telegram (Opens in new window)Telegram Click to share on Reddit (Opens in new window)Reddit Click to share on WhatsApp (Opens in new window)WhatsApp Click to print (Opens in new window)Print Peter, a refugee in Hong Kong, fled political persecution in his home country in Africa. But he never thought he would become a victim again – this time because of a foreign leader thousands of kilometres away. He was scheduled to leave Hong Kong for resettlement in the US on February 4, but the plan was in shambles after Donald Trump was re-elected president. In January, Peter – who declined to disclose his full name and country of origin due to safety concerns – made preparations for his departure. “I packed almost everything, resigned from my job as a pastor, and prepared to return the subdivided unit to the landlord,” he recalled. But on January 20, just hours after taking office, President Trump – infamous for his anti-immigrant rhetoric –signedan executive order, indefinitely suspending the US Refugee Admission Program (USRAP). The executive order also called for a report from the Department of Homeland Security within 90 days to consider whether to resume refugee admissions. Yet, the April 20 deadline came and wentwithoutany announcement. With a stroke of a pen, Trump has upended the lives of many refugees like Peter around the world. They face a life in limbo, unable to enter the US despite having received approval for resettlement, and are forced to stay in a place without a path to permanent residency or citizenship. The number of refugeesadmittedinto the US annually actually decreased, from over 200,000 in 1980, when USRAP started, to around 100,000 in 2024, before Trump began his second term. Citing “the interests of the United States” and the country’s lack of “ability to absorb large numbers of migrants, and in particular, refugees,” Trump ordered the suspension of USRAP. Criticsslammedthe decision, calling it “unjustified” and pointing out that studies – including those by the government – showed refugees “have a positive economic effect on the United States.” As a victim of Trump’s orders, Peter felt disappointed while trying to be understanding. “It is unfair to us but the fairest thing from their perspective,” Peter told HKFP, referring to US policymakers. “They’re trying to sort out their house, to fix their house, right?” With many voters supporting Trump in the US presidential election, he believed that “no single person can be blamed” for the policy. “I understand that people handling refugee cases are also kind of overwhelmed… struggling to screen out who is a genuine refugee, but again, that doesn’t give them the right to make [the lives of] people who are genuine refugees so hard,” Peter said. People don’t choose to become refugees, he added. “Refugees are victims of circumstances, victims of people’s decisions, victims of people’s fights, and they find themselves to be victims for a lifetime.” As of October 2024, there were 37.9 million refugees worldwide,accordingto the United Nations High Commissioner for Refugees (UNHCR). In Hong Kong, there were 359 recognised refugees from late 2009 to March 2025, the Immigration Department’s data showed. Now, four months after the ill-fated news, Peter has slowly got back on his feet. After back-and-forth negotiations with his landlord, he was allowed to stay in the subdivided flat. His church agreed to hire him as a pastor again. In late April, he started working after receiving a work permit from the Hong Kong Immigration Department. “I am the luckiest,” said Peter, in his 40s, as he compared himself with many other refugees affected by the US ban. But like them, he was pessimistic about future resettlement. “Many [in the refugee community] were hopeful over the [90-day review]. Now, nobody has a clear direction for the future,” he said. **‘Back to square one’** The Christian Action Centre for Refugees is located in the labyrinth of Chungking Mansion. On one May afternoon, social worker and centre-in-charge Jeffrey Andrews was busy preparing for an online meeting with representatives of refugees and asylum seekers to give them information on the centre’s services and resettlement updates, especially the US’s. Andrews and his team tried to verify relevant news stories before they briefed the community to avoid giving them false hope. Around 10 refugees served by the centre had prepared to leave for the US before the suspension was announced. “Some had resigned from their jobs, their kids had withdrawn from school, and their house had been returned to the landlord,” Andrews said. Once they found themselves unable to get on the planes to the US, “they are back to square one, just like the day they arrived in Hong Kong to seek asylum.” Most refugees directly affected by Trump’s policy have not secured jobs in Hong Kong again after resigning in preparation for departure, he said. Dozens of refugees he knows expect their waiting time for resettlement to be prolonged. **From asylum seekers to resettlement** There were more than 15,000 asylum seekers in Hong Kong as of June 2024,accordingto the local NGO Justice Centre Hong Kong. They must go through lengthy screening and security vetting procedures before they finally see a glimpse of hope for overseas resettlement. The city, however, does not grant resettlement. Upon arriving in Hong Kong, asylum seekers can file non-refoulement claims with the city’s Immigration Department, whichassesseswhether their claims of fear of persecution are substantiated. If so, the government will not refoul them from Hong Kong. It will refer their cases to the United Nations High Commissioner for Refugees (UNHCR) to decide their refugee status. If UNHCR recognises them as refugees, it will try to arrange resettlement, mainly to Canada and the US, the world’slargestresettlement countries. Only after refugees are resettled do they gain the right to become naturalised citizens. “But resettlement is not a right for refugees according to UNHCR, which means it is not guaranteed,” said Andrews. Starting from their arrival in Hong Kong, asylum seekers wait an average of 10-15 years to be recognised as refugees and to be resettled in a third country, the social worker said. Peter was a school principal when he fled his country after suffering torture and political persecution. He arrived in Hong Kong in 2016 and had to wait around one year to be recognised as a refugee, which he said was “relatively fast.” It took him another seven years to be resettled. He said he was thrilled when UNHCR told him that the US had granted him asylum and that the US Citizenship and Immigration Services had approved his resettlement. Niki Wong, a programme manager at Branches of Hope, a Vine Church-founded NGO serving refugees and asylum seekers, told HKFP that refugees endured a longer waiting time over the past few years because Western countries suspended refugee resettlement during the Covid-19 pandemic. However, just as the resettlement programme returned to normal, they were hit by Trump’s refugee ban. Wong said that although most US-bound refugees he knows could find a place to live and carry on with their lives in the city, they still felt frustrated and hopeless because of an uncertain future. **Decades of waiting** Aimé Girimana, who has been in Hong Kong for 21 years, is another African refugee affected by Trump’s policy. Girimana, who works as a community partnerships officer at Justice Centre Hong Kong, was a human rights lawyer in an East African country. He arrived in Hong Kong in 2004, leaving behind his wife and children, to escape political persecution in his home country. “As I knew my life was under threat, I fled from my office directly to the airport,” he told HKFP. At that time, UNHCR – not the Immigration Department – was responsible for assessing persecution claims in Hong Kong. Girimana said it took only three days for him to be recognised as a refugee, but waiting for resettlement was far longer than he had ever imagined. He said UNHCR had difficulties finding him permanent asylum because of his political activism in his home country. In 2006, UNHCR assigned him to be resettled in Canada, but Canadian authorities refused. It was not until December 2023 that he learned the US had expanded theWelcome Corpsprogramme, allowing private individuals to sponsor refugees they know and welcome them to be resettled in the US under USRAP. Girimana successfully reached out to five American sponsors as requested by the programme. He went through the first interview in October and was waiting for the final interview when Trump announced the suspension of USRAP, including the Welcome Corps. “As a human being, your life is always dependent on others. It’s just like that anybody can decide on your life,” he said. Nonetheless, Girimana, who is in his 60s, is grateful to have a job in Hong Kong that allows him to work with the refugee community. It took years for him to get to where he is today. **‘It’s my duty’** When he arrived in Hong Kong, Girimana found it difficult to support himself because refugees and asylum seekers were not allowed to work. He took the initiative to collect food, clothes, and electrical appliances for refugee and asylum seeker families. He also worked with lawmakers and spoke at Legislative Council sessions to raise awareness. Girimana recalled that in his early years in Hong Kong, refugees and asylum seekers were either treated as if they were invisible or faced prejudice. “Prejudice [against] refugees was really bad. People didn’t have any awareness of refugees and thought that refugees were the same as economic immigrants,” he said. Having no legal right to work, most refugees and asylum seekers rely on a monthly allowance that the government only began to provide in 2006. In 2014, the government increased the allowance, giving an adult asylum seeker or refugee a total of HK$3,200 to HK$3,420 in monthly assistance – HK$1,500 for rent, HK$300 for utilities, HK$200 to HK$420 for transport, and HK$1,200 in food coupons – plus a rent deposit of HK$3,000. The amounts have not changed since. In 2010, Girimana was among four refugees and a torture claimant who filed a judicialreviewof their right to work in Hong Kong. They lost in the Court of First Instance and the Court of Appeal in2011and2012, respectively. The case ultimately went to the Court of Final Appeal. The top courtruledin2014, upholding the lower courts’ decisions that refugees have no constitutional right to work but do have a “discretionary permit” granted by the director of the Immigration Department. In 2013, Girimana got his first job in Hong Kong. It set a precedent, allowing refugees with a job offer to apply for permission to work from the Immigration Department. Uzma Naveed, a refugee from a country in South Asia, has been working as a diversity and inclusion coordinator at the Centre for Refugees for nearly two years. She told HKFP that she arrived in Hong Kong 10 years ago with her husband and child after religious persecution forced them to flee their country. Their lives changed overnight, from a comfortable middle-class existence to living hand to mouth. Uzma was finally recognised as a refugee in 2023 after going through exhaustive screenings for eight years, essentially – in her words – “repeating the trauma again and again.” She and her family are still waiting for UNHCR’s resettlement. However, with the USRAP suspension, she does not see much hope in the near future of finding a permanent home. At the Centre for Refugees, she organises activities, including cooking, sewing, yoga, and basketball, for refugees and asylum seekers to build “a home away from home.” “Every refugee has some kind of depression. No one is living a good life,” said Uzma, in her 30s. For refugees and asylum seekers – many of whom live in subdivided units – knowing others with similar experiences can be empowering, she added. In early February, four American NGOs filed a lawsuit challenging Trump’s refugee ban and funding halt for refugee humanitarian aid. On May 15, a federal judgeorderedthe Trump administration to “immediately” resettle around 160 refugees who were scheduled to travel to the US on or before February 3. For an additional 120,000 refugees “who had arranged and confirmable travel” to the US after February 3, the court would appoint an official to help conduct a case-by-case review. However, as of Saturday, the Trump administration has yet to take any action. Peter is unsure about his resettlement, saying it depends on whether the US will lift the ban. Meanwhile, prejudices against asylum seekers and refugees persist. Some Hong Kong lawmakers still talk about “bogus refugees” who they claimcommitcrimes andwastepublic expenditure – allegations that activists call “racist” and “xenophobic.” Despite living in limbo, Girimana is determined to continue raising public awareness. “It’s my duty when I fled my country,” he said, adding that people should not think refugees are economic migrants. “You could blame the system [of screening refugees], but don’t blame those people looking for safety as refugees.” Support HKFP|Policies & Ethics|Error/typo?|Contact Us|Newsletter|Transparency & Annual Report|Apps Help safeguard press freedom & keep HKFP free for all readers bysupporting our team **LATEST FROM HKFP** **Google searches for ‘secessionist’ online game surge in Hong Kong after authorities warn residents to delete app** **US, China agree on trade ‘framework’ after high-level talks in London** **Anti-corruption watchdog charges ex-lecturer who allegedly solicited HK$20,000 bribe from student** **Billions of data records relating to Chinese citizens leaked online, including WeChat and Alipay details** Support HKFP|Code of Ethics|Error/typo?|Contact Us|Newsletter|Annual & Transparency Report **Irene ChanFeatures Editor** x linkedin Irene Chan is a reporter at Hong Kong Free Press and has an interest in covering political and social change. She previously worked at Initium Media as chief editor for Hong Kong news and was a community organiser at the Society for Community Organisation serving the underprivileged. She has a bachelor’s degree in Journalism from Fudan University and a master’s degree in social work from the Chinese University of Hong Kong. Irene is the recipient of two Society of Publishers in Asia (SOPA) awards and three honourable mentions for her investigative, feature and video reporting. She also received a Human Rights Press Award for multimedia reporting and an honourable mention for feature writing. Facebook X Instagram Threads LinkedIn Bluesky YouTube Telegram Phone RSS About HKFP Advertise with HKFP Annual Report Announcements Anti-harassment Policy Awards Careers Community Guidelines Documentary Freelance Charter Ethics, Policies, Standards Licensing Privacy, T’s & C’s Store Staff Support HKFP Transparency Report"}