{"id": 187, "name": "Canon City Daily Record", "domain": "canoncitydailyrecord.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.canoncitydailyrecord.com/2025/06/10/florence-man-arrested-on-suspicion-of-shooting-at-a-group-of-people-at-canon-city-walmart-following-verbal-dispute/", "title": "Florence Man Arrested On Suspicion Of Shooting At A Group Of People At Canon City Walmart Following Verbal Dispute", "content": "e-Edition e-Edition NewsLocal NewsBusiness NewsBusiness SpotlightBest ReviewsColorado NewsNation & World NewsEducationHealthPoliticsWeatherWorld News Local News Business News Business Spotlight Best Reviews Colorado News Nation & World News Education Health Politics Weather World News Local News Business News Business Spotlight Best Reviews Colorado News Nation & World News Education Health Politics Weather World News Local NewsWestcliffe NewsCañon City NewsPenrose NewsFlorence News Westcliffe News Cañon City News Penrose News Florence News Westcliffe News Cañon City News Penrose News Florence News SportsSportsHigh School SportsCañon City TigersFlorence Huskies Sports High School Sports Cañon City Tigers Florence Huskies Sports High School Sports Cañon City Tigers Florence Huskies Things To DoThings To DoEntertainmentLifestylesMilestonesLocal Events Things To Do Entertainment Lifestyles Milestones Local Events Things To Do Entertainment Lifestyles Milestones Local Events Submit ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsLetters to the EditorOpinion Columnists Opinion Editorials Letters to the Editor Opinion Columnists Opinion Editorials Letters to the Editor Opinion Columnists EntertainmentDaily Horoscope Daily Horoscope Daily Horoscope MarketplaceClassifiedsJobsSpecial SectionsCanon City ShopperBusiness DirectoryToday’s AdsAdvertise With UsSubmitSponsored ContentPublic Notices Classifieds Jobs Special Sections Canon City Shopper Business Directory Today’s Ads Advertise With Us Submit Sponsored Content Public Notices Classifieds Jobs Special Sections Canon City Shopper Business Directory Today’s Ads Advertise With Us Submit Sponsored Content Public Notices On The Record Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint e-Edition Subscribe Log In Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log In Sign up for email newsletters Subscribe Log In e-Edition e-Edition Local Business Business Spotlight Colorado Nation & World Education Politics Trending: Fremont County Fair 2025 📖 2025-2026 Explore Colorado Magazine Cañon City Activity Guide – Summer/Fall 2025 **Florence man arrested on suspicion of shooting at a group of people at Cañon City Walmart after verbal dispute** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X A Florence man was arrested Tuesday evening after he allegedly fired several shots at a group of people at the Cañon City Walmart. No injuries were reported. According to the Cañon City Police Department, officers were dispatched to Walmart at about 5:15 p.m. on a report of shots fired. On arrival, officers were able to ascertain from witnesses that occupants of a vehicle were engaged in some type of verbal dispute that led to a male occupant in the car to fire several shots at a group of people, the CCPD stated in a social media post. The vehicle fled the scene prior to officers arriving. The vehicle was located quickly with the help of Fremont County deputies. The suspect, John Elliott, 56, was taken into custody and transported to the Fremont County Detention Center. He is being held on charges of criminal attempt – first-degree assault. This is an ongoing and active investigation. Any witnesses to this event are encouraged to call and report that information to Det. Taryn Leonard at 719-276-5600. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Events** **Most Popular** Florence man arrested on suspicion of shooting at a group of people at Cañon City Walmart after verbal disputeFlorence man arrested on suspicion of shooting at a group of people at Cañon City Walmart after verbal dispute **Florence man arrested on suspicion of shooting at a group of people at Cañon City Walmart after verbal dispute** **Florence man arrested on suspicion of shooting at a group of people at Cañon City Walmart after verbal dispute** Colo. 115 at milepost 29 southbound closed for fatal crashColo. 115 at milepost 29 southbound closed for fatal crash **Colo. 115 at milepost 29 southbound closed for fatal crash** **Colo. 115 at milepost 29 southbound closed for fatal crash** BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrianBREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian **BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian** **BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian** Fremont County Sheriff: Cañon City man arrested, bonded out twice on same dayFremont County Sheriff: Cañon City man arrested, bonded out twice on same day **Fremont County Sheriff: Cañon City man arrested, bonded out twice on same day** **Fremont County Sheriff: Cañon City man arrested, bonded out twice on same day** Florence City Administrator Amy Nasta ‘moving on to new opportunities’Florence City Administrator Amy Nasta 'moving on to new opportunities' **Florence City Administrator Amy Nasta ‘moving on to new opportunities’** **Florence City Administrator Amy Nasta ‘moving on to new opportunities’** 1 killed, 1 injured in El Paso County crash with semitruck1 killed, 1 injured in El Paso County crash with semitruck **1 killed, 1 injured in El Paso County crash with semitruck** **1 killed, 1 injured in El Paso County crash with semitruck** Cañon City to consider adding new municipal code to protect feline friendsCañon City to consider adding new municipal code to protect feline friends **Cañon City to consider adding new municipal code to protect feline friends** **Cañon City to consider adding new municipal code to protect feline friends** Cañon City Police: Man arrested on suspicion of burglary, trespass, theftCañon City Police: Man arrested on suspicion of burglary, trespass, theft **Cañon City Police: Man arrested on suspicion of burglary, trespass, theft** **Cañon City Police: Man arrested on suspicion of burglary, trespass, theft** Cañon City man died in multi-vehicle accident SundayCañon City man died in multi-vehicle accident Sunday **Cañon City man died in multi-vehicle accident Sunday** **Cañon City man died in multi-vehicle accident Sunday** Cañon City High School’s science teacher Julie Milam named finalist for 2026 Colorado Teacher of the Year awardCañon City High School's science teacher Julie Milam named finalist for 2026 Colorado Teacher of the Year award **Cañon City High School’s science teacher Julie Milam named finalist for 2026 Colorado Teacher of the Year award** **Cañon City High School’s science teacher Julie Milam named finalist for 2026 Colorado Teacher of the Year award** **More in Local News** Cañon City Main Street parking violations would go to $30 under proposal **Cañon City Main Street parking violations would go to $30 under proposal** **Cañon City Main Street parking violations would go to $30 under proposal** BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian **BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian** **BREAKING NEWS: Florence man facing attempted first-degree murder charges after reportedly striking pedestrian** Florence Police Chief named interim city manager **Florence Police Chief named interim city manager** **Florence Police Chief named interim city manager** Cañon City’s Sorted Solutions helps residents declutter, get organized **Cañon City’s Sorted Solutions helps residents declutter, get organized** **Cañon City’s Sorted Solutions helps residents declutter, get organized** 2025 June 10 SubscribeSign Up For Newsletterse-EditionSubmitWeather Sign Up For Newsletters e-Edition Submit Weather Sign Up For Newsletters e-Edition Submit Weather Advertise With UsPrairie Mountain Media AdvertisingNetwork AdvertisingAdtaxi Solutions Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions Prairie Mountain Media Advertising Network Advertising Adtaxi Solutions ClassifiedsPlace a Classified AdToday’s Ads Place a Classified Ad Today’s Ads Place a Classified Ad Today’s Ads Prairie Mountain MediaContact UsWork With UsArchivesRSS FeedsPrivacy PolicyAccessibilitySitemap Contact Us Work With Us Archives RSS Feeds Privacy Policy Accessibility Sitemap Contact Us Work With Us Archives RSS Feeds Privacy Policy Accessibility Sitemap Business DirectorySpecial SectionsJobsCouponsPublic Notices Special Sections Jobs Coupons Public Notices Special Sections Jobs Coupons Public Notices Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration MediaNews Group Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}