{"id": 941, "name": "MyNewsLA.com", "domain": "mynewsla.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://mynewsla.com/crime/2025/06/11/alleged-gunman-in-killing-of-baldwin-park-officer-ordered-jailed-without-bail-2/", "title": "Alleged Gunman In Killing Of Baldwin Park Officer Ordered Jailed Without Bail 2", "content": "Crime Fire Government Business Education Hollywood Arts SFV SGV OC Riverside Health Life Traffic Weather About Staff Contact Advertise FAQ Privacy Policy Terms of Service Facebook Page Twitter Username RSS About Staff Contact Advertise FAQ Privacy Policy Terms of Service Facebook Page Twitter Username RSS MyNewsLA.com Breaking news for Los Angeles, Orange and Riverside counties Crime Fire Government Business Education Hollywood Arts SFV SGV OC Riverside Health Life Traffic Weather **Accused Gunman in Killing of Baldwin Park Officer Ordered Jailed Without Bail** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X The man accused of fatally shooting a Baldwin Park police officer and another man made his initial court appearance Wednesday and was ordered to be held in jail without bail while awaiting arraignment July 31. Eduardo Roberto Medina-Berumen, 22, is charged with two counts of murder and other charges stemming from the May 31 shooting that killed 35-year-old Officer Samuel Riveros — a nine-year department veteran — along with the shooting minutes earlier of 43-year-old Darius Wong, a married father of two young daughters. Medina-Berumen, who was injured in the gun battle, appeared in court in a wheelchair and agreed to a deputy public defender’s request that his arraignment be postponed. The murder charges include the special circumstance allegations of multiple murders and murder of a peace officer that could open him up to a possible death sentence if convicted as charged. District Attorney Nathan Hochman said last week that his office will decide later whether to seek capital punishment. Medina-Berumen is also charged with one count of possession of an assault rifle and two counts of attempted murder involving two other Baldwin Park police officers, including Officer Anthony Pimentel, whom Hochman said was wounded when he was “hit by shards of glass that came from a bullet that we believe hit a windshield or a side windshield.” Riveros was a part of a response dispatched at about 7:15 p.m. May 31 to the 4200 block of Filhurst Avenue, a few blocks east of the San Gabriel River (605) Freeway, regarding a man with a rifle, the sheriff’s department reported. Los Angeles County Sheriff Robert Luna said the Baldwin Park Police Department received a report of a man armed with a rifle who was shooting, saying that Pimentel and fellow Officer Alfredo Leal — who are identified as the victims in the attempted murder charges — arrived at the scene first in separate cars and were “immediately fired upon by this suspect who had a rifle.” “An officer-involved shooting occurred at that time and Officer Pimentel was injured as a result of the suspect’s gunfire,” Luna said, adding that Riveros arrived soon after and he was “tragically struck by the suspect’s gunfire and unfortunately that ended up being a fatal gunshot.” Other Baldwin Park police officers who subsequently arrived at the scene were involved in a “second volley” of gunfire in which “the suspect went down,” according to the sheriff. Sign up here for our free newsletters. We’ll send you the latest headlines every morning and every weekday afternoon. MyNewsLA.com won’t sell your information and you can unsubscribe at any time. “Officer Riveros, along with his fellow officers, ran towards the danger (with) absolutely no hesitation. That’s an act of profound courage,” Luna said, calling what happened “a tragedy” and saying that it serves as a painful reminder of the dangers law enforcement officers face on a daily basis. A man with a gunshot wound to his upper body — later identified as Wong — was located at the scene and rushed to a hospital, where he was pronounced dead. The motive for that shooting remains under investigation. During Wednesday’s brief court hearing in Pomona, Deputy District Attorney Michael Michelena told Superior Court Judge Ramiro P. Cisneros that he believes prosecutors can prove the defendant was standing outside his home with a short-barrel rifle and “started firing indiscriminately.” Michelena said Wong was shot first prior to the officers’ arrival. Officers ultimately “took him into custody after he ran out of ammunition,” the prosecutor said. At a June 3 news conference announcing the charges, Hochman said a .223-caliber assault pistol was found at the shooting scene with a 30-round magazine and approximately 40 to 60 expended shell casings that were found near the weapon. Baldwin Park Police Chief Robert Lopez — who was among those who was in court for Medina-Berumen’s first court appearance — last week called Riveros a “dedicated officer” who “selflessly put the safety of others before his own (and) gave his life doing so.” “… We will never forget Sam,” he said. Riveros was described as a UC Irvine graduate, an avid snowboarder and a Dodgers fan who had watched the team play at stadiums across the nation. The Peace Officers Research Association of California established an online fundraiser to support Riveros’ family and cover funeral expenses. Donations can be made atporac.org/fundraiser/officer-riveros/. In a GoFundMe page established to help cover funeral expenses for Wong, his brother Victor Vuong said his sibling died “in the most innocent of ways — without truly knowing what was happening.” “He was a kind soul with so much more life ahead of him,” Vuong wrote. “As we try to come to terms with this tragic loss, I’m asking for support to help cover funeral expenses and to give Darius the peaceful farewell he deserves. More importantly, we are also seeking justice for Darius. No one should have to experience what he went through, and we won’t stop until the truth is known and accountability is found.” More than $54,000 had been raised by the GoFundMe page as of Wednesday afternoon. **Leave a comment** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ **Get the Latest News by Email!** Sign up here for our free newsletters. We’ll send you the latest headlines every morning and every weekday afternoon. Check for a confirmation email, and then you're all set withMyNewsLA.com! **Latest Headlines** 1 Taken Into Custody in Boyle Heights State Recognizes Possible Impacts of Fire Maps on Insurance Rates Malibu Seeks Public Input on Speed Camera Program for PCH Video Game Artists Suspend Strike, Re-Open Contract Negotiations One Arrested After Boyle Heights Crash, Altercation **Most Popular Posts** Robbery Suspect Killed in Lancaster Shootout ID'd Driver Dies Crashing into Wall in Long Beach Arcadia Woman Pleads Guilty to Leadership Role in $11M Money Laundering Ring Body Found in DTLA; Unknown if Death Related to ICE Raids, Protests Blaze Tears Through Menifee Mobile Home, Displacing Resident About Staff Contact Advertise FAQ Privacy Policy Terms of Service Facebook Page Twitter Username RSS"}