{"id": 743, "name": "KENS - San Antonio News", "domain": "kens5.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kens5.com/article/life/pets/forgotten-friends/mother-daughter-trixie-pixie-adopted-together-forgotten-friends-cats-kitty-feline-shelter-kerrville-bonded-pair/273-8c4b9dd1-e667-4025-9a30-5686d9400531", "title": "Mother Daughter Trixie Pixie Adopted Together Forgotten Friends Cats Kitty Feline Shelter Kerrville Bonded Pair", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocal NewsSATXtodayTexas NewsKENS 5 OriginalsPoliticsCall KENSAt the BorderNear MeNation & WorldGreat Day SAFeatures >>KENS CaresLatest News StoriesCounty offices downtown closing early Wednesday ahead of planned protestsCity of Sabinal issues disaster declaration Back Local News SATXtoday Texas News KENS 5 Originals Politics Call KENS At the Border Near Me Nation & World Great Day SA Features >> KENS Cares County offices downtown closing early Wednesday ahead of planned protests City of Sabinal issues disaster declaration Back Local News SATXtoday Texas News KENS 5 Originals Politics Call KENS At the Border Near Me Nation & World Great Day SA Features >> KENS Cares County offices downtown closing early Wednesday ahead of planned protests City of Sabinal issues disaster declaration WeatherBackForecastRadarHourly/Extended14-Day Forecast & MapsPollenAquiferHurricane TrackerTrafficLatest Weather StoriesMostly cloudy and warm, thunderstorms develop later Wednesday | KENS 5 Weather Impact ForecastSan Antonio could see more heavy rain, flooding this week | Weather Impact Alert Back Forecast Radar Hourly/Extended 14-Day Forecast & Maps Pollen Aquifer Hurricane Tracker Traffic Mostly cloudy and warm, thunderstorms develop later Wednesday | KENS 5 Weather Impact Forecast San Antonio could see more heavy rain, flooding this week | Weather Impact Alert Back Forecast Radar Hourly/Extended 14-Day Forecast & Maps Pollen Aquifer Hurricane Tracker Traffic Mostly cloudy and warm, thunderstorms develop later Wednesday | KENS 5 Weather Impact Forecast San Antonio could see more heavy rain, flooding this week | Weather Impact Alert SportsBackHigh School SportsSan Antonio SpursTexas RangersHouston AstrosCollege SportsTexas OutdoorsLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfallReport: Kevin Durant weighing trade options, which include the Spurs Back High School Sports San Antonio Spurs Texas Rangers Houston Astros College Sports Texas Outdoors Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfall Report: Kevin Durant weighing trade options, which include the Spurs Back High School Sports San Antonio Spurs Texas Rangers Houston Astros College Sports Texas Outdoors Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawFemale athletes appeal NCAA settlement, cite Title IX disparityLandmark NCAA settlement challenged by 8 female athletesFemale athletes appeal NCAA settlement, citing $1.1 billion Title IX shortfall Report: Kevin Durant weighing trade options, which include the Spurs SearchSearch:Search Get KENS 5+ KENS Cares Spurs Project Marvel Neighborhood Eats Call KENS Advertise With Us Originals TV Listings Screen Test Health At the Border Fiesta! Together We Rise **Mother, daughter pair Trixie and Pixie hope to be adopted together | Forgotten Friends** **** To stream KENS 5 on your phone, you need the KENS 5 app. **** **Download the KENS 5 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video KERRVILLE, Texas —Our \"Forgotten Friends\" series showcases a dog or cat each week that has spent a lengthy time at an area shelter, just waiting for someone to notice them and bring them home to love. This week, we meet a mother and daughter found near the Guadalupe River and brought to theAWS Freeman Fritts Animal Shelterin Kerrville by some amazing volunteers over 10 months ago. \"Pixie was just a 6-week-old floof when she was first spotted teetering along a river trail dangerously close to the water—wobbly, wide-eyed, and working her tiny kitten magic on everyone who saw her,\" said shelter staff. \"The video we received showed signs of Cerebellar Hypoplasia, a neurological condition that affects her coordination—but not her spirit.\" The mom is Trixie, a gorgeous 2-year-old Tuxedo cat that is black with a white bib and boots. Her daughter is Pixie, a 1-year-old solid black domestic shorthair cat. \"The morning after that first sighting, some amazing volunteers found Pixie—and got a surprise,\" said shelter staff. \"Her mom, Trixie, was right by her side. Trixie had clearly been doing everything she could to keep her baby safe, and she hasn’t stopped since.\" **MORE PHOTOS** 1/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 2/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 3/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 4/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 5/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 6/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 7/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 8/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 9/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 10/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. 11/11KENS 5 StaffThey have been waiting patiently at the shelter in Kerrville for almost a year, just hoping that someone chooses them to love. Now you might think that being a little wobbly would slow down Pixie, but staff say that she doesn't really know that she's any different. \"She plays, she purrs, she zooms,\" said shelter staff. All she really needs now is a safe environment. Other than that? She’s just like any other playful kitten. That's why shelter staff are looking for a calm home for the pair of felines, preferably one with no young children. And one where they can remain indoors. They both love Temptation cat treats and playing with toys that are on a wand. Mom Trixie is super sweet and loving but it might take a little time for Pixie to warm up to someone new. Right now, she might hiss at you, but don't let that scare you off! \"Mama Trixie could eventually be someone’s lap cat and definitely gets her purr machine going,\" said shelter staff. The mama and daughter pair are both healthy (with the exception of Pixie being a little wobbly), current on all of their vaccinations, and already spayed. \"Pixie is now a year old and ready to celebrate her very first birthday in a forever home—with her mama by her side,\" said shelter staff. \"These two are deeply bonded, and we won’t separate them. They’re a perfect match of spunky and serene.\" If you are interested in adopting this bonded pair, pleasecontact AWS Freeman Frittsdirectly at (830) 257-4144. They are located in Kerrville at 515 Spur 100. You can alsovisit their websitefor more information on adopting Trixie and Pixie or another animal from AWS Freeman Fritts. Not quite ready to adopt but have some extra time on your hands? They always need volunteers.CLICK HEREto find out how you can make a difference. Another way to help is by sponsoringone of their \"hard to adopt\" cats. These are cats that continue to be overlooked because they are \"too old, too shy, too cranky or just need too much medical care.\" A bonus of this way of showing your support is no litter box to clean. You get a virtual pet to love, and they get the extra financial help they so desperately need. You will receive monthly photos of your special kitty as well as an update on how they are doing. You can even go visit the shelter and play with them when you have time. You can also stop the sponsorship whenever you'd like, but they hope that you won't. Financial donationsare also always appreciated. You can also donate in person or by mail at 515 Spur 100, Kerrville, TX 78028. Visit theirAmazon wish listto check out what they need the most. Or if you are at the store and want to pick up something and drop it off at the shelter, here are some of the items they need: Yum Meow Mix Dry Cat Food Fancy Feast or Friskies Gourmet Canned Pate Cat Food Pepperoni Dog Training Treats Gerber Stage 2 Chicken Baby Food for kittens Fancy Feast Dry Cat Food Clean as a Whistle Fabulosa - any fragrance Dawn Dish Soap, Clorox Bleach, Clorox Wipes Paper Towels, Hand Towels, Bath Towels Large Covered Litter Boxes, Litter Scoops Other Necessities and Warm Fuzzies Dog and Cat Beds Baby Blankets Bath Rugs with Rubber Backing Dog and Cat Toys Small and Medium Dog Collars and Leashes Breakaway Cat and Kitten Collars Freeman-Fritts Vet Clinic & Shelter515 Spur 100, Kerrville, Texas 78028Email:info@freemanfritts.comTel: (830) 257-4144Office Hours7:30 a.m.- 12:00 p.m.& 1:00 p.m.- 5:30 p.m.Monday - FridayShelter Hours1:00 p.m.- 4:00 p.m.Wednesday - Friday Remember when you adopt a shelter pet, you save two lives... the one you bring home with you and the one that now will be saved because the shelter has more room. If you know of a Forgotten Friend that has been overlooked and is still looking for a \"furr-ever\" home, contact Andrea at acarden@kens5.com. **Related Articles** Senior canine Mandy longs for 'furr-ever' home after more than 3 years at shelter | Forgotten Friends Fun-loving Lulu has been waiting three years for someone to choose her to bring home | Forgotten Friends Blu, rescued from euthanasia, offers love and affection | Forgotten Friends **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}