{"id": 981, "name": "State of the Planet", "domain": "news.climate.columbia.edu", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://news.climate.columbia.edu/2025/05/19/energy-efficiency-begins-at-home-a-primer-with-climate-school-dean-alexis-abramson/", "title": "Energy Efficiency Begins At Home A Primer With Climate School Dean Alexis Abramson", "content": "Home About Browse Stories Browse Topics Research Education & Community Explainers Interactives Newsletter Contact Media News from the Columbia Climate School **Animated Infographic: Cool Tips for Hot Days (And Lower Bills)** Adrienne Day Illustrated by Traci Hafner For a deeper dive into renewable energy and energy efficiency at home,read the articlethat accompanies this infographic. A transcript of the primer is availablehere. Transcript: Energy Efficiency Begins at Home—A Primer With Climate School Dean Alexis Abramson Written by Adrienne Day; illustrated by Traci Hafner Q&A WITH DEAN ALEXIS ABRAMSON Before Alexis Abramson was dean of the Columbia Climate School, she was an energy efficiency expert, specializing in building upgrades and retrofits. Columbia Climate School Dean Alexis Abramson shares her tips on how to reduce both your energy bills and carbon footprint. DID YOU KNOW? Renewable energy represents a huge economic opportunity for the world. Experts believe it will create at least14 million new jobsby 2030. In 2023,renewable energy worldwidewas worth $1.21 trillion, and it is projected to grow 17.2% annually from 2024 to 2030. RENEWABLE ENERGY HOME SOLUTIONS SOLAR POWER Going solar can cut your energy bills and reduce your carbon footprint, while insulating you from ever-increasing utility costs. “Solar panels are almost always worth the investment,” says Abramson. “If I can pay up front to put solar on my roof, that electricity is essentially free to me, and thepayback timeis less than 12 years for most homes.” WIND POWER If you live in a consistently windy region, a residential wind turbine could be an ideal energy solution for some homeowners. If a turbine is combined with solar panels and battery storage, wind energy can be part of a more resilient and sustainable home energy system. INSULATION Insulating a house is one of the most effective and simple ways to lower energy bills while also reducing your carbon footprint. “The biggest cost of energy in most parts of the country is heating,” says Abramson. “But something as simple as going to a hardware store, getting some pink insulation and rolling it out into attics and crawl spaces can make a big difference.” BATTERY STORAGE Home battery storage systems integrate with the power grid and/or your solar panels, helping to smooth out fluctuations in power by storing excess energy generated during sunny days and then releasing it when solar generation is low, like during nighttime or cloudy days. Batteries can provide emergency electricity during a blackout and help cut your energy bills. HEAT PUMPS A heat pump will cut your household CO2emissionsby 40% or morecompared with gas, and in many parts of the country, you could savemore than $1,000 per yearon your heating bills. “A heat pump will work even in bitterly cold weather,” says Abramson, and “manufacturers are getting much better at designing these systems, so they’re becoming more and more efficient over time.” HYDROPOWER Hydroelectricity is the world’s biggest source of renewable energy,representing 40% of total capacity—ahead of solar (28%) and wind (27%). “Residential homes can harness it via small-scale power generation units, which generate electricity from nearby flowing water. These systems are ideal for rural homes with consistent water flow,” says Abramson. “Otherwise, it’s not usually cost effective. But it makes sense on a larger scale.” GEOTHERMAL ENERGY A U.S. Department of Energy study found that geothermal heat pumps—which work by transferring heat to and from the ground via underground pipes, using the Earth as both a heat source and heat sink—are an environmentally friendly and energy efficient alternative to conventional heating and cooling. The study found that mass deployment, along with insulation improvements,could reduce more than 7,000 million metric tonsof carbon emissions through 2050. CUT YOUR CARBON FOOTPRINT AT HOME Not ready to retrofit your house? Here are some easy ways to reduce your energy consumption. COLD WATER Heating water consumes about 90% of the energy it takes to operate a washing machine. By washing your laundry in cold water,you could cut 864 pounds of CO2emissionsin just one year. UNPLUG Not just to protect your home from fire or water damage, but to conserve energy. Even when an appliance is not actively being used, it still uses power, which means higher energy bills. THERMOSTAT You can save as much as 10% a year on bills by turning your thermostat back7 to 10 degreesduring the workday. A smart thermostat automatically adjusts heating and cooling temperature settings for optimal performance and energy savings. LIGHTING The U.S. phased out the sale of incandescent light bulbs in 2023, making way for LEDs. LEDs use at least75% less energy and last up to 25 timeslonger than incandescent lighting. COOKING Induction appliances, which use electromagnets to heat cookware, are up to three times more efficient than gas stoves, andup to 10% more efficientthan conventional electric ranges. Switching to an electric induction stove can also reduce indoor nitrogen dioxide air pollutionby more than 50%. APPLIANCES Energy-efficient appliances not only use less energy but also waste less energy and use fewer resources. An Energy Star-certified refrigerator can reduce your carbon footprint by4,000 pounds of CO2over the fridge’s lifetime. AIR FILTERS A dirty HVAC filter will slow down air flow and make the system work harder to keep you warm or cool. A new filter uses around15% less energythan a clogged air filter. Tags: **Related Posts** Transcript: An Animated Energy Primer With Climate School Dean Alexis Abramson **Transcript: An Animated Energy Primer With Climate School Dean Alexis Abramson** **Transcript: An Animated Energy Primer With Climate School Dean Alexis Abramson** Energy Efficiency Begins at Home: A Conversation with Alexis Abramson **Energy Efficiency Begins at Home: A Conversation with Alexis Abramson** **Energy Efficiency Begins at Home: A Conversation with Alexis Abramson** Why the Time To Go Solar Is Now **Why the Time To Go Solar Is Now** **Why the Time To Go Solar Is Now** Δ Δ Get the Columbia Climate School Newsletter Instagram LinkedIn Bluesky Facebook YouTube TikTok X / Twitter Newsletter About Contact Media Ask a Question/Suggest a Story Privacy ©2024 Columbia University"}