{"id": 2006, "name": "International Socialism Journal", "domain": "isj.org.uk", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://isj.org.uk/the-circle-of-death-of-the-counter-revolution-allied-intervention-in-bolshevik-russia/", "title": "The Circle Of Death Of The Counter Revolution Allied Intervention In Bolshevik Russia", "content": "Latest issue Back issues Links Resources Translations Subscribe About **“The circle of death of the counter-revolution”: allied intervention in Bolshevik Russia** A review ofA Nasty Little War: The West’s Fight to Reverse the Russian Revolutionby Anna Reid (John Murray Press, 2024), £12.99 From 1918 to 1920, a total of 180,000 allied troops conducted an undeclared war to overthrow the revolutionary Bolshevik government in Soviet Russia.1Forces from 16 countries were involved, headed up by Britain, France, the United States and Japan. They were active in over half a dozen theatres: from the Arctic north to the Caspian Sea in the south, from the Far East Pacific to Poland in the west. The intervening armies formed part of what Victor Serge called “the circle of death of the counter-revolution”.2At times very close to success, the intervention ultimately failed to overthrow the Bolsheviks, ending in a humiliating defeat, which its participants were keen to forget. Both Richard Nixon and Margaret Thatcher gaffed at Cold War summits with their ignorance of this history. It remains relatively unknown today. Anna Reid’s new history, aimed at the general reader and hoping to redress what she describes as the “willed forgetting”, is therefore to be welcomed.3 One of the chief merits of Reid’s book is its extensive use of participant diaries, some of which are from previously inaccessible private collections and thus new to the existing literature. For example, in December 1919, members of the British Military Mission in South Russia were supporting the White general Pyotr Wrangel, at that time retreating from the revolutionary Red Army in Ukraine. A British sergeant witnessed the savage violence of the counter-revolution: The whole army is running hard and not fighting at all. Wrangel is hanging people all over the place…[for three nights running] men and women accused of being pro-Bolsheviks [were] hanged in the town square. They were not given a drop, but were simply strung up, and drunken Cossacks hewed their arms and legs off with their swords, while the wretched people were still alive.4 In the summer of 1919, Wrangel’s Whites were attacking the Red-held city of Tsaritsyn (later renamed Stalingrad, now Volgograd). They were assisted by the British 47 Squadron Royal Air Force (RAF) flying daily raids over the city. Reid writes: “[A] lucky hit knocked out most of the town Soviet. (A day earlier and it might have got Trotsky on one of his lightning visits to the front.)” Tsaritsyn subsequently fell to the Whites and the 47 Squadron helped Wrangel hold the city for the next six months, “strafing enemy troop concentrations and bombing trains, depots and a Red river flotilla. Since the enemy lacked planes and air defences it was relatively straightforward work.” Officially, none of these RAF operations were taking place. The British Military Mission in Southern Russia was only supposed to be training and supplying the Whites, but “Ministers dodged questions in parliament with the assurance that it had orders not to join in combat, and [47 Squadron] was renamed and officially merged with a flying school” to maintain the deception. Squadron leader, the Canadian air ace Raymond Collishaw, wrote in a letter: “None of this made the slightest difference to any of us nor to the squadron’s operations.” They found the Red flotilla riverboats especially easy targets as their anti-aircraft guns had a maximum range of 200 feet: “We go above at 2,500 feet and laugh at them.” Reid notes the consequent low casualty rate made it easier to carry on the cover up back in Britain. Another RAF veteran, Leslie Kemp, recalled: “We had no detailed briefings but we were told that there were Bolshevik uprisings in various parts and flew over these villages firing guns and what have you.” Reid writes there is broad agreement among military historians that these RAF operations “terrified and demoralised” the revolutionaries. Sometimes, they made a significant difference. For instance, when a Red Army thrust almost recaptured Tsaritsyn in September 1919, Wrangel’s men were barely saved.5 British air power was also at work in the northern theatre of the intervention, around the Arctic ports of Murmansk and Archangel, deploying a new type of weapon. The “M Device” was an arsenic-based gas canister that could be dropped from the air. From August to September 1919, the British general William Edmund Ironside oversaw the use of almost 3,000 “M Device” canisters on “Bolo” (Bolshevik) villages. Ironside confided to his diary: “We have no evidence as to what effect these things are having…I am certain that they can’t be nice.” Reid writes: The bombs certainly incapacitated, causing violent symptoms—bleeding from ears, nose and mouth, vomiting, giddiness—for up to forty-eight hours, and crippling lassitude after. A member of the British gas team whose respirator failed during a test was still in hospital four months later, and a pilot who crash-landed and got the powder in his wounds lost the use of his arms. What the long-term health damage was to Russian civilians, we do not know. When the British withdrew from Archangel in late September 1919, they refused to hand over their remaining stock of “M Device” to their White Russian allies, instead dumping 47,000 canisters in the White Sea, “Where”, Reid writes, “they have presumably been poisoning marine life ever since”.6 One key reason why the intervention failed was the mutinies amongst the White armies. The Allies believed that the Bolshevik regime had little popular support and could be easily toppled. In the north, they oversaw the organising of White Russian forces, only for these efforts to blow up in their face. At Archangel in December 1918, 2,000 Russians mutinied. General Ironside put it down by machine gunning and mortaring the barracks building, then executing 13 of the ringleaders. Reid points out that Ironside’s later published memoirs lied about this, falsely claiming that he had commuted the death sentences. Other mutinies and executions followed, each time the British arrogantly diagnosing poor White Russian leadership as the cause. That diagnosis was exploded when the British-officered “Slavo-British Legion” (aka “Dyer’s Battalion”) mutinied in July 1919, killing five British officers. This was a deep humiliation for the British. Reid quotes the diary evidence of major Edward Allfrey’s account of his part in the public execution of 12 mutineers: The execution itself was not a very pleasant sight, as the machine-guns, with their five rounds, only killed about four out of the twelve, and the remainder were left kicking, tied onto big posts. One sergeant had not been touched at all, and I am sure the man behind the gun missed him on purpose. Anyhow, the end of it was that the machine-gunners were doubled off the parade, and we all had to go with our revolvers and polish the prisoners off. When the sergeant, who behaved like a man although he is a murderer, realised that he had been missed, he took the bandage off his eyes and shouted out “Long live the Bolsheviks!” I was glad when somebody fired at him and killed him, for he was uncannily cool and collected. Reid notes how Ironside, very much “gung-ho” when he first got out to Russia, now became “downcast, stiff and aloof”, turning “abruptly and completely against the Intervention.” Two weeks later, Ironside told the War Office he wanted to evacuate Archangel by 1 October 1918. His diary shows that, by this time, he was less worried about the Reds than the possibility of the whole White army turning on him.7 Things really started to fall apart for the allied forces when mutinies broke out amongst their own troops. The French had despatched 45,000 soldiers to Odessa in December 1918 to overthrow the Bolsheviks and recover the huge investments they had made in Tsarist Russia. Red Army attacks and anti-Intervention sentiment back home forced prime minister Georges Clemenceau into a complete reversal of policy, ordering a total evacuation from Odessa in April 1919. It was then, along the Black Sea coast at Sebastopol, that a full-scale French naval mutiny broke out. Reid writes: Hosing unpopular officers out of their cabins, they announced that they would no longer fire on the Bolsheviks, nor obey any other orders until a date was fixed for their return home. The next morning, to loud cheers, the Red Flag replaced the French tricolour at the two ships’ jack-staffs, and some five hundred French sailors went ashore and joined a pro-Bolshevik demonstration…the crews of all the other French ships in harbour also tore down their tricolours. There followed a panic evacuation: “Submarines were towed out to sea and sunk, and a wireless station and eight seaplanes smashed with sledgehammers.” By the end of April, France had quit the intervention. Its troops had lasted five months. France now moved to a “cordon sanitaire” policy, leaving the British to continue the fight in the south alone.8 Mutinies broke out among the British forces. In the north, at Seletskoye in February 1919, troops of the Yorkshire Regiment held a mass meeting demanding instant demobilisation and an end to censorship of outgoing letters. Two sergeants were court martialled and each given ten years, but Ironside suspended the sentences. Reports back to London on the low morale and growing indiscipline prompted Winston Churchill, war secretary at that time, to send a message to his troops, urging them to hold out for “a few months more” and to “carry on like Britons fighting for dear life and dearer honour.” Yet, by late summer 1919, patience had evaporated and the unthinkable happened—a mutiny by the Royal Marines. Reid notes there had been signs of trouble amongst the Marines back in February but oddly omits the episode of the more serious “Marine Mutiny” in August. Another intervention historian, Clifford Kinvig, has detailed what happened. He quotes an investigation report: The men either refused to advance, or if they did, retired as soon as they were fired on; Lewis gun sections threw down their guns in the presence of foreign troops, and, in short, the Royal Corps went through the blackest day in its history.9 It was all too much for the British general Charles Maynard at Murmansk, who “nearly died of a serious heart attack.” Over 90 marines were court martialled and 13 condemned to death but commuted to five years in prison. Kinvig concludes: It was the most substantial and severe disciplinary verdict ever passed on Royal Marines. Thereafter 6 RMLI disappeared from the Royal Marine order of battle and the numeral “6” has not since been connected with any of its combat units.10 One of the most valuable parts of the book is Reid’s documentation of what she calls “the great stain on the White movement and the Intervention in general—the Whites’ massacres of Jews, and Britain’s connivance in them”.11Reid is right in saying some intervention histories have not given this sufficient attention. The ferocity of White hatred for Jews and Bolsheviks—seen by them as synonymous—resulted in horrific pogroms. One estimate has the Whites being responsible for 200,000 Jewish dead, 700,000 maimed and 300,00 orphans.12The worst of it was in Ukraine. General Anton Denikin’s White armies, ascendant in the south from July to December 1919, directly killed 8,000 Jews in just this six-month period alone. Eyewitnesses stressed how “methodical” the White pogroms were. Reid documents that the British government was fully aware of what was going on. Unlike some historical accounts, Reid does not take at face value the condemnations of the pogroms by government ministers or their telegram appeals to Denikin to stop them.13Reid’s assessment: For the British government, in short, Denikin’s massacres and mass rapes were a side issue, only of serious concern in so far as they caused political embarrassment. The admonitory telegrams were gestures, not taken seriously and not expected to be. At no stage did the government tell Denikin that unless the pogroms ceased it would withdraw military aid, nor did it even consider doing so. On the contrary, right up to his final defeat new loans and deliveries continued to flow.14 In fact, many of the British senior military personnel in Russia were themselves rabid antisemites. Reid gives several examples, including general Herbert Holman, head of the Military Mission in the South with Denikin. He was “notoriously antisemitic even by the standards of the time—according to an expatriate clergyman, ‘obsessed by the idea of wiping out the Jews everywhere and can talk of little else’”.15Reid’s final verdict is suitably damning: Even at the distance of a century, with 1919’s killings long overshadowed by the Holocaust, the fact that Britain knowingly funded, supplied, trained and sent men to fight alongside the armies that committed them is shocking and shameful.16 There is, however, a problem with Reid’s discussion of antisemitic pogroms, specifically on the fact that there were several instances of Red Army pogroms in Ukraine in 1919 and the Polish-Soviet War 1920. Reid quite rightly notes these but the statement “not only the Whites were responsible; the attacks came from all sides” is much too vague. Why? Firstly, because it skirts over the important fact that the pogroms were overwhelmingly carried out by the Whites. Although no progrom can be justified, a detailed study calculates that only 8.6 percent of those in Ukraine were perpetrated by forces associ­ated with the Reds.17Secondly, because there is no recognition of the fact that pogroms were completely contrary to Red policy. A much better analysis is offered by Bruce Lincoln: Certain that they faced extermination if the Whites remained, the Jews of the Ukraine turned to the Bolsheviks, who shot pogromists and outlawed antisemitic writings. From time to time, sporadic pogroms occurred in areas held by the Reds to be sure, but when compared with the tens of thousands of murders by the Whites, the few hundred pogrom deaths that Jews suffered in Bolshevik-held territory left few among them in doubt that Lenin’s regime offered better chances for survival. It therefore was no accident that entire Jewish settlements began to follow Red Army units when they retreated rather than face the tender mercies of Denikin’s soldiers.18 Followers of what Tariq Ali has dubbed the “Churchill Cult” will find little of solace in Reid’s book.19From the moment he was appointed war secretary, Churchill was obsessed with achieving the military overthrow of the Bolsheviks, sometimes provoking rows in Cabinet with his more cautious colleagues. Prime minister David Lloyd George became exasperated, imploring Churchill: “to throw off this obsession, which, if you will forgive me for saying so, is upsetting your balance”.20Lloyd George himself was balancing between giving continued backing to the Whites and the increasingly powerful pressure of the anti-Interventionist “Hands off Russia!” movement developing in the British working class—a dimension that receives too little consideration by Reid.21Yet, Churchill persisted, even after the fervent interventionists Clemenceau and Marshall Ferdinand Foch had thrown in the towel.22When Denikin won a spate of victories, Churchill fantasised about being British ambassador in Moscow, helping to write a White Russia constitution. The White advances stalled and turned into a total rout. Churchill privately lamented that the south had become “a complete smash-up”.23Reid fittingly contrasts the chaotic scenes of the March 1920 British evacuation at Novorossiysk with a dejected Churchill sojourned in a French villa, painting watercolours and writing to Lloyd George: “I have been having a complete holiday and trying to forget all the disagreeable things that are going on”.24 The intervention prolonged the civil war by sustaining the Whites with huge levels of military supplies. Take the example of allied support for the White admiral Alexander Kolchak in Siberia. Historian Orlando Figes writes: In the first six months of 1919 his White army received from them: one million rifles; 15,000 machine-guns; 700 field guns; 800 million rounds of ammunition; and clothing and equipment for half a million men. This was roughly equivalent to the Soviet production of munitions for the whole of 1919.25 The prolonged civil war distorted the young Bolshevik regime as it was forced to prioritise a basic struggle for survival. Arthur Ransome, a British journalist in Russia in 1919, reported: “Everywhere I heard the same story: ‘We cannot get things straight while we have to fight all the time’”.26This journal stands in the tradition that contends it was in these civil war years that the roots of Stalinism first appeared.27Reid rejects this view. To conclude, this book is a liberal history and has weaknesses. Nevertheless, it has merit in that it brings attention to the widely unknown fact of the Allied Intervention. Most valuably, it exposes the complicity and deceit of the British ruling class—above all Churchill—in arming the White counter-revolution and its massacres of Jews. Reid’s book, if read critically, can therefore be usefully studied by socialists seeking to defend the Bolshevik Revolution. Kevin Mottramis a long-standing member of the Socialist Workers Party. He is a semi-retired history teacher and lives in the Yorkshire Dales. **Notes** 1Thanks to Joseph Choonara and Tony Phillips for their comments on this review in draft. 2Serge, 1997, p45. Serge was an anarchist-turned-Bolshevik living in Petrograd in 1919. 3Reid has previously authored two successful books on modern Russian history:Leningrad: Tragedy of a City Under Siege, 1941-44(Bloomsbury, 2011) andBorderland: A Journey Through the History of Ukraine(Weidenfeld & Nicolson, 2015). She was Ukraine correspondent for theEconomist1993-5 and worked at the conservative think-tank Policy Exchange 2003-7. 4Reid, 2024, p272. 5Reid, 2024, pp173-174. 6Reid, 2024, pp219-220. For more detail on the M Device see Milton, 2014, pp251-255. 7Reid, 2024, p170. 8Reid, 2024, pp143-144. A cordon sanitaire policy is a measure designed to isolate a country or countries politically to prevent it or them from gaining influence among others. 9Kinvig, 2006 p261. Major General Kinvig was a Senior Lecturer at RMA Sandhurst and Director of Army Education. 10Kinvig, 2006, pp262-264. 11Reid, 2024, p180. 12Rennap, cited in Gluckstein and Stone, 2023, p116. 13In the case of Churchill see Roberts, p275. 14Reid, 2024 p194. 15Reid, 2024 p191. 16Reid, 2024 p195. 17See Gluckstein and Stone, 2023, p116. 18Bruce Lincoln, 1991 pp323-324. 19For the Intervention as Churchill’s “brainchild”, see pp154-162. 20Silverlight, 1970 p285. 21For details of the impact of the “Hand’s Off Russia!” movement, see Newsinger, 2020. 22Looking back many years later Lloyd George said: “Before I could look round, he’d got out maps of Russia and we were making fools of ourselves in the Civil War.”­—Reid, 2024 p303. 23Reid, 2024 p277. 24Reid, 2024 p293. 25Figes, 1997, p652. 26Ransome, 1992, p83. 27See Cliff, 1990, chapters 10,11 and 12. **References** Ali, Tariq, 2023,Winston Churchill. His Times, His Crimes(Verso). Bruce Lincoln, W., 1991,Red Victory. A History of the Russian Civil War(Cardinal). Cliff, Tony, 1990,Trotsky: The Sword of the Revolution 1917-1923(Bookmarks). Figes, Orlando, 1997,A People’s Tragedy. The Russian Revolution 1891-1924(Pimlico). Gluckstein, Donny, and Stone, Janey, 2023,The Radical Jewish Tradition. Revolutionaries, Resistance Fighters & Firebrands(Bookmarks). Kinvig, Clifford, 2006,Churchill’s Crusade. The British Invasion of Russia 1918-1920(Hambledon Continuum). Milton, Giles, 2013,Russian Roulette. How British Spies Defeated Lenin(Sceptre). Newsinger, John, 2022, “1920—when workers said ‘Hands off Russia’”,Socialist Worker(20 September),https://socialistworker.co.uk/in-depth/1920-when-workers-said-hands-off-russian-revolution/ Ransome, Arthur, 1992 [1919],Six Weeks in Russia 1919(Redwords). Roberts, Andrew, 2018,Churchill. Walking with Destiny(Allen Lane). Serge, Victor, 1997 [1921],Revolution in Danger. Writings from Russia 1919-1921(Redwords). Silverlight, John, 1970,The Victors’ Dilemma. Allied Intervention in the Russian Civil War(Barrie & Jenkins Ltd). **Post navigation** **Tags**"}