{"id": 1214, "name": "Sapiens", "domain": "sapiens.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sapiens.org/archaeology/generativeai-reconstruction-history-heritage-misrepresentations/", "title": "Generativeai Reconstruction History Heritage Misrepresentations", "content": "**How Cultural Knowledge Sustained Desert Farms in the Ancient Andes** **How Cultural Knowledge Sustained Desert Farms in the Ancient Andes** **Earworm** **Earworm** **Caring Across Distance—One Call at a Time** **Caring Across Distance—One Call at a Time** **Excavating the Traces of Ice Age Foragers** **Excavating the Traces of Ice Age Foragers** **Reclaiming Collective Life in a Fractured U.S.** **Reclaiming Collective Life in a Fractured U.S.** **Ancient Tools in East Asia Reveal Middle Paleolithic Innovation** **Ancient Tools in East Asia Reveal Middle Paleolithic Innovation** **When Wartime Plunder Comes to Campus** **When Wartime Plunder Comes to Campus** **Why Are People Worshipping the Virgin Mary as a Goddess?** **Why Are People Worshipping the Virgin Mary as a Goddess?** **How Virtual Reality Is Restoring Liberia’s Culture** **How Virtual Reality Is Restoring Liberia’s Culture** **In Japan, Rethinking What It Means to Care for the Dead** **In Japan, Rethinking What It Means to Care for the Dead** **Huh? The Valuable Role of Interjections** **Huh? The Valuable Role of Interjections** **When Calls for Vengeance Go Online** **When Calls for Vengeance Go Online** **A Poetics of Liberation: AnImagined Archive** **A Poetics of Liberation: AnImagined Archive** **The Hopes and Hazards for AI in Reconstructing Ancient Worlds** **The Hopes and Hazards for AI in Reconstructing Ancient Worlds** **“Stop This Invader!”—The War on Spotted Lanternflies** **“Stop This Invader!”—The War on Spotted Lanternflies** **Erasure I and Erasure VI** **Erasure I and Erasure VI** **How Heavy Metal Fuels Indigenous Revival in Patagonia** **How Heavy Metal Fuels Indigenous Revival in Patagonia** **Tallahassee Ghazal** **Tallahassee Ghazal** **Fighting for Justice for the Dead—and the Living** **Fighting for Justice for the Dead—and the Living** **Debitage** **Debitage** **Tracing Roti’s Pasts, Presents, and Futures** **Tracing Roti’s Pasts, Presents, and Futures** **In Iron Age Britain, Descent Was Matrilineal** **In Iron Age Britain, Descent Was Matrilineal** **Broken Sonnets for the Anthropocene** **Broken Sonnets for the Anthropocene** **David Graeber’s Lasting Influence on Anthropology and Activism** **David Graeber’s Lasting Influence on Anthropology and Activism** **Connecting Local Communities to Paleoanthropology in Kenya** **Connecting Local Communities to Paleoanthropology in Kenya** **Pequi Winds** **Pequi Winds** **Launching Starship in South Texas** **Launching Starship in South Texas** **A Spacecraft’s Dance From French Guiana to Jupiter** **A Spacecraft’s Dance From French Guiana to Jupiter** **The First Space Launch for Mauritius** **The First Space Launch for Mauritius** **How Cosmic Explorations Are Reshaping Life on Earth** **How Cosmic Explorations Are Reshaping Life on Earth** **Emic/Etic** **Emic/Etic** **Envisioning a More Empathetic Treatment of Great Ape Remains** **Envisioning a More Empathetic Treatment of Great Ape Remains** **The Hopes and Hazards for AI in Reconstructing Ancient Worlds** In 2022, at a cloud computing and artificial intelligence conference in Hangzhou, China, conference goers could see a display about the archaeological site Sanxingdui. STR/AFP/Getty Images **AMPLIFYING ANTHROPOLOGY** This article was originally published atThe Conversationand has been republished under Creative Commons. Generative artificial intelligenceis often seen as the epitome of our times and sometimes even as futuristic. We can use it to invent new art or technology, analyze emerging data, or simulate people, places, and things. But interestingly, it is also having an impact on how we view the past. AI imagery has already been used to illustrate popular articles, such ascovering scientific discoveries about Neanderthals. It was employed toanimate the Mesolithic period(from about 9,000 to 4,300 years ago) in a museum. TikTok users have adopted it to make realistic short videos about archaeology and history. It’s even been used in aTV documentary about Stonehenge. Yet there are many issues with using AI imagery in archaeology—some of which are also found more broadly within generative AI use. These include its environmental impact and the violation of intellectual property (using training data created by humans). But others are more specific to archaeology. As an academic who has worked extensively on “resurrecting” the past through digital technology, I believe generative AI has both fascinating potential and enormous risk for archaeological misrepresentation. Generative AI has the potential to conceptually bridge millennia—but using it comes with risks. AI-generated Image inCanva/The Conversation Even before the use of AI, it was widely accepted within archaeology that visualizations of the past are highly fraught and should be treated with extreme caution. For example, archaeologist Stephanie Moserexamined 550 reconstructionspublished in academic and popular texts on human evolution. Her review found highly biased depictions, such as only males hunting, making art and tools, and performing rituals, while women were in more passive roles. A similar study by Diane Gifford-Gonzalezrevealed that“not one of 231 depictions of prehistoric males shows a man touching a child, woman, or an older person of either sex … no child is ever shown doing useful work.” These reconstructions do not reflect scientists’ nuanced understanding of the past. We know humans organized themselvesin an incredible array of variety, with a multitude of gender roles and self-expression. **ONE GREAT STORY EVERY DAY** A recent DNA-based study, for example, showed that women were actuallyat the center of societiesin Iron Age Britain. The stakes of representation in archaeology are high. For example, the hotly debated,dark-skinned reconstructionof “Cheddar Man,” originally found in Southwest England, wasbased on ancient DNA analysis. It made headlines for disrupting the perception that all human ancestors in the north were light skinned. This and similar controversies reveal the iconic power of reconstructions, their political implications, and their ability to shape our understanding of the past. While the Cheddar Man reconstruction demonstrates that research is iterative, such reconstructions are sticky. They have profound visual legacies and are not easily supplanted when new data become available. Based on the shape of his skull and DNA analysis, scholars at the Natural History Museum in London created this new reconstruction of the so-called Cheddar Man. Werner Ustorf/CC BY-SA 4.0/Wikimedia This is exacerbated as they are incorporated into generative AI datasets. Beyond the use of outmoded data, generative AI visualizations of the pastcan be extremely poor. Even when more plausible details are included, they can be seamlessly integrated with other highly inaccurate elements. For example, it is impossible for viewers to disentangle the data-led from the so-called hallucinations (mistakes) produced by AI. Highlighting uncertainty is of central importance and concern among archaeologists. Archaeological illustrator Simon James noted that reconstruction artists have usedstrategically placed clouds of smoketo obscure unknown elements. As a digital archaeologist, I have made virtual reconstructions of many different sites and subjects. I know there is often estimation and guesswork involved in making holistic representations. Indeed, photorealistic accuracy is not alwaysthe paramount considerationin visualization—particularly when exploring different hypotheses or addressing young audiences. But knowing what is backed by archaeological data and what is more speculative is key for authentic visual communication. **THE DANGERS OF PSEUDOARCHAEOLOGY** This is particularly important at a time when pseudoarchaeology is increasingly prevalent in popular media, such as theAncient Apocalypseshow on Netflix. The celebrity host and author Graham Hancock asserts there was a lost ice age civilization of Atlantis that had advanced technology. But this claim has beenthoroughly repudiated by archaeologists. Arguably, hoaxes will be much easier to perpetuate using generative AI. Beyond the high potential for misinformation about archaeology, the use of generative AI for archaeological visualizations can actually be harmful for archaeological knowledge production. My researchhas shownthat crafting reconstructions and illustrations in archaeology is incredibly important for understanding and interpreting the past. Creating visualizations based on science—and indeedsoundscapes,smellscapes, and other interpretations based on multiple senses—is very helpful for generating new questions. DONATE HERE Drawing allows archaeologists tocreate more detailed mental modelsand therefore a better understanding of archaeological remains. By delegating this creation to AI, archaeologists lose a powerful tool for knowledge generation. Moreover, my collaborative work with artists has demonstrated the intriguing possibilities that creative approaches open up to tell new stories about the past. Even with all of these problems, Iencourage an engaged, critical, applied approachto understanding the impact of digital technologies on investigations of the past. And this includes exploring the uses of generative AI for archaeological visualization. Archaeologists and nonspecialists are able to leverage generative AI to creatively produce interpretive media. Indeed, some archaeologists are already exploring AI to generate hypotheses about ancient life. And we are teaching critical uses of AI to our archaeology students. But what remains imperative is that archaeologists engage with and critique all visualizations—both those created by generative AI and those made using other media. Colleen Morganis the senior lecturer in digital archaeology and heritage in the department of archaeology at the University of York. She is the director of the Digital Archaeology and Heritage Lab, the M.Sc. in digital archaeology, and the M.Sc. in digital heritage. She was Marie Curie experienced researcher for theEUROTAST projectfrom 2013–2015 and a postdoctoral fellow for the Centre for Digital Heritage from 2015–2017. **Stay connected** Bluesky,LinkedIn,Mastodon **Can Machine Learning Translate Ancient Egyptian Texts?** **Can Machine Learning Translate Ancient Egyptian Texts?** **Huh? The Valuable Role of Interjections** **Huh? The Valuable Role of Interjections** **Why AI Will Never Fully Capture Human Language** **Why AI Will Never Fully Capture Human Language** **Who Pays the Price When Cochlear Implants Go Obsolete?** **Who Pays the Price When Cochlear Implants Go Obsolete?** **Caring Across Distance—One Call at a Time** **Caring Across Distance—One Call at a Time** **Dating Apps Can Gauge Attraction but Not Chemistry** **Dating Apps Can Gauge Attraction but Not Chemistry** **Why a Mexican Village’s DIY Cellphone Network Matters** **Why a Mexican Village’s DIY Cellphone Network Matters** **When a Message App Became Evidence of Terrorism** **When a Message App Became Evidence of Terrorism** You may republish this article, either online and/or in print, under the Creative CommonsCC BY-ND 4.0license. We ask that you follow thesesimple guidelinesto comply with the requirements of the license. In short, you may not make edits beyond minor stylistic changes, and you must credit the author and note that the article was originally published on SAPIENS. Accompanying photos are not included in any republishing agreement; requests to republish photos must be made directly to the copyright holder. We’re glad you enjoyed the article! Want to republish it? This article is currently copyrighted to SAPIENS and the author. But, we love to spread anthropology around the internet and beyond. Please send your republication request via email to editor•sapiens.org. Accompanying photos are not included in any republishing agreement; requests to republish photos must be made directly to the copyright holder. All Articles Contributors Donate Podcast Teaching Training Write AboutStaffContact Staff Contact Staff Contact Newsletter"}