{"id": 1503, "name": "St. Paul Pioneer Press", "domain": "twincities.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.twincities.com/2025/06/10/man-charged-with-aiding-an-offender-in-teens-killing-at-northtown-mall-has-an-open-manslaughter-case/", "title": "Man Charged With Aiding An Offender In Teens Killing At Northtown Mall Has An Open Manslaughter Case", "content": "Today's Paper Today's Paper NewsNewsBusinessBest ReviewsCrime & Public SafetyEducationGovernment & PoliticsHealthNational NewsEnvironment News Business Best Reviews Crime & Public Safety Education Government & Politics Health National News Environment News Business Best Reviews Crime & Public Safety Education Government & Politics Health National News Environment LocalSt. PaulRamsey CountyAnoka CountyWashington CountyDakota CountyMinnesotaWisconsin St. Paul Ramsey County Anoka County Washington County Dakota County Minnesota Wisconsin St. Paul Ramsey County Anoka County Washington County Dakota County Minnesota Wisconsin SportsSportsMinnesota VikingsMinnesota TwinsMinnesota WildMinnesota TimberwolvesMinnesota FrostMinnesota LynxMinnesota United FCCollege SportsGophers FootballSt. Paul SaintsGophers Men’s BasketballHigh School SportsOutdoors Sports Minnesota Vikings Minnesota Twins Minnesota Wild Minnesota Timberwolves Minnesota Frost Minnesota Lynx Minnesota United FC College Sports Gophers Football St. Paul Saints Gophers Men’s Basketball High School Sports Outdoors Sports Minnesota Vikings Minnesota Twins Minnesota Wild Minnesota Timberwolves Minnesota Frost Minnesota Lynx Minnesota United FC College Sports Gophers Football St. Paul Saints Gophers Men’s Basketball High School Sports Outdoors FoodRestaurants, Food and DrinkRestaurant newsRestaurant reviewsRestaurant listsRecipesTakeout Restaurants, Food and Drink Restaurant news Restaurant reviews Restaurant lists Recipes Takeout Restaurants, Food and Drink Restaurant news Restaurant reviews Restaurant lists Recipes Takeout Things to DoThings to DoBooksMovies & TVArtsMusic and ConcertsRestaurants, Food and DrinkTheaterTravelTreasure HuntWinter CarnivalState FairHome & GardenEvents Things to Do Books Movies & TV Arts Music and Concerts Restaurants, Food and Drink Theater Travel Treasure Hunt Winter Carnival State Fair Home & Garden Events Things to Do Books Movies & TV Arts Music and Concerts Restaurants, Food and Drink Theater Travel Treasure Hunt Winter Carnival State Fair Home & Garden Events OpinionEditorialsLetters to the EditorOpinion Columnists Editorials Letters to the Editor Opinion Columnists Editorials Letters to the Editor Opinion Columnists ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint Subscribe Log In Logout Sign up for Newsletters and Alerts to submit an obituary To place an obituary, please include the information from the obituary checklist below in an email toobits@pioneerpress.com. There is no option to place them through our website. Feel free to contact our obituary desk at 651-228-5263 with any questions. General Information: Your full name, Address (City, State, Zip Code), Phone number, And an alternate phone number (if any) Obituary Specification: Name of Deceased, Obituary Text, A photo in a JPEG or PDF file is preferable, TIF and other files are accepted, we will contact you if there are any issues with the photo. Ad Run dates There is a discount for running more than one day, but this must be scheduled on the first run date to apply. If a photo is used, it must be used for both days for the discount to apply, contact us for more information. Policies: Verification of Death: In order to publish obituaries a name and phone number of funeral home/cremation society is required. We must contact the funeral home/cremation society handling the arrangements during their business hours to verify the death. If the body of the deceased has been donated to the University of Minnesota Anatomy Bequest Program, or a similar program, their phone number is required for verification. Please allow enough time to contact them especially during their limited weekend hours. A death certificate is also acceptable for this purpose but only one of these two options are necessary. Guestbook and Outside Websites: We are not allowed to reference other media sources with a guestbook or an obituary placed elsewhere when placing an obituary in print and online. We may place a website for a funeral home or a family email for contact instead; contact us with any questions regarding this matter. Obituary Process: Once your submission is completed, we will fax or email a proof for review prior to publication in the newspaper. This proof includes price and days the notice is scheduled to appear. Please review the proof carefully.We must be notified of errors or changes before the notice appears in the Pioneer Press based on each day’s deadlines. After publication, we will not be responsible for errors that may occur after final proofing. Online: Changes to an online obituary can be handled through the obituary desk. Call us with further questions. Payment Procedure: Pre-payment is required for all obituary notices prior to publication by the deadline specified below in our deadline schedule. Please call651-228-5263with your payment information after you have received the proof and approved its contents. Credit Card:Payment accepted by phone only due to PCI (Payment Card Industry) regulations EFT:Check by phone. Please provide your routing number and account number. Cash:Accepted at ourFRONT COUNTERMonday – Friday from 8:00AM – 3:30PM Rates: The minimum charge is $162 for the first 10 lines. Every line after the first 10 is $12.20. If the ad is under 10 lines it will be charged the minimum rate of $162. On a second run date, the lines are $8.20 per line, starting w/ the first line. For example: if first run date was 20 lines the cost would be $164. Each photo published is $125 per day. For example: 2 photos in the paper on 2 days would be 4 photo charges at $500. Deadlines: Please follow deadline times to ensure your obituary is published on the day requested. Hours Deadline (no exceptions) Ad Photos MONDAY – FRIDAY 9:00AM – 5:00 PM Next Day Publication Must receive obituary content and payment same day by4:30PM Make changes by5:00PM Must receive photo(s) by 4:30PM SATURDAYS 10:00AM – 2:00PM Sunday Publication Must receive obituary content and payment same day by1:30PM Make changes by2:00PM Must receive photo(s) by 1:30PM SUNDAYS 12:00PM – 3:00PM Monday Publication Must receive obituary content, payment, and final changes same day by2:30PM Must receive photo(s) by 2:30PM MEMORIAM (NON-OBITUARY) REQUEST Unlike an obituary, Memoriam submissions are remembrances of a loved one who has passed. The rates for a memoriam differ from obituaries. Please call or email us for more memoriam information Please call 651-228-5280 for more information. HOURS: Monday – Friday 8:00AM – 5:00PM (CLOSED WEEKENDS and HOLIDAYS) Please submit your memoriam ad tomemoriams@pioneerpress.comor call 651-228-5280. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email More Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr Submit to Stumbleupon (Opens in new window)Submit to Stumbleupon Subscribe Log In Sign up for Newsletters and Alerts Subscribe Log In Today's Paper Today's Paper Business Crime Education Government & Politics Health Nation Environment OUR PICKS: Daily Deals Woodturning expo California raids Budget recipes $66B budget Luther Seminary Eickholt memorial **Man charged with aiding an offender in teen’s killing at Northtown Mall has an open manslaughter case** **Two other suspects — ages 14 and 15 — have not been arrested, authorities said** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email More Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr Submit to Stumbleupon (Opens in new window)Submit to Stumbleupon A Blaine man charged with aiding an offender to avoid arrest in Friday’s fatal shooting of a 15-year-old boy outside Northtown Mall was allegedly involved in a February shooting death in Columbia Heights, according to court records. Sudais Abdi Omar, of Brooklyn Park, was shot in the chest Friday in the mall’s Best Buy parking lot and pronounced dead at Mercy Hospital in Coon Rapids. Ayub Abdullahi Mohamed, 20, was one of three suspects who was seen running from the shooting and into the mall. He was arrested at SkyZone Trampoline Park and had a gun magazine in his sock, the criminal complaint says. The two other suspects are ages 14 and 15, the complaint says. They have not been arrested, and the investigation remains ongoing, the Anoka County Sheriff’s Office said Tuesday afternoon. Mohamed remained at the Anoka County Jail on Tuesday in lieu of $100,000 bail. A message left for his attorney for comment on the charge has not been returned. In March, Mohamed was charged with aiding and abetting second-degree manslaughter for allegedly bringing a rifle into a car on Feb. 28 in Columbia Heights. A 16-year-old boy handled the rifle, not knowing a bullet was in the chamber, when it fired and killed the driver, Ibrahim Faisal Dabarani, 20, of Minneapolis, according to the complaint against Mohamed, who then posted bond. The teen also faces the same manslaughter charge, and a hearing to certify him as an adult is set for July 17. According to Tuesday’s complaint, Blaine officers were called to the Best Buy parking lot about 5:15 p.m. on a report of someone who’d been shot. Once there, they were told that several people involved fled the area. Omar was found in the parking lot with a gunshot wound to the chest. Casings were found nearby. The 911 caller, a Best Buy employee, said he saw three male suspects run from the shooting scene and into the mall, then out the door toward Sky Zone. Witnesses gave the suspects’ descriptions and officers located Mohamed in a Sky Zone bathroom. **Related Articles** St. Paul police looking for hit-and-run driver who critically injured pedestrian Eichorn argues federal prosecutors singling him out after child sex sting Sean ‘Diddy’ Combs’ ex says she joined ‘cuckold’ sex marathons to feel loved by him Weinstein jury pores over accuser’s emails during deliberations Weinstein jury set to keep deliberating after tensions spill into public In an interview with investigators, Mohamed said he was in a car with Omar and a teen identified in the complaint as Suspect #1. Mohamed said they went to Best Buy to pick up Suspect #2, who had been waiting outside the store. When they arrived, Mohamed said, he went inside Best Buy to use the bathroom. As he was walking back to the car, he saw the teens running into the store and screaming that Omar had been shot. Mohamed said he went outside and saw Omar lying on the ground. The two teens were pacing around the parking lot before Suspect #2 handed him the gun magazine, Mohamed said, adding he put it into the pocket of his throbe. Mohamed told investigators that once he got into Sky Zone, he called the teens through Snapchat, but they declined his calls. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on Reddit (Opens in new window)Reddit Click to share on X (Opens in new window)X Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email More Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Pinterest (Opens in new window)Pinterest Click to share on Tumblr (Opens in new window)Tumblr Submit to Stumbleupon (Opens in new window)Submit to Stumbleupon **RevContent Feed** **Most Popular** Luther Seminary plans to vacate its St. Paul campusLuther Seminary plans to vacate its St. Paul campus **Luther Seminary plans to vacate its St. Paul campus** **Luther Seminary plans to vacate its St. Paul campus** MN Legislature passes $66B budget, cuts undocumented immigrant insuranceMN Legislature passes $66B budget, cuts undocumented immigrant insurance **MN Legislature passes $66B budget, cuts undocumented immigrant insurance** **MN Legislature passes $66B budget, cuts undocumented immigrant insurance** 2 unidentified campers found dead on Isle Royale National Park2 unidentified campers found dead on Isle Royale National Park **2 unidentified campers found dead on Isle Royale National Park** **2 unidentified campers found dead on Isle Royale National Park** St. Paul man sentenced to workhouse for throwing fatal ‘sucker punch’ outside East Side barSt. Paul man sentenced to workhouse for throwing fatal 'sucker punch' outside East Side bar **St. Paul man sentenced to workhouse for throwing fatal ‘sucker punch’ outside East Side bar** **St. Paul man sentenced to workhouse for throwing fatal ‘sucker punch’ outside East Side bar** St. Paul Downtown Development Corp. seeks to acquire Alliance Bank CenterSt. Paul Downtown Development Corp. seeks to acquire Alliance Bank Center **St. Paul Downtown Development Corp. seeks to acquire Alliance Bank Center** **St. Paul Downtown Development Corp. seeks to acquire Alliance Bank Center** Gophers men’s hockey releases stacked nonconference scheduleGophers men's hockey releases stacked nonconference schedule **Gophers men’s hockey releases stacked nonconference schedule** **Gophers men’s hockey releases stacked nonconference schedule** Raihala: Six big rock acts we might not see in concert againRaihala: Six big rock acts we might not see in concert again **Raihala: Six big rock acts we might not see in concert again** **Raihala: Six big rock acts we might not see in concert again** Jury convicts St. Paul man in 2023 shootout at White Bear Lake barJury convicts St. Paul man in 2023 shootout at White Bear Lake bar **Jury convicts St. Paul man in 2023 shootout at White Bear Lake bar** **Jury convicts St. Paul man in 2023 shootout at White Bear Lake bar** St. Paul school board OKs $1 billion budget for 2026St. Paul school board OKs $1 billion budget for 2026 **St. Paul school board OKs $1 billion budget for 2026** **St. Paul school board OKs $1 billion budget for 2026** Charges filed in drive-by shooting outside Burnsville High School graduationCharges filed in drive-by shooting outside Burnsville High School graduation **Charges filed in drive-by shooting outside Burnsville High School graduation** **Charges filed in drive-by shooting outside Burnsville High School graduation** **More in Crime & Public Safety** St. Paul police looking for hit-and-run driver who critically injured pedestrian **St. Paul police looking for hit-and-run driver who critically injured pedestrian** **St. Paul police looking for hit-and-run driver who critically injured pedestrian** Washington County Sheriff Dan Starry will not run for a third term **Washington County Sheriff Dan Starry will not run for a third term** **Washington County Sheriff Dan Starry will not run for a third term** Eichorn argues federal prosecutors singling him out after child sex sting **Eichorn argues federal prosecutors singling him out after child sex sting** **Eichorn argues federal prosecutors singling him out after child sex sting** Community memorial set for William ‘Ike’ Eickholt, found dead last winter **Community memorial set for William ‘Ike’ Eickholt, found dead last winter** **Community memorial set for William ‘Ike’ Eickholt, found dead last winter** Bemidji woman gets probation for baby’s 2022 fentanyl death in Roseville hotel room **Bemidji woman gets probation for baby’s 2022 fentanyl death in Roseville hotel room** **Bemidji woman gets probation for baby’s 2022 fentanyl death in Roseville hotel room** Jury convicts St. Paul man in 2023 shootout at White Bear Lake bar **Jury convicts St. Paul man in 2023 shootout at White Bear Lake bar** **Jury convicts St. Paul man in 2023 shootout at White Bear Lake bar** 2025 June 10 SubscribeToday’s PaperObituariesComicsPuzzlesSitemap Today’s Paper Obituaries Comics Puzzles Sitemap Today’s Paper Obituaries Comics Puzzles Sitemap Contact UsNewsroom ContactsPioneer Press StorePhoto reprintsManage my accountPrivacy PolicyAccessibility Newsroom Contacts Pioneer Press Store Photo reprints Manage my account Privacy Policy Accessibility Newsroom Contacts Pioneer Press Store Photo reprints Manage my account Privacy Policy Accessibility HomeNewsSportsOpinionThings to Do News Sports Opinion Things to Do News Sports Opinion Things to Do MarketplaceAutosHomesJobsWork With Us Autos Homes Jobs Work With Us Autos Homes Jobs Work With Us Advertise with usNetwork AdvertisingSpecial Advertising Sections Network Advertising Special Advertising Sections Network Advertising Special Advertising Sections Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}