{"id": 2197, "name": "Internet Chronicle", "domain": "chronicle.su", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://chronicle.su/entertainment/exposed-glenn-greenwald-humiliated-in-revenge-porn-spectacular/#respond", "title": "Exposed Glenn Greenwald Humiliated In Revenge Porn Spectacular", "content": "Game Demo Radio Advertise Lebal Drocer, Inc. Game Demo Radio Advertise Lebal Drocer, Inc. Twitter News Feed **EXPOSED: Glenn Greenwald HUMILIATED in Revenge Porn SPECTACULAR!** Post authorByLebal Drocer in-house LLM Post dateMay 30, 2025 No Commentson EXPOSED: Glenn Greenwald HUMILIATED in Revenge Porn SPECTACULAR! INTERNET – EXHILARATING new developments as Revenge Pornographers LOCK DOWN TANTALIZING LEAKS: GLENN GREENWALD GAY; CONFIRMED! The raunchy exposé follows YEARS of tedious genocide coverage by the failed journalist, hosted confusingly on Power-Zionist Peter Thiel’s shock news site RUMBLE™. Greenwald had been whining endlessly about incinerating toddler or some such rubbish, but all the while he was betraying their interest – and yours – by soliciting GAY ACTION. Thiel complained to Chronicle, “I-I-I-I-I- I just told him to…. To…. to stop! I said, I said GLENN. We- you- I- w- you can’t do this! I can’t host this! You think- you think- what, you think it makes any difference if- if- if- if you’reJewish?Buddy, that’s precisely who they’re locked in on! You think I want these people coming afterme?!You… I… You… There’s a very strict protocol for these business arrangements. I-I-I-I- I told him…. Glenn! You have to STOP!” Get ready, because what you’re about to see next on this web article will chill you to your very bone. Glenn Greenwald in dainty maid and skirt pantyhose gruesome fetish FUCK . . . . . . . . . . . . . . . . . . . I CAN’T FUCKING BELIEVE IT, CAN YOU? WILL ANYTHING EVER BE THE SAME AFTER THIS?! The breaking story reached front desk of Lebal Drocer CEO Raleigh T. Sakers who all but confirmed Mossad was behind the hit. “This is almost certainly Mossad’s doing, I go golfing with the guy who keeps hold of this filth. He has his own private server.Petabytes of the shit. “But you listen to mecockroach, I’ve been happy to let the Chronicle slide into irrelevance to avoidpreciselythis type of scandal. You think I want my good friends smeared in my own paper? Not a chance! We’ve got a fundraiser coming up for the annual Fair Saint Louis Parade and I donotwant our biggest donorsunhappy. “If you so much asthinkof publishing even thefaintestallusion that Mossad is behind this? You better believeyou’llbe the next one in tight panty girdle on the front page of the New York Post! Oh, what’s that? No such thing exists?WHAT DO YOU THINK WEHADTHAT AI BUILT FOR? WRITING ARTICLES? GET OUT OF MY OFFICE!” Long time collaborator and heterosexual icon Andrew “Woiv” Auernheimer was shocked and appalled, “this whole time I thought Glenn was Aryan and straight, but it turns out he’s Jewish and gay? What the fuck, man!” Greenwald did everything in his power to rehabilitate Auernehimer’s public image after a neo-nazi hack gone wrong, but it just wasn’t enough. Old wounds now re-open, and the salt inserts directly, “it’s given me a lot to think about that’s for sure! HAH! HAH! HAH!” None were more bothered by it though than old friend and collaborator Ethan Klein of h3h3 fame. Klein recently fell into a heaping pile of dung when it got accidentally revealed his wife “Hila” Klein was a former raider in the Israeli Defence Force. The controversy saw users haemorrhaging out of his podcast – and spondulix out of his pocket. Klein worked quick to control the damage, but it just wasn’t enough. In a last ditch attempt h3 swallowed his pride and solicited donations for Palestine, but accidentally gave all of it to Ahmed Fouad Alkhatib, a Palestinian, yes, but sneakily employed by the Atlantic Council, direct facilitators of the democide. With no where left to turn, Klein’s only hope was a puff piece at the intercept from him old chum Greenwald Glenn, but it turned out he was batting for the other side. “After all these years my good friend Glenn Greenwald can’t even lift a finger to write some positive press about me? It pisses me off!” “For months on end now he’s been brow beating me, Ethan your perspective’s all wrong, Ethan you’re on the wrong side of history. Ethan. Ethan. Ethan. Ethan. But the whole time this is what he’s doing? Maybe those kidsdeserved to dieif this is who’s really pushing their agenda!” **Lebal Drocer. Go Viral.** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Click to share on WhatsApp (Opens in new window)WhatsApp Click to share on Reddit (Opens in new window)Reddit Click to share on Tumblr (Opens in new window)Tumblr **Related News** **By Lebal Drocer in-house LLM** As Internet Chronicle writers approach the harrowing end-of-life stage of TerrorMax™ dependency, Lebal Drocer's LLM solution ensures a comparable standard of output for many centuries to come! **Leave a comment (or don't)Cancel reply** Radio Chronicle Trigger (Demo) Lebal Drocer, Inc. Advertise Twitter News Feed **FREE! Fact Checker** **Channel Select** **WTF?** About Advertise Chronicle Trigger (Demo) Privacy Radio Internet Chronicle on Twitter **Hate Radio** Doug Jackson’s Twisted GameJanuary 13, 2025 Internet Chronicle: The GameSeptember 16, 2024 The King Cobra saga: Jessica Messica tells all!September 1, 2024 Internet Chronicle CommentsMay 20, 2024 Giorgio AngeliniApril 28, 2024 Internet Chronicle Investigates: King Cobra JFSApril 21, 2024 David GolumbiaSeptember 17, 2023 Radio Havana: Trollcow SyndromeSeptember 3, 2023 Radio X — Twitter is burning downJuly 24, 2023 CopGPTMarch 26, 2023 © 2025Internet Chronicle Privacy Powered by WordPress"}