{"id": 1020, "name": "Noozhawk", "domain": "noozhawk.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.noozhawk.com/malia-ortiz-jude-anderson-tounde-yessoufou-honored-by-northern-santa-barbara-county-athletic-round-table/", "title": "Malia Ortiz Jude Anderson Tounde Yessoufou Honored By Northern Santa Barbara County Athletic Round Table", "content": "No paywalls. No subscriptions. Noozhawk is free for everyone! If you like what we're doing — or just want to see more Santa Barbara County news —click here to support our mission. Support Noozhawk Home Local NewsOpen dropdown menuBill MacfadyenJoshua Molina PodcastNoozhawk A.M. Report ArchiveNoozhawk P.M. Report ArchivePhoto of the DayNoozhawk ColumnistsSponsored FeaturesOpinionsOpen dropdown menuSubmit a Letter to the Editor Bill Macfadyen Joshua Molina Podcast Noozhawk A.M. Report Archive Noozhawk P.M. Report Archive Photo of the Day Noozhawk Columnists Sponsored Features OpinionsOpen dropdown menuSubmit a Letter to the Editor Submit a Letter to the Editor Bill Macfadyen Joshua Molina Podcast Noozhawk A.M. Report Archive Noozhawk P.M. Report Archive Photo of the Day Noozhawk Columnists Sponsored Features OpinionsOpen dropdown menuSubmit a Letter to the Editor Submit a Letter to the Editor Submit a Letter to the Editor BusinessOpen dropdown menuBizHawkShop Local BizHawk Shop Local BizHawk Shop Local SportsOpen dropdown menuMark PattonAthletes of the WeekOutdoors Mark Patton Athletes of the Week Outdoors Mark Patton Athletes of the Week Outdoors SchoolsOpen dropdown menuCelebrating the Class of 2025 Celebrating the Class of 2025 Celebrating the Class of 2025 NonprofitsOpen dropdown menuCalendarSponsorship ApplicationNonprofit Guide to Giving Calendar Sponsorship Application Nonprofit Guide to Giving Calendar Sponsorship Application Nonprofit Guide to Giving LifestyleOpen dropdown menuCalendarArts & EntertainmentMeet Your Realtor Calendar Arts & Entertainment Meet Your Realtor Calendar Arts & Entertainment Meet Your Realtor ObituariesOpen dropdown menuSubmit an Obituary Submit an Obituary Submit an Obituary Your HealthOpen dropdown menuMental Health Care in Crisis Mental Health Care in Crisis Mental Health Care in Crisis Special SectionsOpen dropdown menuSenior Life: Living Well and Aging WiselyParentNooz Camp GuideSalute to NursesFour-Legged Friends and MoreThe Wellness GuideSanta Barbara Wedding Bliss: The Complete GuidePrivate & Independent School GuideGood for Santa Barbara Nonprofit Section Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Newsletters Facebook X Instagram Home Local NewsBill MacfadyenA.M. Report ArchiveP.M. Report ArchiveNews ReleasesVentura County News Releases Bill Macfadyen A.M. Report Archive P.M. Report Archive News ReleasesVentura County News Releases Ventura County News Releases Bill Macfadyen A.M. Report Archive P.M. Report Archive News ReleasesVentura County News Releases Ventura County News Releases Ventura County News Releases SportsAthletes of the WeekMark Patton Athletes of the Week Mark Patton Athletes of the Week Mark Patton ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary Schools NonprofitsSponsorship Application Sponsorship Application Sponsorship Application BusinessBizHawk BizHawk BizHawk Your Health Outdoors Sponsored Features Special SectionsSenior Life: Living Well and Aging WiselyParentNooz Camp GuideSalute to NursesFour-Legged Friends and MoreThe Wellness GuideSanta Barbara Wedding Bliss: The Complete GuidePrivate & Independent School GuideGood for Santa Barbara Nonprofit SectionCelebrating the Class of 2025Shop LocalMeet Your Realtor Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Celebrating the Class of 2025 Shop Local Meet Your Realtor Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Celebrating the Class of 2025 Shop Local Meet Your Realtor Homes & LifestyleWeekly Home Showcase Weekly Home Showcase Weekly Home Showcase Arts & Entertainment Event Calendar Special ReportsMental Health Care in CrisisSafety Net SeriesEmergency PreparednessReimagine: Santa Barbara Mental Health Care in Crisis Safety Net Series Emergency Preparedness Reimagine: Santa Barbara Mental Health Care in Crisis Safety Net Series Emergency Preparedness Reimagine: Santa Barbara OpinionsLetters to the Editor Letters to the Editor Letters to the Editor Noozhawk ColumnistsBill MacfadyenJoshua MolinaRay FordJudy ForemanLaurie JervisDan McCaslin Bill Macfadyen Joshua Molina Ray Ford Judy Foreman Laurie Jervis Dan McCaslin Bill Macfadyen Joshua Molina Ray Ford Judy Foreman Laurie Jervis Dan McCaslin Free Newsletters Advertise Submit Your News Photo of the Day Support Noozhawk About NoozhawkMeet the TeamContact Us Meet the Team Contact Us Meet the Team Contact Us Facebook X Instagram Noozhawk The freshest news in Santa Barbara County Support Noozhawk Home Local NewsOpen dropdown menuBill MacfadyenJoshua Molina PodcastNoozhawk A.M. Report ArchiveNoozhawk P.M. Report ArchivePhoto of the DayNoozhawk ColumnistsSponsored FeaturesOpinionsOpen dropdown menuSubmit a Letter to the Editor Bill Macfadyen Joshua Molina Podcast Noozhawk A.M. Report Archive Noozhawk P.M. Report Archive Photo of the Day Noozhawk Columnists Sponsored Features OpinionsOpen dropdown menuSubmit a Letter to the Editor Submit a Letter to the Editor Bill Macfadyen Joshua Molina Podcast Noozhawk A.M. Report Archive Noozhawk P.M. Report Archive Photo of the Day Noozhawk Columnists Sponsored Features OpinionsOpen dropdown menuSubmit a Letter to the Editor Submit a Letter to the Editor Submit a Letter to the Editor BusinessOpen dropdown menuBizHawkShop Local BizHawk Shop Local BizHawk Shop Local SportsOpen dropdown menuMark PattonAthletes of the WeekOutdoors Mark Patton Athletes of the Week Outdoors Mark Patton Athletes of the Week Outdoors SchoolsOpen dropdown menuCelebrating the Class of 2025 Celebrating the Class of 2025 Celebrating the Class of 2025 NonprofitsOpen dropdown menuCalendarSponsorship ApplicationNonprofit Guide to Giving Calendar Sponsorship Application Nonprofit Guide to Giving Calendar Sponsorship Application Nonprofit Guide to Giving LifestyleOpen dropdown menuCalendarArts & EntertainmentMeet Your Realtor Calendar Arts & Entertainment Meet Your Realtor Calendar Arts & Entertainment Meet Your Realtor ObituariesOpen dropdown menuSubmit an Obituary Submit an Obituary Submit an Obituary Your HealthOpen dropdown menuMental Health Care in Crisis Mental Health Care in Crisis Mental Health Care in Crisis Special SectionsOpen dropdown menuSenior Life: Living Well and Aging WiselyParentNooz Camp GuideSalute to NursesFour-Legged Friends and MoreThe Wellness GuideSanta Barbara Wedding Bliss: The Complete GuidePrivate & Independent School GuideGood for Santa Barbara Nonprofit Section Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Senior Life: Living Well and Aging Wisely ParentNooz Camp Guide Salute to Nurses Four-Legged Friends and More The Wellness Guide Santa Barbara Wedding Bliss: The Complete Guide Private & Independent School Guide Good for Santa Barbara Nonprofit Section Newsletters **Malia Ortiz, Jude Anderson, Tounde Yessoufou Honored by Northern Santa Barbara County Athletic Round Table** Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on X (Opens in new window)X TheNorthern Santa Barbara County Athletic Round Tablerecently held its annual end-of-year banquet, recognizing outstanding student-athletes from across the region while inducting two community members into its Hall of Fame.Malia Ortiz fromSanta Ynez Valley Union High Schoolearned Female Athlete of the Year honors, while the Male Athlete of the Year award was shared by Jude Anderson fromCabrillo High Schooland Tounde Yessoufou fromSt. Joseph High School.In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Malia Ortiz fromSanta Ynez Valley Union High Schoolearned Female Athlete of the Year honors, while the Male Athlete of the Year award was shared by Jude Anderson fromCabrillo High Schooland Tounde Yessoufou fromSt. Joseph High School.In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award. The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo The family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo Among the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou. 2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz. **Female Athlete of the Year Nominees** Gabriella Arias, Lompoc High Kenslee Martian, Cabrillo High Taylor Mediano, St. Joseph High Kahlia Melton, Pioneer Valley High Hannah Moon,Righetti High School Mia Murillo, Santa Maria High Malia Ortiz, Santa Ynez High Sofia Rubalcava,Orcutt Academy High School **Male Athlete of the Year Nominees** Mosses Aguire Jr., Orcutt Academy Jude Anderson, Cabrillo High Aiden Burke, Pioneer Valley High Izrell Elizondo, Lompoc High James Fakoury,Valley Christian Academy Ben Flores, Santa Ynez High Jacob McMillan, Righetti High David Joell Ramos, Santa Maria High Tounde Yessoufou, St. Joseph High **Female Scholar Athlete Nominees** Mila Dolores, Pioneer Valley High Joselyn Herrera-Velazquez, Santa Maria High Tobyn Jory, Cabrillo High Peyton Miya, Orcutt Academy Riley Olney, Righetti High Mackensie Phelan, Santa Ynez High Josilyn Philson, St. Joseph High Halee Sager, Lompoc High **Male Scholar Athlete Nominees** Jossue Bautista Segura, Santa Maria Hig Sebastian Bravo, Lompoc High Bryan Garcia Garibay, Pioneer Valley High Alex Meraz, Orcutt Academy Cooper Smith, St. Joseph High Dominic Sousa, Righetti High Adler Von Protz, Cabrillo High The Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Keep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Malia Ortiz fromSanta Ynez Valley Union High Schoolearned Female Athlete of the Year honors, while the Male Athlete of the Year award was shared by Jude Anderson fromCabrillo High Schooland Tounde Yessoufou fromSt. Joseph High School.In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award. The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo The family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo Among the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou. 2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz. **Female Athlete of the Year Nominees** Gabriella Arias, Lompoc High Kenslee Martian, Cabrillo High Taylor Mediano, St. Joseph High Kahlia Melton, Pioneer Valley High Hannah Moon,Righetti High School Mia Murillo, Santa Maria High Malia Ortiz, Santa Ynez High Sofia Rubalcava,Orcutt Academy High School **Male Athlete of the Year Nominees** Mosses Aguire Jr., Orcutt Academy Jude Anderson, Cabrillo High Aiden Burke, Pioneer Valley High Izrell Elizondo, Lompoc High James Fakoury,Valley Christian Academy Ben Flores, Santa Ynez High Jacob McMillan, Righetti High David Joell Ramos, Santa Maria High Tounde Yessoufou, St. Joseph High **Female Scholar Athlete Nominees** Mila Dolores, Pioneer Valley High Joselyn Herrera-Velazquez, Santa Maria High Tobyn Jory, Cabrillo High Peyton Miya, Orcutt Academy Riley Olney, Righetti High Mackensie Phelan, Santa Ynez High Josilyn Philson, St. Joseph High Halee Sager, Lompoc High **Male Scholar Athlete Nominees** Jossue Bautista Segura, Santa Maria Hig Sebastian Bravo, Lompoc High Bryan Garcia Garibay, Pioneer Valley High Alex Meraz, Orcutt Academy Cooper Smith, St. Joseph High Dominic Sousa, Righetti High Adler Von Protz, Cabrillo High The Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Keep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. In the scholar-athlete categories, Halee Sager fromLompoc High Schoolwas awarded Female Scholar Athlete of the Year, with Adler Von Protz from Cabrillo High earning Male Scholar Athlete of the Year.Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award.The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoThe family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photoAmong the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou.2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz.Female Athlete of the Year NomineesGabriella Arias, Lompoc HighKenslee Martian, Cabrillo HighTaylor Mediano, St. Joseph HighKahlia Melton, Pioneer Valley HighHannah Moon,Righetti High SchoolMia Murillo, Santa Maria HighMalia Ortiz, Santa Ynez HighSofia Rubalcava,Orcutt Academy High SchoolMale Athlete of the Year NomineesMosses Aguire Jr., Orcutt AcademyJude Anderson, Cabrillo HighAiden Burke, Pioneer Valley HighIzrell Elizondo, Lompoc HighJames Fakoury,Valley Christian AcademyBen Flores, Santa Ynez HighJacob McMillan, Righetti HighDavid Joell Ramos, Santa Maria HighTounde Yessoufou, St. Joseph HighFemale Scholar Athlete NomineesMila Dolores, Pioneer Valley HighJoselyn Herrera-Velazquez, Santa Maria HighTobyn Jory, Cabrillo HighPeyton Miya, Orcutt AcademyRiley Olney, Righetti HighMackensie Phelan, Santa Ynez HighJosilyn Philson, St. Joseph HighHalee Sager, Lompoc HighMale Scholar Athlete NomineesJossue Bautista Segura, Santa Maria HigSebastian Bravo, Lompoc HighBryan Garcia Garibay, Pioneer Valley HighAlex Meraz, Orcutt AcademyCooper Smith, St. Joseph HighDominic Sousa, Righetti HighAdler Von Protz, Cabrillo HighThe Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award. The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo The family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo Among the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou. 2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz. **Female Athlete of the Year Nominees** Gabriella Arias, Lompoc High Kenslee Martian, Cabrillo High Taylor Mediano, St. Joseph High Kahlia Melton, Pioneer Valley High Hannah Moon,Righetti High School Mia Murillo, Santa Maria High Malia Ortiz, Santa Ynez High Sofia Rubalcava,Orcutt Academy High School **Male Athlete of the Year Nominees** Mosses Aguire Jr., Orcutt Academy Jude Anderson, Cabrillo High Aiden Burke, Pioneer Valley High Izrell Elizondo, Lompoc High James Fakoury,Valley Christian Academy Ben Flores, Santa Ynez High Jacob McMillan, Righetti High David Joell Ramos, Santa Maria High Tounde Yessoufou, St. Joseph High **Female Scholar Athlete Nominees** Mila Dolores, Pioneer Valley High Joselyn Herrera-Velazquez, Santa Maria High Tobyn Jory, Cabrillo High Peyton Miya, Orcutt Academy Riley Olney, Righetti High Mackensie Phelan, Santa Ynez High Josilyn Philson, St. Joseph High Halee Sager, Lompoc High **Male Scholar Athlete Nominees** Jossue Bautista Segura, Santa Maria Hig Sebastian Bravo, Lompoc High Bryan Garcia Garibay, Pioneer Valley High Alex Meraz, Orcutt Academy Cooper Smith, St. Joseph High Dominic Sousa, Righetti High Adler Von Protz, Cabrillo High The Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Keep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Special recognition went to Joselyn Herrera-Velquez fromSanta Maria High School, who received the Joni Gray Heart and Soul Award, and Mila Dolores fromPioneer Valley High School, winner of the Bill Simmas/Elks Award. The family of the late Jim Glines is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo The family of the late Rodney Smalley is on hand for his posthumous induction into the Northern Santa Barbara County Athletic Round Table Hall of Fame.Credit:Northern Santa Barbara County Athletic Round Table photo Among the Northern Santa Barbara County Athletic Round Table 2025 honorees are Female Athlete of the Year Malia Ortiz of Santa Ynez Valley Union High School, co-Male Athletes of the Year Jude Anderson of Cabrillo High School and Tounde Yessoufou of St. Joseph High School; Female Scholar Athlete of the Year Halee Sager of Lompoc High School, Male Scholar Athlete of the Year Adler Von Protz of Cabrillo High, Joni Gray Heart and Soul Award winner Joselyn Herrera-Velquez of Santa Maria High School, and Bill Simmas/Elks Award winner Mila Dolores of Pioneer Valley High School.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Female Athlete of the Year nominees Gabriella Arias, Kenslee Martian, Taylor Mediano, Kahlia Melton, Hannah Moon, Mia Murillo, Malia Ortiz and Sofia Rubalcava.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Athlete of the Year nominees Mosses Aguire Jr., Jude Anderson, Aiden Burke, Izrell Elizondo, James Fakoury, Ben Flores, Jacob McMillan, David Joell Ramos and Tounde Yessoufou. 2025 Female Student Athlete of the Year nominees Mila Dolores, Joselyn Herrera-Velazquez, Tobyn Jory, Peyton Miya, Riley Olney, Mackensie Phelan, Josilyn Philson and Halee Sager.Credit:Northern Santa Barbara County Athletic Round Table photo 2025 Male Student Athlete of the Year nominees Jossue Bautista Segura, Sebastian Bravo, Bryan Garcia Garibay, Alex Meraz, Cooper Smith, Dominic Sousa and Adler Von Protz. **Female Athlete of the Year Nominees** Gabriella Arias, Lompoc High Kenslee Martian, Cabrillo High Taylor Mediano, St. Joseph High Kahlia Melton, Pioneer Valley High Hannah Moon,Righetti High School Mia Murillo, Santa Maria High Malia Ortiz, Santa Ynez High Sofia Rubalcava,Orcutt Academy High School **Male Athlete of the Year Nominees** Mosses Aguire Jr., Orcutt Academy Jude Anderson, Cabrillo High Aiden Burke, Pioneer Valley High Izrell Elizondo, Lompoc High James Fakoury,Valley Christian Academy Ben Flores, Santa Ynez High Jacob McMillan, Righetti High David Joell Ramos, Santa Maria High Tounde Yessoufou, St. Joseph High **Female Scholar Athlete Nominees** Mila Dolores, Pioneer Valley High Joselyn Herrera-Velazquez, Santa Maria High Tobyn Jory, Cabrillo High Peyton Miya, Orcutt Academy Riley Olney, Righetti High Mackensie Phelan, Santa Ynez High Josilyn Philson, St. Joseph High Halee Sager, Lompoc High **Male Scholar Athlete Nominees** Jossue Bautista Segura, Santa Maria Hig Sebastian Bravo, Lompoc High Bryan Garcia Garibay, Pioneer Valley High Alex Meraz, Orcutt Academy Cooper Smith, St. Joseph High Dominic Sousa, Righetti High Adler Von Protz, Cabrillo High The Northern Santa Barbara County Athletic Round Table posthumously inductedJim Glinesand Rodney Smalley into its Hall of Fame, honoring their contributions to local athletics and community involvement.Sign Up for the A.M. ReportKeep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Keep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. Keep up with Noozhawk's daily news coverage, delivered at 4:15 a.m. right to your inbox.Sign upThis site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. **Love your A.M. Report?** Stay in the know withNoozhawk's P.M. Report. The most-read stories of the day — delivered straight to your inbox at 4:15 p.m. Free. Fast. Essential news. **Start Your Day Smarter** Noozhawk's A.M. Report– Santa Barbara County headlines deliveredfreshevery morning. Free. Fast. Essential news. Facebook **Noozhawk** P.O. Box 101Santa Barbara, CA 93102 Noozhawk is a founding member of theLocal Independent Online News (LION) Publishers. Site design and development byHop StudiosHop Studios **About Us** What We Do Meet the Team Contact Us Want to Work? Support Noozhawk Affiliates Terms of Use Privacy Policy **Services** Advertise Submit an Obituary Submit an Event Free Newsletters Text Alerts Support Noozhawk Make Noozhawk Your Home Page **Contact** Submit a News Release Submit a Photo of the Day Submit a Letter to the Editor Noozhawk Contribute Advertise Sponsorship Application Have a Question? Facebook X Instagram"}