{"id": 83, "name": "Anti-Fascist News", "domain": "antifascistnews.net", "bias": "left", "credibility": "high-credibility", "reporting": "mixed", "questionable": null, "url": "https://antifascistnews.net/2019/03/13/antifascist-mobilization-leads-two-venues-to-cancel-molyneux-and-southern-event-in-vancouver-bc-free-speechers-turn-to-secret-location-for-march-15/#comments", "title": "Antifascist Mobilization Leads Two Venues To Cancel Molyneux And Southern Event In Vancouver Bc Free Speechers Turn To Secret Location For March 15", "content": "**Anti-Fascist News** About **Antifascist Mobilization Leads Two Venues to Cancel Molyneux and Southern Event in Vancouver (BC): “Free Speechers” Turn to “Secret Location” for March 15** By Jeff Shantz Anti-fascsists and anti-racists in Vancouver (Unceded Coast Salish territories) have successfully mobilized to get two venues to cancel a planned speaking event by Canadian far Rightists Stefan Molyneux and Lauren Southern scheduled for Friday March 15. The speaking event is being organized by the so-called “Free Speech Club” at the University of British Columbia, a Rightwing group that uses the cover of “free speech” to host far Right figures who oppose the “free speech” (and the very existence) of Muslims, feminists, Leftists, etc. while promoting white supremacy. The club has previously organized and hosted a speaking event by Ben Shapiro. Molyneux, from Toronto, is the founder and host of the Freedomain Radio podcast and YouTube channel which has posted videos under titles like “The Death of Europe – European Migrant Crisis,” “Migratory Patterns of Predatory Immigrants,” and “The Female Evil” which espouse racist and anti-Semitic views. Southern, of Surrey, another YouTube favorite of altRightists has posted videos with titles such as “Asking Feminists: Women’s Rights or Islam” and “Why I Hate Pride Parades.” This event was originally scheduled for March 16 at the Chan Center at UBC, where the Shapiro even was held, but was cancelled following mobilized community opposition, including a petition that gathered 450 signatures in a matter of days. The free speech club claims security costs were too high for the Molyneux/Southern event prompting a move to the Hellenic Community of Vancouver (HCV, 4500 Arbutus St, Vancouver). This led to mobilizing to convince the HCV center to cancel. A demonstration was called for the 15thto oppose Molyneux and Southern. Right before midnight on March 12, ahead of the HCV general meeting of the 13th, the Free Speech Club put out a tweet saying the HCV was cancelling the event in response to the volume of community complaints. Antifascists are still vigilant. The Free Speech club have said they will go ahead with the event in a “secret location.” Details to follow, when available. For now it is satisfying to listen to the whine rising from the now twice disappointed “free speechers” as via their social media: “ANNOUNCEMENT: The Hellenic Centre must cancel our booking due to physical threats of harm towards their community, and church. Domestic Terrorist groups like ANTIFA have bullied this religious community into a crippling and life threatening situation. Please do not direct your hate towards this community. We are currently booking a new venue which will remain private and for ticket holders only. – FSC Team” **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook **Related** **Post navigation** **2 thoughts on “Antifascist Mobilization Leads Two Venues to Cancel Molyneux and Southern Event in Vancouver (BC): “Free Speechers” Turn to “Secret Location” for March 15”** Pingback:Blog: Antifascist Mobilization Leads Two Venues to Cancel Molyneux and Southern Event in Vancouver (BC): “Free Speechers” Turn to “Secret Location” for March 15 – My Blog Pingback:#Antifascist Mobilization Leads Two Venues to Cancel Molyneux and Southern Event in Vancouver (BC): “Free Speechers” Turn to “Secret Location” for March 15 | Indiĝenaj Inteligenteco **Leave a commentCancel reply** Δ **Social** **Recent Posts** The Gilad Atzmon and David Rovics Antisemitism Controversy, Explained Colonialism, Green Resistance, and Fighting Eco-Fascism: An Interview With Eco-Anarchist Kevin Tucker Nationalism is No Alternative: An Interview With German Antifascists Support “No Pasaran,” a New Patreon to Research and Report on Fascism and Build Resistance Community Action: Anti-Trans Speaker with Ties to Soldiers of Odin and Proud Boys Set to Speak in Vancouver on June 23 **Antifascist RSS Feed** RSS - Posts RSS - Comments **Taking on Fascism and Racism from the Ground Up.** **Follow Anti-Fascist News on Facebook** **Follow Us on Twitter** **Social Media** Facebook Twitter **Contact Us** **Follow Blog via Email** Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Follow **Related Topics** **What Are People Saying?** Comment Reblog SubscribeSubscribedAnti-Fascist NewsJoin 580 other subscribersSign me upAlready have a WordPress.com account?Log in now. Anti-Fascist News Already have a WordPress.com account?Log in now. Anti-Fascist News Already have a WordPress.com account?Log in now. Anti-Fascist NewsSubscribeSubscribedSign upLog inCopy shortlinkReport this contentView post in ReaderManage subscriptionsCollapse this bar Anti-Fascist News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Anti-Fascist News SubscribeSubscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"}