{"id": 1421, "name": "The Prepared", "domain": "theprepared.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://theprepared.com/courses/first-aid/", "title": "First Aid", "content": "**Be ready for any challenge that comes your way. Choose one of our three unique and expertly crafted preparedness courses.** **WATER ESSENTIALS** **AUSTERE FIRST AID** **KNIFE SHARPENING** SCROLL FOR DETAILS **are you longing for...** **The confidence that no matter what life throws at you, you'll be ready?** Maybe you've considered preparing before, but you... Didn't know where or how to start? Thought it would be outrageously expensive? Were scared people would think you were a doomsday prepper? There is nothing wrong with wanting to be ready to face the uncertainty of this world. And you can do it in a matter of weeks (not months or years) without spending thousands of dollars. We can help you rationally prepare for any and all scenarios, without any politics or craziness involved. â\u0080\u009cAlthough I normally prefer reading, I was hooked as soon as I watched the first video in this course. I learned a lot even though Iâ\u0080\u0099ve been a survival student for over 40 years!\" - Thomas L., The Prepared student **It's your time to get prepared** Through any of our courses, you can finally start rationally prepping for any and all emergencies in a smart and affordable way. The hours of lessons in each of these courses are taught by experts in their field, each with decades of experience. If you're ready to be prepared, we're here to help. **CHOOSE YOUR ADVENTURE COURSES** Be prepared to tackle any injury you or others may experience on your adventure by diving into our Austere First Aid course. Or, never be without clean water no matter what the environment is after taking our Water Essentials course. Feel well rounded in both of those disciplines? Then check out our Knife Sharpening and Maintenance course to make sure all of your blades are as sharp as can be. No matter what you dive into, know that your course will come with life time membership, customer support, and a 30-day money-back guarantee. Not your average first aid lessons Normal first aid courses teach you based on the assumption that help is just a phone call awayâ\u0080\u0094but what happens when thatâ\u0080\u0099s not true and itâ\u0080\u0099s up to you? In this course, youâ\u0080\u0099ll learn how to deal with emergency medical situations and treat a wide range of injuries. This course is equivalent to a one-week-long, in-person Wilderness First Aid classâ\u0080\u0093except itâ\u0080\u0099s condensed into an online series you can watch at your convenience. After just a single day of studying this course, youâ\u0080\u0099ll be able to handle almost any first aid situation imaginable. Wide range of scenariosYouâ\u0080\u0099ll learn how to handle the kinds of realistic situations youâ\u0080\u0099re most likely to face in life and can actually do something about. Section 1: Intro â\u0080¢ welcomeâ\u0080¢ reference & download â\u0080¢ gear used in this courseâ\u0080¢ bonus: packing a first aid kit Section 6: Environmental â\u0080¢ altitude sicknessâ\u0080¢ arthropodsâ\u0080¢ drowningâ\u0080¢ cold injuriesâ\u0080¢ hypothermiaâ\u0080¢ heat emergenciesâ\u0080¢ lighteningâ\u0080¢ poison ivy, oak, and sumacâ\u0080¢ snake biteâ\u0080¢ solar keratitis / snow blindness Section 2: Medical 101 â\u0080¢ medical core conceptsâ\u0080¢ physiology core conceptsâ\u0080¢ moving patientsâ\u0080¢ documentation and communicationâ\u0080¢ legal issues and Good Samaritan laws Simple, memorable lessons These teachers have taught thousands of students, including total newbies, so they know how to focus on just the right information in a way that youâ\u0080\u0099ll actually benefit from. Section 7: Medical Emergencies â\u0080¢ abdominal painâ\u0080¢ allergies / anaphylaxisâ\u0080¢ asthmaâ\u0080¢ chest painâ\u0080¢ dentalâ\u0080¢ diabetic / blood sugar â\u0080¢ eyes and earsâ\u0080¢ flu-like symptoms, fever, coughâ\u0080¢ gastro-intestinalâ\u0080¢ genito-urinaryâ\u0080¢ rhabdomyolysisâ\u0080¢ seizureâ\u0080¢ strokeâ\u0080¢ toxins / poisoningsâ\u0080¢ congrats and feedback Section 3: Patient Assessment System â\u0080¢ patient assessment system (PAS) â\u0080¢ scene size up â\u0080¢ primary survey â\u0080¢ secondary survey 8 hours 7 sections 90 lessons Section 4: Critical Systems â\u0080¢ critical systemsâ\u0080¢ circulatory systemâ\u0080¢ respiratory systemâ\u0080¢ nervous system Section 5: Trauma â\u0080¢ musculoskeletal injuriesâ\u0080¢ dislocationsâ\u0080¢ spine injuriesâ\u0080¢ soft tissue injuries â\u0080\u009cA cool headed siteâ\u0080¦ emerging as the voice of a movement.â\u0080\u009dNEW YORK TIMES - April 24th, 2020 30-DAY MONEY BACK GUARANTEE FREE BONUS. LEARN MOREHERE Never find yourself without H2O Having access to drinkable water is something that we take for granted but in the wake of a natural disaster, this precious resource may be in short supply. In this course, you'll learn the proper methods and locations for storing water during emergency situations, how to locate additional sources of water, and how to purify it for safe consumption. Youâ\u0080\u0099ll also learn how to conserve the water you have and how to recognize the signs of dehydration and treat it without professional help. Prepare ahead of timeYou can get your household ready for the vast majority of emergencies with a few simple and cheap steps â\u0080\u0094 even if youâ\u0080\u0099re on a tight budget or in a tiny apartment. Section 7: Treating â\u0080¢ store-bought treatment products â\u0080¢ DIY improvised treatment Section 1: Intro â\u0080¢ quick welcome notesâ\u0080¢ big picture goals Section 2: Core Concepts â\u0080¢ how much water do you need to survive? â\u0080¢ contaminants 101 â\u0080¢ filtering vs. disinfecting vs. purifying â\u0080¢ comfort vs. health Section 8: Conserving â\u0080¢ conservation 101 â\u0080¢ cooking and showering examples Survive the emergency Youâ\u0080\u0099ll be able to handle common emergencies just by using what youâ\u0080\u0099ve stored ahead of time. But if things are serious, you might need to find more water, make it safe to drink, and deal with the chaos. Section 9: Dehydration â\u0080¢ lesson 1 â\u0080¢ congratulations and feedback Section 3: Storing Water â\u0080¢ containers 101â\u0080¢ do you need to use chemical preservatives?â\u0080¢ how to clean containersâ\u0080¢ improvised containers Section 4: Rain & Moisture Catches â\u0080¢ proper rain systems before emergencyâ\u0080¢ improvised systems during emergency 7 hours 9 sections 23 lessons Section 5: Finding & Collecting Wild Water â\u0080¢ collection tipsâ\u0080¢ finding water 101â\u0080¢ cold climatesâ\u0080¢ hot climatesâ\u0080¢ coastal and salt water â\u0080\u009cThe Prepared offers useful, non-alarmist advice on disaster prepareness.â\u0080\u009dTHE GUARDIAN - April 30th, 2020 Section 6: Finding Water in Man-Made Areas â\u0080¢ around your homeâ\u0080¢ urban and suburban 30-DAY MONEY BACK GUARANTEE FREE BONUS. LEARN MOREHERE Make dull knives a thing of the pastIn this course, youâ\u0080\u0099ll learn how to sharpen a variety of knives and edged tools. These tools dull with time and use, becoming ineffective and dangerous. If you donâ\u0080\u0099t know how to keep your blades sharp, their usefulness will drop off quickly in an emergency. But you donâ\u0080\u0099t need to throw away your hard-earned money having a professional knife sharpener do this for youâ\u0080\u0093itâ\u0080\u0099s a skill that you can quickly pick up on your own. Fundamental Skills We start with the basics and get into hands-on demonstrations with all of the common sharpening gear youâ\u0080\u0099ll find among preppers. Section 1: Intro â\u0080¢ course goalsâ\u0080¢ the 80/20 approachâ\u0080¢ sharper is saferâ\u0080¢ sharpening is a skill, not a product â\u0080¢ a knife is a wear part, & sharpening is contolled wearâ\u0080¢ the three ingredients of sharpening Section 4: Setting The Angle â\u0080¢ inclusive vs. exclusive edge angleâ\u0080¢ determining the correct edge angleâ\u0080¢ tricks for setting the angleâ\u0080¢ keeping the proper tip angle Section 5: Mousepad & Sandpaper â\u0080¢ selecting materialsâ\u0080¢ why it's important to start with this techniqueâ\u0080¢ some things to watch out forâ\u0080¢ first look: field knife with convex edgeâ\u0080¢ the theory behind the techniqueâ\u0080¢ sharpening demonstration: field knife with convex edgeâ\u0080¢ re-profiling a V-shaped edge to a convex edgeâ\u0080¢ repairing and cleaning up an axe Save money in daily life Don't toss out kitchen knives or scissors that just need a few minutes of love, and don't pay others to sharpen them for you. Section 2: Knife Basics â\u0080¢ parts of a knifeâ\u0080¢ edge grindsâ\u0080¢ types of sharpnessâ\u0080¢ types of dullnessâ\u0080¢ common blade steelsâ\u0080¢ common handle materials Section 3: Sharpening Fundamentals â\u0080¢ take your timeâ\u0080¢ just because you can, doesn't mean you shouldâ\u0080¢ start out slow, then get faster as you get betterâ\u0080¢ turn variables into constantsâ\u0080¢ always be testingâ\u0080¢ you won't always raise a burrâ\u0080¢ know when to quitâ\u0080¢ count your strokesâ\u0080¢ trailing stroke vs. sharpening stroke 5 hours 13 sections 57 lessons Section 6: Leather Strop â\u0080¢ loading the stropâ\u0080¢ stropping technique demonstrationâ\u0080¢ recurve strop technique â\u0080\u009cTo prep like a pro, you need to learn from The Prepared.â\u0080\u009d BLOOMBERG - April 16th, 2020 30-DAY MONEY BACK GUARANTEE FREE BONUS. LEARN MOREHERE **Never prepped? No problem** Whether you've prepped for years or have never even dreamed of starting, our courses can help you. We'll walk you through everything you need to know to prepare rationally and effectively. **Dozens of lessons** Get 20+ hours of online lessons throughout the 3 courses in this package. Once enrolled, you'll have access to the lessons 24/7 through your lifetime membership. **Dedicated support team** Once you enroll, you'll get access to our dedicated support staff for every step of your journeyâ\u0080\u0094whether you have questions about our technology or your prepping lessons. **Impactful lessons** With over 100+ years of experience between all of our instructors, we're confident that our lessons can truly impact and save lives. We want one of those lives to be yours. **30-day money back guarantee** We know that the only way for you to know if our courses are right for you is for you to try them out. If you that they're right for you, fantastic! If not, we'll give you a full refund, no questions asked. **Instructors who care** With over 125,000+ members in our communityâ\u0080\u0094your teachers cater to all experience levels and genuinely care about helping you become confident and prepared for anything. YOURCHOOSE YOUR ADVENTUREBONUSES: **Bonus Guides & Checklists** From the perfect go bag to better securing your home from intruders (without spending a fortune), our bonus checklist and guides will take your preparedness to the next level. These lessons are only available through this special Choose Your Adventure sale, and will be included with whichever individual course you choose. About the bonus: 3 additional guides and checklists Valued at $200, these bonuses are yours for free Written for absolute beginners Tips & tricks thatwon'tcost you thousands Level up your knowledge with either our Austere First Aid, Water Essentials, or Knife Sharpening and Maintenance Course. Learn from the best experts in their fields and join our community of 125,000+ rational preppers. Hoursof video lessons taught by our expert instructors 24/7 lifetime accessto our courses from any device, anywhere in the world 30-day assuranceincluded if you don't love the courses and access to an incredible support team 3 printable bonus guidesthat you can take with you on the goâ\u0080\u0094worth $200, yours free! **AUSTERE FIRST AID** **$250** **click to learn moreabout course** **KNIFE SHARPENING** **$250** **click to learn moreabout course** **WATER ESSENTIALS** **$250** **click to learn moreabout course** Cancel within 30 days for a full refund if it's not right for you! â\u0080\u009cChecklists and acronyms are hard to remember when this isnâ\u0080\u0099t your day job. The way the lessons explained things in simple language, especially the why behind something, was so helpful.â\u0080\u009d - Phillip R., The Prepared student **Who we are & what we believe** Founded in 2018, The Prepared has emerged as one of the largest and most trusted resources on the internet for prepping guides and product reviews. We pride ourselves on the qualityâ\u0080\u0093not the quantityâ\u0080\u0093of the content we produce and we regularly update our site to make sure it's up-to-date and accurate. Weâ\u0080\u0099ve been featured in publications like TechCrunch and The Guardian and have been recognized as one of the foremost advocates of the Sane Prepper movement, meaning that prepping should be rational, practical, and cost-effective. We don't promote conspiracy theories or fear-mongeringâ\u0080\u0093instead, we focus on providing actionable information and practical advice that can help you and your loved ones stay safe and secure. **Jon Stokes** Co-founder, Ars Technica & Founding Editor, AllOutdoor **Jessie Krebs** Former Air Force SERE Instructor **Tom Rader** Former Combat Medic, USMC & Wilderness First Aid Instructor **Sarib Jot Khalsa** Wilderness EMT & Advanced Ambulance EMT **John Ramey** Founder, The Prepared **Caleb Causey** Former Combat Medic, US Army & Founder, Lone Star Medics **We can help you develop the confidence that comes from being prepared for any scenario!** **20+** **100+** **125,000+** hours of instruction in our courses years of experience from our expert instructors members of our online community **Get prepared for less** **On call support** Enjoy easy access to friendly support teams who are ready to provide both technical support and prepping feedback with direct assistance. **Convenient video lessons** Learn to prep right away! There are no live or Zoom classesâ\u0080\u0094everything is pre-recorded so you can watch at your convenience and on your own schedule! **Resources to help you along the way** All of our courses are jam-packed with tips, tricks, lessons, how-tos, and more. You'll never have to waste time researching materials before going to the next course! **Lessons for anyone, at any time** It doesn't matter what your experience level, income, location, or politics isâ\u0080\u0093anyone can become a rational prepper, and do so on their own time and schedule through our online lesson environment. **Learn from the best** Our instructors aren't YouTube influencers or wannabe survivalists. They are experts in their field, and between them all, bring over 100+ years of experience in their fields. **Prepare in weeks, not years** Through our lessons, you'll learn how to get rationally prepared quickly, effectively, and economically, all from the comfort of your home. Best of all, it will NOT take your life savings to do it. **Access from any device** All the lessons are professionally recorded. With a website for your courses, all of your content is housed in a secure space, accessible from your tablet, phone, or desktop. â\u0080\u009cI learned SO much, even after taking a local Red Cross class. Thank you, thank you.â\u0080\u009d - Kristen P., The Prepared student **All in an online environment built for you** Lifetime access from any device with internet connectivity Pre-recorded lessons so you can play on your own time Resources and support at your fingertips Simple, straightforward navigation Loved by 22,000+ subscribers and counting! Level up your knowledge with either our Austere First Aid, Water Essentials, or Knife Sharpening and Maintenance Course. Learn from the best experts in their fields and join our community of 125,000+ rational preppers. Hoursof video lessons taught by our expert instructors 24/7 lifetime accessto our courses from any device, anywhere in the world 30-day assuranceincluded if you don't love the courses and access to an incredible support team 3 printable bonus guidesthat you can take with you on the goâ\u0080\u0094worth $200, yours free! **AUSTERE FIRST AID** **$250** **click to learn moreabout course** **WATER ESSENTIALS** **$250** **click to learn moreabout course** **KNIFE SHARPENING** **$250** **click to learn moreabout course** Cancel within 30 days for a full refund if it's not right for you! **Frequently Asked Questions** What are the courses like? No boring slideshows with someone talking into a cheap webcam! Many scenes are shot on location for a class with more of an in-person feel, where your teacher is talking to a small room of students to explain concepts before getting into demonstrations. Courses are broken into lessons (eg. â\u0080\u009cDehydrationâ\u0080\u009d) and their topics (eg. â\u0080\u009cSymptomsâ\u0080\u009d or â\u0080\u009cTreatmentâ\u0080\u009d). You move through at your own pace and in whatever order you want. Most topics have a main video with additional pictures and text beneath. Whoâ\u0080\u0099s this for? Total head-in-the-sand beginners, weekend warriors, all the way through experienced preppers advancing their skills. For example, the knife sharpening course isnâ\u0080\u0099t going to make you a professional bladesmith, but itâ\u0080\u0099ll get you close! But Iâ\u0080\u0099m not a prepper Are you a responsible adult? Gone are the days when most preppers fit into stereotypes. All that matters is youâ\u0080\u0099re aware enough to know life can be hard and smart enough to do something about it. Youâ\u0080\u0099ll join a diverse community of kind, like-minded people. Are online courses right for me? We wonâ\u0080\u0099t offer online courses unless we think itâ\u0080\u0099s just as good as an equivalent in-person weekend course. Some are even better than a week-long 24/7 course. You might want to take an online course so you can warm up at your own pace before your limited and expensive in-person time. Maybe you want to try the cheaper online version first before deciding if you want to go to a more advanced physical course. Or maybe youâ\u0080\u0099ve taken an in-person course and want the digital version as a refresher you can go back to over the years. This course is for everyone! How much / what will I learn? Prepping can be overwhelming in generalâ\u0080\u0094and you shouldnâ\u0080\u0099t have to dive into the deep end of a topic just to learn the basics. We focus on Pareto Preparedness, based on the 80-20 â\u0080\u009cPareto rule,â\u0080\u009d so you get the right info you need and none of what you donâ\u0080\u0099t. That way you can get back to enjoying real life â\u0080¦ just a lot smarter! Once you finish a course, youâ\u0080\u0099ll know enough to get you through the vast majority of emergency scenarios youâ\u0080\u0099ll face and you'll be better prepared than 99% of people around you. How long do I have access? What about updates? Lifetime access, including free, automatic upgrades for anything we add or change in the future to that course. What emergencies do you cover? Modern, sane prepping means focusing first on things that are more likely than a doomsday scenario. Prepping is about being prepared for anything that could majorly disrupt your life, which might be as simple as a car accident or sudden job loss. Natural disasters are another biggie.These courses are meant to apply to normal life as much as possible, but they also explain what to do in the really bad scenarios. Can I get my money back? Sure! If youâ\u0080\u0099re not happy, just let us know within a month and youâ\u0080\u0099ll get a full refund. 2023 The Prepared. All rights reserved **KNIFE SHARPENING & MAINTENANCE** Lessons continued... Section 10: Rod Sharpener â\u0080¢ recurve rod techniquer Section 13: Knife Sharpening & maintenance â\u0080¢ storage tips and making a cardboard sheathâ\u0080¢ rust preventionâ\u0080¢ patina and discolorationâ\u0080¢ rust removalâ\u0080¢ caring for wood handlesâ\u0080¢ caring for synthetic and leather handles Section 7: Diamond Bench Stone â\u0080¢ stone and field knife with v-shaped edgeâ\u0080¢ stone and knife with scandi grindâ\u0080¢ stone and pocket knifeâ\u0080¢ stone and chef knifeâ\u0080¢ stone and scissors Section 11: Powered Sharpening â\u0080¢ ken onion work sharp and field knifeâ\u0080¢ ken onion work sharp and axe Section 8: Pocket Diamond Stone â\u0080¢ pocket stone and hatchet â\u0080¢ some pocket stone alternatives Section 12: Field Expedient Sharpening â\u0080¢ improvised strop from fabricâ\u0080¢ coffee mug demonstrationâ\u0080¢ cardboard and toothpasteâ\u0080¢ car window Section 9: Pull-Through Sharpener â\u0080¢ lesson 1"}