{"id": 1073, "name": "The Outlook (Monmouth University)", "domain": "outlook.monmouth.edu", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://outlook.monmouth.edu/2025/04/monmouth-universitys-music-and-theatre-department-presents-industry-alumni-networking-event/", "title": "Monmouth Universitys Music And Theatre Department Presents Industry Alumni Networking Event", "content": "HomeArchiveClimateClub & Greek ArchiveClimateClub & Greek Climate Club & Greek ArchiveClimateClub & Greek Climate Club & Greek Climate Club & Greek NewsThe Verge The Verge The Verge OpinionEditorialStudent Voices Editorial Student Voices Editorial Student Voices Features Lifestyles EntertainmentComics Comics Comics Politics Sports Got a Tip? **Monmouth Universityâ\u0080\u0099s Music and Theatre Department presents â\u0080\u009cIndustry Alumni Networking Eventâ\u0080\u009d** O n April 8, at Woods Theatre, successful Monmouth alumni gathered to share their advice, lives, and love of music. Over the years, Blue Hawk Records (BHR) has made 25 compilation albums with 132 original artists creating 147 tracks, involving over 900 students. Their contributions to not only the university but also to these studentsâ\u0080\u0099 lives are remarkable. This event was the ultimate celebration of the past, present, and future of the music industry. The hosts were future BHR President, Antonia Bongiorno and Joe Rapolla, Professor and Chair of the Music and Theatre Arts Department. The event was split into three sections: Panel one, musical performances, and then panel two. It was all so well done, the decor outside the theatre doors, the food provided, and the welcoming atmosphere. The first panel consisted of five industry professionals who are thriving in their positions. Those included Taylor Coigne, Premium Experiences Coordinator at Live Nation; Kayla Booker, Music Central Assistant at William Morris Endeavor; Jenna Hawryluk, E-Commerce Fan Services Specialist at Universal Music Group; Ryan Hamilton, VP of Business Development and Digital at Spirit Music Group and Founder of CTLG (Catalog Management Services); And finally Mia Heim, Content Manager at Colossus Media Group. They began by explaining how they landed their first job cementing them into the industry. Coigne talked a lot about how she was open to exploring everything in college and gravitated toward BHR and MUâ\u0080\u0099s radio station, WMCX. Booker, Hawryluk, and Heim all said the same, that being a part of BHR cultivated their love of music and made them want to work in the industry. â\u0080\u009cWhat you do at Monmouth and through internships are gonna help you in your career,â\u0080\u009d Heim said. Hamilton explained how his love for music made him long to be near his favorite artists and bands. â\u0080\u009cI was a huge Incubus fanâ\u0080\u0093So I had to get my way in there,â\u0080\u009d He said. All of them had that driving force inside, leading them to where they wanted to be. The group also had some strategies for making and maintaining connections, especially on LinkedIn. Heim explained that you should â\u0080\u009chit connect, connect, connectâ\u0080\u009d to build your following and get to 500+ connections. Hamilton mentioned following every company of interest could have some value in looking at what they post, interacting, and finding people who work for them. While the virtual connections are great, Booker said to take it a step further by asking to go out for coffee. She said, â\u0080\u009cTry your best to stand out and take it beyond that [making a virtual connection].â\u0080\u009d Living behind a screen is definitely something weâ\u0080\u0099ve all gotten used to since the COVID-19 pandemic, but thereâ\u0080\u0099s nothing like face-to-face communication. Itâ\u0080\u0099s how we show our personalities and connect on deeper levels. The group also had a discussion about what technical and interpersonal skills are helpful once youâ\u0080\u0099re out in the field. Booker said, â\u0080\u009cBeing mindful of your body language when you communicate with people,â\u0080\u009d is especially important. Heim also added that how you approach certain people will be different depending on their role. You canâ\u0080\u0099t talk to coworkers the same as you would talk to your friends. She said, â\u0080\u009cHumor goes a really long way when youâ\u0080\u0099re trying to get to know people.â\u0080\u009d Itâ\u0080\u0099s important to remember that weâ\u0080\u0099re all human; showing your personality is not a bad thing. In fact, itâ\u0080\u0099s a great strength when it comes to making that first impression. Hawryluk and Hamilton talked about technical skills, saying itâ\u0080\u0099s important to be adaptable, especially since the industry changes every day. From platforms like TikTok to Microsoft Excel, itâ\u0080\u0099s important to keep up with trends and learn new outlets. You never know what youâ\u0080\u0099ll be asked of or what you can contribute. Finally, before panel one concluded, each person gave their advice to the students in the audience. One piece that really stuck with me. Heim said, â\u0080\u009cDonâ\u0080\u0099t think that graduating means you need to know what you want to do in lifeâ\u0080¦Learning doesnâ\u0080\u0099t end when you graduate; learning ends when you die.â\u0080\u009d The world is endless, and if you love what you do, youâ\u0080\u0099ll never stop grasping for more. Before the second panel started there were two performances by MU students, Taylor Wichterman and Jeffrey Mendez. Wichterman sang a beautiful rendition of â\u0080\u009cViennaâ\u0080\u009d by Billy Joel taking us on the journey of growing up. Mendez sang â\u0080\u009cNorthern Lightsâ\u0080\u009d by Teddy Swims in his first ever live singing performance. Both took my breath away with their effortless talent. Truth be told, Iâ\u0080\u0099ve never seen a bad performance at Woods Theatre. The second panel included Katherine Fernandez, Digital Ad Sales Associate at Paramount; Michelle Etienne, Recruiting and Operations Associate at TurnkeyZRG; Zack Sandler, Producer at Danny Clinch Photography and Transparent Clinch Gallery; And last but not least, Abigail Garcia, Office Operations Coordinator at Vydia. Most of the alumni had landed their first jobs from connections through MU like Rapolla and Rashida Scott-Cruz or networking events on campus. Itâ\u0080\u0099s all about the timing. Etienne was inspired to pursue a career in the industry because sheâ\u0080\u0099s a â\u0080\u009cbig fangirl.â\u0080\u009d Garcia said the same, explaining that after seeing the â\u0080\u009cBest of Both Worlds Tourâ\u0080\u009d with Miley Cyrus, she knew where she wanted to be.The group talked about technical aspects as well and how to cultivate those skills. Sandler said, â\u0080\u009cYou know what you know and you donâ\u0080\u0099t know what you donâ\u0080\u0099t know.â\u0080\u009d Itâ\u0080\u0099s all faking it until you make it, while acquiring skills by doing research and figuring it out. Everything is a learning curve until you practice and improve. Fernandez and Etienne mentioned learning about all operational business aspects no matter what job you find yourself in. Itâ\u0080\u0099s always good to have that learning mindset. Everyone stressed the rising usage of AI platforms like ChatGPT and Google Gemini, something all of us are going to have to get used to in the workforce. They gave some really great advice for making a name for yourself while making those connections. Etienne said, â\u0080\u009cKindness goes such a long way.â\u0080\u009d In most job settings the world might seem large but everyone knows each other, so how you treat others will definitely reflect your connections.Fernandez emphasized the importance of building your personal brand and being consistent in sharing your accomplishments. Etienne followed her up by saying personalized resumes are really what draws people in. Templates are great, but after seeing a million carbon copies of the same resumes, youâ\u0080\u0099ll get lost in the crowd. Garcia gave her input by saying, â\u0080\u009cBe emotionally intelligent,â\u0080\u009d and it goes a long way in knowing how to approach and talk to people. Sandler reminded everyone that being behind a desk isnâ\u0080\u0099t everyoneâ\u0080\u0099s future. â\u0080\u009cYou can be an artist. The end all be all doesnâ\u0080\u0099t have to be corporate,â\u0080\u009d He said. Remembering why you love music is so important: the curtain going up, the lights going out, that first note, and hearing the crowd go wild.While students were there to get advice regarding their future careers, there was still time for laughs. Specifically, when Sandler revealed his â\u0080\u009cRoman Empire,â\u0080\u009d of exploring other creative outlets in his downtime, like the video game â\u0080\u009cX-Plane 12,â\u0080\u009d a flying simulator. This entire interaction got a lot of laughs from the audience. It was such a wholesome moment in between the serious career advice. This event was truly a success and left students filled with the drive to forge their network. It gave MU students hope for their own futures of sitting on panels like this once they graduate. It all starts with love and passion for music. **Related Articles** **â\u0080\u009cSelmaâ\u0080\u009d Marches Into Greatness** Selmawas one of the best civil rights movies I’ve seen in a long time. It allowed the audience to get a closer look at Dr. Martin Luther King as he gathers a rally of people of all races to march from Selma to Montgomery, Alabama for the right to vote for African Americans in 1965. The film shows not only the struggles that Dr. King had as a civil rights protester and preacher, but also the dysfunctions that it brought upon his family. **Harryween: New Yorkâ\u0080\u0099s Preeminent Halloween Party** Harry Styles has been touring around America for â\u0080\u0098Love On Tourâ\u0080\u0099 these past few months. However, for the last two days of October, he took a break from that tour and went to Madison Square Garden for a two-day-only â\u0080\u0098Harryweenâ\u0080\u0099 concert special. These concerts were extra special, because Harry had informed the fans when purchasing […] **FOX Jives with â\u0080\u009cGrease Liveâ\u0080\u009d** On Jan. 31, millions of Americans tuned in toFOXto watch what was going to be either a hit or a miss.Grease Live, which aired Sunday and starred Aaron Tveit and Julianne Hough as Danny and Sandy respectively, was just the push America needed to get their dancing shoes on. **Post navigation** **Sections** Home News Sports Politics Features Entertainment Opinion Lifestyles Online Exclusive Ask the Experts **Services** About Us Contact Us Join the Outlook Staff Event Coverage Meet the EditorsPast Editorial Staff Past Editorial Staff Past Editorial Staff Advertising Archive Privacy Policy **Contact Information** Campus LocationThe OutlookJules L. Plangere Jr. Center for Communicationand Instructional Technology (CCIT)Room 260, 2nd floorMailing AddressThe OutlookMonmouth University400 Cedar Ave, West Long Branch, New Jersey07764Phone:(732) 571-3481|Fax:(732) 263-5151Email:outlook@monmouth.edu"}