{"id": 1508, "name": "Institute for the Study of War", "domain": "understandingwar.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://understandingwar.org/backgrounder/battlefield-ai-revolution-not-here-yet-status-current-russian-and-ukrainian-ai-drone", "title": "Battlefield Ai Revolution Not Here Yet Status Current Russian And Ukrainian Ai Drone", "content": "**Search form** Home Who We Are Research Publications Get Involved Planned Giving Donate **The Battlefield AI Revolution Is Not Here Yet: The Status of Current Russian and Ukrainian AI Drone Efforts** ByKateryna Stepanenko June 2, 2025 Russia and Ukraine are engaged in an active technological race to develop and deploy drones with artificial intelligence (AI) and machine learning (ML) capabilities.Russia and Ukraine are competing to advance these AI/ML-powered drones to automate drone interoperability, targeting, and battlefield analysis. The successful integration of AI/ML drones could enable Russian and Ukrainian forces to reduce their reliance on human drone operators and defenders, bypass electronic warfare (EW), including jamming, reduce human limitations in target identification, and speed up decision-making processes involved in drone warfare.[1] Russian and Ukrainian forces will seek to operate unmanned systems in multiple domains: unmanned aerial systems (UAVs), unmanned surface vehicles (USF), and unmanned ground systems (UGVs).[2] Neither Russia nor Ukraine has leveraged AI/ML drones on the battlefield at scale as of early June 2025.[3] Russia and Ukraine are, however, increasingly integrating ML capabilities with some limited AI adaptations into new drone variants on the path to developing fully AI/ML-powered drones. This paper uses AI and ML to refer to different implementations and varied degrees of development complexity, although there can be considerable overlap in definitions and discussions frequently lump ML functionality into a general bucket of AI.ML capabilities can be more scalable and easier to implement into drones when these models are trained to perform predictable and specific tasks that do not require significant processing power, memory, or data clouds.[4] Some examples of specific tasks include navigation in a GPS-denied environment and terminal guidance, image and pattern recognition, homing, and target locking, although some of these tasks may require AI and other more advanced tools.[5] Drones with ML-powered capabilities still require general guidance and analysis from a drone operator, such as identifying a target or modifying and training the model to operate in new or complex environments, and generally require some communication with the operator.[6] ML capabilities, in other words, can enable drones to perform some pre-programmed and pre-trained tasks, but lack the autonomy and necessary reasoning skills to adapt to battlefield conditions without human intelligence and fine-tuning.[7] AI models can perform tasks that require human intelligence, including analyzing data, autonomous identification and selection of targets, and controlling and adjusting a drone’s flight path based on real-time conditions.[8] AI models can manage swarms of drones against a target and allow for advanced drone-to-drone interoperability.[9] AI also stores and analyzes mission data in the cloud to independently improve drone operations, and AI-powered drones are capable of adaptive decision-making that can eliminate the need for communication with drone operators.[10] The integration of AI capabilities into drones is a more expensive and time-consuming process. AI drone capabilities require the development of new and complex algorithms, significant computing power, a large data cloud, and long-term testing aimed at training AI systems to operate and learn from different battlefield environments.[11] Technological breakthroughs in drone warfare require the development and integration of both AI and ML capabilities.AI powers higher-level autonomous decision-making, while ML capabilities perform specific tasks and help AI learn from the battlefield environment.[12] Swarm drones can be an example of an AI/ML-powered drone. Swarm drones largely depend on AI for their drone-to-drone interoperability, targeting, and task distribution and management.[13] Swarm drones also need ML capabilities to facilitate specialized tasks such as identifying images, avoiding collisions with other drones, and locking onto the target. Russia and Ukraine have been increasingly focusing on developing drones with machine vision capabilities since at least mid-2023.Machine vision refers to automatic image recognition algorithms that enable a drone to memorize an image of a target and lock onto the target even if the target is moving.[14] Ukraine sought to advance the development of machine vision drones as an adaptation to Russia’s use of EW and electronic reconnaissance on the battlefield and to solve the problem of drones not reaching their targets due to losing signal with the drone operator.[15] Drones with machine learning have target-homing capabilities in the event of loss of communication with drone operators, such as during EW interference.[16] Vision-capable drones are not fully AI-enabled at this time because these drones cannot independently distinguish targets and still rely on human intelligence.[17] Russian forces first began using drones with machine vision when introducing the Lancet-3 UAV and loitering munitions in mid to late 2023.[18] Ukraine’s Digital Transformation Minister Mykhailo Fedorov announced in February 2024 that Ukraine’s efforts to create AI-powered drones and noted that Ukraine would soon create an analogue to the Lancet-3 drones with machine vision.[19] Ukrainian forces demonstrated drones with machine vision capabilities in March 2024.[20] Russia continues efforts to scale up its development of drones with machine vision. Russian developers announced in mid-May 2025 the start of serial production of the Tyuvik light attack drones, which are drones equipped with target-homing systems and resistant to EW interference.[21] Russian developers first presented and tested these drones in June 2024.[22] Russian developers describe Tyuvik drones as capable of autonomously striking targets after Russian drone operators determine the targets during the terminal phase of the drone strike planning.[23] Tyuvik drones have autopilot capabilities that do not require satellite navigation or communications with the pilot in environments with EW interference. Russian drone experts claimed that Tyuvik autopilot capabilities rely on pre-loaded map data and image recognition. Ukrainian military officials also observed Russia’s increased use of unspecified drones with AI capabilities in May 2025, possibly referring to Russia’s growing number of drones with machine vision and some AI capabilities.[24] Russia and Ukraine both encountered challenges in developing and applying drones with machine learning capabilities to the frontlines in Ukraine in 2024 and early 2025, instead pivoting to scaling the use of fiber-optic drones.Russian Lancet-3 drones reportedly experienced glitches with their autonomous lock-on-target mode in late 2023 and early 2024.[25] Combat footage published in late January 2024 showed a Lancet-3 lock onto an armored vehicle, only to divert at the last minute and strike a debris pile.[26] Combat footage suggests that Lancet-3 drones were able to strike some artillery systems and rocket launchers, but did not demonstrate Lancet-3 drones going after camouflaged targets. Western experts notably questioned in February 2024 the Lancet-3’s actual automation levels and its ability to reliably recognize objects.[27] Russian developers simultaneously launched parallel development and production of fiber-optic drones, likely in hopes of gaining a technological advantage on the battlefield without needing to wait for machine vision technology to mature.[28] Fiber-optic drones are not a particularly sophisticated technological adaptation (wire-guided munitions are a decades-old phenomenon), but Russian forces were able to impose new battlefield dilemmas on Ukrainian forces starting mid-2024 because these drones were resistant to EW interference, enabled precision strikes on armored equipment, and were scalable due to their simplicity.[29] A CEO of a Ukrainian drone manufacturer stated in the Summer of 2024 that Ukrainian developers were unable to develop machine vision fast enough due to weak guidance algorithms.[30] The CEO also noted that Russian EW deployment along the frontline rather than near the target made it challenging to maintain connectivity with the drones upon launch. One Ukrainian drone manufacturer, who has been testing machine vision drones for almost two years, stated in May 2025 that the technology for these drones is still “raw” and works “mediocrely” on tactical drones used along the frontlines.[31] The developer noted that terminal guidance normally functions on fixed-wing drones that fly longer distances, but that Ukrainian forces struggle to bring quadcopters with machine vision within range of a Russian target on the battlefield. The developer added that these drones also have homing problems when following moving targets, and that first-person-view (FPV) drone cameras are unable to recognize targets at distances of 500 meters. A Ukrainian company commander stated that Ukrainian forces are currently focused on integrating fiber-optic drones on the battlefield.[32] Russia and Ukraine have demonstrated some integration of limited AI capabilities into drones as of May 2025, but mostly are fielding these capabilities and have not deployed them at scale on the battlefield.A Ukrainian electronic and radio warfare expert observed Russian forces fielding a swarm of six drones with different-colored wings for drone-to-drone recognition on May 18.[33] The Russian swarm drone reportedly carries a 3-kilogram warhead, has a range of up to 80 kilometers, inertial and satellite navigation systems, and heavily relies on foreign-made components.[34] The swarm drone reportedly has a high-resolution camera, a JETSON module for video recognition and processing, a laser rangefinder, and a high-speed hard drive exceeding 100 gigabytes in capacity.[35] One model of the Russian swarm drone has a gas engine, which increases the drone’s operational range to over 100 kilometers.[36] Russian forces have reportedly been launching 30 to 50 of these drones per day across multiple operational directions in test configurations of two to six drones. The drone reportedly relies on visual terrain navigation to fly towards a target; autonomously detects, classifies, and selects targets; and does not require an operator to authorize the final strike decision.[37] Ukrainian forces reportedly used a new AI-powered “mother drone” for the first time on the frontlines in late May. A Ukrainian startup first reported on May 26 that its GOGOL-M AI-powered mothership drone carried out its first autonomous missions during a trial against Russian targets.[38] The startup noted that the GOGOL-M mothership can deliver two FPV attack drones and launch a precision strike at a range of 300 kilometers. Fedorov announced on May 29 that Ukraine’s defense platform Brave1 created and battlefield-tested a new mothership drone that can autonomously identify, find, and strike targets with two FPV drones at a distance of up to 300 kilometers, including striking Russian aircraft, air defense systems, and critical infrastructure.[39] Fedorov stated that the mothership can return for additional usage if it operates at a distance of up to 100 kilometers and that the drone uses the “SmartPilot” system and cameras for visual-inertial navigation. The full effectiveness and autonomy of Russian and Ukrainian AI-powered mothership drones are unclear right now, given that both systems are currently undergoing battlefield testing. Russia’s further development of AI/ML drones is in part predicated on Russia’s ability to create a joint situational awareness and battlefield management system.Russia will need to develop an elaborate cloud-based system that can store and analyze frontline data obtained to systematically train its AI-powered drones to autonomously distinguish between targets, avoid friendly drones, and enable the Russian military to track Russian drone operations across the frontline. Ukrainian developers and forces have been evolving various situational awareness systems, such as Delta and Kropyva, that resemble the US Department of Defense (DoD) vision of Combined Joint All-Domain Command and Control (CJADC2) for many years.[40] Ukraine’s Delta system is an expansive cloud-based software that is designed to gather data, analyze it, provide comprehensive situational awareness, and support decision-making. Delta enables Ukrainian forces in all branches and command levels to coordinate intelligence from drones, satellites, stationary cameras, sensors, and frontline reconnaissance units.[41] The Delta team has integrated additional capabilities such as the Mission Control application (synchronization matrix), which Ukrainian drone operators use to avoid friendly fire and plan drone missions.[42] Delta has also integrated the Vezha external application.[43] Vezha is a battlefield video analysis system that comprises video streaming and collective video exploitation capabilities, enabling AI-assisted targeted acquisition and the dispatching of targets to strike units via the Monitor situational awareness module. Vezha uses the Avengers AI system for target acquisition. These data analytics capabilities and cloud-based data management can give Ukrainian forces an advantage in training AI/ML drones. Russia is actively trying to catch up to Ukraine’s innovations in the creation of a joint situational awareness and battlefield management system. Russian state media outletRBCreported on May 22 that Russia’s GLONASS satellite navigation system and the Russian state National Technological Initiative (NTI) Corporation developed a draft concept for creating a system called the “Digital Sky of Russia,” which would establish a single network and information technology system for Russian air, space, and related cyberspace systems.[44]RBCreported that the “Digital Sky of Russia” seeks to make interoperable currently unconnected air, space, and drone systems and disjointed regulatory frameworks into a single AI- and human-operated system for the transmission and processing of satellite and drone data. A GLONASS official toldRBCthat the new “Digital Sky of Russia” system proposes to create a Russian low-orbit satellite constellation, hybrid communication networks, a trusted information exchange environment, and to use artificial intelligence to develop secure communications with unmanned vehicles.RBCreported that Russian developers are planning to complete and submit the project proposal to Russia’s Ministry of Transport, Roscosmos (the Russian space corporation), the Ministry of Economic Development, and other agencies by July 16, 2025. Russia’s centralized approach to drone innovation and production may inhibit its efforts to pioneer the development of AI/ML drones.The Kremlin is actively trying to centralize control over volunteer-led companies and organizations that have pioneered much of Russia’s drone and AI innovations.[45] The Kremlin is increasingly investing in drone development companies and startups, reportedly allocating 243 billion rubles (three billion dollars) in investments to 407 companies specializing in aircraft production between 2023 and 2024. (The Kremlin, in comparison, plans to allocate 277 billion rubles ($3.1 billion) over six years for the development of nuclear energy.)[46] The Russian Ministry of Defense (MoD) previously established an unmanned systems training and production center at the base of the “Sudoplatov” Volunteer Battalion in occupied Donetsk Oblast in late 2023, which reportedly produced cheap and ineffective drones that were vulnerable to Ukrainian EW systems.[47] The Kremlin’s current centralization efforts may erode some of the Russian drone developers’ independence to pursue technological breakthroughs due to limitations imposed by Russian bureaucracy. The Kremlin is also establishing the state-controlled Center for AI Development that will build end-to-end operational coordination between government agencies, regions, and businesses, and provide analytical support for the government's high-priority AI objectives.[48] The center will be responsible for digitalizing and modernizing government systems, as Russia’s use of technology varies greatly at both the federal and regional levels. Deputy Prime Minister Dmitry Chernyshenko emphasized on May 15 the need for Russia to be at the forefront of the global AI development race and announced the intention of funding research programs to this end. The Kremlin will likely use this center to advance AI use for military purposes and for the development of AI/ML drones, but it is unclear if and how the Kremlin will integrate the volunteer AI developer community in Russia. The Kremlin has been restricting the operations of volunteer groups by preventing them from visiting the frontlines in Ukraine or imposing severe limitations on crowdfunding efforts, which may impact Russia’s organic drone and AI development.[49] A lack of investment and immediate combat needs, on the other hand, are impacting Ukraine’s development of AI/ML drones.Ukrainian President Volodymyr Zelensky stated in January 2025 that Ukraine needs additional investments from its partners to increase and improve Ukraine’s drone production.[50] An expert at the Wadhwani AI Center explained in May 2025 that Ukraine needs additional resources to continue innovating its AI/ML drones, as Ukraine’s AI capabilities come from the commercial sector, open source, and available technologies.[51] The expert noted that these AI capabilities are reaching their ”glass ceilings,” and that Ukraine’s AI development depends on the amount of investment and the Ukrainian government’s commitment. Ukraine also reportedly faces problems with limited development and production capacity, fragmented efforts to develop AI capabilities, resource competition within the government, and a lack of inter-government and military cooperation.[52] Ukraine also reportedly has a shortage of computing power and professionals with AI experience.[53] The Ukrainian government has a challenging task of sustaining the development of AI/ML drones in conditions of investment shortages, while simultaneously advancing other innovations to support immediate battlefield needs. The Ukrainian government, for example, is currently racing to catch up to Russian fiber-optic drone production.[54] Promises of an immediate AI/ML drone revolution are premature as of June 2025, given that both Russian and Ukrainian forces will need to allocate more time, testing, and investment to deploy these drones on the frontlines en masse.Russia and Ukraine will continue improving their ML and machine vision capabilities while training and testing AI capabilities. Russia and Ukraine will then need to tackle the issue of scaling the production of the new AI/ML drones that will require additional time and resources to facilitate. Russia and Ukraine may start to use some AI/ML drones to carry out specific tasks in the meantime, such as striking certain types of targets like armored equipment or aircraft, before learning to fully operate on the battlefield. AI/ML drones are also unlikely to fully replace the need for the mass of tactical FPV drones over the coming months because the latter are cheaper to produce and adapt to the current battlefield conditions at the current state of technology. [1] https://mwi.westpoint.edu/battlefield-drones-and-the-accelerating-autonomous-arms-race-in-ukraine/#:~:text=Both%20Ukraine%20and%20Russia%20are,reducing%20risks%20to%20human%20lives; https://www.nationaldefensemagazine.org/articles/2025/5/28/as-russia-ukraine-war-continues-so-does-drone-innovation;https://www.csis.org/analysis/ukraines-future-vision-and-current-capabilities-waging-ai-enabled-autonomous-warfare;https://www.nytimes.com/2024/07/02/technology/ukraine-war-ai-weapons.html [2] https://www.csis.org/analysis/ukraines-future-vision-and-current-capabilities-waging-ai-enabled-autonomous-warfare#:~:text=FPV%20drones%20supported%20the%20operation%20from%20the%20air%2C%20creating%20a%20coordinated%20multidomain%20assault. [3] https://www.csis.org/analysis/ukraines-future-vision-and-current-capabilities-waging-ai-enabled-autonomous-warfare#:~:text=FPV%20drones%20supported%20the%20operation%20from%20the%20air%2C%20creating%20a%20coordinated%20multidomain%20assault.; https://www.csis.org/analysis/understanding-military-ai-ecosystem-ukraine; https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/;https://www.nationaldefensemagazine.org/articles/2025/5/28/as-russia-ukraine-war-continues-so-does-drone-innovation [4] https://breakingdefense.com/2024/03/the-difference-between-artificial-intelligence-and-machine-learning-and-why-it-matters/; https://www.csis.org/analysis/russia-ukraine-drone-war-innovation-frontlines-and-beyond; https://www.flyeye dot io/drone-acronym-ml/#:~:text=Relevance%20to%20the%20Industry.%20ML%20dramatically%20improves,speed%20up%20decision%2Dmaking%2C%20and%20minimize%20human%20error. [5] https://www.flyeye.io/drone-acronym-ml/#:~:text=Relevance%20to%20the%20Industry.%20ML%20dramatically%20improves,speed%20up%20decision%2Dmaking%2C%20and%20minimize%20human%20error.; https://www.unian dot ua/weapons/drakon-palyanicya-i-kerovana-aviabomba-top-10-golovnih-novinok-ukrajinskogo-vpk-12762267.html; https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/; https://swiftengineering dot com/machine-learning-techniques-can-help-enable-intelligent-autopilot-for-enhanced-uav-navigation-and-flight-safety/#:~:text=Machine%20learning%20(ML)%20algorithms%20enable,data%20processing%20and%20decision%2Dmaking; https://www.intechopen dot com/journals/1/articles/557; https://www.unmannedsystemstechnology dot com/expo/machine-learning/#:~:text=Unmanned%20Applications,turbines%2C%20power%20lines%20and%20infrastructure.; https://seclgroup dot com/adding-ai-and-ml-to-military-drones-for-target-recognition/; [6] https://www.forbes.com/sites/davidhambling/2024/02/14/it-looks-like-russias-automated-killer-drones-did-not-work-as-planned/ [7] https://professionalprograms.mit.edu/blog/technology/machine-learning-vs-artificial-intelligence/; https://www.flyeye dot io/ai-algorithms-for-drones/; https://www.flyeye dot io/drone-acronym-ml/#:~:text=Relevance%20to%20the%20Industry.%20ML%20dramatically%20improves,speed%20up%20decision%2Dmaking%2C%20and%20minimize%20human%20error. [8] https://professionalprograms.mit.edu/blog/technology/machine-learning-vs-artificial-intelligence/; https://www.flyeye.io/ai-algorithms-for-drones/ [9] https://www.flyeye dot io/ai-algorithms-for-drones/ [10] https://www.flyeye dot io/ai-algorithms-for-drones/ [11] https://www.flyeye dot io/ai-algorithms-for-drones/ [12] https://www.researchgate.net/publication/391544112_Drones_Equipped_With_Computer_Vision_CV_and_Machine_Learning_ML_Will_Be_at_the_Forefront_of_Many_Industry_Breakthroughs [13] https://www.flyeye dot io/ai-algorithms-for-drones/; https://www.csis.org/analysis/ukraines-future-vision-and-current-capabilities-waging-ai-enabled-autonomous-warfare; https://www.unmannedsystemstechnology dot com/expo/artificial-intelligence-components/; https://www.flyeye dot io/drone-technology-autonomy-ai/#:~:text=Drones%20equipped%20with%20AI%20can,anomalies%2C%20or%20areas%20of%20concern. [14] https://www.unian dot ua/weapons/drakon-palyanicya-i-kerovana-aviabomba-top-10-golovnih-novinok-ukrajinskogo-vpk-12762267.html; https://www.pravda dot com.ua/eng/articles/2025/01/13/7493257/ [15] https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/ [16] https://www.unian dot ua/weapons/drakon-palyanicya-i-kerovana-aviabomba-top-10-golovnih-novinok-ukrajinskogo-vpk-12762267.html; https://www.pravda dot com.ua/eng/articles/2025/01/13/7493257/; https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/ [17] https://www.unian dot ua/weapons/drakon-palyanicya-i-kerovana-aviabomba-top-10-golovnih-novinok-ukrajinskogo-vpk-12762267.html [18] https://defence-blog.com/ukraine-raises-concerns-over-ai-powered-lancet-drone/; https://defence-ua dot com/weapon_and_tech/scho_tse_za_rosijski_lantseti_zi_shtuchnim_intelektom_scho_vidomo_pro_izdelie_53-13314.html?fbclid=IwAR1ZHrUnQp3E3dejQ38cBXYOoQky19UlLP4LeyBE-2y1WzGKSwvxjyVGa2M; https://isis-online.org/isis-reports/detail/russian-lancet-3-kamikaze-drone-filled-with-foreign-parts#:~:text=The%20Lancet%2D3%20has%20AI%20analytical%20and%20image,produced%20by%20the%20American%20company%20NVIDIA%20and; https://glavcom dot ua/techno/devices/ukrajina-rozrobljaje-droni-zi-shtuchnim-intelektom-985037.html [19] https://glavcom dot ua/techno/devices/ukrajina-rozrobljaje-droni-zi-shtuchnim-intelektom-985037.html [20] https://newsletter dot counteroffensive.pro/p/how-ukraine-integrates-machine-vision-in-battlefield-drones; https://www.unian dot ua/weapons/drakon-palyanicya-i-kerovana-aviabomba-top-10-golovnih-novinok-ukrajinskogo-vpk-12762267.html; https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/ [21] https://iz dot ru/1885565/bogdan-stepovoi/vam-buket-zapuseno-proizvodstvo-mini-versii-legendarnyh-geranei [22] https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-june-3-2024; https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-june-6-2024 [23] https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-june-6-2024; https://www.understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-21-2025; https://iz dot ru/1885565/bogdan-stepovoi/vam-buket-zapuseno-proizvodstvo-mini-versii-legendarnyh-geranei [24] https://www.understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-21-2025 [25] https://www.forbes.com/sites/davidhambling/2024/02/14/it-looks-like-russias-automated-killer-drones-did-not-work-as-planned/ [26] https://youtu.be/nohbKunfS3Y; https://vk.com/challenge.html?hash429=slT4r_Tq_5yNT4BwvhBcgcNC8ZzAmyBnT_L9yQ3suABhjzymTHkT11c8TWI5z4dXzpchK60nukjagd_qsmf85wyRx1awM51QAo0_lKuTxuA-Q0JXEWp_34DOXz6LjBnQ3ob1kjOh2DsqRzOv&sign=HzbrbQ6nWIH0IAV6sVN8wA&back=https%3A%2F%2Fvk.com%2Fmilinfolive%3Fw%3Dwall-123538639_4015603&origin=; https://www.forbes.com/sites/davidhambling/2024/02/14/it-looks-like-russias-automated-killer-drones-did-not-work-as-planned/ [27] https://www.forbes.com/sites/davidhambling/2024/02/14/it-looks-like-russias-automated-killer-drones-did-not-work-as-planned/ [28] https://www.pravda dot com.ua/eng/articles/2025/01/13/7493257/ [29] https://www.pravda dot com.ua/eng/articles/2025/01/13/7493257/; https://www.understandingwar.org/sites/default/files/Six%20Month%20Kursk%20Retrospective%20PDF.pdf [30] https://www.pravda dot com.ua/eng/articles/2025/01/13/7493257/ [31] https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/ [32] https://mezha dot media/oboronka/fpv-droni-z-mashinnim-zorom-301682/ [33] https://t.me/serhii_flash/5600; https://en.defence-u dot .com/weapon_and_tech/swarm_tactic_test_drive_or_why_russians_mark_their_attack_drones_wings_with_paint-14654.html; https://t.me/milinfolive/148667 [34] https://en.defence-ua dot com/weapon_and_tech/swarm_tactic_test_drive_or_why_russians_mark_their_attack_drones_wings_with_paint-14654.html [35] https://en.defence-ua dot com/analysis/russias_fully_autonomous_kamikaze_drone_now_has_100_km_range_a_bigger_threat_than_just_another_uav-14626.html [36] https://en.defence-ua dot com/weapon_and_tech/swarm_tactic_test_drive_or_why_russians_mark_their_attack_drones_wings_with_paint-14654.html; https://en.defence-ua dot com/analysis/russias_fully_autonomous_kamikaze_drone_now_has_100_km_range_a_bigger_threat_than_just_another_uav-14626.html; https://t.me/serhii_flash/5617 [37] https://en.defence-ua dot com/analysis/russias_fully_autonomous_kamikaze_drone_now_has_100_km_range_a_bigger_threat_than_just_another_uav-14626.html [38] https://www.forbes.com/sites/davidhambling/2025/05/26/ukraine-drone-carriers-launch-first-long-range-autonomous-strikes/ [39] https://t.me/zedigital/5825 [40] https://www.csis.org/analysis/does-ukraine-already-have-functional-cjadc2-technology [41] https://www.csis.org/analysis/does-ukraine-already-have-functional-cjadc2-technology [42] https://mil.in dot ua/en/news/ukrainian-uav-units-are-actively-mastering-the-mission-control-module/; https://www.csis.org/analysis/does-ukraine-already-have-functional-cjadc2-technology [43] https://www.csis.org/analysis/does-ukraine-already-have-functional-cjadc2-technology [44] https://www.understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-30-2025; https://www dot rbc dot ru/technology_and_media/22/05/2025/682d7c9e9a7947bc47395812 ; https://t.me/sotaproject/98157 [45] https://www.nationaldefensemagazine.org/articles/2025/5/28/as-russia-ukraine-war-continues-so-does-drone-innovation#:~:text=As%20for%20Ukraine%2C%20Kateryna%20Bondar,need%20more%20resources%2C%20she%20explained.; https://www.understandingwar.org/backgrounder/russian-efforts-centralize-drone-units-may-degrade-russian-drone-operations; https://jamestown.org/program/russia-capitalizes-on-development-of-artificial-intelligence-in-its-military-strategy/ [46] https://understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-21-2025 [47] https://www.understandingwar.org/backgrounder/russian-efforts-centralize-drone-units-may-degrade-russian-drone-operations [48] https://understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-21-2025;https://wwwdot kommersant.ru/doc/7712489 [49] https://understandingwar.org/backgrounder/russian-force-generation-and-technological-adaptations-update-may-30-2025; https://www.understandingwar.org/backgrounder/russian-efforts-centralize-drone-units-may-degrade-russian-drone-operations [50] https://www.facebook.com/watch/?v=486900110726226 [51] https://www.nationaldefensemagazine.org/articles/2025/5/28/as-russia-ukraine-war-continues-so-does-drone-innovation#:~:text=As%20for%20Ukraine%2C%20Kateryna%20Bondar,need%20more%20resources%2C%20she%20explained. [52] https://www.csis.org/analysis/understanding-military-ai-ecosystem-ukraine [53] https://www.csis.org/analysis/understanding-military-ai-ecosystem-ukraine [54] https://kyivindependent dot com/as-russias-fiber-optic-drones-flood-the-battlefield-ukraine-is-racing-to-catch-up/ **Tags**"}