{"id": 1861, "name": "American Enterprise Institute", "domain": "aei.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.aei.org/research-products/report/depoliticizing-the-university-re-prioritizing-academic-excellence-in-accreditation-and-faculty-governance/", "title": "Depoliticizing The University Re Prioritizing Academic Excellence In Accreditation And Faculty Governance", "content": "AboutAbout AEICareersInternshipsFor StudentsAEI Archive About AEI Careers Internships For Students AEI Archive About AEI Careers Internships For Students AEI Archive CentersAEI Housing CenterSurvey Center on American LifeCenter on Opportunity and Social MobilityCenter for Technology, Science, and EnergyAgricultural Policy StudiesOpen Source Policy CenterCritical Threats AEI Housing Center Survey Center on American Life Center on Opportunity and Social Mobility Center for Technology, Science, and Energy Agricultural Policy Studies Open Source Policy Center Critical Threats AEI Housing Center Survey Center on American Life Center on Opportunity and Social Mobility Center for Technology, Science, and Energy Agricultural Policy Studies Open Source Policy Center Critical Threats Press President's Page National Affairs Scholars Policy AreasEconomicsForeign and Defense PolicySociety and CultureHealth CarePolitics and Public OpinionOpportunity & Social MobilityEducationLegal and Constitutional StudiesTechnology and InnovationScience, Energy, and EnvironmentHousingAgricultural Policy Studies Economics Foreign and Defense Policy Society and Culture Health Care Politics and Public Opinion Opportunity & Social Mobility Education Legal and Constitutional Studies Technology and Innovation Science, Energy, and Environment Housing Agricultural Policy Studies Economics Foreign and Defense Policy Society and Culture Health Care Politics and Public Opinion Opportunity & Social Mobility Education Legal and Constitutional Studies Technology and Innovation Science, Energy, and Environment Housing Agricultural Policy Studies ProductsResearchArticles & Op-EdsBooksPodcastsMultimedia Research Articles & Op-Eds Books Podcasts Multimedia Research Articles & Op-Eds Books Podcasts Multimedia Events AEIdeas Subscribe Donate Scholars Policy AreasEconomicsForeign and Defense PolicySociety and CultureHealth CarePolitics and Public OpinionOpportunity & Social MobilityEducationTechnology and InnovationLegal and Constitutional Studies Economics Foreign and Defense Policy Society and Culture Health Care Politics and Public Opinion Opportunity & Social Mobility Education Technology and Innovation Legal and Constitutional Studies Economics Foreign and Defense Policy Society and Culture Health Care Politics and Public Opinion Opportunity & Social Mobility Education Technology and Innovation Legal and Constitutional Studies AboutCareers Careers Careers Press Room Events President's Message AEIdeas Subscribe Donate **Depoliticizing the University: Re-Prioritizing Academic Excellence in Accreditation and Faculty Governance** June 11, 2025 By Robert Manzer Key Points American higher education’s politicization demands an urgent response. As the member most responsible for academic quality in the higher education regulatory triad, accreditors should be at the forefront, helping universities confront this problem. Accreditation can most effectively address universities’ politicization by strengthening faculty governance. While many reformers are understandably tempted to replace faculty governance, a more likely successful long-term approach is to re-prioritize academic excellence in accreditation and hold faculty accountable for achieving it. A new competitive marketplace has inaugurated a vibrant period of accreditation reform. The most successful reform will remove the “continuous improvement” barrier and provide clear, well-designed standards and expectations that re-prioritize faculty’s essential responsibility for academic excellence. **Introduction** Whatever their political persuasion, most observers of American higher education now agree that the real or apparent politicization of universities has become a major problem.1Accreditors, the member most responsible for academic quality in the higher education regulatory triad, should be at the forefront, helping universities confront this problem. Unfortunately, over the past three decades, accreditors have paid little attention to politicization, and their current quality assurance model enjoys little confidence among universities and regulators. Fortunately, the accreditation world is anything but static, for the US Department of Education’s 2020 rules—which inaugurated a new competitive accreditation marketplace—have catalyzed a vibrant period of reform.2 Accreditation can most effectively address universities’ politicization by strengthening faculty governance. Faculty play a central role in shaping academic life, and their authority over curricula and standards is well established by tradition and regulation.3 However, most faculty are not adequately prepared for this responsibility. While PhD programs develop deep expertise in research and scholarship, they rarely equip faculty to oversee broader questions of academic quality. General education programs’ steady erosion over the past 50 years is one sign of this gap.4Rampant grade inflation5and campus life’s growing politicization are also consequences of weak academic governance. In this report, I propose an accreditation model designed to strengthen faculty governance by applying clear standards, guiding principles, and evidence-based best practices. These elements serve as constructive guardrails—tools that support and shape governance without undermining its core autonomy. The US constitutional system offers a helpful comparison, transforming the public’s limited capacity for self-government into a functional democratic framework through checks, balances, and structure.6Similarly, accreditors can help channel faculty governance into a more effective system for ensuring academic quality. Before introducing my proposed accreditation model, I explain why accreditors moved away from supporting faculty governance in the early 1990s. During that time, they adopted a consumer-protection framework that emphasized business processes and operational efficiency over academic substance. This shift, though well-intentioned, ultimately proved misguided. Restoring academic excellence as a core priority in accreditation will require reversing this turn and reaffirming faculty’s essential role in academic leadership. **Accreditation’s Decline: Two Masters** What sociologists have called the “academic revolution” of the mid-20th century brought a fundamental change to American higher education. During this period, the professoriat underwent professionalization, transforming faculty from generalist educators into discipline-based scholar-researchers.7This revolution elevated professors from tweedy amateurs to prized elites, and their new status shifted substantial power from boards of trustees and presidents to themselves.8 Accreditors reinforced this rebalancing of power by imposing a “shared governance” principle that called for faculty to participate in institutional governance, particularly in academics.9However, under the pressure of a new financial aid gatekeeping role that accreditors assumed shortly after the GI Bill, they ultimately undermined the faculty’s role in quality assurance.10The sad story of accreditation’s decline stems from the conflict between the two masters it came to serve: universities and the US Department of Education. Over 100 years ago, accreditors began with an original purpose of brand protection. Colleges and univer­sities formed accreditors to differentiate themselves from diploma mills. This involved establishing criteria or standards that identified the components of a legitimate higher education institution. Accreditors were—and still are—bodies for declaring what a university is.11 Unfortunately, mission creep catalyzed accreditation’s decline. Shortly after the federal government first made federal financial aid available, it made accreditors the gateway to this aid. At the time, accreditors were a convenient vehicle for ensuring that federal dollars did not flow to fraudulent institutions, and relying on them meant not having to create a federal bureaucracy. Initially, this solution seemed to work fine. Even the Great Society’s massive expansion of federal student aid did not seem to cause a problem.12 Yet accreditors’ day of reckoning came when students stopped paying back their loans en masse in the 1980s. Congress and government officials quickly blamed accreditors for this calamity. In the politicians’ eyes, accreditors had failed in their mission to protect student borrowers. This was a critical moment for accreditors, with their role being more narrowly defined than it had previously been. It locked in the view that accreditors and institutions were responsible for students’ failure and wasted federal dollars while excusing students and politicians, who had made student aid so readily available.13 Accreditors then made a catastrophic mistake: They sought to reassure politicians and the Department of Education by adopting a faddish version of business quality assurance to guide their institution evaluations. Moving forward, they declared that good schools would be distinguished from bad ones according to whether their data-driven, transparent business processes helped them achieve “continuous improvement.” Embracing the spirit and authority—if not the rigor—of W. Edwards Deming’s total quality management and the Malcolm Baldrige National Quality Award, the accreditors conditioned access to federal student aid based on how well institutions demonstrated these good business processes.14 But accreditors weren’t good at this work, and colleges and universities were even less so. Nearly all faculty balked at an approach that reduced academic quality to good business processes, and accred­itors never succeeded in putting any teeth into this approach.15Accreditors rarely failed schools, and outside observers—including Congress and Department of Education officials—were not impressed by the new business facade. Pressure mounted on accreditors to create something better as the student debt crises continued unabated.16 By the late 2000s—during the Obama administration—accreditation was widely seen as a complete failure.17Most importantly, many viewed accreditors as having failed at the consumer-protection mission that the Department of Education had gradually assigned to them: assuring that students and the government got their money’s worth. In 2008, Council of Higher Education Accreditation President Judith S. Eaton conceded that such “accountability” was now the only thing that mattered and that accreditors were in danger of being subsumed by the department.18Their 60-year “partnership” with the Department of Education had brought accreditors to the brink. The department’s priority now trumped all else. To the extent that the concept of academic excellence survived, it was fast being redefined in terms of consumer protection. Academic excellence would soon equal good job outcomes, period. Eaton mused that accreditation itself might cease to exist by 2014.19 In such a state of wreckage, accreditors ceased to be much concerned with academic excellence, and schools quite reasonably came to regard maintaining access to federal financial aid as accreditation’s entire purpose. Certainly, they found little value in one-size-fits-all standards that merely established the hoops through which they had to jump. Such vacuity and the pursuit of political favor soon opened the door to the diversity, equity, and inclusion agenda, and accreditors began redirecting some of their standards toward it in the mid-2010s.20As a result, accreditors offered little, if any, resistance to universities’ politicization, which was quickly gaining speed. Accreditors failed to act as politicization on campus accelerated, further eroding trust in their role as stewards of academic quality.21 **A Better Alternative: Academic Excellence** Accreditors’ path back to sanity is to re-embrace the excellence of discipline-based faculty asthebasic building block of American colleges and universities. Academic excellence in the United States has traditionally built on faculty’s extraordinary achievements and their communicating these insights to the classroom and society. These achievements are what has made US higher education the envy of the world, and accreditors must re-prioritize the excellence that produced them. To do so, they must abandon the consumer-protection framework that emphasizes business processes and operational efficiency over academic substance. This framework has erected a barrier between accreditation and faculty that has diminished the faculty’s essential responsibility for academic excellence. Yet accreditors cannot be blind to the shortcomings of faculty governance, and they should establish standards, principles, and best practices to improve it. In this work, accreditors must begin by acknowledging the faculty’s culpability for the university’s current politicized state and the public’s growing disenchantment with higher education. Given their academic oversight, faculty are primarily responsible for the fact that higher education itself is now identified with censorship, self-censorship, groupthink, and hostility to opposing viewpoints. Faculty allowed the university’s very purpose to be politicized in many cases, and they did little to stop the spread of viewpoint exclusion across campus. They looked the other way when speakers were shouted down and ideological litmus tests were imposed in faculty hiring. If accreditors are going to get serious about depoliticizing higher education, as they should, they must constructively adapt the model of faculty governance in light of its recent failures. A first step accreditors should take to re-prioritize academic excellence is to return the responsibility for effective teaching to faculty by making them accountable for adopting and demonstratingbest practices.22To re-embrace academic excellence, accreditors must allow faculty the freedom to create true cultures of dynamic pedagogical improvement. These cultures should prioritize an attention to outcomes, but accreditors must stop shoehorning effective teaching into a reductionist “student learning outcomes” construct. Standards for teaching excellence should instead center on best practices, like those identified inWhat the Best College Teachers Do.23Used widely by professors, this book identifies best practices through hundreds of interviews with highly regarded college teachers and a review of leading research on teaching and learning. A similar best-practices orientation undergirds Quality Matters, the leading quality-assurance system used to certify quality online courses and programs.24The best path to making universities accountable for teaching effectiveness is combining an emphasis on best practices with a more nuanced approach to learning outcomes. A second step toward re-prioritizing academic excellence is to create standards incorporating the ideals that can guard against politicization. Here is an example: The university’s curriculum “emphasizes the importance of liberal education:introducing students to the pursuit of knowledge for its own sake and for the good it brings to self and society.”25(Emphasis in original.) Such a standard can act as a guardrail by compelling faculty to give an account of their curriculum. To give this account, faculty must examine and reflect collectively on their curriculum and how they teach it. The standard effectively holds a mirror up to them and what they do. It compels them to ask themselves questions like these: Does our curriculum present multiple perspectives in a way that encourages students to think through complex issues and problems in a balanced and informed manner? Does our curriculum contain courses in which students will encounter alternative views in a way that invites them to gain a deeper understanding of them? Do we employ professors who can teach alternative views respectfully and rigorously (i.e., in a way that grasps and presents their depth)? By requiring faculty to answer these questions, the standard challenges them to defend their adherence to the principle of liberal education.26 An important area in which faculty can demonstrate their adherence to this standard is how they treat West­ern civilization and American society. Foundational ideas like liberal democracy, free enterprise, constitu­tionalism, and modern science shape the world in which students live and underlie many, if not most, contemporary social justice debates. Thus, it is critical that these ideas gain a fair hearing in the curriculum and classroom. The goal is not to turn students into champions of Western civilization or American exceptionalism but to equip them with a basic, impartial understanding of the strengths and weaknesses of both.27With this goal, a liberal education standard can create a fence against politicization in this vital area of the curriculum and across campus as a whole. Fortunately, not all accreditors need to adopt new liberal education standards to establish guardrails against politicization. The Department of Education’s 2020 rules created a national marketplace of accreditors by ending the six “regional” accreditors’ monopoly over their respective regions. This revolutionary change introducedchoiceinto accreditation for the first time. And the department sought to give institutions more choice by making it easier for new accreditors to form.28 Presumably, as this new marketplace takes shape, institutions will be able to choose an accreditor whose standards best suit their understanding of institutional excellence. The existence of even one accreditor with a liberal education standard will offer institutions the opportunity to define themselves against institutional politicization. Institutions and their boards of trustees will be free to choose this option. Those who don’t will risk defining themselves—by association and their choice of accreditor—as prioritizing political activism over academic excellence. **Conclusion: Restoring and Trusting the Triad** My key argument throughout this report is that, rather than trying to replace faculty governance, accreditors should focus on strengthening it by setting clear, well-designed standards and expectations. Supporting—not supplanting—faculty is essential to restoring academic excellence. Achieving that goal also means rebalancing higher education’s regulatory structure. We need to return to a true partnership among the three main players: the Department of Education, state governments, and accreditors. Each has a distinct role. The Department of Education is responsible for overseeing federal financial aid and enforcing civil rights protections. States manage and regulate public institutions to meet local needs. Accreditors, in turn, should focus on maintaining high academic standards. For this system to work, each part of the triad must be respected and allowed to prioritize its core mission—especially the accreditor’s role in safeguarding academic quality. Unfortunately, for the past 30 years—since the first student debt crisis—the Department of Education’s priority has grown at the expense of accreditors’ and state governments’. When politicians complained that accreditors weren’t doing their job in the early 1990s because students were defaulting on federal student loans, accreditors considered opting out of their relationship with the Department of Education.29But they didn’t, and accreditors ultimately sacrificed their priority—academic excellence—for the department’s—making sure students and the government got their money’s worth. And as the federal government as a whole gradually assumed a broader mandate for consumer protection over the next 30 years, the die was cast. The triad is now out of balance. The Department of Education acts increasingly like a Ministry of Education that is typical in a centrally administered democracy (France) or a nondemocratic state (Russia).30 To rebalance the triad, the department must allow accreditors to re-prioritize academic excellence, or accreditors must abandon their connection with the department and their federal role. The biggest obstacle to the former alternative is the view that unless accreditors are engaged in consumer protection, colleges and universities will not be accountable to consumers. It is hard not to sympathize with this view; there are many bad institutions.31Yet we must acknowledge that accreditors’ track record in protecting consumers is abysmal. Accreditors have rarely flunked institutions and almost never done so on grounds of poor academic quality. Instead of continuing to ask accreditors to improve in this regard, we should recognize that they are poorly suited to it. Thirty years of failure is a solid basis for reaching this conclusion.32 A better approach is to restore the triad and trust it to balance its priorities, including between academic excellence and consumer protection. Admittedly, this strategy may seem premature or unwise right now. It depends on the still-unproven potential of the nascent accreditation marketplace to create better options for institutions. Similarly, arguing for improving faculty governance at the nadir of university politicization may seem inopportune, if not naive or bizarre. Yet academic excellence matters, and at least one member of the triad should prioritize it. Surely they can strike a balance between academic excellence and consumer protection that does not reduce the former to the latter. Happily, the new accreditation marketplace appears to favor academic excellence in supporting accreditors focused on distinctive institutional types, such as those focused on economic outcomes and research universities.33Liberated from the one-size-fits-all orientation of legacy accreditors, these accreditors can concentrate on guiding faculty toward achieving each type of institution’s particular excellence. The stakes are high. Recovering academic excellence’s priority can be a powerful method of depoliticiz­ing American higher education and erecting guardrails against future politicization. With this commitment, higher education’s energizing contributions to our society—and, indeed, the world—will not simply fade into past glory. **About the Author** Robert Manzerserves as president of the American Academy for Liberal Education. Previously, he cofounded and served as chief academic officer of Acadeum. He has also served as vice president for academic affairs at St. Edward’s University, dean of arts and sciences at Ohio Northern University, dean of Nebraska Wesleyan University’s University College, and associate dean of the University of Dallas’s Constantine College. **Notes** For a comprehensive description of the politicization problem, see Roger Pielke Jr.’s recent five-part series: Roger Pielke Jr., “Politicization of the American University, Part 1: The Problem,”The Honest Broker,November 25, 2024, https:// rogerpielkejr.substack.com/p/politicization-of-the-american-university; Roger Pielke Jr., “Partisan Professors: Politicization of the American University, Part 2,”The Honest Broker, December 2, 2024, https://rogerpielkejr.substack.com/p/partisan-professors; Roger Pielke Jr., “How Universities Went off Track: Politicization of the American University, Part 3,”The Honest Broker, December 8, 2024, https://rogerpielkejr.substack.com/p/how-universities-went-off-track; Roger Pielke Jr., “How to Get Rid of a Tenured Professor: Politicization of the American University, Part 4,”The Honest Broker, December 16, 2024, https:// rogerpielkejr.substack.com/p/how-to-get-rid-of-a-tenured-professor; and Roger Pielke Jr., “Fixing Universities: Politicization of the American University, Part 5,”The Honest Broker, December 23, 2024, https://rogerpielkejr.substack.com/p/fixing-universities. Michael Brickman and Sean Doolan, “The Mission-Driven University Is Facing a Crisis. New Accreditors Are Here to Help.,”AEIdeas,June 20, 2024, https://www.aei.org/education/the-mission-driven-university-is-facing-a-crisis-new-accreditors-are-here-to-help/; and Beth Akers, “It’s Time for Radical Reform in Higher Education,”AEIdeas,August 29, 2024, https://www.aei.org/education/its-time-for-radical-reform-in-higher-education/. “Qualified, effective faculty members are essential to carry out the mission of the institution and to ensure the quality and integrity of its academic program. The tradition of shared governance within American higher education recognizes the importance of both faculty and administrative involvement in the approval of educational programs. Because student learning is central to the institution’s mission and educational degrees,the faculty has responsibility for directing the learning enterprise including overseeing and coordinating educational programs to ensure that each contains essential curricular components, has appropriate content and pedagogy, and maintains discipline currency.” (Emphasis added.) Southern Association of Colleges and Schools Commission on Colleges,The Principles of Accreditation: Foundations for Quality Enhancement, 2024 ed., December 2023, 17–18, https:// sacscoc.org/app/uploads/2024/01/2024PrinciplesOfAccreditation.pdf. The landmark study of the disintegration of general education is Stephen H. Balch and Rita Zürcher,The Dissolution of General Education: 1914–1993, National Association of Scholars, November 9, 1999, https://www.nas.org/reports/the-dissolution-of-general-education/full-report. See also Steven Mintz, “Gen Ed: Its Past, Present and Possible Future,”Inside Higher Ed, April 2, 2023, https://www.insidehighered.com/blogs/higher-ed-gamma/gen-ed-its-past-present-and-possible-future; Mark Bauerlein and Scott Yenor, “Professors Ruined Gen Ed. Florida Is Fixing It.,”Chronicle of Higher Education, December 16, 2024, 5–6, https://www.chronicle.com/article/professors-ruined-gen-ed-florida-is-fixing-it; Adam Kissel et al.,Slacking: A Guide to Ivy League Miseducation(Encounter Books, 2025); Niall Ferguson and Jacob Howland, “What the Freshman Class Needs to Read,”The Atlantic, August 24, 2024, https://archive.md/DBPMz; Scott Yenor, “Florida’s Much-Needed General-Education Reform,” James G. Martin Center for Academic Renewal, December 18, 2024, https://jamesgmartin.center/2024/12/floridas-much-needed-general-education-reform/; and Scott Yenor, “Florida’s Much-Needed Reform of Gen Ed,”Inside Higher Ed, October 30, 2024, https://www.insidehighered.com/opinion/views/2024/10/30/floridas-reform-gen-ed-very-much-necessary-opinion. Libby Nelson, “The Ivy League’s Crazy Grade Inflation, in One Chart,”Vox,September 10, 2014, https://www.vox.com/ xpress/2014/9/10/6132411/chart-grade-inflation-in-the-ivy-league-over-time; and Frederick M. Hess, “Elite Colleges Need to Offer Less Affirmative Action. And Insist on More Work,”Education Next,February 6, 2024, https://www.educationnext.org/ elite-colleges-need-to-offer-less-affirmation-and-insist-on-more-work/. Federalist, no. 1 (Alexander Hamilton), https://avalon.law.yale.edu/18th_century/fed01.asp;Federalist, no. 10 (James Madison), https://avalon.law.yale.edu/18th_century/fed10.asp;Federalist, no. 39 (James Madison), https://avalon.law.yale.edu/18th_ century/fed39.asp; andFederalist, no. 51 (James Madison), https://avalon.law.yale.edu/18th_century/fed51.asp. Christopher Jencks and David Reisman,The Academic Revolution(Routledge, 2002). Jencks and Reisman,The Academic Revolution, 16. The best introduction to the operational requirements and reality of “shared governance” is Mark G. Edelstein, “Academic Governance: The Art of Herding Cats,” inFirst Among Equals: The Role of the Chief Academic Officer, ed. James Martin and James E. Samels (Johns Hopkins University Press, 1997), 58–78. Paul L. Gaston,Higher Education Accreditation: How It’s Changing, Why It Must(Routledge, 2014), 21. Gaston,Higher Education Accreditation, 18–19, 28; and Stanley O. Ikenberry,Where Do We Take Accreditation?, Council for Higher Education Accreditation, January 27, 2009, 3, https://www.chea.org/sites/default/files/presentations/2009_AC_Where_ Do_We_Take_Accreditation_Ikenberry.pdf. Alexandra Hegji,An Overview of Accreditation of Higher Education in the United States, US Library of Congress, Congressional Research Service, October 16, 2020, 7–8, https://www.congress.gov/crs-product/R43826. Peter T. Ewell,U.S. Accreditation and the Future of Quality Assurance: A Tenth Anniversary Report from the Council for Higher Education Accreditation, Council for Higher Education Accreditation, 2008, 46, 81; and Ikenberry,Where Do We Take Accreditation?, 2. Ikenberry,Where Do We Take Accreditation?, 5; Gaston,Higher Education Accreditation, 22–25; Ewell,U.S. Accreditation and the Future of Quality Assurance, 76; and Robert Birnbaum,Management Fads in Higher Education: Where They Come from, What They Do, Why They Fail(Jossey-Bass, 2001), 91–113. Gayle Greene, “The Terrible Tedium of ‘Learning Outcomes,’”The Chronicle of Higher Education, January 4, 2023, https:// www.chronicle.com/article/the-terrible-tedium-of-learning-outcomes; Robert Manzer,The American University’s Path to Illiberalism, American Enterprise Institute, April 20, 2023, 4, https://www.aei.org/research-products/report/the-american-universitys-path-to-illiberalism/; and Linda Suskie,Five Dimensions of Quality: A Common Sense Guide to Accreditation and Accountability(Jossey-Bass, 2015), 157–58. Gaston,Higher Education Accreditation, 84–110; and Natalie Schwartz, “Education Department Presses Forward with Review of Accreditation and Distance Ed Rules,”Higher Ed Dive, November 28, 2023, https://www.highereddive.com/news/ education-department-regulations-negotiated-rulemaking/700928/. Gaston,Higher Education Accreditation, xiii. Judith S. Eaton, “The Future of Accreditation?,”Inside Higher Ed, March 23, 2008, https://www.insidehighered.com/views/2008/03/24/future-accreditation. Eaton, “The Future of Accreditation?”; and Katherine Knott, “U.S. Focused on Consumer Protection, Accountability in Rules Overhaul,”Insider Higher Ed, January 5, 2024, https://www.insidehighered.com/news/government/student-aid-policy/2024/01/05/education-dept-focuses-consumer-protection-rule. Robert Manzer,Accreditation at the Crossroads: Threats and Opportunities for Christian Colleges and Universities, Center for Academic Faithfulness & Flourishing, April 5, 2024, https://americanreformer.org/2024/04/accreditation-at-the-crossroads/. Robert Manzer, “Why Don’t Accreditors Care About Campus Illiberalism?,”Washington Examiner, June 13, 2023, https:// www.washingtonexaminer.com/opinion/beltway-confidential/2741705/why-dont-accreditors-care-about-campus-illiberalism/. Manzer,The American University’s Path to Illiberalism, 4. Ken Bain,What the Best College Teachers Do(Harvard University Press, 2004). I am indebted to Kim Shankman, longtime dean at Benedictine College, for directing me to this outstanding resource on teaching excellence. Quality Matters, “Specific Review Standards from the QM Higher Education Rubric,” 7th ed., 2023, https://www. qualitymatters.org/sites/default/files/PDFs/StandardsfromtheQMHigherEducationRubric.pdf. This liberal education curriculum standard modifies the mission and curriculum program accreditation standards of the American Academy for Liberal Education (AALE). American Academy for Liberal Education,Program Standards of Excellence in Liberal Education, January 2017, 5, https://www.aale.org/wp-content/uploads/2020/03/Program-Stds.Oct-2013.Nov-2017.pdf. AALE has used liberal education standards to promote faculty and institutional self-reflection since 1996, and its successful work supporting liberal education general-education programs in Middle Eastern universities is particularly noteworthy. Over its 30 years of operation, AALE has developed a core competency in helping institutions overcome entrenched ideological zeal and authoritarian orthodoxies. Paul O. Carrese, “Restoring a Higher Civics in America’s Universities,”Law & Liberty, September 30, 2024, https:// lawliberty.org/forum/restoring-a-higher-civics-in-americas-universities/. Michael Brickman,The State of Federal Accreditation Regulations and Guidance: Recent Reforms and New Opportunities, Defense of Freedom Institute, March 7, 2023, 5–12, https://www.aei.org/research-products/report/the-state-of-federal-accreditation-regulations-and-guidance/. Gaston,Higher Education Accreditation, 24. Eaton, “The Future of Accreditation?” Beth Akers,A Conservative Vision for Higher Education Reform, American Enterprise Institute, February 24, 2025, https:// www.aei.org/research-products/report/a-conservative-vision-for-higher-education-reform/. Stig Leschly and Yazmin Guzmin,Oversight of Academic Quality and Student Outcomes by Accreditors of US Higher Education: Evidence from the Database of Accredited Postsecondary Institutions and Programs, Postsecondary Commission, March 1, 2022, https://postsecondarycommission.org/report-on-oversight-of-college-academic-quality-by-higher-education-accreditors/. The two new accreditors being created are the Postsecondary Commission and the National Association for Academic Excellence. See Postsecondary Commission, website, https://postsecondarycommission.org/; and National Association for Academic Excellence, website, https://naaeinc.org/. **About** About AEI Organization and Purpose Leadership Annual Report AEI Archive **Scholars** Agricultural Policy Studies Center for Technology, Science, and Energy Economics Education Foreign and Defense Policy Health Care Housing Legal and Constitutional Opportunity and Social Mobility Politics and Public Opinion Society and Culture **Policy Areas** Economics Foreign and Defense Policy Health Care Education Politics and Public Opinion Opportunity & Social Mobility Society and Culture Technology and Innovation Legal and Constitutional Studies **Contact** American Enterprise Institute1789 Massachusetts Avenue,NW Washington, DC 20036 Main telephone:202.862.5800 Main fax:202.862.7177"}