{"id": 749, "name": "KGUN - Tucson News", "domain": "kgun9.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.kgun9.com/news/community-inspired-journalism/sahuarita-and-green-valley-news/new-green-valley-treatment-center-expands-mental-health-and-addiction-support-in-rural-arizona", "title": "New Green Valley Treatment Center Expands Mental Health And Addiction Support In Rural Arizona", "content": "Menu About KGUN 9Contact KGUN 9Submit News TipsYou Ask. We Investigate.®Article Edits and Removal RequestsMug Shot PolicySensitive Footage PolicySupport Contact KGUN 9 Submit News Tips You Ask. We Investigate.® Article Edits and Removal Requests Mug Shot Policy Sensitive Footage Policy Support Contact KGUN 9 Submit News Tips You Ask. We Investigate.® Article Edits and Removal Requests Mug Shot Policy Sensitive Footage Policy Support Advertise With Us My Vote: Live Poll Question Submit your photos and videos Community Inspired Journalism 9 News Navigator NewsLocal NewsMidtown & Downtown NewsNorthside NewsEastside NewsSoutheast Side NewsSouthside NewsWestside NewsMarana NewsOro Valley NewsCatalina Foothills NewsSahuarita and Green Valley NewsCochise CountyStatewide NewsNational NewsTanque Verde HS Student View Local News Midtown & Downtown News Northside News Eastside News Southeast Side News Southside News Westside News Marana News Oro Valley News Catalina Foothills News Sahuarita and Green Valley News Cochise County Statewide News National News Tanque Verde HS Student View Local News Midtown & Downtown News Northside News Eastside News Southeast Side News Southside News Westside News Marana News Oro Valley News Catalina Foothills News Sahuarita and Green Valley News Cochise County Statewide News National News Tanque Verde HS Student View Scripps News Traffic WeatherHourly Forecast7 DayRadar MapsMonsoonWildfire WatchAZ DroughtSevere Weather AlertsNeighborhood Network Camera Hourly Forecast 7 Day Radar Maps Monsoon Wildfire Watch AZ Drought Severe Weather Alerts Neighborhood Network Camera Hourly Forecast 7 Day Radar Maps Monsoon Wildfire Watch AZ Drought Severe Weather Alerts Neighborhood Network Camera SportsThe Huddle The Huddle The Huddle Absolutely Arizona Border Watch Teacher of the Year Awards Spirit of Southern Arizona The Giving Project Things to Do Operation Safe Roads Photo Galleries VideoLive VideoKGUN 9 on RokuKGUN 9 on Amazon Fire TVKGUN 9 on YouTube Live Video KGUN 9 on Roku KGUN 9 on Amazon Fire TV KGUN 9 on YouTube Live Video KGUN 9 on Roku KGUN 9 on Amazon Fire TV KGUN 9 on YouTube Meet the KGUN 9 Team Contests TV Listings The Morning BlendBe on the ShowOur HostsHomeProsFacebookTwitterInstagramContestsMorning Blend Newsletters Be on the Show Our Hosts HomePros Facebook Twitter Instagram Contests Morning Blend Newsletters Be on the Show Our Hosts HomePros Facebook Twitter Instagram Contests Morning Blend Newsletters Arizona 58 Sign In Newsletters Sign Out Manage Emails Apps Careers Search Sahuarita and Green Valley News Westside News Midtown & Downtown News Southside News Northside News Eastside News Cochise County News Oro Valley News Marana News Catalina Foothills News Southeast Side News Vail News City of South Tucson News **Actions** Facebook Tweet Email **New Green Valley center expands mental health, addiction care in rural Arizona** GREEN VALLEY, Ariz. (KGUN) — Arizona ranks48th in the nation for access to mental health care, according to a report by Mental Health America. In response to this critical shortage, a new facility in Green Valley is working to expand access to mental health and substance abuse treatment in rural Southern Arizona. TheHaven Detox Arizonaopened its doors earlier this year, aiming to bridge a long-standing gap in behavioral health care for rural communities. “Tucson has great resources,” said Felicia Dadamio, Director of Business Development at the Haven. “But in these rural pockets and in these rural counties, where are they going and where are they getting help?” The facility offers a wide range of services, including detox programs, inpatient mental health care, and evidence-based therapies such as dialectical behavioral therapy (DBT), cognitive behavioral therapy (CBT), and trauma-focused therapy. The Haven also integrates holistic wellness options like yoga, meditation, group cooking classes andGeneSight testing, a form of genetic testing that helps identify which medications may be most effective for a patient. Crucially, the facility accepts the Arizona Health Care Cost Containment System (AHCCCS), along with tribal health programs like the American Indian Health Program (AIHP), Tribal ALTCS, and the Tribal Regional Behavioral Health Authority (TRBHA). This makes it one of the few treatment centers in the area accessible to many Medicaid and tribal health recipients. For Marcus Bia, now a lead behavioral technician at the Haven, finding a facility that accepted AHCCCS made all the difference. “I did ultimately try to do it on my own multiple times and I was unsuccessful every time,” Bia said. “I needed that sense of community. I needed that support.” Insurance was a barrier he struggled with for years. “It was hard finding resources that did accept my insurance,” Bia recalled. “Without places like this accepting AHCCCS, I would not be here. I truly believe that.” Today, Bia is part of the support system he once relied on. “It’s very important to me to kind of give that support out and give everyone the chance they deserve,” he said. Treatment programs at the Haven typically last 30 days, but recovery support doesn’t end there. The facility’s case managers help clients plan next steps in their recovery journey. An active alumni network provides ongoing peer support, care coordination, and access to recovery resources. “You’re finally able to learn how to process some of these emotions, to work through them,” Bia said. “It’s just how you handle them and how you go about coping with them.” To learn more about the Haven Detox Arizona, visit thecenter’s website. Additional resources to treat substance abuse and mental health issues include: Community Bridges, Inc.(Tucson and statewide) Crisis stabilization, residential treatment, and outpatient services. COPE Community Services(Tucson) Outpatient mental health and substance abuse programs, including integrated care. La Frontera Arizona(Tucson and Southern Arizona)Behavioral health services including crisis response, counseling and substance abuse treatment. CODAC Health, Recovery & Wellness(Tucson) Specializes in mental health, MAT (medication-assisted treatment), and addiction recovery services. Arizona 2-1-1(Statewide)A free helpline for connecting with health and human services, including mental health and addiction resources. Offered online or by dialing 2-1-1 Crisis Response Network (Southern Arizona) 24/7 crisis support for mental health and substance use emergencies. Call 1-866-495-6735 Suicide & Crisis Lifeline Call or text 988 — available 24/7 for anyone in emotional distress or suicidal crisis. ——Joel Fosteris a multimedia journalist at KGUN 9 who previously worked as an English teacher in both Boston and the Tucson area. Joel has experience working with web, print and video in the tech, finance, nonprofit and the public sectors. In his off-time, you might catch Joel taking part in Tucson's local comedy scene. Share your story ideas with Joel atjoel.foster@kgun9.com, or by connecting onFacebook,InstagramorX. Report a typo **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** **Find the stories in your neighborhood** **Find the stories in your neighborhood** News Weather Traffic You Ask. We Investigate.™ Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers KGUN FCC Public File KWBA FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact KGUN9OnYourSide kgun9/?hl=en KGUN9"}