{"id": 131, "name": "Bowling Green Daily News", "domain": "bgdailynews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://bgdailynews.com/2025/06/08/wku-regents-approve-tuition-hike-renewed-presidential-contract-and-a-new-housing-model-is-announced/", "title": "Wku Regents Approve Tuition Hike Renewed Presidential Contract And A New Housing Model Is Announced", "content": "Home Subscriptions Newsletter signup E-Edition Best of Bowling Green 2024 BG2050 News Opinion Obituaries SportsHigh School SportsWKU SportsHot RodsCommunity Sports High School Sports WKU Sports Hot Rods Community Sports High School Sports WKU Sports Hot Rods Community Sports Community Local Events Classifieds For the Record ServicesContact UsAbout Us Contact Us About Us Contact Us About Us Home SportsWKU SportsHigh School SportsCommunity SportsHot Rods WKU Sports High School Sports Community Sports Hot Rods WKU Sports High School Sports Community Sports Hot Rods News Obituaries Opinion Community Classifieds Best of BG E-Edition **WKU regents approve tuition hike, renewed presidential contract — and a new housing model is announced** Published 6:05 am Sunday, June 8, 2025 ByDavid Horowitz DAVID MAMARIL HOROWITZ david.horowitz@bgdailynews.com Friday’s Board of Regents meeting at Western Kentucky University authorized a tuition hike, presidential contract renewal and steps to comply with controversial state legislation — and, atop it all, featured a big announcement: A new model for student housing is coming to Western. This approach — in the works for months, but announced following the May closures of Normal and Regents halls — entails a three-phase plan for the initial work. WKU is coordinating on it alongside consultation firm Brailsford & Dunlavey and the Student Life Foundation, which owns campus residence halls. “A large challenge requires an seven bigger solution,” WKU President Tim Caboni said. “There have been longstanding conversations at this university about how we might transform residence life, and as difficult and challenging as these current circumstances are, we are going to use this as an opportunity to accelerate the conversations and focus on the future of housing at this university and how we will transform residential experience for our students during the next decade by thinking in a broader and more intentional and more exciting way … “We’re going to work together to explore what (…) new type of model might work best for WKU in terms of housing.” A key early step will be finding a national partner for these projects. WKU plans to release a request for bids in summer, with proposals due September; in fall 2025, there’ll be negotiations and predevelopment; and in winter and then spring 2026, design and preconstruction will commence. The first phase entails the renovation and mediation of the two recently shuttered halls over the next year or two, according to WKU. Phase one will also see the demolition of Hilltopper Hall and the clearing of Douglas Keen and/or Hugh Poland for Phase 2, according to B&D. In phase two, they’ll work on completing the first year village with up to 1,000 beds replacing those of Hugh Poland and Douglas Keen halls. This second phase also entails clearing McCormack, Rodes Harlin and Gilbert halls to make way for phase three. Finally, phase three for the sites of the latter three halls calls for up to 1,400 beds in an upper-class and sophomore village. “So, longer term, we will eliminate every community housing option on our campus so that students will select from hotel-style, suite-style, pod-style housing — a complete reimagining of the relationship between students, our living community and the academic life of our institution,” Caboni said. “We’re not just going to upgrade the housing, we’re going to do it in such a way that ensures we maintain affordability and our access mission.” Tuition hike and college fees WKU acquired unanimous approval for a 3.6% tuition increase for in-state residents, bringing its semester tuition to $6,036. The increase is based on first-time, first-year enrollment of 2,800, according to WKU. The approved tuition rate will go to the Council on Postsecondary Education, and WKU Executive Vice President for Strategy, Operations and Finance Susan Howarth said she doesn’t see it facing any problems. The budget also adds college fees of $15 to $20 per credit hour to replace WKU’s 500-plus individual course fees to simplify billing and more evenly spread costs, according to WKU. Terrance Brown, dean of the Potter College of Arts and Letters, said these additionally enable the provision of services and programs such as more tutoring and mock trial. “It’s a way that we sought to take and be able to create opportunities for students …,” WKU Provost Robert “Bud” Fischer added. Budget sustainability WKU’s new budget, approved unanimously, is WKU’s first in 20 years that is structurally balanced and does away with the practice known as carry-forward, which would use previous years’ money to help fund the budget and is “a terrible budget process,” Caboni said. “It may not be sexy, it may not get headlines in the newspaper, but what I’m going to tell you is (it’s) some of the most important work that’s happened at this university in the past generation,” he said. WKU is halfway through its budget realignment plan, which was intended to balance a $24 million structural imbalance in the budget over two years. This past year — year one — entailed a 7.5% permanent budget alignment target on the unit level that accounted for $13.5 million; the voluntary separation incentive program, which had 57 employees accept and accounted for $3.7 million by fiscal year 2026; and a $300,000 reduction to the transportation budget. Over the next year, the university intends to complete that plan via a vacant position credit that accounts for $4 million, a reduction in the fixed pension obligation that accounts for $1 million, a replacement of $750,00 in funding for physical plant critical needs with state asset preservation funds, and an 13% overhead charge to non-college revenue-generating units that covers $600,000; previously, the latter was a controversial 10% charge on revenue-generating units. Separately, the budget includes a 2% compensation pool for faculty and staff by Jan. 1. New contract for Caboni Caboni, whose four-year term as president ends this academic year, had his contract renewed with a base salary of $524,700 and the full typical 10% performance-based bonus. WKU Board of Regents Chair Currie Milliken pointed to the gains WKU has made in fiscal responsibility and record-high student retention and graduation rates. House Bill 4 and Viewpoint Neutrality The WKU board approved two items to comply with the controversial March-enacted Kentucky House Bill 4, which bans diversity, equity and inclusion initiatives at public higher-education institutions. One is a state-mandated viewpoint neutrality policy, which must promote “intellectual diversity and (prohibit) discrimination based on an individual’s political or social viewpoint,” according to the approval document. Another is a resolution affirming that the board has read or been advised to ensure WKU’s full compliance with the legislation. “We continue to take a look over the summer to see, are there any outliers, to make sure that what we do complies with the law, but we’ve really not found a lot of challenges for us as an institution,” Caboni said. “We continue to focus on every student in making sure every student is successful in meeting them where they are. “We’re going to continue to obviously protect academic freedom, and faculty will be able to teach in their classes what they want to teach, and there’s a diversity of perspectives and viewpoints that exist on this campus, and we’re going to continue to create space for those conversations to happen in our classes. Federal budget Regarding the proposed federal budget bill, Caboni told the media he’s concerned about the conversation around the Pell Grant and federal TRIO programs, which supply students direct support services. The current federal proposal would redefine full-time enrollment to require more credits per academic year, offer prorated awards to those with fewer units and reduce the lowest-income students’ grants, according to the nonprofit Brookings Institution. Caboni said he’ll visit with the Congressional delegation on Monday. “A third of our students are first-generation students, a third of our students, plus, are on Pell — so, any reduction in that federal investment in our students will be difficult for our undergraduates,” he said. “So, I’m going to talk with our delegation about that.” **You Might Like** **ICE detains local teen despite legal authorization to be in U.S.** **ICE detains local teen despite legal authorization to be in U.S.** **Five accused in BG drug conspiracy return to court** **Five accused in BG drug conspiracy return to court** **Bowling Green EV battery plant on track despite construction halt in SC** **Bowling Green EV battery plant on track despite construction halt in SC** **GPD: Man arrested after being tied up** **GPD: Man arrested after being tied up** News Obituaries Sports Opinion Community Newsletter signup e-Edition Subscriptions Classifieds About Us Contact Us"}