{"id": 268, "name": "Concealed Nation", "domain": "concealednation.org", "bias": "right", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://concealednation.org/2025/05/video-armed-witnesses-open-fire-after-driver-intentionally-hits-three-in-florida-driveway/#disqus_thread", "title": "Video Armed Witnesses Open Fire After Driver Intentionally Hits Three In Florida Driveway", "content": "Categories Beginners Product Reviews Women Guns Saving Lives News Follow Us Facebook YouTube X Instagram Threads RSS Feed Other Links Contact About Terms of Use **VIDEO: Armed Witnesses Open Fire After Driver Intentionally Hits Three in Florida Driveway** Posted By Brandon Curtis A 55-year-old man from Hialeah was arrested after allegedly driving into a group of people during an altercation in Fort Myers, injuring three. Witnesses fired in self-defense and managed to detain the suspect until law enforcement arrived. LISTEN TO THIS ARTICLE FORT MYERS, FL (2-minute read) —A disturbing incident in Fort Myers Sunday evening resulted in three people being injured and a suspect arrested, thanks to thecourageous intervention of bystanders. According to the Lee County Sheriff’s Office, a verbal dispute in the 2000 block of Maravilla Circle escalated dangerously when 55-year-old Eduardo Lando-Matamoro of Hialeah drove his vehicle into a crowd gathered in a driveway. **Quick-Thinking Witnesses Respond with Self-Defense** Authorities report that after Lando-Matamoro struck three individuals with his vehicle, two witnesses responded by drawing firearms and shooting the suspect in the shoulder. Despite being wounded, he attempted to flee the scene on foot. One witness, however, was able to physically restrain him until deputies arrived. Bodycam footage released by the sheriff’s office shows the suspect pinned in a headlock as deputies made the arrest. Lando-Matamoro was hospitalized due to his injuries and subsequently charged with three counts of aggravated battery with a deadly weapon. Lee County Sheriff Carmine Marceno commended the bystander’s bravery, stating, “Their quick actions made a real difference.” He emphasized the importance of community vigilance and praised his deputies for their swift response. While the situation ended with the suspect in custody, this incident raises crucial conversations about personal safety, community responsibility, and the lawful use of firearms in self-defense scenarios. Florida law permits the use of force, including deadly force, under the state’s “Stand Your Ground” statute when a person reasonably believes it’s necessary to prevent imminent harm. Such events also highlight the need for concealed carriers and armed citizens to have a thorough understanding of both their rights and responsibilities when choosing to intervene during a violent confrontation. Safety Tip:Always understand your state’s laws on self-defense and the justified use of deadly force. Situational awareness and proper training can be the difference between lawful protection and legal trouble. **Follow us on Social** Facebook YouTube X Instagram Threads RSS Feed We Are Responsible Carry **Related Articles** Texas Man Defends Against Armed Child Robbery Gang, Shoots 3 **Texas Man Defends Against Armed Child Robbery Gang, Shoots 3** **Texas Man Defends Against Armed Child Robbery Gang, Shoots 3** Non-Violent Offenders and Illegal Migrants Granted Gun Rights by Courts **Non-Violent Offenders and Illegal Migrants Granted Gun Rights by Courts** **Non-Violent Offenders and Illegal Migrants Granted Gun Rights by Courts** Victims Forced to Unlock Phones at Gunpoint in Chicago **Victims Forced to Unlock Phones at Gunpoint in Chicago** **Victims Forced to Unlock Phones at Gunpoint in Chicago** Father Returns Fire After Son Shot In Crossfire Between Two Other Parties **Father Returns Fire After Son Shot In Crossfire Between Two Other Parties** **Father Returns Fire After Son Shot In Crossfire Between Two Other Parties** **One response to “VIDEO: Armed Witnesses Open Fire After Driver Intentionally Hits Three in Florida Driveway”** VIDEO: Armed Witnesses Open Fire After Driver Intentionally Hits Three In Florida Driveway | – Freedom Is Just Another Word…May 31, 2025[…]https://concealednation.org/2025/05/video-armed-witnesses-open-fire-after-driver-intentionally-hits-&#8230; […]Reply […]https://concealednation.org/2025/05/video-armed-witnesses-open-fire-after-driver-intentionally-hits-&#8230; […] […]https://concealednation.org/2025/05/video-armed-witnesses-open-fire-after-driver-intentionally-hits-&#8230; […] **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. **Follow us on Social** Facebook YouTube X Instagram Threads RSS Feed We Are Responsible Carry **Recommended For You** Man Fatally Shot By Homeowner During Attempted Home Invasion **Man Fatally Shot By Homeowner During Attempted Home Invasion** **Man Fatally Shot By Homeowner During Attempted Home Invasion** Two Armed Robbers Walk Into A Grocery Store Filled With Armed Employees **Two Armed Robbers Walk Into A Grocery Store Filled With Armed Employees** **Two Armed Robbers Walk Into A Grocery Store Filled With Armed Employees** Car Accident Leads To 17-Year-Old Being Shot And Killed In Rochester, Concealed Carrier Charged With Murder **Car Accident Leads To 17-Year-Old Being Shot And Killed In Rochester, Concealed Carrier Charged With Murder** **Car Accident Leads To 17-Year-Old Being Shot And Killed In Rochester, Concealed Carrier Charged With Murder** Random Stabbings In Vegas Leave 1 Dead — Suspect Should Have Already Been In Jail **Random Stabbings In Vegas Leave 1 Dead — Suspect Should Have Already Been In Jail** **Random Stabbings In Vegas Leave 1 Dead — Suspect Should Have Already Been In Jail** Machete-Wielding Man Grazed By Homeowner’s .22LR Pistol, Amazed Homeowner Tried To Shoot Him — Still Doesn’t Understand Why His Bail Is So High **Machete-Wielding Man Grazed By Homeowner’s .22LR Pistol, Amazed Homeowner Tried To Shoot Him — Still Doesn’t Understand Why His Bail Is So High** **Machete-Wielding Man Grazed By Homeowner’s .22LR Pistol, Amazed Homeowner Tried To Shoot Him — Still Doesn’t Understand Why His Bail Is So High** Nebraska Supreme Court Interpretation Could Criminalize Non-CHP Holders’ Normal Behavior **Nebraska Supreme Court Interpretation Could Criminalize Non-CHP Holders’ Normal Behavior** **Nebraska Supreme Court Interpretation Could Criminalize Non-CHP Holders’ Normal Behavior** Gangland Shooting In Pittsburgh: At Least Five Dead And Multiple Injured **Gangland Shooting In Pittsburgh: At Least Five Dead And Multiple Injured** **Gangland Shooting In Pittsburgh: At Least Five Dead And Multiple Injured** [VIDEO] The Newest Scary Addition To The Holster Industry: The Handgun Sling™ **[VIDEO] The Newest Scary Addition To The Holster Industry: The Handgun Sling™** **[VIDEO] The Newest Scary Addition To The Holster Industry: The Handgun Sling™** A Tragic Death, And The Idiot Responsible **A Tragic Death, And The Idiot Responsible** **A Tragic Death, And The Idiot Responsible** Our favorite firearm channels on YouTube **Our favorite firearm channels on YouTube** **Our favorite firearm channels on YouTube** We Are Responsible Carry Facebook YouTube X Instagram Threads RSS Feed © 2024 Concealed Nation, LLC Contact About Terms of Use"}