{"id": 155, "name": "Bored Panda", "domain": "boredpanda.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.boredpanda.com/jojo-siwa-dropped-by-record-label-revealing-not-lesbian-admitting-relationship-with-chris-hughes/#post-comments", "title": "Jojo Siwa Dropped By Record Label Revealing Not Lesbian Admitting Relationship With Chris Hughes", "content": "No fees, cancel anytime Log In or Sign Up or Reset your password Enter your email address or username and we’ll send you a link to reset your password Check your inbox An email with a link to reset your password was sent to the email address associated with your account Provide email Please enter your email to complete registration Activate to continue Your account isn't active yet. We've emailed you an activation link. Please check your inbox and click the link to activate your account Premium Funny Shopping Relationships Animals Travel Comics Parenting More Funny Shopping Relationships Animals Travel Comics Parenting Other Art & Creativity Social Issues Community Entertainment Food Curiosities Home & Design Work & Money History Science & Technology Occasions Wholesome Health Pet Wellness Quotes Environment Facts Reviews Games Premium Contact About Us Jobs Advertise Privacy Policy Newsletter Get the AppGet the App Cookies Home Trending Latest Community Premium The Bored Panda iOS app is live!Fight boredom with iPhones and iPadshere. Home Partnership Advertise Success stories Jobs About us Contact **Join the Fun!** Join 1.2 million Panda readers who get the best art, memes, and fun stories every week! P.S. It's 100% free, unsubscribe anytime. **Thank you!** You're on the list! Expect to receive your first email very soon! **JoJo Siwa Dropped By Major Record Label After Revealing She’s Not Lesbian** 13 14 Link copied! Link copied! Share Share Link copied! Link copied! Share Share JoJo Siwa’s careerjust took a major turn. Less than a year aftersigning with Columbia Records, the powerhouse label behind stars like Beyoncé and Adele, the 22-year-old singer has beenquietly dropped. Her latest single,Bulletproof, was released independently, sources have confirmed. JoJo’s split with Columbia Records comes amid her new relationship with 32-year-old co-Celebrity Big Brothercontestant Chris Hughes. JoJo Siwa was dropped by Columbia Records less than a year after signing. She's now releasing music independently and searching for a new label in London. She found love with Chris Hughes on Celebrity Big Brother and says the bond is \"bulletproof.\" **Sources confirmed that JoJo has been dropped by Columbia, but she is not slowing down** Share icon Image credits:Chelsea Guglielmino / Getty Citing a source from the music industry, theDaily Mailreported that Jojo’s latest songBulletproofhad been released independently. Her songKarmawas her last work with Columbia. “JoJo has been dropped by Columbia Records. She self-released her latest songBulletproof, whereasKarmawas done with the label,” theDaily Mail‘s source stated. JoJowas once featured alongside the likes ofMiley Cyrusand Halle on Columbia’s official artist page, but she’s since been removed. Neither JoJo nor the label has issued a public comment on her departure. Share icon Image credits:itsjojosiwa Rather than slow down, JoJo headed to London, where she’s been playing gigs, hoping to sign a new record deal.“JoJo is an all-rounder, she’s a dancer, singer and performer, and being on stage is where she feels most at home,” theMail‘s source stated. Jojo has been very busy as of late. Recently, she performed at Colour Hoxton and even taught a dance class at the iconic Pineapple Dance Studios. She was also named a contestant on The Great Celebrity Bake Offfor Stand Up to Cancer.She has an 11-day tour booked for July in the United States as well, according to a report fromThe Sun. **JoJo found unexpected love onCelebrity Big Brother, but her ex says the split caused deep emotional pain** Share icon Image credits:chrishughesofficial While JoJo was chasing her musical dreams, she also found love at theCelebrity Big Brotherhouse. There, she metLove Islandalum Chris Hughes, and the pair quickly became close. While their blossoming relationship was sweet, JoJo was in a relationship at the time. Her former partner, Kath Ebbs, flew to the UK for the reality show’s finale, only to be broken up with at the wrap party. JoJo and Chris made things official soon after. Share icon Image credits:chrishughesofficial Kath later spoke out about the painful breakup, saying the aftermath was brutal and that it was “some of the darkest times mentally that I’ve had in my adult life.” The situation sparked strong reactions online, with some netizens calling JoJo’s actions towards Kath insensitive. Despite the drama,JoJo and Chrishave stayed together, spending time on both sides of the Atlantic and sharing glimpses of their new relationship on social media.JoJo has also shared that she plans to meet his family. **JoJo says Chris and the relationship they have formed make her feel grounded** Share icon Image credits:ITV During an interview onCapital Radio, JoJo opened up about her relationship with Chris, stating that everything has been “going lovely.” She also stated that she would be meeting his family in the Cotswolds. The singer described the connection with her “soulmate” in poetic terms, saying, “As hectic as life is, and as much as that noise goes on, I feel like Christopher and I discovered this beautiful house together.” OH MY GOD!! JOJO JUST SAID SHE’S NOT A LESBIAN AND BEING IN THE HOUSE HAS HELPED HER REALIZE THAT?! WOAH!! 🙊🙊#CBBLive#CBBUKpic.twitter.com/vaatBuSaBz — Siobhan 🇬🇬 (@slinehan1)April 22, 2025 “This house is earthquake-proof, and it’s fireproof and bulletproof. And you know, we discovered this house and found the keys, and we took the keys and locked ourselves in,” she said. **Even without Columbia Records, JoJo is still chasing her dreams of pop stardom** Share icon Image credits:itsjojosiwa JoJo has not given up on hermusic career,despite being dropped from Columbia. She continues to create and perform—this time on her own terms. In an interview withHits Radio, Jojo stated that she actually choreographed and directed the music video of her songBulletproof, her first work after her stint at Columbia Records. Share icon Image credits:itsjojosiwa When asked what her new music will be like, JoJo stated that her work will definitely be “more vulnerable” and “definitely more real.” “I want everything to be pulled from real moments in my life and how I feel. With the new stuff, I really want to figure out who I am in my core. I want to make music that’s still fun but has something real and substantial to it,” she said. **Netizens have shared polarizing reactions to JoJo’s departure from Columbia, with some calling the singer out over her relationship with Chris Hughes** Share icon Image credits:KarmaIsAFad Share icon Image credits:misafrano Share icon Image credits:SquirrelHotel Share icon Image credits:buffys Share icon Image credits:Voxilar Share icon Image credits:positionsmafiaa Share icon Image credits:ladidaix Share icon Image credits:itzDango Share icon Image credits:monuchomp Share icon Image credits:RobODonnell93 Share icon Image credits:JoneshaLut6650 Share icon Image credits:PalestinianBoii Share icon Image credits:bosdovja92 **** **** **Thanks! Check out the results:** **** **** **Subscribe to AccessExclusive Polls** By entering your email and clicking Subscribe, you're agreeing to let us send you customized marketing messages about us and our advertising partners. You are also agreeing to ourPrivacy Policy. Thank you! You've successfully subscribed to newsletters! Anyone can write on Bored Panda.Start writing! Follow Bored Panda onGoogle News! Follow us onFlipboard.com/@boredpanda! 13 14 14 13 14 Link copied! Link copied! Share Share Link copied! Link copied! Share Share **Renan Duarte** Author,BoredPanda staff This lazy panda forgot to write something about itself. **Renan Duarte** Author,BoredPanda staff This lazy panda forgot to write something about itself. **Peter Michael de Jesus** Writer,BoredPanda staff I've been doing straight hard news way too long. So bring on the soft news and evergreen topics! **Peter Michael de Jesus** Writer,BoredPanda staff I've been doing straight hard news way too long. So bring on the soft news and evergreen topics! Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport I am so confused by my fellow humans. She clearly is bi or possibly some other non sexual attraction. Why do we need to make a big deal out of her mistaking herself as a lesbian previously? None of this makes sense. People care way too much about meaningless things. Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport Is this heterophobia? BTW - Never take anything you see quoted in the Daily Mail seriously. They have produced some complete and utter rubbish over the years - and that's not uninformed bias, I do actually read their website. One example that sticks in my mind is a report of Jamie Murray, amongst others, \"sniffing\" tennis balls - when anyone who has ever actually seen a game of doubles knows that he was hiding his mouth from view when discussing tactics with his partner. Keep a very large pinch of salt on hand at all times. Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport Love bi erasure being done by people online. Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport I am so confused by my fellow humans. She clearly is bi or possibly some other non sexual attraction. Why do we need to make a big deal out of her mistaking herself as a lesbian previously? None of this makes sense. People care way too much about meaningless things. Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport Is this heterophobia? BTW - Never take anything you see quoted in the Daily Mail seriously. They have produced some complete and utter rubbish over the years - and that's not uninformed bias, I do actually read their website. One example that sticks in my mind is a report of Jamie Murray, amongst others, \"sniffing\" tennis balls - when anyone who has ever actually seen a game of doubles knows that he was hiding his mouth from view when discussing tactics with his partner. Keep a very large pinch of salt on hand at all times. Round attentionSvg Vector Icons : http://www.onlinewebfonts.com/iconReport Love bi erasure being done by people online. **People Applaud Keanu Reeves' Reaction To Being Straddled Live At The Tony Awards** **People Applaud Keanu Reeves' Reaction To Being Straddled Live At The Tony Awards** **You Can’t Fix Stupid, But You Can Watch It Try To Fix Others In These 50 Iconic Self-Owns (New Pics)** **You Can’t Fix Stupid, But You Can Watch It Try To Fix Others In These 50 Iconic Self-Owns (New Pics)** **Woman Shut Out Of SIL’s Holiday Plans For Years, Finally Cancels Visit To Take A Stand** **Woman Shut Out Of SIL’s Holiday Plans For Years, Finally Cancels Visit To Take A Stand** **Parents Of 19-Year-Old Who Passed Away After Trying 'Dusting’ Challenge Issue Urgent Warning** **Parents Of 19-Year-Old Who Passed Away After Trying 'Dusting’ Challenge Issue Urgent Warning** **50 Stories When People Ruined Their Cases By Acting In Dumb Ways** **50 Stories When People Ruined Their Cases By Acting In Dumb Ways** **Madeleine McCann Mystery Deepens After Cops Discover 'Clothing And Bones' In Dig Samples** **Madeleine McCann Mystery Deepens After Cops Discover 'Clothing And Bones' In Dig Samples** **50 Unfortunate Names That Could’ve Been Avoided With Just One More Minute Of Thought** **50 Unfortunate Names That Could’ve Been Avoided With Just One More Minute Of Thought** **“I Don’t Have Kids”: MIL Confesses Her Ulterior Motive After Calling CPS On DIL** **“I Don’t Have Kids”: MIL Confesses Her Ulterior Motive After Calling CPS On DIL** **If You Love Disney Movies, Now You Can Prove It: Name 25 Disney Characters Challenge** **If You Love Disney Movies, Now You Can Prove It: Name 25 Disney Characters Challenge** **50 Cool And Interesting Medical Facts You Might Not Know About Your Own Body And Health** **50 Cool And Interesting Medical Facts You Might Not Know About Your Own Body And Health** **Beginner Jiu-Jitsu Student Gets $56M After Black-Belt Instructor Leaves Him Paralyzed During Class** **Beginner Jiu-Jitsu Student Gets $56M After Black-Belt Instructor Leaves Him Paralyzed During Class** **50 ‘Cursed Images’ That Are Wrong On Every Level (New Pics)** **50 ‘Cursed Images’ That Are Wrong On Every Level (New Pics)** **Disturbing New Theory In Madeleine McCann's Disappearance Suggests She Was Run Over By Drunk Driver** **Disturbing New Theory In Madeleine McCann's Disappearance Suggests She Was Run Over By Drunk Driver** **Therapists Reveal The Stories That Quietly Broke Their “No Judgment” Rule** **Therapists Reveal The Stories That Quietly Broke Their “No Judgment” Rule** **50 Times Autopsy Doctors Uncovered Disturbing Truths About A Person's Death** **50 Times Autopsy Doctors Uncovered Disturbing Truths About A Person's Death** **Man Leaves Wife For Another Woman After 10 Years Of Marriage, Gets Mad At Her Reaction** **Man Leaves Wife For Another Woman After 10 Years Of Marriage, Gets Mad At Her Reaction** **Guy Messes Up Roommate’s Life, Gets His Life Messed Up 20 Years Later When They Meet Again** **Guy Messes Up Roommate’s Life, Gets His Life Messed Up 20 Years Later When They Meet Again** **‘What I Asked For Vs. What I Got’, Tattoo Edition: 40 Times Tattoo Artists Outdid Themselves** **‘What I Asked For Vs. What I Got’, Tattoo Edition: 40 Times Tattoo Artists Outdid Themselves** **50 Unhinged Tumblr Posts That Are Just The Right Kind Of Chaotic (New Pics)** **50 Unhinged Tumblr Posts That Are Just The Right Kind Of Chaotic (New Pics)** **“I Have (Almost) No Eye Colour”: 40 Fascinating And Wild Things That Can Happen To The Human Body (New Pics)** **“I Have (Almost) No Eye Colour”: 40 Fascinating And Wild Things That Can Happen To The Human Body (New Pics)** **50 Examples Of Men Doing Something So Dumb It Might Cost Them Their Life** **50 Examples Of Men Doing Something So Dumb It Might Cost Them Their Life** **The Internet Asked For Laughter, These 50 Funny Cat Pics Delivered On Tiny Paws** **The Internet Asked For Laughter, These 50 Funny Cat Pics Delivered On Tiny Paws** **“What In The Austin Powers?”: Netizens React To Testimony In Diddy Trial About Mike Myers** **“What In The Austin Powers?”: Netizens React To Testimony In Diddy Trial About Mike Myers** **50 Amazing Comparisons That Show What Everyday Things Looked Like Decades Ago** **50 Amazing Comparisons That Show What Everyday Things Looked Like Decades Ago** **40 Mind-Bending Then-And-Now Pictures Of Places That Prove Time Waits For No One** **40 Mind-Bending Then-And-Now Pictures Of Places That Prove Time Waits For No One** **Management Enforces Toxic Policy, Engineer Obeys Too Well, Company Watches Itself Collapse** **Management Enforces Toxic Policy, Engineer Obeys Too Well, Company Watches Itself Collapse** **50 People Are Sharing Memes That Hit Hard With Humor And Harsh Truths** **50 People Are Sharing Memes That Hit Hard With Humor And Harsh Truths** **Religious Couple Tricks Teen Out Of Pay — Her Family’s Clever Payback Leaves Them Speechless** **Religious Couple Tricks Teen Out Of Pay — Her Family’s Clever Payback Leaves Them Speechless** **30 Private Creepy Conversations People Weren’t Meant To Hear, But Now Can’t Unhear** **30 Private Creepy Conversations People Weren’t Meant To Hear, But Now Can’t Unhear** **Woman Who Dropped 84 Lbs On Mounjaro Reveals 10 Terrible Side Effects People Don't Talk About** **Woman Who Dropped 84 Lbs On Mounjaro Reveals 10 Terrible Side Effects People Don't Talk About** **Person Upgrades To Business Class To Escape Mid-Flight Babysitting, Vacation Turns Tense** **Person Upgrades To Business Class To Escape Mid-Flight Babysitting, Vacation Turns Tense** **50 People Who Delivered Comebacks So Brutally Genius, Even Their Enemies Laughed (New Pics)** **50 People Who Delivered Comebacks So Brutally Genius, Even Their Enemies Laughed (New Pics)** **Everyday Annoyances, Solved By People Smarter And Slightly More Petty Than You (New Pics)** **Everyday Annoyances, Solved By People Smarter And Slightly More Petty Than You (New Pics)** **50 Women Share The Unhinged Microfeminisms They Use To Support Women And Annoy Men** **50 Women Share The Unhinged Microfeminisms They Use To Support Women And Annoy Men** **Bosses Can’t Understand Why Sales Have Dropped, Workers Remind Them It’s Their Own Fault** **Bosses Can’t Understand Why Sales Have Dropped, Workers Remind Them It’s Their Own Fault** **50 Funny Dog Memes That Are A True Ray Of Sunshine On A Tiring Day** **50 Funny Dog Memes That Are A True Ray Of Sunshine On A Tiring Day** **Niece Publicly Mocks Aunt’s Child-Free Life, Is Shocked When Her College Fund Disappears** **Niece Publicly Mocks Aunt’s Child-Free Life, Is Shocked When Her College Fund Disappears** **“She Smells Really Bad”: Tennis Star Breaks Silence On Opponent Commenting On Her Odor Mid-Match** **“She Smells Really Bad”: Tennis Star Breaks Silence On Opponent Commenting On Her Odor Mid-Match** **“They Put Duct Tape On Blistered Skin”: 50 Times Doctors Saved Patients From Their DIY Treatments** **“They Put Duct Tape On Blistered Skin”: 50 Times Doctors Saved Patients From Their DIY Treatments** **“People Who Have Worked At Sea, What’s The Creepiest Thing That’s Happened?” (50 Answers)** **“People Who Have Worked At Sea, What’s The Creepiest Thing That’s Happened?” (50 Answers)** 2comments28 points 1comment22 points 2comments25 points 9replies20 points 2comments19 points 22replies21 points 1comment20 points 7comments35 points 4comments26 points 7comments24 points"}