{"id": 278, "name": "Cosmos Magazine", "domain": "cosmosmagazine.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://cosmosmagazine.com/news/common-street-trees-show-resilience-to-growing-heat-in-australia/", "title": "Common Street Trees Show Resilience To Growing Heat In Australia", "content": "LOG IN SIGN UP Space Tech Nature Earth History People Health Core Sciences Visual Stories Newsletters Cosmos»News **Common street trees show resilience to growing heat in Australia** **The Conversation** The Conversation is an independent, not-for-profit media outlet that uses content sourced from the academic and research community. **The Conversation** The Conversation is an independent, not-for-profit media outlet that uses content sourced from the academic and research community. As Australian citiesheat up and dry out, street trees are emerging as frontline defenders of urban liveability. Street trees make city lifemore bearableduring heatwaves. They alsoimprovehuman health and wellbeing, filter pollutants and support biodiversity. But as climate change intensifies droughts and dials up more extreme heat, can urban forests survive in a hotter, drier future? To find out, we studied how ten of Australia’s most common non-native street trees grow and tolerate drought across seven cities. The familiar species we chose are the well-loved jacaranda and widely planted London plane tree as well as box elder, European nettle tree, honey locust, sweetgum, southern magnolia, callery pear, black locust and Chinese elm. Unexpectedly, ournew researchshows several species tolerate drought better than predicted, including jacaranda and London plane. Some even put on growth spurts during droughts of unprecedented duration and heat. But others showed greater sensitivity than we had anticipated, including honey locust and black locust. As cities plan for a hotter future, our research will help urban planners choose the toughest, most resilient street trees. **What did we do?** Street trees cool cities both through their shade and by giving off water through transpiration. These effects can lower local temperatures by several degrees, which helps offset the extra heat trapped by roads, rooftops and hard surfaces. But the trees we rely on for cooling are vulnerable tomounting pressuresfrom climate change. Drought, heatwaves and limited soil and water availability in cities can all threaten tree health, growth and survival. To test how these species were coping, we chose over 570 street trees in Adelaide, Melbourne and Sydney, as well as Mildura in regional Victoria, Mandurah south of Perth and Parramatta and Penrith in Western Sydney. We extracted small cores of wood from the trunk, in a process that leaves the tree alive and largely unaffected. The oldest tree we sampled was a 70-year-old southern magnolia in Sydney. Growth rings in these cores let us reconstruct their growth histories and assess how they responded both to long-term climate patterns and extreme events such as the Black Summer of 2019–20 and theMillennium Droughtfrom 1997–2009. **How resilient are these trees?** What we found was both reassuring and surprising. Across all seven cities, the fastest average growth for all species was recorded in Mildura in northern Victoria. Overall, the slowest growth was found in the warmest location – Penrith. Some species behaved predictably. The black locust grew faster in cooler, wetter cities such as Melbourne, as expected, while honey locust and Chinese elms grew more slowly in hotter cities. But others defied expectations. Species such as London plane and southern magnolia showed consistent growth trends across cities despite the difference in heat, while others varied depending on local conditions. Crucially, the growth records showed many street trees responded positively to wetter conditions during the warmest months, most likely due to the longer growing season and increased access to water. Surprisingly, species such as box elder and Callery pear actually increased their growth during the very hot periods over the Black Summer of 2019–20 as well as during wetter La Niña periods in 2021–22. This suggests these species have adapted to warm urban environments – or that care and watering was provided. **What happened during drought?** During drought, street trees generally demonstrated strong resistance. This means they maintained their growth during dry periods. But their resilience – measured by their ability to bounce back to pre-drought growth rates – was often limited, especially in drier cities. While many street trees can withstand short-term stress, this suggests repeated or prolonged droughts can still take a toll on their long-term health. Interestingly, species identified as vulnerablein climate modelsdid not always show greater sensitivity to drought or climate extremes in our real-world study. Why? Local conditions and species-level characteristics such as leaf size, wood density and water use strategy may play a significant role in determining which individual trees will thrive as the climate changes. We also know care provided by council staff or local residents is extremely useful. When trees are irrigatedduring stressful conditions, they can help get the tree through tough times. **Why no eucalypts?** During their growing season each year, many northern hemisphere trees produce growth rings. These rings make it possible to reliably reconstruct their growth histories using our methods. But most eucalypts don’t form clear annual growth rings. This is why we didn’t include spotted gums and other common eucalypts seen on city streets. Eucalypts tend to grow whenever conditions are favourable rather than being constrained by a strict annual cycle. Only a few native species reliably produce datable annual rings, such as snow gums and alpine ash. This is because they live in cold, high elevation areas, where winter consistently limits growth each year. These conditions aren’t found in any major Australian city. **What does this mean for city planners?** Our research shows that species selection matters a great deal. Some street trees such as jacarandas, London plane and the European nettle tree can thrive even under extreme heat and drought, while honey locust and Chinese elms are more sensitive to local conditions. Authorities can maximise the benefits of urban forests and reduce tree decline or loss by choosing resilient species and matching them to the specific climate of each city or neighbourhood. As climate extremes become more common, even resilient species may face new challenges. Planting and maintaining diverse, climate-adapted urban forests will help ensure our cities remain liveable, healthy, and green in thedecades to come. Manuel Esperon-Rodriguez, Senior Lecturer in Ecology,Western Sydney University;Mark G Tjoelker, Professor of Ecology and Associate Director, Hawkesbury Institute for the Environment,Western Sydney University;Matthew Brookhouse, Senior Lecturer in Ecology,Australian National University, andSally Power, Professor of Ecology,Western Sydney University This article is republished fromThe Conversationunder a Creative Commons license. Read theoriginal article. Originally published byCosmosasCommon street trees show resilience to growing heat in Australia Please login to favourite this article. About Us FAQ Terms of use Schools Contact us Privacy Policy 'Cosmos' and 'The Science of Everything' are registered trademarks in Australia and owned by CSIRO. T: 1300 719623 (Australia)E:[email protected] Address: Cosmos, CSIRO Publishing, PO Box 10041, Adelaide SA 5001 Australia"}