{"id": 1635, "name": "Wyofile", "domain": "wyofile.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://wyofile.com/state-biologists-warned-of-wildlife-conflicts-at-proposed-shooting-complex-site-wyoming-approved-the-location-anyway/", "title": "State Biologists Warned Of Wildlife Conflicts At Proposed Shooting Complex Site Wyoming Approved The Location Anyway", "content": "Donate ❤️ Sign up ✉️ Latest NewsOpen dropdown menuLegislative CoverageEnergyNatural ResourcesJusticeEducationWildlifeNative AmericaOutdoorsHealth CarePhoto FridayPolicyOpinion Legislative Coverage Energy Natural Resources Justice Education Wildlife Native America Outdoors Health Care Photo Friday Policy Opinion Legislative Coverage Energy Natural Resources Justice Education Wildlife Native America Outdoors Health Care Photo Friday Policy Opinion Special ProjectsOpen dropdown menuCorner CrossingAbortion in WyomingWyoProfilesCollaborationsCheyenne RoundupA Critical CallDying in JailDelivery DesertColorado River CrisisEvents and Recordings Corner Crossing Abortion in Wyoming WyoProfiles Collaborations Cheyenne Roundup A Critical Call Dying in Jail Delivery Desert Colorado River Crisis Events and Recordings Corner Crossing Abortion in Wyoming WyoProfiles Collaborations Cheyenne Roundup A Critical Call Dying in Jail Delivery Desert Colorado River Crisis Events and Recordings Become a MemberOpen dropdown menuDonateSupportersPublisher’s CircleInstitutional SupportersUnderwriting Donate Supporters Publisher’s Circle Institutional Supporters Underwriting Donate Supporters Publisher’s Circle Institutional Supporters Underwriting Newsletters Mobile App Facebook Bluesky YouTube Instagram LinkedIn TikTok X Donate ❤️ Sign up ✉️ Latest NewsOpen dropdown menuLegislative CoverageEnergyNatural ResourcesJusticeEducationWildlifeNative AmericaOutdoorsHealth CarePhoto FridayPolicyOpinion Legislative Coverage Energy Natural Resources Justice Education Wildlife Native America Outdoors Health Care Photo Friday Policy Opinion Legislative Coverage Energy Natural Resources Justice Education Wildlife Native America Outdoors Health Care Photo Friday Policy Opinion Special ProjectsOpen dropdown menuCorner CrossingAbortion in WyomingWyoProfilesCollaborationsCheyenne RoundupA Critical CallDying in JailDelivery DesertColorado River CrisisEvents and Recordings Corner Crossing Abortion in Wyoming WyoProfiles Collaborations Cheyenne Roundup A Critical Call Dying in Jail Delivery Desert Colorado River Crisis Events and Recordings Corner Crossing Abortion in Wyoming WyoProfiles Collaborations Cheyenne Roundup A Critical Call Dying in Jail Delivery Desert Colorado River Crisis Events and Recordings Become a MemberOpen dropdown menuDonateSupportersPublisher’s CircleInstitutional SupportersUnderwriting Donate Supporters Publisher’s Circle Institutional Supporters Underwriting Donate Supporters Publisher’s Circle Institutional Supporters Underwriting Newsletters Mobile App Facebook Bluesky YouTube Instagram LinkedIn TikTok X WyoFile Indepth News about Wyoming People, Places & Policy. Wyoming news. **State biologists warned of wildlife conflicts at proposed shooting complex site. Wyoming approved the location anyway.** Over 21,000 Wyomingites get WyoFile delivered straight to their inbox.Join your neighbors and stay informed with the stories shaping Wyoming. When atask force of lawmakers and appointed citizensdecided last summer where best to locate a state-funded destination shooting facility, they chose a picturesque 3-square-mile tract of state land nestled into the Absaroka Range foothills. Their rationale, in part, was that the site evoked wild Wyoming. Rolling hills blanketed in sagebrush, the location is home to elk, mule deer, pronghorn and sage grouse, among other species. It boasts spectacular views of high peaks leading to the Yellowstone plateau and, off to the east, the Bighorn Basin. Bisected by Sulphur Creek, the site feels like it’s in the middle of nowhere despite being just an 8-mile drive from Cody. Those same attributes concerned Wyoming’s wildlife managers, according toan agency reviewof the proposal acquired by WyoFile through a Wyoming Public Records Act request. **As a WyoFile member, you make stories like this possible.Thanks for being on our team!** Seven days before the 12-member task force voted 8-4 in favor of the location, the Wyoming Game and Fish Department issued a memo that effectively recommended the complex go elsewhere. Specifically, Habitat Protection Supervisor Will Schultz asked that it be moved outside of “core” sage grouse habitat and “crucial” range forstruggling mule deer, which exhibited “high use” of the site throughout the year according to GPS collar data. Pronghorn and elk also used the 2,036-acre property, which is slated for development into a world-class shooting operation, and is expected to draw gun enthusiasts from far and wide. “Ground-disturbing activities and extensive human presence can result in the disturbance or displacement of wintering big game and loss of habitat, potentially impacting the viability of local populations,” stated the July 15, 2024 letter signed by Schultz. One week later, the state agency’s concerns surfaced as the task force voted. “Is this cleared for that wildlife aspect?” Republican Rep.Pepper Ottman of Riverton asked her fellow members. “It looks to me as though that is still a concern. What would that look like, to alleviate that concern? I’m not sure. That is of grave concern.” Nobody attempted to answer the questions. **‘Of grave concern’** Ottman, who’s no longer on the task force, voted with the minority for the runner-up site, near Gillette. She told WyoFile in an interview that she asked about the wildlife concerns because she wanted to get ahead of them — and wants theWyoming State Shooting Complexto be successful. “I’m going to support the decisions that were made,” Ottman said. No one other than Ottman, including the agency itself, raised Game and Fish’s wildlife concerns with the Cody site to the task force. Nor did the state agency’sreview of the alternative Campbell County site, which detailed far fewer concerns with wildlife, make much of an appearance in the debate. Publicly, there has been little to no discussion about requests to avoid the crucial mule deer range and the Oregon Basin sage grouse core area, or of any other wildlife-friendly guidance that’s been issued for the Park County shooting complex site, where construction crews could break ground as soon as July. Powell resident Greg Mayton, who spent 14 years working for Wyoming Game and Fish, said that the wildlife concerns were minimized because of a “top-down push” that has kept the agency’s Cody Region personnel muzzled. “It wouldn’t look good,” Mayton said, “if Game and Fish was against this site.” WyoFile’s attempts to talk with regional personnel were not successful — an in-person inquiry at the Cody office in early May prompted a phone call from the agency’s Cheyenne headquarters. An avid hunter, Mayton is among the few Park County residents who’ve spoken out against the shooting complex. The former aquatic invasive species biologist has spent ample time hunting elk and mule deer andlooking for shed antlerson the selected state land, which abuts a much larger expanse of Bureau of Land Management property west of Highway 120 between Cody and Meeteetse. He feels local residents have to unfairly subsidize a commercial enterprise they might not want in the first place. “We have to pay for it three times,” Mayton said. “Through county money I’m paying to build the road, through Game and Fish dollars, and then through all the state tax dollars.” Wildlife managers were more forward about their concerns earlier in the Park County site-selection process, according to Andy Quick, a former Cody town councilor. “They were going to pursue a different area north of town [near Skull Creek] that was really a bad idea,” Quick said. “That was a designated elk parturition area. The Game and Fish was a little more vocal about that one.” Like Mayton, Quick isn’t a fan of the planned commercial operation, which the Wyoming Legislature funded to the tune of $10 million last session. The allocation required somelast-minute maneuveringafter thesupplemental budget, which included funding for the complex, unexpectedly died. “It’s just going to fracture more habitat and it’s just one more step in the wrong direction, as far as I’m concerned,” Quick told WyoFile. “I think recreation and hunting are also going to lose out. I know that the state land can be managed as de facto private land, which is inherently a problem in and of itself.” “It’s just going to fracture more habitat and it’s just one more step in the wrong direction.” There’ve been several more visible scuffles of late over industrial and commercial use of state lands. Those includeopposition to a gravel pitjust outside of Casper, a lawsuitover a commercial wind farmin Converse County and a fight over aglamping operationat the foot of the Tetons that has spurred calls for reform and possibly legislation. The Wyoming State Shooting Complex has so far advanced with comparatively little controversy, at least in public. Quick, the former Cody town councilor, said that he was well in the minority among local elected officials. “I was probably the only one that was against it,” he said. **A defense** Former Park County Commissioner Lee Livingston, who works as a big game outfitter, championed the project. He helped shepherd it through the county board, and was a part of the county working group that helped preparea 241-page proposalpitching a complex south of Cody. Livingston told WyoFile in May that Game and Fish gave the location the “green light.” “I think anywhere you go in Wyoming, you can call it habitat,” Livingston said. “Overall, I think it’s probably about the best location it can be in that Cody area.” Other project proponents made similar contentions. Nephi Cole, a Sheridan-based lobbyist for the National Shooting Sports Foundation, said it’s hard to find a location in Wyoming that doesn’t have wildlife impacts. He also expressed hope that species would adjust to the gunfire, infrastructure and human activity likely soon to be added to the Absaroka foothills. “Other large ranges, they’re typically fairly non-invasive, believe it or not, for wildlife,” Cole said. “They accustomize to it, they don’t view it as a hindrance. You end up getting deer, antelope and elk all over ranges, to the extent you have to move them for competitions to make sure that they’re not around targets.” Baggs Republican Sen. Larry Hicks, whose2023 legislationspearheaded state planning and funding for a Wyoming State Shooting Complex, said he has witnessed the harmony between wildlife and recreational shooting atColorado’s Cameo Shooting Complex. “They got bighorn sheep, mule deer on the shooting range,” Hicks said. “Chukars all over the place.” Hicks expects something similar in Park County. Long-range shooting on the state site’s west end — there areplans for mile-long targets— are “probably going to have almost no impact” on wildlife, he said. “That’s not going to be an everyday, ongoing type of activity,” he said. “Seasonal use makes a difference. We can work around some of that just by event scheduling. We’ve got to put together a mitigation plan.” Glenn Ross, who chairs theWyoming State Shooting Complex Joint Powers Board, said that Wyoming’s concerns about wildlife impacts have been considered from the get-go and baked into the plans. “Our planning with our site has been making every attempt to be wildlife friendly,” Ross told WyoFile. Wildlife impacts, he said in a follow-up email, were a “primary consideration” in selecting the more southern Park County site before the local working group submitted itsformal applicationto the state in June 2024. That proposal does include some wildlife-focused plans. For example, core sage grouse habitat, which covers about a square mile of the site, would receive “minimum development” to avoid exceeding the 5% threshold authorized by Wyoming’s policy forthe embattled bird,which isparticularly sensitive to noise. Mule deer, whose designated “crucial” range covers almost the entire 2,036-acre site, would be accommodated by adjusting management west of a ridgeline during the winter, “minimizing the overall impact.” “Mule deer, although quite adaptive to human presence, still need areas of shelter and forage in the critical winter months,” Park County’s application stated. Elk and pronghorn, meanwhile, would be encouraged to stick around. “Because having these species on site can be of tremendous value to our customers, the complex will recognize that value and work to operate the facility in harmony with these species,” the planning document reads. **Next steps unclear** A month before a likely groundbreaking — Ross expects to receive the $10 million authorized by the Legislature in July — it’s unclear what actually will be required to minimize harm to wildlife along 3-plus square miles of the Absaroka front. Althoughwildlife managers’ site review of the Park County locationis printed on Wyoming Game and Fish Department letterhead and addressed to an outside legislative task force, the document was described as “internal department correspondence” when it was conveyed to WyoFile via a records request. It’s not considered an “official project letter,” Game and Fish officials said. “We have not submitted any formal comments on the Cody shooting complex,” Wyoming Game and Fish Chief Warden Dan Smith told WyoFile. “And we haven’t been requested for any [comments].” The Office of State Lands and Investments will decide whether Game and Fish formally comments, he said. “It’s up to them,” Smith said, “whether they request us to make comments on their project.” Because the Wyoming State Shooting Complex is set to occupy state trust land, the permitting authority is the Office of State Lands and Investments. Its oversight board, the State Board of Land Commissioners, has already approved the Cody complex, according to Melissa DeFrantis, a public information officer for the state agency. “They’ve approved going forward with it,” DeFrantis said. “We will take the lease to them once it’s complete.” Tired of the noise?We’ll send you the facts, straight to your inbox. The State Board of Land Commissioners consists of Wyoming’s five statewide elected officials: Gov. Mark Gordon, Superintendent of Public Instruction Megan Degenfelder, Secretary of State Chuck Gray, Treasurer Curt Meier and Auditor Kristi Racines. Until the board approves the lease, the draft version and its contents — such as wildlife stipulations — are not considered public information, DeFrantis said. “We don’t know what the negotiations may be,” she said. “A draft, it really wouldn’t benefit you right now.” The Office of State Lands and Investments had a different interpretation of what triggers a formal Wyoming Game and Fish Department project letter. Those are typically prepared by default for state land leases, DeFrantis said. But DeFrantis also said she was unaware if Game and Fish would formally review the Wyoming State Shooting Complex’s lease near Cody. “I can’t say, I’m not drafting the lease,” she said. “But I can say that that’s generally the process, and I don’t know why we would avoid that.” The Office of State Lands and Investment’s lead on the project, Cody Booth, did not return a phone call requesting an interview. If Wyoming Game and Fish does proceed with a formal review and the requested stipulations mirror those in itsexisting site review, the Wyoming State Shooting Complex could be saddled with significant restrictions that inhibit its construction and operations. Because the project isn’t being moved outside of the core sage grouse area, construction and development “should not occur” between March 15 and June 30 in that designated core habitat and within 2 miles of a nearby non-core area lek, according to Game and Fish’sexisting guidance. Furthermore, Game and Fish asked shooting complex proponents to develop “a noise mitigation plan” so gunfire doesn’t compromise an occupied core-area lek that’s three-quarters of a mile south of the complex. “Research has indicated that the declines in male lek attendance in response to increased noise are immediate and sustained,” the state’s letter stated. “Further, sage grouse do not appear to habituate to increased noise levels over time.” **RELATED** **‘Path of the Pronghorn’ protections delayed as development proceeds** **How to decimate a mule deer herd: A case study in Wyoming** Crucial year-round range used by the Upper Shoshone Mule Deer Herd could impact shooting complex operations even more if requested wildlife stipulations are heeded. The herd has struggled mightily: The estimated 6,850 deer in the herd fall more than 40% short of the herd’s 12,000-animal population target, according toGame and Fish’s latest assessment. Because the complex wasn’t relocated outside the “crucial” deer range, which overlapped almost the entire site, Game and Fish’s instruction was to “avoid ground-disturbing activities and extensive human presence” from Nov. 15 to April 30. Mule deer-friendly practices, in other words, could theoretically shutter the destination shooting complex nearly six months a year. BEFORE YOU GO...If you learned something from this article, pay it forward and contribute to WyoFile. Our work is funded by readers like you who are committed to supporting unbiased journalism that works for you, not for the algorithms. **Mike Koshmrl** Mike Koshmrl reports on Wyoming's wildlife and natural resources. Prior to joining WyoFile, he spent nearly a decade covering the Greater Yellowstone Ecosystem’s wild places and creatures for the Jackson...More by Mike Koshmrl **Join the Conversation** 41 Comments WyoFile's goal is to provide readers with information and ideas that foster constructive conversations about the issues and opportunities our communities face. One small piece of how we do that is by offering a space below each story for readers to share perspectives, experiences and insights. For this to work, we need your help.What we're looking for:Your real name — first and last.Direct responses to the article. Tell us how your experience relates to the story.The truth. Share factual information that adds context to the reporting.Thoughtful answers to questions raised by the reporting or other commenters.Tips that could advance our reporting on the topic.No more than three comments per story, including replies.What we block from our comments section, when we see it:Pseudonyms. WyoFile stands behind everything we publish, and we expect commenters to do the same by using their real name.Comments that are not directly relevant to the article.Demonstrably false claims, what-about-isms, references to debunked lines of rhetoric, professional political talking points or links to sites trafficking in misinformation.Personal attacks, profanity, discriminatory language or threats.Arguments with other commenters.Other important things to know:Appearing in WyoFile’s comments section is a privilege, not a right or entitlement.We’re a small team and our first priority is reporting. Depending on what’s going on, comments may be moderated 24 to 48 hours from when they’re submitted — or even later. If you comment in the evening or on the weekend, please be patient. We’ll get to it when we’re back in the office.We’re not interested in managing squeaky wheels, and even if we wanted to, we don't have time to address every single commenter’s grievance.Try as we might, we will make mistakes.We’ll fail to catch aliases, mistakenly allow folks to exceed the comment limit and occasionally miss false statements. If that’s going to upset you, it’s probably best to just stick with our journalism and avoid the comments section.We don’t mediate disputes between commenters. If you have concerns about another commenter, please don’t bring them to us.The bottom line:If you repeatedly push the boundaries, make unreasonable demands, get caught lying or generally cause trouble, we will stop approving your comments — maybe forever. Such moderation decisions are not negotiable or subject to explanation. If civil and constructive conversation is not your goal, then our comments section is not for you. WyoFile's goal is to provide readers with information and ideas that foster constructive conversations about the issues and opportunities our communities face. One small piece of how we do that is by offering a space below each story for readers to share perspectives, experiences and insights. For this to work, we need your help. What we're looking for: Your real name — first and last. Direct responses to the article. Tell us how your experience relates to the story. The truth. Share factual information that adds context to the reporting. Thoughtful answers to questions raised by the reporting or other commenters. Tips that could advance our reporting on the topic. No more than three comments per story, including replies. What we block from our comments section, when we see it: Pseudonyms. WyoFile stands behind everything we publish, and we expect commenters to do the same by using their real name. Comments that are not directly relevant to the article. Demonstrably false claims, what-about-isms, references to debunked lines of rhetoric, professional political talking points or links to sites trafficking in misinformation. Personal attacks, profanity, discriminatory language or threats. Arguments with other commenters. Other important things to know: Appearing in WyoFile’s comments section is a privilege, not a right or entitlement. We’re a small team and our first priority is reporting. Depending on what’s going on, comments may be moderated 24 to 48 hours from when they’re submitted — or even later. If you comment in the evening or on the weekend, please be patient. We’ll get to it when we’re back in the office. We’re not interested in managing squeaky wheels, and even if we wanted to, we don't have time to address every single commenter’s grievance. Try as we might, we will make mistakes.We’ll fail to catch aliases, mistakenly allow folks to exceed the comment limit and occasionally miss false statements. If that’s going to upset you, it’s probably best to just stick with our journalism and avoid the comments section. We don’t mediate disputes between commenters. If you have concerns about another commenter, please don’t bring them to us. The bottom line: If you repeatedly push the boundaries, make unreasonable demands, get caught lying or generally cause trouble, we will stop approving your comments — maybe forever. Such moderation decisions are not negotiable or subject to explanation. If civil and constructive conversation is not your goal, then our comments section is not for you. WyoFile's goal is to provide readers with information and ideas that foster constructive conversations about the issues and opportunities our communities face. One small piece of how we do that is by offering a space below each story for readers to share perspectives, experiences and insights. For this to work, we need your help. What we're looking for: Your real name — first and last. Direct responses to the article. Tell us how your experience relates to the story. The truth. Share factual information that adds context to the reporting. Thoughtful answers to questions raised by the reporting or other commenters. Tips that could advance our reporting on the topic. No more than three comments per story, including replies. What we block from our comments section, when we see it: Pseudonyms. WyoFile stands behind everything we publish, and we expect commenters to do the same by using their real name. Comments that are not directly relevant to the article. Demonstrably false claims, what-about-isms, references to debunked lines of rhetoric, professional political talking points or links to sites trafficking in misinformation. Personal attacks, profanity, discriminatory language or threats. Arguments with other commenters. Other important things to know: Appearing in WyoFile’s comments section is a privilege, not a right or entitlement. We’re a small team and our first priority is reporting. Depending on what’s going on, comments may be moderated 24 to 48 hours from when they’re submitted — or even later. If you comment in the evening or on the weekend, please be patient. We’ll get to it when we’re back in the office. We’re not interested in managing squeaky wheels, and even if we wanted to, we don't have time to address every single commenter’s grievance. Try as we might, we will make mistakes.We’ll fail to catch aliases, mistakenly allow folks to exceed the comment limit and occasionally miss false statements. If that’s going to upset you, it’s probably best to just stick with our journalism and avoid the comments section. We don’t mediate disputes between commenters. If you have concerns about another commenter, please don’t bring them to us. The bottom line: If you repeatedly push the boundaries, make unreasonable demands, get caught lying or generally cause trouble, we will stop approving your comments — maybe forever. Such moderation decisions are not negotiable or subject to explanation. If civil and constructive conversation is not your goal, then our comments section is not for you. Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ Nanette Benoit Tillsays:June 8, 2025 at 4:48 pmThis site should not be the site for the shooting complex. I do not know why Game and Fish has not been more vocal against this location. Someone at state level has told them to stand down. This location is critical habitat for many species. This giant shooting complex will destroy this beautiful place no matter what stipulations are made. Our mule deer are disappearing and sage grouse are not doing well. Its absolutely ridicules to tear this area up for a shooting complex. I think there are many people against this who have been silent. It belongs. in GilletteReply This site should not be the site for the shooting complex. I do not know why Game and Fish has not been more vocal against this location. Someone at state level has told them to stand down. This location is critical habitat for many species. This giant shooting complex will destroy this beautiful place no matter what stipulations are made. Our mule deer are disappearing and sage grouse are not doing well. Its absolutely ridicules to tear this area up for a shooting complex. I think there are many people against this who have been silent. It belongs. in Gillette This site should not be the site for the shooting complex. I do not know why Game and Fish has not been more vocal against this location. Someone at state level has told them to stand down. This location is critical habitat for many species. This giant shooting complex will destroy this beautiful place no matter what stipulations are made. Our mule deer are disappearing and sage grouse are not doing well. Its absolutely ridicules to tear this area up for a shooting complex. I think there are many people against this who have been silent. It belongs. in Gillette Christina Anthessays:June 8, 2025 at 12:28 pmWhen all the wildlife moves out of the area they will blame it on the wolves.Reply When all the wildlife moves out of the area they will blame it on the wolves. When all the wildlife moves out of the area they will blame it on the wolves. Linda J Coopersays:June 8, 2025 at 11:46 amShooting? Is that all Wyoming is good for?Reply Shooting? Is that all Wyoming is good for? Shooting? Is that all Wyoming is good for? Brianna Jonessays:June 7, 2025 at 6:32 pmThere is no habitat being ruined it will probably be an increase in certain feeds. The spread of Wolves and Grizzles are far more a threat with their broadcast spread of CWD than this project .Reply There is no habitat being ruined it will probably be an increase in certain feeds. The spread of Wolves and Grizzles are far more a threat with their broadcast spread of CWD than this project . There is no habitat being ruined it will probably be an increase in certain feeds. The spread of Wolves and Grizzles are far more a threat with their broadcast spread of CWD than this project . Patricia McDanielsays:June 7, 2025 at 1:29 pmThe outsized influence of trappers, outfitters and gun enthusiasts are a huge reason Wyoming cannot move forward as a state. If they want it, they will get it.Reply The outsized influence of trappers, outfitters and gun enthusiasts are a huge reason Wyoming cannot move forward as a state. If they want it, they will get it. The outsized influence of trappers, outfitters and gun enthusiasts are a huge reason Wyoming cannot move forward as a state. If they want it, they will get it. Mike Krallsays:June 7, 2025 at 12:50 pmIn and around all the lack of consideration of and use of developed understandings of wild life, their habitats, and environmental impact is range layout. A “best” range is laid out to fire north, or as much as 25 deg. to the north east.Along with the other noted dysfunctional aspects here, I don’t get the feeling ideal range design criteria have been a significant consideration in this project.Reply In and around all the lack of consideration of and use of developed understandings of wild life, their habitats, and environmental impact is range layout. A “best” range is laid out to fire north, or as much as 25 deg. to the north east. Along with the other noted dysfunctional aspects here, I don’t get the feeling ideal range design criteria have been a significant consideration in this project. In and around all the lack of consideration of and use of developed understandings of wild life, their habitats, and environmental impact is range layout. A “best” range is laid out to fire north, or as much as 25 deg. to the north east. Along with the other noted dysfunctional aspects here, I don’t get the feeling ideal range design criteria have been a significant consideration in this project. Clifford L. Folkertssays:June 7, 2025 at 10:45 amWhat a lousy idea to put this shooting complex in that spot, especially when the Gillette location is way less wildlife intrusive. I won’t be traveling to either place, either way, at least not to go to a shooting complex. Why must wildlife always take the back seat to development? This reminds me of the big solar panel field north of I-80 on HWY 389. Though the developers knew the “green energy” plan would place the field smack in the middle of a pronghorn migration trail, and G&F had expressed their desire to the developers and county to consider that information, their input was basically ignored. Again it happens. Wyoming will never be the same. Too much development. Not just there, but across the entire state. I suppose “progress” is inevitable, it’s just sad to see what once was is now forever gone.Reply What a lousy idea to put this shooting complex in that spot, especially when the Gillette location is way less wildlife intrusive. I won’t be traveling to either place, either way, at least not to go to a shooting complex. Why must wildlife always take the back seat to development? This reminds me of the big solar panel field north of I-80 on HWY 389. Though the developers knew the “green energy” plan would place the field smack in the middle of a pronghorn migration trail, and G&F had expressed their desire to the developers and county to consider that information, their input was basically ignored. Again it happens. Wyoming will never be the same. Too much development. Not just there, but across the entire state. I suppose “progress” is inevitable, it’s just sad to see what once was is now forever gone. What a lousy idea to put this shooting complex in that spot, especially when the Gillette location is way less wildlife intrusive. I won’t be traveling to either place, either way, at least not to go to a shooting complex. Why must wildlife always take the back seat to development? This reminds me of the big solar panel field north of I-80 on HWY 389. Though the developers knew the “green energy” plan would place the field smack in the middle of a pronghorn migration trail, and G&F had expressed their desire to the developers and county to consider that information, their input was basically ignored. Again it happens. Wyoming will never be the same. Too much development. Not just there, but across the entire state. I suppose “progress” is inevitable, it’s just sad to see what once was is now forever gone. Anne Brandesays:June 7, 2025 at 10:39 amOur conservancy in SE Wyoming is compelled to point out Rail Tie Wind, Albany County’s largest wind energy project is also on state lease land and not only will have negative impacts due to large scale 675 ft. turbines affecting pronghorn, mule deer, elk, and moose as well as “species of greatest conservation need” it also has the impacts of a large scale commercial quarry to provide gravel for this project the county’s largest wind project to date which has over 90 stream crossings and did not do a federal wet lands study as required by the EPA . Rail Tie Wind sits between Arapahoe National Forest and Medicine Bow National forest along the HWY287 and the I80 Corridor. The the Rail Tie Wind project area contains 480 nationally significant historic and cultural sites and therefore should have in the mitigation process designated these sites as a national historic district due to the pristine condition and integrity of sites identified. In 2021 Albany County residents sued in WY Supreme Court regarding the denial and subsequent approval to lease to Spanish Company Repsol then Houston basted Connect Gen who sold later sold Rail Tie Wind for $485 million dollars to Repsol in November of 2024. After the WY state land board voted against leasing to Connect Gen and under very questionable actions the Land Board rescinded and the lease was up for vote again only a few months after the board voted to deny the lease approval initially. The public learned state lease was back on the table yet it was not on the meeting agenda for public comment. The public demanded to make comment. After five hours of contentious public comment against leasing the board approved to lease the only no vote was cast by State treasurer Meyer. That in itself should be telling.A letter from Game and Fish regarding the impacts to ungulates and species of greatest conservation need was also produced as in this case with the same response from Wyoming Game and Fish. The Wyoming public was then forced to look to federal inadequacies for protection our state was not willing to weigh in on. Rail Tie Wind sits near a major federal power line and and was mandated to conducted a full Environmental Impact Statement, the most rigorous of federal National Environmental Policy Act reviews required. This law suit was published WyoFile earlier this year 2025. In Rail Tie there is a federal 110F violation under the National Historic Preservation Act Section 106 process. Wyoming residents need to stay informed and involved in state and federal land management. They can not rely on county, state, or federal government to follow sound practices until things of this nature as covered in your article are addressed. And more importantly until Wyoming Game and Fish staff feel comfortable speaking with integrity regardless of top down directives. We have learned from Rail Tie Wind laws are being broken which will forever impact Wyoming natural resources at the county, state, and federal level. Wyoming is at the precipice and if we do not unite as Wyoming residents to communicate locally, state wide, and federal we stand by and allow the promise of big money to dictate our future, often without in state key stake holders making long term positive improvements to a broken system. Litigating to preserve, protect, and promote Wyoming wildlife, habitat, and pristine historic sites of tremendous national and local value was our only option. Let’s make sure that this is NOT the case in every county around the Wyoming moving forward.Reply Our conservancy in SE Wyoming is compelled to point out Rail Tie Wind, Albany County’s largest wind energy project is also on state lease land and not only will have negative impacts due to large scale 675 ft. turbines affecting pronghorn, mule deer, elk, and moose as well as “species of greatest conservation need” it also has the impacts of a large scale commercial quarry to provide gravel for this project the county’s largest wind project to date which has over 90 stream crossings and did not do a federal wet lands study as required by the EPA . Rail Tie Wind sits between Arapahoe National Forest and Medicine Bow National forest along the HWY287 and the I80 Corridor. The the Rail Tie Wind project area contains 480 nationally significant historic and cultural sites and therefore should have in the mitigation process designated these sites as a national historic district due to the pristine condition and integrity of sites identified. In 2021 Albany County residents sued in WY Supreme Court regarding the denial and subsequent approval to lease to Spanish Company Repsol then Houston basted Connect Gen who sold later sold Rail Tie Wind for $485 million dollars to Repsol in November of 2024. After the WY state land board voted against leasing to Connect Gen and under very questionable actions the Land Board rescinded and the lease was up for vote again only a few months after the board voted to deny the lease approval initially. The public learned state lease was back on the table yet it was not on the meeting agenda for public comment. The public demanded to make comment. After five hours of contentious public comment against leasing the board approved to lease the only no vote was cast by State treasurer Meyer. That in itself should be telling.A letter from Game and Fish regarding the impacts to ungulates and species of greatest conservation need was also produced as in this case with the same response from Wyoming Game and Fish. The Wyoming public was then forced to look to federal inadequacies for protection our state was not willing to weigh in on. Rail Tie Wind sits near a major federal power line and and was mandated to conducted a full Environmental Impact Statement, the most rigorous of federal National Environmental Policy Act reviews required. This law suit was published WyoFile earlier this year 2025. In Rail Tie there is a federal 110F violation under the National Historic Preservation Act Section 106 process. Wyoming residents need to stay informed and involved in state and federal land management. They can not rely on county, state, or federal government to follow sound practices until things of this nature as covered in your article are addressed. And more importantly until Wyoming Game and Fish staff feel comfortable speaking with integrity regardless of top down directives. We have learned from Rail Tie Wind laws are being broken which will forever impact Wyoming natural resources at the county, state, and federal level. Wyoming is at the precipice and if we do not unite as Wyoming residents to communicate locally, state wide, and federal we stand by and allow the promise of big money to dictate our future, often without in state key stake holders making long term positive improvements to a broken system. Litigating to preserve, protect, and promote Wyoming wildlife, habitat, and pristine historic sites of tremendous national and local value was our only option. Let’s make sure that this is NOT the case in every county around the Wyoming moving forward. Our conservancy in SE Wyoming is compelled to point out Rail Tie Wind, Albany County’s largest wind energy project is also on state lease land and not only will have negative impacts due to large scale 675 ft. turbines affecting pronghorn, mule deer, elk, and moose as well as “species of greatest conservation need” it also has the impacts of a large scale commercial quarry to provide gravel for this project the county’s largest wind project to date which has over 90 stream crossings and did not do a federal wet lands study as required by the EPA . Rail Tie Wind sits between Arapahoe National Forest and Medicine Bow National forest along the HWY287 and the I80 Corridor. The the Rail Tie Wind project area contains 480 nationally significant historic and cultural sites and therefore should have in the mitigation process designated these sites as a national historic district due to the pristine condition and integrity of sites identified. In 2021 Albany County residents sued in WY Supreme Court regarding the denial and subsequent approval to lease to Spanish Company Repsol then Houston basted Connect Gen who sold later sold Rail Tie Wind for $485 million dollars to Repsol in November of 2024. After the WY state land board voted against leasing to Connect Gen and under very questionable actions the Land Board rescinded and the lease was up for vote again only a few months after the board voted to deny the lease approval initially. The public learned state lease was back on the table yet it was not on the meeting agenda for public comment. The public demanded to make comment. After five hours of contentious public comment against leasing the board approved to lease the only no vote was cast by State treasurer Meyer. That in itself should be telling.A letter from Game and Fish regarding the impacts to ungulates and species of greatest conservation need was also produced as in this case with the same response from Wyoming Game and Fish. The Wyoming public was then forced to look to federal inadequacies for protection our state was not willing to weigh in on. Rail Tie Wind sits near a major federal power line and and was mandated to conducted a full Environmental Impact Statement, the most rigorous of federal National Environmental Policy Act reviews required. This law suit was published WyoFile earlier this year 2025. In Rail Tie there is a federal 110F violation under the National Historic Preservation Act Section 106 process. Wyoming residents need to stay informed and involved in state and federal land management. They can not rely on county, state, or federal government to follow sound practices until things of this nature as covered in your article are addressed. And more importantly until Wyoming Game and Fish staff feel comfortable speaking with integrity regardless of top down directives. We have learned from Rail Tie Wind laws are being broken which will forever impact Wyoming natural resources at the county, state, and federal level. Wyoming is at the precipice and if we do not unite as Wyoming residents to communicate locally, state wide, and federal we stand by and allow the promise of big money to dictate our future, often without in state key stake holders making long term positive improvements to a broken system. Litigating to preserve, protect, and promote Wyoming wildlife, habitat, and pristine historic sites of tremendous national and local value was our only option. Let’s make sure that this is NOT the case in every county around the Wyoming moving forward. Larry Skowsays:June 7, 2025 at 10:23 amIf they made this a SKI IN SHOOTING RANGE there would not be one protest.Reply If they made this a SKI IN SHOOTING RANGE there would not be one protest. If they made this a SKI IN SHOOTING RANGE there would not be one protest. Ron Smithsays:June 7, 2025 at 8:18 amI’ve often thought that Wyoming’s nickname should be “The Wildlife State.” Wyoming has long been renowned for its abundance of native wildlife. Sadly, this is becoming less and less true. Wyoming’s human population has more than doubled in my lifetime. This population increase has brought with it ever more impacts. Wyoming can no longer simply ignore those impacts. Every project should include a rigorous and formal review of wildlife impacts. And those impacts need to be heeded! Wyoming does not need a gigantic shooting complex in the extreme corner of the state. A far better plan would be small, well-managed shooting ranges near every Wyoming town. This would help eliminate the trashing of public lands by hunters simply needing to sight in their rifles.Reply I’ve often thought that Wyoming’s nickname should be “The Wildlife State.” Wyoming has long been renowned for its abundance of native wildlife. Sadly, this is becoming less and less true. Wyoming’s human population has more than doubled in my lifetime. This population increase has brought with it ever more impacts. Wyoming can no longer simply ignore those impacts. Every project should include a rigorous and formal review of wildlife impacts. And those impacts need to be heeded! Wyoming does not need a gigantic shooting complex in the extreme corner of the state. A far better plan would be small, well-managed shooting ranges near every Wyoming town. This would help eliminate the trashing of public lands by hunters simply needing to sight in their rifles. I’ve often thought that Wyoming’s nickname should be “The Wildlife State.” Wyoming has long been renowned for its abundance of native wildlife. Sadly, this is becoming less and less true. Wyoming’s human population has more than doubled in my lifetime. This population increase has brought with it ever more impacts. Wyoming can no longer simply ignore those impacts. Every project should include a rigorous and formal review of wildlife impacts. And those impacts need to be heeded! Wyoming does not need a gigantic shooting complex in the extreme corner of the state. A far better plan would be small, well-managed shooting ranges near every Wyoming town. This would help eliminate the trashing of public lands by hunters simply needing to sight in their rifles. Bill Huffsays:June 6, 2025 at 9:07 pmFor what it’s worth perhaps you might reach out to the NRA Whittington center in New Mexico. While shooting there we had to pause fire due to mule deer walking across the range during live fire. They seemed totally unfazed by it. I’m sure they might have information on how their range has impacted wildlife behavior. Hope this helps in making the best decision on this question.Reply For what it’s worth perhaps you might reach out to the NRA Whittington center in New Mexico. While shooting there we had to pause fire due to mule deer walking across the range during live fire. They seemed totally unfazed by it. I’m sure they might have information on how their range has impacted wildlife behavior. Hope this helps in making the best decision on this question. For what it’s worth perhaps you might reach out to the NRA Whittington center in New Mexico. While shooting there we had to pause fire due to mule deer walking across the range during live fire. They seemed totally unfazed by it. I’m sure they might have information on how their range has impacted wildlife behavior. Hope this helps in making the best decision on this question. Harvey Readingsays:June 6, 2025 at 4:01 pmAnything to please the insecure popgunners…Reply Anything to please the insecure popgunners… Anything to please the insecure popgunners… Daniel G. Vuletichsays:June 6, 2025 at 2:43 pmGood bye paradise, we need to spend more tax money to fragment wildlife habitat so Cody can make a few more bucks. Most people live in Wyoming because of open spaces and wildlife like no other state, it’s turning into a playground for the rich. How soon till we sell off public lands for a quick buck.Reply Good bye paradise, we need to spend more tax money to fragment wildlife habitat so Cody can make a few more bucks. Most people live in Wyoming because of open spaces and wildlife like no other state, it’s turning into a playground for the rich. How soon till we sell off public lands for a quick buck. Good bye paradise, we need to spend more tax money to fragment wildlife habitat so Cody can make a few more bucks. Most people live in Wyoming because of open spaces and wildlife like no other state, it’s turning into a playground for the rich. How soon till we sell off public lands for a quick buck. Norm Burkesays:June 6, 2025 at 12:35 pmMake no mistake, this shooting complex project is an incognito Forward Cody scheme with many of the same clownage personalities working their magic behind the curtain. Forward Cody has a dismal track record of creating economic development in the NW region of Wyoming and as others said, very few jobs ever created and leaving a string of new and huge vacant buildings in their wake. This calamity has burnt through Millions $$$ of taxpayer funds and looks like the fun will continue until stopped. What’s even more shocking to read is that the Park County Commissioners have approved a $750,000 road to be constructed to the ill-chosen shooting complex site. THREE-QUARTER of a MILLION DOLLARS—-have the citizens of Park County been fully advised of this and are in agreement? Regarding the wildlife, the NW Wyoming Mule Deer herd is at a critically low level under the watch of the local Game and Fish department with the redshirts sleeping at the wheel. Game and Fish should be screaming the loudest but sounds like they’ll pass the buck. This Cody area Shooting complex is an impending disaster anyway you look at it and someone who doesn’t have a greedy stake in this debacle needs to stand up to the follyReplyNanette Benoit Tillsays:June 8, 2025 at 4:50 pmYou are totally correct on all you have written here.Reply Make no mistake, this shooting complex project is an incognito Forward Cody scheme with many of the same clownage personalities working their magic behind the curtain. Forward Cody has a dismal track record of creating economic development in the NW region of Wyoming and as others said, very few jobs ever created and leaving a string of new and huge vacant buildings in their wake. This calamity has burnt through Millions $$$ of taxpayer funds and looks like the fun will continue until stopped. What’s even more shocking to read is that the Park County Commissioners have approved a $750,000 road to be constructed to the ill-chosen shooting complex site. THREE-QUARTER of a MILLION DOLLARS—-have the citizens of Park County been fully advised of this and are in agreement? Regarding the wildlife, the NW Wyoming Mule Deer herd is at a critically low level under the watch of the local Game and Fish department with the redshirts sleeping at the wheel. Game and Fish should be screaming the loudest but sounds like they’ll pass the buck. This Cody area Shooting complex is an impending disaster anyway you look at it and someone who doesn’t have a greedy stake in this debacle needs to stand up to the folly Nanette Benoit Tillsays:June 8, 2025 at 4:50 pmYou are totally correct on all you have written here.Reply You are totally correct on all you have written here. Make no mistake, this shooting complex project is an incognito Forward Cody scheme with many of the same clownage personalities working their magic behind the curtain. Forward Cody has a dismal track record of creating economic development in the NW region of Wyoming and as others said, very few jobs ever created and leaving a string of new and huge vacant buildings in their wake. This calamity has burnt through Millions $$$ of taxpayer funds and looks like the fun will continue until stopped. What’s even more shocking to read is that the Park County Commissioners have approved a $750,000 road to be constructed to the ill-chosen shooting complex site. THREE-QUARTER of a MILLION DOLLARS—-have the citizens of Park County been fully advised of this and are in agreement? Regarding the wildlife, the NW Wyoming Mule Deer herd is at a critically low level under the watch of the local Game and Fish department with the redshirts sleeping at the wheel. Game and Fish should be screaming the loudest but sounds like they’ll pass the buck. This Cody area Shooting complex is an impending disaster anyway you look at it and someone who doesn’t have a greedy stake in this debacle needs to stand up to the folly Nanette Benoit Tillsays:June 8, 2025 at 4:50 pmYou are totally correct on all you have written here.Reply You are totally correct on all you have written here. You are totally correct on all you have written here. Richard Faustsays:June 6, 2025 at 11:15 amWhy hasn’t our great protector of wildlife and open spaces the Nature Conservancy been hollerin’ and a cryin’?! Oh ya, forgot, they actually focus on parking money for the ultra rich and leverage millions of dollars of taxpayer money in the form of grants and forgivable loans under the ruse of saving the environment. The TNC silence on this project has been deafeningReply Why hasn’t our great protector of wildlife and open spaces the Nature Conservancy been hollerin’ and a cryin’?! Oh ya, forgot, they actually focus on parking money for the ultra rich and leverage millions of dollars of taxpayer money in the form of grants and forgivable loans under the ruse of saving the environment. The TNC silence on this project has been deafening Why hasn’t our great protector of wildlife and open spaces the Nature Conservancy been hollerin’ and a cryin’?! Oh ya, forgot, they actually focus on parking money for the ultra rich and leverage millions of dollars of taxpayer money in the form of grants and forgivable loans under the ruse of saving the environment. The TNC silence on this project has been deafening Chuck Tarinellisays:June 6, 2025 at 10:13 amAs a hunter, I believe that in complex situations, such as this, the recommendations of the state wildlife biologists should be followed. These folks are much more objective than any other group … certainly more than those who will be prifitting from this shooting complex. Additionally, it seems odd that hunters would support a development that would negatively impact game animals.ReplyEd Daviessays:June 6, 2025 at 8:16 pmWell said.Reply As a hunter, I believe that in complex situations, such as this, the recommendations of the state wildlife biologists should be followed. These folks are much more objective than any other group … certainly more than those who will be prifitting from this shooting complex. Additionally, it seems odd that hunters would support a development that would negatively impact game animals. Ed Daviessays:June 6, 2025 at 8:16 pmWell said.Reply Well said. As a hunter, I believe that in complex situations, such as this, the recommendations of the state wildlife biologists should be followed. These folks are much more objective than any other group … certainly more than those who will be prifitting from this shooting complex. Additionally, it seems odd that hunters would support a development that would negatively impact game animals. Ed Daviessays:June 6, 2025 at 8:16 pmWell said.Reply Well said. Well said. Dewey Vanderhoffsays:June 6, 2025 at 9:58 amWyoming potentates have never really cared much about wildlife when making and selling policy . Wildlife are just another commodity resource to be exploited or extracted.For the zillionth time we see here more proof of the proverb about politicians ” ” Don’t believe what they say … watch what they do “.Sidenote : my hometown of Cody is chronically drunk on gunsReplyDoug Olsensays:June 6, 2025 at 11:36 amMust explain this?Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.htmlReplyDewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Wyoming potentates have never really cared much about wildlife when making and selling policy . Wildlife are just another commodity resource to be exploited or extracted. For the zillionth time we see here more proof of the proverb about politicians ” ” Don’t believe what they say … watch what they do “. Sidenote : my hometown of Cody is chronically drunk on guns Doug Olsensays:June 6, 2025 at 11:36 amMust explain this?Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.htmlReplyDewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Must explain this? Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.html Dewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Not relevant to the discussion at hand, Doug. Doug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.Reply Sorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker. Larry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Dewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes. Wyoming potentates have never really cared much about wildlife when making and selling policy . Wildlife are just another commodity resource to be exploited or extracted. For the zillionth time we see here more proof of the proverb about politicians ” ” Don’t believe what they say … watch what they do “. Sidenote : my hometown of Cody is chronically drunk on guns Doug Olsensays:June 6, 2025 at 11:36 amMust explain this?Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.htmlReplyDewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Must explain this? Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.html Dewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Not relevant to the discussion at hand, Doug. Doug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.Reply Sorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker. Larry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Dewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes. Must explain this? Cody is recognized as one of the safest cities in Wyoming based on crime statistics, including violent and property crime rates.https://www.codyenterprise.com/news/local/article_8a321d34-fbed-11ed-b6ea-03f1c910d9a9.html Dewey Vanderhoffsays:June 6, 2025 at 2:23 pmNot relevant to the discussion at hand, Doug.ReplyDoug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.ReplyLarry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Not relevant to the discussion at hand, Doug. Doug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.Reply Sorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker. Larry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Dewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes. Not relevant to the discussion at hand, Doug. Doug Olsensays:June 6, 2025 at 10:12 pmSorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker.Reply Sorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker. Sorry Dewey just replying to your “chronically drunk on guns”, side note relevance breaker. Larry Skowsays:June 7, 2025 at 10:27 amDewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes.Reply Dewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes. Dewey. Yes his comment is relative. You just don’t want to admit that high volume of legally owned guns make a safe area. Boulder Colo is prime example of how bad guys pick up that Boulder is anti gun. So makes it a target for evil. Sanctuary city’s seem to become crime scenes. Chancy Brownsays:June 6, 2025 at 9:35 amIt is very interesting to note some of the vocabulary in this article. It is stated Mule deer will be “accommodated” to use a different ridge. Elk and Pronghorn would be “encouraged” to stay around the area.To use this language when talking about WILDLIFE is almost comical. To “accommadate” Mule deer they need wide open undisturbed areas. To :encourage” elk and pronghorn I guess you might try baiting?I do like the idea of a state shooting range. I also agree that there are few places in Wyoming that can be developed for something like the shooting complex. The good thing that is happening is all the considerations. Unfortunately this does not take place with large tracts of land used for private enterprise.Reply It is very interesting to note some of the vocabulary in this article. It is stated Mule deer will be “accommodated” to use a different ridge. Elk and Pronghorn would be “encouraged” to stay around the area.To use this language when talking about WILDLIFE is almost comical. To “accommadate” Mule deer they need wide open undisturbed areas. To :encourage” elk and pronghorn I guess you might try baiting?I do like the idea of a state shooting range. I also agree that there are few places in Wyoming that can be developed for something like the shooting complex. The good thing that is happening is all the considerations. Unfortunately this does not take place with large tracts of land used for private enterprise. It is very interesting to note some of the vocabulary in this article. It is stated Mule deer will be “accommodated” to use a different ridge. Elk and Pronghorn would be “encouraged” to stay around the area.To use this language when talking about WILDLIFE is almost comical. To “accommadate” Mule deer they need wide open undisturbed areas. To :encourage” elk and pronghorn I guess you might try baiting?I do like the idea of a state shooting range. I also agree that there are few places in Wyoming that can be developed for something like the shooting complex. The good thing that is happening is all the considerations. Unfortunately this does not take place with large tracts of land used for private enterprise. Brian R Skeochsays:June 6, 2025 at 8:50 amShouldnt this have been the first thing to be looked at?Reply Shouldnt this have been the first thing to be looked at? Shouldnt this have been the first thing to be looked at? Greg Huntersays:June 6, 2025 at 8:19 amI have been watching and commenting on this complex since its proposal, so I have been waiting to see if any of my concerns were addressed. The answer is a resounding NO.I have been involved with evaluating shooting ranges since 1988 from indoor units in the basement of National Guard facilities to the ones operated by the US Army at Fort Knox and Campbell. One of the biggest things that all these activities overlooked was the deposition and migration of lead (Pb). Since 1988, indoor ranges have been closed or significantly modified to reduce the lead exposure to the shooters, but outdoor ranges are another story. These ranges have lead (Pb) spread from the blast zone all the way down range to where the projectile lands. Every outdoor range I have ever evaluated generates far more motile lead (Pb) than has been perceived by the operators or the public.During a committee meeting I recommended that a representative from Wyoming Department of Environmental Quality be added to the Wyoming State Shooting Complex Joint Powers Board, but that did not happen.I have just searched the 241 page proposal and there was exactly one mention of lead (Pb) in the entire document with a reference to Appendix 14, which I cannot find. Oh well, I guess those happy humans and animals will enjoy frolicking in the lead (Pb) and noise generated by this wonderful operation. Just ask Senator Hicks or the Firearms Research Center.Reply I have been watching and commenting on this complex since its proposal, so I have been waiting to see if any of my concerns were addressed. The answer is a resounding NO. I have been involved with evaluating shooting ranges since 1988 from indoor units in the basement of National Guard facilities to the ones operated by the US Army at Fort Knox and Campbell. One of the biggest things that all these activities overlooked was the deposition and migration of lead (Pb). Since 1988, indoor ranges have been closed or significantly modified to reduce the lead exposure to the shooters, but outdoor ranges are another story. These ranges have lead (Pb) spread from the blast zone all the way down range to where the projectile lands. Every outdoor range I have ever evaluated generates far more motile lead (Pb) than has been perceived by the operators or the public. During a committee meeting I recommended that a representative from Wyoming Department of Environmental Quality be added to the Wyoming State Shooting Complex Joint Powers Board, but that did not happen. I have just searched the 241 page proposal and there was exactly one mention of lead (Pb) in the entire document with a reference to Appendix 14, which I cannot find. Oh well, I guess those happy humans and animals will enjoy frolicking in the lead (Pb) and noise generated by this wonderful operation. Just ask Senator Hicks or the Firearms Research Center. I have been watching and commenting on this complex since its proposal, so I have been waiting to see if any of my concerns were addressed. The answer is a resounding NO. I have been involved with evaluating shooting ranges since 1988 from indoor units in the basement of National Guard facilities to the ones operated by the US Army at Fort Knox and Campbell. One of the biggest things that all these activities overlooked was the deposition and migration of lead (Pb). Since 1988, indoor ranges have been closed or significantly modified to reduce the lead exposure to the shooters, but outdoor ranges are another story. These ranges have lead (Pb) spread from the blast zone all the way down range to where the projectile lands. Every outdoor range I have ever evaluated generates far more motile lead (Pb) than has been perceived by the operators or the public. During a committee meeting I recommended that a representative from Wyoming Department of Environmental Quality be added to the Wyoming State Shooting Complex Joint Powers Board, but that did not happen. I have just searched the 241 page proposal and there was exactly one mention of lead (Pb) in the entire document with a reference to Appendix 14, which I cannot find. Oh well, I guess those happy humans and animals will enjoy frolicking in the lead (Pb) and noise generated by this wonderful operation. Just ask Senator Hicks or the Firearms Research Center. Rick Jonessays:June 6, 2025 at 7:35 amOh no, not another Cody region blunder, both ecologically and economically. Our greatest natural resource in Wyoming is our wildlife and a minority of gun nuts wants to pave paradise. Isn’t there already a large shooting range just North of Cody? Yes, there is and with all of the loud shooting and maneuvering of people hardly any wild critters can be found. But funny that some members of the task force are claiming that excessive shooting and human presence attracts wildlife!? Crucial mule deer range and within core sage grouse habitat and oh great there’ll be more deer and sage grouse, can’t forgot all those chukkers running around, this place will be like a petting zoo! Another aspect regarding the business plan of this ill advised shooting complex is that it’ll basically turn into a de facto private little club for a select few sponsored by the taxpayers. Readers should research the amount of millions of dollars sent from Cheyenne up to Cody in the guise of economic development (Forward Cody) that has resulted in empty buildings and very few if any substantial jobs. Our Game & Fish dept needs to step up and be heard before these same Forward Cody types pull their shenanigans again.ReplyEd Daviessays:June 6, 2025 at 8:24 pmI just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy?Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line.Reply Oh no, not another Cody region blunder, both ecologically and economically. Our greatest natural resource in Wyoming is our wildlife and a minority of gun nuts wants to pave paradise. Isn’t there already a large shooting range just North of Cody? Yes, there is and with all of the loud shooting and maneuvering of people hardly any wild critters can be found. But funny that some members of the task force are claiming that excessive shooting and human presence attracts wildlife!? Crucial mule deer range and within core sage grouse habitat and oh great there’ll be more deer and sage grouse, can’t forgot all those chukkers running around, this place will be like a petting zoo! Another aspect regarding the business plan of this ill advised shooting complex is that it’ll basically turn into a de facto private little club for a select few sponsored by the taxpayers. Readers should research the amount of millions of dollars sent from Cheyenne up to Cody in the guise of economic development (Forward Cody) that has resulted in empty buildings and very few if any substantial jobs. Our Game & Fish dept needs to step up and be heard before these same Forward Cody types pull their shenanigans again. Ed Daviessays:June 6, 2025 at 8:24 pmI just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy?Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line.Reply I just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy? Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line. Oh no, not another Cody region blunder, both ecologically and economically. Our greatest natural resource in Wyoming is our wildlife and a minority of gun nuts wants to pave paradise. Isn’t there already a large shooting range just North of Cody? Yes, there is and with all of the loud shooting and maneuvering of people hardly any wild critters can be found. But funny that some members of the task force are claiming that excessive shooting and human presence attracts wildlife!? Crucial mule deer range and within core sage grouse habitat and oh great there’ll be more deer and sage grouse, can’t forgot all those chukkers running around, this place will be like a petting zoo! Another aspect regarding the business plan of this ill advised shooting complex is that it’ll basically turn into a de facto private little club for a select few sponsored by the taxpayers. Readers should research the amount of millions of dollars sent from Cheyenne up to Cody in the guise of economic development (Forward Cody) that has resulted in empty buildings and very few if any substantial jobs. Our Game & Fish dept needs to step up and be heard before these same Forward Cody types pull their shenanigans again. Ed Daviessays:June 6, 2025 at 8:24 pmI just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy?Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line.Reply I just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy? Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line. I just want to know who is paying whom off in this whole ill conceived enterprise. Seriously, what other explanation is there for this lunacy? Somebody with connections to CJ Box should make sure he is aware of this travesty. Perfect grist for his next story line. Jerry Longobardisays:June 6, 2025 at 7:33 amIt is interesting, that on one hand Larry Hicks is currently proposing a bill that would compensate Wyoming residents for loss of property (wildlife) when large projects displace wildlife and on the other hand, is a lead proponent on a large project that will use millions of Wyoming residents tax payers dollars that is guaranteed to displace wildlife. Is this a fiscally and wise use of limited Wyoming taxpayers dollars ?Reply It is interesting, that on one hand Larry Hicks is currently proposing a bill that would compensate Wyoming residents for loss of property (wildlife) when large projects displace wildlife and on the other hand, is a lead proponent on a large project that will use millions of Wyoming residents tax payers dollars that is guaranteed to displace wildlife. Is this a fiscally and wise use of limited Wyoming taxpayers dollars ? It is interesting, that on one hand Larry Hicks is currently proposing a bill that would compensate Wyoming residents for loss of property (wildlife) when large projects displace wildlife and on the other hand, is a lead proponent on a large project that will use millions of Wyoming residents tax payers dollars that is guaranteed to displace wildlife. Is this a fiscally and wise use of limited Wyoming taxpayers dollars ? Doug Olsensays:June 6, 2025 at 6:03 amCody already has a good rifle skeet pistol ranges and a 3D archery range on the other side of town.IMO this range isn’t really needed. Waste of money???ReplyEd Daviessays:June 6, 2025 at 8:25 pmWhy the question marks?Reply Cody already has a good rifle skeet pistol ranges and a 3D archery range on the other side of town. IMO this range isn’t really needed. Waste of money??? Ed Daviessays:June 6, 2025 at 8:25 pmWhy the question marks?Reply Why the question marks? Cody already has a good rifle skeet pistol ranges and a 3D archery range on the other side of town. IMO this range isn’t really needed. Waste of money??? Ed Daviessays:June 6, 2025 at 8:25 pmWhy the question marks?Reply Why the question marks? Why the question marks? Robert Hoskinssays:June 6, 2025 at 5:58 amAside from all the critical problems mentioned here, to include muzzling legitimate biological and ecological concerns from G&F for the Park County location, the last thing we need in the Greater Yellowstone Ecosystem is another tourist facility in a place that lacks the infrastructure to support it. Clearly, the Gillette location is preferable. I myself thought a centrally located facility near Casper would have been better, but Gillette is much better than Park County.A lawsuit against the Park County location is in order.Reply Aside from all the critical problems mentioned here, to include muzzling legitimate biological and ecological concerns from G&F for the Park County location, the last thing we need in the Greater Yellowstone Ecosystem is another tourist facility in a place that lacks the infrastructure to support it. Clearly, the Gillette location is preferable. I myself thought a centrally located facility near Casper would have been better, but Gillette is much better than Park County. A lawsuit against the Park County location is in order. Aside from all the critical problems mentioned here, to include muzzling legitimate biological and ecological concerns from G&F for the Park County location, the last thing we need in the Greater Yellowstone Ecosystem is another tourist facility in a place that lacks the infrastructure to support it. Clearly, the Gillette location is preferable. I myself thought a centrally located facility near Casper would have been better, but Gillette is much better than Park County. A lawsuit against the Park County location is in order. Richard Nielsensays:June 6, 2025 at 5:46 amWe wanted it in Gillette, but we were out spent by the outfitter and tourist lobbies.Reply We wanted it in Gillette, but we were out spent by the outfitter and tourist lobbies. We wanted it in Gillette, but we were out spent by the outfitter and tourist lobbies. BJ Petersonsays:June 6, 2025 at 12:01 am“Paved paradise, put up a parking lot” While maybe it won’t have a pink hotel, it will undoubtedly change the landscape forever. “Don’t it always seem to go, that you don’t know what you got ’til it’s gone” Can we for once consider the consequences of our actions, or are we doomed to go thru life blissfully oblivious to the effect that these destructive decisions have on the fabric of life.Reply “Paved paradise, put up a parking lot” While maybe it won’t have a pink hotel, it will undoubtedly change the landscape forever. “Don’t it always seem to go, that you don’t know what you got ’til it’s gone” Can we for once consider the consequences of our actions, or are we doomed to go thru life blissfully oblivious to the effect that these destructive decisions have on the fabric of life. “Paved paradise, put up a parking lot” While maybe it won’t have a pink hotel, it will undoubtedly change the landscape forever. “Don’t it always seem to go, that you don’t know what you got ’til it’s gone” Can we for once consider the consequences of our actions, or are we doomed to go thru life blissfully oblivious to the effect that these destructive decisions have on the fabric of life. Bruce Lawtonsays:June 5, 2025 at 10:39 pmI know the northwest part of the state has all the big money, and the tourists and famous mountains, but the shooting complex is supposedly for the state of Wyoming residents? Was that fact was even cosidered? Why was it not sited in the center of the state? I bet there are a lot of residents in this state that are being bypassed that own a significant number of fire arms that would really like to have access to the facility without having to drive a full day to get to it but do not have that option or the political pull to get it centrally located. Too bad for us!Reply I know the northwest part of the state has all the big money, and the tourists and famous mountains, but the shooting complex is supposedly for the state of Wyoming residents? Was that fact was even cosidered? Why was it not sited in the center of the state? I bet there are a lot of residents in this state that are being bypassed that own a significant number of fire arms that would really like to have access to the facility without having to drive a full day to get to it but do not have that option or the political pull to get it centrally located. Too bad for us! I know the northwest part of the state has all the big money, and the tourists and famous mountains, but the shooting complex is supposedly for the state of Wyoming residents? Was that fact was even cosidered? Why was it not sited in the center of the state? I bet there are a lot of residents in this state that are being bypassed that own a significant number of fire arms that would really like to have access to the facility without having to drive a full day to get to it but do not have that option or the political pull to get it centrally located. Too bad for us! Joseph Mayersays:June 5, 2025 at 7:28 pmI live in Florida, I have relatives in Cheyenne. I grew up loving animals, nature. I am a lifetime NRA Member, a Veteran, I do not hunt, trap. I picked up injured wildlife for South Florida Wildlife Care Center for 8.5 years till I had to move north to a more affordable area. Now this area is being over run by development, eastern central Florida. It is becoming a culture for developers to over ride environmental laws and common sense.The wildlife is seeing more poaching, hunting, BLM horse, donkey, buffalo, roundups, land clearing seemingly with little regard for the wildlife other than selling hunt licenses, tags, etc. I am very sad to see the places out west become land grabs, litigious battles and again the wildlife loses. This is the last generation to be able to save what is left before large quantities of mass extinctions come true, not just on land but seas. I grew up on cowboy movies and always thought the west would protect the wild life. I have been sickened to see what has evolved today where I live but also in the west. I am 75 and see what could change and what probably won’t. I try to be a voice for animals but computers and digital media has allowed the separation of government officials from the people.You are lucky to get anyone on a phone live and corruption, grift and cover ups have made it worse all across the board. I hope you make right choices for your area and for wildlife. Time is running out. Go for the money or go for nature. It is your choice.Reply I live in Florida, I have relatives in Cheyenne. I grew up loving animals, nature. I am a lifetime NRA Member, a Veteran, I do not hunt, trap. I picked up injured wildlife for South Florida Wildlife Care Center for 8.5 years till I had to move north to a more affordable area. Now this area is being over run by development, eastern central Florida. It is becoming a culture for developers to over ride environmental laws and common sense.The wildlife is seeing more poaching, hunting, BLM horse, donkey, buffalo, roundups, land clearing seemingly with little regard for the wildlife other than selling hunt licenses, tags, etc. I am very sad to see the places out west become land grabs, litigious battles and again the wildlife loses. This is the last generation to be able to save what is left before large quantities of mass extinctions come true, not just on land but seas. I grew up on cowboy movies and always thought the west would protect the wild life. I have been sickened to see what has evolved today where I live but also in the west. I am 75 and see what could change and what probably won’t. I try to be a voice for animals but computers and digital media has allowed the separation of government officials from the people.You are lucky to get anyone on a phone live and corruption, grift and cover ups have made it worse all across the board. I hope you make right choices for your area and for wildlife. Time is running out. Go for the money or go for nature. It is your choice. I live in Florida, I have relatives in Cheyenne. I grew up loving animals, nature. I am a lifetime NRA Member, a Veteran, I do not hunt, trap. I picked up injured wildlife for South Florida Wildlife Care Center for 8.5 years till I had to move north to a more affordable area. Now this area is being over run by development, eastern central Florida. It is becoming a culture for developers to over ride environmental laws and common sense.The wildlife is seeing more poaching, hunting, BLM horse, donkey, buffalo, roundups, land clearing seemingly with little regard for the wildlife other than selling hunt licenses, tags, etc. I am very sad to see the places out west become land grabs, litigious battles and again the wildlife loses. This is the last generation to be able to save what is left before large quantities of mass extinctions come true, not just on land but seas. I grew up on cowboy movies and always thought the west would protect the wild life. I have been sickened to see what has evolved today where I live but also in the west. I am 75 and see what could change and what probably won’t. I try to be a voice for animals but computers and digital media has allowed the separation of government officials from the people.You are lucky to get anyone on a phone live and corruption, grift and cover ups have made it worse all across the board. I hope you make right choices for your area and for wildlife. Time is running out. Go for the money or go for nature. It is your choice. Duane Kerrsays:June 5, 2025 at 6:48 pmSame old story. Wildlife suffers again, particularly sensitive species like sage grouse and mule deer. Political pressure wins again.Reply Same old story. Wildlife suffers again, particularly sensitive species like sage grouse and mule deer. Political pressure wins again. Same old story. Wildlife suffers again, particularly sensitive species like sage grouse and mule deer. Political pressure wins again. Cory Smithsays:June 5, 2025 at 5:59 pmSo, best case scenario is that this shooting range could only be in operation for half a year? Huh? This news piece is exposing another ‘huge’ project in Cody using $millions of State funds that will either turn out to be a bust or an underperforming disappointment. Not surprised by Game and Fish Deputy Director Dan Smith being non committal and passing the buck. While he was the head game warden in the Cody district he let a rogue warden run wild and rack up millions in attorney fees due to lawsuits.The 2nd place choice, Gillette, needs to stand by and be ready to take the reigns. It was by far the best location and if wiser heads prevail this shooting complex project will not be another notorious Cody bustReply So, best case scenario is that this shooting range could only be in operation for half a year? Huh? This news piece is exposing another ‘huge’ project in Cody using $millions of State funds that will either turn out to be a bust or an underperforming disappointment. Not surprised by Game and Fish Deputy Director Dan Smith being non committal and passing the buck. While he was the head game warden in the Cody district he let a rogue warden run wild and rack up millions in attorney fees due to lawsuits. The 2nd place choice, Gillette, needs to stand by and be ready to take the reigns. It was by far the best location and if wiser heads prevail this shooting complex project will not be another notorious Cody bust So, best case scenario is that this shooting range could only be in operation for half a year? Huh? This news piece is exposing another ‘huge’ project in Cody using $millions of State funds that will either turn out to be a bust or an underperforming disappointment. Not surprised by Game and Fish Deputy Director Dan Smith being non committal and passing the buck. While he was the head game warden in the Cody district he let a rogue warden run wild and rack up millions in attorney fees due to lawsuits. The 2nd place choice, Gillette, needs to stand by and be ready to take the reigns. It was by far the best location and if wiser heads prevail this shooting complex project will not be another notorious Cody bust Joe Burnssays:June 5, 2025 at 4:11 pmYea…I’m calling BS on loud and continuous gunfire attracting wildlife. Nephi Cole and Larry Hicks are piling it on pretty deep. No, Mr. Hicks, deer, bighorn sheep and chukar will not be “running all over the place” they’ll be running away from the place forever. Building this monstrosity in crucial mule deer habitat and core sage grouse habitat is absolutely ridiculous as well as the Park County commissioners pledging $750,000 to build the road without approval from Park County citizenry. This project is an impending disaster for both taxpayers and wildlife.ReplyGordon Townsendsays:June 9, 2025 at 6:26 amOnly Larry Hicks could come up with something that stupid.Reply Yea…I’m calling BS on loud and continuous gunfire attracting wildlife. Nephi Cole and Larry Hicks are piling it on pretty deep. No, Mr. Hicks, deer, bighorn sheep and chukar will not be “running all over the place” they’ll be running away from the place forever. Building this monstrosity in crucial mule deer habitat and core sage grouse habitat is absolutely ridiculous as well as the Park County commissioners pledging $750,000 to build the road without approval from Park County citizenry. This project is an impending disaster for both taxpayers and wildlife. Gordon Townsendsays:June 9, 2025 at 6:26 amOnly Larry Hicks could come up with something that stupid.Reply Only Larry Hicks could come up with something that stupid. Yea…I’m calling BS on loud and continuous gunfire attracting wildlife. Nephi Cole and Larry Hicks are piling it on pretty deep. No, Mr. Hicks, deer, bighorn sheep and chukar will not be “running all over the place” they’ll be running away from the place forever. Building this monstrosity in crucial mule deer habitat and core sage grouse habitat is absolutely ridiculous as well as the Park County commissioners pledging $750,000 to build the road without approval from Park County citizenry. This project is an impending disaster for both taxpayers and wildlife. Gordon Townsendsays:June 9, 2025 at 6:26 amOnly Larry Hicks could come up with something that stupid.Reply Only Larry Hicks could come up with something that stupid. Only Larry Hicks could come up with something that stupid. CJ Clarksays:June 5, 2025 at 3:55 pmBesides the irreversible damage to wildlife habit and migration corridors, many local citizens in opposition, this project also reeks of just another Cody/Park County economic boondoggle. Funny you’d mention Glen Ross. Mr. Ross has been a cog in the wheel of the local economic development force, Forward Cody (known to many as Backward Cody). Forward Cody via Ross’ buddy Mr. James Klessens has been the catalyst for many, many big dollar failed projects that have swallowed up millions of dollars of State money. Almost too many to mention, but Eleutian, Cody Labs and the ill fated Kanye West “yeezy” shoe factory quickly come to mind. There are 1,000’s and 1,000’s of square footage of huge new and shiny empty buildings dotting Cody and Park County thanks to the Forward Cody cabal. Not only is this proposed Shooting Complex a disaster for wildlife, it’s suffers from extremely poor local leadership with a history of big failure so Cody/Park County/State of Wyoming, get ready for another boondoggleReply Besides the irreversible damage to wildlife habit and migration corridors, many local citizens in opposition, this project also reeks of just another Cody/Park County economic boondoggle. Funny you’d mention Glen Ross. Mr. Ross has been a cog in the wheel of the local economic development force, Forward Cody (known to many as Backward Cody). Forward Cody via Ross’ buddy Mr. James Klessens has been the catalyst for many, many big dollar failed projects that have swallowed up millions of dollars of State money. Almost too many to mention, but Eleutian, Cody Labs and the ill fated Kanye West “yeezy” shoe factory quickly come to mind. There are 1,000’s and 1,000’s of square footage of huge new and shiny empty buildings dotting Cody and Park County thanks to the Forward Cody cabal. Not only is this proposed Shooting Complex a disaster for wildlife, it’s suffers from extremely poor local leadership with a history of big failure so Cody/Park County/State of Wyoming, get ready for another boondoggle Besides the irreversible damage to wildlife habit and migration corridors, many local citizens in opposition, this project also reeks of just another Cody/Park County economic boondoggle. Funny you’d mention Glen Ross. Mr. Ross has been a cog in the wheel of the local economic development force, Forward Cody (known to many as Backward Cody). Forward Cody via Ross’ buddy Mr. James Klessens has been the catalyst for many, many big dollar failed projects that have swallowed up millions of dollars of State money. Almost too many to mention, but Eleutian, Cody Labs and the ill fated Kanye West “yeezy” shoe factory quickly come to mind. There are 1,000’s and 1,000’s of square footage of huge new and shiny empty buildings dotting Cody and Park County thanks to the Forward Cody cabal. Not only is this proposed Shooting Complex a disaster for wildlife, it’s suffers from extremely poor local leadership with a history of big failure so Cody/Park County/State of Wyoming, get ready for another boondoggle **Latest News** **Teton County becomes world’s first dark sky county** **Wyoming sorority sisters file new lawsuit, but drop transgender student from case** **Savvy 13-year-old Teton wolf almost breaks all-time age record** **Gillette Council to cut funds for clinic that provides low-cost birth control, cancer screenings and STD testing** **Litigation over Wyoming’s beleaguered Star Plunge could last ‘years,’ owner says** Want quality Wyoming news delivered directly to your inbox? Sign up for our free daily newsletter. About us Careers Write for us Become a Member Report an error Donate Underwriting How to republish Contact us Newsletter archive Mobile app Facebook Bluesky YouTube Instagram LinkedIn TikTok X"}