{"id": 2173, "name": "Washington Examiner", "domain": "washingtonexaminer.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "\n              https://www.washingtonexaminer.com/in_focus/3425722/what-happens-when-cartel-kills-americans-trump-cjng-terrorism-drugs/              \n              ", "title": "What Happens When Cartel Kills Americans Trump Cjng Terrorism Drugs", "content": "Sign In Home NewsPoliticsWhite HouseSenateHouseCampaigns PoliticsWhite HouseSenateHouseCampaigns White House Senate House Campaigns PoliticsWhite HouseSenateHouseCampaigns White House Senate House Campaigns White House Senate House Campaigns Policy OpinionEditorialsOp-Eds Editorials Op-Eds Editorials Op-Eds In Focus Restoring America Magazine Watch SponsoredNational ParksExamining Tax Reform National Parks Examining Tax Reform National Parks Examining Tax Reform TWS Archive NewsPoliticsWhite HouseSenateHouseCampaignsBusinessWorldInvestigationsJusticeSupreme CourtCrimeEntertainmentWashington SecretsSports PoliticsWhite HouseSenateHouseCampaigns White House Senate House Campaigns Business World Investigations Justice Supreme Court Crime Entertainment Washington Secrets Sports PoliticsWhite HouseSenateHouseCampaigns White House Senate House Campaigns White House Senate House Campaigns Business World Investigations Justice Supreme Court Crime Entertainment Washington Secrets Sports PolicyDefenseNational SecurityEnergy and EnvironmentEducationImmigrationFinance and EconomyHealthcareForeign PolicyTechInfrastructureSpace Defense National Security Energy and Environment Education Immigration Finance and Economy Healthcare Foreign Policy Tech Infrastructure Space Defense National Security Energy and Environment Education Immigration Finance and Economy Healthcare Foreign Policy Tech Infrastructure Space Trump Administration IN FOCUSCultural IssuesIdeological IssuesPolitical Issues Cultural Issues Ideological Issues Political Issues Cultural Issues Ideological Issues Political Issues OpinionColumnistsEditorialsThink TanksBeltway ConfidentialOp-EdsEditorial Cartoons Columnists Editorials Think Tanks Beltway Confidential Op-Eds Editorial Cartoons Columnists Editorials Think Tanks Beltway Confidential Op-Eds Editorial Cartoons Restoring AmericaPatriotism & UnityFaith, Freedom & Self-RelianceCourage, Strength & OptimismEquality, Not ElitismCommunity & FamilyFairness & JusticeMission Patriotism & Unity Faith, Freedom & Self-Reliance Courage, Strength & Optimism Equality, Not Elitism Community & Family Fairness & Justice Mission Patriotism & Unity Faith, Freedom & Self-Reliance Courage, Strength & Optimism Equality, Not Elitism Community & Family Fairness & Justice Mission WatchThe LatestThe Debrief ShowReporter’s Notebook ShowPolitical Perspectives ShowRestoring America ShowMorning Wake-Up The Latest The Debrief Show Reporter’s Notebook Show Political Perspectives Show Restoring America Show Morning Wake-Up The Latest The Debrief Show Reporter’s Notebook Show Political Perspectives Show Restoring America Show Morning Wake-Up MagazineMagazineQuarterly BriefingArchivesBook of the MonthGames Magazine Quarterly Briefing Archives Book of the Month Games Magazine Quarterly Briefing Archives Book of the Month Games SponsoredNational ParksExamining Tax Reform National Parks Examining Tax Reform National Parks Examining Tax Reform Newsletters **What happens when the Jalisco New Generation Cartel kills Americans?** The Jalisco New Generation Cartelappears to be gradually displacingthe once vaunted Sinaloa cartel asMexico’sdominantdrug cartel. But the United States isn’t sitting idle. PresidentDonald Trumpdesignated the CJNG, Sinaloa cartel, and other drug trafficking organizations as terrorist groups on his first day in office. Thereare strong indicationsthat the CIA is now engaged in covert action against these organizations. **Recommended Stories** Real wages up 1.3%, inflation down 20% since Trump took office A 'Blue Texas' means more abortion focus Democrats keep choosing losing issues More robust measures are needed to stem the flow of drugs across American borders and to assist Mexican people in restoring a basic degree of order over their country. The consumption of illegal drugs by Americans fuels the cartel wars and their misery in Mexico, so we have an obligation to help Mexico secure a better future. Still, Americans must recognize that a future of reduced drug smuggling into the U.S. and reduced violence and corruption in Mexico will be hard to secure. Facing increasing U.S. efforts to weaken their power, the cartels, the CJNG in particular, are likely to target American citizens. While it may do so via proxies to hide its culpability, Americans must be ready for the coming bloody storm. AsI noted recently, “CJNG is led by Nemesio [Rubén] Oseguera Cervantes, also known as ‘El Mencho.’ A former police officer who once served prison time in the U.S., El Mencho has subsequently established the CJNG’s reputation for near-psychopathic brutality. Torturing and killing competitors and their families, El Mencho has corralled numerous other cartels and their operatives under his control.” The CJNG makes tens of billions of dollars every year by exporting drugs north. But it also makes hundreds of millions of dollars by skimming and selling oil from Mexico’s corrupt state-owned oil producer, Pemex. There are further complications in addressing the CJNG challenge. For one, while the CJNG might revel in extreme violence, its leadership is smart. The group benefits from a highly adept finance unit that expertly hides its money. The leader of that unit has been in prison for 10 years, but thus far, the Mexican government has refused a U.S. request to extradite him. This reflects the government’s concern that extradition might implicate powerful former or active Mexican officials and cause CJNG to pursue even greater bloodletting. The CJNG has also taken advantage of a Sinaloa cartel civil war following the U.S. arrest of Ismael “El Mayo” Zambada García last year. This strife has seen one of Joaquín “El Chapo” Guzmán’s sons, Iván Archivaldo Guzmán Salazar, ally with the CJNG against El Mayo’s supporters. The group has also recently advanced itscontrolover the highly lucrative Tijuana border crossing into San Diego. Put simply, where the CJNG’s power was rising fast, it is now surging. The CJNG will be loath to sacrifice its growing profitability and associated ability to shape Mexican politics just because Trump has ordered a cartel crackdown, hence why U.S. citizens visiting Mexico will need to be increasingly wary. The group has an exceptional appetite for brutality, inuring recruits to extreme violence by forcing themto cannibalizetheir prisoners, for example. El Mencho’s men have also been found to use large camps to train new hitmen andexecute kidnapped victims. They revel in variably kidnapping, torturing, or gunning down civilians, politicians, and police officers who cannot be bought. Indeed, CJNG regularly murders innocent people simply to intimidate others in the same area. Put simply, there is nothing that the group has shown itself unwilling to do to advance its agenda. We must expect reprisals if and when the Mexican cartels’ manufacturing plants, smuggling teams, stateside criminal syndicates, and senior leaders start being hit with indictments, bullets, and renditions. Again, the CJNG is likely to be a particular problem in this regard. The Sinaloa cartel hopes its close links to President Claudia Sheinbaum Pardo’s ruling Morena party will mean it can find shelter and wait out the toughest U.S. actions. In contrast, the CJNG’s natural impulse is to react with outsize violence and intimidation in response to any challenge. What might this mean in practice? We could see attacks on American college students partying in Cancún or older Americans on cruise ships stopping at Mexican ports. We could see rocket attacks on the U.S. Embassy (theWashington Examinerunderstands that the CJNG has previously targeted U.S. diplomatic staff and CIA officers) or assassination attempts against U.S. diplomats, Drug Enforcement Administration agents, or other public servants in Mexico. We could see attacks on Customs and Border Protection officers at border crossings or police officers working on CJNG-related investigations across the U.S. We could even see plots to target Trump administration officials. It’s also important to note that the CJNG, unlike the Islamic State or Hezbollah, doesn’t need to work extremely hard to infiltrate the U.S. and remain hidden from FBI counterterrorism squads. It already has a significant U.S. logistics network, operational presence, and close relationships with various U.S.-based organized crime groups. The DEA says the group has a particularly strong presence in Los Angeles, New York, Chicago, Houston, and Atlanta. This presence provides the CJNG with the credible means of developing and conducting firearms or explosive attacks on U.S. soil with far greater ease than would be the case for most terrorist groups. The CJNG has a great tolerance for escalation and strategic risk. The group became the powerhouse it is today by relentlessly targeting both perceived and actual opponents and by having little consideration for the second- and third-order risks its hyperaggressive strategy carried. All of which raises a question: What should the U.S. do if and when the CJNG decides to target Americans? The short answer is to make them pay for it in ways they do not expect. Reflecting his latitude for aggressive covert action in the shadows, Trump should respond to any CJNG attacks on U.S. interests by authorizing lethal strikes against any and all CJNG personnel the U.S. can identify. Paramilitary officers from the CIA’s Special Operations Group should be ordered to launch raids to kill CJNG officers or capture and forcibly relocate them back to the U.S. The fact that the CJNG’s key territories border the Pacific Ocean increases the feasibility of unilateral U.S. actions against the group. Those targeted should include politicians, police officers, financiers, and other collaborators who are found. At the same time, the National Security Agency should hack and empty CJNG’s bank and crypto accounts. The group’s partners abroad should share in this miserable plight. The group must be made to understand that its capacity to inflict harm on the U.S. is woefully outmatched by the U.S. government’s ability to inflict harm upon it. Mexican government complaints should be ignored in this warlike scenario. NATO’S TROUBLING NEW ADDICTION TO DEFENSE SPENDING GIMMICKS Where does this leave us? With the basic truth that Trump is determined to confront a great storm of chaos south of the border. And a basic reality that as he does so, the chaos will increasingly encompass Americans. Tags Drug Cartels Drug Enforcement Administration In Focus Mexico National Security Political Issues Terrorism Trump Administration **Hegseth refuses to disclose details of Air Force’s Qatar jet deal** **Anti-ICE protests go beyond LA: What other cities have seen demonstrations** **Standing in case on drug prices controls pivotal to litigation** **Rubio condemns nations that sanctioned Israeli ministers** **GOP governors prepared to stamp out LA-like violence ahead of anti-Trump ‘No Kings’ protests** **NEWS** PoliticsWhite HouseSenateHouseCampaigns White House Senate House Campaigns White House Senate House Campaigns Business World Investigations Justice Supreme Court Crime Washington Secrets Entertainment Sports **POLICY** Defense National Security Energy Immigration Finance and Economy Healthcare Foreign Policy Tech Infrastructure Space **COMMENTARY** Columnists Editorials Think Tanks Beltway Confidential Op-Eds Editorial Cartoons **RESTORING AMERICA** Patriotism & Unity Faith, Freedom & Self-Reliance Courage, Strength & Optimism Equality, Not Elitism Community & Family Fairness & Justice Mission **WATCH** ShowsThe DebriefReporters NotebookByron YorkKaylee McGhee WhiteMorning WakeupWEX Minute The Debrief Reporters Notebook Byron York Kaylee McGhee White Morning Wakeup WEX Minute The Debrief Reporters Notebook Byron York Kaylee McGhee White Morning Wakeup WEX Minute Latest Interviews On The Trail Newsletters Magazine Archive Policies and Standards Terms Of Service Subscription Terms of Use Privacy Policy Your Privacy Choices Transparency In Coverage Advertise Subscribe Contact Careers Staff About Examiner Facebook Twitter"}