{"id": 1200, "name": "Rolling Stone", "domain": "rollingstone.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rollingstone.com/product-recommendations/lifestyle/watch-nba-playoffs-online-livestream-basketball-2025-1235320253/", "title": "Product Recommendations", "content": "Music Politics TV & Movies Culture RS Recommends **How to Watch the NBA Playoffs Online Without Cable** Facebook X email **How to Watch the NBA Playoffs Online Without Cable** ByOscar Hartzog **Oscar Hartzog** Lewis Hamilton Turns Another Corner In Lululemon’s New Metal Vent Tech Gear — Shop His Collection Here Inspired by Tennis Looks at the French Open? Shop Lacoste’s Limited-Time Sale These Digital Gifts Can Be Ordered Online (and Delivered Instantly for Father’s Day) If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission. The 2025NBAPlayoffs have reached their finale as the No. 1 Oklahoma City Thunder prepare to square off against the No. 4 Indiana Pacers. Both young teams are chasing their first NBA title (technically), promising an exciting outcome either way. The Thunder punched their ticket to the finals with a fairly breezy five-game series against the Minnesota Timberwolves, while the Pacers secured their spot after a six-game battle against the New York Knicks. **At a Glance: How to Watch the NBA Playoffs** Stream:DirecTV,Fubo,Sling TV Channel(finals): ABC Dates: April 19-June 22 (latest) As always, the NBA Playoffs are primarily available on cable TV channels. If you’ve cut the cord since last season’s playoffs, read on. Ahead, we’ve put together a full guide on the best ways to livestream the NBA Playoffs without cable, including key details aboutbasketball’s biggest tournament. **How to Watch the NBA Playoffs Online** Coverage of the playoffs was spread out across multiple channels, but the NBA Finals are only on ABC. If you don’t have cable, you’ll need to get alive TV streaming servicethat carries ABC to watch the NBA Finals online. Here are two of the best options, including a quick review of each: **DirecTV** DirecTV now offers packages that don’t require any hardware, but still deliver the same comprehensive live TV coverage you’d expect from the brand. Better yet, DirecTV now offers a streamlined “MySports” package that carries 20+ topsportschannels — including ABC for NBA Finals livestreams. This package costs $69.99 a month (less than similar packages) and starts with afive-day free trial. **Fubo** ➤Pros: Huge channel lineup, great local coverage, RSNs, watch on 10 screens➤Cons: No Warner Bros. channels (TNT, CNN, TBS, etc.), pricey Another top choice for sports fans looking to stream the NBA Finals is Fubo. Subscriptions start with afive-day free trialand deliver an impressive lineup of 150+ channels, including ABC. It does come at a higher price, with plans starting at $84.99 per month, but you can also score $20 off your first month with Fubo’s current promotion. **Sling TV** Another great live TV streaming service you can use to watch the NBA Playoffs online is Sling. Fans can get ABC in Sling’s Blue package, which starts at the very affordable price of $45.99 a month. Better yet, you can get50% off your first month. Sling does not offer a free trial, however. **NBA Playoffs Schedule, Bracket 2025** The 2025 NBA Playoffs started on April 19 and run through the NBA Finals. The Finals begin on June 5 and run as late as June 22, if a Game 7 is necessary. Here’s the schedule for the NBA Finals: Game 1: Pacers at Thunder — Wednesday, June 5, 8:30 p.m. ET Game 2: Pacers at Thunder — Friday, June 8, 8 p.m. ET Game 3: Thunder at Pacers — Monday, June 11, 8:30 p.m. ET Game 4: Thunder at Pacers — Thursday, June 13, 8:30 p.m. ET Game 5*: Pacers at Thunder — Saturday, June 16, 8:30 p.m. ET Game 6*: Thunder at Pacers — Tuesday, June 19, 8:30 p.m. ET Game 7*: Pacers at Thunder — Friday, June 22, 8 p.m. ET * If necessary Basketball, noads, RS Recommends, sports RS Recommends Lifestyle **More News** How to Watch Thunder vs. Pacers NBA Finals Games OnlineNBA FinalsByOscar Hartzog **How to Watch Thunder vs. Pacers NBA Finals Games Online** NBA Finals ByOscar Hartzog **How to Watch Thunder vs. Pacers NBA Finals Games Online** NBA Finals ByOscar Hartzog With the Release of the Switch 2, the Original Nintendo Switch Is Marked Down OnlineOG Switch DealsByRudie Obias **With the Release of the Switch 2, the Original Nintendo Switch Is Marked Down Online** OG Switch Deals ByRudie Obias **With the Release of the Switch 2, the Original Nintendo Switch Is Marked Down Online** OG Switch Deals ByRudie Obias Your Bulk-Buying Dad Can Get All The Lawn Care and Protein Powder He Needs With This Sam's Club Membership Dealdeal of the dayBySage Anderson **Your Bulk-Buying Dad Can Get All The Lawn Care and Protein Powder He Needs With This Sam's Club Membership Deal** deal of the day BySage Anderson **Your Bulk-Buying Dad Can Get All The Lawn Care and Protein Powder He Needs With This Sam's Club Membership Deal** deal of the day BySage Anderson Lewis Hamilton Turns Another Corner In Lululemon's New Metal Vent Tech Gear — Shop His Collection HereLewLewLemonByOscar HartzogandSage Anderson **Lewis Hamilton Turns Another Corner In Lululemon's New Metal Vent Tech Gear — Shop His Collection Here** LewLewLemon ByOscar HartzogandSage Anderson **Lewis Hamilton Turns Another Corner In Lululemon's New Metal Vent Tech Gear — Shop His Collection Here** LewLewLemon ByOscar HartzogandSage Anderson Inspired by Tennis Looks at the French Open? Shop Lacoste’s Limited-Time SaleDealsByOscar Hartzog **Inspired by Tennis Looks at the French Open? Shop Lacoste’s Limited-Time Sale** Deals ByOscar Hartzog **Inspired by Tennis Looks at the French Open? Shop Lacoste’s Limited-Time Sale** Deals ByOscar Hartzog **Top stories newsletter** Music Politics TV & Movies Culture Staff Contact Advertise Privacy Policy Terms of Use AdChoices PMC Entertainment California Privacy Rights Your Privacy Choices EU Privacy Preferences Accessibility Policy on Anonymous Sources **Follow Us** Facebook Instagram TikTok X YouTube **Newsletter Signup** **Got a Hot News Tip?** We want to hear it. Send us a tip using our anonymous form. Rolling Stone is a part of Penske Media Corporation. © 2025 Rolling Stone, LLC. All rights reserved. Art in America Artforum ARTnews BGR Billboard BlogHer Deadline Flow Space Gold Derby IndieWire LA3C Life is Beautiful Robb Report Rolling Stone SheKnows Soaps Sourcing Journal Sportico Spy StyleCaster The Hollywood Reporter TVLine Variety Vibe WWD Log InWelcomeManage AccountManage Print AccountSign Out Welcome Manage Account Manage Print Account Sign Out Welcome Manage Account Manage Print Account Sign Out MusicNewsFeaturesListsAlbum ReviewsLive ReviewsArtists You Need To KnowSongs You Need To KnowRS CountryRS Latin News Features Lists Album Reviews Live Reviews Artists You Need To Know Songs You Need To Know RS Country RS Latin News Features Lists Album Reviews Live Reviews Artists You Need To Know Songs You Need To Know RS Country RS Latin PoliticsNewsFeaturesLists News Features Lists News Features Lists TV & MoviesNewsFeaturesListsRecapsReviews News Features Lists Recaps Reviews News Features Lists Recaps Reviews Video & PhotosPhotosVideosThe CoverMusicians on Musicians Photos Videos The Cover Musicians on Musicians Photos Videos The Cover Musicians on Musicians RS LIVE CultureNewsFeaturesListsCreatorsRS Gaming News Features Lists Creators RS Gaming News Features Lists Creators RS Gaming RS Films RS RecommendsReviewsRS EssentialsRS Audio AwardsGift Guides Reviews RS Essentials RS Audio Awards Gift Guides Reviews RS Essentials RS Audio Awards Gift Guides Culture Council Facebook Instagram TikTok X YouTube"}