{"id": 531, "name": "Frontiers in Conservation Science", "domain": "frontiersin.org/journals/conservation-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/conservation-science/articles/10.3389/fcosc.2025.1542455/full", "title": "Conservation Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Animal Conservation Conservation Genetics and Genomics Conservation Social Sciences Global Biodiversity Threats Human-Wildlife Interactions Plant Conservation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Animal Conservation Conservation Genetics and Genomics Conservation Social Sciences Global Biodiversity Threats Human-Wildlife Interactions Plant Conservation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Animal Conservation Conservation Genetics and Genomics Conservation Social Sciences Global Biodiversity Threats Human-Wildlife Interactions Plant Conservation Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Conserv. Sci., 05 June 2025 Sec. Plant Conservation Volume 6 - 2025 |https://doi.org/10.3389/fcosc.2025.1542455 This article is part of the Research TopicConserving Plants in a Changing ClimateView all 4 articles **Unraveling the meiotic puzzle: chromosome count, meiotic behaviour, and reproductive challenges inPhlomis cashmerianaRoyle ex Benth. from the Kashmir Himalaya** 1Plant Reproductive Biology, Genetic Diversity and Phytochemistry Research Laboratory, Department of Botany, University of Kashmir, Srinagar, India 2Department of Botany, University of Kashmir, Baramulla, Jammu and Kashmir, India Meiotic stability is crucial for maintaining reproductive success and genetic diversity in plants, especially in montane regions like the Himalaya, where fluctuating environmental conditions can disrupt normal chromosome behavior.Phlomis cashmerianaRoyle ex Benth., a medicinally important species, has not previously been studied for the meiotic behavior and its impact on reproductive output. This study presents the first comprehensive meiotic analysis ofP. cashmerianaacross three populations in the Kashmir Himalaya, focusing on chromosome count, meiotic behavior, pollen fertility, and seed set. While most of the Pollen Mother Cells (PMCs) exhibited normal meiosis, several meiotic abnormalities were recorded, including chromosome stickiness, laggards, unoriented bivalents, and interchromosomal connections. Chromosome stickiness (11.48%) was the most prominent abnormality, particularly during diakinesis and metaphase I across all the study sites. These irregularities, likely influenced by high UV radiation and low temperatures characteristic of the region, were associated with reduced pollen viability (67.65–74.50%) and seed set (54.40–59.75%) across the studied populations. Such reproductive impairments may compromise the long-term survival and genetic resilience ofP. cashmeriana, potentially limiting its adaptive capacity under ongoing changing environmental conditions. These findings highlight the broader ecological significance of meiotic behavior as a determinant of reproductive fitness and evolutionary potential in Himalayan flora. Understanding these cytological constraints is vital for developing informed, long-term conservation and management strategies forP. cashmerianaand other threatened montane species. Future research should explore the genetic basis of these abnormalities and assess population viability under shifting climate conditions. **Introduction** The genusPhlomisL. is one of the largest genera of the subfamily Lamioideae (Lamiaceae) with about 93 species distributed throughout the world (POWO, 2024). These species have been divided into two main sections:PhlomoidesandPhlomis(Rechinger, 1982;Albaladejo et al., 2005). The diagnostic character for separating the sections is corolla morphology. The species of genusPhlomishave corolla with a curved upper lip and trifid lower lip with large median and smaller lateral lobes while the species belonging toPhlomoideshave corolla with straight upper lip and trifid lower lip with subequal lobes (Azizian and Moore, 1982). In Kashmir Himalaya the genusPhlomisis represented by two species namely,Phlomis cashmiricaWells andPhlomis cashmerianaRoyle ex Benth (POWO, 2024). The later species native to Kashmir Himalaya has been selected for the present study.P. cashmeriana, locally known as Darshol is used in traditional medicine systems to treat wounds and bone fractures. Phytochemical analyses have identified a wide range of bioactive compounds, including flavonoids, triterpenes, alkaloids, phenolics, tannins, coumarins, shikimic acid derivatives, and steroids (Qadir et al., 2022,2024a;Hussain et al., 2024). Consequently, this plant species is reported to have different biological activities, including antioxidant, anti-inflammatory, anti-bacterial anti-fibrillation, immunosuppressive, and antidiabetic properties (Qadir et al., 2024b;Hussain et al., 2024). In addition to its medicinal value,P. cashmerianais also used as an ornamental plant (Sarkhail et al., 2007;Shang et al., 2016). Over the past few decades,P. cashmerianahas experienced severe anthropogenic pressures like habitat degradation, and overharvesting due to its high therapeutic demand leading to a rapid decline in its populations across natural habitats (Ganie et al., 2019;Wani et al., 2022). These pressures often result in habitat fragmentation and population isolation, which limit gene flow and reduce genetic diversity. Small and fragmented populations are more prone to inbreeding, which can lead to the accumulation of deleterious alleles and heightened expression of meiotic abnormalities. Such genetic consequences impair reproductive success by reducing pollen viability, seed set, and overall fitness. As a result, conserving this species has become a critical priority. For developing effective conservation strategies, detailed knowledge about the meiotic behavior of a plant species is crucial as it offers valuable scientific insights into identifying genetic factors influencing reproduction, viability, and long-term survival (Armstrong and Jones, 2003). Meiosis is fundamental for regular cell division, gamete formation, and the maintenance of chromosomal stability—all crucial for sustaining plant populations, especially in challenging montane environments (Golubovskaya, 1979;Pagliarini, 2000). Disturbances (mutations) during meiosis result in abnormalities, leading to variations in the genetic constitution (Kaul and Murthy, 1985;Jiang et al., 2009). Studies on other plant species have shown that such abnormalities—like chromosomal stickiness, laggards, bridges, and micronuclei—can significantly impair gamete viability and seed production, ultimately affecting population sustainability (Pagliarini, 2000;Singhal et al., 2018;Kaur and Singhal, 2019). These cytogenetic disruptions are often associated with environmental stress, polyploidy, or genomic instability and have been widely used as indicators of reproductive constraints in threatened and endemic species. In fragile ecosystems like the Kashmir Himalaya, where climatic extremes and anthropogenic disturbances can intensify reproductive limitations, understanding the meiotic behavior ofP. cashmerianais particularly important. Such insights can help identify the reproductive constraints contributing to its reduced reproductive success and inform targeted conservation strategies. Although the Kashmir Himalaya harbors a rich diversity of medicinal plants,Phlomis cashmerianawas chosen for this study due to its restricted geographic distribution, high medicinal importance, and lack of prior cytogenetic research. Its rapid population decline makes it a priority species for understanding reproductive constraints among Himalayan medicinal plants. This study does have certain limitations, including a focus on a limited number of populations and an emphasis solely on cytological parameters. Broader ecological interactions, genetic diversity assessments, and long-term population monitoring were beyond the current scope. Nonetheless, this work establishes a cytogenetic baseline and highlights key reproductive bottlenecks that can guide future conservation efforts for this and other threatened species in the region. To date,Phlomis cashmerianahas not been investigated for its chromosome count, meiotic behavior, and the effect of meiotic irregularities on pollen fertility and seed set. Given the ecological and medicinal significance of this species, we hypothesize that disturbances in meiotic processes contribute to reduced pollen fertility and seed set, thereby impacting the reproductive success and long-term survival ofP. cashmerianain its natural habitat. Based on this hypothesis, we addressed the following research questions: (a) What is the chromosome number and meiotic behavior ofPhlomis cashmeriana? (b) What are the different meiotic abnormalities inP. cashmerianaacross selected sites? (c) How do meiotic abnormalities affect pollen viability, fruit, and seed set in the target plant? By addressing these questions, this study provides essential cytogenetic insights that can aid in understanding the reproductive constraints ofP. cashmeriana, ultimately informing its conservation and management strategies. **Materials and methods** **Study area** Kashmir Himalaya is located at the north-western extremes of India and lies between latitude 32°17ʹ and 37°05ʹ North and longitude 72°31ʹ and 80°20ʹ East. This Himalayan region has a wide elevational gradient, diverse geological formations, and varied climatic zones, supporting a rich diversity of medicinal plants (Tali et al., 2019;Ganie et al., 2020). For the current study, 3 sitesviz., Daksum (Site 1), Hillar Naar (Site 2), and Jawahar Tunnel (Site 3) were selected across the Kashmir Himalaya based on the ease of access, habitat characteristics, and abundance of the target plant population (Figure 1). Herbarium specimens ofP. cashmerianacollected from selected sites were deposited in the University of Kashmir Herbarium (KASH) under voucher specimen numbers 2941, 2942, and 2943. Figure 1. Map showing study area and sampling sites in Kashmir Himalaya. **Study species** Phlomis cashmeriana(Cashmere Sage) is a densely woolly multi-stem perennial herb native to Tadzhikistan, Pakistan, Afghanistan, and West Himalaya (POWO, 2024). The species mainly grows on open exposed slopes at an elevational range of 2000—2800 m asl. The stem is simple or branched, and the rootstock is woody. Leaves are lanceolate-oblong and leathery, covered with hairs. The inflorescence is verticillaster with dense lilac-purple flowers, and corolla lobes pale purple. **Analysis of pollen mother cells** For meiotic studies, young floral buds were randomly collected during the early morning hours in April 2023 from three wild populations—Daksum, Hillar Naar, and Jawahar Tunnel. This period coincides with the pre-anthesis stage ofP. cashmeriana, when meiotic activity is at its peak, allowing accurate observation of meiotic stages. The buds were fixed in fresh Carnoyʼs solution (3 ethanol: 1 glacial acetic acid) for 24 hours, and then stored in freshly prepared 70% ethanol at 4°C in a refrigerator till further analysis. The squashing technique involving crushing individual anthers in 2% acetocarmine was used for slide preparation. To ensure high-quality slide preparations, only appropriately sized buds were selected, and squashing was performed gently to minimize mechanical damage and avoid overlapping cells. Each slide was carefully screened, and only well-spread, clearly stained PMCs were used for meiotic analysis. The anther squash method is widely used for its reliability in visualizing meiotic stages and chromosomal behavior. To reduce potential errors such as poor staining, cell overlap, or mechanical damage, buds were carefully staged, and squashes were performed gently and consistently. Multiple cells from each stage were analyzed to ensure reproducibility and accuracy. The freshly prepared slides from each population were analyzed for chromosome counts and meiotic behaviour in Pollen Mother Cells (PMCs) at different stages (diplotene, diakinesis, metaphase I, II, anaphase I, II, telophase and tetrad stage). This procedure was repeated for two consecutive years (2023–2024). Only good preparations were used for chromosome counts and analyzing meiotic behavior. Photomicrographs of PMCs with ideal stages (for chromosome counts, meiotic abnormalities, and sporads) were taken using a trinocular microscope (Leica) integrated with Leica software (magnification 100x). The percent meiotic abnormality (stickiness, laggards, unoriented bivalents, interchromosomal connections) was calculated by the following formula: From each population, buds were collected from 25 plants and the anthers from these floral buds were squashed to ascertain the meiotic behavior and the results were obtained from about 50 slides with different meiotic stages from each population. **Pollen fertility estimation** To determine pollen viability, three methods were employed, in the first method; the mature pollen grains were mounted in Fluorescein diacetate (FDA) solution and incubated for 3–5 min. The pollens with fluorescent and non-fluorescent cytoplasm were treated as fertile and non-fertile, respectively. In the second method, the ready-to-dehisce mature anthers were placed in 1% tetrazolium chloride for one hour and squashed to check for viability. In the third method, mature and undehisced anthers were squashed in 1% aniline blue-lactophenol and observed after 15 minutes. These methods have been widely validated in previous studies for their reliability in evaluating pollen viability. FDA staining is sensitive to enzymatic activity in viable pollen (Heslop-Harrison and Heslop-Harrison, 1970), while tetrazolium chloride assesses metabolic activity through dehydrogenase function (Norton, 1966). Aniline blue-lactophenol has been effectively used to identify viable pollen based on the intensity of cytoplasmic staining (Shivanna and Rangaswamy, 2012). The use of multiple techniques enhances the accuracy and robustness of pollen fertility estimation. The percentage pollen fertility was determined by the following formula: **Calculation of fruit set** To assess the fruit set, we recorded the total number of flowers at the peak blooming period and the number of mature fruits post-fruiting period on selected, tagged plants. The fruit set percentage was calculated using the formula: **Calculation of seed set** For estimating the seed set, plants were selected randomly, tagged, and scored for the number of seeds produced per plant followingLubbers and Christensen (1986). **Results** The meiotic analysis ofP. cashmerianarevealed that the species is diploid, possessing a chromosome number of 2n = 2x = 20 at all three study sites. This was confirmed by the presence of 10 bivalents during diplotene, diakinesis, and metaphase-I (Figures 2a-d). The bivalents exhibited both terminal and interstitial chiasmata, and with ring-shaped bivalents particularly evident at diakinesis (Figure 2d). The present investigation revealed normal anaphasic segregation of 10:10 chromosomes in pollen mother cells (PMCs) at anaphase I and II (Figures 2g, n), followed by normal telophase and tetrad formation (Figure 2o). In addition to normal meiosis, a range of abnormalities were identified in PMCs, including chromosomal stickiness, lagging chromosomes, chromosome bridges, out-of-plate bivalents, and inter-chromosomal connections. Figure 2.(a-p)Meiotic behavior ofPhlomis cashmeriana.(a)PMC at diplotene with 10 bivalents and prominent nucleolus (arrowed);(b, c)PMC at diakinesis with interchromosomal connections (arrowed);(d)PMC showing 10 bivalents at metaphase I;(e)PMCs with chromatin stickiness at metaphase I (arrowed);(f)Out of plate bivalent at metaphase I (arrowed);(g)Anaphase I showing 10:10 chromosome distribution at each pole;(h)PMC with single bridge at anaphase I (arrowed);(i, j)PMCs with multiple bridges at anaphase I (arrowed);(k)A bridge and laggards at anaphase I (arrowed);(l, m)PMCs with laggards at anaphase I (arrowed);(n)PMC at Anaphase II,(o)Tetrad,(p)Viable and non-viable pollens. Among 3,648 PMCs analyzed at different stages, chromosome stickiness was the most prominent meiotic abnormality observed, occurring mainly at diakinesis and metaphase I (Figure 2e), in all the 3 selected sites. Stickiness caused chromosomes to form compact masses, losing their distinct morphology and appearing as dense clumps in affected PMCs. At metaphase I, the frequency of stickiness was highest at Site 3 (31.12 ± 1.15%), followed by Site 2 (23.03 ± 1.81%) and Site 1 (20.59 ± 1.03%) (Table 1). Out-of-plate bivalents observed during metaphase I did not show significant variation among sites. This abnormality was recorded in 3.81 ± 1.46%, 4.61 ± 0.62%, and 5.87 ± 1.87% of PMCs at Sites 1, 2, and 3, respectively (Figure 2f,Table 1). Likewise, PMCs with Lagging chromosomes were recorded during anaphase I and II (Figures 2k-m), with the highest frequencies observed at Site 3 (17.14 ± 1.28% and 11.91 ± 1.80%, respectively), followed by Site 2 (13.18 ± 0.59% and 5.36 ± 2.77%) and Site 1 (9.64 ± 1.21% and 4.36 ± 1.60) (Table 1). Lagging chromosomes are those that fail to migrate properly to the poles during anaphase, often due to spindle defects or chromosomal adhesions. Chromosome bridges, resulting from incomplete separation of chromatids or unresolved chiasmata, were most prevalent at Site 3 (18.24 ± 0.61% in anaphase I, 12.64 ± 1.31% in anaphase II), followed by Site 2 (16.55 ± 1.99% and 6.07 ± 1.80%) and Site 1 (11.09 ± 1.92% and 5.03 ± 1.44%) (Figures 2h-k;Table 1). Similarly, inter-chromosomal connections were observed in PMCs during diplotene and diakinesis, occurring at frequencies of 13.43 ± 1.47%, 15.77 ± 1.20%, and 17.39 ± 0.69% at Sites 1, 2, and 3, respectively. All these meiotic irregularities resulted in the formation of non-fertile pollen grains and reduced seed set. Table 1. Percentage of PMCs with normal and irregular meiotic behavior observed at different meiosis stages inPhlomis cashmeriana. The pollen fertility (Figure 2p), fruit set, and seed set ofP. cashmerianavaried significantly among study sites (Table 2;Figure 2n). Pollen viability was assessed using three staining techniques: aniline blue, 2,3,5-triphenyl tetrazolium chloride (TZ), and fluorescein diacetate (FDA). Viability was consistently highest at Site 1 and lowest at Site 3 across all staining methods. At Site 1, pollen viability was maximum, with 79.57 ± 2.28% for aniline blue, 73.70 ± 1.57% for TZ, and 73.70 ± 1.57% for FDA. In contrast, Site 3 exhibited the lowest pollen viability, with 65.83 ± 1.04%, 64.67 ± 1.45%, and 62.30 ± 3.11% for aniline blue, TZ, and FDA, respectively (Table 2). Similarly, both fruit set and seed set showed site-dependent variation. Site 1 showed the highest fruit set (69.77 ± 2.84%) and seed set (62.43 ± 1.85%), whereas Site 3 exhibited the lowest values, with 59.40 ± 1.25% fruit set and 49.43 ± 2.79% seed set (Table 2). These findings indicate a progressive decline in reproductive success from Site 1 to Site 3, coinciding with increased frequencies of meiotic abnormalities. Table 2. Pollen fertility, fruit set and seed set ofPhlomis cashmerianarecorded during the present study. **Discussion** In the present study, we determined the chromosome number and detailed meiotic behaviour ofPhlomis cashmerianafrom Kashmir Himalaya, India. This study presents the first report on chromosome count and meiotic analysis for this species. Our results revealed a basic chromosome number of x=10 in the studied populations. Plant populations from all three study sites showed the same chromosome count of 2n=2x=20, confirming the diploid nature of the species. Previous reports reveal that all the studiedPhlomisspecies have chromosome counts of 2n=2x=20 (Aparicio and Albaladejo, 2003;Ozdemir et al., 2014;Yousefi et al., 2018;Sadeghian et al., 2021).Azizian and Moore (1982)reported thatPhlomisspecies in the sectionPhlomisare characterized by having 2n=20 chromosomes, while those in the sectionPhlomoideshave 2n=22 chromosomes.Ozdemir et al. (2014)also reported a chromosome count of 2n=20 forP. grandifloraH.S. Thomps. andP. lunariifoliaSm., both members of thePhlomissectionPhlomis. Other studies have also confirmed a chromosome count of 2n=20 in other species within the genusPhlomis, includingP. italicaL.,P. lychnitisL.,P. herba-ventiL. var.tomentosa, andP. purpureaL., Boiss (Mateu, 1986);P. cypriaPost var.cypria(Yildiz and Gücel, 2006);Phlomis composita(Aparicio and Albaladejo, 2003);Phlomis olivieriBenth. (Yousefi et al., 2018) andPhlomis anisodontaandPhlomis pachyphylla(Sadeghian et al., 2021). The present study revealed that meiosis was normal in most (about 80%) of the observed PMCs; however, some PMCs showed meiotic abnormalities such as stickiness, laggards, unoriented bivalents, inter-chromosomal connections, resulting in sterile pollen grains and low seed set. The meiotic abnormalities were also observed in some other species of the family Lamiaceae and genusPhlomisgrowing in India (Singh et al., 2018). Chromosome stickiness was the most prominent abnormality observed across all three populations ofP. cashmerianaand has been widely reported in various flowering plants, including species from the western Himalaya (Tripathi and Kumar, 2010;Kaur and Singhal, 2012,2014;Rana et al., 2013;Rashid et al., 2021:Rashid et al., 2022;Wani et al., 2022). Chromosome stickiness is thought to arise from defects in the function of specific non-histone proteins, such as DNA topoisomerase II and peripheral proteins, which are essential for proper chromatid segregation (Gaulden, 1987;Azad et al., 2022). Some researchers attribute chromosome stickiness to genetic and environmental factors (Nirmala, 1996;Baptista-Giacomelli et al., 2000;Bione et al., 2000;Saggoo and Farooq, 2011;Jeelani et al., 2012;Rashid et al., 2021). In the alpine to sub-alpine regions of the Himalaya, harsh environmental conditions such as low temperatures, high UV radiation, and shorter growing seasons likely intensify meiotic stress, contributing to chromosomal stickiness, failure of segregation at anaphase I, and other irregularities (Weitz et al., 2021;Fu et al., 2024). The formation of laggards and bridges during meiosis is considered a syndrome indicating reduced control over the meiotic process (Jones and Brumpton, 1971;Sofi et al., 2023). Laggards may result from delayed terminalization and stickiness at chromosome ends (Kaur and Grover, 1985;Rashid et al., 2022), while bridges are likely caused by chiasma interlocking in bivalents, chromatin stickiness, and late disjunction of bivalents (Tarar, 1980;Rashid et al., 2022). The presence of laggards may also be attributed to irregular spindle formation, cytoskeletal disruptions, and other cellular changes (Vasek, 1962;Potapova and Gorbsky, 2017). The irregularities in the meiotic course—such as chromatin stickiness, interchromosomal connections, and formation of lagging chromosomes and bridges can lead to defective sporad formation and reduced pollen viability (Risso-Pascotto et al., 2005;Kumar and Singhal, 2008,2012;Rashid et al., 2021). These meiotic abnormalities disrupt microsporogenesis and contribute to pollen sterility, negatively impacting the reproductive success of species in natural habitats (Lattoo et al., 2006;Kumar and Singhal, 2008,2012;Kumar, 2010;Rashid et al., 2021). In this study, a clear link was observed between the frequency of meiotic abnormalities and reduced reproductive success inP. cashmeriana. Site 1, with the highest incidence of abnormalities, showed the lowest pollen viability, fruit set, and seed set, whereas Site 3, with more regular meiotic behavior, exhibited higher reproductive output. This highlights the direct impact of meiotic stability on fertility and subsequent fruit and seed production (Pagliarini, 2000;Souza et al., 2006;Kumar and Singhal, 2012). Such abnormalities can result in the formation of abnormal gametes, leading to reduced genetic recombination, impaired gene flow, and lower genetic diversity among populations—ultimately threatening long-term survival and adaptability. Furthermore, in the context of environmental change, factors such as habitat degradation, climate-induced stress, and pollinator decline may intensify reproductive constraints. Pollen sterility, combined with declining pollinator populations due to habitat fragmentation, and global climate change can significantly reduce fertilization success and gene exchange between fragmented populations. While meiotic abnormalities appear to be a key factor, other ecological and genetic influences—such as pollinator limitation, environmental stress, and low genetic diversity—may also contribute to reduced reproductive output (Ashman et al., 2004;Barrett, 2010). Limited seed dispersal and low seedling recruitment caused by reproductive bottlenecks could further restrict gene flow among fragmented populations, increasing inbreeding and reducing population connectivity—factors that must be considered in conservation planning (Aguilar et al., 2006;Browne and Karubian, 2018). Understanding the causes of the meiotic instability along with the breeding behavior of the species is crucial for the conservation and management of threatened and native plants (Souza et al., 2006). Pollination plays a crucial role in determining fruit and seed set inP. cashmeriana. The species is pollinated by four different insect species, includingXylocopasp.,Bombus tunicatus,Apis mellifera, and a wasp. Although ambophilous,P. cashmerianaprimarily relies on entomophily (Roof, 2024). Given its dependence on insect pollination, pollen sterility caused by meiotic irregularities could limit successful fertilization, ultimately reducing reproductive success. The potential decline in pollinator populations may exacerbate these challenges, especially in sensitive ecosystems where both plants and pollinators are vulnerable to environmental pressures. The effectiveness of pollinators, along with the availability of viable pollen, significantly influences seed production. In species exhibiting high pollen sterility, even efficient pollinators may fail to ensure adequate seed set, leading to lower reproductive output. The long-term survival of a plant species depends on effective reproduction and constant recruitment of new individuals to maintain healthy populations (Corlett, 2007). In this study, significant meiotic irregularities observed in the species could contribute to low seed production, leading to a gradual decline in its population size. Previous studies on some species have shown that various meiotic abnormalities can reduce plant fertility or even lead to complete male sterility (Pagliarini, 2000;Wani et al., 2022). From an evolutionary perspective, persistent meiotic instability can reduce fitness and limit adaptive potential, making species more susceptible to environmental change. Given the restricted distribution of the target species, increasing anthropogenic pressures and the presence of meiotic bottlenecks could significantly contribute to a decline in its population size within its native range in the Kashmir Himalaya, thereby increasing the risk of extinction (Najar et al., 2024) within its native range in the Kashmir Himalaya, which may decline further in the near future. Therefore, it is important to devise conservation strategies for this valuable medicinal plant species. **Conclusions and conservation implications** This study presents the first comprehensive meiotic analysis ofPhlomis cashmeriana, a valuable Himalayan medicinal herb, confirming its diploid chromosome number (2n = 2x = 20) and identifying critical meiotic irregularities that may compromise reproductive success. Although most Pollen Mother Cells (PMCs) exhibited normal meiosis, abnormalities such as chromosomal stickiness, laggards, unoriented bivalents, and interchromosomal connections were observed—among which chromosomal stickiness was most frequent. These disruptions were associated with reduced pollen viability and seed set, indicating potential reproductive bottlenecks that could limit natural regeneration. Environmental factors characteristic of high-altitude habitats, including low temperatures and elevated ultraviolet radiation, are likely contributors to these meiotic disturbances. Given the species’ medicinal significance and the increasing anthropogenic pressures on its native habitats, such reproductive challenges may critically threaten population viability and long-term survival. Thus, integrating cytogenetic insights into broader conservation frameworks is vital. The observed meiotic irregularities—particularly chromosomal stickiness, laggards, bridges, and interchromosomal connections—impair microsporogenesis and reduce reproductive efficiency. In the montane ecosystems of the Kashmir Himalaya, where populations are already impacted by habitat degradation and unsustainable harvesting, these reproductive constraints pose a serious risk to species persistence. Limited seed output and reduced genetic recombination due to meiotic instability may further decrease genetic diversity, increasing vulnerability to environmental stressors and human activities. Urgent conservation interventions are warranted, including habitat protection, regulation of wild harvesting, and promotion ofin situconservation measures. Simultaneously, the development ofex situstrategies—such as seed banking and micropropagation—will be crucial for safeguarding germplasm and supporting restoration initiatives. Future research should integrate cytogenetic assessments with studies on breeding systems, genetic diversity, and ecological adaptability to inform effective conservation and sustainable utilization. This study underscores the importance of reproductive biology in shaping conservation priorities forP. cashmerianaand other ecologically significant Himalayan endemics. **Data availability statement** The original contributions presented in the study are included in the article/supplementary material. Further inquiries can be directed to the corresponding author. **Author contributions** RQ: Data curation, Formal analysis, Methodology, Software, Visualization, Writing – original draft. HJ: Data curation, Formal analysis, Methodology, Software, Visualization, Writing – review & editing. AG: Methodology, Supervision, Validation, Writing – original draft. BW: Data curation, Writing – review & editing. IN: Conceptualization, Investigation, Methodology, Supervision, Validation, Writing – review & editing. JM: Conceptualization, Data curation, Methodology, Visualization, Writing – original draft. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. The authors also acknowledge the funding under MANF-201920-JKO416200268 in favour of JM. **Acknowledgments** We are highly thankful to the Head, Department of Botany, University of Kashmir, Srinagar, for providing the necessary facilities. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Aguilar R., Ashworth L., Galetto L., and Aizen M. A. (2006). Plant reproductive susceptibility to habitat fragmentation: Review and synthesis through a meta-analysis.Ecol. Lett.9, 968–980. doi: 10.1111/j.1461-0248.2006.00927.x PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Albaladejo R. G., Aguilar J. F., Aparicio A., and Feliner G. N. (2005). Contrasting nuclear plastidial phylogenetic patterns in the recently diverged IberianPhlomis crinitaandP. lychnitislineages (Lamiaceae).Taxon54, 987–998. doi: 10.2307/25065483 Crossref Full Text|Google Scholar Aparicio A. and Albaladejo R. G. (2003). Microsporogenesis and meiotic abnormalities in the hybrid complex ofPhlomis composita(Lamiaceae).Botanical J. Linn. Soc.143, 79–85. doi: 10.1046/j.1095-8339.2003.00208.x Crossref Full Text|Google Scholar Armstrong S. J. and Jones G. H. (2003). Meiotic cytology and chromosome behaviour in wild-typeArabidopsis thaliana.J. Exp. Bot.54, 1–10. doi: 10.1093/jxb/erg034 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Ashman T. L., Knight T. M., Steets J. A., Amarasekare P., Burd M., Campbell D. R., et al. (2004). Pollen limitation of plant reproduction: ecological and evolutionary causes and consequences.Ecology85, 2408–2421. doi: 10.1890/03-8024 Crossref Full Text|Google Scholar Azad Z. R., Ahmad Khah M., and Alam Q. (2022). Gamma irradiation induced chromosome aberrations in meiotic cells of bread wheat (Triticum aestivumL.).Int. J. Plant Soil Sci.26, 81–89. Google Scholar Azizian D. and Moore D. F. (1982). Morphological and palynological studies inPhlomisL.,EremostachysBunge andParaphlomisPrain (Labiatae).Botanical J. Linn. Soc.85, 225–248. doi: 10.1111/j.1095-8339.1982.tb00372.x Crossref Full Text|Google Scholar Baptista-Giacomelli F. R., Pagliarini M. S., and de Almeida J. L. (2000). Meiotic behavior in several Brazilian oat cultivars (Avena sativaL.).Cytologia65, 371–378. doi: 10.1508/cytologia.65.371 Crossref Full Text|Google Scholar Barrett S. C. H. (2010). Understanding plant reproductive diversity.Philos. Trans. R. Soc. B: Biol. Sci.365, 99–109. doi: 10.1098/rstb.2009.0199 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Bione N. C. P., Pagliarini M. S., and Toledo J. F. F. D. (2000). Meiotic behavior of several Brazilian soybean varieties.Genet. Mol. Biol.23, 623–631. doi: 10.1590/S1415-47572000000300022 Crossref Full Text|Google Scholar Browne L. and Karubian J. (2018). Habitat loss and fragmentation reduce effective gene flow by disrupting seed dispersal in a neotropical palm.Mol. Ecol.27, 3055–3069. doi: 10.1111/mec.2018.27.issue-15 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Corlett R. T. (2007). “Pollination or seed dispersal: which should we worry about most?,” inSeed Dispersal: Theory and Its Application in a Changing World. Ed. Green R. J. (CABI, Wallingford), 523–544. Google Scholar Fu H., Zhong J., Zhao J., Huo L., Wang C., Ma D., et al. (2024). Ultraviolet attenuates centromere-mediated meiotic genome stability and alters gametophytic ploidy consistency in flowering plants.New Phytol.243, 2214–2234. doi: 10.1111/nph.v243.6 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Ganie A. H., Tali B. A., Khuroo A. A., Reshi Z. A., and Nawchoo I. A. (2019). Impact assessment of anthropogenic threats to high-valued medicinal plants of Kashmir Himalaya, India.J. Nat. Conserv.50, 125715. doi: 10.1016/j.jnc.2019.125715 Crossref Full Text|Google Scholar Ganie A. H., Tali B. A., Nawchoo I. A., Khuroo A. A., Reshi Z. A., and Dar G. H. (2020). “Diversity in medicinal and aromatic flora of the Kashmir Himalaya,” inBiodiversity of the Himalaya: Jammu and Kashmir State. Eds. Dar G. H. and Khuroo A. A. (Springer, Singapore), 545–563. Google Scholar Gaulden M. E. (1987). Hypothesis: some mutagens directly alter specific chromosomal proteins (DNA topoisomerase II and peripheral proteins) to produce chromosome stickiness, which causes chromosome aberrations.Mutagenesis2, 357–365. doi: 10.1093/mutage/2.5.357 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Golubovskaya I. N. (1979). Genetic control of meiosis.Int. Rev. Cytology58, 247–290. doi: 10.1016/S0074-7696(08)61477-1 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Heslop-Harrison J. and Heslop-Harrison Y. (1970). Evaluation of pollen viability by enzymatically induced fluorescence; intracellular hydrolysis of fluorescein diacetate.Stain Technol.45, 115–120. doi: 10.3109/10520297009085351 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Hussain A., Azram S., Rehman K., Ali M., Akash M. S. H., Zhou X., et al. (2024). Green synthesis of Fe and Zn-NPs, phytochemistry and pharmacological evaluation of Phlomis cashmeriana Royle ex Benth.Heliyon. 10 (13). PubMed Abstract|PubMed Abstract|Google Scholar Jeelani S. M., Kumari S., and Gupta R. C. (2012). Male meiosis inLotus corniculatusL.Plant Systematics Evol.298, 1977–1985. doi: 10.1007/s00606-012-0695-4 Crossref Full Text|Google Scholar Jiang H., Wang F. F., Wu Y. T., Zhou X., Huang X. Y., Zhu J., et al. (2009). Multipolar Spindle 1 (MPS1), novel coiled-coil protein ofArabidopsis thaliana, is required for meiotic spindle organization.Plant J.59, 1001–1010. doi: 10.1111/j.1365-313X.2009.03929.x PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Jones G. H. and Brumpton R. J. (1971). Sister and non-sister chromatid U-type exchange in rye meiosis.Chromosoma33, 115–128. doi: 10.1007/BF00285628 Crossref Full Text|Google Scholar Kaul M. L. H. and Murthy T. G. K. (1985). Mutant genes affecting higher plant meiosis.Theor. Appl. Genet.70, 449–466. doi: 10.1007/BF00305977 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Kaur P. and Grover I. S. (1985). Cytological effects of some organophosphorus pesticides II. Meiotic effects.Cytologia50, 199–211. doi: 10.1508/cytologia.50.199 Crossref Full Text|Google Scholar Kaur D. and Singhal V. K. (2012). Phenomenon of cytomixis and intraspecific polyploidy (2x, 4x) inSpergularia diandra(Guss.) Heldr. & Sart. in the cold desert regions of Kinnaur district (Himachal Pradesh).Cytologia77, 163–171. doi: 10.1508/cytologia.77.163 Crossref Full Text|Google Scholar Kaur M. and Singhal V. K. (2014). First report of cytomixis and meiotic abnormalities inNepeta govanianafrom Solang Valley, Kullu District, Himachal Pradesh.Cytologia79, 227–233. doi: 10.1508/cytologia.79.227 Crossref Full Text|Google Scholar Kaur D. and Singhal V. K. (2019). Meiotic abnormalities affect genetic constitution and pollen viability in dicots from Indian cold deserts.BMC Plant Biol.19, 1–11. doi: 10.1186/s12870-018-1596-7 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Kumar P. (2010).Exploration of cytomorphological diversity in the members of Polypetalae from Lahaul-Spiti and adjoining areas. Ph.D Thesis(India: Punjabi University Patiala, Punjab). Google Scholar Kumar P. and Singhal V. K. (2008). Cytology ofCaltha palustrisL. (Ranunculaceae) from cold regions of Western Himalayas.Cytologia73, 137–143. doi: 10.1508/cytologia.73.137 Crossref Full Text|Google Scholar Kumar P. and Singhal V. K. (2012). Erratic male meiosis resulting in 2npollen grain formation in a 4x cytotype (2n= 28) ofRanunculus laetusWall. ex Royle.Sci. World J.2012, 691545. PubMed Abstract|PubMed Abstract|Google Scholar Lattoo S. K., Khan S., Bamotra S., and Dhar A. K. (2006). Cytomixis impairs meiosis and influences reproductive success inChlorophytum comosum(Thunb) Jacq.—an additional strategy and possible implications.J. Biosci.31, 629–637. doi: 10.1007/BF02708415 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Lubbers A. E. and Christensen N. L. (1986). Intraseasonal variation in seed production among flowers and plants ofThalictrum thalictroides(Ranunculaceae).Am. J. Bot.73, 190–203. doi: 10.1002/j.1537-2197.1986.tb08520.x Crossref Full Text|Google Scholar Mateu I. (1986). Revision del genero Phlomis l. (Labiatae) en la Peninsula Iberica e Islas Baleares.Acta Botanica Malacitana11, 177–204. doi: 10.24310/Actabotanicaabmabm.v11i.9552 Crossref Full Text|Google Scholar Najar R. A., Wani A. A., Rashid I., and Javid W. (2024). Meiotic chromosomal behaviour ofArtemisia amygdalinaDecne: A critically endangered medicinal plant, endemic to the North-western Himalaya.Flora315, 152525. doi: 10.1016/j.flora.2024.152525 Crossref Full Text|Google Scholar Nirmala A. (1996). Genetics of chromosome numerical mosaism in higher plants.Nucleus39, 151–175. Google Scholar Norton J. D. (1966). Testing of plum pollen viability with tetrazolium salts.Proc. Am. Soc. Hortic. Sci.89, 132. Google Scholar Ozdemir C., Durmuskahya C., and Bozdag B. (2014). Karyological studies on somePhlomisl taxa (Lamiaceae) canan.Pakistan J. Bot.46, 91–94. Google Scholar Pagliarini M. S. (2000). Meiotic behavior of economically important plant species: the relationship between fertility and male sterility.Genet. Mol. Biol.23, 997–1002. doi: 10.1590/S1415-47572000000400045 Crossref Full Text|Google Scholar Potapova T. and Gorbsky G. J. (2017). The consequences of chromosome segregation errors in mitosis and meiosis.Biology6, 12. doi: 10.3390/biology6010012 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar POWO (2024).Plants of the World Online(Facilitated by the Royal Botanic Gardens, Kew). Available at:http://www.plantsoftheworldonline.org/. Google Scholar Qadir R. U., Bhat I. A., Javid H., Wani B. A., Magray J. A., Nawchoo I. A., et al. (2024a). Exploring morphological variability,in vitroantioxidant potential, and HR-LCMS phytochemical profiling of Phlomis cashmeriana Royle ex Benth. across different habitats of Kashmir Himalaya.Environ. Monit. Assess.196, 241. doi: 10.1007/s10661-024-12338-2 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Qadir R. U., Bhat I. A., Javid H., Wani B. A., Magray J. A., Nawchoo I. A., et al. (2024b). Understanding the plant assemblages ofPhlomis cashmerianaRoyle ex Benth. in the Kashmir Himalaya.Discover Plants1, 1–16. Google Scholar Qadir R. U., Javid H., Shapoo G. A., Wani B. A., Magray J. A., Nawchoo I. A., et al. (2022). Phenotypic variability and resource allocation in kashmir sage (Phlomis cashmerianaRoyle ex Benth.) in relation to different habitats and altitudes.Proc. Pakistan Acad. Sciences: B. Life Environ. Sci.59, 35–47. Google Scholar Rana P. K., Kumar P., and Singhal V. K. (2013). Spindle irregularities, chromatin transfer, and chromatin stickiness during male meiosis inAnemone tetrasepala(Ranunculaceae).Turkish J. Bot.37, 167–176. doi: 10.3906/bot-1108-23 Crossref Full Text|Google Scholar Rashid K., Rashid S., Ganie A. H., Nawchoo I. A., and Khuroo A. A. (2021). Meiotic studies, pollen fertility and seed set ofTrillium govanianum, an endangered endemic plant species of the Himalaya.Cytologia86, 245–249. doi: 10.1508/cytologia.86.245 Crossref Full Text|Google Scholar Rashid S., Rashid K., Ganie A. H., Nawchoo I. A., and Khuroo A. A. (2022). Meiotic studies, pollen fertility and seed set ofActaea kashmiriana, an endemic medicinal plant species of Kashmir Himalaya.Cytologia87, 239–244. doi: 10.1508/cytologia.87.239 Crossref Full Text|Google Scholar Rechinger K. H. (1982). “PhlomisL,” inFlora Iranica, vol. 150 . Ed. Rechinger K. H. (Akademische Druck- und Verlagsanstalt, Graz), 292–317. Google Scholar Risso-Pascotto C., Pagliarini M. S., Valle C. D., and Jank L. (2005). Symmetric pollen mitosis I and suppression of pollen mitosis II prevent pollen development inBrachiaria jubata(Gramineae).Braz. J. Med. Biol. Res.38, 1603–1608. doi: 10.1590/S0100-879X2005001100006 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Roof U. Q. (2024).Impact of habitat variability on morpho chemical characters of Phlomis cashmeriana Royle ex Benth.(Unpublished doctoral dissertation)(Srinagar: University of Kashmir). Google Scholar Sadeghian S., Hatami A., and Hamzeh’ee B. (2021). Chromosome counts of six taxa of Lamiaceae from Iran.Iranian J. Bot.27, 58–61. Google Scholar Saggoo M. I. S. and Farooq U. (2011). Meiotic studies inSarcococcaspecies (Buxaceae) from western Himalayas.Cytologia76, 329–335. doi: 10.1508/cytologia.76.329 Crossref Full Text|Google Scholar Sarkhail P., Rahmanipour S., Fadyevatan S., Mohammadirad A., Dehghan G., Amin G., et al. (2007). Antidiabetic effect of Phlomis anisodonta: effects on hepatic cells lipid peroxidation and antioxidant enzymes in experimental diabetes.Pharmacol Res.56 (3), 261–266. PubMed Abstract|PubMed Abstract|Google Scholar Shang, X., Chao, Y., Zhang, Y., Lu, C., Xu, C., and Niu, W. (2016). . 21 (8), 1085 X., Chao Y., Zhang Y., Lu C., Xu C., and Niu W. (2016). Immunomodulatory and antioxidant effects of polysaccharides from Gynostemma pentaphyllum Makino in immunosuppressed mice.Molecules21 (18), 1085. PubMed Abstract|PubMed Abstract|Google Scholar Shivanna K. R. and Rangaswamy N. S. (2012).Pollen biology: a laboratory manual(Springer Science & Business Media). Google Scholar Singh V., Gupta R. C., Sharma K., Sharma V., Sharma M., and Kaur K. (2018). Male meiotic studies in 29 species of Lamiaceae from Sirmaur District of Himachal Pradesh, India.Cytologia83, 235–243. doi: 10.1508/cytologia.83.235 Crossref Full Text|Google Scholar Singhal V. K., Singh J., Singh H., Kumar P., Kholia B. S., and Tewari L. M. (2018). Chromosome count, meiotic abnormalities, pollen fertility and karyotype of Elymus semicostatus (Nees ex Steud.) Meld. (Family: Poaceae) from North-west Himalaya.Caryologia71, 322–330. doi: 10.1080/00087114.2018.1469816 Crossref Full Text|Google Scholar Sofi I. I., Verma S., Ganie A. H., Sharma N., and Shah M. A. (2023). Meiotic behavior and its implications on the reproductive success ofArnebia euchroma(Royle ex Benth.) IM Johnst. (Boraginaceae), an important medicinal plant of Trans-Himalaya.Caryologia76 (3), 29–37. Google Scholar Souza M. M., Martins E. R., Pereira T. N. S., and Oliveira L. O. (2006). Reproductive studies on ipecac (Cephaelis ipecacuanha(Brot.) A. Rich; Rubiaceae): meiotic behavior and pollen viability.Braz. J. Biol.66, 151–159. doi: 10.1590/S1519-69842006000100019 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Tali B. A., Khuroo A. A., Nawchoo I. A., and Ganie A. H. (2019). Prioritizing conservation of medicinal flora in the Himalayan biodiversity hotspot: an integrated ecological and socioeconomic approach.Environ. Conserv.46, 147–154. doi: 10.1017/S0376892918000425 Crossref Full Text|Google Scholar Tarar J. L. (1980). Effect of gamma rays and EMS on growth and branching inTurneria ulmifoliaL.Cytology Genet.14, 118–124. Google Scholar Tripathi R. and Kumar G. (2010). Genetic loss through heavy metal induced chromosomal stickiness in Grass pea.Caryologia63, 223–228. doi: 10.1080/00087114.2010.10589731 Crossref Full Text|Google Scholar Vasek F. C. (1962). Multiple spindle”—a meiotic irregularity inClarkia exilis.Am. J. Bot.49, 536–539. doi: 10.1002/j.1537-2197.1962.tb14977.x Crossref Full Text|Google Scholar Wani B. A., Magray J. A., Qadir R. U., Javid H., Ganie A. H., and Nawchoo I. A. (2022). Meiotic bottlenecks compromises reproductive success by impairing pollen fertility and seed set inSwertia thomsoniiCB Clarke—an important endemic medicinal herb of Western Himalaya.Cytologia87, 323–330. doi: 10.1508/cytologia.87.323 Crossref Full Text|Google Scholar Weitz A. P., Dukic M., Zeitler L., and Bomblies K. (2021). Male meiotic recombination rate varies with seasonal temperature fluctuations in wild populations of autotetraploidArabidopsis arenosa.Mol. Ecol.30, 4630–4641. doi: 10.1111/mec.v30.19 PubMed Abstract|PubMed Abstract|Crossref Full Text|Google Scholar Yildiz K. and Gücel S. (2006). Chromosome numbers of 16 endemic plant taxa from Northern Cyprus.Turkish J. Bot.30, 181–192. Google Scholar Yousefi H., Amirahmadi A., Naderi R., and Atri M. (2018). Chromosome numbers and karyotype features ofPhlomis olivieriBenth. (Lamiaceae) from Iran.Acta Botanica Croatica77, 93–96. doi: 10.2478/botcro-2018-0001 Crossref Full Text|Google Scholar Keywords:meiotic behavior, abnormalities, pollen fertility, seed set, conservation Citation:Qadir RU, Javid H, Ganie AH, Wani BA, Nawchoo IA and Magray JA (2025) Unraveling the meiotic puzzle: chromosome count, meiotic behaviour, and reproductive challenges inPhlomis cashmerianaRoyle ex Benth. from the Kashmir Himalaya.Front. Conserv. Sci.6:1542455. doi: 10.3389/fcosc.2025.1542455 Received:09 December 2024;Accepted:20 May 2025;Published:05 June 2025. Edited by: Reviewed by: Copyright© 2025 Qadir, Javid, Ganie, Wani, Nawchoo and Magray. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Junaid A. Magray,anVuYWlkbWFncmF5Nzg2QGdtYWlsLmNvbQ== Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Materials and methods Results Discussion Conclusions and conservation implications Data availability statement Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}