{"id": 511, "name": "Frontiers in Bird Science", "domain": "frontiersin.org/journals/bird-science", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/bird-science/articles/10.3389/fbirs.2025.1587072/full", "title": "Bird Science", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Bird Conservation and Management Bird Ecology and Behavior Bird Movements and Migration Science of Birding Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Bird Conservation and Management Bird Ecology and Behavior Bird Movements and Migration Science of Birding Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Bird Conservation and Management Bird Ecology and Behavior Bird Movements and Migration Science of Birding Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Bird Sci., 29 May 2025 Sec. Bird Ecology and Behavior Volume 4 - 2025 |https://doi.org/10.3389/fbirs.2025.1587072 This article is part of the Research TopicBioenergetic and Behavioral Effects of Rapid Anthropogenic Change and Eco-evolutionary ImplicationsView all 4 articles **A decade of diving: responses of Cassin’s auklets to variable foraging conditions in the California Current System** 1Department of Biology, Pomona College, Claremont, CA, United States 2Point Blue Conservation Science, Petaluma, CA, United States 3Department of Mathematics and Statistics, Pomona College, Claremont, CA, United States 4Biota.earth, Berkeley, CA, United States We investigated how a planktivorous seabird adjusts its foraging behavior in response to different levels of prey biomass. We studied the diving behavior of Cassin’s auklets (Ptychoramphus aleuticus) breeding on Southeast Farallon Island and feeding in the highly variable California Current System. In recent years Cassin’s auklets have experienced mass mortality events and complete reproductive failure due to anomalous atmospheric and oceanographic conditions. We hypothesized that in years with low prey biomass, Cassin’s auklets work harder to collect food for themselves and for their chick and that reproductive success is lower during those years. To test this hypothesis, we equipped 133 Cassin’s auklets with Time Depth Recorders from 2008 – 2017. We estimated krill biomass levels in the top 30 m during oceanographic cruises carried out where Cassin’s auklets foraged. We measured the annual number of chicks fledged per pair. In years with high prey biomass reproductive success was very high and Cassin’s auklets collected prey in fewer, deeper and longer dives. They spent more time in the bottom of their dives and more time underwater. When krill biomass was low, they made shallow, shorter dives and a higher number of these dives during their foraging trips. Variability in the California Current System greatly influenced the diving behavior and reproductive success of the Cassin’s auklets. Climate anomalies that lead to extremely low krill biomass are expected to become more frequent. Cassin’s auklets are likely not going to able to increase their foraging effort enough to be able to survive and reproduce. **Introduction** The purpose of this study was to investigate how a top predator adjusts its foraging behavior in response to variable levels of prey in a highly dynamic ecosystem. In the California Current System, seasonal upwelling of cold, nutrient rich water promotes blooms of phytoplankton, which in turn, support grazing zooplankton that are prey for upper trophic predators. The upwelling dynamics of the California Current System have become increasingly variable with higher frequencies and intensities of El Niño and La Niña conditions and other atmospheric anomalies (BjorkstEdt et al., 2011;Cai et al., 2014;Guilyardi and Jin, 2014;Piatt et al., 2020;Renner et al., 2024;Sydeman et al., 2014;Thompson et al., 2024). This variability in atmospheric and oceanographic conditions causes large inter-annual differences in the levels of zooplankton (Manugian et al., 2015). Coupled with this variability, there has been an overall decline in zooplankton (Roemmich and McGowan, 1995). These changes have been reflected in the inter-annual differences in diets, phenology and reproductive success of seabirds feeding in the California Current (Abraham and Sydeman, 2004;Ainley et al., 1995, 1996;Hipfner 2008;Jahncke et al., 2008;Sydeman et al., 2009). Southeast Farallon Island, part of the Farallon Islands National Wildlife Refuge, has a large breeding population of Cassin’s aukletsPtychoramphus aleuticus(Figure 1). Cassin’s auklet reproductive success has been monitored on the Farallon Islands since 1972 (Ainley and Boekelheide, 1990). Cassin’s auklets are sensitive to variations in oceanographic conditions which influence prey availability (Abraham and Sydeman, 2004,2006;Ainley et al., 1996). For example, anomalous oceanographic conditions in 2005 caused low marine productivity and complete reproductive failure in Cassin’s auklets (Jahncke et al., 2008;Sydeman et al., 2006), whereas in other years, abundant prey allows many pairs to raise a second chick during the breeding season (double brooding) (Ainley and Boekelheide, 1990;Johns et al., 2017). Figure 1. Southeast Farallon Island is south of Point Reyes in Northern California (below Line 6). Shipboard surveys of the ACCESS program with acoustic measurements of krill covered the area where Cassin’s auklet foraged. The circles indicate where net tows were carried out. Cassin’s auklets are sub-surface foragers that use wing-propelled dives to capture zooplankton prey, primarily the krill speciesEuphausia pacificaandThysanoessaspinifera(Abraham and Sydeman, 2006;Ainley and Boekelheide, 1990;Ainley et al., 1996;Manugian et al., 2015). Both male and female Cassin’s auklets take turns incubating the egg, brooding the chick in the early stages, and foraging for the chick (Manuwal, 1974). Cassin’s auklets spend the entire day out foraging in areas where krill are abundant (Manugian et al., 2015). They leave their nests before sunrise and return after sunset (Manuwal, 1974). During the breeding season they are Central Place Foragers which means that they must return to their nest to feed their chick and so that places limits on how far they can travel to find food (Orians and Pearson, 1979). Cassin’s auklets have extremely high energy demands due to their energetically expensive flights in and out of the water; they need to consume 67% of their body mass a day in krill (Hodum et al., 1998). Manugian et al. (2015)found that the number of dives and the numbers of birds that dove to maximum dive depths varied interannually in Cassin’s auklets breeding on the Farallon Islands from 2008 - 2013. In this study, we extend the analyses of diving behavior in these same Cassin’s auklets along with others breeding on Southeast Farallon Island in 2014–2017 in order to understand how inter-annual variations in krill availability influence the diving behavior of Cassin’s auklets. We hypothesized that in years with lower krill biomass, the birds work harder to collect krill for themselves and for their chicks. We also hypothesized that in years with lower levels of krill, Cassin’s auklets have lower productivity (chicks fledged per pair). We predicted that during years with lower levels of prey, Cassin’s auklets would need to make more dives during foraging trips. We predicted that in years with lower levels of available krill, Cassin’s auklets would search for prey by making shallower, shorter dives with shorter post-dive intervals before diving to search again. In contrast, in years with high biomass of krill, we predicted they would make longer dives to collect abundant prey and would swim to deeper areas to target the dense layers of krill. We predicted they would spend more time diving within dive bouts, but make fewer dives. Additionally, we predicted that in those years with abundant prey, they would spend more time in the bottom portion of the dive (collecting krill) and therefore would make more U-shaped (versus more V-shaped) dives. **Methods** We carried out this study for 10 consecutive breeding seasons from 2008 to 2017 on Southeast Farallon Island (37°41’N, 123° 0’W), part of the Farallones Islands National Wildlife Refuge (Figure 1). During those years, we used time-depth recorders (TDRs) to measure the diving behavior of Cassin’s auklets during the chick rearing period of their breeding cycle. The parent wearing the TDR had a chick aged between 5–35 days old. Most (85%) were between 5 and 15 days old. Cassin’s auklets typically nest in burrows they dig in the dirt which are often too deep and fragile to extract birds from safely without damaging their nest site. We selected Cassin’s auklets that breed in artificial nest boxes so that we could easily install and recover the TDRs as well as band and monitor the reproductive success of the birds with minimal handling and disturbance to the nest site (Ainley and Boekelheide, 1990,Figure 2). Figure 2. A Cassin’s auklet on Southeast Farallon Island with a TDR affixed to feathers on its ventral side (photo N. Karnovsky). We affixed CEFAS G5 TDRs (CEFAS Technology Limited, Suffolk, United Kingdom) to the belly feathers of breeding Cassin’s auklets with Loctite glue (Figure 2). We used TDRs that were rounded at the “head” end to reduce drag (Wilson and Culik, 1994). The TDRs measured 8mm x 31mm and weighed 2.7g in air (1.3g in water) which is less than 2% of the body weight of an adult Cassin’s auklet. We programmed the TDRs to record pressure and temperature every five seconds when at the surface or in flight. When the bird dove deeper than 1.5db (1.5m), we increased sampling frequency to every 0.5 seconds until the end of the dive (“fast-logging”) (Karnovsky et al., 2011). The TDRs measured depth to within 4 cm of accuracy, and temperature to within ±0.1°C. We retrieved most TDRs after 2–5 days. We removed the TDRs by snipping the few feathers that were glued to the TDR. We estimated Cassin’s auklet annual productivity by following pairs of Cassin’s auklets throughout the breeding season to determine the number of chicks fledged per breeding pair, per year. **Diving variables** For each foraging trip (Figure 3a), we calculated the number of dives the bird made. Diving during foraging trips occurs in discrete bouts of diving. We considered a dive bout to be a set of dives in which each dive was separated by a short interval (<2min) at the surface (Figure 3b,Monaghan et al., 1994). For each bout we calculated the number of dives and the percentage of the time in each bout that was spent diving. For each dive, if the time elapsed before the next dive was <2min, it was defined as the post dive interval (PDI – recovery time) for that dive, while if the time elapsed before the next dive was >2min, we considered that dive to be the last of the diving bout. Figure 3.(a)Temperature and pressure patterns of a typical foraging trip of a Cassin’s auklet foraging in 2008. This bird flew out from the colony around 4:43 in the morning and returned after 21:15 in the evening,(b)a single diving bout; a series of dives with less than 2 minutes between dives,(c)a single dive. We defined a dive as the underwater period in which the bird reached a depth of at least 1.5db (1.5m,Figure 3c). To analyze the dives, we used the fast-logging portion of each TDR deployment. We considered a decrease in pressure to be a dive only if there were more than 4 points (2 seconds) to be analyzed. We also removed from the analyses dives which had a pressure read of more than 40db (40m), as these were most likely increases in pressure from other causes (for example, when the bird leans on the TDR while in the nest box). For each dive we calculated the maximum depth (m), length of the dive (sec), and the time spent in the bottom portion of the dive (sec). We defined “bottom time” as the amount of time of each dive spent within 80% of the maximum depth of that dive (Kuroki et al., 2003). We determined dive shape (frequency) by dividing bottom time by dive duration (high values = U-shaped dives). We then averaged these values over all the trips corresponding to each individual bird. We developed a Python script to automate the analyses. **Prey biomass** To assess how diving behavior is affected by prey levels, we estimated the level of krill biomass (g m-2) from data collected during oceanographic cruises that were part of the Applied California Current Ecosystem Studies (ACCESS) program. The ACCESS cruises occurred during the Cassin’s auklet chick rearing period. While the ship travelled along transect lines within the foraging range of the Cassin’s auklets, we used a Simrad EK60 echosounder to measure the backscatter of zooplankton during acoustic surveys (Figure 1,Manugian et al., 2015). We only used data from the top 30 meters of the water column (minus the backscatter in the top 5 meters that are influenced by surface interference). The top 30 meters encompasses the foraging depths of the Cassin’s auklets (Manugian et al., 2015). We confirmed that the backscatter was primarily fromT.spiniferaandE. pacifica, the two krill species that constitute most of the Cassin’s auklet diets, from hoop net samples taken during the annual cruises at standardized locations within the foraging range of the Cassin’s auklets (Manugian et al., 2015). We towed the hoop net (1m diameter, 333 µm mesh, equipped with a General Oceanics model 2030R mechanical flowmeter) obliquely for approximately 10 minutes to sample the upper 50 m of the water column during daytime hours; we sampled at six stations on each of the three oceanographic lines (Figure 1). We preserved all zooplankton samples in 10% formalin and identified the species, age classes of the zooplankton. We also measured and weighed subsamples of the zooplankton (Manugian et al., 2015). Based on these data, we derived a single value of krill biomass in the upper 30 m for each year for the study. In order to meet the technical conditions of the linear model, we used a log2 transformation on krill biomass, the explanatory variable. We considered a year to be a “high” krill year if it was greater than 0.5 from the standardized mean of 0 and a “low” krill year if it was less than -0.5 away from the standardized mean. We considered years to be “fair” krill years if they were close to the standardized mean (between +0.5 and -0.5Figure 4). To test the hypothesis that krill biomass influences Cassin’s auklet reproductive success, we carried out a regression of Cassin’s auklet productivity on the log of krill biomass (hereafter ‘krill biomass’) for the years 2008–2017 and calculated R2value for that relationship. We used ordinary least squares (OLS) linear regressions for each of the diving variables to see how differences in krill biomass levels influence the diving variables. We also determined if there was a non-linear relationship of krill biomass with diving variables. If those models were a better fit than the linear ones, we reported those results instead. In order for each data point to be independent, we averaged each measure of diving for each of the individual Cassin’s auklets. We recognize that due to the large number of tests, we may have additional false positive results. Overall, we tested 11 hypotheses. Using a Bonferroni p-value adjustment (dividing p-value 0.05 by 11), we used p-value <0.0045 for significance. To assess interannual differences in diving parameters of Cassin’s auklets, we created a multi-dimensional scaling plot (MDS) and used a PERMANOVA to assess overall differences and then used multiple pairwise comparisons to understand which years were most different. We used four parameters that we considered independent: average dive depth (m), bottom time (sec), number of dives per bout and number of dives per foraging trip. Only one bird in a pair wore a TDR. We determined the reproductive success of pairs with and without one member wearing a TDR. We carried out a paired t-test on the average reproductive success for each year of each of the two groups paired by year to determine if there were differences between the two groups over the 10 years of the study. **Results** We found that from 2008 to 2017, the annual average biomass of krill in the top 30 m of the water column varied from a low of 0.16 g/m2in 2008 to a high of 6.01 g/m2in 2010. Likewise, Cassin’s auklet productivity varied from 0.64 chicks raised per pair in 2008 to a high of 1.62 chicks fledged per breeding pair in 2010, when many pairs raised a second chick. The variation in krill biomass from 2008–2017 explained much of the variation in Cassin’s auklet productivity (Figure 4, R2= 0.77). Figure 4. The relationship between krill biomass (red) and Cassin’s auklet productivity (blue) for the ten years of this study (2008 – 2017). From 2008 to 2017, we caught and affixed TDRs to 162 Cassin’s auklets. Of those, we recovered 152 TDRs, and of those, 133 had usable data (several of the TDRs suffered battery failure or had connectivity problems). The Cassin’s auklets wore the TDRs during a total of 381 foraging trips during which they made a total of 107,552 dives (Table 1). Table 1. The number of Cassin’s auklets that wore TDRs over the ten years of this study and the total number of foraging trips made by those birds. We found that when krill biomass was high, the number of dives made during foraging trips decreased (Figure 5, t = -4.36, df = 131, p = 0.000). For every unit increase in krill biomass, the number of dives during entire foraging trips declined by 32 dives. However, the average number of bouts made per foraging trip did not vary with krill biomass (Supplementary Figure 1, t = -1.83, df = 131, p = 0.069). The fraction of time spent diving during a bout of diving increased with krill biomass. With every unit increase in the krill biomass, the fraction of time spent diving increased by 2% (Figure 6, t = 4.93, df = 131 p = 0.000). Figure 5. The average number of dives made per foraging trip (time from departure of colony to return to colony) in relation to krill biomass. Each dot represents the average for a single Cassin’s auklet, n=133. Figure 6. The fraction of time spent diving within a dive bout (consecutive dives + post dive intervals with less than 2-minute intervals between dives) in relation to krill biomass. We found that the number of dives within a bout of diving had a quadratic relationship with krill biomass. That is, the number of dives was lowest when krill biomass was lowest but was also low when krill biomass was high (Supplementary Figure 2, F = 6.57, df = 2,130, p = 0.009). However, with the Bonferroni correction factor, this test is not-significant (p = 0.009 > 0.0045). Cassin’s auklet diving depth was positively correlated with high krill biomass (R2= 0.28,Figure 7a). For every one unit increase in the level of biomass of krill the predicted average dive depth was 1.7m deeper (t =7.2, df = 131, p = 0.000). We found that dive depth and dive length were correlated (R2= 0.815). Therefore, as krill biomass increased, so did dive length (R2= 0.35). For every unit increase in krill biomass, dive length is predicted to increase by 5.1 seconds (Figure 7b, t = 6.8, df = 131, p = 0.000). We found that the length of the post dive interval was positively correlated with the lengths of the dives (R2= 0.35) such that longer dives required a longer recovery period. For every unit increase in the krill biomass, the Cassin’s auklets increased their PDI by 2 seconds (Figure 7c, t = 3.2, df = 131, p = 0.002). We found that when krill biomass was high, Cassin’s auklets spent more time at the bottom of their dives. Bottom time increased by 2.1 percent with increases in krill biomass, (Figure 8, t= 4.965, df = 131, p = 0.000). However, we found that average dive shape did not vary with krill biomass (Supplementary Figure 3, t = -0.046, df = 131, p =0.964). Figure 7. The changes in(a)dive depth (m),(b)dive length (sec),(c)post-dive interval (PDI in second) in relation to krill biomass. Each dot represents the average for a single Cassin’s auklet, n=133. Figure 8. The fraction of time spent in the bottom 80% portion of the dives in relation to krill biomass. Each dot represents the average bottom time of a single Cassin’s auklet, n=133. We found that there were interannual differences in diving behavior of the Cassin’s auklets based on the parameters average depth (m), bottom time (sec), dives per bout and dives per foraging trip (Figure 9. PERMANOVA, Pseudo-F=7.8997 df = 9, 123 p = 0.0001). Pairwise comparisons of differences revealed many significant differences even with a Bonferroni corrected p-value of 0.001 (21 of the 44 comparisons,Supplementary Table 1). There are several years when Cassin’s auklets clustered together with very little overlap with other years. Of those years, 2008 is one of the most distinct (Figure 9). Figure 9. A multi-dimensional scaling (MDS) plot of all the Cassin’s auklets. In this plot each symbol represents a single Cassin’s auklet. This plot was derived from measures of average depth (m), bottom time (sec), number of dives per bout and dives per foraging trip. **Impact of TDRs on Cassin’s auklets** The mean reproductive success (chicks fledged) of Cassin’s auklet pairs in which one member of the pair wore a TDR was 86% (2008 -2017). The mean reproductive success of Cassin’s auklets that were followed but did not have a TDR was 104%. This number is above 100% due to double brooding. Pairs with TDRs had higher reproductive success than the non-TDR study birds in some years (2008, 2009, 2015, 2016) or equal reproductive success (87%, 2017). In the other years they had lower reproductive success. Overall, there was no significant difference between the two groups (paired t-test, t= 1.87, df = 9, p = 0.09). **Discussion** We found that Cassin’s auklet diving behavior varied in concrete ways during the ten years of this study. Cassin’s auklet reproductive success and diving behavior varied with the low, fair, and high levels of krill biomass. There was only one year (2008) that had lower than average biomass of krill and this year had lower than average reproductive success (0.64 chicks fledged per pair) compared to the long-term average (0.74). There were, however, several years (four) with high krill biomass levels and reproductive success (>100% reproductive success due to double brooding in 2010-2013) and five years with fair levels of krill biomass and reproductive success (Figure 4). Therefore, our analysis did not capture the diving responses of Cassin’s auklets foraging in a very bad year with extremely low krill biomass and reproductive success. Recovering TDRs during very poor years when the Cassin’s auklets abandon the colony (as they did on Southeast Farallon Island for the first time in 2005 and 2006) would be very difficult, therefore, we consider it fortunate that extremely poor conditions did not exist during our study. We found that when krill biomass was low (2008), the birds made more dives during their foraging trips. This increase in number of dives may indicate that they may have had to work harder to collect food for themselves and for their chicks. In contrast, in high krill biomass years, Cassin’s auklets made fewer dives, however, the dives they made were longer and deeper with more time on the bottom portion of their dives. This pattern is likely an indication that they were foraging on dense patches of krill. They were able to fill up on krill in fewer but longer and deeper dives and found enough krill to successfully raise a chick. Some individuals in those high krill years (such as 2010) were in good enough condition to raise a second chick during the breeding season (Johns et al., 2017). With low krill biomass, the shallow, short dives may be indicative of a higher proportion of unprofitable dives in which they pick up low numbers of krill per dive. The frequent shallow dives could be an indication of patchily distributed krill or low densities of krill. They may be making more searching dives when there is low krill biomass. Lastly, these shorter, shallower and more frequent dives when krill biomass was low might reflect feeding on non-krill types of prey that are less aggregated. In 2008, when the biomass of krill was low, a large portion of the Cassin’s auklet chick diets were made up of mysids (Manugian et al., 2015). Mysids occur in low densities in the upper part of the water column. Frequent diving for these mysids may explain the shallower and shorter dives in 2008. Reproductive success was lower in 2008 (0.64 chicks per pair) therefore diving for mysids may have been energetically expensive, bringing reproductive success down. When we compared multiple dive parameters within Cassin’s auklets foraging in different years, birds foraging in 2008 had very little overlap with birds other years although other years differed as well (MDS plot,Figure 9). Even though Cassin’s auklets increased their bottom time in years with higher biomass (Figure 8), we did not find any change in dive shape across years. There are several possible explanations for this counter-intuitive result. Both deep dives in high krill years and the shallow dives when krill biomass was low, may be U-shaped. Another possibility is that in all years, Cassin’s auklets make a mixture of both V-shaped and U-shaped dives and, by taking the average dive shape (frequency) per bird, we were not able to distinguish differences amongst years. Little auks (Alle alle) are similar in size to Cassin’s auklets and are also planktivorous members of the Family Alcidae. Little auks foraging in the Greenland Sea exhibit similar responses to prey biomass differences as Cassin’s auklets. For example, little auks feeding on smaller prey made more dives per 24 hours (Karnovsky et al., 2011) just as Cassin’s auklets made more dives in low krill years. Another similarity was in the number of dives per bout. In both species, when prey biomass was low (in the case of little auks, where the size of prey was small) birds made dive bouts with low numbers of dives which might indicate a series of searching dives for patches of prey (Karnovsky et al., 2011). In this study, we used annual measures of krill biomass and diving parameters. Given that there is a clear link between food availability, diving effort and reproductive success, future investigations should focus on how diving behavior of Cassin’s auklets changes as the food web in the California Current System develops within a breeding season.Abraham and Sydeman (2004)found that Cassin’s auklets switch to targeting moreT.spiniferaduring the chick rearing period and that low abundances ofT.spiniferaare associated with slower chick growth in Cassin’s auklets breeding on Southeast Farallon Island (Abraham and Sydeman, 2004,2006). This study contributes to our understanding of the mechanisms by which Cassin’s auklets are sensitive to bottom-up forcing. Their behavior at-sea is linked to their zooplankton prey which in turn, is linked to oceanographic conditions driven by atmospheric forcing. Except for 2008, the krill abundance and reproductive success in the years of this study were near or above average. However, the frequency of anomalous years with low krill biomass are increasing (Cai et al., 2014;Thompson et al., 2024). Anomalous climate conditions which lead to declines in zooplankton have severe consequences for Cassin’s auklets (Jahncke et al., 2008;Jones et al., 2018;Lee et al., 2007;Sydeman et al., 2006,2014;Wolf et al., 2009). During this study, there was a marine heatwave event which led to unprecedented die-offs of seabirds (Piatt et al., 2020;Renner et al., 2024). In 2014, thousands of Cassin’s auklets died of starvation and washed up on beaches (Jones et al., 2018). After these high mortality events, Cassin’s auklets had increases in their populations due to high recruitment into empty nest sites (Johns et al., 2022). Therefore, the Cassin’s auklet population on Southeast Farallon Island was able to rebound, to some extent, after these anomalous events. We found that low biomass of krill leads to increases in foraging effort. With frequent and extreme climate change induced perturbations to the California Current System, there may be more breeding seasons when the Cassin’s auklet may not be able to increase its foraging effort to buffer low availability of krill biomass. This study contributes to our understanding of the behavioral responses of Cassin’s auklets to variations in prey biomass and points to the importance of long-term measurements of oceanographic conditions, breeding success, and foraging behavior. **Data availability statement** The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. **Ethics statement** The animal study was approved by Pomona College Institutional Animal Care and Use Committee. The study was conducted in accordance with the local legislation and institutional requirements. **Author contributions** NK: Conceptualization, Data curation, Formal Analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Supervision, Visualization, Writing – original draft, Writing – review & editing. PW: Data curation, Investigation, Methodology, Supervision, Writing – review & editing. AC: Formal Analysis, Methodology, Software, Supervision, Validation, Visualization, Writing – review & editing. JH: Formal Analysis, Visualization, Writing – review & editing. ZB: Conceptualization, Formal Analysis, Methodology, Visualization, Writing – review & editing. EC: Conceptualization, Formal Analysis, Investigation, Visualization, Writing – review & editing. CF: Conceptualization, Formal Analysis, Investigation, Visualization, Writing – review & editing. GG: Formal Analysis, Methodology, Visualization, Writing – review & editing. NM: Formal Analysis, Methodology, Visualization, Writing – review & editing. KM: Conceptualization, Formal Analysis, Investigation, Methodology, Visualization, Writing – review & editing. RB: Conceptualization, Investigation, Supervision, Writing – review & editing. ME: Formal Analysis, Investigation, Writing – review & editing. BS: Formal Analysis, Investigation, Visualization, Writing – review & editing. JJ: Conceptualization, Funding acquisition, Investigation, Project administration, Supervision, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by a grant from the Pomona College Research Fund to NK, and Pomona College Summer Undergraduate Research Program grants to KM and CF. EC was supported by a Pomona College grant from the Howard Hughes Medical Institute. Funders for Point Blue’s Farallon and ACCESS Research Programs include the Bently Foundation, Boring Family Foundation, California Sea Grant, Campini Foundation, Elinor Paterson Baker Trust, Firedoll Foundation, Hellman Family Foundation, Kimball Foundation, Marisla Foundation, Mead Foundation, Moore Family Foundation, National Fish and Wildlife Foundation, Resources Legacy Fund, Wendy P. McCaw Foundation, and individual donors. **Acknowledgments** We thank the Point Blue Conservation Science biologists and volunteers who helped to collected these data on the island and out at sea, the Farallon Patrol for transportation to the island, and the U.S. Fish and Wildlife Service for granting permission to conduct research on the Farallon Islands National Wildlife Refuge. We also thank M. Brown and D. Howard for their support, as well as J. Roletto, D. Lipski, K. Graiff and L. Etherington and volunteers from Cordell Bank and the Greater Farallones National Marine Sanctuaries for coordinating and facilitating the ACCESS cruises. Thanks to C. Chang and W. M. Meyer, III, Pomona College, for assistance with diving analyses. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **Supplementary material** The Supplementary Material for this article can be found online at:https://www.frontiersin.org/articles/10.3389/fbirs.2025.1587072/full#supplementary-material **References** Abraham C. L. and Sydeman W. J. (2004). Ocean climate, euphausiids and auklet nesting: inter-annual trends and variation in phenology, diet and growth of a planktivorous seabird,Ptychoramphus aleuticus.Mar. Ecol. Prog. Ser.274, 235–250. doi: 10.3354/meps274235 Crossref Full Text|Google Scholar Abraham C. L. and Sydeman W. J. (2006). Prey-switching by Cassin’s aukletPtychoramphus aleuticusreveals seasonal climate-related cycles ofEuphausia pacificaandThysanoessaspinifera.Mar. Ecol.-Prog. Ser.313, 271–283. doi: 10.3354/meps313271 Crossref Full Text|Google Scholar Ainley D. G. and Boekelheide R. J. (Eds.) (1990).Seabirds of the Farallon Islands: ecology, dynamics, and structure of an upwelling-system community(Stanford, Calif: Stanford University Press). Google Scholar Ainley D. G., Spear L. B., and Allen S. G. (1996). Variation in the diet of Cassin’s auklet reveals spatial, seasonal, and decadal occurrence patterns of euphausiids off California, USA.Mar. Ecol.-Prog. Ser.137, 1–10. doi: 10.3354/meps137001 Crossref Full Text|Google Scholar Ainley D. G., Sydeman W. J., and Norton J. (1995). Upper trophic level predators indicate interannual negative and positive anomalies in the California Current food web.Mar. Ecol. Prog. Ser.118, 69–79. doi: 10.3354/meps118069 Crossref Full Text|Google Scholar BjorkstEdt E. P., Goericke R., McClatchie S., Weber E. D., Watson W., Lo N., et al. (2011). State of the California Current 2010–2011: regionally variable responses to a strong (but fleeting)?La Niña Calif. Cooper. Ocean. Fish. Invest. Rep.52, 36–68. Google Scholar Cai W., Borlace S., Lengaigne M., van Rensch P., Collins M., Vecchi G., et al. (2014). Increasing frequency of extreme El Niño events due to greenhouse warming.Nat. Clim Change4, 111–116. doi: 10.1038/nclimate2100 Crossref Full Text|Google Scholar Guilyardi E. and Jin F.-F. (2014). Increasing frequency of extreme El Nino events due to greenhouse warming.Nat. Clim. Change4, 111–116. doi: 10.1038/nclimate2100 Crossref Full Text|Google Scholar Hipfner J. M. (2008). Matches and mismatches: ocean climate, prey phenology and breeding success in a zooplanktivorous seabird.Mar. Ecol. Prog. Ser.368, 295–304. doi: 10.3354/meps07603 Crossref Full Text|Google Scholar Hodum P. J., Sydeman W. J., Visser G. H., and Weathers W. W. (1998). Energy expenditure and food requirement of Cassin’s Auklets provisioning nestlings.Condor100, 546–550. doi: 10.2307/1369722 Crossref Full Text|Google Scholar Jahncke J., Saenz B. L., Abraham C. L., Rintoul C., Bradley R. W., and Sydeman W. J. (2008). Ecosystem responses to short-term climate variability in the Gulf of the Farallones, California.Prog. Oceanography77, 182–193. doi: 10.1016/j.pocean.2008.03.010 Crossref Full Text|Google Scholar Johns M. E., Warzybok P., Bradley R. W., Jahncke J., Lindberg M., and Breed G. (2017). Age, timing, and a variable environment affect double brooding of a long-lived seabird.Mar. Ecol. Prog. Ser.564, 187–197. doi: 10.3354/meps11988 Crossref Full Text|Google Scholar Johns M. E., Warzybok P., Jahncke J., Doak P., Lindberg M., and Breed G. A. (2022). Episodes of high recruitment buffer against climate-driven mass mortality events in a North Pacific seabird population.J. Anim. Ecol.91, 345–355. doi: 10.1111/1365-2656.13630 PubMed Abstract|Crossref Full Text|Google Scholar Jones T., Parrish J. K., Peterson W. T., Bjorkstedt E. P., Bond N. A., Ballance L. T., et al. (2018). Massive mortality of a planktivorous seabird in response to a marine heatwave.Geophysical Res. Lett.45, 3193–3202. doi: 10.1002/2017GL076164 Crossref Full Text|Google Scholar Karnovsky N., Brown Z., Welcker J., Harding A., Walkusz W., Cavalcanti A., et al. (2011). Inter-colony comparison of diving behavior of an Arctic top predator: implications for warming in the Greenland Sea.Mar. Ecol. Prog. Ser.440, 229–240. doi: 10.3354/meps09351 Crossref Full Text|Google Scholar Kuroki M., Kato A., Watanuki Y., Niizuma Y., Takahashi A., and Naito Y. (2003). Diving behavior of an epipelagically feeding alcid, the Rhinoceros Auklet (Cerorhinca monocerata).Can. J. Zoology81, 1249–1256. doi: 10.1139/z03-112 Crossref Full Text|Google Scholar Lee D. E., Nur N., and Sydeman W. J. (2007). Climate and demography of the planktivorous Cassin’s auklet off northern California: implications for population change.J. Anim. Ecol.76, 337–347. doi: 10.1111/j.1365-2656.2007.01198.x PubMed Abstract|Crossref Full Text|Google Scholar Manugian S., Elliott M. L., Bradley R., Howar J., Karnovsky N., Saenz B., et al. (2015). Spatial distribution and temporal patterns of Cassin’s Auklet foraging and their Euphausiid prey in a variable ocean environment.PloS One10, e0144232. doi: 10.1371/journal.pone.0144232 PubMed Abstract|Crossref Full Text|Google Scholar Manuwal D. A. (1974). The natural history of Cassin’s Auklet (Ptychoramphus aleuticus).Condor76, 421–431. doi: 10.2307/1365815 Crossref Full Text|Google Scholar Monaghan P., Walton P., Wanless S., Uttley J. D., and BlJrns M. D. (1994). Effects of prey abundance on the foraging behaviour, diving efficiency and time allocation of breeding GuillemotsUria aalge.Ibis136, 214–222. doi: 10.1111/j.1474-919X.1994.tb01087.x Crossref Full Text|Google Scholar Orians G. H. and Pearson N. E. (1979). “On the theory of central place foraging,” inAnalysis of Ecological Systems. Eds. Horn D. J., Mitchell R. D., and Stairs G. R. (The Ohio State University Press, Columbus), 154–177. Google Scholar Piatt J. F., Parrish J. K., Renner H. M., Schoen S. K., Jones T. T., Arimitsu M. L., et al. (2020). Extreme mortality and reproductive failure of common murres resulting from the northeast Pacific marine heatwave of 2014-2016.PLoS One15, e0226087. doi: 10.1371/journal.pone.0226087 PubMed Abstract|Crossref Full Text|Google Scholar Renner H. M., Piatt J. F., Renner M., Drummond B. A., Laufenberg J. S., and Parrish J. K. (2024). Catastrophic and persistent loss of common murres after a marine heatwave.Science386, 1272–1276. doi: 10.1126/science.adq4330 PubMed Abstract|Crossref Full Text|Google Scholar Roemmich D. and McGowan J. (1995). Climatic warming and the decline of zooplankton in the California current.Science267, 1324–1326. doi: 10.1126/science.267.5202.1324 PubMed Abstract|Crossref Full Text|Google Scholar Sydeman W. J., Bradley R. W., Warzybok P., Abraham C. L., Jahncke J., Hyrenbach K. D., et al. (2006). Planktivorous auklet Ptychoramphus aleuticus responses to ocean climate 2005: Unusual atmospheric blocking?Geophys. Res. Lett.33, L22S09. doi: 10.1029/2006GL026736 Crossref Full Text|Google Scholar Sydeman W. J., García-Reyes M., Schoeman D. S., Rykaczewski R. R., Thompson S. A., Black B. A., et al. (2014). Climate change. Climate change and wind intensification in coastal upwelling ecosystems. Science. Climate change and wind intensification in coastal upwelling ecosystems.Science345, 77–80. doi: 10.1126/science.1251635 PubMed Abstract|Crossref Full Text|Google Scholar Sydeman W. J., Mills K. L., Santora J. A., Thompson S. A., Bertram D. F., Morgan K. H., et al. (2009). Seabirds and climate in the California current-a synthesis of change.Calif. Coop. Ocean. Fish. Invest. Rep.50, 82–104. Google Scholar Thompson A. R., Swalethorp R., Alksne M., Santora J. A., Hazen E. L., Leising A., et al. (2024). State of the California Current Ecosystem report in 2022: a tale of two La Niñas.Front. Mar. Sci.11. doi: 10.3389/fmars.2024.1294011 Crossref Full Text|Google Scholar Wilson R. P. and Culik B. M. (1994). Hydrodynamic aspacts of design and attachment of a backmounted device in penguins.J. Exp. Biol.194, 83–96. doi: 10.1242/jeb.194.1.83 PubMed Abstract|Crossref Full Text|Google Scholar Wolf S. G., Sydeman W. J., Hipfner J. M., Abraham C. L., Tershy B. R., and Croll D. A. (2009). Range-wide reproductive consequences of ocean climate variability for the seabird Cassin’s Auklet.Ecology90, 742–753. doi: 10.1890/07-1267.1 PubMed Abstract|Crossref Full Text|Google Scholar Keywords:Cassin’s auklets, Southeast Farallon Island, California Current System, time depth recorders, diving behavior, krill, seabird, climate change Citation:Karnovsky NJ, Warzybok P, Cavalcanti A, Hardin J, Brown ZW, Caves E, Flynn CM, Gallaher G, McDuffie N, McOmber K, Bradley RW, Elliott ML, Saenz BT and Jahncke J (2025) A decade of diving: responses of Cassin’s auklets to variable foraging conditions in the California Current System.Front. Bird Sci.4:1587072. doi: 10.3389/fbirs.2025.1587072 Received:03 March 2025;Accepted:12 May 2025;Published:29 May 2025. Edited by: Reviewed by: Copyright© 2025 Karnovsky, Warzybok, Cavalcanti, Hardin, Brown, Caves, Flynn, Gallaher, McDuffie, McOmber, Bradley, Elliott, Saenz and Jahncke. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Nina J. Karnovsky,bmluYS5rYXJub3Zza3lAcG9tb25hLmVkdQ== †Present addresses: Zachary W. Brown, Tidelines Institute, Gustavus, AK, United StatesEleanor Caves, Department of Ecology, Evolution, and Organismal Biology, Brown University, Providence, RI, United StatesClare M. Flynn, Department of Ecology and Evolution, Stony Brook University, Stony Brook, NY, United StatesKristina McOmber, Department of Biological Sciences, University of Manitoba, Winnipeg, MB, CanadaRussell W. Bradley, Natural Resources Division, Wildlife Management, California State Parks, CA, United States Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Methods Results Discussion Data availability statement Ethics statement Author contributions Funding Acknowledgments Conflict of interest Generative AI statement Publisher’s note Supplementary material References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}