{"id": 1598, "name": "WMAR - Baltimore News", "domain": "wmar2news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wmar2news.com/buylocalbuymaryland/frederickcounty/frederick-flying-cows-soar-into-tbl-final-four-after-victory-over-raleigh-firebirds-in-decisive-game-3", "title": "Frederick Flying Cows Soar Into Tbl Final Four After Victory Over Raleigh Firebirds In Decisive Game 3", "content": "Menu Local NewsAround TownLocal EatsBridging the GapShop Small with SteviePets on SetVoice for Veterans Around Town Local Eats Bridging the Gap Shop Small with Stevie Pets on Set Voice for Veterans Around Town Local Eats Bridging the Gap Shop Small with Stevie Pets on Set Voice for Veterans NewsLocal NewsIn FocusKey Bridge CollapseNational NewsNews Photo GalleryDon't Waste Your MoneyScripps News Group Local News In Focus Key Bridge Collapse National News News Photo Gallery Don't Waste Your Money Scripps News Group Local News In Focus Key Bridge Collapse National News News Photo Gallery Don't Waste Your Money Scripps News Group Election 2024Maryland ElectionsAmerica Votes Maryland Elections America Votes Maryland Elections America Votes Weather7 Day ForecastLive Weather CamsSchool ClosingsWeather AlertsWeather BlogsInteractive RadarTraffic 7 Day Forecast Live Weather Cams School Closings Weather Alerts Weather Blogs Interactive Radar Traffic 7 Day Forecast Live Weather Cams School Closings Weather Alerts Weather Blogs Interactive Radar Traffic WMAR In-DepthMatter for MalloryKey Bridge CollapseMaryland Cold CasesInvestigations Matter for Mallory Key Bridge Collapse Maryland Cold Cases Investigations Matter for Mallory Key Bridge Collapse Maryland Cold Cases Investigations Midday MarylandGBMC RX GBMC RX GBMC RX Local SportsBaltimore OriolesRavens FootballTurkey BowlHigh School Sports Baltimore Orioles Ravens Football Turkey Bowl High School Sports Baltimore Orioles Ravens Football Turkey Bowl High School Sports EntertainmentTV ListingsBounce TVCourt TV TV Listings Bounce TV Court TV TV Listings Bounce TV Court TV WMAR -2 VideosWMAR-2 On YouTubeWMAR OriginalsGrace & Glory WMAR-2 On YouTube WMAR Originals Grace & Glory WMAR-2 On YouTube WMAR Originals Grace & Glory MarketplaceContestsSteering ChangeChick-fil-A Everyday HeroesPower of AgeHome Pros Contests Steering Change Chick-fil-A Everyday Heroes Power of Age Home Pros Contests Steering Change Chick-fil-A Everyday Heroes Power of Age Home Pros About WMARAdvertise with WMARMeet the WMAR-2 News TeamContact UsStation Jobs Advertise with WMAR Meet the WMAR-2 News Team Contact Us Station Jobs Advertise with WMAR Meet the WMAR-2 News Team Contact Us Station Jobs Sign In Newsletters Sign Out Manage Emails Apps Careers Search Weather Your Voice, Your Stories Maryland Cold Cases In Focus Matter for Mallory Key Bridge Collapse Voice for Veterans WMAR on YouTube Contests WMAR on Facebook **Actions** Facebook Tweet Email **Frederick Flying Cows soar into TBL Final Four after victory over Raleigh Firebirds in decisive Game 3** The Frederick Flying Cows are headed to the TBL Final Four after defeating the Raleigh Firebirds 108-98 in Game 3 at Woodsboro Bank Arena. WATCH: Frederick Flying Cows advance to TBL final four with win over Raleigh Firebirds Frederick took a 49-43 lead into halftime after shooting an efficient 50% from the field, despite struggling from three-point range, where they connected on just 3 of 16 attempts. Joseph Bradshaw led the Flying Cows with 9 first-half points. In the second half, Raleigh kept the game close, scrapping and clawing their way back, but the Flying Cows ultimately proved too much for the Firebirds, pulling away for the 10-point victory. \"This team was built from the ground up. Every piece is needed, even the guys on the bench; everybody's needed. Everybody has a role. Everybody has a niche. That's how we win,\" said one Flying Cows player. Another player reflected on personal growth since last season: \"I just wanted to make sure that we won and come back as a better point guard. Last year I feel like I failed us, and this year I was on a mission, man.\" The team's confidence was evident in postgame comments. \"We're trying to build a powerhouse, man. You know, Coach is the all-time winningest coach. I'm the all-time winningest. That's why we're here, man. We expected this, but you never know, you know what I'm saying? It's tough, but this is what we're working for every year. Hopefully this year we take it and next year we do it again, and the following year again,\" said a team member. Another player added, \"That's what we do. I always tell everybody, like, you know, are you surprised that y'all win and everything? I was like, no, that's what we do. Wherever we go, that's what we do.\" Despite the celebration, the team remains focused on their championship goal. \"We got 2 more games to get that, Lily. That's all that means; it's just another win, you know what I'm saying?\" The Flying Cows will next face the Capital Seahawks from Bowie, Maryland, in the TBL Final Four. Game one of that series will be played in Bowie on Wednesday at 7 p.m. This story was reported by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theHeadlines Newsletterand receive up to date information.** **now signed up to receive theHeadlines Newsletter.** News **Stay connected to community, wherever you are** News **Stay connected to community, wherever you are** Traffic News Business Local Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public Files FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact wmar2news/ wmar2news WMAR2News wmar2news"}