{"id": 299, "name": "Christian Science Monitor", "domain": "csmonitor.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.csmonitor.com/About/Contact/Feedback/Contact-Customer-Service", "title": "Contact Customer Service", "content": "Our name is about honesty. The Monitor is owned by The Christian Science Church, and we’ve always been transparent about that. The Church publishes the Monitor because it sees good journalism as vital to progress in the world. Since 1908, we’ve aimed “to injure no man, but to bless all mankind,” as our founder, Mary Baker Eddy, put it. Here, you’ll find award-winning journalism not driven by commercial influences – a news organization that takes seriously its mission to uplift the world by seeking solutions and finding reasons for credible hope. A deeper view that unites instead of divides, connecting why the story matters to you. Behind the news are values that drive people and nations. Explore them here. **Argentina's win for clean governance** **Argentina's win for clean governance** **Why London’s hot ticket is a sing-along of school assembly hymns** **Why London’s hot ticket is a sing-along of school assembly hymns** **Robert Smalls’ Civil War bravery jumps off the page. A new comic captures his legacy.** **Robert Smalls’ Civil War bravery jumps off the page. A new comic captures his legacy.** What bookworm doesn’t remember their first library? For me, it was the public library in downtown Winchester, Massachusetts. I remember sitting in the stacks as a kid, looking around and thinking, “I want to read every single book.” In rural Tunisia, some children have the same opportunity, thanks to Judge Omar Weslati, as reported in today’s Daily. His initiative – called Zira’at al-Maktabat, Arabic for “planting libraries” – is giving kids something he didn’t have growing up, books to read right there at school. Discover the values that drive the story. **Why We Wrote This** Discover the values that drive the story. **Why We Wrote This** **For divided and threatened Druze, what role in peaceful Syrian future?** **For divided and threatened Druze, what role in peaceful Syrian future?** **Why London’s hot ticket is a sing-along of school assembly hymns** **Why London’s hot ticket is a sing-along of school assembly hymns** **Colombia made strides toward peace. Senator’s shooting underscores challenges ahead.** **Colombia made strides toward peace. Senator’s shooting underscores challenges ahead.** The Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles. **War in the Middle East** The Christian Science Monitor's coverage of the war between Hamas and Israel, and related articles. **War in the Middle East** A deeper view that unites instead of divides, connecting why the story matters to you. **Contact Customer Service** Follow us: About Contact Us Subscribe Give a Gift Subscription Support Monitor Journalism Free Newsletters Careers Social Media Content Map Text Edition RSS Reprints & Permissions A Christian Science Perspective **Subscription expired** Your subscription to The Christian Science Monitor has expired. You can renew your subscription or continue to use the site without a subscription. Return to the free version of the site If you have questions about your account, pleasecontact customer serviceor call us at1-617-450-2300. This message will appear once per week unless you renew orlog out. **Session expired** Your session to The Christian Science Monitor has expired. We logged you out. Return to the free version of the site If you have questions about your account, pleasecontact customer serviceor call us at1-617-450-2300. **No subscription** You don’t have a Christian Science Monitor subscription yet. Return to the free version of the site If you have questions about your account, pleasecontact customer serviceor call us at1-617-450-2300."}