{"id": 1346, "name": "The Journal (Colorado)", "domain": "the-journal.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.the-journal.com/articles/colorado-wildlife-officials-kill-copper-creek-wolf-after-it-preyed-on-livestock-in-pitkin-county/", "title": "Colorado Wildlife Officials Kill Copper Creek Wolf After It Preyed On Livestock In Pitkin County", "content": "Log In Subscribe E-Edition Homepage NewsLocal News Local News Local News Four CornersCortezDoloresMancosColoradoRegional Cortez Dolores Mancos Colorado Regional Cortez Dolores Mancos Colorado Regional New Mexico Nation & World Education Business and Agriculture Obituaries Sports LivingMilestonesFaithThank You Letters Milestones Faith Thank You Letters Milestones Faith Thank You Letters OpinionEditorialsOpinion ColumnsLetters to the EditorEditorial Cartoons Editorials Opinion Columns Letters to the Editor Editorial Cartoons Editorials Opinion Columns Letters to the Editor Editorial Cartoons Events Columns Videos Galleries Community Calendar Comics Puzzles 4CornersJobs Real Estate Classifieds Public Notices Advertise with Us SUBSCRIBE TODAY! Cortez Dolores Mancos Election Photos Opinion Obituaries E-Edition Real Estate 4CornersJobs Classifieds **Colorado wildlife officials kill Copper Creek wolf after it preyed on livestock in Pitkin County** A young male wolf born in Grand County and relocated after its pack preyed on livestock last summer was killed Thursday by Colorado Parks and Wildlife officials after the now yearling animal attacked livestock in Pitkin County. Over Memorial Day weekend, the wolf attacked and killed livestock over three days on the Crystal River Ranch, in the Crystal River Valley, and on the Lost Marbles and McCabe ranches, in the Roaring Fork Valley. The animal was identified by its tracking collar number 2405, a member of the first pack to establish after the first release of gray wolves in Colorado in late 2023. The Copper Creek pack, which included an adult male and female and five pups, was blamed for numerous sheep and cattle kills on two ranches in Grand County last year so the group was captured in September 2024. “The decision to take lethal management action was very difficult,” CPW Director Jeff Davis said in a news release Friday afternoon. “Our wildlife biologists and officers constructed a timeline of recent events that shows the depredation behavior met the conditions for chronic depredation that were defined earlier this year. We have great respect for these animals and take the removal of a wolf very seriously. Removal of problem animals is unfortunate and rare, but consistent with the Colorado Wolf Restoration and Management Plan.” CPW said it confirmed four “depredation events” between May 17 and 25, including three by clear and convincing evidence. All were on private property. Officials said they will monitor the Copper Creek pack, which was moved to Pitkin County in January, to see if killing the young wolf changes the pack’s behavior. Rancher Tom Harrington, whose calf was killed on the Crystal River Ranch near Carbondale, said he and the other ranchers had worked with CPW on site assessments at their ranches before the attacks. He said a CPW nonlethal damage specialist teamed up with the district wildlife manager who knew the area and they visited with the operators. “We showed him where we have cows at different times of the year, all the different facilities and the rotation of our cows,” he said. “From that, they assess what nonlethal deterrence will work, what would be appropriate and be effective.” In early calving season, when his cattle were within a 5-acre area of his ranch, a CPW official told Harrington fladry would likely work to keep wolves away if he had problems. He never needed it there, but his cattle also calve in a much larger area with “really rough terrain. Lots of trees, draws and big, open spaces,” he said. And in that area, officials told him “the only thing that’s going to work is the presence of people, range riders.” Harrington said, “what we do actively every day is watching over, taking care of and monitoring our cattle. We’re out at our cows in daylight, on horseback, riding these pastures. We’re checking calves down in the draw, in the trees, wherever they are. Throughout the day, we’re checking them, we’re feeding them, and then we’re back out there right before dark.” But the Copper Creek male did make it into his herd Sunday. And he said a range rider who CPW sent to find it went to the wrong location. “The range rider program is just not prepared,” Harrington said. “These guys don’t know everybody in their area that they’re dispatched to. They don’t have contact numbers. They don’t have maps where the cattle are, where they range or how many there are. And even fladry, the nonlethal deterrence that they recommend. There’s a shortage of it. They can’t get enough.” Harrington believes CPW’s decision to kill the wolf was “appropriate and aligned with the wolf program.” “But, in my opinion, if we’d have been a little better prepared and had some of the programs in effect earlier, maybe it wouldn’t have come to the point to remove wolves,” he said. CPW released 10 wolves from Oregon into Summit and Grand counties in December 2023 and another 15 from British Columbia were released in Pitkin and Eagle counties in January. Five Copper Creek wolves – a female and four of her now yearling pups that were captured in Grand County last fall after multiple confirmed livestock kills – were released with the British Columbia wolves. The adult male in the pack died after it was captured in September and one of the pups evaded capture in Grand County. The Colorado Sun is a reader-supported, nonpartisan news organization dedicated to covering Colorado issues. To learn more, go to coloradosun.com. **RecentLocal News** Sign up for email headline alerts: Choose from several print and digital subscription packages © 2025 The Journal |Ballantine Communications, Inc.All Rights Reserved. |Terms of Use|Privacy Policy We use cookies to improve your experience on our site. By using our site, you consent to ourpolicies **Account info** Name: Screen name: Email:"}