{"id": 1836, "name": "Vigilant Citizen", "domain": "vigilantcitizen.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://vigilantcitizen.com/vigilantreport/trumps-shooter-reenacted-a-scene-from-the-manchurian-candidate-was-he-brainswashed-by-handlers-or-social-media/", "title": "Trumps Shooter Reenacted A Scene From The Manchurian Candidate Was He Brainswashed By Handlers Or Social Media", "content": "Login CategoriesLatest NewsMusic BusinessPics of the MonthMovies and TVVigilant ReportsSinister SitesVC Resources Latest News Music Business Pics of the Month Movies and TV Vigilant Reports Sinister Sites VC Resources Latest News Music Business Pics of the Month Movies and TV Vigilant Reports Sinister Sites VC Resources Read This First Subscribe to the Newsletter Recommended Reading About Contact **The Vigilant Citizen** Browse by CategoryLatest NewsMusic BusinessPics of the MonthMovies and TVVigilant ReportsSinister SitesVC Resources Latest News Music Business Pics of the Month Movies and TV Vigilant Reports Sinister Sites VC Resources Latest News Music Business Pics of the Month Movies and TV Vigilant Reports Sinister Sites VC Resources VC E-Book Download Contact Login **Vigilant Reports** **Trump’s Shooter Reenacted “The Manchurian Candidate.” Was He Brainwashed by Handlers? Or Social Media?** Several days after the failed assassination attempt on Presidential candidate Donald Trump, there is a bizarre lack of information concerning the shooter. Is it because the elite doesn’t want the masses to know the ugly truth behind his motives? Published on By On July 13th, world history was literally an inch away from taking a sharp, drastic, and dramatic turn. Indeed, if this one bullet hit Trump’s brain instead of his ear, we’d probably be in an entirely different situation right now. Many still do not comprehend the historical gravity of the situation, as if still in shock (or completely numb). Some of the most significant events in world history, including major wars and revolutions, started following the assassination of an important political figure. If Trump had not turned his head in that specific direction at that exact moment, the consequences could have taken historical proportions: A successful assassination could have been the spark needed to turn the gaping divide in America into an outright explosive situation. Even though the assassination attempt failed, tensions are still palpable. Several days after the shooting, there is still little to no information regarding the shooter’s history and motives available in mass media – although the FBI gained access to Thomas Matthew Crooks’ phone. Is information purposely being withheld? Not unlike other “lone shooters” in the past, there’s a lot of weirdness surrounding Thomas Matthew Crooks. How could a nerdy 20-year-old man who still lives with his parents almost take out a Presidential candidate? How did this guy foil the US Secret Service? And local law enforcement? In many ways, the unfolded drama is reminiscent of the 1962 movieThe Manchurian Candidate. In this highly relevant movie, a man is brainwashed using MKULTRA to assassinate a Presidential candidate amid a crucial election. The killing would cause a chain of events leading to the instauration of an authoritarian regime favorable to the communist block. The movie ends with the shooter taking a sniper’s position to shoot the candidate. However, he misses and kills two other people instead. He then kills himself. While there are significant differences between this Cold War-era movie and the events that unfolded in the past week, every bit of information known about the shooter is highly perplexing. **Bizarre Facts About the Shooter** Despite the FBI gaining access to the shooter’s phone, media still describes him as an “elusive enigma”. Is Thomas Crooks truly an “enigma,” or is the truth being withheld? While mass media keeps pushing stories about how mysterious he is, the little information that has leaked out only leads to more questions. One piece odd piece of information is that both of the shooter’s parents are licensed behavior health counselors. Crooks’ parents, Matthew and Mary Crooks, née Frizzi, are certified behavioral health counselors, according to state licensing records.– The Independent, ‘I don’t know what to say’: Family of Thomas Matthew Crooks struggles to make sense of Trump shooting This fact is extremely odd, considering what happened. Here’s a description of the shooter’s parents’ line of work. Behavioral health therapists assess, diagnose, and treat a wide range of mental health issues such as anxiety, depression, phobias, and addiction. They work in both public and private sector settings, including hospitals, clinics, schools, and private practices. Their clientele typically span all age ranges, from children, to adolescents, to adults. Behavioral therapists use different techniques to help their clients modify their problematic behaviors and develop new, healthy ones.– Palo Alto University,What is a Behavioral Health Therapist How is it possible that both of this guy’s parents were unable to “assess, diagnose and treat” the fact that their own son, who lives under their roof, wanted to kill a Presidential Candidate? And that it was also a suicide mission? Is it possible that the shooter’s behavior was “altered” but not in a good way? Another bizarre fact is that Crooks appeared in aBlackRock commercialin 2022. Crooks sits front and center while a BlackRock representative explains how they rule the world to high school students. At one point, there’s a closeup of Crooks interacting with the representative. What are they even talking about? BlackRock is, simply put, one of the most powerful companies in the world. It is the world’s largest investment corporation, with over $10trillion in assets. The Economist called BlackRock “the world’s largest shadow bank”, and through its strategically placed investments, the company shapes the world according to the elite’s will. It is simply impossible to overstate the sheer power and influence of BlackRock, which is, of course, a prominent player in the elite’s major gatherings, such as the Bilderberg Meetings and the World Economic Forum. Through its trillions of dollars, BlackRock shapes entire nations (it already made a deal with Volodymyr Zelensky for its role in reconstructing Ukraine) while forcing the corporations it acquires to adopt specific “progressive” policies. BlackRock has also funneled billions of dollars to the Chinese communist government. In other words, BlackRock is the definition of an elite-owned, globalist entity that is working against American interests. The fact that one of its rare ads features a Manchurian candidate-type assassin is simply mindblowing. **Radicalized?** Although the FBI gained access to Crooks’ phone, there might be a reason why there is so little information concerning his online activity: He might have been radicalized by some of the elite’s favorite outlets. Indeed, as a 20-year-old white American male with some interest in politics, Crooks is the target audience of a highly popular yet toxic site: Reddit. Dubbed “the front page of the internet,” the social news site Reddit is currently the 18th most visited website in the world. While Reddit used to be a hotspot of memes and entertaining articles, the site has taken a drastic turn in recent years. To put it bluntly, it is now a den of propaganda and disinformation, curated by sophisticated algorithms, AI bots, and various agents. This switch occurred about five years ago, which coincided with Reddit being partly acquired by Tencent – the Chinese multinational technology conglomerate. It is problematic that Reddit—a site highly influential among young Americans—is partly owned by Tencent. Dubbed an “AI champion” by the Chinese government, Tencent has close ties with the Chinese Communist Party. Here are some of Tencent’s “accomplishments” relating to the Chinese government. The Chinese government views Tencent as one of its national champion corporations. For the occasion of the 19th National Congress of the Chinese Communist Party, Tencent released a mobile game titled “Clap for Xi Jinping: An Awesome Speech”, in which players have 19 seconds to generate as many claps as possible for the party leader. In August 2019, it was reported that Tencent collaborated with the Guangdong Propaganda Department of the Chinese Communist Party and thePeople’s Dailyto develop “patriotic games”. In a December 2020 article inForeign Policy, a former senior official of the Central Intelligence Agency stated that the CIA concluded that Tencent received funding from the Ministry of State Security early on in its foundation. This was said to be a “seed investment” that was provided “when they were trying to build out the Great Firewall and the monitoring technology.” Tencent denied this allegation. In 2021, it was reported that Tencent and Ant Group were working with the People’s Bank of China to develop a Central bank digital currency. In June 2022, Tencent partnered with Shanghai United Media Group to launch a plan to develop domestic and foreign influencers.– Wikipedia, Tencent When one recognizes China’s involvement in Reddit, one understands the toxic agenda behind it: To rot America from within with a constant flow of toxic and divisive content. This fact could not have been more evident than after the attempted assassination of Trump. While the near death of the man caused most reasonable people to tone down their radical, hateful, and sometimes violent rhetoric, Reddit doubled down on it. It’s almost as if local and foreign agents are purposely trying to undermine America’s democracy from within. Here are some examples. A radical sub called “ConservativeTerrorism” does not shy away from calling anyone voting for the Republican Party “terrorists.” What better way of creating a gaping divide in America? Even subs such as Millenials (initially about funny, relatable memes relating to Millenials) turned into outlets for extreme political rhetoric. This post insinuates that nobody should feel bad for Trump and that he even deserves it. This post is about Trump faking his assassination attempt. Alex Jones got sued for billions for stating that a shooting was fake. Why isn’t Reddit being sued for billions as well? This post downplays the assassination attempt and almost depicts the shooter as a hero who shot Trump because of his ties with Epstein. Of course, none of this is verified information – it is yet another propaganda meme. I could add hundreds of other posts custom-made to sow hatred and division in America. The last thing they want is unity among Americans. They want to radicalize people to the point of pushing them to the brink of a civil war. While some American outlets had the common sense to tone down the radical rhetoric in these tense times, Chinese-owned Reddit showed its true toxic colors. The chances of the FBI finding Thomas Matthew Crooks to be an avid Redditor are high. Such a revelation could place an unwanted spotlight in this elite-favorite site and jeopardize its radical agendas. Another proof of the elite loving this site: Google has recently boosted the site’s visibility greatly while penalizing others in search results. In other words, They want people to drink from this poisonous well of toxicity. It is a perfect embodiment of their Orwellian future: Through sophisticated algorithms and AI technology, opinions that are favorable to the elite are pushed into view while others are automatically censored. Thomas Crooks is most likely a product of this site. **In Conclusion** Once again, a high-profile shooting was carried out by a mysterious “lone shooter” is surrounded by highly conflicting information. Crooks is supposedly a registered Republican, while records show he donated $15 to a liberal cause. His father is a registered Republican, while his mother is a Democrat. Both of his parents are, astoundingly, behavioral therapists. Still, they failed to diagnose the fact that the son living in their home wanted to carry out a suicide mission to kill a Presidential Candidate. This leads us to ask: Was Crooks a Manchurian Candidate-style MK agent programmed to kill Trump? On the other hand, considering the brainwashing powers of social media outlets such as Reddit, bad actors can now automatically sleeper agents from very far away. **realvigilantcitizen** The official Instagram account of the Vigilant Citizen **realvigilantcitizen** The official Instagram account of the Vigilant Citizen L.A. mayor says National Guard deployment could be a ‘national experiment’ to ‘take over power’2 hours ago Norra Wilbor, Nigerian Football Blogger, pledges allegiance…1 day ago The 33 – Movie about the Miraculous True Story2 days ago Program says children's character is trans and babies are racist2 days ago Globalist stooge2 days ago Sweden Urged To Halt International Adoptions After Decades Of Child Trafficking Uncovered2 days ago AI Startup Backed by Microsoft Revealed to Be 700 Indian Employees Pretending to Be Chatbots2 days ago The Many Things That Are Wrong With That Trump-Gaza AI Video The Many Things That Are Wrong With That Trump-Gaza AI Video The Many Things That Are Wrong With That Trump-Gaza AI Video The Many Things That Are Wrong With That Trump-Gaza AI Video The Many Things That Are Wrong With That Trump-Gaza AI Video Biden Awarding George Soros the Medal of Freedom is Proof That the “Conspiracy Theories” Are True Biden Awarding George Soros the Medal of Freedom is Proof That the “Conspiracy Theories” Are True Biden Awarding George Soros the Medal of Freedom is Proof That the “Conspiracy Theories” Are True Biden Awarding George Soros the Medal of Freedom is Proof That the “Conspiracy Theories” Are True Biden Awarding George Soros the Medal of Freedom is Proof That the “Conspiracy Theories” Are True Kamala’s Campaign Was Objectively the Worst in Recent History Kamala’s Campaign Was Objectively the Worst in Recent History Kamala’s Campaign Was Objectively the Worst in Recent History Kamala’s Campaign Was Objectively the Worst in Recent History Kamala’s Campaign Was Objectively the Worst in Recent History An “Urban Opera” in Toulouse Using Massive Machines is Denounced as a Satanic Ritual An “Urban Opera” in Toulouse Using Massive Machines is Denounced as a Satanic Ritual An “Urban Opera” in Toulouse Using Massive Machines is Denounced as a Satanic Ritual An “Urban Opera” in Toulouse Using Massive Machines is Denounced as a Satanic Ritual An “Urban Opera” in Toulouse Using Massive Machines is Denounced as a Satanic Ritual This Opera About Lusting Over Jesus Has Performers Actually Bleed and Cook Human Flesh This Opera About Lusting Over Jesus Has Performers Actually Bleed and Cook Human Flesh This Opera About Lusting Over Jesus Has Performers Actually Bleed and Cook Human Flesh This Opera About Lusting Over Jesus Has Performers Actually Bleed and Cook Human Flesh This Opera About Lusting Over Jesus Has Performers Actually Bleed and Cook Human Flesh Biden’s Debate Performance Was Shocking Proof That He’s Merely a Puppet. Who Actually Runs the Country? Biden’s Debate Performance Was Shocking Proof That He’s Merely a Puppet. Who Actually Runs the Country? Biden’s Debate Performance Was Shocking Proof That He’s Merely a Puppet. Who Actually Runs the Country? Biden’s Debate Performance Was Shocking Proof That He’s Merely a Puppet. Who Actually Runs the Country? Biden’s Debate Performance Was Shocking Proof That He’s Merely a Puppet. Who Actually Runs the Country? Scientist Proposes AI-Powered Mind Control to Rehabilitate Criminals. Yes, it’s Insane. Scientist Proposes AI-Powered Mind Control to Rehabilitate Criminals. Yes, it’s Insane. Scientist Proposes AI-Powered Mind Control to Rehabilitate Criminals. Yes, it’s Insane. Scientist Proposes AI-Powered Mind Control to Rehabilitate Criminals. Yes, it’s Insane. Scientist Proposes AI-Powered Mind Control to Rehabilitate Criminals. Yes, it’s Insane. The Lawsuit Against Diddy for Rape and Sex Trafficking Was Settled in One Day. What Does This Say About the Music Industry? The Lawsuit Against Diddy for Rape and Sex Trafficking Was Settled in One Day. What Does This Say About the Music Industry? The Lawsuit Against Diddy for Rape and Sex Trafficking Was Settled in One Day. What Does This Say About the Music Industry? The Lawsuit Against Diddy for Rape and Sex Trafficking Was Settled in One Day. What Does This Say About the Music Industry? The Lawsuit Against Diddy for Rape and Sex Trafficking Was Settled in One Day. What Does This Say About the Music Industry? This Agenda Given College Students in Canada Exemplifies How Education Has Turned into Indoctrination This Agenda Given College Students in Canada Exemplifies How Education Has Turned into Indoctrination This Agenda Given College Students in Canada Exemplifies How Education Has Turned into Indoctrination This Agenda Given College Students in Canada Exemplifies How Education Has Turned into Indoctrination This Agenda Given College Students in Canada Exemplifies How Education Has Turned into Indoctrination Δ Δ Music Business2 months agoLady Gaga’s 2025 Coachella Performance Was Nothing Less Than a Satanic Megaritual Lady Gaga’s 2025 Coachella Performance Was Nothing Less Than a Satanic Megaritual Music Business2 months agoLady Gaga’s 2025 Coachella Performance Was Nothing Less Than a Satanic Megaritual Lady Gaga’s 2025 Coachella Performance Was Nothing Less Than a Satanic Megaritual Lady Gaga’s 2025 Coachella Performance Was Nothing Less Than a Satanic Megaritual Pics of the Month3 months agoSymbolic Pics of the Month 03/25 Symbolic Pics of the Month 03/25 Pics of the Month3 months agoSymbolic Pics of the Month 03/25 Symbolic Pics of the Month 03/25 Symbolic Pics of the Month 03/25 Pics of the Month1 month agoSymbolic Pics of the Month 05/25 Symbolic Pics of the Month 05/25 Pics of the Month1 month agoSymbolic Pics of the Month 05/25 Symbolic Pics of the Month 05/25 Symbolic Pics of the Month 05/25 Music Business2 months agoThe Dark Meaning Behind Ariana Grande’s Short Film “Brighter Days Ahead” The Dark Meaning Behind Ariana Grande’s Short Film “Brighter Days Ahead” Music Business2 months agoThe Dark Meaning Behind Ariana Grande’s Short Film “Brighter Days Ahead” The Dark Meaning Behind Ariana Grande’s Short Film “Brighter Days Ahead” The Dark Meaning Behind Ariana Grande’s Short Film “Brighter Days Ahead” Vigilant Reports2 months agoThe Mysterious Case of “Sad Satan”, the Cursed Video Game From the Dark Web The Mysterious Case of “Sad Satan”, the Cursed Video Game From the Dark Web Vigilant Reports2 months agoThe Mysterious Case of “Sad Satan”, the Cursed Video Game From the Dark Web The Mysterious Case of “Sad Satan”, the Cursed Video Game From the Dark Web The Mysterious Case of “Sad Satan”, the Cursed Video Game From the Dark Web Latest News1 month agoEpstein and Prince Andrew Accuser Virginia Giuffre Dies by “Suicide” … After Warning That She Was Not Suicidal Epstein and Prince Andrew Accuser Virginia Giuffre Dies by “Suicide” … After Warning That She Was Not Suicidal Latest News1 month agoEpstein and Prince Andrew Accuser Virginia Giuffre Dies by “Suicide” … After Warning That She Was Not Suicidal Epstein and Prince Andrew Accuser Virginia Giuffre Dies by “Suicide” … After Warning That She Was Not Suicidal Epstein and Prince Andrew Accuser Virginia Giuffre Dies by “Suicide” … After Warning That She Was Not Suicidal Vigilant Reports4 weeks agoThere’s Something Terribly Wrong with “Cute Cat” Videos on YouTube There’s Something Terribly Wrong with “Cute Cat” Videos on YouTube Vigilant Reports4 weeks agoThere’s Something Terribly Wrong with “Cute Cat” Videos on YouTube There’s Something Terribly Wrong with “Cute Cat” Videos on YouTube There’s Something Terribly Wrong with “Cute Cat” Videos on YouTube Movies and TV2 weeks agoCheering For Evil: The Occult Symbolism and Hidden Messages in “Saltburn” Cheering For Evil: The Occult Symbolism and Hidden Messages in “Saltburn” Movies and TV2 weeks agoCheering For Evil: The Occult Symbolism and Hidden Messages in “Saltburn” Cheering For Evil: The Occult Symbolism and Hidden Messages in “Saltburn” Cheering For Evil: The Occult Symbolism and Hidden Messages in “Saltburn” Contact About Privacy Policy Copyright © 2025 The Vigilant Citizen"}