{"id": 80, "name": "Analytics India Magazine", "domain": "analyticsindiamag.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://analyticsindiamag.com/ai-news-updates/infosys-partners-with-yorkshire-building-society-to-accelerate-its-2030-strategic-plan-with-ai/", "title": "Infosys Partners With Yorkshire Building Society To Accelerate Its 2030 Strategic Plan With Ai", "content": "Conferences Research Videos Trainings MachineHack Councils Best Firm Careers Contact Features Deep Tech Trends Startups News Branded ContentAWSFractalIntuitNvidia AWS Fractal Intuit Nvidia AWS Fractal Intuit Nvidia CXO Corner GCC Corner Webinars Features Deep Tech Trends Startups News Branded ContentAWSFractalIntuitNvidia AWS Fractal Intuit Nvidia AWS Fractal Intuit Nvidia CXO Corner GCC Corner Webinars Published on April 30, 2025 InAI News **Infosys Partners with Yorkshire Building Society to Accelerate its 2030 Strategic Plan with AI** byShalini Mondal Infosys has announced a strategic collaboration with Yorkshire Building Society on Wednesday to accelerate its digital transformation. The partnership aims to provide the financial institution’s mortgage, commercial, and savings customers with a mobile-first banking experience that simplifies financial interactions. The collaboration will leverage cloud, data, AI, and cybersecurity solutions to help Yorkshire Building Society achieve its 2030 strategic plan, focusing on enhancing customer and employee experiences through digital operations. “This transformation will empower our members and colleagues with the tools and services needed to deliver great customer outcomes, including major investments such as faster payments and enhanced security,” Patrick Connolly, director of change delivery at Yorkshire Building Society said. To thisDennis Gada, executive vice president and global head of banking & financial services at Infosys, commented that “We are bringing our full suite of next-generation technologies to help them improve customer experience for their members, with a deeper focus on end-to-end digital channels.” Meanwhile, Infosys has alsolaunchedan AI-driven suite,InfosysTopaz for SAP S/4HANA Cloud, to support enterprises in transitioning to SAP’s cloud-based ERP platform. The offering integrates generative AI into every stage of digital transformation. Built on Infosys’ cloud framework, the suite includes industry-specific pre-built solutions and implementation guides, aiming to accelerate SAP S/4HANA Cloud adoption and operational modernisation.In the recent January–March quarter of FY25 earrings call,CEOSalil Parekh, showed confidence in generative AI. During thepress conference, he said, “We’ve seen growing demand from clients to partner with them on AI. They’re moving from a use case approach to an AI led transformation approach,” he said, saying that this is using AI agents, which are playing more and more of a critical role. 📣 Want to advertise in AIM?Book here This year, ABBYY is introducing dedicated breakout sessions tailored to both business and developer tracks, so every attendee walks away with actionable insights aligned to their role. Join top GCC leaders in Goa from 20 to 22 June 2025 to shape the future of digital transformation Email:info@aimmediahouse.com Our Offices AIM India1st Floor, Sakti Statesman, Marathahalli – Sarjapur Outer Ring Rd, Green Glen Layout, Bellandur, Bengaluru, Karnataka 560103 AIM Americas2955, 1603 Capitol Avenue, Suite 413A, Cheyenne, WY, Laramie, US, 82001 About Us Newsletters Videos Podcast Events Careers Sitemap Webinars CXO Corner GCC Corner Contact Us AIM Research MachineHack Best Firm Certification Councils ADaSci PeMa Quadrant Advertise with us Branded Content Bespoke Events Hackathons Talent Assessment Research & Advisory Corporate Trainings Cypher MachineCon USA Data Engineering Summit MachineCon GCC Summit MLDS Happy Llama The Rising VendorAI: AI Vendor Database GCC Explorer: List of GCCs in India Bot Bazaar: A Comprehensive Database of AI Startups in the USA Datalyze: Simulation-Based Gamified Learning for Data Analytics © Analytics India Magazine Pvt Ltd & AIM Media House LLC 2025 Terms of use Privacy Policy Copyright PostgreSQL, the open-source relational database, has surged in popularity, surpassing MySQL as the most favoured"}