{"id": 1055, "name": "Orange County Register", "domain": "ocregister.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ocregister.com/2025/06/03/fullerton-college-student-kidnapped-from-whittier-park-died-from-gunshot-wound-to-head-prosecutor-says/", "title": "Fullerton College Student Kidnapped From Whittier Park Died From Gunshot Wound To Head Prosecutor Says", "content": "e-Edition e-Edition NewsNewsCrime and Public SafetyInvestigative ReportingElectionBusinessBest ReviewsHousingPoliticsHealthEnvironmentWeather News Crime and Public Safety Investigative Reporting Election Business Best Reviews Housing Politics Health Environment Weather News Crime and Public Safety Investigative Reporting Election Business Best Reviews Housing Politics Health Environment Weather Orange County North OCAnaheimBreaBuena ParkCypressFullertonGarden GroveLa HabraLa PalmaOrange + Villa ParkPlacentiaSanta AnaSeal Beach+ Los AlamitosStantonTustinWestminsterYorba Linda Anaheim Brea Buena Park Cypress Fullerton Garden Grove La Habra La Palma Orange + Villa Park Placentia Santa Ana Seal Beach+ Los Alamitos Stanton Tustin Westminster Yorba Linda Anaheim Brea Buena Park Cypress Fullerton Garden Grove La Habra La Palma Orange + Villa Park Placentia Santa Ana Seal Beach+ Los Alamitos Stanton Tustin Westminster Yorba Linda South OCCosta MesaDana PointFountain ValleyHuntington BeachIrvineLaguna BeachLaguna Niguel + Aliso ViejoLaguna HillsLadera RanchLake ForestLaguna WoodsMission ViejoNewport BeachRancho Santa MargaritaSan ClementeSan Juan Capistrano Costa Mesa Dana Point Fountain Valley Huntington Beach Irvine Laguna Beach Laguna Niguel + Aliso Viejo Laguna Hills Ladera Ranch Lake Forest Laguna Woods Mission Viejo Newport Beach Rancho Santa Margarita San Clemente San Juan Capistrano Costa Mesa Dana Point Fountain Valley Huntington Beach Irvine Laguna Beach Laguna Niguel + Aliso Viejo Laguna Hills Ladera Ranch Lake Forest Laguna Woods Mission Viejo Newport Beach Rancho Santa Margarita San Clemente San Juan Capistrano SportsSportsAngelsDodgersChargersRamsDucksKingsLakersHigh School SportsClippersCollege SportsUCLA SportsUSC SportsOlympicsBoxing/MMASoccerHorse Racing Sports Angels Dodgers Chargers Rams Ducks Kings Lakers High School Sports Clippers College Sports UCLA Sports USC Sports Olympics Boxing/MMA Soccer Horse Racing Sports Angels Dodgers Chargers Rams Ducks Kings Lakers High School Sports Clippers College Sports UCLA Sports USC Sports Olympics Boxing/MMA Soccer Horse Racing Things To DoThings To DoRestaurants Food and DrinkMoviesMusic + ConcertsAmusement Parks + DisneylandTheater + ArtsCasinosTV and StreamingHome + GardenTravelBooksComicsBest of Orange CountyOrange County Register StoreEvents Things To Do Restaurants Food and Drink Movies Music + Concerts Amusement Parks + Disneyland Theater + Arts Casinos TV and Streaming Home + Garden Travel Books Comics Best of Orange County Orange County Register Store Events Things To Do Restaurants Food and Drink Movies Music + Concerts Amusement Parks + Disneyland Theater + Arts Casinos TV and Streaming Home + Garden Travel Books Comics Best of Orange County Orange County Register Store Events ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary OpinionOpinionEditorialsOpinion ColumnsCommentaryLetters to the EditorEditorial BoardEndorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements Opinion Editorials Opinion Columns Commentary Letters to the Editor Editorial Board Endorsements SCNG Premium Sponsored Content Branded ContentPaid Content by Brandpoint Paid Content by Brandpoint Paid Content by Brandpoint The T.E.A. Subscribe Log In Logout Get the latest news delivered daily! **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Subscribe Log In Get the latest news delivered daily! Subscribe Log In e-Edition e-Edition Crime Investigative Reporting Election Business Housing Politics Environment Weather Trending: ICE protests 🎓 2025 Graduations Details in Fullerton College student's death Crime news Rooftop dining in OC **Fullerton College student kidnapped from Whittier park died from gunshot wound to head, prosecutor says** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Julian Gonzalez andAndrea Vazquezwere sitting on the trunk of his parked Honda Accord at Penn Park in Whittier, hanging out and talking when a white pickup truck with tinted windows pulled up in front of his car. “That’s when I heard shots,” he said. For update, see:Whittier man confessed to kidnapping, slaying Fullerton College student, detective testifies Gonzalez turned around and saw 19-year-old Vazquez lying on the ground. She was bleeding above her neck, close to the face, he said. Gonzalez testified about what happened to them on Aug. 20, 2023 during Tuesday’s preliminary hearing forGabriel Sean Esparza, the Whittier man accused of kidnapping Vazquez, trying to rape the Fullerton College student and killing her. Her body was found Aug. 21, 2023 lying facedown in a field off Alessandro Boulevard and Merwin Street in Moreno Valley. She wore only a black top with her pants and underwear pulled down to her ankles. Photos of Vazquez as she was discovered were shown in a court filled with her family and friends. Several of them cried. Four bullet fragments were recovered from her brain, Deputy District Attorney Beth Silverman said, adding the coroner ruled Vazquez died from a gunshot wound to the forehead. The Los Angeles County District Attorney’s OfficechargedEsparza with the murder of Vazquez, the attempted murder of her boyfriend as well as kidnapping to commit another crime, kidnapping, assault with intent to rape and two counts of attempted rape by force. He was also charged with the special circumstance allegations of murder during the course of a kidnapping and murder during the course of an attempted rape as well as the allegation he personally used a rifle while committing the crimes. Esparza has pleaded not guilty to the charges and denied the allegations. If convicted, he faces a possible maximum sentence of life in prison without parole. Gonzalez, who was dating Vazquez, said he picked her up at her Downey home on Aug. 19, 2023. They went to a Starbucks in Downey, a parking structure in Whittier, then Penn Park at 13950 Penn St. in Whittier. Gonzalez backed into a parking stall. His Accord was facing Penn Street. Then the white Toyota showed up. After the gunshots, Gonzalez ducked. “That’s when I heard the door (of the pickup) open,” he said, adding he peeked and saw the driver holding a gun coming towards him. Gonzalez made eye contact with the man who pointed the gun at him. Gonzalez ran and went into the park. When he returned, he saw the pickup was still there; Then the driver took off. He heard tires screeching. “Andrea, she wasn’t there. She was gone,” he said. Gonzalez noticed a puddle of blood where he last saw her. He saw people and told them to call police. He tried to call Vazquez’s sister, Edlyn, then called police. He went back to Vazquez’s home. “I just wanted to let the family know right away,” Gonzalez said. Alejandro Rico was outside a home on Canyon Crest Road, directly above Penn Park, around 12:20 a.m. on Aug. 20, 2023. He said he was cleaning up after a barbecue and heard two gunshots. He said he climbed up a wall, looked over, saw a coyote running and a white Toyota truck with the driver’s side open. It had a black cover on the truck bed and tinted windows. He saw the driver come out, go to the back passenger side, open it, and throw something. The driver also went to the bed of the truck. He heard the truck take off. He also saw a couple running and a Camry and black Accord take off pretty fast, Rico said. He thought these were probably related to the white Toyota that sped off. Whittier Police Detective Tom Nordbak, who is one of the investigators in the case, later showed Rico a photo of a white Tacoma taken by a security camera near a Chevron station in Moreno Valley. Rico told the detective it looked like the vehicle he saw. Esparza was arrested the afternoon of Aug. 21, 2023 at his job in Lakewood. Detectives also seized a gun and his Tacoma. Nordbak went to Moreno Valley with Esparza, other detectives and officers around 10:30 p.m. on Aug. 21, 2023. “It was an area his cell phone pinged at,” said Nordbak, who described the area as desolate with a small road. They had Esparza walk them to the area he was familiar with, he said. The police spread out and did a grid search. They found Vazquez. They went to another spot where Esparza said he threw Vazquez’s phone, Nordbak said. They searched but didn’t find the phone, he added. Edlyn Vazquez was part of the big group that showed up for the hearing and filled the courtroom. “I don’t tell anyone to come. They came on their own,” she said, adding it shows how much her sister was loved. She plans to be in court every single day, she said. “I don’t want to miss anything and I want to make sure I hear everything myself,” Edlyn Vazquez said. The hearing, held at the Clara Shortridge Foltz Criminal Justice Center in Los Angeles, continues Wednesday. **Related Articles** 4 men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests Federal appeals court hears arguments in Trump’s bid to erase hush money conviction Sean ‘Diddy’ Combs’ ex says she joined ‘cuckold’ sex marathons to feel loved by him Weinstein jury set to keep deliberating after tensions spill into public Weinstein jury pores over accuser’s emails during deliberations **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Reddit (Opens in new window)Reddit Click to print (Opens in new window)Print Newsroom Guidelines News Tips Contact Us Report an Error **RevContent Feed** **Most Popular** National Guard in downtown Santa Ana Tuesday as protesters decry ICE raidsNational Guard in downtown Santa Ana Tuesday as protesters decry ICE raids **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** Protesters clash with law enforcement in Santa Ana after day of ICE raids in OCProtesters clash with law enforcement in Santa Ana after day of ICE raids in OC **Protesters clash with law enforcement in Santa Ana after day of ICE raids in OC** **Protesters clash with law enforcement in Santa Ana after day of ICE raids in OC** South Korean chain Lotteria to open first US location in Orange CountySouth Korean chain Lotteria to open first US location in Orange County **South Korean chain Lotteria to open first US location in Orange County** **South Korean chain Lotteria to open first US location in Orange County** Huntington Beach’s Measures A and B results: Both were passing in early returns Tuesday nightHuntington Beach’s Measures A and B results: Both were passing in early returns Tuesday night **Huntington Beach’s Measures A and B results: Both were passing in early returns Tuesday night** **Huntington Beach’s Measures A and B results: Both were passing in early returns Tuesday night** California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearingCalifornia judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** **California judge doesn’t grant Gov. Newsom’s request for immediate blockage of Trump’s deployment of troops, sets hearing** Woman convicted of orchestrating friend’s execution in car in Fountain ValleyWoman convicted of orchestrating friend’s execution in car in Fountain Valley **Woman convicted of orchestrating friend’s execution in car in Fountain Valley** **Woman convicted of orchestrating friend’s execution in car in Fountain Valley** Orange County condo requires $189,000 income to buyOrange County condo requires $189,000 income to buy **Orange County condo requires $189,000 income to buy** **Orange County condo requires $189,000 income to buy** Photos: Santa Ana Police declare riot as immigration raids spark day-long protestPhotos: Santa Ana Police declare riot as immigration raids spark day-long protest **Photos: Santa Ana Police declare riot as immigration raids spark day-long protest** **Photos: Santa Ana Police declare riot as immigration raids spark day-long protest** Former OC Supervisor Andrew Do sentenced to 60 months in prisonFormer OC Supervisor Andrew Do sentenced to 60 months in prison **Former OC Supervisor Andrew Do sentenced to 60 months in prison** **Former OC Supervisor Andrew Do sentenced to 60 months in prison** Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho CucamongaFrito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** **Frito-Lay production plant, birthplace of Flamin’ Hot Cheetos, closes in Rancho Cucamonga** **More in Crime and Public Safety** 4 men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests **4 men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests** **4 men charged on suspicion of having destructive devices, assaulting officers during anti-ICE protests** Man convicted of murder in Irvine DUI crash that killed 20-year-old woman **Man convicted of murder in Irvine DUI crash that killed 20-year-old woman** **Man convicted of murder in Irvine DUI crash that killed 20-year-old woman** National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** **National Guard in downtown Santa Ana Tuesday as protesters decry ICE raids** FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** **FBI seeks Compton man on suspicion of throwing rocks at federal vehicles during Paramount protest** 2025 June 3 SubscribeSign Up For Newsletterse-EditionBreaking News Sign Up For Newsletters e-Edition Breaking News Sign Up For Newsletters e-Edition Breaking News MarketplaceClassifiedObituaryLegalsLocal Job Board Classified Obituary Legals Local Job Board Classified Obituary Legals Local Job Board About OC RegisterAbout Southern California News GroupMediaNews GroupWork With UsPrivacy PolicyAccessibilityNews Archive About Southern California News Group MediaNews Group Work With Us Privacy Policy Accessibility News Archive About Southern California News Group MediaNews Group Work With Us Privacy Policy Accessibility News Archive Advertising SolutionsGet in Touch with a Marketing StrategistRequest Media KitCreative ServicesContent Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Get in Touch with a Marketing Strategist Request Media Kit Creative Services Content Marketing Contact UsCorrectionsOC Register StoreReader RewardsPhoto ReprintsSponsored Access Corrections OC Register Store Reader Rewards Photo Reprints Sponsored Access Corrections OC Register Store Reader Rewards Photo Reprints Sponsored Access PartnersLive Traffic MapNewspapers in EducationSponsor a Student Live Traffic Map Newspapers in Education Sponsor a Student Live Traffic Map Newspapers in Education Sponsor a Student Subscribe Now Terms of Use Cookie Policy Cookie Preferences California Notice at Collection Notice of Financial Incentive Do Not Sell/Share My Personal Information Arbitration Powered by WordPress.com VIP Copyright © 2025 MediaNews Group"}