{"id": 714, "name": "Jewish Currents", "domain": "jewishcurrents.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://jewishcurrents.org/event/woodstock-jewish-congregations-rabbi-emeritus-jonathan-kligler-with-peter-beinart", "title": "Woodstock Jewish Congregations Rabbi Emeritus Jonathan Kligler With Peter Beinart", "content": "You should follow us onTwitterorInstagram. And listen to ourpodcast. **Woodstock Jewish Congregation’s Rabbi Emeritus Jonathan Kligler with Peter Beinart** Please join the Woodstock Jewish Congregation in welcoming author Peter Beinart to Woodstock to discuss the themes of his latest book,Being Jewish After the Destruction of Gaza,with Rabbi Emeritus Jonathan Kligler. InBeing Jewish After the Destruction of Gaza, Beinart considers how a story of persecution and victimhood has come to dominate contemporary Jewish life, even as Israel is decimating the conditions of life for millions. That narrative, Beinart argues, both warps our understanding of Israel and Palestine and erases much of the nuance of Jewish religious tradition. After more than a year of Israel’s bombardment of Gaza—and the deployment of Jewish text and history to justify mass slaughter and starvation—Beinart insists that Jews must tell a new story. After this war, whose horror will echo for generations, they must offer a new answer to the question: What does it mean to be a Jew? This event is taking place on May 13th in-person at the Woodstock Jewish Congregation, and will be livestreamed. It is free for WJC members and members ofJewish Currents, with an $18 donation for non-members. All proceeds benefit the Woodstock Jewish Congregation.Register here. From the Woodstock Jewish Congregation:“We also invite you to join Rabbi Jonathan and Rabbi Karen for a discussion of some of the themes in Beinart’s book to prepare for his visit to Woodstock. This will be held the prior Tuesday, May 6 at 7pm ET, in-person and online.Register herefor this additional evening discussion.” John Collazos Peter Beinartteaches national reporting and opinion writing at the Newmark J-School and political science at the CUNY Graduate Center. He is the editor-at-large ofJewish Currents, an MSNBC political commentator, author ofThe Beinart Notebookon Substack, a fellow at the Foundation for Middle East Peace, and the author ofBeing Jewish After the Destruction of Gaza. Rabbi Jonathan Kligleris rabbi emeritus of Kehillat Lev Shalem, the Woodstock Jewish Congregation. He is a renowned and beloved teacher of Torah, and is the author ofTurn It and Turn It, for Everything Is in It: Essays on the Weekly Torah Portion.He is now devoting himself to writing, teaching, and sharing the joy of music. You can read his latest essays on his Substack publication,Turn It and Turn It. The Woodstock Jewish Communityis a vibrant, welcoming spiritual home, dedicated to the advancement of Jewish ethics, culture, and religion. Founded in 1946,Jewish Currentsis a magazine committed to the rich tradition of thought, activism, and culture of the Jewish left. © 2025 ·Privacy Policy You should follow us onTwitterorInstagram. And listen to ourpodcast."}