{"id": 1286, "name": "Stacker", "domain": "stacker.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://stacker.com/resources/earned-media/difference-between-earned-media-vs-social-media-reach", "title": "Difference Between Earned Media Vs Social Media Reach", "content": "BRANDSShow submenu for BRANDSLEARN MOREContent OptimizationNative DistributionReporting & InsightsLocalNewsroom-as-a-Service LEARN MORE Content Optimization Native Distribution Reporting & Insights Local Newsroom-as-a-Service LEARN MORE Content Optimization Native Distribution Reporting & Insights Local Newsroom-as-a-Service PUBLISHERS STORIES CASE STUDIES ABOUT BLOG REQUEST A DEMO BRANDSShow submenu for BRANDSLEARN MOREContent OptimizationNative DistributionReporting & InsightsLocalNewsroom-as-a-Service LEARN MORE Content Optimization Native Distribution Reporting & Insights Local Newsroom-as-a-Service LEARN MORE Content Optimization Native Distribution Reporting & Insights Local Newsroom-as-a-Service PUBLISHERS STORIES CASE STUDIES ABOUT BLOG REQUEST A DEMO There are no suggestions because the search field is empty. Resources Earned Media Earned Media **What is the Difference Between Earned Media and Social Media Reach?** **Reaching audiences online is essential for enhancing your marketing strategy. Two key components of this approach are earned media and social media reach. Earned media involves gaining unpaid attention through customer reviews, influencer mentions, and news coverage. Social media reach measures the volume of people who see your content. In this article, we will define both concepts, explore how they work together, and provide simple examples of how they can boost your online presence.** **What is Earned Media?** Earned mediais the publicity a brand receives without paying for it. It happens when people talk about your brand because they find it interesting, useful, or trustworthy. Common examples include: Press Coverage:News articles or interviews about your brand. Customer Reviews and Testimonials:Positive feedback from satisfied customers on review sites or forums. Influencer Mentions:Endorsements or mentions by trusted individuals without any payment. Social Shares:When people share your content with their friends and followers. Since earned media comes from third parties, it often feels more reliable to the audience and can have a significant impact on building brand authority. 💡Example: You create a listicle that features a particular brand or entity, and they share your content because they’re included in it. Thanks for including us in the list of #1 rock songs of the 1970s,@Stacker!Written by singer Dewey Bunnell about his experience growing up in the desert, \"A Horse With No Name\" spent 3 weeks at #1 in 1972.Real the full article here:https://t.co/Qxl3Kx7T3dpic.twitter.com/av5yJWDutw 💡Read more:What is earned media? **What is Social Media Reach?** Social media reachis the number of unique people who see your content on a social platform. It helps you understand how many individuals are exposed to your message. There are two main types: Organic Reach:The number of people who see your posts naturally, without any paid promotion. Paid Reach:The number of people reached through paid advertisements or sponsored posts. This measurement shows how widely your content is seen and can help you decide if you need to use paid methods to reach more people. It can also help you assess if your messaging is resonating with your target audience. 💡Example: The CEO at your company posts on LinkedIn and you want to see how many people have seen his content, so you check LinkedIn’s analytics. **How Do They Differ?** Earned media can be considered both: A strategy:Creating content and/or pitching folks to talk about your brand or content A result:Getting the brand mention what occurs naturally or as a result of your outreach Social media reach is more about the result. When you post either organic or paid content, how many people see it? The other main differentiation is that social media reach can relate to both paid and organic content, so it’s not exclusively a metric of earned media. **Using Earned Media and Social Media Reach in Your Strategy** If we focus on the earned aspect of both of these terms, then we’re looking at a combination that can serve as a solid content, communications, and/or PR strategy. You’re basically asking yourself: How can I reach as many people as possible and build as much trust as possible organically? Here are some ideas for how to achieve this: Tell Interesting, Data-Driven Stories:Focus on topics that connect with a wider audience. Good stories can attract the attention of news outlets and other trusted voices. Use Engaging Visuals:Images, infographics, and videos can help your content be more compelling. 💡Example: TruckInfo.net creates a story based on National Highway Traffic and Safety Information data that is widely appealing. When we distributed it on our newswire, it earned more than 72,000 impressions. Reach Out to Media:Send clear and interesting press releases or story ideas to news outlets. Connect with Influencers:Develop relationships with people who have a trusted voice in your field. Encourage them to share their honest opinions about your product or service. (Or, pay them to advocate for your product/service.) 💡Example: A grocery/meal delivery service has influencers and customers share their experiences with their product. Use Analytics:Check your social media tools to see how many people are seeing and interacting with your content. Improve Based on Data:If you see certain posts do well, try to understand why and use that insight in future posts. 💡Example: You’re getting started on Instagram and tracking to see which posts are performing better than others to help you devise a go-forward social content strategy. Highlight Good Coverage:When you receive a mention from a respected source, share it on your social channels. Keep Your Message Consistent:Make sure the message from your earned media matches what you post on social media to build a clear and trustworthy brand image. 💡Example: The founder of a SaaS tool shares a testimonial on his social channels. .@brodieclark.bsky.social is one of the SEOs I look up to; for the e-com he is pretty much unmatched with the insights he uncovers and tips he generously provides. It really made my day when I found out that Brodie had used @alsoasked.com and had something nice to say about it! 💙 alsoasked.com[image or embed] Ask for Feedback:Invite customers to share their experiences online. This can create both earned media and more organic reach. Feature Customer Content:Repost and comment on content your customers create about or featuring your product/service. 💡Example: Ring regularly shares posts of their customers’ videos that their Rings recorded. It adds a personal touch to their product and makes it very relatable. **Conclusion** Earned media and social media reach are two important parts of a strong communication plan. Earned media brings trust and third-party approval, while social media reach shows you how many people are seeing your content. By understanding both, you can create a clear and effective strategy that builds trust and extends your audience. This straightforward approach ensures that your efforts are not only measurable but also relatable, making it easier for everyone to understand the value of both earned media and social media reach. 💡 Read next:What is the difference between earned media and paid media? Want Earned Media You Can Actually Count On? Getting covered by the press doesn’t have to be a mystery. Stacker helps brands publish newsroom-quality stories that get picked up by hundreds of trusted media outlets—without chasing journalists or crossing your fingers. 🔹See How It Works– Explore how Stacker powers earned media at scale. FOR BRANDS FOR PUBLISHERS STANDARDS CONTACT US BLOG ABOUT PRESS STORIES CONTENT OPTIMIZATION NATIVE DISTIRBUTION CONTENT OPTIMIZATION REPORTING & INSIGHTS WHAT IS EARNED MEDIA EARNED MEDIA VS PAID MEDIA EARNED MEDIA VS SOCIAL MEDIA HOW TO SCALE EARNED MEDIA Terms & Conditions Privacy Policy"}