{"id": 1889, "name": "AutoStraddle", "domain": "autostraddle.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.autostraddle.com/23-queer-owned-stores-thatll-meet-your-lgbt-pride-t-shirt-needs-keep-it-in-the-family-382557/#comments", "title": "23 Queer Owned Stores Thatll Meet Your Lgbt Pride T Shirt Needs Keep It In The Family 382557", "content": "**** AboutAbout AutostraddleMeet The TeamJobsAdvertisePressEventsContactComment Policy About Autostraddle Meet The Team Jobs Advertise Press Events Contact Comment Policy About Autostraddle Meet The Team Jobs Advertise Press Events Contact Comment Policy Shop Sign In Support UsGive to AutostraddleBecome an AF+ MemberAF+ Gift MembershipBuy Our Merch Give to Autostraddle Become an AF+ Member AF+ Gift Membership Buy Our Merch Give to Autostraddle Become an AF+ Member AF+ Gift Membership Buy Our Merch Home AF+All AF+ PostsAF+ Discount MarketplaceInto the AF+ Advice BoxAF+ RoundtablesPersonal EssaysAnonymous Job ConfessionsInterview with My Significant OtherThings I’ve Never AskedThe Autostraddle InsiderSome Answers to Some QuestionsSex DiariesS L I C K EroticaInterview With My ExExcerpts From My Secret DiaryAnnual Report All AF+ Posts AF+ Discount Marketplace Into the AF+ Advice Box AF+ Roundtables Personal Essays Anonymous Job Confessions Interview with My Significant Other Things I’ve Never Asked The Autostraddle Insider Some Answers to Some Questions Sex Diaries S L I C K Erotica Interview With My Ex Excerpts From My Secret Diary Annual Report All AF+ Posts AF+ Discount Marketplace Into the AF+ Advice Box AF+ Roundtables Personal Essays Anonymous Job Confessions Interview with My Significant Other Things I’ve Never Asked The Autostraddle Insider Some Answers to Some Questions Sex Diaries S L I C K Erotica Interview With My Ex Excerpts From My Secret Diary Annual Report TelevisionAll Television PostsLGBTQ Television Guide: What To Watch NowTV Show RecapsTV ReviewsTV ListsTV News & TrailersTV FeaturesThe L Word: Generation QAutostraddle TV AwardsTo L and Back PodcastBoobs On Your Tube All Television Posts LGBTQ Television Guide: What To Watch Now TV Show Recaps TV Reviews TV Lists TV News & Trailers TV Features The L Word: Generation Q Autostraddle TV Awards To L and Back Podcast Boobs On Your Tube All Television Posts LGBTQ Television Guide: What To Watch Now TV Show Recaps TV Reviews TV Lists TV News & Trailers TV Features The L Word: Generation Q Autostraddle TV Awards To L and Back Podcast Boobs On Your Tube FilmAll Film PostsThe 100 Best Lesbian Movies Of All TimeThe Autostraddle Encyclopedia of Lesbian CinemaMovie ListsMovie ReviewsMovie FeaturesMovie News & Trailers All Film Posts The 100 Best Lesbian Movies Of All Time The Autostraddle Encyclopedia of Lesbian Cinema Movie Lists Movie Reviews Movie Features Movie News & Trailers All Film Posts The 100 Best Lesbian Movies Of All Time The Autostraddle Encyclopedia of Lesbian Cinema Movie Lists Movie Reviews Movie Features Movie News & Trailers EntertainmentLiteratureCelebrities (Vapid Fluff)StyleMusicTheaterVisual ArtComedySports Literature Celebrities (Vapid Fluff) Style Music Theater Visual Art Comedy Sports Literature Celebrities (Vapid Fluff) Style Music Theater Visual Art Comedy Sports Love + SexAll Love + Sex PostsDatingLesbian SexSex ToysLesbian Dating AppsFriendshipBreakupsRelationshipsLesbian WeddingsShibari 101Tops & Bottoms All Love + Sex Posts Dating Lesbian Sex Sex Toys Lesbian Dating Apps Friendship Breakups Relationships Lesbian Weddings Shibari 101 Tops & Bottoms All Love + Sex Posts Dating Lesbian Sex Sex Toys Lesbian Dating Apps Friendship Breakups Relationships Lesbian Weddings Shibari 101 Tops & Bottoms NewsPolitics + ActivismSociety + CulturePop Culture Fix Politics + Activism Society + Culture Pop Culture Fix Politics + Activism Society + Culture Pop Culture Fix CommunityCultureStraddleverseThe Autostraddle YearbookLGBTQ+ BusinessesLGBT PrideAutostraddle Reader Data Culture Straddleverse The Autostraddle Yearbook LGBTQ+ Businesses LGBT Pride Autostraddle Reader Data Culture Straddleverse The Autostraddle Yearbook LGBTQ+ Businesses LGBT Pride Autostraddle Reader Data IdentityFirst PersonComing OutGenderThe QTPOC SpeakeasyDisabilityBisexuality First Person Coming Out Gender The QTPOC Speakeasy Disability Bisexuality First Person Coming Out Gender The QTPOC Speakeasy Disability Bisexuality HomeCrafts & DIY ProjectsFood and DrinkHouse & GardenPets & Animals Crafts & DIY Projects Food and Drink House & Garden Pets & Animals Crafts & DIY Projects Food and Drink House & Garden Pets & Animals GamesQuizzesPuzzles Quizzes Puzzles Quizzes Puzzles **Life** LGBT History Health Travel Money + Work Geekery Astrology, Tarot & Witchcraft Holigays Parenting & Family Pregnancy **Etc.** Special Issues Webcomics Lists/Top Tens Greatest Hits Ranked by Lesbianism Epic Lists Shopping Podcasts **** Support UsGive to AutostraddleBecome an AF+ MemberAF+ Gift MembershipBuy Our Merch Give to Autostraddle Become an AF+ Member AF+ Gift Membership Buy Our Merch Give to Autostraddle Become an AF+ Member AF+ Gift Membership Buy Our Merch Sign In Home AF+All AF+ PostsAF+ Discount MarketplaceInto the AF+ Advice BoxAF+ RoundtablesPersonal EssaysAnonymous Job ConfessionsInterview with My Significant OtherThings I’ve Never AskedThe Autostraddle InsiderSome Answers to Some QuestionsSex DiariesS L I C K EroticaInterview With My ExExcerpts From My Secret DiaryAnnual Report All AF+ Posts AF+ Discount Marketplace Into the AF+ Advice Box AF+ Roundtables Personal Essays Anonymous Job Confessions Interview with My Significant Other Things I’ve Never Asked The Autostraddle Insider Some Answers to Some Questions Sex Diaries S L I C K Erotica Interview With My Ex Excerpts From My Secret Diary Annual Report All AF+ Posts AF+ Discount Marketplace Into the AF+ Advice Box AF+ Roundtables Personal Essays Anonymous Job Confessions Interview with My Significant Other Things I’ve Never Asked The Autostraddle Insider Some Answers to Some Questions Sex Diaries S L I C K Erotica Interview With My Ex Excerpts From My Secret Diary Annual Report TelevisionAll Television PostsLGBTQ Television Guide: What To Watch NowTV Show RecapsTV ReviewsTV ListsTV News & TrailersTV FeaturesThe L Word: Generation QAutostraddle TV AwardsTo L and Back PodcastBoobs On Your Tube All Television Posts LGBTQ Television Guide: What To Watch Now TV Show Recaps TV Reviews TV Lists TV News & Trailers TV Features The L Word: Generation Q Autostraddle TV Awards To L and Back Podcast Boobs On Your Tube All Television Posts LGBTQ Television Guide: What To Watch Now TV Show Recaps TV Reviews TV Lists TV News & Trailers TV Features The L Word: Generation Q Autostraddle TV Awards To L and Back Podcast Boobs On Your Tube FilmAll Film PostsThe 100 Best Lesbian Movies Of All TimeThe Autostraddle Encyclopedia of Lesbian CinemaMovie ListsMovie ReviewsMovie FeaturesMovie News & Trailers All Film Posts The 100 Best Lesbian Movies Of All Time The Autostraddle Encyclopedia of Lesbian Cinema Movie Lists Movie Reviews Movie Features Movie News & Trailers All Film Posts The 100 Best Lesbian Movies Of All Time The Autostraddle Encyclopedia of Lesbian Cinema Movie Lists Movie Reviews Movie Features Movie News & Trailers EntertainmentLiteratureCelebrities (Vapid Fluff)StyleMusicTheaterVisual ArtComedySports Literature Celebrities (Vapid Fluff) Style Music Theater Visual Art Comedy Sports Literature Celebrities (Vapid Fluff) Style Music Theater Visual Art Comedy Sports Love + SexAll Love + Sex PostsDatingLesbian SexSex ToysLesbian Dating AppsFriendshipBreakupsRelationshipsLesbian WeddingsShibari 101Tops & Bottoms All Love + Sex Posts Dating Lesbian Sex Sex Toys Lesbian Dating Apps Friendship Breakups Relationships Lesbian Weddings Shibari 101 Tops & Bottoms All Love + Sex Posts Dating Lesbian Sex Sex Toys Lesbian Dating Apps Friendship Breakups Relationships Lesbian Weddings Shibari 101 Tops & Bottoms NewsPolitics + ActivismSociety + CulturePop Culture Fix Politics + Activism Society + Culture Pop Culture Fix Politics + Activism Society + Culture Pop Culture Fix CommunityCultureStraddleverseThe Autostraddle YearbookLGBTQ+ BusinessesLGBT PrideAutostraddle Reader Data Culture Straddleverse The Autostraddle Yearbook LGBTQ+ Businesses LGBT Pride Autostraddle Reader Data Culture Straddleverse The Autostraddle Yearbook LGBTQ+ Businesses LGBT Pride Autostraddle Reader Data IdentityFirst PersonComing OutGenderThe QTPOC SpeakeasyDisabilityBisexuality First Person Coming Out Gender The QTPOC Speakeasy Disability Bisexuality First Person Coming Out Gender The QTPOC Speakeasy Disability Bisexuality HomeCrafts & DIY ProjectsFood and DrinkHouse & GardenPets & Animals Crafts & DIY Projects Food and Drink House & Garden Pets & Animals Crafts & DIY Projects Food and Drink House & Garden Pets & Animals GamesQuizzesPuzzles Quizzes Puzzles Quizzes Puzzles Shop AboutAbout AutostraddleMeet The TeamJobsAdvertisePressEventsContactComment Policy About Autostraddle Meet The Team Jobs Advertise Press Events Contact Comment Policy About Autostraddle Meet The Team Jobs Advertise Press Events Contact Comment Policy Community LGBT Pride **36 LGBTQ-Owned Businesses Selling LGBT T-Shirts To Support This Pride Season** 93 Click to share on Facebook (Opens in new window)FacebookClick to share on X (Opens in new window)XClick to share on Tumblr (Opens in new window)TumblrClick to share on Pinterest (Opens in new window)PinterestClick to email a link to a friend (Opens in new window)EmailClick to print (Opens in new window)Print Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print If you wanna give your money to actual LGBTQ people this Pride season, have I got the thing for you: it’s called THE INTERNET, and it’schock-full of queer-owned businesses who have designed and produced their very own t-shirtsthat you could potentially purchase for yourself and wear to a Pride celebration or really anywhere t-shirts are worn. Plus, these indies have also been known to produce social justice and LGBTQ+ apparel that goes beyond straight-up rainbows! Imagine that. Last year, a lot of shops from the year before had to be removed because they’d shut down or didn’t have anything in stock. Meanwhile on Etsy,in line with etsy trends already acknowledged across the entire platform, the carefully-curated maker-centric stores are getting drowned out by massive, print-on-demand shirt-makers (print-on-demand is a less risky and more efficient — but less profitable on a price-per-item basis —way to sell merchandise) who, rather than developing an intentional line of designs are just throwing 200 slogans out there and seeing what sticks. This isn’t a criticism of the makers themselves, but of the way the indie queer merch-schilling market has evolved into one where it’s not profitable to do it any other way. Those of us who have bothered to create original designs have long given up on trying to control the massive amount of copycat makers out there, too. Which is just to say —if you can, don’t buy your Pride Tees from Target or from straight people or CustomTrendyShirts or HappyCustomTee, buy them from the queer people acknowledged in this post. If you are a writer using this list as a reference tool to write your own list of queer-owned businesses for a mainstream (not queer) website or a website that makes more money than we do, we would very much appreciate it if you couldinclude our storeor credit our list! This post was originally written in 2017 and has been updated for 2025. **Autostraddle: Our #1 Most Favorite Queer-Owned Business** Up top is our #1 most favorite queer-owned business store on the entire internet even though we haven’t made any new shirts since 2023. Regardless, there is no other store in the world that will make you as happy as theAutostraddle store.The people who you support by shopping at the Autostraddle Store are some of the best people to have ever existed in the world! Wow, where do I begin? All these shirts look great on a body that contains a head that contains a face that is pretty bummed about Wells Fargo sponsoring Pride. Many of the slogans that are now common on queer tees, like the “Gal Pal” t-shirt, were pioneered right here on Autostraddle! I could go on and on because there are so many shirts from Autostraddle that will pop at Pride, but you can make your own choices! **Ash & Chess** Ash & Chess is a joyful, eye-popping stationary shop run by a queer and trans couple in Richmond, VA. They “create greeting cards and art prints that are bold, retro color palettes and they often use their artwork to make a political statement and to uplift the queer community.” Their t-shirt selection encourages all to support trans kids and reminds people that all bodies are good bodies and boys do cry. **Flavnt** FLAVNT Streetwear is an independent clothing brand based in Austin, Texas created with “the goal of creating clothes that promote confidence and pride.” They sell binders, stickers and sweats and run fundraisers for organizations like Black Lives Matter as well as individual trans people who need money for surgery. Flavnt’s LGBTQ+ relevant t-shirt selection is pretty vast, ranging from a “Hot Trans Boy Summer” to “Will Bottom For Femmes.” **AngiePeaon etsy** Angie is a self-identified “queer, neurodivergent woman of color” who hopes her shirts can show people in her community that feel forgotten that they’re not alone —they’re loved and they’re safe and they belong. She has hundreds of designs across social justice movements, including nearly 200 for queer causes specifically. **Culture Flock** Missouri-based apparel, accessories and gifts store Culture Flock designs and creates colorful and inclusive apparel, goods, and accessories for friends of every shape, size, color, gender, and orientation. **March for the Movementon etsy** Selling “soft tees for loud voices,” this LGBTQ-owened, AAPI-owned business focused on creating high-quality apparel that aims to empower its wearers to make a statement and raise social awareness. Their IYKYK scissoring tarot lesbian pride shirt is a winner, and this year they’ve added shirts on topics such as gender affirming health care saving lives! **heycolandaon etsy** based in Illinois, heycolanda describe themselves as “a couple of queers who do screen-printed things.” These “lesbian starter kit” tees are very cute I think. **A Tribe Called Queer** Created by Black, Indigenous hard femme Sabine Maxine Lopez; a Tribe Called Queer is a multidisciplinary brand featuring gender-netural and size-inclusive clothing as well as a podcast, zine, virtual events and a blog. The brand’s extensive selection of t-shirts tout slogans like “Femmes Can Be Thems” and “Queer Misfit.” **Style is Freedom** This “Tomboi Lifestlye Brand” from designer Toni Branson sells snapbacks, beanies, sweatshirts, tees, wallets, slides and more. **Lockwood51** Shirts, socks, hats, shorts and bags from this queer-owned Los Angeles shop with a mission to empower queer youth tout the benefits of staying queer as fuck, queer anarchy, burning it all down and existence as an act of resistance. **Sabor a Libertad** Sabor a Libertad is the project of a graphic artist in San Juan, Puerto Rico, aiming to make clothes that represent them and other queer, trans and/or non-binary people in Puerto Rico. They sell a ton of cute original graphic tees in bright, fun colors in both Spanish and English like Mariconx Caribenx Muscle Tank, Suck by Spiritual D*ck and a Disrupt Rebuild Oversized Tee. (h/t toVicovia whom I found this shop!) **re-inc** Founded by legendary women’s soccer players Megan Rapinoe, Tobin Heath, Meghan Klingenberg, and Christen Press, re-inc has “the mission of inspiring us all to boldly reimagine the status quo.” This year’s “More Proud Than Ever” line is on tie-dye shirts with the option to incorporate your favorite NSWL team’s logo. **Many Many Moons Agoon Etsy** Based in Austin, Texas, ManyManyMoonsAgo’s shirts sport slogans and illustrations relevant to topics including astrology, tarot, feminism and being QUEER. Great for anybody looking to hex the patriarchy or promote the concept that queerness is infinite. **Wildfang** These self-described “modern-day, female Robin Hoods raiding men’s closets and maniacally dispensing blazers, cardigans, wingtips and bowlers” launched their dapper-tomboy brand in early 2013. This year’s Pride Tee was designed byVivian Wilson. **MegemikoArton Etsy** ThisAsian-American non binary artist’s wares implore you to support trans kids, feel valid, stop Asian hate, believe in trans happiness and push back against gender norms. **Mi Vida** Noelle Reyes founded her LA-based store in 2008 “with the purpose of providing the surrounding the surrounding community a shopping experience that compliments their lifestyle, incorporating cultural elements into fashion and functional art.” The tees aren’t gay-specific, but they definitely have Pride-appropriate attitude. **The Phluid Project** In 2018, The Phluid Project launched in NYC and online to make gender-free apparel and accessories available worldwide and to improve humanity through not just fashion, but also through the Phluid Foundation’s community outreach, activism and education. **Queerly Designson Etsy** The self-described “lesbian Anthony Robbins” sells tees with just about every slogan under the sun. They would like you to kiss more girls and acknowledge that mean lesbians are the backbone of society. **Tegan & Sara Foundationcomic-t-shirt** 100% of the proceeds from these tees go to the Tegan & Sara foundation, which “fights for economic justice, health and representation for LGBTQ girls and women.” **Official Rebrand** Official Rebrand specializes in breathing new life into discarding clothing through painting and other alterations. Thisprocess“celebrates the fluidity of identity, dissociating garments from gendered categories, reintroducing them without arbitrary social constraints.” This season they would like you to have PRIDE ok **Sparkletown Studioson Etsy** Boston-based maker Femme Brulée is a burlesque performer “known for her over-the-top costumes and props,” and as the founder and coreographer of the Glitter Bombs, Boston’s Premier Strip Hop Troupe. Her glittery store offers pasties and earrings as well as t-shirts so you can have more queer and less fear. **Thugz Maison** “The Goddesses” t-shirt celebrates queer icons Audre Lorde, Gloria Anzaldúa and Angela Davis as well as our other fave bell hooks. You may as well pick up a “Butch Please” hat while you’re over there! **Jen Zeano Designs** Wife-and-wife team Jen and Vero started Jen Zeano Designs in 2014, the same year they got married, launching the store with a Pink Latina Power Tee. The brand celebrates Latina community & culture through tees, sweats, accessories, bags, stationary, drinkware and kids stuff, including their limited edition Bien Gay Pride Tees. She would like you to understand that amor is amor! **Demian Diné Yazhi’on Etsy** Demian Diné Yazhi’ is a Portland-based artist and transdisciplinary warrior whose work is “an archivalization & exploration of memory formation, landscape representation, HIV/AIDS-related art & activism, gender / sexuality, & indigenous survivance.” Demian is also the founder of R.I.S.E.: Radical Indigenous Survivance & Empowerment, an Indigenous artist/activist collective. **Haute Butch** Selling “fierce dapper stud style” and “tomboy-style clothes,” Haute Butch features suits, vests, watches, belts, footwear, briefs and so much more at their online store. Karen Roberts opened her store in April 2012 witha focus on becoming“a clothing, footwear and lifestyle destination for butch women, studs, bois and transmen who prefer ‘menswear’ inspired finishes.” **Queer Gear** “Queer Gearmakes must-have pieces that are perfect for Pride parades, date night with your partner, political events, awkward holiday dinners with the family, or anywhere else you want to be uniquely, proudly, and unapologetically you.” **Transfigure Print Co** The Transfigure Print Co. is a small screen-printing store based in Grand Rapids, Michigan, “surrounded by a unique, nation-wide community of individuals who want to make—and wear—a statement.” Since 2017, this trans-and-queer owned store has partnered with myriad like-minded small businesses to raise over $70k for LGBTQ+ related causes. **Kiernan Dunnon Etsy** Kiernan Dunn is a printmaker and zinemaker based in New Orleans. **Bad Real Bad** Former Autostraddle CartoonistArchie Bongiovanni, a “genderqueer mesh-wearing, french fry luver, leather-daddy-in-training, “Satan is an ok dude”, drunk cartoonist trash living in MPLS,” sells tees and tanks on their threadless shop. **Decolonizing FitnessSaveSave** Decolonizing Fitness is a social justice platform that provides affirming fitness services, community education and apparel in support of body diversity. It’s owned by Black non-binary trans masculine person Illya, a physical therapist assistant and ACE Medical Exercise Specialist. 100% of Shirt sales on the Decolonize Fitness website — t-shirts that suggest concepts like “down with the binary” and “Fitness is for All Bodies” will be donated to help support Black Trans and Gender Diverse folks who are currently experiencing houselessness. **Surprideon Etsy** Surpride’s mission is to create apparel that LGBTQIA+ people can relate to, by sharing their thoughts and purposes and being a part of the community themselves as a queer-owned business. Many of their designs are inspired by Gay Activism shirts designed in the 70s, 80s and 90s, like their Gay Liberation Day line. **South Street Art Mart** This queer-women-owned South Street Art Market in Philadelphia sells goods from 130+ indie artists in their store and online, embracing whims from kitschy nostalgia to nerdy indulgences to the dark arts. They invite you toenjoy ass,promote bats as gay icons, identify as aLilith Fair Lesbianand so much more. **Rebirth Garments** Rebirth Garments is a gender non-conforming wearables line centering non-binary, trans, disabled and mad queers of all sizes and ages. You can shop all their signature designs including their Star Queercrip tees and all-over-prints on fanny packs and tees. Anyways, Happy Pride! SaveSave SaveSave SaveSave 93 Click to share on Facebook (Opens in new window)FacebookClick to share on X (Opens in new window)XClick to share on Tumblr (Opens in new window)TumblrClick to share on Pinterest (Opens in new window)PinterestClick to email a link to a friend (Opens in new window)EmailClick to print (Opens in new window)Print Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to share on Tumblr (Opens in new window)Tumblr Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print **Riese** Rieseis the 43-year-old Co-Founder of Autostraddle.com as well as an award-winning writer, video-maker, LGBTQ+ Marketing consultant and aspiring cyber-performance artist who grew up in Michigan, lost her mind in New York and now lives in Los Angeles. Her work has appeared in nine books, magazines includingMarie ClaireandCurve, and all over the web including Nylon, Queerty, Nerve, Bitch, Emily Books and Jezebel. She had a very popularpersonal blogonce upon a time, and then she recappedThe L Word, and then she had the idea to make this place, and now here we all are! In 2016, she was nominated for a GLAAD Award for Outstanding Digital Journalism. She's Jewish. Follow her ontwitterandinstagram. Riese has written 3328 articles for us. **You May Also Like...** **Post navigation** **93 Comments** Carmen SanDiegoJune 15, 2017 at 10:40 amHold on, I’m gonna go get my credit card.Be right backLoading...Reply to This CommentCarmen SanDiegoJune 15, 2017 at 10:41 amOh, and the link for Thugz Maison is missingLoading...Reply to This CommentGBWhatsAppDecember 15, 2021 at 11:46 pmNice Post Useful Information ..!Loading...Reply to This Comment Hold on, I’m gonna go get my credit card.Be right back Carmen SanDiegoJune 15, 2017 at 10:41 amOh, and the link for Thugz Maison is missingLoading...Reply to This Comment Oh, and the link for Thugz Maison is missing GBWhatsAppDecember 15, 2021 at 11:46 pmNice Post Useful Information ..!Loading...Reply to This Comment Nice Post Useful Information ..! Hold on, I’m gonna go get my credit card.Be right back Carmen SanDiegoJune 15, 2017 at 10:41 amOh, and the link for Thugz Maison is missingLoading...Reply to This Comment Oh, and the link for Thugz Maison is missing Oh, and the link for Thugz Maison is missing GBWhatsAppDecember 15, 2021 at 11:46 pmNice Post Useful Information ..!Loading...Reply to This Comment Nice Post Useful Information ..! Nice Post Useful Information ..! Jenni(fer)June 15, 2017 at 10:46 amWell now my wishlist is full.Also I saw FtM Detroit at Ferndale Pride this year and they were so great and nice!Loading...Reply to This CommentKarJune 2, 2021 at 5:01 pmCheck out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! XoLoading...Reply to This Comment Well now my wishlist is full. Also I saw FtM Detroit at Ferndale Pride this year and they were so great and nice! KarJune 2, 2021 at 5:01 pmCheck out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! XoLoading...Reply to This Comment Check out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! Xo Well now my wishlist is full. Also I saw FtM Detroit at Ferndale Pride this year and they were so great and nice! KarJune 2, 2021 at 5:01 pmCheck out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! XoLoading...Reply to This Comment Check out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! Xo Check out threadedwit.comWe’re queer owned and donate the majority of proceeds to the Looking Out Foundation! Xo Carmen SanDiegoJune 15, 2017 at 10:52 amDammit both the Harvey Milk T-Shirt and Rainbow Mountain t-shirts seem to be unavailable.C’mon, Revel & Riot!Loading...Reply to This Commentyour worst enemy at bestJune 7, 2021 at 1:37 amRiot and get a bullet, just saying. No fucking1 way to that.Loading...Reply to This Comment Dammit both the Harvey Milk T-Shirt and Rainbow Mountain t-shirts seem to be unavailable.C’mon, Revel & Riot! your worst enemy at bestJune 7, 2021 at 1:37 amRiot and get a bullet, just saying. No fucking1 way to that.Loading...Reply to This Comment Riot and get a bullet, just saying. No fucking1 way to that. Dammit both the Harvey Milk T-Shirt and Rainbow Mountain t-shirts seem to be unavailable.C’mon, Revel & Riot! your worst enemy at bestJune 7, 2021 at 1:37 amRiot and get a bullet, just saying. No fucking1 way to that.Loading...Reply to This Comment Riot and get a bullet, just saying. No fucking1 way to that. Riot and get a bullet, just saying. No fucking1 way to that. Priscila TJune 15, 2017 at 11:02 amSo, what you’re saying is I should stop procrastinating and finally get the Gender Traitor tee… I guess, if you insist…Loading...Reply to This Comment So, what you’re saying is I should stop procrastinating and finally get the Gender Traitor tee… I guess, if you insist… So, what you’re saying is I should stop procrastinating and finally get the Gender Traitor tee… I guess, if you insist… Valerie AnneJune 15, 2017 at 11:08 amThis is rude. I already own enough Autostraddle/Everyone is Gay merch to outfit myself forever, I surely didn’t need more. BUT NOW I /NEED/ MORE. So THANKS A LOT. (But no really, thanks.)Loading...Reply to This CommentCarmen SanDiegoJune 15, 2017 at 12:05 pmSo what you’re saying is that you are a queer and forever dressed?Loading...Reply to This CommentValerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment This is rude. I already own enough Autostraddle/Everyone is Gay merch to outfit myself forever, I surely didn’t need more. BUT NOW I /NEED/ MORE. So THANKS A LOT. (But no really, thanks.) Carmen SanDiegoJune 15, 2017 at 12:05 pmSo what you’re saying is that you are a queer and forever dressed?Loading...Reply to This CommentValerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment So what you’re saying is that you are a queer and forever dressed? Valerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment Always Queer, NeverNude This is rude. I already own enough Autostraddle/Everyone is Gay merch to outfit myself forever, I surely didn’t need more. BUT NOW I /NEED/ MORE. So THANKS A LOT. (But no really, thanks.) Carmen SanDiegoJune 15, 2017 at 12:05 pmSo what you’re saying is that you are a queer and forever dressed?Loading...Reply to This CommentValerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment So what you’re saying is that you are a queer and forever dressed? Valerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment Always Queer, NeverNude So what you’re saying is that you are a queer and forever dressed? Valerie AnneJune 15, 2017 at 12:21 pmAlways Queer, NeverNudeLoading...Reply to This Comment Always Queer, NeverNude Always Queer, NeverNude krisJune 15, 2017 at 1:11 pmYes! I’ve been waiting for this post, tbh.Loading...Reply to This Comment Yes! I’ve been waiting for this post, tbh. Yes! I’ve been waiting for this post, tbh. Iman JenkinsJune 15, 2017 at 1:30 pmHey friends I think the Gloria in the Thugz Madison shirt is Gloria Anzaldua, not Gloria Steinem <3Loading...Reply to This CommentRieseJune 15, 2017 at 2:30 pmthe first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE.Loading...Reply to This Comment Hey friends I think the Gloria in the Thugz Madison shirt is Gloria Anzaldua, not Gloria Steinem <3 RieseJune 15, 2017 at 2:30 pmthe first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE.Loading...Reply to This Comment the first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE. Hey friends I think the Gloria in the Thugz Madison shirt is Gloria Anzaldua, not Gloria Steinem <3 RieseJune 15, 2017 at 2:30 pmthe first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE.Loading...Reply to This Comment the first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE. the first place i saw that shirt was linked from an article on like, mashable maybe? or refinery29? and i copied the names from their description and didn’t double-check them when i went to the actual store in question and was like, hm, gloria steinem is a weird choice. THIS MAKES A LOT MORE SENSE. HayleyJune 15, 2017 at 1:33 pmhttps://www.etsy.com/shop/CrowandBier?ref=l2-shopheader-nameMy friend (and ex) designed these shirts for Chicago pride!Loading...Reply to This Comment https://www.etsy.com/shop/CrowandBier?ref=l2-shopheader-name My friend (and ex) designed these shirts for Chicago pride! https://www.etsy.com/shop/CrowandBier?ref=l2-shopheader-name My friend (and ex) designed these shirts for Chicago pride! AlJune 15, 2017 at 2:00 pmIs there a back story to the demon lizard shirt, because for years I’ve seen that term used in Antisemitic manner from racists and writers who claim they aren’t racist/antisemitic, but then proceed say stuff that is offensive. Even had to explain to a friend who is not straight what she’s seen on the internet is way out there false, and racist against Jews and poc.Loading...Reply to This CommentRieseJune 15, 2017 at 2:31 pmyeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episodeLoading...Reply to This CommentAlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading...Shawn GibsonJune 7, 2021 at 1:44 amIt must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP.Loading...Reply to This CommentpackratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment Is there a back story to the demon lizard shirt, because for years I’ve seen that term used in Antisemitic manner from racists and writers who claim they aren’t racist/antisemitic, but then proceed say stuff that is offensive. Even had to explain to a friend who is not straight what she’s seen on the internet is way out there false, and racist against Jews and poc. RieseJune 15, 2017 at 2:31 pmyeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episodeLoading...Reply to This CommentAlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... yeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episode AlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Ah. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such. HazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... You are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/Reptilians AlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. Shawn GibsonJune 7, 2021 at 1:44 amIt must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP.Loading...Reply to This CommentpackratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment It must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP. packratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment Moderators, please remove this comment. Is there a back story to the demon lizard shirt, because for years I’ve seen that term used in Antisemitic manner from racists and writers who claim they aren’t racist/antisemitic, but then proceed say stuff that is offensive. Even had to explain to a friend who is not straight what she’s seen on the internet is way out there false, and racist against Jews and poc. RieseJune 15, 2017 at 2:31 pmyeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episodeLoading...Reply to This CommentAlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... yeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episode AlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Ah. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such. HazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... You are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/Reptilians AlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. yeah, it’s a reference to a demon lizard who lived in the basement of a fraternity in an episode of buffy the vampire slayer, and the lizard was basically the patriarchy in that episode AlJune 15, 2017 at 5:04 pmAh. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such.Loading...Reply to This CommentHazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Ah. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such. HazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... You are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/Reptilians AlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. Ah. Maybe Im jumpy as I’ve seen too many antisemitic material in the past few years referring to us as lizards and such. HazardHellerJune 16, 2017 at 12:21 amYou are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/ReptiliansLoading...Reply to This CommentAlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... You are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/Reptilians AlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. You are referring to the conspiracy theory about Reptilians (or Lizard People) propagated by David Icke. It’s … well… weird. However, you don’t necessarily have to be Jewish or a POC to be accused of being a lizard. Anyway, here’s some info on the fun stuff:https://en.m.wikipedia.org/wiki/Reptilians AlJune 16, 2017 at 1:35 pmYes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women.Loading... Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. Yes, I saw that. Then got to the wiki page of a author, forget her name atm, who said similar things. Still, kind of jumpy as I’ve seen in recent times white (usually)men quote authors like Icke to attack queer and feminist Jewish women. Shawn GibsonJune 7, 2021 at 1:44 amIt must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP.Loading...Reply to This CommentpackratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment It must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP. packratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment Moderators, please remove this comment. It must be a rough life seeing racism, bigotry, seismic etc in literally everything. Good thing this dumb country is about to fail to people that haven’t fallen to this stupid ideology THE RUSSIAN AND CHINESE. YOUR KIND IS TOAST. THEY WILL KILL YOU BY WIPING THEIR ASSES WITH YOU OFF THE MAP. packratpatJune 8, 2022 at 4:36 amModerators, please remove this comment.Loading...Reply to This Comment Moderators, please remove this comment. Moderators, please remove this comment. Femme BruleeJune 15, 2017 at 2:24 pmAlso check out queer-owned Sparkletown Studios on Etsy!https://www.etsy.com/shop/SparkletownStudiosLoading...Reply to This CommentCarmen SanDiegoJune 16, 2017 at 7:42 amFantastic user name. CongratsLoading...Reply to This CommentErinJuly 15, 2017 at 4:38 pmOMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!!Loading...Reply to This Comment Also check out queer-owned Sparkletown Studios on Etsy! https://www.etsy.com/shop/SparkletownStudios Carmen SanDiegoJune 16, 2017 at 7:42 amFantastic user name. CongratsLoading...Reply to This Comment Fantastic user name. Congrats ErinJuly 15, 2017 at 4:38 pmOMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!!Loading...Reply to This Comment OMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!! Also check out queer-owned Sparkletown Studios on Etsy! https://www.etsy.com/shop/SparkletownStudios Carmen SanDiegoJune 16, 2017 at 7:42 amFantastic user name. CongratsLoading...Reply to This Comment Fantastic user name. Congrats Fantastic user name. Congrats ErinJuly 15, 2017 at 4:38 pmOMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!!Loading...Reply to This Comment OMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!! OMG I JUST ORDERED THE POOP ON THE PATRIARCHY HOODIE FOR MY TINY DOG AND I’M SO EXCITED I HAVE TO USE ALLLLLLL CAAAAPPPPPPSSSS!!!!! EmersonJune 15, 2017 at 3:32 pmMy etsy shop is queer hats and not t-shirts, is it cool if I plug that?Loading...Reply to This CommentRieseJune 15, 2017 at 5:51 pmsure! this post is about t-shirts but you can plug whatever you want in the comments!Loading...Reply to This Comment My etsy shop is queer hats and not t-shirts, is it cool if I plug that? RieseJune 15, 2017 at 5:51 pmsure! this post is about t-shirts but you can plug whatever you want in the comments!Loading...Reply to This Comment sure! this post is about t-shirts but you can plug whatever you want in the comments! My etsy shop is queer hats and not t-shirts, is it cool if I plug that? RieseJune 15, 2017 at 5:51 pmsure! this post is about t-shirts but you can plug whatever you want in the comments!Loading...Reply to This Comment sure! this post is about t-shirts but you can plug whatever you want in the comments! sure! this post is about t-shirts but you can plug whatever you want in the comments! Liam Invincible 67June 15, 2017 at 4:09 pmI need that Don’t Assume Anything as a 29 yo trans masc person who looks like a 13 yo girl. Sums me up so much lol.Loading...Reply to This Comment I need that Don’t Assume Anything as a 29 yo trans masc person who looks like a 13 yo girl. Sums me up so much lol. I need that Don’t Assume Anything as a 29 yo trans masc person who looks like a 13 yo girl. Sums me up so much lol. CloudyJune 15, 2017 at 5:08 pmJacob is the best, so happy to see their work advertised here <3Loading...Reply to This Comment Jacob is the best, so happy to see their work advertised here <3 Jacob is the best, so happy to see their work advertised here <3 CDJune 15, 2017 at 5:09 pmAHHH! Thank you so much for this! I’ve been desperate for menswear cut for AFAB bodies. The only place I knew was Wildfang and they are usually way out of my budget. Also trying to buy more from independent merchants just generally so this is a win-win.Loading...Reply to This Comment AHHH! Thank you so much for this! I’ve been desperate for menswear cut for AFAB bodies. The only place I knew was Wildfang and they are usually way out of my budget. Also trying to buy more from independent merchants just generally so this is a win-win. AHHH! Thank you so much for this! I’ve been desperate for menswear cut for AFAB bodies. The only place I knew was Wildfang and they are usually way out of my budget. Also trying to buy more from independent merchants just generally so this is a win-win. Dina WilsonJune 15, 2017 at 5:34 pmYou know, I’m a femme, but I’m not a hard one. And because I’m a femme, I don’t want to wear unisex T-shirts. Where are the pretty, women-cut, femme t-shirts?Loading...Reply to This CommentDarcyJune 15, 2017 at 6:28 pmThe Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else?Loading...Reply to This Comment You know, I’m a femme, but I’m not a hard one. And because I’m a femme, I don’t want to wear unisex T-shirts. Where are the pretty, women-cut, femme t-shirts? DarcyJune 15, 2017 at 6:28 pmThe Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else?Loading...Reply to This Comment The Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else? You know, I’m a femme, but I’m not a hard one. And because I’m a femme, I don’t want to wear unisex T-shirts. Where are the pretty, women-cut, femme t-shirts? DarcyJune 15, 2017 at 6:28 pmThe Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else?Loading...Reply to This Comment The Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else? The Lavender Menace shirt comes in a women’s cut, and AS has some others that do too, although they keep peskily selling out…check out the store, they normally have a scissoring one, a lazy femme one, can’t remember what else? Uruk-Hai_Groupie_1989June 15, 2017 at 7:42 pmThese are so great! I’m wearing the “wish you were queer” shirt right now!I’m also happy to learn about werk for pecs! Def donating to that.Loading...Reply to This Comment These are so great! I’m wearing the “wish you were queer” shirt right now! I’m also happy to learn about werk for pecs! Def donating to that. These are so great! I’m wearing the “wish you were queer” shirt right now! I’m also happy to learn about werk for pecs! Def donating to that. EmilyJune 16, 2017 at 12:31 ami really, really wish i had the guts to wear the vag sign shirt but i don’t know if i could just sit in class with that emblazoned across my chest.also it’s not queer-owned but my “america needs lesbian farmers” shirt from raygun just came in the mail and i’m absurdly excited about it.Loading...Reply to This Comment i really, really wish i had the guts to wear the vag sign shirt but i don’t know if i could just sit in class with that emblazoned across my chest.also it’s not queer-owned but my “america needs lesbian farmers” shirt from raygun just came in the mail and i’m absurdly excited about it. i really, really wish i had the guts to wear the vag sign shirt but i don’t know if i could just sit in class with that emblazoned across my chest.also it’s not queer-owned but my “america needs lesbian farmers” shirt from raygun just came in the mail and i’m absurdly excited about it. MeganJune 16, 2017 at 6:18 amGOT THE LAVENDER MENACE T SHIRT LAST WEEK!! Came in yesterday and I love it. SO soft!! Ah I wish this was posted a bit earlier so I could have seen some of these before pride. This compilation is incredible.Loading...Reply to This CommentCarmen SanDiegoJune 16, 2017 at 1:48 pmIt’s super softLoading...Reply to This Comment GOT THE LAVENDER MENACE T SHIRT LAST WEEK!! Came in yesterday and I love it. SO soft!! Ah I wish this was posted a bit earlier so I could have seen some of these before pride. This compilation is incredible. Carmen SanDiegoJune 16, 2017 at 1:48 pmIt’s super softLoading...Reply to This Comment It’s super soft GOT THE LAVENDER MENACE T SHIRT LAST WEEK!! Came in yesterday and I love it. SO soft!! Ah I wish this was posted a bit earlier so I could have seen some of these before pride. This compilation is incredible. Carmen SanDiegoJune 16, 2017 at 1:48 pmIt’s super softLoading...Reply to This Comment It’s super soft It’s super soft EmersonJune 16, 2017 at 1:52 pmCool, here’s my hat shop.https://www.etsy.com/shop/QueerBeaniesI’m low on stock right now because it’s pride month, obviously, but I’m knitting more as fast as my lil gay hands can go.Loading...Reply to This Comment Cool, here’s my hat shop.https://www.etsy.com/shop/QueerBeanies I’m low on stock right now because it’s pride month, obviously, but I’m knitting more as fast as my lil gay hands can go. Cool, here’s my hat shop.https://www.etsy.com/shop/QueerBeanies I’m low on stock right now because it’s pride month, obviously, but I’m knitting more as fast as my lil gay hands can go. Rachel W.June 17, 2017 at 6:20 amthat wish you were queer shirt made me smileLoading...Reply to This Comment that wish you were queer shirt made me smile that wish you were queer shirt made me smile Rad WhateverJune 17, 2017 at 11:12 amHere’s another line of queer-designed queer t-shirtshttp://www.amazon.com/Tukaho-e/b/ref=w_bl_sl_ap_ap_web_14627595011?ie=UTF8&node=14627595011&field-lbr_brands_browse-bin=Tukaho-eLoading...Reply to This Comment Here’s another line of queer-designed queer t-shirtshttp://www.amazon.com/Tukaho-e/b/ref=w_bl_sl_ap_ap_web_14627595011?ie=UTF8&node=14627595011&field-lbr_brands_browse-bin=Tukaho-e Here’s another line of queer-designed queer t-shirtshttp://www.amazon.com/Tukaho-e/b/ref=w_bl_sl_ap_ap_web_14627595011?ie=UTF8&node=14627595011&field-lbr_brands_browse-bin=Tukaho-e RynJune 21, 2017 at 1:09 pmThe Autostraddle store is better than ever but half the shirt styles only go up to a 2XL?? I love you guys but you need to find a better vendor, because that’s not fair to your fat readership. K thanks byeeeeeLoading...Reply to This CommentSarahJune 4, 2021 at 12:16 pmAgreed!Loading...Reply to This CommentabigailJune 1, 2022 at 10:55 amI know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :(Loading...Reply to This Comment The Autostraddle store is better than ever but half the shirt styles only go up to a 2XL?? I love you guys but you need to find a better vendor, because that’s not fair to your fat readership. K thanks byeeeee SarahJune 4, 2021 at 12:16 pmAgreed!Loading...Reply to This Comment Agreed! abigailJune 1, 2022 at 10:55 amI know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :(Loading...Reply to This Comment I know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :( The Autostraddle store is better than ever but half the shirt styles only go up to a 2XL?? I love you guys but you need to find a better vendor, because that’s not fair to your fat readership. K thanks byeeeee SarahJune 4, 2021 at 12:16 pmAgreed!Loading...Reply to This Comment Agreed! Agreed! abigailJune 1, 2022 at 10:55 amI know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :(Loading...Reply to This Comment I know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :( I know that it’s from 2018, but it’s disappointing to see dfrntpigeon’s pride crystals design lacking any sort of representation of the lesbian community :( BridgetApril 23, 2019 at 10:51 amWanted to share my new line here too!https://bridgetwoodbury.com/product-category/pride-2019/Loading...Reply to This Comment Wanted to share my new line here too! https://bridgetwoodbury.com/product-category/pride-2019/ Wanted to share my new line here too! https://bridgetwoodbury.com/product-category/pride-2019/ AlasseMay 23, 2019 at 12:25 amThank you for including an Australian creator in here! For once shipping costs may be less than the cost of the garment!Loading...Reply to This CommentRueJune 17, 2019 at 4:06 pmI know! And they have a couple of “DEADLY” shirts too! Good to seeLoading...Reply to This Comment Thank you for including an Australian creator in here! For once shipping costs may be less than the cost of the garment! RueJune 17, 2019 at 4:06 pmI know! And they have a couple of “DEADLY” shirts too! Good to seeLoading...Reply to This Comment I know! And they have a couple of “DEADLY” shirts too! Good to see Thank you for including an Australian creator in here! For once shipping costs may be less than the cost of the garment! RueJune 17, 2019 at 4:06 pmI know! And they have a couple of “DEADLY” shirts too! Good to seeLoading...Reply to This Comment I know! And they have a couple of “DEADLY” shirts too! Good to see I know! And they have a couple of “DEADLY” shirts too! Good to see RoseclueMay 26, 2019 at 4:29 pm/selfpromotion now that it’s pride time againCheck out my awesome queer art on Redbubble!https://www.redbubble.com/people/sgrangerGet $10 off your purchase if you’re a new customer on Redbubble!https://www.talkable.com/x/xX3AJhCheck out this new design I just put on my page! I would be thrilled to see someone wearing this at pride!https://www.redbubble.com/people/sgranger/works/39112051-rainbow-roses?p=pencil-skirt&ref=available_productsLoading...Reply to This Comment /selfpromotion now that it’s pride time again Check out my awesome queer art on Redbubble!https://www.redbubble.com/people/sgranger Get $10 off your purchase if you’re a new customer on Redbubble!https://www.talkable.com/x/xX3AJh Check out this new design I just put on my page! I would be thrilled to see someone wearing this at pride!https://www.redbubble.com/people/sgranger/works/39112051-rainbow-roses?p=pencil-skirt&ref=available_products /selfpromotion now that it’s pride time again Check out my awesome queer art on Redbubble!https://www.redbubble.com/people/sgranger Get $10 off your purchase if you’re a new customer on Redbubble!https://www.talkable.com/x/xX3AJh Check out this new design I just put on my page! I would be thrilled to see someone wearing this at pride!https://www.redbubble.com/people/sgranger/works/39112051-rainbow-roses?p=pencil-skirt&ref=available_products ValkyrieJune 17, 2019 at 12:56 pmHi! I sell large, acrylic laser cut earrings!I’m a queer maker, a budding small business and I will be donating a 50% of every of the pronoun earrings, “Be Gay, Do Crime”, and the new upcoming “Queer Magic” designs to the Trans Lifeline and the Transgender Law Center for the month of June and 10% all year long.https://www.etsy.com/shop/PickleKittenCoLoading...Reply to This CommentValkyrieJune 17, 2019 at 12:59 pmLoading...Reply to This Comment Hi! I sell large, acrylic laser cut earrings! I’m a queer maker, a budding small business and I will be donating a 50% of every of the pronoun earrings, “Be Gay, Do Crime”, and the new upcoming “Queer Magic” designs to the Trans Lifeline and the Transgender Law Center for the month of June and 10% all year long. https://www.etsy.com/shop/PickleKittenCo ValkyrieJune 17, 2019 at 12:59 pmLoading...Reply to This Comment Hi! I sell large, acrylic laser cut earrings! I’m a queer maker, a budding small business and I will be donating a 50% of every of the pronoun earrings, “Be Gay, Do Crime”, and the new upcoming “Queer Magic” designs to the Trans Lifeline and the Transgender Law Center for the month of June and 10% all year long. https://www.etsy.com/shop/PickleKittenCo ValkyrieJune 17, 2019 at 12:59 pmLoading...Reply to This Comment RoseEsqJune 17, 2019 at 4:48 pmThis is exactly the content I’ve been looking for. Thank you!!Loading...Reply to This Comment This is exactly the content I’ve been looking for. Thank you!! This is exactly the content I’ve been looking for. Thank you!! :)June 17, 2019 at 6:57 pmHere to confirm that Autostraddle’s “who all’s gay here” shirt is perfect for a hot Pride day and gets a solid share of compliments.Loading...Reply to This Comment Here to confirm that Autostraddle’s “who all’s gay here” shirt is perfect for a hot Pride day and gets a solid share of compliments. Here to confirm that Autostraddle’s “who all’s gay here” shirt is perfect for a hot Pride day and gets a solid share of compliments. AleciaJune 17, 2019 at 8:31 pmShameless self promotion as another queer lady in this graphic tee game.Femfatfun.com – everything available in sizes 4X-XS, not prices difference between sizes!Loading...Reply to This Comment Shameless self promotion as another queer lady in this graphic tee game. Femfatfun.com – everything available in sizes 4X-XS, not prices difference between sizes! Shameless self promotion as another queer lady in this graphic tee game. Femfatfun.com – everything available in sizes 4X-XS, not prices difference between sizes! J.L.June 18, 2019 at 4:57 amCheck out my queer owned Etsy shop. Lots of mugs with feminist and queer/pride themes.etsy.com/shop/swimmingturtleartThanks!Loading...Reply to This Comment Check out my queer owned Etsy shop. Lots of mugs with feminist and queer/pride themes.etsy.com/shop/swimmingturtleartThanks! Check out my queer owned Etsy shop. Lots of mugs with feminist and queer/pride themes.etsy.com/shop/swimmingturtleartThanks! neely22cJune 18, 2019 at 10:41 amBesides the point, but just want to take a moment to appreciate how ridiculously soft literally everything autostraddle makes is. I don’t know how y’all do it but it is incredible. Can confirm that it is helping me live my best/coziest/softest life.Loading...Reply to This Comment Besides the point, but just want to take a moment to appreciate how ridiculously soft literally everything autostraddle makes is. I don’t know how y’all do it but it is incredible. Can confirm that it is helping me live my best/coziest/softest life. Besides the point, but just want to take a moment to appreciate how ridiculously soft literally everything autostraddle makes is. I don’t know how y’all do it but it is incredible. Can confirm that it is helping me live my best/coziest/softest life. Marissa HJune 20, 2019 at 11:29 amI love this roundup!Loading...Reply to This Comment I love this roundup! I love this roundup! SylianneJune 2, 2021 at 12:07 pmJZD!!! I love their Bien Gay shirt.https://jenzeanodesigns.com/products/bien-gay-pride-teeThe shop is run by two wives in South Texas.Loading...Reply to This Comment JZD!!! I love their Bien Gay shirt.https://jenzeanodesigns.com/products/bien-gay-pride-tee The shop is run by two wives in South Texas. JZD!!! I love their Bien Gay shirt.https://jenzeanodesigns.com/products/bien-gay-pride-tee The shop is run by two wives in South Texas. MGJune 2, 2021 at 8:58 pmI also have an Etsy store with a whole section of pride wear!https://www.etsy.com/shop/GoodTroubleCafe?section_id=32397160Loading...Reply to This Comment I also have an Etsy store with a whole section of pride wear! https://www.etsy.com/shop/GoodTroubleCafe?section_id=32397160 I also have an Etsy store with a whole section of pride wear! https://www.etsy.com/shop/GoodTroubleCafe?section_id=32397160 KelbyJune 3, 2021 at 10:44 amI love this post but also hate it at the same time. See, I’m buying a new car in July so I told myself not to spend too much money in June. Then this post comes along to just laugh in my face.Loading...Reply to This Comment I love this post but also hate it at the same time. See, I’m buying a new car in July so I told myself not to spend too much money in June. Then this post comes along to just laugh in my face. I love this post but also hate it at the same time. See, I’m buying a new car in July so I told myself not to spend too much money in June. Then this post comes along to just laugh in my face. Corvin GreeneJune 3, 2021 at 5:32 pmBefore I click on all these links and then get disappointed, it would be super helpful to know which, if any, are size inclusive. It’s really hard to find ethically-made, cute Pride clothes in plus sizes.Loading...Reply to This CommentSarahJune 4, 2021 at 12:15 pmI was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sitesLoading...Reply to This Comment Before I click on all these links and then get disappointed, it would be super helpful to know which, if any, are size inclusive. It’s really hard to find ethically-made, cute Pride clothes in plus sizes. SarahJune 4, 2021 at 12:15 pmI was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sitesLoading...Reply to This Comment I was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sites Before I click on all these links and then get disappointed, it would be super helpful to know which, if any, are size inclusive. It’s really hard to find ethically-made, cute Pride clothes in plus sizes. SarahJune 4, 2021 at 12:15 pmI was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sitesLoading...Reply to This Comment I was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sites I was just going to make this comment! As a fat person, i know I will be so disappointed when visiting most of these sites forawhileJune 3, 2021 at 7:34 pmwow yall I was NOT planning on buying anything and then this Plants Against Gender Norms shirt happened and i’m broken!https://www.etsy.com/listing/888680503/plants-against-gender-norms-t-shirt?ref=shop_home_active_82&crt=1&variation0=1582586486&variation1=1582586474Loading...Reply to This Comment wow yall I was NOT planning on buying anything and then this Plants Against Gender Norms shirt happened and i’m broken!https://www.etsy.com/listing/888680503/plants-against-gender-norms-t-shirt?ref=shop_home_active_82&crt=1&variation0=1582586486&variation1=1582586474 wow yall I was NOT planning on buying anything and then this Plants Against Gender Norms shirt happened and i’m broken!https://www.etsy.com/listing/888680503/plants-against-gender-norms-t-shirt?ref=shop_home_active_82&crt=1&variation0=1582586486&variation1=1582586474 DinahJune 3, 2021 at 9:22 pmOkay, I know this post is about t-shirts (and I will be buying some) but what I *really* want is some kind of necklace with a sizable transgender pendant a la a 70’s style astrology necklace. Surely this must exist.Loading...Reply to This Comment Okay, I know this post is about t-shirts (and I will be buying some) but what I *really* want is some kind of necklace with a sizable transgender pendant a la a 70’s style astrology necklace. Surely this must exist. Okay, I know this post is about t-shirts (and I will be buying some) but what I *really* want is some kind of necklace with a sizable transgender pendant a la a 70’s style astrology necklace. Surely this must exist. RachelJune 4, 2021 at 9:23 amWow, I am the owner of Many Many Moons Ago and am so honored to see my shop on this list! Thank you so much for supporting the community. <3Loading...Reply to This Comment Wow, I am the owner of Many Many Moons Ago and am so honored to see my shop on this list! Thank you so much for supporting the community. <3 Wow, I am the owner of Many Many Moons Ago and am so honored to see my shop on this list! Thank you so much for supporting the community. <3 SarahJune 4, 2021 at 12:18 pmEchoing some other comments, but as a fat person i know that most of not all of these stores won’t carry my size! Let’s see some 3x – 6x optionsLoading...Reply to This CommentTara MarshallJune 5, 2022 at 5:40 pmHi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.comLoading...Reply to This Comment Echoing some other comments, but as a fat person i know that most of not all of these stores won’t carry my size! Let’s see some 3x – 6x options Tara MarshallJune 5, 2022 at 5:40 pmHi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.comLoading...Reply to This Comment Hi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.com Echoing some other comments, but as a fat person i know that most of not all of these stores won’t carry my size! Let’s see some 3x – 6x options Tara MarshallJune 5, 2022 at 5:40 pmHi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.comLoading...Reply to This Comment Hi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.com Hi Sarah, Umoja Threads Apparel carries up to 5X in most items! We also don’t charge more for some sizes. Our goal is to be body positive and inclusive in every way.http://www.umojathreads.com murJune 7, 2021 at 12:12 amYou forgot the T in “the Tegan & Sara foundation, which “fights for economic justice, health and representation for LGBQ girls and women.”” there buddyLoading...Reply to This Comment You forgot the T in “the Tegan & Sara foundation, which “fights for economic justice, health and representation for LGBQ girls and women.”” there buddy You forgot the T in “the Tegan & Sara foundation, which “fights for economic justice, health and representation for LGBQ girls and women.”” there buddy Elliot EvanJune 9, 2021 at 5:38 pmI also have a shop! I’m a gay trans guy using all the funds to pay for my top surgery :~)Biggaysoapshopco.Etsy.comLoading...Reply to This Comment I also have a shop! I’m a gay trans guy using all the funds to pay for my top surgery :~)Biggaysoapshopco.Etsy.com I also have a shop! I’m a gay trans guy using all the funds to pay for my top surgery :~)Biggaysoapshopco.Etsy.com TheSameInsideJune 12, 2021 at 10:20 amI LOVE this list! But you left one off!TheSameInside.comPronounced “same,” this logo was designed by a lesbian for all LGBTQ+ individuals and those who support them. We are all the same inside, regardless of who you are. We all just want to be happy and get the most out of life. The more that things change and evolve socially in our world, the more it will be realized we really are all the same. Thanks for pushing the movement forward Autostraddle. Sorry for the guerrilla style post but it seemed appropriate for the topic.Loading...Reply to This Comment I LOVE this list! But you left one off!TheSameInside.com Pronounced “same,” this logo was designed by a lesbian for all LGBTQ+ individuals and those who support them. We are all the same inside, regardless of who you are. We all just want to be happy and get the most out of life. The more that things change and evolve socially in our world, the more it will be realized we really are all the same. Thanks for pushing the movement forward Autostraddle. Sorry for the guerrilla style post but it seemed appropriate for the topic. I LOVE this list! But you left one off!TheSameInside.com Pronounced “same,” this logo was designed by a lesbian for all LGBTQ+ individuals and those who support them. We are all the same inside, regardless of who you are. We all just want to be happy and get the most out of life. The more that things change and evolve socially in our world, the more it will be realized we really are all the same. Thanks for pushing the movement forward Autostraddle. Sorry for the guerrilla style post but it seemed appropriate for the topic. MxFitz BrandJune 16, 2021 at 4:34 pmHow do I get my clothing brand on this list next year? 😬Black & Trans owned.Loading...Reply to This Comment How do I get my clothing brand on this list next year? 😬Black & Trans owned. How do I get my clothing brand on this list next year? 😬Black & Trans owned. JohnSeptember 22, 2021 at 7:09 pmHave a nice day.We are a fashion brand website:https://www.museslove.comWe are very interested in your page and hope to cooperate with your page.We have a lot of popular products of women fashion clothing,shoes,Accessories and so on .We can provide your customers super cost-effective products, and special discounts up to 50%-70%.We have in-depth cooperation with many influencers on Instagram, we have a lot of great discount deals, We believe your followers will love them very much.We also have a lot of business on Blogs websites and Facebook,Tiktok so on.What kind of cooperation do you have here?We sincerely hope to establish a long-term cooperative relationship with you and look forward to your positive response.Best WishJOHNLoading...Reply to This Comment Have a nice day.We are a fashion brand website:https://www.museslove.comWe are very interested in your page and hope to cooperate with your page.We have a lot of popular products of women fashion clothing,shoes,Accessories and so on .We can provide your customers super cost-effective products, and special discounts up to 50%-70%.We have in-depth cooperation with many influencers on Instagram, we have a lot of great discount deals, We believe your followers will love them very much.We also have a lot of business on Blogs websites and Facebook,Tiktok so on.What kind of cooperation do you have here?We sincerely hope to establish a long-term cooperative relationship with you and look forward to your positive response. Best WishJOHN Have a nice day.We are a fashion brand website:https://www.museslove.comWe are very interested in your page and hope to cooperate with your page.We have a lot of popular products of women fashion clothing,shoes,Accessories and so on .We can provide your customers super cost-effective products, and special discounts up to 50%-70%.We have in-depth cooperation with many influencers on Instagram, we have a lot of great discount deals, We believe your followers will love them very much.We also have a lot of business on Blogs websites and Facebook,Tiktok so on.What kind of cooperation do you have here?We sincerely hope to establish a long-term cooperative relationship with you and look forward to your positive response. Best WishJOHN Beefcake PicsNovember 5, 2021 at 6:36 amIt’s not Pride specific, but my gay & bi men’s t-shirt store athttp://www.sauceshirts.comhas a couple of Pride shirts and a whole load more.Loading...Reply to This Comment It’s not Pride specific, but my gay & bi men’s t-shirt store athttp://www.sauceshirts.comhas a couple of Pride shirts and a whole load more. It’s not Pride specific, but my gay & bi men’s t-shirt store athttp://www.sauceshirts.comhas a couple of Pride shirts and a whole load more. Tara Marshall-HillJune 5, 2022 at 5:53 pmUmoja Threads Apparel Company™ is gender expansive fashion brand with the LGBTQ+ BIPOC communities in mind, and streetwear/athleisure designed for all bodies.Founded by Black queer couple, Tara Marshall-Hill and Mo Hill, Umoja Threads™ is the answer to their frustration at being unable to find apparel that celebrated our Blackness *and* celebrated our identities as a cis female lesbian and non-binary person. The Black pride apparel companies ignore us, and we found it difficult to find apparel that fit our style at stores that carried mostly LGBTQ+ apparel.* We are vehemently inclusive! ALL sizes are the SAME price, and we carry up to 5X in most styles.* We also have an incredible number of designs for every style and every identity.We’re having a ton of flash sales throughout Pride month and would love to see you all come through!!!Loading...Reply to This Comment Umoja Threads Apparel Company™ is gender expansive fashion brand with the LGBTQ+ BIPOC communities in mind, and streetwear/athleisure designed for all bodies. Founded by Black queer couple, Tara Marshall-Hill and Mo Hill, Umoja Threads™ is the answer to their frustration at being unable to find apparel that celebrated our Blackness *and* celebrated our identities as a cis female lesbian and non-binary person. The Black pride apparel companies ignore us, and we found it difficult to find apparel that fit our style at stores that carried mostly LGBTQ+ apparel. * We are vehemently inclusive! ALL sizes are the SAME price, and we carry up to 5X in most styles.* We also have an incredible number of designs for every style and every identity. We’re having a ton of flash sales throughout Pride month and would love to see you all come through!!! Umoja Threads Apparel Company™ is gender expansive fashion brand with the LGBTQ+ BIPOC communities in mind, and streetwear/athleisure designed for all bodies. Founded by Black queer couple, Tara Marshall-Hill and Mo Hill, Umoja Threads™ is the answer to their frustration at being unable to find apparel that celebrated our Blackness *and* celebrated our identities as a cis female lesbian and non-binary person. The Black pride apparel companies ignore us, and we found it difficult to find apparel that fit our style at stores that carried mostly LGBTQ+ apparel. * We are vehemently inclusive! ALL sizes are the SAME price, and we carry up to 5X in most styles.* We also have an incredible number of designs for every style and every identity. We’re having a ton of flash sales throughout Pride month and would love to see you all come through!!! KellyJune 9, 2022 at 11:41 amQuite Nice has an amazing shirt right now! It is a boxy fit cropped pocket tee that says “Quite Queer” on the front + “Queers are natural leaders, you’re following one”.The shirts are from For Days (100% circular!!!) and screen printed locally in Oakland, CA.Check it out here!!:https://quiteniceshop.com/products/quite-queers-90s-recycled-t-shirtLoading...Reply to This Comment Quite Nice has an amazing shirt right now! It is a boxy fit cropped pocket tee that says “Quite Queer” on the front + “Queers are natural leaders, you’re following one”. The shirts are from For Days (100% circular!!!) and screen printed locally in Oakland, CA. Check it out here!!:https://quiteniceshop.com/products/quite-queers-90s-recycled-t-shirt Quite Nice has an amazing shirt right now! It is a boxy fit cropped pocket tee that says “Quite Queer” on the front + “Queers are natural leaders, you’re following one”. The shirts are from For Days (100% circular!!!) and screen printed locally in Oakland, CA. Check it out here!!:https://quiteniceshop.com/products/quite-queers-90s-recycled-t-shirt EmilyJune 10, 2022 at 6:17 amHiya everyone, I started my outdoors-inspired sustainable clothing brand recently and have had my Pride tees on sale since the beginning, since I don’t believe Pride is for one month of the year!If you’d care to check them out I’d be thrilled –https://arborlow.co/collection/logo-tees/Thanks and happy Pride!Loading...Reply to This Comment Hiya everyone, I started my outdoors-inspired sustainable clothing brand recently and have had my Pride tees on sale since the beginning, since I don’t believe Pride is for one month of the year! If you’d care to check them out I’d be thrilled –https://arborlow.co/collection/logo-tees/ Thanks and happy Pride! Hiya everyone, I started my outdoors-inspired sustainable clothing brand recently and have had my Pride tees on sale since the beginning, since I don’t believe Pride is for one month of the year! If you’d care to check them out I’d be thrilled –https://arborlow.co/collection/logo-tees/ Thanks and happy Pride! Softs32AppsJune 13, 2022 at 12:53 amHello Dear, I love your site. Many thanks for the shared this informative and interesting post with us.tuneskit ios system recovery keygeneasybcd download crackedenscape student license key crackLoading...Reply to This Comment Hello Dear, I love your site. Many thanks for the shared this informative and interesting post with us.tuneskit ios system recovery keygeneasybcd download crackedenscape student license key crack Hello Dear, I love your site. Many thanks for the shared this informative and interesting post with us.tuneskit ios system recovery keygeneasybcd download crackedenscape student license key crack 실시간 카지노July 26, 2022 at 8:34 pm“Only one race inhabits this earth, Homo Sapiens. And it is unique and undivided,” chief rabbi Robert Fröhlich commented.Loading...Reply to This Comment “Only one race inhabits this earth, Homo Sapiens. And it is unique and undivided,” chief rabbi Robert Fröhlich commented. “Only one race inhabits this earth, Homo Sapiens. And it is unique and undivided,” chief rabbi Robert Fröhlich commented. GregAugust 7, 2022 at 11:36 amTrying to raise some money selling some unique designs on etsy at my Pride Blossoms shop to pay for recent cancer treatment. Been made to feel bad because I am a accused of exploiting the community. Not sure how. I am a designer. Most of these are my copyrighted and unique designs (except for the flag teeshirts of course).Loading...Reply to This Comment Trying to raise some money selling some unique designs on etsy at my Pride Blossoms shop to pay for recent cancer treatment. Been made to feel bad because I am a accused of exploiting the community. Not sure how. I am a designer. Most of these are my copyrighted and unique designs (except for the flag teeshirts of course). Trying to raise some money selling some unique designs on etsy at my Pride Blossoms shop to pay for recent cancer treatment. Been made to feel bad because I am a accused of exploiting the community. Not sure how. I am a designer. Most of these are my copyrighted and unique designs (except for the flag teeshirts of course). LauraLaurieFebruary 3, 2023 at 2:29 pmAnother addition to the list:https://skinsteem.com/. Their tees are on the decadent-futurist-vintage-queer side. Hard to explain. Better check by yourselves :PLoading...Reply to This Comment Another addition to the list:https://skinsteem.com/. Their tees are on the decadent-futurist-vintage-queer side. Hard to explain. Better check by yourselves :P Another addition to the list:https://skinsteem.com/. Their tees are on the decadent-futurist-vintage-queer side. Hard to explain. Better check by yourselves :P iNoblex.comFebruary 15, 2023 at 2:15 amInstagram us @inoblexco if you guys need a discount code for this years pride!!!! DM us, we are ready for pride this June! Get ready for all the month of June!Loading...Reply to This Comment Instagram us @inoblexco if you guys need a discount code for this years pride!!!! DM us, we are ready for pride this June! Get ready for all the month of June! Instagram us @inoblexco if you guys need a discount code for this years pride!!!! DM us, we are ready for pride this June! Get ready for all the month of June! isabelMarch 4, 2023 at 8:17 pmI design tshirts & hats that reference queer history / the queer archive! ie. classified ads from the fall 1986 edition of On Our Backs magazine, pretty hot <3 feeling-space.com/shop/tops/classifieds ~ everything is made in LA!Loading...Reply to This Comment I design tshirts & hats that reference queer history / the queer archive! ie. classified ads from the fall 1986 edition of On Our Backs magazine, pretty hot <3 feeling-space.com/shop/tops/classifieds ~ everything is made in LA! I design tshirts & hats that reference queer history / the queer archive! ie. classified ads from the fall 1986 edition of On Our Backs magazine, pretty hot <3 feeling-space.com/shop/tops/classifieds ~ everything is made in LA! LucaJune 10, 2023 at 12:02 amlove this list, thank you! I especially love the Lockwood51 and Gbee Studios designs, yum.thought I’d share a few of my personal favourite queer t-shirt makers that I didn’t see featured here:Mars Wright –https://marswright.com/collections/shirts-1the Gender Reveal Podcast (usually I find merch pretty boring, but they have some fun designs) –https://gender-reveal.creator-spring.com/unisex-men-s-t-shirtsBothAnd – they make mostly plain t-shirts but hey, what better way to celebrate pride than to wear a t-shirt that fits you really really really wellLoading...Reply to This Comment love this list, thank you! I especially love the Lockwood51 and Gbee Studios designs, yum. thought I’d share a few of my personal favourite queer t-shirt makers that I didn’t see featured here: Mars Wright –https://marswright.com/collections/shirts-1 the Gender Reveal Podcast (usually I find merch pretty boring, but they have some fun designs) –https://gender-reveal.creator-spring.com/unisex-men-s-t-shirts BothAnd – they make mostly plain t-shirts but hey, what better way to celebrate pride than to wear a t-shirt that fits you really really really well love this list, thank you! I especially love the Lockwood51 and Gbee Studios designs, yum. thought I’d share a few of my personal favourite queer t-shirt makers that I didn’t see featured here: Mars Wright –https://marswright.com/collections/shirts-1 the Gender Reveal Podcast (usually I find merch pretty boring, but they have some fun designs) –https://gender-reveal.creator-spring.com/unisex-men-s-t-shirts BothAnd – they make mostly plain t-shirts but hey, what better way to celebrate pride than to wear a t-shirt that fits you really really really well LucaJune 10, 2023 at 1:32 amoh and one i forgot was Ezra Michel’s apparel, it’s called PussyBoy –https://www.pussyboyapparel.com/shopalllLoading...Reply to This Comment oh and one i forgot was Ezra Michel’s apparel, it’s called PussyBoy –https://www.pussyboyapparel.com/shopalll oh and one i forgot was Ezra Michel’s apparel, it’s called PussyBoy –https://www.pussyboyapparel.com/shopalll HannahJune 10, 2023 at 4:21 amI look forward to this list every year!!!! Time to drain my bank account!!!Loading...Reply to This Comment I look forward to this list every year!!!! Time to drain my bank account!!! I look forward to this list every year!!!! Time to drain my bank account!!! DidiJune 10, 2023 at 6:39 pmJust opened so many tabs. Gonna find me a tee. Thank youalso I’d recommend “THERE Skateboards”.Its a really talented, sweet group queer of skateboarders. They have really great hand drawn art on tehir clothes and boards.Loading...Reply to This Comment Just opened so many tabs. Gonna find me a tee. Thank you also I’d recommend “THERE Skateboards”.Its a really talented, sweet group queer of skateboarders. They have really great hand drawn art on tehir clothes and boards. Just opened so many tabs. Gonna find me a tee. Thank you also I’d recommend “THERE Skateboards”.Its a really talented, sweet group queer of skateboarders. They have really great hand drawn art on tehir clothes and boards. LuJune 12, 2023 at 2:30 amHeads up, the link in the copy for Haute Butch is broken.Thanks for doing this mammoth task every year!Loading...Reply to This Comment Heads up, the link in the copy for Haute Butch is broken. Thanks for doing this mammoth task every year! Heads up, the link in the copy for Haute Butch is broken. Thanks for doing this mammoth task every year! LucaAugust 5, 2023 at 2:10 amanother shop that makes cute queer tees which I recently came across and thought should be included! saw Gabe wearing their tee on the JBU youtube channel –https://www.makemygaycommunity.com/Loading...Reply to This Comment another shop that makes cute queer tees which I recently came across and thought should be included! saw Gabe wearing their tee on the JBU youtube channel –https://www.makemygaycommunity.com/ another shop that makes cute queer tees which I recently came across and thought should be included! saw Gabe wearing their tee on the JBU youtube channel –https://www.makemygaycommunity.com/ MoonAugust 21, 2023 at 1:20 amNot to be missed: MACHINEhttps://instagram.com/hellomachine?igshid=MzRlODBiNWFlZA==Loading...Reply to This Comment Not to be missed: MACHINE https://instagram.com/hellomachine?igshid=MzRlODBiNWFlZA== Not to be missed: MACHINE https://instagram.com/hellomachine?igshid=MzRlODBiNWFlZA== KatieRainyDayJune 6, 2024 at 11:19 amGlad to see this list back again, absolutely going to buy some! (That But I’m A Cheerleader tee…)To clarify, you said you weren’t having any more things in the Autostraddle shop. Are you going to stop making all your wonderful designs now you’ve merged???!Loading...Reply to This CommentRieseJune 6, 2024 at 1:41 pmwe’re gonna eventually be bringing some of the more popular ones over to the For Them store!Loading...Reply to This CommentKatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment Glad to see this list back again, absolutely going to buy some! (That But I’m A Cheerleader tee…) To clarify, you said you weren’t having any more things in the Autostraddle shop. Are you going to stop making all your wonderful designs now you’ve merged???! RieseJune 6, 2024 at 1:41 pmwe’re gonna eventually be bringing some of the more popular ones over to the For Them store!Loading...Reply to This CommentKatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment we’re gonna eventually be bringing some of the more popular ones over to the For Them store! KatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment Oh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting) Glad to see this list back again, absolutely going to buy some! (That But I’m A Cheerleader tee…) To clarify, you said you weren’t having any more things in the Autostraddle shop. Are you going to stop making all your wonderful designs now you’ve merged???! RieseJune 6, 2024 at 1:41 pmwe’re gonna eventually be bringing some of the more popular ones over to the For Them store!Loading...Reply to This CommentKatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment we’re gonna eventually be bringing some of the more popular ones over to the For Them store! KatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment Oh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting) we’re gonna eventually be bringing some of the more popular ones over to the For Them store! KatieRainyDayJune 6, 2024 at 2:19 pmOh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting)Loading...Reply to This Comment Oh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting) Oh phew! That’s a relief, I was worried I wouldn’t be able to re-up my Lavender Menace tee or Lesberado (please keep both!) when my current ones goes to the t-shirt equivalent of the nice farm upstate (being turned into sleeveless muscle tanks for allotmenting) Aro/Ace WLW Who’d Like More RepJune 6, 2024 at 2:18 pmFor my fellow Aromantic and/or Asexual WLW looking for aro/ace specific pride merch, there are four shops on this list that carry aro/ace items! Those are:Queer GearMany Many MoonsSabor a LibertadSouth Street Art MartRebirthLoading...Reply to This Comment For my fellow Aromantic and/or Asexual WLW looking for aro/ace specific pride merch, there are four shops on this list that carry aro/ace items! Those are: Queer GearMany Many MoonsSabor a LibertadSouth Street Art MartRebirth For my fellow Aromantic and/or Asexual WLW looking for aro/ace specific pride merch, there are four shops on this list that carry aro/ace items! Those are: Queer GearMany Many MoonsSabor a LibertadSouth Street Art MartRebirth maxJune 8, 2024 at 9:04 amgreat article but i think there may be a typo! MegemikoArt’s blurb says that they “implore you to protest trans kids” which….doesn’t sound exactly right.Loading...Reply to This Comment great article but i think there may be a typo! MegemikoArt’s blurb says that they “implore you to protest trans kids” which….doesn’t sound exactly right. great article but i think there may be a typo! MegemikoArt’s blurb says that they “implore you to protest trans kids” which….doesn’t sound exactly right. MonstersJune 9, 2024 at 1:10 amsuch a good list!i have a line of crop tops that are colorful, surreal illustrations of sweet monsters & fantastical landscapes.http://shop.monstersoftheunderworld.comall queer madesizes xs-5xlLoading...Reply to This Comment such a good list! i have a line of crop tops that are colorful, surreal illustrations of sweet monsters & fantastical landscapes.http://shop.monstersoftheunderworld.comall queer madesizes xs-5xl such a good list! i have a line of crop tops that are colorful, surreal illustrations of sweet monsters & fantastical landscapes.http://shop.monstersoftheunderworld.comall queer madesizes xs-5xl johnJuly 4, 2024 at 11:55 pmSupporting LGBTQ-owned businesses this Pride season by purchasing their unique t-shirts not only celebrates diversity but also supports the community directly. Amidst evolving trends and challenges, these businesses offer more than just rainbow designs, promoting social justice through their apparel. Let’s empower these indie creators and their originality!Loading...Reply to This Comment Supporting LGBTQ-owned businesses this Pride season by purchasing their unique t-shirts not only celebrates diversity but also supports the community directly. Amidst evolving trends and challenges, these businesses offer more than just rainbow designs, promoting social justice through their apparel. Let’s empower these indie creators and their originality! Supporting LGBTQ-owned businesses this Pride season by purchasing their unique t-shirts not only celebrates diversity but also supports the community directly. Amidst evolving trends and challenges, these businesses offer more than just rainbow designs, promoting social justice through their apparel. Let’s empower these indie creators and their originality! **Contribute to the conversation...Cancel reply** Yay! You've decided to leave a comment. That's fantastic. Please keep in mind that comments are moderated by the guidelines laid out in ourcomment policy. Let's have a personal and meaningful conversation and thanks for stopping by! Comment* Name* Email* Website Δ **From the Archives** Kristin Chenoweth is Popular and Possibly Perfect: The Auto-Interview Give It Time, Delphine “RuPaul’s Drag Race” 1408 Episode Recap: Is This What I Get For Loving Ru? **Latest Comments** CIt’s Okay, We Don’t Need Fletcher To Sing About Girls\"Yes, and it’s something I’ve noticed happens a lot in marginalised communities – this policing of other community members’ behaviour…\" KadyIt’s Okay, We Don’t Need Fletcher To Sing About Girls\"Hi! It’s not biphobic to have preferences. Thank you for your name-calling though ❤️\" CIt’s Okay, We Don’t Need Fletcher To Sing About Girls\"To my understanding Fletcher was predominantly dating women for a decade. She was also never out as a lesbian, she…\" RieseIt’s Okay, We Don’t Need Fletcher To Sing About Girls\"oh yeah, definitely it is, 100% what i meant was more the entire paragraph, where she’s like, i was caught…\" **Latest Posts** We Watched Bravo’s New Show About Gen Z Nepo Babies in NYC and Wow Turns Out There’s One Thing We All Have in Common (Mommy Issues) Breaking Up Is Hard To Do No Filter: Doechii Brought the Swamp To DC Pride Thailand’s First Out Trans Diplomat Is Changing the Perception of What Thai Trans Women Can Do Mini Crossword Is Watching the ‘Night Shift’ Music Video Again **Our Network** Store For Them **About Us** What is AS? Meet The Team Press Advertise Contact Us Write for Us Cookie Policy Privacy Policy **Follow Us** Twitter Facebook Pinterest Tumblr Instagram RSS Copyright 2009 - 2025 The Excitant Group, LLC. All Rights Reserved. Comment Policy **** **** ****"}