{"id": 1513, "name": "UN Watch", "domain": "unwatch.org", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://unwatch.org/contempt-for-colonna-unrwa-leaders-continue-to-promote-terrorism-presented-to-parliament-of-the-netherlands-the-hague-20-june-2024/", "title": "Contempt For Colonna Unrwa Leaders Continue To Promote Terrorism Presented To Parliament Of The Netherlands The Hague 20 June 2024", "content": "About UsOur WorkMission & HistoryChairman: Alfred H. MosesExecutive Director: Hillel NeuerFounder: Morris B. AbramCareersCurrent OpeningsInternships Our Work Mission & History Chairman: Alfred H. Moses Executive Director: Hillel Neuer Founder: Morris B. Abram CareersCurrent OpeningsInternships Current Openings Internships Our Work Mission & History Chairman: Alfred H. Moses Executive Director: Hillel Neuer Founder: Morris B. Abram CareersCurrent OpeningsInternships Current Openings Internships Current Openings Internships MediaLatest NewsPress ReleasesIn the News Latest News Press Releases In the News Latest News Press Releases In the News IsraelThe Case Against UNRWAFrancesca AlbaneseItem 7The Pillay CommissionDurban Racism Conferences The Case Against UNRWA Francesca Albanese Item 7 The Pillay Commission Durban Racism Conferences The Case Against UNRWA Francesca Albanese Item 7 The Pillay Commission Durban Racism Conferences Human RightsOur SpeakersSpotlightsIranRussiaChinaCountriesGeneva Summit Our Speakers SpotlightsIranRussiaChina Iran Russia China Countries Geneva Summit Our Speakers SpotlightsIranRussiaChina Iran Russia China Iran Russia China Countries Geneva Summit ResourcesReportsCartoonsPodcastsUN Watch DatabaseVideos Reports Cartoons Podcasts UN Watch Database Videos Reports Cartoons Podcasts UN Watch Database Videos Take Action Donate Contact About UsOur WorkMission & HistoryChairman: Alfred H. MosesExecutive Director: Hillel NeuerFounder: Morris B. AbramCareersCurrent OpeningsInternships Our Work Mission & History Chairman: Alfred H. Moses Executive Director: Hillel Neuer Founder: Morris B. Abram CareersCurrent OpeningsInternships Current Openings Internships Our Work Mission & History Chairman: Alfred H. Moses Executive Director: Hillel Neuer Founder: Morris B. Abram CareersCurrent OpeningsInternships Current Openings Internships Current Openings Internships MediaLatest NewsPress ReleasesIn the News Latest News Press Releases In the News Latest News Press Releases In the News IsraelThe Case Against UNRWAFrancesca AlbaneseItem 7The Pillay CommissionDurban Racism Conferences The Case Against UNRWA Francesca Albanese Item 7 The Pillay Commission Durban Racism Conferences The Case Against UNRWA Francesca Albanese Item 7 The Pillay Commission Durban Racism Conferences Human RightsOur SpeakersSpotlightsIranRussiaChinaCountriesGeneva Summit Our Speakers SpotlightsIranRussiaChina Iran Russia China Countries Geneva Summit Our Speakers SpotlightsIranRussiaChina Iran Russia China Iran Russia China Countries Geneva Summit ResourcesReportsCartoonsPodcastsUN Watch DatabaseVideos Reports Cartoons Podcasts UN Watch Database Videos Reports Cartoons Podcasts UN Watch Database Videos Take Action Donate Contact **The Case of Fathi Sharif: Head of UNRWA Teachers Union is Hamas Terror Chief** June 20, 2024 Israel,United Nations Fathi al-Sharif,pinned,UNRWA,UNRWA report Presented to Parliament of the NetherlandsThe Hague, 20 June 2024 **I. Despite Promising to Implement Colonna Reforms, UNRWA in Gross Violation of Neutrality Obligations** As documented below, UNRWA is in gross breach of the neutrality commitments that it recently made to donor countries in order for them to reinstate funding, including the agency’s promise to implement all of the findings of the April 2024Colonna Report.Dutch aid minister Liesje Schreinemachertold parliamentin April that the Netherlands would not renew funding to UNRWA unless it implements the Colonna Report’s recommendations. In light of UNRWA’s handling of the al-Sharif case, which is documented below, we urge the Netherlands not to resume funding to UNRWA. Despite UNRWA knowing for more than a decade thatthe head of its teachers union in Lebanon, Fathi al-Sharif (a.k.a. Fateh “Abo Amin” al-Sharif), overseeing 39,000 students in 65 schools, is part of Hamas and an overt promoter of terrorism, the agency is refusing to fire him. UNRWA chief Lazzarini initiated an external review of UNRWA in mid-January 2024 in response to revelations about the agency’s terror ties, including a 3,000-member UNRWA staff Telegram group and the participation of at least 12 UNRWA employees in the October 7 Hamas attack. The mandate of that review, headed by former French Foreign Minister Catherine Colonna, was to “conduct an independent review of mechanisms and procedures to ensure adherence by UNRWA to the humanitarian principle of neutrality.” The Colonna Review Group published its final report, containing 50 separate recommendations, on April 20, 2024. This was immediately followed by acommitmentfrom UNRWA to implement the report, and a cascade of donorsagreeingto renew funding. Separate and apart from UNRWA’s commitments under the Colonna Report, UNRWA is also bound byUN&UNRWAstaff regulations on neutrality (SeeColonna Report p. 18), the UNRWACode of Ethics(newly updated in February 2024), and commitments to other donors. Both UN and UNRWA regulations require staff to “avoid any action and in particular any kind of public pronouncement which may adversely reflect on their status, or on the integrity, independence and impartiality which are required by that status.” The Code of Ethics further explains that UNRWA employees should “not take sides in situations of armed conflict, public controversies or other political, racial, religious, or ideological disputes.” The Code of Ethics is also clear that “attending demonstrations … that are political or could become politicized” or “displaying controversial flags or symbols, or holding political meetings or religious services in UNRWA installations” all constitute neutrality breaches. Regarding specific donor commitments, we note that when the European Commission announced on March 1 that it would allocate an additional 68 Million Euro to UNRWA, ithighlightedUNRWA’s commitments to (1) review its staff to make sure they did not participate in October 7, (2) launch an audit by EU appointed external experts to review UNRWA controls to prevent involvement of staff in terrorist activities, and (3) strengthen its department of internal investigations. It also welcomed the Colonna review which would “assess whether the Agency is doing everything within its power to ensure neutrality and respond to allegations of serious breaches.” Likewise, even though the U.S. funding freeze has been extended until March 2025, $121 million had already beentransferredto UNRWA by the end of January 2024, and UNRWA is still bound by its commitments in its2023-24 Framework Agreementwith the U.S. These include, (1) addressing neutrality violations in line with UNRWA’s neutrality framework, including prompt and transparent disciplinary proceedings for staff violations, (2) ensuring U.S. assistance is not used to aid a refugee “who is receiving military training as a member of the so-called Palestinian Liberation Army, or any guerilla-type organization or anyone who has engaged in any act of terrorism,” and (3) to ensure that U.S. funding “does not provide assistance to, or otherwise support, terrorists or terrorist organizations.” UNRWA’s handling of the Al-Sharif case breaches all of these obligations and commitments. 1. Staff union politicization & support for Hamas.The Colonna report expressly found that UNRWA staff unions are “politicized” and “have sometimes resisted management disciplinary actions, including on neutrality” (p. 32). This is clear from past cases where the staff unions rallied behind teachers who had been suspended for neutrality violations connected to terrorism. In 2011, when UNRWA principal/Hamas member Suhail al-Hindi was suspended for his Hamas activities, the Gaza staff union protested for three months until al-Hindi returned to work. The next year, al-Hindi waselectedhead of that staff union. Indeed, Hamas hascontrolledthe UNRWA Gaza staff union for years. In 2023, when teacher Riad Nimr was suspended for posting support for terrorism on Facebook, the Lebanon staff union orchestrated three weeks of protests until Nimr was returned to work. The same politicization marks the months of protests on behalf of Fateh al-Sharif who heads the UNRWA Lebanon staff union, is a principal in the UNRWA Deir Yassin school, and is also an active member of Hamas. Like with Suhail al-Hindi and Riad Nimr, the UNRWA Lebanon staff union led more than two months of protests, including school strikes across Lebanon, forced UNRWA’s Beirut headquarters to shutdown, and threatened UNRWA’s Lebanon Director Dorothy Klaus, accusing her of blackmailing al-Sharif, until UNRWA Chief Phillipe Lazzarini finally caved to the pressure. Clearly UNRWA has not dealt with the issue of politicization among its staff unions. 2. Hamas-linked unions threaten management.The Colonna report also found that UNRWA’s staff unions have used “intimidation tactics and threats” to force “numerous UNRWA directors to be transferred to different positions and contexts for their own security” (p. 32). As detailed below, in the context of the Al-Sharif rallies, the Lebanon teachers’ union issued a statement that UNRWA Lebanon Director Dorothy Klaus was “playing with fire,” accused her of “blackmail,” and created a large banner depicting Klaus with a big red X on her face which was displayed behind al-Sharif when he addressed one of the rallies. The Al-Sharif protests were also backed by a coalition of terrorists which likewise threatened UNRWA, accusing Klaus of doing Israel’s bidding, and saying she had crossed “all red lines” and was “ignit[ing] fire with [her] own hands to destroy UNRWA.” As in the past, UNRWA allowed itself to be threatened and succumbed to the pressure. Lazzarini even met and negotiated with the terrorists. The Al-Sharif case shows that nothing has changed at UNRWA in this regard. 3. Gross violation of neutrality obligations under UN & UNRWA Regulations and ethics code.While UNRWA did suspend al-Sharif in February 2024, al-Sharif’s current status is unclear. The reports discussed below indicate that UNRWA suspended al-Sharif and asked for his resignation, but that he refused. According to the Palestinian Refugees Portal website, Lazzariniagreedto cancel the suspension in exchange for ending the UNRWA strike that was paralyzing UNRWA’s operations in Lebanon. The Colonna Report recommended UNRWA to “strengthen disciplinary processes across the agency” (p. 24). UNRWA’s handling of the al-Sharif case reflects the opposite. As detailed below, the evidence is overwhelming that al-Sharif and his UNRWA colleagues in Lebanon grossly breached their neutrality obligations and that al-Sharif should have been fired long ago. Al-Sharif is a member of Hamas.As shown below, Al-Sharif has attended Hamas events, rallies, and funerals, always appearing near the Hamas leadership. Key Hamas leaders attended his son’s wedding, including Ahmad Abd Al-Hadi who justtolda Lebanese newspaper that if Hamas could go back in time, it would still commit the October 7 attack. It is not accidental that a person like al-Sharif who is closely associated with Hamas heads the UNRWA Lebanon teachers’ union. This is exactly the same modus operandi seen with Suhail al-Hindi in Gaza in 2011-12. This alone constitutes a breach of neutrality. Al-Sharif is a member of Hamas.As shown below, Al-Sharif has attended Hamas events, rallies, and funerals, always appearing near the Hamas leadership. Key Hamas leaders attended his son’s wedding, including Ahmad Abd Al-Hadi who justtolda Lebanese newspaper that if Hamas could go back in time, it would still commit the October 7 attack. It is not accidental that a person like al-Sharif who is closely associated with Hamas heads the UNRWA Lebanon teachers’ union. This is exactly the same modus operandi seen with Suhail al-Hindi in Gaza in 2011-12. This alone constitutes a breach of neutrality. Al-Sharif is a member of Hamas.As shown below, Al-Sharif has attended Hamas events, rallies, and funerals, always appearing near the Hamas leadership. Key Hamas leaders attended his son’s wedding, including Ahmad Abd Al-Hadi who justtolda Lebanese newspaper that if Hamas could go back in time, it would still commit the October 7 attack. It is not accidental that a person like al-Sharif who is closely associated with Hamas heads the UNRWA Lebanon teachers’ union. This is exactly the same modus operandi seen with Suhail al-Hindi in Gaza in 2011-12. This alone constitutes a breach of neutrality. Al-Sharif openly supports terrorism on Facebook.A quick glance at Al-Sharif’sFacebook page, which has4,000 friends, shows that he openly supports Hamas and other terrorist groups in breach of UN & UNRWA regulations and the UNRWA Code of Ethics. For example, on October 7, al-Sharif praised the Hamas attacks, proclaiming “God is the greatest, God is the greatest…” On July 2, 2019, he praised Hamas leader Hassan Youssef as a “firm leader,” adding “we are all proud of you.” On November 21, 2021, he celebrated Hamas terrorist Fadi Abu Shkhidem with the words “our blood creates victory” after Abu Shkhidem was killed carrying out a terrorist attack that killed one and injured four. On November 23, 2023, Al-Sharif also endorsed Hamas’s hostage-taking as a strategy to get convicted Palestinian terrorists released from Israeli jails. These are just some examples of many. Al-Sharif openly supports terrorism on Facebook.A quick glance at Al-Sharif’sFacebook page, which has4,000 friends, shows that he openly supports Hamas and other terrorist groups in breach of UN & UNRWA regulations and the UNRWA Code of Ethics. For example, on October 7, al-Sharif praised the Hamas attacks, proclaiming “God is the greatest, God is the greatest…” On July 2, 2019, he praised Hamas leader Hassan Youssef as a “firm leader,” adding “we are all proud of you.” On November 21, 2021, he celebrated Hamas terrorist Fadi Abu Shkhidem with the words “our blood creates victory” after Abu Shkhidem was killed carrying out a terrorist attack that killed one and injured four. On November 23, 2023, Al-Sharif also endorsed Hamas’s hostage-taking as a strategy to get convicted Palestinian terrorists released from Israeli jails. These are just some examples of many. Al-Sharif openly supports terrorism on Facebook.A quick glance at Al-Sharif’sFacebook page, which has4,000 friends, shows that he openly supports Hamas and other terrorist groups in breach of UN & UNRWA regulations and the UNRWA Code of Ethics. For example, on October 7, al-Sharif praised the Hamas attacks, proclaiming “God is the greatest, God is the greatest…” On July 2, 2019, he praised Hamas leader Hassan Youssef as a “firm leader,” adding “we are all proud of you.” On November 21, 2021, he celebrated Hamas terrorist Fadi Abu Shkhidem with the words “our blood creates victory” after Abu Shkhidem was killed carrying out a terrorist attack that killed one and injured four. On November 23, 2023, Al-Sharif also endorsed Hamas’s hostage-taking as a strategy to get convicted Palestinian terrorists released from Israeli jails. These are just some examples of many. Organizes politicized student protests on UNRWA premises.As detailed below, Al-Sharif proudly boasts on Facebook about the many political rallies he organized for his students in UNRWA camps and facilities, including within school grounds, clearly violating UNRWA’s Code of Ethics. At one of these rallies, a student is seen holding a Hamas flag. Organizes politicized student protests on UNRWA premises.As detailed below, Al-Sharif proudly boasts on Facebook about the many political rallies he organized for his students in UNRWA camps and facilities, including within school grounds, clearly violating UNRWA’s Code of Ethics. At one of these rallies, a student is seen holding a Hamas flag. Organizes politicized student protests on UNRWA premises.As detailed below, Al-Sharif proudly boasts on Facebook about the many political rallies he organized for his students in UNRWA camps and facilities, including within school grounds, clearly violating UNRWA’s Code of Ethics. At one of these rallies, a student is seen holding a Hamas flag. UNRWA knew about al-Sharif’s terror support for years but took no action.Al-Sharif’s 4,000 Facebook friends include many UNRWA teachers. As shown below, his posts supporting Hamas are often liked by his UNRWA teacher friends. A February 28, 2015 post endorsing violent resistance as “an honor” was liked by several UNRWA employees. Likewise, his July 2, 2019 post praising Hamas leader Hassam Youssef was also liked by several UNRWA employees. As far back as 2013, al-Sharif had endorsed the kidnapping and murder of an Israeli soldier, writing “resistance” “by all means” is “our right.” Al-Sharif’s support for, and association with, Hamas was no secret. Everyone at UNRWA knew about this. UNRWA knew about al-Sharif’s terror support for years but took no action.Al-Sharif’s 4,000 Facebook friends include many UNRWA teachers. As shown below, his posts supporting Hamas are often liked by his UNRWA teacher friends. A February 28, 2015 post endorsing violent resistance as “an honor” was liked by several UNRWA employees. Likewise, his July 2, 2019 post praising Hamas leader Hassam Youssef was also liked by several UNRWA employees. As far back as 2013, al-Sharif had endorsed the kidnapping and murder of an Israeli soldier, writing “resistance” “by all means” is “our right.” Al-Sharif’s support for, and association with, Hamas was no secret. Everyone at UNRWA knew about this. UNRWA knew about al-Sharif’s terror support for years but took no action.Al-Sharif’s 4,000 Facebook friends include many UNRWA teachers. As shown below, his posts supporting Hamas are often liked by his UNRWA teacher friends. A February 28, 2015 post endorsing violent resistance as “an honor” was liked by several UNRWA employees. Likewise, his July 2, 2019 post praising Hamas leader Hassam Youssef was also liked by several UNRWA employees. As far back as 2013, al-Sharif had endorsed the kidnapping and murder of an Israeli soldier, writing “resistance” “by all means” is “our right.” Al-Sharif’s support for, and association with, Hamas was no secret. Everyone at UNRWA knew about this. Instead of Firing al-Sharif, UNRWA awarded al-Sharif a Certificate of Excellence.Yet, not only did UNRWA take no action against al-Sharif, it awarded him with a Certificate of Excellence in October 2019. Instead of Firing al-Sharif, UNRWA awarded al-Sharif a Certificate of Excellence.Yet, not only did UNRWA take no action against al-Sharif, it awarded him with a Certificate of Excellence in October 2019. Instead of Firing al-Sharif, UNRWA awarded al-Sharif a Certificate of Excellence.Yet, not only did UNRWA take no action against al-Sharif, it awarded him with a Certificate of Excellence in October 2019. Other UNRWA Lebanon employees are in gross breach of neutrality.Aside from al-Sharif, many other UNRWA Lebanon employees have been implicated in neutrality violations and should be investigated and disciplined. At a minimum, these include all of the UNRWA employees that clicked like on al-Sharif’s hateful Facebook posts and all of the UNRWA Lebanon employees – some 2,000 – that have been participating in the strikes in support of al-Sharif, shutting down UNRWA services, and demanding that al-Sharif be reinstated. Other UNRWA Lebanon employees are in gross breach of neutrality.Aside from al-Sharif, many other UNRWA Lebanon employees have been implicated in neutrality violations and should be investigated and disciplined. At a minimum, these include all of the UNRWA employees that clicked like on al-Sharif’s hateful Facebook posts and all of the UNRWA Lebanon employees – some 2,000 – that have been participating in the strikes in support of al-Sharif, shutting down UNRWA services, and demanding that al-Sharif be reinstated. Other UNRWA Lebanon employees are in gross breach of neutrality.Aside from al-Sharif, many other UNRWA Lebanon employees have been implicated in neutrality violations and should be investigated and disciplined. At a minimum, these include all of the UNRWA employees that clicked like on al-Sharif’s hateful Facebook posts and all of the UNRWA Lebanon employees – some 2,000 – that have been participating in the strikes in support of al-Sharif, shutting down UNRWA services, and demanding that al-Sharif be reinstated. 4.Breach of commitment to EU in exchange for funding.When the EU announced 68 million Euros of funding to UNRWA on March 1, it specifically commended the fact that the Colonna Review was going to “assess whether the Agency is doing everything within its power to ensure neutrality and respond to allegations of serious breaches.” However, the Al-Sharif case shows that UNRWA is not doing everything in its power to ensure neutrality, as Hamas-member al-Sharif appears to still be employed by UNRWA and to head the UNRWA Lebanon teachers’ union. 5.Gross violations of commitments to U.S.UNRWA received $121 million from the U.S. in 2024. Pursuant to UNRWA’s framework for cooperation agreement with the U.S., UNRWA must conduct prompt and transparent disciplinary proceedings for staff violations. The proceedings against al-Sharif have been neither prompt nor transparent, as UNRWA has refused to publicly clarify al-Sharif’s current employment status. Moreover, UNRWA is to ensure that funding does not go to support any refugee who has received military training from a terrorist organization, or to support terrorism. Not enough is known about al-Sharif’s Hamas activities to ascertain whether these provisions have been breached, but UNRWA should be conducting a full investigation about al-Sharif’s Hamas ties and activities and publicize its findings. **** **II.Dorothy Klaus Suspends Al-Sharif For Colonna Review, But Refuses to Fire Him** In the wake of October 7th, UNRWA premises in Lebanon experienced months of political protests and fundraising campaigns related to the war in Gaza at thebehestof the UNRWA Teachers Staff Union. This includedorganizinga “national open day” at all UNRWA schools where students and teachers were required to “wear the Palestinian Kofiya, wear black clothes and raise the Palestinian flag,” and shed “light on the right of our people to resist the occupier according to a planned program, calling on the student forces and parents of students to organize angry demonstrations that go round the streets of camps and cheer for Palestine, Aqsa, prisoners and martyrs.” Protests like these continued unchecked for months, in clear violation of UNRWA neutrality rules, and paralyzed the UNRWA school system in Lebanon. UNRWA took action only in February 2024 because of the public scrutiny it was facing after its largest donors had suspended funding over severe neutrality breaches by UNRWA staff and the Lazzarini appointed the external review led by Catherine Colonna to assess UNRWA’s compliance with neutrality. These developments prompted UNRWA Lebanon Director Dorothy Klaus tosummonseveral UNRWA school principals who had been leading the disruptive political activities, warning them that they were in violation of UNRWA neutrality and that they would have to resign if they refused to comply. Despite the warnings from Klaus, the disruptive political activities on UNRWA premises in Lebanon continued. Therefore, on February 26, KlaussummonedFateh al-Sharif, one of the protest leaders who is also the principal of UNRWA’s Deir Yassin High School and head of the UNRWA Lebanon teachers’ union, and informed him that he had until March 2 to resign or face an investigation for his political activities on UNRWA premises. When al-Sharif declined to resign, Commissioner General Philippe Lazzarini sent him anemailconfirming his suspension for three months for “political activities violating neutrality.” In addition to being a leader of the post-October 7th protests in UNRWA facilities, Al-Sharif is also a Hamas member. He has attended Hamas events, rallies, and funerals, always appearing near the Hamas leadership. For example, in December 2021, Al-Sharifparticipatedin the funeral of three Hamas members who had been killed by the Palestinian Authority. Heeulogizedthe Hamas members as “our martyrs” and “men of high importance” and wished “curses upon those who killed them,” referring to the PA forces.As noted above, key Hamas leaders attended al-Sharif’s son’s wedding. Al-Sharif also has close personal ties with other terrorists. In June 2023, al-Sharifmournedthe death of his friendSheikh Haitham Abdul Karim Al-Saadi(“Abu Tariq”), deputy emir of theAsbat al-Ansar— designated as a terrorist organization by the U.S., UK, Canada, the UN, and others — whom he referred to as his “honorable brothers.” **** **III.UNRWA Union and Terrorist Groups Unite to Threaten UNRWA Officials** Al-Sharif’s suspension provoked significant backlash. The UNRWA Lebanon teachers’ union quicklyissued“Statement No. 1,” characterizing the suspension as an “existential threat,” “blackmail,” and a “declaration of war,” while praising al-Sharif’s reputation as a union leader, as well as al-Sharif’s leadership in hiring hundreds of UNRWA teachers. “Whoever does not know who “Fateh Amin Sharif” is among his people, let him know that he is a man the size of a nation, and whoever dares to blackmail this important person is blackmailing our Palestinian people in Lebanon from the far north to the far south. Neither UNRWA nor any framework in this world, no matter how high its status, can blackmail us with our patriotism, thought, and belonging to our beloved land” “[Klaus] is playing with fire and an existential war in which only the owners of the land and the cause will remain,” indicating that “neither the UNRWA agency nor any framework in this world, no matter how high its status, can blackmail us.” Palestinian terrorist groups such asHamas, through its Office of Refugee Affairs, and the PFLP defended al-Sharif, framing UNRWA’s actions as an attack on Palestinian national identity — “the national affiliation of our people’s employees is a red line that we do not allow to be crossed.” Subsequently, a coalition of Palestinian terrorist groups, including the Palestinian Forces Alliance, the Popular Front for the Liberation of Palestine (PFLP), the Democratic Front (DFLP), the Islamic Forces, civil committees, representatives of the Palestine Scholars Council and Association, the Houthis, and the Popular Committees made a “declaration of conflict and administrative disobedience” with UNRWA. These groups made it clear that the PLO and PA were not welcomed as part of the coalition. They imposed a nationwide strike in 62 UNRWA schools affecting 36,000 children, proclaiming this as a warning that would escalate if the decision was not reversed. The protests also forced the shutdown of UNRWA’s Beirut headquarters. This terrorist coalition also made direct threats to UNRWA Lebanon Director Dorothy Klaus insinuating that she was working with Zionist forces despite Klaus’s adamant stance that she was only trying to reassure donor states. In onestatementthe coalition asked: “In whose interest will the file of accountability for intellectual and political affiliation be activated at this time? Who is the instigator of this? For whose benefit does this new terrorism practice against specific intellectual and political trends under the pretext of supporting donor countries? Are the Director General, her team, and those who incited her able to bear the consequences of this new and dangerous trend.” In a joint letter, the coalitionwrote: “The UNRWA administration in Lebanon, represented by its Director General, Mrs. Dorothy Klaus, crosses all red lines and ignites fire with its own hands to destroy UNRWA, in complement and harmony with the malicious projects that aim to liquidate the issue.” “The Palestinian political forces are determined to wage the confrontation until the end so as not to repeat the rosary and threaten employees with dismissal as a sword drawn over their necks under the pretext of violating “neutrality,” which means stripping national affiliation in favor of the job or stopping financial funding for “UNRWA,” considering that the political forces refuse. UNRWA’s attempts to classify employees, distinguish between them, and threaten them, stressing that the threat of employees by the agency’s director in Lebanon, Dorothy Klaus, is a tampering with the social security and civil stability of the Palestinian community in Lebanon…” In thepicturebelow, Fateh al-Sharif is seen delivering a speech in front of the UNRWA HQ in Beirut with a banner featuring Dorothy Klaus with a red X over her face.The secondpictureis the posters put up by the student forces of Klaus. In anotherstatement, the coalition threatened to equate the UNRWA administration with enemies of the “resistance” unless UNRWA reverses its decision: The UNRWA administration warned against targeting any of our people’s employees, and we will place them in line with the malicious projects that target our people and their resistance…” Philippe Lazzarini’s deputy, Antonia De Meo, further fueled the tension bysuggestingthat the agency could transfer its services to a Palestinian administration, causing an uproar among Palestinians who insist UNRWA must continue to exist until their right of return is realized. The DFLP’s Relief Agency Department expressed its rejection of De Meo’s proposal,statingthat it “contradicts the decision to establish UNRWA which links its existence to the end of the reason for which it was established” — the “reason” being the creation of the State of Israel — and that the Palestinian Authority is not a substitute for UNRWA. For more than two months, al-Sharif, student leaders, and leaders of this terrorist coalition coordinated protests across UNRWA premises. A student associationvowedto escalate its measures if the administration did not meet their demands: “We denounce this unjust decision and demand that the UNRWA administration reverse it. Otherwise, we in the student forces and Palestinian youth organizations in Lebanon will proceed to take escalatory measures in all regions and gradually if the administration does not respond to our legitimate demand…” In early March, Al-Sharifspokein front of a student march in the Al-Bass camp, where Deir Yassin High School is located, asserting that he has not resigned and will not change his position or stop his activities. Al-Sharif said: “The job was never a goal, and it will never humiliate us, nor will it make us give up our rights, our dignity, and our pride. I said it, and I say it, and I repeat it, that our affiliation to Palestine, to our people, to Gaza, to the West Bank, and to all of Palestine, is a religious affiliation, and there is no going back from it.” Member of the Popular Committee of Ain al-Hilweh Camp, Adnan al-Rifai, told onenews sourcethat it is impossible to expect UNRWA employees to be neutral: “This neutrality, as UNRWA wants, means attacking the Palestinian national situation. How is it possible for the employee to remain a spectator to the slaughter of his people?” How can he remain neutral? It’s dangerous. The Palestinian employee is a local employee, not an international employee. How can they want him to be neutral, when he is at the mercy of the Palestinian people and lives with their suffering, poverty, misery, and deprivation?” He went on to add that if the situation is not reversed they would escalate and forcibly prevent Klaus from entering the camp. **** **IV.UNRWA Caves to Terrorists Demands** UNRWA caved in to the terrorists’ demands. First, itblamed donorsfor the actions it had taken against al-Sharif, stating “donor countries will not support UNRWA if the administration does not take such measures against him [Al-Sharif] and other employees.” UNRWA explained that it is not enforcing its own neutrality policies because it wants to abide by these rules, but rather that it is being forced to do so in order for states to have cover to appease their own constituencies so that they can continue funding the agency. Next, Lazzarini attempted to further distance UNRWA from the actions against al-Sharif byexplainingthat “the decision is carried out by the Department of Internal Oversight Services, based on reports about alleged activities carried out by the employee that violate the agency’s regulatory framework.” These explanations did not dissuade the terrorist coalition from continuing the protests. Strike leadersarguedthat similar measures had been imposed on other teachers in the past, including Professors Ahmed Meyari, Ziad Abdel Ghani, and Ahmed Nimr Mustafa in 2023, and Muhammad Khalil Abu Arab in 2022, but these teachers were all ultimately reinstated after widespread protests pressuring UNRWA management. Therefore, they insisted on continuing the pressure campaign with regard to al-Sharif. Once again the terrorist coalition was able to successfully apply this strategy in the Al-Sharif case. OnMay 27th, Lazzarini traveled to Beruit where he met with the terrorist leaders in a meeting mediated by Lebanese Prime Minister Najib Mikati. One of the terrorist leaders who spoke at this meeting was none other than Hamas Lebanon representative Ahmad Abd Al-Hadi who justendorsedHamas’s October 7 attack.At the meeting, Lazzarini conceded to the terrorist coalition’s demands andreportedlyagreed to reinstate al-Sharif in exchange for getting the UNRWA Beirut headquarters reopened. In doing so, Lazzarini contravened his commitment to donors to implement the Colonna Report’s findings and recommendations from just one month earlier. Will UNRWA’s top officials finally acknowledge that they are not in control of their staff and therefore are unable to implement the Colonna Report as promised? No, instead it appears that the administration is attempting to cover up this story while it continues business as usual. Also importantly, who really is Fateh al-Sharif and how did he manage to gain the support of terrorist groups and even the Lebanese prime minister? What prompted UNRWA to suspend him in the first place? **** **V. Examples of Al-Sharif’s connections and support for Hamas and other terrorists** Following are only a few of al-Sharif’s countless publicFacebookposts, and pictures of him from Hamas accounts, making it clear why an entire coalition of terrorist groups rallied behind him these past few months, shutting down UNRWA operations in Lebanon.In his posts, al-Sharif celebrates the October 7th massacre, shares pictures of himself organizing political rallies for his UNRWA students, celebrates the killing of Israelis, states that resistance “by all means” is a “right,” glorifies various terrorists, and encourages teachers to disseminate maps that erase Israel.In turn, these posts promoting terrorism and the elimination of Israel were liked and shared by numerous other UNRWA employees. However, UNRWA has failed to fire any of these employees who violate the agency’s rules on “neutrality.” BELOW: October 19, 2023pictureof al-Sharif sitting in front row at a Hamas event among its leadership in Lebanon.In the first picture below, al-Sharif is seen sitting with his arms crossed, as the Hamas chief political officer in Lebanon, Ahmed Abdul-Hadi,addressed the crowd one week after October 7th, to celebrate the “martyrdom” ofthree Hamas terrorists— Ahmed Osama Othman and Yahya Nayef Abdel Razek from Ain al-Hilweh camp, and Suhaib Omar Kayed from Wadi al-Zeina — who were killed while attempting toinfiltrate from Lebanoninto the northern Israeli community of Moshav Margaliot. “We have very strong relations with Hezbollah. We were cooperating with Hezbollah before the attack on Israel and after and now we are in full cooperation,” Abdul-Haditold Politicothe day before. “They are saying they are geared for a major war.”Asked about the October 7th massacre, Abdul-Hadi recentlydeclared: “If we could go back in time, we would do it again.” This event was publicized by a Hamas-affiliatednewschannel that publishes pictures of other Hamas events in the same location featuring children training to be terrorists: On the same day that this Hamas-linked account showed UNRWA official al-Sharif attending the Hamas event eulogizing the terrorists, it alsoshowed related photosof “Distributing sweets in Wadi Al-Zeina in the joy of our martyr,Saheb Omar Kaid, may Allah have mercy on him.” Hamas was celebratinga local “martyr”from the town, one ofthree Al Qassam terroristskilled on October 13, 2023 while attempting toinfiltrateinto Israel from Lebanon near the northern town of Margaliot. The account continued to announce events celebrating the Hamas terrorist, “Our hero martyr, Saheb Omar Kaid,” including a “victory seminar” in honor of the terrorist, the video of which was postedhere. The terrorist was also honored at anApril 1, 2024 eventby the Islamic Association of Palestine Students, a pro-Hamas youth group that was one of many associations mobilized to pressure UNRWA into backing down from requesting al-Sharif’s resignation. Pictureof al-Sharif at a Hamas funeral on December 18, 2021: January 19, 2024photo of al-Sharif at another Hamas funeral for Walid Ahmed Hassanein. Pictureof al-Sharif attending a Hamas rally in Al-Bass Camp on October 13, 2023 insupportof Hamas’ Oct 7 attack: Al-Sharif appears inphotosamong the Hamas organizers of the rally which includes Hamas spokesman in Lebanon Jihad Taha. OnJune 24, 2020,top officials from Hamas and other terrorist organizations attended the engagement party of Fateh al-Sharif’s son, Ibrahim Fateh Sharif. This is al-Sharif and his two sons embracing Sheikh Haitham Abdul Karim Al-Saadi “Abu Tariq”, deputy emir of the terrorist group Islamic Ansar League. Here is al-Sharif and his son Ibrahim with Hamas Spokesman, Jihad Taha between them. Here is al-Sharif with the Public Relations Officer for Hamas in Lebanon Dr. Ayman Shana and Hamas’ UNRWA lobbyist Hajj Abu Hussam Zuaiter. Here is al-Sharif with Hamas representatives Ahmad Abd Al-Hadi and Ali Baraka. Ali Baraka is a senior Hamas official who oversees the group’s foreign relations. He was one of 8 Hamas officialssanctionedby the US and UK after October 7th for perpetuating the massacre. Baraka hasclaimedthat Hamas has been planning October 7th for two years and has beenvocalin his support for the taking of hostages. OnFebruary 1, 2019, top Hamas officials also attended the engagement of Fateh al-Sharif’s other son, Amin Fateh Sharif. The Hamas trio of Ahmad Abd Al-Hadi, Jihad Taha, and Abdul Majeed Al-Awad who appear multiple times with al-Sharif have been hosted as the official representatives of Hamas in Lebanon at a series of meetings, including with the Ambassadors ofIran,Russia,Qatar,Turkey,Algeria,Indonesia,CubaandVenezuela. They have also been hosted by Lebanese officials including the Minister of LaborMustafa Bayram, and the former prime minister of Lebanon,Hassan Diab. They have also represented Hamas in meetings with the officials ofHezbollah,Islamic Jihad, andal-Jamaa al-Islamiya. Finally, they have also been interviewed as Hamas representatives byal-JazeeraandNewsweekwhere Al-Hadi once stated, “We coordinated with Hezbollah and with Iran before, during, and after this battle at the highest levels” concerning the October 7th attacks. In at leastone meetingwith the Russian Ambassador,onewith the Venezuelan Ambassador, andanotherwith the terrorist group al-Jamaa al-Islamiya the topic of discussion was how to pressure UNRWA. Inonemeeting with the Vice-President of the Supreme Islamic Shiite Council, Sheikh Ali al-Khatib, the trio conveyed greetings from Hamas leader Ismail Haniyeh, and inanothermeeting, Al-Hadi relayed a message from Haniyeh to Nasrallah through Hezbollah’s liaison. Jihad Taha andAhmad Abd Al-Hadi have also been involved in UNWRA demonstrations before. OnJanuary 23, 2016,both can be seen holding a banner in front of UNRWA headquarters in Beirut protesting changes to UNRWA’s health policies. OnMarch 29, 2018al-Sharif organized an event with Hamas to honor the teachers in the Al-Bass Camp and oppose the Deal of the Century. Hamas’ political and media relations officer Abdul Majeed Al-Awad told teachers “that this day is the day of insistence on liberating every speck of dirt from Palestine, and our Palestinian people have proven with their blood that we are the legitimate owners of the land, and the occupiers are the alien strangers.” He went on to add that, “we must all stand in one row to confront the deal of the century, stressing that the greatest response to the deal is the return marches, working to unify and strengthen the Palestinian ranks, and agreeing on a unified strategy based on the option of confrontation and resistance.” In effect, al-Sharif is collaborating with Hamas to ensure teachers are implementing the Hamas philosophy of violent resistance in their classrooms. June 3, 2023pictureof al-Sharif withSheikh Haitham Abdul Karim Al-Saadi “Abu Tariq”, deputy emir of theUN-designatedterrorist groupIslamic Ansar League whom he describes in the post as “my honorable brothers”: July 2, 2019postpraising Hamas“firm leader”Hassan Youssef: This post is liked by several UNRWA teachers and his deputy: June 4, 2024posthonoring “brother” Hamas member Abu Jihad Radwan Deeb. Seen below at his funeral adorned with a Hamas headscarf, and in an earlier photo carrying a child with a weapon next to the casket of Hamas terrorist Walid Ahmed Hassanein: Al-Sharif proudly boasts on Facebook about the many political rallies he organized for his students in UNRWA camps and facilities, including within school grounds. Below is a selection of photos from Al-Sharif’s Facebook page. In onephoto, a student is seen holding a Hamas flag: December 18, 2021postglorifies three Hamas members who werekilled by the PA: In the post, al-Sharif wishes curses upon the PA while celebrating the Hamas members as “men of importance” and “protector of the book of Allah.” : December 17, 2021postpraises Hamas terrorist Hussein Al-Ahmed: This post was liked by UNRWA teachers: January 3, 2024postmeeting with the sons of deceased Hamas leaders who “arewalking on their [fathers’] path”: Abu Amer Fendiwas the leader of Hamas operations in southern Lebanon andAbu Khaled Al-Khharazwas the deputy commander of the Al-Qassam Brigades in Lebanon. The above post was liked and commented on by UNRWA teachers: November 23, 2023postendorses Hamas’s hostage-taking strategy when by thanking Hamas for freeing convicted terroristIsraa Jaabiswho, in 2015, detonated a bomb injuring an Israeli police officer. She was released as part of the November 2023 deal for the release of Israeli hostages held by Hamas in exchange for Palestinian prisoners in Israeli jails. November 26, 2023postcelebrating Hamas’ achievement of setting Palestinian prisoners free in the hostage release deal: February 16, 2024postvenerates “old union friend” andPFLP member, Muhammad Dheeb Al-Jadoua, as a “father,” “teacher,” and “friend”: November 21, 2021postcelebrates Hamas terrorist Fadi Abu Shkhidem as a “martyr” after he was killed in the course of committing a terroristattackin Jerusalem killing one and injuring four others. The text on the photo reads “our blood creates victory,” which is an endorsement of violent terrorism: March 25, 2021postcommemorating West Bank Hamas leader Omar Barghouti (aka Abu Assif Barghouti) who had just died, while also referring to his sonSaleh Barghouti, as a “martyr.” Saleh was a Hamas terrorist who hadshot and injuredseven Israeli civilians at a bus stop in December 2018, including a pregnant woman whose baby later died: Posts celebrating October 7th: [1][2][3][4][5] July 25, 2023postencourages teachers to disseminate map erasing Israel. Accompanying text laments Israel’s creation which resulted in the area not “remain[ing] Palestine” and hopes for “return”: March 31, 2024postcalling on the spy that reported him to UNWRA administration to “die in disgust”: April 6, 2024postendorsing Hamas, referred to as “the resistance”: Full translation: “The resistance of our people will certainly be victorious, God willing, despite the failure of those who are negligent and the conspiracy of the conspirators. God is victorious over His command, and victory is only from God.” As far back as September 21, 2013, al-Sharif had apostcelebrating thekidnap and murderof an Israeli soldier in which he says “resistance” by “all means” is “our right”: May 13, 2018postcalling for a return to Jerusalem through “resistance, liberation, and return”: February 28, 2015postendorsing violent resistance, proclaiming that it is not terrorism, it is an honor: This post was liked by several UNRWA teachers: One week later onMarch 6, 2015,al-Sharif reaffirmed his position by stating that “accusing the honorable resistance of terrorism is a disgrace…” May 2, 2023posteulogizingKhader Adnan, a senior leader of the Palestinian Islamic Jihad terror group: September 6, 2021postscelebratingtheGilboa Prison break, where six Palestinian prisoners, including the former leader of al-Aqsa Martyrs’ Brigades in Jenin, escaped from Israeli detention through tunnels. Al-Sharif had five posts supporting this escape. OnSeptember 26, 2022, al-Sharif eulogized Yusuf Al-Qaradawi, a head of the Muslim Brotherhood who is mainlyknownas the key figure in shaping the concept of violent jihad. OnMay 23, 2021, al-Sharif praised his unity withAbu Ali Mustafa, who served as the former General Secretary of the terrorist organization Popular Front for the Liberation of Palestine. OnMay 14, 2021al-Sharif eulogized Mohammed Tahan, a Hezbollah terrorist who was killed attempting to infiltrate Israel to become a martyr. He is described by his family as “consumed by the idea of becoming a martyr — of fulfilling the destiny laid out for him since he was born.” His entire family is affiliated with Hezbollah. About his death, Tahan’s fatherstated“I wouldn’t expect anything less from him… My children are the same as well. Even my daughter, when she was little, wanted to have a plastic gun, just like her brothers. For us, freeing Palestine is tantamount to an obligatory prayer…We were raised to take the road to Jerusalem.” To top it all off here is Fateh’s certificate of appreciation from UNRWA for his contribution to “enhancing the school community to guarantee a better future for Palestine refugee children” **Share** **Recent** **Background to June 2025 UN Conference on Two-State Solution** **China, Russia, Turkey Win Seats On UN Organ Overseeing Human Rights** **Francesca Albanese’s Eight Worst Statements of Hate in May 2025** **Francesca Albanese Finally Admits: “I’m not a lawyer”** **Hillel Neuer on Sydney Radio: UN Must Remove Tom Fletcher After Scandalous Blood Libel** **Hillel Neuer on Sky News Australia: Shocking Lies About Israel Have Real Consequences** **Your Voice at the United Nations** UN Watch is a non-profit organization dedicated to holding the United Nations accountable to its founding principles. UN Watch is funded entirely by charitable donations **Keep in touch** **Support** **Copyright © 2014–2024. UN Watch | Your voice at the UN.** **Privacy Statement** To provide the best experiences, we use technologies like cookies to store and/or access device information. Not consenting or withdrawing consent, may adversely affect certain features and functions."}