{"id": 1853, "name": "WXQW - 660 AM - Mobile", "domain": "660wxqw.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.660wxqw.com/news/us-companies-warn-of-multibillion-dollar-setbacks-amid-trade-war/", "title": "Us Companies Warn Of Multibillion Dollar Setbacks Amid Trade War", "content": "Shows CommunityEventsResources Events Resources Events Resources InformationAdvertise With UsConnect with WXQWWeather Advertise With Us Connect with WXQW Weather Advertise With Us Connect with WXQW Weather NewsU.S. NewsPolitical NewsWorld newsFinance newsNational NewsEntertainment NewsHeadline NewsBusiness NewsOdd NewsHealth News U.S. News Political News World news Finance news National News Entertainment News Headline News Business News Odd News Health News U.S. News Political News World news Finance news National News Entertainment News Headline News Business News Odd News Health News Sweet Deals Advertising SPONSORS **US Companies Warn of Multibillion-Dollar Setbacks Amid Trade War** American companies are voicing concern over the escalating tariffs issued by the Trump administration to China. The Hill reported that American companies are warning of multibillion-dollar losses and deep uncertainty. United Airlines issued two separate financial outlooks, citing the unpredictable nature of the current economic climate. The company said it was “impossible to predict” whether the U.S. could slide into a recession as a result of the ongoing reciprocal tariffs. Johnson & Johnson CEO Joaquin Duato voiced his concern over the potential for new tariffs on pharmaceuticals, warning that such measures could disrupt the medical supply chain. Read more at Newsmax© 2025 Newsmax. All rights reserved. **Headlines** Privacy Policy Terms of Service General Contest Rules Station Information WXQW Public File Employment Opportunities Cumulus Media Corporate Advertise With Us FCC Applications Equal Employment Opportunity Records Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}