{"id": 2010, "name": "Jewish Breaking News", "domain": "jewishbreakingnews.com", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://jewishbreakingnews.com/watch-argentinas-president-milei-visits-western-wall-meets-netanyahu-will-meet-hostage-families-and-demand-hamas-release-remaining-hostages/", "title": "Watch Argentinas President Milei Visits Western Wall Meets Netanyahu Will Meet Hostage Families And Demand Hamas Release Remaining Hostages", "content": "Disclaimer Privacy Advertise Contact Us Join us on WhatsApp Join JBN+ Featured Israel & The Middle East Jewish World Politics Culture & Lifestyle Videos **LATEST NEWS** **WATCH: Argentina’s President Milei Visits Western Wall, Meets Netanyahu, Will Meet Hostage Families and Demand Hamas Release Remaining Hostages** **Jewish Breaking News** Argentine President Javier Milei arrived in Israel this week on a highly symbolic trip, reaffirming his country’s steadfast support for the Jewish state and calling for the immediate release of Argentine hostages held by Hamas. Milei’s visit began with a prayer at the Western Wall in Jerusalem—his second since taking office—before he met Israeli President Isaac Herzog and later, Prime Minister Benjamin Netanyahu. In a joint statement with Herzog, Milei reiterated his unwavering support for Israel amid global criticism of its ongoing military operations in Gaza and the humanitarian crisis in the strip. View this post on InstagramA post shared by Jewish Breaking News (@jewishbreakingnews) A post shared by Jewish Breaking News (@jewishbreakingnews) A post shared by Jewish Breaking News (@jewishbreakingnews) “Friendship between our two states and people is a diplomatic pillar of our administration,” Milei said. “As a nation, we want to stand firm beside you as you transit these dark days.” Milei, accompanied by Karina Milei, declared that the fight against terrorism “brings together” Argentina and Israel. He praised Israel as “a beacon of light that shines over the path to freedom and the commitment to civilization” for refusing to “cowardly surrender” to Hamas. He also highlighted the suffering of Argentines during the October 7 Hamas attack, which killed 27 Argentine citizens and led to 21 being taken hostage—four of whom, Eitan Horn, Ariel and David Cunio, and Lior Rudaeff, are still held in Gaza. Milei forcefully demanded their release and is scheduled to meet with relatives of kidnapped Argentines, showing solidarity and empathy. In his meeting with Prime Minister Netanyahu, Milei presented a heartfelt gift: a photograph of himself and the Lubavitcher Rebbe. The exchange was steeped in personal reflection and shared values. Netanyahu reminisced, “You know, the Lubavitcher Rebbe told me that when you go to the UN—a house of lies and darkness—if you light a single candle, people can see the truth from afar.” Milei responded, “If you check out my speech at the UN, it has a lot of what the Rebbe told you.” Netanyahu added, “He was like a prophet, and he had laser blue eyes. He was so clear and prophetic.” Milei’s show of solidarity comes as Israel faces increasing international pressure. Top EU diplomats have accused Israel of exceeding self-defense in Gaza. French President Emmanuel Macron recently described Israel’s blockade on humanitarian aid as “a disgrace” and renewed calls for a ceasefire. Despite such criticism, Milei made clear his government’s unflinching support, stating Argentina would stand “firm beside” Israel through these challenging times. Milei also emphasized the importance of truth and resilience, echoing the Rebbe’s teachings about lighting a candle in the darkness, a message he incorporated into his own recent speech at the United Nations. This trip marks Milei’s longest international journey as president. His nine-day tour has taken him from the Vatican, Italy, Spain, and France, culminating in Israel. On Wednesday, he will visit the Holy Sepulcher, meet with more hostage families, and receive the Genesis Prize—sometimes called the “Jewish Nobel Prize”—which Israel awarded him in January for his steadfast support during the conflict. Throughout his visit, Milei has ratified Argentina’s alignment with Israel, both in combating terrorism and defending democratic values. As the war in Gaza continues, Milei’s message remains clear: Argentina stands shoulder to shoulder with Israel and demands justice for the victims of terrorism, both Israeli and Argentine. **Comments (0)** **Our Whatsapp Group** **Our Whatsapp Group** **Follow us On** **453k** **453k** **12k** **12k** **1.6k** **1.6k** **Join Our Newsletter** Stay connected with the pulse of the Jewish community! Subscribe to our newsletter for exclusive updates, insightful articles, and relevant news tailored to enrich your understanding of Jewish culture, traditions, and global events. **Editors Picks** **Popular Picks** **Popular Category** JBN is your news site for all Israeli and Jewish related news. We provide you with the latest breaking news and videos straight from the real world. © 2024 Jewish Breaking News|Built byKornerstone Media|All Rights Reserved|Cookies Policy|Privacy Policy Follow us on"}