{"id": 1095, "name": "Peterson Foundation", "domain": "pgpf.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pgpf.org/article/moodys-downgraded-its-us-credit-rating-and-warns-that-recent-policy-decisions-will-worsen-fiscal-outlook/", "title": "Moodys Downgraded Its Us Credit Rating And Warns That Recent Policy Decisions Will Worsen Fiscal Outlook", "content": "The Fiscal ChallengeOur National DebtUnderstanding The Federal Budget Our National Debt Understanding The Federal Budget Our National Debt Understanding The Federal Budget IssuesSee all issues ›Fiscal OutlookHealthcareSocial ProgramsThe U.S. BudgetDefense SpendingPolicy ProposalsIndividual TaxesCorporate TaxesEconomic OutlookDemocracy See all issues › Fiscal Outlook Healthcare Social Programs The U.S. Budget Defense Spending Policy Proposals Individual Taxes Corporate Taxes Economic Outlook Democracy See all issues › Fiscal Outlook Healthcare Social Programs The U.S. Budget Defense Spending Policy Proposals Individual Taxes Corporate Taxes Economic Outlook Democracy Programs & ProjectsAdvancing Fiscal PolicyEngaging Young AmericansStrengthening Our DemocracyConvening ExpertsSee all › Advancing Fiscal Policy Engaging Young Americans Strengthening Our Democracy Convening Experts See all › Advancing Fiscal Policy Engaging Young Americans Strengthening Our Democracy Convening Experts See all › Resources Press Grants AboutAbout the Peterson FoundationOur FounderCareers About the Peterson Foundation Our Founder Careers About the Peterson Foundation Our Founder Careers **SIGN UP FOR OURNEWSLETTER** Register with us to become part of an important movement to develop long-term, nonpartisan fiscal solutions for a healthy growing economy. By signing up, you’ll receive our email newsletter with relevant and timely information on economic and fiscal policy. Our Sites National Debt Clock Peterson Center on Healthcare Peterson Health Technology Institute Peterson Philanthropies Peterson Solutions Fund Up to Us Press Grants AboutAbout the Peterson FoundationOur FounderCareers About the Peterson Foundation Our Founder Careers About the Peterson Foundation Our Founder Careers **SIGN UP FOR OURNEWSLETTER** Register with us to become part of an important movement to develop long-term, nonpartisan fiscal solutions for a healthy growing economy. By signing up, you’ll receive our email newsletter with relevant and timely information on economic and fiscal policy. Our Sites National Debt Clock Peterson Center on Healthcare Peterson Health Technology Institute Peterson Philanthropies Peterson Solutions Fund Up to Us **SIGN UP FOR OURNEWSLETTER** Register with us to become part of an important movement to develop long-term, nonpartisan fiscal solutions for a healthy growing economy. By signing up, you’ll receive our email newsletter with relevant and timely information on economic and fiscal policy. **** The Fiscal ChallengeOur National DebtUnderstand the U.S. national debt, why it matters, and what we can do.Understanding the Federal BudgetLearn about the budget, how it’s created, and how we can fix our budgeting process.$36TNational Debt$1TFY25 Deficit Our National DebtUnderstand the U.S. national debt, why it matters, and what we can do.Understanding the Federal BudgetLearn about the budget, how it’s created, and how we can fix our budgeting process.$36TNational Debt$1TFY25 Deficit Our National Debt Understand the U.S. national debt, why it matters, and what we can do. Understanding the Federal Budget Learn about the budget, how it’s created, and how we can fix our budgeting process. **$36T** **$1T** Our National DebtUnderstand the U.S. national debt, why it matters, and what we can do.Understanding the Federal BudgetLearn about the budget, how it’s created, and how we can fix our budgeting process.$36TNational Debt$1TFY25 Deficit Our National Debt Understand the U.S. national debt, why it matters, and what we can do. Understanding the Federal Budget Learn about the budget, how it’s created, and how we can fix our budgeting process. **$36T** **$1T** Our National Debt Understand the U.S. national debt, why it matters, and what we can do. Understanding the Federal Budget Learn about the budget, how it’s created, and how we can fix our budgeting process. **$36T** **$1T** IssuesFiscal OutlookThe U.S. BudgetPolicy ProposalsIndividual TaxesCorporate TaxesDemocracyHealthcareSocial ProgramsDefense SpendingEconomic OutlookSee all Issues Fiscal OutlookThe U.S. BudgetPolicy ProposalsIndividual TaxesCorporate TaxesDemocracyHealthcareSocial ProgramsDefense SpendingEconomic OutlookSee all Issues Fiscal Outlook Fiscal Outlook The U.S. Budget The U.S. Budget Policy Proposals Policy Proposals Individual Taxes Individual Taxes Corporate Taxes Corporate Taxes Democracy Democracy Healthcare Healthcare Social Programs Social Programs Defense Spending Defense Spending Economic Outlook Economic Outlook See all Issues See all Issues Fiscal OutlookThe U.S. BudgetPolicy ProposalsIndividual TaxesCorporate TaxesDemocracyHealthcareSocial ProgramsDefense SpendingEconomic OutlookSee all Issues Fiscal Outlook Fiscal Outlook The U.S. Budget The U.S. Budget Policy Proposals Policy Proposals Individual Taxes Individual Taxes Corporate Taxes Corporate Taxes Democracy Democracy Healthcare Healthcare Social Programs Social Programs Defense Spending Defense Spending Economic Outlook Economic Outlook See all Issues See all Issues Fiscal Outlook Fiscal Outlook Fiscal Outlook The U.S. Budget The U.S. Budget The U.S. Budget Policy Proposals Policy Proposals Policy Proposals Individual Taxes Individual Taxes Individual Taxes Corporate Taxes Corporate Taxes Corporate Taxes Democracy Democracy Democracy Healthcare Healthcare Healthcare Social Programs Social Programs Social Programs Defense Spending Defense Spending Defense Spending Economic Outlook Economic Outlook Economic Outlook See all Issues See all Issues See all Issues Programs and ProjectsAdvancing Fiscal SolutionsEngaging Young AmericansStrengthening Our DemocracyConvening ExpertsSee all Programs Advancing Fiscal SolutionsEngaging Young AmericansStrengthening Our DemocracyConvening ExpertsSee all Programs Advancing Fiscal Solutions Advancing Fiscal Solutions Engaging Young Americans Engaging Young Americans Strengthening Our Democracy Strengthening Our Democracy Convening Experts Convening Experts See all Programs See all Programs Advancing Fiscal SolutionsEngaging Young AmericansStrengthening Our DemocracyConvening ExpertsSee all Programs Advancing Fiscal Solutions Advancing Fiscal Solutions Engaging Young Americans Engaging Young Americans Strengthening Our Democracy Strengthening Our Democracy Convening Experts Convening Experts See all Programs See all Programs Advancing Fiscal Solutions Advancing Fiscal Solutions Advancing Fiscal Solutions Engaging Young Americans Engaging Young Americans Engaging Young Americans Strengthening Our Democracy Strengthening Our Democracy Strengthening Our Democracy Convening Experts Convening Experts Convening Experts See all Programs See all Programs See all Programs Resources **Moody’s Downgrade of U.S. Credit Rating Highlights Risks of Rising National Debt** Last Updated May 19, 2025 PRINT **Moody’s Downgrade of U.S. Credit Rating Highlights Risks of Rising National Debt** On May 16,Moody’s Ratings downgraded the U.S. credit rating, citing an inability of the nation to address large and growing deficits. This downgrade means that for the first time ever, all three major credit ratings agencies have downgraded U.S. credit below their top rating. Moody’s warning comes as lawmakers are considering budget reconciliation legislation that would make America’s fiscal situation significantly worse. The new report from Moody’s downgrades the U.S. credit rating from the top level of Aaa (negative) to Aa1 (stable). In its announcement, Moody’s stated the following primary reasons for doing so: Growing debt caused by increased federal spending and reduced revenues from tax cuts.Moody’s includes the assumption that extension of the 2017 TCJA provisions will add $4 trillion to the debt over the next decade. Growing federal interest payments, driven by rising interest rates.The cost of financing the U.S. debt has increased rapidly, driven by higher Treasury yields since 2021. In particular, Moody’s continues to warn that “successive US administrations and Congress have failed to agree on measures to reverse the trend of large annual fiscal deficits and growing interest costs. . . . In turn, persistent, large fiscal deficits will drive the government's debt and interest burden higher. The US' fiscal performance is likely to deteriorate relative to its own past and compared to other highly-rated sovereigns.” The two other major credit rating agencies, Standard & Poor’s (S&P) and Fitch Ratings, haveboth already downgraded the nation’s rating— S&P in 2011 and Fitch in August 2023. S&P and Fitch Ratings also recognize the risk presented by growing debt and political division for the U.S. outlook. WhenS&P lowered the sovereign credit rating for the United States more than a decade ago, it noted weakening “effectiveness, stability, and predictability of American policymaking and political institutions” as well as an insufficient fiscal stabilization plan for the medium-term. The 2023 downgrade from Fitch Ratingscited the nation’s high and rising debt, the lack of a plan to address the drivers of that debt, and the erosion of good governance. Sovereign credit ratingsassess the capacity and willingness that a borrower will default on its debt obligations. Now, all three major rating agencies have lowered their ratings for U.S. debt, reflecting deep concern about the United States’ growing debt and deficits. These serious and credible warnings should send a strong message to policymakers about the need to addressAmerica’s unsustainable fiscal path. Image credit: Photo by Samuel Corum/Getty Images **Further Reading** **House Reconciliation Bill Would Add Trillions to the National Debt** The bill would increase debt by $3.0 trillion over the next 10 years, driving it from nearly 100 percent of GDP now to 124 percent of GDP by 2034. **House Reconciliation Bill Would Increase the National Debt by More Than Any Other Recent Legislation** The House recently passed the largest reconciliation bill ever. CBO estimates it would add $2.4 trillion (excluding interest) to the national debt over 10 years. **United States Is Borrowing at a Higher Rate than the Global Average, Warns IMF** New IMF reports serve as a warning to all countries that global fiscal and economic conditions are veering into dangerous territory. **Get Involved** Register with us to become part of an important movement to develop long-term fiscal solutions for a healthy growing economy. By signing up, you’ll receive our email newsletter with relevant and timely information on economic and fiscal policy. Learn what you can do. Read and share insights on the issues we face. HomeIssuesPress AboutOur FounderCareers Copyright © 2025 Peter G. Peterson Foundation. All rights reserved.Copyright Policy|Privacy Policy|Terms of Use|Permissions"}