{"id": 2053, "name": "The Nation Pakistan", "domain": "nation.com.pk", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.nation.com.pk/03-Jun-2025/csa-and-cerp-host-policy-workshop-to-train-civil-servants-as-champions-of-evidence-based-governance", "title": "Csa And Cerp Host Policy Workshop To Train Civil Servants As Champions Of Evidence Based Governance", "content": "nawaiwaqt group News Paper & TV ChannelRoznama NawaiwaqtWaqt News TV Roznama Nawaiwaqt Waqt News TV Roznama Nawaiwaqt Waqt News TV MagazinesSunday MagazineFamily MagazineNidai MillatMahnama Phool Sunday Magazine Family Magazine Nidai Millat Mahnama Phool Sunday Magazine Family Magazine Nidai Millat Mahnama Phool **** e-Paper Today's Paper EDITOR'S PICKSNewspaper Picks Newspaper Picks Newspaper Picks OPINIONEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters NEWSLatestHeadlinesTop StoriesNationalSportsLifestyle & EntertainmentBusinessInternationalEditor's PicksSnippetsLahoreKarachiIslamabad Latest Headlines Top Stories National Sports Lifestyle & Entertainment Business International Editor's Picks Snippets Lahore Karachi Islamabad Latest Headlines Top Stories National Sports Lifestyle & Entertainment Business International Editor's Picks Snippets Lahore Karachi Islamabad MULTIMEDIANews In PicturesCartoonsVideos News In Pictures Cartoons Videos News In Pictures Cartoons Videos BLOGSBlogsWrite for Us Blogs Write for Us Blogs Write for Us Get Alerts Get Alerts **CSA and CERP Host Policy Workshop to Train Civil Servants as Champions of Evidence-Based Governance** The Civil Services Academy (CSA), in strategic partnership with the Centre for Economic Research in Pakistan (CERP), successfully held a high-level policy workshop titled “Engaging with Evidence: Training Officers as Future Smart Policy Champions” at the CSA Walton Campus, Lahore. This workshop marks a significant step in the broader launch of the Capacity Building & Research Advisory Group, a joint initiative by CSA and CERP to institutionalize evidence-based policymaking in Pakistan’s civil service. The event convened a cohort of early to mid-career civil servants for a day of immersive learning, policy dialogue, and networking. The day began with registration, followed by the recitation of the Holy Quran and a presentation of the CTP Transformation Videos, showcasing CSA’s commitment to modernizing governance training. The workshop was formally opened with welcome remarks by Dr. Syed Shabbir Akbar Zaidi Director, Capacity Building, who highlighted the importance of cultivating a culture of curiosity, critical thinking, and continuous learning among young officers. Speaker KP Assembly pays no heed to pinpointing of quorum The workshop featured a series of interactive training sessions led by CERP faculty, focused on building essential policy evaluation and analytical skills: “Engaging with Evidence” sessions explored practical tools for evidence-informed decision-making and included dynamic group presentations facilitated by CERP and CSA Teaching Fellows. Shabeeh Haider Raza (CERP) introduced the Survey and Research Track, providing officers with an overview of upcoming research activities and their expected contributions. Participants engaged in hands-on survey completion and feedback activities, creating space for reflection and applied learning. A major highlight of the event was a keynote talk by Dr. Adnan Qadir Khan, Chief Economist, FCDO, who emphasized the transformative power of evidence in policymaking during an insightful address followed by an engaging Q&A session. The event concluded with a keynote speech by Mr. Farhan Aziz Khawaja, Director-General of CSA, who underlined the indispensable role of research and data in informed governance. He also distributed shields among key facilitators and contributors, acknowledging their efforts in promoting a forward-thinking policy mindset. The day ended with a group photo and a networking lunch. Jazz launches Pakistan’s first national tape-ball cricket tournament 2025 in Sialkot This workshop served as a launchpad for embedding a research-oriented culture within the civil service and empowering officers to act as policy champions driving forward institutional reform and innovation. **Web Desk** **** **Related News** **UK govt considers social media time limits for children** **UK govt considers social media time limits for children** **Silk and Spices Festival: A symbiosis of tourism and entrepreneurship** **Silk and Spices Festival: A symbiosis of tourism and entrepreneurship** **Emperor penguin populations declining faster than expected** **Emperor penguin populations declining faster than expected** **Lack of sleep in teens linked to disrupted brain connectivity, ...** **Lack of sleep in teens linked to disrupted brain connectivity, behaviour issues** **Over 130,000 tourists flock to Kaghan valley during Eid holidays** **Over 130,000 tourists flock to Kaghan valley during Eid holidays** **2 BTS megastars released from South Korea military** **2 BTS megastars released from South Korea military** **Top Stories** **Time to move forward on economic front, says PM** **Time to move forward on economic front, says PM** **Field Marshal lauds formation’s exemplary performance during ...** **Field Marshal lauds formation’s exemplary performance during Marqa-e-Haq** **Coalition govt to unveil federal budget 2025-26 today** **Coalition govt to unveil federal budget 2025-26 today** **Despite claims, tax exemptions surge by 48pc to Rs5.8tr** **Despite claims, tax exemptions surge by 48pc to Rs5.8tr** **Bilawal asks UK to facilitate Pak-India talks** **Bilawal asks UK to facilitate Pak-India talks** **Economic survey 2024–25: Inflation falls to 4.6% as GDP grows 2.7%** **Economic survey 2024–25: Inflation falls to 4.6% as GDP grows 2.7%** **Latest** **Speaker KP Assembly pays no heed to pinpointing of quorum** **Jazz launches Pakistan’s first national tape-ball cricket tournament 2025 in Sialkot** **JCP to meet on June 19 to discuss bench extensions** **Burhan Mirza: ‘This budget isn’t startup friendly, it’s startup deadly’** **Law minister chairs meeting of FBR review committee** **Editor's Picks** Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures **Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures** **Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures** Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures **Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures** **Pilgrims perform final Hajj ritual as Eidul Azha begins amid tight security and heat measures** Hajj 2025 sermon: Imam-e-Kaaba prays for Palestine, urges unity and compassion **Hajj 2025 sermon: Imam-e-Kaaba prays for Palestine, urges unity and compassion** **Hajj 2025 sermon: Imam-e-Kaaba prays for Palestine, urges unity and compassion** Nearly 2 million Muslim pilgrims ascend Mt Arafat for climax of Hajj pilgrimage **Nearly 2 million Muslim pilgrims ascend Mt Arafat for climax of Hajj pilgrimage** **Nearly 2 million Muslim pilgrims ascend Mt Arafat for climax of Hajj pilgrimage** How the US repeatedly failed to deliver aid to the people of Gaza **How the US repeatedly failed to deliver aid to the people of Gaza** **How the US repeatedly failed to deliver aid to the people of Gaza** President Zardari signs bill criminalising child marriage **President Zardari signs bill criminalising child marriage** **President Zardari signs bill criminalising child marriage** **Columns** **Enigma of US Leftover Weapons** **Enigma of US Leftover Weapons** **Finance Tips** **Finance Tips** **Peace with Land Mines?** **Peace with Land Mines?** **Pak-India: New normal** **Pak-India: New normal** **Higher Education Funding** **Higher Education Funding** **ePaper** **Blogs** **Digital democracy for a polarized Pakistan** **Digital democracy for a polarized Pakistan** **The delicate boldness of Zaajh: A culinary ...** **The delicate boldness of Zaajh: A culinary hideout in Raya ...** **Pahalgam attack and Indo-Pak escalation** **Pahalgam attack and Indo-Pak escalation** **Encountering suppositions in M. Athar ...** **Encountering suppositions in M. Athar Tahir’s Telling ...** **The legacy of US regime change** **The legacy of US regime change** **Cartoons** **Cartoon** **Editorials** **Tyranny’s Homecoming** **Pakistan’s Pride** **Stability Over Growth** **Voyage of Courage** **Economic Review** **Letters** **May Cowards Never Sleep** **Bike Snatching** **Power Plants Sale** **Rising Polio Cases** **Climate Change** **ePaper - Nawaiwaqt** **Newsletter Subscription** **Follow Us** **Contact Us** NIPCO House, 4 - Shaharah e Fatima Jinnah, Lahore, Pakistan Tel: +92 42 36367580 | Fax : +92 42 36367005 Advertise With Us Contact Us About Us Privacy Policy Copyrights Nawaiwaqt Group | Copyright © 2025 e-Paper Today's Paper EDITOR'S PICKSNewspaper Picks Newspaper Picks Newspaper Picks OPINIONEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters NEWSLatestHeadlinesTop StoriesNationalSportsLifestyle & EntertainmentBusinessInternationalEditor's PicksSnippetsLahoreKarachiIslamabad Latest Headlines Top Stories National Sports Lifestyle & Entertainment Business International Editor's Picks Snippets Lahore Karachi Islamabad Latest Headlines Top Stories National Sports Lifestyle & Entertainment Business International Editor's Picks Snippets Lahore Karachi Islamabad MULTIMEDIANews In PicturesCartoonsVideos News In Pictures Cartoons Videos News In Pictures Cartoons Videos BLOGSBlogsWrite for Us Blogs Write for Us Blogs Write for Us Nawaiwaqt Group | Copyright © 2025"}