{"id": 1858, "name": "Accuracy in Academia (AIA)", "domain": "academia.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.academia.org/liberals-explode-at-abcs-suspension-of-terry-moran-for-tweet-critical-of-stephen-miller/", "title": "Liberals Explode At Abcs Suspension Of Terry Moran For Tweet Critical Of Stephen Miller", "content": "Home Campus Report Bias Watch About Contact Interns Donate **Liberals Explode at ABC’s Suspension of Terry Moran for Tweet Critical of Stephen Miller** June 9, 2025 ByDon Irvine Liberals are exploding at the decision by ABC News to suspend senios correspondent Terry Moran for the now-deleted tweet calling White House Deputy Chief of Staff Stephen Miller a “world-class hater.” Miller apparently had gotten under Moran’s skin one time too many when he let his feelings fly. While Moran quickly realized the error of his ways it was too late as the conservative media pounced on his remarks resulting in his suspension pending an investigation. While liberals attacked ABC parent Disney for the suspension saying that it was kow-towing to the Trump administration it was the right thing to do. Moran is supposed to be an unbiased journalist and present the news as such. He is not a pundit and his job isn’t to offer commentary. There are many conservatives who have called for his firing but that would be an overreaction at this point since journalists on both sides have been guilty of inflammatory language on Twitter -now X and have kept their jobs. ABC will probablt take Moran to the woodshed and remind him of his journalistic duties and standards and let him return to the air once things have cooled down a bit which should take long given how fast the news cycle moves but this will only reinforce the notion of liberal media bias in the minds of many Americans. Don IrvineDonald Irvine is the chairman of of Accuracy in Academia (AIA), a non-profit research group reporting on bias in education. Irvine follows his father’s legacy, Reed Irvine, to critically analyze the liberal media’s bias and brings over thirty years of media analysis experience. He has published countless blog posts and articles on media bias, in context of current events, and he has been interviewed by many news media outlets during his professional career. He currently hosts a livestream weekly show on AIA’s Facebook page which discusses current events. Irvine graduated from the University of Maryland and rose up the ranks to become chairman of Accuracy in Media until his transition to AIA. He resides in the suburbs around the nation’s capital and is a proud father and grandfather. **Sign up for Updates & Newsletters.** **Recent articles in Bias Watch** **Biden, Cancer and Me** May 27, 2025 **Ramen Falls Victim to Oneworld Lounge ESG Policy** May 22, 2025 **CNN’s Tapper Admits He Ignored Biden’s Cognitive Decline** May 14, 2025 **Trump’s Firehose First 100 Days** April 29, 2025 About AIA Bias Watch Accuracy in America Campus Report MLA Donate Internship Contact Us"}