{"id": 391, "name": "CityNews Edmonton", "domain": "edmonton.citynews.ca", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://edmonton.citynews.ca/video/2025/06/11/mcleod-the-architect-crown-begins-closing-argument-in-hockey-player-sex-assault-trial/", "title": "Mcleod The Architect Crown Begins Closing Argument In Hockey Player Sex Assault Trial", "content": "Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAbout UsOur Team About Us Our Team About Us Our Team ContactContact Us Contact Us Contact Us Submit a News Tip NewsAllLocalCanadaWorld Local Canada World Local Canada World WatchAllLivestreamLatest Videos Livestream Latest Videos Livestream Latest Videos Weather EdmontonAllEdmontonCalgaryEdmontonHalifaxKitchenerMontrealOttawaTorontoVancouverWinnipeg Edmonton Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg Edmonton Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAllAbout UsOur Team About Us Our Team About Us Our Team ContactAllContact Us Contact Us Contact Us Submit a News Tip **Live Streaming** **Live Streaming 24/7** **McLeod the 'architect': Crown begins closing argument in hockey player sex assault trial** **Live Streaming 24/7** The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. **Recommended Videos** The City of Edmonton is short about $1.8 billion needed for infrastructure renewal. As Sean Amato reports, the mayor and a councillor running to replace him disagree on what caused the problem and how to solve it. 21h ago The City of Edmonton is short about $1.8 billion needed for infrastructure renewal. As Sean Amato reports, the mayor and a councillor running to replace him disagree on what caused the problem and how to solve it. 21h ago The City of Edmonton wants more apartments in mature neighborhoods, but that means more people and more traffic. Residents in the Belgravia community near the university of Alberta say commuting is a nightmare. The City of Edmonton wants more apartments in mature neighborhoods, but that means more people and more traffic. Residents in the Belgravia community near the university of Alberta say commuting is a nightmare. Edmonton woman speaks out after losing over $7000 in an apparent banking scam. Hiba Kamal-Choufi has the story. 42m ago Edmonton woman speaks out after losing over $7000 in an apparent banking scam. Hiba Kamal-Choufi has the story. 42m ago Movember Canada conducted a report for Men’s Health Week showing men in Downtown Edmonton and Griesbach have a high rate of premature male death. Our Leo Cruzat reports. 21h ago Movember Canada conducted a report for Men’s Health Week showing men in Downtown Edmonton and Griesbach have a high rate of premature male death. Our Leo Cruzat reports. 21h ago **Live Streaming 24/7** The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. The latest updates and breaking news, now available around the clock. Check back in with us at any time to find out what's happening, and always be the first to know. CityNews, Everywhere. **Recommended Videos** The City of Edmonton is short about $1.8 billion needed for infrastructure renewal. As Sean Amato reports, the mayor and a councillor running to replace him disagree on what caused the problem and how to solve it. 21h ago The City of Edmonton is short about $1.8 billion needed for infrastructure renewal. As Sean Amato reports, the mayor and a councillor running to replace him disagree on what caused the problem and how to solve it. 21h ago The City of Edmonton wants more apartments in mature neighborhoods, but that means more people and more traffic. Residents in the Belgravia community near the university of Alberta say commuting is a nightmare. The City of Edmonton wants more apartments in mature neighborhoods, but that means more people and more traffic. Residents in the Belgravia community near the university of Alberta say commuting is a nightmare. Edmonton woman speaks out after losing over $7000 in an apparent banking scam. Hiba Kamal-Choufi has the story. 42m ago Edmonton woman speaks out after losing over $7000 in an apparent banking scam. Hiba Kamal-Choufi has the story. 42m ago Movember Canada conducted a report for Men’s Health Week showing men in Downtown Edmonton and Griesbach have a high rate of premature male death. Our Leo Cruzat reports. 21h ago Movember Canada conducted a report for Men’s Health Week showing men in Downtown Edmonton and Griesbach have a high rate of premature male death. Our Leo Cruzat reports. 21h ago **Latest Videos** In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 13m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 13m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 34m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 34m ago “We have to be doing something,” says Catherine Corriveau of Movember Canada on their new report which revealed too many Canadian men are dying prematurely. Tehosterihens Deer reports. 35m ago “We have to be doing something,” says Catherine Corriveau of Movember Canada on their new report which revealed too many Canadian men are dying prematurely. Tehosterihens Deer reports. 35m ago Get the CityNews AppNow New and Improved! Watch CityNews Edmonton, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Watch CityNews Edmonton, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Watch CityNews Edmonton, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. Google Store Apple Store About Us News Policy Contact CityNews Edmonton Privacy Policy Ad Choices Terms of Service Advertise With Us Political Ads Registry"}