{"id": 1235, "name": "Sentencing Project", "domain": "sentencingproject.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sentencingproject.org/advocacy/50-years-and-a-wake-up-ending-the-mass-incarceration-crisis-in-america/", "title": "50 Years And A Wake Up Ending The Mass Incarceration Crisis In America", "content": "IssuesIssuesLearn about our key areas of focus to end mass incarceration and promote racial justice.View issuesRacial JusticeEnding mass incarceration must include combating racial inequality and disparity.Sentencing ReformIt's time to take a second look at extreme sentences.Voting RightsThe criminal justice system shouldn't have a say in our democracy.Youth JusticeWe must end youth incarceration and provide all youth with the support they need to thrive.Featured CampaignSecond Look NetworkEnding mass incarceration requires taking a second look at extreme sentences. Learn more about our coalition of legal professionals providing direct representation to incarcerated individuals seeking relief from lengthy or unfair sentences. **Issues** Learn about our key areas of focus to end mass incarceration and promote racial justice. Racial JusticeEnding mass incarceration must include combating racial inequality and disparity. Ending mass incarceration must include combating racial inequality and disparity. Sentencing ReformIt's time to take a second look at extreme sentences. It's time to take a second look at extreme sentences. Voting RightsThe criminal justice system shouldn't have a say in our democracy. The criminal justice system shouldn't have a say in our democracy. Youth JusticeWe must end youth incarceration and provide all youth with the support they need to thrive. We must end youth incarceration and provide all youth with the support they need to thrive. Ending mass incarceration requires taking a second look at extreme sentences. Learn more about our coalition of legal professionals providing direct representation to incarcerated individuals seeking relief from lengthy or unfair sentences. **Issues** Learn about our key areas of focus to end mass incarceration and promote racial justice. Racial JusticeEnding mass incarceration must include combating racial inequality and disparity. Ending mass incarceration must include combating racial inequality and disparity. Ending mass incarceration must include combating racial inequality and disparity. Sentencing ReformIt's time to take a second look at extreme sentences. It's time to take a second look at extreme sentences. It's time to take a second look at extreme sentences. Voting RightsThe criminal justice system shouldn't have a say in our democracy. The criminal justice system shouldn't have a say in our democracy. The criminal justice system shouldn't have a say in our democracy. Youth JusticeWe must end youth incarceration and provide all youth with the support they need to thrive. We must end youth incarceration and provide all youth with the support they need to thrive. We must end youth incarceration and provide all youth with the support they need to thrive. Ending mass incarceration requires taking a second look at extreme sentences. Learn more about our coalition of legal professionals providing direct representation to incarcerated individuals seeking relief from lengthy or unfair sentences. AdvocacyAdvocacyThe Sentencing Project is a leading voice for criminal legal reform.Advocacy overviewOur WorkExplore our work at the national, state, and local level to promote a fair and effective criminal legal system.Second Look NetworkThe Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home.Get InvolvedChanging laws and policies to end mass incarceration require a mass movement. Here are ways you can take action.Featured Campaign50 Years and a Wake UpThis year marks the 50th year since the U.S. prison population began its unprecedented surge. Partner with us to end mass incarceration! **Advocacy** The Sentencing Project is a leading voice for criminal legal reform. Our WorkExplore our work at the national, state, and local level to promote a fair and effective criminal legal system. Explore our work at the national, state, and local level to promote a fair and effective criminal legal system. Second Look NetworkThe Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home. The Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home. Get InvolvedChanging laws and policies to end mass incarceration require a mass movement. Here are ways you can take action. Changing laws and policies to end mass incarceration require a mass movement. Here are ways you can take action. This year marks the 50th year since the U.S. prison population began its unprecedented surge. Partner with us to end mass incarceration! **Advocacy** The Sentencing Project is a leading voice for criminal legal reform. Our WorkExplore our work at the national, state, and local level to promote a fair and effective criminal legal system. Explore our work at the national, state, and local level to promote a fair and effective criminal legal system. Explore our work at the national, state, and local level to promote a fair and effective criminal legal system. Second Look NetworkThe Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home. The Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home. The Network serves, connects, and empowers legal advocates across the country to bring people serving excessive and unfair prison sentences home. Get InvolvedChanging laws and policies to end mass incarceration require a mass movement. Here are ways you can take action. Changing laws and policies to end mass incarceration require a mass movement. Here are ways you can take action. Changing laws and policies to end mass incarceration require a mass movement. Here are ways you can take action. This year marks the 50th year since the U.S. prison population began its unprecedented surge. Partner with us to end mass incarceration! ResearchResearchExplore our publications, fact sheets, data & more.OverviewGrowth in Mass IncarcerationThe United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration.U.S. Criminal Justice DataView state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United StatesDetailed Data ToolCompare state-level incarceration data for youth and adults with this expanded data setResource LibrarySearch important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and moreFeatured PublicationOne in FiveOne in five Black men born in 2001 is likely to experience imprisonment within their lifetime. Our four-part “One in Five” series examines racial inequities in America’s criminal legal system, as well as highlights promising reforms.Glossary of Criminal Justice Terms **Research** Explore our publications, fact sheets, data & more. Growth in Mass IncarcerationThe United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration. The United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration. U.S. Criminal Justice DataView state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United States View state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United States Detailed Data ToolCompare state-level incarceration data for youth and adults with this expanded data set Compare state-level incarceration data for youth and adults with this expanded data set Resource LibrarySearch important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and more Search important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and more One in five Black men born in 2001 is likely to experience imprisonment within their lifetime. Our four-part “One in Five” series examines racial inequities in America’s criminal legal system, as well as highlights promising reforms. Glossary of Criminal Justice Terms **Research** Explore our publications, fact sheets, data & more. Growth in Mass IncarcerationThe United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration. The United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration. The United States is the world’s leader in incarceration. Get the facts and statistics on trends in U.S. incarceration. U.S. Criminal Justice DataView state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United States View state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United States View state-level data to provide a snapshot of key indicators of mass incarceration's impact in the United States Detailed Data ToolCompare state-level incarceration data for youth and adults with this expanded data set Compare state-level incarceration data for youth and adults with this expanded data set Compare state-level incarceration data for youth and adults with this expanded data set Resource LibrarySearch important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and more Search important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and more Search important resources published by The Sentencing Project, including research publications, advocacy briefs, webinars, and more One in five Black men born in 2001 is likely to experience imprisonment within their lifetime. Our four-part “One in Five” series examines racial inequities in America’s criminal legal system, as well as highlights promising reforms. Glossary of Criminal Justice Terms AboutAbout UsWays to GiveOur ImpactStaff & BoardAnnual Reports & FinancesCareers & InternshipsEventsContact Us About Us Ways to Give Our Impact Staff & Board Annual Reports & Finances Careers & Internships Events Contact Us About Us Ways to Give Our Impact Staff & Board Annual Reports & Finances Careers & Internships Events Contact Us IssuesIssuesView issuesRacial JusticeSentencing ReformVoting RightsYouth Justice **Issues** Racial Justice Sentencing Reform Voting Rights Youth Justice **Issues** Racial Justice Sentencing Reform Voting Rights Youth Justice AdvocacyAdvocacyAdvocacy overviewOur WorkSecond Look NetworkGet Involved **Advocacy** Our Work Second Look Network Get Involved **Advocacy** Our Work Second Look Network Get Involved ResearchResearchOverviewGrowth in Mass IncarcerationU.S. Criminal Justice DataDetailed Data ToolResource LibraryGlossary of Criminal Justice Terms **Research** Growth in Mass Incarceration U.S. Criminal Justice Data Detailed Data Tool Resource Library Glossary of Criminal Justice Terms **Research** Growth in Mass Incarceration U.S. Criminal Justice Data Detailed Data Tool Resource Library Glossary of Criminal Justice Terms AboutAboutAbout UsWays to GiveOur ImpactStaff & BoardAnnual Reports & FinancesCareers & InternshipsEventsContact Us **About** About Us Ways to Give Our Impact Staff & Board Annual Reports & Finances Careers & Internships Events Contact Us **About** About Us Ways to Give Our Impact Staff & Board Annual Reports & Finances Careers & Internships Events Contact Us Facebook Twitter YouTube LinkedIn Instagram Advocacy 50 Years and a Wake Up **50 Years and a Wake Up** “50 Years and a Wake Up: Ending The Mass Incarceration Crisis In America” raises awareness about the dire state of the U.S. criminal legal system, the devastating impact of incarceration on communities and families, and proposes more effective crime prevention strategies for our country. Scroll below to watch our latest Public Service Announcement. Today, almost 2 million individuals – disproportionately Black Americans – are incarcerated in our nation’s prisons and jails. The prison population has grown 500% since 1973, the year America began to sharply increase its prison population. America’s 50-year experiment with mass incarceration has been a profound moral and policy failure, perpetuating cycles of despair and retribution, tearing apart communities, and destroying countless lives. Billions of taxpayer dollars are poured into this failed system that seems designed to perpetuate itself. It is a profound tragedy that should stir the conscience of our nation. Watch the video above to hear from formerly incarcerated activists, Kemba Smith and Joél Castón, on why it’s past time for our country to WAKE UP! **Take Action** Learn MoreGet the facts on mass incarceration and explore research and advocacy webinars to promote public safety and racial justice.Learn more **Learn More** Get the facts on mass incarceration and explore research and advocacy webinars to promote public safety and racial justice. **Learn More** Get the facts on mass incarceration and explore research and advocacy webinars to promote public safety and racial justice. ShareHelp us spread the word about the urgent need to reform our criminal legal system and end mass incarceration.Click to tweet **Share** Help us spread the word about the urgent need to reform our criminal legal system and end mass incarceration. **Share** Help us spread the word about the urgent need to reform our criminal legal system and end mass incarceration. DonateYour contributions are vital to making a difference to the individuals, families, and communities impacted by mass incarceration.Donate now **Donate** Your contributions are vital to making a difference to the individuals, families, and communities impacted by mass incarceration. **Donate** Your contributions are vital to making a difference to the individuals, families, and communities impacted by mass incarceration. **Stay involved & informed** Stay up-to-date on the latest reports and news from The Sentencing Project. **Thanks for subscribing!** By submitting your cell phone number, you are agreeing to receive text messages from The Sentencing Project. Messages may include fundraising. 4 msgs/month. Message and data rates may apply. Text HELP for more information. Text STOP to stop receiving messages.Terms & Conditions.Privacy Policy. **One more thing,!** Please click the link in the email we sent to. Otherwise, we won't be able to contact you. In the meantime, get social with us! Join our community of over 100,000 followers onTwitter,Facebook, andInstagram. Contact Us Ways to Give About Us Careers © 2025 The Sentencing Project. All Rights Reserved. Terms of Use Privacy Policy Do Not Sell/Share My Data Facebook Twitter YouTube LinkedIn Instagram"}