{"id": 2214, "name": "McSweeney's Internet Tendency", "domain": "mcsweeneys.net", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.mcsweeneys.net/pages/dispatches-digital-ephemera-the-four-deportations-of-jean-marseille", "title": "Dispatches Digital Ephemera The Four Deportations Of Jean Marseille", "content": "Internet Tendency The Store Books Division Quarterly Concern The Believer Donate Join our Patreon for as little as $5 a month and get access to author interviews, content calls, discounts at our store, and more.Help support our writers and keep our site ad-free. **Dispatches Digital Ephemera: The Four Deportations of Jean Marseille** Dispatches Digital Ephemera: The Four Deportations of Jean Marseille Dispatches Digital Ephemera: The Four Deportations of Jean Marseille UPDATE: We have officially announced the second book in ourDispatchesseries:If You Don’t Want to Be Punched, Don’t Punch Somebody Else: The Lives of Carole Hinojosa.Starting with this second book, each book in the series will include a QR code for readers to access exclusive digital ephemera and the actual audio recordings that form the basis of each title. In honor of the impending release, we’ve made the first batch of digital ephemera (for the first title,The Four Deportations of Jean Marseille) free for all. To purchaseThe Four Deportations of Jean Marseille,click here. To subscribe to the Dispatches series,click here. **DispatchesDigital Ephemera** Each book in ourDispatchesseriesoriginates in short voice recordings. These confidences, recorded during borrowed moments, offer an intimate portrait of a singular life. Below, readers of the series can hear selections of the original audio dispatches, listening directly to the voices behind these stories of daily human endurance. In addition, readers will have exclusive access to photos, maps, and additional digital ephemera, further expanding the insight into each storyteller’s life. **AboutDispatches** Dispatchesis a series of powerful and compact nonfiction titles documenting the highs and lows of daily human endurance, as they happen. Edited by award-winning writers Peter Orner and Laura Lampton Scott, each book originates in short confidences voice recordings. Set amid some of our most pressing contemporary environments, these invaluable books provide a vital firsthand look into lives rarely put to paper. **The Four Deportationsof Jean Marseille** Audio dispatches from Jean Marseille Jean Marseille is the charismatic father at the heart of the first book in theDispatchesseries,The Four Deportations of Jean Marseille. Jean is an experienced fixer for journalists who often finds himself on the subject side of stories. In these audio recordings, Jean describes his life in Haiti and his reluctant emigration across the island to the Dominican Republic, where he doesn’t speak the language and faces increasingly difficult discrimination and immigration challenges. Jean’s house in Port-au-Prince has been stolen, his family has experienced kidnapping and attacks, and work is impossible to find. He’s been living on the streets, separated from his wife. He’s exhausted and sick. On the bus to Santiago, Dominican Republic, Jean considers the hurdles to legally emigrate from Haiti to the Dominican Republic and how it feels to leave his wife and some of his children behind. Two of his daughters, already living in Santiago, will receive him when he arrives. While in the DR, Jean works in a call center, serving US customers with his American English skills, garnered from his childhood and early adulthood as an American, before Clinton administration policies deported him to Haiti, a country he hadn’t seen since early childhood. Without Spanish skills and in a time hostile to Haitian immigrants, Jean feels isolated in the DR and, in the early morning, he considers other possibilities, including returning to the Bahamas to find his birth certificate and discover what day he was born. PART1: Jean reflects on his time in the DR, including working at the call center and the cycle of being deported back to Haiti and returning to the DR. PART2: Back in Port-au-Prince, Jean lives on and off the streets and is separated from his family. **Photos** Jean with Laura, one of his editors, in Santiago, Dominican Republic, August 2024. Photo by Stephane Merzier. One of Jean’s many deportations by Dominican immigration across the border to Haiti. Photo by Jean Marseille. Jean in 2012 interviewing a fish merchant in Port-au-Prince for the post-earthquake bookLavil. Photo by Peter Orner. Jean training a new call center employee at JC Solutions in Santiago, Dominican Republic, August 2024. Photo by Stephane Merzier. Jean’s Dominican visa, which he could no longer renew, as the Dominican government suspended visas to Haitians, August 2024. Photo by Jean Marseille. **Maps** **Recommended** June 3, 2025New York Times’ Style Guide Substitutions for “The President Violated the Constitution”byCarlos Greaves June 6, 2025I, Saruman, Have Ended My Alliance with the Dark Lord SauronbyCarlos Greaves May 19, 2025A Company Reminder for Everyone to Talk Nicely About the Giant Plagiarism MachinebyAmanda Bachman June 2, 2025The Zen of Dying Quietly, and Other Teachings by Senator Joni ErnstbyJack Loftus June 11, 2025Welcome to My Well-Stocked Pantry of Empty BoxesbyAudrey Burges June 10, 2025Memo from theDHS: Deploy Megatron Before the LA Protesters Start Thinking They Have RightsbyMatti Ben-Lev June 10, 2025My Season Pass to Burnout LandbyTaylor Harris June 10, 2025If Charles Bukowski Wrote a Children’s Book About Emotional RegulationbyHeather Kays Internet Tendency The Store Books Division Quarterly Concern The Believer Donate About Us Events Email Newsletter Advertise Store Policy Contact Us Internships Submission Guidelines Internet Tendency The Store Books Division Quarterly Concern The Believer Donate"}