{"id": 1630, "name": "Orlando Sentinel", "domain": "orlandosentinel.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.orlandosentinel.com/2025/06/10/coach-jeremy-palmer-47-dies-after-8-month-battle-with-cancer-fhsaa-orlan-do-university-high-celebration-high-school-bossier-city-louisiana-mississippi-louisiana-tech-mississippi-college/", "title": "Coach Jeremy Palmer 47 Dies After 8 Month Battle With Cancer Fhsaa Orlan Do University High Celebration High School Bossier City Louisiana Mississippi Louisiana Tech Mississippi College", "content": "Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Daily e-Edition Evening e-Edition NewsNewsLatest HeadlinesPoliticsEducationNational News News Latest Headlines Politics Education National News News Latest Headlines Politics Education National News Local NewsLocal NewsLake CountyOrange CountyOsceola CountySeminole County Local News Lake County Orange County Osceola County Seminole County Local News Lake County Orange County Osceola County Seminole County HealthHealthMedicare Health Medicare Health Medicare SportsSportsHigh School SportsUCF KnightsOrlando MagicMike Bianchi CommentaryFlorida Gators Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators BusinessBusinessTourismEconomyReal EstateGrowthSpotterConsumer Reviews Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews WeatherWeatherConditions and ForecastsHurricanesHurricane preparednessHurricane Tracks Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks OpinionOpinionLetters to the EditorScott Maxwell CommentaryEditorialsEndorsements Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements EntertainmentEntertainmentTheater and ArtsThings to DoHoroscopesRestaurants, Food & DrinkEvents Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events TravelTravelTheme ParksEpic UniverseExplore FloridaCruisesFlorida & Caribbean Experiences Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds ServicesAbout the Orlando SentinelManage SubscriptionSubscriber BenefitsSign up for NewslettersBuy an advertisement About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Subscribe Login Sign up for email newsletters Subscribe Login Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Mike Bianchi Commentary Orlando Magic Orlando City SC Orlando Pride UCF Knights UF Gators FSU Seminoles UM Hurricanes High School Sports Trending: 🎢 Vote: Best of theme parks 🏠 Homeless Camping Ban 🚀 Launch schedule 💻 Donate to Orlando Sentinel News Fund 🔍 Restaurant Inspections 🏀 Buy Gators Title Pages **Breaking News** **Brian Wilson, Beach Boys visionary leader and summer’s poet laureate, dies at 82** **High school coach Jeremy Palmer, 47, dies after 8-month battle with cancer** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X Jeremy Palmer, the 47-year-old former football coach at Orlando University and Celebration high schools, died Monday at Good Shepherd Hospice in Auburndale. The coach was fighting aneight-month battle with cancerthat was diagnosed in November, just six days after the football season ended. Palmer was surrounded by his family — wife Shannon, son Zachery, and daughters Sarra and Talia — as well as his father Thomas Palmer and his mother Sheila Morrison Bridges, who both live in Mississippi. He is also survived by his brother Jonathan Palmer, who also lives in Mississippi. Funeral arrangements are being handled by Oak Ridge Funeral Home (1001 E. Grave Avenue, Haines City, 33844). The funeral is set for Friday, with viewing from 11 a.m. to noon, and the service at noon. Palmer, who played college football at Mississippi College and graduated from Louisiana Tech, was born in Bossier City, La. He took over coaching positions at a pair of struggling Central Florida programs with the hopes of steering them in the right direction. In two seasons at Celebration, his teams were 2-18, and he finished 2-8 in his only year atOrlando’s University High last season. “He was not in any pain. He’s gone to be with Jesus,” Shannon Palmer said. “He fought until that very last breath. He kept fighting for his family and that’s what Jeremy always did. He fought for the people he loved. “It’s heartbreaking. After watching him this past week, I am just so thankful he is not in any pain. He is going to be missed. He was truly loved by so many people. Too young to be dealing with this.” Six days after the final game last season, Palmer went in for what he thought was going to be routine testing of his esophagus — procedures he had dealt with since he was 13 years old, when he had surgery. From routine scans, however, doctors found a malignant tumor in his esophagus. Further testing found seven different tumors throughout his body. He had the one in the esophagus, two in the brain and others in his liver, diaphragm and lymph nodes around the stomach. Palmer had brain surgery in December, followed by four months of chemotherapy. At the beginning of May, he was upbeat, positive and optimistic about upcoming scans on June 3. His condition, however, quickly deteriorated in the following weeks, and he was placed in hospice on Sunday. In lieu of flowers, the family is asking that donations be made to theJeremy Palmer Memorial. Chris Hays can be found on X.com@OS_ChrisHays. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on Bluesky (Opens in new window)Bluesky Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** SeaWorld Orlando rolls out summer concert scheduleSeaWorld Orlando rolls out summer concert schedule **SeaWorld Orlando rolls out summer concert schedule** **SeaWorld Orlando rolls out summer concert schedule** Suspended Osceola Sheriff Lopez’s hearing for reduction in $1M bond canceled, unclear whySuspended Osceola Sheriff Lopez's hearing for reduction in $1M bond canceled, unclear why **Suspended Osceola Sheriff Lopez’s hearing for reduction in $1M bond canceled, unclear why** **Suspended Osceola Sheriff Lopez’s hearing for reduction in $1M bond canceled, unclear why** Maxwell: DeSantis orders Orlando Sentinel to stop investigating his scandal. That’s not happening.Maxwell: DeSantis orders Orlando Sentinel to stop investigating his scandal. That's not happening. **Maxwell: DeSantis orders Orlando Sentinel to stop investigating his scandal. That’s not happening.** **Maxwell: DeSantis orders Orlando Sentinel to stop investigating his scandal. That’s not happening.** Florida lawmakers fund another $1.7 billion in I-4 construction projectsFlorida lawmakers fund another $1.7 billion in I-4 construction projects **Florida lawmakers fund another $1.7 billion in I-4 construction projects** **Florida lawmakers fund another $1.7 billion in I-4 construction projects** Bianchi: USA Today columnist proves the left’s willful blindness on transgender sports is backfiringBianchi: USA Today columnist proves the left's willful blindness on transgender sports is backfiring **Bianchi: USA Today columnist proves the left’s willful blindness on transgender sports is backfiring** **Bianchi: USA Today columnist proves the left’s willful blindness on transgender sports is backfiring** Orange County deputy runs red light, hits another car, injures threeOrange County deputy runs red light, hits another car, injures three **Orange County deputy runs red light, hits another car, injures three** **Orange County deputy runs red light, hits another car, injures three** Editorial: Intimidation won’t make the Sentinel back down on Hope Florida storyEditorial: Intimidation won't make the Sentinel back down on Hope Florida story **Editorial: Intimidation won’t make the Sentinel back down on Hope Florida story** **Editorial: Intimidation won’t make the Sentinel back down on Hope Florida story** Central Florida property values continue to skyrocketCentral Florida property values continue to skyrocket **Central Florida property values continue to skyrocket** **Central Florida property values continue to skyrocket** Asking Eric: It’s not in my nature to ghost but, boy, is she boringAsking Eric: It’s not in my nature to ghost but, boy, is she boring **Asking Eric: It’s not in my nature to ghost but, boy, is she boring** **Asking Eric: It’s not in my nature to ghost but, boy, is she boring** Osceola sheriff’s top director fired, denies knowing of illegal gambling schemeOsceola sheriff's top director fired, denies knowing of illegal gambling scheme **Osceola sheriff’s top director fired, denies knowing of illegal gambling scheme** **Osceola sheriff’s top director fired, denies knowing of illegal gambling scheme** **More in High School Sports** Winter Park Sentinel Varsity boys volleyball Player of the Year is Stanford signee **Winter Park Sentinel Varsity boys volleyball Player of the Year is Stanford signee** **Winter Park Sentinel Varsity boys volleyball Player of the Year is Stanford signee** Seminole’s Adam Walker is Sentinel Varsity boys water polo Player of the Year **Seminole’s Adam Walker is Sentinel Varsity boys water polo Player of the Year** **Seminole’s Adam Walker is Sentinel Varsity boys water polo Player of the Year** Seminole’s Halle Zimlich is Sentinel Varsity girls water polo Player of the Year again **Seminole’s Halle Zimlich is Sentinel Varsity girls water polo Player of the Year again** **Seminole’s Halle Zimlich is Sentinel Varsity girls water polo Player of the Year again** Winter Park beach volleyball ace Rachel Seneff is Orlando Sentinel’s Varsity Player of Year **Winter Park beach volleyball ace Rachel Seneff is Orlando Sentinel’s Varsity Player of Year** **Winter Park beach volleyball ace Rachel Seneff is Orlando Sentinel’s Varsity Player of Year** 2025 June 10 Tribune PublishingChicago TribuneThe Morning Call of Pa.Daily Press of Va.New York Daily NewsSouth Florida Sun-SentinelHartford CourantThe Virginian-PilotStudio 1847 Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company InfoArchivesContact Us at the Orlando SentinelCommunity News FundCareers Archives Contact Us at the Orlando Sentinel Community News Fund Careers Archives Contact Us at the Orlando Sentinel Community News Fund Careers Manage AccountNewslettersDaily e-EditionEvening EditionHelp Newsletters Daily e-Edition Evening Edition Help Newsletters Daily e-Edition Evening Edition Help Advertise with UsPlace an AdAuto ListingsFind a Job Place an Ad Auto Listings Find a Job Place an Ad Auto Listings Find a Job About the Orlando SentinelPhoto requests, reprintsSend us a News TipSubscriber Services & HelpSite Map Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Orlando Sentinel"}