{"id": 1319, "name": "SWI - Swissinfo.ch", "domain": "swissinfo.ch", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.swissinfo.ch/eng/swiss-abroad/one-against-the-other-zero-sum-thinking-can-be-found-on-both-the-political-left-and-right/89448492", "title": "One Against The Other Zero Sum Thinking Can Be Found On Both The Political Left And Right", "content": "Jump to home page Jump to navigation Jump to content Skip to search Home About us Democracy International Geneva Foreign Affairs Swiss Politics Science Health economy Culture Life & Aging Swiss Abroad Switzerland: How To Videos and Swiss Films Podcasts Debates Special reports Opinions Newsletters Search enEnglish deDeutsch frFrançais itItaliano esEspañol ptPortuguês ja日本語 arالعربية zh中文 ruРусский **One against the other: zero-sum thinking can be found on both the political left and right** English (US) English (British) **Your gain, my loss. This is the concept behind zero-sum thinking. Supporters of both left-wing and right-wing parties hold this worldview, as shown by a study from the University of Basel.** I write about political developments and social issues that are relevant for the Swiss Abroad. As part of the Swiss Broadcasting Corporation's \"dialogue\" project, I further aim to encourage multilingual debates between the Swiss Abroad and people living in Switzerland. After graduating from the MAZ School of Journalism, I worked as a program director at a local radio station in Basel and reported on political, economic, social and cultural topics. I have been working for SWI swissinfo.ch since 2023. More from this author German Department DeutschdeDein Gewinn, mein Verlust: Solches Nullsummendenken gibt es links wie rechtsOriginalRead more: Dein Gewinn, mein Verlust: Solches Nullsummendenken gibt es links wie rechts ItalianoitLa mentalità “noi contro loro” esiste in tutti i partitiRead more: La mentalità “noi contro loro” esiste in tutti i partiti US President Donald Trump exemplifies the rhetoric of zero-sum thinking, which is evident in arguments such as: a migrant getting a job in the US means one job fewer for US citizens. Or something produced in Asia cannot be produced in the US. The belief that one group can win only if another loses is also widespread in Switzerland. While a third of people believe that prosperity can grow for everyone, for nearly 30% of the Swiss population the acquisition of wealth follows a zero-sum logic. This is according to a study by theUniversity of BaselExternal link, based on the second edition of the national survey “How are you, Switzerland?” by the Swiss Broadcasting Corporation (SBC), SWI swissinfo.ch’s parent company. This 30% agreement with zero-sum thinking surprises Kelly Liu, co-author of the study, because “Switzerland is a rich country that has already experienced relatively long economic growth”. Liu also finds it unexpected that this mindset cannot be tied to a specific population group, whether in terms of age, gender, education or language. **Politically left and right** Zero-sum thinking cannot be attributed to a specific political party either. It is more common on the political left regarding wealth, associated with demands for more redistribution and higher taxation of assets. However, the study shows that among the supporters of each party, there is a proportion of people who agree with the following statement: “People can only get rich at the expense of others”. Likewise, in all parties there is a proportion that holds the opposite view: “Wealth can grow so there’s enough for everyone.” **More** **Our newsletter on Swiss politics** Short political news from Bern: the latest on votes, parliament and new political ideas. Everything you need to keep up to date in a single newsletter. Zero-sum thinking exists across the political spectrum, indicating that corresponding political demands can find approval across party lines. “There seems to be a second dimension here besides the classic left-right division,” says Alois Stutzer, co-author of the study. This dimension does not necessarily relate to traditional boundaries in society or people’s values, but rather the ideas of how the world works. **Does zero-sum thinking make people unhappy?** Examining the connection between zero-sum thinking and satisfaction, the study found that people strongly sharing this mindset are less satisfied with their lives. The authors say they can only speculate about the reasons for this correlation, but the extent is significant. **The study** Thestudy by the University of BaselExternal linktitled “Zero-Sum Beliefs, Political Views, and Life Satisfaction in a Rich Country” is based on the second edition of the survey “How are you, Switzerland?”. This was conducted by the research institute gfs.bern on behalf of the Swiss Broadcasting Corporation (SBC), SWI swissinfo.ch’s parent company, between May and June 2024. Further research would also be desirable on political instrumentalisation of zero-sum thinking. “Politicians could try to exploit this worldview of voters and use it for their own advantage,” says Stutzer. For example, politicians may employ a zero-sum narrative of global trade to justify protectionist trade policies. Or they may try to foster an “us” versus “them” mentality to gain popularity and decrease approval for their opponents. Edited by Balz Rigendinger. Adapted from German by Claire Micallef/ts Once again, we are keen to learn more about the everyday concerns of Swiss residents and Swiss emigrants. Take part in the third wave of our national survey “How are you, Switzerland” by clicking on the following image (the questionnaire is available in the four Swiss national languages): **Articles in this story** Our newsletter on Swiss politics In compliance with the JTI standards More:SWI swissinfo.ch certified by the Journalism Trust Initiative You can find an overview of ongoingdebates with our journalists here. Please join us! If you want to start a conversation about a topic raised in this article or want to report factual errors, email us atenglish@swissinfo.ch. **More** **How are you, Switzerland? Let us know in our 2025 survey** This content was published onMay 15, 2025We want to hear more about our readers’ daily concerns and thoughts on major issues. Take part in our survey and share your views! **More** **Almost half of Swiss citizens are open to holding political office** This content was published onMay 20, 2025Would you consider holding political office? Nearly half of Swiss citizens would, according to a study by the University of Basel. **More** **Honesty over success: the true values of the Swiss population** This content was published onMay 12, 2025Is honesty more important for a satisfied life than success? Yes, according to a major survey by the Swiss Broadcasting Corporation. **More** **Poll: Swiss Abroad pensioners are enthusiastic while workers struggle** This content was published onSep 5, 2024Swiss pensioners abroad are generally happy with their lives but Swiss nationals who live and work overseas are less satisfied than the average citizen. **More** **Poll: Swiss are fed up with social media** This content was published onSep 12, 2024According to the latest figures, social media is being used less. One of the reasons: the platforms are no longer truly social. Follow us Stay informed daily about news in Switzerland with our Briefing in the SWI plus app for the Swiss abroad. Imprint Data Privacy Statement Terms of Use Rights to content and liability Jobs Play SWI About us Annual Report 2024 Newsletters Podcasts Contact SWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR RTS SRF RSI RTR SWI swissinfo.ch - a branch of Swiss Broadcasting Corporation SRG SSR"}