{"id": 1464, "name": "Times of San Diego", "domain": "timesofsandiego.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://timesofsandiego.com/uncategorized/2025/06/11/ntsb-says-it-expects-preliminary-report-on-cessna-crash-off-point-loma-next-month/", "title": "Ntsb Says It Expects Preliminary Report On Cessna Crash Off Point Loma Next Month", "content": "We're now home to seven San Diego Community Newspaper Group newspapers.Read more → **Free neighborhood news in your inbox** Join the 20,000+ people who get Times of San Diego in their inbox at 8 a.m. every day – plus breaking news alerts. We've also added weekly updates from San Diego neighborhoods! By clicking sign up, you agree to theterms. Select below. DONATE NEWSLETTER All topicsOpen dropdown menuArtsBusinessCrimeEducationEventsHealthLifeMilitaryObituariesOpinionPoliticsSportsTech Arts Business Crime Education Events Health Life Military Obituaries Opinion Politics Sports Tech Arts Business Crime Education Events Health Life Military Obituaries Opinion Politics Sports Tech Home Beach & Bay Downtown News La Jolla La Mesa Courier Mission Times Peninsula Beacon Uptown News About Staff Contact Media Kit Real Estate Post an Obituary ASU NEWSWELL Facebook Twitter Instagram RSS About Staff Contact Media Kit Real Estate Post an Obituary ASU NEWSWELL Facebook Twitter Instagram RSS Times of San Diego Local News and Opinion for San Diego DONATE NEWSLETTER All topicsOpen dropdown menuArtsBusinessCrimeEducationEventsHealthLifeMilitaryObituariesOpinionPoliticsSportsTech Arts Business Crime Education Events Health Life Military Obituaries Opinion Politics Sports Tech Arts Business Crime Education Events Health Life Military Obituaries Opinion Politics Sports Tech Home Beach & Bay Downtown News La Jolla La Mesa Courier Mission Times Peninsula Beacon Uptown News **NTSB says it expects preliminary report on Cessna crash off Point Loma next month** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to share on Reddit (Opens in new window)Reddit Click to share on Pinterest (Opens in new window)Pinterest Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print The National Transportation Safety Board said it will continue working to determine why a Cessna 414 with six people on boardcrashedoff the coast of Point Loma on Sunday — but it does not expect to have any updates on the crash until it publishes its preliminary report about a month from now. With the wreckage still resting under a couple hundred feet of water, the NTSB’s investigator isn’t even immediately traveling to where the plane crashed about three miles off the coast of Point Loma. Meanwhile, the Coast Guardsuspended their searchfor the wreckage of the small plane on Tuesday. Authorities have not officially identified the six whodiedin the crash. However, according to theArizona Republic, they have been identified by community reports — and aGoFundMe page— as Ayden Bingham, 21, and his father Jeremy, 48, and brothers Bailey, 26, and Gavin, 24, along with the pilot, Landon Baldwin and his wife, Torrie Baldwin. Their bodies have not been recovered.The plane was scheduled to return to Arizona on Sunday, one day after it flew out to San Diego. A natural supplements company called Optimal Health Systems based in Pima, Arizona, said it sold the plane in 2023 to a group of individuals who are part of their small community.Get neighborhood news in your inbox. It's free and enlightening.Join the 20,000+ people who get Times of San Diego in their inbox at 8 a.m. every day – plus breaking news alerts. We've also added weekly updates from San Diego neighborhoods! By clicking sign up, you agree to theterms. Select below.Email address*Select your neighborhood (optional)La MesaLa JollaMission Times CourierPacific/Mission BeachPoint Loma/OBUptown NewsDowntown NewsNavajo/College AreaNorth CountySouth BayAir traffic controllers quickly became concerned about the plane after it failed to climb over 1,000 feet or turn back east after taking off. The pilot reported having trouble climbing and maintaining his heading before repeatedly calling out “Mayday” before the plane disappeared from radar.This crash came just weeks after a small Cessnacrashedinto a San Diego neighborhood infoggy weatherandkilled six people.Those two are just the latest in a stringof deadly crashes, mishaps and near misses in aviation this year ever since an airlinercollided with an Army helicopterover Washington, D.C., in January, killing 67 people.Associated Press contributed to this article.Before you go ...Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help.San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors.That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today?One-timeMonthlyAnnuallyOne-time$120$180$300OtherDonation amount$Monthly$10$15$25OtherDonation amount per month$Annually$120$180$195OtherDonation amount per year$DONATE NOW The plane was scheduled to return to Arizona on Sunday, one day after it flew out to San Diego. A natural supplements company called Optimal Health Systems based in Pima, Arizona, said it sold the plane in 2023 to a group of individuals who are part of their small community. **Get neighborhood news in your inbox. It's free and enlightening.** Join the 20,000+ people who get Times of San Diego in their inbox at 8 a.m. every day – plus breaking news alerts. We've also added weekly updates from San Diego neighborhoods! By clicking sign up, you agree to theterms. Select below. Air traffic controllers quickly became concerned about the plane after it failed to climb over 1,000 feet or turn back east after taking off. The pilot reported having trouble climbing and maintaining his heading before repeatedly calling out “Mayday” before the plane disappeared from radar. This crash came just weeks after a small Cessnacrashedinto a San Diego neighborhood infoggy weatherandkilled six people. Those two are just the latest in a stringof deadly crashes, mishaps and near misses in aviation this year ever since an airlinercollided with an Army helicopterover Washington, D.C., in January, killing 67 people. Associated Press contributed to this article.Before you go ...Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help.San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors.That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today?One-timeMonthlyAnnuallyOne-time$120$180$300OtherDonation amount$Monthly$10$15$25OtherDonation amount per month$Annually$120$180$195OtherDonation amount per year$DONATE NOW Before you go ... Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help. San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors. That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today? The plane was scheduled to return to Arizona on Sunday, one day after it flew out to San Diego. A natural supplements company called Optimal Health Systems based in Pima, Arizona, said it sold the plane in 2023 to a group of individuals who are part of their small community. **Get neighborhood news in your inbox. It's free and enlightening.** Join the 20,000+ people who get Times of San Diego in their inbox at 8 a.m. every day – plus breaking news alerts. We've also added weekly updates from San Diego neighborhoods! By clicking sign up, you agree to theterms. Select below. Air traffic controllers quickly became concerned about the plane after it failed to climb over 1,000 feet or turn back east after taking off. The pilot reported having trouble climbing and maintaining his heading before repeatedly calling out “Mayday” before the plane disappeared from radar. This crash came just weeks after a small Cessnacrashedinto a San Diego neighborhood infoggy weatherandkilled six people. Those two are just the latest in a stringof deadly crashes, mishaps and near misses in aviation this year ever since an airlinercollided with an Army helicopterover Washington, D.C., in January, killing 67 people. Associated Press contributed to this article.Before you go ...Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help.San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors.That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today?One-timeMonthlyAnnuallyOne-time$120$180$300OtherDonation amount$Monthly$10$15$25OtherDonation amount per month$Annually$120$180$195OtherDonation amount per year$DONATE NOW Before you go ... Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help. San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors. That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today? Before you go ... Thank you for believing in local news. By reading Times of San Diego you're helping build a more informed San Diego.But there's another way you can help. San Diego is home to over 100 distinctive neighborhoods, each with its own personality, charm and challenges. We want to add more reporters and expand into even more neighborhoods to help tell their stories – and bring you more journalism that matters to you and your neighbors. That’s why we’re asking for your readership – and your support.Can you help us reach our $20,000 spring fundraising goal with a donation today? Free neighborhood news in your inbox Join the 20,000+ people who get Times of San Diego in their inbox at 8 a.m. every day – plus breaking news alerts. And we've recently added weekly updates from San Diego neighborhoods – select community news below. Pacific/Mission Beach Downtown La Jolla Uptown Point Loma/OB Navajo/College Area Mission Valley North County South Bay La Mesa Times of San Diego newsletter By clicking sign up, you agree to theterms. **Celebrating dads, grads, and food lovers in Little Italy** **Rep. Sara Jacobs reintroduces My Body, My Data Act in Congress** **Midway District homeless shelter to close in June** **Letter: An ode to the ‘Mayor of Ocean Beach’ – Steve Aldridge** **Twelfth daily round-trip Amtrak rail service added from San Diego to Los Angeles** Facebook Twitter Instagram RSS ABOUTDonateNewslettersCorrections policyContact usAdvertising and sponsorship policiesReader submission guidelines and formPrivacy statementRepublication guidelinesAdditional policies and guidelinesTerms of useDonor transparency **Support Local News** San Diego residents need the truth. Help us report it. Join the growing list of donors investing in our community's long-term future."}