{"id": 1058, "name": "OilPrice", "domain": "oilprice.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://oilprice.com/Latest-Energy-News/World-News/US-Sanctions-Hit-Iranian-Oil-Smuggling-Network-Spanning-UAE-China-and-Hong-K.html", "title": "Us Sanctions Hit Iranian Oil Smuggling Network Spanning Uae China And Hong K.html", "content": "Home Oil Prices Oil Futures Rig Count EnergyEnergy-GeneralOil PricesCrude OilHeating OilGas PricesNatural GasCoalCompany NewsInterviewsGeopolitics Energy-General Oil Prices Crude Oil Heating Oil Gas Prices Natural Gas Coal Company News Interviews Geopolitics Energy-General Oil Prices Crude Oil Heating Oil Gas Prices Natural Gas Coal Company News Interviews Geopolitics Alternative EnergyNuclear PowerSolar EnergyHydroelectricRenewable EnergyGeothermal EnergyWind PowerFuel CellsTidal EnergyBiofuelsEnvironmentGlobal WarmingOil Spills Nuclear Power Solar Energy Hydroelectric Renewable Energy Geothermal Energy Wind Power Fuel Cells Tidal Energy Biofuels EnvironmentGlobal WarmingOil Spills Global Warming Oil Spills Nuclear Power Solar Energy Hydroelectric Renewable Energy Geothermal Energy Wind Power Fuel Cells Tidal Energy Biofuels EnvironmentGlobal WarmingOil Spills Global Warming Oil Spills Global Warming Oil Spills Video Breaking News Premium Articles My Account All Prices OPEC Blends Canadian Blends U.S. Blends Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices Click Here for 150+ Global Oil Prices 1D 1M 3M 1Y Headlines 3 hoursWTI Spikes Nearly 5% as U.S. Embassy Prepares Iraq Evacuation 4 hoursTrump Increasingly Skeptical about Nuclear Deal with Iran 6 hoursTrump Claims China Will Supply Rare Earths to U.S. 7 hoursRussia’s Oil Profits Tumble as Prices Fall and Sanctions Hit 9 hoursShell Set to Add 12 Million Tons of LNG Capacity by 2030 10 hoursEU Set to Allow More Flexible Natural Gas Storage Targets 11 hoursHot Asian Summer Could Further Boost U.S. LNG Exports 12 hoursGerman Startup Raises Record Funds to Advance Nuclear Fusion 13 hoursOPEC Chief Claims Oil Demand Growth Is Here to Stay 15 hoursGM Earmarks $4 Billion for New ICE Car Factories 16 hoursOil Prices Slip Despite U.S.-China Talks 1 dayGasoline, Distillate Builds Spook Oil Markets 1 dayPutin Extends Russian Oil Export Ban to Price Cap Countries Through 2025 1 dayEIA Calls Peak Shale as Drilling Activity Declines 1 dayChina’s Gas Firms Want Power Sector To Prop Up Demand 1 dayJapan Imports Russian Oil for First Time Since 2023 1 dayPermian Oil Producers Face Higher Costs With New Saltwater Rules 1 daySaudi $5 Billion Loan to Nigeria Hangs in the Balance After Crude Prices Plunge 1 dayIndia Solar Power Generation Surges as Coal Makes a Rare Retreat 2 daysBidders Line Up to Buy Macquarie’s $3.6-Billion Industrial Gas Firm 2 daysAsia Energy Imports From the U.S. Slide 2 daysUK to Pour $19 Billion Into Nuclear Power Plant 2 daysUS Solar Finance Trembles As Mosaic Enters Chapter 11 2 daysAmazon Targets Nuclear Energy in $20B Pennsylvania AI Bet 2 daysForeign Investors Are Betting Big on Argentina's Energy Sector 2 daysKenya Plans to Launch Crude Oil Exports in 2026 2 daysBofA: Oil Prices Could Jump on Coming Short Covering 2 daysU.S. Rooftop Solar Giant Sunnova Files for Bankruptcy 2 daysU.S. Solar Growth Faces Tax Credit and Tariff Challenges 3 daysChina’s Exports of Rare Earths Jump Despite Shipment Controls 3 daysCNOOC Installs Record-Breaking Offshore Oil Platform 3 daysChina Imports 18% Less Coal in May 5 daysTrump’s Coal Comeback Goes Global 5 daysU.S. Sanctions Hit Iranian Oil Smuggling Network in Asia 5 daysTrump Administration: Biden’s Fuel Economy Rules Exceeded Authority 5 daysHSBC Sees OPEC+ Output Hikes Weighing on Oil Prices in Late 2025 5 daysSpain Halts Oil Imports From Venezuela as U.S. Sanctions Come Into Effect 5 daysAfrica’s Biggest Refinery Boosts U.S. Crude Oil Purchases 5 daysIndia’s Top Private Refiners Boost Domestic Sales as Export Margins Drop 5 daysBusinesses Urge UK to Cut Energy Costs for Industry **Breaking News:** WTI Spikes Nearly 5% as U.S. Embassy Prepares Iraq Evacuation Find us on: **Russia Plans Eight Nuclear Plants in Iran** Russia has agreed to build… **Natural Gas Boom to Heat Up in Texas** Production of associated natural gas… Home Latest Energy News Julianne Geiger Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info **Share** Facebook Twitter Linkedin Reddit **Related News** Hot Asian Summer Could Further Boost U.S. LNG Exports German Startup Raises Record Funds to Advance Nuclear Fusion OPEC Chief Claims Oil Demand Growth Is Here to Stay GM Earmarks $4 Billion for New ICE Car Factories Oil Prices Slip Despite U.S.-China Talks **U.S. Sanctions Hit Iranian Oil Smuggling Network in Asia** The U.S. Treasury Department has unleashed a sweeping wave of sanctions targeting a sprawling network of companies and individuals accused of facilitating Iranian oil and petrochemical exports in violation of existing sanctions. The action, announced Friday, strikes at the financial and logistical infrastructure underpinning Iran’s shadow energy trade—particularly its crude exports to Asia. At the center of the designations is Nasser Zarrin Ghalam and Partners Company, based in Tehran, which U.S. authorities say orchestrates illicit petroleum transactions through a web of front companies. Dozens of these entities are registered in Hong Kong, the United Arab Emirates, and Iran, often using aliases and shell addresses to obscure Iranian origins and enable oil shipments through falsified documentation. Two UAE-based firms—ACE Petrochem FZE and Moderate General Trading LLC—were sanctioned for their direct links to the National Iranian Tanker Company (NITC), a blacklisted entity central to Iran’s crude oil export apparatus. Both firms are alleged to facilitate crude transport and payments through maritime and financial routes designed to evade detection. Another key entity, Kimia Sadr Pasargad Company, headquartered in Tehran, was identified as a critical player in Iran’s petrochemical export sector. It, too, now faces secondary sanctions, cutting it off from dollar-based transactions and threatening foreign partners with penalties. Hong Kong served as the financial nerve center for much of the operation. Shell companies such as PrettyAndy Trading Limited (a.k.a. Ragang Petroleum and Logistics Co.) and Golden Pen General Trading LLC were cited for their role in laundering proceeds and masking cargo origins. Friday’s move signals Washington’s intent to tighten the noose on Iran’s sanctioned oil flows at a time when Tehran is reportedly increasing exports to China and other Asian buyers via intermediaries. With global oil markets tightening and enforcement fatigue rising, the U.S. appears determined to disrupt Iran’s energy workaround networks—especially those with reach into major Asian trading hubs. By Julianne Geiger for Oilprice.com More Top Reads From Oilprice.com Permian or Bust? U.S. Oil Growth Has a One-Basin Problem Trump Administration to Roll Back Biden’s Curbs on Alaska Oil Drilling Iraq Says Kurdistan Is Legally Responsible for Oil Smuggling Join the discussion|Back to homepage Previous Post Trump Administration: Biden’s Fuel Economy Rules Exceeded Authority Next Post Trump’s Coal Comeback Goes Global **Julianne Geiger** Julianne Geiger is a veteran editor, writer and researcher for Oilprice.com, and a member of the Creative Professionals Networking Group. More Info **Related posts** **Russia’s Oil Profits Tumble as Prices Fall and Sanctions Hit** **Russia’s Oil Profits Tumble as Prices Fall and Sanctions Hit** **Shell Set to Add 12 Million Tons of LNG Capacity by 2030** **Shell Set to Add 12 Million Tons of LNG Capacity by 2030** **EU Set to Allow More Flexible Natural Gas Storage Targets** **EU Set to Allow More Flexible Natural Gas Storage Targets** **Leave a comment** **Most Popular** Phillips 66 to Lay Off Most Workers at Los Angeles Refinery Phillips 66 to Lay Off Most Workers at Los Angeles Refinery Elon Musk Says Oil Is “Small-Time” Elon Musk Says Oil Is “Small-Time” U.S.-Canada Trade Strains Alter Trans Mountain Oil Flows U.S.-Canada Trade Strains Alter Trans Mountain Oil Flows Saudi Arabia and Kuwait Announce New Oil Discovery Saudi Arabia and Kuwait Announce New Oil Discovery Germany Shifts Stance on Nuclear Power in EU Policy Germany Shifts Stance on Nuclear Power in EU Policy ADVERTISEMENT **Most Commented** Diplomacy Fails To Yield Breakthrough In Russia-Ukraine War Diplomacy Fails To Yield Breakthrough In Russia-Ukraine War The Return of Peak Oil The Return of Peak Oil OPEC+ Gives Up Trying To Boost Prices. What’s Next? OPEC+ Gives Up Trying To Boost Prices. What’s Next? Russia’s Oil Export Revenue Plunges to Near Two-Year Low Russia’s Oil Export Revenue Plunges to Near Two-Year Low More About Us About Us Site News Sitemap Advertise with us Site info Terms & Conditions Disclaimer Privacy Policy Contact Us ©OilPrice.com The materials provided on this Web site are for informational and educational purposes only and are not intended to provide tax, legal, or investment advice. Nothing contained on the Web site shall be considered a recommendation, solicitation, or offer to buy or sell a security to any person in any jurisdiction. Merchant of Record: A Media Solutions trading as Oilprice.com"}