{"id": 1830, "name": "USA Conservative Report", "domain": "usaconservativereport.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://usaconservativereport.com/2017/06/angelina-jolie-islam-beautiful-religion-americans-must-take-muslim-refugees-obligation/", "title": "Angelina Jolie Islam Beautiful Religion Americans Must Take Muslim Refugees Obligation", "content": "DOJ Asks for Information on 1.3 Million Visitors to Anti-Trump Protest Organizing Website Obama Former Spokesman Spills The Beans On How Obama Screwed Up With North Korea Bill Maher Wants The Stock Market To Crash So It Will Hurt Trump BREAKING!!! British Spy Points at McCain in Russia-Trump FAKE Dossier Case Lindsey Graham Accuses President Trump Of Having A Friendship With White Supremacists **Conservative Report** **** **Conservative Report** **** Home US Politics World Politics Entertainment **Angelina Jolie: Islam Is â\u0080\u0098Beautiful Religionâ\u0080\u0099; Americans MUST take in Muslim Refugees Because Itâ\u0080\u0099s Their â\u0080\u0098Obligationâ\u0080\u0099** US Politics American esteems require the affirmation of more Muslim outcasts, announced big name liberal Angelina Jolie at an Islamic occasion on Monday in Virginia. The Hollywood face of the UNâ\u0080\u0099s exile organization, she joined Secretary of State John Kerry in pushing for the resettlement of a huge number of Muslim displaced people in the US. No thought of option territorial resettlement alternatives for Middle Eastern or African outcasts was made by either Jolie or Kerry. Conveying Muslim exiles to the US realizes American esteems, guaranteed Jolie. Before a for the most part Muslim group of onlookers, she surrounded the UNâ\u0080\u0099s outcast motivation as an activity in philanthropy. The occasion was facilitated by the All Dulles Area Muslim Society (ADAMS), a subsidiary of the Islamic Society of North America (ISNA), which is associated with the Muslim Brotherhood. Angelina Jolie with John Kerry addressing journalists at the Department of State on Monday â\u0080\u009cIt is our commitment as Americans to make a country that respects those getting away from affliction,â\u0080\u009d said Jolie. â\u0080\u009cEscaping their homes not by decision but rather in light of the fact that it is essential for their survival. An awesome America is a merciful America.â\u0080\u009d Unfit â\u0080\u009cdiffering qualitiesâ\u0080\u009d fortified America, asserted Jolie. â\u0080\u009cWhen we are at our most grounded, it is the point at which we draw on our differing qualities as a people to discover solidarity in light of our normal esteems and our bigger personality,â\u0080\u009d proclaimed Jolie. â\u0080\u009cWe are not solid regardless of our differences, we are solid as a result of it.â\u0080\u009d Recasting Islamic psychological oppression as â\u0080\u009crough radicalism,â\u0080\u009d Jolie conveyed an undefined expression instituted by the Obama Administration with the end goal of denying the marvelâ\u0080\u0099s ideological and religious measurements. Without explicitly recognizing Islam, Jolie discredited endeavors to â\u0080\u009cdemonizeâ\u0080\u009d the â\u0080\u009clovely religion.â\u0080\u009d **Comments** comments **Post navigation** Oprah Winfrey: â\u0080\u009cWhite older people have to dieâ\u0080\u009dOprah Winfrey is looked up to by millions of mindless f... BREAKING:Trey Gowdy`s Missing Son Found IN DC Garbage ContainerTerrence Vaughan Martin Gowdy ,Trey Gowdys 8-year-o... Halle Berry Whines That Her High School Was â\u0080\u009cRacistâ\u0080\u009d, Then Her Classmates Told The TruthMulti-millionaire biracial actress Halle Berry has an A... SHOCKING!!! Huge Fast Food Chain Says â\u0080\u009cI Donâ\u0080\u0099t Serve Copsâ\u0080\u009d, Will You Boycott Them?Dunkinâ\u0080\u0099 Donuts dererves aÂ boycott!!! It is bad when ... Left-Wing Berkeley Thugs Threaten Man Holding US Flag. They Quickly Learn It Was A Bad Decision.The left-wing accuses the right-wing of being violent y... BREAKING: SEVERAL SHIPS ARE PREPARING FOR MUSLIMS DEPORTATION NEXT WEEK. DO YOU SUPPORT THIS?SEND THEM BACK TO THEIR COUNTRIES WHERE THEY CAN PRACTI... Obama Stole $1 BILLION From Social Security, Gave It To THIS Group!Unlawful migration. Controlling it prompts taking care ... Gorka Crushes MSNBCâ\u0080\u0099s Ali Velshi And Stephanie Ruhle For Telling Him Not To Say â\u0080\u009cIslamic Terrorismâ\u0080\u009dEven after President Trump has been President for 8 mon... MASSIVE SCANDAL: Investigators Discovered Something Sinister About The Obama White HousePresident Trumpâ\u0080\u0099s team of investigators just found some... BREAKING Obama Rules, Trump Bombs Mosque Killing Isisâ\u0080\u0099 Entire Iraqi LeadershipObamaâ\u0080\u0099s old rules of Mosques being off limits is off th..."}