{"id": 876, "name": "Market Realist", "domain": "marketrealist.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://marketrealist.com/what-was-the-value-of-1986-1987-michael-jordan-basketball-cards-sticker-on-antiques-roadshow/", "title": "What Was The Value Of 1986 1987 Michael Jordan Basketball Cards Sticker On Antiques Roadshow", "content": "**'Antiques Roadshow' guest gasps in disbelief after hearing the real value of her $12 basketball cards** Playing cards aren't usually the kind of item that one would expect to find on \"Antiques Roadshow,\" but guests are now open to exploring the value of collectibles on the show. The owner of Michael Jordan's three rookie cards from 1986 to 1987, who got them for $12, was hoping to get $1,000 for the set when she walked into \"Antiques Roadshow.\" However, the show's expert, Jasmani Francis, revealed that the true value was much higher at a whopping $45,000. In the episode, the guest shared the loving story of how she and her son bought the rare basketball cards. \"My son went to a school system that was city-based, and we lived in the county, and it was kind of too far to go back home between events. So I would take him to school, and then I would pick him up afterwards. Then we would kill a couple of hours for their next event before we had to go drive home. So we would spend our time at baseball card shops. He decided to collect some Michael Jordan,\" she told Francis. \"Michael Jordan's rookie cards is what you've got here. Two of them, the first two, and then the third one here is the next year's card, 1987. Jordan was a rookie in '84, but we deem the '86 Fleer cards his rookie cards,\" the expert then explained. He further added that it was the first printed iteration of his rookie card came in 1984, but the Starr set wasn't licensed at the time. Later on, Fleer obtained the license, and in 1986, it became his official, formal rookie card. \"It came from that '86 Fleer set. You have them together, which is nice. Now, most collectors, and certainly the savvy ones, aren't going to peel that. They're going to leave it right there. The third one is the next year. It's another important card, featuring a gray border at the top. It's a pretty popular card for card collectors,\" he explained. He added that the guest's cards needed to be graded to certify them on a scale. \"There's mint ten or gem mint ten, and all the way down to, to, to nothing, to one, and to poor and things like that,\" Francis added. He said while the cards weren't graded, he and his colleagues had a discussion, and they were confident that the cards weren't in poor condition by any stretch. \"We're estimating that, that these are, let's call them average, for lack of a better description. Not as low as a five grade, maybe as high as an eight or seven,\" he said. He told the guest that the two cards with the '86 sticker and the '87, together, had an insurance value of about $10,000 to $15,000. This was enough to make the guest gasp and say, \"Wow!\" Moving forward, Francis said, \"Now, the other one, the prices are starting to normalize. The values are starting to come down. Still, I think, and we're talking insurance value, you can probably insure that one safely for $20,000 to $30,000.\" At this point, the owner of the collection was gasping for air. \"Wow, I had no idea,\" she said with a trembling voice. \"Yeah, that, that $20 investment in hanging-out time,\" Francis added. In the end, the guest thanked the appraiser for sharing the staggering estimation. \"I was thinking, honestly, maybe $1,000 for the three,\" she said in the end."}