{"id": 1542, "name": "VTDigger", "domain": "vtdigger.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://vtdigger.org/2025/06/11/federal-lawsuit-accuses-consolidated-communications-of-failing-to-pay-technicians-overtime-in-vermont-new-hampshire-and-maine/", "title": "Federal Lawsuit Accuses Consolidated Communications Of Failing To Pay Technicians Overtime In Vermont New Hampshire And Maine", "content": "**Can Vermont stay livable for everyone? Help launch our new affordability beat.Your gift will be matched.** Donate Vermont v. Trump Jobs Government & Politics Economy Environment Education Health Public Safety Life & Culture Podcasts Latest Stories Opinion Obituaries Donate Buy merch! Share a tip About us Contact Advertise **Follow along** Facebook Instagram YouTube X LinkedIn **Member-supported journalism. Informing and engaging Vermont.** Podcasts Latest Stories Opinion Obituaries Donate Buy merch! Share a tip About us Contact Advertise **Follow along** Facebook Instagram YouTube X LinkedIn **Member-supported journalism. Informing and engaging Vermont.** VTDigger News in pursuit of truth Donate Vermont v. Trump Jobs Government & Politics Economy Environment Education Health Public Safety Life & Culture **Federal lawsuit accuses Consolidated Communications of failing to pay technicians overtime in Vermont, New Hampshire and Maine** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Click to email a link to a friend (Opens in new window)Email Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on WhatsApp (Opens in new window)WhatsApp Consolidated Communications has been hit with a proposed collective and class action lawsuit alleging that the telecommunications giant does not give overtime pay to its technicians in Vermont and two other northern New England states in violation of state and federal laws. David Russell and John Orton III, two former Consolidated Communications technicians who worked for the company in Vermont, New Hampshire and Maine, made the allegations in a complaint filed Tuesday in U.S. District Court in Burlington. Consolidated Communications provides internet and telephone service to households and businesses throughout Vermont and across the U.S., often operating under the brand name Fidium Fiber. The company offers high-speed broadband internet access forover 130,000 Vermontersand is the state’s largest landline telecommunications provider. According to the complaint, the company primarily pays its technicians on a “piece-rate” basis, meaning they are given a flat rate per specific task they complete, such as home internet setups and fiber optic cable installations. Technicians can also earn an hourly wage for certain repair work they complete. But even though technicians typically work at least 65 hours a week, the complaint claims, those flat and hourly rates are set “without accounting for overtime compensation at all” and do not go up once employees exceed a traditional 40-hour workweek. For the company’s wage practices in Vermont, New Hampshire and Maine, the lawsuit accuses the Consolidated Communications of violating the federal Fair Labor Standards Act, the Vermont Employment Practices Act and the New Hampshire and Maine wage laws, all of which require employers to pay overtime wages at a rate of at least 1.5 times an employee’s regular wage. While working with Consolidated Communications, the lawsuit claims, Russell and Orton earned no overtime wages despite working for 65 and 70 hours a week on average, respectively. The two men worked for Consolidated at various points between 2020 and 2024, a time period during which the company invested heavily to extend its fiber optic network in Vermont. The lawsuit identifies one week in May 2023 in which Orton worked nearly 75 hours without any corresponding increase in his pay rate. Calculating Orton’s average wage for the pay period, the complaint claims that, based on the overtime rate required by federal and state law, the technician should have been given over $4,800 in overtime for that week alone. “Hard-working Technicians provide critical telecommunications services to Defendants’ customers throughout the Northeast. Yet, these Defendants have failed to pay them their earned overtime wages,” Stephen Ellis, a Burlington-based lawyer representing Russell and Orton, wrote in a statement. “No one should be denied their earned wages and we look forward to holding these Defendants accountable in court.” A spokesperson for Consolidated Communications said the company could not comment on the ongoing lawsuit. State and federal laws exempt certain categories of employees from overtime pay requirements, including some administrative roles and salespeople who earn commissions, as well as outside contractors. One question that the courts will likely have to tackle is whether technicians working for Consolidated Communications could theoretically fall under such an exemption. According to the complaint, Russell and Orton, as well as many other northern New England technicians for Consolidated Communications, were hired through a company called Conexa Technologies, which is named as a co-defendant. “Together,” the complaint says, “Defendants supervise and control all aspects of their employment of Technicians.” The complaint asks the court to allow the lawsuit to move forward as both a class action and collective action case, meaning that other technicians employed by the company in Vermont, New Hampshire and Maine could join the suit and collectively seek damages. The lawsuit also asks the court to require Consolidated Communications to change its overtime wage policy and to give all technicians involved in the case their owed overtime wages plus interest. According to the complaint, about 500 technicians could feasibly join the suit, potentially putting Consolidated Communications and Conexa on the hook for hundreds of thousands of dollars in damages. Vermont’s affordability crisis affects us all — but not in the same way.That’s why VTDigger is launching a new reporting beat focused on wealth, poverty and economic opportunity across the state. Report for America will partially fund this new role, but they require the remainder come from our community.A generous Vermont donor has stepped up to MATCH ALL GIFTS received by Saturday, June 14. Will you help us launch this critical reporting position? No gift is too big or too small — and today, it will be doubled. Sincerely, Neal Goswami, Managing Editor, VTDigger **Latest stories** **MicroMoo transit service in Brattleboro is set to end June 13** **Vermont Conversation: As Vermonters go hungry, the Trump administration threatens cuts to food assistance** **Vermont joins multistate lawsuit to protect 23andMe users’ private genetic information** Vermont's newsletter Request a correction Submit a tip **Habib Sabet** VTDigger's business and general assignment reporter.More by Habib Sabet **Member-supported journalism. Informing and engaging Vermont.** **VTDigger** Become a member Ways to give Newsletters Job board Buy merch! Contact us Share a tip Advertise **Topics** Government & Politics Economy Environment Education Health Public Safety Life & Culture **Info** About Meet our team Careers FAQ Community News Sharing Project Policies **Counties** Addison Bennington Caledonia Chittenden Essex Franklin Grand Isle Lamoille Orange Orleans Rutland Washington Windham Windsor **** **** ****"}