{"id": 2124, "name": "Sentinel KSMO", "domain": "sentinelksmo.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sentinelksmo.org/taskforce-debates-validity-graduation-rate/", "title": "Taskforce Debates Validity Graduation Rate", "content": "Home News Editorial Get Involved About Donate Home News Editorial Get Involved About Donate **Keeping Media and Government Accountable.** **Education Funding Task Force debates validity of graduation rate against plummeting college readiness** Celebration of a stunning increase in a one-year graduation rate at Wichita Southeast High School came crashing down as reports surfaced ofgrade tamperingleading to the five percentage point rise in graduation numbers. The high school principal was removed, and the district issued a statement assuring patrons that this wrongdoing was confined to the 2024-25 school year: “…Recently, some anomalies at Southeast High School came to light. District administration has reviewed and corrected data to ensure accurate information is reported to the state. Less than 10 records were changed and, at this point, there is no indication of data inaccuracies in past years… WPS (Wichita Public Schools) leadership is developing processes to ensure the systemic integrity of data to remove this type of concern in the future.” The scandal erupted as a select group of lawmakers and state education officials gathered in Topeka as part of an Education Funding Task Force, and the controversy was among issues discussed. Rep. Kristey Williams, Chair of the House Government Oversight Committee, and formerly head of the K-12 Education Budget Committee, said the Southeast High School incident casts a shadow on the use of graduation rates to measure a school’s achievement: “They (Southeast High administration) were really promoting the idea that their graduation rates had improved by 5%. And then I just go and look online to pull up that particular school’s results, and they’re almost twice as bad as our state’s for the lowest category. I just pulled up ELL (English Language Learners) and in 2024, 76% of their ELL students in this particular school, where graduation rates were (supposedly) climbing, were below grade level. If I looked at Free-and-Reduced-Lunch students in the same category; we’re talking about 55% were below grade level. “So, yes, there are multiple ways (to determine a school’s success), but one way that I wouldn’t use is graduation rates, because graduation rates are not correlated at all. I mean, if we want a babysit, that’s one thing, and we want to have a safe place for them, that’s one thing. But that doesn’t mean you’re learning anything, and I think we can look at this. If there’s another form other than the NAEP (National Assessment of Educational Progress) or the ACT (American College Testing) or the state assessment that we need to be looking at, it just has to be quantifiable.” When the 2024 Southeast High graduates were in the 10th grade in 2022, 66% were below grade level in math, and 63% were below grade level in English language arts. Results are similar for 10th-graders in 2024, making it highly unlikely that the 2024 outcomes for Southeast graduates were much different than those in 2022. Fellow committee member Dr. Frank Harwood, Deputy Commissioner for the Kansas Department of Education, disagreed with Williams: “I would push back a little bit on not using graduation rate. Rep. Williams talked yesterday about At-Risk and Free-Lunch numbers going up and needing to change economic drivers in the state. The number one education driver that has to do with economics is graduation, right? And so I do think from that perspective, graduation rate is something that is usable and that the idea that that districts and teachers are artificially inflating credits in order to increase graduation rates; did it happen in this situation? Maybe so, but I think when you look at any industry, including the legislature, there are bad actors that you have to do things around. It doesn’t mean you should throw out that metric altogether.” The exchange between Williams and Harwood beginshereat the 4:26:30 mark. The stated high schoolgraduation rate goalset by the Kansas Education Department is 95%. The most recent statistic as of 2023 pegs the rate at 89%. Check out your district’s graduation and dropout rates for the last three yearshere. The issue of inflated graduation rates was the subject of testimony earlier this year to the Kansas House K-12 Education Budget Committee by Dave Trabert, CEO of the Kansas Policy Institute, which owns ofThe Sentinel. Trabert provided charts showing that graduation rates increased to 89% since 2015, while ACT college readiness plummeted from 32% to 18%. Trabert says the decline in college readiness renders graduation rates meaningless: “A high school diploma used to be an indicator of what students know and are able to do, but now it is more akin to an attendance certificate. Many school districts give diplomas to students even though they cannot read or do math at grade level. A diploma might get you in the door to a job interview, but getting and keeping the job depends on one’s ability. The Kansas Department of Education touting graduation rates is more about making the system look good at students’ expense.” **Related Articles** KC Star: government institutions matter, not studentsThe Missouri Legislature put student needs first in passing the state’s first school choice program,… Kansas tries to reduce standards to make achievement look betterThe Kansas Department of Education dumbed down achievement standards about 20 years ago under No… More false claims from SUBV on spending and achievementThe activists of Stand Up Blue Valley (SUBV) are working hard to protect the bureaucracy… **Post Tags** **Get The Sentinel Newsletter** **Support The Sentinel** The Sentinelis a 501(c)3 non-profit organization that holds government and media accountable for providing complete, accurate and unbiased information so that citizens can make their own informed decisions. We encourage readers to share story ideas by visiting the Get Involved page and hope you will consider supporting our work by visiting the Donate page. Contact us:news@sentinelks.org **Follow Us**"}