{"id": 731, "name": "Jyllands-Posten", "domain": "jyllands-posten.dk", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://jyllands-posten.dk/indland/ECE18225832/hvad-goer-vi-hvis-lyset-slukker-jesper-florin-har-brugt-20-aar-paa-at-finde-svaret-men-et-scenarie-giver-ham-stadig-soevnloese-naetter/", "title": "Hvad Goer Vi Hvis Lyset Slukker Jesper Florin Har Brugt 20 Aar Paa At Finde Svaret Men Et Scenarie Giver Ham Stadig Soevnloese Naetter", "content": "**Hvad gør vi, hvis lyset slukker? Jesper Florin har brugt 20 år på at finde svaret. Men ét scenarie giver ham stadig søvnløse nætter** Krig og krise er det altdominerende tema på årets Folkemøde – og med god grund, mener Jesper Florin, der med et særligt krigsspil vil forberede danskerne på krisens alvor. Men trods hans egne simulationer holder ét urovækkende katastrofescenarie ham stadig vågen om natten. Når politikere, professorer, meningsdannere og menige mennesker stimler sammen til årets udgave af Folkemødet på Bornholm, hænger et overskyggende emne som en mørk sky over solskinsøen. Kriseberedskab. Kast et blik på årets program, og se en perlerække af arrangementer med dette fokus. Beredskabsstyrelsens ”Klar i en krisetid”, Hjemmeværnets ”Er vi krisebevidste eller krisetrætte?” og Dansk Industris ”Hvad skal vi spise, hvis forsyningskæden knækker?”. Blandt de mere kulørte er arrangementet “Wargames: Strømmen er gået!”, der er arrangeret af Dansk Brand- og Sikringsteknisk Institut (DBI). Her skal gæsterne udføre et såkaldt “krigsspil”, der tager udgangspunkt i et scenarie, hvor krisen har ramt Danmark, og strømmen er gået i hele Jylland. Blandt arrangementets deltagere er Jesper Florin, der er afdelingsleder ved Sikrings- og Resiliensafdelingen hos DBI, og han håber, krigsspillet kan få alvoren til at dæmre hos danskerne. Allerede abonnent? Log ind her Log ind her Få adgang til artikler på jp.dk Betal medMobilePay Grundlagt i 1871 **Adresser:** **Kontakt:** Jyllands-Posten:87 38 38 38 Jyllands-Posten:87 38 38 38 JP kundeservice:87 38 37 37 JP kundeservice:87 38 37 37 **Udgiver:** JP/Politikens Hus **Redaktionen:** **For annoncører:** **Køb abonnement** **Køb abonnement** **JP Aurora** **JP Aurora** **Om avisen:** **Ansv. chefredaktør:** Marchen Neel Gjertsen (barsel) Carsten Ellegaard Christensen (konst.) **For abonnenter:** © Alt materiale på denne side er omfattet af gældende lov om ophavsret.Læs om reglerne her. **Familien før alt og arbejde i døgndrift:Den cocktail har gjort fynsk par fra arbejderklassen til mangemillionærer** **Familien før alt og arbejde i døgndrift:Den cocktail har gjort fynsk par fra arbejderklassen til mangemillionærer** **Familiebil banker Porsche og Lotus:Den slår alle ved ladestanderen, og danskere kan købe den nu** **Familiebil banker Porsche og Lotus:Den slår alle ved ladestanderen, og danskere kan købe den nu** **Notat afslører:Så hårdt kan landmænd piskes til at omlægge marker til natur** **Notat afslører:Så hårdt kan landmænd piskes til at omlægge marker til natur** **Hun beskrives som et muntert og venligt menneske:31-årig pædagog er seneste offer for »epidemi« af børnevold i Frankrig** **Hun beskrives som et muntert og venligt menneske:31-årig pædagog er seneste offer for »epidemi« af børnevold i Frankrig** **Lyssky metoder i politiet får flere eksperter til at advare om en potentielt større skandale** **Lyssky metoder i politiet får flere eksperter til at advare om en potentielt større skandale** **Overset hovedstad er postkortsmuk, og du kan komme dertil på 12 timer med tog** **Overset hovedstad er postkortsmuk, og du kan komme dertil på 12 timer med tog** **TV 2 har afsløret en politiskandale– og smadret sin egen troværdighed** **TV 2 har afsløret en politiskandale– og smadret sin egen troværdighed** Tor Illum Johannesson Lederskribent **Bliver dit hus oversvømmet?Nu kommer der gratis hjælp fra uventet kant** **Bliver dit hus oversvømmet?Nu kommer der gratis hjælp fra uventet kant** **Henrik Sass Larsen går efter at blive frifundet ved at bruge særligt greb** **Henrik Sass Larsen går efter at blive frifundet ved at bruge særligt greb** **Brian Wilson fra The Beach Boys er død** **Brian Wilson fra The Beach Boys er død** **Danmarks stærkeste pengeinstitut:Besøg af Finanstilsynet giver ridser i lakken** **Danmarks stærkeste pengeinstitut:Besøg af Finanstilsynet giver ridser i lakken** **Kommune fraråder at bade ved havn** **Kommune fraråder at bade ved havn** **Vingegaard slog Pogacar i vigtig Tour-test – men deres fælles rival var endnu stærkere** **Vingegaard slog Pogacar i vigtig Tour-test – men deres fælles rival var endnu stærkere** **Donald Trump reagerer på Elon Musks undskyldning** **Donald Trump reagerer på Elon Musks undskyldning**"}