{"id": 2161, "name": "Express Tribune", "domain": "tribune.com.pk", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://tribune.com.pk/story/2550340/nintendo-switch-2-sales-hit-35-million-in-4-days-as-demand-overwhelms-us-and-japan-retailers", "title": "Nintendo Switch 2 Sales Hit 35 Million In 4 Days As Demand Overwhelms Us And Japan Retailers", "content": "US Today's Paper | June 12, 2025 | ePaper home Entertainment **Nintendo Switch 2 sales hit 3.5 million in 4 days as demand overwhelms U.S. and Japan retailers** Nintendo Switch 2 breaks launch records with 3.5 million units sold, causing widespread shortages across retailers. Nintendo has reported record-breaking early sales for its new Switch 2 console, with over 3.5 million units sold in just four days following its June 5 launch. The strong debut has led to stock shortages at major U.S. retailers including Walmart, GameStop, Target, and Best Buy, according to their online platforms. While Nintendo has set a sales goal of 15 million units by the end of its fiscal year in March 2026, some analysts believe this target underestimates ongoing demand. Serkan Toto, CEO of gaming consultancy Kantan Games, told CNBC that all indicators pointed to high interest before launch, and he expects additional sales records to be broken in the coming months. David Gibson of MST Financial echoed this, projecting 20 million units sold within the first year. The Switch 2, Nintendo’s first major hardware release in eight years, features several key upgrades over its predecessor, including a larger screen, improved processing power, and a new GameChat2 function that enables voice and video chat. It retails in the U.S. for $449, making it the company’s most expensive console to date. Despite Nintendo’s efforts to prepare sufficient inventory for launch, demand has outpaced supply—especially in Japan. Company President Shuntaro Furukawa revealed that more than 2.2 million people in Japan registered for a lottery to purchase the console on launch day. While shortages are more severe in Japan, Toto noted that global availability appears better managed compared to the 2017 launch of the original Switch. Further complicating supply and pricing are ongoing U.S. trade tariffs, which have already impacted Nintendo’s preorder strategy. In April, the company delayed U.S. preorders while it assessed tariff impacts. Gibson suggested that resolving these issues could eventually lead to lower U.S. prices. COMMENTS Comments are moderated and generally will be posted if they are on-topic and not abusive. For more information, please see ourComments FAQ **** **Entertainment** **Doechii caught on video shouting at assistants before Met Gala 2025 appearance** **Doechii caught on video shouting at assistants before Met Gala 2025 appearance** 'Practical Magic 2' starring Bullock, Kidman gets official release dateUpdated May 07, 2025Sandra Bullock and Nicole Kidman reunite for Practical Magic 2, set to hit theatres September 18, 2026. **'Practical Magic 2' starring Bullock, Kidman gets official release date** Updated May 07, 2025 Sandra Bullock and Nicole Kidman reunite for Practical Magic 2, set to hit theatres September 18, 2026. **'Practical Magic 2' starring Bullock, Kidman gets official release date** **'Practical Magic 2' starring Bullock, Kidman gets official release date** Updated May 07, 2025 Sandra Bullock and Nicole Kidman reunite for Practical Magic 2, set to hit theatres September 18, 2026. Smokey Robinson sued for alleged sexual assault and harassment in $50M LA civil caseUpdated May 07, 2025Four former employees file a civil lawsuit against Smokey Robinson alleging decades long rape, harassment, and abuse. **Smokey Robinson sued for alleged sexual assault and harassment in $50M LA civil case** Updated May 07, 2025 Four former employees file a civil lawsuit against Smokey Robinson alleging decades long rape, harassment, and abuse. **Smokey Robinson sued for alleged sexual assault and harassment in $50M LA civil case** **Smokey Robinson sued for alleged sexual assault and harassment in $50M LA civil case** Updated May 07, 2025 Four former employees file a civil lawsuit against Smokey Robinson alleging decades long rape, harassment, and abuse. YNW Melly requests pretrial release on bond in double-murder caseUpdated May 07, 2025Rapper YNW Melly seeks bond as he awaits retrial in double murder case; judge’s decision expected in the coming days. **YNW Melly requests pretrial release on bond in double-murder case** Updated May 07, 2025 Rapper YNW Melly seeks bond as he awaits retrial in double murder case; judge’s decision expected in the coming days. **YNW Melly requests pretrial release on bond in double-murder case** **YNW Melly requests pretrial release on bond in double-murder case** Updated May 07, 2025 Rapper YNW Melly seeks bond as he awaits retrial in double murder case; judge’s decision expected in the coming days. Is an 'Elden Ring' movie in the works? The truth behind the Alex Garland and A24 film rumoursUpdated May 07, 2025A report linking Alex Garland and A24 to an Elden Ring movie circulated online, but is there any truth to it? **Is an 'Elden Ring' movie in the works? The truth behind the Alex Garland and A24 film rumours** Updated May 07, 2025 A report linking Alex Garland and A24 to an Elden Ring movie circulated online, but is there any truth to it? **Is an 'Elden Ring' movie in the works? The truth behind the Alex Garland and A24 film rumours** **Is an 'Elden Ring' movie in the works? The truth behind the Alex Garland and A24 film rumours** Updated May 07, 2025 A report linking Alex Garland and A24 to an Elden Ring movie circulated online, but is there any truth to it? Barry Diller, husband of Diana von Fürstenberg, comes out as gayUpdated May 07, 2025Barry Diller reveals sexuality and reflects on decades-long romance with Diane von Fürstenberg in upcoming memoir. **Barry Diller, husband of Diana von Fürstenberg, comes out as gay** Updated May 07, 2025 Barry Diller reveals sexuality and reflects on decades-long romance with Diane von Fürstenberg in upcoming memoir. **Barry Diller, husband of Diana von Fürstenberg, comes out as gay** **Barry Diller, husband of Diana von Fürstenberg, comes out as gay** Updated May 07, 2025 Barry Diller reveals sexuality and reflects on decades-long romance with Diane von Fürstenberg in upcoming memoir. **LATEST** Willem Dafoe eyed for Scrooge in Warner Bros. remake of ‘A Christmas Carol’ Veteran actor Harris Yulin dies at 87 due to cardiac arrest Harvey Weinstein convicted of sexual assault in retrial after jury infighting Toxic nitric acid leak at Ohio plant forces evacuations and flight ban Robyn Lively supports Blake after Justin Baldoni lawsuit dismissal Pope Leo XIV wears White Sox hat at Vatican in viral moment **MOST READ** Govt proposes income tax relief for salaried class Finance minister unveils Rs17.6tn budget, targets 4.2% growth Anti-digital, pro-realty sector budget Budget 2025-26 proposes relief for corporate, real estate sectors Thousands of tourists flock to Jab Valley Natalie Reynolds seen distraught outside TikTok HQ after account ban linked to controversial prank video **OPINION** India, ISKP and BLA: Pakistan's multi-front security challenge Military notes of Indo-Pak conflict — the rundown Green economy: beneficiaries and losers Newer world order in Trump era — and Pakistan Relevance of 'The Responsibility of Intellectuals' by Chomsky Muted mandate: SAARC and the cycle of Indo-Pak escalation Pakistan Business World Opinion Life & Style T.Edit Sports Blog Videos Prayer Timing Pakistan Ramazan Calendar Pakistan Weather Forecast Pakistan Karachi Weather Lahore Weather Islamabad Weather About Us Online Advertising RSS Feeds Subscribe to the Paper Contact Us Careers Cricket News Football News UFC News NBA News NFL News WWE News Style Guide Privacy Policy Copyright Code of ethics Mobile App **FOLLOW US** facebook twitter youtube linkedin instagram This material may not be published, broadcast, rewritten, redistributed or derived from. Unless otherwise stated, all content is copyrighted © 2025 The Express Tribune."}