{"id": 1531, "name": "VeryWell Fit", "domain": "verywellfit.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.verywellfit.com/green-mediterranean-diet-pros-cons-and-what-you-can-eat-5498870", "title": "Green Mediterranean Diet Pros Cons And What You Can Eat 5498870", "content": "FitnessActivewearBeginnersWalkingRunningStrength Activewear Beginners Walking Running Strength Activewear Beginners Walking Running Strength NutritionWeight ManagementNutrition FactsNutrition BasicsDietsMeal PlansMeal Delivery ServicesView All Weight Management Nutrition Facts Nutrition Basics Diets Meal Plans Meal Delivery Services View All Weight Management Nutrition Facts Nutrition Basics Diets Meal Plans Meal Delivery Services View All What to BuyFitness GearApparel & AccessoriesFootwear Fitness Gear Apparel & Accessories Footwear Fitness Gear Apparel & Accessories Footwear ToolsRecipe Nutrition CalculatorWeight Loss Calorie GoalBMI CalculatorBody Fat Percentage CalculatorCalories Burned by ActivityDaily Calories BurnedPace Calculator Recipe Nutrition Calculator Weight Loss Calorie Goal BMI Calculator Body Fat Percentage Calculator Calories Burned by Activity Daily Calories Burned Pace Calculator Recipe Nutrition Calculator Weight Loss Calorie Goal BMI Calculator Body Fat Percentage Calculator Calories Burned by Activity Daily Calories Burned Pace Calculator About UsEditorial ProcessMeet Our Review Board Editorial Process Meet Our Review Board Editorial Process Meet Our Review Board FitnessActivewearBeginnersWalkingRunningStrengthView All Activewear Beginners Walking Running Strength View All Activewear Beginners Walking Running Strength View All NutritionWeight ManagementNutrition FactsNutrition BasicsDietsMeal PlansMeal Delivery ServicesView All Weight Management Nutrition Facts Nutrition Basics Diets Meal Plans Meal Delivery Services View All Weight Management Nutrition Facts Nutrition Basics Diets Meal Plans Meal Delivery Services View All What to BuyFitness GearApparel & AccessoriesFootwearView All Fitness Gear Apparel & Accessories Footwear View All Fitness Gear Apparel & Accessories Footwear View All Vegetarian Vegan Keto Diet Diet Comparisons Recipe Nutrition Calculator Weight Loss Calorie Goal BMI Calculator Body Fat Percentage Calculator Calories Burned by Activity Daily Calories Burned Pace Calculator Why BMI May Not Be the Best Metric Apps, Classes, and Memberships Is Lemon Water Good for You? Fitness and Nutrition News About Us Editorial Process Review Board **What Is the Green Mediterranean Diet?** fcafotodigital / Getty Images Background The 7-Day Diet Plan What You Can Eat What You Cannot Eat How to Prepare Pros Cons Is It Right for You? At Verywell, we believe there isno one-size-fits-all approach to a healthy lifestyle. Successful eating plans need to be individualized and take the whole person into consideration. Prior to starting a new diet plan, consult with your healthcare provider or a registered dietitian, especially if you have an underlying health condition. **What Is the Green Mediterranean Diet?** The green Mediterranean diet is a “greener” version of the Mediterranean diet. Created by researchers, the diet emphasizes plant foods and limits meat and poultry intake.You must also consumegreen tea,walnuts, and a plant-based, protein-rich shake daily when following the green Mediterranean diet. Though the green Mediterranean diet hasn’t been reviewed. The 2021U.S. News and World Report Best Dietsranks theMediterranean dietnumber one Best Diets Overall, giving it an overall score of 4.2/5. **What Experts Say** \"Research shows that diets restricting food types and quantities don't work long-term for 95% of people and often lead to increased food cravings and weight cycling. I don't recommend individuals follow any prescriptive diet, including the \"green\" Mediterranean diet, unless the diet is medically necessary due to food allergies or intolerances or a medical condition that requires the elimination of certain foods. However, it can be helpful to take some food additions that are part of particular diets and incorporate them into a well-rounded lifestyle. For example, consuming more walnuts provides fiber, omega-3 fats, and vitamins and minerals, and trying more meals with fish as the protein source may boost omega-3 fat intake and reduce saturated fat consumption. If green tea is something you enjoy drinking, adding it to your diet may provide beneficial antioxidants that may positively impact brain health and combat stress and inflammation. Duckweed is not yet widely available or readily accessible, so it may or may not make sense to experiment with adding it to your diet. In general, adding more 'greens' to your meals and snacks, can add key nutrients that many standard American diets are lacking.\" —Autumn Rauchwerk, MS, RDN, RYT **The 7-Day Diet Plan** The green Mediterranean diet is a plant-focused plan that includes green tea, walnuts, and a high-protein, plant-based shake. There’s no set meal pattern for the diet. However, the diet requires 3 to 4 cups of green tea, 1 ounce of walnuts, and 100-gram frozen cubes of Wolffia globosa (Mankai duckweed)—the plant-based high-protein shake—daily. Day 1: Green tea, high-protein plant-based shake;cottage cheeseand fruit; leafy greens with walnuts, beans, and olive oil; roasted chicken and broccoli Day 2: Green tea, high-protein plant-based shake; yogurt with walnuts; grilledsalmonand spinach; whole grain and bean salad with olive oil Day 3: Green tea, high-protein plant-based shake; scrambled eggs with whole-grain toast; tuna salad with apples and walnuts; grilled veggie sandwich Day 4: Green tea, high-protein plant-based shake; oatmeal made with milk, dried fruit, and walnuts;hummus, pita bread, and carrot sticks; broiled sardines with a tomatoes, onions, and cucumbers Day 5: Green tea, high-protein plant-based shake; whole-grain toast with nut butter; whole-wheat penne pasta with walnutpesto sauce; grilled chicken with red peppers and zucchini Day 6: Green tea, high-protein plant-based shake; Greek yogurt with berries; chickpea stew; walnut-crusted salmon with a mixed green salad Day 7: Green tea, high-protein plant-based shake; spinach omelet with feta cheese; grilled tomatoes, eggplant, and mushrooms with a lentil and walnut salad; whole-wheat pasta with roasted red peppers **What You Can Eat** The green Mediterranean diet includes nutrient-rich options from all of the food groups. The diet encourages more vegetables, fruits, olive oil, and nuts. Fish and poultry are allowed in small quantities. The diet discourages red meat, refined grains, and processed foods. Here is what you can eat on the green Mediterranean diet. **Fruits and Vegetables** Fruits and vegetables are the mainstay of the green Mediterranean diet.You can eat any fruit or vegetable you want as long as it’s not processed or high in salt or sugar. **Grains** The green Mediterranean diet encourageswhole grainsover refined grains.Examples include whole oats, barley,bulgur, millet, and brown rice, Whole-wheat bread, pasta, and crackers as well as popcorn also would be included. **Protein** The green Mediterranean diet encourages lean sources of protein and plant proteins instead of red meat. Protein foods includeeggs, poultry, seafood, beans and peas, nuts and seeds, and duckweed. **Dairy** Yogurt, cheese, and milk are part of the green Mediterranean diet. However, these foods are recommended in moderation. **Healthy Fats** The diet recommends consuming 1 ounce of walnuts everyday.Walnuts are a plant-source ofomega-3 fatty acids. Olive oil, olives, and other vegetable oils are also allowed on the green Mediterranean diet, along with other nuts and seeds. **What You Cannot Eat** The green Mediterranean diet includes a mix of nutrient-rich foods from all the food groups. However, the diet discourages red meat, processed foods, and added sugar.Here is a look at what you cannot eat on the green Mediterranean diet. **Processed Fruits and Vegetables** Fresh, frozen, and canned fruits and vegetables without added sugar or salt are acceptable options on the green Mediterranean diet. However, you may need to avoid processed fruits and vegetables such as jams and jellies, dried fruit with added sugar, and frozen vegetable mixes with added sauces. **Refined Grains** Whole grains are allowed on the green Mediterranean diet, but you can’t eat refined grains likewhite flour, white bread, grits, white rice and pasta, as well as crackers and boxed cereal. **Red Meats and Processed Meats** Plant-based proteins are highly encouraged on the green Mediterranean diet. Though you’re allowed to eat fish and poultry, the diet suggests you consume these proteins in limited amounts. Proteins not allowed on the diet include beef, lamb, pork, luncheon meats, processed meats (hot dogs), and bacon. **Processed Dairy** You need to avoid highly processed dairy foods on this diet plan. This might include fruit yogurt, ice cream, processed cheeses, and pudding. **Fats** The green Mediterranean diet encourages plant-based fats like walnuts and olive oil. You need to avoid fried foods, butter, lard, margarine, and shortening. **How to Prepare the Green Mediterranean Diet and Tips** The green Mediterranean diet is part of DIRECT-PLUS (Dietary Intervention Randomized Clinical Trial Polyphenols Unprocessed Study) randomized clinical controlled trial.This 18-month study included 294 adults who were randomly assigned to follow a standard healthy diet, the Mediterranean diet, or the green Mediterranean diet. The green Mediterranean diet portion of the study is rich in plants andpolyphenolsand low in simple carbohydrates and processed meats. The researchers provided diet and lifestyle guidance to the participants following the greener diet, including advice on a calorie-restricted diet. When following the green Mediterranean diet, you must consume 1 ounce of walnuts, 3 to 4 cups of green tea, and 100 grams of the frozen duckweed protein cubes everyday.Duckweed protein cubes can be hard to find, but can sometimes be purchased online or from a specialty health food store. The diet's researchers suggest that people consume the high-protein plant shake at dinner, serving as a partial substitute for red meat. **Polyphenols** Polyphenols are compounds found in plants that may play a role in the many health benefits that plant foods offer. Current research indicates that regular consumption of polyphenols may help regulate metabolism and prevent chronic diseases.The green Mediterranean diet includes walnuts, green tea, and the plant-based protein shake because they’re rich in polyphenols. **Wolffia Globosa Duckweed** Wolffia globosa duckweed is a water plant rich in high-quality protein. This means it's a plant-food that contains all of the essential amino acids like animal proteins. The plant is also a source of omega-3 fatty acids, dietary fiber, vitamin B12, iron, and polyphenols.In Asian cooking, Wolffia globosa is called a vegetable meatball. **Plant-Based Proteins** Plant-based proteins include vegetables, beans, peas, nuts, seeds, and grains. In addition to Wolffia globosa, soy foods like tofu and tempeh are plant-based proteins that contain all of the essential amino acids. **Eating in Moderation** The green Mediterranean diet suggests consuming dairy foods in moderation. This means not over-consuming and only eating the amount your body needs. In general, adults need three servings of dairy foods, or plant-based alternatives, a day where one serving equals 1 cup of milk or yogurt or 1.5 ounces of cheese. **Pros of Green Mediterranean Diet** Researchers are in the early stages of investigating the potential health benefits of the green Mediterranean diet. This high-polyphenol diet may benefit heart health, gut health, and brain aging. Here is what you need to know. **May Benefit Heart Health** A 2020 study published in the scientific journalHeartinvestigated the effects of the green Mediterranean diet versus the traditional Mediterranean diet onheart healthin a group of adults with high cholesterol. The researchers found that the green Mediterranean achieved more significant improvements in cholesterol and blood pressure than the traditional Mediterranean diet.They suggested that the green Mediterranean diet may prove to offer more benefits to heart health than the traditional Mediterranean diet. **May Promote Gut Health** The green Mediterranean diet also seems to have a positive impact on gut health, according to a 2022 study published inGenome Medicine. Most of the polyphenols you eat are metabolized in the microbiome, which is the city of microorganisms that live in your gut and may have a significant influence over your health. In this study, the researchers found that the green Mediterranean diet created significant changes in the composition and function of the gut microbiome. They suggest these changes may explain why the green Mediterranean diet is more beneficial to heart-health than the traditional Mediterranean diet. **May Impact Brain Aging** Your brain shrinks (brain atrophy) as you get older, which may play a role in age-related cognitive changes like memory loss and difficulty learning new things.But eating a diet filled with polyphenols may help. According to a 2022 clinical study published in theAmerican Journal of Clinical Nutrition, there’s evidence that the nutrient-rich green Mediterranean diet may protect against this age-related brain atrophy and the cognitive changes that come with it. **Cons of Green Mediterranean Diet** Overall, the green Mediterranean diet doesn’t appear to pose any health risks. However, the diet requires consumption of certain foods and recommends avoiding others. Though not highly restrictive, these “rules” can make this diet hard to follow long-term. Diet and restriction seem to go hand-in-hand. But diet is simply a term that describes what and how you eat. A true diet has no beginning or end, no good and bad foods, and no restrictions, unless medically necessary. Here are dome drawbacks to the green Mediterranean diet. **Poses Some Restrictions** The green Mediterranean diet suggests avoiding red meat and processed foods and eating more plant-based foods. These food restrictions make the green Mediterranean diet hard to follow for an extended period of time. Plus, having a list of “good” and “bad” foods may lead to cravings and overeating. **Offers Limited Sources for Wolffia Globosa** The high-protein, plant-based shake is a major part of the green Mediterranean diet. However, you may have a hard time finding Wolffia globosa at your local health food store or online retailer. And, because it’s not readily available, it may be pricey and may put a big dent in your food budget since you need to consume it daily. **Creates Challenges for Those With Food Allergies** Tree nuts are a common food allergen.If you have an allergy to nuts, then you cannot eat walnuts, which are an essential part of the green Mediterranean diet. Green tea also may pose an issue. Though generally considered safe, you want to check with a healthcare provider before making green tea a regular part of your diet. Green tea can interact with certain medications, potentially making them more or less effective.You also need to talk to your provider about whether it is safe for you to drink green tea if you’re pregnant or nursing. **Is the Green Mediterranean Diet a Healthy Choice for You?** The green Mediterranean diet includes a wide array of nutrient-rich foods from all the good groups, but recommends avoiding specific foods. The U.S. Dietary Guidelines recommend following a dietary pattern that includes nutrient-dense foods that fit your tastes, traditions, and budget. Talk to a healthcare provider or a registered dietitian to help you determine what type of eating plan makes the best choice for you. The green Mediterranean diet is a relatively nutritious dietary pattern, but may not fit your tastebuds, food traditions, or budget. The green Mediterranean diet is a supercharged version of the Mediterranean diet that encourages more plant foods and less meat. Current research indicates that this diet may provide some health benefits. However, the green Mediterranean diet has very specific rules about the foods you can eat and the foods you can’t eat. These types of restrictions can make this diet plan difficult to follow long-term. **A Word From Verywell** When it comes to diets, you certainly have a number of options. However, a diet isn’t a quick fix or a short-term plan. The green Mediterranean diet is a balanced plan that encourages nutrient-rich foods. However, the diet may not work for everyone because of the foods you need to include and the ones you need to avoid. Remember, following a long-term or short-term diet may not be necessary for you and many diets out there simply don’t work, especially long-term. While we do not endorse fad diet trends or unsustainable weight loss methods, we present the facts so you can make an informed decision that works best for your nutritional needs, genetic blueprint, budget, and goals. If your goal is weight loss, remember that losing weight isn’t necessarily the same as being your healthiest self, and there are many other ways to pursue health. Exercise, sleep, and other lifestyle factors also play a major role in your overall health. The best diet is always the one that is balanced and fits your life Nutrition Diets British Medical Journal (BMJ).Green Mediterranean (‘green Med’) diet may be even better for health. British Medical Journal (BMJ).Green Mediterranean (‘green Med’) diet may be even better for health. British Medical Journal (BMJ).Green Mediterranean (‘green Med’) diet may be even better for health. U.S. News and World Report.Mediterranean diet. U.S. News and World Report.Mediterranean diet. U.S. News and World Report.Mediterranean diet. Tsaban G, Yaskolka Meir A, Rinott E, et al.The effect of green Mediterranean diet on cardiometabolic risk; a randomised controlled trial[published online ahead of print, 2020 Nov 23].Heart. 2020;heartjnl-2020-317802. doi:10.1136/heartjnl-2020-317802 Tsaban G, Yaskolka Meir A, Rinott E, et al.The effect of green Mediterranean diet on cardiometabolic risk; a randomised controlled trial[published online ahead of print, 2020 Nov 23].Heart. 2020;heartjnl-2020-317802. doi:10.1136/heartjnl-2020-317802 Tsaban G, Yaskolka Meir A, Rinott E, et al.The effect of green Mediterranean diet on cardiometabolic risk; a randomised controlled trial[published online ahead of print, 2020 Nov 23].Heart. 2020;heartjnl-2020-317802. doi:10.1136/heartjnl-2020-317802 Oldways Cultural Food Traditions.Mediterranean diet. Oldways Cultural Food Traditions.Mediterranean diet. Oldways Cultural Food Traditions.Mediterranean diet. Kaplan A, Zelicha H, Yaskolka Meir A, et al.The effect of a high-polyphenol Mediterranean diet (Green-MED) combined with physical activity on age-related brain atrophy: the Dietary Intervention Randomized Controlled Trial Polyphenols Unprocessed Study (DIRECT PLUS).Am J Clin Nutr. 2022;115(5):1270-1281. doi:10.1093/ajcn/nqac001 Kaplan A, Zelicha H, Yaskolka Meir A, et al.The effect of a high-polyphenol Mediterranean diet (Green-MED) combined with physical activity on age-related brain atrophy: the Dietary Intervention Randomized Controlled Trial Polyphenols Unprocessed Study (DIRECT PLUS).Am J Clin Nutr. 2022;115(5):1270-1281. doi:10.1093/ajcn/nqac001 Kaplan A, Zelicha H, Yaskolka Meir A, et al.The effect of a high-polyphenol Mediterranean diet (Green-MED) combined with physical activity on age-related brain atrophy: the Dietary Intervention Randomized Controlled Trial Polyphenols Unprocessed Study (DIRECT PLUS).Am J Clin Nutr. 2022;115(5):1270-1281. doi:10.1093/ajcn/nqac001 Cory H, Passarelli S, Szeto J, Tamez M, Mattei J.The role of polyphenols in human health and food systems: A mini-review.Front Nutr. 2018;5:87. doi:10.3389/fnut.2018.00087 Cory H, Passarelli S, Szeto J, Tamez M, Mattei J.The role of polyphenols in human health and food systems: A mini-review.Front Nutr. 2018;5:87. doi:10.3389/fnut.2018.00087 Cory H, Passarelli S, Szeto J, Tamez M, Mattei J.The role of polyphenols in human health and food systems: A mini-review.Front Nutr. 2018;5:87. doi:10.3389/fnut.2018.00087 Sela I, Yaskolka Meir A, Brandis A, et al.Wolffia globosa-Mankaiplant-based protein contains bioactive vitamin B12 and is well absorbed in humans.Nutrients. 2020;12(10):3067. doi:10.3390/nu12103067 Sela I, Yaskolka Meir A, Brandis A, et al.Wolffia globosa-Mankaiplant-based protein contains bioactive vitamin B12 and is well absorbed in humans.Nutrients. 2020;12(10):3067. doi:10.3390/nu12103067 Sela I, Yaskolka Meir A, Brandis A, et al.Wolffia globosa-Mankaiplant-based protein contains bioactive vitamin B12 and is well absorbed in humans.Nutrients. 2020;12(10):3067. doi:10.3390/nu12103067 European Food Information Council.Plant-based protein: All you need to know to get enough of it. European Food Information Council.Plant-based protein: All you need to know to get enough of it. European Food Information Council.Plant-based protein: All you need to know to get enough of it. Cornell University.What is eating in moderation?. Cornell University.What is eating in moderation?. Cornell University.What is eating in moderation?. USDA, MyPlate.Dairy. USDA, MyPlate.Dairy. USDA, MyPlate.Dairy. Rinott E, Meir AY, Tsaban G, et al.The effects of the Green-Mediterranean diet on cardiometabolic health are linked to gut microbiome modifications: a randomized controlled trial.Genome Med. 2022;14(1):29. doi:10.1186/s13073-022-01015-z Rinott E, Meir AY, Tsaban G, et al.The effects of the Green-Mediterranean diet on cardiometabolic health are linked to gut microbiome modifications: a randomized controlled trial.Genome Med. 2022;14(1):29. doi:10.1186/s13073-022-01015-z Rinott E, Meir AY, Tsaban G, et al.The effects of the Green-Mediterranean diet on cardiometabolic health are linked to gut microbiome modifications: a randomized controlled trial.Genome Med. 2022;14(1):29. doi:10.1186/s13073-022-01015-z University of Georgia.5 dangers of following fad diets. University of Georgia.5 dangers of following fad diets. University of Georgia.5 dangers of following fad diets. American College of Allergy, Asthma, and Immunology.Tree nuts. American College of Allergy, Asthma, and Immunology.Tree nuts. American College of Allergy, Asthma, and Immunology.Tree nuts. National Institutes of Health.Green tea. National Institutes of Health.Green tea. National Institutes of Health.Green tea. USDA.Dietary Guidelines for Americans, 2020-2025, 9th Edition. USDA.Dietary Guidelines for Americans, 2020-2025, 9th Edition. USDA.Dietary Guidelines for Americans, 2020-2025, 9th Edition. ByJill Corleone, RDJill is a registered dietitian who's been learning and writing about nutrition for more than 20 years. Thank you, {{form.email}}, for signing up. There was an error. Please try again. Fitness Nutrition Weight Loss Meet Our Review Board About Us Editorial Process Privacy Policy In the News Advertise Terms of Service Careers Contact Your Privacy Choices"}