{"id": 1618, "name": "WTHR - Indianapolis News", "domain": "wthr.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wthr.com/article/sports/nba/indiana-pacers/nba-finals-indiana-pacers-oklahoma-city-thunder-preview-tyrese-haliburton-myles-turner-pascal-siakam-shai-gilgeous-alexander-odds-match-up-schedule/531-6581e3b8-d188-442a-b365-7fcaf0c4debc", "title": "Nba Finals Indiana Pacers Oklahoma City Thunder Preview Tyrese Haliburton Myles Turner Pascal Siakam Shai Gilgeous Alexander Odds Match Up Schedule", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalINDYtodayStateNear MeCrime13 InvestigatesWhat's The Deal?Nation / WorldTrending / ViralEntertainmentBusinessFeaturesLatest News Stories'Insult on top of injury' | 2 people captured on video driving through west Indy laundromat in ATM smash-and-grabGame 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup Back Local INDYtoday State Near Me Crime 13 Investigates What's The Deal? Nation / World Trending / Viral Entertainment Business Features 'Insult on top of injury' | 2 people captured on video driving through west Indy laundromat in ATM smash-and-grab Game 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup Back Local INDYtoday State Near Me Crime 13 Investigates What's The Deal? Nation / World Trending / Viral Entertainment Business Features 'Insult on top of injury' | 2 people captured on video driving through west Indy laundromat in ATM smash-and-grab Game 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup WeatherBackForecastLive Doppler 13 RadarInteractive Radar10-DayClosings/DelaysBlogMapsTraffic13 Weather AcademyLatest Weather StoriesKnozone Action Day issued for Indianapolis Thursday due to ground-level ozone forecast13Weather afternoon forecast | Wednesday, June 11, 2025 Back Forecast Live Doppler 13 Radar Interactive Radar 10-Day Closings/Delays Blog Maps Traffic 13 Weather Academy Knozone Action Day issued for Indianapolis Thursday due to ground-level ozone forecast 13Weather afternoon forecast | Wednesday, June 11, 2025 Back Forecast Live Doppler 13 Radar Interactive Radar 10-Day Closings/Delays Blog Maps Traffic 13 Weather Academy Knozone Action Day issued for Indianapolis Thursday due to ground-level ozone forecast 13Weather afternoon forecast | Wednesday, June 11, 2025 SportsBackHigh School SportsLocal SportsColtsPacersFeverOperation FootballIndy IndiansIndycarIndy FuelIndy ElevenMotor SportsLocked On Podcast NetworkLatest StoriesNCAA announces new rule changes for men's and women's basketballGame 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup Back High School Sports Local Sports Colts Pacers Fever Operation Football Indy Indians Indycar Indy Fuel Indy Eleven Motor Sports Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Game 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup Back High School Sports Local Sports Colts Pacers Fever Operation Football Indy Indians Indycar Indy Fuel Indy Eleven Motor Sports Locked On Podcast Network NCAA announces new rule changes for men's and women's basketball Game 3: Pacers aren't 100% but are set to play host to Thunder in pivotal NBA Finals matchup SearchSearch:Search Advertise With Us Live Doppler 13 Radar 13 Investigates Chuck's Big Adventure Indiana Fever What's The Deal Consumer Reports Traffic Real Men Wear Gowns Celebrating Diversity Send The Love 13 Weather Academy Inspiring Indiana TV Schedule Meet The Team 13INside Track Download the news app FCC Public File EEO Public File Closed Captioning Help **What you need to know about the Pacers' NBA Finals games against the Thunder** **** To stream 13 WTHR on your phone, you need the 13 WTHR app. **** **Download the 13 WTHR app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video INDIANAPOLIS —GAME 1 RECAP: Haliburton caps huge rally with winning jumper as Pacers stun Thunder 111-110 in Game 1 GAME 2 RECAP: Thunder open another big lead and keep control, topping Pacers 123-107 to even NBA Finals TheIndiana Pacersare heading to the NBA Finals to face theOklahoma City Thunder. It's Indiana's first finals appearance since 2000, and only the second appearance in franchise history! The Pacersbattled to overcome theMilwaukee Bucks,Cleveland CavaliersandNew York Knicksto make it to the highest stage in the NBA. Now, they face a team that is widely believed to be the best in the NBA, and maybe one of the best in the history of the league. They are led by the league MVP and feature a killer offense and even better defense. Here's what you need to know about the Thunder, how they match up against the Pacers and how Indiana made history getting here. **Catching up on a stunning playoff run** Very few people predicted the Pacers making it to the NBA Finals.The Cleveland Cavaliers and the Boston Celtics were the favorites to represent the Eastern Conference for the entire season. But the Celtics lost their star, Jayson Tatum, to an Achilles injury. The Cavs then ran into the Pacers. Many dismissed the Pacers'run to the Eastern Conference Finals last seasonas a fluke that came from playing injured Bucks and Knicks teams. This series, though, the Bucks had their star tandem of Giannis Antetokounmpo and Damian Lillard for much of the first round, and it didn't stop the Pacers from beating them in a 4-1 gentleman's sweep. **** To stream 13 WTHR on your phone, you need the 13 WTHR app. **** **Download the 13 WTHR app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video The Cleveland Cavaliers were the number one seed in the East, and had only one injury (Darius Garland's toe sprain) heading into the series. But even when Garland came back, the Cavaliers were still caught off guard by the Pacers. The series was highlighted byTyrese Haliburton's stunning buzzer beater off of his own missed free throwto beat the Cavs at home in Game 2. The Pacers then went on to win the series 4-1. The New York Knicks were the third seed heading into the ECF and favorites to beat the Pacers. Right off the bat though, Indiana stole Game 1 in a historic rally (or collapse, if you're a Knicks fan) that saw the Pacers erase a 14-point lead in less than three minutes to force overtime.Haliburton again hit a key shot and used Reggie Miller's infamous \"choke\" taunt in celebration. The Knicks went on to win one in Indiana and one at home, but ultimately lost the series in Game 6. **Who are the Oklahoma City Thunder?** Just as the Cavs and Celtics were favorites to win the ECF, the Thunder have been the favorites to win it all the entire season. The Thunder have gotten to the Finals with a season-long dominance built on a historic defense. The Thunder are the first team to hold opponents to under 80 points in three separate games. OKC is led by the league MVP, Shai Gilgeous-Alexander (\"SGA\"), who was the league's leading scorer. The 26-year-old Canadian plays point guard and averaged 39 points per game in the two meetings between the Thunder and the Pacers this year. Luguentz Dort is the other main guard for the Thunder. He's not the threat that SGA is, but he averaged 17 points per game against Indiana this season, and shot more than 41% from behind the 3-point line. At forward, Jalen Williams has been a prolific scorer for the Thunder, averaging 21 points a game in the regular season. Chet Holmgren is the starting power forward for OKC; he averaged 15 points and 8 rebounds per game in the regular season. Isaiah Hartenstein is a returning playoff villain for Pacers fans. He plays center for the Thunder, but last season, he played for the Knicks. He isn't a big scorer, but he averaged 10 rebounds per game in the regular season, an area where the Pacers have struggled. **How have the Pacers fared against the Thunder this season?** Indiana and Oklahoma City squared off twice during the regular season, with the Thunder winning both times. On Dec. 26, SGA scored 45 points as the Thunder erased an early double-digit Pacers lead to win 120-114. Andrew Nembhard scored 23 for the Pacers, while Haliburton was held to a mere four points. On March 29, SGA led in scoring again with 33 points as the Thunder picked up their ninth straight win, 132-111. Haliburton led the Pacers with 18 points. **** To stream 13 WTHR on your phone, you need the 13 WTHR app. **** **Download the 13 WTHR app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video **Do the Pacers have a chance?** Not much of one, according to Las Vegas. According tothe sports betting site DraftKings, the Thunder have an 87.5% chance of winning the Finals. On paper, OKC is indeed a very tough matchup with excellent defense and Gilgeous-Alexander's incredible playmaking ability. Although, the matchup isn't quite as lopsided as it may seem. After the All-Star break, the Thunder had a defensive rating of 110.4. That means for every 100 possessions, they gave up 110 points to opponents. In that same period, the Pacers had a defensive rating of 111.5, so they gave up just one more point per 100 possessions than the Thunder. **** To stream 13 WTHR on your phone, you need the 13 WTHR app. **** **Download the 13 WTHR app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Oklahoma City has also had a lot of success forcing turnovers and scoring off of them, averaging 23.8 points per game that way. But the Pacers are one of the best teams in the league at limiting those points, allowing just 15. One place where the Pacers have a significant leg up on the Thunder is behind the arc. The Pacers shot 40.1% from three in the playoffs. That was the best in the league by a good amount, and much better than the 33.6% number the Thunder posted. In short? The Thunder have a very good defense that feasts on turnovers. The Pacers also have a very good defense and don't give up many points on turnovers. The Pacers have also been on fire from three, while the Thunder have struggled. The Thunder are still heavy favorites to win the championship, but Pacers certainly have a chance. **What happened the last time the Pacers made it this far?** The only other time the Pacers made it to the NBA Finals was in 2000, when they ran into the Hall of Fame combination of Shaquille O'Neal and Kobe Bryant being coached by Phil Jackson. The Pacers, led by Reggie Miller and coached by Larry Bird, put up a fight, but lost in six games to the Lakers, 4-2. Shaq had a monstrous performance in the Finals, averaging 38 points, 16 rebounds and two blocksper game. The 1999-2000 season was the Pacers' first playing at what's now Gainbridge Fieldhouse (Conseco Fieldhouse at the time). And it was Bird's last as head coach — he resigned shortly after the season, following through on a promise to only coach for three years. **What's the series schedule?** The best-of-seven series will be played in a 2-2-1-1-1 format,meaning the Pacers will host Game 3, Game 4 and Game 6 (if necessary) at Gainbridge Fieldhouse. Here's the breakdown: Game 1: Pacers win 111-110 Game 2: Sunday, June 8, 8 p.m. ET Game 3: Wednesday, June 11, 8:30 p.m. ET Game 4: Friday, June 13, 8:30 p.m. ET Game 5*: Monday, June 16, 8:30 p.m. ET Game 6*: Thursday, June 19, 8:30 p.m. ET Game 7*: Sunday, June 22, 8 p.m. ET (bold:home games; *: if necessary) **Pacers watch parties** The Pacers are hosting watch parties at Gainbridge Fieldhousefor the road games in the series, beginning with Game 1 on Thursday, June 5. General admission tickets (which are $5 and go to the Pacers Foundation) are required to enter, with a four-ticket limit per person. Limited complimentary parking will be available in the Virginia Avenue garage, while supplies last. Tickets for the Game 1 watch party go on sale at 10 a.m. June 4. Doors open at 7:30 p.m. June 5 ahead of the 8:30 p.m. tipoff. Tickets for the Game 2 watch party will go on sale at 10 a.m. Friday, June 6. More watch party ticket information can be found atthis link. **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}