{"id": 449, "name": "Florida Politics", "domain": "floridapolitics.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://floridapolitics.com/archives/742556-budget-conference-hillsborough-community-college-lands-2-5m-for-new-plant-city-center-but-its-half-what-they-requested/", "title": "742556 Budget Conference Hillsborough Community College Lands 2 5m For New Plant City Center But Its Half What They Requested", "content": "Home Elections2026New Administration 2026 New Administration 2026 New Administration Culture Wars Legislative CommunitiesPanhandleNE FloridaJaxOrlandoTampa BaySt. PeteSW FloridaSouth Florida Panhandle NE Florida Jax Orlando Tampa Bay St. Pete SW Florida South Florida Panhandle NE Florida Jax Orlando Tampa Bay St. Pete SW Florida South Florida Federal Foreign Affairs Emails & Opinions Subscribe **Budget conference: Hillsborough Community College lands $2.5M for new Plant City center, but it’s half what they requestedImage via Adobe.** Ben Albritton Daniel Alvarez Daniel Perez Danny Burgess Hillsborough Community College **Related Articles** Hillsborough County Community College has secured $2.5 million in the proposed budget, according to the educationcapital outlay projects funded listreleased Monday evening. The request is half of what the school had requested for the project. Sen.Danny Burgessand Rep.Daniel Alvarezeach filed appropriations requests (HF 2546andSF 2159) seeking $5 million to establish a Workforce Education Center in Plant City, providing education and economic development opportunities through comprehensive training for high-wage careers in health care, business, and technology. The requested funds were for planning, design and engineering for the workforce center, which is being developed to meet workforce needs by filling instructional space gaps in eastern Hillsborough County. In addition to training opportunities, the facility will also provide professional development for local industries and offer student services, including academic advising, financial aid, veterans’ services, counseling, and career resources, according to the appropriations requests. While it’s not the complete ask, the $2.5 million included in the budget comes after the House included that amount in its proposed budget. The Senate had initially not included any funding for the project. Not funded in the latest list is $7.3 million, which the House had included in its budget for Hillsborough Community College’s renovation project of its technology building at the school’s Dale Mabry campus in Tampa. Elsewhere in the budget, negotiations continue in Tallahassee, with offers going back and forth between the chambers as they iron out the remaining differences. Senate PresidentBen Albrittonand House SpeakerDaniel Perezexpect to finalize a budget and send it to Gov.Ron DeSantisby June 16, which would require them to reach consensus on all necessary items by June 13 to accommodate the required 72-hour cooling-off period. Janelle Irwin Taylor has been a professional journalist covering local news and politics in Tampa Bay since 2003. Most recently, Janelle reported for the Tampa Bay Business Journal. She formerly served as senior reporter for WMNF News. Janelle has a lust for politics and policy. When she’s not bringing you the day’s news, you might find Janelle enjoying nature with her husband, children and two dogs. You can reach Janelle at[email protected]. **Leave a ReplyCancel Reply** Your email address will not be published. Required fields are marked * Save my name, email, and website in this browser for the next time I comment. Notify me of new posts by email. Post Comment Study: Tampa has highest rate of property tax increase among major U.S. cities Another delay: Miami-Dade’s upgraded South Corridor service now expected to roll in late Summer James Uthmeier warns retailers not to use tariffs to justify ‘price gouging’ U.S. launches $8M project in Panama to swap Chinese equipment for American-made tech Gov. DeSantis names 12 to Judicial Nominating Commissions — including Jason Gonzalez, Nick Meros 2026 APolitical Communities Culture Wars Education Emails & Opinions Federal Foreign Affairs FP Plus Headlines Immigration Enforcement Influence Jax Local NE Florida New Administration Olympics Orlando Panhandle South Florida Special Reports St. Pete SW Florida Tallahassee Tampa Bay Tech Uncategorized Florida Politics is a statewide, new media platform covering campaigns, elections, government, policy, and lobbying in Florida. This platform and all of its content are owned by Extensive Enterprises Media. Publisher: Peter Schorsch @PeterSchorschFL Contributors & reporters: Phil Ammann, Drew Dixon, Roseanne Dunkelberger, Liam Fineout, A.G. Gancarski, Ryan Nicol, Jacob Ogles, Cole Pepper, Andrew Powell, Jesse Scheckner, Janelle Taylor, Drew Wilson, and Mike Wright. Email:[email protected]Twitter: @PeterSchorschFLPhone: (727) 642-3162Address: 204 37th Avenue North #182St. Petersburg, Florida 33704 Home Elections2026New Administration 2026 New Administration 2026 New Administration Culture Wars Legislative CommunitiesPanhandleNE FloridaJaxOrlandoTampa BaySt. PeteSW FloridaSouth Florida Panhandle NE Florida Jax Orlando Tampa Bay St. Pete SW Florida South Florida Panhandle NE Florida Jax Orlando Tampa Bay St. Pete SW Florida South Florida Federal Foreign Affairs Emails & Opinions Subscribe © Copyright by Extensive-Enterprises 2025. All rights reserved.STAFF LOGIN"}