{"id": 1548, "name": "Washington Blade", "domain": "washingtonblade.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.washingtonblade.com/2024/07/01/young-gay-latinos-see-rising-share-of-new-hiv-cases-leading-to-call-for-targeted-funding/", "title": "Young Gay Latinos See Rising Share Of New Hiv Cases Leading To Call For Targeted Funding", "content": "Politics Local National World Arts & Entertainment Financial Photos Opinions Life Style Noticias en Español Classifieds AboutArchivesPrint EditionFind a CopySubscribeContact Us Archives Print Edition Find a Copy Subscribe Contact Us Archives Print Edition Find a Copy Subscribe Contact Us Los Angeles Blade Advertise with Us Become A Blade Member **Washington Blade: LGBTQ News, Politics, LGBTQ Rights, Gay News** Politics51 lawmakers sign letter to Rubio about Andry Hernández RomeroWasserman Schultz: Allies must do more to support LGBTQ JewsSen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey MilkHouse passes reconciliation with gender-affirming care funding banGerry Connolly dies at 75 after battle with esophageal cancer 51 lawmakers sign letter to Rubio about Andry Hernández Romero 51 lawmakers sign letter to Rubio about Andry Hernández Romero Wasserman Schultz: Allies must do more to support LGBTQ Jews Wasserman Schultz: Allies must do more to support LGBTQ Jews Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk House passes reconciliation with gender-affirming care funding ban House passes reconciliation with gender-affirming care funding ban Gerry Connolly dies at 75 after battle with esophageal cancer Gerry Connolly dies at 75 after battle with esophageal cancer 51 lawmakers sign letter to Rubio about Andry Hernández Romero 51 lawmakers sign letter to Rubio about Andry Hernández Romero 51 lawmakers sign letter to Rubio about Andry Hernández Romero 51 lawmakers sign letter to Rubio about Andry Hernández Romero Wasserman Schultz: Allies must do more to support LGBTQ Jews Wasserman Schultz: Allies must do more to support LGBTQ Jews Wasserman Schultz: Allies must do more to support LGBTQ Jews Wasserman Schultz: Allies must do more to support LGBTQ Jews Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk Sen. Schiff proposes resolution urging DOD not to rename U.S. Naval Ship Harvey Milk House passes reconciliation with gender-affirming care funding ban House passes reconciliation with gender-affirming care funding ban House passes reconciliation with gender-affirming care funding ban House passes reconciliation with gender-affirming care funding ban Gerry Connolly dies at 75 after battle with esophageal cancer Gerry Connolly dies at 75 after battle with esophageal cancer Gerry Connolly dies at 75 after battle with esophageal cancer Gerry Connolly dies at 75 after battle with esophageal cancer LocalPHOTOS: WorldPride Street Festival and Closing ConcertBaltimore Trans Pride to take place SaturdayPHOTOS: WorldPride ParadeMan arrested for destroying D.C. Pride decorations, spray painting hate messageDelaware hosts LGBTQ flag raising ceremonyD.C.MarylandVirginiaDelawareBest of Gay DCPhotos PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert Baltimore Trans Pride to take place Saturday Baltimore Trans Pride to take place Saturday PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Delaware hosts LGBTQ flag raising ceremony Delaware hosts LGBTQ flag raising ceremony D.C. Maryland Virginia Delaware Best of Gay DC Photos PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert Baltimore Trans Pride to take place Saturday Baltimore Trans Pride to take place Saturday Baltimore Trans Pride to take place Saturday Baltimore Trans Pride to take place Saturday PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Delaware hosts LGBTQ flag raising ceremony Delaware hosts LGBTQ flag raising ceremony Delaware hosts LGBTQ flag raising ceremony Delaware hosts LGBTQ flag raising ceremony D.C. Maryland Virginia Delaware Best of Gay DC Photos NationalJudge temporarily blocks executive orders targeting LGBTQ, HIV groupsActivists rally for Andry Hernández Romero in front of Supreme CourtA husband’s story: Michael Carroll reflects on life with Edmund WhiteIn town for WorldPride? Take a D.C. LGBTQ walking tourWhite House has ‘no plans’ to recognize Pride month Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Activists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court A husband’s story: Michael Carroll reflects on life with Edmund White A husband’s story: Michael Carroll reflects on life with Edmund White In town for WorldPride? Take a D.C. LGBTQ walking tour In town for WorldPride? Take a D.C. LGBTQ walking tour White House has ‘no plans’ to recognize Pride month White House has ‘no plans’ to recognize Pride month Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Judge temporarily blocks executive orders targeting LGBTQ, HIV groups Activists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court A husband’s story: Michael Carroll reflects on life with Edmund White A husband’s story: Michael Carroll reflects on life with Edmund White A husband’s story: Michael Carroll reflects on life with Edmund White A husband’s story: Michael Carroll reflects on life with Edmund White In town for WorldPride? Take a D.C. LGBTQ walking tour In town for WorldPride? Take a D.C. LGBTQ walking tour In town for WorldPride? Take a D.C. LGBTQ walking tour In town for WorldPride? Take a D.C. LGBTQ walking tour White House has ‘no plans’ to recognize Pride month White House has ‘no plans’ to recognize Pride month White House has ‘no plans’ to recognize Pride month White House has ‘no plans’ to recognize Pride month WorldWorld Bank resumes lending to UgandaSouth African activists demand action to stop anti-LGBTQ violenceGay pharmacist’s murder sparks outrage in ChileJapan should end abusive detention conditions for transgender peopleTrans Ugandans build power through businessNoticias en Español¿Hasta cuándo esperaremos el permiso para amar?El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQNo olvidar el 11 de mayoArtistas drag marchan por derechos laborales, visibilidad LGBTQ en El SalvadorINDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! World Bank resumes lending to Uganda World Bank resumes lending to Uganda South African activists demand action to stop anti-LGBTQ violence South African activists demand action to stop anti-LGBTQ violence Gay pharmacist’s murder sparks outrage in Chile Gay pharmacist’s murder sparks outrage in Chile Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Trans Ugandans build power through business Trans Ugandans build power through business Noticias en Español¿Hasta cuándo esperaremos el permiso para amar?El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQNo olvidar el 11 de mayoArtistas drag marchan por derechos laborales, visibilidad LGBTQ en El SalvadorINDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! ¿Hasta cuándo esperaremos el permiso para amar? ¿Hasta cuándo esperaremos el permiso para amar? El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ No olvidar el 11 de mayo No olvidar el 11 de mayo Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! World Bank resumes lending to Uganda World Bank resumes lending to Uganda World Bank resumes lending to Uganda World Bank resumes lending to Uganda South African activists demand action to stop anti-LGBTQ violence South African activists demand action to stop anti-LGBTQ violence South African activists demand action to stop anti-LGBTQ violence South African activists demand action to stop anti-LGBTQ violence Gay pharmacist’s murder sparks outrage in Chile Gay pharmacist’s murder sparks outrage in Chile Gay pharmacist’s murder sparks outrage in Chile Gay pharmacist’s murder sparks outrage in Chile Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Trans Ugandans build power through business Trans Ugandans build power through business Trans Ugandans build power through business Trans Ugandans build power through business Noticias en Español¿Hasta cuándo esperaremos el permiso para amar?El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQNo olvidar el 11 de mayoArtistas drag marchan por derechos laborales, visibilidad LGBTQ en El SalvadorINDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! ¿Hasta cuándo esperaremos el permiso para amar? ¿Hasta cuándo esperaremos el permiso para amar? El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ No olvidar el 11 de mayo No olvidar el 11 de mayo Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! ¿Hasta cuándo esperaremos el permiso para amar? ¿Hasta cuándo esperaremos el permiso para amar? ¿Hasta cuándo esperaremos el permiso para amar? ¿Hasta cuándo esperaremos el permiso para amar? El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ El Salvador conmemora el 17M bajo un clima de miedo y retroceso en derechos LGBTQ No olvidar el 11 de mayo No olvidar el 11 de mayo No olvidar el 11 de mayo No olvidar el 11 de mayo Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador Artistas drag marchan por derechos laborales, visibilidad LGBTQ en El Salvador INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! INDIGNACIÓN: ¡El transfeminicidio de Sara Millerey en Colombia nos cuestiona como sociedad! OpinionsPride and protests: a weekend full of divisionCapitalism, patriarchy, and neocolonialism are repackaging the scramble for AfricaI interviewed Biden in late 2024 and he was attentive, engagedLGBTQ health equity must not be abandonedJapan should end abusive detention conditions for transgender peoplePeter RosensteinKate ClintonRick RosendallKathi WolfeBrock ThompsonMark Lee Pride and protests: a weekend full of division Pride and protests: a weekend full of division Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa I interviewed Biden in late 2024 and he was attentive, engaged I interviewed Biden in late 2024 and he was attentive, engaged LGBTQ health equity must not be abandoned LGBTQ health equity must not be abandoned Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Peter Rosenstein Kate Clinton Rick Rosendall Kathi Wolfe Brock Thompson Mark Lee Pride and protests: a weekend full of division Pride and protests: a weekend full of division Pride and protests: a weekend full of division Pride and protests: a weekend full of division Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa Capitalism, patriarchy, and neocolonialism are repackaging the scramble for Africa I interviewed Biden in late 2024 and he was attentive, engaged I interviewed Biden in late 2024 and he was attentive, engaged I interviewed Biden in late 2024 and he was attentive, engaged I interviewed Biden in late 2024 and he was attentive, engaged LGBTQ health equity must not be abandoned LGBTQ health equity must not be abandoned LGBTQ health equity must not be abandoned LGBTQ health equity must not be abandoned Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Japan should end abusive detention conditions for transgender people Peter Rosenstein Kate Clinton Rick Rosendall Kathi Wolfe Brock Thompson Mark Lee A&EPHOTOS: WorldPride Street Festival and Closing ConcertPHOTOS: WorldPride ParadeA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’PHOTOS: WorldPride Boat ParadePHOTOS: Capital Pride HonorsTelevisionNo, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remakeQueer TV to watch this springPutting off watching ‘Monsters?’ You’re missing outPBS ‘Disco’ is a Pride party you don’t want to missLesbian road movie returns with campy ‘Dolls’DiningUnion Market’s Last Call Bar a welcoming oasis for allRAMMYs honors restaurant industry professionalsBehind the bar with Moon Rabbit’s Thi NguyenMy Rehoboth Beach culinary tourNew D.C. restaurants opening just in time for springTheaterA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’‘We Are Gathered’ a powerful contemplation of queer equalityTrans performer, juggler premiering one-woman showMike Millan prepares to co-host Helen Hayes AwardsA trip ‘through media, memory to examine cultural imperialism’FilmQueer movies and shows to watch this summer‘Pee-wee’ spills the tea in outstanding new documentaryGay director on revealing the authentic Pee-wee Herman‘Things Like This’ embraces formula and plus-size visibility‘Pink Narcissus’ reasserts queer identity in the face of repressionMusicUnderdog glorious: a personal remembrance of Jill SobuleTom Goss returns with ‘Bear Friends Furever Tour’Kylie brings ‘Tension’ tour to D.C.Busy season for live music in D.C.Pride concert to take place at Strathmore after Kennedy Center rescinds invitationBooksI’m a lesbian and LGBTQ books would have changed my lifeA boy-meets-boy, family-mess story with heatChronicling disastrous effects of ‘conversion therapy’How one gay Catholic helped change the world‘Pronoun Trouble’ reminds us that punctuation mattersPhotosPHOTOS: WorldPride Street Festival and Closing ConcertPHOTOS: WorldPride ParadePHOTOS: WorldPride Boat ParadePHOTOS: Capital Pride HonorsPHOTOS: Latinx Pride PartyBest of Gay DCContests PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors TelevisionNo, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remakeQueer TV to watch this springPutting off watching ‘Monsters?’ You’re missing outPBS ‘Disco’ is a Pride party you don’t want to missLesbian road movie returns with campy ‘Dolls’ No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake Queer TV to watch this spring Queer TV to watch this spring Putting off watching ‘Monsters?’ You’re missing out Putting off watching ‘Monsters?’ You’re missing out PBS ‘Disco’ is a Pride party you don’t want to miss PBS ‘Disco’ is a Pride party you don’t want to miss Lesbian road movie returns with campy ‘Dolls’ Lesbian road movie returns with campy ‘Dolls’ DiningUnion Market’s Last Call Bar a welcoming oasis for allRAMMYs honors restaurant industry professionalsBehind the bar with Moon Rabbit’s Thi NguyenMy Rehoboth Beach culinary tourNew D.C. restaurants opening just in time for spring Union Market’s Last Call Bar a welcoming oasis for all Union Market’s Last Call Bar a welcoming oasis for all RAMMYs honors restaurant industry professionals RAMMYs honors restaurant industry professionals Behind the bar with Moon Rabbit’s Thi Nguyen Behind the bar with Moon Rabbit’s Thi Nguyen My Rehoboth Beach culinary tour My Rehoboth Beach culinary tour New D.C. restaurants opening just in time for spring New D.C. restaurants opening just in time for spring TheaterA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’‘We Are Gathered’ a powerful contemplation of queer equalityTrans performer, juggler premiering one-woman showMike Millan prepares to co-host Helen Hayes AwardsA trip ‘through media, memory to examine cultural imperialism’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ ‘We Are Gathered’ a powerful contemplation of queer equality ‘We Are Gathered’ a powerful contemplation of queer equality Trans performer, juggler premiering one-woman show Trans performer, juggler premiering one-woman show Mike Millan prepares to co-host Helen Hayes Awards Mike Millan prepares to co-host Helen Hayes Awards A trip ‘through media, memory to examine cultural imperialism’ A trip ‘through media, memory to examine cultural imperialism’ FilmQueer movies and shows to watch this summer‘Pee-wee’ spills the tea in outstanding new documentaryGay director on revealing the authentic Pee-wee Herman‘Things Like This’ embraces formula and plus-size visibility‘Pink Narcissus’ reasserts queer identity in the face of repression Queer movies and shows to watch this summer Queer movies and shows to watch this summer ‘Pee-wee’ spills the tea in outstanding new documentary ‘Pee-wee’ spills the tea in outstanding new documentary Gay director on revealing the authentic Pee-wee Herman Gay director on revealing the authentic Pee-wee Herman ‘Things Like This’ embraces formula and plus-size visibility ‘Things Like This’ embraces formula and plus-size visibility ‘Pink Narcissus’ reasserts queer identity in the face of repression ‘Pink Narcissus’ reasserts queer identity in the face of repression MusicUnderdog glorious: a personal remembrance of Jill SobuleTom Goss returns with ‘Bear Friends Furever Tour’Kylie brings ‘Tension’ tour to D.C.Busy season for live music in D.C.Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Underdog glorious: a personal remembrance of Jill Sobule Underdog glorious: a personal remembrance of Jill Sobule Tom Goss returns with ‘Bear Friends Furever Tour’ Tom Goss returns with ‘Bear Friends Furever Tour’ Kylie brings ‘Tension’ tour to D.C. Kylie brings ‘Tension’ tour to D.C. Busy season for live music in D.C. Busy season for live music in D.C. Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Pride concert to take place at Strathmore after Kennedy Center rescinds invitation BooksI’m a lesbian and LGBTQ books would have changed my lifeA boy-meets-boy, family-mess story with heatChronicling disastrous effects of ‘conversion therapy’How one gay Catholic helped change the world‘Pronoun Trouble’ reminds us that punctuation matters I’m a lesbian and LGBTQ books would have changed my life I’m a lesbian and LGBTQ books would have changed my life A boy-meets-boy, family-mess story with heat A boy-meets-boy, family-mess story with heat Chronicling disastrous effects of ‘conversion therapy’ Chronicling disastrous effects of ‘conversion therapy’ How one gay Catholic helped change the world How one gay Catholic helped change the world ‘Pronoun Trouble’ reminds us that punctuation matters ‘Pronoun Trouble’ reminds us that punctuation matters PhotosPHOTOS: WorldPride Street Festival and Closing ConcertPHOTOS: WorldPride ParadePHOTOS: WorldPride Boat ParadePHOTOS: Capital Pride HonorsPHOTOS: Latinx Pride Party PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Latinx Pride Party PHOTOS: Latinx Pride Party Best of Gay DC Contests PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors TelevisionNo, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remakeQueer TV to watch this springPutting off watching ‘Monsters?’ You’re missing outPBS ‘Disco’ is a Pride party you don’t want to missLesbian road movie returns with campy ‘Dolls’ No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake Queer TV to watch this spring Queer TV to watch this spring Putting off watching ‘Monsters?’ You’re missing out Putting off watching ‘Monsters?’ You’re missing out PBS ‘Disco’ is a Pride party you don’t want to miss PBS ‘Disco’ is a Pride party you don’t want to miss Lesbian road movie returns with campy ‘Dolls’ Lesbian road movie returns with campy ‘Dolls’ No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake No, ‘Mid-Century Modern’ is not a ‘Golden Girls’ remake Queer TV to watch this spring Queer TV to watch this spring Queer TV to watch this spring Queer TV to watch this spring Putting off watching ‘Monsters?’ You’re missing out Putting off watching ‘Monsters?’ You’re missing out Putting off watching ‘Monsters?’ You’re missing out Putting off watching ‘Monsters?’ You’re missing out PBS ‘Disco’ is a Pride party you don’t want to miss PBS ‘Disco’ is a Pride party you don’t want to miss PBS ‘Disco’ is a Pride party you don’t want to miss PBS ‘Disco’ is a Pride party you don’t want to miss Lesbian road movie returns with campy ‘Dolls’ Lesbian road movie returns with campy ‘Dolls’ Lesbian road movie returns with campy ‘Dolls’ Lesbian road movie returns with campy ‘Dolls’ DiningUnion Market’s Last Call Bar a welcoming oasis for allRAMMYs honors restaurant industry professionalsBehind the bar with Moon Rabbit’s Thi NguyenMy Rehoboth Beach culinary tourNew D.C. restaurants opening just in time for spring Union Market’s Last Call Bar a welcoming oasis for all Union Market’s Last Call Bar a welcoming oasis for all RAMMYs honors restaurant industry professionals RAMMYs honors restaurant industry professionals Behind the bar with Moon Rabbit’s Thi Nguyen Behind the bar with Moon Rabbit’s Thi Nguyen My Rehoboth Beach culinary tour My Rehoboth Beach culinary tour New D.C. restaurants opening just in time for spring New D.C. restaurants opening just in time for spring Union Market’s Last Call Bar a welcoming oasis for all Union Market’s Last Call Bar a welcoming oasis for all Union Market’s Last Call Bar a welcoming oasis for all Union Market’s Last Call Bar a welcoming oasis for all RAMMYs honors restaurant industry professionals RAMMYs honors restaurant industry professionals RAMMYs honors restaurant industry professionals RAMMYs honors restaurant industry professionals Behind the bar with Moon Rabbit’s Thi Nguyen Behind the bar with Moon Rabbit’s Thi Nguyen Behind the bar with Moon Rabbit’s Thi Nguyen Behind the bar with Moon Rabbit’s Thi Nguyen My Rehoboth Beach culinary tour My Rehoboth Beach culinary tour My Rehoboth Beach culinary tour My Rehoboth Beach culinary tour New D.C. restaurants opening just in time for spring New D.C. restaurants opening just in time for spring New D.C. restaurants opening just in time for spring New D.C. restaurants opening just in time for spring TheaterA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’‘We Are Gathered’ a powerful contemplation of queer equalityTrans performer, juggler premiering one-woman showMike Millan prepares to co-host Helen Hayes AwardsA trip ‘through media, memory to examine cultural imperialism’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ ‘We Are Gathered’ a powerful contemplation of queer equality ‘We Are Gathered’ a powerful contemplation of queer equality Trans performer, juggler premiering one-woman show Trans performer, juggler premiering one-woman show Mike Millan prepares to co-host Helen Hayes Awards Mike Millan prepares to co-host Helen Hayes Awards A trip ‘through media, memory to examine cultural imperialism’ A trip ‘through media, memory to examine cultural imperialism’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ ‘We Are Gathered’ a powerful contemplation of queer equality ‘We Are Gathered’ a powerful contemplation of queer equality ‘We Are Gathered’ a powerful contemplation of queer equality ‘We Are Gathered’ a powerful contemplation of queer equality Trans performer, juggler premiering one-woman show Trans performer, juggler premiering one-woman show Trans performer, juggler premiering one-woman show Trans performer, juggler premiering one-woman show Mike Millan prepares to co-host Helen Hayes Awards Mike Millan prepares to co-host Helen Hayes Awards Mike Millan prepares to co-host Helen Hayes Awards Mike Millan prepares to co-host Helen Hayes Awards A trip ‘through media, memory to examine cultural imperialism’ A trip ‘through media, memory to examine cultural imperialism’ A trip ‘through media, memory to examine cultural imperialism’ A trip ‘through media, memory to examine cultural imperialism’ FilmQueer movies and shows to watch this summer‘Pee-wee’ spills the tea in outstanding new documentaryGay director on revealing the authentic Pee-wee Herman‘Things Like This’ embraces formula and plus-size visibility‘Pink Narcissus’ reasserts queer identity in the face of repression Queer movies and shows to watch this summer Queer movies and shows to watch this summer ‘Pee-wee’ spills the tea in outstanding new documentary ‘Pee-wee’ spills the tea in outstanding new documentary Gay director on revealing the authentic Pee-wee Herman Gay director on revealing the authentic Pee-wee Herman ‘Things Like This’ embraces formula and plus-size visibility ‘Things Like This’ embraces formula and plus-size visibility ‘Pink Narcissus’ reasserts queer identity in the face of repression ‘Pink Narcissus’ reasserts queer identity in the face of repression Queer movies and shows to watch this summer Queer movies and shows to watch this summer Queer movies and shows to watch this summer Queer movies and shows to watch this summer ‘Pee-wee’ spills the tea in outstanding new documentary ‘Pee-wee’ spills the tea in outstanding new documentary ‘Pee-wee’ spills the tea in outstanding new documentary ‘Pee-wee’ spills the tea in outstanding new documentary Gay director on revealing the authentic Pee-wee Herman Gay director on revealing the authentic Pee-wee Herman Gay director on revealing the authentic Pee-wee Herman Gay director on revealing the authentic Pee-wee Herman ‘Things Like This’ embraces formula and plus-size visibility ‘Things Like This’ embraces formula and plus-size visibility ‘Things Like This’ embraces formula and plus-size visibility ‘Things Like This’ embraces formula and plus-size visibility ‘Pink Narcissus’ reasserts queer identity in the face of repression ‘Pink Narcissus’ reasserts queer identity in the face of repression ‘Pink Narcissus’ reasserts queer identity in the face of repression ‘Pink Narcissus’ reasserts queer identity in the face of repression MusicUnderdog glorious: a personal remembrance of Jill SobuleTom Goss returns with ‘Bear Friends Furever Tour’Kylie brings ‘Tension’ tour to D.C.Busy season for live music in D.C.Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Underdog glorious: a personal remembrance of Jill Sobule Underdog glorious: a personal remembrance of Jill Sobule Tom Goss returns with ‘Bear Friends Furever Tour’ Tom Goss returns with ‘Bear Friends Furever Tour’ Kylie brings ‘Tension’ tour to D.C. Kylie brings ‘Tension’ tour to D.C. Busy season for live music in D.C. Busy season for live music in D.C. Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Underdog glorious: a personal remembrance of Jill Sobule Underdog glorious: a personal remembrance of Jill Sobule Underdog glorious: a personal remembrance of Jill Sobule Underdog glorious: a personal remembrance of Jill Sobule Tom Goss returns with ‘Bear Friends Furever Tour’ Tom Goss returns with ‘Bear Friends Furever Tour’ Tom Goss returns with ‘Bear Friends Furever Tour’ Tom Goss returns with ‘Bear Friends Furever Tour’ Kylie brings ‘Tension’ tour to D.C. Kylie brings ‘Tension’ tour to D.C. Kylie brings ‘Tension’ tour to D.C. Kylie brings ‘Tension’ tour to D.C. Busy season for live music in D.C. Busy season for live music in D.C. Busy season for live music in D.C. Busy season for live music in D.C. Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Pride concert to take place at Strathmore after Kennedy Center rescinds invitation Pride concert to take place at Strathmore after Kennedy Center rescinds invitation BooksI’m a lesbian and LGBTQ books would have changed my lifeA boy-meets-boy, family-mess story with heatChronicling disastrous effects of ‘conversion therapy’How one gay Catholic helped change the world‘Pronoun Trouble’ reminds us that punctuation matters I’m a lesbian and LGBTQ books would have changed my life I’m a lesbian and LGBTQ books would have changed my life A boy-meets-boy, family-mess story with heat A boy-meets-boy, family-mess story with heat Chronicling disastrous effects of ‘conversion therapy’ Chronicling disastrous effects of ‘conversion therapy’ How one gay Catholic helped change the world How one gay Catholic helped change the world ‘Pronoun Trouble’ reminds us that punctuation matters ‘Pronoun Trouble’ reminds us that punctuation matters I’m a lesbian and LGBTQ books would have changed my life I’m a lesbian and LGBTQ books would have changed my life I’m a lesbian and LGBTQ books would have changed my life I’m a lesbian and LGBTQ books would have changed my life A boy-meets-boy, family-mess story with heat A boy-meets-boy, family-mess story with heat A boy-meets-boy, family-mess story with heat A boy-meets-boy, family-mess story with heat Chronicling disastrous effects of ‘conversion therapy’ Chronicling disastrous effects of ‘conversion therapy’ Chronicling disastrous effects of ‘conversion therapy’ Chronicling disastrous effects of ‘conversion therapy’ How one gay Catholic helped change the world How one gay Catholic helped change the world How one gay Catholic helped change the world How one gay Catholic helped change the world ‘Pronoun Trouble’ reminds us that punctuation matters ‘Pronoun Trouble’ reminds us that punctuation matters ‘Pronoun Trouble’ reminds us that punctuation matters ‘Pronoun Trouble’ reminds us that punctuation matters PhotosPHOTOS: WorldPride Street Festival and Closing ConcertPHOTOS: WorldPride ParadePHOTOS: WorldPride Boat ParadePHOTOS: Capital Pride HonorsPHOTOS: Latinx Pride Party PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Latinx Pride Party PHOTOS: Latinx Pride Party PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Capital Pride Honors PHOTOS: Latinx Pride Party PHOTOS: Latinx Pride Party PHOTOS: Latinx Pride Party PHOTOS: Latinx Pride Party Best of Gay DC Contests FinancialThe best U.S. cities for LGBTQ homebuyers in 2025Summer-ready rentals: How to prepare for the seasonPride, patriotism, and prosperityTips for buying a house in Rehoboth BeachImpact of federal gov’t RIF on D.C.’s rental market The best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 Summer-ready rentals: How to prepare for the season Summer-ready rentals: How to prepare for the season Pride, patriotism, and prosperity Pride, patriotism, and prosperity Tips for buying a house in Rehoboth Beach Tips for buying a house in Rehoboth Beach Impact of federal gov’t RIF on D.C.’s rental market Impact of federal gov’t RIF on D.C.’s rental market The best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 Summer-ready rentals: How to prepare for the season Summer-ready rentals: How to prepare for the season Summer-ready rentals: How to prepare for the season Summer-ready rentals: How to prepare for the season Pride, patriotism, and prosperity Pride, patriotism, and prosperity Pride, patriotism, and prosperity Pride, patriotism, and prosperity Tips for buying a house in Rehoboth Beach Tips for buying a house in Rehoboth Beach Tips for buying a house in Rehoboth Beach Tips for buying a house in Rehoboth Beach Impact of federal gov’t RIF on D.C.’s rental market Impact of federal gov’t RIF on D.C.’s rental market Impact of federal gov’t RIF on D.C.’s rental market Impact of federal gov’t RIF on D.C.’s rental market HealthUS contributes more than $90 million to fight mpox outbreak in AfricaMpox outbreak in Africa declared global health emergencyWhite House urged to expand PrEP coverage for injectable formYoung gay Latinos see rising share of new HIV cases, leading to call for targeted fundingAsian American and LGBTQ: A Heritage of PrideNewsUS contributes more than $90 million to fight mpox outbreak in AfricaMpox outbreak in Africa declared global health emergencyWhite House urged to expand PrEP coverage for injectable formYoung gay Latinos see rising share of new HIV cases, leading to call for targeted fundingAsian American and LGBTQ: A Heritage of PrideCannabis CultureNew Mexico guv signs marijuana legalizationDelaware cannabis activists take on corporate marijuanaVirginia marijuana legalization takes effect July 1Highstream 420 Festival LivestreamCannabis CultureFitnessNEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gymWhy a personalized diet can help you achieve better resultsAl Roker blasts Jillian Michaels for criticizing Keto dietMake 2019 your year for fitnessRaising healthy adults starts now US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride NewsUS contributes more than $90 million to fight mpox outbreak in AfricaMpox outbreak in Africa declared global health emergencyWhite House urged to expand PrEP coverage for injectable formYoung gay Latinos see rising share of new HIV cases, leading to call for targeted fundingAsian American and LGBTQ: A Heritage of Pride US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Cannabis CultureNew Mexico guv signs marijuana legalizationDelaware cannabis activists take on corporate marijuanaVirginia marijuana legalization takes effect July 1Highstream 420 Festival LivestreamCannabis Culture New Mexico guv signs marijuana legalization New Mexico guv signs marijuana legalization Delaware cannabis activists take on corporate marijuana Delaware cannabis activists take on corporate marijuana Virginia marijuana legalization takes effect July 1 Virginia marijuana legalization takes effect July 1 Highstream 420 Festival Livestream Highstream 420 Festival Livestream Cannabis Culture Cannabis Culture FitnessNEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gymWhy a personalized diet can help you achieve better resultsAl Roker blasts Jillian Michaels for criticizing Keto dietMake 2019 your year for fitnessRaising healthy adults starts now NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym Why a personalized diet can help you achieve better results Why a personalized diet can help you achieve better results Al Roker blasts Jillian Michaels for criticizing Keto diet Al Roker blasts Jillian Michaels for criticizing Keto diet Make 2019 your year for fitness Make 2019 your year for fitness Raising healthy adults starts now Raising healthy adults starts now US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride NewsUS contributes more than $90 million to fight mpox outbreak in AfricaMpox outbreak in Africa declared global health emergencyWhite House urged to expand PrEP coverage for injectable formYoung gay Latinos see rising share of new HIV cases, leading to call for targeted fundingAsian American and LGBTQ: A Heritage of Pride US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa US contributes more than $90 million to fight mpox outbreak in Africa Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency Mpox outbreak in Africa declared global health emergency White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Asian American and LGBTQ: A Heritage of Pride Cannabis CultureNew Mexico guv signs marijuana legalizationDelaware cannabis activists take on corporate marijuanaVirginia marijuana legalization takes effect July 1Highstream 420 Festival LivestreamCannabis Culture New Mexico guv signs marijuana legalization New Mexico guv signs marijuana legalization Delaware cannabis activists take on corporate marijuana Delaware cannabis activists take on corporate marijuana Virginia marijuana legalization takes effect July 1 Virginia marijuana legalization takes effect July 1 Highstream 420 Festival Livestream Highstream 420 Festival Livestream Cannabis Culture Cannabis Culture New Mexico guv signs marijuana legalization New Mexico guv signs marijuana legalization New Mexico guv signs marijuana legalization New Mexico guv signs marijuana legalization Delaware cannabis activists take on corporate marijuana Delaware cannabis activists take on corporate marijuana Delaware cannabis activists take on corporate marijuana Delaware cannabis activists take on corporate marijuana Virginia marijuana legalization takes effect July 1 Virginia marijuana legalization takes effect July 1 Virginia marijuana legalization takes effect July 1 Virginia marijuana legalization takes effect July 1 Highstream 420 Festival Livestream Highstream 420 Festival Livestream Highstream 420 Festival Livestream Highstream 420 Festival Livestream Cannabis Culture Cannabis Culture Cannabis Culture Cannabis Culture FitnessNEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gymWhy a personalized diet can help you achieve better resultsAl Roker blasts Jillian Michaels for criticizing Keto dietMake 2019 your year for fitnessRaising healthy adults starts now NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym Why a personalized diet can help you achieve better results Why a personalized diet can help you achieve better results Al Roker blasts Jillian Michaels for criticizing Keto diet Al Roker blasts Jillian Michaels for criticizing Keto diet Make 2019 your year for fitness Make 2019 your year for fitness Raising healthy adults starts now Raising healthy adults starts now NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym NEW YEAR NEW YOU 2020: Local VIDA master trainer on trends, tips and technology at the gym Why a personalized diet can help you achieve better results Why a personalized diet can help you achieve better results Why a personalized diet can help you achieve better results Why a personalized diet can help you achieve better results Al Roker blasts Jillian Michaels for criticizing Keto diet Al Roker blasts Jillian Michaels for criticizing Keto diet Al Roker blasts Jillian Michaels for criticizing Keto diet Al Roker blasts Jillian Michaels for criticizing Keto diet Make 2019 your year for fitness Make 2019 your year for fitness Make 2019 your year for fitness Make 2019 your year for fitness Raising healthy adults starts now Raising healthy adults starts now Raising healthy adults starts now Raising healthy adults starts now Classifieds AboutPrint EditionArchivesAdvertiseLos Angeles Blade Print Edition Archives Advertise Los Angeles Blade Print Edition Archives Advertise Los Angeles Blade BECOME A MEMBER **Health** **Young gay Latinos see rising share of new HIV cases, leading to call for targeted funding** Fernando Hermida diagnosed four months after asking for asylum Published on By Share Share Tweet Tweet Four months after seeking asylum in the U.S., Fernando Hermida began coughing and feeling tired. He thought it was a cold. Then sores appeared in his groin and he would soak his bed with sweat. He took a test. On New Year’s Day 2022, at age 31, Hermida learned he had HIV. “I thought I was going to die,” he said, recalling how a chill washed over him as he reviewed his results. He struggled to navigate a new, convoluted health care system. Through an HIV organization he found online, he received a list of medical providers to call in D.C., where he was at the time, but they didn’t return his calls for weeks. Hermida, who speaks only Spanish, didn’t know where to turn. By the time of Hermida’s diagnosis, the U.S. Department of Health and Human Services was about three years into afederal initiativeto end the nation’s HIV epidemic by pumping hundreds of millions of dollars annually into certain states, counties, and U.S. territories with the highest infection rates. The goal was to reach the estimated1.2 millionpeople living with HIV, including some who don’t know they have the disease. Overall, estimated new HIV infection rates declined 23 percent from 2012 to 2022. But a KFF Health News-Associated Press analysis found the rate has not fallen for Latinos as much as it has for other racial and ethnic groups. While African Americans continue to have the highest HIV rates in the U.S. overall, Latinos made up the largest share of new HIV diagnoses and infections among gay and bisexual men in 2022, per the most recent data available, compared with other racial and ethnic groups. Latinos, who make up about 19 percent of the U.S. population, accounted for about 33 percent of new HIV infections, according to the Centers for Disease Control and Prevention. The analysis found Latinos are experiencing a disproportionate number of new infections and diagnoses across the U.S., with diagnosis rates highest in the Southeast. Public health officials in Mecklenburg County, North Carolina, and Shelby County, Tennessee, where data shows diagnosis rates have gone up among Latinos, told KFF Health News and the AP that they either don’t have specific plans to address HIV in this population or that plans are still in the works. Even in well-resourced places like San Francisco, HIV diagnosis rates grew among Latinos in the last few years while falling among other racial and ethnic groups despite the county’s goals to reduce infections among Latinos. “HIV disparities are not inevitable,” Robyn Neblett Fanfair, director of the CDC’s Division of HIV Prevention, said in a statement. She noted the systemic, cultural, and economic inequities — such as racism, language differences, and medical mistrust. And though the CDC provides some funds for minority groups, Latino health policy advocates want HHS to declare a public health emergency in hopes of directing more money to Latino communities, saying current efforts aren’t enough. “Our invisibility is no longer tolerable,” said Vincent Guilamo-Ramos,co-chairof the Presidential Advisory Council on HIV/AIDS **Lost without an interpreter** Hermida suspects he contracted the virus while he was in an open relationship with a male partner before he came to the U.S. In late January 2022, months after his symptoms started, he went to a clinic in New York City that a friend had helped him find to finally get treatment for HIV. Too sick to care for himself alone, Hermida eventually moved to Charlotte to be closer to family and in hopes of receiving more consistent health care. He enrolled in anAmity Medical Groupclinic that receives funding from the Ryan White HIV/AIDS Program, a federal safety-net plan that serves over half of those in the nation diagnosed with HIV, regardless of their citizenship status. His HIV became undetectable after he was connected with case managers. But over time, communication with the clinic grew less frequent, he said, and he didn’t get regular interpretation help during visits with his English-speaking doctor. An Amity Medical Group representative confirmed Hermida was a client but didn’t answer questions about his experience at the clinic. Hermida said he had a hard time filling out paperwork to stay enrolled in the Ryan White program, and when his eligibility expired in September 2023, he couldn’t get his medication. He left the clinic and enrolled in a health plan through the Affordable Care Act marketplace. But Hermida didn’t realize the insurer required him to pay for a share of his HIV treatment. In January, the Lyft driver received a $1,275 bill for his antiretroviral — the equivalent of 120 rides, he said. He paid the bill with a coupon he found online. In April, he got a second bill he couldn’t afford. For two weeks, he stopped taking the medication that keeps the virus undetectable and intransmissible. “Estoy que colapso,”he said. I’m falling apart. “Tengo que vivir para pagar la medicación.” I have to live to pay for my medication. One way to prevent HIV is preexposure prophylaxis, or PrEP, which is regularly taken to reduce the risk of getting HIV through sex or intravenous drug use. It wasapproved by the federal governmentin 2012 but the uptake has not been even across racial and ethnic groups: CDC data show much lower rates of PrEP coverage among Latinos than among white Americans. Epidemiologists say high PrEP use and consistent access to treatment are necessary to build community-level resistance. Carlos Saldana, an infectious disease specialist and former medical adviser for Georgia’s health department,helped identifyfive clusters of rapid HIV transmission involving about 40 gay Latinos and men who have sex with men from February 2021 to June 2022. Many people in the cluster told researchers they had not taken PrEP and struggled to understand the health care system. They experienced other barriers, too, Saldana said, including lack of transportation and fear of deportation if they sought treatment. Latino health policy advocates want the federal government to redistribute funding for HIV prevention, including testing and access to PrEP. Of thenearly $30 billionin federal money that went toward things like HIV health care services, treatment, and prevention in 2022, only 4% went to prevention,according to a KFF analysis. They suggest more money could help reach Latino communities through efforts like faith-based outreach at churches, testing at clubs on Latin nights, and training bilingual HIV testers. **Latino Rates Going Up** Congress has appropriated$2.3 billionover five years to the Ending the HIV Epidemic initiative, and jurisdictions that get the money areto invest 25 percentof it in community-based organizations. But the initiative lacks requirements to target any particular groups, including Latinos, leaving it up to the cities, counties, and states to come up with specific strategies. In 34 of the 57 areas getting the money, cases are going the wrong way: Diagnosis rates among Latinos increased from 2019 to 2022 while declining for other racial and ethnic groups, the KFF Health News-AP analysis found. Starting Aug. 1, state and local health departments will have to provide annual spending reports on funding in places that account for 30 percent or more of HIV diagnoses, the CDC said. Previously, it had been required for only a small number of states. In some states and counties, initiative funding has not been enough to cover the needs of Latinos. South Carolina, which saw rates nearly double for Latinos from 2012-2022, hasn’t expanded HIV mobile testing in rural areas, where the need is high among Latinos, said Tony Price, HIV program manager in the state health department. South Carolina can pay for only four community health workers focused on HIV outreach — and not all of them are bilingual. In Shelby County, Tennessee, home to Memphis, the Latino HIV diagnosis rate rose 86 percent from 2012 to 2022. The health department said it got $2 million in initiative funding in 2023 and while thecounty planacknowledges that Latinos are a target group, department director Michelle Taylor said: “There are no specific campaigns just among Latino people.” Up to now, Mecklenburg County, North Carolina, didn’t include specific targets to address HIV in the Latino population — where rates of new diagnoses more than doubled in a decade but fell slightly among other racial and ethnic groups. The health department has used funding for bilingual marketing campaigns and awareness about PrEP. **Moving for medicine** When it was time to pack up and move to Hermida’s third city in two years, his fiancé, who is taking PrEP, suggested seeking care in Orlando, Fla. The couple, who were friends in high school in Venezuela, had some family and friends in Florida, and they had heard about Pineapple Healthcare, a nonprofit primary care clinic dedicated to supporting Latinos living with HIV. The clinic is housed in a medical office south of downtown Orlando. Inside, the mostly Latino staff is dressed in pineapple-print turquoise shirts, and Spanish, not English, is most commonly heard in appointment rooms and hallways. “At the core of it, if the organization is not led by and for people of color, then we’re just an afterthought,” saidAndres Acosta Ardila, the community outreach director at Pineapple Healthcare, who was diagnosed with HIV in 2013. “¿Te mudaste reciente, ya por fin?” asked nurse practitioner Eliza Otero. Did you finally move? She started treating Hermida while he still lived in Charlotte. “Hace un mes que no nos vemos.” It’s been a month since we last saw each other. They still need to work on lowering his cholesterol and blood pressure, she told him. Though his viral load remains high, Otero said it should improve with regular, consistent care. Pineapple Healthcare, which doesn’t receive initiative money, offers full-scope primary care to mostly Latino males. Hermida gets his HIV medication at no cost there because the clinic is part of a federal drug discount program. The clinic is in many ways an oasis. The new diagnosis rate for Latinos in Orange County, Florida, which includes Orlando, rose by about a third from 2012 through 2022, while dropping by a third for others. Florida has the third-largest Latino population in the U.S., and had the seventh-highest rate of new HIV diagnoses among Latinos in the nation in 2022. Hermida, whose asylum case is pending, never imagined getting medication would be so difficult, he said during the 500-mile drive from North Carolina to Florida. After hotel rooms, jobs lost, and family goodbyes, he is hopeful his search for consistent HIV treatment — which has come to define his life the past two years — can finally come to an end. “Soy un nómada a la fuerza, pero bueno, como me comenta mi prometido y mis familiares, yo tengo que estar donde me den buenos servicios médicos,” he said. I’m forced to be a nomad, but like my family and my fiancé say, I have to be where I can get good medical services. That’s the priority, he said. “Esa es la prioridad ahora.” KFF Health News and The Associated Press analyzed data from the U.S. Centers for Disease Control and Prevention on the number of new HIV diagnoses and infections among Americans ages 13 and older at the local, state, and national levels. This story primarily uses incidence rate data — estimates of new infections — at the national level and diagnosis rate data at the state and county level. Bose reported from Orlando, Fla.. Reese reported from Sacramento, Calif.AP video journalist Laura Bargfeld contributed to this report. The Associated Press Health and Science Department receives support from the Robert Wood Johnson Foundation. The AP is responsible for all content. This article was produced byKFF Health News, which publishesCalifornia Healthline, an editorially independent service of theCalifornia Health Care Foundation. **A Project of KFF Health News and the Associated Press co-published by Univision Noticias** **CREDITS:** Reporters:Vanessa G. Sánchez, Devna Bose, Phillip Reese Cinematography:Laura Bargfeld Photography:Laura Bargfeld, Phelan M. Ebenhack Video Editing:Federica Narancio, Kathy Young, Esther Poveda Additional Video:Federica Narancio, Esther Poveda Web Production:Eric Harkleroad, Lydia Zuraw Special thanks to Lindsey Dawson Editors:Judy Lin, Erica Hunzinger Data Editor:Holly Hacker Social Media:Patricia Vélez, Federica Narancio, Esther Poveda, Carolina Astuya, Natalia Bravo, Juan Pablo Vargas, Kyle Viterbo, Sophia Eppolito, Hannah Norman, Chaseedaw Giles, Tarena Lofton Translation:Paula Andalo Copy Editing:Gabe Brison-Trezise KFF Health Newsis a national newsroom that produces in-depth journalism about health issues and is one of the core operating programs at KFF — an independent source of health policy research, polling, and journalism. Learn more aboutKFF. Subscribeto KFF Health News’ free Morning Briefing. White House urged to expand PrEP coverage for injectable form White House urged to expand PrEP coverage for injectable form CDC issues warning on new ‘deadlier strain’ of mpox CDC issues warning on new ‘deadlier strain’ of mpox **Featured Local Savings** PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Street Festival and Closing Concert PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade PHOTOS: WorldPride Parade Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message Man arrested for destroying D.C. Pride decorations, spray painting hate message **Monkeypox** **US contributes more than $90 million to fight mpox outbreak in Africa** WHO and Africa CDC has declared a public health emergency Published on By The U.S. has contributed more than $90 million to the fight against the mpox outbreak in Africa. The U.S. Agency for International Development on Tuesday in a press release announced “up to an additional” $35 million “in emergency health assistance to bolster response efforts for the clade I mpox outbreak in Central and Eastern Africa, pending congressional notification.” The press release notes the Biden-Harris administration previously pledged more than $55 million to fight the outbreak in Congo and other African countries. “The additional assistance announced today will enable USAID to continue working closely with affected countries, as well as regional and global health partners, to expand support and reduce the impact of this outbreak as it continues to evolve,” it reads. “USAID support includes assistance with surveillance, diagnostics, risk communication and community engagement, infection prevention and control, case management, and vaccination planning and coordination.” The World Health Organization and the Africa Centers for Disease Control and Prevention last week declared the outbreak a public health emergency. The Washington Blade last weekreportedthere are more than 17,000 suspected mpox cases across in Congo, Uganda, Kenya, Rwanda, and other African countries. The outbreak has claimed more than 500 lives, mostly in Congo. **Health** **Mpox outbreak in Africa declared global health emergency** ONE: 10 million vaccine doses needed on the continent Published on By Medical facilities that provide treatment to gay and bisexual men in some East African countries are already collaborating with them to prevent the spread of a new wave of mpox cases after the World Health Organization on Wednesday declared a global health emergency. The collaboration, both in Uganda and Kenya, comes amid WHO’s latestreportreleased on Aug. 12, which reveals that nine out of every 10 reported mpox cases are men with sex as the most common cause of infection. The global mpox outbreak report — based on data that national authorities collected between January 2022 and June of this year — notes 87,189 of the 90,410 reported cases were men. Ninety-six percent of whom were infected through sex. Sexual contact as the leading mode of transmission accounted for 19,102 of 22,802 cases, followed by non-sexual person-to-person contact. Genital rash was the most common symptom, followed by fever and systemic rash. The WHO report states the pattern of mpox virus transmission has persisted over the last six months, with 97 percent of new cases reporting sexual contact through oral, vaginal, or anal sex with infected people. “Sexual transmission has been recorded in the Democratic Republic of Congo among sex workers and men who have sex with men,” the report reads. “Among cases exposed through sexual contact in the Democratic Republic of the Congo, some individuals present only with genital lesions, rather than the more typical extensive rash associated with the virus.” The growing mpox cases, which are now more than 2,800 reported cases in at least 13 African countries that include Kenya, Uganda, Rwanda, and prompted the Africa Centers for Disease Control and Prevention this week todeclarethe disease a public health emergency for resource mobilization on the continent to tackle it. “Africa has long been on the frontlines in the fight against infectious diseases, often with limited resources,” said Africa CDC Director General Jean Kaseya. “The battle against Mpox demands a global response. We need your support, expertise, and solidarity. The world cannot afford to turn a blind eye to this crisis.” The disease has so far claimed more than 500 lives, mostly in Congo, even as the Africa CDC notes suspected mpox cases across the continent have surged past 17,000, compared to 7,146 cases in 2022 and 14,957 cases last year. “This is just the tip of the iceberg when we consider the many weaknesses in surveillance, laboratory testing, and contact tracing,” Kaseya said. WHO, led by Director General Tedros Adhanom Ghebreyesus, also followed the Africa CDC’s move bydeclaringthe mpox outbreak a public health emergency of international concern. The latest WHO report reveals that men, including those who identify as gay and bisexual, constitute most mpox cases in Kenya and Uganda. The two countries have recorded their first cases, and has put queer rights organizations and health care centers that treat the LGBTQ community on high alert. The Uganda Minority Shelters Consortium, for example, confirmed to the Washington Blade that the collaboration with health service providers to prevent the spread of mpox among gay and bisexual men is “nascent and uneven.” “While some community-led health service providers such as Ark Wellness Clinic, Children of the Sun Clinic, Ice Breakers Uganda Clinic, and Happy Family Youth Clinic, have demonstrated commendable efforts, widespread collaboration on mpox prevention remains a significant gap,” UMSC Coordinator John Grace stated. “This is particularly evident when compared to the response to the previous Red Eyes outbreak within the LGBT community.” Grace noted that as of Wednesday, there were no known queer-friendly health service providers to offer mpox vaccinations to men who have sex with men. He called for health care centers to provide inclusive services and a more coordinated approach. Although Grace pointed out the fear of discrimination — and particularly Uganda’s Anti-Homosexuality Act — remains a big barrier to mpox prevention through testing, vaccination, and treatment among queer people, he confirmed no mpox cases have been reported among the LGBTQ community. Uganda so far has reported two mpox cases — refugees who had travelled from Congo. “We are for the most part encouraging safer sex practices even after potential future vaccinations are conducted as it can also be spread through bodily fluids like saliva and sweat,” Grace said. Grace also noted that raising awareness about mpox among the queer community and seeking treatment when infected remains a challenge due to the historical and ongoing homophobic stigma and that more comprehensive and reliable advocacy is needed. He said Grindr and other digital platforms have been crucial in raising awareness. The declarations of mpox as a global health emergency have already attracted demand for global leaders to support African countries to swiftly obtain the necessary vaccines and diagnostics. “History shows we must act quickly and decisively when a public health emergency strikes. The current Mpox outbreak in Africa is one such emergency,” said ONE Global Health Senior Policy Director Jenny Ottenhoff. ONE is a global, nonpartisan organization that advocates for the investments needed to create economic opportunities and healthier lives in Africa. Ottenhoff warned failure to support the African countries with medical supplies needed to tackle mpox would leave the continent defenseless against the virus. To ensure that African countries are adequately supported, ONE wants governments and pharmaceutical companies to urgently increase the provision of mpox vaccines so that the most affected African countries have affordable access to them. It also notes 10 million vaccine doses are currently needed to control the mpox outbreak in Africa, yet the continent has only 200,000 doses. The Blade has reached out to Ishtar MSM, a community-based healthcare center in Nairobi, Kenya, that offers to service to gay and bisexual men, about their response to the mpox outbreak. **Health** **White House urged to expand PrEP coverage for injectable form** HIV/AIDS service organizations made call on Wednesday Published on By A coalition of 63 organizations dedicated to ending HIV called on the Biden-Harris administration on Wednesday to require insurers to cover long-acting pre-exposure prophylaxis (PrEP) without cost-sharing. In a letter toChiquita Brooks-LaSure, administrator of the Centers for Medicare and Medicaid Services, the groups emphasized the need for broad and equitable access to PrEP free of insurance barriers. Long-acting PrEP is an injectable form of PrEP that’s effective over a long period of time. The FDA approved Apretude (cabotegravir extended-release injectable suspension) as the first and only long-acting injectable PrEP in late 2021. It’s intended for adults and adolescents weighing at least 77 lbs. who are at risk for HIV through sex. The U.S. Preventive Services Task Force updated its recommendation for PrEP on Aug. 22, 2023, to include new medications such as the first long-acting PrEP drug. The coalition wants CMS to issue guidance requiring insurers to cover all forms of PrEP, including current and future FDA-approved drugs. “Long-acting PrEP can be the answer to low PrEP uptake, particularly in communities not using PrEP today,” said Carl Schmid, executive director of the HIV+Hepatitis Policy Institute. “The Biden administration has an opportunity to ensure that people with private insurance can access PrEP now and into the future, free of any cost-sharing, with properly worded guidance to insurers.” Currently, only 36 percent of those who could benefit from PrEP are using it. Significant disparities exist among racial and ethnic groups. Black people constitute 39 percent of new HIV diagnoses but only 14 percent of PrEP users, while Latinos represent 31 percent of new diagnoses but only 18 percent of PrEP users. In contrast, white people represent 24 percent of HIV diagnoses but 64 percent of PrEP users. The groups also want CMS to prohibit insurers from employing prior authorization for PrEP, citing it as a significant barrier to access. Several states, including New York and California, already prohibit prior authorization for PrEP. Modeling conducted for HIV+Hep, based on clinical trials of a once every 2-month injection, suggests that 87 percent more HIV cases would be averted compared to daily oral PrEP, with $4.25 billion in averted healthcare costs over 10 years. Despite guidance issued to insurers in July 2021, PrEP users continue to report being charged cost-sharing for both the drug and ancillary services. A recent review of claims data found that 36 percent of PrEP users were charged for their drugs, and even 31 percent of those using generic PrEP faced cost-sharing. The coalition’s letter follows a more detailed communication sent by HIV+Hepatitis Policy Institute to the Biden administration on July 2. Signatories to the community letter include Advocates for Youth, AIDS United, Equality California, Fenway Health, Human Rights Campaign, and the National Coalition of STD Directors, among others. Latest Popular **World Bank resumes lending to Uganda** **World Bank resumes lending to Uganda** **PHOTOS: WorldPride Street Festival and Closing Concert** **PHOTOS: WorldPride Street Festival and Closing Concert** **Baltimore Trans Pride to take place Saturday** **Baltimore Trans Pride to take place Saturday** **PHOTOS: WorldPride Parade** **PHOTOS: WorldPride Parade** **Judge temporarily blocks executive orders targeting LGBTQ, HIV groups** **Judge temporarily blocks executive orders targeting LGBTQ, HIV groups** **PHOTOS: WorldPride Boat Parade** **PHOTOS: WorldPride Boat Parade** **Activists rally for Andry Hernández Romero in front of Supreme Court** **Activists rally for Andry Hernández Romero in front of Supreme Court** **The best U.S. cities for LGBTQ homebuyers in 2025** **The best U.S. cities for LGBTQ homebuyers in 2025** **LGBTQ voices echo from the Lincoln Memorial at International Rally for Freedom** **LGBTQ voices echo from the Lincoln Memorial at International Rally for Freedom** **A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’** **A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’** Photos4 days agoPHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade Photos4 days agoPHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade PHOTOS: WorldPride Boat Parade U.S. Supreme Court4 days agoActivists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court U.S. Supreme Court4 days agoActivists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court Activists rally for Andry Hernández Romero in front of Supreme Court Real Estate3 days agoThe best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 Real Estate3 days agoThe best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 The best U.S. cities for LGBTQ homebuyers in 2025 Theater3 days agoA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ Theater3 days agoA hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ A hilarious ‘Twelfth Night’ at Folger full of ‘elegant kink’ About Advertise Contact Us Find A Copy Classifieds Privacy Policy Terms of Service RSS Syndication © Copyright Brown, Naff, Pitts Omnimedia, Inc. 2021. All rights reserved | Powered byKeynetik."}