{"id": 2235, "name": "The Onion", "domain": "theonion.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://theonion.com/michael-strahan-surpasses-diane-sawyer-as-good-morning-americas-all-time-sack-leader/", "title": "Michael Strahan Surpasses Diane Sawyer As Good Morning Americas All Time Sack Leader", "content": "Become A Member. Get The Paper. Wednesday, June 11, 2025 77° Isolated Thunderstorm coming out of shell, getting into musical theater America’s Finest News Source News Local Politics Entertainment Sports Opinion MoreSearchThe LatestVideoHoroscopesThe Onion Store Search The Latest Video Horoscopes The Onion Store Search The Latest Video Horoscopes The Onion Store News Local Politics Entertainment Sports Opinion MoreSearchThe LatestVideoHoroscopesThe Onion Store Search The Latest Video Horoscopes The Onion Store Search The Latest Video Horoscopes The Onion Store Wednesday, June 11, 2025 77° Isolated Thunderstorm coming out of shell, getting into musical theater The Latest News Local Politics Entertainment Sports Opinion Video Search Horoscopes About Us The Onion Store InstagramTwitterFacebookYouTubeTikTokBlueskyTumblr Instagram Twitter Facebook YouTube TikTok Bluesky Tumblr Instagram Twitter Facebook YouTube TikTok Bluesky Tumblr Free your wallet. Shop The Onion Store. Newsletter Instagram Twitter Facebook YouTube TikTok Bluesky Tumblr Share Share on Facebook Share on Bluesky Share on X Share on LinkedIn Share on SMS Email this Page **Michael Strahan Surpasses Diane Sawyer As Good Morning America’s All-Time Sack Leader** Share Share on Facebook Share on X Share on Bluesky Share on LinkedIn Share on SMS Email this Page Published: NEW YORK—After months of closing in on the former news anchor’s legendary record, Michael Strahan surpassed Diane Sawyer on Friday asGood Morning America‘s all-time sack leader. “Throughout his career onGMA, Strahan has led the show in tackles, forced fumbles, interceptions, and, most importantly, sacks,” said producer Greg Emerson, adding that Strahan’s speed, strength, and ability to penetrate the offensive line and rush the passer had also earned him the title of ABC’s Defensive Anchor of the Year. “Many people said Diane Sawyer was, and always would be, the undisputed queen of the blitz. But despite suffering a pectoral injury and being put on the IR broadcasting list, Michael Strahan was able to recover, tackle George Stephanopoulos during an in-studio cooking segment, and beat Sawyer’s long-standing record of 140 career sacks.” At press time, Strahan had reportedly been traded toCBS Morningsin exchange for CBS all-time pass rusher Gayle King and CBS return specialist/backup wide receiver Nate Burleson. Advertising Advertising **Like A Vitamin You Ingest With Your Eyes. Get The Onion Newsletter.** \"*\" indicates required fields Δ Explore Tags Related Coverage Aaron Rodgers Purchases Lavish Pittsburgh-Area Bunker **Aaron Rodgers Purchases Lavish Pittsburgh-Area Bunker** **Aaron Rodgers Purchases Lavish Pittsburgh-Area Bunker** State Department Designates WNBA As Terrorist Organization **State Department Designates WNBA As Terrorist Organization** **State Department Designates WNBA As Terrorist Organization** UFC Clown Jumps Into Octagon To Distract Irate Fighter **UFC Clown Jumps Into Octagon To Distract Irate Fighter** **UFC Clown Jumps Into Octagon To Distract Irate Fighter** Advertising **Trending** PoliticsTrump Escalates Musk Feud By Nuking Mars **Trump Escalates Musk Feud By Nuking Mars** **Trump Escalates Musk Feud By Nuking Mars** NewsFEMA Chief Confused By Wind **FEMA Chief Confused By Wind** **FEMA Chief Confused By Wind** EntertainmentChristie Brinkley Also Shocked To Learn She Not Spokesperson For Skechers **Christie Brinkley Also Shocked To Learn She Not Spokesperson For Skechers** **Christie Brinkley Also Shocked To Learn She Not Spokesperson For Skechers** **Recent News** American VoicesIsrael Intercepts Gaza Aid Boat With Greta Thunberg Aboard **Israel Intercepts Gaza Aid Boat With Greta Thunberg Aboard** **Israel Intercepts Gaza Aid Boat With Greta Thunberg Aboard** EntertainmentAmazon Teases Next James Bond Will Face Off Against Threat Of Collective Bargaining **Amazon Teases Next James Bond Will Face Off Against Threat Of Collective Bargaining** **Amazon Teases Next James Bond Will Face Off Against Threat Of Collective Bargaining** LocalDissolving Fillers Leave Face Completely Concave **Dissolving Fillers Leave Face Completely Concave** **Dissolving Fillers Leave Face Completely Concave** Real EstateClose To Transportation **Close To Transportation** **Close To Transportation** ObituariesGreg King **Greg King** **Greg King** **Join The Millions Of Others Who Entered In Their Credit Card Number.** Advertising **Read More** ObituariesGreg King **Greg King** **Greg King** SportsAaron Rodgers Purchases Lavish Pittsburgh-Area Bunker **Aaron Rodgers Purchases Lavish Pittsburgh-Area Bunker** **Aaron Rodgers Purchases Lavish Pittsburgh-Area Bunker** NewsICE Releases Gavin Newsom Beheading Video **ICE Releases Gavin Newsom Beheading Video** **ICE Releases Gavin Newsom Beheading Video** EntertainmentThe Onion’s Box Office Hits **The Onion’s Box Office Hits** **The Onion’s Box Office Hits** Your Horoscope — Today’s Birthday Gemini(May 21 to June 20):You really shouldn’t have done that…That’s unfortunately as specific as the stars can be.Read Your Horoscope Gemini (May 21 to June 20): You really shouldn’t have done that…That’s unfortunately as specific as the stars can be. Read Your Horoscope Gemini (May 21 to June 20): You really shouldn’t have done that…That’s unfortunately as specific as the stars can be. Read Your Horoscope Subscribe for all the latest Headlines \"*\" indicates required fields Δ **Sections** The Latest News Local Politics Entertainment Sports Opinion Video **Explore** Search About Us Become a Member The Onion Store Front Page Archive Jobs © 2025 The Onion Privacy Policy Cookie Policy Terms of Use DMCA Print Membership Terms Instagram Twitter Facebook YouTube TikTok Bluesky Tumblr"}