{"id": 1743, "name": "Israel365 News", "domain": "israel365news.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://israel365news.com/409490/thunberg-deported-after-gaza-flotilla-interception-rocket-fired-from-gaza-intercepted-near-zikim-and-idf-dismantles-explosives-lab-in-tulkarem/", "title": "Thunberg Deported After Gaza Flotilla Interception Rocket Fired From Gaza Intercepted Near Zikim And Idf Dismantles Explosives Lab In Tulkarem", "content": "IDF Biblical News Israel News Jerusalem Judea & Samaria Israel365 Action Opinion IDF Biblical News Israel News Jerusalem Judea & Samaria Israel365 Action Opinion **Thunberg Deported After Gaza Flotilla Interception, Rocket Fired from Gaza Intercepted Near Zikim, and IDF Dismantles Explosives Lab in Tulkarem** **No one shall be able to resist you as long as you live. As I was with Moshe, so I will be with you; I will not fail you or forsake you.** **Joshua** **1:** **5** **(the israel bible)** **Israel at War** **June 10, 2025** **3min read** Home»Thunberg Deported After Gaza Flotilla Interception, Rocket Fired from Gaza Intercepted Near Zikim, and IDF Dismantles Explosives Lab in Tulkarem **gazaIDF - Israel Defense ForceIsrael** **Greta Thunberg Deported from Israel After Gaza Flotilla Attempt; Eight Activists Detained** Swedish climate activist Greta Thunberg was deported from Israel early Tuesday after she and 11 fellow activists were intercepted by Israeli forces while trying to breach the naval blockade of Gaza. Their vessel, theMadleen, sailing under a British flag, was stopped before reaching the Gaza Strip. According to Israeli media, four of the activists agreed to deportation and returned home. The remaining eight, including French European Parliament Member Rima Hassan, declined to sign deportation documents and were taken into custody. They will be held at the Givon detention facility for up to 96 hours before potentially being deported without their consent, as per Israeli law. The activists, associated with the Freedom Flotilla Coalition, had departed from Italy with a small consignment of humanitarian aid. Israel’s Foreign Ministry criticized the mission, calling it a media stunt rather than a serious relief effort, noting that the aid on board amounted to less than a single truckload. Israel emphasized that it has facilitated the entry of over 1,200 aid trucks into Gaza in the past two weeks alone, in contrast to the flotilla’s symbolic gesture. The ministry reiterated that the maritime blockade is lawful and in place to prevent weapons smuggling and other threats from groups like Hamas. The passengers of the “Selfie Yacht” arrived at Ben Gurion Airport to depart from Israel and return to their home countries.Some of the “Selfie Yacht” passengers are expected to leave within the next few hours.Those who refuse to sign deportation documents and leave Israel will…pic.twitter.com/szEHmd0rS0 Thunberg posted on social media describing her detention as a “kidnapping” by Israeli forces. Former U.S. President Donald Trump reacted dismissively, suggesting she needed “anger management” and calling her “a strange person.” The Foreign Ministry stated that consular officials from the activists’ countries met them at Ben Gurion Airport. Officials warned that any unauthorized attempt to challenge the blockade is both illegal and dangerous. **Rocket Fired from Gaza Intercepted Near Zikim Beach** The Israeli military intercepted a rocket launched from northern Gaza on Tuesday morning after it triggered warning sirens in the Zikim Beach area, close to the Israel-Gaza border. The rocket was shot down by Israel’s air defense system, and no injuries or property damage were reported, according to a spokesperson from the Israel Defense Forces (IDF). 🔴 𝗕𝗥𝗘𝗔𝗞𝗜𝗡𝗚 𝗡𝗘𝗪𝗦 | Rocket Sirens Return: Zikim Beach area targeted by Gaza terrorists in past few minutesREPORT▸https://t.co/7FopHSAJ0tpic.twitter.com/wEHqFbBBJN Shortly after the incident, IDF Arabic-language spokesperson Lt. Col. Avichay Adraee issued a public warning on social media. He urged residents in northern Gaza to evacuate, stating that the Israeli military would soon carry out a major operation against terrorist elements in the area. “The IDF will respond forcefully to any act of terrorism or rocket fire,” Adraee emphasized, advising civilians to seek shelter in designated safe zones within Gaza City. **IDF Uncovers and Destroys Explosives Lab in Tulkarem** Israeli forces uncovered and demolished a bomb-making facility in the city of Tulkarem in western Samaria on June 4, as part of a wider counter-terrorism effort. The discovery was announced Monday morning by the Israel Defense Forces (IDF). Troops found gas canisters and other materials used to manufacture improvised explosive devices (IEDs). Additional sites used for building explosive devices and suicide drones were also located during the operation, the IDF said. These actions are part of “Operation Iron Wall,” launched in January to dismantle terrorist infrastructure in Judea and Samaria. Defense officials say the initiative marks a significant shift in Israel’s security approach in the region. The IDF increased its activity in Tulkarem following a failed bombing attempt near Tel Aviv in February, where several buses were targeted. Investigators linked those attacks to the Tulkarem refugee camp. In related operations over the weekend, the IDF, Shin Bet, and Israeli police arrested 35 wanted individuals across Judea and Samaria. Authorities also seized weapons, military equipment, and substantial sums of money tied to terrorist activity. Among those arrested were suspects involved in rock-throwing attacks and other forms of violence against Israeli civilians and forces. According to data from Rescuers Without Borders, Palestinian attacks in Judea and Samaria numbered over 6,300 in 2024 alone, with 27 Israelis killed and more than 300 injured. The incidents included Molotov cocktail attacks, shootings, explosive charges, and attempted arsons. **Share this article** **Related articles** **Huckabee Slams U.S. Media as IDF Hits Hamas Targets and Greta Thunberg Joins Gaza Flotilla Challenge** **More Aid in Gaza, Unrest in Samaria, and Israel Supports Hezbollah Disarmament in Lebanon** **Netanyahu Vows Final Victory in Gaza as IDF Defends Israel from Houthi Missiles and Eliminates Terrorist Behind Fatal Attack** **Follow Us** Opinion Jerusalem IDF Judea & Samaria Israel365 Action Opinion Jerusalem IDF Judea & Samaria Israel365 Action Biblical Archeology SCIENTIFIC INNOVATIONS Terror Watch List of Terror Victims About Us Biblical Archeology SCIENTIFIC INNOVATIONS Terror Watch List of Terror Victims About Us Opinion Jerusalem IDF Judea & Samaria Israel365 Action Opinion Jerusalem IDF Judea & Samaria Israel365 Action © ISRAEL365NEWS 2025 Privacy Policy Opinion Judea & Samaria Israel365 Action Jerusalem IDF Biblical Archeology Scientific Innovations Terror Watch Videos Podcasts **Subscribe** Prophecy from the Bible is revealing itself as we speak. Israel365 News is the only media outlet reporting on it. Sign up to our free daily newsletter today to get all the most important stories directly to your inbox. See how the latest updates in Jerusalem and the world are connected to the prophecies we read in the Bible. ."}