{"id": 1107, "name": "PolicyEd.org", "domain": "policyed.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.policyed.org/lessons-hoover-policy-boot-camp/expanding-college-going-opportunities-meritorious-students-all-3", "title": "Expanding College Going Opportunities Meritorious Students All 3", "content": "Jump to navigation About Scholars FAQs Log in Series Topics Latest Register Caroline Hoxby discusses how to expand college opportunities for low-income, high-achieving students. The Investment Returns of a College Degree College Opportunities for Low- Income, High-Achieving Students Expanding College Opportunities for All Students Further Explanations – Free College and Eliminating Standardized Tests Knowledge Base Test Your Knowledge **Related Resources** **“What High-Achieving Low-Income Students Know About College,” by Caroline Hoxby and Sarah Turner** **“Expanding College Opportunities for High-Achieving Low-Income Students,” by Caroline Hoxby and Sarah Turner** **“The Right way to Capture College ‘Opportunity’” by Caroline Hoxby and Sarah Turner** **“Identifying the Colleges that Successfully Recruit Low-Income Students,” featuring Caroline Hoxby** **Expanding College Opportunities for All Students** Comment Published January 6, 2022 Caroline Hoxby explains how she and her team created a customized informational intervention to help low-income, high-achieving students learn more about the true costs of attending selective institutions. They tested this intervention using a randomized control trial. The intervention caused big increases in college applications, college admissions, and graduation rates for the treated students. Discussion Questions: What challenges do low-income, high-achieving students face when applying to college? What resources might be useful to low-income, high-achieving students applying to college? Additional resources: Read “What High-Achieving Low-Income Students Know About College,” by Caroline Hoxby and Sarah Turner. Availablehere. Read “Expanding College Opportunities for High-Achieving Low-Income Students,” by Caroline Hoxby and Sarah Turner Availablehere. Read “The Right way to Capture College ‘Opportunity’” by Caroline Hoxby and Sarah Turner viaEducation Next. Availablehere. View the discussion thread. Donate Series Topics Latest Register About FAQs Contact Us Connect with us © 2024 by the Board of Trustees of Leland Stanford Junior University |Privacy Policy"}