{"id": 366, "name": "Disability Scoop", "domain": "disabilityscoop.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.disabilityscoop.com/2025/05/23/house-approves-deep-cuts-to-medicaid-threatening-disability-services-advocates-say/31472/", "title": "House Approves Deep Cuts To Medicaid Threatening Disability Services Advocates Say", "content": "Access provided by My Account Log Out Join Log In Latest News Education Health & Behavior Living Money Politics & Law Autism Cerebral Palsy Down Syndrome Intellectual Disability About Email Sign-Up Advertise Contact Search Jobs Facebook Twitter LinkedIn RSS Email Sign-Up Jobs 1New Disability Regulations For Airlines Won’t Be Enforced 2PBS Series To Center On Autism 3Across The US, Unions Are Seeking Big Boosts To Paraprofessional Pay 4Amid Uncertainty, Parents Raise Funds For Rare Disorder 5Effort To Roll Back Federal Disability Rights Protections Alarms Advocates 6Most TV Characters With Disabilities Played By Those Without 7‘Landmark’ Study Shows Possible Path To Treat, Prevent Autism 8Trump Budget Calls For Major Changes To Disability Programs 9School Districts Face Soaring Demand For Special Education 10Apple Making Film About Disability Rights Activist **House Approves Deep Cuts To Medicaid Threatening Disability Services, Advocates Say** by Michelle Diament| May 23, 2025 A bill calling for sweeping changes to Medicaid now heads to the U.S. Senate. (Thinkstock) The U.S. House of Representatives approved billions in cuts to Medicaid that advocates warn would undermine the nation’s already fragile system of services and supports for people with disabilities. Republicans in the House pushed through a bill designed to follow through on President Donald Trump’s domestic agenda early Thursday by a vote of 215 to 214 after intense negotiations. The legislation known as the “One Big Beautiful Bill Act,” which now heads to the Senate, would impose work requirements on many Medicaid beneficiaries and mandates that states check individuals’ eligibility for the program more frequently, among other changes. Advertisement - Continue Reading Below The Congressional Budget Office estimated earlier this week that the changes called for in the bill would lead to $698 billion less in federal Medicaid subsidies between 2026 and 2034. Savings from Medicaid and other areas would help pay for an extension of tax cuts from Trump’s first term and support other administration priorities. Republicans said the measure will end “waste, fraud and abuse” in Medicaid. “Today, the House has passed generational, nation-shaping legislation that reduces spending, permanently lowers taxes for families and job creators, secures the border, unleashes American energy dominance, restores peace through strength, and makes government work more efficiently and effectively for all Americans,” House Speaker Mike Johnson, R-La., said. He indicated that the measure “strengthens our essential programs like Medicaid for the people who need it the most.” Disability advocates, however, say that’s not the case. “No matter what some Congressional leaders repeatedly deny, this budget contains some of the largest cuts to Medicaid in history,” said Nicole Jorwic, chief program officer at Caring Across Generations, an organization advocating for caregivers and people who rely on them. “This will impact disability service systems. Providers will close, wages will go down for an already underpaid (direct support professional) workforce, and disabled people will be at risk of losing their coverage if they don’t break through red tape and jump through the hoops being created by eligibility checks and work requirements.” While disability services are not explicitly mentioned in the bill, chopping billions in federal investment for Medicaid would put financial pressure on states, advocates say. “Community-based services for people with disabilities are not federally mandated and are especially vulnerable to Medicaid funding reductions at the state level,” said Elise Aguilar, senior director of federal relations at the American Network of Community Options and Resources, or ANCOR, which represents disability service providers across the nation. “Historically, when states face Medicaid funding shortfalls, non-mandatory services like home and community-based services are among the first to be scaled back, restricting access to essential supports people with disabilities need to live, work and thrive in their communities.” The push for cuts comes at a time when the Medicaid home and community-based services system is already struggling. Over 700,000 people are on waiting lists for Medicaid waivers, which provide such services, according to KFF, a nonprofit that conducts health policy research. And asurveyof almost 500 community-based services providers across the country late last year found that nearly all had experienced moderate or severe staffing shortages in the previous year. As a result, 69% had declined new clients and 39% closed programs or services, with over a third saying they were considering further cuts. Lydia Nunez Landry with the disability rights group ADAPT said that waiting lists will only increase under the House bill forcing people with disabilities into institutions. “The cuts are draconian and will have a catastrophic impact on people with disabilities, older Americans, children and poor people,” Nunez Landry said. “Disabled people will be socially removed into institutions and die.” There are also concerns that more frequent eligibility checks and work requirements will mean increased paperwork and greater chances for people who qualify for Medicaid to be inadvertently lobbed off. Meanwhile, states will be obligated to allocate resources toward establishing systems to verify the new requirements are met, said Katy Neas, CEO of The Arc of the United States. “These cuts are devastating,” said Neas who urged the Senate to reject the cuts. “And we won’t be silent while our community is pushed past the brink.” This page is available to subscribers. Click here to sign in or get access. Read more stories like this one.Sign up for Disability Scoop's free email newsletterto get the latest developmental disability news sent straight to your inbox. Advertisement - Continue Reading Below **Find a Job** President & CEO Executive Director Direct Support Professional with Experience in Media and Influencer Marketing Program Supervisor – Group Homes for Adults with Intellectual Disabilities Executive Director **Read Next** **Politics & Law** **New Disability Regulations For Airlines Won’t Be Enforced** Federal officials are holding off on implementing new regulations that were hailed as the largest expansion of rights for airline passengers with disabilities in a generation. **Autism** **PBS Series To Center On Autism** A new drama focusing on a character with autism who has a unique way of solving crimes is coming to television. **Education** **Across The US, Unions Are Seeking Big Boosts To Paraprofessional Pay** Teachers unions are seeking to boost paraprofessional pay, which remains so low that workers are struggling to get by in many states. © 2025 Disability Scoop, LLC. All Rights Reserved. View this article online athttps://www.disabilityscoop.com/2025/05/23/house-approves-deep-cuts-to-medicaid-threatening-disability-services-advocates-say/31472/ **Sign up today forthe Disability ScoopNewsletter** **Thanks for your interest** Please check your email for instructions to complete your sign-up. © 2008-2025 Disability Scoop, LLC. All Rights Reserved. Privacy Policy Terms and Conditions Advertise **Sign up for our newsletterGet the latest developmental disability news sent straight to your inbox.Autism, intellectual disability, cerebral palsy, Down syndrome, and more.** Get the latest developmental disability news sent straight to your inbox. Autism, intellectual disability, cerebral palsy, Down syndrome, and more. Get the latest developmental disability news sent straight to your inbox. Autism, intellectual disability, cerebral palsy, Down syndrome, and more. **Sign up for our newsletterGet the latest developmental disability news sent straight to your inbox.Autism, intellectual disability, cerebral palsy, Down syndrome, and more.** Get the latest developmental disability news sent straight to your inbox. Autism, intellectual disability, cerebral palsy, Down syndrome, and more. Get the latest developmental disability news sent straight to your inbox. Autism, intellectual disability, cerebral palsy, Down syndrome, and more. You're readingoffree articles this month. This is your last free article this month. **Get unlimited Disability Scoop access starting at just $5** Logged in as Already a member?Log In **Log In** Forgot password? Don't have an account?Join Today"}