{"id": 598, "name": "Glamour Magazine", "domain": "glamour.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.glamour.com/story/nordstrom-half-yearly-sale-trends-2025", "title": "Nordstrom Half Yearly Sale Trends 2025", "content": "Newsletter Style Beauty Entertainment Shopping Wellness Culture Gifts Video Women of the Year Newsletter Style Beauty Entertainment Shopping Wellness Culture Gifts Video Women of the Year Facebook X Instagram Pinterest Tiktok **7 Summer Trends I’m Buying Before the Nordstrom Half-Yearly Sale Ends** All products featured on Glamour are independently selected by our editors. However, we may receive compensation from retailers and/or from purchases of products through these links. Deal hunters, assemble! The Nordstrom Half-Yearly sale—the retailer’s biannual savings event with discounts up to 60% off—is coming to a close, and it’s time to finalize your carts. While you can find a little of everything, sure, I’m most excited about the clothes and accessories. So many current-season pieces are included in the markdowns, meaning plenty ofsummer’s biggest fashion trendsare up for grabs.Barrel jeans?Drop-waist dresses?Colorful sneakers? Check, check, check. The Nordstrom Half-Yearly sale wraps up on Sunday, June 1, so you’ll have to act fast. (Plenty of the coolest finds, including from designer labels like Staud and Tory Burch, are starting to sell out.) So in the interest of getting your warm-weather wardrobe into shape, I went ahead and curated the absolute trendiest fashion deals below. Get going before the discounts disappear for good. **Glamour’s Nordstrom Half-Yearly sale wish list** The Bold Sneakers:Puma Palermo Sneakers,$80$48 (40% off) The Summer Dress:Free People Primavera Sundress,$168$92 (40% off) The Editor-Worn Jeans:Pistola Eli High-Rise Barrel Jeans,$178$107 (40% off) The Gold Ring:PDPaola Shell Ring,$150$113 (25% off) The Vacation Flats:Marc Fisher LTD Maycee Sandals,$99$70 (29% off) The Designer Bag:Tory Burch Mini Denim Bucket Bag,$368$221 (40% off) The Chic Skirt:Staud Procida Skirt,$325$211 (35% off) **1. Coastal chic** Everyone’s dressing like they live seaside this season, whether or not there’s an actual body of water nearby. Breton stripes,fisherman sandals, shell motifs—anything that could remind you of the ocean is very much in play, and plenty of it is currently on sale at Nordstrom. In fact, these four pieces would make an incredible outfit. **Moon River Sleeveless Stripe Maxi Sundress** Nordstrom Nordstrom **Vince Melina Fisherman Sandals** Nordstrom Nordstrom **Nina Shelly Rattan Bag** Nordstrom Nordstrom **PDPaola Shell Ring** Nordstrom Nordstrom **2. Bucket bags** Buckets popped up at plenty of our favorite spring-summer runway shows, including Prada and Gucci, and we couldn’t be happier that they’re trending. Few silhouettes feel as laid-back and summery; it’s the perfect on-the-go companion, especially for exploring a new place on vacation. And these designer picks are way cheaper than usual right now. Thanks, Nordy! **Tory Burch Mini T-Monogram Denim Bucket Bag** Nordstrom Nordstrom **Veronica Beard Small Grommet Convertible Satchel** Nordstrom Nordstrom **Toteme Leather Bucket Bag** Nordstrom Nordstrom **Mulberry Islington Leather Bucket Bag** Nordstrom Nordstrom **3. Colorful sneakers** It’s officially time to give yourwhite sneakersa break, even if it’s just for a season. I’ve been seeing so many candy-colored kicks out in the wild, and everyone from Emily Ratajkowski and Charli XCX is on board with the look. Go low-key in sky-blue court shoes or make your plainer outfits pop with bold red or yellow. **Puma Palermo Sneakers** Nordstrom Nordstrom **Dolce Vita Notice Sneakers** Nordstrom Nordstrom **Steve Madden Verdict Mesh Sneakers** Nordstrom Nordstrom **Vince Oasis Runner Sneakers** Nordstrom Nordstrom **4. Drop-waist silhouettes** Drop-waist dresses and skirts offer an easygoing elegance that’ll meet the moment at any dressy occasion—dinner dates, backyard birthdays, fancy brunches, you name it. Whether you need a stunner of a wedding guest dress or a trendy addition to your work wardrobe, these discounted gems belong in your summer rotation. **Hutch Drop-Waist Maxidress** Nordstrom Nordstrom **WeWoreWhat Drop-Waist Maxidress** Nordstrom Nordstrom **Staud Procida Skirt** Nordstrom Nordstrom **Caslon Linen-Blend Skirt** Nordstrom Nordstrom **5. Romantic eyelets** Many of summer’s cutest skirts, dresses, and blouses feature delicate eyelets. The detailing is adjacent to 2025’s big boho revival and nods at the sheer look that’s so hot in fashion right now—while keeping things wearable. These dresses are perfect for casual celebrations, while the separates below will pair well with your favorite jeans andT-shirts. **Free People Primavera Eyelet Sundress** Nordstrom Nordstrom **Cinq à Sept Maude Embroidered Dress** Nordstrom Nordstrom **Wit & Wisdom Embroidered Eyelet Shirt** Nordstrom Nordstrom **Farm Rio Flower Crochet Skirt** Nordstrom Nordstrom **6. T-strap sandals** In the mood for something a little more elevated than flip-flops? Thesetrendy sandalsare the answer. I’ve been seeing more and more T-straps on my feed, and all of these picks could almost pass for The Row (especially styled with roomy shorts or relaxed linen pants). Better yet, thanks to its ankle strap, this silhouette is a little morewalking-friendlythan other options. **Tory Burch Georgia Sandals** Nordstrom Nordstrom **Cole Haan Gayle Sandals** Nordstrom Nordstrom **Schutz Elsha Slingback Sandals** Nordstrom Nordstrom **Marc Fisher LTD Maycee Sandals** Nordstrom Nordstrom **7. Barrel jeans** If you haven’t yet hopped on the barrel-jeans bandwagon, now’s your chance to do it while thetrendy denimis on sale. WhileGlamourstaffers were initially skeptical of the cut, we’ve been proven wrong: It’s universally flattering and lends an editorial edge to your usual denim rotation. One editor recommends the Pistola pair below forpetite people, while another loves Madewell’s subtler, easy-to-wear take. **Pistola Eli High-Rise Barrel Jeans** Nordstrom Nordstrom **Madewell Darted Barrel-Leg Jeans** Nordstrom Nordstrom **Good American Good Relaxed Barrel Jeans** Nordstrom Nordstrom **Free People Rylee Wide-Leg Chinos** Nordstrom Nordstrom **All the Best Memorial Day Deals of 2025** The Memorial Day Clothing Sales Our Editors AreActuallyShopping The Memorial Day Clothing Sales Our Editors AreActuallyShopping The Memorial Day Clothing Sales Our Editors AreActuallyShopping Amazon’s Memorial Day Sale Is the Best Place to Shop Summer Trends Amazon’s Memorial Day Sale Is the Best Place to Shop Summer Trends Amazon’s Memorial Day Sale Is the Best Place to Shop Summer Trends Nordstrom’s Half-Yearly Sale Is Here—Peek Inside Our Carts Nordstrom’s Half-Yearly Sale Is Here—Peek Inside Our Carts Nordstrom’s Half-Yearly Sale Is Here—Peek Inside Our Carts All the Chic Trends We’re Buying on Sale Over the Long Weekend All the Chic Trends We’re Buying on Sale Over the Long Weekend All the Chic Trends We’re Buying on Sale Over the Long Weekend **Glamour Coupons** First-time customers can get a 15% Bloomingdale’s promo code First-time customers can get a 15% Bloomingdale’s promo code Get a 15% Off MESHKI Discount Code with Email Sign Up Get a 15% Off MESHKI Discount Code with Email Sign Up 15% off Kizik promo code + free shipping with sign up 15% off Kizik promo code + free shipping with sign up Extra 15% off outlet styles with this Michael Kors Promo Code Extra 15% off outlet styles with this Michael Kors Promo Code Sign Up For Texts & Get A 15% Off VIVAIA Coupon Code Sign Up For Texts & Get A 15% Off VIVAIA Coupon Code Spanx promo code: 20% off your first order with email or text sign-up Spanx promo code: 20% off your first order with email or text sign-up Facebook X Instagram Pinterest Tiktok More from Glamour About Glamour Newsletter Signup Glamour Media Kit See More Stories & Guides Fashion Beauty Wellness News & Culture Sex & Relationships Gifts for Women Vibrators LED Face Masks Leggings Silk Pillowcases Coupons User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Accessibility Help Condé Nast Store Contact Glamour ©2025Condé Nast. All rights reserved.Glamourmay earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad Choices Brazil Bulgaria Germany Hungary Mexico Poland Romania South Africa Spain US"}