{"id": 1988, "name": "Health Magazine", "domain": "health.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.health.com/this-diet-can-significantly-reduce-your-risk-of-alzheimer-s-and-it-s-never-too-late-to-start-11748497", "title": "This Diet Can Significantly Reduce Your Risk Of Alzheimer S And It S Never Too Late To Start 11748497", "content": "Search the siteGOPlease fill out this field. Newsletters NewsNewsTrending Trending Trending Conditions A - ZConditions A - ZAnxietyCoronavirusType 2 DiabetesHeadaches and MigrainesHeart DiseaseView All Anxiety Coronavirus Type 2 Diabetes Headaches and Migraines Heart Disease View All Anxiety Coronavirus Type 2 Diabetes Headaches and Migraines Heart Disease View All NutritionNutritionEat WellNutrition BasicsVitamins and SupplementsView All Eat Well Nutrition Basics Vitamins and Supplements View All Eat Well Nutrition Basics Vitamins and Supplements View All WellnessWellnessMental HealthFitnessSkincareSexual HealthView All Mental Health Fitness Skincare Sexual Health View All Mental Health Fitness Skincare Sexual Health View All What to BuyWhat to BuyNutrition & SupplementsOral & Dental CareSleep ProductsOver the CounterSkincareView All Nutrition & Supplements Oral & Dental Care Sleep Products Over the Counter Skincare View All Nutrition & Supplements Oral & Dental Care Sleep Products Over the Counter Skincare View All About UsAbout UsEditorial ProcessMedical Expert BoardTesting and Vetting ProductsRead More Editorial Process Medical Expert Board Testing and Vetting Products Read More Editorial Process Medical Expert Board Testing and Vetting Products Read More Search the siteGOPlease fill out this field. Newsletter Sign Up NewsTrending Trending Trending Conditions A - ZAnxietyCoronavirusType 2 DiabetesHeadaches and MigrainesHeart DiseaseView All Anxiety Coronavirus Type 2 Diabetes Headaches and Migraines Heart Disease View All Anxiety Coronavirus Type 2 Diabetes Headaches and Migraines Heart Disease View All NutritionEat WellNutrition BasicsVitamins and SupplementsView All Eat Well Nutrition Basics Vitamins and Supplements View All Eat Well Nutrition Basics Vitamins and Supplements View All WellnessMental HealthFitnessSkincareSexual HealthView All Mental Health Fitness Skincare Sexual Health View All Mental Health Fitness Skincare Sexual Health View All What to BuyNutrition & SupplementsOral & Dental CareSleep ProductsOver the CounterSkincareView All Nutrition & Supplements Oral & Dental Care Sleep Products Over the Counter Skincare View All Nutrition & Supplements Oral & Dental Care Sleep Products Over the Counter Skincare View All Editorial Process Medical Expert Board Testing and Vetting Products **This Diet Could Cut Your Dementia Risk—Even If You Start Later in Life** Researchers offer more evidence that the MIND eating plan truly can keep your brain healthy. Liudmila Chernetska / Getty Images In a new study, theMIND dietwas linked to alower risk of Alzheimer’s and dementia, even when adopted later in life. Foods in the MIND diet maylower inflammationandsupport brain healthas you age. Experts say it’snever too lateto eat more brain-friendly foods likeleafy greens, berries, and fish. A new study found a link between following the MIND diet and a significantly lower risk of dementia, including Alzheimer’s disease—even when the eating plan is adopted later in life. The new research, presented last week at the annual meeting of the American Society for Nutrition, specifically found that adopting the diet—which focuses on foods such as leafy greens and fatty fish like salmon—may reduce the chances ofdementiaby 25%. “Results of this large-scale longitudinal study are consistent with previous research showing that adherence to the MIND diet reduces risk for developingAlzheimer’s disease,”Gary Small, MD, a geriatric psychiatrist, chair of psychiatry at Hackensack University Medical Center, and author of multiple books on cognitive health and aging, toldHealth. “The large sample size and long study duration make these findings particularly compelling.” **What Is the MIND Diet?** The MIND diet isa fusion of two highly regarded diets: The Mediterranean diet.This eating plan doesn’t have one strict formula but is based on the generalized eating habits of people living in the countries along the Mediterranean Sea. It’s heavy on plant-based foods, including many fruits and vegetables, nuts, legumes, whole grains, and healthy fats, with small amounts of eggs, low-fat dairy, fish, and other lean proteins. It limits butter and othersaturated fats, added sugar, refined grains, and overly processed foods. Research has found that the Mediterranean diet may help you live longer, reduce inflammation in your body, lower the risk of heart disease and some cancers, and improve mental health. The DASH diet. While this diet focuses on mostly the same foods as the Mediterranean diet, it places a greater emphasis on limitingsodiumand saturated fats to lower blood pressure and boost cardiovascular health. The MIND diet “is similar in many ways to the Mediterranean and DASH diets, butit emphasizes specific nutrients found in foods like dark leafy greens, berries, and nuts that we know are essential for brain healthandreducing risk of Alzheimer’s diseaseand dementia,”Julie Andrews, RDN, a registered dietitian, chef, and author of cookbooks about the MIND and DASH diets, toldHealth. Other brain-boosting foods incorporated into the diet are fatty fish like salmon and healthy fats (primarily olive oil). **What Did the Study Find?** Researchers gathered and analyzed data from 92,849 people involved in the University of Hawaii’s Multiethnic Cohort Study. At the study’s start, participants were between the ages of 45 and 75 and represented five racial and ethnic groups: African-American, Latino, White, Japanese-American, and Native Hawaiian. Ten years after participants completed a food-frequency questionnaire, researchers followed up with them to assess how closely they adhered to the MIND diet. People whofollowed the MIND diet most closely had a 9% lower risk of developing Alzheimer’sdisease and related dementias compared to those who stuck to the eating plan the least. Those whoimproved their MIND diet score the most over 10 years, even if they didn’t follow the diet at first, had a 25% lower risk of developing dementiathan those whose diet scores got worse. “This suggests that it is never too late to adopt a healthy diet to prevent dementia,” saidSong-Yi Park, PhD, the study’s first author and an associate professor at the University of Hawaii at Manoa, in a press release. **Were Results the Same Across Racial Groups?** Researchers found an association between the MIND diet and lower dementia risk in racial and ethnic groups except Native Hawaiians, who saw no benefit regardless of age. Of the groups that did seem to benefit, the connection was weakest for Japanese-Americans. The reasons for this aren’t obvious, saidBrendan Kelley, MD, a neurologist and dementia expert at the Peter J. O’Donnell Jr. Brain Institute at the University of Texas Southwestern. “It is not clear why, and this study is not structured to be able to answer this question,” he toldHealth. However, the study’s authors noted the possibility that Asian Americans experience lower rates of dementia compared to the other racial and ethnic groups included in the study. That could make it more difficult to demonstrate statistically significant differences in dementia rates, Small said. **What Were the Study’s Limitations?** Theresearch hasn’t yet been peer-reviewedand shows only a correlation between the MIND diet and a lower dementia risk—itdoesn’t prove causation. “People who are more conscientious in adherence to a healthy diet also would be more likely to engage in other healthy lifestyle behaviors, such as regular physical exercise, social engagement, and mental stimulation, all of which may have contributed to the lowered risk for the disease,” Small said. Additionally, “the study relies on information that was reported by participants and on diagnoses that were assigned in clinical settings. The researchers did not directly evaluate the people participating in the study, and so the accuracy of the diagnosis or diet is not known,” Kelley said. However, thisisn’t the firststudy to find a link between the MIND diet and lower chances of dementia. Previous research has also shown that the diet may slow brain aging by up to 7.5 years and could lead to other improvements in various aspects of aging, including grip strength, mobility, and “inflammaging,” a term forchronic low-grade inflammation. **Should You Try the MIND Diet For a Brain Boost?** Small, Andrews, and Kelley areproponents of this eating plan. “It’s never too early or too late to change your dietary and lifestyle habits to protect your brain,” Small said. To get started, Andrews recommended: Swapping out refined grains, such as white bread, forwhole grains Adding in a few weekly servings of dark leafy greens Snacking on ahandful of roasted nutsevery week Making a weekly frozen berry smoothie Adhering to the MIND diet can be pricey, however. For budget-friendly ways to implement the eating plan, Andrews suggested: Usingfrozen vegetablesinstead of fresh Addingcanned beansto casseroles, soups, salads, and bowls Opting for canned salmon and tuna, which you can mix into salads, pasta dishes, and fish burgers News Park SY, Setiawan VW, Crimmins E, et al.The MIND diet and incidence of Alzheimer’s disease and related dementias among five racial and ethnic groups in the multiethnic cohort study.Curr Dev Nutr. 2025;9:106493. doi:10.1016/j.cdnut.2025.106493 Park SY, Setiawan VW, Crimmins E, et al.The MIND diet and incidence of Alzheimer’s disease and related dementias among five racial and ethnic groups in the multiethnic cohort study.Curr Dev Nutr. 2025;9:106493. doi:10.1016/j.cdnut.2025.106493 Park SY, Setiawan VW, Crimmins E, et al.The MIND diet and incidence of Alzheimer’s disease and related dementias among five racial and ethnic groups in the multiethnic cohort study.Curr Dev Nutr. 2025;9:106493. doi:10.1016/j.cdnut.2025.106493 Liu X, Morris MC, Dhana K, et al.Mediterranean-DASH Intervention for Neurodegenerative Delay (MIND) study: rationale, design and baseline characteristics of a randomized control trial of the MIND diet on cognitive decline.Contemp Clin Trials. 2021;102:106270. doi:10.1016/j.cct.2021.106270 Liu X, Morris MC, Dhana K, et al.Mediterranean-DASH Intervention for Neurodegenerative Delay (MIND) study: rationale, design and baseline characteristics of a randomized control trial of the MIND diet on cognitive decline.Contemp Clin Trials. 2021;102:106270. doi:10.1016/j.cct.2021.106270 Liu X, Morris MC, Dhana K, et al.Mediterranean-DASH Intervention for Neurodegenerative Delay (MIND) study: rationale, design and baseline characteristics of a randomized control trial of the MIND diet on cognitive decline.Contemp Clin Trials. 2021;102:106270. doi:10.1016/j.cct.2021.106270 Tosti V, Bertozzi B, Fontana L.Health benefits of the Mediterranean Diet: metabolic and molecular mechanisms.J Gerontol A Biol Sci Med Sci. 2018;73(3):318-326. doi:10.1093/gerona/glx227 Tosti V, Bertozzi B, Fontana L.Health benefits of the Mediterranean Diet: metabolic and molecular mechanisms.J Gerontol A Biol Sci Med Sci. 2018;73(3):318-326. doi:10.1093/gerona/glx227 Tosti V, Bertozzi B, Fontana L.Health benefits of the Mediterranean Diet: metabolic and molecular mechanisms.J Gerontol A Biol Sci Med Sci. 2018;73(3):318-326. doi:10.1093/gerona/glx227 American Heart Association.What is the Mediterranean Diet?. American Heart Association.What is the Mediterranean Diet?. American Heart Association.What is the Mediterranean Diet?. Newswise.It’s Not Too Late to Start Eating Better for Your Brain. Newswise.It’s Not Too Late to Start Eating Better for Your Brain. Newswise.It’s Not Too Late to Start Eating Better for Your Brain. Chan RSM, Yu BWM, Leung J, et al.How dietary patterns are related to inflammaging and mortality in community-dwelling older Chinese adults in Hong Kong—a prospective analysis.J Nutr Health Aging. 2019;23(2):181-194. doi:10.1007/s12603-018-1143-0 Chan RSM, Yu BWM, Leung J, et al.How dietary patterns are related to inflammaging and mortality in community-dwelling older Chinese adults in Hong Kong—a prospective analysis.J Nutr Health Aging. 2019;23(2):181-194. doi:10.1007/s12603-018-1143-0 Chan RSM, Yu BWM, Leung J, et al.How dietary patterns are related to inflammaging and mortality in community-dwelling older Chinese adults in Hong Kong—a prospective analysis.J Nutr Health Aging. 2019;23(2):181-194. doi:10.1007/s12603-018-1143-0 Morris MC, Tangney CC, Wang Y, et al.MIND diet slows cognitive decline with aging.Alzheimers Dement. 2015;11(9):1015-1022. doi:10.1016/j.jalz.2015.04.011 Morris MC, Tangney CC, Wang Y, et al.MIND diet slows cognitive decline with aging.Alzheimers Dement. 2015;11(9):1015-1022. doi:10.1016/j.jalz.2015.04.011 Morris MC, Tangney CC, Wang Y, et al.MIND diet slows cognitive decline with aging.Alzheimers Dement. 2015;11(9):1015-1022. doi:10.1016/j.jalz.2015.04.011 **Related Articles** News Conditions A-Z Nutrition Wellness About Us Medical Expert Board Editorial Process Privacy Policy Product Vetting Terms of Service Careers Advertise Contact Your Privacy Choices"}