{"id": 1964, "name": "FaithWire", "domain": "faithwire.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.faithwire.com/2025/05/29/phil-robertsons-last-words-to-his-son-revealed-as-familys-powerful-tributes-continue-humbled-to-keep-his-legacy-going/", "title": "Phil Robertsons Last Words To His Son Revealed As Familys Powerful Tributes Continue Humbled To Keep His Legacy Going", "content": "Watch Go! Podcasts Newsletter Contact Us Facebook Twitter YouTube Instagram SCOTUS Life Religious Liberty News Politics Faith Opinion **Phil Robertson’s Last Words to His Son Revealed as Family’s Powerful Tributes Continue: ‘Humbled to Keep His Legacy Going’** Al Robertson, the eldest son of the Robertson clan, is offering a heartfelt tribute to his father, Phil Robertson,who died May 25after a battle with Alzheimer’s. Listen to the latest episode of “Quick Start” 👇 In a statement shared with CBN News, Al Robertson — whose family rose to fame in 2012, when their hit reality show “Duck Dynasty” premiered on A&E — reflected on his father’s profound influence in his life. “Well, it has finally happened,” he wrote. “The man that raised me, trained and disciplined me, accepted me, loved me and partnered with me in sharing the Gospel of Jesus has left this life and crossed over to await the Great Resurrection.” Rather than lament, Robertson expressed gratitude and hope, appealing to his Christian faith to process the tragic loss with which the family is coping. “I feel joyful, and even relieved, that he no longer suffers from a terrible, mind destroying disease known as Alzheimer’s,” Robertson continued. “I am also humbled to keep his legacy going to reach as many people as possible with the saving grace of Jesus Christ’s coming to earth, death, burial, resurrection and ascension.” He said the past decade of working with his dad on books, podcasts, and other projects has been “some of the most rewarding ministry experiences” he has ever had. A post shared by Sadie Robertson Huff (@legitsadierob) “I do not grieve like men with no hope and I don’t say goodbye , but ‘see you in a while’ instead,” he said. “As he told me over and over in my life, especially the last few years, ‘Al, the resurrection looms larger every day for us all.’ Indeed it does Dad, indeed it does.” Other family members are sharing powerful messages as well, with Sadie Robertson, Phil’s granddaughter, revealing one of the final things he said to her: “Full strength ahead!” It’s a powerful reminder to power through and keep on moving even in the wake of pain and tragedy. Sadie also reflected on her grandpa’s influence over her family and fans. “It was his testimony that changed his life, our families life, and thousands of others,” she said, referring to Philovercomingalcoholism and finding Jesus decades ago. “Now he is experiencing it in the fullness. Fully alive in Christ. The new has come.” A post shared by Willie Robertson (@realwilliebosshog) Her father, Willie — Phil’s son, also shared his dad’s final words. “The last words he said to me as I leaned down over his weakened body was ‘You’re my brother,'” Williewrotein an Instagram post. “It made total sense to me. He always told me we were coworkers in the Kingdom of God. Maybe that’s why I always just called him Phil.” Continue to pray for the Robertson family as they mourn the loss of Phil. The family comes back to TV June 1 with the premiere of “Duck Dynasty: The Revival,” a new show on A&E. As the number of voices facing big-tech censorship continues to grow, please sign up forFaithwire’s daily newsletterand download theCBN News app, developed by our parent company, to stay up-to-date with the latest news from a distinctly Christian perspective. **Latest** NewsEvangelist Nick Vujicic Urges Christians to Embrace Biblical Counseling News Evangelist Nick Vujicic Urges Christians to Embrace Biblical Counseling News Evangelist Nick Vujicic Urges Christians to Embrace Biblical Counseling News Evangelist Nick Vujicic Urges Christians to Embrace Biblical Counseling Faith‘This Is the Core Belief of New Thought’: Apologist Uncovers Deceptive Theologies Faith ‘This Is the Core Belief of New Thought’: Apologist Uncovers Deceptive Theologies Faith ‘This Is the Core Belief of New Thought’: Apologist Uncovers Deceptive Theologies Faith ‘This Is the Core Belief of New Thought’: Apologist Uncovers Deceptive Theologies NewsSinger’s Wife Experiences Radical Miracle While Being Prayed Over: ‘Instant Healing’ News Singer’s Wife Experiences Radical Miracle While Being Prayed Over: ‘Instant Healing’ News Singer’s Wife Experiences Radical Miracle While Being Prayed Over: ‘Instant Healing’ News Singer’s Wife Experiences Radical Miracle While Being Prayed Over: ‘Instant Healing’ FaithMark Driscoll Condemns Stay-at-Home Dads as ‘Non-Christian’ Faith Mark Driscoll Condemns Stay-at-Home Dads as ‘Non-Christian’ Faith Mark Driscoll Condemns Stay-at-Home Dads as ‘Non-Christian’ Faith Mark Driscoll Condemns Stay-at-Home Dads as ‘Non-Christian’ CultureJonathan Roumie, ‘The Chosen’ March Toward Emotional Crucifixion Scene Culture Jonathan Roumie, ‘The Chosen’ March Toward Emotional Crucifixion Scene Culture Jonathan Roumie, ‘The Chosen’ March Toward Emotional Crucifixion Scene Culture Jonathan Roumie, ‘The Chosen’ March Toward Emotional Crucifixion Scene Email* PhoneThis field is for validation purposes and should be left unchanged. Evangelist Nick Vujicic Urges Christians to Embrace Biblical Counseling ‘This Is the Core Belief of New Thought’: Apologist Uncovers Deceptive Theologies Singer’s Wife Experiences Radical Miracle While Being Prayed Over: ‘Instant Healing’ Mark Driscoll Condemns Stay-at-Home Dads as ‘Non-Christian’ Jonathan Roumie, ‘The Chosen’ March Toward Emotional Crucifixion Scene June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 January 2024 December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 July 2016 June 2016 Christian Persecution Coronavirus Culture culture Entertainment Faith Faith Family George Floyd Go! Israel Life Life Lifestyle Media Men Mission Haiti News News Opinion P.O.V Politics Politics Roe Sponsored Sports Virtue Women Log in Entries feed Comments feed WordPress.org **Navigation** Watch Go! Podcasts Newsletter Contact Us Staff Privacy Policy Terms of Service **Follow Us** Facebook Twitter YouTube Instagram **Subscribe to the Newsletter** Sign up to get our newsletter your inbox every day. Email* EmailThis field is for validation purposes and should be left unchanged. Do you want to readmore articles like this? Email* CommentsThis field is for validation purposes and should be left unchanged."}