{"id": 419, "name": "Euromaidan Press", "domain": "euromaidanpress.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://euromaidanpress.com/2025/06/02/trojan-truck-attack-ukraine-used-ai-trained-fpv-drones-launched-from-trucks-to-destroy-34-of-russias-strategic-bomber-fleet-in-a-day/", "title": "Trojan Truck Attack Ukraine Used Ai Trained Fpv Drones Launched From Trucks To Destroy 34 Of Russias Strategic Bomber Fleet In A Day", "content": "UkraineUkrainian politicsUkrainian reformsHistory of UkraineCulture of UkrainePolitical prisonersCivil SocietyPeople of UkraineCrimea Ukrainian politics Ukrainian reforms History of Ukraine Culture of Ukraine Political prisoners Civil Society People of Ukraine Crimea Ukrainian politics Ukrainian reforms History of Ukraine Culture of Ukraine Political prisoners Civil Society People of Ukraine Crimea International Russian AggressionRusso-Ukrainian war 2022-2025DonbasCrimeaHybrid WarPeace to Ukraine Russo-Ukrainian war 2022-2025 Donbas Crimea Hybrid War Peace to Ukraine Russo-Ukrainian war 2022-2025 Donbas Crimea Hybrid War Peace to Ukraine MoreOpinionSpecial projectsPlus1 Opinion Special projectsPlus1 Plus1 Opinion Special projectsPlus1 Plus1 Plus1 Rundown AboutAbout usSubmit an op-ed to Euromaidan PressContributeJob opportunities About us Submit an op-ed to Euromaidan Press Contribute Job opportunities About us Submit an op-ed to Euromaidan Press Contribute Job opportunities Support usDonate to Euromaidan PressPatrons, donors, and partnersSupport our army fundraiser Donate to Euromaidan Press Patrons, donors, and partners Support our army fundraiser Donate to Euromaidan Press Patrons, donors, and partners Support our army fundraiser UkraineUkrainian politicsUkrainian reformsHistory of UkraineCulture of UkrainePolitical prisonersCivil SocietyPeople of UkraineCrimea Ukrainian politics Ukrainian reforms History of Ukraine Culture of Ukraine Political prisoners Civil Society People of Ukraine Crimea Ukrainian politics Ukrainian reforms History of Ukraine Culture of Ukraine Political prisoners Civil Society People of Ukraine Crimea International Russian AggressionRusso-Ukrainian war 2022-2025DonbasCrimeaHybrid WarPeace to Ukraine Russo-Ukrainian war 2022-2025 Donbas Crimea Hybrid War Peace to Ukraine Russo-Ukrainian war 2022-2025 Donbas Crimea Hybrid War Peace to Ukraine MoreOpinionSpecial projectsPlus1 Opinion Special projectsPlus1 Plus1 Opinion Special projectsPlus1 Plus1 Plus1 Rundown AboutAbout usSubmit an op-ed to Euromaidan PressContributeJob opportunities About us Submit an op-ed to Euromaidan Press Contribute Job opportunities About us Submit an op-ed to Euromaidan Press Contribute Job opportunities Support usDonate to Euromaidan PressPatrons, donors, and partnersSupport our army fundraiser Donate to Euromaidan Press Patrons, donors, and partners Support our army fundraiser Donate to Euromaidan Press Patrons, donors, and partners Support our army fundraiser Russian Aggression **Trojan truck op: Kyiv destroys “34%” of Russia’s strategic bomber fleet within hours with truck-launched FPV drones (updated)** Some Ukrainians and Westerners alike have dubbed the 1 June audacious attack on Russian strategic bombers the “Trojan truck” operation, referencing the disguised long-haul vehicles that delivered drones straight close to Russia’s strategic airbases. The destroyed Tu-95 and Tu-22 bombers have been used to bomb Ukraine since 2022. Many Russians called it their “Pearl Harbor.” However, unlike Japan’s unprovoked attack on the US naval base in 1941, Ukraine hit back at bombers responsible for missile strikes on civilian cities. **Ukraine says 41 Russian bombers destroyed in record-range drone strike using disguised trucks** According to theSBUand Ukrainian PresidentVolodymyr Zelenskyy, Ukraine’s most far-reaching drone strike to date destroyed 34% of Russia’s strategic cruise missile carriers at their home airfields. Breaking: Russian strategic bombers ablaze en masse under SBU drone attack (video) Ukraine’s Security Service (SBU) sourcessaidearlier today that the operation destroyed “over 40” Russian military aircraft across multiple airbases. So far, seven aircraft have been visually confirmed destroyed, according to UkrainianOSINT sources, with upcoming satellite imagery expected to verify additional damage. **Zelenskyy: “Absolutely brilliant” op planned inside Russia, right next to FSB** In a Telegrampostand national videoaddress, President Volodymyr Zelenskyy described the operation as “absolutely brilliant” and “unique.” He said planning lasted one year, six months, and nine days, and that Ukrainian operatives had been safely extracted from Russian territory before launch. “Our people operated on the territory of various Russian regions — across three time zones. On the eve of the operation, our personnel were withdrawn from Russian territory, and those who assisted us are now safe,” Zelenskyy said. He revealed that the strike was coordinated from inside Russia, “right next to an FSB office” in one of the oblasts. Zelenskyy praised SBU chief General Vasyl Maliuk for leading the mission and said it would go into history books. He instructed the SBU to publish available public details. **117 drones reportedly used, 34% of missile-carrying bombers hit in Operation Web** The SBUnamedthe mission Operation Spiderweb (Pavutyna) and confirmed it was executed across three Russian time zones. The operation used 117 drones to target strategic bombers capable of launching cruise missiles, according to Zelenskyy. SBU states that 34% of Russia’s strategic missile-carrying aviation was damaged or destroyed. The value of affected aircraft was estimated at $7 billion. In a defiant message, the agency quoted Ukrainian author Lina Kostenko: “Did you think Ukraine would be that easy? Ukraine is something extraordinary. Ukraine is one of a kind. It has been run over by every steamroller of history. It has endured every kind of trial. It is tempered by the highest forge. ” **Confirmed losses: at least 8 aircraft destroyed at Olenya and Belaya** Open-source intelligence analystsconfirmedthe destruction of eight Russian aircraft as of 18:00: 5 Tu-95MS strategic bombers 2 Tu-22M3 bombers 1 An-12 transport aircraft Destruction was confirmed at two airbases — Belaya in Irkutsk Oblast and Olenya in Murmansk Oblast — via available combat footage and satellite imagery. OSINT Dnipro reported fires in areas where additional aircraft, including Tu-160s, were parked, suggesting the final number may rise. The channel dismissed rumors of 40 destroyed planes as “nonsense” but said 10+ is likely. In any case, the satellite images will settle the final score. OSINT analysis confirmed that two Tu-22M3 and one Tu-95MS bombers were destroyed during the Ukrainian attack. Fires were observed at parking areas used by additional aircraft. The Olenya airbase, located on the Kola Peninsula, hosts strategic bombers from several regiments under the 22nd Guards Heavy Bomber Division. Confirmed destruction includes three Tu-95MS bombers and one An-12 transport aircraft. The base may have also housed Tu-160 and additional Tu-22M3 aircraft at the time of the strike. **Trojan trucks and AI-trained drones** Footage and OSINT confirmed that Ukraine used long-haul trucks and trailers to secretly deliver drones near Russian airfields. Once in position, the trucks served as launch platforms, releasing FPV drones at close range to evade Russian long- and medium-range air defenses. In Irkutsk and Murmansk oblasts, videos showed drones launched from trucks, followed by self-destruction of the vehicles by fire. Telegram channel Clash Report alsostatedthat AI targeting systems were trained using real aircraft at the Poltava Museum of Long-Range and Strategic Aviation, which displays Tu-95MS and Tu-22M3 bombers — the same models targeted in the operation. **Drones assembled inside Russia: Chelyabinsk warehouse geolocated** Ukrainian Telegram channels analyzed photos related to the operation that surfaced earlier today — including images showing drone containers — and identified a warehouse facility inside Russia that matched the visuals. The facility was geolocated to a warehouse in Chelyabinsk Oblast, at 28A Sverdlovsky Trakt, reportedly rented by the company Dan-Invest. The facility is located near the Kazakhstan border, which may have served as a supply route for components. This supports President Zelenskyy’s claim that drones and launchers were assembled on Russian territory. **Failed strike attempt in Amur Oblast caught on video** In Russia’s Far East, a drone strike attempt near the Ukrainka airbase in Amur Oblast failed. Video shows a truck on fire, followed by an explosion when a man tries to open the trailer. The vehicle is believed to have been another disguised launcher that failed to reach its intended point. **Four airbases were reportedly targeted in drone operation** On 1 June, Russian authorities reported drone attacks in four oblasts. Ukrainian intelligence sourcestold Suspilnethat the SBU coordinated a multi-target operation against Russian long-range aviation at: Belaya (Irkutsk Oblast) Olenya (Murmansk Oblast) Dyagilevo (Ryazan Oblast) Ivanovo airbase (Ivanovo Oblast) Sources claimed over 40 aircraft were hit, including A-50 early warning planes, Tu-95MS, and Tu-22M3 bombers. Also, a fire wasreportedat an airbase in Voskresensk, Moscow Oblast. As of now, independently confirmed destruction is limited to Olenya and Belaya, with additional data expected from satellite review. Update: **Russia downplays the Ukrainian air assault** Russia’s Defense Ministrycalledthe Ukrainian attack on purely military facilities, hosting hardware used against Ukraine, a“terrorist act.“ The Ministry claimed that all drone attacks on airfields in Ivanovo, Ryazan, and Amur oblasts were successfully “repelled.” However, it admitted that fires broke out at airbases in Murmansk and Irkutsk after FPV drones were launched from areas “in direct proximity” to the sites, and “several units of aircraft equipment caught fire.” MoD insisted the fires were quickly extinguished and there were no casualties. It also announced that “some participants in the terror attacks” had been ostensibly detained. Read alsoUkraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucksUkraine destroys strategic bombers Moscow cannot replaceUkraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticksKilling the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB officeYou could close this page. Or you could join our community and help us produce more materials like this.We keep our reporting open and accessible to everyone because we believe in the power of free information. This is why our small, cost-effective team depends on the support of readers like you to bring deliver timely news, quality analysis, and on-the-ground reports about Russia's war against Ukraine and Ukraine's struggle to build a democratic society. A little bit goes a long way: for as little as the cost of one cup of coffee a month, you can help build bridges between Ukraine and the rest of the world, plus become a co-creator and vote for topics we should cover next.Become a patronor see other ways tosupport.Become a Patron! **Read also** Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks **Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks** Ukraine destroys strategic bombers Moscow cannot replace **Ukraine destroys strategic bombers Moscow cannot replace** Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks **Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks** Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office **Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office** **Read also** Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks **Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks** **Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks** **Ukraine rewrites Budapest Memorandum with 40 burning Russian jets targeted by drones launched from cargo trucks** Ukraine destroys strategic bombers Moscow cannot replace **Ukraine destroys strategic bombers Moscow cannot replace** **Ukraine destroys strategic bombers Moscow cannot replace** **Ukraine destroys strategic bombers Moscow cannot replace** Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks **Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks** **Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks** **Ukraine’s own drones crash Putin’s $7-billion “red lines” aircraft — while Russia fights them back with sticks** Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office **Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office** **Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office** **Killing the killer: Ukraine coordinates most successful Russian bomber strike from hub next to FSB office** To suggest a correction or clarification, write to us here You can also highlight the text and pressCtrl + Enter Please leave your suggestions or corrections here airbases An-12 Belaya Chelyabinsk Oblast deep strikes inside Russia drone strikes inside Russia Irkutsk Oblast Murmansk Oblast Olenya Russian strategic aviation Tu-22M3 Tu-95MS We are an independent media outlet that relies solely on advertising revenue to sustain itself. We do not endorse or promote any products or services for financial gain. Therefore, we kindly ask for your support by disabling your ad blocker. Your assistance helps us continue providing quality content. Thank you! About Us Contribute Patrons, donors, and partners Support us Job opportunities The digital development of this website has been supported by the Strategic Media Support Program implemented byLviv Media ForumandNational Endowment for Democracy Privacy Overview Strictly Necessary Cookies This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again."}