{"id": 270, "name": "ConsumerLab.com", "domain": "consumerlab.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.consumerlab.com/reviews/black-currant-borage-evening-primrose-flaxseed-and-hemp-oils-sources-of-ala-and-gla-omega-3-and-6-fatty-acids/flaxseed/", "title": "Black Currant Borage Evening Primrose Flaxseed And Hemp Oils Sources Of Ala And Gla Omega 3 And 6 Fatty Acids", "content": "Product Reviews Health Conditions Brands Warnings Answers News Join Now & Get Full Access Sign In Join Now In The News Testimonials News Releases **Reviews & Articles** Product Reviews (A-Z) Health Conditions Brands Answers Warnings Clinical Updates Recommended Intakes & Limits Avoid Counterfeits **Membership & Subscription** Join Now & Get Full Access Member Sign In Group Subscriptions Give a Gift Member Support Join Free Newsletter **About ConsumerLab.com** About Us Meet Our Team Testimonials **About Testing** Testing Programs Quality Certification Program & List How Products Were Tested ConsumerLab Seal **News** News Releases ConsumerLab In The News ConsumerLab Annual Survey Contact Us Privacy Policy Home /Product Reviews / Black Currant Oil, Borage Oil, Evening Primrose Oil, Flaxseed Oil, and Hemp Oil Supplements & Top Picks www.consumerlab.com/reviews/black-currant-borage-evening-primrose-flaxseed-and-hemp-oils-sources-of-ala-and-gla-omega-3-and-6-fatty-acids/flaxseed/ **** **Save to favorites** This feature is restricted to active members. Join now to save favorites and get all member benefits, including over 1,400 reviews. Already a member?Sign in here. **Black Currant, Borage, Evening Primrose, Flax and Hemp Oil Review** Medically reviewed and edited by Tod Cooperman, M.D. Medically reviewed and edited by Tod Cooperman, M.D. **Summary** Does it work?These seed oils contain predominately healthful, polyunsaturated fats such as the omega-3 fatty acid ALA (as from flax) and/or the omega-6 fatty acid GLA (as from evening primrose) (seeWhat It Is). Substituting these for saturated fats in your diet can lower your risk of cardiovascular disease. Taken as a supplement, they may help with the following conditions, although the evidence remains only preliminary: Acne, ADHD, dry eye, bipolar disorder, diabetic neuropathy, mastitis, rheumatoid arthritis, and Raynaud's phenomenon (seeWhat It Does). Simply consuming these oils as a supplement (rather than use in preparing foods) is not associated with any general health benefits, and omega-6 fatty acids can, potentially, have an inflammatory effect (seeConsumerTips). **Does it work?** **Does it work?** What dose?Depending on the use, studies have used daily doses of seed oils that provide from as little as 15 mg to as much as 2,000 mg of ALA or GLA (seeDosage). Keep in mind that only a part of the seed oil is ALA or GLA, so the amount of oil needed could be double or even 10 times higher than the dose of ALA or GLA. For example, about 55% of flaxseed oil is ALA, so a tablespoon of flaxseed oil (weighing about 14,000 mg) provides about 7,700 mg of ALA, while evening primrose oil is only 7% to 10% GLA (about 1,200 mg per tablespoon) (seeWhat to Consider When Buying). **What dose?** **What dose?** Best choice?ConsumerLab.com's tests found that most products were high-quality, although one failed to pass for having somewhat lower amounts of fatty acids than claimed. See CL'sTop Picksamong products that were Approved. **Best choice?** **Best choice?** Cautions:Although generally safe, these oils can cause mild nausea and diarrhea, but there are ways to lessen this. Rarely, allergic reactions to flaxseed have been reported. Use these oils with caution if you are pregnant, have a seizure disorder, hemophilia, take blood-thinning medication, or are considering use in an infant (seeConcerns and Cautions). **Cautions:** **Cautions:** Also see ourWhole and Ground Flaxseed Review. In addition the results of its expert testing, ConsumerLab uses only high-quality, evidence based, information sources. These sources include peer-reviewed studies and information from agencies such as the FDA and USDA, and the National Academy of Medicine. On evolving topics, studies from pre-print journals may be sourced. All of our content is reviewed by medical doctors and doctoral-level experts in pharmacology, toxicology, and chemistry. We continually update and medically review our information to keep our content trustworthy, accurate, and reliable. The following sources are referenced in this article: Davis, Am J Clin Nutr 2003 Burdge, Br J Nutr 2002 Jehi, Br J Nutr 2022 Kawakami Nutri J 2015 Rodriguez-Leyva, Can J Cardiol 2010 Patenaude, Eur J Clin Nutr 2009 Rodriguez-Leyva, Hypertension 2013 Caliguri, Hypertension 2014 Botelho, Lipds Health Dis 2013 Surette, J Nutr 2004 Kuhnt, J Nutr 2014 Ferreira, Nutr Hosp 2015 Jung Acta Derm Venereol 2014 Price, Neurology 2022 Kumari, Cureus 2024 Cochrane Library 2013 Barabino, Cornea 2003 Sheppard, Cornea 2013 HydroEye Liang, Biochem J 1992 Nanashima, Molecules 2019 Sergeant, Eur J Pharmacol 2016 Innes, Prostaglandins Leukot Essent Fatty Acids 2018 Lankinen, Am J Clin Nutr 2019 Zhu, J Lipid Res 2013 Nandish,Pharmacogn Mag 2018 Levy Br J Clin Pharmacol 2017 Proposition 65 THC Fact Sheet OEHHA, 8-8-22 Brouwer, J Nutr 2004 Lu, J Am Coll Nutr 2007 Leon, Allergol Immunopathol 2013 Leson J Anal Toxicol 2001 Yang, Cannabis Cannabinoid Res 2018 Struempler, J Anal Toxicol 1997 **Make sure you're choosing the best oil supplements approved in our tests!** Already a member?Sign in here. Join now at www.consumerlab.com/join/ **Omega-3 and omega-6 supplements for people -- and pets -- compared in this review:** **365 Organic Flax Oil - Filtered** **Barlean's Flax Oil** **Flora Udo's Choice Udo's Oil 3-6-9 Blend** **Life Extension Mega GLA** **Manitoba Harvest Organic Hemp Seed Oil** **Nature Made Flaxseed Oil 1,400 mg** **Nordic Naturals Borage Oil** **NOW Borage Oil** **Solaray Black Currant Seed Oil** **Solgar Evening Primrose Oil 1,300 mg** **Swanson Black Currant Seed Oil** Which omega-3 and omega-6 supplementspassedorfailedConsumerLab testing ConsumerLab'sTop Picksamong black currant, borage, evening primrose, flaxseed and hemp seed oil supplements based on quality and value Direct comparisons of amounts of omega fatty acids found in products and the cost to get these fatty acids by product What omega-3 and omega-6 supplementscanandcannotdo for cardiovascular disease and inflammatory diseases such as dry eye, acne, and mastitis Dosage for specific uses Concerns, cautions, potential drug interactions, and side effects of these seed oil supplements **Join tounlock the full reportand get full access to over 1,400 reviews** Already a member?Sign in here. Join now at www.consumerlab.com/join/ **Latest Clinical Research Updates for Black Currant, Borage, Evening Primrose, Flax and Hemp Oil Review** **Hemp Seed Benefits?** What are hemp seeds and does eating them help with heart health, diabetes, or boosting testosterone? Find out in our article about thebenefits, safety, and what to consider when picking a product. Alsosee our test resultsfor: Hempprotein Hempseed oil Hempmilk Hempextract **Black Currant or Caffeine for Hair?** Does black currant seed oil, or its constituent gamma-linolenic acid (GLA), increase hair growth? Find out what research suggests in theGLA sectionof our ALA and GLA Supplements Review, which includes ourTop Pickfor black currant seed oil.Also find out ifapplying caffeine to the scalpincreases hair growth and reduces shedding in our article aboutsupplements and topicals for hair. **Walnuts for Omega-3s?** Walnuts are often touted as a good source of the omega-3 fatty acid ALA, but can eating walnuts regularly increase blood levels of DHA and EPA (the omega-3s in fish oil)? Find out in theWhat It Issection of our Black Currant Oil, Borage Oil, Evening Primrose Oil, Flaxseed Oil, and Hemp Oil Supplements Review. **Is Omega-6 a Problem?** **Flaxseed Oil for High Blood Pressure?** **Flaxseed Oil for Improving Cholesterol?** **Flaxseed Lowers Blood Pressure** **Supplement Helps Dry Eye** **Omega-6 for Eczema?** **Related CL Answers (17)** **Hemp Seeds: Health Benefits, Safety, and What To Consider When Picking a Product** Hemp seeds are promoted for heart health, diabetes, boosting testosterone, and other conditions, but do they work? Find out and learn about potential safety concerns. **Hemp Seeds: Health Benefits, Safety, and What To Consider When Picking a Product** Hemp seeds are promoted for heart health, diabetes, boosting testosterone, and other conditions, but do they work? Find out and learn about potential safety concerns. **Supplements for Eczema: Some May Help, While Others Don’t** Certain supplements may reduce symptoms of atopic dermatitis (the most common form of eczema), while others don't seem to work. Find out if gamma-linolenic acid, L-histidine, phytoceramides, probiotics, and other supplements may be beneficial. **Supplements for Eczema: Some May Help, While Others Don’t** Certain supplements may reduce symptoms of atopic dermatitis (the most common form of eczema), while others don't seem to work. Find out if gamma-linolenic acid, L-histidine, phytoceramides, probiotics, and other supplements may be beneficial. **What is C15:0 fatty acid (found in fatty15), and does it have health benefits?** C15:0 fatty acid in fatty15 is promoted for “healthier hair & skin, balanced metabolism, and deeper sleep,” as well as “slowing the aging process.” Find out if it works. **What is C15:0 fatty acid (found in fatty15), and does it have health benefits?** C15:0 fatty acid in fatty15 is promoted for “healthier hair & skin, balanced metabolism, and deeper sleep,” as well as “slowing the aging process.” Find out if it works. **Should I be concerned about pyrrolizidine alkaloids in herbal supplements?** Find out which herbal supplement ingredients contain pyrrolizidine alkaloids (PAs), learn why these constituents are a safety concern, and find out how supplements containing these ingredients are regulated in the U.S. and Europe. **Should I be concerned about pyrrolizidine alkaloids in herbal supplements?** Find out which herbal supplement ingredients contain pyrrolizidine alkaloids (PAs), learn why these constituents are a safety concern, and find out how supplements containing these ingredients are regulated in the U.S. and Europe. **Can any supplements be used to reduce inflammation in people sensitive to NSAIDs such as ibuprofen, high-dose aspirin, or naproxen?** Find out if supplements such as turmeric, fish oil, MSM (methylsulfonylmethane), SAMe (S-adenosyl-methionine), boswellia, ginger, white willow bark or arnica may, or may not, be helpful to people sensitive to NSAIDs. **Can any supplements be used to reduce inflammation in people sensitive to NSAIDs such as ibuprofen, high-dose aspirin, or naproxen?** Find out if supplements such as turmeric, fish oil, MSM (methylsulfonylmethane), SAMe (S-adenosyl-methionine), boswellia, ginger, white willow bark or arnica may, or may not, be helpful to people sensitive to NSAIDs. **Can supplements, natural eye drops, or lifestyle modifications improve symptoms of dry eye?** Can supplements such as fish oil, flaxseed oil or curcumin (from turmeric) help treat dry eyes? Find out, including formulas and doses that have shown benefit. Also, learn if drinking more water or using eye drops containing castor oil, N-acetylcarnosine or aloe can help with dry eye. **Can supplements, natural eye drops, or lifestyle modifications improve symptoms of dry eye?** Can supplements such as fish oil, flaxseed oil or curcumin (from turmeric) help treat dry eyes? Find out, including formulas and doses that have shown benefit. Also, learn if drinking more water or using eye drops containing castor oil, N-acetylcarnosine or aloe can help with dry eye. **Is canola oil good or bad for you? I heard it can be toxic.** Find out if canola oil is bad for you or good for you, and whether it helps heart health. Clinical evidence and how it compares to other oils. **Is canola oil good or bad for you? I heard it can be toxic.** Find out if canola oil is bad for you or good for you, and whether it helps heart health. Clinical evidence and how it compares to other oils. **Which supplements can help lower my triglycerides?** Find out whether fish oil supplements, or plant-based oil supplements, such as flaxseed oil and echium oil are best for lowering triglyceride levels. ConsumerLab.com's answer explains. **Which supplements can help lower my triglycerides?** Find out whether fish oil supplements, or plant-based oil supplements, such as flaxseed oil and echium oil are best for lowering triglyceride levels. ConsumerLab.com's answer explains. **Which supplements can cause diarrhea?** Can supplements like magnesium cause diarrhea? Find out which supplements may cause diarrhea, such as vitamin B12, curcumin, magnesium, vitamin C and fish oil. **Which supplements can cause diarrhea?** Can supplements like magnesium cause diarrhea? Find out which supplements may cause diarrhea, such as vitamin B12, curcumin, magnesium, vitamin C and fish oil. **Which supplements can help to lower blood pressure?** Supplements to lower blood pressure, including CoQ10, vitamin C, fish oil, and olive oil, are all explored to find out what works. **Which supplements can help to lower blood pressure?** Supplements to lower blood pressure, including CoQ10, vitamin C, fish oil, and olive oil, are all explored to find out what works. **My dog is getting older and his veterinarian recently recommended giving him a glucosamine supplement for his joints. Has ConsumerLab.com tested these, or other supplements for pets?** Find out our test results on glucosamine for dogs and cats as well as other supplements for pets. **My dog is getting older and his veterinarian recently recommended giving him a glucosamine supplement for his joints. Has ConsumerLab.com tested these, or other supplements for pets?** Find out our test results on glucosamine for dogs and cats as well as other supplements for pets. **I've heard that rice has high levels of arsenic. Does that mean rice bran oil does too?** Find out if rice bran oil can contain high levels of arsenic like whole rice and other rice products do. **I've heard that rice has high levels of arsenic. Does that mean rice bran oil does too?** Find out if rice bran oil can contain high levels of arsenic like whole rice and other rice products do. **Do any supplements help with gum disease or periodontitis?** Supplements for healthy gums may help with gum disease or periodontitis. Learn more about omega fatty acids, lycopene, and probiotics. **Do any supplements help with gum disease or periodontitis?** Supplements for healthy gums may help with gum disease or periodontitis. Learn more about omega fatty acids, lycopene, and probiotics. **Do any supplements, like Nervive, help with nerve pain, like sciatica, diabetic neuropathy or postherpetic neuralgia?** Find out which supplements for nerve pain, including fish oil and alpha-lipoic acid, are effective for sciatica, diabetic neuropathy, or postherpetic neuralgia. **Do any supplements, like Nervive, help with nerve pain, like sciatica, diabetic neuropathy or postherpetic neuralgia?** Find out which supplements for nerve pain, including fish oil and alpha-lipoic acid, are effective for sciatica, diabetic neuropathy, or postherpetic neuralgia. **Is it better to take fish oil, flaxseed oil -- or both?** Fish oil and flaxseed oil -- how they are different, what they are used for, if and how they can help with arthritis, depression, lowering cholesterol & more. **Is it better to take fish oil, flaxseed oil -- or both?** Fish oil and flaxseed oil -- how they are different, what they are used for, if and how they can help with arthritis, depression, lowering cholesterol & more. **I have low blood pressure. Are there any supplements I should avoid?** Find out which supplements can cause decreases in blood pressure, including melatonin, arginine, magnesium, and calcium. **I have low blood pressure. Are there any supplements I should avoid?** Find out which supplements can cause decreases in blood pressure, including melatonin, arginine, magnesium, and calcium. **What supplements should I stop taking before surgery?** Info on which supplements to avoid before surgery due to increased risk of bleeding or interference with anesthesia. **What supplements should I stop taking before surgery?** Info on which supplements to avoid before surgery due to increased risk of bleeding or interference with anesthesia. **Join our Free Newsletter andBecome a Memberto View the fullBlack Currant, Borage, Evening Primrose, Flax and Hemp Oil ReviewReview!** **Become a Memberto View the Latest Update:in ourBlack Currant, Borage, Evening Primrose, Flax and Hemp Oil ReviewReview** * We do not sell or share your personal information with anyone else, ever. Already a member?Sign in here. **** As a ConsumerLab.com member, you may print a copy of this report for your personal use. You can access a special print version by clicking the \"Print\" icon in the upper right corner of this report. You can then use your web browser's print functions to print the whole report or just selected pages. You may also email or post a link to this report using the web address above. Non-members using the link will see a free summary and can join to view the full report. Other means of copying or distributing this report, in part or full, are not permitted. If you are sight-impaired and your computer is having trouble converting the text in this report to speech, contact us for assistance atMembership@ConsumerLab.comor by phone at914-722-9149. **Join our Free Newsletter andBecome a Memberto View the fullBlack Currant, Borage, Evening Primrose, Flax and Hemp Oil ReviewReview!** **Become a Memberto View the Latest Update:in ourBlack Currant, Borage, Evening Primrose, Flax and Hemp Oil ReviewReview** * We do not sell or share your personal information with anyone else, ever. Already a member?Sign in here. The \"Updated\" date indicates when new clinical or product information was most recently added. In the full review (available to CL members), the newest information is highlighted in yellow and, if a new product is added, it is footnoted in the results table, showing the date added to the review. **Join over250,000people on our weekly email list.** **OUR MISSION: To identify the best quality health and nutritional products through independent testing.** By Supplement Type By Brand By Health Condition How Products Were Tested Testing Programs Quality Certification Program CL Certified Products ConsumerLab Answers Clinical Updates Recalls & Warnings Recommended Intakes Avoid Counterfeits Join ConsumerLab Join Free Newsletter Group Subscriptions Testimonials In The News News Releases Member Sign In My Account Give a Gift Member Support Security User Agreement About Us Meet Our Team Medical & Scientific Expert Team Contact Us ConsumerLab Seal ConsumerLab Survey Privacy Policy © 2025 ConsumerLab.com, LLC. All rights reserved. ConsumerLab.com name and flask logo are both registered trademarks of ConsumerLab.com, LLC. This site is intended for informational purposes only and not to provide medical advice."}