{"id": 1665, "name": "American Free Press", "domain": "americanfreepress.net", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://americanfreepress.net/war-over-nutrition-healthy-fats-quietly-rages-behind-the-scenes-as-americans-health-continues-to-decline/", "title": "War Over Nutrition Healthy Fats Quietly Rages Behind The Scenes As Americans Health Continues To Decline", "content": "Terms Of Service ABOUT HELP PRIVACY CONTACT Facebook Twitter Youtube Home MultimediaRumbleVideoAudio Rumble Video Audio Rumble Video Audio Archives Support Store Subscribe About Login Subscriber Only [ May 30, 2025 ]Fate of Birthright CitizenshipSubscriber Only [ May 30, 2025 ]Americans Who Voted for Deportations Frustrated With SystemNational News [ May 30, 2025 ]Why Trump called end to Houthi bombingsSubscriber Only [ May 29, 2025 ]Are You Open-Minded Enough to Venture Into ‘the Gray Area’?Subscriber Only [ May 29, 2025 ]Mideast Peace Trip Infuriates War Hawks, NeoconsSubscriber Only **War Over Nutrition, Healthy Fats Quietly Rages Behind the Scenes as Americans’ Health Continues to Decline** May 16, 2017AFP EditorAlternative Health,Bookstore0 Information about what we should eat and drink to enhance our wellness is confusing. Seemingly every week we’re bombarded with a new directive as to what a healthy diet should or should not include. A new book finally puts the kibosh on faulty information we have long been told about the advantages of a low-fat diet. In fact, it turns out, our bodiesneedcertain fats to maintain optimal health. By Christopher J. Petherick There’s a war going on inside this country. However, this one doesn’t involve militarized police kicking down doors and shooting innocent people or even the propaganda war that’s being waged to control your thoughts. This fight is over your health—more specifically, what you’re being told is good to eat in order to ensure optimal health. It’s evident that regular Americans are losing this battle, because for too long they have followed the advice of the medical and dietary experts who have argued that eating fat-free foods is the only path to good health. Thankfully, though, new research is validating what many health advocates have been saying for years: Your body needs fat to function, and if you want to lose weight and live a long and healthy life, then eat more fat. Sally Fallon Morell, the founder and president of theWeston A. Price Foundationand owner ofPA Bowen farmsteadin Brandywine, Md., has long said that human beings need to eat healthy fats to achieve peak health. Her new book, titledNourishing Fats: Why We Need Animal Fats for Health and Happiness*, makes just this case, arguing cogently that fat-free margarines and certain vegetable oils are not just making people fat and unhealthy, they’re actually killing us. Mrs Morrell also maintainsher own “Nourishing Traditions” blogon health and nutrition. The premise of the book is laid out right on the cover of the book: “Animal fats are not villains.” Over the years, Americans have been inundated with bad advice on how to eat healthy that’s not just inconsistent, but schizophrenic. One day, it’s “Don’t eat any fats—they’re all bad for you.” The next day it’s, “Okay, you can eat some fats from fish and avocadoes.” Then, the next day, they tell us, “Well, eggs and meat aren’t that bad for you after all.” Listen to AFP’s interview with Sally Fallon Morrell by clicking the link below. Now, an editorial published inThe British Journal of Sports Medicineby several leading cardiologists states: “It is time to shift the public health message in the prevention and treatment of coronary artery disease away from measuring serum lipids [cholesterol] and reducing dietary saturated fat. Coronary artery disease is a chronic inflammatory disease, and it can be reduced effectively by walking 22 minutes a day and eating real food.” The real food they’re referring to consists of full-fat milk and other once-maligned foods that your parents and grandparents ate. It’s no wonder the average person is totally confused by this. It’s also no wonder obesity rates are through the roof. Mrs. Morell’s farm is only a few miles up the road from this editor’s house. She sat down with me recently to discuss her book as well as her tireless work to educate Americans on healthy living. Her views are devastating to the medical and dietary establishment, arguing that animal fats are not just not bad for you—they actually are vital for the human body to function. “Animal fats are essential for us,” Mrs. Morell told AFP. “One thing that the mainstream media and the establishment has never budged on is that saturated fats are the enemy. They’re bad. They’ll clog your arteries. And this is where we’ve gone wrong. Saturated fats are critical for our health, and, of course, we get saturated fats mostly from animal fats.” Mrs. Morell told AFP, “What’s in the animal fats are nutrients we can’t get anywhere else—vitamins A, D, and K—that are absolutely critical for our health.” Her book contains nearly 30 pages of footnotes that cite scientific research studies and books proving that animal fats are healthy for the human body. AFP is carrying Mrs. Morell’s book,Nourishing Fats, which also includes 35 pages of healthy recipes. To put it simply, if you want to be healthy and live a long, happy life, give up the fad diets and the refined and processed foods and go back to eating real food. You’ll lose weight and feel better, and you’ll get to eat amazingly well, too. Christopher J. Petherick is the editor-in-chief ofAmerican Free Pressand has a small farm in historic Southern Maryland. *Nourishing Fats: Why We Need Animal Fats for Health and Happiness(softcover, 272 pages) is available from AFP’s Bookstore for $25. Call AFP toll free at 1-888-699-6397 to charge or send payment with form on page 16 to AFP, 16000 Trade Zone Ave., Ste. 406, Upper Marlboro, MD 20613. See more books and videos online at theAFP Bookstore. dietary fats Nourishing Fats Sally Fallon Morell Weston A. Price Foundation **Related Articles** **Do New Vegetarian Hamburgers Pose a Health Concern for Men?** Login Password Signup HereLost Password Fate of Birthright Citizenship Americans Who Voted for Deportations Frustrated With System Why Trump called end to Houthi bombings Issue 21&22, 2025 News You May Have Missed Are You Open-Minded Enough to Venture Into ‘the Gray Area’? Andrew WallaceonDyed-in-the-Wool Libertarian Warns: ‘Tariffs Are Theft’ Blowtorch MasononJewish Academics Haven’t Seen ‘Anti-Semitism’ on Campus Blowtorch MasononJewish Academics Haven’t Seen ‘Anti-Semitism’ on Campus dinha Comedor de cocôonSome Embracing, Others Bypassing Donald Trump’s Anti-DEI Orders Home ABOUT ADVERTISE HELP PRIVACY POLICY TERMS and CONDITIONS Copyright © 2025 | American Free Press. All Rights Reserved."}