{"id": 1745, "name": "Jesus is Savior", "domain": "jesus-is-savior.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://www.jesus-is-savior.com/Books,%20Tracts%20&%20Preaching/Printed%20Books/Dr%20Jack%20Hyles/The%20Church/purpose_of_going_to_church-chap_12.htm", "title": "Purpose_of_going_to_church Chap_12.htm", "content": "The Purpose Of Going To Church byPastor Jack Hyles(1926-2001) Then the same day at evening, being the first day of the week, when the doors were shut where the disciples were assembled for the fear of the Jews, came Jesus and stood in the midst, and saith unto them, Peace be unto you. And when he had so said, he shewed unto them his hands and his side. Then were the disciples glad, when they saw the Lord. Then said Jesus to them again, Peace be unto you: as my Father hath sent me, even so send I you. And when he had said this, he breathed on them, and saith unto them, Receive ye the Holy Ghost: Whosesoever sins ye remit, they are remitted unto them; and whosesoever sins ye retain, they are retained. And after eight days again his disciples were within, and Thomas with them: then came Jesus, the doors being shut, and stood in the midst and said, Peace be unto you. John 20:19-23, 26 Not many people know the true reason why Jesus started the church. Let me give a couple of things which are not legitimate reasons, even though most people think they are. 1. The church was not started to be a place of worship. You can worship God better alone than you can with others. You can also pray better alone than you can with others. When two people pray together, their prayers will too often be designed to impress each other. Every Christian should worship Godin the beauty of His holiness.We should adore Him, worship Him, magnify Him, and honor Him. The idea that the church is a place to worship God came from Rome, not from the New Testament. There is only one place in the New Testament where the word worship is connected to a public service, and that deals with worshipping the Devil. There is no example in the entire New Testament of a Christian worship service. God told the people in Amos 5:21-23,1 hate, I despise your feast days, and! will not smell in your solemn assemblies.... I will not accept them.... Take thou away from me the noise of thy songs....The church was not made to be a place of worship. 2. Jesus did not start the church as a place of evangelism. The evangelistic church is not in the Bible. The soul-winning church is. I am not against people getting saved at church, nor am I against an occasional evangelistic sermon. But, that is not the main purpose of the church, nor was it why the church was started. The New Testament church was a soul-winning institution where all of the members won people to Jesus. And daily in the temple, and in every house, they ceased not to teach and preach Jesus Christ.Acts 5:42 Some people believe that the New Testament church won the lost in thechurchand in house-to-house soul winning. That is half true. They did go house-to-house soul winning. The temple, however, was not the church, nor did they have church in the temple. The temple was the location of the big gala occasion when they had their feasts and when all of the people would gather in Jerusalem. The temple was also the place where they conducted their daily business. It was like our business district. This was not talking about witnessing in church, but about witnessing in public places as well as in people's homes. And Saul was consenting unto his death. And at that time there was a great persecution against the church which was at Jerusalem; and they were all scattered abroad throughout the regions of Judaea and Samaria, except the apostles. Therefore they that were scattered abroad went every where preaching the word.Acts 8:1, 4 They witnessed everywhere. There was no place they did not go. The jail is part of everywhere. Downtown is part of everywhere. The street corner is part of everywhere. Rest homes are a part of everywhere. Neighborhoods are a part of everywhere. The homes where the poor, the lame, the halt, and the blind live are parts of everywhere. The New Testament church was not an evangelistic church. It was a soul-winning church, and they went everywhere doing so. And he said unto them, Go ye into all the world, and preach the gospel to every creature.Mark 16:15 Jesus gave the Great Commission on several occasions. Matthew, Mark, Luke, and Acts all give different phrasings of the Great Commission. That does not mean that Jesus spoke it only one time, and that each of them gave it in their own words. They each quoted Jesus. He did not just give it once. One of those times was quoted in Mark. It is not talking about standing behind a pulpit and preaching. It is not directed to a congregation. It is directed to every creature. An evangelistic church is where a preacher gets up and preaches on salvation. I am not against that, but it is not why the church was started. The evangelism was not to be done at the church. Soul winning was to be done where the people were. Paulsaid For I determined not to know any thing among you, save Jesus Christ and him crucified.Some preachers take that as a mandate to preach on nothing except Jesus. That is not true. Paul wrote Timothy and said,Preach the word,but he said something else. He said toexhort.He said torebuke.Sometimes the preacher is to preach the Word. Sometimes he is to be lovingly stern and rebuke. Sometimes he is to give advice, or exhort. God wants more than just the plan of salvation preached in the church. Jesus said in Matthew toteach all nations.That word in Matthew is the Greek word \"ethnos\" which meansethnicsorraces. Mark 16:15 says, to go into all the world. The word\"kosmos\"is the wordarrangement. When Jesus started the church, he started a soul-winning church. Soul winning was not the purpose of the church, it was the fruit of the church and the result of the church. In the first century the local churches were soul-winning churches. They were scattered abroad everywhere with everybody preaching or soul winning. Peter did not preach the evangelistic sermon on Pentecost as many think. The Bible says that every nation under Heaven was represented at Pentecost and every man heard the Gospel. Many people were doing the soul winning. It was not just Peter. I am not against having an evangelistic service, but that was not why Jesus started the church, nor was it the way the New Testament church operated. In the first century, our churches were soul-winning churches. The people came to church for the realpurposeof the church. Then they went out from the church and won folks to Christ in the public places and neighborhoods and brought them back to church. Something happened shortly after the early church. The churches became evangelistic rather than soul winning. What is the difference? A soul-winning churchis where the people go out and win them and bring them back in to make a public profession. An evangelistic churchis where you invite sinners to come and the preacher tries to get them saved through his preaching. There is nothing wrong with that except the people go unfed. For 1900 years the soul-winning church was lost. In our generation the soul-winning church has been rediscovered. The First Baptist Church of Hammond has had a big part in that. All across America preachers are baptizing more converts than Spurgeon did. I am not nearly the preacher Spurgeon was, but First Baptist Church is a better church than Spurgeon had because we discovered the soul-winning church instead of the evangelistic church. Evangelists have been being forced to change their ministries. And he gave some, apostles; and some, prophets; and some evangelists; and some, pastors and teachers; For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ:Ephesians 4:11, 12 The wordperfectingmeansmaturing. God gave apostles for the maturing of the saints. God gave prophets for the maturing of the saints. God gave evangelists for the maturing of the saints. God gave pastors and teachers for the maturing of the saints. All these were given forthe perfecting of the saintsforthework of the ministry. Every saint is commanded to do the work of the ministry. Every Christian is commanded to be a soul-winner. It is the evangelist's job to mature the Christians so they will better do the work of the ministry. For many years evangelists were men who traveled across the country and preached revival meetings. These were actually evangelistic crusades, and they basically preached on salvation. I believe that God raisedthem up, but I do not believe that God had this in mind for the New Testament church. Evangelists were given for the perfecting or maturing of the saints, so the saints could do the work of the ministry. Nobody in the New Testament went around preaching to great crowds of people in churches just to get people saved. They taught, exhorted, rebuked, and perfected them so that the saints could do the work of the ministry. I am not against the evangelists who went into churches and preached on Heaven, Hell, salvation, the great white throne judgment, etc. Thank God for them, but they had to do it because churches were not doing the job of soul winning. God raised up these evangelists to go to churches and get people saved. In our day, the evangelist is a preacher who does more of what the Bible says he is to do, the perfecting of the saints. We have lived in the age of the rediscovery of the soul-winning church. Let us now look at the reasons for the starting of the church: 1. The church was started for comfort. Then the same day at evening, being the first day of the week, when the doors were shut where the disciples were assembled for fear of the Jews, came Jesus and stood in the midst, and said unto them, Peace be unto you.John 20:19 These people went to church because they were scared. That is one reason Jesus started the church. It was the place they could receive comfort in the midst of persecution. Jesus met in the upper room the night that he was betrayed.(John13 & 14)From there He went to the garden of Gethsemane where he was betrayed that night. It was on Wednesday that our Lord was crucified, so the church meets on Wednesday. Sunday was the day that our Lord rose from the dead, so the church meets on Sunday. It had to be a church that met in the upper room because they had the Lord's Supper, which was given by the local church. It was also in the upper room that they met when He rose from the dead.(John 20:19 &26)Consequently, they came to church for comfort. Our Saviour met with the apostles and said:Let not your heart be troubled: ye believe in God, believe also in me.He was comforting them. The church is a place to dispel the fears of the people. When somebody comes with an incurable disease, the church is supposed to help him dispel his fear. When people have a fear of financial reversal, the church is to help dispel their fear. The reason they assembled in the upper room was for the fear of the Jews. Coming together gave them more courage and strength than being alone. 2. It is a place for encouragement. Often people will not come to church because they have problems or because they are discouraged. That is why the church was started. That is why we are supposed to come. When you want to be alone is usually when you do not need to be alone. That is the time we most need to be in church. Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching.Hebrews 10:25 That means we are not to forsake thechurchingof ourselves together. It is especially true as we see the second coming of Jesus Christ coming closer. Why? Because there is a certain element of fear there. You come to church to be comforted in the fact that we are all going up together. When we come to church we get encouraged. For if there come unto your assembly a man with a gold ring, in goodly apparel, and there come in also a poor man in vile raiment; And ye have respect to him that weareth the gay clothing, and say unto him, Sit thou here in a good place; and say to the poor, Stand thou there, or sit here under my footstool: Are ye not then partial in yourselves, and are become judges of evil thoughts?James 2:2-4 There is one place in this world where a poor child can go and be just as important as the children of the Pastor, the deacons or the Sunday school teachers. The church is a place of encouragement for those who are looked down upon or despised in this world. 3. It is a place to give tithes to God. Now concerning the collection for the saints, as I have given order to the churches of Galatia, even so do ye. Upon the first day of the week let every one of you lay by him in the store, as God hath prospered him, that there be no gatherings when! come.I Corinthians 16:1 They tithed on the first day of the week, which is when they went to church. Sundays we are to bring our tithes and offerings to the church as well. The tithe or tenth is the smallest portion given in the Bible. Consequently, we go to church to give. 4. It is a place for maturing. And he gave some, apostles; and some, prophets; and some, evangelists; and some, pastors and teachers; For the perfecting of the saints, for the work of the ministry, for the edifying of the body of Christ: Till we all come in the unity of the faith, and of the knowledge of the Son of God, unto a perfect man, unto the measure of the stature of the fulness of Christ: That we henceforth be no more children, tossed to and fro, and carried about with every wind of doctrine, by the sleight of men, and cunning craftiness, whereby they lie in wait to deceive; But speaking the truth in love, may grow up into him in all things, which is the head, even Christ:Ephesians 4:11-15 The body of Christ is the local New Testament church. He owns it. God has given us the church, so that every time someone tries to deceive us with a false doctrine, we will not fall prey to the error. God has given us the church in order for us to become mature. He wants us to grow up. That is what it is all about. We are to come to church to mature. We will never outgrow the church. The church is there to help us to grow up. The preacher is there to help us grow up. The evangelist is there to help us to grow up. The quickest way to be deceived by false doctrines is to become unfaithful to church. 5.It is a place for inspiration to go soul winning. And when they were assembled with the elders Then the eleven disciples went away into Galilee, into a mountain where Jesus had appointed them. And when they saw him, they worshipped him: but some doubted. And Jesus came and spake unto them, saying, All powers is given unto me in heaven and in earth. Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost: Teaching them to observe all things whatsoever! have commanded you:Matthew 28:12, 16-20a The church is to inspire and instill in us the importance of goingsoul winning. Most people will never walk inside the church, but we can go to them. Most people where we work will never walk inside our church, but we can take the message where they are. As a pastor, I am to inspire everybody to go soul winning. Four thousand people go soul winning from First Baptist Church every week. I am not satisfied with that. I want everybody to go soul winning every week. It is not the preacher's job to preach the unsaved down the aisle. It is the preacher's job to preach and inspire the individual Christians to go soul winning. That is God's plan. 6. It is a place for fellowship, to take the Lord's supper, to learn the Bible and to learn how to pray. Then they that gladly received his word were baptized: and the same day there were added to them about three thousand souls. And they continued stedfastly in the apostles' doctrine and fellowship, and in the breaking of bread, and in prayers.Acts 2:41, 42 The wordfellowshipmeanscommunion. It is not referring to the typical fellowship of the church. It is referring to a communing in Christ with one another. It is a place where we share a \u0093God Bless You\u0094 and \u0093I am praying for you\u0094 as we unite in the work of God. It is a place for the breaking of bread in the Lord's Supper as we remember together the price Jesus paid for us on Calvary. These are the real reasons for the church. When we get away from these, the church fails to do that which we were called by the Saviour to do, and we look to church to be something different than what God ordained it to be. TABLE OF CONTENTS"}