{"id": 236, "name": "City Journal", "domain": "city-journal.org", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.city-journal.org/article/gender-medicine-trans-movement-donald-trump-election", "title": "Gender Medicine Trans Movement Donald Trump Election", "content": "Search The Magazine Podcasts Topics AboutCity JournalContributorsManhattan Institute City Journal Contributors Manhattan Institute City Journal Contributors Manhattan Institute SubscribeEmail AlertsSubscribe Email Alerts Subscribe Email Alerts Subscribe Donate Search The Magazine Podcasts Topics AboutCity JournalContributorsManhattan Institute City Journal Contributors Manhattan Institute City Journal Contributors Manhattan Institute SubscribeEmail AlertsSubscribe Email Alerts Subscribe Email Alerts Subscribe Donate **Gender Medicine on the Ropes** From the courtroom to the ballot box, the trans movement has taken some hits. The left-wing gender insanity being pushed on our children is an act of child abuse,” Donald Trump declared in a 2024 campaign video. “On Day One,” Trump vowed, he would sign an “executive order instructing every federal agency to cease all programs that promote the concept of sex and gender transition at any age.” He would also ask Congress to ban child sex-change procedures, prohibit the use of taxpayer dollars “to promote or pay for these procedures” in adults, “support the creation of a private right of action for victims to sue doctors who have unforgivably performed these procedures on minor children.” He pledged to unleash the Department of Justice to “investigate Big Pharma and the big hospital networks to determine whether they have deliberately covered up horrific long-term side effects of sex transitions in order to get rich at the expense of vulnerable patients.” Demonstrating how even gender ideology’s critics have been conditioned to use its language, Trump said that he would ask Congress to pass a bill declaring that there are only “two genders,” which are “assigned at birth.” Presumably, he meant twosexes, which aredeterminedat conception andrecognizedat or before birth. Finally, a reason to check your email. Sign up for ourfree newslettertoday. Assuming that these are not empty promises, Trump’s victory in November poses a serious threat to the gender medicine industry. That industry, however, was already on the defensive on the eve of the presidential election. Since 2021,24 stateshave passed laws banning the use of puberty blockers, cross-sex hormones, and surgeries for youth who feel discomfort with their sex. An additional two—Arizona and New Hampshire—have prohibited the use of surgeries, but not hormones. A challenge to one of these laws, from Tennessee, is on the Supreme Court’s 2025 docket. The case,U.S.v.Skrmetti, will determine how states can regulate gender medicine—and, with its 6–3 conservative majority, the Court likely will rule in Tennessee’s favor. Nearly two dozen de-transitioners—young men and (more often) women who were given drugs and surgeries, only to realize later that what they really needed was counseling and time to mature—are now suing their doctors and clinics for medical mistreatment. Though these lawsuits are tough to win, even a single multimillion-dollar verdict or out-of-court settlement could send malpractice insurance premiums soaring and create a chilling effect in states where “gender-affirming care” remains legal. The gender medicine industry’s most powerful argument—that kids will commit suicide without access to “gender-affirming care”—suffered another serious blow in February, when aFinnish studyfound that gender-dysphoric minors and young adults’ suicide risk, while higher than the general population’s, was still thankfully low. Crucially, the study was the first of its kind to control for psychiatric comorbidities. The researchers found that gender-dysphoric young people were not statistically significantly more likely to commit suicide relative to non-dysphoric individualswith similar levels of psychiatric problems. In other words, comorbid mental-health challenges, extremely common in gender-dysphoric youth, explain that population’s elevated suicide risk—not gender issues per se. At the oral arguments inU.S.v.Skrmetti, Chase Strangio, the ACLU’s star transgender litigator, admitted that suicide among trans-identified youths is “thankfully and admittedly rare.”Admittedly? Between April and August of 2024, three events sent shockwaves through the world of gender medicine. In April, pediatrician Hilary Cass submitted a scathing 388-page report on the U.K.’s Gender Identity Development Service (GIDS) to the National Health Service of England. Dubbed the “Cass Review,” the report’s findings and conclusions were based on a multiyear investigation of GIDS and interviews with more than 1,000 people and groups and included seven new systematic reviews of evidence on various topics related to youth gender transition. The review’s conclusions were unambiguous: the evidence for the safety and efficacy of medical transition is “remarkably weak” and cannot support the continued routine use of puberty blockers and cross-sex hormones. The “gender-affirming” model of care, centered on an adolescent’s self-declared identity, is at odds with the standard tools of clinical assessment, to say nothing of accumulated knowledge about adolescent development. Since the Cass Review’s publication, the U.K. has banned puberty blockers as a routine intervention for adolescent gender dysphoria—a move endorsed by Tory and Labour governments alike. Further use of the drugs for treatment of gender dysphoria in minors is subject to strict research protocols. The powerful British Medical Association at first opposed the Cass Review’s recommendations but later retreated from that position. If the Netherlands is the midwife that brought pediatric transition into this world, England is the undertaker that may help bring it to its final rest. The review has been unevenly received in the United States. On the one hand, its release gave liberal newspapers an unprecedented opportunity to admit that Republicans were not alone in their concerns about “gender-affirming care.” Cass joined WBUR’s Meghna Chakrabarti for a sympathetic and thoughtful interview on her show,On Point. TheNew York Times’s initial coverage, while passable, buried some of the report’s critical insights and implications under distracting asides about its political context. In a follow-up Q&A with Cass, however, theTimesgave the former president of the Royal College of Paediatrics and Child Health space to reflect on the growing divergence between the U.S. and Europe. Cass said that while she has “enormous respect” for the American Academy of Pediatrics, she noted that the group is “holding on to a position that is now demonstrated to be out of date by multiple systematic reviews.” TheTimeseventually ran an opinion piece by Pamela Paul, “Why Is the U.S. Still Pretending We Know Gender-Affirming Care Works?” Even theWashington Posthas started to come around. On December 15, the editorial board published an article criticizing the gender industry for its failure to study these interventions properly and maintaining that red-state laws are a response to that failure. “The failure to adequately assess these treatments,” the authors wrote, “gives Tennessee reason to worry about them—and legal room to restrict them.” A sentence like this would have been unthinkable even six months ago. But the Cass Review’s reception among other liberal media outlets and most medical associations was disappointing. STAT News and CNN’s news desks largely ignored the report’s release, despite its being the most significant development in the field of youth gender medicine since the Dutch began the experiment with puberty blockers in the 1990s. The Endocrine Society, meantime, told theNew York Timesthat the review “does not contain any new research” that would lead it to update its guidelines—a clever evasion, since the Cass Review’s seven systematic reviews of evidence and guideline quality, though tops in the field of evidence-based medicine, are not primary “research.” The World Professional Association for Transgender Health (WPATH) criticized the review partly because Cass and her team are not gender clinicians—in other words, because they were not personally invested in the treatments whose evidence they were evaluating and were thus free of conflicts of interest. “The U.K. has banned puberty blockers for adolescent gender dysphoria—a move endorsed by Tory and Labour governments alike.” Recognizing that ignoring the Cass Review wouldn’t make it go away, some U.S. medical groups banned its very discussion on their professional e-mail chains. When Shlomit Gorin, a Bay Area psychologist, posted information about the report and its evidence reviews on the Listserv of a formal division of the American Psychological Association, the moderator blocked her post on the grounds that it violated the group’s 2020 “Letter of Apology to LGBTQ+ Communities,” which forbids “speech that is injurious to LGBTQ+ members.” A similar episode unfolded in the APA’s Pennsylvania chapter, where moderators shut down posts about the Cass Review because “LGBTQIA+” members might feel “targeted, harmed, and hurt by this literature being repeatedly shared.” “We need to regulate our own behavior,” the group told its members. These examples illustrate how professional medical associations often serve more aptly as associations for medical professionals. Professionals who put their patients first would consider it essential to hear robust debate about scientific developments as significant as the Cass Review. Unfortunately, at the APA and elsewhere, the feelings of dues-paying adult members trump the interests of patients. The second landmark event that roiled gender medicine was the disclosure of internal WPATH communications as part ofBoev.Marshall, a lawsuit challenging Alabama’s ban on “gender-affirming care” for minors. When historians look back and ask what led to the downfall of this medical pseudo-experiment on children, the activists’ decision to sue Alabama will be seen as their most significant blunder. TheBoeplaintiffs argue that Alabama’s Vulnerable Child Compassion and Protection Act unconstitutionally deprives “transgender adolescents” of “medically necessary” care. Because their chief piece of evidence for this proposition is WPATH’s Standards of Care for the Health of Transgender and Gender Diverse People, Version 8 (SOC-8), the court granted Alabama’s request to subpoena all internal WPATH communications related to SOC-8’s development. Here is a taste of what those documents revealed: In 2019, WPATH commissioned numerous systematic reviews of evidence from experts at Johns Hopkins University. However, after consulting “social justice lawyers” who advised that conducting evidence reviews would “reveal little or no evidence and put us in an untenable position in terms of affecting policy or winning lawsuits,” and after seeing indications that the evidence was indeed lacking, WPATH suppressed the publication of these reviews. It further demanded that the JHU team henceforth submit any manuscript for WPATH’s approval prior to submission in a medical journal and that authors of these submissions declare in their manuscript that their work was free of any external influence. In the final version of SOC-8, WPATH wrote that conducting a systematic review of evidence for adolescent medical transition “is not possible.” The chair and lead author of SOC-8 admitted in a deposition that “most” of the standards’ chapter authors were chosen because they had previously favored the “gender-affirming” medical pathway over psychotherapeutic alternatives—a clear violation of the widely accepted principle that guideline development should be free from financial or intellectual conflicts of interest. WPATH’s former president, surgeon Marci Bowers, said that when considering potential members for the SOC-8 development team, it was “important” that a candidate be “an advocate for [gender transition] treatments.” Bowers was aware of the organization’s misrepresentations of medical science. In a private e-mail to colleagues, Bowers wrote that SOC-8 “is a balancing act between what I feel to be true and what we need to say.” Bowers also admitted in the deposition to making over $1 million performing gender surgeries in 2023. WPATH caved to pressure from the American Academy of Pediatrics and then–Health and Human Services assistant secretary Rachel Levine to strike from SOC-8 any mention of age minimums for hormones and surgeries. The organization had already shirked a bedrock principle of guideline development—reliance on systematic evidence reviews—and instead used a consensus-based process with (conflicted) authors. Several days after SOC-8’s publication, WPATH issued the correction, eliminating age minimums, without going through its consensus-building process. The organization did not, however, amend its statement in SOC-8 that its recommendations are the product of consensus—a serious violation of transparency. Privately, one WPATH leader complained that the organization was “allowing US politics to dictate international professional clinical guidelines.” SOC-8 included a chapter on “eunuchs,” which WPATH defines as a “gender identity” found in people (including children) “assigned male at birth” who desire castration. WPATH recommends that such individuals undergo castration if they so desire. The standards refer to an online forum called “Eunuch Archive,” which they say contains “the greatest wealth of information about contemporary eunuch-identified people.” According to Alabama’s summary of the website, men can go there to find fetishistic stories of, among other things, “pedophilic fantasies of children who have been castrated to halt their puberty.” Within days of the unsealing of theBoedocuments, the Biden White House told theNew York Timesthat it no longer supported gender surgeries for minors. A week later, the White House told 19th News, a progressive outlet, that it “continue[s] to support gender-affirming care for minorslike mental health care” (my emphasis). The apparent emphasis on psychotherapy rather than on hormones outraged transgender activist groups. “The Biden administration is flat wrong on this,”wrote the Human Rights Campaign, the largest transgender lobby group.Leaked e-mailsshowed that HRC immediately kicked into action, organizing its network of LGBT groups and activists to pressure the administration. Five hours after 19th News published the press release, the White House issued a new statement that replaced “mental health care” with “continuum of care.” On November 5, Democrats saw the fruits of their repeated concessions to transgender activists. A third major blow landed in August, when the American Society of Plastic Surgeons (ASPS) broke from the supposed consensus of U.S. medical groups in support of “gender-affirming care” for minors. It did so in a press release sent to me, in response to questions that I had sent about the Cass Review, the WPATH discovery from Alabama, and ongoing lawsuits by former patients against ASPS-affiliated gender surgeons. The ASPS responded that it had “not endorsed any organization’s practice recommendations for the treatment of adolescents with gender dysphoria,” that there is “considerable uncertainty as to the long-term efficacy for the use of chest and genital surgical interventions,” and that “the existing evidence base is viewed as low quality/low certainty.” ASPS is the largest medical association representing plastic surgeons in the U.S. and Canada, boasting more than 11,000 members. One would think that of all subspecialties, plastic surgery would be the last publicly to question the evidence for pediatric “transition.” But due partly to the bold leadership of its president, Steven Williams, it was the first. In a podcast with a gender surgeon and ASPS member who criticized the organization’s move, Williams, the ASPS’s first black president, cited the Tuskegee experiments as evidence that doctors should not blindly be trusted to self-correct. I broke the news about ASPS in an article in which I also presented findings from an ongoing insurance database analysis about the incidence of mastectomy as a treatment for gender dysphoria in teen girls. At least 5,000 teen girls in the U.S. had their breasts amputated for “gender transition” purposes between 2017 and 2023. This includes at least 50 girls aged 12½ or younger at the time of surgery. Because our database did not include closed-billing health systems like Kaiser Permanente, the largest provider in California, or procedures paid for out of pocket, the true number of girls who have received “top surgery” is almost certainly higher. U.S.v.Skrmettiis the Supreme Court’s highest-profile case of this term. The mere existence of the lawsuit is a political liability for the Democratic Party, which the American public now correctly recognizes as unable or unwilling to stand up to transgender pressure groups. According toa recent YouGov poll, 54 percent of American voters believe that minors should not have access to puberty blockers, compared with only 19 percent who say that they should. Though support for laws that ban these drugs is less strong (45 percent), even fewer Americans oppose such laws (32 percent). In 2019, Kamala Harris infamously expressed support for taxpayer-funded sex-change surgeries for detained illegal immigrants. Her answer exemplifies the chokehold that transgender pressure groups—whose leaders are accountable to foundations and deep-pocket donors, not to the electorate, and who thus have no incentive to moderate their positions—have on the Democratic Party. Smelling blood in the water, the Trump campaign spentabout $20 millionon attack ads focused on transgenderism, with Republicans spendingover $65 millionnationally. One of the ads, which memorably claimed, “Kamala is for they/them. President Trump is for you,” may have been decisive in November. According to theNew York Times, Harris’s most important super PAC found that a version of the “they/them” ad “shifted the race 2.7 percentage points in . . . Trump’s favor after viewers watched it.” Following their party’s sweeping losses, two congressional Democrats—Tom Suozzi of New York and Seth Moulton of Massachusetts—expressed frustration over how Democrats have handled the trans issue. “Democrats spend way too much time trying not to offend anyone rather than being brutally honest about the challenges many Americans face,” Moulton told theNew York Times. “I have two little girls, I don’t want them getting run over on a playing field by a male or formerly male athlete, but as a Democrat I’m supposed to be afraid to say that.” Donald Trump returns to office with a clear mandate to use executive power and leadership in Congress to undo some of the most radical and damaging policies and social practices of the past decade. This will require putting common sense and science forward. It will also require building consensus with liberals and moderates who are aligned on this issue to ensure a lasting policy coalition. It’s important to recognize that transgender activism in medicine and education flourished during Trump’s first term in office. The Agency for Healthcare Research and Quality in the Department of Health and Human Services had no trouble supporting “gender-affirming care” during these years. Transgender-focused NGOs ran extremely lucrative fund-raising campaigns, filling their coffers and staffing their ranks with ambitious young lawyers eager for a fight. Medical associations issued guidelines recommending hormones and surgeries. Democratic states passed laws prohibiting “conversion therapy,” which they defined as any approach that is not “gender-affirming.” The number of kids seeking body modification as a solution to their woes skyrocketed. None of this happened with Trump’s blessing, of course, but it illustrates the challenge of reining in a large and sprawling bureaucracy staffed only partially with political appointments. A second Trump administration will thus need to get serious about tackling the roots of the crisis. This will mean appointing individuals with experience combating transgender activism and finding ways to remove or curb the influence of unappointed bureaucrats. The American public is hungry for a return to sanity. With Democrats facing a civil war over trans issues and the gender medicine industry’s back to the wall, now is the time for smart and principled leadership. Leor Sapiris a fellow at the Manhattan Institute. Top Photo: Recentmonths have witnessed growing public opposition to “gender-affirming care” for minor children. (Joseph Prezioso/AFP/Getty Images) City Journalis a publication of the Manhattan Institute for Policy Research (MI), a leading free-market think tank. Are you interested in supporting the magazine? As a 501(c)(3) nonprofit, donations in support of MI and City Journal are fully tax-deductible as provided by law (EIN #13-2912529). **Further Reading** - - - - Terms of Use Privacy Policy Copyright © 2025 Manhattan Institute for Policy Research, Inc. All rights reserved. PublicationsEye on the NewsFrom the MagazinePodcastsBooks and CultureVideo Eye on the News From the Magazine Podcasts Books and Culture Video Eye on the News From the Magazine Podcasts Books and Culture Video About City JournalContributorsSubscribeDonateContact Us Contributors Subscribe Donate Contact Us Contributors Subscribe Donate Contact Us Quick LinksAdvertiseManhattan InstitutePrivacy PolicyTerms of Use Advertise Manhattan Institute Privacy Policy Terms of Use Advertise Manhattan Institute Privacy Policy Terms of Use Copyright © 2025 Manhattan Institute for Policy Research, Inc. All rights reserved. EIN #13-2912529 - - -"}