{"id": 408, "name": "El Pais", "domain": "elpais.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://elpais.com/salud-y-bienestar/2025-06-11/ser-mayor-no-es-una-excusa-para-no-hacer-ejercicio-intenso-no-existe-mas-riesgo-de-lesion-muscular-y-tampoco-cuesta-mas-recuperarse.html", "title": "Ser Mayor No Es Una Excusa Para No Hacer Ejercicio Intenso No Existe Mas Riesgo De Lesion Muscular Y Tampoco Cuesta Mas Recuperarse.html", "content": "- - - España AméricaMéxicoColombiaChileArgentina México Colombia Chile Argentina México Colombia Chile Argentina US Español US English **Ser mayor no es una excusa para no hacer ejercicio intenso: no existe más riesgo de lesión muscular y tampoco cuesta más recuperarse** **Un nuevo metaanálisis proporciona evidencia sólida contra creencias muy extendidas del deporte durante la vejez, entre ellas que el músculo envejecido es más proclive a romperse** Yedra Martín tiene 65 años. Lleva muchos años haciendo ejercicio de forma regular en el gimnasio de un pueblo de la provincia de Valencia. Este curso asiste dos veces por semana a una clase deFull Bodyy tres a otra deCardio Power, lo que le permite trabajar tanto la fuerza como el equilibrio y la capacidad aeróbica. Es una delas más mayoresde las clases, aunque hay al menos otras siete compañeras que se mueven entre los 60 y los 65 años. “Me encantan estas clases porque siento que trabajo y cuando acabo y me ducho me encuentro genial. Al principio es verdad que, como trabajamos músculos que no había movido nunca, tenía agujetas y cierto dolor muscular, pero después de tantos meses ya no experimento ninguna molestia física”, afirma. La evidencia científica da la razón a la persistencia en el ejercicio de Yedra pese a las molestias iniciales. Segúnlos resultados de un metaanálisispublicado en la revistaJournal of Ageing and Physical Activityque recopiló datos de 36 estudios, a diferencia de lo que se suele creer, el envejecimiento no está asociado con una peor recuperación ni con un mayor daño muscular en los días posteriores a la práctica de ejercicio físico, independientemente de si este es aeróbico o de resistencia. “Aunque estudios individuales han concluido que el envejecimiento podría asociarse con un mayor daño muscular o una peor recuperación, este es el primer estudio que revisa sistemáticamente la literatura disponible para concluir que realmente no es así”, explica a EL PAÍS John Fernandes, investigador de la Escuela de Deportes y Ciencias de la Salud de la Universidad Metropolitana de Cardiff. Según el autor del estudio, estos resultados proporcionan “una evidencia sólida” contra creencias muy extendidas, entre ellas que el músculo envejecido tarda más en recuperarse o que es más proclive a romperse. “Ciertos marcadores indirectos de daño muscular, como el aumento del dolor o la debilidad muscular, de hecho, se reducen con la edad. Es decir, que los síntomas son menores en los adultos mayores, lo que quiere decir que podrían ejercitarse incluso con mayor intensidad o con mayor frecuencia”, añade. Desde la Sociedad Española de Geriatría y Gerontología (SEGG), su vicepresidente de Geriatría, el doctor Nicolás Martínez Velilla, llama a tomar los datos con precaución, ya que en el metaanálisis se consideró comoadulto mayora cualquier persona mayor de 35 años, lo que implica una población muy heterogénea y de franjas etarias muy diversas. “Cuando nosotros hablamos de adultos mayores, habitualmente nos referimos a personas mayores de 65 años, por lo que eso afectaría a la validez externa de estos resultados y debemos ser cautos a la hora de interpretarlo en ese sector poblacional. No obstante, bajo mi punto de vista, el mensaje final del metaanálisis es válido”, sostiene el jefe del Servicio de Geriatría del Complejo Hospitalario de Navarra. De la misma opinión es Mikel Izquierdo, investigador del Centro de Investigación Biomédica en Red de Envejecimiento y Fragilidad (ciberFES), que lleva décadas estudiando el impacto del ejercicio físico en personas mayores. “Los resultados de este estudio coinciden con los de muchos otros publicados en los últimos treinta años que demuestran que, lejos de ser frágil, el músculo envejecido es notablemente adaptable y que, con el entrenamiento adecuado, las personas mayores pueden ganar fuerza y resistencia de manera muy similar a como lo hacen los jóvenes”, reflexiona. Según el catedrático del departamento de Ciencias de la Salud de la Universidad Pública de Navarra-Navarrabiomed, es “importante” derribar el mito limitante del riesgo de dolor o lesión muscular para que más adultos mayores se animen a practicar ejercicio y mantenerse activos. De hecho, explica el experto, elConsenso global de recomendaciones de ejercicio físico en personas mayores, publicado en enero de 2025, apunta que el dolor muscular de aparición tardía (DOMS) es normal y forma parte del proceso adaptativo que lleva a la hipertrofia muscular. “Un dato muy interesante es que, en los adultos mayores, incluso en quienes se inician en entrenamientos de alta intensidad, el DOMS suele presentarse con menos frecuencia y de forma poco severa, así que, en lugar de intentar evitar este tipo de molestias, lo fundamental es educar a los participantes sobre su base fisiológica para aliviar preocupaciones innecesarias y promover que las personas se mantengan constantes en sus programas de entrenamiento de fuerza”, argumenta. **Ajustar los programas de entrenamiento** Como apunta John Fernandes, muchas dinámicas de trabajo y actividades físicas para mayores están planteadas en la actualidad basándose en ese mito de que su musculatura puede experimentar más daño o tardarmás en recuperarse. “Es probable que quienes trabajan con personas mayores implementen tiempos de recuperación más largos o reduzcan el volumen del ejercicio para compensar esa percepción errónea. Por tanto, los programas de entrenamiento podrían ajustarse para aumentar el volumen o la frecuencia del ejercicio, lo que, a su vez, podría potenciar los beneficios del ejercicio en adultos mayores”, afirma. Su opinión la secunda Nicolás Martínez Velilla, que considera que los resultados del estudio pueden implicar un cambio en la programación deentrenamientos, “permitiendo un enfoque más dinámico y variado, que incluya ejercicios de mayor intensidad y resistencia, en lugar de rutinas más suaves”. Una opción respaldada por el reciente Consenso global de recomendaciones de ejercicio físico en personas mayores, que desafía las creencias limitantes tradicionales que han llevado a rutinas de ejercicio poco exigentes o estandarizadas para las personas mayores, promoviendo en su lugar programas personalizados y basados en evidencia científica. “El consenso destaca la importancia de prescribir programas de ejercicio multicomponente que incluyan entrenamiento de fuerza, potencia, equilibrio y resistencia aeróbica, adaptados a las capacidades y condiciones individuales de cada persona mayor”, señala Mikel Izquierdo.Un estudioliderado por el propio investigador y publicado enJournal of Applied Physiology, de hecho, demostró que las personas de entre 65 y 70 años que participaban en un programa de entrenamiento de fuerza y potencia muscular durante 16 semanas podían recobrar la potencia muscular de una persona de mediana edad. En el consenso, además, añade Izquierdo, se enfatiza que incluso los adultos mayores, frágiles o con múltiples comorbilidades, puedenbeneficiarse de entrenamientosbien estructurados y progresivos, siempre que se realicen con una evaluación clínica adecuada y supervisión profesional. El experto, en ese sentido, destaca que el entrenamiento de fuerza y potencia ha demostrado ser efectivo para mejorar la funcionalidad y prevenir caídas, incluso en personas de edad avanzada. Elprograma Vivifrail, desarrollado por el propio investigador navarro, es un referente internacional en ese sentido en el ámbito de la intervención comunitaria y hospitalaria para la prevención de la fragilidad y las caídas en las personas mayores que ha demostrado “beneficios significativos en la mejora del equilibrio, la fuerza muscular y la reducción del riesgo de caídas en adultos mayores”. Para el investigador de cibefFES, por último, tanto el metaanálisis como el consenso internacional respaldan “una transformación” en la programación del ejercicio para adultos mayores, promoviendo enfoques individualizados que consideren las capacidades funcionales y objetivos personales, y que integren componentes clave como la fuerza, el equilibrio y la resistencia. “Este enfoque no solo mejora la salud física, sino que también contribuye al bienestar general y a una mayor independencia en la vida diaria de las personas mayores”, concluye. **Tu suscripción se está usando en otro dispositivo** ¿Quieres añadir otro usuario a tu suscripción? Si continúas leyendo en este dispositivo, no se podrá leer en el otro. ¿Por qué estás viendo esto? **Tu suscripción se está usando en otro dispositivo y solo puedes acceder a EL PAÍS desde un dispositivo a la vez.** Si quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS. ¿Tienes una suscripción de empresa? Accedeaquípara contratar más cuentas. En el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseñaaquí. Si decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedesconsultar aquí los términos y condiciones de la suscripción digital. **Sobre la firma** **Más información** **Los beneficios de hacer pesas para los mayores: ya no basta con salir a caminar** **Caminar rápido 50 minutos a la semana reduce la mortalidad en personas que llevan décadas inactivas** **Archivado En** Salud Ciencia Ejercicio físico Deportes Ancianos Investigación científica **Últimas noticias** **La Suprema Corte ordena la liberación de Juana Hilda González y desnuda la fabricación del ‘caso Wallace’** **Tomar nota: Trump no tiene límites** **El Oviedo hace bueno el 1-2 de la ida y jugará la final del ‘playoff’ de ascenso a Primera** **La energía del Real Madrid funde al Unicaja: 99-81** **Lo más visto** Muere Cristina Santurino, la ultracorredora de las rodillas de acero, a los 36 años En la piel de un corrector de la Selectividad: “Cuando llevas 20 exámenes corregidos, dices: ‘voy a bajar el nivel” Michael Douglas: “Me avergüenzo de mi país y pido disculpas” Ardem Patapoutian, nobel de Medicina: “El 90% de las personas ni siquiera sabe que tiene el sentido de la propiocepción” Villarejo a la jefa del PP catalán: “Esta guerra que vamos a hacer es para que estos tipos [independentistas] no saquen mayoría absoluta” Escaparate Cursos Cursos online Idiomas online EL PAÍS Vinos Cursos Centros Francés online Inglés online Italiano online Alemán online Crucigramas & Juegos Cursos Centros Italiano online Francés online Alemán online Crucigramas & Juegos Mi actividad Mi suscripción Mis datos Mis newsletters Derechos y baja Experiencias para mí - - - España AméricaMéxicoColombiaChileArgentina México Colombia Chile Argentina México Colombia Chile Argentina US Español US English Internacional OpiniónEditorialesTribunasViñetasCartas al DirectorDefensora del lector Editoriales Tribunas Viñetas Cartas al Director Defensora del lector Editoriales Tribunas Viñetas Cartas al Director Defensora del lector EspañaAndalucíaCataluñaComunidad ValencianaGaliciaMadridPaís Vasco Andalucía Cataluña Comunidad Valenciana Galicia Madrid País Vasco Andalucía Cataluña Comunidad Valenciana Galicia Madrid País Vasco EconomíaMercadosViviendaMis derechosFormación Mercados Vivienda Mis derechos Formación Mercados Vivienda Mis derechos Formación Sociedad Educación Clima y Medio Ambiente Ciencia Salud Tecnología Cultura DeportesFútbolBaloncestoTenisCiclismoFórmula 1MotociclismoGolfAtletismoAjedrez Fútbol Baloncesto Tenis Ciclismo Fórmula 1 Motociclismo Golf Atletismo Ajedrez Fútbol Baloncesto Tenis Ciclismo Fórmula 1 Motociclismo Golf Atletismo Ajedrez Televisión Gente y Estilo de vida El País Exprés Fotografía Vídeos Canal EL PAÍS Podcasts el país semanal ideas Negocios Babelia Quadern el viajero planeta futuro s moda icon Gastro El Comidista Cinco Días Motor Mamas & Papas América Futura Escaparate Extras Crucigramas y Juegos EL PAÍS + Últimas noticias Hemeroteca Especiales Soluciones Colecciones"}