{"id": 2054, "name": "National Center for Public Policy Research", "domain": "nationalcenter.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://nationalcenter.org/ncppr/2025/06/05/walmart-paypal-netflix-and-alphabet-held-accountable-by-conservative-shareholders/", "title": "Walmart Paypal Netflix And Alphabet Held Accountable By Conservative Shareholders", "content": "Home About What’s New ProgramsFree Enterprise ProjectProject 21Able AmericansEnvironment & Enterprise Institute Free Enterprise Project Project 21 Able Americans Environment & Enterprise Institute Free Enterprise Project Project 21 Able Americans Environment & Enterprise Institute Donate Contact Home About What’s New ProgramsFree Enterprise ProjectProject 21Able AmericansEnvironment & Enterprise Institute **Programs** Free Enterprise Project Project 21 Able Americans Environment & Enterprise Institute **Programs** Free Enterprise Project Project 21 Able Americans Environment & Enterprise Institute Donate Contact **05 Jun 2025Walmart, PayPal, Netflix and Alphabet Held Accountable By Conservative Shareholders** Washington, D.C. — Over the next 30 hours, shareholder activists with the National Center for Public Policy Research’sFree Enterprise Project(FEP) will present shareholder proposals at the annual meetings of four well-known corporations:Walmart,PayPal,NetflixandAlphabet. At today’sWalmartmeeting, FEP will request that the board explain why it refused to revise its Diversity, Equity and Inclusion (DEI) initiatives until anti-DEI activist Robby Starbuck threatened to publicly expose the company’s policies and practices. (Proposal 9) “It was apparently not untilRobby Starbuckthreatened to expose offensive Walmart ‘wokeness’ that meaningful changes were made, and then within a matter of days,” FEP writes in its supporting statement. “In addition to concerns about the time it took Walmart to revise its DEI programs, a major concern for Walmart shareholders is that value-destroying DEI initiatives are merely being repackaged rather than eliminated. Corporate governance missteps revealed by the requested report would help prevent that recurrence.” At today’sPayPalmeeting, FEP will request that PayPal analyze the risks of its charitable contributions, as they may reflect discrimination against individuals based on their speech or religious exercise. (Proposal 5) In itssupporting statementfor Proposal 5, FEP draws particular attention to PayPal’s partnerships with the Southern Poverty Law Center (SPLC) and Human Rights Campaign (HRC): Groups like the Southern Poverty Law Center have been criticized across the political spectrum as “a partisan progressive hit operation” more interested in “bludgeon[ing] mainstream politically conservative opponents” than upholding civil rights. It uses its “Hate Map” to target many mainstream political and religious groups and individuals, including Moms for Liberty, and Dr. Ben Carson. It has also used its influence to get social media and tech companies, including PayPal, to adopt acceptable use policies that censor SPLC targets. Similarly, the Human Rights Campaign has led coalitions calling on major social media platforms to censor “hate speech and harassment” that includes many mainstream views on parental rights and human sexuality. At today’sNetflixmeeting, FEP will ask the board to assess how the company’s affirmative action initiatives impact Netflix’s risks related to actual and perceived discrimination on the basis of protected categories under civil rights law. (Proposal 7) Stefan Padfield As he presents Proposal 7 today, Free Enterprise Project Executive DirectorStefan Padfieldwill tell Netflix shareholders: Netflix apparently continues to practice affirmative action in a variety of ways despite the fact that the U.S. Supreme Court ruled in the 2023 case ofSFFA v. Harvardthat discriminating on the basis of race in college admissions violates the equal protection clause of the 14th Amendment and as a result, the legality of corporate affirmative action programs has been called into question, with thirteen Attorneys General warning that SFFA implicates corporate affirmative action programs… Unfortunately,the most likely outcome hereis that our proposal will be defeated by a combination of apparently biased and conflicted proxy advisers, asset managers and corporate executives — leaving what have been referred to as the “true” and “ultimate” owners of the company stuck with race and sex discrimination being conducted with their money in the name of “diversity” and “inclusion.” At tomorrow’s meeting ofGoogleparent companyAlphabet, FEP will request that the board consider ending Alphabet’s participation in the Human Rights Campaign’s Corporate Equality Index (CEI). (Proposal 6) In his presentation of Proposal 6 tomorrow, Padfield plans to say: Many believe that HRC’s CEI functions like a social credit score for corporations, with the threat of a bad score being wielded by HRC against corporations to force them to do the political bidding of radical activists, including sowing gender confusion in youth, encouraging permanent surgical procedures on confused and vulnerable teens, and effectively eliminating girls’ and women’s sports and private spaces. This is likely why so many major corporations have recently severed ties with HRC… Alphabet argues that its engagement with organizations does not necessarily reflect an endorsement of their agendas. However, in addition to cooperating with HRCs survey, Alphabet is also a Platinum Partner of HRC, which HRC proudly touts as evidence that Alphabet provides “generous support of the work of the Human Rights Campaign.” …In opposing our proposal, Alphabet is defiantly refusing to even consider ending its participation in the CEI, which is all our proposal asks. In light of this, Alphabet should at least answer the following questions. First, what is a woman? Second, can a man become a woman simply by saying so? Third, can a child be born in the wrong body? Alphabet arguably breaches its duties to shareholders by supporting HRC as it does without having answered these questions. FEP expects that all four of these proposals will be defeated by a wide margin, but argues that thefinal vote tallies will not reflect the will of the majority of individual shareholders. Also, in addition to asking shareholders to support these four proposals, FEP has publishedcomplete voting scorecardsfor each of these companies as part of its Proxy Navigator voting guide. About TheNational Center for Public Policy Research, founded in 1982, is a non-partisan, free-market, independent conservative think-tank. Ninety-four percent of its support comes from individuals, less than four percent from foundations and less than two percent from corporations. It receives over 350,000 individual contributions a year from over 60,000 active recent contributors. FEP, the original and premier opponent of the woke takeover of American corporate life, aims to push corporations to respect their fiduciary obligations and to stay out of political and social engineering. More information about this proposal can be found in FEP’s mobile and web app,ProxyNavigator. Contributionsare tax-deductible and may be earmarked for the Free Enterprise Project. Sign up for email updateshere. Follow us on X (Twitter) at@FreeEntProjectand@NationalCenterfor general announcements. To be alerted to upcoming media appearances by National Center staff, follow our media appearances X account at@NCPPRMedia. SIGN UP FOR EXCLUSIVE UPDATESSign up for NCPPR's monthly newsletter, event invitations, or program-specific updates. All Programs Free Enterprise Project Project 21 Environment and Enterprise Institute Able Americans Wendi BermanMedia Relations Specialist (202) 984-7167 -Email Dan FaoroDirector of Marketing and Communications (202) 984-7162 -Email The National Center for Public Policy Research is a communications and research foundation supportive of a strong national defense and dedicated to providing free market solutions to today’s public policy problems. We believe that the principles of a free market, individual liberty and personal responsibility provide the greatest hope for meeting the challenges facing America in the 21st century.Learn More About UsSubscribe to Our Updates The National Center 2005 Massachusetts Avenue NW Washington, DC 20036 Email us List Removals Contact Us Subscribe Donate Privacy Policy Terms and Conditions Careers"}