{"id": 298, "name": "Center for Strategic and International studies", "domain": "csis.org", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.csis.org/programs/energy-security-and-climate-change-program/projects/project-critical-minerals-security", "title": "Energy Security And Climate Change Program", "content": "**Departmentssubmenu** **Regionssubmenu** **Topicssubmenu** **Primary Menu** Analysis Programs Experts Regions Topics Events Digital Reports Podcasts Newsletters Videos Microsites **About CSIS** **About CSISsubmenu** Home About CSIS Leadership & Staff Financial Information Membership Groups Media Requests iDeas Lab/Multimedia Congressional Affairs Executive Education Careers & Culture Location & Contact **About Menu** **About CSISsubmenu** Home About CSIS Leadership & Staff Financial Information Membership Groups Media Requests iDeas Lab/Multimedia Congressional Affairs Executive Education Careers & Culture Location & Contact **How the Loss of Agricultural Biodiversity Threatens National Security** **Protecting America's Spectrum: A Fireside Chat with Senator Maria Cantwell (D-WA)** **Korea-Japan Relations: What to Expect? | The Capital Cable #115** **Summit on Resilient U.S. Medical Supply Chains** **About Menu** **About CSISsubmenu** Home About CSIS Leadership & Staff Financial Information Membership Groups Media Requests iDeas Lab/Multimedia Congressional Affairs Executive Education Careers & Culture Location & Contact Aerospace Security Project Arleigh A. Burke Chair in Strategy Critical Minerals Security Program Defending Democratic Institutions Defense 360 Defense Budget Analysis Defense-Industrial Initiatives Group Futures Lab Intelligence, National Security, and Technology Program International Security Program Missile Defense Project Project on Nuclear Issues Smart Women, Smart Power Strategy and Statecraft Warfare, Irregular Threats, and Terrorism Program Chair on India and Emerging Asia Economics Chinese Business and Economics Economics Program and Scholl Chair in International Business Energy Security and Climate Change Program Renewing American Innovation Strategic Technologies Program Wadhwani AI Center Global Food and Water Security Program Global Health Policy Center Humanitarian Agenda Human Rights Initiative Project on Prosperity and Development Stephenson Ocean Security Project Sustainable Development and Resilience Initiative Africa Program Americas Program Asia Maritime Transparency Initiative Australia Chair China Power Project Europe, Russia, and Eurasia Program Freeman Chair in China Studies Hidden Reach Japan Chair Kissinger Chair Korea Chair Middle East Program Southeast Asia Program All Regions Africa Americas Arctic and Antarctica Asia Australia, New Zealand & Pacific Europe Middle East Russia and Eurasia All Topics American Innovation Artificial Intelligence Civic Education Civil Society Climate Change Critical Minerals Cybersecurity Defense Budget and Acquisition Defense and Security Economic Security Energy and Sustainability Food Security Gender and International Security Geopolitics and International Security Global Health Global Markets Human Rights Humanitarian Assistance Intelligence International Development Maritime Issues and Oceans Missile Defense Nuclear Issues Space and Aerospace Strategic Capital Technology Trade and International Business Transnational Threats Ukraine War Water Security **Executive Ed Navigation** Global Policy Courses Custom Programs Leadership Development University Programs Course Catalog About Contact Us **Breadcrumb** Defense and Security **Critical Minerals Security Program** The Critical Minerals Security Program is a groundbreaking initiative providing leadership as the United States races to build the resilient minerals supply chains needed for national, economic, and energy security Staff and Affiliates Analysis Events The United States cannot preserve its leadership in national security, economic competitiveness, or energy resilience while remaining dependent on foreign adversaries for critical minerals. Securing these resources demands a bold, modern strategy–one that is market-led, environmentally and socially responsible, builds capacity in both production and processing, and works with allies while also forging new geopolitical alliances with resource-rich Global South countries. The Critical Minerals Security Program will build upon CSIS’s longstanding work with policymakers on both sides of the aisle to support market-led efforts to expand production and processing capabilities to improve domestic and global security. With a new paradigm, the United States can enable its diplomats, policymakers, and private sector actors to develop a secure supply chain and meet the mineral needs of the 21st century. **Meet Our Experts** Meet our network of experts, staff, and non-resident affiliates who contribute to our Critical Minerals Security Program's Analysis Stay up to date on the latest fromCritical Minerals Security Program The CSIS Critical Minerals Security Program's weekly newsletter. A monthly newsletter highlighting reports, commentaries, media appearances, and events from the Defense and Security Department. A weekly recap of the analysis, events, podcasts, and more from the CSIS Energy Security and Climate Change Program. **Contact Information** Kessarin Horvath Program Manager, Critical Minerals Security Program 202.775.7307 KHorvath@csis.org **MEDIA QUERIES** H. Andrew Schwartz Chief Communications Officer 202.775.3242 ASchwartz@csis.org Sofia Chavez Media Relations Manager, External Relations 202.775.7317 SChavez@csis.org **Featured Analysis** **G7 Cooperation to De-Risk Minerals Investments in the Global South** Commentary byGracelin BaskaranandMeredith Schwartz— May 7, 2025 **Rebuilding U.S. Zinc Capacity in an Era of Global Competition** Brief byGracelin BaskaranandMeredith Schwartz— May 5, 2025 Photo: technotr/Getty Images **Underexplored and Undervalued: Addressing Africa’s Mineral Exploration Gap** Africa is a resource-rich continent, yet its share of global exploration spending has dropped by over a third since 2004—highlighting a mismatch between geological potential and actual investment. Exploration incentives should be a central pillar of minerals diplomacy. Commentary byGracelin Baskaran— May 9, 2025 **What to Know About the Signed U.S.-Ukraine Minerals Deal** Critical Questions byGracelin BaskaranandMeredith Schwartz— May 1, 2025 Photo: Gracelin Baskaran/CSIS **Building Critical Minerals Cooperation Between the United States and the Democratic Republic of the Congo** Brief byGracelin Baskaran Photo: nuttawutnuy/Adobe Stock **Trump’s Deep-Sea Mining Executive Order: The Race for Critical Minerals Enters Uncharted Waters** Critical Questions byGracelin BaskaranandMeredith Schwartz Photo: Matt Cardy/Getty Images **The Consequences of China’s New Rare Earths Export Restrictions** Critical Questions byGracelin BaskaranandMeredith Schwartz **Featured Project** Photo: Collection/Adobe Stock **The Copper Initiative** The Copper Initiative brings together independent analysis, dynamic events, and productive dialogues between government officials, private industry, and subject-matter experts to create policy solutions to meet future copper demand for national security, economic competitiveness and energy resilience **Featured Video** **Critical Minerals and the Future of the U.S. Economy** Dr. Gracelin Baskaran sits down with 10 experts from the edited volume \"Critical Minerals and the Future of the U.S. Economy\" to discuss U.S. critical mineral security challenges and policy solutions to address mineral needs for national security, economic competitiveness, and energy resilience. **Featured Report** Photo: adimas/Adobe Stock **Critical Minerals and the Future of the U.S. Economy** Critical minerals play an indispensable role in the modern economy—yet the U.S. mineral supply chain is highly vulnerable. This edited volume offers comprehensive analysis and recommendations to create resilient supply chains for national, economic, and energy security. Report byGracelin BaskaranandDuncan Wood— February 10, 2025 **In the Media4of139results** **How China’s Lock on Rare Earths Is Pressuring Trump in Trade Talks** Gracelin Baskarancited inThe Wall Street Journal— June 11, 2025 **China’s Lock on Rare Earths Dictated Path Toward Trade Truce** Gracelin Baskarancited inThe Wall Street Journal— June 11, 2025 **China’s rare-earth mineral squeeze puts defense giants in the crosshairs** Gracelin Baskarancited inCNBC— June 10, 2025 **‘Disruptions all over the place’ if today’s China talks fail** Gracelin Baskarancited inCNN— June 10, 2025 **AllCritical Minerals Security ProgramContent** **Filter by** **Typeopenfilter submenu** Article(50) Chart(1) Event(16) Expert/Staff(7) Podcast Episode(22) Report(13) **Article Typeopenfilter submenu** **Report Typeopenfilter submenu** **Regionopenfilter submenu** Africa(11) Americas(10) Arctic and Antarctica(1) Asia(8) Australia, New Zealand, and Pacific(2) Caribbean Security(1) Central Asia(1) China(13) Eastern Europe(2) Europe(3) India(1) Middle East(5) North Africa(1) North America(9) Russia(6) Russia and Eurasia(2) South America(2) Sub-Saharan Africa(2) Ukraine(3) **Topicopenfilter submenu** Allies and Partners(1) American Innovation(1) Asian Economics(2) Climate Change(45) Critical Minerals(80) Defense and Security(23) Defense Industrial Base(2) Defense Strategy and Capabilities(1) Economic Security(24) Energy and Geopolitics(61) Energy and Sustainability(57) Energy Innovation(16) Energy Markets, Trends, and Outlooks(15) Geopolitics and International Security(15) Global Economic Governance(1) Global Governance and Institutions(1) Governance and Rule of Law(1) Human Rights(2) International Development(8) Maritime Issues and Oceans(1) Nuclear Issues(1) Private Sector Development(1) Technology(5) Technology and Innovation(11) Trade and International Business(34) U.S. Development Policy(1) **Departmentopenfilter submenu** Defense and Security(92) Economic Security and Technology(7) Geopolitics and Foreign Policy(7) **Trump Strikes a Deal to Restore Rare Earths Access** President Trump announced an agreement with China to resume exports of rare earth minerals and magnets, following two months of supply disruptions to U.S. industry. China's chokehold on rare earth supply chains and resulting leverage necessitates investment into alternative supply. Critical Questions byGracelin BaskaranandMeredith Schwartz— June 11, 2025 **Three U.S. Government Lists: Which Minerals Are the Most Critical?** The existence of multiple lists creates complexity and uncertainty,undermining efforts to encourage private investment across critical mineral supply chains, both domestically and internationally. Analysis byGracelin BaskaranandMeredith Schwartz— May 15, 2025 **Trump’s Middle East Minerals Deal** Gracelin Baskaran, director of the CSIS Critical Minerals Security Program, joins the podcast to discuss potential minerals deals with the United Arab Emirates, Saudi Arabia, and Qatar during President Trump’s trip to the Middle East. Podcast Episode byH. Andrew SchwartzandGracelin Baskaran— May 14, 2025 **Trade in Critical Supply Chains** The U.S. must act urgently to secure critical minerals vital to national security and economic competitiveness. This includes collaboration with allies, which will be key to competing with China’s dominance and building resilient supply chains. Congressional Testimony byGracelin Baskaran— May 14, 2025 **Underexplored and Undervalued: Addressing Africa’s Mineral Exploration Gap** An audio version of “⁠⁠⁠⁠Underexplored and Undervalued: Addressing Africa’s Mineral Exploration Gap⁠,” a new commentary by CSIS's Gracelin Baskaran. This audio was generated with text-to-speech by Eleven Labs. Podcast Episode byGracelin Baskaran— May 9, 2025 **Underexplored and Undervalued: Addressing Africa’s Mineral Exploration Gap** Africa is a resource-rich continent, yet its share of global exploration spending has dropped by over a third since 2004—highlighting a mismatch between geological potential and actual investment. Exploration incentives should be a central pillar of minerals diplomacy. Commentary byGracelin Baskaran— May 9, 2025 **G7 Cooperation to De-Risk Minerals Investments in the Global South** An audio version of “⁠G7 Cooperation to De-Risk Minerals Investments in the Global South⁠,” a new commentary by CSIS's Gracelin Baskaran and Meredith Schwartz. This audio was generated with text-to-speech by Eleven Labs. Podcast Episode byGracelin BaskaranandMeredith Schwartz— May 7, 2025 **G7 Cooperation to De-Risk Minerals Investments in the Global South** The G7 must act decisively on critical minerals security at this year’s summit. Establishing a dedicated G7 investment fund could unlock high-priority projects, de-risk investments, and catalyze private capital—strengthening supply chains and reducing key vulnerabilities. Commentary byGracelin BaskaranandMeredith Schwartz— May 7, 2025 **Rebuilding U.S. Zinc Capacity in an Era of Global Competition** An audio version of “⁠⁠Rebuilding U.S. Zinc Capacity in an Era of Global Competition⁠⁠,” a new brief by CSIS's Gracelin Baskaran and Meredith Schwartz. This audio was generated with text-to-speech by Eleven Labs. Podcast Episode byGracelin BaskaranandMeredith Schwartz— May 5, 2025 **Rebuilding U.S. Zinc Capacity in an Era of Global Competition** Once a zinc processing leader, the U.S. now faces supply chain risks from limited refining, import reliance, and China’s dominance—demanding urgent action to expand domestic capacity, strengthen allied ties, and spur investment in the steel and semiconductor industries. Brief byGracelin BaskaranandMeredith Schwartz— May 5, 2025 Current page1 Page2 Page3 Page4 Page5 Page6 Page7 Page8 Page9 Next pageNext **Footer** About CSIS Programs Topics Regions Events Analysis Careers & Culture Center for Strategic and International Studies1616 Rhode Island Avenue, NWWashington, DC 20036 Tel: 202.887.0200Fax: 202.775.3199 **Media Inquiries** H. Andrew Schwartz Chief Communications Officer 202.775.3242 ASchwartz@csis.org Sofia Chavez Media Relations Manager, External Relations 202.775.7317 SChavez@csis.org SeeMedia Pagefor more interview, contact, and citation details. **Footer Social** **Follow** Facebook X Linkedin YouTube Instagram Threads ©2025 Center for Strategic & International Studies. All Rights Reserved. **Footer secondary navigation** Accessibility Privacy Policy Reprint Permissions"}