{"id": 1281, "name": "Spiegel Online (Der Spiegel)", "domain": "spiegel.de", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.spiegel.de/kultur/kino/sandra-bullock-schauspielerin-lud-dakota-johnson-nach-auszeichnung-mit-goldener-himbeere-zum-brunch-der-verschmaehten-ein-a-7a090c32-6ac0-40e9-bbdc-f4a7dd9d776b", "title": "Sandra Bullock Schauspielerin Lud Dakota Johnson Nach Auszeichnung Mit Goldener Himbeere Zum Brunch Der Verschmaehten Ein A 7a090c32 6ac0 40e9 Bbdc F4a7dd9d776b", "content": "News Ticker Magazin Audio Account Startseite Kultur Kino Sandra Bullock Sandra Bullock lud Dakota Johnson zum Brunch der Geschmähten ein **Sandra Bullock lud Dakota Johnson zum Brunch der Geschmähten ein** **Sandra Bullock lud Dakota Johnson zum Brunch der Geschmähten ein** EILMELDUNG—__proto_headline__ EILMELDUNG—__proto_headline__ **Nach Auszeichnung mit »Goldener Himbeere«Sandra Bullock lud Dakota Johnson zum Brunch der Geschmähten ein** Zur Merkliste hinzufügen Artikel anhören (2 Minuten)2 Min X.com Facebook E-Mail Link kopieren Weitere Optionen zum Teilen X.com Facebook E-Mail Messenger WhatsApp Link kopieren Schauspielerin Sandra Bullock Den »Razzie«, auch »Goldene Himbeere« genannt, möchte wohl niemand zu seiner Trophäensammlung zählen. Mit dem Schmähpreis, dem »Anti-Oscar«, werden jährlich besonders schlechte filmische Leistungen ausgezeichnet. In diesem Jahr wurde die zweifelhafte Ehre Dakota Johnson, 35, für ihre Performance in der Comicverfilmung »Madame Web« zuteil. Doch dann kam Trost in Form einer euphorischen Sprachnachricht, von einer prominenten Schauspielkollegin. Dakota Johnson in Cannes Sandra Bullock, 60, habe sich bei ihr gemeldet, nachdem sie von ihrem »Sieg« bei den »Razzies« erfahren habe, erzählte Johnson nun in demPodcast »Good Hang with Amy Poehler«. Bullock habe ihr gesagt: »Ich habe gehört, dass du im ›Razzie-Klub‹ bist. Wir sollten brunchen. Wir sollten einen monatlichen Brunch haben.« Bullock hat ihre »Goldene Himbeere« als schlechteste Schauspielerin 2010 für den Film »Verrückt nach Steve« erhalten – im selben Jahr, in dem sie ihren Oscar als beste Hauptdarstellerin für ihre Rolle in »Blind Side – Die große Chance« gewann. Zur Verleihung des Schmähpreises erschien sie, anders als Johnson, persönlich –samt einem Handkarren voller DVDs ihres Films. »Goldene Himbeere«: Eine Nominierung, die niemand wirklich haben will US-Schauspielerin: Sandra Bullock warnt vor Fake-Profilen Auszeichnung als beste Hauptdarstellerin: Halle Berry glaubt nicht, dass ihr Oscargewinn schwarzen Frauen geholfen hat Als Johnson die Nachricht von Bullock erhielt, sei sie »ausgerastet«. »Sie ist so ikonisch für mich. Ich dachte nur: ›Oh mein Gott‹. Es war einfach verrückt«, sagte Johnson. **Prominente Vertreter im »Razzie-Klub«** Ob der Brunch der Verschmähten tatsächlich stattgefunden hat und ob sich weitere Angehörige des »Razzie-Klubs« dazugesellt haben, erzählte Johnson nicht. An hochkarätigen Preisträgern mangelt es jedenfalls nicht. AuchHalle Berry,Demi Moore,Leonardo DiCaprioundKevin Costnerhaben den Schmähpreis bereits verliehen bekommen. Für Dakota Johnson ist es nicht das erste Mal, dass sie mit einem »Razzie« bedacht wurde. Vor ihrer Titelrolle in dem Spiderman-Spin-off »Madame Web«, das vielen als künstlerischer und kommerzieller Totalausfall gilt, wurde sie bereits 2016 zur schlechtesten Schauspielerin für »Fifty Shades of Grey« gekürt. **Mehr lesen über** Wordle Wortsuche Paarsuche Wabenrätsel Das tägliche Quiz Kreuzworträt­sel Solitär Sudoku Mahjong Bubble-Shooter Jackpot Snake Exchange 2048 Doppel Rushtower Sudoken Street Wortblitz Fibonacci Gumblast Wimmelbild Skiracer Trivial Pursuit **Auto** Bußgeldrechner Firmenwagenrechner **Job** Brutto-Netto-Rechner Kurzarbeitergeld-Rechner Studienfächer erklärt **Finanzen** Gehaltsvergleich Versicherungen Währungsrechner **Freizeit** Bücher bestellen Eurojackpot GlücksSpirale LOTTO 6aus49 Spiele Streaming Guide Das tägliche Quiz DER SPIEGEL SPIEGEL GESCHICHTE SPIEGEL WISSEN SPIEGEL BESTSELLER Effilee SPIEGEL SPEZIAL SPIEGEL COACHING DEIN SPIEGEL SPIEGEL CHRONIK S-Magazin **SPIEGEL Gruppe** Abo Abo kündigen Shop manager magazin Harvard Business manager 11FREUNDE Werbung Jobs MANUFAKTUR SPIEGEL Akademie SPIEGEL Ed Impressum Datenschutz Nutzungsbedingungen Teilnahmebedingungen Cookies & Tracking Utiq verwalten Newsletter Kontakt Hilfe & Service Text- & Nutzungsrechte Facebook Instagram Wo Sie uns noch folgen können Anmelden Abonnement Suche starten Startseite Schlagzeilen Neue Bundesregierung Klimakrise Newsletter Debatte SPIEGEL Extra Games und Quiz SPIEGEL+ Magazine Meinung PolitikMenü Politik aufklappenBundesregierungBundestag Bundesregierung Bundestag Bundesregierung Bundestag AuslandMenü Ausland aufklappenUSAEuropaNahostGlobale GesellschaftAsienAfrika USA Europa Nahost Globale Gesellschaft Asien Afrika USA Europa Nahost Globale Gesellschaft Asien Afrika PanoramaMenü Panorama aufklappenJustiz & KriminalitätLeuteGesellschaftBildung Justiz & Kriminalität Leute Gesellschaft Bildung Justiz & Kriminalität Leute Gesellschaft Bildung SportMenü Sport aufklappenErgebnisse & TabellenLivetickerFußballBundesligaChampions LeagueFormel 1Formel 1 – Liveticker, Kalender, WM-StandWintersport Ergebnisse & Tabellen Liveticker Fußball Bundesliga Champions League Formel 1 Formel 1 – Liveticker, Kalender, WM-Stand Wintersport Ergebnisse & Tabellen Liveticker Fußball Bundesliga Champions League Formel 1 Formel 1 – Liveticker, Kalender, WM-Stand Wintersport WirtschaftMenü Wirtschaft aufklappenBörseVerbraucher & ServiceVersicherungenUnternehmen & MärkteStaat & SozialesBrutto-Netto-Rechner Börse Verbraucher & Service Versicherungen Unternehmen & Märkte Staat & Soziales Brutto-Netto-Rechner Börse Verbraucher & Service Versicherungen Unternehmen & Märkte Staat & Soziales Brutto-Netto-Rechner WissenschaftMenü Wissenschaft aufklappenKlimakriseMenschNaturTechnikWeltallMedizin Klimakrise Mensch Natur Technik Weltall Medizin Klimakrise Mensch Natur Technik Weltall Medizin NetzweltMenü Netzwelt aufklappenNetzpolitikWebGadgetsGamesApps Netzpolitik Web Gadgets Games Apps Netzpolitik Web Gadgets Games Apps KulturMenü Kultur aufklappenKinoMusikTVLiteraturSPIEGEL-Bestseller Kino Musik TV Literatur SPIEGEL-Bestseller Kino Musik TV Literatur SPIEGEL-Bestseller LebenMenü Leben aufklappenReiseStilGesundheitFamiliePsychologieSPIEGEL Coaching Reise Stil Gesundheit Familie Psychologie SPIEGEL Coaching Reise Stil Gesundheit Familie Psychologie SPIEGEL Coaching Reporter Daten & Visualisierungen Job & Karriere Start GeschichteMenü Geschichte aufklappenZeitzeugenErster WeltkriegZweiter WeltkriegDDRFilm Zeitzeugen Erster Weltkrieg Zweiter Weltkrieg DDR Film Zeitzeugen Erster Weltkrieg Zweiter Weltkrieg DDR Film MobilitätMenü Mobilität aufklappenFahrberichteFahrkultur Fahrberichte Fahrkultur Fahrberichte Fahrkultur SPIEGEL in English DEIN SPIEGEL Audio Video SPIEGEL-Events TestsMenü Tests aufklappenElektronikHaushaltFahrrad & ZubehörKücheCampingGartenAuto-ZubehörBrettspiele Elektronik Haushalt Fahrrad & Zubehör Küche Camping Garten Auto-Zubehör Brettspiele Elektronik Haushalt Fahrrad & Zubehör Küche Camping Garten Auto-Zubehör Brettspiele Bestseller Backstage Themen Vorteile mit S+ MarktplatzAnzeige LottoAnzeigeMenü Lotto aufklappenEurojackpotLOTTO 6aus49GlücksSpirale Eurojackpot LOTTO 6aus49 GlücksSpirale Eurojackpot LOTTO 6aus49 GlücksSpirale Streaming GuideAnzeigeMenü Streaming Guide aufklappenAmazon Prime VideoApple TV +Disney+MagentaTVNetflixParamount+JOYNWOWPluto TV Amazon Prime Video Apple TV + Disney+ MagentaTV Netflix Paramount+ JOYN WOW Pluto TV Amazon Prime Video Apple TV + Disney+ MagentaTV Netflix Paramount+ JOYN WOW Pluto TV SpieleVerlagsangebotMenü Spiele aufklappenDas tägliche QuizKreuzworträtselSolitärSudokuMahjongSnakeJackpot Das tägliche Quiz Kreuzworträtsel Solitär Sudoku Mahjong Snake Jackpot Das tägliche Quiz Kreuzworträtsel Solitär Sudoku Mahjong Snake Jackpot KaufradarAnzeigeMenü Kaufradar aufklappenAuto & FahrradTechnik & ElektronikFinanzen & VersicherungenLebenFreizeit & ReiseHaus & GartenEnergiesystemeHaushalt & KücheTarife Auto & Fahrrad Technik & Elektronik Finanzen & Versicherungen Leben Freizeit & Reise Haus & Garten Energiesysteme Haushalt & Küche Tarife Auto & Fahrrad Technik & Elektronik Finanzen & Versicherungen Leben Freizeit & Reise Haus & Garten Energiesysteme Haushalt & Küche Tarife SPIEGEL-HeftMenü SPIEGEL-Heft aufklappenHeftarchivShop Heftarchiv Shop Heftarchiv Shop Alle MagazineMenü Alle Magazine aufklappenSPIEGEL WISSENDEIN SPIEGELSPIEGEL GESCHICHTESPIEGEL EDITIONSPIEGEL LESEZEICHENSPIEGEL COACHING SPIEGEL WISSEN DEIN SPIEGEL SPIEGEL GESCHICHTE SPIEGEL EDITION SPIEGEL LESEZEICHEN SPIEGEL COACHING SPIEGEL WISSEN DEIN SPIEGEL SPIEGEL GESCHICHTE SPIEGEL EDITION SPIEGEL LESEZEICHEN SPIEGEL COACHING SPIEGEL TV RSS-Feed SPIEGEL MediaMenü SPIEGEL Media aufklappenMANUFAKTURAffiliate & IntegrationsMedia Products MANUFAKTUR Affiliate & Integrations Media Products MANUFAKTUR Affiliate & Integrations Media Products SPIEGEL Ed SPIEGEL Akademie ServicesMenü Services aufklappenBußgeldrechnerUni-ToolsWährungsrechnerVersicherungen Bußgeldrechner Uni-Tools Währungsrechner Versicherungen Bußgeldrechner Uni-Tools Währungsrechner Versicherungen Nachrichtenarchiv Facebook Instagram Wo Sie uns noch folgen können Schauspielerin Sandra Bullock Dakota Johnson in Cannes"}