{"id": 1193, "name": "RichmondSide", "domain": "richmondside.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://richmondside.org/2025/06/10/una-nueva-clase-gratuita-em-latina-center-permite-a-los-jovenes-de-richmond-constuir-mas-que-solo-robots/", "title": "Una Nueva Clase Gratuita Em Latina Center Permite A Los Jovenes De Richmond Constuir Mas Que Solo Robots", "content": "Don’t miss Richmond’s biggest stories.Get the freeRichmondside Reportsent straight to your inbox every Thursday morning. **Want more articles like this? 📚✏️** Richmondside now has a reporter dedicated tokeeping a close eye on WCCUSDso you can expect more education stories from us.Sign up for our weekly newsletter, The Richmondside Report, so you never miss a story. **The local news you need, sent to you weekly.📬** Every Thursday, the freeRichmondside Reportnewsletter tells you what’s happening around town so you canbetter enjoy and engage with your community. Donate NEWSLETTERS TIPS Latest News City Community Schools Events Nosh How We Work About Contact us Advertise Facebook Instagram WhatsApp tiktok Test tesst C ool Story Hello About Contact us Advertise Facebook Instagram WhatsApp tiktok Richmondside Independent nonprofit news for Richmond Donate NEWSLETTERS TIPS Latest News City Community Schools Events Nosh How We Work News bar - RS Riggers Loft is facing eviction El Cerrito joins Korean fried chicken boom Peres family shares coffee cake recipe and tales of city **Una nueva clase gratuita en Latina Center permite a los jóvenes de Richmond constuir más que solo robots** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Click to share on Threads (Opens in new window)Threads Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky 🥳We're celebrating our first birthday! Help us tell the Richmond stories that matter to you. Ya era el día. Después de 10 semanas de programación y construcción, los robots estaban listos para demostrar de lo que eran capaces. Los niños de primaria y secundaria que los construyeron contenían la respiración, ansiosos por ver si sus esfuerzos darían fruto. Los familiares estaban sentados a los lados, congelados por la anticipación. Entonces, uno de los robots cobró vida de repente, y la multitud de aproximadamente 50 personas enel Latina Centeren Richmond estalló en vítores. Padres, abuelos y hermanos celebraban cada movimiento de los robots, aunque no fuera el de su hijo. Primero, los estudiantes guiaron a sus robots por el piso, mostrando su destreza y diseño. Luego, pequeños equipos de estudiantes compitieron para ver qué robot con control remoto podía sacar bloques de una caja más rápido. Don’t miss Richmond’s biggest stories.Sign up to get the Richmondside Report sent straight to your inbox every Thursday morning. “La primera vez que vi a mi robot moverse fue increíble,” dijo Monica Rodriguez, una estudiante de sexto grado en la escuela Lincoln Elementary, a Richmondside. “Nunca había programado un robot en mi vida… Fue increíble ver que algo que tú construiste, se mueve.” Rodriguez dijo que su mamá, quien asiste regularmente al Latina Center, la inscribió no solo para que aprendiera a programar, sino también para que conociera gente nueva y aprendiera a trabajar en equipo. “Al principio pensé que sería muy difícil, pero en realidad no lo es cuando estás con las personas correctas. Puedes construir muchas cosas y, pues, crear cosas nuevas,” dijo Rodriguez. “Y todo fue increíble porque también nos dieron snacks, pizza deliciosa.” **Read this story in English.** Rodriguez fue una de 20 estudiantes en la primera generación del programa Future Latin Tech (Futuro Tecnología Latina), una nueva clase gratuita de robótica diseñada para jóvenes de entre 11 y 15 años. Dirigida por el Latina Center, una organización sin fines de lucro en Richmond que apoya a familias latinas, la iniciativa busca introducir a los estudiantes a la codificación, la ingeniería y el trabajo en equipo dentro de un espacio con raíces culturales. La compañera de equipo de Rodriguez, Itzel Castro, dijo que aunque era mayor que algunos de los otros participantes, sintió que pudo hacer amistades duraderas. Esta estudiante de octavo grado en Making Waves Academy en Richmond ya tiene en la mira convertirse en enfermera. “Sé que las enfermeras usan mucha tecnología, así que sentí que era una buena oportunidad, y lo fue”, dijo Castro. Castro dijo que le sorprendió ver que su robot se moviera. Aunque ya había tomado una clase de programación, este fue un reto único porque los estudiantes tuvieron que construir y programar los robots manualmente, en lugar de solo escribir código en línea. “Hay muchas piezas que se parecen un montón, y realmente tienes que enfocarte en cuáles estás poniendo porque es bien fácil equivocarse,” dijo Castro. “Mi equipo y yo nos equivocamos varias veces, pero estuvo bien porque cometer errores es parte del aprendizaje, y eso te hace pensar mejor.” Castro y sus amigas también señalaron que aprender habilidades de codificación y programación es especialmente útil para las niñas, porque les da más confianza yoportunidadesen el ámbito profesional. “La mayoría de la gente solo piensa en las niñas o mujeres limpiando, cocinando o quedándose en la casa”, dijo Castro. “(Aunque aprender a cocinar está bien,) también está mal, porque no tienen una carrera (ni siguen) sus sueños.” Durante la reciente competencia del sábado, se habló exclusivamente en español. Miriam Wong, fundadora y directora ejecutiva del Latina Center, dijo que eso fue intencional. “Primero que nada, si ellos (los jóvenes) son bilingües, es mejor,” dijo Wong. “Pero también por los papás. Todo inmigrante, incluyéndome a mí, cuando llegamos a este país, perdemos ese sentimiento de seguridad, de estar en casa, y aquí pueden hablar su idioma y encontrar su comunidad y hacer amistades entre generaciones.” **El Latina Center fue fundado para apoyar a sobrevivientes de violencia doméstica** En 25 años, se convirtió en un lugar donde esas sobrevivientes se sintieron empoderadas para crear nuevos programas. El centro ofrece clases para padres, apoyo de salud mental para latinas yfamiliascon poco o ningún acceso a atención médica, apoyo legal ymigratorio, además de una gran variedad de programas de liderazgo y tecnología para todas las edades. Wong, quien emigró a Estados Unidos desde Perú, dijo que ha sido hermoso ver cómo ha crecido el centro a lo largo de los años, subrayando que cuando las comunidades se unen para apoyarse mutuamente, nacen grandes ideas. El programa Future Latin Tech fue financiado con una subvención del Richmond Fund for Children and Youth (Fondo de Richmond para Niños y Jóvenes). El centro creó el programa con la ayuda de Fundación Global Arte Ciencia y Tecnología, una organización con más de 18 años de experiencia en robótica educativa. “Este es un sueño hecho realidad, especialmente para mí, porque yo escucho a los papás, lo que está pasando y las atrocidades en este país. Sabemos y entendemos que nuestra juventud tiene menos oportunidades, especialmente los latinos,” dijo Wong. “La tecnología es el futuro del mundo, y estamos en desventaja, así que tenemos que introducir (esas habilidades) a nuestros hijos.” Dijo que cuando los primeros 20 niños llegaron al salón el 22 de marzo, estaban tímidos y nerviosos, escondidos bajo sus capuchas. Pero a lo largo del programa, su confianza creció. “Fue como ‘guau’, estos niños son inteligentes, y lo están viendo. Y ver a los papás hoy, eso fue un gran apoyo para ellos,” dijo Wong. “Y los papás, muchos de ellos los conocemos y sabemos lo que han pasado, para ellos, dicen ‘yo sí veo un futuro para mis hijos.’” Ines Ambrocio Garcia le dijo a Richmondside que se sentía increíblemente orgullosa de ver a su hijo construir un robot y ver lo que podía lograr, y que está agradecida por la oportunidad. Sus hijos le ayudaron a traducir del español al inglés. “Es una oportunidad muy grande para mis hijos, porque les da una chance en la vida de tener un estilo de vida diferente al nuestro,” dijo Garcia en español. “Y los deja experimentar y probar cosas nuevas.” Su hijo, Lester Ambrocio Garcia, estudiante de octavo grado en la escuela Summit Tamalpais, dijo que siempre ha estado interesado en la tecnología y la codificación desde que tiene memoria. Ya había tomado diferentes clases de programación, pero esta experiencia fue única y gratificante. “” “Y creo que es una gran oportunidad que se estén enfocando en los latinos, porque nos da un lugar para brillar y decir que no somos las sombras de otros, y que todos merecemos una oportunidad, sin importar de dónde venimos.” —Lester Ambrocio Garcia, estudiante de la clase de robótica “Fue complicado, porque era la primera vez que hacía algo así, y muy divertido conocer gente y experimentar algo nuevo,” dijo Lester Ambrocio Garcia. “Y creo que es una gran oportunidad que se estén enfocando en los latinos, porque nos da un lugar para brillar y decir que no somos las sombras de otros, y que todos merecemos una oportunidad, sin importar de dónde venimos.” El programa de robótica funcionará durante tres años. Este verano, otras dos generaciones pasarán por la capacitación. Los padres interesados pueden obtener más informaciónaquí. **Related stories** **Families say WCCUSD needs better plan to support most vulnerable students** **‘Excited, eager, optimistic:’ Local high school seniors celebrate scholarships** **Richmond protest draws more than 200 in support of immigrants** **… We have a small favor to ask.** We're marking the first anniversary of Richmondside's launch. Our independent, nonprofit newsroom is committed to bringing youhigh-impact, trustworthy local news about Richmondeach and every day. Our journalism is free for all, but not free to produce. If you value our work, please consider making a donation to celebrate our first year! **Jana KadahReporter** What I cover: I write about Richmond schools and youth issues, Contra Costa College, the county Board of Education and other general topics. My background: I made my way to the East Bay after covering city hall at San Jose Spotlight where I earned several first-place awards for my local government, business/economy and public service reporting from the California News Publishers Association. Before that, I was a reporter for Bay City News, where I wrote about issues ranging from homelessness to the environment and education. **Leave a comment** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ Contact us About Donate Advertise Policies Berkeleyside The Oaklandside Careers Facebook Instagram WhatsApp tiktok **** **** ****"}