{"id": 213, "name": "Chalkbeat", "domain": "chalkbeat.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://events.chalkbeat.org/event/the-carnegie-learning-national-institutes-tni-professional-learning-summer-experience-mathelaworld-languages/", "title": "The Carnegie Learning National Institutes Tni Professional Learning Summer Experience Mathelaworld Languages", "content": "Browse Events List your event Read Chalkbeat Newsletters **Carnegie Learning Professional Learning Summer Institutes featuring Peter Liljedahl** **Carnegie Learning Professional Learning Summer Institutes featuring Peter Liljedahl** San Antonio, TX June 23-26, 2025 and Scottsdale, AZ July 8-11 and July 13-17 LONG + LIVE + MATHReady to be inspired? Join fellow math educators at LONG + LIVE + MATH in San Antonio or Scottdale, where you’ll get actionable insights from workshops on Building Thinking Classrooms featuring Peter Liljedahl, PhD as keynote, intentionally varied math instruction, multilingual learner support, and more. As one of The National Institutes (TNI), this event will also feature dynamic speakers and networking opportunities. Located in vibrant San Antonio, TX, the Hyatt Regency Hill Country Resort and in sunny Scottsdale, AZ, the Fairmont Scottsdale Princess resort provide the ideal backdrop for this transformative event. Fairmont Scottdale Princess Resort Join fellow ELA at Lead With Literacy: The National Institute (TNI), where you’ll get actionable insights from workshops on evidence-based literacy practices, meeting diverse learner needs, creating authentic experiences across literary genres, and more. As one of The National Institutes (TNI), this literacy conference will feature dynamic keynote speakers and networking opportunities. Join fellow World Language educators Language Is Limitless: The National Institute (TNI), where you’ll get actionable insights from workshops on language teaching foundations, comprehensible input & output, heritage speaker instruction, and more. Located in sunny Scottsdale, AZ, the Fairmont Scottsdale Princess resort provides the ideal backdrop for this transformative event. **Additional Details** **Date And Time** **Location** **Event Category** **Watch video** **Share With Friends** About Chalkbeat Events Contact Become a Sponsor Careers at Chalkbeat"}