{"id": 991, "name": "WTVF - NewsChannel5", "domain": "newschannel5.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.newschannel5.com/news/newschannel-5-investigates/this-is-disgusting-parents-in-disbelief-after-video-surfaces-of-black-sludge-in-elementary-school-kitchen", "title": "This Is Disgusting Parents In Disbelief After Video Surfaces Of Black Sludge In Elementary School Kitchen", "content": "Menu WeatherSafe Places Safe Places Safe Places Safe Places Local NewsAdventures in IcelandLet Me HelpMy HeroYour MoneySchool PatrolSportsTake Time to SmileTraffic Adventures in Iceland Let Me Help My Hero Your Money School Patrol Sports Take Time to Smile Traffic Adventures in Iceland Let Me Help My Hero Your Money School Patrol Sports Take Time to Smile Traffic NewsChannel 5 InvestigatesBrokenBroken - Mental Health CrisisCapitol HillCity Hall ScandalConsumer AlertCOVID InvestigationsThe DA's DealsDCS InvestigationsHate Comes To Main StreetGideon's ArmyMaking The GradeMetro SchoolsPolicing For ProfitRevealedTennessees Secret DealsToxic School Water Broken Broken - Mental Health Crisis Capitol Hill City Hall Scandal Consumer Alert COVID Investigations The DA's Deals DCS Investigations Hate Comes To Main Street Gideon's Army Making The Grade Metro Schools Policing For Profit Revealed Tennessees Secret Deals Toxic School Water Broken Broken - Mental Health Crisis Capitol Hill City Hall Scandal Consumer Alert COVID Investigations The DA's Deals DCS Investigations Hate Comes To Main Street Gideon's Army Making The Grade Metro Schools Policing For Profit Revealed Tennessees Secret Deals Toxic School Water National News Embrace: Learn about our mural How to Watch NewsChannel 5 Events and Community Calendar Talk Of The TownTalk of the Town RecipesExtrasBe Your Best Talk of the Town Recipes Extras Be Your Best Talk of the Town Recipes Extras Be Your Best NewsChannel 5+MorningLineOpenLineSportsLineInside PoliticsAARP ConnectedThe Corner to Corner ShowIssues of FaithMedical MondaysMillions of ConversationsOut & About TodayPharmacist On CallThe Plus Side of NashvilleQue Pasa Nashville?Retirement ReportThe Sami Cone ShowScore ConnectState of the WorkforceSouthern Woods and WatersUrban League LiveUrban Outlook MorningLine OpenLine SportsLine Inside Politics AARP Connected The Corner to Corner Show Issues of Faith Medical Mondays Millions of Conversations Out & About Today Pharmacist On Call The Plus Side of Nashville Que Pasa Nashville? Retirement Report The Sami Cone Show Score Connect State of the Workforce Southern Woods and Waters Urban League Live Urban Outlook MorningLine OpenLine SportsLine Inside Politics AARP Connected The Corner to Corner Show Issues of Faith Medical Mondays Millions of Conversations Out & About Today Pharmacist On Call The Plus Side of Nashville Que Pasa Nashville? Retirement Report The Sami Cone Show Score Connect State of the Workforce Southern Woods and Waters Urban League Live Urban Outlook Contact NewsChannel 5 Team Bios TV Listings From our sponsorsCommon CentsExperts on 5Music City MustSalvation Army Angel TreeDonate to the Salvation Army Red Kettle Challenge Common Cents Experts on 5 Music City Must Salvation Army Angel Tree Donate to the Salvation Army Red Kettle Challenge Common Cents Experts on 5 Music City Must Salvation Army Angel Tree Donate to the Salvation Army Red Kettle Challenge Sign In Newsletters Sign Out Manage Emails Apps Careers Search Investigates Home Hate Comes To Main Street Revealed DCS Broken - Mental Health Crisis Broken Consumer Alert **Actions** Facebook Tweet Email **'This is disgusting.': Parents in disbelief after video surfaces of black sludge in elementary school kitchen** MT. JULIET, Tenn. (WTVF) — What parents saw from their cars had many of them struggling to find words as they lined up outside W.A. Wright Elementary on the last day of school. This was for many of them the first time they had seen images of the black sludge creeping down the walls of the school kitchen. “I’m shocked. I can’t. This school? I’m having a hard time,” Lindsey Vazquez said. “It’s nasty, whatever it is,” Jodee Stocki said. NewsChannel5 Investigatesobtained video and photos from inside the school showing the sludge build-up on kitchen walls, on the floor, and in the cooler. We shared this with parents who were left trying to make sense of how long this substance was on the walls and if their children were somehow impacted. “Well, that makes me uneasy. My daughter has lunch here almost every day,” Kourtney Hurst said. Shannel Saddler has worked in the kitchen for the past few months but says she’s felt sick practically every day since. We met with Saddler on the last day of school, hours after she said she was told to leave for speaking up. “It’s bad. It’s bad. That’s why a lot of the children have been sick. It’s not just allergies,” Saddler said. She told us her team met with an administrator and that’s when Saddler explained her concerns. “She got angry, walked toward me, put her finger in my face, and told me to leave,” Saddler said. Saddler says she walked out knowing that speaking up meant risking her job. That hasn’t stopped her from sharing what she’s since learned has been dripping down these walls for years. “It’s in the vents, they’re breathing it in. It’s in the cafeteria where the kids eat. It would be on the food, but I would remove it and throw it in the trash,” Saddler said. NewsChannel5 Investigatesdiscovered that the last three inspection reports from the Tennessee Department of Health show W.A. Wright Elementary School’s kitchen received 98s and 99s out of 100 dating back to February 2024. All three reports mention a brown or black substance in some cases dripping from the ceiling and onto yogurt and canned drinks. The report doesn’t explain what this substance could be and never requested a follow-up investigation. “I’m afraid that it will not be fixed and that the kids will constantly be sick from it. That’s what I’m afraid of,” Saddler said through tears. “You didn’t get into this business to make kids sick,” we asked. “No,” Saddler replied. Bart Barker, the public information officer for Wilson County Schools, said that while the project to fix roof issues at the school is long overdue, it will be completed. “One of the issues we’ve faced since then is that other schools in the district have had equally as pressing or other dire needs that match this or are in worse condition. This year is when the approval came for the funds to really get on the roof situation. It’s no secret, it (W.A. Wright Elementary) has had its issues for multiple years,” Barker said. Barker says other more recent projects include a new roof for Lakeview Elementary, major interior repairs and a new HVAC system for Mt. Juliet Middle, as well as new HVAC systems at Gladeville Elementary and Carroll Oakland Elementary. He said roofers began work at W.A. Wright Elementary in the past few weeks, so they've since taped off the kitchen and dining rooms. Several students are expected to return to summer school beginning this week, but Barker says they will all be fed out of the nearby Green Hills High School. Barker says they’ve ordered air quality tests for W.A. Wright, but he’s seen the videos and understands why parents are concerned. “From a photogenic standpoint, it looks awful,” Barker said. Barker, however, said they haven’t seen any more sick kids or staff than normal. He says the district consulted with The Garland Company and they concluded that the substance is, “remnants of roofing material, tar/stains/oils that’s applied to roofs such as this, along with asphalt sheeting/insulation materials.” Barker said much of what we see is a byproduct of one of the wettest starts to the year we’ve had in years. Once water collects on the roof, Barker said it’s only inevitable for it to make its way through the roof of this aging school. “Knowing that this has been going on for years, why has it not risen to the level of letting parents know what’s going on?” we asked. “If we felt there was a crisis involving this school and children’s health, then absolutely there would have been communication, but at no point have we felt like that,” Barker said. “One of the inspection reports mentions that whatever was leaking from the ceiling was falling on yogurt and soda cans. That to me presents an issue of contamination,” we responded. “If there were things that were penetrated because of leakage, they were discarded,” Barker said. Saddler said she and her team felt pressure at times not to throw away food because it costs money to replace it. Barker said not only does he believe that wasn’t the case, but he also rejects the notion that Saddler was fired for speaking up. “Not only is she still an employee as I had stated, but multiple waves of communication from the district were sent to her last week via her then and still active district email address to offer support and state clearly that she had not been terminated,” Barker said. He said his wish would be for more employees to feel empowered about speaking up if they spot problems of their own. “Exercise the open-door policy. Come talk before a school board meeting. Express your concerns and your views. That’s encouraged. I don’t know what the disconnect is and why that didn’t happen,” Barker said. Saddler says she has no intentions of returning, but says that was never really the priority. She wants parents to know what’s happening and feels relying on a short-term fix will not solve long-term problems. “You’ve got to think about the children. That’s it. I don’t care about anything else, but that. That’s why I put my job at risk,” Saddler said. Barker said they expect to have air quality test results at some point this summer and promise to provide those findings as soon as possible. If you’re a parent, staff, or faculty member at a Wilson County School experiencing similar issues, please contact Levi at: Levi.Ismail@newschannel5.com **Stay informed with the latest weather tracking** **Stay informed with the latest weather tracking** Phone: 615-244-5000 News Sports Weather Traffic Talk Of The Town Newschannel 5+ Don't Waste Your Money Support Contact Us Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Public Contact FCC Application Accessibility Statement Scripps Media Trust Center Closed Captioning Contact newschannel5 newschannel5 newschannel5/ nc5 newschannel5"}