{"id": 1406, "name": "The Manual", "domain": "themanual.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.themanual.com/auto/aston-martin-and-lego-unveil-their-latest-collaboration-the-lego-technic-aston-martin-valkyrie/", "title": "Aston Martin And Lego Unveil Their Latest Collaboration The Lego Technic Aston Martin Valkyrie", "content": "STYLESTYLESee All STYLEAccessoriesClothingFootwearWatches See All STYLE Accessories Clothing Footwear Watches See All STYLE Accessories Clothing Footwear Watches GROOMINGGROOMINGSee All GROOMINGBodyFragrancesHaircareShavingSkincare See All GROOMING Body Fragrances Haircare Shaving Skincare See All GROOMING Body Fragrances Haircare Shaving Skincare FOOD & DRINKFOOD & DRINKSee All FOOD & DRINKAdvice and InsightsLiquor, Beer, Wine & DrinksCoffee & TeaRecipes See All FOOD & DRINK Advice and Insights Liquor, Beer, Wine & Drinks Coffee & Tea Recipes See All FOOD & DRINK Advice and Insights Liquor, Beer, Wine & Drinks Coffee & Tea Recipes CULTURECULTURESee All CULTUREStreamingTrendingBooks & MusicBrand Profiles See All CULTURE Streaming Trending Books & Music Brand Profiles See All CULTURE Streaming Trending Books & Music Brand Profiles HEALTH & FITNESSHEALTH & FITNESSSee All HEALTH & FITNESSNutritionWorkoutsTherapy and RecoveryEquipment See All HEALTH & FITNESS Nutrition Workouts Therapy and Recovery Equipment See All HEALTH & FITNESS Nutrition Workouts Therapy and Recovery Equipment OUTDOORSOUTDOORSSee All OUTDOORSSnowboardingSnowsportsBackpackingCampingHikingNational ParksE-mobilityGolfPortable Power Stations See All OUTDOORS Snowboarding Snowsports Backpacking Camping Hiking National Parks E-mobility Golf Portable Power Stations See All OUTDOORS Snowboarding Snowsports Backpacking Camping Hiking National Parks E-mobility Golf Portable Power Stations TRAVELTRAVELSee All TRAVELAdvice and how-tosDestinationsTravel GearTravel Guides See All TRAVEL Advice and how-tos Destinations Travel Gear Travel Guides See All TRAVEL Advice and how-tos Destinations Travel Gear Travel Guides AUTOAUTOSee All AUTOAuto NewsEVsCar CareMotorcyclesAuto ReviewsSupercars See All AUTO Auto News EVs Car Care Motorcycles Auto Reviews Supercars See All AUTO Auto News EVs Car Care Motorcycles Auto Reviews Supercars Deals MOREMOREAbout The ManualContact UsAdvertise With UsWork With UsDigital TrendsDigital Trends en Español About The Manual Contact Us Advertise With Us Work With Us Digital Trends Digital Trends en Español About The Manual Contact Us Advertise With Us Work With Us Digital Trends Digital Trends en Español Trending: Whiskey Gifts How to Tie a Tie Best Coffee Beans How to Shape a Beard Best Sweaters for Men Most Expensive Cognac Monos vs Away Luggage Best Luxury Hotel Chains Fastest Cars in the World Ernest Hemingway Books What Does CBD Feel Like? Canada Goose Alternatives Fastest Motorcycles in the World Home Auto **Aston Martin and LEGO unveil their latest collaboration: the LEGO Technic Aston Martin Valkyrie** **The LEGO Technic Aston Martin Valkyrie** Aston Martin and the LEGO Group have teamed up to roll out an exciting new project: the LEGO TechnicAston Martin Valkyrie. This awesome set combines the high-performance vibes of Aston Martin’s incredible hypercar with the fun of LEGO building. It gives fans a chance to explore all the exciting details and cutting-edge technology that make this car so unique. Whether you’re into cars or just love LEGO, this model promises a fun building experience that’s sure to keep you engaged. Plus, it’s part of a fun partnership with Gameloft’s Asphalt Legends UNITE gaming platform, so you can race both the real Aston Martin Valkyrie and your LEGO version in the game, getting the best of both worlds. The Valkyrie isn’t just another sports car; it’s the ultimate hypercar, engineered for both the road and the track. With its sleek design and exotic features, it turns heads anywhere it goes. Thanks to its Formula One tech, the Valkyrie comes from a collaboration between the genius Adrian Newey and the talented Aston Martin team. Marek Reichman, Executive Vice President and Chief Creative Officer of Aston Martin, stated: “The Aston Martin Valkyrie represents a triumph of engineering, design, and aerodynamic innovation — a true icon born from Aston Martin’s mastery of performance and beauty. Our collaboration with LEGO Technic celebrates the extraordinary engineering and visionary thinking that brought the Valkyrie to life. By integrating it into the Gameloft Asphalt Legends UNITE gaming platform, we’re not only preserving its legacy, but also introducing this remarkable machine to a new audience in a creative way.” This car pushes the limits of what’s possible in automotive design. With radical aerodynamics and jaw-dropping speed, it gives drivers an experience that feels like being behind the wheel of a Formula One racer. It can go from 0 to 62 mph (100 km/h) in just 2.5 seconds and packs a powerful punch with 1,124 horsepower. Inspired by this incredible ride, the LEGO Technic Aston Martin Valkyrie has over 700 pieces that fit together to create a stunning model. Its sleek shape is eye-catching, especially in the iconic Podium Green color. But it’s not just about looks. This set has some cool features, like gullwing doors that actually open, a top-mounted lever for steering, and a detailed V12 engine with moving pistons. It’s all the excitement of Aston Martin packed into one awesome build. Alexandra Dragomir, Marketing Manager for LEGO Technic, said, “With LEGO Technic and Aston Martin joining forces to create the new LEGO Technic Aston Martin Valkyrie, we’re taking fast-paced play to a whole new level. This latest set highlights the Valkyrie as the pinnacle of engineering, emphasized by the moving functionality of LEGO Technic. We’re excited to bring Aston Martin’s hypercar to life in brick form, as well as through an in-game experience on the Gameloft Asphalt Legends UNITE platform.” The LEGO Technic Aston Martin Valkyrie is more than just a building kit; it’s a celebration of Aston Martin’s exceptional engineering and design. So, if you love cars or LEGO (or both), this is your chance to get creative and build something special. The set is now available at LEGO.com, ready for fans to take home and kick off their adventure in luxury car design and imaginative building for a mere $64.99, which is a whole heck of a lot less than a life-sized Valkyrie’s $4 million price tag. Auto News **Editors’ Recommendations** Jeep unveils the all-new Cherokee to debut late 2025 New Q by Aston Martin series celebrates a decade of Aston Martin in Mexico. Harley-Davidson and MotoGP unveil global bagger racing championship for 2026 Genesis unveils its GMR-001 hypercar to compete in Le Mans Fersa’s latest fuel efficient wheel hubs cut friction and logistical costs at the same time Auto Firestone, a subsidiary of Bridgestone, is rolling out its latest touring tire, the Firestone Affinity AS, and it's all about making your drive smoother and more reliable. Designed for popular cars, this tire gives you the confidence and peace of mind you want when you're on the road. The Affinity AS is built to go the distance, using a special tread compound that fights against uneven wear and tear. Plus, it comes with a solid warranty of up to 65,000 miles, so you know it’s made to last. Auto The Mercedes-Benz G-Class, known for its iconic boxy shape and impressive off-road capabilities, first hit the streets in 1979 with the 280 GE model. It wasn't long before it became a favorite among everyone from the Kardashians to the Pope. Mercedes has just dropped some exciting news with the new limited-edition G-Class, called the \"Edition Stronger Than the 1980s.\" This ride pays tribute to the classic SUV style from the Eighties and is sure to turn heads. With just 460 units being made worldwide, this special G-Wagen embraces vintage colors, sleek black trim, and unique lighting, all while bringing back some serious nostalgia. Auto Genesis is entering the world of endurance racing. Ahead of the New York International Auto Show, the Korean luxury automaker announced a new V8-powered hypercar, and some big targets for its “Genesis Magma Racing” team. The hefty V8 at the center of it all wasn’t present at the show itself, but the vehicle it will power, the GMR-001, was on display at Genesis House. It’s easy enough to spot, with its bright orange “Magma” livery. Drivers André Lotterer and Luis “Pipo” Derani, who share multiple victories at the likes of Le Mans and Sebring between them, wearing the team’s firesuits. In addition to the colors matching the vehicle well, the new suits are also a nod to the company’s proud Korean heritage. The Essential Guide for MenThe Manual is simple — we show men how to live a life that is more engaged. As our name implies, we offer a suite of expert guides on a wide range of topics, including fashion, food, drink, travel, and grooming. We don’t boss you around; we’re simply here to bring authenticity and understanding to all that enriches our lives as men on a daily basis. Facebook Instagram Twitter YouTube Pinterest LinkedIn Flipboard Men’s Style Watches Men’s Clothing Men’s Grooming Shaving Skincare Food and Drink Culture Health & Fitness Outdoors Camping Travel Auto About Us Contact Us Logo & Accolade Licensing Branded Content Careers Work With Us Diversity & Inclusion Terms of Use Privacy Policy Do Not Sell or Share My Information Press Room Sitemap"}