{"id": 1265, "name": "Skeptic Magazine", "domain": "skeptic.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://skeptic.com/article/when-our-best-friend-becomes-our-worst-enemy-the-story-of-american-bully-xl-attacks-and-the-campaign-that-banned-the-breed-in-britain/", "title": "When Our Best Friend Becomes Our Worst Enemy The Story Of American Bully Xl Attacks And The Campaign That Banned The Breed In Britain", "content": "Articles Podcast Data Events Magazine Skeptics Society Donate Shop Toggle themeMode Log In Subscribe Articles Podcast Data Events Magazine Skeptics Society Donate Shop Toggle themeMode Log In Subscribe **American Bully XL Attacks and the Campaign That Banned the Breed in Britain** Article crime animals When I first investigated the sharp rise in human deaths due to dogs in the UK, I did not expect the fast-paced chain of events it would spur. A month after publishing a blog post on the dramatic rise in maimings and deaths due to dogs and the single breed that accounted for this unprecedented change, I was asked by the head of a victims’ group to run a campaign to ban the American Bully XL breed in England. From the outset, I was told that such action, from an inactive government, was essentially impossible—one person involved in politics told me I would need to “make it a national issue” before the government would ever consider hearing our concerns, let alone acting on them. Thanks to a small group of dedicated people, relentless persistence and focus on our goal, just 77 days after starting the campaign, the British Prime Minister announced the implementation of our policy to the nation. The ban was overwhelmingly popular with the public and remains so to this day. Indeed, in recent polling on the chief achievements of the now ex-Prime Minister Rishi Sunak, the American Bully XL ban was ranked by the public tied for 4th place—higher than a significant tax cut and above increased childcare provision. Why? The British public is known for its love of dogs. Indeed, I have a dog and have grown up with dogs. Why would I spearhead such a campaign? **The Horrifying Problem** It is common to start these kinds of articles with a kind of emotive, engaging story designed to appeal to the reader. I have tried writing such an introduction, but the stories are so horrifying I cannot begin to describe them. Whether it’s the 10-year-old Jack Lis, mauled to death and having injuries so horrific that his mother cannot shake the image from her mind at every moment she closes her eyes, or a 17-month-old girl that lost her life in the most unimaginably terrible circumstances, the stories, the pain of the parents, and the horrifying last moments of those children’s lives are beyond comprehension. In the past three years, the number of fatal dog attacks in the UK has increased dramatically.1Between 2001 and 2021 there were an average of 3.3 fatalities per year—with no year reaching above 6. In 2022, 10 people were killed, including 4 children. Optimistic assumptions that 2022 was an outlier did not last and by the summer of 2023, there had already been 5 fatalities. This pattern continued throughout the year. A day before the ban was announced, a man lost his life to two dogs. He had been defending his mother from an attack, and was torn apart in his garden, defending her. A video surfaced online showing people attempting to throw bricks at the animals, but they continued to tear him apart, undaunted. Later in 2023, after the ban was announced, another man was killed by a Bully XL while walking his own dog. In 2024, even after the ban, the owners that have chosen to keep Bully XLs under the strict new conditions, face the threat within their home. As of this writing, two people have died: one, an elderly woman looking after the dogs for her son; the other an owner torn to pieces by the dogs she had raised from puppies. These are “just” fatalities. Non-lethal dog attacks on humans, often resulting in life-changing injuries, are also on the rise, increasing from 16,000 in 2018, to 22,000 in 2022, and hospitalizations have almost doubled from 4,699 in 2007 to 8,819 in 2021/22, a trend that continued in 2022/23 with 9,342 hospitalizations.2,3These cases make for difficult reading. Seventy percent of injuries on children were to the head; nearly 1 in 3 required an overnight stay. In Liverpool (a city of 500,000), there are 4–7 dog bites a week, with most injuries to the face. One doctor recounted dealing with a “near-decapitation.” In 2023 in London, the police were dealing with one dangerous dog incident per day.4We do not have reliable data on dogs attacking other dogs and pets, but I would wager those have increased as well. Yet, despite an increase in both the human and dog populations of the UK over the past four decades, fatalities have remained consistently low until just a few short years ago. **What’s going on?** Looking through the list of fatal dog attacks in the UK, a pattern becomes clear.5,6In 2021, 2 of the 4 UK fatalities were from a breed known as the American Bully XL. In 2022, 5 out of 10 were American Bullies.7In 2023, 5 fatalities of 9 were from American Bullies. In 2024, 2 of 3 deaths so far are from American Bully XLs kept by owners after the ban. In other words, without American Bullies, the dog fatalities list would drop to 5 for 2022 (within the usual consistent range we’ve seen for the past four decades), 4 for 2023 and 1 for 2024 so far. Again, this is “just” fatalities. We do not have accurate recordings of all attacks, but a concerning indication arises from Freedom of Information requests to police forces from across the UK. In August of 2023, 30 percent of all dogs seized by police—often due to violent attacks—were American Bullies. To put this in context, the similarly large Rottweiler breed accounted for just 2 percent. This pattern is seen elsewhere, in one other breed, the Pitbull—a very, very close relative of the American Bully. In the U.S., for example, 60–70 percent of dog fatalities are caused by Pitbulls and Pitbull crosses.8The very recent relatives of the American Bully are also responsible for the vast majority of dog-on-dog aggression (including bites, fatalities, etc.).9In the Netherlands, the majority of dogs seized by police for dog attacks on other dogs were Pitbull types.10The same is true nearly anywhere you look. In New York City, Pitbulls were responsible for the highest number of bites in 2022.11 Despite these figures, both in the UK and internationally, and the recent media attention dog attacks have received, if you were to argue that a breed was dangerous, you would receive significant pushback from owners, activists, and even animal charity organizations stating that it isthe owner’sfault. But this is wrong. While many would contend that “it’s the owner, not the breed,” the reality is different. **Designing Our Best Friend** Dogs—unlike humans—have been bred for various, very specific traits. Their traits, appearance, and behavior has been directed in a way comparable to how we’ve molded plant and other animal life over thousands of years. Watermelons and bananas used to be mostly seed; now they’re mostly flesh. Chickens were not always raised for their meat; now they are. These weren’t the natural course of evolution, but the result of humans intentionally directing evolution through deliberate cultivation or breeding. Modern-day dogs are very clearly also a result of such directed breeding. Broadly speaking, we selected dogs for traits that are very much unlike those of wolves. Unlike their wolf ancestors, dogs are, broadly, naturally loyal to humans, even beyond preserving their own lives and those of other dogs. Indeed, a trait such as this in dogs might actually have caused some of the original aesthetic changes to their original wolf-like appearance. When Russian scientists bred foxes over generations for “tameness” to humans, they found the foxes began to have different colored fur, floppy ears, and to look, well, more like domestic dogs (though there is some debate on this). Each dog breed has deep underlying propensities, desires, and drives for which we have selected them for generations. A key responsibility of dog ownership is to know your dog’s breed, understand its typical traits, and prepare for them. Not all individual dogs will exhibit these breed-specific traits, but most do, to varying degrees. Some hound breeds (Whippets, Greyhounds, etc.) have a prey drive and will chase or even try to kill small animals such as rabbits, even if those animals are kept as pets. Some breed-specific behavior can be trained out, but much of it can’t. Form follows function—breed-specific behavior has driven physical adaptations. Relative to other breeds, they have great vision (aptly, Greyhounds and Whippets belong to the type of dogs called “sighthounds”) and bodies that are lean and aerodynamic, with a higher ratio of muscle to fat relative to most other breeds, making them among the fastest animals on the planet, with racing Greyhounds reaching speeds up to 45 mph (72 km/h). Like many other hound breeds, they are ancient, bred for centuries to seek comfort in humans and to hunt only very specific animals, whether small vermin for Whippets and Greyhounds, or deer and wolves for the, well, Deerhounds and Wolfhounds. Hounds make fine family pets, having been bred to be highly affectionate to humans, as after all, you don’t want your hunting dog attacking you or your family. Labradors love to retrieve—especially in water, much to the displeasure of their owners who all too often find them diving into every puddle they encounter on their daily walks. Pointers point. Border Collies herd, and as many owners would note, their instinct can be so strong that they often herd children in their human family. Cocker Spaniels will run through bushes, nose to the ground, looking as if they are tracking or hunting even when just playing—even when they have never been on a hunt of any kind. Dogs are not the way they are by accident but, quite literally, by design. **Designing Bully-type Dogs** Bulldogs were originally bred to be set on a bull, and indiscriminately injure and maim the much larger animal until it died. (These dogs were longer-legged and much more agile and healthier than today’s English Bulldog breed—bred specifically for their now nonfunctional squat appearance.) After the “sport” of bull baiting was banned, some of these dogs were instead locked in a pen with large numbers of rats and scored on how many they could kill in a specified time, with often significant wagers placed on picking the winners. This newer “sport” required greater speed and agility, so the bulldogs of that time were interbred with various terriers to produce what were originally called, naturally, “Bull and Terriers.” From these would eventually come today’s Pitbull Terriers. In addition to this, some of the early Bull and Terriers began to be used for yet another “sport,” and one on which significant amounts of money were wagered—dog fighting. These were bred specifically for aggression. Two of these dogs would be put together in a closed pit to fight until only one came out alive. During their off hours, these fighting dogs were mostly kept in cages, away from humans. The winners, often seriously wounded themselves, were bred for their ability to kill the other dog before it could kill them. They were not bred for loyalty to humans—these were dogs bred for indiscriminate, sustained, and brutal violence in the confined quarters of the dog pit (hence the name, Pitbull Terrier). This explains why Pitbulls are responsible for 60–70 percent of deaths to dogs in the U.S. It is not—as some advocates state—a function of size. There are many larger and stronger breeds. Pitbulls are not the largest or the strongest dog breed, but—combinedwith their unique behavioral traits—they are large enough and strong enough to be the deadliest. While Pitbull and some Pitbull-type breeds have been banned in the UK under the Dangerous Dogs Act 1991, the American Bully XL was permitted due to a loophole in the law—simply put, this new breedexceededphysical characteristics of the banned breeds to the point they no longer applied under the law. It is that loophole that resulted in the recent rise of the American Bully XL, and the violence attendant to it. **(In)Breeding the American Bully XL** American Bully XLs are the heavyweight result of breeds born out of brutalhumanpractices that sculpted generations of dogs. The foundational stock for American Bully XLs were bred for terrifying violence and we should not be surprised to find that this new, more muscular and larger version still exhibits this same propensity. It is not the dogs’ fault any more than it is the fault of sighthounds to chase squirrels, or pointers to point. But that does not change the reality. The American Bully began in the late 1980s and early 1990s. At least one line started from champion “game dogs,” bred to endure repeated severe maiming and still continue to fight to the deadly end. To be a champion they must have killed at least one other dog in brutal combat. To further increase their size and strength, these game dogs were then bred with each other and with other Pitbulls. The UK original breeding stock that produced Bully XLs is extremely small. An investigation from one member of our campaign uncovered an absurd, awful reality: that at least 50 percent of American Bullies advertised for sale in the UK could trace their immediate or close lineage toone line and one single dog: Killer Kimbo.12,13 Killer Kimbo was infamous in Bully breeding circles. He was a huge animal and the result of extreme levels of inbreeding to create his mammoth size. He was so inbred that he had the same great grandfatherfour times over. It is this dog that has given rise to one of the most popular bloodlines within the UK. And what has been the result of heavily inbreeding dogs originating from fighting stock? While precise data are difficult to collect, at least one of Killer Kimbo’s offspring is known to have killed someone; other breeders recount stories of his offspringtrying to attack people in front of them. At least one death in the UK is a second-generation dog from Killer Kimbo stock. These are the dogs that were advertised and promoted as if they just looked large but had been bred responsibly for temperament. Indeed, many families bought these dogs thinking these were gentle giants—many have kept them even after the impositions of the ban, believing that a dog’s behavior is set only by their owners. After his own mother was killed by the Bullies he had kept, one owner in 2024 said:14 In fact, the breed was genetically constructed from fighting stock, inbred repeatedly for greater size and strength, shipped over to the UK skirting the Pitbull ban, and then advertised to families as if these dogs were the result of years of good breeding. **The Nanny Dog** In the UK, the Royal Society for the Prevention of Cruelty to Animals (RSPCA) has argued that no breeds are more inherently dangerous than others and leads a coalition to stop any breed bans, including the campaign to “Ban the Bully.” This is despite the fact that the RSPCA itself wouldnotinsure American Bullies on their own insurance policies, and that they separately advocate for the banning of cat breeds they consider to be too dangerous. The UK Bully Kennel Club (not to be confused with the similar sounding UK Kennel Club) describes the American Bully XL as having a “gentle personality and loving nature.” While the United Kennel Club does not recognize the American Bully XL breed, it describes the wider breed (i.e., not the XL variant) as “gentle and friendly,” and goes even a step further, recommending that the breed “makes an excellent family dog.” Again, the XL variant of this breed is responsible for the most fatalities of any dog breed in the UK in recent years, including for killing several children. Even more troubling is the fact that well-intentioned and potentially good owners are left at a severe disadvantage by the statements of advocates for Pitbulls and American Bullies. If an owner is aware of the breed’s past and the risks in their behaviors, they are far more likely to be able to anticipate issues and control the dog. For example, hound owners are generally aware that they will often have to emphasize recall in their dogs or keep them on a lead in non-fenced areas to prevent them from running off to chase squirrels or other small animals—it is a well-advertised trait. These preventive measures are taken very early, far before the dog may even be interested in chasing. However, owners of American Bullies would not be aware of the breed’s past were they to rely on the supportive advertising descriptions. They were actively told, from sources all over, that American Bullies are naturally good with kids and family, that they are naturally non-violent, and don’t pose any risk. Positive descriptions of American Bullies (and their XL variety) de-emphasized their violent tendencies and ran the very real risk of obfuscating future owners as to the aggressive traits of this breed and so prevented owners from correctly understanding and therefore controlling their dog appropriately. This encouraged ignorance from owners who are ill-equipped to handle their dog, such as the owner that saw her dog “Cookie-Doe” (related to Killer Kimbo) kill her father-in-law by ripping apart his leg. Her response? It wasn’t an aggressive dog, it just liked to “play too rough.” But for every owner like this, there are other experienced, diligent owners that nevertheless find themselves, or their children, under attack from one of these dogs. Worse still is the nickname of “nanny dog.” There is a myth among advocates for the breed that Pitbulls were once known as “nanny dogs” for their loyalty to children in the late 19th and early 20th centuries. However, this isn’t true. The name originates from Staffordshire Bull Terriers (not Pitbulls) that were named “nursemaid dogs” in a 1971New York Timespiece. There is no evidence of “nanny dog” or similar descriptions before this. Stories of 19th or early 20th century origins for the nickname are likely the result of advocates wanting to believe in a more family-oriented origin for the breed, rather than the cruel reality. We should not blame the dog breed for how they were bred, maintained, and for what they were selected for. They were bred out of cruel origins, inbred repeatedly, still face ear cropping, and some find themselves owned by individuals who select dogs for their ability to intimidate and attack. Nevertheless, none of this changes that violent, aggressive nature that has resulted from generations of breeding specifically for it. **(Some) Owners Bear Blame Too** American Bully XLs were not cheap, and this only began to change when our campaign started in full. At the lower end, they cost about the same as other dogs, but at the very higher end of the price range they were some of the most expensive dogs you could buy. Golden Retrievers, the archetypical family dog, are so desired that it is common for breeders to have long waiting lists for litters yet to be conceived. A typical cost for a Golden Retriever in the UK is around $2,600. American Bullies, at the height of their popularity, cost as much as $4,000 per puppy. The higher-end puppies were often accompanied by graphics involving violent metaphors and text written in horror movie-type “blood” fonts. Given this kind of marketing, what did some prospective owners think they were purchasing? Indeed, it bears asking what kind of owners were prepared to pay vast sums for a dog advertised in such a way. These dogs were clearly a status symbol for many—a large, aggressive, powerful animal to be used either for intimidation or self-defense. It is for this reason that many owners have their dog’s ears cropped to look yet more aggressive, a practice illegal under UK law, but still nonetheless practiced. Cropping ears and tails actually serves a purpose—though a brutal one. The other dog cannot bite on to the ear or tail and so gain control of its rival. The old bull baiting dogs used to go after the bull’s ears and noses. Cropping also prevents a human, engaged in defending themselves from a dog attack, from grabbing the tail or ears and using them to sling the dog off or up against a wall. This explains the popularity of these dogs, altered in such a way, amongst drug dealers and others involved in crime. **Opposition** The politics of banning the American Bully proved difficult. It took a public campaign both to convince a government that was generally averse to actions of any kind; as well as to stop the continued influence of a coalition of charities that was opposing any and all breed bans. These charities included the Dogs Trust, RSPCA, the UK Kennel Club, Battersea Dogs and Cats Home, and others. It might seem strange that these charities could argue against any breed bans, given the figures in fatalities from Bullies. Not only this, but these same charities supported the return of the Pitbull to the UK, even despite the decades of startling figures on their dramatic overrepresentation in fatalities. The reason for this is simple. There is no way to split fatality data so that it is favorable to Pitbulls (or, recently, XL Bullies). Instead, the charities focus chiefly on a different measure:bites.15This measure enables charities to claim that there is a problem with a great many dog breeds such as Labradors—which, in some calculations, bite the most people. On this measure, a mauling from a Bully XL that rips a child’s throat, or tears away an adult’s arm, and a bite on the hand from a chihuahua countthe same: they are eachone bite. It isn’t necessary to outline how inadequate and bankrupt this measure is. It is a shame on this entire sector that this was considered anything more than a smokescreen. It is, in my view, a true scandal that has provided a great deal of unintended cover for horrifying breeding practices, which in turn resulted in the horrific deaths of pets, adults, and children. Dog bites are not the public’s (orowners) chief concern: it is maulings, hospitalizations, and deaths. That is what we should focus on, and until the advocacy sector does so, it does not deserve to be taken seriously. **Banning the Breed** England and Wales have banned several breeds since the early 1990s. The Dangerous Dogs Act 1991 first banned Pitbulls, and then was amended to ban a further three breeds. The Act required little more than the signature of the relevant Secretary of State to add a new breed to the banned list. This Act prohibits the buying, selling, breeding, gifting, or otherwise transferring the ownership of any dog of a banned breed. All dogs in that breed are to be registered, neutered, as well as leashed and muzzled at all times in public. Not doing so or failing to register a dog of a banned breed, is a criminal offense. When the XL Bully ban was announced, all owners were given a few months to register their dogs, neuter them, and then muzzle and leash them in public. They were forbidden to sell them, give them away or abandon them. Scotland—as a devolved nation within the United Kingdom—announced they would not ban the American Bully, and this resulted in a great many Bullies being sent to Scotland to escape the ban. Within two weeks, and after a couple of prominent attacks, the Scottish government made a legal U-turn and announced a ban. When the new Northern Ireland government formed, their first act was to ban the American Bully. **The Effects of the Ban** The strength of the ban is twofold. On one hand, Bullies are less of a danger to pets and people than they were previously. They must now be muzzled and leashed in public—or owners face seizure of the dog by police and criminal sentences for themselves. However, as has been seen in recent months, this does not change the risk to owners or those that visit their homes. Allowing registered dogs to be kept by their owners means that this risk persists. It is a risk from which the public is shielded, however, it remains one that owners and those that visit them choose to take upon themselves. The other and key strength of the ban is in the future. Stopping the breeding and trading of Bullies means that there is a timer on their threat within Britain. They will not continue to future generations. We will not have to see more and more Bully variants, and yet worse breeding practices as breeders chase the latest trend, inbreeding for a particular coat color, the ever-increasing sizes, or the propensity for violence. Children will not have to be mauled; other dogs will not have to be ripped apart. We chose to stop this. Think a friend would enjoy this? Send it their way! Lawrence Newport holds a law degree, a master’s degree in rhetoric and argumentation, and a PhD in legal history. He has lectured in law at Royal Holloway, University of London. He currently serves as the campaign director of a nonprofit focused on mitigating extinction risks from artificial intelligence, provides campaign consultancy, and recently co-founded The Progress Project, which advocates for policy improvements in Britain. **Member Discussion** **Join the discussion** Become a paid member of Skepticto start commenting **Similar Articles** **OUR MISSION** To explore complex issues with careful analysis and help you make sense of the world. Nonpartisan. Reality-based. Join the Movement Donate Advertising Contact Pitch an Article Team **Modal Title** **Check your email** We’ve emailed you a magic link — click it to access your account. **Log In** **Check your email** We’ve emailed you a magic link — click it to access your account. **Popular Searches** skeptic research center pitbulls contact skeptics society katherine brodsky pitch an article"}