{"id": 25, "name": "ABC News Australia", "domain": "abc.net.au", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.abc.net.au/news/2025-06-07/callaghan-park-racecourse-rockhampton-racing-queensland-history/105369414", "title": "Callaghan Park Racecourse Rockhampton Racing Queensland History", "content": "Just In Australia Votes For You Politics World Business Analysis Sport Lifestyle Entertainment Search the news, stories & people Search the news, stories & people News HomeJust InAustralia VotesFor YouAnalysisRuralWatch LiveHealthIndigenousPoliticsScienceElectionsWorldEnvironmentInvestigationsBusinessFact CheckLocal news Just In Australia Votes For You Analysis Rural Watch Live Health Indigenous Politics Science Elections World Environment Investigations Business Fact Check Local news Just In Australia Votes For You Analysis Rural Watch Live Health Indigenous Politics Science Elections World Environment Investigations Business Fact Check Local news SportAFLNRLFootballTennisCricketNetball AFL NRL Football Tennis Cricket Netball AFL NRL Football Tennis Cricket Netball LifestyleWellbeingRelationships & FamilyFood & RecipesPersonal FinanceHome & Garden Wellbeing Relationships & Family Food & Recipes Personal Finance Home & Garden Wellbeing Relationships & Family Food & Recipes Personal Finance Home & Garden EntertainmentTV & MoviesBooksMusicPop CultureArts TV & Movies Books Music Pop Culture Arts TV & Movies Books Music Pop Culture Arts Personalise the news and stay in the know Facebook YouTube Instagram Twitter Emergency Emergency Emergency Emergency Backstory Backstory Backstory Backstory Newsletters Newsletters Newsletters Newsletters 中文新闻 中文新闻 中文新闻 中文新闻 BERITA BAHASA INDONESIA BERITA BAHASA INDONESIA BERITA BAHASA INDONESIA BERITA BAHASA INDONESIA TOK PISIN TOK PISIN TOK PISIN TOK PISIN ABC ABC iView ABC Listen Triple J ABC Kids ABC News **Rockhampton's Callaghan Park celebrates more than 125 years of racing** ABy Aaron Kelly By Aaron Kelly By Aaron Kelly By Aaron Kelly ABC Capricornia ABC Capricornia ABC Capricornia ABC Capricornia Topic:History Topic:History Topic:History Topic:History One of the earliest horse races held at Queensland's Callaghan Park racecourse.(Supplied: Rockhampton Jockey Club) Cut from scrub on the banks of a river at the end of the 19th century, a unique Australian racecourse boasts a history like no other. From a plane crash, crocodiles taking residence during extreme flood events and bachelor and spinster — or B&S — balls, Rockhampton's Callaghan Park in central Queensland has a rich and colourful past. The present location of the racecourse, a stone's throw from the mighty Fitzroy River, was established more than 125 years ago by a dapper group of racing folk. Thousands flocked to the track in 1899 for the first of many race meetings and social outings.(Supplied: Rockhampton Jockey Club) Rockhampton Jockey Club (RJC) chief executive David Aldred said 60 hectares of thick bushland was selected for the racecourse in 1898 for its proximity to the town centre. \"There were actually two racecourses in Rockhampton in those days, west of the CBD past Rockhampton Airport, but it was too far out of town to go to the races,\" Mr Aldred said. \"They picked this site beside the river and a team of guys were engaged to carve out the track from scrub and within a few months had a racetrack.\" Callaghan Park became a popular place for people to meet in the early 1900s.(Supplied: Rockhampton Jockey Club) The opening of Callaghan Park was celebrated with a two-day race meeting, the first of which was on June 2, 1899. \"They had 3,000 people each day for the first meeting, which is a big thing when you consider how those people had to get to the races,\" Mr Aldred said. A Bleriot monoplane raced a car around the track in 1912.(Supplied: Rockhampton Jockey Club) **Plane crash makes international headlines** The first properly constituted racing body in the Rockhampton region was the Fitzroy Jockey Club, formed in 1863, before the RJC was established in 1868. While horse racing is the club's bread and butter, colourful characters and international news stories also hold a place in Callaghan Park folklore. In 1912, a race around the track between a Bleriot monoplane and car attracted a crowd of 7,000 spectators. The race attracted a huge crowd, which was left stunned when the plane crashed.(Supplied: Rockhampton Jockey Club) The main attraction was Hollywood stunt man and famous American aviator Mr A.B. \"Wizard\" Stone. At the conclusion of the race on the final lap, the crowd was horrified to see the plane crash land on the nearby cricket ground. Mr Aldred said patrons rushed to the site and were relieved to see Mr Stone climb from the wreckage uninjured. Callaghan Park has seen many major floods over the years.(Supplied: Rockhampton Jockey Club) **Floods, frocks and crocs** The course has also endured times of hardship and tragedy. Major floods over the years have engulfed Callaghan Park. In the record 1991 Rockhampton flood, the grass track was completely destroyed and rebuilt with a new type of grass to better withstand weather events. The racetrack completely under water.(Supplied: Rockhampton Jockey Club) \"If you have a look at the water marks we've got engraved on the buildings downstairs, they've come up to the roof of those buildings,\" Mr Aldred said. In the 2011 floods, authorities had to issue warnings about marauding snakes and crocodiles in the murky, brown floodwaters around the course and surrounding flood-hit suburbs. From floods to frocks, Callaghan Park hosted modern B&S balls in the 1980s and 90s before growing concerns about insurance and liquor licensing saw events dry up. David Aldred has been exploring the history of Callaghan Park.(ABC Capricornia: Aaron Kelly) \"That's what people forget, racecourses are seven-day-a-week venues and we host a lot of events here,\" Mr Aldred said. \"It's a unique facility that has catered for a lot of interesting people over many, many years.\" **Racing royalty and cup winners** While Sydney's Royal Randwick racecourse is recognised as Australia's oldest key racing venue, established in 1833, Callaghan Park has also hosted racing royalty through the decades. Trainer Gai Waterhouse, world-class jockey Craig Williams and former Melbourne Cup winners have graced the popular country Queensland track. More than 125 years of history on display at Callaghan Park.(ABC Capricornia: Aaron Kelly) Racing Queensland acting chief executive Lachlan Murray said the venue was one of the state's oldest and most important regional racing hubs — hosting more than 30 meetings each year. \"Callaghan Park is at the coalface of racing in the region both on race day and as a vital training facility for in excess of 30 local trainers,\" Mr Murray said. Callaghan Park is still going strong after more than 125 years.(Supplied: Caught in the Act Photography CQ) \"Thoroughbred racing in the Rockhampton region also plays a significant role in the Central Queensland economy, contributing close to $70 million in value whilst supporting almost 450 full-time roles in the wider region. \"We look forward to another 125 years of gallopers thundering down the famous Callaghan Park straight.\" **ABC Capricornia — local news in your inbox** Copy link Facebook X (formerly Twitter) **Sport** **Aussies blow away South African top order in nine-wicket final session** Topic:Cricket Topic:Cricket **Five quick hits: Verreynne takes a screamer and Carey drops a sitter** Topic:Cricket Topic:Cricket **O'Callaghan opens up on the insular life of elite swimmers** Topic:Swimming Topic:Swimming **Soccer players demand ban on betting on yellow cards** Topic:Soccer Topic:Soccer **Socceroos' milestone man wanted to 'freeze time' after Saudi penalty save** Topic:Socceroos Topic:Socceroos **Top Stories** **US launches review into AUKUS submarine deal to ensure it's 'America First'** Topic:World Politics Topic:World Politics **Albanese-Trump meeting in limbo as Israeli cabinet sanctions trigger US rebuke** Topic:Foreign Affairs Topic:Foreign Affairs **Only four of 20 popular sunscreens passed CHOICE's SPF testing** Topic:Consumer Goods Topic:Consumer Goods **Parents urged to DNA test kids after second IVF error revealed** Topic:Reproductive Technology Topic:Reproductive Technology **Aussies blow away South African top order in nine-wicket final session** Topic:Cricket Topic:Cricket **Related stories** **Heartbroken partner of fallen jockey remembers how beautiful horsewoman 'died doing what she wanted to do'** Topic:Horse Racing Topic:Horse Racing **Singapore real estate prices are so shocking, the city-state is bulldozing this racecourse for the land** Topic:Housing Policy Topic:Housing Policy **Home is where the horse is as international race jockeys boost Racing Queensland's riding ranks** Topic:Sport Topic:Sport **Related topics** Clubs and Associations Clubs and Associations Clubs and Associations Clubs and Associations History History History History Horse Racing Horse Racing Horse Racing Horse Racing Human Interest Human Interest Human Interest Human Interest Rockhampton Rockhampton Rockhampton Rockhampton Sport Sport Sport Sport **Top Stories** US launches review into AUKUS submarine deal to ensure it's 'America First'Topic:World PoliticsPhoto showsA close up of Donald Trump's face as he looks over his shoulder with a casual expression. **US launches review into AUKUS submarine deal to ensure it's 'America First'** Topic:World Politics **US launches review into AUKUS submarine deal to ensure it's 'America First'** Topic:World Politics Topic:World Politics Albanese-Trump meeting in limbo as Israeli cabinet sanctions trigger US rebukeTopic:Foreign Affairs **Albanese-Trump meeting in limbo as Israeli cabinet sanctions trigger US rebuke** Topic:Foreign Affairs **Albanese-Trump meeting in limbo as Israeli cabinet sanctions trigger US rebuke** Topic:Foreign Affairs Topic:Foreign Affairs Only four of 20 popular sunscreens passed CHOICE's SPF testingTopic:Consumer Goods **Only four of 20 popular sunscreens passed CHOICE's SPF testing** Topic:Consumer Goods **Only four of 20 popular sunscreens passed CHOICE's SPF testing** Topic:Consumer Goods Topic:Consumer Goods Parents urged to DNA test kids after second IVF error revealedTopic:Reproductive Technology **Parents urged to DNA test kids after second IVF error revealed** Topic:Reproductive Technology **Parents urged to DNA test kids after second IVF error revealed** Topic:Reproductive Technology Topic:Reproductive Technology Aussies blow away South African top order in nine-wicket final sessionTopic:Cricket **Aussies blow away South African top order in nine-wicket final session** Topic:Cricket **Aussies blow away South African top order in nine-wicket final session** Topic:Cricket Topic:Cricket **Just In** **Just In** Dam should be demolished over blue-green algae concerns, residents sayTopic:Water8m ago8 minutes agoWed 11 Jun 2025 at 9:27pm **Dam should be demolished over blue-green algae concerns, residents say** Topic:Water **Dam should be demolished over blue-green algae concerns, residents say** Topic:Water Topic:Water O'Callaghan opens up on the insular life of elite swimmersTopic:Swimming14m ago14 minutes agoWed 11 Jun 2025 at 9:21pm **O'Callaghan opens up on the insular life of elite swimmers** Topic:Swimming **O'Callaghan opens up on the insular life of elite swimmers** Topic:Swimming Topic:Swimming AUKUS 'all or nothing' for Australia, ex-ambassador warns amid US reviewLIVE16m ago16 minutes agoWed 11 Jun 2025 at 9:19pm **AUKUS 'all or nothing' for Australia, ex-ambassador warns amid US review** LIVE **AUKUS 'all or nothing' for Australia, ex-ambassador warns amid US review** LIVE Symmie died at just 10. Her parents say a CT scan might have saved herTopic:Children's Health20m ago20 minutes agoWed 11 Jun 2025 at 9:14pm **Symmie died at just 10. Her parents say a CT scan might have saved her** Topic:Children's Health **Symmie died at just 10. Her parents say a CT scan might have saved her** Topic:Children's Health Topic:Children's Health **Footer** We acknowledge Aboriginal and Torres Strait Islander peoples as the First Australians and Traditional Custodians of the lands where we live, learn, and work. **Sections** ABC NEWS Just In Watch Live Politics World Business Analysis Sport Science Health Entertainment Lifestyle Fact Check Other **News in language** 中文 Berita Bahasa Indonesia Tok Pisin **Connect with ABC News** Facebook Instagram YouTube Apple News X (formerly Twitter) **More from ABC News** Contact ABC NEWS This service may include material from Agence France-Presse (AFP), APTN, Reuters, AAP, CNN and the BBC World Service which is copyright and cannot be reproduced. AEST= Australian Eastern Standard Time which is 10 hours ahead of GMT (Greenwich Mean Time) Editorial Policies Accessibility Help Contact Us About the ABC Privacy Policy Terms of Use © 2025 ABC"}