{"id": 710, "name": "Japan Times", "domain": "japantimes.co.jp", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.japantimes.co.jp/environment/2025/06/04/climate-change/swiss-glacier-climate-disaster-management/", "title": "Swiss Glacier Climate Disaster Management", "content": "SubscribeDigitalPrint Subscribe Japan elections Rice crisis War in Ukraine Latest News Today's print edition Home Delivery JAPANPoliticsSocietyCrime & LegalScience & HealthExplainerHistory Politics Society Crime & Legal Science & Health Explainer History Politics Society Crime & Legal Science & Health Explainer History WORLDPoliticsCrime & LegalScience & HealthSociety Politics Crime & Legal Science & Health Society Politics Crime & Legal Science & Health Society ASIA PACIFICPoliticsCrime & LegalScience & HealthSociety Politics Crime & Legal Science & Health Society Politics Crime & Legal Science & Health Society BUSINESSCompaniesEconomyMarketsTech Companies Economy Markets Tech Companies Economy Markets Tech SPORTSSumoSoccerBaseballBasketballTennisOlympicsMore sports Sumo Soccer Baseball Basketball Tennis Olympics More sports Sumo Soccer Baseball Basketball Tennis Olympics More sports OPINIONEditorialsCommentary Editorials Commentary Editorials Commentary EnvironmentCLIMATE CHANGEEnergySUSTAINABILITYWILDLIFEEARTH SCIENCE CLIMATE CHANGE Energy SUSTAINABILITY WILDLIFE EARTH SCIENCE CLIMATE CHANGE Energy SUSTAINABILITY WILDLIFE EARTH SCIENCE LIFETravelDigitalFood & DrinkStyle & DesignLanguageLifestyle Travel Digital Food & Drink Style & Design Language Lifestyle Travel Digital Food & Drink Style & Design Language Lifestyle CULTUREFilmBooksMusicArtTV & StreamingStageEntertainment news Film Books Music Art TV & Streaming Stage Entertainment news Film Books Music Art TV & Streaming Stage Entertainment news COMMUNITYVoicesIssuesHow-tosOur Lives Voices Issues How-tos Our Lives Voices Issues How-tos Our Lives My Account My Bookmarks Logout **Swiss glacier collapse is a lesson on climate disaster management** A Swiss mountain slope bursting and unleashing a cascade of rocks and ice over an idyllic Alpine village last week was a chilling image, but also the symbol of a well-managed climate crisis. The collapse of the Birch glacier in the Swiss Alps was an expected disaster. Authorities and scientists had been monitoring the area closely and when the first signs of instability started to appear, over a week before the event, they evacuated the town of Blatten, on the valley below the glacier. The landslide obliterated about 90% of the village and one person is missing, according to Swiss authorities. \"It was the least worst scenario — any loss of property or homes is a tragedy, but they were prepared for it,” said Rachel Carr, a glaciologist at the University of Newcastle in the U.K. \"We can at least manage the threat of the loss of life, we need to at least do that.” Yet not all countries are able to respond as effectively to such disasters. Billions of people globally live downstream from glaciers and at least 15 million are directly exposed to floods from glacial lakes bursting, according to a 2023 research paper co-authored by Carr. Glaciers have melted at the fastest pace on record this decade, leading to an increase of lakes that can burst any time, unleashing hundreds of tons of rocks and ice, together with landslides and floods that destroy everything on their path. \"We see the highest risk in the Himalayas and the Andes, where people have a strong dependence on subsistence agriculture,” said Carr, speaking on the phone from Bhutan. A lake outburst or a glacier collapsing can \"take out their yaks, their grazing land and their capacity to generate food and money for years to come.” Human settlements in many high mountain areas are days away from the nearest road, so bringing in materials to rebuild can take years, said Carr, whose current research focuses on helping set up sensors to monitor glaciers in Bhutan, one of the world's few carbon negative countries, which also has some of the fastest-retreating glaciers in the world. Glaciers are a thick layer of ice that has eroded the mountain for centuries. They often act like a containment wall, holding rocks and mud together. When the glacier melts, it becomes thinner until eventually it can’t hold the mountain anymore and it collapses. At the same time, permafrost, the frozen ground present in high mountain environments, is thawing fast, making terrains more unstable. These events are made worse by climate change, and they played a role in the collapse of the Birch glacier, said Jean-Baptiste Bosson, a glaciologist and the director of nature preservation non-profit Marge Sauvage. Establishing a direct link between the event and climate change is difficult, if not impossible, but it seems likely that it played a role in the event, Swiss researchers said in a note. When Birch collapsed, Bosson was in Dushanbe, Tajikistan, attending the first-ever United Nations-sponsored glacier conference. Suddenly, glaciologists there saw their field of study become front page news and felt like the calls for action they had been repeating for decades would be listened to. The conference ended with a final declaration highlighting the need to protect glaciers as climate change advances, and to monitor them to prepare for hazards. It also called on governments and finance institutions to fund these efforts and contribute to a glacier preservation fund coordinated by the U.N. Tajikistan made an initial contribution of $100,000 and no additional funding has been announced, although several countries have expressed interest, according to a spokesperson from the U.N.’s World Meteorological Organization. \"I’m a bit disappointed — there are no heads of state here” beyond Tajikistan’s, Bosson said. \"Glaciers are melting and we have to do something, but no one put on the table real, effective solutions.” Wealthy countries including France or Switzerland have their own programs and are watching dozens of glaciers with drones, satellites, sensors and measurements on the ground. Even with these advanced methods it’s impossible to predict which glacier will collapse next, said Daniel Farinotti, a glaciologist at the Swiss Federal Institute of Technology in Zurich. \"I would pay a lot of money in order to be able to answer this question,” Farinotti said. \"We don’t know why this particular glacier happened to fall down at that particular moment in time.” The vast amounts of data and images from the collapse of the Birch glacier will allow researchers to reconstruct the event, he said. \"But we are not able to predict one of these the same way we can predict meteorological conditions three days ahead because the conditions are so complex. We try hard, though.” Authorities can do more than monitoring. In France, the Tete-Rousse glacier is under watch since scientists discovered the equivalent of twenty Olympic swimming pools of water were held underneath the ice. Between 2,000 and 3,000 people in the Haute Savoie region could be affected if that glacier collapses, according to local media. Over the past 15 years, some water has been pumped from underneath the glacier, an alarm system has been set up across the valley and construction in vulnerable areas has been restricted. Swiss authorities were already thinking about next steps just hours after Blatten was engulfed in ice and rock. At a press conference with emergency authorities in the area last Wednesday, the mayor of Blatten, Matthias Bellwald, appeared moved as he addressed journalists and the community. \"The village is under rubble, but we will rebuild it,” Bellwald said. \"This will take a long, long time, we will require help and support, but the glacier can’t collapse twice.” **KEYWORDS** In a time of both misinformation and too much information,quality journalism is more crucial than ever.By subscribing, you can help us get the story right. With your current subscription plan you can comment on stories. However, before writing your first comment, please create a display name in the Profile section ofyour subscriber account page. Your subscription plan doesn't allow commenting. To learn more see ourFAQ WHAT’S TRENDING Editors' Picks **Our Planet** **Podcast** **Longform** **SUSTAINABLE JAPAN** **SPECIAL SUPPLEMENTS** Sponsored contents planned and edited by JT Media Enterprise Division. 広告出稿に関するおといあわせはこちらまで Read more **SUPPLEMENTS BINDER** Bridges by SMS Global Insight GMI Post World Eye Reports **Latest News** products & services Print subscriptions Group subscriptions Student subscription JT Digital Archives Epaper Edition RSS feeds help & support Support FAQs Link policy Republishing Contact us about us Company info Privacy policy Link policy Announcements Work with us Advertise with us Press releases our sites The Japan Times Alpha JT Bookclub The Japan Times Jobs Education In Japan Classifieds Public notices Disaster information Comfacts our activities Sustainable Japan Destination Restaurants Satoyama Consortium ESG Consortium"}