{"id": 1695, "name": "Covid Call to Humanity", "domain": "covidcalltohumanity.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://covidcalltohumanity.org/2025/05/09/why-trump-is-a-murdering-hypocrite-supporting-genocide-and-destroying-free-speech-in-america-while-claiming-to-be-a-man-of-peace/", "title": "Why Trump Is A Murdering Hypocrite Supporting Genocide And Destroying Free Speech In America While Claiming To Be A Man Of Peace", "content": "Home About Navigating the website Global Philippines Perlas Videos and Articles Archives **Why Trump is a Murdering Hypocrite Supporting Genocide and Destroying Free Speech in America while Claiming to be a Man of Peace** First, most of his Cabinet appointees are ardent, some even fanatical. Zionists. This indicated that Trump will not drain the swamp; he was part of the swamp. Then, Trump started making contradictory comments and displayed his neo-colonial empire building intentions starting with Panama, Canada, and Greenland, among others. See the CCH articles here.1 Then, he declared that he was a man of peace while bombing the hell out of the Houthis in Yemen. The Hourthis threatened to resume their disruptions in the waters near Israel because the Zionist government of Netanyahu were continuing genocide by other means. The Israeli government blocked food aid to Palestinian war victims. Trump, the man of peace, preferred to genocide by Israel to continue and bombed the Houthis for many weeks, but without much success. Trump’s actions in the past weeks and months has, unfortunately, confirmed the predictions of CCH. The wars in Ukraine, Russia, Gaza and neighboring countries will only intensify. Trump speaks with a forked tongue while the world continues to escalate towards a global war. View these videos for the evidence of the brief analysis above. Why Criticizing Israel Isn’t Anti-Semitic – Jeffrey Sachs Interview Col Doug Magregor: It’s UKRAINE Prolonging this WAR Candace Owens CALLS OUT Trump! Meanwhile, it is important that an increasing number of his influential MAGA supporters have slowly criticized Trump. See the video of Candaca Owens cited above and the second half of the Kim Iversen video also referred to above. But not Alex Jones. He continues to kiss the ​**s of Trump, destroying his reputation in the process. See here on Alex Jones.2 **Resources** https://covidcalltohumanity.org/2024/11/15/is-trump-for-real-will-he-betray-his-massive-maga-followers-and-the-world/;https://covidcalltohumanity.org/2024/12/04/trump-will-not-drain-the-swamp-he-is-part-of-the-swamp-he-will-bring-war-and-betray-his-domestic-agenda-in-the-process/;https://covidcalltohumanity.org/2024/12/05/why-trumps-genocidal-zionist-loving-cabinet-will-destroy-trumps-domestic-agenda-and-plunge-the-world-into-war/;https://covidcalltohumanity.org/2025/02/18/trump-dr-jekyll-mr-hyde-sowing-chaos-in-the-world/; and here,https://covidcalltohumanity.org/2025/02/23/confused-or-alarmed-by-trumps-foreign-policy-understand-the-imperial-mindset-and-hubris-of-the-us-a-clear-and-powerful-indictment-of-the-us-empire-by-jeffrey-sachs/↩︎ https://covidcalltohumanity.org/2024/11/15/is-alex-jones-blinded-by-power-is-he-becoming-a-trump-puppet/;https://covidcalltohumanity.org/2025/02/27/beware-alex-jones-does-not-walk-his-talk-he-is-a-disservice-to-his-audience-and-is-destroying-his-hard-earned-reputation-he-is-no-longer-a-reliable-source-of-news/; andhttps://covidcalltohumanity.org/2025/03/10/alex-jones-continues-disinformation-campaign-for-trump-administratio↩︎ **Read Online** Click the button below if you wish to read the article on the website where it was originally published. Visit Website Visit Website **Read Offline** Click the button below if you wish to read the article offline. Download PDF Download PDF **Post navigation** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. Δ **Post Archives** **Categories** **Archives**"}