{"id": 1255, "name": "Sherwood News", "domain": "sherwood.news", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://sherwood.news/business/fords-sales-climbed-16-in-may-but-its-discounts-probably-wont-be-around-much/", "title": "Fords Sales Climbed 16 In May But Its Discounts Probably Wont Be Around Much", "content": "Fordshares rose more than 2% on Tuesday following the F-150 maker’s May sales report. Ford sold 220,959 vehicles in the US in May, up 16.3% from the same month last year (and up nearly 6% from April). It’s the third consecutive month of double-digit sales bumps for Ford, which posted increases of 16.2% in April and 19% in March. The automaker has been offering employee pricing discountssince early April, when President Trump’s 25% auto tariffs went into effect. Ford, which imports about a fifth of its vehicles sold in the US, hasextended those discountsthrough July 4, but has basically said“no promises”to extensive price hikes after that. Barring tariff relief, that will probably mean one more month of boosted sales before the trade war hammer drops. **More Business** **Ford says employee pricing discount campaign boosted US market share by nearly 2 points** **Ford says employee pricing discount campaign boosted US market share by nearly 2 points** A lesson to automakers: if you make it cheaper, they will come. At Wednesday morning’s Deutsche Bank global auto conference,Ford’spresident ofFord Blue and Ford Model e, Andrew Frick, said the F-150 maker saw its US market share spike nearly two points in the 60 days after itinstituted its employee pricing discountprogram. According to Frick, Ford’s US share is 14.7% as of the end of May, up 1.9% from last year. Ford began the promotion in early April, when President Trump’s 25% auto tariff took effect. “A lot of times in this industry we fight for tenths of [market] share, and to have a 1.9% increase year over year was very strong. And we did it with our profit pillars,” Frick said, adding that Ford trucks saw their bestsales monthin two decades. More than 80% of the vehicles Ford sells in the US are built here, compared to 54% for rivalGM. Ford has said it will end the employee pricing discount —and potentially start raising prices— following the July 4 holiday. Treasuries. Hardware. Collectibles. Games. In that order. Treasuries. Hardware. Collectibles. Games. In that order. GMannouncedTuesday evening it plans to invest $4 billion into three US plants in Michigan, Kansas, and Tennessee. The investment, which largely boosts production of gas-powered vehicles, will come over the next two years. As part of the investment, GM will move production of its gas-powered Chevrolet Blazer and Chevrolet Equinox from Mexico to the US by 2027. It’s a relatively small price to pay for GM, which earlier this year said tariffs would cost it $5 billion in 2025. The automakerimported about 900,000 vehiclesfrom Mexico last year, and 46% of its US saleswere imports. **FanDuel puts $0.50 surcharge on bets in Illinois** **FanDuel puts $0.50 surcharge on bets in Illinois** Flutter Entertainment’sFanDuel is rolling out a new $0.50 fee on bets placed in Illinois to help absorb the state’ssurprise sports betting tax hike. The new tax applies to each wager a sportsbook accepts, starting at $0.25 per bet for the first 20 million wagers and rising to $0.50 after that. Shares of Flutter and rivalDraftKingsboth dropped earlier this month after Illinois lawmakers approved asteep tax hikeof over 50% for high-volume gambling operators. Together, FanDuel and DraftKings make up nearly 75% of the state’s sports betting market. Flutter said it would remove the new fee if Illinois were to roll back the tax increase. DraftKing (which jumped over 2% on the news) hasn’t yet rolled out fee hikes but said it’s evaluating options. Flutter shares are up about 4% year to date. **FanDuel adds 50-cent surcharge on Illinois bets to offset state taxes, DraftKings may follow** **FanDuel adds 50-cent surcharge on Illinois bets to offset state taxes, DraftKings may follow** Shares of Flutter and rivalDraftKingsboth dropped earlier this month after Illinois lawmakers approved asteep tax hikeof over 50% for high-volume gambling operators. Together, FanDuel and DraftKings make up nearly 75% of the state’s sports betting market. Flutter said it would remove the new fee if Illinois were to roll back the tax increase. DraftKing (which jumped over 2% on the news) hasn’t yet rolled out fee hikes but said it’s evaluating options. Flutter shares are up about 4% year to date. **Eli Lilly’s telehealth deals require platforms to stop compounding GLP-1s, CFO says** **Eli Lilly’s telehealth deals require platforms to stop compounding GLP-1s, CFO says** Telehealth companies have to stop compounding GLP-1s if they want access to branded Zepbound, Lilly’s CFO said on Tuesday. **Latest Stories** Privacy Notice Disclosures Terms and Conditions Editorial Standards Masthead Your Privacy Choices Advertising Disclaimers"}