{"id": 1587, "name": "CityNews - Winnipeg", "domain": "winnipeg.citynews.ca", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://winnipeg.citynews.ca/video/2025/06/11/mcleod-the-architect-crown-begins-closing-argument-in-hockey-player-sex-assault-trial/", "title": "Mcleod The Architect Crown Begins Closing Argument In Hockey Player Sex Assault Trial", "content": "Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAbout UsOur Team About Us Our Team About Us Our Team ContactContact Us Contact Us Contact Us Submit a News Tip NewsAllLocalCanadaWorld Local Canada World Local Canada World WatchAllLatest Videos Latest Videos Latest Videos Weather WinnipegAllWinnipegCalgaryEdmontonHalifaxKitchenerMontrealOttawaTorontoVancouverWinnipeg Winnipeg Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg Winnipeg Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg AboutAllAbout UsOur Team About Us Our Team About Us Our Team ContactAllContact Us Contact Us Contact Us Submit a News Tip **Live Streaming** **Live Streaming 24/7** **McLeod the 'architect': Crown begins closing argument in hockey player sex assault trial** **Recommended Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago **Recommended Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Elon Musk says some of his social media posts about Donald Trump 'went too far' as the billionaires' breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won't be back down on efforts to confront any violence. 1h ago **Latest Videos** A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that – despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 13m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago In her closing argument, the Crown prosecutor took aim at Michael McLeod, accusing him of being the architect behind the alleged sexual assaults. Michelle Mackey reports. 12m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Elon Musk says some of his social media posts about Donald Trump ‘went too far’ as the billionaires’ breakup played out online. Brandon Choghri with a look at the fiery feud, as Trump speaks out about the split. 12m ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 1h ago Immigration protests that began in Los Angeles keep spreading to other American cities. As Michael Yoshida explains, the Trump administration is signaling it won’t be back down on efforts to confront any violence. 1h ago Get the CityNews AppNow New and Improved! Watch CityNews Winnipeg, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Watch CityNews Winnipeg, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. **Get the CityNews App** Now New and Improved! Watch CityNews Winnipeg, and get up-to-the-minute breaking-news alerts, traffic, weather and video from CityNews anywhere you are – across all Android and iOS devices. Apple Store Google Store About Us News Policy Contact CityNews Winnipeg Privacy Policy Ad Choices Terms of Service Advertise With Us Political Ads Registry"}