{"id": 1872, "name": "American Crime Journal", "domain": "americancrimejournal.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://americancrimejournal.com/https-americancrimejournal-com-wp-admin-revision-phprevision6241gutenbergtrueacj-obtains-livestream-of-coco-berthmann-asking-for-donations-detailing-cancer-diagnosis/", "title": "Https Americancrimejournal Com Wp Admin Revision Phprevision6241gutenbergtrueacj Obtains Livestream Of Coco Berthmann Asking For Donations Detailing Cancer Diagnosis", "content": "Announcement ACJ InvestigatesDerailed: Operation Underground Railroad (O.U.R.)Operation Underground RailroadThe Whiteboard MeetingThe Disappearance of Karlie GuseI-65 Killer/Days Inn MurdersBREAKING: I-65 Serial Killer IdentifiedTrafficked: The Human Trafficking Hoax Derailed: Operation Underground Railroad (O.U.R.)Operation Underground RailroadThe Whiteboard Meeting Operation Underground Railroad The Whiteboard Meeting The Disappearance of Karlie Guse I-65 Killer/Days Inn MurdersBREAKING: I-65 Serial Killer Identified BREAKING: I-65 Serial Killer Identified Trafficked: The Human Trafficking Hoax Derailed: Operation Underground Railroad (O.U.R.)Operation Underground RailroadThe Whiteboard Meeting Operation Underground Railroad The Whiteboard Meeting Operation Underground Railroad The Whiteboard Meeting The Disappearance of Karlie Guse I-65 Killer/Days Inn MurdersBREAKING: I-65 Serial Killer Identified BREAKING: I-65 Serial Killer Identified BREAKING: I-65 Serial Killer Identified Trafficked: The Human Trafficking Hoax Crime & Justice News Our MissionACJ in MediaDamion MooreLynn PackerDr. Laura RobinsonContactAdvertise with Us! ACJ in Media Damion Moore Lynn Packer Dr. Laura Robinson Contact Advertise with Us! ACJ in Media Damion Moore Lynn Packer Dr. Laura Robinson Contact Advertise with Us! The Lauren DesJardine ACJ Society Wall **American Crime Journal |** For a Better Informed Public INFOOur MissionACJ in MediaDamion MooreLynn PackerAdvertise with UsContact Our MissionACJ in MediaDamion MooreLynn PackerAdvertise with Us ACJ in Media Damion Moore Lynn Packer Advertise with Us Contact Our MissionACJ in MediaDamion MooreLynn PackerAdvertise with Us ACJ in Media Damion Moore Lynn Packer Advertise with Us ACJ in Media Damion Moore Lynn Packer Advertise with Us Contact Crime & Justice NewsCold CaseThe MissingEndangeredThe MissingUnidentified PersonMurderChi Crime TimesCrime & Justice News Cold CaseThe MissingEndangeredThe MissingUnidentified PersonMurder The MissingEndangeredThe MissingUnidentified Person Endangered The Missing Unidentified Person Murder Chi Crime Times Crime & Justice News Cold CaseThe MissingEndangeredThe MissingUnidentified PersonMurder The MissingEndangeredThe MissingUnidentified Person Endangered The Missing Unidentified Person Murder The MissingEndangeredThe MissingUnidentified Person Endangered The Missing Unidentified Person Endangered The Missing Unidentified Person Murder Chi Crime Times Crime & Justice News I-65 Serial KillerBREAKING: I-65 Serial Killer IdentifiedCompositesWanted Poster I-65 Killer 1991Columbus Composite 1990Envoy Inn CompositeBurger Chef Murders CompositesI-65 Serial Killer/Days Inn MurdersConfirmed Victims (DNA)Murder of Vicki HeathThe Days Inn Murders: Margaret Mary “Peggy” GillThe Days Inn Murders: Jeanne GilbertDays Inn Columbus, Indiana Assault 1990Rochester Assault 1991Suspected VictimsMurder of Lois “Evelyn” WrightMurder of James WaltonThe Murder of Victoria Harshman BREAKING: I-65 Serial Killer Identified CompositesWanted Poster I-65 Killer 1991Columbus Composite 1990Envoy Inn CompositeBurger Chef Murders Composites Wanted Poster I-65 Killer 1991 Columbus Composite 1990 Envoy Inn Composite Burger Chef Murders Composites I-65 Serial Killer/Days Inn Murders Confirmed Victims (DNA)Murder of Vicki HeathThe Days Inn Murders: Margaret Mary “Peggy” GillThe Days Inn Murders: Jeanne GilbertDays Inn Columbus, Indiana Assault 1990Rochester Assault 1991 Murder of Vicki Heath The Days Inn Murders: Margaret Mary “Peggy” Gill The Days Inn Murders: Jeanne Gilbert Days Inn Columbus, Indiana Assault 1990 Rochester Assault 1991 Suspected VictimsMurder of Lois “Evelyn” WrightMurder of James WaltonThe Murder of Victoria Harshman Murder of Lois “Evelyn” Wright Murder of James Walton The Murder of Victoria Harshman BREAKING: I-65 Serial Killer Identified CompositesWanted Poster I-65 Killer 1991Columbus Composite 1990Envoy Inn CompositeBurger Chef Murders Composites Wanted Poster I-65 Killer 1991 Columbus Composite 1990 Envoy Inn Composite Burger Chef Murders Composites Wanted Poster I-65 Killer 1991 Columbus Composite 1990 Envoy Inn Composite Burger Chef Murders Composites I-65 Serial Killer/Days Inn Murders Confirmed Victims (DNA)Murder of Vicki HeathThe Days Inn Murders: Margaret Mary “Peggy” GillThe Days Inn Murders: Jeanne GilbertDays Inn Columbus, Indiana Assault 1990Rochester Assault 1991 Murder of Vicki Heath The Days Inn Murders: Margaret Mary “Peggy” Gill The Days Inn Murders: Jeanne Gilbert Days Inn Columbus, Indiana Assault 1990 Rochester Assault 1991 Murder of Vicki Heath The Days Inn Murders: Margaret Mary “Peggy” Gill The Days Inn Murders: Jeanne Gilbert Days Inn Columbus, Indiana Assault 1990 Rochester Assault 1991 Suspected VictimsMurder of Lois “Evelyn” WrightMurder of James WaltonThe Murder of Victoria Harshman Murder of Lois “Evelyn” Wright Murder of James Walton The Murder of Victoria Harshman Murder of Lois “Evelyn” Wright Murder of James Walton The Murder of Victoria Harshman Derailed: O.U.R.O.U.R.’s Origin MythSound of FreedomDavis County Criminal InvestigationLawsuits Against Ballard/O.U.R.Lawsuit against Tim Ballard and Operation Underground RailroadSecond lawsuit against Tim Ballard, OUR & othersRighter v. Ballard & O.U.R.Whitehead v. AG Reyes & O.U.R.Suarez Moya v. Tim Ballard & O.U.R.Operation Underground RailroadThe Whiteboard MeetingLas Vegas Metropolitan PD Human Trafficking Task Force calls out O.U.R.Ballard’s Separation Agreement from O.U.R. O.U.R.’s Origin Myth Sound of Freedom Davis County Criminal Investigation Lawsuits Against Ballard/O.U.R.Lawsuit against Tim Ballard and Operation Underground RailroadSecond lawsuit against Tim Ballard, OUR & othersRighter v. Ballard & O.U.R.Whitehead v. AG Reyes & O.U.R.Suarez Moya v. Tim Ballard & O.U.R. Lawsuit against Tim Ballard and Operation Underground Railroad Second lawsuit against Tim Ballard, OUR & others Righter v. Ballard & O.U.R. Whitehead v. AG Reyes & O.U.R. Suarez Moya v. Tim Ballard & O.U.R. Operation Underground Railroad The Whiteboard Meeting Las Vegas Metropolitan PD Human Trafficking Task Force calls out O.U.R. Ballard’s Separation Agreement from O.U.R. O.U.R.’s Origin Myth Sound of Freedom Davis County Criminal Investigation Lawsuits Against Ballard/O.U.R.Lawsuit against Tim Ballard and Operation Underground RailroadSecond lawsuit against Tim Ballard, OUR & othersRighter v. Ballard & O.U.R.Whitehead v. AG Reyes & O.U.R.Suarez Moya v. Tim Ballard & O.U.R. Lawsuit against Tim Ballard and Operation Underground Railroad Second lawsuit against Tim Ballard, OUR & others Righter v. Ballard & O.U.R. Whitehead v. AG Reyes & O.U.R. Suarez Moya v. Tim Ballard & O.U.R. Lawsuit against Tim Ballard and Operation Underground Railroad Second lawsuit against Tim Ballard, OUR & others Righter v. Ballard & O.U.R. Whitehead v. AG Reyes & O.U.R. Suarez Moya v. Tim Ballard & O.U.R. Operation Underground Railroad The Whiteboard Meeting Las Vegas Metropolitan PD Human Trafficking Task Force calls out O.U.R. Ballard’s Separation Agreement from O.U.R. The Disappearance of Karlie Guse Collateral Damage Editorial **ACJ Obtains Livestream of Coco Berthmann Asking for Donations, Detailing Cancer Diagnosis** **ACJ has obtained Coco Berthmann’s February 5, 2022, Instagram livestream from a follower who“knew something was off”and decided to hit record. In the 13-minute video, Berthmann reveals her cancer diagnosis and prognosis, her symptoms, pain, and the struggles ahead. She also “feels bad for asking” for help in any kind of “financial way”.** Fool me once, shame on you. Fool me twice? According to a press releaseby police, the creator of Coco Berthmann’s GoFundMe claimed she [Berthmann] never asked her for money but“had expressed financial concerns… due to the treatments being expensive.” Her February 5, 2022, Instagram livestream says otherwise. American Crime Journal was able to secure a recording of the livestream from a source who wishes to remain confidential, we’ll call her “Maria”. She had originally been following Berthmann’s story and was slightly suspicious and admits she had not donated to Berthmann or her foundation because she “never trusted where that money would be going”. Maria said,“when the cancer claims popped up, something in me said to just screen shot and record everything. So, I did” She revealed that she had seen Lynn Packer’sreports on Coco Berthmann, debunking her fantastic human trafficking story. LikeElizabeth Frazier, Coco briefly kept a low profile, but last month began asking her followers for donations to adopt a dog. We began getting messages from concerned and angry followers who felt that Berthmann had not addressed the report or taken it seriously. Many of the were former donors. Late last month, Berthmann was at it again, she had taken to Instagram revealing more horrible news. According to Maria,“Iimmediately knew something was off, though even before then, and especially after the hoax reports came out in August, I didn’t believe most of what she said. I felt like no one took it seriously. It was completely mind blowing to me that no one was talking about it” I agree. While some took articles and videos down, not a single one issued a public statement outside Lynn Packer’s original reports onCoco BerthmannandElizabeth Fraiser. Here is a one-minute clip of Coco’s cancer claims, we will release the full video tomorrow. Roughly a month ago, dozens of people- mostly former supporters of Coco Berthmann reached out letting us know she had finished taking a break from advocacy against the$154 Trillion a year human trafficking industry(yes, she claims the industry is three quarters of the Gross World Product) and was seeking donations once again. First, she was seeking donor money to adopt a dog, then it quickly evolved into cancer. What is more concerning, is the fact that I contacted over a dozen publications, podcasts and human trafficking advocacy groups and just a few have since pulled their coverage and reporting of the “Coco Berthmann Sex Trafficking Survivor Story” (which seems like a rejected Lifetime Movie script). The Elizabeth SmartFoundationimmediately withdrew their support when Lynn Packer contacted Ed Smart shortly before his report on Coco Berthmann was released. With the exception ofLDS Living, not a single one has retracted their claims and apologized for peddling human trafficking horror fantasies and myths. In fact, organizations like The Malouf Foundation, Adaptive Ops, Operation Underground Railroad, and individuals like U.S. Senator from Utah Mike Lee, continue to either profit or benefit from these bogus human trafficking horror stories. It’s also important to note thatLDS Livingpulled their story on Coco before Packer’s report,afterbeing contacted by a LDS family with evidence that called into question the legitimacy of Berthmann’s story, and who had previously been contacted by Berthmann’s mother, Renata Ruff.LDS Livingpulled the story not only because they could not verify so much as a single claim made by Berthmann, but uncovered evidence that contradicted her claims. Rather than properly retract the story and apologize for misleading their readers and Berthmann supporters, they allow the legend to continue. The Malouf Foundation still has yet to acknowledge or apologize for presenting two “professional victims”, as human trafficking survivors. At their inaugural Human Trafficking Policy and Education Summit last April, Coco Berthmann andElizabeth Frazier, were two of the three “survivors” featured. Utah elected officials such as Senator Mike Lee and Representatives Blake Moore, John Curtis, and Burgess Owens were in attendance. The third victim featured, Julie Whitehead who is also an employee of the organization has long been aware that their stories were in question and refuted by evidence long before Coco’s cancer scam and arrest became a problem. What value has the public received from wild human trafficking fantasies that are nothing more than a campfire for adults to hear scary human trafficking horror stories? That’s exactly what all these summits, foundations and meetings are. Actual human trafficking stories are not that compelling, right? We all know why. For more information on this and other cases visit Your True Crime Source athttps://americancrimejournal.comorhttps://mytruecrime.com/ **Follow Us!!!** **Share this:** Click to share on X (Opens in new window)X Click to share on Facebook (Opens in new window)Facebook Click to email a link to a friend (Opens in new window)Email Click to share on Reddit (Opens in new window)Reddit **Like this:** **Related** **Discover more from American Crime Journal |** Subscribe to get the latest posts sent to your email. Type your email… Subscribe Coco Berthmann Charged Elizabeth Frazier: Another Sham Child Sex Trafficking Victim Eliza Lies: Will the Real Eliza Please Stand Up? Exposed: The Coco Berthmann Child Sex Slave Hoax **Post navigation** **Support ACJ on Patreon!** **I-65 Serial Killer** Collateral Damage: The Anti-Human Trafficking Industrial Complex I-65 Serial Killer/Days Inn Murders Wanted Poster I-65 Killer 1991 Envoy Inn Composite Burger Chef Murders Composites Columbus Composite 1990 The Days Inn Murders: Margaret Mary “Peggy” Gill The Days Inn Murders: Jeanne Gilbert Murder of Vicki Heath Days Inn Columbus, Indiana Assault 1990 Rochester Assault 1991 Murder of Lois “Evelyn” Wright Murder of James Walton The Murder of Victoria Harshman Confirmed Victims (DNA) Composites Suspected Victims Legend of the “Bearded Man” BREAKING: I-65 Serial Killer Identified **FBI News** Justice for Palak Patel: A Life Gone Too SoonFriday, May 30, 2025 National Missing Children’s Day 2025Friday, May 23, 2025 FBI Seeks the Public’s Help in Finding Missing Children in SaipanFriday, May 23, 2025 Global Operation Targets Darknet Drug TraffickingThursday, May 22, 2025 FBI Honors Fallen Law Enforcement During National Police WeekWednesday, May 14, 2025 Raising Awareness: Sexual Assault Aboard AircraftTuesday, April 29, 2025 FBI-Led Operation in Nigeria Leads to Sextortion ArrestsThursday, April 24, 2025 Celebrating 45 Years of FBI Joint Terrorism Task ForcesMonday, April 21, 2025 30th Anniversary of Oklahoma City BombingFriday, April 18, 2025 How the FBI’s Victim Services Division Supports Survivors of CrimeTuesday, April 8, 2025 **Follow Us!** Facebook X YouTube Instagram Patreon Copyright © 2016-2024 American Crime Journal and ACJ.All Rights Reserved. **Recent Articles** ‘God’s Children’ Deserve the Truth: Holding Tim Ballard & Rescuers Accountable—No Exceptions, No Excuses DNA Doe Project identifies Jane Doe found in Arizona in 1997 Tim Ballard and Ken Krogue Recount Elder Ballard’s Prophecy and Support Survivors of Tim Ballard and Operation Underground Railroad Respond to OUR’s Move to Minneapolis: “You Can Run, But You Can’t Hide” Plaintiffs File Lawsuit Against Tim Ballard and Operation Underground Railroad for Human Trafficking Violations Copyright © 2016-2024 American Crime Journal and ACJ Media. All Rights Reserved. **Discover more from American Crime Journal |** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"}