{"id": 947, "name": "Nation of Change", "domain": "nationofchange.org", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.nationofchange.org/2025/06/10/how-the-rich-get-richer-evade-taxation-grease-trillion-dollar-tax-breaks-jack-interest-rates-then-seize-depressed-assets/", "title": "How The Rich Get Richer Evade Taxation Grease Trillion Dollar Tax Breaks Jack Interest Rates Then Seize Depressed Assets", "content": "IssuesActionsPetitionsPledgesTimelinePoliticsJusticeEnvironmentHealthCultureWar ActionsPetitionsPledgesTimeline Petitions Pledges Timeline Politics Justice Environment Health Culture War ActionsPetitionsPledgesTimeline Petitions Pledges Timeline Petitions Pledges Timeline Politics Justice Environment Health Culture War Latest Originals Donate Sign Up IssuesActionsPetitionsPledgesTimelinePoliticsJusticeEnvironmentHealthCultureWar ActionsPetitionsPledgesTimeline Petitions Pledges Timeline Politics Justice Environment Health Culture War ActionsPetitionsPledgesTimeline Petitions Pledges Timeline Petitions Pledges Timeline Politics Justice Environment Health Culture War Latest Originals Donate Sign Up Politics **How the rich get richer: Evade taxation, grease trillion-dollar tax breaks, jack interest rates, then seize depressed assets** In class and status-conscious, materialistic America (was it ever otherwise?), scoring net worth is easier than figuring out messy election results. tweet **Playing the long game—vs. grasping for instant wealth, a fool’s errand. Starting loaded helps either way.** You can’t hit pay dirt, even play the game without scratch. Forget crypto or meme-coins, lotteries or online gambling, even the latest pump-and-dump stock meteor—all sucker plays. Behold the ultimate trillion dollar profit scam: Buy enough servile, tax-hating officials and force through massive tax giveaways biased to the rich (with crumbs for struggling blue collar/middle class marks). Parlay other people’s money by channeling aggrieved, anti-government energy so that libertarian billionaire elitists can feast—all the while condemning constructive government. What big shots don’t love tax breaks, subsidies and deregulation even more than they hate government, scoffed at as if federalism is a stumbling, unprofitable business? After the predictable deluge, tycoons have even more cash or credit to buy assets cheaply. Dynastic crisis capitalism, here we come! The Trump payola dynamic is obvious: cut taxes, balloon the deficit, thus forcing bond holders to demand higher interest rates to offset higher risks. Muddle indiscriminate, boomeranging tariff insanity that amps up instability and lowers dollar prestige. Then explode trust by having the dumbest president ever needlessly insult foreign powers whose cash buys and sustains lower Treasury yields, helping support a strong dollar (now in sharp decline). **Payola schemes for non reimbursed tax cuts define legal theft and virtual subsidies.** Then, leveraging spoils from lowered taxes, start buying the same premium government debt oligarchs just goosed. That makes the rich richer, fueling future donations to repeat the facile cycle. Thus in one generation $70 billion+ has “migrated” upwards to those who need not endure university studies, hard business internships, or military service for those without bone spurs. That’s why billionaires, who care little about fabricated cultural wars, certainly immigration or abortion rights, steadfastly support Trump, despite knowing he’s a criminal, liar and epic scam artist. The tippy top, after all, don’t begrudge their White House operative skimming off the top, using his second term to triple winnings. Hey, who doesn’t want blood relatives to be forever beholden to their genius, money-grubbing papa. What self-respecting oligarch won’t crowbar payoffs, corrupting government as a pliant spigot, all for modest donations? That’s how the richest get richer and richer and richer—until so much corrupt greed kills the golden goose—in comes a recession or worse that punishes the poor. Unless magnates squander their “free cash” on wine, sex, gold trinkets and status quests, time is on the moneyed side. The grift demands enough propaganda to make deluded flocks help elect enough tax-and-regulation cutters so that tax payoffs exceed costs, inflation, blunders and reversals. Call it “pump-priming, right wing style” and the beat goes on—enough is never enough. This addiction is less about life-style than bragging rights, like outdoing small-fry Trumps. In class and status-conscious, materialistic America (was it ever otherwise?), scoring net worth is easier than figuring out messy election results. The big shot with the biggest treasure wins, never counting the downsides. **Money trumps working hard** Front and center is the single MAGA commandment, to wit, “the world owes us a living.” But that only works for connivers who game the system. Does buying an overpriced MAGA hat or a scam Trump family meme-coin (with no intrinsic value), or getting arrested when defying a fraud-free election, raise or lower family income, bank accounts or assets? After Trump’s first four years, big surprise: the very rich got richer and nearly all others suffered basic shortages, inflation (with slightly lower taxes), worse job and education choices, and shredded social services (even worse now). How many of the needless Covid fatalities enhanced either truly lost earning power or retirement options, struck down by fake cures, unspeakable medical ignorance, and grossly negligent White House policies? How about deranged serial killers spurred on by MAGA propaganda—did any get richer or happier, with lucrative job openings when jailed, thus losing liberty as well as paychecks? Not that prison, per Martha Stewart, stops everyone from securing affluence. No doubt smarter convicts learn new skill-sets helpful after release, like how to deal drugs, or do burglary, or learn how to escape capture and unjust prosecution by some nasty “woke” federal attorney, just like Trump, out to get them. **Blueprint to the end of the rainbow** First rule to getting rich—start well off, even well-heeled. Otherwise one must find investment “capital,” though in the long run does it matter whether that comes by mugging neighbors or victimizing strangers with identity threat, even gambling with dicey bit-coins? The latter, our latest, most conspicuous legalized gambling, only demands perfect psychic powers and guts to buy low, sell high. Of course other maps to wealth exist. Discover oil, gold or silver mines in your backyard. Most unlikely, especially if you’re missing a backyard. Win the zillion-to-one lottery, or only slightly less chancy casino gambits. Invent some new valuable tool or gimmick, get it patented, find angel funding, then manufacture, market and promote while elbowing aside competitive corporate giants defending monopolies like grizzly mothers protect cubs. That long shot demands specific expertise, knowing what’s needed plus perfect timing and good luck. There’s always authoring a best-selling novel or screenplay but that’s a life-time mission, closer to a lottery—and after all is said and done, the story must thrill a producer and fit the latest fashions. No doubt about it: inheriting is the least demanding way to wealth—only if you have affluent relatives or friends and don’t alienate the obnoxious, super-Trumpers among them. Yet, picking rich parents is no easy task, even for the smartest newborn—and benefactors have to stay rich until they pass on – decades and decades hence. You could die poor first. Before that, moderate family wealth could fund your costly education, but that means enduring endless school boredom, then equally boring jobs. The true winners must have the ideal skills to fit into the fraction of fabulous high-tech innovators that go public. Finding tomorrow’s Microsoft or Google is harder than forgery. One last ploy: develop a high demand skill-set, learn to hobnob with smart industry types, especially in finance (where the money is), invest in blue chip stocks and wait—meanwhile dreaming about inheritances from distant uncles you didn’t even know existed. Alas, amassing your own treasure the usual way is very hard work—and success is hardly guaranteed. Even if you secure seed money and avoid monumental blunders or bankruptcy, socio-economic mobility from the lower or middle class to the upper echelon is harder than a generation ago, just like the devolving American dream. Perhaps instead, save your money, don’t buy garage junk or drugs, and cultivate more life-fulfilling experience than mere dreams of material wealth. Money counts but it’s not everything—a good life thrives on avoiding bad car accidents or hurricanes, decent health, humor, curiosity, positive challenges, relationships, and family (if applicable). Learn to sit back and find mixed but continuing fascination with today’s peculiarly nefarious gang of public idiots, hustlers, egotists and heartless power-brokers. Count your blessings, breathe deeply and often, exercise, eat well, meditate now and again, thankful not to end up an addict, homeless, or having to spend time with fixated people you can’t stand. Hey, it’s a plan and successmerelydepends on finding what you enjoy doing well, a place to foster growth and a life in the end you can cheerfully boast is yours. How many badly-wounded, manic rich people (Trump, Musk) desperate to make their mark by whatever means necessary can claim the same? If you liked this article, please donate $5 to keep NationofChange online through November. TAGS elections politics rich taxes tweet **Chaos & cruelty: Trump deploys thousands of soldiers to put down anti-ICE protests in Los Angeles** **Republicans can’t see the forest for the trees. Trump blocks their vision of the midterms.** **Khanna unveils $12 trillion progressive plan to cut deficit and invest in working families** **Trump threatens ‘heavy force’ against peaceful protesters as military parade marks birthday spectacle** **Timely lessons for keeping people safe in the streets** **Freedom of movement and global apartheid** **Planetary boundary crossed: Ocean acidification now threatens global ecosystems and coastal economies** **‘No Kings’ movement rises as Trump unleashes military force to silence dissent** **The 3 questions every democratic candidate should be required to answer** **Global outrage after Israel seizes Gaza-bound aid ship in international waters** **Trump’s nuclear orders revive a failed industry at the expense of public safety and clean energy** **New poll shows Medicaid cuts could cost GOP senators support—even from their own base** **How the rich get richer: Evade taxation, grease trillion-dollar tax breaks, jack interest rates,...** **‘No Kings’ movement rises as Trump unleashes military force to silence dissent** **The 3 questions every democratic candidate should be required to answer** **Planetary boundary crossed: Ocean acidification now threatens global ecosystems and coastal economies** **Global outrage after Israel seizes Gaza-bound aid ship in international waters** Home Newsletter Latest Blog BookClub RSS Feed About Donate Careers FAQs Submissions Contact Robert Reich’s Blog This Can’t Be Happening Campaign for America’s Future TomDispatch Democracy Now! Truthdig Inter Press Service YES! Magazine In These Times Contact"}