{"id": 696, "name": "Irish Daily Mirror", "domain": "irishmirror.ie", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.irishmirror.ie/sport/gaa/gaelic-football/gaelic-football-news/ireland-football-permutations-dublin-galway-35373178", "title": "Gaelic Football News", "content": "NewsLatest NewsIrish NewsCrimePoliticsEducationWorld NewsNews OpinionExpand Latest News Irish News Crime Politics Education World News News Opinion Latest News Irish News Crime Politics Education World News News Opinion SportLatest SportGAASoccerGolfRugby UnionUFCOther SportSport OpinionExpand Latest Sport GAA Soccer Golf Rugby Union UFC Other Sport Sport Opinion Latest Sport GAA Soccer Golf Rugby Union UFC Other Sport Sport Opinion Showbiz Horoscopes TV & Film Lifestyle Travel Property Partner Stories Buzz Follow us Irish News Celebrity News Latest Sport Horoscopes Crime Shattered Lives Podcast mynewsassistant Mirror Bingo Newsletter signup Advertise with us About Us Advertise with us Contact Us Work for us Corrections & Clarifications Google Survey Cookie Notice Privacy Notice AI Notice Terms and Conditions How to Complain Newsletter Signup Syndication & Licensing Mirror.co.uk BelfastLive.co.uk © 2025 MGN Limited Home Sport GAA All-Ireland Football championship **All-Ireland football permutations: Dublin, Galway, Derry, Mayo, Donegal, Tyrone walk the tight rope this weekend** **Round 3 of the All-Ireland group stages will take place this weekend and at least one big team is going to crash out of the Championship, while those who top their groups will go straight through to the quarter-finals. It's all to play for on a huge weekend of football.** Bookmark Share 14:48, 11 JUN 2025 Bookmark Our community members are treated to special offers, promotions and adverts from us and our partners. You can check out at any time.More info It's all to play for going into the final round of the All-Ireland football group stages. None of the 16 sides are out of the competition - and all bar Armagh, who have qualified as table toppers, have something big to play for this weekend. Groups 2 and 3 are relatively straightforward, but Groups 1 and 4 are likely to come to a dramatic conclusion this weekend. Big guns like Galway, Dublin, Derry and Mayo are all in extremely precarious positions with at least one of them set to exit the competition. Topping the group guarantees an automatic pass to the All-Ireland quarter-finals and an extra weeks break - a coveted prize - while second and third go the more treacherous route via a preliminary quarter-final where they'll face three Championship games inside 13 to 15 days. Here are the permutations going into a dramatic final round of games: GROUP 1 All four sides, Donegal (+16), Mayo (+4), Tyrone (-4) and Cavan (-16) have one win apiece. If Cavan lose to Tyrone they need Donegal to beat Mayo and the Breffni blues will survive on their head to head win over Mayo. If Tyrone lose to Cavan, they need Mayo to beat Donegal, which would see Malachy O’Rourke’s side survive on their head to head win over Donegal and Jim McGuinness’ men bow out. If Donegal lose to Mayo they need a Tyrone win over Cavan to stay alive on their head to head victory over Cavan. And if Mayo lose to Donegal they need a Cavan win over Tyrone to stay alive on their head to head win over Tyrone. Cavan have an awful Championship record against Tyrone, leaving Mayo in a precarious position. Lose and they're probably going home. A draw would be enough for Mayo and Donegal to survive, with Donegal, who would finish second then on scoring averages, gaining home advantage for the preliminary quarter-final and Mayo away from home. Don't rule a draw out. A Mayo win though would see them top the group and go straight into an All-Ireland quarter-final - unless Cavan shock Tyrone. If Tyrone beat Cavan, Donegal can’t top the group. GROUP 2 Kerry will be expected to get the draw or win they need against Meath to top the group and go straight through to the All-Ireland quarter-finals. If Meath were to beat Kerry they would top the group. Meath are already guaranteed a preliminary quarter-final with a game to spare. The only way Meath (+4) can be denied second place and a home tie is if they lose and Roscommon (-10) win against Cork (-15) - and the Rossies make up a considerable score difference deficit, which is currently 14 points. However, Kerry have beaten Cork and Roscommon by 10 and 11 points respectively so Meath should be wary. A similar win for Kerry over Meath would leave a four or five point Roscommon win potentailly enough to take home advantage away from the Royals in the preliminary quarter-finals. A draw is enough for Roscommon to make the preliminary quarter-finals. If they lose to a pointless Cork, they’re out. This group is fairly straightforward. GROUP 3 Down and Monaghan will battle it out for top spot and the one automatic All-Ireland quarter-final place on offer. A draw will be enough for Down (+18), whereas Monaghan (+15) have to win. Louth (-7) and Clare (-26) are both on zero points. The winner will finish third and have an away tie in the preliminary quarter-finals, with the loser bowing out. A draw will be good enough for Louth to stay in the competition on score difference. GROUP 4 All-Ireland champions Armagh are the first side in the three years of the round robin to qualify as table toppers with one game to spare. This is the third year in a row they’ve topped their group to claim the one automatic quarter-final spot on offer. This may help Galway, who they face this weekend. Galway have one point, the same as Derry, after the sides drew last time out. If Derry beat Dublin they survive - and on top of this, if Galway beat Armagh then it would be Dublin who finish bottom of the group and bow out. A draw is enough for Dublin to go through, and would see Derry exit the competition if Galway were to get a draw or better against Armagh. A Galway draw and a Derry win over Dublin would mean the two sides finish on two point but Galway would be out (based on their head to head loss to Dublin). Galway (-1) can still lose to Armagh and survive provided Derry (-4) lose to Dublin and the current three point gap in scoring averages between Galway and Derry isn’t bridged. If Armagh draw or win against Galway, Dublin are safe regardless of their result against Derry. All-Ireland Football championship Dublin GAA Mayo GAA Donegal GAA Sport all Most Read Most Recent Most Read Most Recent News Sport Lifestyle Follow us About Us Advertise with us Contact Us Work for us Corrections & Clarifications Google Survey Cookie Notice Privacy Notice AI Notice Terms and Conditions How to Complain Newsletter Signup Syndication & Licensing Mirror.co.uk BelfastLive.co.uk © 2025 MGN Limited"}