{"id": 907, "name": "Miami Valley Today", "domain": "miamivalleytoday.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://miamivalleytoday.com/covingtons-preston-king-takes-third-in-d-iii-high-jump-at-state-meet-daylynn-garrett-seth-coker-payton-mayfield-advance-to-finals/", "title": "Covingtons Preston King Takes Third In D Iii High Jump At State Meet Daylynn Garrett Seth Coker Payton Mayfield Advance To Finals", "content": "E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsSign Up for Our NewsletterArchive Sign Up for Our Newsletter Archive Sign Up for Our Newsletter Archive Sports Obituaries OpinionSubmit a Letter to the EditorLettersColumns Submit a Letter to the Editor Letters Columns Submit a Letter to the Editor Letters Columns Jobs ClassifiedsClassified Ads Classified Ads Classified Ads Public Notices Businesses MoreAsk the ExpertSpecial SectionsCalendarDigital AdvertisingContact Us Ask the Expert Special Sections Calendar Digital Advertising Contact Us Ask the Expert Special Sections Calendar Digital Advertising Contact Us E-EditionLogoutSign InSubscribeMyAccountNewsletter SignupManage PreferencesLink My Account NewsSign Up for Our NewsletterArchive Sign Up for Our Newsletter Archive Sign Up for Our Newsletter Archive Sports Obituaries OpinionSubmit a Letter to the EditorLettersColumns Submit a Letter to the Editor Letters Columns Submit a Letter to the Editor Letters Columns Jobs ClassifiedsClassified Ads Classified Ads Classified Ads Public Notices Businesses MoreAsk the ExpertSpecial SectionsCalendarDigital AdvertisingContact Us Ask the Expert Special Sections Calendar Digital Advertising Contact Us Ask the Expert Special Sections Calendar Digital Advertising Contact Us Sports **Covington’s Preston King takes third in D-III high jump at state meet; Day’Lynn Garrett, Seth Coker, Payton Mayfield advance to finals** Covington high jumper Preston King goes over the bar in the high jump at Jesse Owens Stadium Friday. King cleared 6-8 to finish third in the high jump at the OHSAA D-III state track and field meet. Ben Robinson|Color Green Photos Covington’s Day’Lynn Garrett advanced to the finals in the 110 high hurdles in D-III Friday. Ben Robinson|Color Green Photos Milton-Union’s Payton Mayfield advanced to the D-II finals in the 100 and 200 meter dashes. Ben Robinson|Color Green Photos COLUMBUS — It would be hard for Covington senior Preston King to have found a better way to end his high school career in the high jump. At the D-III state track and field meet at Jesse Owens Stadium on the campus of The Ohio State University, King soared to new heights, breaking the school record again with a height of 6-8 and finishing third in his final high school meet. “It was a great way to end things,” King said. “It felt really good. I am really happy the way it turned out.” After clearing 6-0 and 6-2 on his first attempts, King had a scary moment at 6-4. After missing on his first two attempts at 6-4, he was down to his last attempt. He brushed the bar, but it stayed up. “It was kind of demoralizing really,” King said. “That is a height had been making easily and it came down to my third attempt. But, I just had to find a way to push forward. Even though my legs weren’t feeling great, I hadn’t done what I wanted to do. I wanted to do more.” While it put him behind Nolan Garrabant of Fisher Catholic, Jesse Brown of Purcell Marian and Calvin Willow of Arlington on misses, King was just getting started. He cleared 6-5 on his second attempt and 6-6 and 6-7 on his first attempt. When all three failed to clear 6-7, that moved King into the top three. While he had never cleared 6-8 before, he got it on his first attempt, before missing all three attempts at 6-9. Drew Boggs of Delphos St. John’s cleared 6-10 to win and Thomas Cook of Miami Valley School — who passed at 6-9 — also cleared 6-8 and took second on misses. “I just had a feeling I could get 6-8,” King said. “I had been close before and I really wanted to get it. It was a great way to end things.” King’s teammate Day’Lynn Garrett advanced to the finals in the 110 meter high hurdles, with the third fastest qualifying time in 14.87, Garrett also finished 15th in the long jump, leaping 19-11. Newton’s Seth Coker advanced to the finals, with the sixth fastest qualifying time in the 400, 49.78. Two Newton relays failed to make the finals. The 400 relay (Jaemyn Lowry, Luke Cornett, Dakota Craig, Christian Maxwell) had the 11th fastest time, 44.11 and the 1,600 relay (Jacson Cress, Liam Woods, Lincoln Smith, Coker) had the 16th fastest time, 3:32.21. DIVISION I Tippecanoe’s Will Strong advanced to the finals in both the 100 and 200 meter dashes. Strong had the seventh fastest qualifying time in both events with a 10.57 100 and 21.48 200. Troy’s Michael Tucker did not make the finals in the 110 high hurdles. He had the 15th fastest time of 14.56. Also competing Saturday will Strong and teammate Max Deckard in the long jump, Troy’s T.J. Murray in the pole vault and Piqua’s Noah Burgh in the 3,200 meter run. DIVISION II Milton-Union’s Payton Mayfield competed in three events Friday, advancing to the finals in both the 100 and 200 meter dashes. He had the fifth fastest qualifying time in the 200, 21.82 and the ninth fastest qualifying time in the 100, 10.86. Mayfield also finished 11th in the long jump, 20-10. Also competing Saturday will be Miami East’s Levi Glassmeyer and Bethel’s Kade Schweikhardt. Glassmeyer will compete in the discus and Schweikhardt will run the 800. Sports Editor Rob Kiser can be reached at[email protected] **No posts to display**"}