{"id": 1429, "name": "The Root", "domain": "theroot.com", "bias": "left", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.theroot.com/wild-new-development-in-case-of-london-teen-who-mysteri-2000044965", "title": null, "content": "Black News and Black Views with a Whole Lotta Attitude Home Latest Entertainment The Culture News The Root Institute Opinion Beauty + Style Home Latest Entertainment The Culture News The Root Institute Opinion Beauty + Style **Wild New Development in Case of London Teen Who Mysteriously Vanished for 6 Weeks** Deante James smoked what he thought was marijuana, but it was something much more deadly. By Phenix S Halley Published When 17-year-old Deante James went missing from his familyhome in North London,his mother quickly realized something was wrong. The teen, who enjoyed exercising and school, began behaving differently during the weeks leading up to his disappearance. Soon, it was discovered James was smoking what he thought was marijuana. Instead, it was a lab-made drug resembling weed that caused severe side effects. To view this video please enable JavaScript, and consider upgrading to a web browser thatsupports HTML5 video K2— or Spice— emerged during the early 2000s as a cheap street drug targeting naive teens and young adults. Although it's hard to pinpoint how many deaths the drug has caused since it hit the streets, the number is estimated to be dozens around the world and even more cases of severe side effects, usually in young adults,according to CNN.For James, his side effects began with hallucinations and hearing voices. His mother even took him to the hospital where doctors diagnosed him with a drug-induced psychosis. When they returned home, James ran away with no phone or money, accordingto the Daily Record.That was on March 31. Three days after he went missing, local transit police stopped him for fare evasion. He gave the cops a fake name, but officials eventually let him go, not realizing he was a missing person,according to PEOPLE. \"Once his identity was confirmed, he was dearrested and allowed to leave,\" the British Transport Police told PEOPLE. \"Although the teenager was reported missing to the Met Police prior to being arrested, no \"missing marker was found when officers searched for his name on the police database.\" James' mom, Vandana Bhogowoth, ran a missing persons' campaign for her son soon after he ran away. Now, in a new development, the teenager was found, and she believes her campaign was key to him finally being found safe and alive six weeks later on May 17. \"The publicity made the police take the case more seriously,\"she told Magzter. \"I'm really thankful to everyone, also my local MP and the Missing People charity, who pushed the police to take it seriously and get him found,\" Bhogowoth continued. \"I think highlighting it did push them. Everyone collectively helped - thank you. I'm so grateful.\" Now, his family says he's back to normal. \"He’s recovering and he’s going to get back to his absolute best self, so I’m really happy, positive and extremely grateful to everyone,\" his mother said. \"He’s looking forward to getting his life back on track and following his dreams.\" Straight From Sign up for our free daily newsletter. **More From The Root** Two Days Before Trial, Crucial Evidence is Lost in Decade-Old Cold Case **Two Days Before Trial, Crucial Evidence is Lost in Decade-Old Cold Case** **Two Days Before Trial, Crucial Evidence is Lost in Decade-Old Cold Case** Why Audra McDonald’s Tony Awards Performance Should Convince Patti LuPone to Have Several Seats **Why Audra McDonald’s Tony Awards Performance Should Convince Patti LuPone to Have Several Seats** **Why Audra McDonald’s Tony Awards Performance Should Convince Patti LuPone to Have Several Seats** A Famous Supermodel Just Endorsed Blue Ivy’s On-Stage Catwalk **A Famous Supermodel Just Endorsed Blue Ivy’s On-Stage Catwalk** **A Famous Supermodel Just Endorsed Blue Ivy’s On-Stage Catwalk** Don Lemon Breaks Down How He’s Building His Media Empire **Don Lemon Breaks Down How He’s Building His Media Empire** **Don Lemon Breaks Down How He’s Building His Media Empire** Facebook Twitter Instagram YouTube RSS Feed Sitemap About Accessibility Privacy Terms of Use Advertising Jobs Reprints & Permissions Your Privacy Choices More from our network © 2025 G/O Media"}