{"id": 145, "name": "BMC Cancer Journal", "domain": "bmccancer.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://bmccancer.biomedcentral.com/submission-guidelines/preparing-your-manuscript/study-protocol", "title": "Preparing Your Manuscript", "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Submission Guidelines Collections Join the Board **Submission Guidelines** Aims and scope Fees and funding Language editing services Copyright Preparing your manuscriptResearch articleDatabase articleSoftware articleStudy protocolReviewMatters ArisingCommentSystematic Review Research article Database article Software article Study protocol Review Matters Arising Comment Systematic Review Research article Database article Software article Study protocol Review Matters Arising Comment Systematic Review Prepare supporting information Conditions of publication Editorial policies Peer-review policy Manuscript transfers Promoting your publication **Study protocol** **Criteria** Publishing study protocols inBMC Canceris part of our commitment to improving research standards by promoting transparency, reducing publication bias, and enhancing the reproducibility of study design and analysis. We consider study protocols for proposed or ongoing prospective clinical research that provide a detailed account of the hypothesis, rationale and methodology of the study, and the associated ethical requirements. By publishing your protocol with us, it becomes a fully citable open-access article. We evaluate study protocol submissions on a case-by-case basis and consider only those for proposed or ongoing studies that have not completed participant recruitment at the time of submission. We encourage authors to submit their study protocols well in advance of participant recruitment completion and confirm the study status within the cover letter. Study protocols for pilot or feasibility studies are not considered, and authors are encouraged to submit the pilot results as a research article and the study protocol for the definitive study. Additionally, we may not consider study protocols where authors have other articles published or under consideration relating to the same protocol. Please note that study protocols for systematic reviews are not considered by the BMC Series journals. If a proposed study protocol has obtained formal ethical approval and undergone independent peer-review from a major funding body, it will usually be considered for publication without further peer-review. Please ensure the Declarations section in your manuscript outlines the funding information, including whether it was peer reviewed and information about ethical approval. In some cases, the Editor may request to see the peer-review reports from the funder and/or may send the protocol for additional peer review. Please note that study protocols without major external funding or ethics approval may not be considered for publication. Protocols of randomized controlled trials should follow theSPIRITguidelines and must have a trial registration number included in the last line of the abstract, as described in our editorial policies. Please provide a completed SPIRIT checklist as a supplementary file when submitting your protocol. When conducting peer-review of study protocols, the intention is not to change the study design. Instead, we ask our reviewers to evaluate and report on the study's adequacy in testing the hypothesis, whether there is sufficient detail for replication or comparison, the appropriateness of the planned statistical analysis, and the acceptability of the writing. The final decision on whether to consider a study protocol for publication will rest with the Editor, and appeals will not be considered. To ensure a smooth submission process, please take note of the following before submitting: Confirm the status of your study within the cover letter. Ensure that the Declarations section is complete and contains ethical approval and funding information. For protocols describing clinical trials, provide a completed copy of theSPIRIT checklistas a supplementary file. Professionally produced Visual Abstracts BMC Cancerwill consider visual abstracts. As an author submitting to the journal, you may wish to make use of services provided at Springer Nature for high quality and affordable visual abstracts where you are entitled to a 20% discount. Clickhereto find out more about the service, and your discount will be automatically be applied when using this link. **Preparing your manuscript** The information below details the section headings that you should include in your manuscript and what information should be within each section. Please note that your manuscript must include a 'Declarations' section including all of the subheadings (please see below for more information). **Title page** The title page should: present a title that includes, if appropriate, the study design e.g.:\"A versus B in the treatment of C: a randomized controlled trial\", \"X is a risk factor for Y: a case control study\", \"What is the impact of factor X on subject Y: A systematic review\"or for non-clinical or non-research studies: a description of what the article reports \"A versus B in the treatment of C: a randomized controlled trial\", \"X is a risk factor for Y: a case control study\", \"What is the impact of factor X on subject Y: A systematic review\" or for non-clinical or non-research studies: a description of what the article reports \"A versus B in the treatment of C: a randomized controlled trial\", \"X is a risk factor for Y: a case control study\", \"What is the impact of factor X on subject Y: A systematic review\" or for non-clinical or non-research studies: a description of what the article reports list the full names and institutional addresses for all authorsif a collaboration group should be listed as an author, please list the Group name as an author. If you would like the names of the individual members of the Group to be searchable through their individual PubMed records, please include this information in the “Acknowledgements” section in accordance with the instructions belowLarge Language Models (LLMs), such asChatGPT, do not currently satisfy ourauthorship criteria. Notably an attribution of authorship carries with it accountability for the work, which cannot be effectively applied to LLMs. Use of an LLM should be properly documented in the Methods section (and if a Methods section is not available, in a suitable alternative part) of the manuscript if a collaboration group should be listed as an author, please list the Group name as an author. If you would like the names of the individual members of the Group to be searchable through their individual PubMed records, please include this information in the “Acknowledgements” section in accordance with the instructions below Large Language Models (LLMs), such asChatGPT, do not currently satisfy ourauthorship criteria. Notably an attribution of authorship carries with it accountability for the work, which cannot be effectively applied to LLMs. Use of an LLM should be properly documented in the Methods section (and if a Methods section is not available, in a suitable alternative part) of the manuscript if a collaboration group should be listed as an author, please list the Group name as an author. If you would like the names of the individual members of the Group to be searchable through their individual PubMed records, please include this information in the “Acknowledgements” section in accordance with the instructions below Large Language Models (LLMs), such asChatGPT, do not currently satisfy ourauthorship criteria. Notably an attribution of authorship carries with it accountability for the work, which cannot be effectively applied to LLMs. Use of an LLM should be properly documented in the Methods section (and if a Methods section is not available, in a suitable alternative part) of the manuscript indicate the corresponding author **Abstract** The Abstract should not exceed 350 words. Please minimize the use of abbreviations and do not cite references in the abstract. The abstract must include the following separate sections: Background:the context and purpose of the study Methods:how the study will be performed Discussion:a brief summary and potential implications Trial registration:If your article reports the results of a health care intervention on human participants, it must be registered in an appropriate registry and the registration number and date of registration should be in stated in this section. If it was not registered prospectively (before enrollment of the first participant), you should include the words 'retrospectively registered'. See our editorial policies for more information on trial registration **Keywords** Three to ten keywords representing the main content of the article. **Background** The Background section should explain the background to the study, its aims, a summary of the existing literature and why this study is necessary or its contribution to the field. **Methods/Design** The methods section should include: the aim, design and setting of the study the characteristics of participants or description of materials a clear description of all processes, interventions and comparisons. Generic drug names should generally be used. When proprietary brands are used in research, include the brand names in parentheses the type of statistical analysis used, including a power calculation if appropriate. **Discussion** This should include a discussion of any practical or operational issues involved in performing the study and any issues not covered in other sections. **List of abbreviations** If abbreviations are used in the text they should be defined in the text at first use, and a list of abbreviations should be provided. **Declarations** All manuscripts must contain the following sections under the heading 'Declarations': Ethics approval and consent to participate Consent for publication Availability of data and materials Competing interests Funding Authors' contributions Acknowledgements Authors' information (optional) Please see below for details on the information to be included in these sections. If any of the sections are not relevant to your manuscript, please include the heading and write 'Not applicable' for that section. Manuscripts reporting studies involving human participants, human data or human tissue must: include a statement on ethics approval and consent (even where the need for approval was waived) include the name of the ethics committee that approved the study and the committee’s reference number if appropriate Studies involving animals must include a statement on ethics approval and for experimental studies involving client-owned animals, authors must also include a statement on informed consent from the client or owner. See oureditorial policiesfor more information. If your manuscript does not report on or involve the use of any animal or human data or tissue, please state “Not applicable” in this section. If your manuscript contains any individual person’s data in any form (including any individual details, images or videos), consent for publication must be obtained from that person, or in the case of children, their parent or legal guardian. All presentations of case reports must have consent for publication. You can use your institutional consent form or ourconsent formif you prefer. You should not send the form to us on submission, but we may request to see a copy at any stage (including after publication). See oureditorial policiesfor more information on consent for publication. If your manuscript does not contain data from any individual person, please state “Not applicable” in this section. All manuscripts must include an ‘Availability of data and materials’ statement. Data availability statements should include information on where data supporting the results reported in the article can be found including, where applicable, hyperlinks to publicly archived datasets analysed or generated during the study. By data we mean the minimal dataset that would be necessary to interpret, replicate and build upon the findings reported in the article. We recognise it is not always possible to share research data publicly, for instance when individual privacy could be compromised, and in such instances data availability should still be stated in the manuscript along with any conditions for access. Authors are also encouraged to preserve search strings on searchRxivhttps://searchrxiv.org/, an archive to support researchers to report, store and share their searches consistently and to enable them to review and re-use existing searches. searchRxiv enables researchers to obtain a digital object identifier (DOI) for their search, allowing it to be cited. Data availability statements can take one of the following forms (or a combination of more than one if required for multiple datasets): The datasets generated and/or analysed during the current study are available in the [NAME] repository, [PERSISTENT WEB LINK TO DATASETS] The datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. All data generated or analysed during this study are included in this published article [and its supplementary information files]. The datasets generated and/or analysed during the current study are not publicly available due [REASON WHY DATA ARE NOT PUBLIC] but are available from the corresponding author on reasonable request. Data sharing is not applicable to this article as no datasets were generated or analysed during the current study. The data that support the findings of this study are available from [third party name] but restrictions apply to the availability of these data, which were used under license for the current study, and so are not publicly available. Data are however available from the authors upon reasonable request and with permission of [third party name]. Not applicable. If your manuscript does not contain any data, please state 'Not applicable' in this section. More examples of template data availability statements, which include examples of openly available and restricted access datasets, are availablehere. BioMed Central strongly encourages the citation of any publicly available data on which the conclusions of the paper rely in the manuscript. Data citations should include a persistent identifier (such as a DOI) and should ideally be included in the reference list. Citations of datasets, when they appear in the reference list, should include the minimum information recommended by DataCite and follow journal style. Dataset identifiers including DOIs should be expressed as full URLs. For example: Hao Z, AghaKouchak A, Nakhjiri N, Farahmand A. Global integrated drought monitoring and prediction system (GIDMaPS) data sets. figshare. 2014.http://dx.doi.org/10.6084/m9.figshare.853801 With the corresponding text in the Availability of data and materials statement: The datasets generated during and/or analysed during the current study are available in the [NAME] repository, [PERSISTENT WEB LINK TO DATASETS].[Reference number] If you wish to co-submit a data note describing your data to be published inBMC Research Notes, you can do so by visiting oursubmission portal. Data notes supportopen dataand help authors to comply with funder policies on data sharing. Co-published data notes will be linked to the research article the data support (example). All financial and non-financial competing interests must be declared in this section. See oureditorial policiesfor a full explanation of competing interests. If you are unsure whether you or any of your co-authors have a competing interest please contact the editorial office. Please use the authors initials to refer to each authors' competing interests in this section. If you do not have any competing interests, please state \"The authors declare that they have no competing interests\" in this section. All sources of funding for the research reported should be declared. If the funder has a specific role in the conceptualization, design, data collection, analysis, decision to publish, or preparation of the manuscript, this should be declared. The individual contributions of authors to the manuscript should be specified in this section. Guidance and criteria for authorship can be found in oureditorial policies. Please use initials to refer to each author's contribution in this section, for example: \"FC analyzed and interpreted the patient data regarding the hematological disease and the transplant. RH performed the histological examination of the kidney, and was a major contributor in writing the manuscript. All authors read and approved the final manuscript.\" Please acknowledge anyone who contributed towards the article who does not meet the criteria for authorship including anyone who provided professional writing services or materials. Authors should obtain permission to acknowledge from all those mentioned in the Acknowledgements section. See oureditorial policiesfor a full explanation of acknowledgements and authorship criteria. If you do not have anyone to acknowledge, please write \"Not applicable\" in this section. Group authorship (for manuscripts involving a collaboration group): if you would like the names of the individual members of a collaboration Group to be searchable through their individual PubMed records, please ensure that the title of the collaboration Group is included on the title page and in the submission system and also include collaborating author names as the last paragraph of the “Acknowledgements” section. Please add authors in the format First Name, Middle initial(s) (optional), Last Name. You can add institution or country information for each author if you wish, but this should be consistent across all authors. Please note that individual names may not be present in the PubMed record at the time a published article is initially included in PubMed as it takes PubMed additional time to code this information. This section is optional. You may choose to use this section to include any relevant information about the author(s) that may aid the reader's interpretation of the article, and understand the standpoint of the author(s). This may include details about the authors' qualifications, current positions they hold at institutions or societies, or any other relevant background information. Please refer to authors using their initials. Note this section should not be used to describe any competing interests. Footnotes can be used to give additional information, which may include the citation of a reference included in the reference list. They should not consist solely of a reference citation, and they should never include the bibliographic details of a reference. They should also not contain any figures or tables. Footnotes to the text are numbered consecutively; those to tables should be indicated by superscript lower-case letters (or asterisks for significance values and other statistical data). Footnotes to the title or the authors of the article are not given reference symbols. Always use footnotes instead of endnotes. **References** Examples of the Vancouver reference style are shown below. See oureditorial policiesfor author guidance on good citation practice Web links and URLs:All web links and URLs, including links to the authors' own websites, should be given a reference number and included in the reference list rather than within the text of the manuscript. They should be provided in full, including both the title of the site and the URL, as well as the date the site was accessed, in the following format: The Mouse Tumor Biology Database.http://tumor.informatics.jax.org/mtbwi/index.do. Accessed 20 May 2013. If an author or group of authors can clearly be associated with a web link, such as for weblogs, then they should be included in the reference. Example reference style: Article within a journal Smith JJ. The world of science. Am J Sci. 1999;36:234-5. Article within a journal (no page numbers) Rohrmann S, Overvad K, Bueno-de-Mesquita HB, Jakobsen MU, Egeberg R, Tjønneland A, et al. Meat consumption and mortality - results from the European Prospective Investigation into Cancer and Nutrition. BMC Medicine. 2013;11:63. Article within a journal by DOI Slifka MK, Whitton JL. Clinical implications of dysregulated cytokine production. Dig J Mol Med. 2000; doi:10.1007/s801090000086. Article within a journal supplement Frumin AM, Nussbaum J, Esposito M. Functional asplenia: demonstration of splenic activity by bone marrow scan. Blood 1979;59 Suppl 1:26-32. Book chapter, or an article within a book Wyllie AH, Kerr JFR, Currie AR. Cell death: the significance of apoptosis. In: Bourne GH, Danielli JF, Jeon KW, editors. International review of cytology. London: Academic; 1980. p. 251-306. OnlineFirst chapter in a series (without a volume designation but with a DOI) Saito Y, Hyuga H. Rate equation approaches to amplification of enantiomeric excess and chiral symmetry breaking. Top Curr Chem. 2007. doi:10.1007/128_2006_108. Complete book, authored Blenkinsopp A, Paxton P. Symptoms in the pharmacy: a guide to the management of common illness. 3rd ed. Oxford: Blackwell Science; 1998. Online document Doe J. Title of subordinate document. In: The dictionary of substances and their effects. Royal Society of Chemistry. 1999. http://www.rsc.org/dose/title of subordinate document. Accessed 15 Jan 1999. Online database Healthwise Knowledgebase. US Pharmacopeia, Rockville. 1998. http://www.healthwise.org. Accessed 21 Sept 1998. Supplementary material/private homepage Doe J. Title of supplementary material. 2000. http://www.privatehomepage.com. Accessed 22 Feb 2000. University site Doe, J: Title of preprint. http://www.uni-heidelberg.de/mydata.html (1999). Accessed 25 Dec 1999. FTP site Doe, J: Trivial HTTP, RFC2169. ftp://ftp.isi.edu/in-notes/rfc2169.txt (1999). Accessed 12 Nov 1999. Organization site ISSN International Centre: The ISSN register. http://www.issn.org (2006). Accessed 20 Feb 2007. Dataset with persistent identifier Zheng L-Y, Guo X-S, He B, Sun L-J, Peng Y, Dong S-S, et al. Genome data from sweet and grain sorghum (Sorghum bicolor). GigaScience Database. 2011.http://dx.doi.org/10.5524/100012. **Figures, tables and additional files** SeeGeneral formatting guidelinesfor information on how to format figures, tables and additional files. Submit manuscript Important informationEditorial boardFor authorsFor editorial board membersFor reviewers **Important information** Editorial board For authors For editorial board members For reviewers **Important information** Editorial board For authors For editorial board members For reviewers Contact Us **Annual Journal Metrics** Citation ImpactJournal Impact Factor: 3.4 (2023)5-year Journal Impact Factor: 3.8 (2023)Source Normalized Impact per Paper (SNIP): 0.964 (2024)SCImago Journal Rank (SJR): 1.178 (2024)SpeedSubmission to first editorial decision (median days): 10Submission to acceptance (median days): 140Usage 2024Downloads: 11,210,121Altmetric mentions: 3,310 Citation ImpactJournal Impact Factor: 3.4 (2023)5-year Journal Impact Factor: 3.8 (2023)Source Normalized Impact per Paper (SNIP): 0.964 (2024)SCImago Journal Rank (SJR): 1.178 (2024)SpeedSubmission to first editorial decision (median days): 10Submission to acceptance (median days): 140Usage 2024Downloads: 11,210,121Altmetric mentions: 3,310 Citation ImpactJournal Impact Factor: 3.4 (2023)5-year Journal Impact Factor: 3.8 (2023)Source Normalized Impact per Paper (SNIP): 0.964 (2024)SCImago Journal Rank (SJR): 1.178 (2024)SpeedSubmission to first editorial decision (median days): 10Submission to acceptance (median days): 140Usage 2024Downloads: 11,210,121Altmetric mentions: 3,310 More about our metrics **Peer-review Terminology** The following summary describes the peer review process for this journal:Identity transparency:Single anonymizedReviewer interacts with:EditorReview information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communicationMore information is available here The following summary describes the peer review process for this journal: Identity transparency:Single anonymized Reviewer interacts with:Editor Review information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communication More information is available here The following summary describes the peer review process for this journal: Identity transparency:Single anonymized Reviewer interacts with:Editor Review information published:Review reports. Reviewer Identities reviewer opt in. Author/reviewer communication More information is available here **Follow** Follow us on Twitter Advertisement ISSN: 1471-2407 Submission enquiries:bmccancer@biomedcentral.com General enquiries:ORSupport@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}