{"id": 346, "name": "DefenseScoop", "domain": "defensescoop.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://defensescoop.com/2024/12/17/report-highlights-how-secure-data-sharing-platforms-can-support-the-intelligence-communitys-it-roadmap/", "title": "Report Highlights How Secure Data Sharing Platforms Can Support The Intelligence Communitys It Roadmap", "content": "DefenseScoop AIScoop FedScoop CyberScoop StateScoop EdScoop TopicsBackITCybersecurityAISpaceWeaponsR&D IT Cybersecurity AI Space Weapons R&D IT Cybersecurity AI Space Weapons R&D Events Podcasts Videos Subscribe to our Newsletters Advertise DefenseScoop 50 DefenseScoop AIScoop FedScoop CyberScoop StateScoop EdScoop Sponsored Insights **Report highlights how secure data-sharing platforms can support the Intelligence Community’s IT roadmap** ByScoop News Group December 17, 2024 As the U.S. Intelligence Community (IC) grapples with a dynamic threat landscape and demands for faster, more secure data sharing, a new report from GDIT offers a practical guide for achieving a variety of the IC’s critical modernization goals. The report, “Navigating the Intelligence Community IT Roadmap,” analyzes key challenges facing the IC and outlines how existing and tested technology capabilities can help IC components gain a strategic advantage over adversaries. The report’s timely release aligns with the IC’s five-year IT roadmap, which seeks to advance intelligence operations by promoting seamless collaboration, enhanced data sharing and management and the ability to deploy the newest tech innovations rapidly. The report highlights a variety of currently available technical capabilities developed by GDIT as part of its long-standing work to support the U.S. defense and intelligence agencies, including: DeepSky— a private, multi-cloud, on-prem data center environment developed and maintained by GDIT that facilitates the testing of emerging technology and security capabilities from multiple providers in collaboration with government agencies and their partners. “It’s really difficult to ingest massive amounts of data from a bunch of tools and make it usable for an engineer, an analyst or an executive. So DeepSky helps make those tools work together,” says Ryan Deslauriers, director of cybersecurity at GDIT. Mission Partner Environments— a new generation of interoperable networking and data exchange environments. Originally designed to allow military units to exchange data with specific partners, these expanded information-sharing environments enable the selective yet secure sharing of sensitive and classified information with trusted military and coalition partners. MPEs make it possible to take a “full report, break out what can and can’t be released, and push it to the appropriate network virtually and automatically so that information gets to relevant users where they are in a timely fashion,” explains Jennifer Krischer, a former U.S. Air Force intelligence officer who now serves as vice president for defense intelligence at GDIT. Raven— a mobile command center tech suite developed by GDIT that fits in the back of a truck. It extends and deploys the data mesh concept to mobile environments. It can be utilized for disaster relief, special forces operations, or disconnected environments, enabling operators to collect and disseminate data from the tactical edge directly to users on the ground and back to the enterprise. Raven is an example of how GDIT “enables teams to conduct their mission without having to develop, build, maintain, and operate the services internally,” notes Nicholas Townsend, senior director at GDIT. Federated Data Fabric— creates a unified data environment through a centralized service platform designed to streamline data curation, management, and dissemination and enable seamless access to data independent of its source or security level. It allows users on the network’s edge to discover, request, publish and subscribe to information within a federated network environment. Workforce commitment The report also highlights GDIT’s distinctive approach to hiring and training professionals with extensive defense, IC, and technical experience who uniquely understand the needs of the government’s mission. “Our workforce two to five years from now will need to be different from what it is today and prepared to take advantage of new technology,” notes Chaz Mason, mission engineering and delivery lead at GDIT. Recognizing this, GDIT doubled its investment in tuition and technical training programs in 2023. More than 20,000 employees have taken at least one of our cyber, AI, and cloud upskilling programs, he said. GDIT’s staff currently numbers 30,000 professionals supporting customers in over 400 locations across 30 countries; 25%+ of the workforce are veterans. Read more abouthow GDIT’s vendor-agnostic technology and decades of government customer experience can help achieve the Intelligence Community’s data-sharing vision. This article was produced by Scoop News Group for FedScoop and DefenseScoop and sponsored by GDIT. data fabric Raven DeepSky GDIT 2024 mission partner environments defense department open source IT Modernization GDIT special report edge computing Office of the Director of National Intelligence (ODNI) workforce Sponsored Content intelligence community (IC) Facebook LinkedIn Twitter Copy Link **More Like This** Transforming federal and defense network infrastructure with new wireless technologiesByScoop News Group **Transforming federal and defense network infrastructure with new wireless technologies** **Transforming federal and defense network infrastructure with new wireless technologies** How the DOD can harness AI for innovation and efficiencyByScoop News Group **How the DOD can harness AI for innovation and efficiency** **How the DOD can harness AI for innovation and efficiency** CDAO leaves edge data mesh nodes behind with Indo-Pacom after success in major exerciseByBrandi Vincent **CDAO leaves edge data mesh nodes behind with Indo-Pacom after success in major exercise** **CDAO leaves edge data mesh nodes behind with Indo-Pacom after success in major exercise** **Top Stories** Pentagon’s 2026 budget plan includes more than $4B for next-generation Air Force fighter jetsByJon Harper **Pentagon’s 2026 budget plan includes more than $4B for next-generation Air Force fighter jets** **Pentagon’s 2026 budget plan includes more than $4B for next-generation Air Force fighter jets** Central Command looks to expand its counter-drone arsenal in the aftermath of Operation Rough RiderByBrandi Vincent **Central Command looks to expand its counter-drone arsenal in the aftermath of Operation Rough Rider** **Central Command looks to expand its counter-drone arsenal in the aftermath of Operation Rough Rider** Army moving on from MFEW aerial jammer, embracing backpack as ground-based solutionByMark Pomerleau **Army moving on from MFEW aerial jammer, embracing backpack as ground-based solution** **Army moving on from MFEW aerial jammer, embracing backpack as ground-based solution** Inside the Pentagon CIO’s push to overhaul antiquated software acquisition practicesByMikayla Easley **Inside the Pentagon CIO’s push to overhaul antiquated software acquisition practices** **Inside the Pentagon CIO’s push to overhaul antiquated software acquisition practices** House Armed Services leaders unveil bill to reform defense acquisition, speed up requirements processByMark Pomerleau **House Armed Services leaders unveil bill to reform defense acquisition, speed up requirements process** **House Armed Services leaders unveil bill to reform defense acquisition, speed up requirements process** Canada eyes major military investments, more non-U.S. defense partnershipsByBrandi Vincent **Canada eyes major military investments, more non-U.S. defense partnerships** **Canada eyes major military investments, more non-U.S. defense partnerships** Pentagon zero trust guidance for IoT and OT coming in SeptemberByBilly Mitchell **Pentagon zero trust guidance for IoT and OT coming in September** **Pentagon zero trust guidance for IoT and OT coming in September** Navy contracting officers will soon see new incentives to ‘go commercial’ByBrandi Vincent **Navy contracting officers will soon see new incentives to ‘go commercial’** **Navy contracting officers will soon see new incentives to ‘go commercial’** **More Scoops** **MPEs gain momentum for sharing information with allied partners** **New ‘official channels’ for sharing data on unexplained phenomena leads to uptick in Pentagon’s collection of evidence** **Latest Podcasts** **Tech** Data and integration will be 'core' of Army's Next-Gen C2 Trump picks new combatant commanders Congress wants to see Army’s ‘homework’ on transformation initiative Next summer could be culmination of bridge network and next-gen C2 for the Army **Weapons** Allvin hints at new funding for Air Force’s ARRW hypersonic missile in fiscal 2026 Army weaves robo-boats, drones, balloons and C2 tech into multi-continent Arcane Thunder exercise Army considers buying thousands of portable small drone detectors — including for Taiwan Brits join US Operation Rough Rider to bomb Houthi drone hub in Yemen **Cyber** Cybercom’s defensive arm elevated to sub-unified command National Guardsmen receive brief from Volt Typhoon utility victim at cyber exercise DOD leadership asks for Cybercom 2.0 relook Members of Congress vow not to split Cyber Command, NSA **AI** Allvin: AI adoption within the Air Force currently a ‘mixed bag’ Air Mobility Command enlists AI to better spot and track threats to military bases ‘Growing demand’ sparks DOD to raise Palantir’s Maven contract to more than $1B DIU helping Navy get new AI capabilities for maritime operations centers FedScoop DefenseScoop CyberScoop StateScoop EdScoop AIScoop Newsletters Advertise with us Ad specs (202) 887-8001 hello@defensescoop.com FB TW LinkedIn YT"}