{"id": 1045, "name": "New York Times", "domain": "nytimes.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.nytimes.com/interactive/2025/06/10/us/politics/trump-immigrant-family-deportation-journey.html", "title": "Trump Immigrant Family Deportation Journey.html", "content": "**Detention and Deportation as Seen Through a Family Group Chat** A Venezuelan man’s criminal past made him a target of immigration agents. His family was determined to stay in touch. Saul Martinez for The New York Times ByAllison McCann Share full article On Feb. 15, Carlos Enrique Itriago Arevalo put on a mint-green softball uniform, ate a bowl of cornflakes and rushed out the door to his rec league game. It was early, just after 7 a.m., and his wife and 9-year-old son were still asleep. He was in such a hurry that he forgot his phone. He didn’t make it past the gates of his Florida housing complex before multiple Immigration and Customs Enforcement agents pulled him over. Carlos never made it to the game. His teammates began to worry, calling and texting him several times that day. Missed audio call Where are you !?!?!?! Papi, are you ok? where are you Carlos knew he fit the profile of a “criminal alien” the Trump administration had pledged to target. Not long after coming to the United States from Venezuela, he had been convicted of fraud. But he had served his sentence and, years later, had been granted relief from deportation in the form ofTemporary Protected Status. “I was never worried about it — about being deported — because I had T.P.S.,” he said. About an hour after his arrest, Carlos called his wife, Emily, from the ICE offices in Jacksonville and told her what had happened. He warned her not to put herself or the rest of their family, all recent immigrants from Venezuela, at risk by coming to see him. In the family group chat, Emily was despondent. There’s nothing we can do 😭 Why not? He said that we shouldn’t go there… We shouldn’t go there because ICE took him. I don’t know, don’t know, I didn’t understand him well Ok, that’s fine, but we still have to find out what can be done The Itriago Arevalo family, like many recent immigrant families, is extremely close. A walking path of turf patches connects their two family homes. One was shared by Carlos, Emily and their son; the other by his parents, two brothers, sister-in-law and niece. Carlos’s wife, Emily, and their son at home in Jacksonville in May. Saul Martinez for The New York Times Most of them had overstayed their visas and later sought protection from deportation under the Biden administration, which offered new legal pathwaysfor Venezuelansfleeing their nation’s political and economic crisis. President Trump had promised a sweeping crackdown on undocumented immigrants and a reversal of many Biden-era protections, including the extension of T.P.S., which Republicans had opposed. But Mr. Trump was barely a month in office when Carlos was arrested. The Supreme Court would not allow the administration toproceed with ending the program’s protectionsuntil May. The family was not sure whether Carlos’s criminal record meant he had been specifically targeted that Saturday, or picked up randomly. How come they got to him directly? He didn’t even have a phone That’s what we don’t know Over the next few months, as Carlos was moved to three detention facilities across three states, the family members kept one another updated about his situation through text and audio messages on WhatsApp. These messages, shared with The New York Times, show a family caught up in Mr. Trump’s aggressive immigration enforcement. (The messages were translated from Spanish and in some cases condensed for clarity.) They grappled with the turmoil of Carlos’s abrupt detention and the threat of his deportation. They watched what was happening toother Venezuelansand worried about what it could mean for their own status. They struggled to understand the law, and how to help Carlos without endangering themselves. LET’S KEEP PRAYING FOR CARLOS ENRIQUE ITRIAGO’S RELEASE Just like that 🙏 🙏 **2016 – 2024** **Separation and Reunion** Carlos first came to the United States in 2016 when he was 25, leaving behind Emily and their son, who was barely 10 months old. Venezuela was on thebrink of economic collapse, and Carlos said he needed to find work. He got a tourist visa and planned to stay for just a few months. His visa did not allow him to work legally, but he got a job as a dishwasher at a pizzeria in Brooklyn. He returned on the same visa in April 2017, heading to Chicago for another dishwashing job. “That’s when I met some crazy people,” he recalled. August 2016Carlos in front of the Statue of Liberty. He captioned the photo on Instagram, “A second dream come true.” Courtesy of Carlos Itriago Arevalo Within a few months, Carlos was arrested in Jacksonville with a group of others accused of using A.T.M. skimming devices to collect credit and debit card numbers to make fraudulent purchases. He knew it was wrong, but said he had used some of the stolen money to send food and other items back home. He pleaded guilty to three felonies and was sentenced to five years in a Florida prison. From there, he applied for asylum, saying he feared returning to violence in Venezuela. His case was denied, and in December 2021 a judge ordered him removed. Back in Venezuela, the economic and political situationcontinued to deteriorate, and most of Carlos’s immediate family emigrated to the United States. His brothers came in 2018, and his parents in 2022. They all applied for asylum, too. When Carlos was released from prison in January 2022, he was promptly picked up by immigration authorities. But deportation flights to Venezuela had been halted, and after a few months in detention, like many nonviolent offenders, Carlos was released. He said he went to his first check-in with ICE that June but was told to reschedule, and then he never heard back. He got a job off the books painting houses and soon started his own house-painting business. He grew a small social media following by posting photos and videos of his jobs in the familiar H.G.T.V. before-and-after style. “When I work, I am four people at once,” he joked. April 2023Carlos promoted his house-painting business on Instagram. Courtesy of Carlos Itriago Arevalo Later that year, Emily and their son crossed the border in Brownsville, Texas, and turned themselves over to immigration authorities. They were given a notice to appear at the ICE offices in Jacksonville. In 2023, President Joseph R. Biden Jr. extended T.P.S. for Venezuelans in the United States, citing unsafe conditions that would make it difficult for them to return home. Everyone in the Itriago Arevalo family applied. Carlos thought T.P.S. would be a long shot for him. The application asked about prior felony convictions, and he marked “Yes.” When U.S. Citizenship and Immigration Services followed up to request more information about his criminal history, he provided more details. He included affidavits from each member of his family, attesting to his changed character and the importance of remaining in the United States with his wife and young son. November 2024Carlos, Emily and their son at home in Jacksonville. Courtesy of Carlos Itriago Arevalo Everyone but Carlos was approved for T.P.S. in 2023. “I felt calm and confident that I could have protection in this country and to do things correctly,” Emily recalled. T.P.S. allowed the rest of the family members to live and work legally. They found jobs — construction, landscaping, cleaning — and Carlos’s son and niece enrolled in public school. They paid taxes and saved up for family trips to Florida’s amusement parks. They settled into life in America. They let themselves relax. Almost a year later, in September 2024, they were surprised when Carlos received his approval letter in the mail. The document contained a guarantee: While you are under Temporary Protected Status, you will not be removed from the United States. Courtesy of Carlos Itriago Arevalo **Feb. 15 – March 22** **Life in Detention** When Carlos was detained, his family thought he might have a chance of being released — or at least not deported — because of his T.P.S. Katisuca [a nickname for Emily] just told me that Carlos texted her and that he needs a lawyer that can defend his T.P.S. That means that if he is saying so, it’s because there is a possibility that they can respect his T.P.S. He’s telling Katiusca to look for a lawyer, but one that doesn’t charge. I think that we should defend Carlos’s fight doing what needs to be done. If we must spend money, we spend it, but we cannot hand him over without a fight. What do you all say? Totally agree. We should get a lawyer. Yes, of course 🙏🏽 Carlos said lawyers from the A.C.L.U. and the University of Miami law school visited him and other detainees at Baker County Detention Center, but no one agreed to take his case. “I explained that I had T.P.S., I gave them my T.P.S. number,” he said. “They said, ‘Oh we’ll check it out, we’ll let you know.’ ” Immigration lawyers who reviewed Carlos’s case at the request of The Times said this was most likely because it appeared the protection had been granted in error — felons are ineligible to receive T.P.S. Legally, they said, the government was still required to reopen the case and withdraw his status before deporting him. Carlos studied to learn his rights, spending much of his time in detention researching on the tablets available to them and taking detailed notes, which he later mailed to Emily. In one letter, he described how crowded the facility had become. Since 3/10/2025 overcrowding has begun in the detention center where dormitories have a capacity of 32 people, they have been taken up to 40 people, with people sleeping outside the cells without a right to privacy, bathing or going to the bathroom. Courtesy of Carlos Itriago Arevalo Carlos said that detainees were frequently mistreated and that guards routinely pepper sprayed and hit them, accusations a spokesperson for the Department of Homeland Security denied. Since 2017, more than 135 complaints have been reported documenting mistreatment and abusive conditions at Baker,according to the A.C.L.U. of Florida. Laundry and hygiene is completely gross. Soap and detergent are not used in clothes, which is why clothes and sheets are brown, so you can’t see the dirt. NO SOAP, NO DETERGENTS! Courtesy of Carlos Itriago Arevalo “Baker is worse than any place I’ve been,” Carlos said. “I tell everybody, I prefer to be in prison than in Baker.” Carlos called Emily every day. They talked about how their son was doing, and how Emily would manage the rent — about $1,000 a month — on her income from cleaning houses. They decided she would have to rent out their second bedroom. All the while, his family kept working to find him a lawyer. But they were quoted fees of $5,000 to $10,000, sums they said they could not afford. **March 22 – April 14** **Florida to Louisiana** After an initial wave of arrests in February, many Venezuelans were lingering in immigrant detention as the country reversed course onwhether it would accept deportation flights. Carlos spent more than a month at Baker in limbo. By early March, the family said they had given up trying to find him a lawyer. Carlos’s work boots left behind in Jacksonville. Saul Martinez for The New York Times Then on March 15, Mr. Trump issued an executive order invoking theAlien Enemies Act of 1798, a wartime law he wanted to use to — without a court hearing — detain and deport Venezuelans accused of being gang members. A week later, Carlos was awoken at 5 a.m. and told to pack up. A cellmate from Baker called Emily to let her know. A guy that was with him in the same room just called me. They still got him over there in Baker, but they are going to move him soon. They told him they are going to take him to Louisiana. I actually don’t know where that is. Close to Texas 😭😭 Oh my God, the worst thing is where they take him after that. Carlos was being transferred to Richwood Correctional Center, a private detention facility in Monroe, La., about a 10-hour bus ride away. The food was better, at least, Carlos said, but the roughly 1,000-person facility made Baker feel quaint in comparison. Detainees were stacked in three-tiered beds, and toilets were inside the rooms where they slept. There were no books, but there was one Playstation. Phone calls were 38 cents per minute — nearly twice as much as what they cost at Baker. In one video chat Emily recorded, Carlos can be seen trying to show her how there were only a few tables for dozens of detainees. “You have to stand up and eat, like a chicken,” he said. **April 14 – April 23** **One Week in Texas** Emily said she started to worry that Carlos was going to be taken somewhere other than Venezuela. She had seen the news that more than 200 Venezuelans had beensent to a prison in El Salvador. Juana, Carlos was moved During the night, it seems He said he was going to call but he didn’t On April 14, Emily began to panic when she had not heard from him for the entire day. Just before 10 p.m., he finally called. Carlos just called me. He was moved to Texas Ok what else did he tell you? What did they tell him? I asked him what are they telling him; “We don’t know anything”, “We don’t know why you’re all here”, “We don’t know when you’ll get out”, “We know nothing”, as if trying to stop them from asking more These people are so mean, really Carlos had been moved to the El Valle Detention Facility in Raymondville, Texas, but he did not stay long. A week later, he was moved again — this time to the airport. He called me and said that he doesn’t know where they are taking him Shit, god willing it won’t be somewhere else. It won’t be El Salvador, if it’s not directly to Venezuela No negative thoughts Think positively, hold on to God who can do everything Carlos said he was afraid. Detainees were not told where they were going, he said, and the window shades were drawn for the entire flight. The plane made three stops — Miami; Guantánamo Bay, Cuba; and finally Honduras — where Venezuelan authorities sent their own plane to transport the detainees on their final leg. Nobody had heard from Carlos in almost 48 hours. His whereabouts were not listed in theICE detainee locator system. Emily started scrolling, scouring social media and Venezuelan news sites for any updates. Late that night, she came across avideo on TikTokfrom a Venezuelan journalist reporting on the arrival of 174 deportees to Caracas. There, wearing his mint-green softball uniform, was Carlos. Hylenne Gonzálezvia TikTok “I actually felt calm because they had sent him to Venezuela and not another country,” Emily said. “But I also felt very sad to see the story repeated — of us being separated in different countries — after fighting so hard for the three of us to be together again.” **May 2025** **Life After Deportation** Carlos is living with Emily’s parents in Caracas, in a different neighborhood from where he grew up. Emily shipped him his work tools in the hopes that he can start painting houses again, though he doesn’t know if his business can survive in Venezuela. In May, Emily and their son traveled to Orlando for their initial asylum hearing. They were given a date in May 2026 for their next court appearance. At this point, the family is unsure of how or whether they will reunite. They have talked about moving somewhere else, maybe to Spain, where thousands of Venezuelans have sought asylum in recent years. But they’re reluctant to move their son; he loves his school and his baseball team in Jacksonville. They text and talk daily, and everyone makes sure to send Carlos updates from his son’s games. That’s amazing, 3 pitches, he made the three outs Just like that Your son is trying to look like a star 😂 More than 90 days after he was arrested and about a month after he landed back in Caracas, Carlos got a notice saying his T.P.S. had been withdrawn. The Supreme Court has allowed the Trump administration to move forward inrevoking T.P.S. from more than 350,000 Venezuelans— including from the eight members of the Itriago Arevalo family who remain in the United States. They hope their pending asylum cases will protect them from removal, for now. Carlos’s mother, Juana, at home in Jacksonville. Saul Martinez for The New York Times Share full article Produced by Rebecca Lieberman. Víctor Rogelio Hernández Marroquín and Grégory Escobar contributed translation and reporting from Mexico City, and Isayen Herrera from Caracas, Venezuela. Share full article Advertisement **Site Index** **Site Information Navigation** ©2025The New York Times Company NYTCo Contact Us Accessibility Work with us Advertise T Brand Studio Your Ad Choices Privacy Policy Terms of Service Terms of Sale Site Map Canada International Help Subscriptions Manage Privacy Preferences"}