{"id": 769, "name": "KOAM News Now", "domain": "koamnewsnow.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.koamnewsnow.com/lifestyle/winter-weather-safety-tips-to-protect-yourself-and-loved-ones/article_cb8f3cb2-6b93-50ec-a43c-aeec291fd494.html", "title": "Winter Weather Safety Tips To Protect Yourself And Loved Ones", "content": "About Us Contact Us Meet the Team Email & Alerts Apps Join KOAM Team Find Local Jobs Programming Morning Show Joplin News First 4-States In Depth National & World Politics Elections Election Results Money Health Medically Speaking Education Forecast Radar Alerts Closings Sky Cams Water Levels Weather Call Pro Sports MLB Baseball Schedule High School Sports College Sports Pigskin Preview Events Welcome Home Hero Fund USA Flag Swap Submit Photos / Videos 4-State Heroes Birthdays Contests Pets Mr. Food Food News Technology Entertainment Ways to Watch KOAM Presents Programming Facebook Twitter YouTube Instagram 69° Site searchSearch Site searchSearch Site searchSearch Joplin Pittsburg News Weather Sports Community Obituaries Watch **KOAM+ 24/7 News** Live updates all day, breaking news as it happens and weather every 10 minutes Resize: **RAW: FILE: TRUMP SAYS HE WILL PHASE OUT FEMA** **RAW: FILE: TRUMP SAYS HE WILL PHASE OUT FEMA** **NC: CHASE RICE HELPS GIVE HOME TO HELENE FAMILY** **NC: CHASE RICE HELPS GIVE HOME TO HELENE FAMILY** **10 PM Newscasts - June 10** **10 PM Newscasts - June 10** Stacie Strader Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Winter weather safety tips to protect yourself and loved ones** **Courtesy of the Centers for Disease Control and Prevention at CDC.gov.** By Site staff Jan 10, 2020 Jan 10, 2020UpdatedJan 4, 2024 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save (KOAM) - When winter hits, its frigid temperatures, ice and snow can be challenging. Especially behind the wheel. But a little preparation now can help all of us stay safe. (Related:Winter Weather Definitions) Stay Safe Indoors Protect yourself and your loved ones during a winter storm. Take extra steps to make sure you heat your home safely and follow the tips below. Heat your home safely. If you plan to use a wood stove, fireplace, or space heater, be extremely careful. Follow the manufacturer’s instructions and remember these safety tips: Turning on the stove for heat is not safe; have at least one of the following heat sources in case the power goes out:Extra blankets, sleeping bags, and warm winter coatsFireplace that is up to code with plenty of dry firewood or a gas log fireplacePortable space heaters. Extra blankets, sleeping bags, and warm winter coats Fireplace that is up to code with plenty of dry firewood or a gas log fireplace Portable space heaters. Extra blankets, sleeping bags, and warm winter coats Fireplace that is up to code with plenty of dry firewood or a gas log fireplace Portable space heaters. Use electric space heaters with automatic shut-off switches and non-glowing elements. Make sure to keep them away from any flammable materials, like curtains or blankets. Use fireplaces, wood stoves, or other combustion heaters only if they are properly vented to the outside and do not leak gas from the flue or exhaust into the indoor air space. Have your heating system serviced by a qualified technician every year. Do not burn paper in a fireplace. Make sure you have proper ventilation if you must use a kerosene heater. Use only the type of fuel your heater is designed to use—don’t substitute. Keep heat sources, like space heaters, at least 3 feet away from drapes, furniture, or bedding. Never cover your space heater. Never place a space heater on top of furniture or near water. Never leave children unattended near a space heater. Make sure that the cord of an electric space heater is not a tripping hazard, but do not run the cord under carpets or rugs. Avoid using extension cords to plug in your space heater. If your space heater has a damaged electrical cord or produces sparks, do not use it. Light your home safely. If there is a power failure: Use battery-powered flashlights or lanterns rather than candles, if possible. Candles can lead to house fires.If you do use candles, never leave lit candles unattended. If you do use candles, never leave lit candles unattended. If you do use candles, never leave lit candles unattended. VisitWhat You Need to Know When the Power Goes Out Unexpectedlyfor more information on power outage safety. Use generators and other appliances safely. Generators should be located at least 20 feet from any window, door, or vent and in a space where rain and snow will not reach them. Protect yourself fromcarbon monoxide (CO) poisoningby installing a battery-operated CO detector. Never using generators, gas or charcoal grills, camp stoves, or similar devices inside your home, in basements, in garages, or near windows. The fumes are deadly. Plug in appliances to the generator using individual heavy-duty, outdoor-rated extension cords. Do not use the generator or appliances if they are wet. Do not store gasoline indoors where the fumes could ignite. Conserve heat. Some gas-fueled heaters, such as vent-less gas fireplaces, require some ventilation. Otherwise, if you don’t need extra ventilation, keep as much heat as possible inside your home. Avoid unnecessarily opening doors or windows. Close off unneeded rooms. Stuff towels or rags in cracks under doors. Close draperies or cover windows with blankets at night. Make sure babies and older adults stay warm. Babies Infants less than one year old should never sleep in a cold room because they lose body heat more easily than adults. Follow these tips to keep your baby safe and warm during the extreme cold: Remove any pillows or other soft bedding. These can increase the risk of smothering andSudden Infant Death Syndrome (SIDS). Dress babies in warmer clothing such as footed pajamas, one-piece wearable blankets, or sleep sacks. Try to maintain a warm temperature inside your home. If you’re not able to keep your home warm, make temporary arrangements to stay elsewhere. In an emergency, you can keep your baby warm using your own body heat. If you must sleep, take precautions to prevent rolling on or smothering your baby. Older Adults Older adults often make less body heat because of a slower metabolism and less physical activity. Check on elderly friends and neighbors often to make sure their homes are heated properly. If you are over 65 years of age, check the temperature in your home often during extremely cold weather. Keep a water supply. Extreme cold can cause water pipes in your home to freeze and sometimes rupture or break. When you are expecting very cold or freezing temperatures: Leave all water taps slightly open so they drip continuously. Keep the temperature inside your home warm. Allow heated air to reach pipes. For example, open cabinet doors beneath the kitchen and bathroom sinks. If your pipes do freeze, do not thaw them with a torch. Thaw the pipes slowly with warm air from an electric hair dryer.If you cannot thaw your pipes, or the pipes have broken open, use bottled water or get water from a neighbor’s home. If you cannot thaw your pipes, or the pipes have broken open, use bottled water or get water from a neighbor’s home. If you cannot thaw your pipes, or the pipes have broken open, use bottled water or get water from a neighbor’s home. As an emergency measure, if no other water is available, snow can be melted for water. Bringing water to a rolling boil for one minute will kill most germs but won’t get rid of chemicals sometimes found in snow. VisitKeep Food and Water Safe After a Disaster or Emergencyto learn more. Eat well-balanced meals and avoid alcoholic or caffeinated drinks. Eating well-balanced meals will help you stay warmer. Do not drink alcoholic or caffeinated beverages—they cause your body to lose heat faster. Instead, drink warm, sweet beverages or broth to help keep yourself warm. If you have any dietary restrictions, ask your doctor. Stay Safe Outdoors Try to stay indoors during extremely cold weather. Make any trips outside as brief as possible and remember these tips below to protect your health and safety. Dress warmly and stay dry Adults and children should wear a hat a scarf or knit mask to cover face and mouth sleeves that are snug at the wrist mittens (they are warmer than gloves) water-resistant coat and boots several layers of loose-fitting clothing Layer-up Inner Layer:Wear fabrics that will hold more body heat and don’t absorb moisture. Wool, silk, or polypropylene will hold more body heat than cotton. Insulation Layer:An insulation layer will help you retain heat by trapping air close to your body. Natural fibers, like wool, goose down, or a fleece work best. Outer Layer:The outermost layer helps protect you from wind, rain, and snow. It should be tightly woven, and preferably water and wind resistant, to reduce loss of body heat. Dress warmly before you go outside in cold weather. Additional Tips: Stay dry—wet clothing chills the body quickly. Excess sweating will cause your body to lose more heat, so remove extra layers of clothing whenever you feel too warm. Avoid getting gasoline or alcohol on your skin while de-icing and fueling your car or using a snow blower. Getting these materials on your skin will cause your body to lose a lot more heat. Do not ignore shivering—it’s an important first sign that your body is losing heat. Constant shivering is a sign that it is time to go inside. Know the signs of frostbite and hypothermia. Hypothermia Hypothermia(abnormally low body temperature) is a dangerous condition that can happen when a person is exposed to extremely cold temperatures. In adults, warning signs of hypothermia include shivering, exhaustion or feeling very tired, confusion, fumbling hands, memory loss, slurred speech, and drowsiness. In babies, signs include bright red, cold skin, and very low energy. If you notice any of these signs, take the person’s temperature.If it is below 95° F, the situation is an emergency—get medical attention immediately. Frostbite Frostbiteis a type of injury caused by freezing. It can lead to a loss of feeling and color in the areas it affects, usually the nose, ears, cheeks, chin, fingers, and toes. Frostbite can permanently damage the body, and severe cases can lead to amputation (removing the affected body part). Signs of frostbite include a white or grayish-yellow skin area, skin that feels unusually firm or waxy, and numbness.If you notice signs of frostbite, seek medical care. Stay off the ice. Walking on ice is extremely dangerous. Many injuries related to cold weather happen from falls on ice-covered sidewalks, steps, driveways, and porches. Keep your steps and walkways as free of ice as possible by using rock salt or another chemical de-icing compound. Sand may also be used on walkways to reduce the risk of slipping. Avoid exerting yourself and stay safe during cleanup. Cold weather puts an extra strain on the heart. If you have heart disease or high blood pressure, follow your doctor’s advice about shoveling snow or performing other hard work in the cold. Otherwise, if you have to do heavy outdoor chores, dress warmly and work slowly to avoid excess sweating. Remember, your body is already working hard just to stay warm, so don’t overdo it. Be safe during outdoor activities. Let your friends and family know where you will be before you go hiking, camping, or skiing. Do not leave any areas of your skin exposed to the cold. Try not to sweat or become too tired. Be prepared to take emergency shelter. Pack dry clothing, a two-way radio, waterproof matches, and paraffin fire starters with you. Do not use alcohol and other mood-altering substances and avoid caffeinated drinks. Avoid walking on ice or getting wet. Carefully watch for signs of cold-weather health problems, like hypothermia and frostbite. Be careful while traveling. Listen for radio or television reports of travel advisories issued by theNational Weather ServiceExternal. Do not travel in low visibility conditions. Avoid traveling on ice-covered roads, overpasses, and bridges if at all possible. Never pour water on your windshield to remove ice or snow—this can cause your windshield to shatter. If you must travel by car, use tire chains and take a mobile phone with you. If you must travel, let someone know your destination and when you expect to arrive. Ask them to notify authorities if you are late. Check and restock thewinter emergency supplies in your carbefore you leave. Always carry extra warm clothing and blankets with you. Don’t rely on a car to provide enough heat. The car could break down. If you get stranded: Staying in your car when stranded is often the safest choice if winter storms create poor visibility or if roadways are ice covered. These steps will increase your safety when stranded: Tie a brightly colored cloth to the antenna as a signal to rescuers and raise the hood of the car (if it is not snowing). Move anything you need from the trunk into the passenger area. Wrap your entire body, including your head, in extra clothing, blankets, or newspapers. Stay awake. You will be less vulnerable to cold-related health problems. Run the motor (and heater) for about 10 minutes per hour, opening one window slightly to let in air. Make sure that snow is not blocking the exhaust pipe—this will reduce the risk of carbon monoxide poisoning. As you sit, keep moving your arms and legs to improve your circulation and stay warmer. Do not eat snow because it will lower your body temperature. Huddle with other people for warmth. Winter Weather Safety Tips are courtesy of Centers for Disease Control and Prevention atCDC.gov. Content source:National Center for Environmental Health (NCEH),Agency for Toxic Substances and Disease Registry (ATSDR),National Center for Injury Prevention and Control (NCIPC) KOAM Winter Weather Tips - Definitions and Safety COPYRIGHT 2022 BY KOAM NEWS NOW. ALL RIGHTS RESERVED. THIS MATERIAL MAY NOT BE PUBLISHED, BROADCAST, REWRITTEN OR REDISTRIBUTED. Facebook Twitter WhatsApp SMS Email Print Copy article link Save **KOAM Winter Weather Tips – Definitions and Safety2.51MB** Cdc Koam Safety Tips Weather Winter **Most Popular** Beaver Lake Dam all spillways open, “rare and powerful sight!” Arkansas escapee captured; Grant Hardin transferred to Varner SuperMax Prison B&B Theatres 8-screen luxury theater construction continues in Joplin Two separate house fires in Carterville during T-Storms; Lightning to blame Jacob Misiorowski called up to Milwaukee Brewers' MLB roster **Latest News** Joplin residents react to locked storm doors Jacob Misiorowski called up to Milwaukee Brewers' MLB roster Rolling Into Summer: ‘Ramp Camp’ Welcomes First Campers Pitt State football to face Northwest MO in Kansas City Pittsburg residents react to U.S. 69 plans More News **TOP VIDEOS** Facebook Twitter LinkedIn YouTube TikTok Instagram Watch Now! View Archive Advertise Email Alerts Submission Forms Events Contests Search News Weather Sports Obituaries Community Lifestyle Watch Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}