{"id": 658, "name": "How Stuff Works", "domain": "howstuffworks.com", "bias": "center", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://science.howstuffworks.com/innovation/famous-inventors/who-was-rube-goldberg-and-what-are-his-contraptions.htm", "title": "Who Was Rube Goldberg And What Are His Contraptions.htm", "content": "Science Tech Home & Garden Auto Culture Health Money Animals Lifestyle Entertainment Quizzes Coupons Advertisement **Rube Goldberg: The Man Behind the Ingenious Contraptions** Share Content on Facebook Share Content on LinkedIn Share Content on Flipboard Share Content on Reddit Share Content via Email Ever seen a Rube Goldberg machine? A Rube Goldberg machine is a super-cool, complex contraption that performs a simple task in a ridiculously complicated manner. For example, want to know how to get rid of a mouse? Simple — there's a Rube Goldberg machine for that. It's a mouse trap that lures the mouse with a painting of a piece of cheese. It causes the mouse to step onto a hot stove, jump to an escalator, fall on a boxing glove, and get knocked into a rocket that sends him to the moon. What could be easier? Advertisement What Is a Rube Goldberg Machine? Who Was Rube Goldberg? How Did Rube Goldberg Machines Influence Modern Society? **What Is a Rube Goldberg Machine?** The mouse trap was one of many chain reaction inventions by Reuben Goldberg, a \"rock star\" American cartoonist of the early 1900s,according to Renny Pritikin, former chief curator at theContemporary Jewish Museumin San Francisco. Goldberg drew thousands of drawings of wacky inventions that were syndicated in newspapers all over the United States. His name became synonymous with entertainingly absurd chain reaction machinery that complicates simple tasks. In 1931, the Merriam-Webster Dictionary included the entry \"Rube Goldberg,\" making Goldberg the only person whose name is listed as an adjective in the dictionary,according to Smithsonian.com. Advertisement **Who Was Rube Goldberg?** Rube Goldberg, who was born in San Francisco in 1883, was originally an engineer. He graduated from the College of Mining Engineering at the University of California at Berkeley in 1904. For six months he mapped water and sewer lines until he could stand it no longer. He then took a lower-paying job cartooning at the San Francisco Chronicle. Advertisement \"What he cared about most was if he made you laugh,\" said his granddaughter Jennifer George, whom we spoke to in 2018. Her 2013 book, \"The Art of Rube Goldberg,\" describes his extensive output of cartoons, writing and even sculpture, before his death in 1970. Goldberg left California for New York in 1907 and was hired by the New York Evening Mail. One of his early cartoons for the newspaper showed a badly injured man who had fallen from a 50-story building and a woman asking \"Are you hurt?\" The man replied \"No, I am taking my beauty sleep.\" It was a hit, and over the next two years he drew 449 more in the Foolish Questions series. Readers loved sending in suggestions. He also created a series called \"I'm the Guy.\" It featured statements such as \"I'm the guy who put the hobo in Hoboken\" and \"I'm the guy who put the sand in the sandwich,\" starting a national fad. Among his cartoon characters was Boob McNutt, who always managed to screw up as he attempted to help someone. Goldberg's invention drawings began in 1912 and made him into a household name, according to anexhibit at the Contemporary Jewish Museumin San Francisco. The first of his elaborate contraptions was \"The Simple Mosquito Exterminator,\" a classic Rube Goldberg machine. A mosquito enters window, walks along a board strewn with small pieces of steak, falls unconscious because of chloroform fumes from a sponge, and falls on platform. He wakes up, looks through the telescope to see the reflection of a bald head in a mirror, and jumps in fear off spring-board through, killing himself when he hits the mirror, falling dead into can. For the next 20 years, Goldberg provided a new Rube Goldberg machine about every two weeks. He continued on a less frequent basis until 1964. He inventedthe character Professor Lucifer Gorgonzola Butts, who created his own machines to open screen doors, shine shoes and find soap dropped from the bathtub. According to \"The Art of Rube Goldberg,\" the character was inspired by two professors that Goldberg found particularly boring at the College of Mining Engineering: Samuel B. Christy, who lectured at length on time-and-motion efficiency, and Frederick Slate, who once showed students the \"barodik,\" a convoluted machine meant to measure the weight of Earth. The invention cartoons mocked \"the elaborate world of machinery,\" wrote Adam Gopnik in his introduction to the book, by mocking the \"larger idea of efficiency.\" Goldberg had \"a poetic intuition common to all great cartoonists,\" Gopnik wrote. Advertisement **How Did Rube Goldberg Machines Influence Modern Society?** He was an early voice questioning the use to which technology is put. His work questioned the benefits of supposed labor-saving devices. Instead of simplifying life, they complicate it, Pritikin said. A Rube Goldberg machine was a comment on technology and its ability to mess things up. Complicated technology often takes the place of simple machines. The theme is pertinent today, says Pritikin, because in the rush to create and sell new technology \"we are ignoring a public conversation: Is this good for us or not?\" In 1938, Goldberg started drawing political cartoons. In them, he began to comment on the rise of fascism. \"He got a lot of criticism for it,\" including threats to himself and his family, Pritikin said. Advertisement Among his famous political cartoons was a scene in a Middle Eastern desert. Two figures trudge along two parallel paths that never meet. One figure is labeled \"Arab\" and the other \"Jew.\" A 1947 cartoon shows a small house balanced on an enormous nuclear missile balanced on a precipice. The title is \"Peace Today.\" This cartoon won a Pulitzer Prize. \"He had a huge impact on his time culturally,\" Pritikin said. \"Cartoonists were immensely popular. They were really cultural heroes.\" The Rube Goldberg machine lives on today in theRube Goldberg Machine Contest, which pits school kids who love Rube Goldberg machines against each other in an effort to design and complete the most complicated chain reaction machines to perform a simple task. Seesome of their efforts on YouTube. Advertisement Please copy/paste the following text to properly cite this HowStuffWorks.com article: Advertisement Advertisement Advertisement Advertisement Advertisement"}