{"id": 36, "name": "KGO - ABC7 News", "domain": "abc7news.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abc7news.com/post/Costco-shopper-sues-for-14-million-after-display-cabinet-allegedly-falls-causing-brain-injury-sonoma-county-california-according-to-lawsuit/16717270/", "title": "Costco Shopper Sues For 14 Million After Display Cabinet Allegedly Falls Causing Brain Injury Sonoma County California According To Lawsuit", "content": "BUSINESS **Costco shopper sues for $14 million after display cabinet allegedly falls, causing brain injury** Her lawyer claims Costco refused to share footage of the cabinet falling. SANTA ROSA, Calif. --A woman in California is suing Costco for more than $14 million after a heavy liquor cabinet display allegedly fell on her, causing severe injuries. The shopper, Sadie Novotny, filed the lawsuit against Costco Wholesale Corporation following the March 22 incident at the company's Santa Rosa store in northern California. According to court documents, Novotny was walking down an aisle when she alleges a large, heavy cabinet used to display liquor suddenly toppled onto her. The lawsuit claims Novotny suffered multiple severe and permanent injuries, including a traumatic brain injury. She is seeking $9 million for pain and suffering, $5 million for emotional distress and additional damages for medical expenses and lost wages. The case, originally filed in Alameda County Superior Court, has been moved to federal court at Costco's request. A case management conference is scheduled for Sept. 4 at the San Francisco Federal Courthouse. According to the lawsuit, the cabinet was displayed on what's described as a defective or worn wooden pallet. The filing argues that this created an unsafe situation for shoppers, claiming the display was \"set up in an unreasonably dangerous manner.\" The lawsuit alleges Costco failed to properly inspect and maintain the display, arguing the company should have known about the danger and either fixed it or warned customers about the risk. ABC News has reached out to Costco Wholesale Corporation for comment. Claude Armand Wyle, Novotny's attorney, claimed to ABC News that a Costco representative told him they have a video of the incident, but won't send it to him to review. \"The employee told me that the video didn't happen the way I explained it,\" Wyle said. \"I told her, 'Well, send it.' She then said, 'Oh no, you can only get that video through discovery.'\" \"That meant I had to file a lawsuit,\" he added. \"I couldn't investigate any further. I was stuck. If I wanted to get to the truth, I had to file a lawsuit.\" Wyle told ABC News that Novotny went to the hospital an hour after the incident after she told her husband she felt \"really bad.\" \"When she arrived at the hospital, doctors diagnosed her with a concussion,\" Wyle said. \"She suffered a head injury. We don't know how bad it is yet.\" Wyle said his client feels slightly better but still suffers from headaches and vision problems. The lawsuit is seeking compensation for current and future medical expenses, estimated at $2 million, along with lost earnings and future earning capacity losses of approximately $2 million. Additional damages are being sought for loss of household services. **Related Topics** BUSINESS SANTA ROSA COSTCO LAWSUIT HEALTH & FITNESS U.S. & WORLD **Top Stories** **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **'No Kings' protests against Trump to take place across Bay Area** **'No Kings' protests against Trump to take place across Bay Area** **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **New SF park to offer 'multi-sensory playground' experience** 37 minutes ago **New SF park to offer 'multi-sensory playground' experience** 37 minutes ago **California asks court to stop troops on ICE raids** 2 hours ago **California asks court to stop troops on ICE raids** 2 hours ago **Workers run from fields as ICE agents raid California farms** 3 hours ago **Workers run from fields as ICE agents raid California farms** 3 hours ago **CA state senator refuses to discuss senate bill, $100K+ advisor gig** **CA state senator refuses to discuss senate bill, $100K+ advisor gig**"}