{"id": 1340, "name": "De Telegraaf", "domain": "telegraaf.nl", "bias": "right", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.telegraaf.nl/entertainment/media/terwijl-bezuiniging-op-npo-excuus-is-om-in-datingshows-te-snijden-worden-er-nog-meer-besteld-wat-is-daar-de-publieke-waarde-van/71309467.html", "title": "Terwijl Bezuiniging Op Npo Excuus Is Om In Datingshows Te Snijden Worden Er Nog Meer Besteld Wat Is Daar De Publieke Waarde Van", "content": "**Terwijl bezuiniging op NPO excuus is om in datingshows te snijden, worden er nóg meer besteld: ’Wat is daar de publieke waarde van?’** Media22:00PremiumHet perfecte plaatje op reis: Irene Moors verleid door 23-jarige Italiaanse casanovaZes overgebleven deelnemers, zes camera’s, één missie: Toscane veroveren met hun creativiteit. Dat het mooie weer ze in Het perfecte plaatje op reis in de steek laat, mag de pret niet drukken. Irene Moors krijgt zelfs bijna verkering met een 23-jarige snelheidsduivel in een rode cabriolet. „We kunnen op Tinder.” Zes overgebleven deelnemers, zes camera’s, één missie: Toscane veroveren met hun creativiteit. Dat het mooie weer ze in Het perfecte plaatje op reis in de steek laat, mag de pret niet drukken. Irene Moors krijgt zelfs bijna verkering met een 23-jarige snelheidsduivel in een rode cabriolet. „We kunnen op Tinder.” Zes overgebleven deelnemers, zes camera’s, één missie: Toscane veroveren met hun creativiteit. Dat het mooie weer ze in Het perfecte plaatje op reis in de steek laat, mag de pret niet drukken. Irene Moors krijgt zelfs bijna verkering met een 23-jarige snelheidsduivel in een rode cabriolet. „We kunnen op Tinder.” Zes overgebleven deelnemers, zes camera’s, één missie: Toscane veroveren met hun creativiteit. Dat het mooie weer ze in Het perfecte plaatje op reis in de steek laat, mag de pret niet drukken. Irene Moors krijgt zelfs bijna verkering met een 23-jarige snelheidsduivel in een rode cabriolet. „We kunnen op Tinder.” Media20:53Regisseur Halina Reijn maakt modecampagne voor Givenchy met topmodel Kaia GerberHalina Reijn regisseert een modecampagne voor Givenchy met topmodel Kaia Gerber. Het Franse modehuis deelt op sociale media beeldmateriaal van achter de schermen. Halina Reijn regisseert een modecampagne voor Givenchy met topmodel Kaia Gerber. Het Franse modehuis deelt op sociale media beeldmateriaal van achter de schermen. Halina Reijn regisseert een modecampagne voor Givenchy met topmodel Kaia Gerber. Het Franse modehuis deelt op sociale media beeldmateriaal van achter de schermen. Halina Reijn regisseert een modecampagne voor Givenchy met topmodel Kaia Gerber. Het Franse modehuis deelt op sociale media beeldmateriaal van achter de schermen. Media17:06Yvon Jaspers maakt programma over Parkinson na diagnose broerYvon Jaspers werkt aan een programma over parkinson, nadat de ziekte een jaar geleden werd vastgesteld bij haar 43-jarige broer Willem. Met het maken van het programma voelt Jaspers zich alsof ze „in een spagaat zit”. Yvon Jaspers werkt aan een programma over parkinson, nadat de ziekte een jaar geleden werd vastgesteld bij haar 43-jarige broer Willem. Met het maken van het programma voelt Jaspers zich alsof ze „in een spagaat zit”. Yvon Jaspers werkt aan een programma over parkinson, nadat de ziekte een jaar geleden werd vastgesteld bij haar 43-jarige broer Willem. Met het maken van het programma voelt Jaspers zich alsof ze „in een spagaat zit”. Yvon Jaspers werkt aan een programma over parkinson, nadat de ziekte een jaar geleden werd vastgesteld bij haar 43-jarige broer Willem. Met het maken van het programma voelt Jaspers zich alsof ze „in een spagaat zit”. Media12:00PremiumTina Nijkamp: weg met De rijdende rechter, het werd tijd ookDe rijdende rechter is dinsdag na 30 jaar gestopt. Officieel trekken Omroep Max en de NPO de stekker eruit vanwege de bezuinigingen die op stapel staan, maar eerlijk is eerlijk: dit programma was al jaren klaar. Wat is er eigenlijk überhaupt publieke omroep aan? De rijdende rechter is dinsdag na 30 jaar gestopt. Officieel trekken Omroep Max en de NPO de stekker eruit vanwege de bezuinigingen die op stapel staan, maar eerlijk is eerlijk: dit programma was al jaren klaar. Wat is er eigenlijk überhaupt publieke omroep aan? De rijdende rechter is dinsdag na 30 jaar gestopt. Officieel trekken Omroep Max en de NPO de stekker eruit vanwege de bezuinigingen die op stapel staan, maar eerlijk is eerlijk: dit programma was al jaren klaar. Wat is er eigenlijk überhaupt publieke omroep aan? De rijdende rechter is dinsdag na 30 jaar gestopt. Officieel trekken Omroep Max en de NPO de stekker eruit vanwege de bezuinigingen die op stapel staan, maar eerlijk is eerlijk: dit programma was al jaren klaar. Wat is er eigenlijk überhaupt publieke omroep aan? Digitale krant Digitale krant Dag Nacht Self Service Privacy Abonneren De Telegraaf Copyright Mediahuis Nederland B.V. - Alle rechten voorbehouden"}