{"id": 1562, "name": "KTVF - Fairbanks News", "domain": "webcenterfairbanks.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.webcenterfairbanks.com/page/interior-wedding-showcase/", "title": "Interior Wedding Showcase", "content": "News Livestream Weather Contests Submit Photos and Video Submit Breaking News Programming Schedule Homepage NewsAPCourtCrimeEconomyEducationEntertainmentEnvironmentDigital NewsCenterHealthInternationalMissing PersonsNationalPoliticsState LegislatureStateSafetyFire & RescueMilitary Report AP Court Crime Economy Education Entertainment Environment Digital NewsCenter Health International Missing Persons National Politics State Legislature State Safety Fire & Rescue Military Report AP Court Crime Economy Education Entertainment Environment Digital NewsCenter Health International Missing Persons National Politics State Legislature State Safety Fire & Rescue Military Report News Live Stream SportsAthlete Of The WeekFishing Report Athlete Of The Week Fishing Report Athlete Of The Week Fishing Report WeatherWeather Calendar Sponsor LocationsKTVF Fab Photos Weather Calendar Sponsor Locations KTVF Fab Photos Weather Calendar Sponsor Locations KTVF Fab Photos CommunityCalendarGas TrackerNewsletterArctic GardensSchool Lunch Menu Calendar Gas Tracker Newsletter Arctic Gardens School Lunch Menu Calendar Gas Tracker Newsletter Arctic Gardens School Lunch Menu Promotions & EventsFill the BusMay No Child Go HungrySummer Activity FairSchool Lunch MenuCoat DriveHoliday Toy DriveInterior Wedding Showcase Fill the Bus May No Child Go Hungry Summer Activity Fair School Lunch Menu Coat Drive Holiday Toy Drive Interior Wedding Showcase Fill the Bus May No Child Go Hungry Summer Activity Fair School Lunch Menu Coat Drive Holiday Toy Drive Interior Wedding Showcase Contests Connect With UsSubmit Breaking NewsDownload Our AppsAdvertise With UsSubmit Photos Submit Breaking News Download Our Apps Advertise With Us Submit Photos Submit Breaking News Download Our Apps Advertise With Us Submit Photos About UsContact UsEmployment OpportunitiesProgramming Schedule Contact Us Employment Opportunities Programming Schedule Contact Us Employment Opportunities Programming Schedule Video NextGen TV Zeam - News Streams TV Signal Problems FAQs Submit Photos and Video Circle Country Gray DC Bureau PowerNation InvestigateTV Watching Your Wallet Digital Marketing **2025 KTVF Interior Wedding Showcase** KTVF is bringing the largest bridal expo to the Golden Heart City. Save the date. Everyone is invited to the 2025 Interior Wedding Showcase at the Westmark Hotel Gold Room in Fairbanks on Sunday, February 23, 2025 from 11 a.m. to 3 p.m. Plan and shop for your wedding in one place for the finest bridal products and services from Interior local businesses and businesses throughout the state. You will find jewelers, caterers, florists, photographers, DJs and everything you need to make your wedding dreams come true. Anderson’s Bride of Anchorage will present two fashion shows at the event. The first show is scheduled for noon and the second show is at 2 p.m. Door prizes will be announced throughout the day and one lucky couple is going to win a Stan Stephen’s Columbia Glacier Cruise for two. This free event is brought to you by KTVF, Anderson’s Bride, Ulta Beauty, Alaska Universal Productions, REVEL Event Services, and the vendors. 2025 INTERIOR WEDDING SHOWCASE REGISTERED VENDORS BUSINESS LISTINGS: 8 Star Event Center| 907.202.5901 | Event Center in Fairbanks Adam Kohl Films|907.987.0199 | Wedding Films Advance Printing Co.| 907.451.1111 | Printing Services - large variety of printing services Alaska Bride & Groom| 907.868.9050 | The Complete Alaska Wedding Guide Alaska Dreams, Inc.|907.455.7712 | Event Rentals Alaska Universal ProductionsAUP| 907.451.4833 | Full-service event company Anderson’s Bride|907.563.8839 | Bridal Attire from Anchorage Anytime Tea| 907.388.9919 | Tea set up for bridal showers/host dinner Audrey’s Womenswear| 907.456.5831 | Women’s Bridal attire Beyond the Box Photobooth| 907.451.0633 | Photobooth Rentals Calypso Farm & Floral| 907-978-4461 | Floral Arrangements and Bouquets Elizabeth Warlick Ballroom Dancer| 502.345.1354 | Wedding and Ballroom Dance Lessons Far North Tinctures LLC.| 907.322.7890 | Natural Health Remedies Fox Hollow Peonies| 907.590.9148 | Peony flowers & dried flower products Frank’s Menswear| 907.457.2009 | Men’s wedding attire Great Alaska Bowl Co.| 907.474.9663 | Alaska Wood Bowls Huffman Manor/Alaska Adventure Properties|907.388.3330 | Wedding venues Ice Aged Charcuterie| 907.347.8340 | Charcuterie boards and graze tables Mary Kay- Nina Elliot| Cosmetics Menadelook Carvings| 907-434-1701 | Ivory Jewelry and Carvings Midnight Sun Mobile Detailing| 727.292.1821 | Automotive & boat detailing ceramic coating services Mt. McKinley Bank| 907.451.4668 | Mortgage Lending Nice & Bella Jewelry|907.378.3496 | Fashion Jewelry North Pole Peonies|(907) 378-2636 |peony bouquet (in season) Revel Event Services| 907.451.7520 | Event Decorations and Rentals Ribbons & Brims| 907.388.0596 | Western Hat Bar, hats for brides and bachelorette parties Riverside Eats + Drinks| 907.978.6940 | Catering and bar services R-Tek Entertainment| 907.347.3505 | DJ Services Shannon Fortune St. Farm Insurance| 907.452.1385 | Insurance & Financial Services Sinfully Sweet Treats|907.987.8575 | Wedding Cake and Desserts Taylor’s Gold n Stones|907.456.8369 | Jewelry Tawny Nichelle Photography| 931-627-1441 | Photography The Alaska Club Fairbanks South| 907.452.6801 | Fitness center, pool, sauna, basketball & racquetball courts. Toast FBX| 907-378-2581 | Nutritious Handcrafted Gourmet Toast Two Wild Photography| 907.854.4904 | Wedding Photography Ulta Beauty|907.455.4305 | Hair & Make-up services and products Westmark Hotels| 907.456.7722 | Ballroom rentals, reception, & destination wedding services Sunday, February 23rd, 202511 AM - 3 PM LOCATION: Westmark Hotel Gold Room, 813 Noble St., Fairbanks Contact via email tomarlene.phillips@ktvf11.comor call 907.590.3334 Exhibit Space-All exhibitors must check in during setup hours (7:30 a.m. 10:45 a.m.) to ensure their space is correct. Failure of the exhibitor to attend the show still holds the exhibitor liable for full payment of space. The event is from 11 a.m. to 3 p.m. Please do not tear down before 3 PM. Contracted Businesses Only-Booth sharing or subleasing are not permitted. Every business that participates must have a signed contract with Interior Wedding Showcase. Electrical-Electric power is available on a first come, first serve basis. Exhibitor is responsible for bringing their own extension code and duct tape to the event. We ask that you tape down your extension cords for safety reasons. Insurance-Each exhibitor is responsible for their own business insurance for liability or damage. The exhibitor agrees to make no claim for any reason whatsoever against KTVF, Gray Television Group, and/or the Westmark Hotel in Fairbanks. KTVF/KXDF 3650 Braddock Street Fairbanks, AK 99701 (907) 458-1800"}