{"id": 1500, "name": "WMYD - Detroit News", "domain": "tv20detroit.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.tv20detroit.com/science-and-tech/animals-and-insects/rattlesnake-vs-bobcat-arizona-resident-captures-standoff-between-two-desert-predators", "title": "Rattlesnake Vs Bobcat Arizona Resident Captures Standoff Between Two Desert Predators", "content": "Menu TV Schedule Contests Contact Us TV20 Marketplace TV20 ShowcaseBlack History Month Black History Month Black History Month WMYD-TV Removal Requests Sign In Newsletters Sign Out Manage Emails Apps Careers Search **Rattlesnake vs. bobcat: Arizona resident captures standoff between two desert predators** An Arizona woman captured a short but intense video of a stand-off between two desert predators last week. Surveillance video taken outside of Terry Campbell's home in Oro Valley shows a tense interaction between a bobcat and a rattlesnake around 5 a.m. The bobcat swiftly approached the rattlesnake, which appeared to be attempting to camouflage itself. The rattlesnake begins shaking its rattle, a defense tactic the reptile will use before striking. Campbell said her home surveillance cameras capture various wildlife all the time. Her video of the bobcat and rattlesnake match only lasts 15 seconds, but she told the Scripps News Group in Tucson that one of her other cameras showed the bobcat \"strolling away\" just after. According to the Arizona-Sonora Desert Museum, bobcats are known predators of rattlesnakes, but they are not immune to their venom and could die if they're bitten. This story was originally published by Reyna Preciado with the Scripps News Group in Tucson. **7 News Detroit** **7 News Detroit** Home TV Schedule Detroit Weather Don't Waste Your Money Support WMYD-TV Removal Requests Sitemap Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application 1.0 Host Exhibit Public File Contact Accessibility Statement Closed Captioning Contact"}