{"id": 1668, "name": "Ancient Code", "domain": "ancient-code.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.ancient-code.com/are-the-mysterious-metallic-spheres-of-siberia-product-of-a-long-lost-ancient-civilization/#respond", "title": "Are The Mysterious Metallic Spheres Of Siberia Product Of A Long Lost Ancient Civilization", "content": "Nikola Tesla, Ether, Antigravity and harnessing the power of the universe 23 mind-boggling facts about the Ancient Egyptian Civilization The mysterious Fawn Hoof Mummy: Ancient Egyptian Presence in North America Fascinating video filmed in 69′ by Armstrong reveals Ancient Structures on the moon 20 things about the Ancient Sumerian Civilization you should know 10 things you should know about the ‘alien-like’ Sealand skull 5 Top-Secret Places that are censored on Google Maps This Ancient Sumerian Cylinder Seal is said to depict 12 planets in our Solar System HOME ARCHAEOLOGY HISTORY UNEXPLAINED **Are The Mysterious Metallic Spheres Of Siberia Product Of A Long Lost Ancient Civilization?** Siberia: Home of frozen landscapes, and origin of countless mysteries. A beautiful yet mysterious land in Russia has it all. From tales of lost civilizations, numerous strange explosions like the Tunguska, to countless UFO sightings and strange phenomenon, Siberia has it all. Yakutia, a region in Northern Russia with a total area of 3,083,523 km2of virtually unexplored and very inhospitable land, full of swamps, is a place that locals avoid at all costs since, according to them, anyone that enters the Valley of Death never returns. There, in the enigmatic and mysterious frozen landscape, people claim to have found, among many other mysterious things, strange metallic spheres whose purpose and origin are as controversial as inexplicable to science. The area of land is referred to by locals as Uliuiu Cherkechek, the Valley of Death. Anyone who ventures out into the unexplained can encounter a great number of mysterious metallic spheres, which many say are of extraterrestrial origin. An alien defense grid? It almost sounds like a sci-fi movie or script from MIB, but few people who have ventured out into the unknown lands and seen the mystery spheres claim they are ‘strategically positioned. This fact has given rise to various conspiracy theories which suggest that the enigmatic metallic spheres are not only of alien origin but were placed there to protect the region from the dangers of space, and even ‘hostile’ energies. Beyond any speculation, the truth is that this mysterious area of land has been a protagonist of several catastrophic events such as the great Tunguska explosion in 1908, Chulum in 1984, and Vitim, in 2002. It’s almost as if the entire region is a magnet for destruction. People who live in the vicinity of this dangerous place believe there is no mystery to it: the Death Valley owes its name to countless deaths and illness that marked the fate of anyone who dared roam the vicinity of any of these metal spheres which are, according to rumors of extraterrestrial origin. Legends state that here, in this inhospitable landscape live the ancient demons of the “Taiga.” In 1853, R. Maak, a noted explorer of the region, wrote: “In Suntar [a Yakut settlement] I was told that in the upper reaches of the Viliuy there is a stream called Algy timirbit (which translates as “the large cauldron sank”) flowing into the Viliuy. Close to its bank in the forest, there is a gigantic cauldron made of copper. Its size is unknown as only the rim is visible above the ground, but several trees grow within it.” In 1936, alongside the Olguidakh (“place with a cauldron”) River, a geologist led by elderly natives came upon a smooth metal half-sphere, reddish in color, protruding from the ground with such a sharp edge that it “cut a fingernail.” Its outer walls were about two centimeters thick, and it stuck out of the ground roughly a fifth of its diameter. The geologist despatched a description of it to Yakutsk, the regional center. In 1979, an archaeological expedition from Yakutsk attempted to find the hemisphere he had encountered. The team members were accompanied by a guide who had seen the structure several times in his youth. However, since any years went by and the region’s topography changed, the group failed to find the hemisphere. The same thing was recorded by N. D. Arkhipov, a researcher who studied the ancient cultures of Yakutia, who wrote: “Among the population of the Viliuy basin there is a legend from ancient times about the existence in the upper reaches of that river of bronze cauldrons orolguis. This legend deserves attention as the areas that are the supposed location of the mythical cauldrons contain several streams with the name Olguidakh – ‘Cauldron Stream.'” Lone hunters who have ventured into the area where the metallic spheres are said to be located say that some of the mystery spheres are submerged under water while other spheres are half-buried in the ground. Some have already been devoured by vegetation, and remain hidden from sight. Nonetheless, they plague the entire area. The “olguis” are said to be forged out of an unknown metal, believed to be “copper-like” in nature. The metal of these spheres is said to be extremely resistant and hard, and no one has been able to analyze them, due to fear of approaching the spheres. The few tests that were made were ignored by laboratories who have failed to identify their composition and origin. Local hunters say that over time, these metallic spheres sink into the ground and disappear from sight. They leave behind strange stains where vegetation cannot grow, the reason why many tribal elders have cursed the spheres and the lands where they are found. Strangely, despite the fact that their existence seems to be very well documented on paper, we have failed to find a single quality image of the mysterious spheres. Mikhail Koretsky from Vladivostok who visited the mysterious area where the spheres are located wrote: “I was there three times. The first time was in 1933, when I was ten – I travelled with my father when he went there to earn some money – then in 1937, without my father. And the last time was in 1947 as part of a group of youngsters. “The ’Valley of Death’ extends along a right-hand tributary of the Viliuy River. In point of fact it is a whole chain of valleys along its flood lands. All three times I was there with a guide, a Yakut. We didn’t go there because life was good, but because there, in the back of beyond, you could pan for gold without the threat that at the end of the season you’d be robbed or get a bullet in the back of your head. “As for mysterious objects, there are probably a lot of them there, as in three seasons I saw seven of those ’cauldrons’. They all struck me as totally perplexing: for one thing, there was their size – between six and nine meters in diameter. “Secondly, they were made of some strange metal. Everyone has written that they were made of copper, but I’m sure it isn’t copper. The thing is that even a sharpened cold chisel will not mark the ’cauldrons’ (we tried more than once). The metal doesn’t break off and can’t be hammered. On copper, a hammer would definitely have left noticeable dents. But this ’copper’ is covered over with a layer of some unknown material resembling emery. Yet it’s not an oxidation layer and not scale – it can’t be chipped or scratched, either. “We didn’t come across shafts going down into the ground with chambers. But I did note that the vegetation around the ’cauldrons’ is anomalous – totally different from what’s growing around. It’s more opulent: large-leaved burdock; very long withes; strange grass, one and a half or two times the height of a man. In one of the ’cauldrons’, the whole group of us (six people) spent the night. We didn’t sense anything bad, and we calmly left without any sort of unpleasant occurrences. Nobody fell seriously ill afterwards. Except that three months later, one of my friends lost all his hair. And on the left side of my head (the side I slept on), three small sore spots the size of match-heads appeared. I’ve tried to get rid of them all my life, but they’re still with me today. “None of our efforts to break off even a small piece from the strange ’cauldrons’ was successful. The only thing I did manage to bring away was a stone. Not an ordinary one, though: half of a perfect sphere, six centimeters in diameter. It was black in colour and bore no visible signs of having been worked, yet was very smooth as if polished. I picked it up from the ground inside one of those cauldrons. “I took my souvenir of Yakutia with me to the village of Samarka, Chuguyevka district, Primorsky region (the Soviet Far East), where my parents were living in 1933. I was laid up with nothing to do until my grandmother decided to build a house. We needed to put glass in the windows and there wasn’t a glass-cutter in the entire village. I tried scoring it with the edge of that half of a stone sphere, and it turned out to cut with amazing ease. After that, my find was often used like a diamond by all our relatives and friends. In 1937 I gave the stone to my grandfather, but that autumn he was arrested and taken to Magadan where he lived on without trial until 1968 and then died. Now no-one knows where my stone got to…” In his letter, Koretsky stresses that in 1933 his Yakut guide told him that: “…five or ten years before, he had discovered several spherical cauldrons (they were absolutely round) that protruded high (higher than a man) out of the ground. They looked brand new. Later the hunter had seen them again, now broken and scattered.” The area remains a profound mystery not only for scientists but for explorers and ordinary people as well. Source: Nexus Magazine Biblioteca Pleyades Featured image credit:byJulian-Faylona, used with permission. Website Ancient Code is a website founded in 2012 that covers articles and scientific discoveries that help understand humanity’s past, present, and future. Home History Unexplained News Conspiracy Ancient Aliens Archaeology UFO Phenomena Science Human Origins Mars About Recommended Links Writer’s Guidelines DMCA / Removal Privacy Policy GDPR Fair Use Notice Contact Us Ancient Code is a website founded in 2012 that covers articles and scientific discoveries that help understand humanity’s past, present, and future. Home History Unexplained News Conspiracy Ancient Aliens Archaeology UFO Phenomena Science Human Origins Mars About Recommended Links Writer’s Guidelines DMCA / Removal Privacy Policy GDPR Fair Use Notice Contact Us World US Politics EU Politics Business Opinions Connections Science Information Advertising Classified Ads Contact Info Do Not Sell Data GDPR Policy Media Kits Subscriptions Customer Support Bulk Packages Newsletters Sponsored News Work With Us **Subscribe to Updates** Get the latest creative news from the Ancient Code By signing up, you agree to the our terms and ourPrivacy Policyagreement. Privacy Policy Terms Accessibility Type above and pressEnterto search. PressEscto cancel."}