{"id": 1763, "name": "National Economics Editorial", "domain": "nationaleconomicseditorial.com", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://nationaleconomicseditorial.com/2019/04/16/remittances-illegal-immigrations-30-billion-hidden-tax/#mh-comments", "title": "Remittances Illegal Immigrations 30 Billion Hidden Tax", "content": "Analysis economics Culture Big Ideas [ February 25, 2025 ]Steve Bannon’s War Room: Economic Globalism Destroyed AmericaVideo [ February 25, 2025 ]NTD Interview: How Tariffs Will Rebuild Americas IndustryVideo [ February 25, 2025 ]No, Trump’s Tariffs Will Not Cause InflationAnalysis [ February 25, 2025 ]Without Tariffs America is Helpless Against ChinaAnalysis [ February 18, 2025 ]Reshore Now Available for PurchaseNews **Remittances: Illegal Immigration’s $30 Billion HIDDEN TAX** April 16, 2019Spencer P MorrisonVideo3 Please subscribe on my newYouTube channel. Don’t forget to support me onPatreon& follow me onTwitter. This channel & website are reader-funded. FromRemittances: Illegal Immigration’s Hidden Tax: To be clear, it’s impossible to know exactly how much money illegal immigrants remit annually. There are three reasons for this. First, we don’t know how many illegal immigrants actually reside in America. Second, the term remittance itself is ambiguous: should we include money stuffed in a birthday card in our calculations? Third, we cannot track the location of every dollar even if we wanted to (if we could, black markets wouldn’t exist). Nevertheless, I think we can apply a set of reasonable assumptions to a reasonable dataset, and reach a reasonable conclusion as to just how much money illegal aliens remit annually—although we cannot hit a home run, we can at least bat in the right ballpark. Let’s step up to the plate. First, assume that all of America’s remittance outflows are either sent by first-generationlegalimmigrants, or illegal aliens. Next, assume that these two groups send equal amounts of money home per person. Although legal immigrants earn more per capita, they likely send a much smaller proportion of their pay abroad (if they send any at all). I think these are fair assumptions. Now, let’s apply those assumptions to the numbers. According toPew Research’s 2018 remittance outflow data, America lost $138.2 billion in remittances in 2016. And given that there are some40 million first generation immigrants, and (at least)11.1 million illegal aliens, this means that there are roughly 51.1 million people sending remittances abroad. Of course, the number of aliens is debatable: arecent study from Yale Universityfound that there were at least 22.8 million illegals residing in America. That being said, let’s go with the low number for the sake of argument. Dividing the total remittance outflows by immigrant proportions reveals that illegal aliens likely remit some $30 billion per year. That’s a lot of money. For context, it’s as much as the entire annual GDP of Vermont. And of course, the figure would be higher if we used Yale’s population estimates. But it’s not just about the money—it’s what’s happening to it. Remember when I said earlier that no matter how bad Paris’ taxes were, at least the money paid for French, rather than Russian, harlots and maestros? Remittances are worse. Every dollar remitted by illegal aliens is a dollar ejected from the local economy, never to recirculate or be reinvested—it goes directly to Russia, or more likely Mexico, China, and Guatemala. This reduces the velocity of money, and causes liquidity problems, particularly in small towns. Functionally, there’s little difference between remittances and federal taxes: taxes skimmed from small towns pools in Washington DC, while remittances sent by aliens line Carlos Slim’s pockets. It’s that simple. And yet allegedly anti-tax organizations like theCato Instituteroutinelyargue in favor of open borders, not seeming to grasp the necessary implications. It’s time we stopped speaking in jargon. Let’s call out remittances sent by illegal aliens for what they actually are: a tax. America Illegal Immigraiton mexico Remittances China STEALS $600 Billion in American Intellectual Property Every Year China STEALS $600 Billion in American Intellectual Property Every Year Covid Quarantine Will Destroy the Economy, Not Save Lives Covid Quarantine Will Destroy the Economy, Not Save Lives **Steve Bannon’s War Room: Economic Globalism Destroyed America** **NTD Interview: How Tariffs Will Rebuild Americas Industry** **No, Trump’s Tariffs Will Not Cause Inflation** **Without Tariffs America is Helpless Against China** **Reshore Now Available for Purchase** America Europe economics Immigration Government Waste Technology Big Ideas Culture Contact Copyright © 2025 | MH Magazine WordPress Theme byMH Themes **** **** ****"}