{"id": 1697, "name": "CrossExamined.org", "domain": "crossexamined.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://crossexamined.org/the-role-of-intelligent-design-in-unforgetting-god-an-interview-with-barry-arrington-about-his-new-book/", "title": "The Role Of Intelligent Design In Unforgetting God An Interview With Barry Arrington About His New Book", "content": "Follow Follow Follow Follow Follow Follow Follow AboutAbout UsStaffWhat Is Christian Apologetics?Seminar TopicsYouth Exodus ProblemOur Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution BlogBlogBLOG ESPAÑOLDoes Truth Exist?Does God Exist?Is The New Testament True?Are Miracles Possible?Theology and Christian ApologeticsLegislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Videos AudioRadioPodcast (I Don’t Have Enough Faith to be an Atheist)Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español CE CommunityLoginSign Up Login Sign Up Login Sign Up TV Events2025 Israel & Jordan Tour with Frank TurekCIACIALodging/TransportationInstructorsPaymentsAdvanced CIALodging – TBDFrank Turek CalendarJ. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar ResourcesOnline CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of JesusEn EspañolBlog EspañolMediaCross Ex AppTV ProgramRadio & PodcastPhotosVideosArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / EvolutionAPPBooksApologetics CurriculumTV DVDsSubscribeLinksApologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub StoreImpact ApologeticsApparel Impact Apologetics Apparel Impact Apologetics Apparel Online Courses Donate Contact Subscribe Follow Follow Follow Follow Follow Follow Follow Follow Follow Follow Follow Follow Follow AboutAbout UsStaffWhat Is Christian Apologetics?Seminar TopicsYouth Exodus ProblemOur Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution BlogBlogBLOG ESPAÑOLDoes Truth Exist?Does God Exist?Is The New Testament True?Are Miracles Possible?Theology and Christian ApologeticsLegislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Videos AudioRadioPodcast (I Don’t Have Enough Faith to be an Atheist)Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español CE CommunityLoginSign Up Login Sign Up Login Sign Up TV Events2025 Israel & Jordan Tour with Frank TurekCIACIALodging/TransportationInstructorsPaymentsAdvanced CIALodging – TBDFrank Turek CalendarJ. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar ResourcesOnline CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of JesusEn EspañolBlog EspañolMediaCross Ex AppTV ProgramRadio & PodcastPhotosVideosArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / EvolutionAPPBooksApologetics CurriculumTV DVDsSubscribeLinksApologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub StoreImpact ApologeticsApparel Impact Apologetics Apparel Impact Apologetics Apparel Online Courses Donate Contact Subscribe Follow Follow Follow Follow Follow Follow **The Role of Intelligent Design in UNFORGETTING GOD: An Interview with Barry Arrington about his new book** By Bill Dembski | View (30) byBill Dembski|Jun 11, 2025|Legislating Morality, Culture & Politics Barry Arrington is a friend, colleague, and top-flight attorney who is deeply interested in how worldviews impact our society. He and I collaborated for close to two decades on the intelligent design blogUncommonDescent.com, which I started in 2005, which Barry managed for more than a decade as a 501(c)(3), and which we finally archived in 2023. In its first decade, Uncommon Descent was the premier blog for advancing the intelligent design movement, though in more recent years other blogs surpassed it in that role, notablyEvolutionNews.org. On May 6, 2025, Barry published with Inkwell Press a fascinating new book titledUnforgetting God: Defeating Culture-Destroying Materialism Through Christian Renewal(available at Amazon here). Barry’s perspective as a Christian, intelligent design proponent, and seasoned litigator (he has brought cases before the US Supreme Court) has given him a useful perspective from which to understand how materialism affects and infects our culture. Intelligent design provides an important tool in his arsenal for defeating materialism. I therefore proposed to him that we do an interview relating his book to intelligent design. Barry graciously agreed and gave the following interview. **Tell us about Barry Arrington.** I grew up in Texas and graduated from the University of Texas Law School (Austin) in 1986. I was admitted to the bar in 1987 and since then I have practiced mainly in complex civil litigation, including constitutional law, and nonprofit law. I have been an allied attorney with the Alliance for Defending Freedom since 1994. I served in the Colorado legislature in the 1990s. Some of my cases have been in the news. In 1999, I began representing several of the families whose children were killed at Columbine. In 2020, I represented a Colorado church in a case that went to the United States Supreme Court. We won that case and succeeded in opening the churches, which Colorado had shut down during COVID. I discuss my experiences with those cases in the book. I have been involved in the intelligent design movement for many years. I ran the intelligent design website Uncommon Descent (UncommonDescent.com) for well over a decade, which in its heyday was the largest intelligent design discussion site on the internet. In 2023, we decided to shut UD down and archive it at the Discovery Institute’s website. Currently, I have a case pending in which I sued the State of Colorado over its law making it illegal for licensed professionals to counsel teens struggling with gender dysphoria in any way other than “trans affirming.” The Supreme Court has agreed to hear that case and oral argument will be in the fall. **What was your purpose in writingUnforgetting God?** In 2020, I wrote a post for Uncommon Descent with the intentionally provocative title “Critical Theory is Certainly Correct.” The first sentence of the article is: “Indeed, it is more than merely true; it is an inexorable logical certaintyif the premises of the theorists are true.” In that article, I went on to write: “Critical theory is applied metaphysical materialism. Materialism posits that the physical is all there is. Its central premise is this: In the beginning there were particles, and the particles were in motion, and in the entire universe there is and never has been and never will be anything other than particles in motion. This means that human beings are not special. You and your family and your friends are also merely particles in motion, reducible to the chemicals that make up your bodies. Humans are clever hairless apes with no more ultimate significance than rocks. Yes, they have come up with this thing called ‘morality.’ But morality is an illusion foisted on us by material evolutionary forces because it gives us a reproductive advantage. Morality in any objective transcendent sense of the word not only does not exist, it cannot exist. There are no moral or immoral rocks. And humans — in their essence — are in the same category as rocks. Both rocks and humans are mere amalgamations of burnt out star dust. If this is true, it has profound implications for just about everything. One of those implications is that there are no universal truths guiding our relations in society. There is only power and those who have it and those who do not.” That article in UD contained the seeds that would ultimately grow into the bookUnforgetting God. The book is about premises. If materialist premises are true, then certain conclusions logically follow. This radically secular philosophy has come to dominate the minds of Western cultural elites and is at the root of tribalism in our politics, lawlessness in our courts, chaos in our universities, and the crisis of meaning rampaging among young people. In my thirty-eight years of practicing law, I have had a front row seat watching materialism literally destroy lives and hollow out our once vibrant cultural institutions. InUnforgetting God, I try to shine a light on the path out of the soul-numbing materialist wilderness in which we find ourselves. The book is about demonstrating that materialism is false, even absurd, and pointing the way to a loving God who is our best hope for personal salvation and cultural renewal. **The cover of your book is striking. Tell us about that.** The cover features Friedrich Nietzsche and Aleksandr Solzhenitsyn holding opposite ends of a rope as they play tug of war for the soul of the West. Nietzsche famously said “God is dead.” In contrast, Solzhenitsyn was a committed theist who called for spiritual renewal. The title of the book is an allusion toSolzhenitsyn’s speech when he accepted the Templeton Prize in 1983. He said that he had spent 50 years working on the history of the Russian Revolution. He had read hundreds of books and interviewed hundreds of witnesses to try to gain an understanding of that unspeakable human tragedy. Then he concluded: “But if I were asked today to formulate as concisely as possible the main cause of the ruinous Revolution that swallowed up some 60 million of our people, I could not put it more accurately than to repeat: ‘Men have forgotten God; that’s why all this has happened.’” Even a casual perusal of the headlines on any given day reveals that in the West, we too are rapidly forgetting God. The purpose of the book is to call for a reversal of that trend before it is too late. **You mentioned Columbine. How does that tragic event figure into your book?** This too has its roots in a UD article I wrote many years ago called “Darwin at Columbine.” Eric Harris was the leader in the Columbine shooting. Dylan Klebold was merely a follower. In the course of representing my clients whose children were killed that day, I spent hundreds of hours investigating Harris’s writings as well as his video and audio recordings. Contrary to popular myth, Harris was not insane. Nor was he a victim of bullying out for revenge. Harris was an intelligent young man who had even studied philosophy. And as I write in the book: “[Harris] took the philosophical ideas he learned very seriously indeed. He often alluded to those ideas in his journals and recordings. That’s how we know that Harris affirmatively believed those philosophical ideas justified his actions. Unfortunately for those he murdered and maimed, those ideas were a toxic miasma of Charles Darwin funneled through Friedrich Nietzsche. . . . If there is one quotation that sums up Harris’s views, it is probably this one: ‘F**k money, f**k justice, f**k morals, f**k civilized, f**k rules, f**k laws . . . DIE manmade words . . . people think they apply to everything when they don’t/can’t. There’s no such thing as True Good or True evil, it’s all relative to the observer. It’s just all nature, chemistry, and math.’ Harris was a deeply committed materialist who believed that ‘morality’ is just a word; there is no such thing as good or evil, and everything ultimately reduces to chemistry and math.” Harris took materialist evolution very seriously. It was not a coincidence that the shirt he wore the day of the shooting had “natural selection” emblazoned across the front. He believed he had evolved into a Nietzschean Übermensch, and as such he had no duty to respect his fellow students’ right to life. Obviously, the overwhelming majority of materialists are not mass killers. My point is that Harris was taught to reject the existence of objective good and evil. The only difference between Harris and other materialists is that he acted on his metaphysical beliefs and they usually do not. **How does Darwin make an appearance in your book?** In the opening chapter, I discuss how the late philosopher Daniel Dennett compared the materialism that came to dominate the minds of Western intellectuals following the publication of Darwin’sOrigin of Speciesto a “universal acid” that ate “through just about every traditional concept” in Western culture and left in its wake “a revolutionized world-view.” Materialist evolution was not a new concept in 1859. The Greeks and the Romans had discussed forms of the theory (such as Epicurus and Lucretius). Darwin’s genius lay in overcoming the fatal flaw in the classical theory — its prior invocation of sheer randomness to account for the exquisite design of living things. Darwin proposed a seemingly plausible materialistic explanation — natural selection acting on random variations in deep time — to account for the apparent design of living things. And the rest is history. As Richard Dawkins remarked inThe Blind Watchmaker, he could not imagine being an atheist prior to 1859, the year Darwin’sOrigin of Speciesappeared in print. But for Dawkins, everything changed in 1859 — Darwin now made it possible to be an intellectually fulfilled atheist. It is no coincidence that belief in metaphysical materialism came to dominate the minds of Western elites in the decades afterOrigin of Specieswas published. **Describe the place of intelligent design in your book.** In the first third of the book, I draw on my experience as a lawyer and former legislator to discuss materialism’s corrosive impact on culture, politics, and law, especially constitutional law. I then make a plea for a reevaluation of the premises underlying the materialist worldview. I write: “As late as the 1980s, when materialism’s iron grip on the minds of intellectuals was at its zenith, it would have probably been pointless for me to write a book like this. To be sure, many people continued to believe in God, but that belief was under assault from a militant and ascendant materialist elite that accused believers of clinging to superstitious myths. Times have changed, and we live in an exciting intellectual age for theists in general and Christians in particular. The materialist edifice has been crumbling for some time now. Nevertheless, while materialism is no longer intellectually ascendant, it remains culturally dominant, and the cultural course materialists have set us on is fraught with danger. Destruction and chaos lie at the end of our current path.” I urge my readers to reevaluate the case for theism generally and for Christianity in particular. As Stephen Meyer discussed in his masterfulReturn of the God Hypothesis, which I cite extensively, ID can play a role in pointing to theism generally. Chapter six is in many ways the heart of the book. I sketch [out] many ID arguments and point to the work of ID theorists for more in-depth analysis. These ID arguments include how Big Bang cosmology, cosmic fine tuning, and the staggering specified complexity of living things point to a creator. Along the way, in addition to Meyer, I discuss Bill Dembski’sThe Design Inference, Michael Behe’sDarwin’s Black Box, Jim Tour’s work in the origin-of-life area, Douglas Axe’s work in protein folds, Granville Sewell’s insights into complexity theory and the work of other ID luminaries. **What convinced you that intelligent design is true?** InThe Blind Watchmaker, Richard Dawkins wrote that “The complexity of living organisms is matched by the elegant efficiency of their apparent design.” Dawkins went on to argue in that book that this appearance of design is an illusion, but the point is that even an arch-atheist like Dawkins concedes that living things at least appear to be designed. Is that appearance of design really an illusion as Dawkins argues? I have always been skeptical of that claim. So, to answer your question, I probably always had a deeply held intuition that intelligent design is true. The more important question in my mind is, “When did you come to realize there are solid empirical grounds confirming that intuition?” For years I endured a constant onslaught of Darwinian/materialist indoctrination as I made my way through the education system. I had resisted that indoctrination but I constantly wondered whether I was just being stubborn. All the “smart” people believed in materialist evolution. Phil Johnson’s seminal bookDarwin on Trialwas, for me, epochal. Like many people,Darwin on Trialwas my first introduction to the ID movement, and thirty-five years later, I still remember the excitement I felt reading that book. Johnson demonstrated that the empirical support for the modern synthesis (neo-Darwinism) is really quite unimpressive. Then, in a stunning passage that literally changed my life, he provided an insight that finally made it all make sense. Why do “smart” people believe such a weak theory? Religion. I incorporated Johnson’s insight in the following passage inUnforgetting God: “One of the consequences of a fervent religious commitment to materialism . . . is the belief thatanyevidence is a stunning confirmation of the materialist origins myth. Phillip Johnson pointed out that if materialism is true, ‘then some materialistic theory of evolution has to be true simply as a matter of logical deduction, regardless of the evidence. That theory will necessarily be at least roughly like neo-Darwinism, in that it will have to involve some combination of random changes and law-like processes.’” Belief in Darwinian evolution is not a conclusion based on the evidence. It is a logical deduction from metaphysical materialism. That was in the early 1990s. In the decade or so that followed, I continued my investigation into ID. At that time, Richard John Neuhaus was still in charge ofFirst Things, and he provided an early forum for ID proponents. I remember Stephen Meyer’s “DNA and Other Designs,” in which he set forth an early version of the ideas that would appear in his bookSignature in the Cell, having a particularly powerful impact. During this time, Dembski’s and Behe’s work also came to my attention. So, to answer the question, while I always believed design at an intuitive level, the ID pioneers confirmed my belief at an empirical level. **Opposition to intelligent design is a proving ground for atheism. How did your leadership for close to 20 years at Uncommon Descent in defending intelligent design against atheist critics help shapeUnforgetting God?** Indeed. The late Cornell atheist professor William Provine (who often debated Phil Johnson) rightly stated that evolution is the greatest engine for atheism ever invented. This is true because Darwinian evolution has tremendous first-blush plausibility, and if one is inclined to go with the cultural flow, it provides a great jumping-off point. Francis Bacon famously said that a superficial knowledge of science (which he called “natural philosophy”) would “incline the mind of man to atheism,” but a deeper understanding would bring him back to God. That is still true today. A superficial study of origins undermines theism, but the deeper study provided by ID theorists points the other way. As I mentioned earlier, I have always believed in ID at an intuitive level, and ID theorists helped confirm that belief empirically. There is an obvious pitfall here. A natural human tendency is to believe what one wants to believe despite the evidence. There is a name for that tendency: confirmation bias. After I had been running UD (Uncommon Descent) for several years, I addressed an earlier fear I had had that my belief in ID would one day be exposed as nothing but the result of intense confirmation bias. The name of that article was “No Bomb After 10 Years,” and it opens with this: “I have to admit that when I first started debating the origins issue I did so with some trepidation. After all, there are a lot of highly educated, credentialed, intelligent professionals who say they believe the Darwinian narrative. To tell the truth, when I first started debating origins, I assumed not only that there was a very good chance that I was on the wrong side of the debate, but also that one or more of those highly educated, credentialed, intelligent professionals would come along anddrop a science bomb on methat would destroy my naïve belief in ID.” I go on to report that after 10 years of debating hundreds of materialists, no one had dropped a science bomb on me. My confidence in ID was as strong as ever, and I was beginning to suspect there is no bomb. Leading UD all those years was valuable for several reasons. The first I have already mentioned. Exposing one’s ideas to criticism can be scary, but if those ideas come out intact through the crucible, one can hold them with much more confidence. Yes, confirmation bias will always remain a risk, but one way to mitigate that risk is to receive and deal with intense objections in good faith. That “good faith” part is important. You have to address the opposition’s real argument, not some straw man caricature. One thing I have found over the years is that when your opponent sets up and knocks over a straw man, it is a sure sign they are not so confident that they can beat your actual argument. Second, debating origins all those years at UD not only strengthened my own position, but it also exposed me to materialist arguments that I might not otherwise have thought of. At UD, I learned that materialists tend to recycle the same arguments over and over. This prepared me to write one of the most important chapters inUnforgetting Godentitled “Objection!” in which I address numerous materialist objections to theism. **How does your background as a lawyer impact your approach to atheism?** How many times have you heard someone say, “there is no evidence for God’s existence” or “you can’t prove that God exists.” After 38 years of litigation, I know a thing or two about evidence and proof, and in the book, I show how both of these claims are demonstrably false. You may not be persuaded by the overwhelming evidence for God’s existence. That does not mean that evidence does not exist. And while the existence of God cannot be proved to an apodictic certainty, the totality of the evidence proves his existence to a high degree of certainty. God permits doubt. He does not permit reasonable doubt. In addition to my experience in evaluating evidence and proving facts, I hope I am following in the tradition of Phil Johnson inDarwin on Trial. Johnson said that he was a lawyer “with a specialty in analyzing the logic of arguments and identifying the assumptions that lie behind those arguments. This background is more appropriate than one might think, because what people believe about evolution and Darwinism depends very heavily on the kind of logic they employ and the kind of assumptions they make.” That is just as true today as it was in 1991 when Johnson publishedDarwin on Trial. **In a world without intelligent design, what happens to natural law? How does natural law undergirdUnforgetting God?** There is a passage in chapter four ofUnforgetting Godentitled “Lawless Law,” in which I address the question of natural law: “Prior to the Revolution, the colonists did not think of themselves primarily as ‘Americans.’ They thought of themselves as Englishmen living in America, and English common law was the law of the colonies. After the Revolution, English common law carried over as the law of the states of the new nation, and William Blackstone’sCommentarieswere the preeminent authority on that law. It is difficult to exaggerate Blackstone’s influence on early American law. John Marshall, considered by many to be the greatest Chief Justice in our nation’s history, read the Commentaries four times by the time he turned twenty-seven. As one historian wrote, ‘In the first century of American independence, theCommentarieswere not merely an approach to the study of law; for most lawyers they constituted all there was of the law.’ To this day, the Supreme Court cites Blackstone when it is seeking to understand the state of the law in the early republic.” For Blackstone, all legal matters implicating a moral question must be resolved by reference to natural law principles that God infused into the fabric of the universe at creation. He wrote: “[When God] created man, and endued him with freewill to conduct himself in all parts of life, he laid down certain immutable laws of human nature, whereby that freewill is in some degree regulated and restrained, and gave him also the faculty of reason to discover the purport of those laws.” The Declaration of Independence speaks of the “Laws of . . . Nature’s God.” These are the immutable moral principles laid down by God of which Blackstone spoke. A key idea in natural law theory is that men do not create natural law. Rather, like mathematical concepts that are discovered and not invented, the precepts of natural law have a freestanding existence and are discovered through human reason. This idea informed the founders’ view of law when they signed the Declaration of Independence. It is the view that dominated American law through the end of the nineteenth century. InUnforgetting God, I describe how all of that changed largely through the work and ideas of one man, Oliver Wendell Holmes Jr. Holmes was a committed Darwinist, a brutal materialist, and a moral nihilist. For good reason, he has been called “the American Nietzsche.” Holmes’s great project was to sever the link between law and morality, which he believed had no objective existence. For Holmes, all human relations, including the law, boiled down to a Darwinian struggle. One consequence of Holmes’s ideas was that American legal thinkers developed the jurisprudential theory of “legal positivism,” which remains the hegemonic theory of law to this day. Under legal positivism, law is not “discovered.” It is made by the people with the power, and the laws they make will have no necessary connection to morality. The prevalence of legal positivism is only possible in a legal culture that is thoroughly saturated with materialist presuppositions. InUnforgetting God, I point out the brutal consequences of judges imposing their will on the American people under the guise of interpreting the Constitution. The “living constitution” project is essentially materialism played out in constitutional law. I call for a reexamination of the materialist underpinnings of the modern legal project, and crucial to that reexamination is answering the following key question: Does God exist? As I discussed earlier in this interview, intelligent design plays a critical role in answering that question. Again, it all comes down to premises. If God does not exist, the legal positivist view of law is almost certainly correct. Natural law — law based in a fundamental morality — is possible only if objective morality exists, and objective morality exists only if God exists. **What do you say to people who think that God created by Darwinian evolution? Can such “theistic evolutionists” still profit from your book, and if so, how?** As I discussed above, belief in the materialist worldview exploded after Darwin. Daniel Dennett was surely correct that Darwin’s “universal acid” dissolved ancient theistic beliefs, and for many Western intellectual elites (such as Holmes) those theistic beliefs gave way to a thoroughgoing materialism. For over 160 years, many Christians have been trying to reconcile belief in God with belief in Darwinian evolution. Many of them have settled on what’s come to be called “theistic evolution.” Today, the BioLogos Foundation, established by Francis Collins, promotes this theory relentlessly. The essence of theistic evolution is that God uses Darwinian evolution to create all living things, including humans. The only difference between atheist Richard Dawkins and the typical theistic evolutionist is that the theist evolutionist adds the following footnote: “We accept on faith that all of this was caused by God in an empirically undetectable way.” Well, if science is the study of empirical phenomena, what is the purpose of that footnote? Good question. Theistic evolutionists are committed to the view that “theistic evolution” is, at the level of empirically observable phenomena, identical to “materialist evolution.” I believe that theistic evolution is misguided in at least two respects. First, as ID theorists have convincingly demonstrated, a creator’s work is empirically detectable. Second, they are kidding themselves if they believe that theistic evolution will halt the culture’s slide into atheistic materialism in any meaningful way. It is a very short journey from “God is not empirically detectible in the process” to “God is not necessary to explain the process,” and it is an even shorter journey from there to “God is not necessary, full stop.” InUnforgetting God, I rely on ID theory to demonstrate that the design inference is by far the most reasonable explanation for the staggering specified complexity of living things. Thus, there is no reason to retreat into the theistic evolution cul-de-sac. **What impact would you like your bookUnforgetting Godto have immediately and in the coming years?** In a word, I am calling for the revival of skepticism. This might sound odd coming from a theist because we have been conditioned by our culture to believe that only atheists can be true skeptics. While that might have been true at one time, as I explain in the following passage fromUnforgetting God, that is no longer the case. “’Fideism’ is a grit-your-teeth-and-believe-despite-the-evidence sort of belief. I am not asking anyone to retreat into an unreflective fideism. Indeed, I am calling for just the opposite – a revival of skepticism. For centuries, ‘skepticism’ was associated with unbelievers such as the Enlightenment thinkers David Hume and Voltaire. This is because they were skeptical of the dominant cultural narrative, which in their time was Christianity. In our time, materialism is the dominant narrative, especially in the media and academia, which are the joint heralds of our culture’s received wisdom. My purpose in writing this book is to urge everyone to re-examine the evidence for the existence of God with a skeptical perspective toward the secular received wisdom that has long dominated the discourse in our nation. . . . I am calling for a renewal of an attitude of genuine skepticism toward the cultural hegemon of materialism. Again, I am not asking anyone to retreat into fideism. That is both irrational and unsustainable in the long run. I am not asking anyone to endure and believe despite all the evidence to the contrary. I am asking for the opposite.The point of this book is to encourage people to examine the evidence again, especially in light of the scholarship summarized in chapter sixthat demonstrates that accepting the existence of God and the truth of Jesus Christ’s message of love, peace, and redemption are the overwhelmingly more rational positions to hold.” As the highlighted part of the passage states, my purpose in writingUnforgetting Godis to call on people to examine the claims of materialism with a genuinely skeptical attitude. I understand this will be difficult for many. It takes true courage to stand up against the overwhelmingly dominant materialist narrative of our culture. While I do not agree with Hume’s and Voltaire’s conclusions, I cannot help but admire their courage in standing up to the dominant narrative of their culture. We must find the courage to do the same thing, because the stakes are very high. Indeed, they are nothing short of existential for Western Civilization. **Recommended Resources:** I Don’t Have Enough Faith to Be an Atheist (Paperback), and (Sermon) by Norman Geisler and Frank Turek Stealing From God by Dr. Frank Turek (Book,10-Part DVD Set,STUDENT Study Guide,TEACHER Study Guide) Answering Stephen Hawking & Other AtheistsMP3andDVDby Dr. Frank Turek Person of Interest: Why Jesus Still Matters in a World that Rejects the Bible by J. Warner Wallace (Paperback), (Investigator’s Guide). Bill Dembskiholds doctorates in math and philosophy as well as an advance theological degree. He’s published in the peer-reviewed math, engineering, biology, philosophy, and theology literature. His focus is on freedom, technology, and education. Formerly almost exclusively an ID (intelligent design) guy, with most of his writing focused on that topic, he found that even though ID had the better argument, it faced roadblocks designed to stop its success. So his focus shifted to the wider social and political forces that block free human inquiry. Bill still writes a lot on intelligent design but his focus these days is broader. Originally posted at:https://bit.ly/3FyCxE9 **About us** CrossExamined.org is a non-profit ministry started in 2006 that conducts dynamicI Don’t Have Enough Faith to Be An Atheistseminars on college campuses, churches, and high schools. **subscribe to blog** **Total Subscribers: 102,522** **Our App** The Role of Intelligent Design in UNFORGETTING GOD: An Interview with Barry Arrington about his new bookBy Bill DembskiJune 11, 2025 Do I have to go to church to be a Christian?By Jennifer DefratesJune 9, 2025 Countercultural Warriors…By TJ GentryJune 4, 2025 **Popular Posts** The Top 20 Christian ApologistsFrank Turek with the world's most credentialed and likable apologist, Dr. J... Frank Turek with the world's most credentialed and likable apologist, Dr. J... Frank Turek with the world's most credentialed and likable apologist, Dr. J... A Simple Reason Why The Qur’an Cannot Be The Word of GodThe Islamic religion claims that the Qur’an, revealed allegedly by the ange... The Islamic religion claims that the Qur’an, revealed allegedly by the ange... The Islamic religion claims that the Qur’an, revealed allegedly by the ange... The Mind-Blowing Meaning Behind the Sign of Jonah Why the Gospel of Thomas isn’t in the Bible Who Wrote the Gospel of Matthew?By Brian Chilton Over the course of the new few weeks, we will discuss the... By Brian Chilton Over the course of the new few weeks, we will discuss the... By Brian Chilton Over the course of the new few weeks, we will discuss the... **Recent Videos** **Spanish Blog** Mis cielos – no están en las estrellas0 CommentApr 28th, 2023 0 CommentApr 28th, 2023 0 CommentApr 28th, 2023 ¿Podemos legislar la moral?0 CommentApr 14th, 2023 0 CommentApr 14th, 2023 0 CommentApr 14th, 2023 ¿Quién hizo a Dios?0 CommentApr 7th, 2023 0 CommentApr 7th, 2023 0 CommentApr 7th, 2023 Cuando tu oponente hace trampas, ¿qué debes hacer?0 CommentMar 31th, 2023 0 CommentMar 31th, 2023 0 CommentMar 31th, 2023 **Contact Cross Examined** **Have General Questions?** **SCHEDULE A CROSS EXAMINED SPEAKER** CrossExamined.org is a non-profit ministry started in 2006 that conducts dynamic I Don’t Have Enough Faith to Be An Atheist seminars on college campuses, churches, and high schools. About App Blog Videos TV Radio Events Resources Store Donate Contact Subscribe In Spanish Media Articles Books Curriculum TV DVDs Subscribe Links © Copyright 2022 CrossExamined.org. All Rights Reserved. AboutAbout UsStaffWhat Is Christian Apologetics?Seminar TopicsYouth Exodus ProblemOur Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution About Us Staff What Is Christian Apologetics? Seminar Topics Youth Exodus Problem Our Solution BlogBlogBLOG ESPAÑOLDoes Truth Exist?Does God Exist?Is The New Testament True?Are Miracles Possible?Theology and Christian ApologeticsLegislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Blog BLOG ESPAÑOL Does Truth Exist? Does God Exist? Is The New Testament True? Are Miracles Possible? Theology and Christian Apologetics Legislating Morality, Culture & Politics Videos AudioRadioPodcast (I Don’t Have Enough Faith to be an Atheist)Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español Radio Podcast (I Don’t Have Enough Faith to be an Atheist) Podcast en Español CE CommunityLoginSign Up Login Sign Up Login Sign Up TV Events2025 Israel & Jordan Tour with Frank TurekCIACIALodging/TransportationInstructorsPaymentsAdvanced CIALodging – TBDFrank Turek CalendarJ. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar 2025 Israel & Jordan Tour with Frank Turek CIACIALodging/TransportationInstructorsPayments CIA Lodging/Transportation Instructors Payments CIA Lodging/Transportation Instructors Payments Advanced CIALodging – TBD Lodging – TBD Lodging – TBD Frank Turek Calendar J. Warner Wallace Calendar ResourcesOnline CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of JesusEn EspañolBlog EspañolMediaCross Ex AppTV ProgramRadio & PodcastPhotosVideosArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / EvolutionAPPBooksApologetics CurriculumTV DVDsSubscribeLinksApologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub Online CoursesIntroduction to TheologyThe Historical Reliability of the GospelsStealing From GodTextual Criticism with Dr. Dan WallaceI Still Don’t Have Enough Faith to Be an AtheistResurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus Introduction to Theology The Historical Reliability of the Gospels Stealing From God Textual Criticism with Dr. Dan Wallace I Still Don’t Have Enough Faith to Be an Atheist Resurrection of Jesus En EspañolBlog Español Blog Español Blog Español MediaCross Ex AppTV ProgramRadio & PodcastPhotosVideos Cross Ex App TV Program Radio & Podcast Photos Videos Cross Ex App TV Program Radio & Podcast Photos Videos ArticlesArticles on TruthArticles on GodArticles on the BibleArticles on Church BeliefsArticles on Morality and PoliticsArticles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution Articles on Truth Articles on God Articles on the Bible Articles on Church Beliefs Articles on Morality and Politics Articles on Intelligent Design / Evolution APP Books Apologetics Curriculum TV DVDs Subscribe Links Apologetics Hub StoreImpact ApologeticsApparel Impact Apologetics Apparel Impact Apologetics Apparel Online Courses Donate Contact Subscribe **Pin It on Pinterest**"}