{"id": 1086, "name": "Paste Magazine", "domain": "pastemagazine.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.pastemagazine.com/movies/the-man-in-my-basement/the-man-in-my-basement-trailer-willem-dafoe-corey-hawkins-thriller-horror", "title": "The Man In My Basement Trailer Willem Dafoe Corey Hawkins Thriller Horror", "content": "Paste A.V. Club Jezebel Splinter Music Movies TV Comedy Games Books Food Drink Travel Tech Video Newsletter Instagram YouTube Twitter Facebook TikTok **Willem Dafoe Lurks Around Another Man’s Home in First Trailer for Hulu’sThe Man in My Basement** Copy Link Facebook X Reddit Email There’s nothing quite like a creepy basement, especially when that basement contains Willem Dafoe as a seemingly nefarious, perhaps unhinged character who’s insisted on haggling his way into someone else’s home. The first teaser for Hulu’s upcoming feature filmThe Man in My Basementpromises exactly that, along with some extra layers of eeriness. For example, a girl standing in the woods wears a particularly off-putting dog mask and the down-on-his-luck protagonist—played by Corey Hawkins, who you may know fromThe Walking Dead—is seen digging outside in the dead of night … searching for something? Hiding something? Nothing suspicious to see here. Exclusive Excerpt: A Young Weaver Struggles to Make Ends Meet inBeguiled NopeIs American Mythmaking Done Right NBC’sGrand CrewIs the Sunny Hangout Comedy You Need in Your Life Based on the novel by Walter Mosley,The Man in My Basementis directed by Nadia Latif—her first time directing a feature film—with a screenplay by Mosley and Latif. The teaser suggests a psychological thriller with maybe a few more intellectual leanings in the vein of Jordan Peele’sGet Out(2017).For Dafoe,The Man in My Basementmight fit comfortably next to a few other roles in films that play around in the world of high-minded eeriness, such asNosferatu(2024) orPoor Things(2023). There’s certainly been a recent harkening for thrillers that aim a bit higher with their scares and frightening atmospheres, and although it doesn’t get much more old school than masks, ancestral homes, and grimy basements sure to be hiding even grimier secrets, one can hope thatThe Man in My Basementhas a new twist in store to shake up a well-trodden formula. In addition to Hawkins and Dafoe, Anna Diop and Tamara Lawrence are also set to star. At the very least, the film should benefit from such a consummate professional as Willem Dafoe in its lead (antagonist?) role. The Man in My Basementis set to be released on Hulu and in select theaters on a date yet to be announced. Lifeguard: The Best of What’s Next Watch Steve Poltz and Jim Lauderdale's Paste Session at Suwannee Spring Reunion The 5 New and Under-the-Radar TV Shows You Can’t Miss in June GET PASTE RIGHT IN YOUR INBOX The best music, movies, TV, books, comedy and more. Sign Up Paste MediaA.V. ClubGinny & Georgia's biggest crime is its failure to titillateJEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony AwardsSPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict Paste MediaA.V. ClubGinny & Georgia's biggest crime is its failure to titillateJEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony AwardsSPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict A.V. ClubGinny & Georgia's biggest crime is its failure to titillate JEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony Awards SPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict Paste MediaA.V. ClubGinny & Georgia's biggest crime is its failure to titillateJEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony AwardsSPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict A.V. ClubGinny & Georgia's biggest crime is its failure to titillate JEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony Awards SPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict A.V. ClubGinny & Georgia's biggest crime is its failure to titillate JEZEBELOur (Ill-Informed) Picks to Win the 2025 Tony Awards SPLINTEREU Climate Chief: Climate Change Will “Quadruple” The Likelihood of Armed Conflict NewsWillem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My BasementWater From Your Eyes Announce New LP,It's a Beautiful PlaceIvy Announce First New Album in 14 YearsMore News NewsWillem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My BasementWater From Your Eyes Announce New LP,It's a Beautiful PlaceIvy Announce First New Album in 14 YearsMore News Willem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My Basement Water From Your Eyes Announce New LP,It's a Beautiful Place Ivy Announce First New Album in 14 Years More News NewsWillem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My BasementWater From Your Eyes Announce New LP,It's a Beautiful PlaceIvy Announce First New Album in 14 YearsMore News Willem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My Basement Water From Your Eyes Announce New LP,It's a Beautiful Place Ivy Announce First New Album in 14 Years More News Willem Dafoe Lurks Around Another Man's Home in First Trailer for Hulu'sThe Man in My Basement Water From Your Eyes Announce New LP,It's a Beautiful Place Ivy Announce First New Album in 14 Years More News About Advertise Masthead Privacy Copyright Store Facebook Twitter Contact Us © 2025 Paste Media Group. All Rights Reserved"}