{"id": 660, "name": "Humanium", "domain": "humanium.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.humanium.org/en/the-current-state-of-child-labour-in-cobalt-mines-in-the-democratic-republic-of-the-congo/", "title": "The Current State Of Child Labour In Cobalt Mines In The Democratic Republic Of The Congo", "content": "Children’s RightsDefinitionHistory8 Fundamental RightsConvention & TextsChildren’s Rights Map Definition History 8 Fundamental Rights Convention & Texts Children’s Rights Map Definition History 8 Fundamental Rights Convention & Texts Children’s Rights Map Situation in CountriesAfricaAmericasAsia & PacificEurope & the CaucasusMiddle East & North Africa Africa Americas Asia & Pacific Europe & the Caucasus Middle East & North Africa Africa Americas Asia & Pacific Europe & the Caucasus Middle East & North Africa TopicsEnvironmentPovertyExploitationViolenceDiscriminationCultural practicesHealthIsolation and rootlessnessJustice of children Environment Poverty Exploitation Violence Discrimination Cultural practices Health Isolation and rootlessness Justice of children Environment Poverty Exploitation Violence Discrimination Cultural practices Health Isolation and rootlessness Justice of children Blog Who are weAbout UsMethodologyProjectsEthics CharterSupport and PartnersOur TeamLegal StructureAnnual reports About Us Methodology Projects Ethics Charter Support and Partners Our Team Legal Structure Annual reports About Us Methodology Projects Ethics Charter Support and Partners Our Team Legal Structure Annual reports Get involvedSponsor a childMake a donationBecome a memberJobsInternshipsVolunteerNewsletter Sponsor a child Make a donation Become a member Jobs Internships Volunteer Newsletter Sponsor a child Make a donation Become a member Jobs Internships Volunteer Newsletter Contact us **The current state of child labour in cobalt mines in the Democratic Republic of the Congo** TheDemocratic Republic of the Congo (DRC)is home to over 50% of the world’s cobalt reserves. Cobalt is an essential mineral for rechargeable batteries used in electric vehicles, smartphones, and renewable energy technologies. However, this critical resource comes at a staggering human cost: the exploitation ofchild labourin artisanal and small-scale mining (ASM). Despite international attention, thousands of children continue to toil under hazardous conditions for meagre wages, sacrificing their health, education, and future. **Child labour in DRC’s cobalt mines** Child labour remains a widespread issue in cobalt mining, particularly in ASM, which accounts for up to 30% of the DRC’s cobalt production (Save the Children, 2024a, 2024b). According to recent data, an estimated 40,000 children are involved in cobalt mining in the DRC, some as young as seven years old, working in unsafe conditions (Kamara & Bumba, 2025). Tens of thousands of children work alongside their families or asorphans(Zuckerman, 2023). In 2024, the International Labour Organization (ILO) reported that over 6,200 children had been identified as working in mines in the Haut-Katanga and Lualaba provinces alone (ILO, 2024). In these informal and hazardous mining environments, children work long hours for less than $2 per day (Lawson, 2021). They perform dangerous tasks such as digging tunnels, carrying heavy loads, and cleaning cobalt ores with their bare hands and no protective equipment (Higgs, n.d.). Thetraffickingof children for work in mines is also a harsh reality. Militias, sometimes referred to as commandos, abduct and traffic children, even recruiting them from distant parts of Congo. Some children are brought from hundreds of miles away through militia networks to work in the cobalt mines, where their labour funds these groups. Children are among the most vulnerable and exploited workers in these mines, often subjected toviolent conditions(Gross, 2023). **Root causes of child labour in the DRC** Poverty and systemic inequalities are the primary drivers of child labour in cobalt mines. Over 73% of the DRC’s population lives below the international poverty line (Gopal, 2025; IMPACT, 2023). In addition, rising living costs in the DRC have made it increasingly difficult forfamiliesto survive, leaving many without enoughfood. As a result, children are being pushed into mining work, with their families relying on the income to cover essential needs. Often, these children are either encouraged by their parents or influenced by peers, neighbours, or siblings to take up such labour (Mosebo, n.d.). Female miners, lacking childcare options, often bring their children to work (IMPACT, 2023). Moreover, children living near mining sites often have little access tohealthcare. Clinics are located far away, and medicines are scarce, making it difficult to treat diseases that spread due to poorwater, sanitation, and air quality. Children and families living in these areas show higher levels of cobalt in their blood and DNA damage, raising long-term health concerns (Kamara & Bumba, 2025). Lack of access to qualityeducationfurther exacerbates the problem of child labour. Schools are often unaffordable or unavailable in mining communities, leaving children with little option but to work (Amnesty International, 2016). Children living near cobalt mines attain significantly fewer years of schooling than their peers who live elsewhere in the country (Malpede, 2023). “I regret the time I spent in the mines. I missed out on a lot of subjects. Because my friends were going to school, and I was working.” Even when schools are available, impoverished families often prioritise immediate income over long-term benefits that education can provide (IMPACT, 2023). As a result, children are pulled out of school to support their families financially. This creates a vicious cycle in which they grow up without education and rely on ASM work, further perpetuating poverty and child labour (Gopal, 2025). Additionally, from the age of 12, students are expected to pay school fees, which often leads many teenagers to leave school and work alongside their parents and older siblings (Baumann-Pauly, 2023). **Impact of cobalt mining on children** The working conditions in the cobalt mines are dire and life-threatening (Baumann-Pauly, 2023). Artisanal mining sites lack safety measures, which means children are exposed to toxic materials such as cobalt dust and heavy metals that can cause respiratory illnesses such as asthma and chronic bronchitis, and long-term health complications (Kamara & Bumba, 2025; Zuckerman, 2023). Many suffer from spinal deformities caused by carrying heavy loads or working long hours in physically demanding roles (Save the Children, 2024c). “When I got home, my whole body ached and I had to go back the next day. It was very sad, the bags were so heavy. The money was barely enough to feed ourselves. Children were getting sick all the time.” Prolonged exposure to toxic substances can also lead to developmental issues such as difficulty walking or concentrating (Malpede, 2023). Injuries are common due to collapsing tunnels, unsafe equipment, or accidents involving rudimentary mining tools and can result in permanent disabilities or even death (Kamara & Bumba, 2025). Beyond physical harm, working under exploitative conditions takes a toll on children’s mental well-being. Many children experience anxiety, trauma, and emotional distress due to the harsh realities of mining work, including long hours, abusive treatment from supervisors or older miners, and a lack of stable childhood environments (Schwartz et al., 2021). They may also witness accidents or lose family members in mining collapses. “One day I found a large block of cobalt in one of the holes and removed it. From that day on my body has hurt a lot. There are also landslides that kill. There was a landslide right next to where we were toiling for cobalt when the earth slipped and buried my brother and he died. I was in the first grade at the time.” **Recent efforts to combat child labour in the DRC** One significant step forward is the 10-year collaboration between Save the Children Switzerland and the dormakaba Group, a global leader in security solutions. This initiative targets child labour in cobalt mining communities in the DRC by offering educational opportunities and vocational training programmes (dormakaba Group, 2024). Since 2021, Save the Children has been implementing programmes to reintegrate child miners into schools and vocational training centres. These initiatives provide financial support to families, reduce their reliance on child labour, and offer psychological care. Save the Children has also established Catch-Up Clubs, which provide accelerated learning, financial stipends for education, and socio-emotional support for children coping with trauma (Save the Children, 2024a). In parallel, the ILO launched the GALAB (Global Action Against Child Labor) project, building on previous efforts such as the COTECCO (Combattre le travail des enfants dans les mines de cobalt en République Démocratique du Congo) project (2018–2024) (U.S. Department of Labor, n.d.). The goal is “zero children in the mining sector,” focusing on remediation services, vocational training, and educational support for affected children (ILO, 2024). The ILO also raises awareness about child labour through its SCREAM programme (Supporting Children’s Rights through Education, the Arts, and the Media), empowering children to express their experiences. In September 2023, 20 students in Lubumbashi created artistic works to highlight the dangers of mining and the message that children belong in schools, not mines (ILO, 2023). Similarly, the African Development Bank’s PABEA-Cobalt project, launched in 2019, has significantly contributed to improving the welfare of children and young people involved in cobalt mining in the DRC (African Development Bank, 2019). By December 2024, the project had successfully extricated over 9,016 children from artisanal cobalt mines and reintegrated them into schools or vocational training programmes. The initiative also addressed the root causes of child labour by targeting extreme household poverty and inadequate social infrastructure (African Development Bank, 2024). The Hub for Child Labour Prevention, established by Save the Children and the Fair Cobalt Alliance in 2022, also focuses on education, vocational training, and family financial support to break the cycle of child labour (The Centre for Child Rights and Business, n.d.). On a national level, the DRC government created CISTEMA (Commission Interministérielle de Suivi de la Thématique de l’Enfant dans les Mines Artisanales) in 2020, a commission coordinating actions to eliminate child labour in artisanal mining sites. The commission collaborates with international partners, including the ILO, to tackle this issue (ILO, 2023). **Recommendations for addressing child labour in the DRC** To tackle child labour in the DRC’s artisanal mining sector, governments need to step up by providing alternative livelihoods for families who rely on mining income. This includes investing in vocational training programmes and supporting initiatives that improve women’s economic security, helping to reduce the dependence on child labour for survival. Education can be a powerful tool for breaking this cycle—governments should build schools in mining areas and offer financial assistance to families struggling to cover education costs. In addition to addressing these root causes, the DRC government must take steps to formalise the sector. This involves creating clear and practical regulations for mine safety and child labour (Baumann-Pauly, 2023). Enforcing existing child labour laws is equally important. This includes increasing funding for inspections at mining sites and ensuring that those exploiting child workers face legal consequences. Companies also have a responsibility to help. By supporting local community development projects or partnering with NGOs, they can make a real difference in eliminating child labour in the mining sector. Mining companies must also provide safer working conditions, fair pay, and protective equipment (Kamara & Bumba, 2025). Finally, international organisations must strengthen regulations around mineral sourcing, following frameworks such as the Organisation for Economic Co-operation and Development (OECD) Due Diligence Guidance for Responsible Mineral Supply Chains. JoinHumanium, an NGO dedicated to advancing children’s rights worldwide, in the fight against child labour. You can make an impact byvolunteering,sponsoring a child, ordonatingto support education and sustainable alternatives for children in mining communities. Written by Or Salama African Development Bank. (2019, April 9). Democratic Republic of Congo – Support project for alternative welfare of children and young people involved in the cobalt supply chain (PABEA-COBALT) – Appraisal Report. Retrieved from African Development Bank athttps://www.afdb.org/en/documents/document/democratic-republic-of-congo-support-project-for-alternative-welfare-of-children-and-young-people-involved-in-the-cobalt-supply-chain-pabea-cobalt-appraisal-report-108712, accessed on April 12, 2025. African Development Bank. (2024, February 8). Democratic Republic of Congo: African Development Bank projects returns thousands of children from cobalt mines to schools. Retrieved from African Development Bank athttps://www.afdb.org/en/success-stories/democratic-republic-congo-african-development-bank-projects-returns-thousands-children-cobalt-mines-schools-68597, accessed on April 12, 2025. Amnesty International. (2016). “This is what we die for”: Human rights abuses in the Democratic Republic of the Congo power the global trade in cobalt. Retrieved from Amnesty International athttps://www.amnesty.org/fr/wp-content/uploads/2021/05/AFR6231832016ENGLISH.pdf, accessed on April 13, 2025. Ballay, T. (2023, November 21). DR Congo: From work in the mines to school: The story of Steve. Retrieved from World Vision athttps://www.wvi.org/stories/congo/dr-congo-work-mines-school-story-steve, accessed on April 12, 2025. Baumann-Pauly, D. (2023, February). Cobalt mining in the Democratic Republic of the Congo: Addressing root causes of human rights abuses. Retrieved from Geneva Center for Business and Human Rights & NYU Stern Center for Business and Human Rights athttps://gcbhr.org/backoffice/resources/cobalt-mining-drcroot-causes.pdf, accessed on April 12, 2025. dormakaba Group. (2024, June 27). Together against child labor: dormakaba enters into a long-term partnership with Save the Children Switzerland. Retrieved from dormakaba Group athttps://www.dormakabagroup.com/en/news/46f36c3e-9287-4a91-a925-81b9c45513a0/together-against-child-labor-dormakaba-enters-into-a-long-term-partnership-with-save-the-children-switzerland, accessed on April 12, 2025. Gopal, S. (2025, February 24). Children in the mines: The devastating cycle of child labor in the DRC and its impact on education and economic mobility. Retrieved from Floodlight Global athttps://floodlightglobal.com/children-in-the-mines-the-devastating-cycle-of-child-labor-in-the-drc-and-its-impact-on-education-and-economic-mobility/, accessed on April 4, 2025. Gross, T. (2023, February 1). How ‘modern-day slavery’ in the Congo powers the rechargeable battery economy. Retrieved from NPR Illinois athttps://www.nprillinois.org/2023-02-01/how-modern-day-slavery-in-the-congo-powers-the-rechargeable-battery-economy, accessed on April 12, 2025. Higgs, G. (n.d.). DRC: The endurance of child labour in artisanal cobalt mining. Retrieved from CSA Piemonte athttps://csapiemonte.it/sites/default/files/The%20Endurance%20of%20Child%20Labour%20in%20Artisanal%20Cobalt%20Mining.pdf, accessed on April 12, 2025. IMPACT. (2023, July 13). Families depend on income from child labour in Congo’s cobalt mines to stave off hunger. Retrieved from IMPACT athttps://impacttransform.org/en/families-income-child-labour-cobalt/, accessed on April 4, 2025. International Labour Organization. (2023, November 20). Tiny but mighty voices against child labour in cobalt mining. Retrieved from International Labour Organization athttps://www.ilo.org/resource/news/tiny-mighty-voices-against-child-labour-cobalt-mining, accessed on April 4, 2025. International Labour Organization. (2024, November 20).ILO launches GALAB project in Democratic Republic of the Congo to address child labour in cobalt mining sector. Retrieved from ILO athttps://www.ilo.org/resource/news/ilo-launches-galab-project-democratic-republic-congo-address-child-labour, accessed on April 4, 2025. Kamara, J., & Bumba, S. (2025, February 10). Protecting miners’ health in Democratic Republic of Congo. Retrieved from Think Global Health athttps://www.thinkglobalhealth.org/article/protecting-miners-health-democratic-republic-congo, accessed on April 12, 2025. Lawson, M. F. (2021, September 1). The DRC mining industry: Child labor and formalization of small-scale mining. Retrieved from Wilson Center athttps://www.wilsoncenter.org/blog-post/drc-mining-industry-child-labor-and-formalization-small-scale-mining, accessed on April 4, 2025. Malpede, M. (2023, July 27). Children living in cobalt-rich areas in the DRC show poor educational outcomes – study. Retrieved from Mining.com athttps://www.mining.com/children-living-in-cobalt-rich-areas-in-the-drc-show-poor-educational-outcomes-study/, accessed on April 4, 2025. Mosebo, T. (n.d.). Major tech companies accused of child labour in Congolese cobalt mines. Retrieved from Geneva International Centre for Justice (GICJ) athttps://www.gicj.org/topics/thematic-issues/business-human-rights/3710-major-tech-companies-accused-of-child-labour-in-congolese-cobalt-mines, accessed on April 13, 2025. Save the Children. (2024a, June 12). “This job doesn’t deserve me”: Catch-up Clubs help stop child labour in DRC’s deadly cobalt mines. Retrieved from Save the Children athttps://www.savethechildren.net/news/job-doesnt-deserve-me-catch-clubs-help-stop-child-labour-drc-s-deadly-cobalt-mines, accessed on April 12, 2025. Save the Children. (2024b, June 27). DRC: Together against child labour. Retrieved from Save the Children athttps://savethechildren.ch/en/2024/06/27/together-against-child-labour-in-drc/, accessed on April 4, 2025. Save the Children. (2024c, November 4). DRC: Cobalt mines, child labour and the green transition. Retrieved from Save the Children athttps://www.savethechildren.net/stories/drc-cobalt-mines-child-labour-and-green-transition, accessed on April 12, 2025. Schwartz, F. W., Lee, S., & Darrah, T. H. (2021, February 1). A review of health issues related to child labor and violence within artisanal and small‐scale mining. Retrieved from National Library of Medicine athttps://pmc.ncbi.nlm.nih.gov/articles/PMC7875191/, accessed on April 12, 2025. The Centre for Child Rights and Business. (n.d.). The Hub: A child labour prevention and remediation network creating long-term impact in the DRC. Retrieved from The Centre for Child Rights and Business athttps://www.childrights-business.org/impact/the-hub-a-child-labour-prevention-and-remediation-network-creating-long-term-impact-in-kolwezi-democratic-republic-of-congo-drc, accessed on April 4, 2025. U.S. Department of Labor. (n.d.). Combatting child labor in the Democratic Republic of the Congo’s cobalt industry (COTECCO). Retrieved from Bureau of International Labor Affairs athttps://www.dol.gov/agencies/ilab/combatting-child-labor-democratic-republic-congos-cobalt-industry-cotecco, accessed on April 12, 2025. Zuckerman, J. C. (2023, March 30). For your phone and EV, a cobalt supply chain to a hell on earth. Retrieved from Yale Environment 360athttps://e360.yale.edu/features/siddharth-kara-cobalt-mining-labor-congo, accessed on April 13, 2025. **Post navigation** **Your generosity gives children a smile, support our work!** **Please select your country** To donate now, click according to your country of residence. You will be redirected to Humanium’s secure website France Suisse Schweiz España Deutschland Other country Your donation is tax deductible in Switzerland, France, Germany and the EU. **Thanks to your donation** • we defend children whose rights are violated • we protect the most vulnerable children • we make the rights of the child accessible to as many people as possible We work for a world where children's rights are respected, protected and enforced >> Other ways to donate **Let’s stay connected** EN |FR|ES|DE **Petition to Stop the Destruction of the Amazon Rainforest** BE HEARD! Advocate for the protection of child rights by calling for an end to fires and deforestation in the Amazon Rainforest!"}