{"id": 2225, "name": "Suffolk Gazette", "domain": "suffolkgazette.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://www.suffolkgazette.com/dominic-raab-calls-raf-to-coordinate-safe-return-of-holidaying-government-officials/", "title": "Dominic Raab Calls Raf To Coordinate Safe Return Of Holidaying Government Officials", "content": "Home NewsSportBusinessFarmingObituariesVideosFeatures Sport Business Farming Obituaries Videos Features Sport Business Farming Obituaries Videos Features About Contact **Christmas decorations feud lands neighbours in court** Home NewsSportBusinessFarmingObituariesVideosFeatures Sport Business Farming Obituaries Videos Features Sport Business Farming Obituaries Videos Features About Contact Advertise Home NewsSportBusinessFarmingObituariesVideosFeatures Sport Business Farming Obituaries Videos Features Sport Business Farming Obituaries Videos Features About Contact **Nestlé gives customers the Toffee Finger as Xmas Quality Street tub shrinks again** **Bovaer cattle food supplement’s bull-oon side effect** **A load of baubles: Londoners unimpressed by ‘scrawny’ Trafalgar Square Xmas tree** **Refund for Mince Pie connoisseur who ‘can’t taste the difference’** **Dominic Raab calls RAF to coordinate safe return of holidaying Government officials** 0shares Facebook Twitter WhatsApp Share: Facebook Messenger LinkedIn Pinterest Reddit Email Copy Link Dominic Raab today took personal control of the emergency return of Government ministers and officials from holiday. The Foreign Secretary showed his hands-on approach in a crisis in a photograph randomly taken in his office today. Mr Raab was keen to get ministers safely back from boutique hotels in the Mediterranean and elsewhere, just in case a completely unforeseen event blew up in a foreign country and required their attention. “You never know what might happen in an uncertain world,” said a spokesperson for Mr Raab’s office. “Just to be on the safe side, the Foreign Secretary was today on the phone to the RAF ensuring ministers were rescued from their hellhole, first-class vacations and safely brought back to the UK.” RAF spokesperson Wing Commander Lorraine Fisher, 34, said: “There are hundreds of ministers desperately trying to get back before anyone notices they had sneaked off for some sunshine. “We have the logistic expertise to get everyone back before anyone notices.” **Buy a mug and support Suffolk Gazette journalism** Enjoy our stories? Buy a mug from our sister site Dirty Old Goat and revenues will help pay our costs while also getting you a cool mug. Buy from theDirty Old Goat websiteor from the items below… **Get our stories on email** Receive awesome content in your inbox, every week. We don’t spam! Read more in ourprivacy policy You’ve been successfully subscribed to our newsletter! 0shares Facebook Twitter WhatsApp Share: Facebook Messenger LinkedIn Pinterest Reddit Email Copy Link **Nestlé gives customers the Toffee Finger as Xmas Quality Street tub shrinks again** **Bovaer cattle food supplement’s bull-oon side effect** **A load of baubles: Londoners unimpressed by ‘scrawny’ Trafalgar Square Xmas tree** **Refund for Mince Pie connoisseur who ‘can’t taste the difference’** **Just In** **8 Ways to Reduce Fuel Consumption** **How Technology is Elevating the Live Casino Experience** **From Aliens to Royal Names: The Weird World of Unusual Bets** **When Winning Isn’t Everything – History’s Most Notorious Sore Losers** **Struggling or Thriving? The Everyday Realities of Running a Local Business** **Sport** **Premier League 2024/25: Five of the new campaign’s biggest breakout stars** **Ageing Coventry City fans get shirty at annual gathering** **Who’s Next for England Football Coach? A Lineup of Legendary Losers** **High hopes for Refugee Olympic Team’s pole vaulters** **Spain V England Football: A Lesson from History** **Business** **New Tube line will connect Ipswich to London** **London Underground introduces First Class carriages** **Intrigue over Suffolk version of Monopoly** **How Sky News became latest Suffolk Gazette victim** **Norfolk six-fingered gloves make £100million profit** **Features** **Top Six Payment Methods for Online Gambling** **How to Spot an Unsafe or Scam Crypto Casino** **Slow death awaits bored residents of Acton, Suffolk** **Understanding the Growth Trajectory of the UK Casino Industry in 2024** **The Power of Online Reviewers** Advertise Contact About Privacy Pinterest Reddit Email Copy Link"}