{"id": 32, "name": "KFSN - ABC30 Fresno News", "domain": "abc30.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://abc30.com/live-updates/la-protest-live-updates-lapd-says-officers-are-making-arrests-dtla-dispersal-order/16717204/", "title": "La Protest Live Updates Lapd Says Officers Are Making Arrests Dtla Dispersal Order", "content": "**Nationwide ICE protests live updates: 30 LA-area mayors call for raids to end** Tensions are escalating for a fifth day in Los Angeles after protests against Immigration and Customs Enforcement gripped the city, with demonstrators clashing with law enforcement and setting vehicles on fire downtown. President Donald Trump has deployed 4,000 National Guardsmen and 700 Marines to LA. But California Gov. Gavin Newsom and California Attorney General Rob Bonta are suing the Trump administration, saying they unlawfully \"trampled over\" California's sovereignty when they federalized the California National Guard. Across the country, marchers similarly took to the streets in New York City in an anti-ICE protest that began in Foley Square, across from where immigration enforcement operations have been centered. Protests have have also been seen in San Francisco, Boston, Dallas, Chicago, Atlanta and other cities. This is a developing story. Please check back for updates. **Key Headlines** 1 hour and 3 minutes agoDOJ calls lawsuit challenging federal deployment a 'crass political stunt' 1 hour and 3 minutes ago61 Mexican nationals detained in LA raids 2 hours and 19 minutes agoFederal agents involved in LA crash accused of hit-and-run; LAPD investigating 1 hour and 3 minutes ago225 arrests in LA Tuesday night 3 hours and 29 minutes agoNational Guard can detain people **National Guard troops have temporarily detained civilians in LA protests, commander says** National Guard troops already have temporarily detained civilians in the Los Angeles protests over immigration raids, the commander in charge said Wednesday, but they quickly turned them over to law enforcement. Maj. Gen. Scott Sherman also said about 500 of the National Guard troops have been trained so far to accompany agents on immigration operations. Photos of Guard soldiers providing security for the agents have already been circulated by immigration officials. Sherman is commander of Task Force 51, which is overseeing the more than 4,000 Guard troops and 700 Marines who have been deployed to Los Angeles to provide security during the protests. **Marines in LA will have completed 4 days of crowd control training** All 700 Marines sent to LA must complete four days of crowd control training, Marine Commandant Gen. Eric Smith told the Senate Armed Services Committee. Smith said that the Marines are operating under standard Rules of Force. \"These rules emphasize de-escalation, use of non-lethal force and the inherent right of self-defense for Marines and others,\" he said. The 4,000 National Guardsmen must complete two days of crowd control training, he said. **DOJ calls lawsuit challenging federal deployment a 'crass political stunt'** California Gov. Gavin Newsom'slawsuit challenging the Trump administration from using the military to enforce federal immigration lawsis a \"crass political stunt endangering American lives,\" Department of Justice lawyers said. The lawyers asked a federal judge to deny Newsom's request for a temporary restraining order that would limit the military to protecting federal buildings, arguing such an order would amount to a \"rioters' veto to enforcement of federal law.\" \"The extraordinary relief Plaintiffs request would judicially countermand the Commander in Chief's military directives -- and would do so in the posture of a temporary restraining order, no less. That would be unprecedented. It would be constitutionally anathema. And it would be dangerous,\" they argued. In Newsom's request for an emergency order blocking the troops from assisting in federal law enforcement, he argued Trump failed to meet the legal requirements for a federal deployment of the National Guard. Title 10 of the U.S. Code on Armed Services allows a federal deployment in response to a \"rebellion or danger of a rebellion against the authority of the Government of the United States.\" \"To put it bluntly, there is no invasion or rebellion in Los Angeles; there is civil unrest that is no different from episodes that regularly occur in communities throughout the country, and that is capable of being contained by state and local authorities working together,\" Newsom argued. In response, lawyers with the Department of Justice argued that California should not \"second-guess the President's judgment that federal reinforcements were necessary\" and that a federal court should defer to the president's discretion on military matters.a **30 LA-area mayors call for raids to end: 'Political theater ... rooted in fear'** Thirty mayors from the LA area joined together at a news conference to call on the raids to end. LA Mayor Karen Bass again claimed that LA is \"part of a national experiment\" by the Trump administration \"to determine how far the federal government can go in reaching in and taking over power\" from state and local leaders. Bass also highlighted the estimated $134 million spent to deploy the Marines and National Guard, saying, \"all of our cities could use that money.\" For many residents of the south LA city of Paramount -- one of the sites of protests -- \"this has been one of the most devastating moments in recent memory,\" Paramount Mayor Peggy Lemons said, with some families now too afraid to leave their homes. Huntington Park Mayor Arturo Flores, a Marine Corps veteran who served in Iraq and Afghanistan, said, \"The militarization of immigration enforcement has no place in our neighborhoods and the deployment of Marines on U.S. soil is an alarming escalation that undermines the values of democracy.\" \"We stand against these fear-based tactics that target immigrant communities and erode public trust,\" he said, calling the administration's actions \"political theater that is rooted in fear.\" **Related Topics** U.S. & WORLD PROTEST IMMIGRATION ICE LAPD LOS ANGELES RALLY RAID **Top Stories** **Visalia man killed in Fresno County crash involving trailer, CHP says** 2 hours ago **Visalia man killed in Fresno County crash involving trailer, CHP says** 2 hours ago **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **ICE protests: 30 LA-area mayors call for raids to end** 1 hour ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Jury reaches split verdict in Harvey Weinstein sex crimes retrial** 2 hours ago **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Brian Wilson, visionary leader of the Beach Boys, dies at 82** **Workers run from fields as ICE agents raid California farms** 3 hours ago **Workers run from fields as ICE agents raid California farms** 3 hours ago **Fresno Unified reprints thousands of diplomas to change one word** **Fresno Unified reprints thousands of diplomas to change one word** **California asks court to stop troops on ICE raids** 2 hours ago **California asks court to stop troops on ICE raids** 2 hours ago **Trump says China trade deal 'done,' but subject to 'final approval'** 1 hour ago **Trump says China trade deal 'done,' but subject to 'final approval'** 1 hour ago"}