{"id": 1864, "name": "Accuracy in Media", "domain": "aim.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://aim.org/2025/06/10/were-trying-to-embed-dei-across-every-area-western-carolina-university-administrator-tells-accuracy-in-media/", "title": "Were Trying To Embed Dei Across Every Area Western Carolina University Administrator Tells Accuracy In Media", "content": "Investigations Activism NEWS Search Sign Up Submit a tip Donate **‘We’re trying to embed’ DEI ‘across every area,’ Western Carolina University administrator tells Accuracy in Media** June 10, 2025 By Accuracy in Media An administrator at Western Carolina University admitted to an Accuracy in Media hidden-camera investigator there is a “strategy” to “embed” Diversity, Equity, and Inclusion (DEI) across the university so that lawmakers “can’t legislate it away,” despite the Board of Governors’ ban on DEI across the University of North Carolina system. Karen Price, the Director of Institutional Assessment at Western Carolina University, told AIM’s investigator, in terms of DEI, they “are still absolutely doing all of that work;” however, in order to keep it under the radar in the “current political climate,” there is no one person in the role of Chief Diversity Officer. DEI, however, is spread out throughout the school and “being repurposed through other positions so that we can do the work,” she said. “Like honestly, it’s more we’re trying to embed that kind of Diversity, Equity, Inclusiveness, Inclusive Excellence, really across, like, every area should have responsibility for that,” she said. “Like, it shouldn’t just be like an office or a figurehead.” When AIM’s investigator said, “And if you embed it, then it can’t be legislated out,” Price enthusiastically agreed. “There you go!” she said. “Now you’re, now you’re understanding the strategy behind what it is.” “It is easier for them to be like, well, you need to get rid of that position because it has that niche title,” she explained. “Well, if we don’t create titles, and that it’s more just the work you do, and it’s part of everything that should be centered on just being, living your mission… That you’re right, you can’t legislate it away. You can’t take away positions.” Price told AIM’s investigator how positions and money have been dispersed to evade the DEI ban, while continuing to do DEI-related work.“I think if you saw the news, there are some places that did lose a lot of positions because they were more, less strategic, I guess, about the approach,” she said. “So we were able to take, in fact, take the monies that were there and more disperse them down to action level.” “So, the work is still occurring very much here at Western. You just might see it called different things,” Price summarized. “I don’t even mind pissing people off,” Price said. “But I think what it comes down to, though, is just making sure that we’re able to do the work.” When Accuracy in Media tried to ask Western Carolina University staffers what they thought about DEI work being spread out, dispersed, and embedded throughout the university, they did not have a response. Watch the full video on YouTube here. Price admitted that DEI work is still being done at Western Carolina University under different names, throughout the school, in order to circumvent the Board of Governors’ ban. At theUniversity of North Carolina at Charlotteand theUniversity of North Carolina at Asheville, AIM also found administrators bragging about evading the DEI ban. The administratorswere removed from their positions, but that does not mean radical administrators have stopped plotting throughout the UNC system. Go toSaveNCSchools.comto tell the Board of Governors that administrators should not be discussing how to “embed” DEI throughout the school, using different names in order to bypass the ban. **YOUR SUPPORT WILL HOLD THE MEDIA ACCOUNTABLE.** Accuracy in Media is a 501(c)(3) nonprofit using citizen activism and undercover journalism to expose corruption, law-breaking, and public policy failures. We empower individuals to take action and hold government officials, school administrators, and other power players accountable. Radical activists have taken control of every facet of our culture — from classrooms to boardrooms. If you and I don’t fight back now, we risk losing the country we love. Join the movement. Take the pledge. I pledge to do my part in holding bad actors accountable. I pledge to support freedom of speech whenever views are silenced. I pledge to uphold the values of a well-informed free society. **Pledge Now** 1717 K Street NWSuite 900Washington, DC 20006Phone: 202-670-7729 ©2025 Accuracy In Media Donate Contact Us Media Requests Privacy Policy Search About Us"}