{"id": 698, "name": "Issues in Science and Technology", "domain": "issues.org", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://issues.org/futuretensefiction/future-tense-fiction-artificial-intelligence-criminal-justice-joh/", "title": "Future Tense Fiction Artificial Intelligence Criminal Justice Joh", "content": "About Us Events News Contact UsAddressesSubmissionsAdvertising Addresses Submissions Advertising Addresses Submissions Advertising Explore IssuesBy TopicAgriculture and FoodArtificial Intelligence and Machine LearningBiological TechnologyClimateDefense and National SecurityDigital LandscapeDiversity, Equity, and InclusionEducationEnergyEngineering and InfrastructureEnvironmentEthics, Values, and PhilosophyGlobal AffairsInnovation PolicyMedicinePublic HealthResearch ConductScience and SocietyScience PoliticsSpaceTransportationWorkforceBy FocusNavigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series.Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan.By SectionPerspectivesReal NumbersForumEditor’s JournalFiction and PoetryBook ReviewsBy InterviewSaul PerlmutterFei-Fei LiCarla HaydenArati PrabhakarBen S. BernankeFreeman Hrabowski IIIEddie Bernice JohnsonAlondra Nelson By TopicAgriculture and FoodArtificial Intelligence and Machine LearningBiological TechnologyClimateDefense and National SecurityDigital LandscapeDiversity, Equity, and InclusionEducationEnergyEngineering and InfrastructureEnvironmentEthics, Values, and PhilosophyGlobal AffairsInnovation PolicyMedicinePublic HealthResearch ConductScience and SocietyScience PoliticsSpaceTransportationWorkforce Agriculture and Food Artificial Intelligence and Machine Learning Biological Technology Climate Defense and National Security Digital Landscape Diversity, Equity, and Inclusion Education Energy Engineering and Infrastructure Environment Ethics, Values, and Philosophy Global Affairs Innovation Policy Medicine Public Health Research Conduct Science and Society Science Politics Space Transportation Workforce By FocusNavigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series.Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan. Navigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series. Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan. By SectionPerspectivesReal NumbersForumEditor’s JournalFiction and PoetryBook Reviews Perspectives Real Numbers Forum Editor’s Journal Fiction and Poetry Book Reviews By InterviewSaul PerlmutterFei-Fei LiCarla HaydenArati PrabhakarBen S. BernankeFreeman Hrabowski IIIEddie Bernice JohnsonAlondra Nelson Saul Perlmutter Fei-Fei Li Carla Hayden Arati Prabhakar Ben S. Bernanke Freeman Hrabowski III Eddie Bernice Johnson Alondra Nelson By TopicAgriculture and FoodArtificial Intelligence and Machine LearningBiological TechnologyClimateDefense and National SecurityDigital LandscapeDiversity, Equity, and InclusionEducationEnergyEngineering and InfrastructureEnvironmentEthics, Values, and PhilosophyGlobal AffairsInnovation PolicyMedicinePublic HealthResearch ConductScience and SocietyScience PoliticsSpaceTransportationWorkforce Agriculture and Food Artificial Intelligence and Machine Learning Biological Technology Climate Defense and National Security Digital Landscape Diversity, Equity, and Inclusion Education Energy Engineering and Infrastructure Environment Ethics, Values, and Philosophy Global Affairs Innovation Policy Medicine Public Health Research Conduct Science and Society Science Politics Space Transportation Workforce Agriculture and Food Artificial Intelligence and Machine Learning Biological Technology Climate Defense and National Security Digital Landscape Diversity, Equity, and Inclusion Education Energy Engineering and Infrastructure Environment Ethics, Values, and Philosophy Global Affairs Innovation Policy Medicine Public Health Research Conduct Science and Society Science Politics Space Transportation Workforce By FocusNavigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series.Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan. Navigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series. Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan. Navigating a Polluted Information EcosystemFake news, misinformation, and disinformation have become bywords for the kinds of false and misleading information that’s rampant online. But these terms—and a focus on fact-checking problematic content more generally—provide little understanding of the ways people create and share information. The essays here identify ways to help people navigate today’s polluted information ecosystems. Read responses to this series. Guru Madhavan’s New York TrilogyEngineers work not only on visionary projects, but build and—critically—maintain the infrastructure of modern life: sanitation, trains, bridges, and elevators. There is no better place to understand the importance of engineering than New York City, and no better advocate for this often-overlooked infrastructure than Guru Madhavan. By SectionPerspectivesReal NumbersForumEditor’s JournalFiction and PoetryBook Reviews Perspectives Real Numbers Forum Editor’s Journal Fiction and Poetry Book Reviews Perspectives Real Numbers Forum Editor’s Journal Fiction and Poetry Book Reviews By InterviewSaul PerlmutterFei-Fei LiCarla HaydenArati PrabhakarBen S. BernankeFreeman Hrabowski IIIEddie Bernice JohnsonAlondra Nelson Saul Perlmutter Fei-Fei Li Carla Hayden Arati Prabhakar Ben S. Bernanke Freeman Hrabowski III Eddie Bernice Johnson Alondra Nelson Saul Perlmutter Fei-Fei Li Carla Hayden Arati Prabhakar Ben S. Bernanke Freeman Hrabowski III Eddie Bernice Johnson Alondra Nelson Archives Podcast Galleries Future Tense Fiction Future Tense Fiction **Automated Justice?** By Elizabeth Joh April 25, 2025 Rey Velasquez Sagcal Future Tense Fiction **Automated Justice?** By Elizabeth Joh April 25, 2025 Artificial intelligence won’t solve for human error and bias in the criminal justice system. That doesn’t mean it can’t be useful. Share This essay is a response to **The 28th** Mark Stasenko Related Video **Criminal Justice, Automation, and Trust: An Interview With Mark Stasenko** The emerging applications of artificial intelligence promise huge social benefits: significant gains indetecting breast cancerthat allow radiologists to focus on other patient needs, the deciphering of text inside a 2,000-year-old scorched scrollso carbonized that it cannot be unrolled, the development of new drugs through 3Dprotein structure prediction, and so on. But there are perils too, as ordinary people, especially low-income Americans, can attest to: AI systems that, usually with little explanation,deny home loans, set predatoryrent prices, and rejectemployment applications, to name a few. Yet nowhere is the use of AI as fraught as it is in the criminal justice system, where adverse decisions lead to starkly life-altering outcomes. This isn’t a hypothetical future concern: criminal justice automation of varying degrees has already arrived. Local police agencies can turn topredictive technologiesto help direct patrol resources and evengenerate police reports. A number of jurisdictions userisk assessment toolsto decide who should be detained pretrial. Others permit judges to usealgorithmic toolsto determine criminal sentences. Parole boards can rely onautomated assessmentsto identify who should be eligible for parole. So AI is already present in the criminal justice system. But how far should it go? In his Future Tense Fiction story “The 28th,” Mark Stasenko asks us to take the next logical step. What if automated systems weren’t just guides, but replacements for nearly every human in the process—including forensic analysts, defense attorneys, prosecutors, and even juries? In Stasenko’s provocative thought experiment, there are still human detectives engaged in investigations, but even they are under AI supervision, and almost every other criminal justice process has been delegated to AI agents. The detectives’ AI partner, Sybil, isn’t just a guide; “she” is a mandatory taskmaster, now backed up with the legal authority of a constitutional amendment. What would a world of nearly totally automated criminal cases look like—a Siri with coercive power? What would a world of nearly totally automated criminal cases look like? Most technologists, scholars, and civil rights advocates today would balk at the idea, and rightly so. The incursion of AI into the criminal justice system has already brought with it a series of controversies and problems. Predictive policing, touted in2011as one of the best inventions of the year and widely praised in the early 2010s, became so associated with hidden bias andinaccuracythat some citieseventually banned it. Automated gunshot detection software promises to revolutionize police resource allocation, but it turns out to be plagued witherrors and inefficiencies. Facial recognition technologies might seem like a foolproof method of identification, until you hear the stories ofRobert Julian-Borchak Williamsand others who have been wrongfully arrested on the basis of faulty matches. The underlying premise of “The 28th,” as is often the case with the most perceptive speculative fiction, seems entirely plausible. So disillusioned with the criminal justice system and its traditional, human-centered processes, the public backs a constitutional amendment to do away with juries of one’s peers in criminal trials. The goal is to rid the system of humans’ implicit biases and misguided emotion. The story’s detectives, Alex and Elijah, work notwithbutforAI agents that analyze data, direct police work, process cases, and deliver verdicts. In the story, we see that each detective stands at seemingly opposing ends of the spectrum of responses to AI: Alex opts for blind trust, Elijah for rejection. Neither one is realistic or advisable. Each detective stands at seemingly opposing ends of the spectrum of responses to AI: Alex opts for blind trust, Elijah for rejection. Neither one is realistic or advisable. Elijah’s complete rejection of an AI-driven system, based on his nostalgic yearning for “intuitive” police work, papers over the many flaws of traditional policing and ignores the technological revolutions around him. The datafied world today requires some degree of automation to process the sheer amount of information out there; policing must adapt like every other institution in society. And as Elijah’s interventions—which I won’t spoil here—suggest, there is every reason to be skeptical of the “good old days” of human manipulation, bad faith, and error. Alex’s unquestioning faith, for its part, is ill-conceived for different reasons. When he loses his wife to human error, he embraces all that an AI system promises because it appears to be everything that humans are not. For Alex, AI “eliminated” the “type of human error” that led to his wife’s death. But Alex fails to see that AI systems aren’t handed down by some infallible divinity; they are created by flawed human beings. Even worse, the workings of his AI partner Sybil’s judgments are opaque. We can’t know how Sybil resolves any criminal case because the process is hidden within a “black box.” The story’s 28th Amendment may have eliminated our own Sixth Amendment, but if due process is still a part of the future, defendants should shudder at the lack of transparency in the process. There are other troubling aspects of Stasenko’s useful thought experiment. Sybil is not a government-created entity; these AI agents are produced by a private company whose own interests are presumably inclined toward market dominance and corporate secrecy, not public transparency or accountability. Sybil may be the dominant AI in criminal justice because she is the best program available—or because, as the story hints, her creators are the most politically savvy. Similar issues have already cropped up in our world. Some criminal defendants have beenbarred from accessing the algorithmsused to convict them because private companies have invokedtrade secret entitlements. Sybil’s creators may have few incentives to disclose the technology’s inner workings. That scenario feels far from just. Alex realizes the follies of his blind faith in Sybil in the worst possible way: when he is unjustly accused of murder. And Elijah, the person who frees Alex from his AI-dictated fate, harbors his own flawed motivations. So what’s a rational person to do? None of these extremes will do when it comes to the future of AI in the criminal justice system. Part of the answer lies in verbal cues Stasenko has left within the story: the related concepts of faith and fate. Faith is what leaves Alex blind to Sybil’s faults. It is the loss of faith in the criminal justice system that led to the 28th Amendment. The fate of a defendant, once left to a human jury, is handed over to an all-encompassing AI agent. None of these extremes will do when it comes to the future of AI in the criminal justice system. Some AI tools will be beneficial to the criminal justice system, so long as there is oversight and accountability. As petabytes of police bodycam videos become the norm, for example,generative AI technologiescan help already overburdened public defense attorneys review the data for their clients. Policymakers must take the middle path when it comes to applying new technologies in the service of criminal justice: to weigh costs and benefits, to foregroundhuman values like due process and justice, and to abjure any notion that AI will provide a solution to a system createdbypeople that makes decisions of enormous consequenceforpeople. And sometimes, society needs to say no. No to Sybil. Unfortunately, political support for such restraintmay have receded. But one thing is clear: As “The 28th” warns us, AI is a tool, not an answer. **About the Author** Elizabeth Johis the Martin Luther King Jr. Professor of Law at the University of California Davis School of Law. An expert on policing, privacy, and technology, she serves as an appointed member of theNational Academies of Sciences, Engineering, and Medicine study committee on Facial Recognition: Current Capabilities, Future Prospects, and Governance. Future Tense Fiction is a partnership betweenIssues in Science and Technologyand the Center for Science and the Imagination at Arizona State University. **Cite this article** Joh, Elizabeth. “Automated Justice?” Future Tense Fiction.Issues in Science and Technology(April 25, 2025). **Share** Extreme Heat and Climate Storytelling: An Interview With Harrison CookWriter and potter Harrison Cook discusses “The Shade Technician,” his May 2025 story for Future Tense Fiction. Writer and potter Harrison Cook discusses “The Shade Technician,” his May 2025 story for Future Tense Fiction. Writer and potter Harrison Cook discusses “The Shade Technician,” his May 2025 story for Future Tense Fiction. The Shade TechnicianIn a heat-sieged city whose residents have become functionally nocturnal, an essential worker labors during the day to fix private shade structures designed to provide shelter from the grueling sun for anyone who can pay. In a heat-sieged city whose residents have become functionally nocturnal, an essential worker labors during the day to fix private shade structures designed to provide shelter from the grueling sun for anyone who can pay. In a heat-sieged city whose residents have become functionally nocturnal, an essential worker labors during the day to fix private shade structures designed to provide shelter from the grueling sun for anyone who can pay. The Limits of Heat ResilienceHow resilient to extreme heat can humans really be? Our bodies have a limit—and our response to climate change should reflect that. How resilient to extreme heat can humans really be? Our bodies have a limit—and our response to climate change should reflect that. How resilient to extreme heat can humans really be? Our bodies have a limit—and our response to climate change should reflect that. Criminal Justice, Automation, and Trust: An Interview With Mark StasenkoFilm and TV writer Mark Stasenko chats about the story behind his April 2025 Future Tense Fiction story, “The 28th,” in an interview with editor Mia Armstrong-López. Film and TV writer Mark Stasenko chats about the story behind his April 2025 Future Tense Fiction story, “The 28th,” in an interview with editor Mia Armstrong-López. Film and TV writer Mark Stasenko chats about the story behind his April 2025 Future Tense Fiction story, “The 28th,” in an interview with editor Mia Armstrong-López. Future Tense Fiction is a speculative fiction series that uses imagination to explore how science and technology will shape our future. It features short stories that are written by acclaimed authors across a wide range of styles. Each story is paired with original artwork byRey Velasquez Sagcaland a response essay from an expert who connects the fictional narrative to real-world policy debates. If you’d like to get in touch with us about one of our fiction stories, or pitch your own, reach out toimagination@asu.edu. Copyright © 2025 Arizona Board of Regents. All Rights Reserved. PO Box 877705, Tempe, AZ 85287 Sign up for theIssues in Science and Technologynewsletter to get the latest policy insights delivered direct to your inbox. When you do, you'll receive a special offer for nearly 50% off a one-year subscription to the magazine—or simplysubscribe now at this special rate. Name*FirstLast Email* NameThis field is for validation purposes and should be left unchanged. Δ"}