{"id": 1069, "name": "CityNews Ottawa", "domain": "ottawa.citynews.ca", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ottawa.citynews.ca/2025/06/08/national-guard-troops-arrive-in-los-angeles-on-trumps-orders-to-quell-immigration-protests/", "title": "National Guard Troops Arrive In Los Angeles On Trumps Orders To Quell Immigration Protests", "content": "Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg About Contact Newsletters News Insiders NewsAllLocalCanadaWorldBusiness Local Canada World Business Local Canada World Business WatchAllLatest videosRogers tv OttawaAn Hour to Give Latest videos Rogers tv Ottawa An Hour to Give Latest videos Rogers tv Ottawa An Hour to Give ListenAllNow You Know with Rob SnowThe Big Story PodcastSeekr Audio AppAll Shows Now You Know with Rob Snow The Big Story Podcast Seekr Audio App All Shows Now You Know with Rob Snow The Big Story Podcast Seekr Audio App All Shows Traffic Weather Gas Prices ContestsAllContests & OffersContest Rules Contests & Offers Contest Rules Contests & Offers Contest Rules CommunityAllShowcase Showcase Showcase OttawaAllOttawaCalgaryEdmontonHalifaxKitchenerMontrealOttawaTorontoVancouverWinnipeg Ottawa Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg Ottawa Calgary Edmonton Halifax Kitchener Montreal Ottawa Toronto Vancouver Winnipeg About Contact Newsletters News Insiders **Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops** By Eric Thayer, Jason Dearen And Jake Offenhartz, The Associated Press Posted Jun 8, 2025 11:04:13 AM. Last Updated Jun 9, 2025 09:37:53 AM. Tensions in Los Angeles escalated Sunday as thousands of protesters took to the streets in response to President Donald Trump’s extraordinary deployment of the National Guard, blocking off a major freeway and setting self-driving cars on fire as law enforcement used tear gas, rubber bullets and flash bangs to control the crowd. Many protesters dispersed as evening fell and police declared an unlawful assembly, a precursor to officers moving in and making arrests of people who don’t leave. Some of those remaining threw objects at police from behind a makeshift barrier that spanned the width of a street and others hurled chunks of concrete, rocks, electric scooters and fireworks at California Highway Patrol officers and their vehicles parked on the closed southbound 101 Freeway. Officers ran under an overpass to take cover. Sunday’s protests in Los Angeles, a sprawling city of 4 million people, were centered in several blocks of downtown. It was the third and most intense day of demonstrations against Trump’s immigration crackdown in the region, as the arrival of around 300 Guard troops spurred anger and fear among many residents. The Guard was deployed specifically to protect federal buildings, including the downtown detention center where protesters concentrated. Los Angeles Police Chief Jim McDonnell said officers were “overwhelmed” by the remaining protesters. He said they included regular agitators who show up at demonstrations to cause trouble. Several dozen people were arrested throughout the weekend of protest. One was detained Sunday for throwing a Molotov cocktail at police, and another for ramming a motorcycle into a line of officers. Trump responded to McDonnell on Truth Social, telling him to arrest protesters in face masks. “Looking really bad in L.A. BRING IN THE TROOPS!!!” he wrote. **Dozens arrested at San Francisco protest** In San Francisco, officers monitoring protests arrested dozens of people Sunday night after a group of people refused to comply with an order to disperse, police said in a statement on social media. Officers were monitoring a protest in the area of Sansome and Washington streets but declared an unlawful assembly when people in the group became violent, the San Francisco Police Department said. Many people left the scene, but some remained and some moved to Market and Kearny streets, where people vandalized buildings and a police vehicle. A small group continued to Montgomery Street and when they didn’t comply with a dispersal order, police said officers arrested 60 people. Three officers were injured, including one who was taken to a hospital, police said. “Individuals are always free to exercise their First Amendment rights in San Francisco but violence — especially against SFPD officers — will never be tolerated,” the statement said. **Clashes escalate as National Guard troops arrive** In Los Angeles on Sunday morning, National Guard troops stood shoulder to shoulder, carrying long guns and riot shields as protesters shouted “shame” and “go home.” After some closely approached the guard members, another set of uniformed officers advanced on the group, shooting smoke-filled canisters into the street. Minutes later, the Los Angeles Police Department fired rounds of crowd-control munitions to disperse the protesters, who they said were assembled unlawfully. Much of the group then moved to block traffic on the 101 freeway until state patrol officers cleared them from the roadway by late afternoon. Nearby, at least four self-driving Waymo cars were set on fire, sending large plumes of black smoke into the sky and exploding intermittently as the electric vehicles burned. By evening, police had issued an unlawful assembly order shutting down several blocks of downtown Los Angeles. Flash bangs echoed out every few seconds into the evening. **Governor says Guard not needed** Democratic Gov. Gavin Newsom requested Trump remove the guard members in a letter Sunday afternoon, calling their deployment a “serious breach of state sovereignty.” He was in Los Angeles meeting with local law enforcement and officials. The deployment appeared to be the first time in decades that a state’s national guard was activated without a request from its governor, a significant escalation against those who have sought to hinder the administration’s mass deportation efforts. Newsom and Los Angeles Mayor Karen Bass blamed the increasingly aggressive protests on Trump’s decision to deploy the Guard, calling it a move designed to enflame tensions. They’ve both urged protesters to remain peaceful. “What we’re seeing in Los Angeles is chaos that is provoked by the administration,” she said in an afternoon press conference. “This is about another agenda, this isn’t about public safety.” But McDonnell, the LAPD chief, said the protests were following a similar pattern for episodes of civil unrest, with things ramping up in the second and third days. He pushed back against claims by the Trump administration that the LAPD had failed to help federal authorities when protests broke out Friday after a series of immigration raids. His department responded as quickly as it could, and had not been notified in advance of the raids and therefore was not pre-positioned for protests, he said. Newsom, meanwhile, has repeatedly said that California authorities had the situation under control. He mocked Trump for posting a congratulatory message to the Guard on social media before troops had even arrived in Los Angeles, and said on MSNBC that Trump never floated deploying the Guard during a Friday phone call. He called Trump a “stone cold liar.” The admonishments did not deter the administration. “It’s a bald-faced lie for Newsom to claim there was no problem in Los Angeles before President Trump got involved,” White House spokesperson Abigail Jackson said in a statement. **Deployment follows days of protest** The arrival of the National Guard followed two days of protests that began Friday in downtown Los Angeles before spreading on Saturday to Paramount, a heavily Latino city south of the city, and neighboring Compton. Federal agents arrested immigrants in LA’s fashion district, in a Home Depot parking lot and at several other locations on Friday. The next day, they were staging at a Department of Homeland Security office near another Home Depot in Paramount, which drew out protesters who suspected another raid. Federal authorities later said there was no enforcement activity at that Home Depot. The weeklong tally of immigrant arrests in the LA area climbed above 100, federal authorities said. Many more were arrested while protesting, including a prominent union leader who was accused of impeding law enforcement. The protests did not reach the size of past demonstrations that brought the National Guard to Los Angeles, including the Watts and Rodney King riots, and the 2020 protests against police violence, in which Newsom requested the assistance of federal troops. The last time the National Guard was activated without a governor’s permission was in 1965, when President Lyndon B. Johnson sent troops to protect a civil rights march in Alabama, according to the Brennan Center for Justice. **Trump says there will be ‘very strong law and order’** In a directive Saturday, Trump invoked a legal provision allowing him to deploy federal service members when there is ”a rebellion or danger of a rebellion against the authority of the Government of the United States.” He said he had authorized the deployment of 2,000 members of the National Guard. Trump told reporters as he prepared to board Air Force One in Morristown, New Jersey, Sunday that there were “violent people” in Los Angeles “and they’re not gonna get away with it.” Asked if he planned to send U.S. troops to Los Angeles, Trump replied: “We’re gonna have troops everywhere. We’re not going to let this happen to our country.” He didn’t elaborate. About 500 Marines stationed at Twentynine Palms, about 125 miles (200 kilometers) east of Los Angeles were in a “prepared to deploy status” Sunday afternoon, according to the U.S. Northern Command. Associated Press writer Michelle Price contributed to this report **Top Stories** The Rat Mitigation Working Group says that there were fewer rodent-related calls to 311 last year than in 2023. According to a memo sent to councillors, it appears as if some of the ongoing solutions... 5h ago The Rat Mitigation Working Group says that there were fewer rodent-related calls to 311 last year than in 2023. According to a memo sent to councillors, it appears as if some of the ongoing solutions... 5h ago Police were called to a small Ontario town in Lanark County for a disturbance that led to several charges for a man. Officers were called on May 31 around 8:00 p.m. to a home in Portland, a community... 2h ago Police were called to a small Ontario town in Lanark County for a disturbance that led to several charges for a man. Officers were called on May 31 around 8:00 p.m. to a home in Portland, a community... 2h ago The Public Health Agency of Canada says seven people have been hospitalized with salmonella infections after consuming salami that's been linked to a recall. According to the agency, 57 people have... 3h ago The Public Health Agency of Canada says seven people have been hospitalized with salmonella infections after consuming salami that's been linked to a recall. According to the agency, 57 people have... 3h ago Several people were charged in a week's time by Ontario Provincial Police officers for impaired driving. In a press release, officials from the Upper Ottawa Valley detachment say that the four drivers... 4h ago Several people were charged in a week's time by Ontario Provincial Police officers for impaired driving. In a press release, officials from the Upper Ottawa Valley detachment say that the four drivers... 4h ago **Trending Now** OPP put young bear 'out of its misery' after hit-and-run 'Ten degree drop in an hour', Environment Canada lays out how cold front will hit Ottawa World Cup is one year away Committee approves zoning for residential developments in Orléans, Barrhaven Man charged after 'heated dispute' and further threats while at hospital **Top Stories** The Rat Mitigation Working Group says that there were fewer rodent-related calls to 311 last year than in 2023. According to a memo sent to councillors, it appears as if some of the ongoing solutions... 5h ago The Rat Mitigation Working Group says that there were fewer rodent-related calls to 311 last year than in 2023. According to a memo sent to councillors, it appears as if some of the ongoing solutions... 5h ago Police were called to a small Ontario town in Lanark County for a disturbance that led to several charges for a man. Officers were called on May 31 around 8:00 p.m. to a home in Portland, a community... 2h ago Police were called to a small Ontario town in Lanark County for a disturbance that led to several charges for a man. Officers were called on May 31 around 8:00 p.m. to a home in Portland, a community... 2h ago The Public Health Agency of Canada says seven people have been hospitalized with salmonella infections after consuming salami that's been linked to a recall. According to the agency, 57 people have... 3h ago The Public Health Agency of Canada says seven people have been hospitalized with salmonella infections after consuming salami that's been linked to a recall. According to the agency, 57 people have... 3h ago Several people were charged in a week's time by Ontario Provincial Police officers for impaired driving. In a press release, officials from the Upper Ottawa Valley detachment say that the four drivers... 4h ago Several people were charged in a week's time by Ontario Provincial Police officers for impaired driving. In a press release, officials from the Upper Ottawa Valley detachment say that the four drivers... 4h ago **Most Watched Today** The Beach Boys co-founder and creative lead behind its iconic joyful pop sound Brian Wilson has died at the age of 82. 2h ago The Beach Boys co-founder and creative lead behind its iconic joyful pop sound Brian Wilson has died at the age of 82. 2h ago CityNews' Sports Reporter Lindsay Dunn spoke with hockey icon Hayley Wickenheiser about the Oilers series. CityNews' Sports Reporter Lindsay Dunn spoke with hockey icon Hayley Wickenheiser about the Oilers series. Two men drowned in Sturgeon Lake after their canoe capsized. Police are urging the public to exercise caution while in the water as the victims were reportedly not wearing life-jackets. Two men drowned in Sturgeon Lake after their canoe capsized. Police are urging the public to exercise caution while in the water as the victims were reportedly not wearing life-jackets. Ontario Premier Doug Ford pledged to 'onshore' steel and aluminum in Ontario in retaliation of Trump's 50 per cent tariffs on imports. Ontario Premier Doug Ford pledged to 'onshore' steel and aluminum in Ontario in retaliation of Trump's 50 per cent tariffs on imports. A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 40m ago A retired MP warns Canada is in an age of monsters, and must learn to navigate that - despite inviting some of those monsters the G7 summit in Alberta. That includes world leaders who have been accused of extrajudicial assassinations. 40m ago Get the CityNews AppGet breaking news, traffic, and weather alerts from CityNews Ottawa – available for both Android and iOS. **Get the CityNews App** Get breaking news, traffic, and weather alerts from CityNews Ottawa – available for both Android and iOS. **Get the CityNews App** Get breaking news, traffic, and weather alerts from CityNews Ottawa – available for both Android and iOS. Apple Store Google Play Store About Us News Policy Contact Us Privacy Policy Ad Choices Political Ads Registry Accessibility Feedback Terms of Service"}