{"id": 2066, "name": "WKIM - 98.9 FM - Memphis", "domain": "newstalk989.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.newstalk989.com/2025/06/10/local-mayor-paul-young-meets-with-state-leaders-following-their-critical-news-conference/", "title": "Local Mayor Paul Young Meets With State Leaders Following Their Critical News Conference", "content": "SHOWSMemphis Morning News: 6-9amBrian Kilmeade: 9am -11amThe Vince Show 11 -2pmWill Cain Show 2-3pmNation of Jake: 3pm -6pmJimmy Failla 6-9pmWeekend ShowsProducer MAXTalk MoneyTool Talk RadioReal Deal Racing ReportBuy Sell or StayFull Schedule Memphis Morning News: 6-9am Brian Kilmeade: 9am -11am The Vince Show 11 -2pm Will Cain Show 2-3pm Nation of Jake: 3pm -6pm Jimmy Failla 6-9pm Weekend ShowsProducer MAXTalk MoneyTool Talk RadioReal Deal Racing ReportBuy Sell or Stay Producer MAX Talk Money Tool Talk Radio Real Deal Racing Report Buy Sell or Stay Full Schedule Memphis Morning News: 6-9am Brian Kilmeade: 9am -11am The Vince Show 11 -2pm Will Cain Show 2-3pm Nation of Jake: 3pm -6pm Jimmy Failla 6-9pm Weekend ShowsProducer MAXTalk MoneyTool Talk RadioReal Deal Racing ReportBuy Sell or Stay Producer MAX Talk Money Tool Talk Radio Real Deal Racing Report Buy Sell or Stay Producer MAX Talk Money Tool Talk Radio Real Deal Racing Report Buy Sell or Stay Full Schedule Studio Insider Tigers Titans EventsUpcoming EventsCommunity Calendar901 TIX Upcoming Events Community Calendar 901 TIX Upcoming Events Community Calendar 901 TIX Sweet Deals AboutAdvertiseContestsStation InformationContest Rules Advertise Contests Station Information Contest Rules Advertise Contests Station Information Contest Rules **LOCAL | Mayor Paul Young Meets With State Leaders Following Their Critical News Conference** Following a press conference on Monday, Memphis Mayor Paul Young met with a number of Tennessee State Representatives at City Hall on Tuesday. Several organizations came together at the meeting on Monday to call on city officials to reject xAI’s permit applications to run methane gas turbines. They criticized the mayor, and are calling for an effort to stop Elon Musk’s xAI project from proceeding. Following remarks regarding him and his support for the xAI expansion, Young summoned the meeting with Representatives Joe Towns, G.A. Hardaway, Torrey Harris, and Justin J. Pearson. The meeting’s goal, according to Mayor Young, was to update the state officials on the project’s progress and address any “misunderstandings” over the city’s involvement with xAI. “While I’m thankful that the Mayor brought folks together today, the reality of what we are dealing with is that we should have been included in the conversation before this project ever came here. Because you know who would have asked questions about public health? I would have.” MUST-WATCH: “We went to MEMPHIS and found an environmental crime scene.”An important@MorePerfectUSdeep dive on Elon’s XAI supercomputer polluting Memphis with no community input, no permits, and seemingly no guardrails.#MemphisVsMuskFull:https://t.co/BAgieCuY07pic.twitter.com/rM0TbG3zMe Privacy Policy Terms of Service General Contest Rules FCC Online Public File EEO Report Station Information Employment Opportunities Cumulus Media Corporate Copyright 2020 Cumulus Media / Cumulus Media is an equal opportunity employer / AA View Full Site"}