{"id": 1300, "name": "STAT (News)", "domain": "statnews.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.statnews.com/pharmalot/2025/06/10/avidity-fda-trump-pfizer-pharma-biotech-medicine-prices-merck-cholesterol-rsv-sanofi-astrazeneca-pbm-arkansas-cvs-cigna-walmart/", "title": "Avidity Fda Trump Pfizer Pharma Biotech Medicine Prices Merck Cholesterol Rsv Sanofi Astrazeneca Pbm Arkansas Cvs Cigna Walmart", "content": "Manage alerts for this article Email this article Share this article Newsletters Log In My Account SubscribeNow SettingsComplete your personal information for a more tailored experience Complete your personal information for a more tailored experience Complete your personal information for a more tailored experience Billing Log Out Newsletters Log In My Account SubscribeNow Biotech Pharma Public Health Health Tech Policy Science First Opinion STAT+ STAT Events Log In Try STAT+ My Account Home Latest BusinessBiotechPharmaHealth TechHealth InsuranceHospitalsMedical Devices Biotech Pharma Health Tech Health Insurance Hospitals Medical Devices Biotech Pharma Health Tech Health Insurance Hospitals Medical Devices WashingtonPolicyFDACDCNIH Policy FDA CDC NIH Policy FDA CDC NIH ScienceCRISPRGene TherapyResearchNeuroscience CRISPR Gene Therapy Research Neuroscience CRISPR Gene Therapy Research Neuroscience Public HealthH5N1 Bird FluAddictionCovid-19AbortionHealth DisparitiesInfectious DiseaseMental Health H5N1 Bird Flu Addiction Covid-19 Abortion Health Disparities Infectious Disease Mental Health H5N1 Bird Flu Addiction Covid-19 Abortion Health Disparities Infectious Disease Mental Health DiseaseCancerCardiovascular DiseaseChronic DiseaseDiabetesAlzheimer'sObesity Cancer Cardiovascular Disease Chronic Disease Diabetes Alzheimer's Obesity Cancer Cardiovascular Disease Chronic Disease Diabetes Alzheimer's Obesity FeaturesThe MAHA DiagnosisHealth Care's ColossusEmbedded Bias The MAHA Diagnosis Health Care's Colossus Embedded Bias The MAHA Diagnosis Health Care's Colossus Embedded Bias Adam Feuerstein Matthew Herper Ed Silverman CRISPR Tracker Breakthrough Device Tracker Generative AI Tracker Obesity Drug Tracker Upcoming Events Summits 2025 Breakthrough West 2025 STAT Summit STAT Open Doors 2025 STAT Wunderkinds 2025 STAT Brand Studio Don't miss out Subscribe to STAT+ today, for the best life sciences journalism in the industry **Pharmalittle: We’re reading about a Merck shot for RSV, a lawsuit over an Arkansas PBM law, and more** **Drugmakers met with Trump officials about lowering drug prices but no commitments were made** Manage alerts for this article Email this article Share this article ByEd Silverman June 10, 2025 Pharmalot Columnist, Senior Writer Ed Silverman Ed Silverman, a senior writer and Pharmalot columnist at STAT, has been covering the pharmaceutical industry for nearly three decades. He is also the author of the morningPharmalittle newsletterand the afternoonPharmalot newsletter. Top of the morning to you. Once again, menacing gray skies are hovering over the placid Pharmalot campus, but our spirits remain decidedly sunny, nonetheless. Why? We will trot out a bit of insight from the infamous Morning Mayor, who taught us that “every new day should be unwrapped like a precious gift.” While you tug on the ribbon, we will fire up the trusty coffee kettle to brew another cup of stimulation. Please feel free to join us. Remember, a prescription is not required, so no need to worry about rebates or copayments or all those other under-the-hood calculations that can make life challenging. Our choice today, by the way, is salted caramel. Meanwhile, here are a few items of interest. Hope you have a smashing day and conquer the world. And of course, do keep in touch. … Merck won approval from the U.S. Food and Drug Administration for a shot that protects against RSV, the most common cause of hospitalization among infants,STATnotes. This is the third monoclonal antibody product to protect babies against respiratory syncytial virus to be approved by the agency, a development public health experts hope may eventually help to bring down the price of this effective but costly way of reducing the crushing burden of RSV illness on families and the health care system. The Merck drug, which will be marketed under the name Enflonsia, was approved for use in children under the age of 12 months. The wholesale price has been set at $556 a dose, Merck said, which is the same price charged for the shot of its major competitor, Sanofi and AstraZeneca’s Beyfortus. While the price points are the same, the two products have differences. There are two different-sized doses for Beyfortus, depending on a baby’s weight, and a single dosage of Enflonsia used for all babies. That could give the product an advantage in that pediatricians would not have to worry about giving the wrong dose to a baby. advertisement Meanwhile, a Merck cholesterol pill succeeded in two late-stage studies, marking a win for the drugmaker as it focuses on the development of growth drivers beyond its cancer drugs and vaccines,Reuterswrites. The company is searching for its next blockbuster candidate as its major revenue driver, Keytruda, is expected to lose patent protection by the end of the decade. Merck’s non-statin cholesterol drug, enlicitide decanoate, is being tested for the treatment of hyperlipidemia, a condition that causes elevated buildup of fat in the blood vessels and can lead to heart attacks and strokes. Enlicitide works by blocking PCSK9, a protein that plays a crucial role in regulating cholesterol levels, while statins block an enzyme the liver uses to make cholesterol. BMO Capital Markets analyst Evan Seigerman said the Merck drug could potentially provide a “multi-billion dollar opportunity” that expands the PCSK9 market beyond current injectable therapies. The drug showed meaningful reductions in LDL-C cholesterol, commonly referred to as “bad cholesterol”, when compared to placebo and other oral non-statin therapies. STAT+ Exclusive Story Already have an account?Log in **This article is exclusive to STAT+ subscribers** **Unlock this article — plus in-depth analysis, newsletters, premium events, and news alerts.** Already have an account?Log in Monthly $39 Totals $468 per year Totals $468 per year Starter $30 for 3 months, then $399/year Then $399/year Annual $399 Save 15% Save 15% 11+ Users Custom Savings start at 25%! Savings start at 25%! 2-10 Users $300 Annually per user $300 Annually per user To read the rest of this story subscribe to STAT+. Ed SilvermanPharmalot Columnist, Senior WriterEd Silverman, a senior writer and Pharmalot columnist at STAT, has been covering the pharmaceutical industry for nearly three decades. He is also the author of the morningPharmalittle newsletterand the afternoonPharmalot newsletter. Ed Silverman Pharmalot Columnist, Senior Writer Ed Silverman, a senior writer and Pharmalot columnist at STAT, has been covering the pharmaceutical industry for nearly three decades. He is also the author of the morningPharmalittle newsletterand the afternoonPharmalot newsletter. Ed Silverman Pharmalot Columnist, Senior Writer Ed Silverman, a senior writer and Pharmalot columnist at STAT, has been covering the pharmaceutical industry for nearly three decades. He is also the author of the morningPharmalittle newsletterand the afternoonPharmalot newsletter. **Newsletter** Understand how science, health policy, and medicine shape the world every day Your data will be processed in accordance with ourPrivacy PolicyandTerms of Service. You may opt out of receiving STAT communications at any time. **STAT Plus:Pharmalittle: We’re reading about Trump and drug prices, Gilead trial delays, and more** ByEd Silverman **STAT Plus:Pharmalittle: We’re reading about FDA and gene therapies, a kidney disease showdown, and more** ByEd Silverman advertisement **STAT Plus:Up and down the ladder: The latest comings and goings** ByEd Silverman **STAT Plus:Pharmalittle: We’re reading about GLP-1 drugs and eye disease, European pharma reforms, and more** ByEd Silverman **STAT Plus:Pharmalittle: We’re reading about Novo Nordisk’s cautious culture, FDA approvals, and more** ByEd Silverman STAT Plus:Internal document shows how UnitedHealth executives prepared to tamp down investor unrestByCasey Ross,Tara Bannow, andBob Herman **STAT Plus:Internal document shows how UnitedHealth executives prepared to tamp down investor unrest** ByCasey Ross,Tara Bannow, andBob Herman ByCasey Ross,Tara Bannow, andBob Herman **STAT Plus:Internal document shows how UnitedHealth executives prepared to tamp down investor unrest** ByCasey Ross,Tara Bannow, andBob Herman ByCasey Ross,Tara Bannow, andBob Herman ByCasey Ross,Tara Bannow, andBob Herman STAT Plus:The shrewd startup founder who led DOGE’s cost-cutting at HHSByTara Bannow **STAT Plus:The shrewd startup founder who led DOGE’s cost-cutting at HHS** ByTara Bannow ByTara Bannow **STAT Plus:The shrewd startup founder who led DOGE’s cost-cutting at HHS** ByTara Bannow ByTara Bannow ByTara Bannow STAT Plus:UnitedHealth's accidental email attachment, and hospitals' hunt for ‘additional volume’ByBob Herman **STAT Plus:UnitedHealth's accidental email attachment, and hospitals' hunt for ‘additional volume’** ByBob Herman ByBob Herman **STAT Plus:UnitedHealth's accidental email attachment, and hospitals' hunt for ‘additional volume’** ByBob Herman ByBob Herman ByBob Herman STAT Plus:NIH details how Trump budget would cut support for grants, training, and research centersByJonathan WosenandDaniel Payne **STAT Plus:NIH details how Trump budget would cut support for grants, training, and research centers** ByJonathan WosenandDaniel Payne ByJonathan WosenandDaniel Payne **STAT Plus:NIH details how Trump budget would cut support for grants, training, and research centers** ByJonathan WosenandDaniel Payne ByJonathan WosenandDaniel Payne ByJonathan WosenandDaniel Payne STAT Plus:RFK Jr.'s chronic disease agency would eliminate or reduce funding for some prevention programsByElizabeth Cooney **STAT Plus:RFK Jr.'s chronic disease agency would eliminate or reduce funding for some prevention programs** ByElizabeth Cooney ByElizabeth Cooney **STAT Plus:RFK Jr.'s chronic disease agency would eliminate or reduce funding for some prevention programs** ByElizabeth Cooney ByElizabeth Cooney ByElizabeth Cooney Share options X X X X Bluesky Bluesky Bluesky Bluesky LinkedIn LinkedIn LinkedIn LinkedIn Facebook Facebook Facebook Facebook Doximity Doximity Doximity Doximity Copy link Copy link Copy link Reprints Reprints Reprints Reprints Reporting from the frontiers of health and medicine Company About Our Team Contact Us Careers Diversity & Inclusion Awards Advertise With Us STAT Brand Studio Licensing Stories Account STAT+ Group Subscriptions FAQ My Account Log In Subscribe More Events Newsletters Reports App Podcasts Community Privacy Terms Do Not Sell My Data Ethics Policy AI Policy Supporters ©2025 STAT"}