{"id": 334, "name": "Dallas Morning News", "domain": "dallasnews.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.dallasnews.com/help/the-dallas-morning-news-launches-new-brand-campaign-this-is-home", "title": "The Dallas Morning News Launches New Brand Campaign This Is Home", "content": "News Business Sports High School Sports Arts & Entertainment Food Go See DFW Opinion Manage Account ePaper Weather Best in DFW VoteNow CuriousTexas Advice Store Life & Loss inDallas Abode Things toDo Podcasts ePaper Obituaries PublicNotices HelpCenter Help **The Dallas Morning News launches new brand campaign: ‘This is Home’** **The campaign embodies a deep commitment to meaningful storytelling and the shared experiences of North Texans.** ByThe Dallas Morning News The Dallas Morning Newsis excited to announce the launch of its new brand campaign: “This is Home.” Designed to build community, reinforce reader trust and resonate with people where they are, the campaign embodies a deep commitment to meaningful storytelling and the shared experiences of North Texans. For more than 140 years,The Newshas chronicled the stories that shape the lives and perspectives of its readers, who are also its friends and neighbors. More than just a professional endeavor, this work is rooted in personal connection and dedication — becausethis is home. The new campaign results from a collaboration betweenThe Newsand its sister company, Medium Giant, an integrated creative marketing agency. “This brand campaign with Medium Giant represents an exciting collaboration that goes beyond creative work; it’s about building a meaningful connection with our members and our community who we want to become members,” says Grant Moise, chief executive officer of DallasNews Corporation, and president and publisher ofThe Dallas Morning News. “We hope this campaign helps break through the lack of trust in the media that exists in our country, and helps North Texans understand we want to help them make this community feel smaller, safer and more like home.” Indeed, “This is Home” tells the full story of what it means to be part of North Texas. This includes the triumphs, joys and challenges the community faces. From the pervasive impact of the fentanyl crisis and the challenges of the toll roads to stories that spotlight resilience and hope,The Newsis committed to covering the multifaceted nature of life in the region. “Working withThe Dallas Morning Newsto launch this new campaign has been a dream come true,” says John Kiker, president of Medium Giant. “Our team has spent 15 months researching, brainstorming, interviewing and developing concepts, bringing to life an idea with the power to resonate deeply and make an impact on everyone who encounters it. I couldn’t be more proud of the team and the depth of emotional commitment they’ve poured into this project.” An important element of the campaign is the concept of intersections — where stories, people and perspectives meet.The Newssees itself as an essential part of these intersections, providing its readers with the information and context needed to build their own views while appreciating the perspectives of others. Launching this week, “This is Home” will spotlight iconic intersections across North Texas, bringing to life the places where stories converge and resonate. It’s an invitation to readers to see their home not just through the headlines but through shared experiences and deeper community ties. Stay tuned as “This is Home” unfolds, continuingThe News’ legacy of impactful, relevant journalism. **About DallasNews Corporation** DallasNews Corporation is the Dallas-based holding company ofThe Dallas Morning Newsand Medium Giant.The Dallas Morning Newsis Texas’ leading daily newspaper with an excellent journalistic reputation, intense regional focus and close community ties. With offices in Dallas and Tulsa, Medium Giant is an integrated creative marketing agency with a leading roster of world-class brands and companies. Medium Giant is a wholly owned business of DallasNews Corporation. For additional information, visitmediumgiant.co. For additional information, visitdallasnewscorporation.comor emailinvest@dallasnews.com. Media contact: Kimberly Joneskimberly.jones@mediumgiant.co **Hepola: A ‘Real Housewife’ marries a Dallas Cowboy in a (kinda) castle, and everyone wins** **Texas National Guard on standby for upcoming planned protests** **Dallas-Fort Worth under flood watch as rain continues; see your expected downpour** **Dallas County’s overcrowded jail ‘is broken.’ Officials look to Miami for solutions** **McKinney must pay $60K for SWAT team’s damage to woman’s home, federal judge rules** Autos Classifieds Jobs Obituaries Public Notices Archive Back Copies DMN Store Licensing Photo Reprints Today's Paper AboutThe Dallas Morning News Accessibility Careers Content Removal Review Do Not Sell My Personal Information Privacy Policy Site Map ePaper ePaper (Al Día) Newsletters Podcasts Contact Us Delivery Issues Help Center Manage Your Digital Subscription Manage Your Print Subscription Member Rewards Terms of Service Vacation Stop"}