{"id": 209, "name": "Ceasefire Magazine", "domain": "ceasefiremagazine.co.uk", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ceasefiremagazine.co.uk/comment-dispossession-resistance-is-a-natural-law-right-of-the-palestinian-people/#commenting", "title": "Comment Dispossession Resistance Is A Natural Law Right Of The Palestinian People", "content": "Home About PoliticsSouth of The BorderStatesideIrish TimesNorth African DispatchesLetters from BrusselsNotes from the MarginsQuebec ChroniclesWest Bank Diary South of The Border Stateside Irish Times North African Dispatches Letters from Brussels Notes from the Margins Quebec Chronicles West Bank Diary South of The Border Stateside Irish Times North African Dispatches Letters from Brussels Notes from the Margins Quebec Chronicles West Bank Diary FeaturesProfilesInterviewsSpecial ReportsPhoto EssaysDebateOlympics Watch Profiles Interviews Special Reports Photo Essays Debate Olympics Watch Profiles Interviews Special Reports Photo Essays Debate Olympics Watch Arts & CultureTheatreBooksFilm & TVMusic & DanceShort StoriesChess CornerCartoonsRob Murray's Monday CartoonsWeekend ComicClassical & OperaHello MozartCounterpoeticsExhibitionUnknown Spins Theatre Books Film & TV Music & Dance Short Stories Chess Corner CartoonsRob Murray's Monday CartoonsWeekend Comic Rob Murray's Monday Cartoons Weekend Comic Classical & Opera Hello Mozart Counterpoetics Exhibition Unknown Spins Theatre Books Film & TV Music & Dance Short Stories Chess Corner CartoonsRob Murray's Monday CartoonsWeekend Comic Rob Murray's Monday Cartoons Weekend Comic Rob Murray's Monday Cartoons Weekend Comic Classical & Opera Hello Mozart Counterpoetics Exhibition Unknown Spins Editor's Desk ColumnsIn TheoryModern TimesSabir on SecurityDiary of a Domestic ExtremistDevil's AdvocateCounterSpinDeserter's SongsThe Unveiled TruthThe Cutting EdgePassing for NormalOn Corporate PowerThe Anti-ImperialistShawerma RepublicBeautiful TransgressionsRadical AestheticsPalestine is Still the IssueReflectionsSister OutsiderContours of ControlCounter NarrativesUnder the Tree of TalkingSecret StateAfriclimateRadar ReportsGhosts of History In Theory Modern Times Sabir on Security Diary of a Domestic Extremist Devil's Advocate CounterSpin Deserter's Songs The Unveiled Truth The Cutting Edge Passing for Normal On Corporate Power The Anti-Imperialist Shawerma Republic Beautiful Transgressions Radical Aesthetics Palestine is Still the Issue Reflections Sister Outsider Contours of Control Counter Narratives Under the Tree of Talking Secret State Africlimate Radar Reports Ghosts of History In Theory Modern Times Sabir on Security Diary of a Domestic Extremist Devil's Advocate CounterSpin Deserter's Songs The Unveiled Truth The Cutting Edge Passing for Normal On Corporate Power The Anti-Imperialist Shawerma Republic Beautiful Transgressions Radical Aesthetics Palestine is Still the Issue Reflections Sister Outsider Contours of Control Counter Narratives Under the Tree of Talking Secret State Africlimate Radar Reports Ghosts of History BlogsIdeasCeasefire BitesJody Mcintyre's Life on WheelsLe BlogPaul Guest's Musical NotesThe People in BetweenCeasefire Shorts | Why BDS is working Ideas Ceasefire Bites Jody Mcintyre's Life on Wheels Le Blog Paul Guest's Musical Notes The People in Between Ceasefire Shorts | Why BDS is working Ideas Ceasefire Bites Jody Mcintyre's Life on Wheels Le Blog Paul Guest's Musical Notes The People in Between Ceasefire Shorts | Why BDS is working Science EventsThe Ceasefire SessionsThe Rebellious Media Conference 2011 The Ceasefire Sessions The Rebellious Media Conference 2011 The Ceasefire Sessions The Rebellious Media Conference 2011 Contact Us **Comment| Dispossession resistance is a natural law right of the Palestinian people** **New in Ceasefire- Postedon Friday, May 2, 2025 20:46 -0 Comments** ByAsim Qureshi Credit: Libertinus (licensed under CC BY-SA 2.0.) As part of the team convened by the solicitor Fahad Ansari of Riverway Law to apply for the deproscription of Hamas to the UK Home Secretary, I was tasked by the lawyers to gatherexpert reports that would form the evidentiary basis of our application. We were fortunate that there was little hesitancy on the part of the experts once we approached them – having the former ad hoc judge to the ICJ, John Dugard, as well as Oxford professor Avi Shlaim among the many luminaries to lend their name in support of our submissions. While much has been written on Palestine, and indeed the expert reports covered ground that had been written before, it was important that our legal arguments were based on a body of evidence that supported the intended goals of the application – rather than merely a pastiche of previously published work. For the last twenty-two years of my life, I have studied political violence in a range of contexts around the world, finding that the violence of non-state actors is nearly always the by-product of aggressive colonial, neo-colonial and repressive state forces. In many ways, Palestine stands as one of the most longstanding examples of how a people will continue to resist by any means necessary, when subject to constant state-led violations and oppression. With that in mind, I made my own contributions to the bundle of expert reports.One report focused on the root causes of anti-colonial violence, by centring six case studies including: Palestinian resistance to the Zionist state during the Second Intifada. Chechen resistance to imperial Russia and later Soviet rule. Moro resistance of the US occupation of the Philippines. Uyghur resistance to Chinese settler colonisation of East Turkestan. French resistance to Nazi and Vichy occupation during WWII. Algerian resistance to French colonisation. In all the above cases, it was the context of colonial violence that produced resistance movements, ones which were forced to engage in acts of violence that would seek to disrupt illusion of security maintained by colonial regimes. Whether it was the Bride of Haifa, Hanadi Jaradat, carrying out a martyrdom operation at the restaurant Maxim during the Second Intifada, or the Algerian revolutionary Zohra Drif, planting a bomb in the Milk Bar Café during the Battle of Algiers, or even thejuramentadoattacks by Moro Muslims in the Philippines, during the US occupation in the early 1900s – the violence of resistance movements (organised or random) can always be traced and rooted in the extreme violence of occupying and colonial forces. In the specific context of Palestinian dispossession,my other report seeks to understand how that dispossession presents itself as a grave moral wrong, one that will inevitably produce a violent response due to a natural law right to recover what has been stolen. The report seeks to enter into the taxonomy of violence the notion ofdispossession resistance, a form of violence that flows directly from the loss of land and property. I show how nearly all ancient religious traditions contain severe sanctions against those who seek to deprive others of their land and property, centring the right of those who have lost what they once owned. The Palestinian struggle is very much one of the theft of land, and the choice of a people to not give up on that land and maintain their moral authority over it. While the dispossession has material effects on the Palestinian people, for faith-based movements, such as Hamas, there is also a spiritual dimension todispossession resistancethat must be acknowledged – for their relationship to the land and its recovery is derived from their relationship to God. In my expert report, I highlight the specific element of howdispossession resistanceis presented in the Qur’an, outside of the schema of what is traditionally referred to as the conduct of hostilities withinjihad. This resistance is self-executing. It derives its moral legitimacy from the material reality of dispossession and the loss of what was once owned. Verses in the Qur’an from the chaptersal-Baqarah,al-Hajjandal-Shurah, all strongly set out that not only is there a moral right and imperative to recover what was stolen through violent resistance, but that the upper limit of what is permitted in terms of that resistance, is any act of violence that the enemy has used against you. Such Qur’anic allowances exist outside of the traditional confines ofjihad, which regulates military behaviour far more restrictively. With the loss of land and property, my work is forced to contend with the role played by settlers and settlements since 1948. The story I share of Henrick and Genya Kowalski is instructive, as a Jewish couple who survived the crematoriums of the Nazis, only to arrive in Palestine to be offered the stolen home of a Palestinian family by the Jewish Agency. The Kowalskis were not able to full enter the house they had been given. Instead, they broke down in tears, recognising that they were being asked to do, what the Nazis had done to them. The Israeli anthropologist and scholar Jeff Halper, refers to this dispossession as summarised in the Hebraic word ‘nishul’: “After the ethnic cleansing which accompanied the establishment of an expanded Israel, nishul took the form of removing Palestinians from vast tracts of the country and concentrating them in small, disconnected, and densely packed enclaves or cantons. To be sure, policies to induce emigration remained in place, targeting in particular the Palestinian middle classes, but the thrust of dispossession and de-Arabization shifted from expulsion to confinement.”(p.125) This confinement is exemplified in the concentration camp that is the Gaza strip – a piece of land that is densely populated and cut off from the rest of the world. Its isolation from the Zionists on one side and reinforced by its other jailer, Egypt, on the other. Settlers and settlements exist as a reminder of not only what the Palestinians have had stolen from them, but explicitly as part of the machinery of Zionist violence – the ‘frontier settlements’ ornahalbeing what Eyal Weizman explains, the military units that establish those settlements. These settlements are in the very DNA of Zionism, as explained by David Ben Gurion, that they: “…constitute a human wall against the dangers of invasion…Our territorial conquests and redemptions will not be assured if we do not succeed in erecting a great and closely linked chain of settlements of soldiers, on the borders, in the Negev, on the coast, in the Jerusalem corridor, around Safed, and in all other areas of strategic importance.” If we understand that settlements are a form of dispossession violence themselves, then the Palestinians have every right, in the recovering of their land, to dismantle the settlements by any and all means available to them. Their right to resistance is not limited by the existence settlements and settlers. On the contrary, to understand Palestinian resistance, is to acknowledge that until the entirety of the Zionist colonial entity and all its settlements are dismantled, the Palestinians will be entitled to exercise their natural law right to resist their dispossession and recover what was unlawfully stolen. Asim Qureshigraduated in Law (LLB Hons, LLM), specialising in International Law. He completed his Ph.D. in International Conflict Analysis from the University of Kent. He is the Research Director at the advocacy group CAGE International, and since 2003 has specialised in investigating the impact of counterterrorism practices worldwide. He has published a wide range of NGO reports, academic journals and articles. He has written the booksRules of the Game: Detention, Deportation, Disappearance(Hurst, Columbia UP, 2009);A Virtue of Disobedience(Unbound, 2019); the editor ofI Refuse to Condemn: Resisting Racism in Times of National Security(Manchester UP, 2020) andWhen Only God Can See: The Faith of Muslim Political Prisoners(Pluto, 2024). Since 2009, he has been advising legal teams involved in defending terrorism trials in the US and at Guantanamo Bay, Cuba. **More Ideas** On the Nationality and Borders Bill and the UK LeftCommentTuesday, December 28, 2021 13:50 -4 Comments Profits before People: Britain’s unjust housing system preys on asylum seekersAnalysisWednesday, October 27, 2021 18:26 -0 Comments The Bigotry of Man: “Darwin’s views on race were far from radical”InterviewWednesday, October 13, 2021 19:31 -0 Comments The Girl in the Mirror: On Media Representations and Aesthetics of Shamima BegumAnalysisThursday, September 16, 2021 19:08 -0 Comments Diversity of Tactics is Not a Compromise – it’s Praxis!IdeasMonday, July 19, 2021 10:27 -0 Comments **More In Politics** Forcing the bend: On the police killing of Anthony AlvarezCommentThursday, August 12, 2021 19:11 -0 Comments Britain’s media rears its Islamophobic head againCommentTuesday, June 8, 2021 11:01 -0 Comments Biden’s bomb sales to Israel are an obstacle to peaceCommentSaturday, May 22, 2021 12:41 -0 Comments As Jews, we must stand with the Palestinians against Israel’s colonialismCommentTuesday, May 18, 2021 15:18 -0 Comments The UK government should stop putting arms sales ahead of the lives of PalestiniansCommentTuesday, May 11, 2021 16:54 -0 Comments **More In Features** The Bigotry of Man: “Darwin’s views on race were far from radical”InterviewWednesday, October 13, 2021 19:31 -0 Comments As countries around the world push for nuclear disarmament, the UK and its allies resistSpecial ReportTuesday, January 26, 2021 13:19 -0 Comments As another election looms in Myanmar, its democratic transition remains a facadeSpecial ReportSunday, November 8, 2020 9:51 -0 Comments Systemic racism is a public health threat, just ask PalestiniansSpecial ReportThursday, September 17, 2020 11:43 -0 Comments During this pandemic, governments have waged a parallel war on the truthSpecial ReportMonday, August 24, 2020 16:59 -1 Comment **More In Profiles** ‘Mon cher Stéphane’: Remembering Stéphane HesselCommentThursday, February 28, 2013 15:49 -4 Comments ProfileFred Halliday: Political JourneysMonday, March 21, 2011 0:00 -0 Comments Tom Hurndall: Honouring a legacyTributeWednesday, March 9, 2011 0:00 -1 Comment Modern Times:Playing to WinTuesday, November 2, 2010 0:00 -0 Comments Profile:Slavoj Žižek – The Dog’s Bollocks … at the Media Dinner PartyThursday, October 28, 2010 0:00 -13 Comments **More In Arts & Culture** Forensic Architecture: Cloud Studies (Whitworth Gallery)ExhibitionFriday, August 13, 2021 17:07 -1 Comment Review | ‘Chav Solidarity’ by D. HunterBooksFriday, June 26, 2020 11:31 -0 Comments The Universal Enemy: Jihad, Empire, and the Challenge of Solidarity by Darryl LiBooksFriday, June 19, 2020 8:43 -0 Comments Tiger King, COVID-19, and the Nature of WorkCultureWednesday, May 20, 2020 16:19 -2 Comments A resonant poetry of survival: Shareefa Energy’s Galaxy WalkBooksThursday, December 5, 2019 15:31 -1 Comment About Politics Arts & Culture Columns Editor’s Desk Events Features Contact Us © Ceasefire Magazine 2002-2025. All Rights Reserved. Sign up forentries RSSand for thecomments RSS."}