{"id": 1423, "name": "The Quint", "domain": "thequint.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.thequint.com/entertainment/celebrities/stolen-interview-with-anurag-kashyap-vikramaditya-motwane-kiran-rao-nikhil-advani-abhishek-banerjee-karan-tejpal-amazon-prime", "title": "Stolen Interview With Anurag Kashyap Vikramaditya Motwane Kiran Rao Nikhil Advani Abhishek Banerjee Karan Tejpal Amazon Prime", "content": "Queer, Not Quiet Raghav's Take State of Education Uncovering Hate Qisse Kahaniyaan Climate Change India Fights Fraud Members Only WebQoof MoreMy ReportBrand StudioBusinessTech And Auto My Report Brand Studio Business Tech And Auto My Report Brand Studio Business Tech And Auto FIT Gender Opinion Special Projects Videos Entertainment World The Quint Lab MoreSportsEducationExplainersPodcastsPoliticsGraphic NovelsLawMembers' OpinionSouth AsiansNEON Sports Education Explainers Podcasts Politics Graphic Novels Law Members' Opinion South Asians NEON Sports Education Explainers Podcasts Politics Graphic Novels Law Members' Opinion South Asians NEON Home Naukri Crisis India Fights Fraud Uncovering Hate Special Projects About Us T&C Privacy Policy **BECOME A MEMBER** **BECOME A MEMBER** **“There’s a Lack of Good Producers”: Anurag Kashyap on Directors Moving Away** **Stolen starring Abhishek Banerjee released on Amazon Prime and is backed by Anurag, Kiran, and Vikramaditya.** Karan Tejpal’s debut featureStolenfaced significant challenges in securing funding, but it’s finally here. After premiering at the Venice Film Festival in September 2023, the film was released on Amazon Prime on June 4 and opened torave reviews. A film that explores themes of privilege, corruption, vigilantism, classism, misinformation, caste, and more,Stolenis backed by some of the finest names in the industry — Anurag Kashyap,Kiran Rao, Nikkhil Advani, andVikramaditya Motwane. It starsAbhishek Banerjee, Shubham Vardhan, and Mia Maelzer in key roles. The Quintcaught up with the executive producers, actor Abhishek, and producer Gaurav Dhingra to talk about the reasons behind diminishing theatrical footfalls, why directors are stepping away from the Hindi film industry to make films, the challenges of securing funding, and more. In the recent past, the Hindi film industry has seen directors leave to direct films in other industry, we asked the filmmakers what they thought is the larger issue at play. He also added that, there was a time producers made films and they were proud of it. It was not about statistics and algorithm, \"the moment film studios and companies started going public, things started going downhill.\" Director, producer and writer, Vikramaditya says, \"most of our entertainment is owned by tech companies and not by old-fashioned studios. There is a broadening of that gap, that is happening between people with money and the creative people. Sometimes there is a a tendency for there to be a slight coldness in the approach towards making a movie. In an industry like this, we need warmth and a sense of collectivism.\" The theatrical footfalls have been unpredictable, and films have not been performing as expected at the box office. We asked the filmmakers what factors contribute to this. Vikramaditya says, \"Viewing habits have changed since the pandemic. The audience is used to the idea of watching movies at home. However, if the trailer excites the audience, they will go to the theatres to watch the film.\" Laapataa Ladiesdirector Kiran Rao believes that, thanks to streaming, there are so many great options to watch sitting in your home. \"It takes a lot for someone to go out and find the right show, in the right neighbourhood, and the price of tickets is also sometimes prohibitive.\" She also says that the audience wants to watch films in theatres, but sometimes they aren't playing for long enough, or by the time you hear of the film, it's gone from the theatres. “Only big films can afford it, and small films — even great ones — often can’t afford to reach their viewers.” “For changes of this scale, we need an institutional approach. Every industry is managed and schooled by rules,” director Karan Tejpal added. The filmmakers believe it's time for institutional support, with the state needing to step in. “Films from the southern states have institutional backing. The Hindi film industry, on the other hand, is a bit all over the place,” says Kiran Rao. Watch the video for more. (At The Quint, we question everything. Play an active role in shaping our journalism bybecoming a membertoday.) **ReadLatest NewsandBreaking Newsat The Quint, browse for more fromentertainmentandcelebrities** **Topics:Anurag KashyapAbhishek BanerjeeKiran Rao** Loading Comments... FIT Gender Opinion Special Projects Videos Entertainment World The Quint Lab Sports Education Explainers Podcasts Politics Graphic Novels Law Members' Opinion South Asians NEON Rajdeep Sardesai Interview Waqf Land Manoj Bajpayee Interview Minorities in Bangladesh Fact Check Climate Change News Sharad Pawar: Victim of BJP's Uncovering Hate Jharkhand Lynching"}