{"id": 861, "name": "Louisville Public Media", "domain": "lpm.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lpm.org/music/2025-06-10/kevin-bacon-and-jennifer-nettles-it-can-be-tricky-for-a-musician-to-play-a-musician-on-screen", "title": "Kevin Bacon And Jennifer Nettles It Can Be Tricky For A Musician To Play A Musician On Screen", "content": "NewsLatest NewsArts and CultureCommunityBusiness & Economic DevelopmentEducationEnvironmentHealthInvestigationsKentucky PoliticsMetro LouisvilleSouthern IndianaAppalachia + Mid-South NewsroomOn-Air ScheduleEventsLatest NewsArts and CultureCommunityBusiness & Economic DevelopmentEducationEnvironmentHealthInvestigationsKentucky PoliticsMetro LouisvilleSouthern IndianaAppalachia + Mid-South NewsroomOn-Air ScheduleEvents Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Music502unesGiveawaysPerformances & InterviewsWaterfront WednesdayStreaming ArchiveOn-Air ScheduleWFPK PlaylistsEvents502unesGiveawaysPerformances & InterviewsWaterfront WednesdayStreaming ArchiveOn-Air ScheduleWFPK PlaylistsEvents 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events ClassicalBehind The PlaylistGiveawaysNew LensInstrumental PartnersThe Music BoxOn-Air ScheduleWUOL PlaylistsEventsBehind The PlaylistGiveawaysNew LensInstrumental PartnersThe Music BoxOn-Air ScheduleWUOL PlaylistsEvents Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events InvestigationsLatest storiesThe Housing ProjectDig Season 2: The Model CityCriminal JusticeSpecial ProjectsAdvisory BoardLatest storiesThe Housing ProjectDig Season 2: The Model CityCriminal JusticeSpecial ProjectsAdvisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Newsletters Podcasts 75th Anniversary75th Anniversary Timeline75th Anniversary Recognition Opportunities75 and ChangeAnniversary Luncheon75 for 75 ChallengeDonate75th Anniversary Timeline75th Anniversary Recognition Opportunities75 and ChangeAnniversary Luncheon75 for 75 ChallengeDonate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate SupportBecome a MemberMembership InformationSustainer UpdateBusiness PartnershipVolunteeringMore Ways to SupportShopBecome a MemberMembership InformationSustainer UpdateBusiness PartnershipVolunteeringMore Ways to SupportShop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop About LPMAbout UsContact UsEventsOur StaffAbout UsContact UsEventsOur Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff On AirNow PlayingLPM Music - WFPK On AirNow PlayingLPM News - WFPL On AirNow PlayingLPM Classical - WUOL NewsLatest NewsArts and CultureCommunityBusiness & Economic DevelopmentEducationEnvironmentHealthInvestigationsKentucky PoliticsMetro LouisvilleSouthern IndianaAppalachia + Mid-South NewsroomOn-Air ScheduleEventsLatest NewsArts and CultureCommunityBusiness & Economic DevelopmentEducationEnvironmentHealthInvestigationsKentucky PoliticsMetro LouisvilleSouthern IndianaAppalachia + Mid-South NewsroomOn-Air ScheduleEvents Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Latest News Arts and Culture Community Business & Economic Development Education Environment Health Investigations Kentucky Politics Metro Louisville Southern Indiana Appalachia + Mid-South Newsroom On-Air Schedule Events Music502unesGiveawaysPerformances & InterviewsWaterfront WednesdayStreaming ArchiveOn-Air ScheduleWFPK PlaylistsEvents502unesGiveawaysPerformances & InterviewsWaterfront WednesdayStreaming ArchiveOn-Air ScheduleWFPK PlaylistsEvents 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events 502unes Giveaways Performances & Interviews Waterfront Wednesday Streaming Archive On-Air Schedule WFPK Playlists Events ClassicalBehind The PlaylistGiveawaysNew LensInstrumental PartnersThe Music BoxOn-Air ScheduleWUOL PlaylistsEventsBehind The PlaylistGiveawaysNew LensInstrumental PartnersThe Music BoxOn-Air ScheduleWUOL PlaylistsEvents Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events Behind The Playlist Giveaways New Lens Instrumental Partners The Music Box On-Air Schedule WUOL Playlists Events InvestigationsLatest storiesThe Housing ProjectDig Season 2: The Model CityCriminal JusticeSpecial ProjectsAdvisory BoardLatest storiesThe Housing ProjectDig Season 2: The Model CityCriminal JusticeSpecial ProjectsAdvisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Latest stories The Housing Project Dig Season 2: The Model City Criminal Justice Special Projects Advisory Board Newsletters Podcasts 75th Anniversary75th Anniversary Timeline75th Anniversary Recognition Opportunities75 and ChangeAnniversary Luncheon75 for 75 ChallengeDonate75th Anniversary Timeline75th Anniversary Recognition Opportunities75 and ChangeAnniversary Luncheon75 for 75 ChallengeDonate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate 75th Anniversary Timeline 75th Anniversary Recognition Opportunities 75 and Change Anniversary Luncheon 75 for 75 Challenge Donate SupportBecome a MemberMembership InformationSustainer UpdateBusiness PartnershipVolunteeringMore Ways to SupportShopBecome a MemberMembership InformationSustainer UpdateBusiness PartnershipVolunteeringMore Ways to SupportShop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop Become a Member Membership Information Sustainer Update Business Partnership Volunteering More Ways to Support Shop About LPMAbout UsContact UsEventsOur StaffAbout UsContact UsEventsOur Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff About Us Contact Us Events Our Staff **Kevin Bacon and Jennifer Nettles: “It can be tricky for a musician to play a musician on screen”** Facebook Twitter LinkedIn Email **Kevin Bacon and Jennifer Nettles on Appalachian Horror, Back-from-the-Dead Love Songs, The Bondsman, and The Righteous Gemstones** If you’ve ever wondered what would happen ifJustified,The Exorcist, andNashvillewalked into a bar and started a band,The Bondsmanis your answer. Kevin Bacon plays Hub Halloran, a dead bounty hunter who crawls back from the grave with a grudge, a guitar, and a haunted past. Jennifer Nettles—yes, of Sugarland and Righteous Gemstones fame—plays Maryanne, his ex-wife and possibly future musical partner. And yes, they made a whole damn album as their characters. It’s calledTo Hell And Backand it’s somehow both fictional and totally not. “I went into it blind,” Bacon says. “Didn’t even know where the season was going. No director, no cast. I just read the pilot and told Jason Blum, ‘I’m in.’” Because that’s what you do when Jason Blum texts you. It’s called job security. For Nettles, who’s been politely declining every “can you just play a singer in this?” role for a decade, this one finally made the cut. “I was like, it’s gonna take somethingreallyspecial,” she says. “Because if I do it well, they’ll say ‘she’s just playing herself,’ and if I do it poorly, they’ll say, ‘wow, she can’t even fake being a musician.’” So, a real win-win. Turns out, the magic wasn’t just in the script. Bacon and Nettles wrote the songs themselves—as their characters. That’s not method acting, that’s next-level fanfic with a recording budget. “The first song we wrote was ‘To Hell And Back,’” says Bacon, “and Jen sent me this verse and I was like, ‘Alright, this one’s done.’” It helps that Nettles casually drops lines like“I ain’t Johnny / you ain’t June / but I’d go to hell and back for you.”Meanwhile, most of us are out here rhyming “money” with “honey” like it’s still 1957. “Kevin is a fantastic songwriter,” Nettles says, clearly meaning it, which you can tell because she doesn’t say “for an actor.” And he returns the favor: “We didn’t cast her because she could sing—we cast her because she was the right person. That she can sing and write is just… perfect.” They wrote the songs from their characters’ perspectives. “It was like going back and asking, ‘Who was Hub when he was 25?’” Bacon says. “As an actor, you think about backstory. But I’d never written one into a song before.” Some of those songs made it intoThe Bondsman. Others got the boot. “Multiple songs got rejected,” Bacon says. “Which, to me, is a good thing. It means we weren’t just cramming them in because the star wanted a moment.” Those left behind found a second life onTo Hell And Back, which is kind of poetic for a show about resurrection. “It’s born from this world,” Nettles says, “but it can live outside of it.” In other words, you don’t need to watch the show to dig the record—but if you do, it all hits deeper. The music leans Appalachian and Irish, sometimes hymnal, often haunted. “It’s got a lot of minor Irish folk DNA,” Nettles says, name-checking “Woe Death” and their harmonies on “Will the Circle Be Unbroken” as high points. You know, just your typical demons-and-dustbowl-folk bangers. There are whispers of a live show—Bacon popped up with Sugarland in Austin for a one-off—and if the crowd size was any indicator, people are more than ready to go toHell And Backwith them. Your move, Ryman Auditorium. And for the record, Bacon’s Southern drawl in the show is surprisingly convincing. “I was lucky,” he says. “Jen and Beth Grant were in my ear, and we shot in Georgia. All I had to do was get in the van and listen.” It’s not every day a TV show gives you plot, pathos, and a playable record—call it prestige television with a B-side. Watch the interview above and then check out the trailer below. Facebook Twitter LinkedIn Email NewsKentuckiana Sounds is back to share the soundtrack of the area MusicBrian Wilson, the troubled genius behind The Beach Boys, has died at age 82 NewsLouisville Metro Council to vote on endorsing police reform recommendations NewsSouthern Baptist delegates overwhelmingly call for banning same-sex marriage MusicSam Tabor set the skateboard aside to make a great new album MusicCounting Crows' Adam Duritz: \"My confidence was shattered\" MusicToday is WFPK All Request Mental Health Day! MusicA Food & History Tour That Celebrates Queer Pride in Kentucky Louisville Public Media depends on donations from members –generous people like you– for the majority of our funding. You can help make the next story possible with a donation of $10 or $20. We'll put your gift to work providing news and music for our diverse community. twitter instagram facebook linkedin ABOUTAbout LPMBoard of DirectorsCommunity Advisory BoardInvestigations Advisory BoardDiversity, Equity and InclusionHow We WorkCareersNews about LPM About LPM Board of Directors Community Advisory Board Investigations Advisory Board Diversity, Equity and Inclusion How We Work Careers News about LPM About LPM Board of Directors Community Advisory Board Investigations Advisory Board Diversity, Equity and Inclusion How We Work Careers News about LPM RESOURCESContest PolicyPrivacy PolicyReports and FilingsOn-Air SchedulesContact Us Contest Policy Privacy Policy Reports and Filings On-Air Schedules Contact Us Contest Policy Privacy Policy Reports and Filings On-Air Schedules Contact Us SUPPORTBecome a MemberBusiness SponsorshipMore Ways to SupportShop Become a Member Business Sponsorship More Ways to Support Shop Become a Member Business Sponsorship More Ways to Support Shop"}