{"id": 615, "name": "Greenville Advocate", "domain": "greenvilleadvocate.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.greenvilleadvocate.com/2025/06/04/butler-county-concern-citizens-to-host-education-conference/", "title": "Butler County Concern Citizens To Host Education Conference", "content": "Home NewsRecordsLifestyles Records Lifestyles Records Lifestyles Sports Schools Opinion Obituaries Contests Photos Classifieds Public Notices ServicesAbout UsPoliciesCareersSubmit a News TipSubmit a PhotoBirth AnnouncementSubmit a Letter to the EditorSubmit a Classified Advertisement About Us Policies Careers Submit a News Tip Submit a Photo Birth Announcement Submit a Letter to the Editor Submit a Classified Advertisement About Us Policies Careers Submit a News Tip Submit a Photo Birth Announcement Submit a Letter to the Editor Submit a Classified Advertisement E-Edition **Butler County Concern Citizens to host education conference** Published 12:00 pm Wednesday, June 4, 2025 ByAmy Lewis In an effort to spark local educational reform, Butler County Concern Citizens will host a panel discussion and education conference titled “Improving Education: 2025 & Beyond” on June 7, from 11 a.m. to 3 p.m. at Lurleen B. Wallace (LBW) Community College. “I’ve looked at our education system in the U.S. and then focused on Butler County and Greenville and I wanted to see what I could do to help,” said Kenneth Crum, chairman of Concern Citizens. “It’s going to take the effort of parents, students, educators, community leaders and city officials to help make a better system.” Crum said the conference is designed to bring together local voices and statewide experts to discuss both challenges and actionable solutions in education. **Email newsletter signup** “I figured I had the reach to bring in the experts to not only shed light on what’s going on but offer solutions to help improve it,” Crum said. Panelists include Dr. Kenyetta Kendrick, founder of Kreative Teacher, LLC; Aziya Flynn, Alabama FBLA State President; Dr. Antwauan Stinson, education coordinator; Carolyn Crenshaw, former Butler County Board of Education member; Dr. Jacqueline A. Brooks, assessment and field placement coordinator at Tuskegee University; LaCretia Williams, sociology professor at Alabama State University; Jennifer Burt, retired educator; Patrick Muhammad, known as The Principal Farmer; Harry Crum, CTE counselor; Marcus Hall of Monroe STEM and representatives from the Family Sunshine Center. The event will be moderated by WSFA news anchor Rosanna Smith. Dr. Kendrick emphasized the urgent need to refocus on education. “Unfortunately, education has become a second thought,” Kendrick said. “It has taken a back seat. Education is an institution that is alive. As our society changes, so should we. “We’re going to discuss what we can do within our communities to bring about changes in our education system and what resources are available for both short term and long term actions.” Crum hopes the inclusion of a student panelist will spark deeper understanding and engagement. “I think it’s going to be a very well-rounded conference,” Crum said. “We can hear from the experts exactly what we can do to make the most impact. Then we’ll have a Q&A session and I’m hoping for a lot of engagement. We even have a student on the panel because we want to hear from the youth about what they see and what their issues are.” The event is open to the public and organizers encourage educators, parents, students and community members to attend and participate. **Greenville considers grant to fund demolition** **Camellia City Civitan Club celebrates 70 years** **City of Greenville’s Garbage Notice** **Going from pair to spare** Special Section **Special Section** **Special Section** Calendar of events **Calendar of events** **Calendar of events** Home News Sports Opinion Lifestyles Obituaries Small Business About Us Contact Us Subscriptions – old Policies Submit a Photo Submit a News Tip Engagement Announcement Wedding Announcement © 2025, The Greenville Advocate"}