{"id": 475, "name": "WITI - FOX 6 - Milwaukee", "domain": "fox6now.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox6now.com/news/landlord-tenant-issues-contact-6-questions-reviews-experts", "title": "Landlord Tenant Issues Contact 6 Questions Reviews Experts", "content": "LIVE News Weather Sports WakeUp Real MKE Contests More Local Wisconsin's Most Wanted FOX6 Investigators Podcasts Politics FOX6 News Insta-Poll FOX LOCAL mobile app FOX6 en Español Severe weather alerts FOX6 Storm Center app FOX6 Live Cam Network FOX Weather app FOX Weather Closings Future Forecaster FOX6 Snow Stick webcam Contact 6 FOX6 Cents Recalls Personal Finance Business Small Business Submit for Look Who's 6 Look Who's 6 Real Milwaukee Out and About Interviews Food Gino At The Movies Milwaukee Traffic Tracker Milwaukee Brewers Green Bay Packers Milwaukee Admirals Beyond The Game Milwaukee Bucks Wisconsin Badgers Marquette Golden Eagles High School Hot Shots How to stream LIVE FOX6 newscasts FOX6 Live Cam Network LiveNOW from FOX FOX Weather FOX Sports FOX Soul FOX News Sunday YouTube Facebook Instagram Threads Bluesky X (formerly Twitter) TikTok Facebook (FOX6 Weather) X (FOX6 Weather) FOX6 TV listings FOX Shows Contests 2025 Salute to Seniors Things To Do 2025 Famous Racing Sausages Run/Walk Beer Garden Finder Buddy Check 6 Project ADAM Fish Fry Finder Community Connection Chicago News - FOX 32 Minneapolis News - FOX 9 Detroit News - FOX 2 LiveNOW from FOX Sign up for email alerts FOX6 Mobile Apps FOX6 News Team Jobs at FOX6 Internships at FOX6 EEO Report Public File Help FCC Applications Closed Captioning Info DTV Reception Questions FOX6 Sales Team Advertise with FOX6 FOX FOCUS Sponsored content **Aging; Contact 6 gets answers to your questions** Share Copy Link Email Facebook Twitter LinkedIn Reddit Contact 6's Jenna Sachs and Ask Contact 6 are taking your questions about aging. Find out how you can ask your question. MILWAUKEE-Contact 6 is fielding questions from you about aging. The questions can be about benefits, long-term care, aging in place, estate planning, transportation, healthcare, assistive technology and home modifications. IMPORTANT: We are accepting submissions until 5 p.m. on Monday, June 2. We have experts ready to answer your questions. They include Gerald Hay, Director of Independent Living Services at Independence First and Rebecca Schmitt, the Milwaukee County Director of Aging and Disability Resource Center. We will answer as many questions as possible during an upcomingAsk Contact 6segment. The video will be posted onFOX LOCAL, a free TV streaming app, on Friday, June 6. Please try to keep your submission brief. Video submissions should be less than one minute long. Written submissions may be paraphrased or shortened for time. Please include your first name and city. **CLICK HERE to submit a question for our experts** **** **** **** **DAILY NEWSLETTER** All the news you need to know, every day By clicking Sign Up, I confirmthat I have read and agreeto thePrivacy PolicyandTerms of Service. **** **** Local Wisconsin's Most Wanted FOX6 Investigators Podcasts Politics FOX6 News Insta-Poll FOX LOCAL mobile app FOX6 en Español Severe weather alerts FOX6 Storm Center app FOX6 Live Cam Network FOX Weather app FOX Weather Closings Future Forecaster FOX6 Snow Stick webcam Contact 6 FOX6 Cents Recalls Personal Finance Business Small Business Submit for Look Who's 6 Look Who's 6 Real Milwaukee Out and About Interviews Food Gino At The Movies Milwaukee Traffic Tracker Milwaukee Brewers Green Bay Packers Milwaukee Admirals Beyond The Game Milwaukee Bucks Wisconsin Badgers Marquette Golden Eagles High School Hot Shots How to stream LIVE FOX6 newscasts FOX6 Live Cam Network LiveNOW from FOX FOX Weather FOX Sports FOX Soul FOX News Sunday YouTube Facebook Instagram Threads Bluesky X (formerly Twitter) TikTok Facebook (FOX6 Weather) X (FOX6 Weather) FOX6 TV listings FOX Shows Contests 2025 Salute to Seniors Things To Do 2025 Famous Racing Sausages Run/Walk Beer Garden Finder Buddy Check 6 Project ADAM Fish Fry Finder Community Connection Chicago News - FOX 32 Minneapolis News - FOX 9 Detroit News - FOX 2 LiveNOW from FOX Sign up for email alerts FOX6 Mobile Apps FOX6 News Team Jobs at FOX6 Internships at FOX6 EEO Report Public File Help FCC Applications Closed Captioning Info DTV Reception Questions FOX6 Sales Team Advertise with FOX6 FOX FOCUS Sponsored content facebook twitter instagram threads youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX6 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"}