{"id": 1109, "name": "Politico Europe", "domain": "politico.eu", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.politico.eu/article/proposed-simplification-eu-chemicals-legislation-deregulation-ursula-von-der-leyen-hazard-competitiveness-lobby/", "title": "Proposed Simplification Eu Chemicals Legislation Deregulation Ursula Von Der Leyen Hazard Competitiveness Lobby", "content": "Europe UK France Germany US Policy areasAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTechnology UKTech FranceTradeTrade UK Policy areasAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTechnology UKTech FranceTradeTrade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Technology UK Tech France Trade Trade UK Policy areasAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTechnology UKTech FranceTradeTrade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Technology UK Tech France Trade Trade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Technology UK Tech France Trade Trade UK NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der PodcastOpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast OpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast OpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked Featured SeriesEurope’s looming water crisisPolish Presidency of the EUBreaking out: Stories of Roma empowermentCOP29A global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28Poll of pollsElections in EuropeEuropean Parliament electionPolitico LiveSee All Future EventsAbout our events Featured SeriesEurope’s looming water crisisPolish Presidency of the EUBreaking out: Stories of Roma empowermentCOP29A global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28 Europe’s looming water crisis Polish Presidency of the EU Breaking out: Stories of Roma empowerment COP29 A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 Poll of pollsElections in EuropeEuropean Parliament election Elections in Europe European Parliament election Politico LiveSee All Future EventsAbout our events See All Future Events About our events Featured SeriesEurope’s looming water crisisPolish Presidency of the EUBreaking out: Stories of Roma empowermentCOP29A global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28 Europe’s looming water crisis Polish Presidency of the EU Breaking out: Stories of Roma empowerment COP29 A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 Europe’s looming water crisis Polish Presidency of the EU Breaking out: Stories of Roma empowerment COP29 A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 Poll of pollsElections in EuropeEuropean Parliament election Elections in Europe European Parliament election Elections in Europe European Parliament election Politico LiveSee All Future EventsAbout our events See All Future Events About our events See All Future Events About our events AppsApple StoreGoogle Play StoreMore InfoAbout UsMedia SolutionsPOLITICO StudioPressPrint EditionContact UsCareers at POLITICO AppsApple StoreGoogle Play Store Apple Store Google Play Store More InfoAbout UsMedia SolutionsPOLITICO StudioPressPrint EditionContact UsCareers at POLITICO About Us Media Solutions POLITICO Studio Press Print Edition Contact Us Careers at POLITICO AppsApple StoreGoogle Play Store Apple Store Google Play Store Apple Store Google Play Store More InfoAbout UsMedia SolutionsPOLITICO StudioPressPrint EditionContact UsCareers at POLITICO About Us Media Solutions POLITICO Studio Press Print Edition Contact Us Careers at POLITICO About Us Media Solutions POLITICO Studio Press Print Edition Contact Us Careers at POLITICO Europe UK France Germany US Home Latest news EU-US relations War in Ukraine Newsletters Podcasts Poll of Polls Policy news Events News Opinion **Proposed simplification of EU chemicals legislation masks deregulation** Undermining vital legislation will harm people, the environment and the economy — not to mention citizens’ confidence in the bloc. AI generated Text-to-speech Share options Copy Link EMail Twitter WhatsApp Linkedin Margot Wallström is a former vice president of the European Commission and former foreign minister of Sweden. Jytte Guteland is member of the Swedish parliament and former lead negotiator on EU climate law in the European Parliament. Mats Engström is a former deputy state secretary at the Swedish Ministry for the Environment. The chemical industry is vital to Europe’s economy and employs millions of workers across the bloc. However, too many hazardous substances remain on the market, threatening humans and nature alike. For example, the use of a group of chemicals known as PFAS — or “forever chemicals” — has contaminated thousands of sites and can now be measured in our bloodstreams. It is, therefore, worrying that after 18 years in force, the flagship of Europe’s chemicals legislation — the Registration, Evaluation, Authorisation and Restriction of Chemicals (REACH) — is becoming endangered. What the European Commission has promised is to “simplify” REACH. But theproposalpresented to member country experts seems more akin to deregulation and a lowering of ambitions. For instance, if put into action, the goal of phasing out substances of very high concern would be severely diluted. The main reason behind this revision is an intense lobbying campaign for European “competitiveness.” But this approach is too narrow and short-sighted. And while the intention of simplification may be good, undermining vital legislation will harm people, the environment and the economy — not to mention citizens’ confidence in the EU. Among the authors of this article, one of us proposed and negotiated REACH in the early 2000s, and another was the European Parliament’s lead negotiator on the EU’s climate law. In both cases, we witnessed intense lobbying to slow progress, with industry pressure to weaken REACH described as “the largest ever lobbying campaign in Europe.” The situation today seems widely similar in terms rolling back legislation. According to the EU Transparency Register, industrylobbying on REACH and PFAS has been very intensein recent years. However, there’s no evidence that regulation is the main cause of the chemical industry’s current problems — not to mention that substituting the most hazardous substances would provide a competitive advantage in future global markets. It would also help other industries, such as textiles, furniture and recycling, and several companies in these sectors have already called for a stronger REACHrather than a watered-down one. More crucially, though, what the Commission is indicating would cause harm. It would limit the authorization procedure for substances of very high concern — for example, by excluding those with widespread uses — which would result in more such substances remaining on the market and increasing risks. The Commission is also reversing its position on the 2020Chemicals Strategy for Sustainability. This is particularly evident in its weakened approach to the rapid phaseout of substances with well-established generic risks, such as neurotoxicity, or are persistent in the environment (“forever chemicals”). Essentially, this new approach would reduce regulatory incentive to replace these substances. But we know from experience that voluntary approaches fail to deliver results, with the burden of regulation increasingly falling on national authorities — something that could lead to fragmentation of the internal market. Take the debate on PFAS, which are endocrine disruptors and possible carcinogens. Two of us writing this piece had blood tests done a few years ago, and as expected, the results showed widespread PFAS variants at levels typical of individuals of a similar age. Other potentially dangerous chemicals, such as polychlorinated alkanes, were also present. These levels are remarkably high, and their presence is frightening because there are many gaps in research on the effects they might have. Moreover, it’s almost impossible for individuals to do anything about this, as we’re constantly exposed to these chemicals from so many different sources, including drinking water and food. This is why we need legislation and standards. So far, Commission President Ursula von der Leyen has promoted the “One Health approach” — which links human well-being to that of animals, plants and the wider environment — in a very positive way. But we also need an ambitious policy on hazardous substances that is guided by the precautionary principle. Instead, this potential weakening of chemicals legislation is yet another example of how “simplification” often means deregulation. It also makes the commitment to “stay the course on the Green Deal” in the new Commission’s policy guidelines increasingly meaningless. The Commission’s own estimates show thatthe cost of cleaning up PFAS contamination across the blocwill be between €5 billion and €100 billion per year — that’s just one example of the human and economic cost of inaction when it comes to hazardous substances. As such, Europe’s competitiveness and its citizens would truly benefit from stronger chemicals regulations. In order to achieve that, we must first close the information gap, while the EU accelerates its phaseout of the most harmful substances and ensures regulation is properly enforced in all member countries. To restore the ambition of the EU’s chemicals policy and actually protect both its people and the environment, we need urgent improvements to REACH. Only then can the EU deliver on its commitments to a toxic-free environment. **Our readers read next** **Gaza’s journalists are starved into silence. The EU’s neutrality is complicity.** **Britain at a crossroads: Finance, industry and the global adjustment** **More from Margot Wallström** **Europe to Russia: We won’t forget Crimea** On the second anniversary of Russia’s illegal annexation, European foreign ministers call for sanctions to be upheld. **What to do after the birthday party** It was a good party, with celebrations all over Europe. From the decorated tram train in Vienna to the giant jig-saw puzzle of Europe set up in Madrid to the two-week Festival of Europe in London, Europe has shown that it knows how to celebrate its birthday. **Constitution: from reflection to action** One year ago the French and Dutch referenda on the constitution sent shockwaves through the European Union. As a result, EU leaders called for a ‘period of reflection’. We can now draw lessons. **Sweetening the poverty pill** We have all heard from popstars and prime ministers that this is the year that could make poverty history. It was on the agenda at the G8 summit, at the UN meeting in New York on the Millennium Development Goals and it will also be discussed at the World Trade Organization’s (WTO) upcoming ministerial meeting in Hong Kong. But the commitments we have seen in so far, will not suffice to ‘walk the talk’ in practice. FacebookTwitterYouTube Facebook Twitter YouTube Facebook Twitter YouTube App Store Play Store PolicyAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTech FranceTechnology UKTradeTrade UK PolicyAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTech FranceTechnology UKTradeTrade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Tech France Technology UK Trade Trade UK PolicyAgriculture and FoodCentral BankerCompetition and Industrial PolicyCybersecurity and Data ProtectionDefenseEnergy and ClimateEnergy and Climate UKEnergie et Climat FranceFinancial ServicesFinancial Services UKHealth CareMobilityParis InfluenceSustainabilityTechnologyTech FranceTechnology UKTradeTrade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Tech France Technology UK Trade Trade UK Agriculture and Food Central Banker Competition and Industrial Policy Cybersecurity and Data Protection Defense Energy and Climate Energy and Climate UK Energie et Climat France Financial Services Financial Services UK Health Care Mobility Paris Influence Sustainability Technology Tech France Technology UK Trade Trade UK NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch NewslettersBerlin BulletinBerlin PlaybookBrussels PlaybookDimanchissimeEU Election PlaybookEU InfluenceGlobal PlaybookGlobal Policy Lab: Living CitiesLondon InfluenceLondon PlaybookPlaybook ParisPOLITICO ConfidentialSunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch Berlin Bulletin Berlin Playbook Brussels Playbook Dimanchissime EU Election Playbook EU Influence Global Playbook Global Policy Lab: Living Cities London Influence London Playbook Playbook Paris POLITICO Confidential Sunday Crunch PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der PodcastOpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast OpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked PodcastsEU ConfidentialPolitics at Sam and Anne'sPower PlayWestminster InsiderBerlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast EU Confidential Politics at Sam and Anne's Power Play Westminster Insider Berlin Playbook — Der Podcast OpinionAll OpinionBeyond the BubbleGermany InterpretedDeclassifiedFrom Across the PondUnpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked All Opinion Beyond the Bubble Germany Interpreted Declassified From Across the Pond Unpacked Featured SeriesEurope’s looming water crisisPolish Presidency of the EUA global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28SubscriptionsPOLITICO ProPrint EditionResearch and analysis divisionEditionsPOLITICO EuropePOLITICO UKPOLITICO FrancePOLITICO GermanyPOLITICO US Featured SeriesEurope’s looming water crisisPolish Presidency of the EUA global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28 Europe’s looming water crisis Polish Presidency of the EU A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 SubscriptionsPOLITICO ProPrint EditionResearch and analysis division POLITICO Pro Print Edition Research and analysis division EditionsPOLITICO EuropePOLITICO UKPOLITICO FrancePOLITICO GermanyPOLITICO US POLITICO Europe POLITICO UK POLITICO France POLITICO Germany POLITICO US Featured SeriesEurope’s looming water crisisPolish Presidency of the EUA global emergency: Tackling antimicrobial resistanceLiving CitiesPOLITICO 28 Europe’s looming water crisis Polish Presidency of the EU A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 Europe’s looming water crisis Polish Presidency of the EU A global emergency: Tackling antimicrobial resistance Living Cities POLITICO 28 SubscriptionsPOLITICO ProPrint EditionResearch and analysis division POLITICO Pro Print Edition Research and analysis division POLITICO Pro Print Edition Research and analysis division EditionsPOLITICO EuropePOLITICO UKPOLITICO FrancePOLITICO GermanyPOLITICO US POLITICO Europe POLITICO UK POLITICO France POLITICO Germany POLITICO US POLITICO Europe POLITICO UK POLITICO France POLITICO Germany POLITICO US Manage Privacy Settings About us Contact us Privacy Policy Cookie Policy Media Solutions Research and Analysis Division Agency IQ Press Print Edition Careers at POLITICO Ts&Cs FAQs"}