{"id": 239, "name": "Claiborne Progress", "domain": "claiborneprogress.net", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://claiborneprogress.net/2025/05/27/claiborne-man-charged-with-criminal-homicide-in-shooting-death-of-stepfather/", "title": "Claiborne Man Charged With Criminal Homicide In Shooting Death Of Stepfather", "content": "Home E-Edition News Sports Opinion Obituaries Features Classifieds Contests Services Calendar Public Notices Home News Sports Opinion Obituaries Features Classifieds Contests ServicesAbout UsPoliciesNews TipSubmit a PhotoAnniversary AnnouncementEngagement AnnouncementWedding AnnouncementLetter to EditorPay Subscription About Us Policies News Tip Submit a Photo Anniversary Announcement Engagement Announcement Wedding Announcement Letter to Editor Pay Subscription About Us Policies News Tip Submit a Photo Anniversary Announcement Engagement Announcement Wedding Announcement Letter to Editor Pay Subscription E-Edition Calendar Public Notices **Claiborne man charged with criminal homicide in shooting death of stepfather** Published 2:05 pm Tuesday, May 27, 2025 ByStaff Reports A Claiborne County man has been charged with criminal homicide after shooting and killing his stepfather Sunday morning. According to a report from WRIL, Claiborne County 911 received a call on Sunday morning at 10:19 a.m. that a shooting had taken place at his residence on Old Pearman Road in Cumberland Gap. Claiborne County Sheriff Bob Brooks says that 25-year-old Maxwell A. Madon, who was living with his grandparents, got into an argument with them about cleaning his room and at one point became combative, assaulting the grandfather. Madon’s grandmother then called his stepfather 62-year-old Mark Steven Laws to come to the home to help with his stepson. **Email newsletter signup** Laws came to the residence, began arguing with Madon, and a short time later Madon shot Laws, killing him. During the incident Madon shot through his own hand and was transported to UT Hospital for treatment of the injury. After his release from the hospital he will be lodged in the Claiborne County Jail. Maxwell Madon has been charged with criminal homicide. His bond is unknown at this time. More charges are expected against Madon in connection with this incident. **You Might Like** **Adult male killed, juvenile wounded in Tazewell shooting** **Adult male killed, juvenile wounded in Tazewell shooting** **New Tazewell man charged with selling Methamphetamine** **New Tazewell man charged with selling Methamphetamine** **Congratulations Class of 2025** **Congratulations Class of 2025** Home News Sports Obituaries Opinion Contests Small Business E-Edition Classifieds News Tip Submit a Photo Submit Sports Story Letter to Editor Public Notices About Us Terms of Use"}