{"id": 1204, "name": "R Street Institute", "domain": "rstreet.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rstreet.org/outreach/r-street-letter-of-opposition-to-de-house-republican-caucus-regarding-sb-46-an-act-to-amend-title-21-of-the-delaware-code-relating-to-autonomous-vehicles/", "title": "R Street Letter Of Opposition To De House Republican Caucus Regarding Sb 46 An Act To Amend Title 21 Of The Delaware Code Relating To Autonomous Vehicles", "content": "ResearchAll ResearchOur Policy AreasPolicy StudiesExplainersR SheetsExternal Policy Studies All Research Our Policy Areas Policy Studies Explainers R Sheets External Policy Studies All Research Our Policy Areas Policy Studies Explainers R Sheets External Policy Studies CommentaryAll CommentaryReal Solutions BlogOp-EdsPodcasts All Commentary Real Solutions Blog Op-Eds Podcasts All Commentary Real Solutions Blog Op-Eds Podcasts OutreachAll OutreachLettersTestimonyRegulatory CommentsAmicus Briefs All Outreach Letters Testimony Regulatory Comments Amicus Briefs All Outreach Letters Testimony Regulatory Comments Amicus Briefs Events Connect with R Street **R Street Letter of Opposition to DE House Republican Caucus regarding SB 46, ‘An Act to Amend Title 21 of the Delaware Code Relating to Autonomous Vehicles.’** Share via Email: R%20Street%20Letter%20of%20Opposition%20to%20DE%20House%20Republican%20Caucus%20regarding SB 46,%20‘An%20Act%20to%20Amend%20Title%2021%20of%20the%20Delaware%20Code%20Relating%20to%20Autonomous%20Vehicles.’ Share via Facebook: R%20Street%20Letter%20of%20Opposition%20to%20DE%20House%20Republican%20Caucus%20regarding SB 46,%20‘An%20Act%20to%20Amend%20Title%2021%20of%20the%20Delaware%20Code%20Relating%20to%20Autonomous%20Vehicles.’ Share via Twitter: R%20Street%20Letter%20of%20Opposition%20to%20DE%20House%20Republican%20Caucus%20regarding SB 46,%20‘An%20Act%20to%20Amend%20Title%2021%20of%20the%20Delaware%20Code%20Relating%20to%20Autonomous%20Vehicles.’ Leader Dukes: My name is Adam Thierer. I am a Resident Senior Fellow in the Technology and Innovation program at the R Street Institute. The R Street Institute is a nonprofit, nonpartisan public policy research organization. Our mission is to engage in policy research and outreach to promote free markets and limited, effective government in many areas, including emerging technology. This is why SB 46: “An Act to Amend Title 21 of the Delaware Code Relating to Autonomous Vehicles,” is of particular interest to our organization. The bill would prohibit certain autonomous vehicles (AVs) from being operated on Delaware roads without a human safety operator being physically present within the vehicle. Such a “driver-in” mandate would discourage cutting-edge AV innovation in the state of Delaware and, by extension, undermine road safety. America needs a road safety revolution.[1]Simple tweaks to traditional safety regulations are not sufficient. Unfortunately, public roads in Delaware and across the nation are more dangerous than ever. According to the National Highway Traffic Safety Administration, more than 42,000 people died in motor vehicle traffic crashes in 2022, and the totals have been rising in recent years compared to the previous decade.[2]Traffic fatalities have risen in a similar way in Delaware.[3] There are many factors that contribute to this dismal result, but the major culprits are various types of human driver error including driver distraction, impairment, speeding, and road rage.[4]For example, despite years of government efforts to counter it, alcohol-related driving fatalities are rising in Delaware and the rest of the nation.[5] Therefore, while proposals like SB 46 are well-intentioned, driver-in regulatory requirements are not the way to achieve greater roadway safety. In fact, such regulations could actually undermine safety goals. The promise of AVs is precisely that they will help minimize human error behind the wheel. AVs should not be held to an unreasonable standard of being vastly superior to human-driven vehicles before lawmakers allow them to be deployed widely without human drivers inside.[6]Some scholars refer to this as “robophobia,” and observe that, “[i]f governments restrict the use of driverless cars, the effect might be to limit fatalities associated with driverless cars, but that outcome is desirable only if driverless cars produce more fatalities than cars with drivers,” and that is clearly not the case.[7] Current data suggests AVs are already considerably safer than human drivers, which makes such robophobia dangerous for public safety outcomes.[8]A new peer-reviewed report from Swiss Reinsurance Co. and other technical labs found that Waymo robotaxis “significantly outperformed … the overall driving population” with an 88-percent drop in property-damage claims and a 92-percent drop in bodily-injury claims.[9]Summarizing the significance of these findings, one economist observed that these results mean that current generation AV robotaxis are 10 times safer than human drivers, and that this rate of safety improvement is doubling roughly every five years.[10]Even in the rare cases where AVs have been involved in some crashes, human drivers have been to blame for the majority of them.[11] AV policy flexibility is also an important way to help expand transportation market options for industry and the public alike.[12]It would be particularly counter-productive to impose driver-in mandates at a time when the nation is facing a truck driver shortage.[13]AV advancement might eventually be able to help alleviate that problem. Prohibiting the use of AV technology in semi-trucks could also undermine freight delivery options to the public, which would also raise costs. Importantly, lawmakers should also be aware that any state action that undermines the vibrancy of the American AV industry can have broader ramifications for our nation’s competitiveness with China’s AV industry growing rapidly.[14]Experts note that “China wants to win this race,” and “to be out ahead with this technology.”[15] Notably, during his recent United States Senate confirmation hearing to become the next head of the Department of Transportation, Sean Duffy stressed the importance of AVs as part of a new class of transportation technologies America needs to work to advance because “we are in a global race to out-innovate the rest of the world.”[16]For this reason, Duffy noted in response to questions, AV innovation must also be seen as a national security issue. Throughout the confirmation hearing several Senators echoed his concerns. Again, misguided state regulation of the AV marketplace could counter that goal while also undermining roadway safety more generally. Delaware should look to become a leader in AV innovation and avoid regulatory mandates that would undermine safety and security objectives. The state should instead be considering legislative approaches like those in effect in other states, which create a more flexible legal framework for AV testing and operations. For these reasons, I encourage you and the House Republican Caucus to oppose SB 46. Thank you, Adam ThiererResident Senior Fellow, Technology and InnovationR Street Institute Cc: The Honorable Jeffrey N. Spiegelman, House Minority Whip, Delaware House Republican Caucus David Deputy, Chief of Staff, Delaware House Republican Caucus [1]Jordan McGillis, “Autonomous Now: Why We Need Self-Driving Technology and How We Can Get It Faster,” Manhattan Institute, July 2023. https://manhattan.institute/article/why-we-need-self-driving-technology-and-how-we-can-get-it-faster. [2]National Highway Traffic Safety Administration, “Motor Vehicle Traffic Fatalities and Fatality Rates, 1899-2022,” https://cdan.dot.gov/tsftables/Fatalities and Fatality Rates.pdf. [3]Traffic Safety Facts: Delaware 2018-2022, https://cdan.dot.gov/SASJobExecution. [4]CDC, “Global Road Safety,” May 16, 2024. https://www.cdc.gov/transportation-safety/global/index.html. [5]Craig Anderson, “Keeping tabs on Delaware’s DUI arrests,”Daily State News, July 30, 2024. https://baytobaynews.com/stories/dui-arrests-in-delaware-a-continuing-concern,141187. Scott Calvert, “Drunken-Driving Deaths Are Up. Why Are DUI Arrests Down?”Wall Street Journal, May 2, 2024. https://www.wsj.com/us-news/drunk-driving-deaths-rise-dui-arrests-down-92d53ea7. [6]Matthew Yglesias, “Self-driving cars are underhyped,”Slow Boring, Apr., 25, 2024. https://www.slowboring.com/p/self-driving-cares-are-underhyped. [7]Matt Perault & Andrew K. Woods, “Governing Robophobia,”Lawfare, Sept. 25, 2024. https://www.lawfaremedia.org/article/governing-robophobia. [8]Steven Greenhut, “Slow approval of self-driving cars is costing lives,”Orange County Register, Jan. 12, 2025. https://www.ocregister.com/2025/01/12/slow-approval-of-self-driving-cars-is-costing-lives. [9]“Do Autonomous Vehicles Outperform Latest-Generation Human-Driven Vehicles? A Comparison to Waymo’s Auto Liability Insurance Claims at 25 Million Miles,” 2024. https://waymo.com/research/do-autonomous-vehicles-outperform-latest-generation-human-driven-vehicles-25-million-miles. [10]Gale Pooley, “Waymo Drivers Are Way Safer (10x) Than Humans,”Human Progress, Jan. 7, 2025. https://humanprogress.org/waymo-drivers-are-way-safer-10x-than-humans. [11]Timothy B. Lee, “Human drivers are to blame for most serious Waymo collisions,”Understanding AI, Sept. 10, 2024. https://www.understandingai.org/p/human-drivers-are-to-blame-for-most. [12]Brent Skorup, “Making Transportation Faster, Cheaper and Safer,”Discourse, Feb. 20, 2023. https://www.discoursemagazine.com/p/making-transportation-faster-cheaper-and-safer. [13]Brandon Downs, “New study shows U.S. is facing truck driver shortage,”CBS News, Oct. 26, 2023. https://www.cbsnews.com/sacramento/news/new-study-shows-u-s-is-facing-truck-driver-shortage. [14]Amber DaSilva, “China Has The U.S. Beat On Autonomous Driving,”Jalopnik, March 13, 2024. https://jalopnik.com/china-has-the-u-s-beat-on-autonomous-driving-1851331633. [15]Edward White, “China challenges the west for driverless car supremacy,”Financial Times, Jan. 30, 2024. https://www.ft.com/content/3a649978-69df-46eb-94c8-eee23a69e6bb. [16]Rep. Sean Duffy, Opening Statement Commerce Committee Nomination Hearing as Prepared for Delivery, Jan. 15, 2024. https://www.commerce.senate.gov/services/files/DCD2DD73-6654-4D85-A808-382AA7063234. **R Street Institute** 1411 K Street N.W., Suite 900Washington, D.C. 20005Media Inquiries:pr@rstreet.org (202) 525-5717feedback@rstreet.org Link to Twitter Link to Linkedin Link to Youtube **Sections** Column 1ResearchCommentaryOutreachEvents Research Commentary Outreach Events Research Commentary Outreach Events Column 2About R StreetEmploymentSupport R StreetConnect with R Street About R Street Employment Support R Street Connect with R Street About R Street Employment Support R Street Connect with R Street **Subscribe** Sign up for our newsletter to stay up to date with the latest research and learn about upcoming events. Δ Explore: Research Commentary Outreach Events Connect with R Street Support R Street Our IssuesCriminal Justice and Civil LibertiesCybersecurity and Emerging ThreatsEnergy and EnvironmentFederal Government AffairsFinance and TradeGovernanceHarm ReductionInsuranceProject for Women and FamiliesState PolicyTechnology and InnovationOur Organization Criminal Justice and Civil Liberties Cybersecurity and Emerging Threats Energy and Environment Federal Government Affairs Finance and Trade Governance Harm Reduction Insurance Project for Women and Families State Policy Technology and Innovation Our Organization Criminal Justice and Civil Liberties Cybersecurity and Emerging Threats Energy and Environment Federal Government Affairs Finance and Trade Governance Harm Reduction Insurance Project for Women and Families State Policy Technology and Innovation Our Organization About R StreetTeamEmploymentMedia RelationsProjects Team Employment Media Relations Projects Team Employment Media Relations Projects Support R Street Connect with R Street Link to Twitter Link to Linkedin Link to Youtube ResearchResearch OverviewPolicy StudiesExplainersR SheetsExternal Policy Studies Research Overview Policy Studies Explainers R Sheets External Policy Studies Research Overview Policy Studies Explainers R Sheets External Policy Studies CommentaryCommentary OverviewReal Solutions BlogOp-EdsPodcastsR Street Responds Commentary Overview Real Solutions Blog Op-Eds Podcasts R Street Responds Commentary Overview Real Solutions Blog Op-Eds Podcasts R Street Responds OutreachOutreach OverviewLettersTestimonyRegulatory CommentsAmicus BriefsBooks Outreach Overview Letters Testimony Regulatory Comments Amicus Briefs Books Outreach Overview Letters Testimony Regulatory Comments Amicus Briefs Books Events Connect with R Street About R StreetAbout R StreetTeamFederal & State AffairsMedia RelationsProjectsEmployment About R Street Team Federal & State Affairs Media Relations Projects Employment About R Street Team Federal & State Affairs Media Relations Projects Employment Support R Street Our IssuesIssues OverviewCriminal Justice & Civil LibertiesCompetition PolicyCybersecurity and Emerging ThreatsEnergy and EnvironmentFederal Government AffairsFinance and TradeGovernanceHarm ReductionInsuranceState PolicyTechnology and Innovation Issues Overview Criminal Justice & Civil Liberties Competition Policy Cybersecurity and Emerging Threats Energy and Environment Federal Government Affairs Finance and Trade Governance Harm Reduction Insurance State Policy Technology and Innovation Issues Overview Criminal Justice & Civil Liberties Competition Policy Cybersecurity and Emerging Threats Energy and Environment Federal Government Affairs Finance and Trade Governance Harm Reduction Insurance State Policy Technology and Innovation Link to Twitter Link to Linkedin Link to Youtube"}