{"id": 1958, "name": "Eagle Pass News Leader", "domain": "epnewsleader.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.epnewsleader.com/post/city-of-eagle-pass-secures-nearly-300-000-to-strengthen-drug-task-force-border-security-efforts", "title": "City Of Eagle Pass Secures Nearly 300 000 To Strengthen Drug Task Force Border Security Efforts", "content": "**Eagle Pass News Leader** HOME HOME HOME HOME NEWS NEWS NEWS NEWS VIDEOS VIDEOS VIDEOS VIDEOS ABOUT US ABOUT US ABOUT US ABOUT US More More More All Articles **City of Eagle Pass Secures Nearly $300,000 to Strengthen Drug Task Force, Border Security Efforts** EP News Leader May 29 4 min read EAGLE PASS, TEXAS— The City of Eagle Pass has been awarded a significant $297,835 grant from the Office of National Drug Control Policy (ONDCP), marking a major step forward in the fight against drug trafficking and criminal networks along the U.S.–Mexico border. The funding comes through the High Intensity Drug Trafficking Areas (HIDTA) program, a national initiative that bolsters law enforcement agencies in critical regions with resources, intelligence-sharing, and coordinated strategies. Eagle Pass’s inclusion in the program underscores its strategic importance on the national drug enforcement map and reflects the strength of local public safety operations. Mayor Rolando Salinas hailed the award as a “major accomplishment” for the community. “These funds will allow our law enforcement teams to continue doing the important work of protecting our community and tackling criminal networks that threaten the safety of our residents,” Salinas said. “We thank the ONDCP for recognizing the urgency of this issue in our region and supporting us in such a significant way.” City Manager Homero Balderas also praised the achievement, highlighting the collaborative efforts behind the scenes. “We are deeply grateful for this award and the opportunity it brings to further strengthen our policing efforts,” Balderas stated. “I want to especially thank our Grants Department for their dedication and tireless work in securing this funding, as well as our Eagle Pass Police Department for their unwavering commitment to fighting drug-related crime. This achievement reflects the hard work of many individuals who continue to prioritize the safety and well-being of our community.” The Eagle Pass Police Department, working alongside regional and federal partners, will use the funds to enhance its multi-agency operations, targeting the sophisticated criminal enterprises that exploit the border region for drug trafficking. This award not only provides critical financial support but also reaffirms Eagle Pass’s role as a trusted partner in national drug enforcement efforts. City officials emphasized that the funding will help build on existing successes through sustained cooperation and intelligence-sharing, reinforcing Eagle Pass’s commitment to safeguarding the community from the impacts of drug-related crime. As the city continues to strengthen its partnerships and capabilities, leaders remain resolute in their mission to confront the complex challenges posed by transnational criminal activity. If you want, I can also write a shorter version or add a Spanish-language quote or summary! Let me know. La Ciudad de Eagle Pass Obtiene Casi $300,000 para Reforzar el Grupo HIDTA y los Esfuerzos de Seguridad Fronteriza EAGLE PASS, TEXAS— La Ciudad de Eagle Pass ha sido beneficiada con una importante subvención de $297,835 por parte de la Oficina de Política Nacional de Control de Drogas (ONDCP), marcando un avance significativo en la lucha contra el narcotráfico y las redes criminales a lo largo de la frontera entre Estados Unidos y México. Los fondos provienen del programa Áreas de Tráfico de Drogas de Alta Intensidad (HIDTA, por sus siglas en inglés), una iniciativa nacional que fortalece a las agencias policiales en regiones críticas mediante recursos, intercambio de inteligencia y estrategias coordinadas. La inclusión de Eagle Pass en este programa subraya su importancia estratégica en el mapa nacional de control antidrogas y refleja la solidez de las operaciones locales de seguridad pública. El alcalde Rolando Salinas calificó el otorgamiento de fondos como “un gran logro” para la comunidad. “Estos fondos permitirán que nuestros equipos de seguridad pública continúen realizando el importante trabajo de proteger a nuestra comunidad y enfrentar a las redes criminales que amenazan la seguridad de nuestros residentes,” expresó Salinas. “Agradecemos a la ONDCP por reconocer la urgencia de este problema en nuestra región y apoyarnos de una manera tan significativa.” El administrador municipal Homero Balderas también destacó el logro, resaltando los esfuerzos colaborativos detrás de este éxito. “Estamos profundamente agradecidos por esta subvención y la oportunidad que brinda para seguir reforzando nuestras labores policiales,” afirmó Balderas. “Quiero agradecer especialmente a nuestro Departamento de Subvenciones por su dedicación e incansable trabajo para obtener estos fondos, así como a nuestro Departamento de Policía de Eagle Pass por su firme compromiso en la lucha contra los delitos relacionados con las drogas. Este logro refleja el esfuerzo de muchas personas que continúan priorizando la seguridad y el bienestar de nuestra comunidad.” El Departamento de Policía de Eagle Pass, en coordinación con socios regionales y federales, utilizará estos fondos para fortalecer sus operaciones multiagencia, enfocándose en desmantelar las sofisticadas organizaciones criminales que explotan la región fronteriza para el tráfico de drogas. Este reconocimiento no solo aporta un apoyo financiero crucial, sino que también reafirma el papel de Eagle Pass como un socio confiable en los esfuerzos nacionales contra el narcotráfico. Los funcionarios municipales recalcaron que estos recursos permitirán consolidar los avances ya logrados mediante la cooperación y el intercambio constante de inteligencia, reforzando el compromiso de Eagle Pass para proteger a la comunidad de los impactos del crimen relacionado con las drogas. Mientras la ciudad continúa fortaleciendo sus alianzas y capacidades, sus líderes permanecen firmes en su misión de enfrentar los complejos desafíos que plantea la actividad criminal transnacional. Si quieres, también puedo preparar un resumen breve para redes sociales o un titular llamativo. ¿Te lo preparo? **Recent Posts** © 2024 by Del Rio & Eagle Pass News Leader."}