{"id": 127, "name": "BerkeleySide", "domain": "berkeleyside.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.berkeleyside.org/author/rebecca-meyer-sara-zimmerman-katy-love-ben-gerhardstein-liza-lutzker-heather-bradley-ball-and-scott-friese", "title": "Rebecca Meyer Sara Zimmerman Katy Love Ben Gerhardstein Liza Lutzker Heather Bradley Ball And Scott Friese", "content": "Essential reading for tens of thousands of Berkeleyans.The Daily Briefing is the easiest way to stay up to speed with what’s happening in Berkeley. Donate Newsletters Submit a tip About How we work Advertise Careers Nosh Arts Business City Community Public Safety Housing Neighborhoods Schools Obituaries Opinion Events Latest news Nosh Features Nosh Guides New Restaurants Subscribe to Nosh Berkeleyside Nosh New restaurants Bites Nosh features Arts Business City City COVID-19 Crime & Safety Policing Homicide Shootings Traffic Safety Events Housing Neighborhoods Schools Obituaries Opinion Berkeleyside Nonprofit news. Free for all, funded by readers. Donate Newsletters Submit a tip About How we work Advertise Careers Nosh Arts Business City Community Public Safety Housing Neighborhoods Schools Obituaries Opinion Events Latest news Nosh Features Nosh Guides New Restaurants Subscribe to Nosh Berkeleyside Nosh Logo (Highlight Menu) Nosh **Rebecca Meyer, Sara Zimmerman, Katy Love, Ben Gerhardstein, Liza Lutzker, Heather Bradley Ball and Scott Friese** **Opinion: Construction compromises safe access to Longfellow Middle School** The students and staff at Longfellow have adjusted to a new site after the old one was deemed unsafe. Now, their safety is again at risk due to construction that will create hazards for those who walk and bike to school. **Berkeleyside** Arts Berkeley neighborhoods Business City Community Public Safety Events Housing & Development Obituaries Opinion Schools **Nosh** All Nosh New Restaurants Nosh Features Coming Soon Nightlife Nosh Guides Restaurant Closures **About** Donate Newsletters Submit a tip About How we work Advertise Careers Richmondside Oaklandside **Support** Donate to Berkeleysideand support independent local journalism. **Part of**"}