{"id": 662, "name": "ICI Radio-Canada", "domain": "ici.radio-canada.ca", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://ici.radio-canada.ca/ohdio/premiere/emissions/tout-un-matin/segments/rattrapage/2087422/reseaux-sociaux-avec-julien-poirier-malo-debat-sur-poutine", "title": "Reseaux Sociaux Avec Julien Poirier Malo Debat Sur Poutine", "content": "Nous et un nombre restreint de nos partenaires publicitaires utilisons des témoins pour recueillir certaines de vos données et les utilisons afin d’améliorer votre expérience et de vous présenter des contenus et des publicités personnalisés. Si vous n’êtes pas à l’aise avec l’utilisation de ces informations,veuillez revoir les paramètres de confidentialité de votre appareil et de votre navigateur(nouvelle fenêtre)avant de poursuivre votre visite. La destination audio de Radio‑Canada Radios Balados Parcourir Mon OHdio Ma région ApparenceAutoClaireSombreCe paramètre vous permet de modifier le jeu de couleurs de l’interface. Auto Claire Sombre Ce paramètre vous permet de modifier le jeu de couleurs de l’interface. Auto Claire Sombre Ce paramètre vous permet de modifier le jeu de couleurs de l’interface. RC OHdioICI PREMIÈREICI MUSIQUE Radio-Canada Info ICI TOU.TV(nouvelle fenêtre) ICI RDI ICI TÉLÉ Mordu(nouvelle fenêtre) Radios(page actuelle). Balados Parcourir Mon OHdio Favoris Nouveaux épisodes Écoutes récentes À écouter plus tard Radios(page actuelle). Balados Parcourir Mon OHdio Tout un matin Rattrapage du 4 juin 2025 : Le décès de Nicole Croisille, et une chicane transatlantique sur la poutine **La poutine, meilleure à Paris qu’au Québec? Un influenceur français fait le test** Un influenceur français a décidé de comparer la poutine venant d’un restaurant parisien à celle de La Banquise, à Montréal. Et bien sûr, cela a lancé un débat, et des centaines de commentaires sont apparus sous la vidéo de l’influenceur. Comme l’explique le chroniqueur web Julien Poirier-Malo, on « vous laisse en deviner la nature ». Le chroniqueur souligne cependant à quel point cette vidéo a été conçue pour créer de la controverse et générer du clic. «C’est léger comme débat, mais c’est voulu pour titiller les algorithmes.» Julien Poirier-Malo explique également que la vidéo de l’influenceur n’est pas innocente, car elle a été faite en partenariat avec le ministère du Tourisme du Québec. **En complément** Chronique | La poutine à toutes les sauces!,Pénélope Livre audio |La plus grosse poutine du monde Entrevue | La poutine célébrée dans le monde entier aujourd’hui!,Y a pas deux matins pareils **Appli Radio-Canada OHdio** Tout un monde à écouter, partout où vous allez. **Émissions ICI Première** Foire aux questions(nouvelle fenêtre) **Téléchargez nos applications** **Explorez nos contenus** Émissions Balados Livres audio Listes d’écoute musicales Vidéos Concerts Grandes séries **Abonnez-vous à l’infolettre** Radio-Canada OHdioDécouvrez nos incontournables : balados, livres audio, émissions et listes musicales. Ombudsman(nouvelle fenêtre) Accessibilité Aide Contactez-nous Applications mobiles Choix publicitaires(nouvelle fenêtre) Communiqués(nouvelle fenêtre) Conditions d’utilisation Emplois(nouvelle fenêtre) Infolettres Mises au point Publicité(nouvelle fenêtre) Plan du site Registre de publicités politiques(nouvelle fenêtre) Révisions de l’ombudsman(nouvelle fenêtre) Vie privée(nouvelle fenêtre)"}