{"id": 883, "name": "The Morning Call", "domain": "mcall.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.mcall.com/2025/06/10/federal-budget-bill-could-strip-300000-pennsylvanians-of-medicaid-coverage-push-rural-hospitals-to-the-brink/", "title": "Federal Budget Bill Could Strip 300000 Pennsylvanians Of Medicaid Coverage Push Rural Hospitals To The Brink", "content": "Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition Daily e-Edition Evening e-Edition NewsNewsLatest HeadlinesCrime & Public SafetyPhotos and VideosElectionsWeatherCapitol IdeasEducationHealthPennsylvania NewsCoronavirus News Latest Headlines Crime & Public Safety Photos and Videos Elections Weather Capitol Ideas Education Health Pennsylvania News Coronavirus News Latest Headlines Crime & Public Safety Photos and Videos Elections Weather Capitol Ideas Education Health Pennsylvania News Coronavirus Local NewsLocal NewsAllentownBethlehemEastonEast PennParkland Local News Allentown Bethlehem Easton East Penn Parkland Local News Allentown Bethlehem Easton East Penn Parkland SportsSportsHigh School SportsCollege SportsPhiladelphia PhilliesAthlete of the WeekPhiladelphia EaglesOutdoorsGolfNHL Sports High School Sports College Sports Philadelphia Phillies Athlete of the Week Philadelphia Eagles Outdoors Golf NHL Sports High School Sports College Sports Philadelphia Phillies Athlete of the Week Philadelphia Eagles Outdoors Golf NHL BusinessBusinessReal EstateRetailConsumer Reviews Business Real Estate Retail Consumer Reviews Business Real Estate Retail Consumer Reviews OpinionOpinionReaders React Opinion Readers React Opinion Readers React Things to DoThings to DoEntertainmentRestaurants Food and DrinkNightcrawlerMusic and ConcertsTheaterLehigh Valley InsiderMoviesTV and Streaming Things to Do Entertainment Restaurants Food and Drink Nightcrawler Music and Concerts Theater Lehigh Valley Insider Movies TV and Streaming Things to Do Entertainment Restaurants Food and Drink Nightcrawler Music and Concerts Theater Lehigh Valley Insider Movies TV and Streaming ObituariesObituariesNews ObituariesPlace an Obituary Obituaries News Obituaries Place an Obituary Obituaries News Obituaries Place an Obituary Photos and Video Branded ContentPaid Partner ContentAdvertising by AscendPaid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Paid Partner Content Advertising by Ascend Paid Content by Brandpoint ClassifiedsClassifiedsJobs Classifieds Jobs Classifieds Jobs Subscribe Login Logout Sign up for email newsletters **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X Subscribe Log In Sign up for email newsletters Subscribe Log In Daily e-Edition Daily e-Edition Evening e-Edition Evening e-Edition News Latest Headlines Crime & Public Safety Elections Weather Capitol Ideas Education Pennsylvania News Coronavirus Trending: ☐ Primary election results 🎓 Graduations 🛍️ Retail Openings/Closings 📝 Food safety inspections **Breaking News** **SWAT, multiple police agencies on scene of reported shooter in Bucks County** **Federal budget bill could strip 300,000 Pennsylvanians of Medicaid coverage, push rural hospitals to the brink** **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X This story was produced by theState College regional bureau of Spotlight PA, an independent, nonpartisan newsroom dedicated to investigative and public-service journalism for Pennsylvania. Sign up for Talk of the Town, a weekly newsletter of local stories that dig deep, events, and more from north-central PA, atspotlightpa.org/newsletters/talkofthetown. HARRISBURG — President Donald Trump’s “big, beautiful” budget bill could have a disastrous effect on the health of rural Pennsylvanians and the operations of the hospitals and other medical centers that care for them. Thefederal budget proposal, which passed the U.S. House by aone-vote marginin May, calls for nearly $800 billion inMedicaid cuts over the next decade. It alsoincludesa new 80-hour-per-month work or service requirement for Medicaid recipients between the ages of 19 and 64 who aren’t caregivers or who have disabilities. Among other changes, the bill would require verification of coverage eligibility every six months rather than annually. While supporters of the budget bill argue that it would slow spending and safeguard government programs, critics say the cuts andnew requirementswould create more paperwork for states and make it harder to access essential care. Opponents also argue the changes would push struggling rural hospitals and other providers to the brink, and force them to scale back services or close entirely. More than 3 million people in Pennsylvania — 23% — are covered by Medicaid, according todatafrom the state Department of Human Services, which administers the program. The agency estimates that more than 300,000 would lose Medicaid coverage under the proposal. Val Arkoosh, secretary of the department, said the bill would not only hurt those losing coverage but “all of us who would face the real-life consequences of crowded emergency departments, increases in the cost of health insurance, and the catastrophic effects on economies and health systems in rural areas.” More than 737,000 Medicaid recipients live in rural counties, where residents are typically older and more reliant on government-funded insurance programs. Such programs reimburse at lower rates compared with private insurance companies and haven’t kept up with inflation. Cameron County Commissioner James Moate, a Republican, said the Medicaid reimbursement rate should have never been less than 100%. “That’s why we have struggling hospitals,” he told Spotlight PA. On average, Pennsylvania hospitals absorb a loss of 18 cents on the dollar for care provided to Medicaid patients, said Nicole Stallings, president and CEO of the Hospital and Healthsystem Association of Pennsylvania, which represents more than 230 hospitals statewide. In rural communities, the average loss is 26 cents on the dollar, she added in aMay statement. “Medicaid plays a vital role in the health of rural residents, and it is important to preserve this funding so that families can continue to access the care they need for healthier lives,” said Douglas Winner, chief financial officer for Penn Highlands Healthcare, a nonprofit system with nine hospitals in rural counties. Penn Highlands President and CEO Steve Fontaine has told lawmakers that consolidating with other health systems and expanding into new areas has helped facilities survive. This strategy, which has helped Penn Highlands diversify its patient and insurance bases, is why the system expanded into Centre County, where resident numbers are expected to grow, he told lawmakerslast year. Still, the health system hasshuttered servicesand reportedoperating lossesover the past year. Winner said Penn Highlands is “greatly concerned” about the proposed Medicaid cuts. “Rural hospitals have experienced substantial cost increases for labor, drugs, and supplies,” he said in a statement. “Coupled with decreasing volumes, inadequate reimbursement rates, and ongoing staffing shortages — recruitment and retention — we are struggling financially.” Advocates worry the cuts in the federal budget will force rural hospitals to slash services even more or close altogether. And once facilities end a service or shut down, they rarely reopen, Stallings told Spotlight PA. Community health centers could also be strained. These facilities, also known as federally qualified health centers, provide services regardless of someone’s ability to pay and primarily see patients who use Medicaid and PENNIE, the state’s Affordable Care Act marketplace. More uninsured people will likely lead to an increase in uncompensated care, said Eric Kiehl, director of policy and partnership for the Pennsylvania Association of Community Health Centers. And these facilities are already strapped for resources, he told Spotlight PA. A surge in demand could cause these health centers to shutter core services — such as medical, dental or behavioral health — reduce hours or close, Kiehl said. Pennsylvania’s U.S. House delegationvotedalong party lines on the federal budget bill, with Republicans supporting and Democrats opposing the proposal. Medicaid spending totaled roughly$44 billionin fiscal year 2023. The federal government provided almost $28 billion of those dollars. Democratic Gov. Josh Shapiro has said the state won’t be able to make up those dollars to support the Medicaid program. In a statement, Shapiro said he hopes “common sense and a concern for the people of Pennsylvania” will prevail in the U.S. Senate, where Democratic U.S. Sen. John Fetterman and Republican U.S. Sen. Dave McCormick disagree on aspects of the bill. McCormick did not respond to a request for comment for this story. He hasexpressed supportfor the budget bill, which he says would reduce and slow government spending. During aFox News forum, McCormick said he isn’t advocating for taking benefits from “vulnerable people” but is trying to ensure “people for whom the program was designed” benefit. Fetterman called the plan “a bad bill,” telling Spotlight PA in a statement: “Republicans want to put more money in the pockets of the ultra-rich at the expense of hundreds of thousands of Pennsylvanians who will lose access to Medicaid if this disastrous bill is passed.” SUPPORT THIS JOURNALISMand help us reinvigorate local news in north-central Pennsylvania atspotlightpa.org/donate. Spotlight PA is funded byfoundations and readers like youwho are committed to accountability and public-service journalism that gets results. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **RevContent Feed** **Most Popular** Woman, 3-year-old boy found dead in car in Upper BucksWoman, 3-year-old boy found dead in car in Upper Bucks **Woman, 3-year-old boy found dead in car in Upper Bucks** **Woman, 3-year-old boy found dead in car in Upper Bucks** Lehigh County man who fled to Mexico with teen faces rape chargesLehigh County man who fled to Mexico with teen faces rape charges **Lehigh County man who fled to Mexico with teen faces rape charges** **Lehigh County man who fled to Mexico with teen faces rape charges** Lehigh Valley warehouse to shut down, more than 700 to be laid offLehigh Valley warehouse to shut down, more than 700 to be laid off **Lehigh Valley warehouse to shut down, more than 700 to be laid off** **Lehigh Valley warehouse to shut down, more than 700 to be laid off** SWAT, multiple police agencies on scene of reported shooter in Bucks CountySWAT, multiple police agencies on scene of reported shooter in Bucks County **SWAT, multiple police agencies on scene of reported shooter in Bucks County** **SWAT, multiple police agencies on scene of reported shooter in Bucks County** ICE arrests 17 employees working at Bethlehem apartment complex damaged by fireICE arrests 17 employees working at Bethlehem apartment complex damaged by fire **ICE arrests 17 employees working at Bethlehem apartment complex damaged by fire** **ICE arrests 17 employees working at Bethlehem apartment complex damaged by fire** New plans for 37-story ‘pencil tower’ in Allentown revealed to positive reviews, despite concerns over shadow it may castNew plans for 37-story ‘pencil tower’ in Allentown revealed to positive reviews, despite concerns over shadow it may cast **New plans for 37-story ‘pencil tower’ in Allentown revealed to positive reviews, despite concerns over shadow it may cast** **New plans for 37-story ‘pencil tower’ in Allentown revealed to positive reviews, despite concerns over shadow it may cast** Monroe County woman shot man during road rage incident, DA saysMonroe County woman shot man during road rage incident, DA says **Monroe County woman shot man during road rage incident, DA says** **Monroe County woman shot man during road rage incident, DA says** Allentown title agent Louis Belletieri pleads guilty to $10 million fraud scheme; stole money for personal use and sports bets, prosecutors sayAllentown title agent Louis Belletieri pleads guilty to $10 million fraud scheme; stole money for personal use and sports bets, prosecutors say **Allentown title agent Louis Belletieri pleads guilty to $10 million fraud scheme; stole money for personal use and sports bets, prosecutors say** **Allentown title agent Louis Belletieri pleads guilty to $10 million fraud scheme; stole money for personal use and sports bets, prosecutors say** PIAA 6A softball: Nazareth’s ‘comeback kids’ do it again; rally with 6 runs in 7th to reach state finalPIAA 6A softball: Nazareth’s ‘comeback kids’ do it again; rally with 6 runs in 7th to reach state final **PIAA 6A softball: Nazareth’s ‘comeback kids’ do it again; rally with 6 runs in 7th to reach state final** **PIAA 6A softball: Nazareth’s ‘comeback kids’ do it again; rally with 6 runs in 7th to reach state final** Lehigh County man who fled to Mexico with teen and is now facing rape charges arrested in West Virginia after police pursuits, DA saysLehigh County man who fled to Mexico with teen and is now facing rape charges arrested in West Virginia after police pursuits, DA says **Lehigh County man who fled to Mexico with teen and is now facing rape charges arrested in West Virginia after police pursuits, DA says** **Lehigh County man who fled to Mexico with teen and is now facing rape charges arrested in West Virginia after police pursuits, DA says** **More in Pennsylvania News** Penn State trustees agree to legal training, improved transparency in settlement with Spotlight PA **Penn State trustees agree to legal training, improved transparency in settlement with Spotlight PA** **Penn State trustees agree to legal training, improved transparency in settlement with Spotlight PA** Parents accused of putting their infants in unsafe sleep positions charged with felonies **Parents accused of putting their infants in unsafe sleep positions charged with felonies** **Parents accused of putting their infants in unsafe sleep positions charged with felonies** ‘No more quick fixes’: Gov. Josh Shapiro, Lehigh Valley officials campaign for public transit funding **‘No more quick fixes’: Gov. Josh Shapiro, Lehigh Valley officials campaign for public transit funding** **‘No more quick fixes’: Gov. Josh Shapiro, Lehigh Valley officials campaign for public transit funding** Cyber charter reform that could save public schools $616M advances with unclear future in Pa. Senate **Cyber charter reform that could save public schools $616M advances with unclear future in Pa. Senate** **Cyber charter reform that could save public schools $616M advances with unclear future in Pa. Senate** 2025 June 10 Tribune PublishingChicago TribuneSun Sentinel of Fla.Daily Press of Va.New York Daily NewsOrlando SentinelHartford CourantThe Virginian-PilotStudio 1847 Chicago Tribune Sun Sentinel of Fla. Daily Press of Va. New York Daily News Orlando Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Chicago Tribune Sun Sentinel of Fla. Daily Press of Va. New York Daily News Orlando Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company InfoCareersContact UsSitemapHelp CenterArchivesAbout Us Careers Contact Us Sitemap Help Center Archives About Us Careers Contact Us Sitemap Help Center Archives About Us AdvertisingPlace an AdClassifiedsLocal Print AdsJobsAbout Our Ads Place an Ad Classifieds Local Print Ads Jobs About Our Ads Place an Ad Classifieds Local Print Ads Jobs About Our Ads Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 The Morning Call"}