{"id": 2024, "name": "KSFO - 560 AM - San Francisco", "domain": "ksfo.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.ksfo.com/news/ex-ufc-champ-luke-rockhold-to-newsmax-calling-on-trump-to-pardon-cain-velasquez/", "title": "Ex Ufc Champ Luke Rockhold To Newsmax Calling On Trump To Pardon Cain Velasquez", "content": "**Ex-UFC Champ Luke Rockhold to Newsmax: Calling on Trump to Pardon Cain Velasquez** By / Former UFC middleweight champion Luke Rockhold issued a plea on Newsmax Friday for President Donald Trump to pardon his friend, former UFC heavyweight champion Cain Velasquez, for shooting at the man accused of molesting his young son. In February 2022, Velasquez reportedly fired a handgun multiple times at a truck carrying three people, including Harry Goularte, 46, who is awaiting trial on felony child molestation charges. Prosecutors say Velasquez followed the truck for 11 miles through San Jose in Northern California. Goularte was unhurt, but his stepfather was injured in the incident. Last August, Velasquez pled no contest to attempted murder, felony assault, and other related gun charges and was sentenced on Monday to five years in prison. He will receive credit for time already served. Read more at Newsmax© 2025 Newsmax. All rights reserved. Get our iPhone App Get our Android App Twitter X Facebook Instagram **The Latest on KSFO** Ex-UFC Champ Luke Rockhold to Newsmax: Calling on Trump to Pardon Cain Velasquez **Ex-UFC Champ Luke Rockhold to Newsmax: Calling on Trump to Pardon Cain Velasquez** **Ex-UFC Champ Luke Rockhold to Newsmax: Calling on Trump to Pardon Cain Velasquez** FEMA Blocks $10B in Aid, Cites Immigration Concerns **FEMA Blocks $10B in Aid, Cites Immigration Concerns** **FEMA Blocks $10B in Aid, Cites Immigration Concerns** Harrison Fields to Newsmax: Judges Trying to Usurp Trump’s Powers **Harrison Fields to Newsmax: Judges Trying to Usurp Trump’s Powers** **Harrison Fields to Newsmax: Judges Trying to Usurp Trump’s Powers** Johnny Mathis Retires Due to ‘Age, Memory Issues’ **Johnny Mathis Retires Due to ‘Age, Memory Issues’** **Johnny Mathis Retires Due to ‘Age, Memory Issues’** Trump Urges House to Pass DC Budget ‘Fix’ **Trump Urges House to Pass DC Budget ‘Fix’** **Trump Urges House to Pass DC Budget ‘Fix’** Sen. Eric Schmitt: Panama Should Expel CK Hutchison **Sen. Eric Schmitt: Panama Should Expel CK Hutchison** **Sen. Eric Schmitt: Panama Should Expel CK Hutchison** Former Teen Idol Bobby Sherman Fighting Stage 4 Cancer **Former Teen Idol Bobby Sherman Fighting Stage 4 Cancer** **Former Teen Idol Bobby Sherman Fighting Stage 4 Cancer** Treasury Sanctions 5 People, 3 Companies Allegedly Supporting Hezbollah **Treasury Sanctions 5 People, 3 Companies Allegedly Supporting Hezbollah** **Treasury Sanctions 5 People, 3 Companies Allegedly Supporting Hezbollah** Advertise With Us Privacy Policy Terms of Service General Contest Rules Station Information FCC Public File FCC Applications EEO Public File Report Cumulus Media Corporate Employment Opportunities Copyright © 2025 Cumulus Media / Cumulus Media is an equal opportunity employer / AA Get our iPhone App Get our Android App Twitter X Facebook Instagram"}