{"id": 1945, "name": "Defend Democracy Press", "domain": "defenddemocracy.press", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.defenddemocracy.press/alfred-de-zayas-demande-l-arret-de-toute-relation-avec-israel-et-des-mandats-darrets-contre-kallas-et-van-der-layen/", "title": "Alfred De Zayas Demande L Arret De Toute Relation Avec Israel Et Des Mandats Darrets Contre Kallas Et Van Der Layen", "content": "Home Greek Crisis EuropeRefugee CrisisDebate on EU Refugee Crisis Debate on EU Refugee Crisis Debate on EU InternationalEconomyBRICSUkraine / East – WestNuclear Weapons/War Economy BRICS Ukraine / East – West Nuclear Weapons/War Economy BRICS Ukraine / East – West Nuclear Weapons/War ex-USSR Middle East TTIP Ecology Democracy ABOUT US Donate Home Greek Crisis EuropeRefugee CrisisDebate on EU Refugee Crisis Debate on EU Refugee Crisis Debate on EU InternationalEconomyBRICSUkraine / East – WestNuclear Weapons/War Economy BRICS Ukraine / East – West Nuclear Weapons/War Economy BRICS Ukraine / East – West Nuclear Weapons/War ex-USSR Middle East TTIP Ecology Democracy ABOUT US Donate Democracy Europe Middle East **Alfred de Zayas demande l’arrêt de toute relation avec Israël et des mandats d’arrêts contre Kallas et Van der Layen** tweet May 23, 2025 Entretien avec : • M. Alfred-Maurice de Zayas – Expert indépendant des Nations Unies sur la promotion d’un ordre international démocratique et équitable, avocat, juriste, historien et militant pour la Paix. Contacté par Meriem Abdou Sur Alger Chaîne III Nous rappelons à nos lecteurs que la publication d’articles sur notre site ne signifie pas que nous adhérons à ce qui y est écrit. Notre politique est de publier tout ce que nous considérons comme intéressant, afin d’aider nos lecteurs à se forger leur propre opinion. Parfois aussi, nous publions des articles avec lesquels nous sommes en total désaccord, car nous croyons qu’il est important que nos lecteurs soient informés d’un éventail d’opinions aussi large que possible. Alfred de Zayas on the arrest warrant for Putin Vidéo. Colonisation de l’Algérie : un… Arrêtez la guerre, levez les sanctions, faites-le… Appel à former une coalition internationale… Kurdistan : Le PKK décide de s’autodissoudre et de… Self-determination, referenda and the rights of… TAGS Arabs Debate on EU EU Genocide Israel Palestine Terrorism UN War crimes Zayas Alfred de **Ukraine Says Russia Launched Biggest Drone Attack of the War** **Over 150,000 protest across Europe against Gaza blockade and attack on...** **Nearly 8,000 killed in Syria within six months, 75 percent civilians:...** **Jerusalem Agreed to a Transfer of Ex-Israeli Patriots to Ukraine, But...** **Urgence Palestine saisit l’ONU après l’annonce de sa procédure de dissolution** **The EU is finally paying the price for its unfair trade...** We invite you to join the dialogueon our Facebook page. **\"It's barbarism. I see it coming masqueraded under lawless alliances and predetermined enslavements. It may not be about Hitler's furnaces, but about the methodical and quasi-scientific subjugation of Man. His absolute humiliation. His disgrace\"** Designed by Kangaru Productions Contact Us COPYRIGHT & DISCLAIMER"}