{"id": 1771, "name": "Newsexaminer.net", "domain": "newsexaminer.net", "bias": "fake-news", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://newsexaminer.net/lifestyle/health/a-kilo-of-cocaine-costs-1500-in-colombia-12000-16000-in-mexico-and-77000-in-britain-according-to-the-accountant-of-colombias-medellin-drug-mob/", "title": "A Kilo Of Cocaine Costs 1500 In Colombia 12000 16000 In Mexico And 77000 In Britain According To The Accountant Of Colombias Medellin Drug Mob", "content": "BillionairesCelebrity newsLifestyleBusinessGood experienceContact Celebrity newsLifestyleBusinessGood experienceContact LifestyleBusinessGood experienceContact BusinessGood experienceContact Good experienceContact Contact Celebrity newsLifestyleBusinessGood experienceContact LifestyleBusinessGood experienceContact BusinessGood experienceContact Good experienceContact Contact LifestyleBusinessGood experienceContact BusinessGood experienceContact Good experienceContact Contact BusinessGood experienceContact Good experienceContact Contact Good experienceContact Contact Contact **A kilo of Cocaine costs $1,500 in Colombia, $12,000-16,000 in Mexico and $77,000 in Britain according to the accountant of Colombia’s Medellín drug mob** ROBERTO SAVIANO’S first book, “Gomorrah”, put him in grave danger. An exposé of the Neapolitan mafia, the Camorra, it sold over 10m copies. But it also struck a nerve with its subject, and death threats soon followed. Mr Saviano, an Italian journalist, now moves between safe houses under 24-hour police protection. He dedicates his new book “to all my Carabinieri bodyguards. To the fifty-one thousand hours we’ve spent together and to those still ahead.” His movement may have been curtailed, but not his anger or ambition. His latest book, “Zero Zero Zero”, is an exploration of the global cocaine trade, from the foothills of the Andes to the nightclubs of Europe. It is a well-trodden trail, but the book provides a useful overview of the industry, explaining the incongruous mix of co-operation and cruelty in each link of the supply chain. Cocaine-trafficking is risky but enormously profitable. As Mr Saviano points out, a kilo of the drug costing $1,500 in Colombia fetches $12,000-$16,000 in Mexico and $77,000 if it makes it to Britain. According to the accountant of Colombia’s Medellín drug mob, the group was trafficking 15 tonnes of cocaine into America every day in the 1980s. Thirty years later, the figures are still staggering. In Italy the Calabrian ’Ndrangheta has now overtaken the Sicilian Cosa Nostra as the country’s most powerful mafia group. It turns over an estimated €53 billion ($59 billion) a year, almost half of which comes from drug-trafficking. The book does a fine job of tracing the international co-operation required to get the drug to market. In Colombia, producers struck distribution deals with their Mexican counterparts after American authorities grew adept at intercepting their cocaine shipments. In exchange for a large chunk of the profits, the Mexicans agreed to move the drugs across the border. Alliances have also been formed with groups from further away. The Russian mafia supplies Latin American gangs with Soviet-era weapons. West African government officials store drug shipments off the coast. In an often grisly series of passages, Mr Saviano details some of the murderous national rivalries that occasionally make the front pages. In 2006 Mexico was plunged into violence when the president, Felipe Calderón, declared war on the drug gangs by sending 6,500 troops to the troubled state of Michoacán. Over 47,000 people were killed by violence associated with organised crime between 2006 and 2011, says the government. In the first six years of the drug war 31 Mexican mayors were killed, 13 of them in 2010 alone. The most vivid sections are those describing the industry’s countless victims: the young man from Guinea-Bissau who spends a flight to Lisbon praying that the 60 capsules of cocaine in his stomach will not burst; the Colombian beauty queen whose husband has disappeared; the American undercover agent who is tortured to death when his cover is blown, his body dumped beside a Mexican road. Structurally, the book is a bit of a mess. Lacking a coherent narrative, it is more a collection of articles, lurching from one topic to another. The effect is often disorientating and sometimes offputting. A chapter on Los Zetas, a ferocious group of Mexican traffickers composed of former soldiers, is followed, inexplicably, by a syrupy poem about cocaine. Better editing would have made for an easier read. Despite its shortcomings, the book lands a resounding thump to the solar plexus. Taken as a whole, it is an angry rebuke to all those—traffickers and politicians alike—who perpetuate the violence. “I want to scream this loud enough so that people will know,” writes Mr Saviano. His rage, both at his own predicament and that of other victims, is palpable. “As terrible as it may seem, total legalisation may be the only answer,” he concludes. By reminding readers of the senseless suffering wrought by the cocaine trade, this book makes a powerful case for a new approach. How useful was this post? Click on a star to rate it! Average rating4/ 5. Vote count:7 No votes so far! Be the first to rate this post. **You may also like** **Sina Bari MD: Aligning AI Innovations With Healthcare...** **Waheed Lawal Demonstrates How Global Dialogue Can...** **Frank Meza Showcases How One Doctor Can Revolutionize...** **When Beauty Turns Tragic: Coping After a Loved One’s...** **How to Personalize Your Health Routine Without...** **Why Good Nutrition Is Important for Pain Management** **About the author** Born at an early age, Jimmy Rustling has found solace and comfort knowing that his humble actions have made this multiverse a better place for every man, woman and child ever known to exist. Dr. Jimmy Rustling has won many awards for excellence in writing including fourteen Peabody awards and a handful of Pulitzer Prizes. When Jimmies are not being Rustled the kind Dr. enjoys being an amazing husband to his beautiful, soulmate; Anastasia, a Russian mail order bride of almost 2 months. Dr. Rustling also spends 12-15 hours each day teaching their adopted 8-year-old Syrian refugee daughter how to read and write. Advice3 AI43 Anonymous1 Apple11 Art21 Automation1 Baseball2 Billionaires2 Books3 BREAKING NEWS17 Business526 celebrity news37 Christianity2 Commercial456 Cooking13 Crime22 Democratic4 Education143 Entertainment29 Environment10 Fake News1 Fantasy1 Fappy The Dolphin2 fashion37 Fashion and Retail1 Finance103 Fitness2 Food22 Football31 Gaming338 Garden2 Good experience2,206 Graffiti1 Health291 history5 Humor3 Industrial1 Insurance1 Intellectual Property1 international3 Investigative4 Investing9 Kitchen17 Law217 Lifestyle1,384 Marketing31 MLB2 Movies13 Music35 NBA2 News127 News36 NFL7 NSA2 Opinion3 Opinion4 Painting1 paul horner news1 Photography8 Politics67 Relationships3 Religion6 Republican6 Restaurant1 reviews2 Satire2 Science7 Skateboarding1 Skiing4 Spirituality2 Sports165 Standup Comedy1 Tech2 Tech374 Television26 Tennis11 Tips tricks16 Travel80 Uncategorized7 World73 world records4 Yoga1"}