{"id": 565, "name": "Frontiers in Fungal Biology", "domain": "frontiersin.org/journals/fungal-biology", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.frontiersin.org/journals/fungal-biology/articles/10.3389/ffunb.2025.1563395/full", "title": "Fungal Biology", "content": "Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Fungal Biotechnology Fungal Genomics and Evolution Fungal Pathogenesis Fungal Physiology and Metabolism Fungal Secondary Metabolites and Mycotoxins Fungi-Animal Interactions Fungi-Plant Interactions Marine and Freshwater Fungi Medical Mycology Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Who we are Mission and values History Leadership Awards Impact and progress Frontiers' impact Our annual reports Publishing model How we publish Open access Peer review Research integrity Research Topics FAIR² Data Management Fee policy Services Societies National consortia Institutional partnerships Collaborators More from Frontiers Frontiers Forum Frontiers Planet Prize Press office Sustainability Career opportunities Contact us Fungal Biotechnology Fungal Genomics and Evolution Fungal Pathogenesis Fungal Physiology and Metabolism Fungal Secondary Metabolites and Mycotoxins Fungi-Animal Interactions Fungi-Plant Interactions Marine and Freshwater Fungi Medical Mycology Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office Fungal Biotechnology Fungal Genomics and Evolution Fungal Pathogenesis Fungal Physiology and Metabolism Fungal Secondary Metabolites and Mycotoxins Fungi-Animal Interactions Fungi-Plant Interactions Marine and Freshwater Fungi Medical Mycology Scope Field chief editors Mission & scope Facts Journal sections Open access statement Copyright statement Quality For authors Why submit? Article types Author guidelines Editor guidelines Publishing fees Submission checklist Contact editorial office ORIGINAL RESEARCH article Front. Fungal Biol., 22 May 2025 Sec. Fungal Pathogenesis Volume 6 - 2025 |https://doi.org/10.3389/ffunb.2025.1563395 **SsMet1is a critical gene in methionine biosynthesis inSclerotinia sclerotiorum** 1Plant Pathology, United States Department of Agriculture (USDA) Agricultural Research Service, Pullman, WA, United States 2Plant Pathology Department, Washington State University, Pullman, WA, United States 3College of Veterinary Medicine, Washington State University, Pullman, WA, United States Methionine, a key sulfur-containing amino acid, is involved in various important functions in cellular metabolism. Genes that encode enzymes to catalyze steps of the methionine biosynthesis pathway are essential for survival of fungi. TheSsMet1(SS1G_11000) gene inSclerotinia sclerotiorumis an orthologue ofBcStr2, a gene characterized inBotrytis cinereathat plays a key role in methionine biosynthesis. In this study, we characterizedSsMet1inS. sclerotiorumby creatingSsMet1-deletion mutants,Met1–2andMet1-4, using a split marker technique. TheSsMet1-deletion mutants were unable to grow on minimal medium and did not produce sclerotia. Supplementation with methionine and homocysteine rescued the defects in mycelial growth, but not sclerotial development of theSsMet1-deletion mutants. These results indicate thatSsMet1-deletion mutants are auxotrophic for methionine. In addition, theSsMet1-deletion mutants exhibited increased sensitivity to osmotic and oxidative stresses, cell wall-damaging agents, and thermal stress. The mutants were avirulent on detached bean leaves, but virulence was also restored with methionine supplementation in minimal media. All the defects were restored by genetic complementation of the mutant with wildtypeSsMet1allele. The results of this study indicate thatSsMet1plays a critical role in the regulation of various cellular processes inS. sclerotiorum. **Introduction** Sclerotinia sclerotiorumis one of the most destructive plant pathogens. There are more than 60 names that have been used to describe the diseases it causes (Purdy, 1979), including white mold, watery soft rot and stem rot (Bolton et al., 2006).S. sclerotiorumis known to infect dicotyledonous crops such as sunflower, soybean, dry bean, dry pea and chickpea, but has also some monocotyledonous species such as onion and Chinese chive (Boland and Hall, 1994;Choi et al., 2017).S. sclerotiorum’s mechanism to attack host plants includes cell wall and middle lamella degrading enzymes, toxins, defense substances and rapidity of infection (Lumsden, 1979). Annual losses fromS. sclerotiorumin the United States have exceeded $200 million due to a lack of high levels of host resistance (Bolton et al., 2006). S. sclerotiorumis a robust pathogen that thrives under diverse environmental conditions and survives as sclerotia for four to five years and up to eight years in soil (Adams and Ayers, 1979;Bolton et al., 2006). Management ofS. sclerotiorumis difficult due to the fungus targeting different stages of crop development; infection can cause damping-off of seedlings, stem rot, and soft rot of fruits and flowers (Bolton et al., 2006). Successful disease control usually requires implementation and integration of multiple management practices. In the past, cultural practices such as field burning to reduce the number of sclerotia in the soil (Hind-Lanoiselet et al., 2005;Brooks et al., 2018) were used. Currently, the disease is managed in fields of many crop species using applications of fungicides, which can have negative environmental implications (Leroux et al., 2002;Mir et al., 2023). However, in many cases, especially for high value crops or on highly specialized farms, these methods are insufficient for white mold control. Because of the central role of methionine in metabolism (Jastrzębowska and Gabriel, 2015) and growth control in fungi, methionine biosynthesis inhibition by fungicides has been explored in several filamentous fungi (Masner et al., 1994;Fritz et al., 1997;Scott et al., 2020). Methionine (Met), a key sulfur-containing amino acid, is not only a key amino acid of proteins, but is also involved in many essential functions in cellular metabolism through its main derivative S-adenosylmethionine (SAM). The pathways of methionine biosynthesis have been characterized extensively in some plants, bacteria, and fungi (Jastrzębowska and Gabriel, 2015) but have not been reported inSclerotinia. Recently, targeted disruption of genes involved in the metabolism of cysteine and methionine inAlternaria alternata,AaMetB,AaMetCandAaMetX, have been investigated as these genes are required for vegetative growth, conidiation, and pathogenicity ofA. alternata(Gai et al., 2021). Fungal mutants that lackAaMetB,AaMetC, orAaMetXexhibited developmental deficiencies such as decreased aerial hyphae and conidia production, and inability to grow on minimal media. However, the defects in cell growth and development of these mutants were restored by exogenous applications of methionine or homocysteine, but not cysteine. This restoration indicated thatAaMetB,AaMetC, andAaMetXmutants are typical methionine auxotrophs rather than cysteine auxotrophs (Gai et al., 2021). In the study onB. cinerea,Shao et al. (2016)observed that the deletion mutantΔBcStr2, an orthologue ofStr2encoding a cystathionine γ-synthase (CGS) in yeastSaccharomyces cerevisiae, exhibited a decrease in virulence on different plant tissues. They also found thatΔBcStr2produced significantly fewer conidia compared to the wildtype and complemented strains. The mutant strain also showed increased sensitivity to agents that damage the cell wall and increased sensitivity to osmotic stress, which led to reduced mycelial growth of the mutant strain in host tissue. InMagnaporthe oryzae, the methionine synthase, MET6, catalyzes the last step of methionine biosynthesis.MET6-deletion mutants were obtained by targeted gene replacement (Saint-Macary et al., 2015). TheΔmet6mutants were unable to grow on minimal media unless supplemented with methionine. M. oryzae Δmet6mutants were non-pathogenic on intact and wounded barley and rice leaves. These results indicated that the Met biosynthesis pathway may be essential for fungal development, survival, and pathogenicity (Saint-Macary et al., 2015). In this study, we investigated the role ofSsMet1, a gene hypothesized to be involved in methionine biosynthesis, inS. sclerotiorum. Thus, we generated gene deletion mutants ofSsMet1, characterized the function ofSsMet1in mutant strains to evaluate the role ofSsMet1in the regulation of various cellular processes inS. sclerotiorum. The deletion of the methionine biosynthesis gene demonstrated its role in growth, virulence, sclerotial development, and response to environmental stresses. **Experimental methods** **SsMet1sequence acquisition and phylogenetic analysis** First, the sequence ofSsMet1was identified as an orthologue sequence toBcStr2ofB. cinereaon EnsemblFungi (Yates et al., 2022;Martin et al., 2023). These two sequences as well as 15 additional sequences highlighted as orthologues of SS1G_11000 were obtained by EnsemblFungi (Yates et al., 2022;Martin et al., 2023) and on the Basic Local Alignment Search Tool (BLAST) (https://blast.ncbi.nlm.nih.gov/Blast.cgi;Sayers et al., 2022). We searched against the NCBI genome database with a cut-off E-value of 1e–10. The translated protein sequences were aligned using the National Center for Biotechnology Information multiple alignment tool (COBALT: Multiple Alignment Tool;Papadopoulos and Agarwala, 2007). For phylogenetic analysis, maximum-likelihood phylogenetic dendrograms were constructed using MEGA11 with 1000 bootstraps (Tamura et al., 2021). **Knockout ofSsMet1inS. sclerotiorum** Gene replacement mutants forSsMet1were created with a split-marker technique (Goswami, 2012). For the target gene, both the 5’ (840 bp) and the 3’ (507 bp) flanking sequences of the ORF were amplified from genomic DNA of the wildtype strain WMA1 (ATCC MYA-4521), with PCR primers 11HindL/11SalR and 11XbaL/11KpnR (Table 1) and cloned into the pJET1.2 cloning vector (Promega, Madison, Wisconsin) (Figure 1). The amplified 5’ and 3’ flanking sequences ofSsMet1were then subcloned into pUCH18 (Lu et al., 1994) to generate pCU18-ORF-5’and pCU18-ORF-3’, which harbor a hygromycin-resistance gene (HYG) and the 5’ or 3’ flanking sequences at the 5’ and 3’ ends of the HYG gene (Figure 1). The 5’ and 3’ flanking sequences with their corresponding truncated HYG were amplified (Figure 1). Purified 5’-HY and YG-3’ fragments were then used to co-transformS. sclerotiorumprotoplasts (Rollins, 2003). Transformants were selected and purified through repeated hyphal tipping on potato dextrose agar (PDA) containing hygromycin (100 ug/L). In the hygromycin-resistant transformants, the target gene was replaced by reconstituted HYG via homologous recombination mediated by the flanking sequences (Figure 1). Table 1. PCR primers used in this study. Figure 1. Knockout of theSsMet1gene inS. sclerotiorum. The schematic diagram illustrates the knockout strategy ofSsMet1gene with the hygromycin-resistance gene (HYG) as the replacement (not drawn to scale). The deletion ofSsMet1and gene replacement inMet1–2andMet1–4mutants were confirmed by rt-PCR assays with the 11delF6/11delR6 primers (Table 1). For rt-PCR, mycelia were harvested, freeze dried and total RNA was isolated using the RNeasy Plant Mini Kit (Qiagen, Germantown, MD), according to the manufacturer’s instructions. All RNA samples were diluted to 400 ng/µl and cDNA was synthesized using the 5X all-in-one RT Mastermix (Applied Biological Materials Inc., Richmond, Canada), according to the manufacturer’s instructions. **Complementation ofSsMet1** TheSsMet1-deletion mutant was complemented with the full-length wildtype allele ofSsMet1gene. The full-lengthSsMet1gene was amplified from the cDNA of the wildtype WMA1 strain with 11-L/11-R primers (Table 1). The PCR product was cloned into a pJET1.2 blunt cloning vector (Promega, Madison, Wisconsin) and digested withSacIandSmaI. The resultingSacI-SmaIfragment was cloned into a complementation vector (pCETNS) in theSac1/Sma1sites and used forAgrobacterium-mediated transformation. Transformants were selected on PDA plates containing 150 μg/ml geneticin (G418; Ameresco, Ohio) for two rounds of hyphal tip transfers under geneticin selection, and the presence and expression of the wildtypeSsMet1allele were confirmed by rt-PCR assay using primers 11delF6/11delR6 (Table 1). **Characterization ofSsMet1-deletion mutants** TheSsMet1-deletion mutants were compared with the wildtype strain for growth rate and sensitivity to various stress agents. To compare their growth rates, colonized agar plugs (4 mm in diameter) of wildtype WMA1 and mutant strainsMet1–2andMet1–4were taken from the edge of a 2-day-old culture, placed on the center of a fresh PDA plate, and incubated at 22°C. Cultures were monitored for three days for evaluation of colony morphology and diameter, and up to 30 days for sclerotial formation. Mycelial growth tests under various conditions were performed on minimal medium (MM) (10 mM K2HPO4, 10 mM KH2PO4, 4 mM (NH4)2SO4, 2.5 mM NaCl, 2 mM MgSO4, 0.45 mM CaCl2, 9 mM FeSO4. 7H2O, 10 mM glucose and 1 L water, pH 6.9) and MM amended with four different supplements: methionine (1 mM), cysteine (1 mM), homocysteine (0.5 mg/mL), or glutathione (0.5 mg/mL). Each plate was inoculated with a 4-mm-diameter mycelial-colonized agar plug taken from the edge of a 2-day-old colony on PDA. The diameter of the mycelium was measured with a digital caliper three days post inoculation. Each treatment was replicated three times for each strain and the experiment was repeated three times. To test the sensitivity of each strain to various environmental stressors, colonized agar plugs (4 mm in diameter) taken from the margin of a 2-day-old colony on PDA were placed onto PDA plates amended with one the following six stressors: a cell wall stress agent, congo red (CR, 0.5 mg/mL); two osmotic stress generators, sodium chloride (NaCl, 1 M) and potassium chloride (KCl, 1 M); and three oxidative stress generators, sorbitol (1 M), hydrogen peroxide (H2O2, 10 mM) and calcofluor white (CFW, 0.5 g/liter). After incubation at 22°C for three days, the mycelial diameter in each plate was measured. Each experiment was repeated three times with three replications for each strain. The overall average of mycelia growth was obtained. Thermal stress sensitivity was tested by incubating 2-day-old colonies grown on PDA and then placed on fresh PDA plates under four temperature conditions (15, 20, 25, and 28°C) and measuring mycelial diameter after three days. **Pathogenicity assays** Detached leaf disease assays on bean were conducted using mycelium of the wildtype and mutant strains grown on PDA. After a two-day growth on PDA, mycelium colonized agar plugs (4 mm in diameter) were placed on the leaves for observance of disease development. Lesion sizes were measured 48 hours post inoculation. This experiment was repeated three times with three replications for each strain. Supplementation of MM with methionine was also used to investigate pathogenicity restoration of the deletion mutants on detached been leaves. We inoculated the wildtype strain and deletion mutants on to MM amended with methionine and after two days of growth we used the fungal plugs to evaluate virulence on detached bean leaves. **Statistical analysis** A linear model in conjunction with an analysis of variances (ANOVA) (R Core Team, 2020) were used to compare the mean growth rates of the wildtype, complement and mutant strains (Met1–2andMet1-4) inoculated on PDA and MM with amendments, which are the environmental stressors for PDA and the additions of methionine, homocysteine, cysteine and glutathione for MM. For the linear model and ANOVA, the fungus type and the media type were used as factors. The same approach was used to compare the growth responses to the different thermal stressors on PDA. For this analysis, the fungus type and temperature were used as factors. A linear model in conjunction with an ANOVA were also used to analyze the lesion sizes induced by the wildtype, complement and mutant strains on bean. For this analysis, the fungus type was used as a factor. The linear model provided the standard error. After each ANOVA, pairwise comparisons with Tukey’s HSD test were used to find means that were significantly different from each other. The alpha value of 0.05 was used for the ANOVA computation. **Results** **Identification ofSsMet1inS. sclerotiorum** SsMet1ofS. sclerotiorumis an orthologue ofBcStr2ofB. cinerea.The homologous sequence forBcStr2gene fromB. cinereawas found inS. sclerotiorumfollowing a BLAST search against the NCBI genome database. TheSsMet1protein shares 91.72% identity with that ofBcStr2. Because of the high similarity of their amino acid sequences,SsMet1was identified as an orthologue ofBcStr2in theB. cinereagenome database. We named this geneSsMet1due toBcStr2(an orthologue ofSaccharomyces cerevisiae,Str2) being involved in methionine biosynthesis. TheSsMet1gene is 1815 bp in length and encodes 604 amino acids. The structure of the nucleotide sequence was predicted to contain two introns of 96 and 71 bp located at positions 625 and 816 of the sequence, respectively. Analysis of the characteristic domains of theSsMet1protein with EnsemblFungi indicated thatSsMet1contains a pyridoxal phosphate-dependent transferase domain (Yates et al., 2022;Martin et al., 2023). **Sequence acquisition and phylogenetic analysis ofSsMet1orthologues** BLAST search of the NCBI genome database and EnsemblFungi using the SS1G_11000 protein sequence as the query identified homologous sequences in 16 other fungi (includingBcStr2). We found this protein sequence to be highly conserved among the 17 fungi compared, with amino acid identity varying from 37.25% to 91.89% (Table 2).S. cerevisiaewas used as an outgroup and has the least identity at 37.25%. To further elaborate the phylogenetic relationships for this gene among the 17 fungal species, Maximum-likelihood phylogenetic dendrograms were constructed with MEGA11 (Tamura et al., 2021) (Figure 2). Regarding the protein sequence, the phylogenetic tree shows thatS. sclerotiorumandB. cinereaare sister taxa. In addition,S. sclerotiorum,B. cinerea,S. borealisandRutstroemiasp. NJR-2017a WRK4 form one monophyletic group. The taxa includingCadophorasp. DSE1049, R. secalis,M. brunneaandD. rosaeform another monophyletic group and these two groups as a whole share a common ancestor. A third monophyletic group includesF. solani,U. virens,N. crassa, andM. oryzae. The tree also displays an ancestor further back in time that connects this monophyetic group to the previous two discussed that includesS. sclerotiorum. Lastly, the furthest ancestor highlighted in this tree shows thatS. sclerotiorumandS. cervisiaeshare a distant common ancestor. Table 2. Amino acid sequence identity. Figure 2. Evolutionary analysis by Maximum Likelihood method. The evolutionary history was inferred based on amino acid sequences using the Maximum Likelihood method and JTT matrix-based model. The tree with the highest log likelihood (–9941.71) is shown. The percentage of trees in which the associated taxa clustered together is shown next to the branches. Initial tree(s) for the heuristic search were obtained by applying the Neighbor-Joining method to a matrix of pairwise distances estimated using the JTT model. All positions containing gaps and missing data were excluded (complete deletion option). Evolutionary analyses were conducted in MEGA11. **Knockout and complementation ofSsMet1inS. sclerotiorum** To confirmSsMet1gene knockout and complementation inS. sclerotiorum, rt-PCR was conducted with 11delF6/11delR6 primers (Table 1). The rt-PCR confirmed that the wildtype and complement strains ofS. sclerotiorumhave a band corresponding to the expected size of 217 bps, which was absent in the mutants (Figure 3), confirming that theSsMet1was deleted. Figure 3. Verification ofSsMet1knockout inS. sclerotiorumby PCR.(A)Confirmation of gene deletion ofMet1–2andMet1–4using RT-PCR withSsMet1specific primers 11delF/11delR (217 bps).(B)PCR with SsGAR1 primers (NADPH-utilizing reductase) to check the RNA quality. **Role ofSsMet1inS. sclerotiorumpathogenicity** To analyze the role ofSsMet1in pathogenicity,SsMet1infection capability was evaluated on detached bean leaves. As shown inFigure 4, the wildtype and complement strains, WMA1 (average size of 26.3 mm) and Met1C (average size of 26.3 mm) respectively, caused disease lesions on detached leaves of bean 48 hours after inoculation. In contrast, the mycelia ofMet1–2andMet1–4mutants were unable to infect bean leaves (Figure 4A). When the wildtype and deletion mutants were grown on MM amended with methionine and then used to inoculate detached bean leaves to observe virulence, the deletion mutants,Met1–2andMet1–4were able to cause disease on detached bean leaves (Figure 4B). The average disease lesion size forMet1–2andMet1–4were 21.1 mm and 20.8 mm respectively (Figure 4D). Figure 4. Pathogenicity assay of mutants in comparison to wildtype and complement strains. Pathogenicity assay on common bean leaves with(A)Wildtype, WMA1, complement, Met1C andSsMet1-deletion mutants,Met1–2andMet1–4grown on PDA.(B)WMA1 and mutantsMet1–2andMet1–4after being inoculated on MM amended with methionine. Disease lesions were measured, and photos were taken 48h after inoculation.(C, D)Average lesion diameter. A one-way ANOVA in R and the Tukey HSD test were used to determine the significant differences of means from the wildtype, WMA1. The means of three replicates are presented and the error bars are standard errors. A significance threshold of 0.05 was used. Signif. codes:*** P < 0.001, ** P < 0.01. **SsMet1is required for differentiation and sclerotial development** To study the growth ofSsMet1-deletion mutants,Met1–2andMet1-4, wildtype WMA1 and the complement Met1C, were grown on PDA for three days at 22°C. The average colony diameter of WMA1 and Met1C strains were 82.2 mm and 82.4 mm, respectively. TheSsMet1-deletion mutantsMet1–2andMet1–4diameters were 72.2 mm and 72.6 mm respectively. The results show that the deletion mutants,Met1–2andMet1-4, grew slower on PDA than the wildtype and complemented strains, WMA1 and Met1C, respectively (Figures 5A, C). Figure 5. Sensitivity of the wildtype WMA1, complement Met1C and mutant strainsMet1–2andMet1–4to cell wall-damaging, osmotic, and oxidative stress.(A)Comparisons of colony morphology on PDA plates amended with cell wall-damaging agent (0.5 mg/mL Congo Red), oxidative stress generators (1 M Sorbitol, 0.5 g/liter CFW and 10 mM H2O2) or osmotic stress agents (1 M NaCl and 1 M KCl). Photos were taken three days after incubation.(B)Sclerotial formation of the wildtype WMA1,SsMet1-deletion mutantsMet1–2andMet1-4, and complement Met1C strains on PDA, and PDA amended with the above environmental stressors at 7 days and up to 30 days post inoculation.(C)Colony diameter. A one-way ANOVA in R and the Tukey HSD test were used to determine the significant differences of means from the wildtype, WMA1. The means of three replicates are presented and the error bars are standard errors. A significance threshold of 0.05 was used. Signif. codes:*** P < 0.001, * P < 0.05. Naturally, we wanted to observe how sclerotial formation of the deletion mutants compared to the wildtype and complemented strains due to sclerotia being an important form of survival forS. sclerotiorum. Twelve days post inoculation on PDA,Met1–2andMet1–4mutants did not produce prominent sclerotia whereas the wildtype WMA1, and the complemented strain, Met1C, both produced normal sized sclerotia after seven days (Figure 5B). These results indicate thatSsMet1is required for sclerotial development inS. sclerotiorum. In addition, the mutants were unable to grow on MM (Figure 6A), suggesting thatSsMet1plays a role in mycelial growth and differentiation. Figure 6. Chemical complementation assays ofSsMet1-deletion mutants.(A)Mycelial growth of WMA1, mutant strainsMet1–2andMet1–4and complement, Met1C on MM and MM amended with Methionine (1 mM), Homocysteine (0.5 mg/mL), Cysteine (1 mM) and Glutathione (0.5 mg/mL).(B)Colony diameter. A one-way ANOVA in R and the Tukey HSD test were used to determine the significant differences of means from wildtype, WMA1. The means of three replicates are presented and the error bars are standard errors. A significance threshold of 0.05 was used. Signif. codes:*** P < 0.001. **SsMet1is crucial for stress response inS. sclerotiorum** To investigate the functions ofSsMet1inS. sclerotiorumtolerance to environmental stresses, we observed the growth of wildtype WMA1, complement Met1C, and mutantsMet1–2andMet1–4strains under conditions of osmotic and oxidative stresses, cell wall-damaging agents and thermal stress. To analyze the growth response associated with exposure to these environmental stressors the four strains were grown on PDA for two days at 22°C and then agar plugs from these 2-day-old cultures were inoculated onto PDA amended with the above listed stress agents stated in the methods section. Colony diameters were measured after three days of inoculation. Compared with the wildtype and complemented strains,Met1–2andMet1–4showed increased sensitivity to osmotic stress (reduced radial growth) generated by NaCl (1 M) (P < 0.001) and KCl (1 M) (P < 0.001), and the cell wall stress agent, congo red (0.5 mg/mL) (P < 0.001) (Figures 5A, C).Met1–2andMet1–4both exhibited increased sensitivity as shown by reduced growth to oxidative stress generated by H2O2(10 mM) (P < 0.001), CFW (0.5 g/liter) (P < 0.001) and sorbitol (1 M) (P < 0.05) (Figures 5A, C). After fifteen days, the mutants were able to grow their mycelial to the edge of the PDA plate amended with H2O2. The initial growth size (measured after three days) for theSsMet1-deletion mutants was 1 mm and after 15 days the growth size increased to 82 mm. This increase in growth may be due to the instability of H2O2and the loss of inhibitory effect over time. On exposure to thermal stress, the mutants showed sensitivity to temperatures both lower and higher than the optimal growth temperature of 20 °C (Figure 7A). At 15 °C and 28 °C, bothMet1–2andMet1–4showed a significant decrease in growth compared to the wildtype after three days (Figure 7B). Figure 7. Sensitivity of WMA1, mutantsMet1–2andMet1–4and complement strain Met1C to thermal stress.(A)Comparisons on PDA after incubation at 15, 20, 25 and 28°C for 3 days.(B)Colony diameter of wildtype, WMA1, complement, Met1C andSsMet1-deletion mutant strainsMet1–2andMet1-4. A one-way ANOVA in R and the Tukey HSD test were used to determine the significant differences of means from the wildtype, WMA1. The means of three replicates are presented and the error bars are standard errors. A significance threshold of 0.05 was used. Signif. codes:*** P < 0.001. **Mycelial growth restoration ofSsMet1phenotype** Mycelium viability is very important forS. sclerotiorumgrowth. Minimal medium (MM) provides the minimal nutrients required for the fungus to grow. The mutants were not able to grow on MM because it lacks methionine. Our results show that in comparison with the wildtype (79.9 mm) and complemented (79.3 mm) strains, theSsMet1-deletion mutants,Met1–2andMet1–4were unable to grow on MM (0.0 mm) (Figures 6A, B). Supplementation with methionine (1 mM) and homocysteine (0.5 mg/mL) restored the growth defect ofSsMet1-deletion mutants,Met1–2andMet1-4, on MM, although not to wildtype levels. The average mycelial growth for the wildtype, complement and mutants,Met1–2andMet1–4on MM amended with methionine were 71 mm, 70.8 mm, 46 mm, 45.6 mm respectively. The average mycelial growth for the wildtype, complement and mutants,Met1–2andMet1–4on MM amended with homocysteine were 76.6 mm, 76.5 mm, 46.4 mm, 47.5 mm respectively. Supplementation with cysteine (1 mM) and glutathione (0.5 mg/mL) also partially restored the growth defect of theSsMet1-deletion mutants, (Figures 6A, B). The average mycelial growth for the wildtype, complement and mutants,Met1–2andMet1–4on MM amended with cysteine were 75.8 mm, 74.8 mm, 22 mm, 23.9 mm respectively. The average mycelial growth for the wildtype, complement and mutants,Met1–2andMet1–4on MM amended with glutathione were 79.3 mm, 78.8 mm, 25 mm, 24.2 mm respectively. These results indicate thatSsMet1is an auxotroph of methionine and methionine is required for processes like the initiation of translation, DNA synthesis, and the utilization of nutrients for optimal growth (Jastrzębowska and Gabriel, 2015). **Discussion** **The biosynthesis of methionine** The methionine biosynthesis pathway has been studied in fungi (Saint-Macary et al., 2015;Shao et al., 2016;Gai et al., 2021). The main fungal route of methionine biosynthesis starts from homoserine, a branch point in the aspartate pathway leading to methionine or isoleucine through threonine production (Ejim et al., 2004). L-Homoserine first undergoes O-acetylation catalyzed by L-homoserine transacetylase Met2p. The sulfur atom is then introduced into the rising amino acid chain, either from inorganic sulfide via direct sulfhydrylation or from L-cysteine through the transsulfurylation pathway (Hébert et al., 2011;Kulikova et al., 2019). The sulfhydrylation reaction catalyzed by O-acetylhomoserine(thiol)-lyase Met15p leads to the conversion of O-acetylhomoserine to L-homoserine. Introduction of a sulfur atom through the transsulfurylation pathway requires the participation of two enzymes: cystathionine-γ-synthase (CGS) (Str2p) and cystathionine-β-lyase (Str3p). Str2p utilizes O-acetyl-homoserine and L-cysteine to produce L-cystathionine which, upon the action of cystathionine β-lyase Str3p, is converted to L-homocysteine. Finally, in all fungi, L-homocysteine is S-methylated by methionine synthase Met6p to generate methionine using 5-methyltetrahydrofolate as the methyl donor (Jastrzębowska and Gabriel, 2015;Shao et al., 2016). **SsMet1-deletion mutants are methionine auxotrophic** In this study, we characterizedSsMet1, a gene we believe that is implicated in methionine metabolism inS. sclerotiorum.We createdSsMet1-deletion mutants,Met1–2andMet1-4. Methionine is a sulfur containing amino acid and plays a key role in cell proliferation, metabolism, protein synthesis and DNA methylation (Gai et al., 2019). The mutants grew slowly on PDA and were unable to grow on MM and did not produce sclerotia on MM. The sclerotia produced on PDA were abnormally small (Figure 5B). Supplementation with methionine and homocysteine to MM partially rescued the defects in mycelial growth, but not sclerotial development of theSsMet1-deletion mutants. These results indicate that theSsMet1-deletion mutantsMet1–2andMet1–4are methionine auxotrophic, thusSsMet1is required for the regulation of cellular processes inS. sclerotiorumwhich includes amino acid biosynthesis and formation, and transferase activity. Thus,SsMet1is important for growth, pathogenicity, stress response and long-term survival.SsMet1is an orthologue ofBcStr2found inB. cinerea. TheStr2gene encodes a cystathionine γ‐synthase (CGS) that is a key enzyme in methionine biosynthesis inSaccharomyces cerevisiae. Therefore, CGS has been regarded as an attractive target for fungicide discovery (Leroux et al., 2002). **SsMet1is necessary for virulence ofSclerotinia sclerotiorum** TheMet1–2andMet1–4mutants were avirulent on detached bean leaves. This behavior is like that reported for theΔBcStr2mutant inB. cinerea, which exhibited decreased virulence on host plants (Shao et al., 2016).Gai et al. (2021)showed thatAaMetB,AaMetC, andAaMetXare required for full virulence inA. alternata. The defects in virulence of theMet1–2andMet1–4mutants on detached bean leaves were also restored by exogenous supply of methionine as reported byGai et al. (2021). This suggests thatSsMet1is essential for virulence ofS. sclerotiorum. **SsMet1is required for sclerotial formation ofS. sclerotiorum** TheMet1–2andMet1–4mutants were also unable to produce prominent sclerotial development. These results are consistent withΔBcStr2, which exhibited decreased conidiation and impaired sclerotial development (Shao et al., 2016), whereas inA. alternata, mutantsAaMetB/MetC/MetXshowed defects in conidiation. We were able to restore the virulence ofMet1–2andMet1–4by adding exogenous methionine to MM, but sclerotial development was not restored using the same method. This suggests that virulence and sclerotial development can be controlled by separate downstream factors. **SsMet1-deletion mutants are more sensitive to stresses** TheMet1–2andMet1–4mutants in the present study showed increased sensitivity to all environmental stresses. Both mutants grew slowly on sorbitol medium than the wildtype and complement strains but produced large sclerotia on PDA plates amended with 1 M sorbitol (Figure 5B), suggesting that exposure to sorbitol does not induce oxidative stress in these mutants to the point of not being able to produce resting structures. The mutants were not able to produce prominent sclerotia on PDA alone so the addition of sorbitol to PDA somehow reversed those effects. Growth was significantly reduced on PDA amended with H2O2in the first 7 days, but both mutants were able to recover from the exposure to this H2O2exposure and grow fully (15 days post inoculation), likely because H2O2became ineffective with increased incubation time due to its short half-life. In addition, the deletion mutants,Met1–2andMet1–4were not able to produce sclerotia in the H2O2-amended medium.AaMetRwas primarily sensitive to H2O2and many reactive oxygen species (ROS)-generating compounds (Gai et al., 2021). The inactivation ofMetRinA. alternataresulted in severe inhibition of methionine synthesis and increased sensitivity to H2O2(Gai et al., 2021). In addition,ΔBcStr2, showed increased sensitivity to osmotic and oxidative stresses, cell-wall damaging agents and thermal stress (Shao et al., 2016). These results indicate that theSsMet1-deletion mutants were extremely affected by the environmental stressors and perhapsSsMet1is essential for ROS tolerance. The knockout and replacement ofSsMet1has resulted in methionine metabolism being blocked. This can possibly affect the biosynthesis and expression of other metabolism related genes (Gai et al., 2021). In addition,SsMet1may interact with the genes that play a key role in cell wall synthesis and integrity, osmotic stress, and oxidative stress. Methionine and homocysteine amendments were able to restore growth of the mutants on MM, but not to wildtype levels. Methionine supplementation to MM was able to restore virulence to theMet1–2andMet1–4mutants on detached bean leaves. In the research conducted byDas et al. (2024)exogenous methionine restored disease infection on rice and facilitated growth ofRs_MET13‐silencedRhizoctonia solanigene in the presence of MM amended with 10 mM of H2O2.Homocysteine can be converted back to methionine through a process requiring folate, vitamin B12 and methionine synthase (McCaddon and Miller, 2023) and thus homocysteine was able to restore growth of the mutants to the same level as methionine on MM. We infer that homocysteine can also restore virulence to theSsMet1-deletion mutants. Glutathione and cysteine restored mycelial growth of theSsMet1-deletion mutants partially and in comparison to methionine and homocysteine, it was nearly 50% less after three days. Cysteine and glutathione cannot be converted back to methionine, resulting in poor growth restoration of theSsMet1-deletion mutants on MM. This slow rate of growth does indicate to us that virulence would be affected negatively and not be restored. This growth and virulence restoration indicatesMet1–2andMet1–4are methionine auxotrophic mutants. InA. alternata, exogenous cysteine restored the growth and virulence defects ofAaMetRsuggesting thatAaMetRis essential for cysteine biosynthesis (Gai et al., 2021).SsMet1is required for methionine synthesis and its deletion may prevent the initiation of other metabolic pathways such as cysteine biosynthesis due to it being described as a pyridoxal phosphate-dependent enzyme involved in Cys/Met metabolism (Martin et al., 2023). ForSsMet1to be involved in Cys/Met metabolism (Martin et al., 2023), this allosteric dependence needs further investigation. In the transsulfuration pathway, homocysteine is converted to cysteine. Cysteine is then used to build glutathione. It is also important to note that fungi also have an alternative pathway (DUG pathway) to generate cysteine by degrading glutathione. InS. sclerotiorum, there are two genes, SS1G_04565 and SS1G_02111, related to the DUG pathway, DUG1 and DUG2 respectively. There is a possibility that the function of these genes can be dependent onSsMet1and in the absence ofSsMet1, growth is not fully restored in the presence of exogenous cysteine and glutathione. **Conclusion** Overall, we infer that methionine synthesis interacts with various biochemical pathways inS. sclerotiorum. The deletion ofSsMet1demonstrated its role in growth, virulence, sclerotial development, and is important for the response to environmental stresses.SsMet1is a potential antifungal drug target inS. sclerotiorum. TheStr2gene encodes a cystathionine γ‐synthase (CGS) that is a key enzyme in methionine biosynthesis inSaccharomyces cerevisiae.Therefore, CGS has been regarded as an attractive target for fungicide discovery. Further analysis can be done on the mutants for their sensitivity to fungicides. CGS is a proposed target of anilinopyrimidine (AP) fungicides (Leroux et al., 2002). **Data availability statement** The original contributions presented in the study are included in the article/supplementary material. Further inquiries can be directed to the corresponding authors. **Author contributions** NP-P: Conceptualization, Formal analysis, Investigation, Methodology, Project administration, Writing – original draft. WW: Writing – review & editing. RM: Formal analysis, Writing – review & editing. MM: Investigation, Writing – review & editing. GV: Resources, Writing – review & editing. WC: Conceptualization, Funding acquisition, Supervision, Writing – review & editing. **Funding** The author(s) declare that financial support was received for the research and/or publication of this article. This research was supported in part by the USDA National Sclerotinia Initiative (NSI) to WC. **Conflict of interest** The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. **Generative AI statement** The author(s) declare that no Generative AI was used in the creation of this manuscript. **Publisher’s note** All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. **References** Adams P. B. and Ayers W. A. (1979). Ecology ofSclerotiniaspecies.Phytopathology69, 896–898. doi: 10.1094/Phyto-69-896 Crossref Full Text|Google Scholar Boland G. J. and Hall R. (1994). Index of plant hosts ofSclerotinia sclerotiorum.Can. J. Plant Pathol.16, 93–108. doi: 10.1080/07060669409500766 Crossref Full Text|Google Scholar Bolton M. D., Thomma B. P. H. J., and Nelson B. D. (2006).Sclerotinia sclerotiorum(Lib.) de Bary: Biology and Molecular Traits of a Cosmopolitan Pathogen.Mol. Plant Pathol.7, 1–16. doi: 10.1111/j.1364-3703.2005.00316.x PubMed Abstract|Crossref Full Text|Google Scholar Brooks K. D., Bennett S. J., Hodgson L. M., and Ashworth M. B. (2018). Narrow Windrow Burning Canola (Brassica napusL.) Residue forSclerotinia sclerotiorum(Lib.) de Bary Sclerotia Destruction.Pest Manage. Sci.74, 2594–2600. doi: 10.1002/PS.5049 PubMed Abstract|Crossref Full Text|Google Scholar Choi I. Y., Kim J., Lee W. H., Cho S. E., and Shin H. D. (2017). First report ofSclerotiniastem rot caused bySclerotinia sclerotiorumon Chinese chives in Korea.Plant Dis.101, 1953. doi: 10.1094/PDIS-04-17-0587-PDN Crossref Full Text|Google Scholar Das J., Ghosh S., Tyagi K., Sahoo D., and Jha G. (2024). Methionine biosynthetic genes and methionine sulfoxide reductase A are required forRhizoctonia solaniAG1-IA to cause sheath blight disease in rice.Microbial Biotechnol.17(4), 1–12. doi: 10.1111/1751-7915.14441 PubMed Abstract|Crossref Full Text|Google Scholar Ejim L., Mirza I. A., Capone C., Nazi I., Jenkins S., Chee G. L., et al. (2004). New phenolic inhibitors of yeast homoserine dehydrogenase.Bioorganic Medicinal Chem.12, 3825–3830. doi: 10.1016/j.bmc.2004.05.009 PubMed Abstract|Crossref Full Text|Google Scholar Fritz R., Lanen C., Colas V., and Leroux P. (1997). Inhibition of methionine biosynthesis inBotrytis cinereaby the anilinopyrimidine fungicide pyrimethanil.Pesticide Sci.49, 40–46. doi: 10.1002/(SICI)1096-9063(199701)49:1<40::AID-PS470>3.0.CO;2-Y Crossref Full Text|Google Scholar Gai Y., Li L., Ma H., Riely B. K., Liu B., and Li H. (2021). Critical role ofMetR/MetB/MetC/MetXin cysteine and methionine metabolism, fungal development, and virulence ofAlternaria alternata.Appl. Environ. Microbiol.87, 1–24. doi: 10.1128/AEM.01911-20 PubMed Abstract|Crossref Full Text|Google Scholar Gai Y., Liu B., Ma H., Li L., Chen X., Moenga S., et al. (2019). The methionine biosynthesis regulatorAaMetRcontributes to oxidative stress tolerance and virulence inAlternaria alternata.Microbiological Res.219, 94–109. doi: 10.1016/j.micres.2018.11.007 PubMed Abstract|Crossref Full Text|Google Scholar Goswami R. S. (2012). Targeted gene replacement in fungi using a split-marker approach.Methods Mol. Biol. (Clifton N.J.)835, 255–269. doi: 10.1007/978-1-61779-501-5_16 PubMed Abstract|Crossref Full Text|Google Scholar Hébert A., Casaregola S., and Beckerich J.-M. (2011). Biodiversity in sulfur metabolism in hemiascomycetous yeasts.FEMS Yeast Res.11, 366–378. doi: 10.1111/j.1567-1364.2011.00725.x PubMed Abstract|Crossref Full Text|Google Scholar Hind-Lanoiselet T. L., Lanoiselet V. M., Lewington F. K., Ash G. J., and Murray G. M. (2005). Survival ofSclerotiniasclerotia under fire.Australas. Plant Pathol.34, 311–317. doi: 10.1071/AP05048 Crossref Full Text|Google Scholar Jastrzębowska K. and Gabriel I. (2015). Inhibitors of amino acids biosynthesis as antifungal agents.Amino Acids47, 227–249. doi: 10.1007/s00726-014-1873-1 PubMed Abstract|Crossref Full Text|Google Scholar Kulikova V. V., Revtovich S. V., Bazhulina N. P., Anufrieva N. V., Kotlov M. I., Koval V. S., et al. (2019). Identification of O-acetylhomoserine sulfhydrylase, a putative enzyme responsible for methionine biosynthesis inClostridioides difficile: gene cloning and biochemical characterizations.IUBMB Life71, 1815–1823. doi: 10.1002/IUB.2139 PubMed Abstract|Crossref Full Text|Google Scholar Leroux P., Fritz R., Debieu D., Albertini C., Lanen C., Bach J., et al. (2002). Mechanisms of resistance to fungicides in field strains ofBotrytis cinerea.Pest Manage. Sci.58, 876–888. doi: 10.1002/PS.566 PubMed Abstract|Crossref Full Text|Google Scholar Lu S., Lyngholm L., Yang G., Bronson C., Yoder O. C., and Turgeon B. G. (1994). Tagged Mutations at the Tox1 Locus ofCochliobolus heterostrophusby Restriction Enzyme-Mediated Integration.Proc. Natl. Acad. Sci. United States America91, 12649–12653. doi: 10.1073/PNAS.91.26.12649 PubMed Abstract|Crossref Full Text|Google Scholar Lumsden R. D. (1979). Histology and physiology of pathogenesis in plant diseases caused bySclerotiniaspecies.Phytopathology69, 890–896. doi: 10.1094/phyto-69-890 Crossref Full Text|Google Scholar Martin F. J., Amode M. R., Aneja A., Austine-Orimoloye O., Azov A. G., Barnes I., et al. (2023). Ensembl 2023.Nucleic Acids Res.51, D933–D941. doi: 10.1093/nar/gkac958 PubMed Abstract|Crossref Full Text|Google Scholar Masner P., Muster P., and Schmid J. (1994). Possible methionine biosynthesis inhibition by pyrimidinamine fungicides.Pesticide Sci.42, 163–166. doi: 10.1002/PS.2780420304 Crossref Full Text|Google Scholar McCaddon A. and Miller J. W. (2023). Homocysteine—A retrospective and prospective appraisal.In Front. Nutr.10. doi: 10.3389/fnut.2023.1179807 PubMed Abstract|Crossref Full Text|Google Scholar Mir S. A., Padhiary A., Ekka N. J., Baitharu I., and Nayak B. (2023). “Environmental impacts of synthetic and biofungicides,” inCurrent developments in biotechnology and bioengineering: pesticides: human health, environmental impacts and management. Eds. Singh J., Pandey A., Singh S., Garg V. K., and Ramamurthy P. (Elsevier), 487–504. doi: 10.1016/B978-0-323-91900-5.00012-6 Crossref Full Text|Google Scholar Papadopoulos J. S. and Agarwala R. (2007). COBALT: constraint-based alignment tool for multiple protein sequences.Bioinformatics23, 1073–1079. doi: 10.1093/bioinformatics/btm076 PubMed Abstract|Crossref Full Text|Google Scholar Purdy L. H. (1979).Sclerotinia sclerotiorum: history, diseases and symptomatology, host range, geographic distribution, and impact.Phytopathology69, 875–880. doi: 10.1094/PHYTO-69-875 Crossref Full Text|Google Scholar R Core Team (2020).R: A language and environment for statistical computing(Vienna, Austria: R Foundation for Statistical Computing). Available at:https://www.R-project.org/(Accessed February 15, 2024). Google Scholar Rollins J. A. (2003). TheSclerotinia sclerotiorumPac1 gene is required for sclerotial development and virulence.Mol. Plant-Microbe Interact.16, 785–795. doi: 10.1094/MPMI.2003.16.9.785 PubMed Abstract|Crossref Full Text|Google Scholar Saint-Macary M. E., Barbisan C., Gagey M. J., Frelin O., Beffa R., Lebrun M. H., et al. (2015). Methionine biosynthesis is essential for infection in the rice blast fungusMagnaporthe oryzae.PloS One10, 1–22. doi: 10.1371/journal.pone.0111108 PubMed Abstract|Crossref Full Text|Google Scholar Sayers E. W., Bolton E. E., Brister J. R., Canese K., Chan J., Comeau D. C., et al. (2022). Database resources of the national center for biotechnology information.Nucleic Acids Res.50, D20–D26. doi: 10.1093/nar/gkab1112 PubMed Abstract|Crossref Full Text|Google Scholar Scott J., Sueiro-Olivares M., Thornton B. P., Owens R. A., Muhamadali H., Fortune-Grant R., et al. (2020). Targeting methionine synthase in a fungal pathogen causes a metabolic imbalance that impacts cell energetics, growth, and virulence.MBio11, e01985–e01920. doi: 10.1128/MBIO.01985-20 PubMed Abstract|Crossref Full Text|Google Scholar Shao W., Yang Y., Zhang Y., Lv C., Ren W., and Chen C. (2016). Involvement ofBcStr2in methionine biosynthesis, vegetative differentiation, multiple stress tolerance and virulence inBotrytis cinerea.Mol. Plant Pathol.17, 438–447. doi: 10.1111/mpp.12292 PubMed Abstract|Crossref Full Text|Google Scholar Tamura K., Stecher G., and Kumar S. (2021). MEGA11: Molecular evolutionary genetics analysis version 11.Mol. Biol. Evol.38, 3022–3027. doi: 10.1093/molbev/msab120 PubMed Abstract|Crossref Full Text|Google Scholar Yates A. D., Allen J., Amode R. M., Azov A. G., Barba M., Becerra A., et al. (2022). Ensembl genomes 2022: an expanding genome resource for non-vertebrates.Nucleic Acids Res.50, D996–D1003. doi: 10.1093/nar/gkab1007 PubMed Abstract|Crossref Full Text|Google Scholar Keywords:methionine metabolism, fungal mutant, virulence,Sclerotinia sclerotiorum, sclerotia, reduced growth and development, stress response, mycelium Citation:Pierre-Pierre N, Wei W, Manasseh R, Mendoza M, Vandemark GJ and Chen W (2025)SsMet1is a critical gene in methionine biosynthesis inSclerotinia sclerotiorum.Front. Fungal Biol.6:1563395. doi: 10.3389/ffunb.2025.1563395 Received:19 January 2025;Accepted:23 April 2025;Published:22 May 2025. Edited by: Reviewed by: Copyright© 2025 Pierre-Pierre, Wei, Manasseh, Mendoza, Vandemark and Chen. This is an open-access article distributed under the terms of theCreative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. *Correspondence:Nickisha Pierre-Pierre,bmlja2lzaGEucGllcnJlLXBpZXJyZUB1c2RhLmdvdg==; Weidong Chen,d2VpZG9uZy5jaGVuQHVzZGEuZ292 Disclaimer:All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article or claim that may be made by its manufacturer is not guaranteed or endorsed by the publisher. Download PDF ReadCube epub XML (NLM) Share on EndNote Reference Manager Simple Text file BibTex Share on Abstract Introduction Experimental methods Results Discussion Conclusion Data availability statement Author contributions Funding Conflict of interest Generative AI statement Publisher’s note References EndNote Reference Manager Simple Text file BibTex Research integrity at Frontiers **94% of researchers rate our articles as excellent or good** Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Supplementary Material Download PDF ReadCube epub XML (NLM) GuidelinesAuthor guidelinesEditor guidelinesPolicies and publication ethicsFee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy Author guidelines Editor guidelines Policies and publication ethics Fee policy ExploreArticlesResearch TopicsJournalsHow we publish Articles Research Topics Journals How we publish Articles Research Topics Journals How we publish OutreachFrontiers ForumFrontiers Policy LabsFrontiers for Young MindsFrontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize Frontiers Forum Frontiers Policy Labs Frontiers for Young Minds Frontiers Planet Prize ConnectHelp centerEmails and alertsContact usSubmitCareer opportunities Help center Emails and alerts Contact us Submit Career opportunities Help center Emails and alerts Contact us Submit Career opportunities"}