{"id": 342, "name": "Debunking Denialism", "domain": "debunkingdenialism.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://debunkingdenialism.com/2020/06/23/crown-appeal-begins-for-quack-parents-acquitted-for-letting-their-son-die-of-meningitis/", "title": "Crown Appeal Begins For Quack Parents Acquitted For Letting Their Son Die Of Meningitis", "content": "About Article Library Knowledge Library Scientific SkepticismVaccinesGMOsMedicineEvolutionPsychiatryClimateSkepticismMore… Vaccines GMOs Medicine Evolution Psychiatry Climate Skepticism More… Vaccines GMOs Medicine Evolution Psychiatry Climate Skepticism More… Critical ThinkingScience Denialist Tactics Science Denialist Tactics Science Denialist Tactics Science ResourcesBiologyChemistryPsychologyEarth ScienceMathematicsScientific ComputingMore… Biology Chemistry Psychology Earth Science Mathematics Scientific Computing More… Biology Chemistry Psychology Earth Science Mathematics Scientific Computing More… **Crown Appeal Begins For Quack Parents Acquitted For Letting Their Son Die of Meningitis** In September of 2019, a stunning turn of events in the Canadian court system saw David and Collet Stephanacquittedof the charge of failing to provide the necessaries of life to their son Ezekiel who died of meningitis in 2012 after his parents refused to take him to see a doctor for about two weeks. Instead, they gave him various naturopathic quackery products that had no benefit. Thankfully, the Crown decided toappeal the caseand it has now started in the Alberta Court of Appeals. Will they go free again, or will they face the legal consequences for their actions? Will there be justice for Ezekiel, or will quackery reign supreme yet again? Whatever the outcome of the appeal, this long-running court case will have a profound cultural impact on the rights of children to have the requirements for life provided to them by their parents versus the alleged right of parents to treat their dying child with quackery and refuse to take them to the hospital. **The situation so far..** This is a horrific case study of how alleged parental rights to refuse medical treatment for their son and rely on quackery instead supposedly triumphs over the right of children to live and be healthy. Parental rights are important, but the rights of children are even more important. When the two clashes, the rights of children should win and this is precisely what is recommended by the United Nations and their Rights of the Child convention. This case has gone through the Canadian court system over a period spanning several years. Debunking Denialism has covered the case since the summer of 2016 with a total of 11 in-depth articles covering the minute details of the court system and the broader impact of the trials on the regional quackery community. David Stephan Gets 4 Months in Jail for Naturopathy Meningitis Death Crown Prosecutors Appeal Lenient Toddler Meningitis Sentence Remorseless David Stephan Continues Selling Naturopathic Quackery Appeal Trial For Remorseless Quacks Who Let Their Toddler Die of Meningitis Begins Conviction Upheld For Parents Who Let Their Toddler Die of Meningitis Quack Who Let His Son Die Booted From Wellness Expo Quacks Who Let Their Son Die Have Convictions Overturned On Technicality Quacks Who Let Their Son Die Demanded 4 Million Dollars. Court Rejected It. Retrial Begins For Quacks Who Let Their Son Die of Meningitis Quack Parents Who Let Their Son Ezekiel Stephan Die Found Not Guilty Prosecutors Appeal Acquittal of Quack Parents Who Let Their Son Die of Meningitis To make a very long story short, they Court of Queen’s Bench of Alberta convicted them in 2016. The parents sent in an appeal to Court of Appeal of Alberta and got convicted a second time during 2017. However, only two out of the three judges agreed on a conviction. This gave them the right to have their case heard by the Supreme Court of Canada. Their conviction was removed due to a legal technicality and the case was heard again by the Court of Queen’s Bench of Alberta. It is in this retrial that they got acquitted during 2019. The Crown appealed the case to the Alberta Court of Appeals, and this is where the court case is currently being heard in the summer of 2020. The consequences for David and Collet Stephan have been rough. They have had to liquidate their assets and move to another area. David continued to sell naturopathic supplements in various places, but he got booted out from a few alternative health expos. During this period, they have also welcomed a new child to the world. FollowDebunking DenialismonFacebookorTwitterfor new updates. **The Crown appeal and the coronavirus pandemic** The date for the Crown appeal of the acquittal of the Stephans was originally set to June 11 2020 in Calgary. With the ongoing coronavirus pandemic, there was always a sense of uncertainty if the trial would start at the date that was set way back in the middle of January of 2020. With social distancing, employees of the courts being home sick and other possible obstacles, it was by no means a given that the date would be kept from the outset. On its own, this is perhaps not that problematic. Surely, the prosecutors would still get their day in court to appeal the acquittal? Sure, but in Canada there is a special rule since the2016 Jordandecisionthat bans unreasonably long delays in criminal court cases because it is a violation of charter rights. For a lower court case, the hard limit is 18 months, while it increases to 30 months for cases handled in superior courts. If the hard limit is reached, there will be a stay of proceedings. Although it is not entirely clear for an outside when this time limit starts and what counts as delay from the prosecution, it is worth keeping in mind for court cases that drag on. Perhaps it is not that important, since delay due to the pandemic would likely fall under extraordinary circumstances and would not get in the way. A CBC journalist who has been covering the case for years clarified on social media that the trial date was still on track to be followed and the trial did start on time. **What kind of appeal is it?** The prior trial occurred at the Court of Queen’s Bench of Alberta. This is a court that hears appeals from the Provincial Court of Alberta. The prosecutors appealed the Court of Queen’s Bench verdict to the Court of Appeal of Alberta. The latter is the highest court of Alberta. Essentially, the Crown want the acquittal to be replaced with a conviction or that they order a new trial. In other words, the Crown claims that the trial that acquitted the Stephans contain trial errors. **What were the main arguments delivered by the prosecutors?** Theprosecutorsclaimthat the trial judge that acquitted David and Collet Stephan had substantial racial bias against the doctor who served as an expert witness for the Crown. This was so explicit during the court proceedings that it was reported to the Canadian Judicial Council by a over 40 medical and academic professionals. This included mocking his accent, his grammar, and to what degree the doctor pronounced the letter H. In fact, the judgement document spends over two pages on these alleged issues. The judgement is available in the bottom of the articleProsecutors Appeal Acquittal of Quack Parents Who Let Their Son Die of Meningitis. Actually, the judge was so mean towards the doctor from Nigeria that he insinuated that the doctor should not even have been hired. This goes way outside his responsibility and shows a clear bias against the prosecutors expert witness. The second argument that the prosecutors put forward was that the judge wrongly required that they prove that medical treatment would have saved the life of the toddler. This is a problematic requirement, as it is very difficult to prove beyond reasonable doubt that the boy could not have died even if treatment had been given. This is because meningitis is a serious disease that can kill people even if treated. Instead, it should be enough to demonstrate that Ezekiel had the disease and that the parents did not take him to the hospital even they knew he was very sick. Otherwise it could be impossible to prove that some action or lack of action led to some negative health consequence and the make legal system completely toothless in these areas. **What happens now?** The current Alberta Court of Appeals case is heard by a panel of three judges. In the first trial the Stephans faced was a jury trial. The appeal was in front of three judges and the retrial was in front of a single judge. The three judges in the Crown appeal case will involve Chief Justice of Alberta Catherine Fraser. So whatever the outcome, it is safe to say that the Alberta Court of Appeals used their top judge in this case. The panel stated early in the process that they would not deliver a decision on the same day that the trial was held. This means that we have to wait a certain period of time before the judgement is delivered. It is likely that the judges involved aims to write a detailed trial decision since this court case has taken so many trials, appeals and retrials over so many years. The ongoing pandemic might also be a factor if there are any delays, but it is difficult to know with confidence. There are also more mundane reasons why the decision might be delayed. It is summer and vacation periods for people working in the court system. Once the judgement is delivered, there is only one more superior court left in the nation. That is the Supreme Court of Canada. It, however, hears only a few selected cases per year like most Supreme Courts in the world. This means that the losing side might make an appeal, but the Supreme Court of Canada declines to hear it. That would mean that, whatever the decision delivered by the Alberta Court of Appeals might be, it might be the final judgement. On the other hand, since the Crown alleges that the court system has erred in the handling the case, there might be a higher chance that the Supreme Court of Canada might consider taking up the case should the Stephans be acquitted again. It is also possible that the Alberta Court of Appeals will vacate the judgement of the lower court and call for another retrial. This means that the case will return to the lower court for yet another trial. The results of this can yet again be appealed to the Alberta Court of Appeals later on. No matter the judgement, it is likely that this court case will affect other similar court cases. During recent years, there appears to be a surge of cases where courts have convicted parents for failing to provide the basic requirements for life or otherwise mistreating their children. Should the Stephans be convicted and the decision would end up being final, it gives hope to the many children who are the victims of severe harm from their parents. Should they end up going free for good, it is a roadblock for the efforts to bring justice to those innocent children that suffered or died at the hands of their parents quackery beliefs. Let us hope that children to parents with quack beliefs receive more protection. Let us hope that parents who harm their children are brought to justice. Above all, let us hope for justice for Ezekiel. **Spread this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X **Like this:** Prosecutors Appeal Acquittal of Quack Parents Who Let Their Son Die of Meningitis Astrophysicist Screw-Up on Coronavirus Transmission Reaches Astronomical Proportions Debunker of pseudoscience. **You May Also Like** **Conviction Upheld For Parents Who Let Their Toddler Die of Meningitis** **Danny Saucedo Spews Pseudoscientific Nonsense About Cannabis** **Extremist Quacks Get Life Sentences For Murdering Their Diabetic Son** **Keep up to date with new content** Type your email… Subscribe **Social media** Facebook Twitter Instagram Threads Bluesky **Discover more from Debunking Denialism** Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading **** **** **** Hate email lists? Follow onFacebookandTwitterinstead. Email AddressSubscribe **** Email Address Subscribe **** Email Address Subscribe"}