{"id": 1886, "name": "Asia Times", "domain": "asiatimes.com", "bias": "center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://asiatimes.com/2025/06/from-kent-state-to-la-deploying-soldiers-against-civilians-is-high-risk/", "title": "From Kent State To La Deploying Soldiers Against Civilians Is High Risk", "content": "**Want to comment on Asia Times stories?** Sign up here Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link. Sign In China Southeast Asia Military Northeast Asia BusinessOpen dropdown menuTradeFinance Trade Finance Trade Finance Technology WorldOpen dropdown menuUnited StatesUS-ChinaSouth AsiaMiddle EastUkraine War United States US-China South Asia Middle East Ukraine War United States US-China South Asia Middle East Ukraine War Opinion MembershipOpen dropdown menuMy accountOur Subscription offersAT+ Premium AccessHelp Asia Times SurviveNewsletters My account Our Subscription offers AT+ Premium Access Help Asia Times Survive Newsletters My account Our Subscription offers AT+ Premium Access Help Asia Times Survive Newsletters Facebook Twitter LinkedIn RSS **Support Asia Times** Keep independent journalism alive Support us Asia Times Covering geo-political news and current affairs across Asia Sign In China Southeast Asia Military Northeast Asia BusinessOpen dropdown menuTradeFinance Trade Finance Trade Finance Technology WorldOpen dropdown menuUnited StatesUS-ChinaSouth AsiaMiddle EastUkraine War United States US-China South Asia Middle East Ukraine War United States US-China South Asia Middle East Ukraine War Opinion MembershipOpen dropdown menuMy accountOur Subscription offersAT+ Premium AccessHelp Asia Times SurviveNewsletters My account Our Subscription offers AT+ Premium Access Help Asia Times Survive Newsletters My account Our Subscription offers AT+ Premium Access Help Asia Times Survive Newsletters **From Kent State to LA, using soldiers on civilians is high-risk** Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on WhatsApp (Opens in new window)WhatsApp Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print Responding to street protests in Los Angeles against federal immigration enforcement raids, President Donald Trump ordered 2,000 soldiers from the California National Guard into the city on June 7, 2025, toprotect agents carrying out the raids. Trump also authorized the Pentagon to dispatch regular US troops “as necessary” to support the California National Guard. The president’s orders did not specify rules of engagement about when and how force could be used. California Governor Gavin Newsom, who did not request the National Guard and asserted it was not needed, criticized the president’s decision as “inflammatory” and warned it “will only escalate tensions.” I ama historianwho has written several books about the Vietnam War, one of the most divisive episodes in our nation’s past. My recent book, “Kent State: An American Tragedy,” examines ahistoric clash on May 4, 1970, between anti-war protesters and National Guard troops at Kent State University in Ohio. The confrontation escalated into violence: troops opened fire on the demonstrators, killing four students and wounding nine others, including one who was paralyzed for life. In my view, dispatching California National Guard troops against civilian protesters in Los Angeles chillingly echoes decisions and actions that led to the tragic Kent State shooting. Someactive-duty units, as well asNational Guard troops, are better prepared today than in 1970 to respond to riots and violent protests – but the vast majority of their training and their primary mission remains to fight, to kill and to win wars. TheNational Guardis a force of state militias under the command of governors. It can be federalized by the president during times of national emergency or for deployment on combat missions overseas. Guardsmen train for one weekend per month and two weeks every summer. Typically, the Guard has been deployed to deal with natural disasters and supportlocal police responses to urban unrest. Examples include riots inDetroit in 1967,Washington DC in 1968, Los Angelesin 1965and 1992, andMinneapolis and other cities in 2020after the death of George Floyd. Presidents rarely deploy National Guard troops without state governors’ consent. The main modern exceptions occurred in the 1950s and 1960s during the Civil Rights Movement, when Southern governors defied federal court orders to desegregate schools inArkansas,MississippiandAlabama. In each case, the federal government sent troops to protect Black students from crowds of white protesters. **Latest stories** **A cure for Indonesia’s ailing and corrupt health system** **Shooting journalists in Trump’s America** **Asia’s shaky economies need a US-China trade truce, fast** The1807 Insurrection Actgrants presidents authority to use active-duty troops or National Guard forces to restore order within the United States. President Trumpdid not invoke the Insurrection Act. Instead, he relied on Section 12406 of Title 10 of the US Code, anarrower federal statutethat allows the president to mobilize the National Guard in situations including “rebellion or danger of a rebellion against the authority of the Government of the United States.” Trump did not limit his order to Los Angeles. He authorized armed forces to protect immigration enforcement operations at any “locationswhere protests against these functions are occurring or are likelyto occur.” The war in Vietnam had grown increasingly unpopular by early 1970, but protests intensified on April 30 when President Richard Nixon authorizedexpanding the conflict into Cambodia. At Kent State, after a noontime anti-war rally on campus on May 1, alcohol-fueled students harassed passing motorists in town and smashed storefront windows that night. On May 2, anti-war protestersset fire to the buildingwhere military officers trained Kent State students enrolled in the armed forces’ Reserve Officer Training Corps program. In response, Republican Governor Jim Rhodes dispatched National Guard troops, against the advice of the university and many local officials, who understood the mood in the town of Kent and on campus far better than Rhodes did. County prosecutor Ron Kane hadvehemently warned Rhodesthat deploying the National Guard could spark conflict and lead to fatalities. Nonetheless, Rhodes – who was trailing in an impending Republican primary for a U.S. Senate seat – struck the pose of a take-charge leader who wasn’t going to be pushed around by a long-haired rabble. “We’re going to put a stop to this!” he shouted, pounding the table at a press conference in Kent on May 3. Hundreds of National Guard troops were deployed across town and on campus. University officials announced thatfurther rallies were banned. Nonetheless, on May 4, some 2,000 to 3,000 students gathered on the campus Commons for another anti-war rally. They were met by 96 National Guardsmen, led by eight officers. There was confrontation in the air as student anger over Nixon’s expansion of the war blended with resentment over the Guard’s presence. Protesters chanted antiwar slogans, shouted epithets at the Guardsmen and made obscene gestures. The Guardsmen sent to Kent State had no training in de-escalating tension or minimizing the use of force. Nonetheless, their commanding officer that day, Ohio Army National Guard Assistant Adjutant General Robert Canterbury, decided to use them to break up what the Department of Justicelater deemed a legal assembly. In my view, it was a reckless judgment that inflamed an already volatile situation. Students started showering the greatly outnumbered Guardsmen with rocks and other objects. In violation of Ohio Army National Guard regulations, Canterburyneglected to warn the studentsthat he had ordered Guardsmens’ rifles loaded with live ammunition. As tension mounted, Canterbury failed to adequately supervise his increasingly fearful troops – a cardinal responsibility of the commanding officer on the scene. This fundamental failure of leadership increased confusion and resulted in a breakdown of fire control discipline – officers’ responsibility to maintain tight control over their troops’ discharge of weapons. When protesters neared the Guardsmen,platoon sergeant Mathew McManusshouted “Fire in the air!” in a desperate attempt to prevent bloodshed. McManus intended for troops to shoot above the students’ heads to warn them off. But some Guardsmen, wearing gas masks that made it hard to hear amid the noise and confusion, only heard or reacted to the first word of McManus’ order, and fired at the students. The troops had not been trained to fire warning shots, which was contrary to National Guard regulations. And McManus had no authority to issue an order to fire if officers were nearby, as they were. **Sign up for one of our free newsletters** The Daily ReportStart your day right with Asia Times' top stories AT Weekly ReportA weekly roundup of Asia Times' most-read stories Many National Guardsmen who were at Kent State on May 4 later questioned why they had been deployed there. “Loaded rifles and fixed bayonets are pretty harsh solutions for students exercising free speech on an American campus,” one of themtold an oral history interviewer. Another plaintively asked me in a 2023 interview, “Why would you put soldiers trained to kill on a university campus to serve a police function?” National Guard equipment and training have improved significantly in the decades since Kent State. But Guardsmen are still military troops who are fundamentally trained to fight, not to control crowds. In 2020, then-National Guard Bureau Chief General Joseph Lengyel told reporters that “the civil unrest mission is one of themost difficult and dangerous missions… in our domestic portfolio.” In my view, the tragedy of Kent State shows how critical it is for authorities to be thoughtful in responding to protests, and extremely cautious in deploying military troops to deal with them. The application of force is inherently unpredictable, often uncontrollable, and can lead to fatal mistakes and lasting human suffering. And while protests sometimes break rules, they may not bedisruptive or harmful enoughto merit responding with force. Aggressive displays of force, in fact, can heighten tensions and worsen situations. Conversely, research shows that if protesters perceive that authorities are acting with restraint and treating them with respect, they aremore likely to remain nonviolent. The shooting at Kent State demonstrated that using military force in these situations is an option fraught with grave risks. Brian VanDeMarkis professor of history,United States Naval Academy This article is republished fromThe Conversationunder a Creative Commons license. Read theoriginal article. **Sign up here to comment on Asia Times stories** Thank you for registering! An account was already registered with this email. Please check your inbox for an authentication link. Click to share on X (Opens in new window)X Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on Facebook (Opens in new window)Facebook Click to share on WhatsApp (Opens in new window)WhatsApp Click to share on Reddit (Opens in new window)Reddit Click to email a link to a friend (Opens in new window)Email Click to print (Opens in new window)Print **Join the Conversation** 2 Comments You must belogged into post a comment. BigRoostersays:June 12, 2025 at 3:35 AMMaybe that should be from Kent State to Tiananmen Square……No Charlies commenting on this webpage?Log in to Reply Maybe that should be from Kent State to Tiananmen Square……No Charlies commenting on this webpage? Maybe that should be from Kent State to Tiananmen Square……No Charlies commenting on this webpage? Joesays:June 10, 2025 at 2:58 PMIn Hong Kong and Tiananmen Square, protesters are being arrested and imprisoned or crushed by tanks. In Los Angeles, demonstrators were shot with rubber bullets. This is the difference between the “dysfunctional” democracy in the United States and the totalitarian systems in China or Russia.Log in to Reply In Hong Kong and Tiananmen Square, protesters are being arrested and imprisoned or crushed by tanks. In Los Angeles, demonstrators were shot with rubber bullets. This is the difference between the “dysfunctional” democracy in the United States and the totalitarian systems in China or Russia. In Hong Kong and Tiananmen Square, protesters are being arrested and imprisoned or crushed by tanks. In Los Angeles, demonstrators were shot with rubber bullets. This is the difference between the “dysfunctional” democracy in the United States and the totalitarian systems in China or Russia. **AT+ Premium stories** Trump’s tech sanctions to empower China, betray America Trump’s capital tax would be coup de grace for the dollar UK-Japan charting a joint nuclear fusion future Japan’s bond spasm hits a world without safe havens Sugon, its suppliers hit by US sanctions, to merge with Hygon The case for a stronger Chinese yuan Trump’s coming currency war has Asia in its sights Moody’s US downgrade rings alarm on Asia’s dollar assets Trump’s trade beef more with Global South than China Why Trump’s China trade war retreat may be fleeting **Top trending stories** The tiny Philippine island denying and defying China at sea China cracks a code on invisible battlefield surveillance Ukraine in a bind as Russia moves into Dnipropetrovsk US-China: what's really at stake in London ​Time to put Elon Musk back to work fixing weapons manufacturing Thai-Cambodia clash through a US vs China lens We're hearing US financial crisis talk again Asia's shaky economies need a US-China trade truce, fast US plans nuclear buildup to check and deter China, Russia Nvidia pushes hardware but experts say UK AI needs something else **Military & Security** Trump’s Golden Dome will make US – and world – less safeJune 7, 2025 Indonesia torn between China’s J-10 and US F-15EXJune 6, 2025 Russia prepping drones that call home, hide and start firesJune 5, 2025 Trial by fire: Chinese laser weapon reputedly in Russian serviceJune 4, 2025 We’re all vulnerable to a Ukraine-style drone strikeJune 3, 2025 Russia base strike a stark warning for US forces on GuamJune 3, 2025 How Chinese drones could defeat AmericaJune 3, 2025 **Tired of the gaslighting?** The mainstream media told you Economic sanctions would kill the Russian economy US tech sanctions would shut down China’s semiconductor industry Russia is taking massive casualties in Ukraine and will have to negotiate China’s property market will collapse its economy And so on, every day and in every major news outlet. The facts didn’t support the gaslighting. When the facts are clear, Asia Times gives you the facts; when they are controversial, Asia Times gives you the controversy. We urgently need your support to keep on doing so.Independent, fact-based, unbiased journalism needs YOU to stay alive.If you decide to back Asia Times, please choose a monthly, annual, or one-time payment. Your contribution is appreciated. Not ready to support today?Remind me later Facebook Twitter LinkedIn RSS About Us Contact Us Write for us FAQ Terms of Service Keep free journalism alive **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. **Complete your transaction**"}