{"id": 2135, "name": "The US Sun", "domain": "the-sun.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.the-sun.com/entertainment/14445274/kim-zolciak-kroy-biermann-forced-move-mansion-marshals-foreclosure/", "title": "Kim Zolciak Kroy Biermann Forced Move Mansion Marshals Foreclosure", "content": "News Sport TV Entertainment Money Tech Motors Travel Lifestyle More **MORE SECTIONS** Health Royals Wellness Betting Social Casino Shopping Topics A-Z **MORE FROM THE SUN** Newsletters US Jobs Entertainment Celebrity **Kim Zolciak and ex Kroy Biermann forced to move out of Atlanta mansion by U.S. Marshals after losing home to foreclosure** Jessica Finn, Senior Investigations & Exclusives Reporter Published: 15:21 ET,Jun 10 2025 Updated: 16:57 ET,Jun 10 2025 Jessica Finn, Senior Investigations & Exclusives Reporter Published: Invalid Date, KIM Zolciak and her estranged husband Kroy Biermann have been forced to move out of their Atlanta mansion by United States Marshals after losing their home to foreclosure. The U.S. Sun can exclusively reveal that the new owners ofKim, 47, and Kroy's estate began the process of legally removing the pair from the home on December 12, 2024. In the initial filing, the new owners stated that the pair \"holds the premises over and beyond the term for which they rented to them,\" and they were seeking possession of the home. On December 21, the owners filed that theReal Housewives of Atlantastar and her ex-husband had been served the papers for the \"proceeding against a tenant holding over.\" After several filings on behalf of the new owners, which had gone unanswered by Kim and Kroy, the marshals stepped in and removed the pair from the home on April 8, 2025. According to the filings, four deputy marshals responded to the home around 3:30 in the afternoon and the home's holdover occupants were gone by 6:45pm. **Read More Kim Zolciak** **Kim Zolciak claims she found Kroy 'UNCONSCIOUS in her closet while spying on her'** **Kim Zolciak claims she found Kroy 'UNCONSCIOUS in her closet while spying on her'** **Kim Zolciak’s daughter slams mom over clickbait post that claims her dad died** **Kim Zolciak’s daughter slams mom over clickbait post that claims her dad died** The marshal's office checked the box that said the occupants were officially \"ejected\" from the residence. **FAMILY MONEY PROBLEMS** The pair faced foreclosure on their home several times through the years. The home was finally put up for auction through the Fulton County foreclosures list on December 3, 2024, according toPeople. Kim's daughter, Ariana Biermann, 23, has been opening up about her mom and dad's financial woes on the new Bravo show Next Gen NYC. **Most read in Celebrity** **Scarface and Ghostbusters actor dies aged 88 after heart attack** **Scarface and Ghostbusters actor dies aged 88 after heart attack** **Veteran soap actor who starred in The Bold and the Beautiful dies aged 86** **Veteran soap actor who starred in The Bold and the Beautiful dies aged 86** **Justin Bieber ‘could be placed in conservatorship’ by Hailey** **Justin Bieber ‘could be placed in conservatorship’ by Hailey** **Watch Brian Wilson's last performance just two years before his death aged 82** **Watch Brian Wilson's last performance just two years before his death aged 82** Ariana recently accused her mother and stepfather of taking money she earned when she was a minor and spending it all without her knowledge. “I have been on TV since I was 5 years old,\" she said in a confessional on the show's premiere. \"I did reality television with my family and then I started posting on Instagram. I got my first brand deal when I was 14.” “I was doing like three posts a week and you get paid astronomical to do a story or to do an Instagram post and I made quite a bit of money. But, unfortunately, my parents took my money.” She claimed she found out her money was gone two years ago. Ariana further claimed: “I don’t even know how much money I made over the time period. “Nobody was honest, there was no transparency and I have no idea where it actually went.” Kim has Ariana andBriellefrom a previous marriage, and Kroy adopted them when they were children. Kim and Kroy share four other children together: Kaia Rose, Kroy \"KJ\" Jagger Jr.,Kash Kade, and Kane Ren. **MESSY DIVORCE** The athletefiled for divorce from former Real Housewives of Atlanta star Kimfor a second time on August 24, 2023. Kroy previously accused Kim of having a gambling addiction, which he claims led to the ultimate breakdown of their marriage. In his divorce papers, Kroy stated that their marriage was \"irretrievably broken.\" The coupleinitially filed for divorce in May 2023, during which time Kim accused Kroy of smoking marijuana. **Read More on The US Sun** **Beach Boys founder & rock icon Brian Wilson dies aged 82 after health battle** **Beach Boys founder & rock icon Brian Wilson dies aged 82 after health battle** **Barron Trump's 'best pal' claims he got world's most followed TikToker deported** **Barron Trump's 'best pal' claims he got world's most followed TikToker deported** He fired back, alleging that she struggled with a severe gambling problem. At the time of their first filing, it was revealed that Kim and Kroy owed the IRS more than $1 million in unpaid taxes. Bravo Celebrity homes Celebrity marriages Celebrity relationships and break ups Exclusives Real Housewives Real Housewives of Atlanta Kim Zolciack **More from The Sun** **Justin Bieber ‘could be placed in conservatorship’ by Hailey** **Justin Bieber ‘could be placed in conservatorship’ by Hailey** **Harvey Weinstein found guilty in split verdict as jury deadlocks on rape charge** **Harvey Weinstein found guilty in split verdict as jury deadlocks on rape charge** **Barron Trump's 'best pal' claims he got world's most followed TikToker deported** **Barron Trump's 'best pal' claims he got world's most followed TikToker deported** **Teen Mom star David Eason's ex's daughter suddenly dies at 7** **Teen Mom star David Eason's ex's daughter suddenly dies at 7** **Follow The Sun** **Services** Sign Up To The Sun About Us Editorial Complaints Editorial Standards, Policies and Ethics News Licensing Advertising Contact Us Help Hub Topic A-Z Cookie Settings Contact Preferences Sun Jobs Shopping © NEWS ENTERPRISES, INC. ALL RIGHTS RESERVED |TERMS OF USE|PRIVACY|YOUR AD CHOICES|SITEMAP"}