{"id": 377, "name": "Earth.com", "domain": "earth.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.earth.com/news/1000-year-old-native-american-farm-discovery-upends-history-of-what-scientists-believed-was-possible/", "title": "1000 Year Old Native American Farm Discovery Upends History Of What Scientists Believed Was Possible", "content": "**1,000-year-old Native American farm discovery upends what scientists previously believed was possible** When people think of Michigan’s Upper Peninsula, farming likely isn’t the first image that comes to mind. Known for its cold winters, brief growing seasons, and thick forests, the region seems too harsh for traditional agriculture. But a newly published study tells a very different story – one that stretches back over a thousand years and challenges what we thought we knew about the history of Indigenous farming in the northern U.S. Scientists atDartmouth Collegehave confirmed that a site along the Menominee River, known as Sixty Islands, was once home to intensive agriculture practiced by the ancestors of the Menominee Indian Tribe of Wisconsin. The research sheds light on a large and remarkably preserved raised-field system that dates back to between the 10th century and 1600, making it one of the most complete ancient agricultural sites east of theMississippi River. **Sophisticated farming history** At the heart of the discovery are the ridge fields – clusters of garden beds raised between 4 and 12 inches (10 and 30 centimeters) high. These were used to cultivatecorn,beans, squash, and other crops. The ridge fields still stretch across the land in visible patterns, many of them intact despite centuries of weather and change. “The scale of this agricultural system by ancestral Menominee communities is 10 times larger than what was previously estimated,” said lead author Madeleine McLeester, an assistant professor of anthropology. “That forces us to reconsider a number of preconceived ideas we have about agriculture, not only in the region, but globally.” **Complex farming society** The research team surveyed around 330 acres of the site, although they believe that represents only 40% of the total area. The findings hint at a much larger and more complex farming society than previously recognized. “When you look at the scale of farming, this would require the kind of labor organization that is typically associated with a much larger, state-level hierarchical society,” noted McLeester. “Yet, everything we know about this area suggests smaller, egalitarian societies lived in this region but, in fact, this may have been a rather large settlement.” **Farming history of a sacred landscape** The Sixty Islands site is part of Anaem Omot, meaning “Dog’s Belly” in the Menominee language. It’s not just farmland – it’s a sacred and historical landscape. The area includes burial mounds, dance rings, and village remnants. Some of these were originally excavated between the 1950s and 1970s. A corn cupule found and dated during those early digs helped confirm the agricultural roots of the site. Recognizing the deep cultural value of Anaem Omot, it is listed on the U.S. National Register of Historic Places. At the request of Menominee tribal authorities, the Dartmouth archaeologists returned to the site equipped with modern technology to study and document it further. They worked closely with tribal preservation officer David Grignon and the late David Overstreet, a consulting archaeologist for the College of the Menominee Nation. **Drones uncovered ancient patterns** In May 2023, the team launched a drone-based lidar survey of the area.Lidar, which stands for Light Detection and Ranging, uses laser pulses to scan and map surfaces – even beneath forest canopies. It revealed a network of parallel ridges forming quilt-like patterns across the landscape. “Lidar is a really powerful tool in any kind of forested or heavily vegetated region where the archaeology is hidden below trees – where no kind of optical imagery can see what’s underneath the tree canopy,” explained senior author Jesse Casana, a professor of anthropology. “Forests are really confounding to archaeology in a lot of ways, so a lot of archaeologists rely on publicly available lidar that has often been obtained from a plane that flies really high,” said Casana. “But the resolution of the data is usually too low to see many archaeological features. Drone lidar enables us to collect the same kind of data but at a much higher resolution,” added Casana. **Digging deeper into farming history** In August 2023, the team excavated three of the agricultural ridges to learn more about their age and construction. Charcoal samples from the dig were radiocarbon dated, showing that the ridges were actively rebuilt and maintained over a span of 600 years, starting around the year 1000. “All three ridges showed a similar picture in terms of their construction, history and reconstruction,” said Casana. “Most field systems have been either lost or destroyed due to intensive land use across most of North America, through farming, including pastures, and the cutting down of trees for urban development.” “Through this research, we get this little window of preservation into pre-Colonial farming in the Upper Peninsula of Michigan,” Casana added. **Maximizing agricultural productivity** The excavations turned up more than just soil. Charcoal, ceramic sherds, and other small artifacts were found, suggesting that household waste and ashes may have been used to fertilize the fields. The team also found signs that wetland soils were added to improve growing conditions. “Our work shows that the ancestral Menominee communities were modifying the soil to completely rework the topography in order to plant and harvest corn at the near northern extent of where this crop can grow,” said McLeester. “This farming system was a massive undertaking requiring a lot of organization, labor, and know-how to maximize agricultural productivity.” **The geography of early farming** The scope of what was found may only scratch the surface of early farming history. “We’re seeing this kind of landscape alteration in a place where we wouldn’t expect it,” said McLeester. “This may be just a little remnant of what must have been a much larger system,” added Casana. The research raises the possibility that many more raised-field systems once existed across the eastern U.S., and that forested regions like the Upper Peninsula might have been significantly moredeforestedin the past due to agricultural activity. The work continues. Dartmouth archaeologists are partnering with the Menominee Indian Tribe of Wisconsin on further surveys at the Sixty Islands site. The goal is to locate ancestral villages and map more of the historic agricultural landscape – giving us a clearer picture of how Indigenous farmers shaped the land long before European settlers arrived. The full study was published in the journalScience. Image credit: Madeleine McLeester —– Like what you read?Subscribe to our newsletterfor engaging articles, exclusive content, and the latest updates. Check us out onEarthSnap, a free app brought to you byEricRallsand Earth.com. —– home news news-category/plants"}