{"id": 828, "name": "Niles Daily Star", "domain": "leaderpub.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.leaderpub.com/2025/06/06/dowagiac-launches-bridge-improvement-program-as-part-of-infrastructure-upgrades/", "title": "Dowagiac Launches Bridge Improvement Program As Part Of Infrastructure Upgrades", "content": "Home NewsEducationBusinessGiving Education Business Giving Education Business Giving Sports Opinion Obituaries Lifestyles Michiana Life Classifieds Public Notices E-EditionsE-Edition for NilesE-Edition for Dowagiac E-Edition for Niles E-Edition for Dowagiac E-Edition for Niles E-Edition for Dowagiac Contests **Dowagiac launches bridge improvement program as part of infrastructure upgrades** Published 8:00 am Friday, June 6, 2025 BySubmitted DOWAGIAC — The City of Dowagiac is kicking off a summer of construction projects with improvements to five heavily trafficked bridges in the area. The construction work is preventative maintenance, and will require some detours. The work is heavily funded through a State Bridge Funding Grant the city applied for and won in 2022 to be applied to the 2025 construction season. There’s an official detour map, and those familiar with the areas may have their own detour routes to use. Phase 1: S. Front Street bridge, which will be closed for approximately two weeks starting on Monday, June 9. This bridge improvement requires some concrete work, so periods that may look inactive are likely curing time. Phase 2: The Cass, Henry, and Riverside bridges will be closed for approximately four weeks, starting on or about Monday, June 23. Phase 3: The Lowe bridge and S Front Street bridge (part 2) will be closed for approximately two weeks starting on or about July 21. (Potential) Phase 4: There may be some shoulder closures for the Cass, Henry, and Lowe bridges, starting in late July if necessary. “Several construction projects that the City has been working on for years will get underway this summer,” said Dowagiac Assistant City Manager Amanda Sleigh. “We’re kicking off the season with our bridge project, where five key bridges throughout the city will undergo preventative maintenance work to keep them safe for years to come.” **Dowagiac Union High School announces second semester honor roll** **Beacon Health System announces key leadership roles ahead of acquisition** **Walking Challenge returns to Dowagiac** **Two arrested for drug bust in Dowagiac** Home News Education Business Giving Lifestyles Sports Opinion Missed Leader Obituaries Classifieds Small Business About Us Policies Submit a News Tip Submit a Photo Submit an Event Submit a Classified Advertisement Obituary Placement Baseball/Softball Submission Form Anniversary Announcement Birth Announcement Birthday Announcement Engagement Announcement Football Submission Form Letters to the Editor Submission Wedding Announcement © 2025, Leader Publications"}