{"id": 66, "name": "Alabama Today", "domain": "altoday.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://altoday.com/archives/56298-city-of-hoover-lawyers-twist-longtime-community-leader-pat-lynchs-explanations-for-not-testifying-at-con-hearing-local-media-parrot-misrepresentations", "title": "56298 City Of Hoover Lawyers Twist Longtime Community Leader Pat Lynchs Explanations For Not Testifying At Con Hearing Local Media Parrot Misrepresentations", "content": "HOME STATE LOCALNorth AlabamaSouth AlabamaBirmingham MetroRiver Region North Alabama South Alabama Birmingham Metro River Region North Alabama South Alabama Birmingham Metro River Region 2024 INFLUENCE & POLICY OPINION BUSINESS APOLITICAL HOME STATE LOCALNorth AlabamaSouth AlabamaBirmingham MetroRiver Region North Alabama South Alabama Birmingham Metro River Region North Alabama South Alabama Birmingham Metro River Region 2024 INFLUENCE & POLICY OPINION BUSINESS APOLITICAL Home»Influence & Policy»City of Hoover lawyers twist longtime “community leader” Pat Lynch’s explanations for not testifying at CON hearing; local media initially parrots misrepresentations **City of Hoover lawyers twist longtime “community leader” Pat Lynch’s explanations for not testifying at CON hearing; local media initially parrots misrepresentations** June 7, 2024 Categories:FeaturedInfluence & PolicyLocalSliderUncategorized Pat Lynchand his wife Tynette are known for their philanthropy and leadership throughout Central Alabama, both having longtime ties to the City of Hoover. Pat Lynch was honored at an event last year, a year after being diagnosed with cancer in his right kidney, by the group ROAR (Radiation Oncology Accelerated Research). Money raised by ROAR benefits the programs of the UAB Department of Radiation Oncology. In a story byOver the Mountain Journal,Julie Kimthe second vice president of ROAR described Lynch saying, “As a community leader, respected businessman, and recent cancer survivor, Pat Lynch has demonstrated strength and courage in the face of an unforgiving disease and has come out on the other side with hope and positivity.” AL Today spoke to multiple elected officials and members of the community in Hoover who described Lynch’s trustworthiness and character; each person expressed the same level of shock and disbelief that MayorFrank Brocato,accused Lynch of blackmailduring hearings related to a contested Certificate of Need. The ongoing hearings have produced a number of revelationsincluding the fact that the City of Hooveris currently undergoing a previously undisclosed forensic audit. Lynch denied the mayor’s accusations in a notarized affidavit and later in a statement released to the media and posted by him on social media. Lynch was called as a witness in the hearings however his attorney objected. In a Motion to Quash the Subpoena reviewed by Alabama TodayRhett Owens, Lynch’s attorney, cited concerns by medical professionals to object to his participation. However, the Motion also included an emphasize that the city and media have sought to ignore, “In addition to Mr. Lynch’s compromised medical condition, if Mr. Lynch were asked questions about the Brocato call during the Hearing, he would state only that he stands by the statements made in his May 7, 2024 affidavit and in his public statement relating to the Brocato call and, on the advice of counsel, is invoking his rights under the Fifth Amendment in refusing to answer additional questions posed during the Hearing relating to the Brocato call.” There was no ambiguity in the Motion, Lynch stood by his sworn affidavit denying the claims of blackmail and presenting his version of the conversation. That didn’t prevent the attorneys for the City of Hoover during yesterday’s hearing for the contested Certificate of Need from insinuating that the sworn affidavit should not be introduced as evidence because they deemed the sworn defense of his reputation and allegations of criminal conduct “worthless,” if they couldn’t cross-examine Lynch on the state. In later testimony, the City admitted to what has been described as “tampering” with the date on one of its sworn affidavits. Collin Luke one of the city attorneys said of Lynch and his attorney, “after discussions with my partner, Mr. Kirby, he said that he would take — his lawyer said he would take the Fifth if asked about the affidavit that he filed in this proceeding. That’s on advice of counsel.” Hoover’s Council went on to repeat that line a second time to the judge. Reiterating that if called “he would just take the Fifth.” Again, that is not what Lynch’s attorney’s Motion stated. It reinforced his intention to stand by his affidavit but under the advice of his legal counsel not to speak beyond it. The Hoover Sunoriginally picked up the false narrative provided and pushed by the city and failed to include the assertation that Lynch would stand by his previous statements saying only, “Lynch was called to testify Thursday but submitted a filing with the judge Thursday morning saying he was too ill to testify and that, even if he did appear, would plead the Fifth Amendment about the phone conversation with the mayor, exercising his right to remain silent and not incriminate himself.” They later edited the story to say, “Lynch was called to testify Thursday but submitted a filing with the judge Thursday morning saying he was too ill to testify and that, even if he did appear, would stand by his original affidavit and plead the Fifth Amendment about any additional questions regarding the phone conversation with the mayor, exercising his right to remain silent and not incriminate himself.” Meanwhile, many Hoover residents have made their support of Lynch clear in the same local FaceBook group in which he posted his personal statement. *Editors Note: Shortly after this story was published Alabama Today recieved word that Pat Lynch has been readmitted to the hospital. No further details are available at this time. **Share this:** Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to print (Opens in new window) Click to email a link to a friend (Opens in new window) **Like this:** **Related** Share via: Facebook X (Twitter) LinkedIn Email More Tags:Pat Lynch All Posts 2017 2018 2020 2022 2024 Apolitical Business Coronavirus Featured Federal Influence & Policy Local Opinion Slider State Uncategorized Women Back North Alabama South Alabama Birmingham Metro River Region **Is a Christmas Miracle on the Horizon in Hoover? Will residents finally get truthful answers on the forensic audit?** **Barry Moore announces promotions & new hire of “talented individuals” in D.C. office** **Joe Biden and Kamala Harris’s first appearance since Election Day** Dr. Quinton Ross inaugurated as ASU's 15th president City of Hoover lawyers twist longtime “community leader” Pat Lynch’s explanations for not testifying at CON hearing; local media initially parrots misrepresentations Constables: who they are, and what they do Off the Market: Power Couple Jessica Taylor and Leland Whaley announce their elopement Martha Roby: Enhancing the protection of the Second Amendment **Is a Christmas Miracle on the Horizon in Hoover? Will residents finally get truthful answers on the forensic audit?** **Barry Moore announces promotions & new hire of “talented individuals” in D.C. office** **Joe Biden and Kamala Harris’s first appearance since Election Day** **“You are the media now”: Elon Musk vs. Hoover Gatekeepers** **$17 million of federal funding for community improvement projects awarded through ADECA** **Will Ainsworth celebrates the launch of the Alabama Aerospace and Defense Council** **Kamala Harris concedes election to Donald Trump, pledges to help him with transition** **Governor Kay Ivey required medical attention on eve of election** **History made with the first Poarch Creek Tribal Citizen tapped as police chief** **Governor Kay Ivey applauds DOJ indictment of two Sudanese nationals in Alabama cyberattack** Copyright 2024 – ALToday.com | All Rights Reserved. |Login Alabama Today will be the first place Alabamians of influence go for an inside look at breaking statewide, political and business news. The Alabama Today team includes freelance news reporters, as well as guest columnists from around the state. **MORE STORIES** **Is a Christmas Miracle on the Horizon in Hoover? Will residents finally get truthful answers on the forensic audit?** **Barry Moore announces promotions & new hire of “talented individuals” in D.C. office** Facebook X (Twitter) LinkedIn Email More Networks"}