{"id": 1154, "name": "RealClearPolling", "domain": "realclearpolling.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.realclearpolling.com/polls/president/general/2024/trump-vs-harris-vs-kennedy-vs-stein-vs-west", "title": "Trump Vs Harris Vs Kennedy Vs Stein Vs West", "content": "Politics World Defense Investigations Markets Policy Science Energy Health Education Religion History All Latest Polls President Trump Job Approval Trump, Obama, Bush - 2nd Term Favorability Ratings Direction of Country Trump Approval on Issues Generic Ballot State of the Union Polls Trump Job Approval - 1st Term RCP Pollster Scorecard RCP Polling Archive Discover more onRealClearPolitics Senate Polls Governor Polls Generic Congressional Vote Election 2028 Polls Trump vs. Harris 2024 National Full Field Top Battlegrounds 2024 Betting Odds Chart RCP Pollster Scorecard Historical Polling Archive Discover more onRealClearPolitics **Search** Discover more onRealClearPolitics **2024 National Multi-Candidate** Head-to-Head: Trump vs. Harris|Betting Odds Trump vs. Harris|Betting Odds Battleground States:Arizona|Nevada|Wisconsin|Michigan|Pennsylvania|North Carolina|Georgia|RCP Electoral Map Battlegrounds:Arizona|Nevada|Wisconsin|Michigan|Pennsylvania|N.C.|Georgia|Map This Day In History - Final RCP Average:TDIH - Final RCP Average:2020: Biden +7.2, Results: Biden +4.5|2016: Clinton +3.2, Results: Clinton +2.1 Trump 49.8% Harris 48.3% Stein 0.6% Kennedy 0.5% Oliver 0.4% West 0.0% President Trump Job ApprovalView Polls Generic Congressional VoteView Polls Direction of CountryView Polls President Popular VoteView Polls Congressional VoteView Polls Pennsylvania: Trump vs. HarrisView Polls Michigan: Trump vs. HarrisView Polls Wisconsin: Trump vs. HarrisView Polls North Carolina: Trump vs. HarrisView Polls Georgia: Trump vs. HarrisView Polls Arizona: Trump vs. HarrisView Polls Nevada: Trump vs. HarrisView Polls Ohio Senate - Brown vs. MorenoView Polls Pennsylvania Senate - McCormick vs. CaseyView Polls Wisconsin Senate - Hovde vs. BaldwinView Polls Michigan Senate - Rogers vs. SlotkinView Polls Montana Senate - Sheehy vs. TesterView Polls Nevada Senate - Brown vs. RosenView Polls Arizona Senate - Lake vs. GallegoView Polls Texas Senate - Cruz vs. AllredView Polls Election 2024 Republican Nomination Democratic Nomination Trump vs. Biden Trump vs. Biden vs. Kennedy State of the Union President Joe Biden Job Approval Direction of Country Generic Ballot All Latest Polls Copyright © 2024 RealClearHolding, LLC."}