{"id": 2125, "name": "Shareably", "domain": "shareably.net", "bias": "center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://shareably.net/jennifer-nettles-performs-neil-diamonds-greatest-hit/", "title": "Jennifer Nettles Performs Neil Diamonds Greatest Hit", "content": "There come along some performances that you don’t just find beautiful to listen to but that you feel deep in your soul. Jennifer Nettles is an American singer, songwriter, actress, and record producer. She is also the lead vocalist of Sugarland. **A major artist** She is a Grammy award nominee and has performed with other great musical artists like Jon Bon Jovi, Lionel Richie, Josh Groban, Lady Gaga, and many more. She is an exceptional artist who sings from the heart and in this video of her stage performances, she’s paying tribute to another greatest of all-time in the world of music. **It’s none other than American singer-songwriter and actor, Neil Diamond.** He has sold over 100 million records worldwide and he has 38 songs in the Top 10 on the Billboard Adult Contemporary charts. He is one of the best-selling musicians of all time! And to name his racked up accomplishments in music history… “Diamond was inducted into the Songwriters Hall of Fame in 1984 and into the Rock and Roll Hall of Fame in 2011, and he received the Sammy Cahn Lifetime Achievement Award in 2000. In 2011, he was an honoree at the Kennedy Center Honors, and he received the Grammy Lifetime Achievement Award in 2018.” **Nettles performed one of Diamond’s greatest hits, “Hello Again.”** It was during the 34th Annual Kennedy Center Honors back in 2011. The Kennedy Center Honors is an annual event that recognizes American performing artists for their lifetime contributions to American culture. The song “Hello Again” was featured in the film“The Jazz Singer,”when Diamond sang a heartfelt version of the song during a very emotional scene of the movie. The film is an adaptation of the play of the same name by Samson Raphaelson and it included several songs by Diamond. The song became a hit and at the peak of its success, it reached the number six spot on the Billboard Hot 100, and number three spot on the Adult Contemporary charts. **When you are an artist, it’s an honor to sing for another artist.** And that feeling doesn’t get any better for Nettles. She knows she’s surrounded by famous people and fellow musical artists, so she decides to give it her best. With her beautiful and powerful voice, you will not just hear what she sings, but you will feel it too! **The song “Hello Again” talks about the feeling of missing a friend.** I think everyone has been there when you miss someone who is very dear to your heart during those times that you’re alone and you need someone to talk to. **The emotion and power of the song can be felt by everyone in the room.** When Nettles starts to belt out the first few lines of the song, you can feel the emotions she is pouring into every lyric of the song. She is already a talented singer but everything seems to just elevate a lot higher when she pours the right emotion into it. **When the camera pans to Diamond, you can clearly see the song digging up emotions from his past with his teary eyes.** Close your eyes and just feel the song. Nettles continues to wow the star-studded crowd with her amazing vocal prowess whenever she soars high with every head tone of the song. She keeps on punching through the heartfelt lyrics of the song with every ounce of emotion she has deep in her heart, it somehow shows that she could also relate to its message. **Before she enters the final parts of the song, the camera again shows an emotional Diamond.** He seems to have been caught by the message of his own song. You can’t blame him, blame Nettles for giving the song such an emotionally heartfelt rendition. **Do you also miss a friend? Be sure to watch the video below!** PleaseSHAREthis with your friends and family. Like us on Facebook"}