{"id": 1835, "name": "Vaxxter", "domain": "vaxxter.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://vaxxter.com/throwback-thursday-is-the-government-spraying-us-with-bacteria/", "title": "Throwback Thursday Is The Government Spraying Us With Bacteria", "content": "HomePrivacy Policy Privacy Policy Privacy Policy Vaccine EducationVaccine NewsBoot CampVaccine CoursesResearch the Vaccine Library Vaccine News Boot Camp Vaccine Courses Research the Vaccine Library Vaccine News Boot Camp Vaccine Courses Research the Vaccine Library Dr T’s Interviews Dr T’s SubstackEye on the EvidenceWalking With God Eye on the Evidence Walking With God Eye on the Evidence Walking With God Dr T’s Store Dr T’s Website Join email Contact Us Donate To Dr. T **Throwback Thursday: Is The Government Spraying Us With Bacteria?** Posted By:Fed Up Texas Chick01/16/2025 Many of us experienced the strange dense fog in late December. In fact, this fog seemed to cover half the US, especially the southeast. In Naples, Florida, a man there who experienced this fog also happened to run a laboratory. So he tested fog samples. He was curious because people were reporting that the fog had a strange chemical smell and people were having respiratory issues. The fog wasn’t really wet like it normally would be. Ring camera footage looked like massive swarms of insects rather than the typical rain or snow you’d expect to see. And it went on for days, so he was curious. You’ll never believe what he found. Bacteria, and lots of it, specificallySerratia marcescens, a bacteria that is typically a hospital-acquired bacterial infection. It tends to infect people who are already immune compromised, which would explain the reports of many people suddenly developing respiratory infections all at once. Don’t believe it? Read Dr. Jen Brown’ssubstack, complete with the lab results. It seems a precedent has been set with this bacteria, because our government used this bacteria before in biological warfare experiments on the GENERAL POPULATION. In 1950, the DoD releasedSerratia marcescensbacteria over San Francisco to determine “how far the material would disperse and how much of it would be living at the end of the journey.” How nice. And according to our Tenpenny Report guest authorJon Fleetwood, this secret experiment wasn’t disclosed until 1977. It’s chilling. But it’s a good reminder too. The Deep State efforts tostarve usand make us sick have been going on a long time. Lest we forget. **Support Vaxxter** **Your Donation Helps Us Fight Censorship And Remain Ad-Free** Previous post Next post The Tenpenny Report (formerly Vaxxter) is a site that promotes alternative health news. It offers well-structured and highly referenced articles of interest on vaccines and pharmaceutical products. Cryptocurrency: The Spike Harvesting Program Throwback Thursday: Justice for David Daleiden. Take That Kamala Harris! Kicking Butt and Taking Names: Trump Puts NIH On Notice Throwback Thursday: “Unavoidably Unsafe” Vaccines The Compromised FDA Knows Exactly What It’s Doing This website is for informational purposes only. We do not treat, cure, diagnose or otherwise help ailments. Before attempting any natural or holistic practices, it is strongly encouraged that you seek professional medical advice from a licensed healthcare professional. Any communication with Dr. Sherri Tenpenny through this site is for informational purposes only and does not constitute the establishment of a doctor-patient relationship. Any posts you have made about your private matters and personal health are in the public domain and therefore, are not private. Please post responsibly. Please read ourPrivacy Policy Copyright 2025 | MH Newsdesk lite byMH Themes"}