{"id": 1995, "name": "IceNews", "domain": "icenews.is", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.icenews.is/2025/04/25/sweden-orders-online-casino-to-pay-12-million-krona-for-violating-excessive-gambling-rules/", "title": "Sweden Orders Online Casino To Pay 12 Million Krona For Violating Excessive Gambling Rules", "content": "External content Advertisers Weather About **** Arctic BusinessEnergyMarketing and Consulting Energy Marketing and Consulting Energy Marketing and Consulting CountriesCanadaChinaDenmarkFaroe IslandsFinlandGreenlandHollandIcelandIcelandic PM´s officeMBLInternationalNorwaySaamiScandinaviaSwedenUnited KingdomUnited States Canada China Denmark Faroe Islands Finland Greenland Holland IcelandIcelandic PM´s officeMBL Icelandic PM´s office MBL International Norway Saami Scandinavia Sweden United Kingdom United States Canada China Denmark Faroe Islands Finland Greenland Holland IcelandIcelandic PM´s officeMBL Icelandic PM´s office MBL Icelandic PM´s office MBL International Norway Saami Scandinavia Sweden United Kingdom United States EconomyFinance Finance Finance Health LifestyleBizarreEntertainmentLeisureMusicSportsTravel Bizarre Entertainment Leisure Music Sports Travel Bizarre Entertainment Leisure Music Sports Travel PoliticsEuropean Union European Union European Union ScienceTechnologyWeather Technology Weather Technology Weather SocietyArtEducationEnvironment Art Education Environment Art Education Environment **Sweden orders online casino to pay 12 million Krona for violating excessive gambling rules** The online casino Videoslots has been ordered by Sweden’s Gambling Authority, Spelinspektionen, to pay 12 million Krona for failing to counteract excessive gambling. In addition, the Gambling Authority has warned Videoslots after the online casino breached Chapter 14, Section 1 of Sweden’s Gambling Act. The Gambling Authority has concluded that the online casino failed to take sufficient measures to prevent excessive gambling. Spelinspektionen explains, “The violation may be considered serious in the same respect because it has negatively affected individual players in such a way that they have lost large amounts of money in a short period of time.” “The company shall therefore be given a warning combined with a penalty fee,” followed Spelinspektionen. Tagged with: gambling in Sweden Sweden’s Gambling Authority **Sharing this** **Social** **Recent Posts** **Tourism in Norway: Tourist tax to be introduced due to rising visitor numbers** **Sweden to tackle overcrowded prisons by sending inmates abroad** **Denmark in Frugal Four: Country quits group to prioritise Europe** **Iceland’s F-Roads: What You Need to Know Before Driving into the Highlands** **Partnership between Norway and UNESCO strengthened during Oslo meetings** **Categories** **News archive by month** News in the Nordics"}