{"id": 718, "name": "Journal for Neuroinflammation", "domain": "jneuroinflammation.biomedcentral.com", "bias": "pro-science", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://jneuroinflammation.biomedcentral.com/articles/10.1186/s12974-021-02309-6", "title": null, "content": "Advertisement Explore journals Get published About BMC My account Home About Articles Collections Submission Guidelines Submit manuscript Review Open access Published:06 November 2021 **The semantics of microglia activation: neuroinflammation, homeostasis, and stress** Samuel C. Woodburn1, Justin L. Bollinger1& Eric S. Wohleb1 Journal of Neuroinflammationvolume18, Article number:258(2021)Cite this article 37kAccesses 37kAccesses 37kAccesses 396Citations 396Citations 396Citations 31Altmetric 31Altmetric 31Altmetric Metricsdetails Metricsdetails Metricsdetails **Abstract** Microglia are emerging as critical regulators of neuronal function and behavior in nearly every area of neuroscience. Initial reports focused on classical immune functions of microglia in pathological contexts, however, immunological concepts from these studies have been applied to describe neuro-immune interactions in the absence of disease, injury, or infection. Indeed, terms such as ‘microglia activation’ or ‘neuroinflammation’ are used ubiquitously to describe changes in neuro-immune function in disparate contexts; particularly in stress research, where these terms prompt undue comparisons to pathological conditions. This creates a barrier for investigators new to neuro-immunology and ultimately hinders our understanding of stress effects on microglia. As more studies seek to understand the role of microglia in neurobiology and behavior, it is increasingly important to develop standard methods to study and define microglial phenotype and function. In this review, we summarize primary research on the role of microglia in pathological and physiological contexts. Further, we propose a framework to better describe changes in microglia1 phenotype and function in chronic stress. This approach will enable more precise characterization of microglia in different contexts, which should facilitate development of microglia-directed therapeutics in psychiatric and neurological disease. **Background** In the early 1900s, Pío del Río-Hortega described a new type of phagocytic brain cell, of mesodermal origin, that he termed “microglia” [1,2,3]. Decades later, microglia were recognized as macrophages, evidenced by morphological similarities to peripheral macrophages and their recognition by antisera against common monocyte markers [4,5,6,7]. Still, microglia are unique among macrophages. Unlike their fetal liver or bone marrow-derived relatives, microglia arise from embryonic yolk sack progenitors and maintain transcriptional and functional identities distinguishing them from other macrophages which may infiltrate the brain under pathological conditions [8,9,10,11,12,13,14,15]. As such, microglia are considered brain-resident macrophages and are uniquely suited to regulate neural homeostasis and behavior. In particular, recent studies indicate that microglia can modulate neuronal activity, facilitate learning, and shape social behavior [16,17,18,19,20,21,22,23,24]. The underappreciated role of microglia in physiological conditions contrasts earlier work, which mainly focused on microglial function in pathological contexts such as injury and disease, where neuronal death or degeneration is observed [25,26]. These initial studies characterized neuro-immune responses in such contexts and clearly defined the term “neuroinflammation,” which was guided by four primary features of peripheral inflammation: macrophage (microglial) activation, increased cytokines and chemokines, recruitment of peripheral immune cells, and local tissue damage [25,27]. These studies also demonstrated that microglia and peripheral immune cells have dual roles: driving neuroinflammation and subsequent pathology, as well as resolving neuroinflammation and repairing the nervous system [28,29]. Adding to the complexity of neuro-immune systems, these roles do not likely represent discrete functional states in vivo. Indeed, there is ample evidence that inflammation simultaneously drives tissue damage and repair [25,30,31,32,33]. Nonetheless, these functions collectively represent various facets of microglia activation, which is classically identified by substantial increases in cytokine production, the adoption of an amoeboid morphology, and changes in relevant protein markers (Fig.1.) [34,35,36,37]. It should be noted that there is ongoing refinement of approaches to characterize macrophage/microglia activation [for a comprehensive overview, see: [25,30,32,33]. There are limitations to these definitions because biological systems do not fit cleanly into well-defined categories. As a result, terms such as “microglia activation” and “neuroinflammation” have broadened over the years to include most immune-related processes in the nervous system. While this has occurred in multiple areas of study, this review will focus on the functional states of microglia and their contributions to the neurobiology of stress. Phenotypic distinctions between homeostatic and “activated” microglia. Under typical conditions (A), microglia display a ramified morphology and a unique pattern of gene expression, making them identifiable through a number of different techniques. However, a variety of immunogenic stimuli can elicit dramatic morphological and functional changes in microglia. Immunologically activated microglia (B)possess an amoeboid morphology; marked by increased soma size and less ramified processes. Markers for microglia activation vary widely depending on the type and severity of insult, but surface proteins associated with classical immune functions (e.g., antigen presentation, phagocytosis) tend to be increased, while those associated with homeostasis may be reduced. Functions of activated microglia are also highly variable, with the same cells potentially driving tissue damage and repair processes simultaneously. Morphological features may not correspond to assumed functional roles. Nonetheless, classical immune functions of activated microglia include phagocytosing cellular debris, large increases in cytokine signaling, recruitment of peripheral immune cells to the parenchyma, and destroying infected or dying cells Accumulating evidence indicates that microglia play a role in the synaptic and behavioral changes associated with chronic stress [38,39]. However, there remain fundamental issues in the conceptual framework used to integrate immunological concepts with stress research. Indeed, the language used to study peripheral macrophages in the context of infection is not adequate to describe microglial function in chronic stress; especially considering the vast biological differences between these two contexts. Despite this, researchers often use the term “neuroinflammation” to describe immune-related changes caused by chronic stress, which prompts comparisons to tissue injury or disease states and ultimately hinders our understanding of stress effects on microglia. This is significant because preclinical stress models are often used to gain insight into the neurobiology of psychiatric disorders. Thus, simplifying the role of microglia and neuro-immune systems in these models may lead to spurious therapeutic targets that ultimately hinder further clinical research. As advanced approaches (e.g., single cell RNA-Seq) improve our understanding of microglial phenotypes and functions, it is important to define specific features of microglia across model systems and disease states. This will increase the likelihood that congruent molecular and cellular pathways will be identified, which may facilitate the development of therapeutic approaches targeting microglia. In this review, we will discuss microglial functions in pathological and homeostatic conditions; as well as highlight the need to refine terms used to describe microglia in different contexts. Moreover, we propose an alternative framework in which neuron–microglia interactions coordinate neurobiological adaptations to stress, congruent with an immune state called ‘parainflammation’ (not neuroinflammation). **Microglia in inflammatory contexts** Inflammation is triggered by immunogenic stimuli (i.e., pathogens or tissue injury), resulting in various biochemical cascades aimed at resolving these threats to homeostasis. Consequently, tissue damage and repair processes are enhanced during inflammation, often in tandem, until it resolves through complex regulatory mechanisms. In the brain, neuroinflammation manifests as elevated levels of pro-inflammatory cytokines, macrophage (microglia) activation, peripheral leukocyte infiltration, and damage to nervous tissue [25]. Although it is becoming increasingly clear that neuro-immune interactions play a role in most facets of brain function, it is typically under circumstances of disease, injury, and infection that all four of these hallmarks are present [27,40]. In high enough concentrations (i.e., during neuroinflammation), immunogenic molecules can “activate” microglia, causing them to adopt an amoeboid morphology, and drastically increase their production of cytokines and reactive oxygen species (ROS). However these functional changes vary based on the type of stimuli and severity of insult [41]. Thus, in order to understand microglial function in a disease context, it is important to appreciate the intricacies of neuroinflammation. To this end, we will discuss a few examples of microglial function in neuroinflammatory contexts. Microglia activation is observed in various central nervous system (CNS) diseases and is important for coordinating the immune system’s resources during disease-associated neuroinflammation. For example, activated microglia are the main phagocytes observed in early stage multiple sclerosis (MS) lesions. This changes over time, with recruited bone marrow-derived macrophages taking over as the lesion advances [42,43]. Further insights come from mouse hepatitis virus (MHV) infection, which causes demyelinating disease in models of experimental autoimmune encephalomyelitis (EAE). Early after MHV infection, microglia increase expression of cytokines which suppress viral infection and signal to adaptive immune cells [44,45]. Ultimately, this contributes to T-cell and peripheral macrophage infiltration, increased brain cytokine levels, and tissue damage; here in the form of plaques or lesions where activated macrophages are believed to contribute to demyelination [45,46]. Recent studies demonstrate that the initial microglial response is a critical determinant of EAE severity. Depleting microglia with the colony stimulating factor 1 receptor (CSF1R) antagonist PLX5622 prior to MHV infection delayed virus clearance and was linked to reduced infiltration and activation of CD4+T cells, as well as decreased production of interferon gamma (IFN-γ); a critical suppressor of viral replication [44,47,48,49]. This dampened immune response was associated with an 80% increase in mortality [44,47]. This is consistent with other studies reporting greater demyelination at peak disease and less remyelination during recovery in mice lacking microglia [47,49,50]. Thus, while microglia appear to play a role in cytokine production and demyelination in this model, it is evident that they also promote adaptive immune responses and aid in processes to repair tissue in EAE [45]. It remains to be seen whether microglial functions characterized in EAE precisely correspond to those occurring in patients with MS [43]. Nonetheless, this work highlights the complexities of neuroinflammation and microglial phenotypes in disease. Microglia are often first responders to brain or nerve injury. In fact, studies show that just minutes after ischemic stroke, microglia adopt an amoeboid morphology, display enhanced isolectin B4 binding, and have increased levels of compliment receptor 3 (CR3, a.k.a. CD11b) as well as major histocompatibility complex (MHC) I and II [51]. These activated microglia produce high levels of TNFα, leading to endothelial necroptosis and BBB destruction [52]. This secondary tissue damage may also contribute to the infiltration of peripheral monocytes in the brain parenchyma, where they proliferate and gradually take over as the predominant phagocytes at the site of injury [53]. Both microglia and peripheral monocytes are involved with clearing debris after stroke, which attenuates inflammation; however they may also phagocytose injured yet viable neurons, leading to greater tissue damage [54,55,56]. While these findings indicate that microglia drive pathology in stroke, there is evidence to suggest microglia also play a neuroprotective role. Mice lacking TREM2, a receptor highly expressed by microglia and believed to play a role in phagocytosis, show exacerbated ischemic damage after stroke [57]. Moreover, injured cells release high quantities of purines (ATP/ADP), which microglia detect and extend their processes toward via the purinergic receptor P2Y12 [58,59]. Recent work showed that after stroke, neurons in the ischemic penumbra recruit microglial processes through a P2Y12 dependent mechanism, leading to the formation of an immunological synapse between the two cells [17]. Notably, this was attenuated in P2Y12 knockout mice and coincided with increased neuronal calcium load, disrupted cortical network function, and greater area of ischemia-induced disconnection [17]. Altogether these findings show that microglia have dual roles in driving the pathological hallmarks of neuroinflammation and preserving and repairing damaged tissue in stroke [60]. Numerous studies demonstrate that microglia and neuroinflammation play a role in the pathogenesis of Alzheimer’s disease (AD). Genome-wide association studies have suggested that individuals with variants of immune genes such as CD33 and TREM2 are at greater risk of developing AD, and single-cell RNA sequencing studies suggest that immunologically activated microglia are present in both animal models of AD and tissue from AD patients [61,62,63,64,65]. Additionally, studies in human tissue found increased trafficking of peripheral leukocytes in brain tissue from AD patients, suggesting blood–brain barrier (BBB) decline and immune-driven pathology in AD [66,67,68]. In line with this, 5 × and 3 × FAD mice, which overexpress human mutations associated with familial AD, show increased neutrophil extravasation into the parenchyma at sites of amyloid beta (Aβ) plaques, where they release extracellular traps and IL-17. Importantly, depleting neutrophils reduced Aβ42levels and was associated with better cognitive outcomes, suggesting that neutrophils play a role in AD pathogenesis [66]. Collectively, these studies point to neuroinflammation as a contributing factor in AD, however the precise role of microglia in AD is more complicated [69]. As mentioned above, mutations affecting TREM2 function are risk factors for AD, and importantly, TREM2 is involved in Aβ clearance by microglia [70,71]. Further, stimulating microglia proliferation via TREM2 agonism in mice engineered to express one of these human polymorphisms, led to decreased plaque load and neuronal dystrophy, suggesting that stimulating immune function from microglia may be beneficial in AD [72]. This is in line with recent work which identified a subtype of disease-associated microglia (DAM), which are associated with Aβ plaques and promote their clearance through a mechanism involving TREM2 [73]. Thus, rather than suppressing immune function altogether, it may be useful to promote selective microglia responses to help restore homeostasis [74]. In contrast, other work suggests that microglia release Aβ and tau “seeds”, which exacerbate AD progression [75,76]. Given these complexities, additional research will be required to fully appreciate the role of microglia in AD. In cases of CNS infection, neuroinflammation caused by microglia activation is critical for detecting and eliminating pathogens, but is not without consequence [77]. For instance, bacterial infection of the subarachnoid space causes astrocytes, endothelia, and microglia to secrete large amounts of pro-inflammatory cytokines, including tumor necrosis factor alpha (TNF-α), interleukin 1 beta (IL-1β), and interleukin 6 (IL-6), which drive inflammation in the meninges [78]. These cytokines also activate endothelial integrins and stimulate chemokine secretion, promoting peripheral leukocyte recruitment [79,80]. Further,Streptococcal pneumonia, the microorganism most commonly associated with bacterial meningitis, can penetrate the blood–brain barrier (BBB), and microglia react directly to the bacterium’s cell wall in the parenchyma [79,81]. In vitro models and rodent studies show that components of the pneumococcal cell wall cause microglia to produce nitric oxide, as well as a variety of different cytokines and chemokines, increasing leukocyte extravasation to the parenchyma [79,82]. This leads to a predicament where on one hand, invading pathogens will trigger apoptosis via bacterial exotoxins, ultimately resulting in death [83,84]. On the other hand, neuroinflammation caused by cytokines and ROS from the immune system can stop infection, but at the cost of associated tissue damage [78]. Exposure to pathogens in peripheral tissue elicits neuro-immune signaling and microglia responses that are drastically different from CNS infection. In preclinical models, viral (i.e., poly-IC) or bacterial components (i.e., lipopolysaccharide; LPS) are used to mimic peripheral infection and study associated neuro-immune interactions. This work shows that immune cells (often tissue-resident macrophages) in peripheral tissues initiate pro-inflammatory signaling cascades that affect other immune mediators. In particular, circulating cytokines promote IL-1β secretion from macrophages in circumventricular organs, as well as perivascular macrophages and endothelia of the neurovasculature. These pro-inflammatory signals are transmitted to and propagated by microglia in the parenchyma. [85,86,87]. These microglia responses mediate important physiological (e.g., fever) and behavioral (e.g., lethargy) components of sickness that promote survival [88]. This form of microglial activation is transient and occurs without causing overt neuropathology [41,88,89,90,91,92]. Recent reports indicate that peripheral administration of LPS can cause transient BBB disruption and microbleeds in the brain [90,92]. These neuro-immune interactions may contribute to the observed changes in inflammatory mediators in the brain, but further studies are needed to define these mechanisms. It is important to emphasize that peripheral infection alters microglia function indirectly, as viral (i.e., poly-IC) or bacterial components (i.e., lipopolysaccharide; LPS) do not typically reach the brain parenchyma, and that effects of LPS will vary depending on the route of administration, dose, and duration of exposure [93]. Thus, studies using immune challenges, such as LPS, need to consider how neuro-immune pathways (e.g., vagus nerve; endothelial cells) transmit immune signals to microglia and the brain, and whether peripheral inflammation in these models truly drives neuroinflammation as well. **Microglia in non-inflammatory contexts** Foundational to the idea of discrete macrophage activation states is the notion that these cells show limited activity or exist in a “resting” state prior to activation. Keeping with this, many studies note morphological shifts between the complex ramifications protruding from “resting” microglia in homeostasis and that of reactive or “amoeboid” microglia seen in diseased tissue [34,35]. However, by focusing on microglia in the context of disease, these studies overlooked the dynamic nature of microglia in homeostasis. Seminal work utilized in vivo two-photon imaging in transgenic mice expressing EGFP driven by theCx3cr1promoter to investigate microglial function under baseline conditions [94,95]. These studies demonstrated that microglia display nearly constant movement, with their processes undergoing cycles of extension and retraction as they survey the extracellular space [94]. Further, the authors noted that neuronal activity appeared to influence process motility, and that many microglial processes contained pieces of phagocytized material which were gradually transported to the cell body. Thus, instead of quiescent cells in a “resting” state, this work demonstrated that microglia are constantly surveilling and utilize processes associated with immune activation (i.e., phagocytosis) in physiological conditions. Further studies elaborated on this work and demonstrated that microglia are actively involved in neurodevelopment. In early development, neurons establish many more synaptic contacts than persist in a mature brain. As these young neurons send and receive signals to each other, synapses lacking sufficient input are gradually pruned while more active synapses are maintained [96,97]. Interestingly, work by Stevens et al. showed that inactive projections from retinal ganglion cells (RGC) in the dorsal lateral geniculate nucleus (dLGN) were pruned in a complement-dependent manner [98]. In the periphery, the complement system comprised freely circulating proteins that, when bound to pathogens, trigger a signaling cascade which enhances the ability of macrophages to detect and phagocytose those pathogens [99,100,101,102]. Later work by Schafer et al. demonstrated that microglia mediate engulfment of inactive RGC projections within the developing LGN in a complement- and activity-dependent manner, which allowed for typical circuit development [103]. A number of mechanisms have been shown to guide microglia-mediated synaptic pruning, with inhibition of these pathways linked to atypical behavioral phenotypes [22,104,105,106]. For example, mice lacking either TREM2 or CX3CR1, both receptors highly expressed by microglia, show impaired synaptic pruning during development [107]. Consequently, mice lacking either of these receptors exhibit altered brain connectivity and deficits in social behavior in adulthood. Additional studies even show compromised LTP alongside deficits in contextual fear conditioning and spatial learning memory in CX3CR1-deficient mice. [24,108,109]. Expanding on these developmental studies, recent work suggests that the complement system regulates microglial phagocytosis of synapses in the adult hippocampus and contributes to forgetting [110]. Meanwhile other experiments indicate that microglial phagocytosis of the extracellular matrix around hippocampal neurons promotes memory consolidation via a mechanism dependent on neuron-derived IL-33. Collectively these findings indicate that microglial phagocytosis is not only triggered by pathogens or injury, but it is critical for proper neurodevelopment and neuroplasticity as well. A similar theme emerges in work examining purine (e.g., ATP/ADP)-mediated chemotaxis by microglia. Accumulating evidence indicates that this process, traditionally associated with tissue damage (see previous section), guides homeostatic neuron-microglia interactions [111]. Different labs have consistently shown that stimulation of NMDA receptors on highly active neurons causes them to release ATP/ADP into the extracellular space, which is detected by microglial P2Y12 receptors [19,105,112,113,114]. Upon binding extracellular purines, Gicoupled P2Y12 receptors promote extension of microglial processes toward activated neurons [17,18,115,116]. Studies examining neuron-microglia interactions in the visual cortex showed that visual experience caused microglia to interact with dendritic spines of V1 neurons, and that depriving animals of light during visual critical periods increased their phagocytosis of neuronal material [117]. This was driven in part by P2Y12 signaling, as disrupting P2Y12 during monocular deprivation limited microglial remodeling of V1 synapses, which in turn abrogated typical ocular dominance [105]. Interestingly, recent studies show that this process is opposed by noradrenergic signaling, as β2-adrenergic receptors on microglia were shown to limit experience-dependent plasticity in awake mice by inhibiting microglial surveillance [118]. Beyond guiding neuroplasticity, convergence of microglia processes toward active neurons is implicated in regulating neuronal activity through physical contact. For example, microglia have been shown to rescue the somatic potential of hyperactive neurons by physically contacting their axons, while pharmacologically inhibiting microglial detection of neuronal activity (and thus limiting their contacts with neurons) is associated with increased neuronal death [18]. Similarly, neuronal hyperexcitability induced by kainic acid provokes more severe and more frequently lethal seizures in mice lacking P2Y12 [19], further implicating microglia in regulating neuronal excitability. Perhaps the most direct evidence of this however comes from a recent study showing that upon detection, microglia catabolize extracellular ATP into adenosine, which in turn suppresses hyperactive neurons by binding to the adenosine receptor A1R [119]. This inhibitory mechanism was crucial for attenuating seizure severity in mice treated with pro-convulsive doses of a D1 agonist, demonstrating a protective role for microglia. Taken together these studies suggest ATP-mediated chemotaxis by microglia is not only important for responding to injury, but also for maintaining brain homeostasis by limiting pathological neural activity. Another function of activated macrophages is secretion of growth factors and cytokines. This too has been observed in microglia absent neuroinflammation. For example, Parkhurst et al. showed that microglial brain-derived neurotrophic factor (BDNF) secretion was important for synaptic integrity. In these studies, microglia-specific depletion of BDNF reduced cortical expression of certain glutamate receptors, which subsequently altered NMDA and AMPA mEPSCs [20]. These deficits in synaptic function ultimately translated to reduced learning-associated spine growth and subsequent behavioral impairments in rotarod training, indicating that trophic support from microglia is an important neurobiological component of learning. Cytokines are also known to modulate synaptic plasticity under physiological conditions. Initial studies performed both in vivo and in acute hippocampal slices showed thatIl1βtranscript was increased after LTP induction, and that application of IL-1 receptor antagonist (IL-1ra) interfered with LTP maintenance [120]. Similarly, mice engineered to overexpress IL-1ra in the brain show learning deficits, reduced GluA1/2 expression, and impaired BDNF signaling [121]. It should be noted that cytokine signaling is complex, and the same molecule might have entirely different effects depending on concentration, or the presence of other cytokines [122]. Consistent with this, IL-1β has a concentration-dependent relationship with LTP. Under physiological conditions, IL-1β concentrations are relatively low and can enhance LTP and improve recall of a conditioned stimulus. In contrast, when IL-1β concentrations are high (i.e., inflammation or aging), IL-1β impairs LTP by acting at the synapse [123,124,125]. Other immune factors such as TNFα, IL-10, CXCL16, and CX3CL1 have also been implicated in LTP, with microglia acting either as potential sources of, or the cells affected by these molecules [126,127,128,129,130,131]. While much work is needed to fully appreciate microglial contributions to synaptic plasticity, these studies demonstrate the importance of neuro-immune interactions in homeostatic brain function. **Microglia in psychological stress: debating neuroinflammation** Clinical and preclinical studies conducted over the past two decades demonstrate that psychological stress influences various neuro-immune pathways [38,132]. Early work revealed that both acute and chronic stressors increase levels of certain pro-inflammatory cytokines such as IL-1β in the brain [133,134]. Further studies specifically implicated microglia as the primary source of these cytokines, and showed that chronic stress altered microglial morphology [133,135,136,137,138]. Collectively these changes were considered evidence of microglia activation, and therefore neuroinflammation, caused by psychological stress. However, as outlined above, neuroinflammation is characterized by macrophage activation, pro-inflammatory cytokine secretion, leukocyte recruitment, and tissue damage [25]. While there is good evidence that all four of these are present in conditions like MS, AD, stroke, and bacterial meningitis, it is not clear if the term neuroinflammation applies to stress-associated neuro-immune functions. Recall that the effects of pro-inflammatory cytokines depend on other factors such as concentration [122]. During neuroinflammation, IL-1β and TNFα concentrations can reach hundreds or even thousands of times higher than baseline levels, and promote cell death either by directly triggering apoptotic pathways in target cells, or by enhancing other neuroinflammatory processes associated with cellular damage [139,140,141,142,143,144]. While there is evidence that stress exposure influences IL-1β and TNFα levels, the magnitude of this effect is considerably lower by comparison (< 10 times baseline) and occurs in the absence of overt tissue pathology [41,133,135,145,146]. It should also be noted that outside the contexts of injury and disease IL-1β and TNFα secretion in the brain facilitates synaptic plasticity, which is critical in maintaining homeostasis [124,131,147,148]. As such, modest changes in pro-inflammatory cytokine expression may not indicate neuroinflammation and could represent an altogether different biological process. A common finding reported in stress literature is the presence of “activated” microglia. As mentioned in the beginning of this review, the precise definition of macrophage activation is an area of ongoing debate and it is not clear what precisely constitutes an “activated”, “resting”, or “alternatively activated” macrophage or microglia [25,30,32,33]. In Fig.1, we provide some common features of microglia across immunogenic contexts, yet even these come with a multitude of caveats, as features of “activated” microglia in one context may not appear in another [34,35,37]. Further, as mentioned in the previous section, the idea of “activated” microglia presumes they are quiescent under typical conditions, which is not supported by recent data [149]. One of the common metrics to assess microglia activation are broad morphological shifts from small soma with ramified processes in homeostasis, to amoeboid with thicker and less complicated processes during neuroinflammation [36,37]. Indeed initial reports indicated that stress caused microglia activation largely based on changes in morphological features [136]. However, evidence suggests that morphological changes in microglia do not define their functional state. Indeed microglia display dynamic and varied morphologies driven by local cues and these features may not overlap with assumed functions. For example, microglia in the developing subventricular zone and cortex display amoeboid morphology, yet the cytokines and growth factors they produce are essential for neuronal growth and differentiation [150,151]. Even within the context of chronic stress, changes in microglial morphology vary between brain region, sex, species, stress paradigm, and stress duration, without specific biological or behavioral implications [136,152,153,154,155,156]. In this context, it is not accurate to suggest that morphological changes in microglia alone can provide insight into their functional state. Moreover, it should be noted that these morphological analyses have been primarily reported in tissue immunolabeled with IBA-1, which does not fully reproduce microglial complexity. Indeed, studies using mice with a microglia-specific GFP reporter failed to observe such morphological changes after chronic social defeat stress, despite having more statistical power than previous reports [157]. These findings suggest that chronic stress exposure does not cause microglia activation in a way that resembles the immunological origins of the term [32,33,158]. Other studies have also reported that chronic stress promotes peripheral leukocyte trafficking in the brain, but this appears to be dependent on experimental approaches and context. In particular, studies using GFP+bone marrow (BM)-chimeric mice showed that repeated social defeat (RSD) promotes signaling from microglia and caused infiltration of peripheral monocytes into selective brain regions. These neuro-immune interactions were associated with reduced exploratory behavior in socially defeated mice [159,160,161]. However, further studies using LysM-GFP+, CCR2RFP, and UBCGFPreporter mice indicate that RSD promotes accumulation of peripheral myeloid cells (i.e., monocytes and granulocytes) in the perivascular space and choroid plexus; not in the brain parenchyma [157,159,162,163]. These results suggest that development of the BM-chimera model enabled extravasation of myeloid cells into the brain following RSD [157,159,162,163,164]. Despite limited evidence for leukocyte trafficking in the brain, these studies did find that RSD caused a decline in BBB integrity [157,165]. These stress-induced changes in the BBB were associated with vascular remodeling and the passage of signaling peptides, indicating that more subtle processes are involved during stress as compared to neuroinflammation [163,165]. It is important to point out that accumulation of peripheral myeloid cells and loss of BBB integrity has been primarily observed in the RSD model. These findings are still significant, but it reinforces the fact that the context is critical; RSD is a unique paradigm as it involves aggressive encounters that can wound subordinate mice, potentially influencing their inflammatory profile [166,167,168]. Indeed, other stress models that use exposure to unstable or aversive environmental conditions (and lack physical confrontations or wounding) do not cause significant accumulation of peripheral macrophages in the brain [169]. In summary, while it is evident that stress engages neuro-immune pathways and alters microglia function, these effects are subtle and are not associated with immune-driven pathology. Despite these modest effects, neuro-immune interactions still play an important role in the behavioral and biological effects of chronic stress exposure. As such, a different framework is needed to accurately describe neuro-immune responses to stress. **Parainflammation: neuro-immune adaptations to homeostatic threats** Historically, neuro-immune interactions have been framed around existing immunological concepts derived from models of pathological conditions in which all four hallmarks of inflammation are present. By contrast, the behavioral and biological sequelae of chronic stress are best described as a consequence of prolonged adaptation to homeostatic threats, which, while associated with adverse effects, is not inherently pathological [170,171]. For example, repeated stress exposure gradually attenuates hypothalamo–pituitary–adrenocortical (HPA) axis activation in response to a familiar challenge, ultimately reducing the physiological burden of chronic glucocorticoid secretion [170]. However, adaptation to chronic stress also sensitizes HPA activation to new challenges, which, while appropriate in dangerous situations, can be disadvantageous in response to innocuous stimuli [170,172]. Behavioral adaptations to chronic stress can be understood in a similar way. Recent work shows that social avoidance, the primary outcome of RSD in “susceptible” mice, is a learned behavior that does not generalize outside the aggressor’s strain and can be extinguished with repeated exposure in a safe environment [173]. In other words, “susceptible” mice learn to avoid an aggressor strain in a context that reliably predicts danger. Just as well, increased immobility in the forced swim test, a behavioral metric used in many other stress paradigms, might be an adaptive pro-survival behavior, as floating in an inescapable body of water conserves energy [174]. Nonetheless, these paradigms also alter behaviors such as sucrose preference, working memory, and effort-related choice [152,175,176,177,178,179]. Thus, rather than overt pathophysiology (i.e., relating to disease or injury), chronic stress effects on brain and behavior can be framed as adaptations to adverse conditions, which can compromise typical function. With this in mind, stress-induced functional changes in microglia resemble an intermediate tissue state termed parainflammation, in which stressed or malfunctioning cells engage tissue-resident macrophages to restore homeostasis [132,180,181]. In this conceptual framework (Fig.2.), chronic psychological stress disrupts homeostatic brain function, provoking changes in microglia function. In coordination with other brain cells, microglia then facilitate neurobiological adaptations by initiating immune-related processes (i.e., cytokine release, phagocytosis). Of note, these microglia-mediated processes occur independent of other peripheral immune cells and at levels relative to physiological contexts. Ultimately, this may restore brain homeostasis, but may cause important behavioral and biological consequences. Contrast between neuroinflammation and parainflammation. Neuroinflammation (left) describes immune-driven pathology which occurs in the course of disease, injury, or infection in the brain. This tissue state can be identified by four common molecular and cellular hallmarks illustrated on the left. These are:(1)high levels of pro-inflammatory cytokines,(2a)microglia and(2b)peripheral macrophage activation,(3)infiltration of peripheral leukocytes (e.g., bone-derived monocytes, T cells) to the parenchyma, and tissue damage such as(4a)BBB breakdown and(4b)neuron death. Neuro-immune systems can also be engaged by homeostatic challenges (i.e., psychological stress), leading to an intermediate tissue state termed parainflammation (right). While a formal definition of parainflammation is yet to be widely accepted in neuroscience, neuro-immune interactions previously reported in parainflammatory contexts are shown on the right. These include:(1)microglial recruitment of bone-derived monocytes to the perivascular space,(2)changes in cytokine signaling between neurons and microglia,(3)microglia-mediated neuronal remodeling, and(4)diffusion of small signaling peptides across the BBB In support of this, there is growing evidence that stress-induced changes in microglial function reflect coordinated interactions between microglia and neurons (and other cells in the brain) rather than dysfunctional immune processes. For example, chronic unpredictable stress (CUS) and glucocorticoids promote CSF1 signaling in the PFC, which elicits microglial phagocytosis of neuronal elements in the medial PFC [154,169]. Ultimately, this neuronal remodeling by microglia contributes to synapse loss in the medial PFC and associated stress-induced behavioral changes [169,182]. Interestingly, our recent work suggests that while synapse loss persists over the course of chronic stress, microglia-mediated neuronal remodeling diminishes over time, indicating that this is a coordinated process and that spine loss is maintained by other mechanisms [152]. Further support for the concept of parainflammation in stress research comes from emerging evidence that stress-induced changes in microglia correspond to stress-induced changes in neuronal activity. Previous work showed that repeated restraint stress increased microglial proliferation in the hippocampus; however, this was blocked by treatment with the glucocorticoid receptor antagonist RU486 or the NMDA receptor antagonist MK801 prior to restraint [183]. Other studies demonstrated that acute stress exposure increased c-Fos labeling in neurons within the periaqueductal gray (PAG), and that microglia adjacent to c-Fos positive neurons displayed morphological changes [184]. Furthermore, this was distinct from morphological changes caused by LPS treatment, as LPS altered microglial morphology in the PAG regardless of c-Fos labeling on nearby neurons, indicating that microglia respond to different stimuli in these contexts. Experiments conducted in our own lab also hint that neuronal activity drives microglial function in stress. We found that treatment with diazepam limited FosB staining in the medial PFC, which corresponded to attenuated stress effects on microglia-mediated neuronal remodeling, dendritic spine density, CSF1 signaling, and behavior [155]. This is in line with research in other model systems suggesting that CSF1 is released by hyperexcitable neurons, although this remains to be directly tested in the context of chronic stress [185,186]. Because parainflammation is an adaptive process, it is important to consider these changes within the greater context of the stress model. Seminal work in stress neurobiology demonstrated that while acute stress drives glutamate signaling in the PFC and hippocampus of male animals, this reverses as stress exposure becomes chronic [179,187,188,189]. It has previously been hypothesized that, while this change is not without consequences, it ultimately reflects a metabolic shift to meet the homeostatic challenges of stress [170,171,190,191,192,193,194]. In essence, glucocorticoids released during initial stress exposure cause long-lasting potentiation of AMPA and NMDA receptor currents in pyramidal neurons, leading to increased surface expression of these receptors and improvements in working memory [187,188,189,195]. However, excess or prolonged glucocorticoid and glutamate stimulation can exacerbate excitotoxic insults by increasing intracellular Ca2+, and high glucocorticoid levels have profound effects on metabolism by depleting available energy and inhibiting cellular growth [170,192,193]. Thus, over time it may become beneficial to limit the signals associated with acute stress in these regions. Keeping with this, chronic stress is associated with decreased AMPA and NMDA receptor expression, blunted EPSCs in excitatory pyramidal neurons, and impairments in working memory [179,196]. Previous reports are also largely consistent in documenting morphological changes such as dendritic retraction and loss of apical spines in pyramidal neurons after chronic stress exposure, which would make them less susceptible to the effects of excessive Ca2+[197,198,199,200,201]. Given this context, the changes in microglial function arising from chronic stress are quintessentially parainflammatory processes. In this framework, acute stress exposure increases excitatory neurotransmission in a subset of brain regions [187,188]. Microglia detect this shift in neuronal activity, and may modulate it through increased (but much lower than pathological levels) cytokine secretion [124,135,145,202]. As stress exposure continues, activity-dependent signals from neurons, such as CSF1, increase and direct neighboring microglia to modulate neuronal activity through structural remodeling of neurons or release of neuromodulators [169]. These parainflammatory mechanisms are also accompanied by cell autonomous mechanisms in neurons, such as dendritic retraction and degradation of glutamate receptors, which maintain this neuronal phenotype [179,197,200,203]. Collectively, these coordinated neuron–microglia interactions mitigate the effects of uncontrolled glutamate signaling and promote behavioral adaptations to adverse conditions. As an inadvertent result however, these changes may also promote longer-term behavioral and physiological consequences. Thus, while parainflammatory mechanisms are not associated with overt tissue pathology (as is the case in neuroinflammation), some aspects can be considered maladaptive. **Clinical implications** This is a semantic argument, but it is significant, as stress models are often used to inform our understanding of psychiatric conditions such as major depressive disorder (MDD). Indeed, preclinical work attributing stress effects to neuroinflammation and microglia activation are frequently cited by clinical studies claiming a similar etiology for MDD. These clinical reports indicate that some individuals with MDD have higher blood cytokine levels than controls, while others report increased PET detection of translocator protein (TSPO) during depressive episodes, which is interpreted as an indication of microglia activation and neuroinflammation [204,205]. While this work provides evidence of altered immune signaling in MDD, much like the basic research discussed in this review, these measures do not necessarily indicate that neuroinflammation or immune dysregulation underlies the etiology of MDD. Indeed, mild infections or experimentally induced inflammation with LPS increase blood concentrations of inflammatory cytokines to much higher levels, suggesting that peripheral immune signaling in MDD differs from that observed during inflammation [206,207,208]. Similarly, although TSPO has been used as a proxy for microglia activation, the functional consequences of increased TSPO are not entirely understood [209]. In fact, PET imaging studies conducted in patients with MS show no difference in TSPO expression between activated macrophages in white matter lesions and those in normal appearing white matter or in healthy controls [210]. Other studies have indicated additional confounds to consider in TSPO studies, namely that TSPO tracers are bound by vascular endothelia and TSPO levels show maximal intensity after the resolution of inflammation [211,212]. Further, preclinical studies indicate that TSPO expression is also increased in neurons, not microglia, after periods of heightened neurotransmission [213]. These findings suggest that the utility of TSPO in assessing microglia activation is limited by its lack of cellular and temporal specificity. The role of neuroinflammation in MDD was further challenged by recent clinical studies that showed microglia from individuals with MDD have increased expression of transcripts and proteins associated with homeostatic functions, rather than markers of inflammation [214]. Our focus on this literature is not intended to dismiss a potential relationship between MDD and inflammation outright. There is strong evidence to suggest that genuine inflammatory responses can disrupt mood in patients with chronic illness or comorbid inflammatory diseases [215,216,217]. In addition, recent findings demonstrate that there are differences in circulating immune factors and cells in subsets of MDD patients [218]. Considering the evidence however, it seems unlikely that MDD or the psychological effects of stress can be considered truly neuroinflammatory conditions on their own. And although neuro-immune interactions have clearly been implicated in MDD, they appear to reflect an intermediate immune state rather than classic inflammation. Our understanding of immune function in MDD is still developing and further research is needed to fully appreciate its complexity. As such, hypotheses that reduce multidimensional diagnoses like MDD to pathological immune function are not likely to advance treatments for patients. This necessitates the use of conceptual frameworks that integrate parainflammatory neuro-immune interactions within a larger biopsychosocial context, as has been done in other areas of neuroscience and psychiatry [219,220,221]. **Conclusion** As research on the involvement of neuro-immune systems in chronic stress expands, it is imperative that our models and conceptual frameworks be adapted to relevant data. Initial studies used existing disease-based terms to define stress-associated changes in microglial function. However, preclinical research demonstrates that neuro-immune responses to stress are distinct from CNS disease, injury, or infection and should not be characterized as neuroinflammation [25,41]. The neurobiological changes that occur with chronic stress reflect adaptations required to meet the homeostatic demands of an unstable environment. We suggest that, before concluding a given neuro-immune interaction is evidence of neuroinflammation, investigators first consider whether the hallmarks of inflammation are also present. These include: substantially increased cytokine concentrations, macrophage activation, parenchymal infiltration of peripheral immune cells, and pathological tissue damage [25]. We also urge stress researchers to consider how observed neuro-immune changes compare to other model systems within and beyond that context. It is also worth considering if these changes are entirely detrimental, or if they might reflect an adaptive, or even beneficial (i.e., eustress) response to unstable conditions [222,223]. Distinction between pathological (inflammation) and adaptive (parainflammation) functions of neuro-immune interactions are necessary if we hope to one day leverage them for therapeutic purposes. To this end, technologies such as single-cell RNA-Seq and time-of-flight mass cytometry can lend important insights, as these approaches enables researchers to understand the heterogeneity of cellular populations and can identify molecular patterns to distinguish various functional states [73,224,225]. This is particularly relevant to tissue-resident macrophages, such as microglia, as they display a remarkable degree of functional plasticity [31]. Given these technical advances and appreciation for the spectrum of microglia function, we propose that it is time to shift the conceptual framework used to describe neuro-immune function in non-disease contexts, such as stress. Indeed, there is substantial evidence that neuro-immune interactions in chronic stress resemble parainflammation; an intermediate immune state where immune responses are directed toward reestablishing homeostasis [181]. In the end, this framework will enable researchers to more accurately describe the functional role of microglia in various contexts; and we are hopeful this leads to new therapeutic strategies involving microglia. **Availability of data and materials** Not applicable. **Abbreviations** Adenosine A1 receptor Adenosine diphosphate α-Amino-3-hydroxy-5-methyl-4-isoxazolepropionic acid Amyloid beta Adenosine triphosphate Blood–brain barrier Brain-derived neurotrophic factor Bone marrow C–C Motif Chemokine Receptor 2 Central nervous system Compliment receptor 3 Colony stimulating factor 1 Colony stimulating factor 1 receptor Chronic unpredictable stress C-X3-C motif chemokine ligand 1 C-X3-C motif chemokine receptor 1 C-X-C motif chemokine ligand 6 Dopamine 1 receptor Dorsal lateral geniculate nucleus Experimental autoimmune encephalomyelitis Enhanced green fluorescent protein Hypothalamo–pituitary–adrenocortical Interferon gamma Interleukin 1 beta Interleukin 10 IL-1 receptor antagonist Interleukin 6 Interleukin 33 Lipopolysaccharide Long-term potentiation Major depressive disorder Miniature excitatory postsynaptic current Major histocompatibility complex Mouse hepatitis virus Multiple sclerosis N-Methyl-D-aspartate Periaqueductal gray Positron emission tomography Prefrontal cortex Poly-IC: Polyinosinic:polycytidylic acid Purinergic receptor P2Y, G-protein coupled, 12 Retinal ganglion cells Reactive oxygen species Repeated social defeat Triggering receptor expressed on myeloid cells 2 Translocator protein Tumor necrosis factor alpha Ubiquitin C **References** Boullerne AI, Feinstein DL. History of Neuroscience I. Pío del Río-Hortega (1882–1945): the discoverer of microglia and oligodendroglia. ASN Neuro. 2020.https://doi.org/10.1177/1759091420953259.ArticlePubMedPubMed CentralGoogle Scholar Boullerne AI, Feinstein DL. History of Neuroscience I. Pío del Río-Hortega (1882–1945): the discoverer of microglia and oligodendroglia. ASN Neuro. 2020.https://doi.org/10.1177/1759091420953259. ArticlePubMedPubMed CentralGoogle Scholar Boullerne AI, Feinstein DL. History of Neuroscience I. Pío del Río-Hortega (1882–1945): the discoverer of microglia and oligodendroglia. ASN Neuro. 2020.https://doi.org/10.1177/1759091420953259. ArticlePubMedPubMed CentralGoogle Scholar del Río-Hortega BJ. Pío del Río-Hortega: the revolution of Glia. Anat Rec. 2020;303:1232–41.ArticleGoogle Scholar del Río-Hortega BJ. Pío del Río-Hortega: the revolution of Glia. Anat Rec. 2020;303:1232–41. ArticleGoogle Scholar del Río-Hortega BJ. Pío del Río-Hortega: the revolution of Glia. Anat Rec. 2020;303:1232–41. ArticleGoogle Scholar Prinz M, Jung S, Priller J. Microglia biology: one century of evolving concepts. Cell. 2019;179:292–311.https://doi.org/10.1016/j.cell.2019.08.053.ArticlePubMedCASGoogle Scholar Prinz M, Jung S, Priller J. Microglia biology: one century of evolving concepts. Cell. 2019;179:292–311.https://doi.org/10.1016/j.cell.2019.08.053. ArticlePubMedCASGoogle Scholar Prinz M, Jung S, Priller J. Microglia biology: one century of evolving concepts. Cell. 2019;179:292–311.https://doi.org/10.1016/j.cell.2019.08.053. ArticlePubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VII. Distribution of “brain macrophages” in brains of neonatal and adult rats, as determined by means of immunohistochemistry. Cell Tissue Res. 1983;229:85–95.PubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VII. Distribution of “brain macrophages” in brains of neonatal and adult rats, as determined by means of immunohistochemistry. Cell Tissue Res. 1983;229:85–95. PubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VII. Distribution of “brain macrophages” in brains of neonatal and adult rats, as determined by means of immunohistochemistry. Cell Tissue Res. 1983;229:85–95. PubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VI. Postnatal development of microglial cells. Cell Tissue Res. 1982;225:469–85.ArticlePubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VI. Postnatal development of microglial cells. Cell Tissue Res. 1982;225:469–85. ArticlePubMedCASGoogle Scholar Murabe Y, Sano Y. Morphological studies on neuroglia—VI. Postnatal development of microglial cells. Cell Tissue Res. 1982;225:469–85. ArticlePubMedCASGoogle Scholar Perry VH, Hume DA, Gordon S. Immunohistochemical localization of macrophages and microglia in the adult and developing mouse brain. Neuroscience. 1985;15:313–26.ArticlePubMedCASGoogle Scholar Perry VH, Hume DA, Gordon S. Immunohistochemical localization of macrophages and microglia in the adult and developing mouse brain. Neuroscience. 1985;15:313–26. ArticlePubMedCASGoogle Scholar Perry VH, Hume DA, Gordon S. Immunohistochemical localization of macrophages and microglia in the adult and developing mouse brain. Neuroscience. 1985;15:313–26. ArticlePubMedCASGoogle Scholar Hume DA, Perry VH, Gordon S. Immunohistochemical localization of a macrophage-specific antigen in developing mouse retina: Phagocytosis of dying neurons and differentiation in microglial cells to form a regular array in the plexiform layers. J Cell Biol. 1983;97:253–7.ArticlePubMedCASGoogle Scholar Hume DA, Perry VH, Gordon S. Immunohistochemical localization of a macrophage-specific antigen in developing mouse retina: Phagocytosis of dying neurons and differentiation in microglial cells to form a regular array in the plexiform layers. J Cell Biol. 1983;97:253–7. ArticlePubMedCASGoogle Scholar Hume DA, Perry VH, Gordon S. Immunohistochemical localization of a macrophage-specific antigen in developing mouse retina: Phagocytosis of dying neurons and differentiation in microglial cells to form a regular array in the plexiform layers. J Cell Biol. 1983;97:253–7. ArticlePubMedCASGoogle Scholar Cronk JC, Filiano AJ, Louveau A, Marin I, Marsh R, Ji E, et al. Peripherally derived macrophages can engraft the brain independent of irradiation and maintain an identity distinct from microglia. J Exp Med. 2018;215:1627–47.ArticlePubMedPubMed CentralCASGoogle Scholar Cronk JC, Filiano AJ, Louveau A, Marin I, Marsh R, Ji E, et al. Peripherally derived macrophages can engraft the brain independent of irradiation and maintain an identity distinct from microglia. J Exp Med. 2018;215:1627–47. ArticlePubMedPubMed CentralCASGoogle Scholar Cronk JC, Filiano AJ, Louveau A, Marin I, Marsh R, Ji E, et al. Peripherally derived macrophages can engraft the brain independent of irradiation and maintain an identity distinct from microglia. J Exp Med. 2018;215:1627–47. ArticlePubMedPubMed CentralCASGoogle Scholar Gosselin D, Skola D, Coufal NG, Holtman IR, Schlachetzki JCM, Sajti E, et al. An environment-dependent transcriptional network specifies human microglia identity. Science. 2017;356:1248–59.ArticleCASGoogle Scholar Gosselin D, Skola D, Coufal NG, Holtman IR, Schlachetzki JCM, Sajti E, et al. An environment-dependent transcriptional network specifies human microglia identity. Science. 2017;356:1248–59. ArticleCASGoogle Scholar Gosselin D, Skola D, Coufal NG, Holtman IR, Schlachetzki JCM, Sajti E, et al. An environment-dependent transcriptional network specifies human microglia identity. Science. 2017;356:1248–59. ArticleCASGoogle Scholar Alliot F, Godin I, Pessac B. Microglia derive from progenitors, originating from the yolk sac, and which proliferate in the brain. Dev Brain Res. 1999;117:145–52.ArticleCASGoogle Scholar Alliot F, Godin I, Pessac B. Microglia derive from progenitors, originating from the yolk sac, and which proliferate in the brain. Dev Brain Res. 1999;117:145–52. ArticleCASGoogle Scholar Alliot F, Godin I, Pessac B. Microglia derive from progenitors, originating from the yolk sac, and which proliferate in the brain. Dev Brain Res. 1999;117:145–52. ArticleCASGoogle Scholar Alliot F, Lecain E, Grima B, Pessac B. Microglial progenitors with a high proliferative potential in the embryonic and adult mouse brain. Proc Natl Acad Sci U S A. 1991;88:1541–5.ArticlePubMedPubMed CentralCASGoogle Scholar Alliot F, Lecain E, Grima B, Pessac B. Microglial progenitors with a high proliferative potential in the embryonic and adult mouse brain. Proc Natl Acad Sci U S A. 1991;88:1541–5. ArticlePubMedPubMed CentralCASGoogle Scholar Alliot F, Lecain E, Grima B, Pessac B. Microglial progenitors with a high proliferative potential in the embryonic and adult mouse brain. Proc Natl Acad Sci U S A. 1991;88:1541–5. ArticlePubMedPubMed CentralCASGoogle Scholar Ginhoux F, Greter M, Leboeuf M, Nandi S, See P, Gokhan S, et al. Fate mapping analysis reveals that adult microglia derive from primitive macrophages. Science. 2010;701:841–5.ArticleGoogle Scholar Ginhoux F, Greter M, Leboeuf M, Nandi S, See P, Gokhan S, et al. Fate mapping analysis reveals that adult microglia derive from primitive macrophages. Science. 2010;701:841–5. ArticleGoogle Scholar Ginhoux F, Greter M, Leboeuf M, Nandi S, See P, Gokhan S, et al. Fate mapping analysis reveals that adult microglia derive from primitive macrophages. Science. 2010;701:841–5. ArticleGoogle Scholar Schulz C, Perdiguero EG, Chorro L, Szabo-Rogers H, Cagnard N, Kierdorf K, et al. A lineage of myeloid cells independent of myb and hematopoietic stem cells. Science. 2012;335:86–90.ArticleGoogle Scholar Schulz C, Perdiguero EG, Chorro L, Szabo-Rogers H, Cagnard N, Kierdorf K, et al. A lineage of myeloid cells independent of myb and hematopoietic stem cells. Science. 2012;335:86–90. ArticleGoogle Scholar Schulz C, Perdiguero EG, Chorro L, Szabo-Rogers H, Cagnard N, Kierdorf K, et al. A lineage of myeloid cells independent of myb and hematopoietic stem cells. Science. 2012;335:86–90. ArticleGoogle Scholar Geissmann F, Auffray C, Palframan R, Wirrig C, Ciocca A, Campisi L, et al. Blood monocytes: distinct subsets, how they relate to dendritic cells, and their possible roles in the regulation of T-cell responses. Immunol Cell Biol. 2008;86:398–408.ArticlePubMedCASGoogle Scholar Geissmann F, Auffray C, Palframan R, Wirrig C, Ciocca A, Campisi L, et al. Blood monocytes: distinct subsets, how they relate to dendritic cells, and their possible roles in the regulation of T-cell responses. Immunol Cell Biol. 2008;86:398–408. ArticlePubMedCASGoogle Scholar Geissmann F, Auffray C, Palframan R, Wirrig C, Ciocca A, Campisi L, et al. Blood monocytes: distinct subsets, how they relate to dendritic cells, and their possible roles in the regulation of T-cell responses. Immunol Cell Biol. 2008;86:398–408. ArticlePubMedCASGoogle Scholar Kierdorf K, Erny D, Goldmann T, Sander V, Schulz C, Perdiguero EG, et al. Microglia emerge from erythromyeloid precursors via Pu.1-and Irf8-dependent pathways. Nat Neurosci. 2013;16:273–80.ArticlePubMedCASGoogle Scholar Kierdorf K, Erny D, Goldmann T, Sander V, Schulz C, Perdiguero EG, et al. Microglia emerge from erythromyeloid precursors via Pu.1-and Irf8-dependent pathways. Nat Neurosci. 2013;16:273–80. ArticlePubMedCASGoogle Scholar Kierdorf K, Erny D, Goldmann T, Sander V, Schulz C, Perdiguero EG, et al. Microglia emerge from erythromyeloid precursors via Pu.1-and Irf8-dependent pathways. Nat Neurosci. 2013;16:273–80. ArticlePubMedCASGoogle Scholar Eyo UB, Peng J, Murugan M, Mo M, Lalani A, Xie P, et al. Regulation of physical microglia—neuron interactions by fractalkine signaling after status epilepticus. eNeuro. 2016;3:1–14.ArticleGoogle Scholar Eyo UB, Peng J, Murugan M, Mo M, Lalani A, Xie P, et al. Regulation of physical microglia—neuron interactions by fractalkine signaling after status epilepticus. eNeuro. 2016;3:1–14. ArticleGoogle Scholar Eyo UB, Peng J, Murugan M, Mo M, Lalani A, Xie P, et al. Regulation of physical microglia—neuron interactions by fractalkine signaling after status epilepticus. eNeuro. 2016;3:1–14. ArticleGoogle Scholar Cserep C, Posfai B, Lenart N, Fekete R, Laszlo ZI, Lele Z, et al. Microglia monitor and protect neuronal function via specialized somatic purinergic junctions. Science. 2019;127:3201.Google Scholar Cserep C, Posfai B, Lenart N, Fekete R, Laszlo ZI, Lele Z, et al. Microglia monitor and protect neuronal function via specialized somatic purinergic junctions. Science. 2019;127:3201. Google Scholar Cserep C, Posfai B, Lenart N, Fekete R, Laszlo ZI, Lele Z, et al. Microglia monitor and protect neuronal function via specialized somatic purinergic junctions. Science. 2019;127:3201. Google Scholar Kato G, Inada H, Wake H, Akiyoshi R, Miyamoto A, Eto K, et al. Microglial contact prevents excess depolarization. eNeuro. 2016;3:1–9.ArticleCASGoogle Scholar Kato G, Inada H, Wake H, Akiyoshi R, Miyamoto A, Eto K, et al. Microglial contact prevents excess depolarization. eNeuro. 2016;3:1–9. ArticleCASGoogle Scholar Kato G, Inada H, Wake H, Akiyoshi R, Miyamoto A, Eto K, et al. Microglial contact prevents excess depolarization. eNeuro. 2016;3:1–9. ArticleCASGoogle Scholar Eyo UB, Peng J, Swiatkowski P, Mukherjee A, Bispo A, Wu LJ. Neuronal hyperactivity recruits microglial processes via neuronal NMDA receptors and microglial P2Y12 receptors after status epilepticus. J Neurosci. 2014;34:10528–40.ArticlePubMedPubMed CentralGoogle Scholar Eyo UB, Peng J, Swiatkowski P, Mukherjee A, Bispo A, Wu LJ. Neuronal hyperactivity recruits microglial processes via neuronal NMDA receptors and microglial P2Y12 receptors after status epilepticus. J Neurosci. 2014;34:10528–40. ArticlePubMedPubMed CentralGoogle Scholar Eyo UB, Peng J, Swiatkowski P, Mukherjee A, Bispo A, Wu LJ. Neuronal hyperactivity recruits microglial processes via neuronal NMDA receptors and microglial P2Y12 receptors after status epilepticus. J Neurosci. 2014;34:10528–40. ArticlePubMedPubMed CentralGoogle Scholar Parkhurst CN, Yang G, Ninan I, Savas JN, Yates Iii JR, Lafaille JJ, et al. Microglia promote learning-dependent synapse formation through brain-derived neurotrophic factor (+ SI). Cell. 2013;155:1596–609.ArticlePubMedPubMed CentralCASGoogle Scholar Parkhurst CN, Yang G, Ninan I, Savas JN, Yates Iii JR, Lafaille JJ, et al. Microglia promote learning-dependent synapse formation through brain-derived neurotrophic factor (+ SI). Cell. 2013;155:1596–609. ArticlePubMedPubMed CentralCASGoogle Scholar Parkhurst CN, Yang G, Ninan I, Savas JN, Yates Iii JR, Lafaille JJ, et al. Microglia promote learning-dependent synapse formation through brain-derived neurotrophic factor (+ SI). Cell. 2013;155:1596–609. ArticlePubMedPubMed CentralCASGoogle Scholar Kana V, Desland FA, Casanova-Acebes M, Ayata P, Badimon A, Nabel E, et al. CSF-1 controls cerebellar microglia and is required for motor function and social interaction. J Exp Med. 2019;216:2265–81.ArticlePubMedPubMed CentralCASGoogle Scholar Kana V, Desland FA, Casanova-Acebes M, Ayata P, Badimon A, Nabel E, et al. CSF-1 controls cerebellar microglia and is required for motor function and social interaction. J Exp Med. 2019;216:2265–81. ArticlePubMedPubMed CentralCASGoogle Scholar Kana V, Desland FA, Casanova-Acebes M, Ayata P, Badimon A, Nabel E, et al. CSF-1 controls cerebellar microglia and is required for motor function and social interaction. J Exp Med. 2019;216:2265–81. ArticlePubMedPubMed CentralCASGoogle Scholar Kim HJ, Cho MH, Shim WH, Kim JK, Jeon EY, Kim DH, et al. Deficient autophagy in microglia impairs synaptic pruning and causes social behavioral defects. Mol Psychiatry. 2017;22:1576–84.https://doi.org/10.1038/mp.2016.103.ArticlePubMedCASGoogle Scholar Kim HJ, Cho MH, Shim WH, Kim JK, Jeon EY, Kim DH, et al. Deficient autophagy in microglia impairs synaptic pruning and causes social behavioral defects. Mol Psychiatry. 2017;22:1576–84.https://doi.org/10.1038/mp.2016.103. ArticlePubMedCASGoogle Scholar Kim HJ, Cho MH, Shim WH, Kim JK, Jeon EY, Kim DH, et al. Deficient autophagy in microglia impairs synaptic pruning and causes social behavioral defects. Mol Psychiatry. 2017;22:1576–84.https://doi.org/10.1038/mp.2016.103. ArticlePubMedCASGoogle Scholar VanRyzin JW, Marquardt AE, Argue KJ, Vecchiarelli HA, Ashton SE, Arambula SE, et al. Microglial phagocytosis of newborn cells is induced by endocannabinoids and sculpts sex differences in juvenile rat social play. Neuron. 2019;102:435-449.e6.https://doi.org/10.1016/j.neuron.2019.02.006.ArticlePubMedPubMed CentralCASGoogle Scholar VanRyzin JW, Marquardt AE, Argue KJ, Vecchiarelli HA, Ashton SE, Arambula SE, et al. Microglial phagocytosis of newborn cells is induced by endocannabinoids and sculpts sex differences in juvenile rat social play. Neuron. 2019;102:435-449.e6.https://doi.org/10.1016/j.neuron.2019.02.006. ArticlePubMedPubMed CentralCASGoogle Scholar VanRyzin JW, Marquardt AE, Argue KJ, Vecchiarelli HA, Ashton SE, Arambula SE, et al. Microglial phagocytosis of newborn cells is induced by endocannabinoids and sculpts sex differences in juvenile rat social play. Neuron. 2019;102:435-449.e6.https://doi.org/10.1016/j.neuron.2019.02.006. ArticlePubMedPubMed CentralCASGoogle Scholar Zhan Y, Paolicelli RC, Sforazzini F, Weinhard L, Bolasco G, Pagani F, et al. Deficient neuron-microglia signaling results in impaired functional brain connectivity and social behavior. Nat Neurosci. 2014;17:400–6.https://doi.org/10.1038/nn.3641.ArticlePubMedCASGoogle Scholar Zhan Y, Paolicelli RC, Sforazzini F, Weinhard L, Bolasco G, Pagani F, et al. Deficient neuron-microglia signaling results in impaired functional brain connectivity and social behavior. Nat Neurosci. 2014;17:400–6.https://doi.org/10.1038/nn.3641. ArticlePubMedCASGoogle Scholar Zhan Y, Paolicelli RC, Sforazzini F, Weinhard L, Bolasco G, Pagani F, et al. Deficient neuron-microglia signaling results in impaired functional brain connectivity and social behavior. Nat Neurosci. 2014;17:400–6.https://doi.org/10.1038/nn.3641. ArticlePubMedCASGoogle Scholar Estes ML, McAllister AK. Alterations in immune cells and mediators in the brain: It’s Not always neuroinflammation! Brain Pathol. 2014;24:623–30.ArticlePubMedPubMed CentralCASGoogle Scholar Estes ML, McAllister AK. Alterations in immune cells and mediators in the brain: It’s Not always neuroinflammation! Brain Pathol. 2014;24:623–30. ArticlePubMedPubMed CentralCASGoogle Scholar Estes ML, McAllister AK. Alterations in immune cells and mediators in the brain: It’s Not always neuroinflammation! Brain Pathol. 2014;24:623–30. ArticlePubMedPubMed CentralCASGoogle Scholar Tremblay MÈ, Stevens B, Sierra A, Wake H, Bessis A, Nimmerjahn A. The role of microglia in the healthy brain. J Neurosci. 2011;31:16064–9.ArticlePubMedPubMed CentralCASGoogle Scholar Tremblay MÈ, Stevens B, Sierra A, Wake H, Bessis A, Nimmerjahn A. The role of microglia in the healthy brain. J Neurosci. 2011;31:16064–9. ArticlePubMedPubMed CentralCASGoogle Scholar Tremblay MÈ, Stevens B, Sierra A, Wake H, Bessis A, Nimmerjahn A. The role of microglia in the healthy brain. J Neurosci. 2011;31:16064–9. ArticlePubMedPubMed CentralCASGoogle Scholar O’Callaghan JP, Sriram K, Miller DB. Defining “neuroinflammation”: Lessons from MPTP- and methamphetamine-induced neurotoxicity. Ann N Y Acad Sci. 2008;1139:318–30.ArticlePubMedGoogle Scholar O’Callaghan JP, Sriram K, Miller DB. Defining “neuroinflammation”: Lessons from MPTP- and methamphetamine-induced neurotoxicity. Ann N Y Acad Sci. 2008;1139:318–30. ArticlePubMedGoogle Scholar O’Callaghan JP, Sriram K, Miller DB. Defining “neuroinflammation”: Lessons from MPTP- and methamphetamine-induced neurotoxicity. Ann N Y Acad Sci. 2008;1139:318–30. ArticlePubMedGoogle Scholar Prinz M, Mildner A. Microglia in the CNS: Immigrants from another world. Glia. 2011;59:177–87.ArticlePubMedGoogle Scholar Prinz M, Mildner A. Microglia in the CNS: Immigrants from another world. Glia. 2011;59:177–87. ArticlePubMedGoogle Scholar Prinz M, Mildner A. Microglia in the CNS: Immigrants from another world. Glia. 2011;59:177–87. ArticlePubMedGoogle Scholar Prinz M, Priller J. The role of peripheral immune cells in the CNS in steady state and disease. Nat Neurosci. 2017;20:136–44.ArticlePubMedCASGoogle Scholar Prinz M, Priller J. The role of peripheral immune cells in the CNS in steady state and disease. Nat Neurosci. 2017;20:136–44. ArticlePubMedCASGoogle Scholar Prinz M, Priller J. The role of peripheral immune cells in the CNS in steady state and disease. Nat Neurosci. 2017;20:136–44. ArticlePubMedCASGoogle Scholar Ransohoff RM. A polarizing question: do M1 and M2 microglia exist? Nat Neurosci. 2016;19:987–91.ArticlePubMedCASGoogle Scholar Ransohoff RM. A polarizing question: do M1 and M2 microglia exist? Nat Neurosci. 2016;19:987–91. ArticlePubMedCASGoogle Scholar Ransohoff RM. A polarizing question: do M1 and M2 microglia exist? Nat Neurosci. 2016;19:987–91. ArticlePubMedCASGoogle Scholar Stout RD, Suttles J. Functional plasticity of macrophages: reversible adaptation to changing microenvironments. J Leukoc Biol. 2004;76:509–13.ArticlePubMedCASGoogle Scholar Stout RD, Suttles J. Functional plasticity of macrophages: reversible adaptation to changing microenvironments. J Leukoc Biol. 2004;76:509–13. ArticlePubMedCASGoogle Scholar Stout RD, Suttles J. Functional plasticity of macrophages: reversible adaptation to changing microenvironments. J Leukoc Biol. 2004;76:509–13. ArticlePubMedCASGoogle Scholar Martinez FO, Gordon S. The M1 and M2 paradigm of macrophage activation: Time for reassessment. F1000Prime Rep. 2014;6:1–13.ArticleGoogle Scholar Martinez FO, Gordon S. The M1 and M2 paradigm of macrophage activation: Time for reassessment. F1000Prime Rep. 2014;6:1–13. ArticleGoogle Scholar Martinez FO, Gordon S. The M1 and M2 paradigm of macrophage activation: Time for reassessment. F1000Prime Rep. 2014;6:1–13. ArticleGoogle Scholar Murray PJ, Allen JE, Biswas SK, Fisher EA, Gilroy DW, Goerdt S, et al. Macrophage activation and polarization: nomenclature and experimental guidelines. Immunity. 2014;41:14–20.https://doi.org/10.1016/j.immuni.2014.06.008.ArticlePubMedPubMed CentralCASGoogle Scholar Murray PJ, Allen JE, Biswas SK, Fisher EA, Gilroy DW, Goerdt S, et al. Macrophage activation and polarization: nomenclature and experimental guidelines. Immunity. 2014;41:14–20.https://doi.org/10.1016/j.immuni.2014.06.008. ArticlePubMedPubMed CentralCASGoogle Scholar Murray PJ, Allen JE, Biswas SK, Fisher EA, Gilroy DW, Goerdt S, et al. Macrophage activation and polarization: nomenclature and experimental guidelines. Immunity. 2014;41:14–20.https://doi.org/10.1016/j.immuni.2014.06.008. ArticlePubMedPubMed CentralCASGoogle Scholar Kierdorf K, Prinz M. Factors regulating microglia activation. Front Cell Neurosci. 2013;7:1–8.ArticleGoogle Scholar Kierdorf K, Prinz M. Factors regulating microglia activation. Front Cell Neurosci. 2013;7:1–8. ArticleGoogle Scholar Kierdorf K, Prinz M. Factors regulating microglia activation. Front Cell Neurosci. 2013;7:1–8. ArticleGoogle Scholar Ransohoff RM, Perry VH. Microglial physiology: unique stimuli, specialized responses. Annu Rev Immunol. 2009;27:119–45.https://doi.org/10.1146/annurev.immunol.021908.132528.ArticlePubMedCASGoogle Scholar Ransohoff RM, Perry VH. Microglial physiology: unique stimuli, specialized responses. Annu Rev Immunol. 2009;27:119–45.https://doi.org/10.1146/annurev.immunol.021908.132528. ArticlePubMedCASGoogle Scholar Ransohoff RM, Perry VH. Microglial physiology: unique stimuli, specialized responses. Annu Rev Immunol. 2009;27:119–45.https://doi.org/10.1146/annurev.immunol.021908.132528. ArticlePubMedCASGoogle Scholar Stence N, Waite M, Dailey ME. Dynamics of microglial activation: a confocal time-lapse analysis in hippocampal slices. Glia. 2001;33:256–66.ArticleCASPubMedGoogle Scholar Stence N, Waite M, Dailey ME. Dynamics of microglial activation: a confocal time-lapse analysis in hippocampal slices. Glia. 2001;33:256–66. ArticleCASPubMedGoogle Scholar Stence N, Waite M, Dailey ME. Dynamics of microglial activation: a confocal time-lapse analysis in hippocampal slices. Glia. 2001;33:256–66. ArticleCASPubMedGoogle Scholar Jurga AM, Paleczna M, Kuter KZ. Overview of general and discriminating markers of differential microglia phenotypes. Front Cell Neurosci. 2020;14:1–18.ArticleGoogle Scholar Jurga AM, Paleczna M, Kuter KZ. Overview of general and discriminating markers of differential microglia phenotypes. Front Cell Neurosci. 2020;14:1–18. ArticleGoogle Scholar Jurga AM, Paleczna M, Kuter KZ. Overview of general and discriminating markers of differential microglia phenotypes. Front Cell Neurosci. 2020;14:1–18. ArticleGoogle Scholar Bollinger JL, Wohleb ES. The formative role of microglia in stress-induced synaptic deficits and associated behavioral consequences. Neurosci Lett. 2019;711: 134369.https://doi.org/10.1016/j.neulet.2019.134369.ArticlePubMedCASGoogle Scholar Bollinger JL, Wohleb ES. The formative role of microglia in stress-induced synaptic deficits and associated behavioral consequences. Neurosci Lett. 2019;711: 134369.https://doi.org/10.1016/j.neulet.2019.134369. ArticlePubMedCASGoogle Scholar Bollinger JL, Wohleb ES. The formative role of microglia in stress-induced synaptic deficits and associated behavioral consequences. Neurosci Lett. 2019;711: 134369.https://doi.org/10.1016/j.neulet.2019.134369. ArticlePubMedCASGoogle Scholar Wohleb ES, Franklin T, Iwata M, Duman RS. Integrating neuroimmune systems in the neurobiology of depression. Nat Rev Neurosci. 2016;17:497–511.https://doi.org/10.1038/nrn.2016.69.ArticlePubMedCASGoogle Scholar Wohleb ES, Franklin T, Iwata M, Duman RS. Integrating neuroimmune systems in the neurobiology of depression. Nat Rev Neurosci. 2016;17:497–511.https://doi.org/10.1038/nrn.2016.69. ArticlePubMedCASGoogle Scholar Wohleb ES, Franklin T, Iwata M, Duman RS. Integrating neuroimmune systems in the neurobiology of depression. Nat Rev Neurosci. 2016;17:497–511.https://doi.org/10.1038/nrn.2016.69. ArticlePubMedCASGoogle Scholar Denes A, Thornton P, Rothwell NJ, Allan SM. Inflammation and brain injury: acute cerebral ischaemia, peripheral and central inflammation. Brain Behav Immun. 2010;24:708–23.https://doi.org/10.1016/j.bbi.2009.09.010.ArticlePubMedCASGoogle Scholar Denes A, Thornton P, Rothwell NJ, Allan SM. Inflammation and brain injury: acute cerebral ischaemia, peripheral and central inflammation. Brain Behav Immun. 2010;24:708–23.https://doi.org/10.1016/j.bbi.2009.09.010. ArticlePubMedCASGoogle Scholar Denes A, Thornton P, Rothwell NJ, Allan SM. Inflammation and brain injury: acute cerebral ischaemia, peripheral and central inflammation. Brain Behav Immun. 2010;24:708–23.https://doi.org/10.1016/j.bbi.2009.09.010. ArticlePubMedCASGoogle Scholar DiSabato DJ, Quan N, Godbout JP. Neuroinflammation: the devil is in the details. J Neurochem. 2016;139:136–53.ArticlePubMedPubMed CentralCASGoogle Scholar DiSabato DJ, Quan N, Godbout JP. Neuroinflammation: the devil is in the details. J Neurochem. 2016;139:136–53. ArticlePubMedPubMed CentralCASGoogle Scholar DiSabato DJ, Quan N, Godbout JP. Neuroinflammation: the devil is in the details. J Neurochem. 2016;139:136–53. ArticlePubMedPubMed CentralCASGoogle Scholar Zrzavy T, Hametner S, Wimmer I, Butovsky O, Weiner HL, Lassmann H. Loss of “homeostatic” microglia and patterns of their activation in active multiple sclerosis. Brain. 2017;140:1900–13.ArticlePubMedPubMed CentralGoogle Scholar Zrzavy T, Hametner S, Wimmer I, Butovsky O, Weiner HL, Lassmann H. Loss of “homeostatic” microglia and patterns of their activation in active multiple sclerosis. Brain. 2017;140:1900–13. ArticlePubMedPubMed CentralGoogle Scholar Zrzavy T, Hametner S, Wimmer I, Butovsky O, Weiner HL, Lassmann H. Loss of “homeostatic” microglia and patterns of their activation in active multiple sclerosis. Brain. 2017;140:1900–13. ArticlePubMedPubMed CentralGoogle Scholar Guerrero BL, Sicotte NL. Microglia in multiple sclerosis: friend or foe? Front Immunol. 2020;11:1–8.ArticleGoogle Scholar Guerrero BL, Sicotte NL. Microglia in multiple sclerosis: friend or foe? Front Immunol. 2020;11:1–8. ArticleGoogle Scholar Guerrero BL, Sicotte NL. Microglia in multiple sclerosis: friend or foe? Front Immunol. 2020;11:1–8. ArticleGoogle Scholar Wheeler DL, Sariol A, Meyerholz DK, Perlman S. Microglia are required for protection against lethal coronavirus encephalitis in mice. J Clin Invest. 2018;128:931–43.ArticlePubMedPubMed CentralGoogle Scholar Wheeler DL, Sariol A, Meyerholz DK, Perlman S. Microglia are required for protection against lethal coronavirus encephalitis in mice. J Clin Invest. 2018;128:931–43. ArticlePubMedPubMed CentralGoogle Scholar Wheeler DL, Sariol A, Meyerholz DK, Perlman S. Microglia are required for protection against lethal coronavirus encephalitis in mice. J Clin Invest. 2018;128:931–43. ArticlePubMedPubMed CentralGoogle Scholar Savarin C, Dutta R, Bergmann CC. Distinct gene profiles of bone marrow-derived macrophages and microglia during neurotropic coronavirus-induced demyelination. Front Immunol. 2018.https://doi.org/10.3389/fimmu.2018.01325.ArticlePubMedPubMed CentralGoogle Scholar Savarin C, Dutta R, Bergmann CC. Distinct gene profiles of bone marrow-derived macrophages and microglia during neurotropic coronavirus-induced demyelination. Front Immunol. 2018.https://doi.org/10.3389/fimmu.2018.01325. ArticlePubMedPubMed CentralGoogle Scholar Savarin C, Dutta R, Bergmann CC. Distinct gene profiles of bone marrow-derived macrophages and microglia during neurotropic coronavirus-induced demyelination. Front Immunol. 2018.https://doi.org/10.3389/fimmu.2018.01325. ArticlePubMedPubMed CentralGoogle Scholar Hatton CF, Duncan CJA. Microglia Are Essential to Protective Antiviral Immunity: Lessons From Mouse Models of Viral Encephalitis. Front Immunol. 2019.https://doi.org/10.3389/fimmu.2019.02656.ArticlePubMedPubMed CentralGoogle Scholar Hatton CF, Duncan CJA. Microglia Are Essential to Protective Antiviral Immunity: Lessons From Mouse Models of Viral Encephalitis. Front Immunol. 2019.https://doi.org/10.3389/fimmu.2019.02656. ArticlePubMedPubMed CentralGoogle Scholar Hatton CF, Duncan CJA. Microglia Are Essential to Protective Antiviral Immunity: Lessons From Mouse Models of Viral Encephalitis. Front Immunol. 2019.https://doi.org/10.3389/fimmu.2019.02656. ArticlePubMedPubMed CentralGoogle Scholar Mangale V, Syage AR, Ekiz HA, Skinner DD, Cheng Y, Stone CL, et al. Microglia influence host defense, disease, and repair following murine coronavirus infection of the central nervous system. Glia. 2020;68:2345–60.PubMedGoogle Scholar Mangale V, Syage AR, Ekiz HA, Skinner DD, Cheng Y, Stone CL, et al. Microglia influence host defense, disease, and repair following murine coronavirus infection of the central nervous system. Glia. 2020;68:2345–60. PubMedGoogle Scholar Mangale V, Syage AR, Ekiz HA, Skinner DD, Cheng Y, Stone CL, et al. Microglia influence host defense, disease, and repair following murine coronavirus infection of the central nervous system. Glia. 2020;68:2345–60. PubMedGoogle Scholar Sarma JD, Burrows A, Rayman P, Hwang MH, Kundu S, Sharma N, et al. Ifit2 deficiency restricts microglial activation and leukocyte migration following murine coronavirus (m-CoV) CNS infection. PLoS Pathog. 2020;16:1–27.https://doi.org/10.1371/journal.ppat.1009034.ArticleCASGoogle Scholar Sarma JD, Burrows A, Rayman P, Hwang MH, Kundu S, Sharma N, et al. Ifit2 deficiency restricts microglial activation and leukocyte migration following murine coronavirus (m-CoV) CNS infection. PLoS Pathog. 2020;16:1–27.https://doi.org/10.1371/journal.ppat.1009034. ArticleCASGoogle Scholar Sarma JD, Burrows A, Rayman P, Hwang MH, Kundu S, Sharma N, et al. Ifit2 deficiency restricts microglial activation and leukocyte migration following murine coronavirus (m-CoV) CNS infection. PLoS Pathog. 2020;16:1–27.https://doi.org/10.1371/journal.ppat.1009034. ArticleCASGoogle Scholar Sariol A, Mackin S, Allred MG, Ma C, Zhou Y, Zhang Q, et al. Microglia depletion exacerbates demyelination and impairs remyelination in a neurotropic coronavirus infection. Proc Natl Acad Sci U S A. 2020;117:24464–74.ArticlePubMedPubMed CentralCASGoogle Scholar Sariol A, Mackin S, Allred MG, Ma C, Zhou Y, Zhang Q, et al. Microglia depletion exacerbates demyelination and impairs remyelination in a neurotropic coronavirus infection. Proc Natl Acad Sci U S A. 2020;117:24464–74. ArticlePubMedPubMed CentralCASGoogle Scholar Sariol A, Mackin S, Allred MG, Ma C, Zhou Y, Zhang Q, et al. Microglia depletion exacerbates demyelination and impairs remyelination in a neurotropic coronavirus infection. Proc Natl Acad Sci U S A. 2020;117:24464–74. ArticlePubMedPubMed CentralCASGoogle Scholar Wlodarczyk A, Benmamar-Badel A, Cédile O, Jensen KN, Kramer I, Elsborg NB, et al. CSF1R stimulation promotes increased neuroprotection by CD11c+ microglia in EAE. Front Cell Neurosci. 2019;12:1–10.ArticleGoogle Scholar Wlodarczyk A, Benmamar-Badel A, Cédile O, Jensen KN, Kramer I, Elsborg NB, et al. CSF1R stimulation promotes increased neuroprotection by CD11c+ microglia in EAE. Front Cell Neurosci. 2019;12:1–10. ArticleGoogle Scholar Wlodarczyk A, Benmamar-Badel A, Cédile O, Jensen KN, Kramer I, Elsborg NB, et al. CSF1R stimulation promotes increased neuroprotection by CD11c+ microglia in EAE. Front Cell Neurosci. 2019;12:1–10. ArticleGoogle Scholar Nakajima K, Kohsaka S. Microglia: Neuroprotective and neurotrophic cells in the central nervous system. Curr Drug Targets Cardiovasc Haematol Disord. 2004;4:65–84.ArticlePubMedCASGoogle Scholar Nakajima K, Kohsaka S. Microglia: Neuroprotective and neurotrophic cells in the central nervous system. Curr Drug Targets Cardiovasc Haematol Disord. 2004;4:65–84. ArticlePubMedCASGoogle Scholar Nakajima K, Kohsaka S. Microglia: Neuroprotective and neurotrophic cells in the central nervous system. Curr Drug Targets Cardiovasc Haematol Disord. 2004;4:65–84. ArticlePubMedCASGoogle Scholar Chen AQ, Fang Z, Chen XL, Yang S, Zhou YF, Mao L, et al. Microglia-derived TNF-α mediates endothelial necroptosis aggravating blood brain–barrier disruption after ischemic stroke. Cell Death Dis. 2019.https://doi.org/10.1038/s41419-019-1716-9.ArticlePubMedPubMed CentralGoogle Scholar Chen AQ, Fang Z, Chen XL, Yang S, Zhou YF, Mao L, et al. Microglia-derived TNF-α mediates endothelial necroptosis aggravating blood brain–barrier disruption after ischemic stroke. Cell Death Dis. 2019.https://doi.org/10.1038/s41419-019-1716-9. ArticlePubMedPubMed CentralGoogle Scholar Chen AQ, Fang Z, Chen XL, Yang S, Zhou YF, Mao L, et al. Microglia-derived TNF-α mediates endothelial necroptosis aggravating blood brain–barrier disruption after ischemic stroke. Cell Death Dis. 2019.https://doi.org/10.1038/s41419-019-1716-9. ArticlePubMedPubMed CentralGoogle Scholar Ritzel RM, Patel AR, Grenier JM, Crapser J, Verma R, Jellison ER, et al. Functional differences between microglia and monocytes after ischemic stroke. J Neuroinflammation. 2015;12:1–12.https://doi.org/10.1186/s12974-015-0329-1.ArticleCASGoogle Scholar Ritzel RM, Patel AR, Grenier JM, Crapser J, Verma R, Jellison ER, et al. Functional differences between microglia and monocytes after ischemic stroke. J Neuroinflammation. 2015;12:1–12.https://doi.org/10.1186/s12974-015-0329-1. ArticleCASGoogle Scholar Ritzel RM, Patel AR, Grenier JM, Crapser J, Verma R, Jellison ER, et al. Functional differences between microglia and monocytes after ischemic stroke. J Neuroinflammation. 2015;12:1–12.https://doi.org/10.1186/s12974-015-0329-1. ArticleCASGoogle Scholar Zhang Y, Li H, Li X, Wu J, Xue T, Wu J, et al. TMEM16F aggravates neuronal loss by mediating microglial phagocytosis of neurons in a rat experimental cerebral ischemia and reperfusion model. Front Immunol. 2020;11:1–14.Google Scholar Zhang Y, Li H, Li X, Wu J, Xue T, Wu J, et al. TMEM16F aggravates neuronal loss by mediating microglial phagocytosis of neurons in a rat experimental cerebral ischemia and reperfusion model. Front Immunol. 2020;11:1–14. Google Scholar Zhang Y, Li H, Li X, Wu J, Xue T, Wu J, et al. TMEM16F aggravates neuronal loss by mediating microglial phagocytosis of neurons in a rat experimental cerebral ischemia and reperfusion model. Front Immunol. 2020;11:1–14. Google Scholar Yang J, Cao LL, Wang XP, Guo W, Guo RB, Sun YQ, et al. Neuronal extracellular vesicle derived miR-98 prevents salvageable neurons from microglial phagocytosis in acute ischemic stroke. Cell Death Dis. 2021.https://doi.org/10.1038/s41419-020-03310-2.ArticlePubMedPubMed CentralGoogle Scholar Yang J, Cao LL, Wang XP, Guo W, Guo RB, Sun YQ, et al. Neuronal extracellular vesicle derived miR-98 prevents salvageable neurons from microglial phagocytosis in acute ischemic stroke. Cell Death Dis. 2021.https://doi.org/10.1038/s41419-020-03310-2. ArticlePubMedPubMed CentralGoogle Scholar Yang J, Cao LL, Wang XP, Guo W, Guo RB, Sun YQ, et al. Neuronal extracellular vesicle derived miR-98 prevents salvageable neurons from microglial phagocytosis in acute ischemic stroke. Cell Death Dis. 2021.https://doi.org/10.1038/s41419-020-03310-2. ArticlePubMedPubMed CentralGoogle Scholar Neher JJ, Emmrich JV, Fricker M, Mander PK, Théry C, Brown GC. Phagocytosis executes delayed neuronal death after focal brain ischemia. Proc Natl Acad Sci U S A. 2013.https://doi.org/10.1073/pnas.1308679110.ArticlePubMedPubMed CentralGoogle Scholar Neher JJ, Emmrich JV, Fricker M, Mander PK, Théry C, Brown GC. Phagocytosis executes delayed neuronal death after focal brain ischemia. Proc Natl Acad Sci U S A. 2013.https://doi.org/10.1073/pnas.1308679110. ArticlePubMedPubMed CentralGoogle Scholar Neher JJ, Emmrich JV, Fricker M, Mander PK, Théry C, Brown GC. Phagocytosis executes delayed neuronal death after focal brain ischemia. Proc Natl Acad Sci U S A. 2013.https://doi.org/10.1073/pnas.1308679110. ArticlePubMedPubMed CentralGoogle Scholar Kawabori M, Kacimi R, Kauppinen T, Calosing C, Kim JY, Hsieh CL, et al. Triggering receptor expressed on myeloid cells 2 (TREM2) deficiency attenuates phagocytic activities of microglia and exacerbates ischemic damage in experimental stroke. J Neurosci. 2015;35:3384–96.ArticlePubMedPubMed CentralCASGoogle Scholar Kawabori M, Kacimi R, Kauppinen T, Calosing C, Kim JY, Hsieh CL, et al. Triggering receptor expressed on myeloid cells 2 (TREM2) deficiency attenuates phagocytic activities of microglia and exacerbates ischemic damage in experimental stroke. J Neurosci. 2015;35:3384–96. ArticlePubMedPubMed CentralCASGoogle Scholar Kawabori M, Kacimi R, Kauppinen T, Calosing C, Kim JY, Hsieh CL, et al. Triggering receptor expressed on myeloid cells 2 (TREM2) deficiency attenuates phagocytic activities of microglia and exacerbates ischemic damage in experimental stroke. J Neurosci. 2015;35:3384–96. ArticlePubMedPubMed CentralCASGoogle Scholar Haynes SE, Hollopeter G, Yang G, Kurpius D, Dailey ME, Gan WB, et al. The P2Y12 receptor regulates microglial activation by extracellular nucleotides. Nat Neurosci. 2006;9:1512–9.ArticlePubMedCASGoogle Scholar Haynes SE, Hollopeter G, Yang G, Kurpius D, Dailey ME, Gan WB, et al. The P2Y12 receptor regulates microglial activation by extracellular nucleotides. Nat Neurosci. 2006;9:1512–9. ArticlePubMedCASGoogle Scholar Haynes SE, Hollopeter G, Yang G, Kurpius D, Dailey ME, Gan WB, et al. The P2Y12 receptor regulates microglial activation by extracellular nucleotides. Nat Neurosci. 2006;9:1512–9. ArticlePubMedCASGoogle Scholar Swiatkowski P, Murugan M, Eyo UB, Wang Y, Rangaraju S, Oh SB, et al. Activation of microglial P2Y12 receptor is required for outward potassium currents in response to neuronal injury. Neuroscience. 2016;318:22–33.ArticlePubMedCASGoogle Scholar Swiatkowski P, Murugan M, Eyo UB, Wang Y, Rangaraju S, Oh SB, et al. Activation of microglial P2Y12 receptor is required for outward potassium currents in response to neuronal injury. Neuroscience. 2016;318:22–33. ArticlePubMedCASGoogle Scholar Swiatkowski P, Murugan M, Eyo UB, Wang Y, Rangaraju S, Oh SB, et al. Activation of microglial P2Y12 receptor is required for outward potassium currents in response to neuronal injury. Neuroscience. 2016;318:22–33. ArticlePubMedCASGoogle Scholar Patel AR, Ritzel R, McCullough LD, Liu F. Microglia and ischemic stroke: A double-edged sword. Int J Physiol Pathophysiol Pharmacol. 2013;5:73–90.PubMedPubMed CentralGoogle Scholar Patel AR, Ritzel R, McCullough LD, Liu F. Microglia and ischemic stroke: A double-edged sword. Int J Physiol Pathophysiol Pharmacol. 2013;5:73–90. PubMedPubMed CentralGoogle Scholar Patel AR, Ritzel R, McCullough LD, Liu F. Microglia and ischemic stroke: A double-edged sword. Int J Physiol Pathophysiol Pharmacol. 2013;5:73–90. PubMedPubMed CentralGoogle Scholar Bradshaw EM, Chibnik LB, Keenan BT, Ottoboni L, Raj T, Tang A, et al. CD33 Alzheimer’s disease locus: Altered monocyte function and amyloid biology. Nat Neurosci. 2013;16:848–50.ArticlePubMedPubMed CentralCASGoogle Scholar Bradshaw EM, Chibnik LB, Keenan BT, Ottoboni L, Raj T, Tang A, et al. CD33 Alzheimer’s disease locus: Altered monocyte function and amyloid biology. Nat Neurosci. 2013;16:848–50. ArticlePubMedPubMed CentralCASGoogle Scholar Bradshaw EM, Chibnik LB, Keenan BT, Ottoboni L, Raj T, Tang A, et al. CD33 Alzheimer’s disease locus: Altered monocyte function and amyloid biology. Nat Neurosci. 2013;16:848–50. ArticlePubMedPubMed CentralCASGoogle Scholar Guerreiro R, Wojtas A, Bras J, Carrasquillo M, Rogaeva E, Majounie E, et al. TREM2 Variants in Alzheimer’s Disease. N Engl J Med. 2013;368:117–27.ArticlePubMedCASGoogle Scholar Guerreiro R, Wojtas A, Bras J, Carrasquillo M, Rogaeva E, Majounie E, et al. TREM2 Variants in Alzheimer’s Disease. N Engl J Med. 2013;368:117–27. ArticlePubMedCASGoogle Scholar Guerreiro R, Wojtas A, Bras J, Carrasquillo M, Rogaeva E, Majounie E, et al. TREM2 Variants in Alzheimer’s Disease. N Engl J Med. 2013;368:117–27. ArticlePubMedCASGoogle Scholar Mathys H, Davila-Velderrain J, Peng Z, Gao F, Mohammadi S, Young JZ, et al. Single-cell transcriptomic analysis of Alzheimer’s disease. Nature. 2019;570:332–7.https://doi.org/10.1038/s41586-019-1195-2.ArticlePubMedPubMed CentralCASGoogle Scholar Mathys H, Davila-Velderrain J, Peng Z, Gao F, Mohammadi S, Young JZ, et al. Single-cell transcriptomic analysis of Alzheimer’s disease. Nature. 2019;570:332–7.https://doi.org/10.1038/s41586-019-1195-2. ArticlePubMedPubMed CentralCASGoogle Scholar Mathys H, Davila-Velderrain J, Peng Z, Gao F, Mohammadi S, Young JZ, et al. Single-cell transcriptomic analysis of Alzheimer’s disease. Nature. 2019;570:332–7.https://doi.org/10.1038/s41586-019-1195-2. ArticlePubMedPubMed CentralCASGoogle Scholar Olah M, Menon V, Habib N, Taga MF, Ma Y, Yung CJ, et al. Single cell RNA sequencing of human microglia uncovers a subset associated with Alzheimer’s disease. Nat Commun. 2020.https://doi.org/10.1038/s41467-020-19737-2.ArticlePubMedPubMed CentralGoogle Scholar Olah M, Menon V, Habib N, Taga MF, Ma Y, Yung CJ, et al. Single cell RNA sequencing of human microglia uncovers a subset associated with Alzheimer’s disease. Nat Commun. 2020.https://doi.org/10.1038/s41467-020-19737-2. ArticlePubMedPubMed CentralGoogle Scholar Olah M, Menon V, Habib N, Taga MF, Ma Y, Yung CJ, et al. Single cell RNA sequencing of human microglia uncovers a subset associated with Alzheimer’s disease. Nat Commun. 2020.https://doi.org/10.1038/s41467-020-19737-2. ArticlePubMedPubMed CentralGoogle Scholar Da Mesquita S, Papadopoulos Z, Dykstra T, Brase L, Farias FG, Wall M, et al. Meningeal lymphatics affect microglia responses and anti-Aβ immunotherapy. Nature. 2021;593:255–60.https://doi.org/10.1038/s41586-021-03489-0.ArticlePubMedCASPubMed CentralGoogle Scholar Da Mesquita S, Papadopoulos Z, Dykstra T, Brase L, Farias FG, Wall M, et al. Meningeal lymphatics affect microglia responses and anti-Aβ immunotherapy. Nature. 2021;593:255–60.https://doi.org/10.1038/s41586-021-03489-0. ArticlePubMedCASPubMed CentralGoogle Scholar Da Mesquita S, Papadopoulos Z, Dykstra T, Brase L, Farias FG, Wall M, et al. Meningeal lymphatics affect microglia responses and anti-Aβ immunotherapy. Nature. 2021;593:255–60.https://doi.org/10.1038/s41586-021-03489-0. ArticlePubMedCASPubMed CentralGoogle Scholar Zenaro E, Pietronigro E, Bianca VD, Piacentino G, Marongiu L, Budui S, et al. Neutrophils promote Alzheimer’s disease-like pathology and cognitive decline via LFA-1 integrin. Nat Med. 2015;21:880–6.ArticlePubMedCASGoogle Scholar Zenaro E, Pietronigro E, Bianca VD, Piacentino G, Marongiu L, Budui S, et al. Neutrophils promote Alzheimer’s disease-like pathology and cognitive decline via LFA-1 integrin. Nat Med. 2015;21:880–6. ArticlePubMedCASGoogle Scholar Zenaro E, Pietronigro E, Bianca VD, Piacentino G, Marongiu L, Budui S, et al. Neutrophils promote Alzheimer’s disease-like pathology and cognitive decline via LFA-1 integrin. Nat Med. 2015;21:880–6. ArticlePubMedCASGoogle Scholar Zilka N, Stozicka Z, Kovac A, Pilipcinec E, Bugos O, Novak M. Human misfolded truncated tau protein promotes activation of microglia and leukocyte infiltration in the transgenic rat model of tauopathy. J Neuroimmunol. 2009;209:16–25.https://doi.org/10.1016/j.jneuroim.2009.01.013.ArticlePubMedCASGoogle Scholar Zilka N, Stozicka Z, Kovac A, Pilipcinec E, Bugos O, Novak M. Human misfolded truncated tau protein promotes activation of microglia and leukocyte infiltration in the transgenic rat model of tauopathy. J Neuroimmunol. 2009;209:16–25.https://doi.org/10.1016/j.jneuroim.2009.01.013. ArticlePubMedCASGoogle Scholar Zilka N, Stozicka Z, Kovac A, Pilipcinec E, Bugos O, Novak M. Human misfolded truncated tau protein promotes activation of microglia and leukocyte infiltration in the transgenic rat model of tauopathy. J Neuroimmunol. 2009;209:16–25.https://doi.org/10.1016/j.jneuroim.2009.01.013. ArticlePubMedCASGoogle Scholar Togo T, Akiyama H, Iseki E, Kondo H, Ikeda K, Kato M, et al. Occurrence of T cells in the brain of Alzheimer’s disease and other neurological diseases. J Neuroimmunol. 2002;124:83–92.ArticlePubMedCASGoogle Scholar Togo T, Akiyama H, Iseki E, Kondo H, Ikeda K, Kato M, et al. Occurrence of T cells in the brain of Alzheimer’s disease and other neurological diseases. J Neuroimmunol. 2002;124:83–92. ArticlePubMedCASGoogle Scholar Togo T, Akiyama H, Iseki E, Kondo H, Ikeda K, Kato M, et al. Occurrence of T cells in the brain of Alzheimer’s disease and other neurological diseases. J Neuroimmunol. 2002;124:83–92. ArticlePubMedCASGoogle Scholar Hansen DV, Hanson JE, Sheng M. Microglia in Alzheimer ’ s disease. J Cell Biol. 2018;217:459–72.ArticlePubMedPubMed CentralCASGoogle Scholar Hansen DV, Hanson JE, Sheng M. Microglia in Alzheimer ’ s disease. J Cell Biol. 2018;217:459–72. ArticlePubMedPubMed CentralCASGoogle Scholar Hansen DV, Hanson JE, Sheng M. Microglia in Alzheimer ’ s disease. J Cell Biol. 2018;217:459–72. ArticlePubMedPubMed CentralCASGoogle Scholar Wang Y, Cella M, Mallinson K, Ulrich JD, Young KL, Robinette ML, et al. TREM2 lipid sensing sustains the microglial response in an Alzheimer’s disease model. Cell. 2015;160:1061–71.https://doi.org/10.1016/j.cell.2015.01.049.ArticlePubMedPubMed CentralCASGoogle Scholar Wang Y, Cella M, Mallinson K, Ulrich JD, Young KL, Robinette ML, et al. TREM2 lipid sensing sustains the microglial response in an Alzheimer’s disease model. Cell. 2015;160:1061–71.https://doi.org/10.1016/j.cell.2015.01.049. ArticlePubMedPubMed CentralCASGoogle Scholar Wang Y, Cella M, Mallinson K, Ulrich JD, Young KL, Robinette ML, et al. TREM2 lipid sensing sustains the microglial response in an Alzheimer’s disease model. Cell. 2015;160:1061–71.https://doi.org/10.1016/j.cell.2015.01.049. ArticlePubMedPubMed CentralCASGoogle Scholar Yuan P, Condello C, Keene CD, Wang Y, Bird TD, Paul SM, et al. TREM2 haplodeficiency in mice and humans impairs the microglia barrier function leading to decreased amyloid compaction and severe axonal dystrophy. Neuron. 2016;90:724–39.https://doi.org/10.1016/j.neuron.2016.05.003.ArticlePubMedPubMed CentralCASGoogle Scholar Yuan P, Condello C, Keene CD, Wang Y, Bird TD, Paul SM, et al. TREM2 haplodeficiency in mice and humans impairs the microglia barrier function leading to decreased amyloid compaction and severe axonal dystrophy. Neuron. 2016;90:724–39.https://doi.org/10.1016/j.neuron.2016.05.003. ArticlePubMedPubMed CentralCASGoogle Scholar Yuan P, Condello C, Keene CD, Wang Y, Bird TD, Paul SM, et al. TREM2 haplodeficiency in mice and humans impairs the microglia barrier function leading to decreased amyloid compaction and severe axonal dystrophy. Neuron. 2016;90:724–39.https://doi.org/10.1016/j.neuron.2016.05.003. ArticlePubMedPubMed CentralCASGoogle Scholar Wang S, Mustafa M, Yuede CM, Salazar SV, Kong P, Long H, et al. Anti-human TREM2 induces microglia proliferation and reduces pathology in an Alzheimer’s disease model. J Exp Med. 2020.https://doi.org/10.1084/jem.20200785.ArticlePubMedPubMed CentralGoogle Scholar Wang S, Mustafa M, Yuede CM, Salazar SV, Kong P, Long H, et al. Anti-human TREM2 induces microglia proliferation and reduces pathology in an Alzheimer’s disease model. J Exp Med. 2020.https://doi.org/10.1084/jem.20200785. ArticlePubMedPubMed CentralGoogle Scholar Wang S, Mustafa M, Yuede CM, Salazar SV, Kong P, Long H, et al. Anti-human TREM2 induces microglia proliferation and reduces pathology in an Alzheimer’s disease model. J Exp Med. 2020.https://doi.org/10.1084/jem.20200785. ArticlePubMedPubMed CentralGoogle Scholar Keren-Shaul H, Spinrad A, Weiner A, Matcovitch-Natan O, Dvir-Szternfeld R, Ulland TK, et al. A unique microglia type associated with restricting development of alzheimer’s disease. Cell. 2017.https://doi.org/10.1016/j.cell.2017.05.018.ArticlePubMedGoogle Scholar Keren-Shaul H, Spinrad A, Weiner A, Matcovitch-Natan O, Dvir-Szternfeld R, Ulland TK, et al. A unique microglia type associated with restricting development of alzheimer’s disease. Cell. 2017.https://doi.org/10.1016/j.cell.2017.05.018. ArticlePubMedGoogle Scholar Keren-Shaul H, Spinrad A, Weiner A, Matcovitch-Natan O, Dvir-Szternfeld R, Ulland TK, et al. A unique microglia type associated with restricting development of alzheimer’s disease. Cell. 2017.https://doi.org/10.1016/j.cell.2017.05.018. ArticlePubMedGoogle Scholar Rangaraju S, Dammer EB, Raza SA, Rathakrishnan P, Xiao H, Gao T, et al. Identification and therapeutic modulation of a pro-inflammatory subset of disease-associated-microglia in Alzheimer’s disease. Mol Neurodegener. 2018;13:1–25.ArticleGoogle Scholar Rangaraju S, Dammer EB, Raza SA, Rathakrishnan P, Xiao H, Gao T, et al. Identification and therapeutic modulation of a pro-inflammatory subset of disease-associated-microglia in Alzheimer’s disease. Mol Neurodegener. 2018;13:1–25. ArticleGoogle Scholar Rangaraju S, Dammer EB, Raza SA, Rathakrishnan P, Xiao H, Gao T, et al. Identification and therapeutic modulation of a pro-inflammatory subset of disease-associated-microglia in Alzheimer’s disease. Mol Neurodegener. 2018;13:1–25. ArticleGoogle Scholar Hopp S, Lin Y, Oakley D, Roe A, DeVos S, Hanlon D, et al. The role of microglia in processing and spreading of bioactive tau seeds in Alzheimer’s disease. J Neuroinflammation. 2018.https://doi.org/10.1186/s12974-018-1309-z.ArticlePubMedPubMed CentralGoogle Scholar Hopp S, Lin Y, Oakley D, Roe A, DeVos S, Hanlon D, et al. The role of microglia in processing and spreading of bioactive tau seeds in Alzheimer’s disease. J Neuroinflammation. 2018.https://doi.org/10.1186/s12974-018-1309-z. ArticlePubMedPubMed CentralGoogle Scholar Hopp S, Lin Y, Oakley D, Roe A, DeVos S, Hanlon D, et al. The role of microglia in processing and spreading of bioactive tau seeds in Alzheimer’s disease. J Neuroinflammation. 2018.https://doi.org/10.1186/s12974-018-1309-z. ArticlePubMedPubMed CentralGoogle Scholar Venegas C, Kumar S, Franklin BS, Dierkes T, Brinkschulte R, Tejera D, et al. Microglia-derived ASC specks cross-seed amyloid-β in Alzheimer’s disease. Nature. 2017;552:355–61.ArticlePubMedCASGoogle Scholar Venegas C, Kumar S, Franklin BS, Dierkes T, Brinkschulte R, Tejera D, et al. Microglia-derived ASC specks cross-seed amyloid-β in Alzheimer’s disease. Nature. 2017;552:355–61. ArticlePubMedCASGoogle Scholar Venegas C, Kumar S, Franklin BS, Dierkes T, Brinkschulte R, Tejera D, et al. Microglia-derived ASC specks cross-seed amyloid-β in Alzheimer’s disease. Nature. 2017;552:355–61. ArticlePubMedCASGoogle Scholar Rock RB, Gekker G, Hu S, Sheng WS, Cheeran M, Lokensgard JR, et al. Role of microglia in central nervous system infections. Clin Microbiol Rev. 2004;17:942–64.ArticlePubMedPubMed CentralCASGoogle Scholar Rock RB, Gekker G, Hu S, Sheng WS, Cheeran M, Lokensgard JR, et al. Role of microglia in central nervous system infections. Clin Microbiol Rev. 2004;17:942–64. ArticlePubMedPubMed CentralCASGoogle Scholar Rock RB, Gekker G, Hu S, Sheng WS, Cheeran M, Lokensgard JR, et al. Role of microglia in central nervous system infections. Clin Microbiol Rev. 2004;17:942–64. ArticlePubMedPubMed CentralCASGoogle Scholar Scheld WM, Koedel U, Nathan B, Pfister HW. Pathophysiology of bacterial meningitis: Mechanism(s) of neuronal injury. J Infect Dis. 2002;186:225–33.ArticleGoogle Scholar Scheld WM, Koedel U, Nathan B, Pfister HW. Pathophysiology of bacterial meningitis: Mechanism(s) of neuronal injury. J Infect Dis. 2002;186:225–33. ArticleGoogle Scholar Scheld WM, Koedel U, Nathan B, Pfister HW. Pathophysiology of bacterial meningitis: Mechanism(s) of neuronal injury. J Infect Dis. 2002;186:225–33. ArticleGoogle Scholar Hanisch UK, Prinz M, Angstwurm K, Husler KG, Kann O, Kettenmann H, et al. The protein tyrosine kinase inhibitor AG126 prevents the massive microglial cytokine induction by pneumococcal cell walls. Eur J Immunol. 2001;31:2104–15.ArticlePubMedCASGoogle Scholar Hanisch UK, Prinz M, Angstwurm K, Husler KG, Kann O, Kettenmann H, et al. The protein tyrosine kinase inhibitor AG126 prevents the massive microglial cytokine induction by pneumococcal cell walls. Eur J Immunol. 2001;31:2104–15. ArticlePubMedCASGoogle Scholar Hanisch UK, Prinz M, Angstwurm K, Husler KG, Kann O, Kettenmann H, et al. The protein tyrosine kinase inhibitor AG126 prevents the massive microglial cytokine induction by pneumococcal cell walls. Eur J Immunol. 2001;31:2104–15. ArticlePubMedCASGoogle Scholar Häusler KG, Prinz M, Nolte C, Weber JR, Schumann RR, Kettenmann H, et al. Interferon-γ differentially modulates the release of cytokines and chemokines in lipopolysaccharide- and pneumococcal cell wall-stimulated mouse microglia and macrophages. Eur J Neurosci. 2002;16:2113–22.ArticlePubMedGoogle Scholar Häusler KG, Prinz M, Nolte C, Weber JR, Schumann RR, Kettenmann H, et al. Interferon-γ differentially modulates the release of cytokines and chemokines in lipopolysaccharide- and pneumococcal cell wall-stimulated mouse microglia and macrophages. Eur J Neurosci. 2002;16:2113–22. ArticlePubMedGoogle Scholar Häusler KG, Prinz M, Nolte C, Weber JR, Schumann RR, Kettenmann H, et al. Interferon-γ differentially modulates the release of cytokines and chemokines in lipopolysaccharide- and pneumococcal cell wall-stimulated mouse microglia and macrophages. Eur J Neurosci. 2002;16:2113–22. ArticlePubMedGoogle Scholar Ring A, Weiser JN, Tuomanen EI. Pneumococcal trafficking across the blood-brain barrier molecular analysis of a novel bidirectional pathway. J Clin Invest. 1998;102:347–60.ArticlePubMedPubMed CentralCASGoogle Scholar Ring A, Weiser JN, Tuomanen EI. Pneumococcal trafficking across the blood-brain barrier molecular analysis of a novel bidirectional pathway. J Clin Invest. 1998;102:347–60. ArticlePubMedPubMed CentralCASGoogle Scholar Ring A, Weiser JN, Tuomanen EI. Pneumococcal trafficking across the blood-brain barrier molecular analysis of a novel bidirectional pathway. J Clin Invest. 1998;102:347–60. ArticlePubMedPubMed CentralCASGoogle Scholar Kim YS, Täuber MG. Neurotoxicity of glia activated by gram-positive bacterial products depends on nitric oxide production. Infect Immun. 1996;64:3148–53.ArticlePubMedPubMed CentralCASGoogle Scholar Kim YS, Täuber MG. Neurotoxicity of glia activated by gram-positive bacterial products depends on nitric oxide production. Infect Immun. 1996;64:3148–53. ArticlePubMedPubMed CentralCASGoogle Scholar Kim YS, Täuber MG. Neurotoxicity of glia activated by gram-positive bacterial products depends on nitric oxide production. Infect Immun. 1996;64:3148–53. ArticlePubMedPubMed CentralCASGoogle Scholar Skiest DJ. Focal neurological disease in patients with acquired immunodeficiency syndrome. Clin Infect Dis. 2002;34:103–15.ArticlePubMedGoogle Scholar Skiest DJ. Focal neurological disease in patients with acquired immunodeficiency syndrome. Clin Infect Dis. 2002;34:103–15. ArticlePubMedGoogle Scholar Skiest DJ. Focal neurological disease in patients with acquired immunodeficiency syndrome. Clin Infect Dis. 2002;34:103–15. ArticlePubMedGoogle Scholar Braun JS, Sublett JE, Freyer D, Mitchell TJ, Cleveland JL, Tuomanen EI, et al. Pneumococcal pneumolysin and H2O2 mediate brain cell apoptosis during meningitis. J Clin Invest. 2002;109:19–27.ArticlePubMedPubMed CentralCASGoogle Scholar Braun JS, Sublett JE, Freyer D, Mitchell TJ, Cleveland JL, Tuomanen EI, et al. Pneumococcal pneumolysin and H2O2 mediate brain cell apoptosis during meningitis. J Clin Invest. 2002;109:19–27. ArticlePubMedPubMed CentralCASGoogle Scholar Braun JS, Sublett JE, Freyer D, Mitchell TJ, Cleveland JL, Tuomanen EI, et al. Pneumococcal pneumolysin and H2O2 mediate brain cell apoptosis during meningitis. J Clin Invest. 2002;109:19–27. ArticlePubMedPubMed CentralCASGoogle Scholar Schiltz JC, Sawchenko PE. Distinct brain vascular cell types manifest inducible cyclooxygenase expression as a function of the strength and nature of immune insults. J Neurosci. 2002;22:5606–18.ArticlePubMedPubMed CentralCASGoogle Scholar Schiltz JC, Sawchenko PE. Distinct brain vascular cell types manifest inducible cyclooxygenase expression as a function of the strength and nature of immune insults. J Neurosci. 2002;22:5606–18. ArticlePubMedPubMed CentralCASGoogle Scholar Schiltz JC, Sawchenko PE. Distinct brain vascular cell types manifest inducible cyclooxygenase expression as a function of the strength and nature of immune insults. J Neurosci. 2002;22:5606–18. ArticlePubMedPubMed CentralCASGoogle Scholar Quan N, Whiteside M, Herkenham M. Time course and localization patterns of interleukin-1β messenger RNA expression in brain and pituitary after peripheral administration of lipopolysaccharide. Neuroscience. 1998;83:281–93.ArticlePubMedCASGoogle Scholar Quan N, Whiteside M, Herkenham M. Time course and localization patterns of interleukin-1β messenger RNA expression in brain and pituitary after peripheral administration of lipopolysaccharide. Neuroscience. 1998;83:281–93. ArticlePubMedCASGoogle Scholar Quan N, Whiteside M, Herkenham M. Time course and localization patterns of interleukin-1β messenger RNA expression in brain and pituitary after peripheral administration of lipopolysaccharide. Neuroscience. 1998;83:281–93. ArticlePubMedCASGoogle Scholar Konsman JP, Vigues S, Mackerlova L, Bristow A, Blomqvist A. Rat Brain Vascular Distribution of Interleukin-1 Type-1 Receptor Immunoreactivity: Relationship to Patterns of Inducible Cyclooxygenase Expression by Peripheral Inflammatory Stimuli. J Comp Neurol. 2004;472:113–29.ArticlePubMedGoogle Scholar Konsman JP, Vigues S, Mackerlova L, Bristow A, Blomqvist A. Rat Brain Vascular Distribution of Interleukin-1 Type-1 Receptor Immunoreactivity: Relationship to Patterns of Inducible Cyclooxygenase Expression by Peripheral Inflammatory Stimuli. J Comp Neurol. 2004;472:113–29. ArticlePubMedGoogle Scholar Konsman JP, Vigues S, Mackerlova L, Bristow A, Blomqvist A. Rat Brain Vascular Distribution of Interleukin-1 Type-1 Receptor Immunoreactivity: Relationship to Patterns of Inducible Cyclooxygenase Expression by Peripheral Inflammatory Stimuli. J Comp Neurol. 2004;472:113–29. ArticlePubMedGoogle Scholar Dantzer R, O’Connor JC, Freund GG, Johnson RW, Kelley KW. From inflammation to sickness and depression: When the immune system subjugates the brain. Nat Rev Neurosci. 2008;9:46–56.ArticlePubMedPubMed CentralCASGoogle Scholar Dantzer R, O’Connor JC, Freund GG, Johnson RW, Kelley KW. From inflammation to sickness and depression: When the immune system subjugates the brain. Nat Rev Neurosci. 2008;9:46–56. ArticlePubMedPubMed CentralCASGoogle Scholar Dantzer R, O’Connor JC, Freund GG, Johnson RW, Kelley KW. From inflammation to sickness and depression: When the immune system subjugates the brain. Nat Rev Neurosci. 2008;9:46–56. ArticlePubMedPubMed CentralCASGoogle Scholar Norden DM, Trojanowski PJ, Villanueva E, Navarro E, Godbout JP. Sequential activation of microglia and astrocyte cytokine expression precedes increased iba-1 or GFAP immunoreactivity following systemic immune challenge. Glia. 2016;64:300–16.ArticlePubMedGoogle Scholar Norden DM, Trojanowski PJ, Villanueva E, Navarro E, Godbout JP. Sequential activation of microglia and astrocyte cytokine expression precedes increased iba-1 or GFAP immunoreactivity following systemic immune challenge. Glia. 2016;64:300–16. ArticlePubMedGoogle Scholar Norden DM, Trojanowski PJ, Villanueva E, Navarro E, Godbout JP. Sequential activation of microglia and astrocyte cytokine expression precedes increased iba-1 or GFAP immunoreactivity following systemic immune challenge. Glia. 2016;64:300–16. ArticlePubMedGoogle Scholar Zeng J, Zhào H, Liu Z, Zhang W, Huang Y. Lipopolysaccharide Induces Subacute Cerebral Microhemorrhages with Involvement of Nitric Oxide Synthase in Rats. J Stroke Cerebrovasc Dis. 2018;27:1905–13.https://doi.org/10.1016/j.jstrokecerebrovasdis.2018.02.044.ArticlePubMedGoogle Scholar Zeng J, Zhào H, Liu Z, Zhang W, Huang Y. Lipopolysaccharide Induces Subacute Cerebral Microhemorrhages with Involvement of Nitric Oxide Synthase in Rats. J Stroke Cerebrovasc Dis. 2018;27:1905–13.https://doi.org/10.1016/j.jstrokecerebrovasdis.2018.02.044. ArticlePubMedGoogle Scholar Zeng J, Zhào H, Liu Z, Zhang W, Huang Y. Lipopolysaccharide Induces Subacute Cerebral Microhemorrhages with Involvement of Nitric Oxide Synthase in Rats. J Stroke Cerebrovasc Dis. 2018;27:1905–13.https://doi.org/10.1016/j.jstrokecerebrovasdis.2018.02.044. ArticlePubMedGoogle Scholar Sardari M, Skuljec J, Yin D, Zec K, de Carvalho TS, Albers D, et al. Lipopolysaccharide-induced sepsis-like state compromises post-ischemic neurological recovery, brain tissue survival and remodeling via mechanisms involving microvascular thrombosis and brain T cell infiltration. Brain Behav Immun. 2021;91:627–38.https://doi.org/10.1016/j.bbi.2020.10.015.ArticlePubMedCASGoogle Scholar Sardari M, Skuljec J, Yin D, Zec K, de Carvalho TS, Albers D, et al. Lipopolysaccharide-induced sepsis-like state compromises post-ischemic neurological recovery, brain tissue survival and remodeling via mechanisms involving microvascular thrombosis and brain T cell infiltration. Brain Behav Immun. 2021;91:627–38.https://doi.org/10.1016/j.bbi.2020.10.015. ArticlePubMedCASGoogle Scholar Sardari M, Skuljec J, Yin D, Zec K, de Carvalho TS, Albers D, et al. Lipopolysaccharide-induced sepsis-like state compromises post-ischemic neurological recovery, brain tissue survival and remodeling via mechanisms involving microvascular thrombosis and brain T cell infiltration. Brain Behav Immun. 2021;91:627–38.https://doi.org/10.1016/j.bbi.2020.10.015. ArticlePubMedCASGoogle Scholar Sumbria RK, Grigoryan MM, Vasilevko V, Krasieva TB, Scadeng M, Dvornikova AK, et al. A murine model of inflammation-induced cerebral microbleeds. J Neuroinflammation. 2016;13:1–12.https://doi.org/10.1186/s12974-016-0693-5.ArticleCASGoogle Scholar Sumbria RK, Grigoryan MM, Vasilevko V, Krasieva TB, Scadeng M, Dvornikova AK, et al. A murine model of inflammation-induced cerebral microbleeds. J Neuroinflammation. 2016;13:1–12.https://doi.org/10.1186/s12974-016-0693-5. ArticleCASGoogle Scholar Sumbria RK, Grigoryan MM, Vasilevko V, Krasieva TB, Scadeng M, Dvornikova AK, et al. A murine model of inflammation-induced cerebral microbleeds. J Neuroinflammation. 2016;13:1–12.https://doi.org/10.1186/s12974-016-0693-5. ArticleCASGoogle Scholar Banks WA, Robinson SM. Minimal penetration of lipopolysaccharide across the murine blood-brain barrier. Brain Behav Immun. 2010;24:102–9.https://doi.org/10.1016/j.bbi.2009.09.001.ArticlePubMedCASGoogle Scholar Banks WA, Robinson SM. Minimal penetration of lipopolysaccharide across the murine blood-brain barrier. Brain Behav Immun. 2010;24:102–9.https://doi.org/10.1016/j.bbi.2009.09.001. ArticlePubMedCASGoogle Scholar Banks WA, Robinson SM. Minimal penetration of lipopolysaccharide across the murine blood-brain barrier. Brain Behav Immun. 2010;24:102–9.https://doi.org/10.1016/j.bbi.2009.09.001. ArticlePubMedCASGoogle Scholar Nimmerjahn A, Kirchhoff F, Helmchen F. Resting microglial cells are highly dynamic surveillants of brain parenchyma in vivo. Science. 2005;308:1314–9.ArticlePubMedCASGoogle Scholar Nimmerjahn A, Kirchhoff F, Helmchen F. Resting microglial cells are highly dynamic surveillants of brain parenchyma in vivo. Science. 2005;308:1314–9. ArticlePubMedCASGoogle Scholar Nimmerjahn A, Kirchhoff F, Helmchen F. Resting microglial cells are highly dynamic surveillants of brain parenchyma in vivo. Science. 2005;308:1314–9. ArticlePubMedCASGoogle Scholar Davalos D, Grutzendler J, Yang G, Kim JV, Zuo Y, Jung S, et al. ATP mediates rapid microglial response to local brain injury in vivo. Nat Neurosci. 2005;8:752–8.ArticlePubMedCASGoogle Scholar Davalos D, Grutzendler J, Yang G, Kim JV, Zuo Y, Jung S, et al. ATP mediates rapid microglial response to local brain injury in vivo. Nat Neurosci. 2005;8:752–8. ArticlePubMedCASGoogle Scholar Davalos D, Grutzendler J, Yang G, Kim JV, Zuo Y, Jung S, et al. ATP mediates rapid microglial response to local brain injury in vivo. Nat Neurosci. 2005;8:752–8. ArticlePubMedCASGoogle Scholar Katz LC, Shatz CJ. Synaptic activity and the construction of cortical circuits. Science. 1996;274:1133–8.ArticlePubMedCASGoogle Scholar Katz LC, Shatz CJ. Synaptic activity and the construction of cortical circuits. Science. 1996;274:1133–8. ArticlePubMedCASGoogle Scholar Katz LC, Shatz CJ. Synaptic activity and the construction of cortical circuits. Science. 1996;274:1133–8. ArticlePubMedCASGoogle Scholar Hua JY, Smith SJ. Neural activity and the dynamics of central nervous system development. Nat Neurosci. 2004;7:327–32.ArticlePubMedCASGoogle Scholar Hua JY, Smith SJ. Neural activity and the dynamics of central nervous system development. Nat Neurosci. 2004;7:327–32. ArticlePubMedCASGoogle Scholar Hua JY, Smith SJ. Neural activity and the dynamics of central nervous system development. Nat Neurosci. 2004;7:327–32. ArticlePubMedCASGoogle Scholar Stevens B, Allen NJ, Vazquez LE, Howell GR, Christopherson KS, Nouri N, et al. The classical complement cascade mediates CNS synapse elimination. Cell. 2007;131:1164–78.ArticlePubMedCASGoogle Scholar Stevens B, Allen NJ, Vazquez LE, Howell GR, Christopherson KS, Nouri N, et al. The classical complement cascade mediates CNS synapse elimination. Cell. 2007;131:1164–78. ArticlePubMedCASGoogle Scholar Stevens B, Allen NJ, Vazquez LE, Howell GR, Christopherson KS, Nouri N, et al. The classical complement cascade mediates CNS synapse elimination. Cell. 2007;131:1164–78. ArticlePubMedCASGoogle Scholar Medzhitov R, Janeway CA. Decoding the patterns of self and nonself by the innate immune system. Science. 2002;296:298–300.ArticlePubMedCASGoogle Scholar Medzhitov R, Janeway CA. Decoding the patterns of self and nonself by the innate immune system. Science. 2002;296:298–300. ArticlePubMedCASGoogle Scholar Medzhitov R, Janeway CA. Decoding the patterns of self and nonself by the innate immune system. Science. 2002;296:298–300. ArticlePubMedCASGoogle Scholar Carroll MC. The complement system in regulation of adaptive immunity. Nat Immunol. 2004;5:981–6.ArticlePubMedCASGoogle Scholar Carroll MC. The complement system in regulation of adaptive immunity. Nat Immunol. 2004;5:981–6. ArticlePubMedCASGoogle Scholar Carroll MC. The complement system in regulation of adaptive immunity. Nat Immunol. 2004;5:981–6. ArticlePubMedCASGoogle Scholar Zipfel PF, Skerka C. Complement regulators and inhibitory proteins. Nat Rev Immunol. 2009;9:729–40.ArticlePubMedCASGoogle Scholar Zipfel PF, Skerka C. Complement regulators and inhibitory proteins. Nat Rev Immunol. 2009;9:729–40. ArticlePubMedCASGoogle Scholar Zipfel PF, Skerka C. Complement regulators and inhibitory proteins. Nat Rev Immunol. 2009;9:729–40. ArticlePubMedCASGoogle Scholar Ricklin D, Hajishengallis G, Yang K, Lambris JD. Complement: A key system for immune surveillance and homeostasis. Nat Immunol. 2010;11:785–97.ArticlePubMedPubMed CentralCASGoogle Scholar Ricklin D, Hajishengallis G, Yang K, Lambris JD. Complement: A key system for immune surveillance and homeostasis. Nat Immunol. 2010;11:785–97. ArticlePubMedPubMed CentralCASGoogle Scholar Ricklin D, Hajishengallis G, Yang K, Lambris JD. Complement: A key system for immune surveillance and homeostasis. Nat Immunol. 2010;11:785–97. ArticlePubMedPubMed CentralCASGoogle Scholar Schafer DP, Lehrman EK, Kautzman AG, Koyama R, Mardinly AR, Yamasaki R, et al. Microglia sculpt postnatal neural circuits in an activity and complement-dependent manner. Neuron. 2012;74:691–705.https://doi.org/10.1016/j.neuron.2012.03.026.ArticlePubMedPubMed CentralCASGoogle Scholar Schafer DP, Lehrman EK, Kautzman AG, Koyama R, Mardinly AR, Yamasaki R, et al. Microglia sculpt postnatal neural circuits in an activity and complement-dependent manner. Neuron. 2012;74:691–705.https://doi.org/10.1016/j.neuron.2012.03.026. ArticlePubMedPubMed CentralCASGoogle Scholar Schafer DP, Lehrman EK, Kautzman AG, Koyama R, Mardinly AR, Yamasaki R, et al. Microglia sculpt postnatal neural circuits in an activity and complement-dependent manner. Neuron. 2012;74:691–705.https://doi.org/10.1016/j.neuron.2012.03.026. ArticlePubMedPubMed CentralCASGoogle Scholar Weinhard L, Di Bartolomei G, Bolasco G, Machado P, Schieber NL, Neniskyte U, et al. Microglia remodel synapses by presynaptic trogocytosis and spine head filopodia induction. Nat Commun. 2018.https://doi.org/10.1038/s41467-018-03566-5.ArticlePubMedPubMed CentralGoogle Scholar Weinhard L, Di Bartolomei G, Bolasco G, Machado P, Schieber NL, Neniskyte U, et al. Microglia remodel synapses by presynaptic trogocytosis and spine head filopodia induction. Nat Commun. 2018.https://doi.org/10.1038/s41467-018-03566-5. ArticlePubMedPubMed CentralGoogle Scholar Weinhard L, Di Bartolomei G, Bolasco G, Machado P, Schieber NL, Neniskyte U, et al. Microglia remodel synapses by presynaptic trogocytosis and spine head filopodia induction. Nat Commun. 2018.https://doi.org/10.1038/s41467-018-03566-5. ArticlePubMedPubMed CentralGoogle Scholar Sipe GO, Lowery RL, Tremblay M, Kelly EA, Lamantia CE, Majewska AK. Microglial P2Y12 is necessary for synaptic plasticity in mouse visual cortex. Nat Commun. 2016.https://doi.org/10.1038/ncomms10905.ArticlePubMedPubMed CentralGoogle Scholar Sipe GO, Lowery RL, Tremblay M, Kelly EA, Lamantia CE, Majewska AK. Microglial P2Y12 is necessary for synaptic plasticity in mouse visual cortex. Nat Commun. 2016.https://doi.org/10.1038/ncomms10905. ArticlePubMedPubMed CentralGoogle Scholar Sipe GO, Lowery RL, Tremblay M, Kelly EA, Lamantia CE, Majewska AK. Microglial P2Y12 is necessary for synaptic plasticity in mouse visual cortex. Nat Commun. 2016.https://doi.org/10.1038/ncomms10905. ArticlePubMedPubMed CentralGoogle Scholar Gunner G, Cheadle L, Johnson KM, Ayata P, Badimon A, Mondo E, et al. Sensory lesioning induces microglial synapse elimination via ADAM10 and fractalkine signaling. Nat Neurosci. 2019;22:1075–88.https://doi.org/10.1038/s41593-019-0419-y.ArticlePubMedPubMed CentralCASGoogle Scholar Gunner G, Cheadle L, Johnson KM, Ayata P, Badimon A, Mondo E, et al. Sensory lesioning induces microglial synapse elimination via ADAM10 and fractalkine signaling. Nat Neurosci. 2019;22:1075–88.https://doi.org/10.1038/s41593-019-0419-y. ArticlePubMedPubMed CentralCASGoogle Scholar Gunner G, Cheadle L, Johnson KM, Ayata P, Badimon A, Mondo E, et al. Sensory lesioning induces microglial synapse elimination via ADAM10 and fractalkine signaling. Nat Neurosci. 2019;22:1075–88.https://doi.org/10.1038/s41593-019-0419-y. ArticlePubMedPubMed CentralCASGoogle Scholar Filipello F, Morini R, Corradini I, Zerbi V, Canzi A, Michalski B, et al. The Microglial innate immune receptor TREM2 is required for synapse elimination and normal brain connectivity. Immunity. 2018.https://doi.org/10.1016/j.immuni.2018.04.016.ArticlePubMedGoogle Scholar Filipello F, Morini R, Corradini I, Zerbi V, Canzi A, Michalski B, et al. The Microglial innate immune receptor TREM2 is required for synapse elimination and normal brain connectivity. Immunity. 2018.https://doi.org/10.1016/j.immuni.2018.04.016. ArticlePubMedGoogle Scholar Filipello F, Morini R, Corradini I, Zerbi V, Canzi A, Michalski B, et al. The Microglial innate immune receptor TREM2 is required for synapse elimination and normal brain connectivity. Immunity. 2018.https://doi.org/10.1016/j.immuni.2018.04.016. ArticlePubMedGoogle Scholar Paolicelli RC, Bolasco G, Pagani F, Maggi L, Scianni M, Panzanelli P, et al. Synaptic pruning by microglia is necessary for normal brain development. Science. 2011;333:1456–8.https://doi.org/10.1126/science.1202529.ArticlePubMedCASGoogle Scholar Paolicelli RC, Bolasco G, Pagani F, Maggi L, Scianni M, Panzanelli P, et al. Synaptic pruning by microglia is necessary for normal brain development. Science. 2011;333:1456–8.https://doi.org/10.1126/science.1202529. ArticlePubMedCASGoogle Scholar Paolicelli RC, Bolasco G, Pagani F, Maggi L, Scianni M, Panzanelli P, et al. Synaptic pruning by microglia is necessary for normal brain development. Science. 2011;333:1456–8.https://doi.org/10.1126/science.1202529. ArticlePubMedCASGoogle Scholar Rogers JT, Morganti JM, Bachstetter AD, Hudson CE, Peters MM, Grimmig BA, et al. CX3CR1 deficiency leads to impairment of hippocampal cognitive function and synaptic plasticity. J Neurosci. 2011;31:16241–50.ArticlePubMedPubMed CentralCASGoogle Scholar Rogers JT, Morganti JM, Bachstetter AD, Hudson CE, Peters MM, Grimmig BA, et al. CX3CR1 deficiency leads to impairment of hippocampal cognitive function and synaptic plasticity. J Neurosci. 2011;31:16241–50. ArticlePubMedPubMed CentralCASGoogle Scholar Rogers JT, Morganti JM, Bachstetter AD, Hudson CE, Peters MM, Grimmig BA, et al. CX3CR1 deficiency leads to impairment of hippocampal cognitive function and synaptic plasticity. J Neurosci. 2011;31:16241–50. ArticlePubMedPubMed CentralCASGoogle Scholar Wang C, Yue H, Hu Z, Shen Y, Ma J, Li J, et al. Microglia mediate forgetting via complement-dependent synaptic elimination. Science. 2020;367:688–94.ArticlePubMedCASGoogle Scholar Wang C, Yue H, Hu Z, Shen Y, Ma J, Li J, et al. Microglia mediate forgetting via complement-dependent synaptic elimination. Science. 2020;367:688–94. ArticlePubMedCASGoogle Scholar Wang C, Yue H, Hu Z, Shen Y, Ma J, Li J, et al. Microglia mediate forgetting via complement-dependent synaptic elimination. Science. 2020;367:688–94. ArticlePubMedCASGoogle Scholar Eyo UB, Wu L-J. Bidirectional microglia-neuron communication in the healthy brain. Neural Plast. 2013.https://doi.org/10.1155/2013/456857.ArticlePubMedPubMed CentralGoogle Scholar Eyo UB, Wu L-J. Bidirectional microglia-neuron communication in the healthy brain. Neural Plast. 2013.https://doi.org/10.1155/2013/456857. ArticlePubMedPubMed CentralGoogle Scholar Eyo UB, Wu L-J. Bidirectional microglia-neuron communication in the healthy brain. Neural Plast. 2013.https://doi.org/10.1155/2013/456857. ArticlePubMedPubMed CentralGoogle Scholar Dissing-Olesen L, LeDue JM, Rungta RL, Hefendehl JK, Choi HB, MacVicar BA. Activation of neuronal NMDA receptors triggers transient ATP-mediated microglial process outgrowth. J Neurosci. 2014;34:10511–27.https://doi.org/10.1523/JNEUROSCI.0405-14.2014.ArticlePubMedPubMed CentralCASGoogle Scholar Dissing-Olesen L, LeDue JM, Rungta RL, Hefendehl JK, Choi HB, MacVicar BA. Activation of neuronal NMDA receptors triggers transient ATP-mediated microglial process outgrowth. J Neurosci. 2014;34:10511–27.https://doi.org/10.1523/JNEUROSCI.0405-14.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Dissing-Olesen L, LeDue JM, Rungta RL, Hefendehl JK, Choi HB, MacVicar BA. Activation of neuronal NMDA receptors triggers transient ATP-mediated microglial process outgrowth. J Neurosci. 2014;34:10511–27.https://doi.org/10.1523/JNEUROSCI.0405-14.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Eyo UB, Gu N, De S, Dong H, Richardson JR, Wu L-J. Modulation of microglial process convergence toward neuronal dendrites by extracellular calcium. J Neurosci. 2015;35:2417–22.https://doi.org/10.1523/JNEUROSCI.3279-14.2015.ArticlePubMedPubMed CentralCASGoogle Scholar Eyo UB, Gu N, De S, Dong H, Richardson JR, Wu L-J. Modulation of microglial process convergence toward neuronal dendrites by extracellular calcium. J Neurosci. 2015;35:2417–22.https://doi.org/10.1523/JNEUROSCI.3279-14.2015. ArticlePubMedPubMed CentralCASGoogle Scholar Eyo UB, Gu N, De S, Dong H, Richardson JR, Wu L-J. Modulation of microglial process convergence toward neuronal dendrites by extracellular calcium. J Neurosci. 2015;35:2417–22.https://doi.org/10.1523/JNEUROSCI.3279-14.2015. ArticlePubMedPubMed CentralCASGoogle Scholar Pfeiffer T, Avignone E, Nägerl UV. Induction of hippocampal long-term potentiation increases the morphological dynamics of microglial processes and prolongs their contacts with dendritic spines. Sci Rep. 2016;6:32422.ArticlePubMedPubMed CentralCASGoogle Scholar Pfeiffer T, Avignone E, Nägerl UV. Induction of hippocampal long-term potentiation increases the morphological dynamics of microglial processes and prolongs their contacts with dendritic spines. Sci Rep. 2016;6:32422. ArticlePubMedPubMed CentralCASGoogle Scholar Pfeiffer T, Avignone E, Nägerl UV. Induction of hippocampal long-term potentiation increases the morphological dynamics of microglial processes and prolongs their contacts with dendritic spines. Sci Rep. 2016;6:32422. ArticlePubMedPubMed CentralCASGoogle Scholar Eyo UB, Bispo A, Liu J, Sabu S, Wu R, Dibona VL, et al. The GluN2A subunit regulates neuronal NMDA receptor-induced microglia-neuron physical interactions. Sci Rep. 2018;8:1–10.https://doi.org/10.1038/s41598-018-19205-4.ArticleCASGoogle Scholar Eyo UB, Bispo A, Liu J, Sabu S, Wu R, Dibona VL, et al. The GluN2A subunit regulates neuronal NMDA receptor-induced microglia-neuron physical interactions. Sci Rep. 2018;8:1–10.https://doi.org/10.1038/s41598-018-19205-4. ArticleCASGoogle Scholar Eyo UB, Bispo A, Liu J, Sabu S, Wu R, Dibona VL, et al. The GluN2A subunit regulates neuronal NMDA receptor-induced microglia-neuron physical interactions. Sci Rep. 2018;8:1–10.https://doi.org/10.1038/s41598-018-19205-4. ArticleCASGoogle Scholar Bernier L-P, Bohlen CJ, York EM, Stevens B, Barres BA, Correspondence BAM. Nanoscale surveillance of the brain by microglia via cAMP-regulated filopodia. Cell Rep. 2019.https://doi.org/10.1016/j.celrep.2019.05.010.ArticlePubMedGoogle Scholar Bernier L-P, Bohlen CJ, York EM, Stevens B, Barres BA, Correspondence BAM. Nanoscale surveillance of the brain by microglia via cAMP-regulated filopodia. Cell Rep. 2019.https://doi.org/10.1016/j.celrep.2019.05.010. ArticlePubMedGoogle Scholar Bernier L-P, Bohlen CJ, York EM, Stevens B, Barres BA, Correspondence BAM. Nanoscale surveillance of the brain by microglia via cAMP-regulated filopodia. Cell Rep. 2019.https://doi.org/10.1016/j.celrep.2019.05.010. ArticlePubMedGoogle Scholar Tremblay MĚ, Lowery RL, Majewska AK. Microglial interactions with synapses are modulated by visual experience. PLoS Biol. 2010.https://doi.org/10.1371/journal.pbio.1000527.ArticlePubMedPubMed CentralGoogle Scholar Tremblay MĚ, Lowery RL, Majewska AK. Microglial interactions with synapses are modulated by visual experience. PLoS Biol. 2010.https://doi.org/10.1371/journal.pbio.1000527. ArticlePubMedPubMed CentralGoogle Scholar Tremblay MĚ, Lowery RL, Majewska AK. Microglial interactions with synapses are modulated by visual experience. PLoS Biol. 2010.https://doi.org/10.1371/journal.pbio.1000527. ArticlePubMedPubMed CentralGoogle Scholar Stowell RD, Sipe GO, Dawes RP, Batchelor HN, Lordy KA, Whitelaw BS, et al. Noradrenergic signaling in the wakeful state inhibits microglial surveillance and synaptic plasticity in the mouse visual cortex. Nat Neurosci. 2019;22:1782–92.https://doi.org/10.1038/s41593-019-0514-0.ArticlePubMedPubMed CentralCASGoogle Scholar Stowell RD, Sipe GO, Dawes RP, Batchelor HN, Lordy KA, Whitelaw BS, et al. Noradrenergic signaling in the wakeful state inhibits microglial surveillance and synaptic plasticity in the mouse visual cortex. Nat Neurosci. 2019;22:1782–92.https://doi.org/10.1038/s41593-019-0514-0. ArticlePubMedPubMed CentralCASGoogle Scholar Stowell RD, Sipe GO, Dawes RP, Batchelor HN, Lordy KA, Whitelaw BS, et al. Noradrenergic signaling in the wakeful state inhibits microglial surveillance and synaptic plasticity in the mouse visual cortex. Nat Neurosci. 2019;22:1782–92.https://doi.org/10.1038/s41593-019-0514-0. ArticlePubMedPubMed CentralCASGoogle Scholar Badimon A, Strasburger HJ, Ayata P, Chen X, Nair A, Ikegami A, et al. Negative feedback control of neuronal activity by microglia. Nature. 2020.https://doi.org/10.1038/s41586-020-2777-8.ArticlePubMedPubMed CentralGoogle Scholar Badimon A, Strasburger HJ, Ayata P, Chen X, Nair A, Ikegami A, et al. Negative feedback control of neuronal activity by microglia. Nature. 2020.https://doi.org/10.1038/s41586-020-2777-8. ArticlePubMedPubMed CentralGoogle Scholar Badimon A, Strasburger HJ, Ayata P, Chen X, Nair A, Ikegami A, et al. Negative feedback control of neuronal activity by microglia. Nature. 2020.https://doi.org/10.1038/s41586-020-2777-8. ArticlePubMedPubMed CentralGoogle Scholar Schneider H, Pitossi F, Balschun D, Wagner A, Del Rey A, Besedovsky HO. A neuromodulatory role of interleukin-1β in the hippocampus. Proc Natl Acad Sci U S A. 1998;95:7778–83.ArticlePubMedPubMed CentralCASGoogle Scholar Schneider H, Pitossi F, Balschun D, Wagner A, Del Rey A, Besedovsky HO. A neuromodulatory role of interleukin-1β in the hippocampus. Proc Natl Acad Sci U S A. 1998;95:7778–83. ArticlePubMedPubMed CentralCASGoogle Scholar Schneider H, Pitossi F, Balschun D, Wagner A, Del Rey A, Besedovsky HO. A neuromodulatory role of interleukin-1β in the hippocampus. Proc Natl Acad Sci U S A. 1998;95:7778–83. ArticlePubMedPubMed CentralCASGoogle Scholar Spulber S, Mateos L, Oprica M, Cedazo-Minguez A, Bartfai T, Winblad B, et al. Impaired long term memory consolidation in transgenic mice overexpressing the human soluble form of IL-1ra in the brain. J Neuroimmunol. 2009;208:46–53.https://doi.org/10.1016/j.jneuroim.2009.01.010.ArticlePubMedCASGoogle Scholar Spulber S, Mateos L, Oprica M, Cedazo-Minguez A, Bartfai T, Winblad B, et al. Impaired long term memory consolidation in transgenic mice overexpressing the human soluble form of IL-1ra in the brain. J Neuroimmunol. 2009;208:46–53.https://doi.org/10.1016/j.jneuroim.2009.01.010. ArticlePubMedCASGoogle Scholar Spulber S, Mateos L, Oprica M, Cedazo-Minguez A, Bartfai T, Winblad B, et al. Impaired long term memory consolidation in transgenic mice overexpressing the human soluble form of IL-1ra in the brain. J Neuroimmunol. 2009;208:46–53.https://doi.org/10.1016/j.jneuroim.2009.01.010. ArticlePubMedCASGoogle Scholar Prieto GA, Cotman CW. Cytokines and cytokine networks target neurons to modulate long-term potentiation. Cytokine Growth Factor Rev. 2017;34:27–33.https://doi.org/10.1016/j.cytogfr.2017.03.005.ArticlePubMedPubMed CentralCASGoogle Scholar Prieto GA, Cotman CW. Cytokines and cytokine networks target neurons to modulate long-term potentiation. Cytokine Growth Factor Rev. 2017;34:27–33.https://doi.org/10.1016/j.cytogfr.2017.03.005. ArticlePubMedPubMed CentralCASGoogle Scholar Prieto GA, Cotman CW. Cytokines and cytokine networks target neurons to modulate long-term potentiation. Cytokine Growth Factor Rev. 2017;34:27–33.https://doi.org/10.1016/j.cytogfr.2017.03.005. ArticlePubMedPubMed CentralCASGoogle Scholar Ross FM, Allan SM, Rothwell NJ, Verkhratsky A. A dual role for interleukin-1 in LTP in mouse hippocampal slices. J Neuroimmunol. 2003;144:61–7.ArticlePubMedCASGoogle Scholar Ross FM, Allan SM, Rothwell NJ, Verkhratsky A. A dual role for interleukin-1 in LTP in mouse hippocampal slices. J Neuroimmunol. 2003;144:61–7. ArticlePubMedCASGoogle Scholar Ross FM, Allan SM, Rothwell NJ, Verkhratsky A. A dual role for interleukin-1 in LTP in mouse hippocampal slices. J Neuroimmunol. 2003;144:61–7. ArticlePubMedCASGoogle Scholar Goshen I, Kreisel T, Ounallah-Saad H, Renbaum P, Zalzstein Y, Ben-Hur T, et al. A dual role for interleukin-1 in hippocampal-dependent memory processes. Psychoneuroendocrinology. 2007;32:1106–15.ArticlePubMedCASGoogle Scholar Goshen I, Kreisel T, Ounallah-Saad H, Renbaum P, Zalzstein Y, Ben-Hur T, et al. A dual role for interleukin-1 in hippocampal-dependent memory processes. Psychoneuroendocrinology. 2007;32:1106–15. ArticlePubMedCASGoogle Scholar Goshen I, Kreisel T, Ounallah-Saad H, Renbaum P, Zalzstein Y, Ben-Hur T, et al. A dual role for interleukin-1 in hippocampal-dependent memory processes. Psychoneuroendocrinology. 2007;32:1106–15. ArticlePubMedCASGoogle Scholar Prieto GA, Snigdha S, Baglietto-Vargas D, Smith ED, Berchtold NC, Tong L, et al. Synapse-specific IL-1 receptor subunit reconfiguration augments vulnerability to IL-1β in the aged hippocampus. Proc Natl Acad Sci. 2015;112:E5078–87.https://doi.org/10.1073/pnas.1514486112.ArticlePubMedPubMed CentralCASGoogle Scholar Prieto GA, Snigdha S, Baglietto-Vargas D, Smith ED, Berchtold NC, Tong L, et al. Synapse-specific IL-1 receptor subunit reconfiguration augments vulnerability to IL-1β in the aged hippocampus. Proc Natl Acad Sci. 2015;112:E5078–87.https://doi.org/10.1073/pnas.1514486112. ArticlePubMedPubMed CentralCASGoogle Scholar Prieto GA, Snigdha S, Baglietto-Vargas D, Smith ED, Berchtold NC, Tong L, et al. Synapse-specific IL-1 receptor subunit reconfiguration augments vulnerability to IL-1β in the aged hippocampus. Proc Natl Acad Sci. 2015;112:E5078–87.https://doi.org/10.1073/pnas.1514486112. ArticlePubMedPubMed CentralCASGoogle Scholar Di Castro MA, Trettel F, Milior G, Maggi L, Ragozzino D, Limatola C. The chemokine CXCL16 modulates neurotransmitter release in hippocampal CA1 area. Sci Rep. 2016;6:1–13.ArticleCASGoogle Scholar Di Castro MA, Trettel F, Milior G, Maggi L, Ragozzino D, Limatola C. The chemokine CXCL16 modulates neurotransmitter release in hippocampal CA1 area. Sci Rep. 2016;6:1–13. ArticleCASGoogle Scholar Di Castro MA, Trettel F, Milior G, Maggi L, Ragozzino D, Limatola C. The chemokine CXCL16 modulates neurotransmitter release in hippocampal CA1 area. Sci Rep. 2016;6:1–13. ArticleCASGoogle Scholar Ragozzino D, Di Angelantonio S, Trettel F, Bertollini C, Maggi L, Gross C, et al. Chemokine fractalkine/CX3CL1 negatively modulates active glutamatergic synapses in rat hippocampal neurons. J Neurosci. 2006;26:10488–98.ArticlePubMedPubMed CentralCASGoogle Scholar Ragozzino D, Di Angelantonio S, Trettel F, Bertollini C, Maggi L, Gross C, et al. Chemokine fractalkine/CX3CL1 negatively modulates active glutamatergic synapses in rat hippocampal neurons. J Neurosci. 2006;26:10488–98. ArticlePubMedPubMed CentralCASGoogle Scholar Ragozzino D, Di Angelantonio S, Trettel F, Bertollini C, Maggi L, Gross C, et al. Chemokine fractalkine/CX3CL1 negatively modulates active glutamatergic synapses in rat hippocampal neurons. J Neurosci. 2006;26:10488–98. ArticlePubMedPubMed CentralCASGoogle Scholar Lim SH, Park E, You B, Jung Y, Park AR, Park SG, et al. Neuronal synapse formation induced by microglia and interleukin 10. PLoS ONE. 2013;8:1–13.ArticleGoogle Scholar Lim SH, Park E, You B, Jung Y, Park AR, Park SG, et al. Neuronal synapse formation induced by microglia and interleukin 10. PLoS ONE. 2013;8:1–13. ArticleGoogle Scholar Lim SH, Park E, You B, Jung Y, Park AR, Park SG, et al. Neuronal synapse formation induced by microglia and interleukin 10. PLoS ONE. 2013;8:1–13. ArticleGoogle Scholar Maggi L, Trettel F, Scianni M, Bertollini C, Eusebi F, Fredholm BB, et al. LTP impairment by fractalkine/CX3CL1 in mouse hippocampus is mediated through the activity of adenosine receptor type 3 (A3R). J Neuroimmunol. 2009;215:36–42.https://doi.org/10.1016/j.jneuroim.2009.07.016.ArticlePubMedCASGoogle Scholar Maggi L, Trettel F, Scianni M, Bertollini C, Eusebi F, Fredholm BB, et al. LTP impairment by fractalkine/CX3CL1 in mouse hippocampus is mediated through the activity of adenosine receptor type 3 (A3R). J Neuroimmunol. 2009;215:36–42.https://doi.org/10.1016/j.jneuroim.2009.07.016. ArticlePubMedCASGoogle Scholar Maggi L, Trettel F, Scianni M, Bertollini C, Eusebi F, Fredholm BB, et al. LTP impairment by fractalkine/CX3CL1 in mouse hippocampus is mediated through the activity of adenosine receptor type 3 (A3R). J Neuroimmunol. 2009;215:36–42.https://doi.org/10.1016/j.jneuroim.2009.07.016. ArticlePubMedCASGoogle Scholar Bertollini C, Ragozzino D, Gross C, Limatola C, Eusebi F. Fractalkine/CX3CL1 depresses central synaptic transmission in mouse hippocampal slices. Neuropharmacology. 2006;51:816–21.ArticlePubMedCASGoogle Scholar Bertollini C, Ragozzino D, Gross C, Limatola C, Eusebi F. Fractalkine/CX3CL1 depresses central synaptic transmission in mouse hippocampal slices. Neuropharmacology. 2006;51:816–21. ArticlePubMedCASGoogle Scholar Bertollini C, Ragozzino D, Gross C, Limatola C, Eusebi F. Fractalkine/CX3CL1 depresses central synaptic transmission in mouse hippocampal slices. Neuropharmacology. 2006;51:816–21. ArticlePubMedCASGoogle Scholar Stellwagen D, Malenka RC. Synaptic scaling mediated by glial TNF-α. Nature. 2006;440:1054–9.ArticlePubMedCASGoogle Scholar Stellwagen D, Malenka RC. Synaptic scaling mediated by glial TNF-α. Nature. 2006;440:1054–9. ArticlePubMedCASGoogle Scholar Stellwagen D, Malenka RC. Synaptic scaling mediated by glial TNF-α. Nature. 2006;440:1054–9. ArticlePubMedCASGoogle Scholar Wohleb ES. Neuron-microglia interactions in mental health disorders: “For better, and for worse.” Front Immunol. 2016;7:1–13.ArticleGoogle Scholar Wohleb ES. Neuron-microglia interactions in mental health disorders: “For better, and for worse.” Front Immunol. 2016;7:1–13. ArticleGoogle Scholar Wohleb ES. Neuron-microglia interactions in mental health disorders: “For better, and for worse.” Front Immunol. 2016;7:1–13. ArticleGoogle Scholar Nguyen KT, Deak T, Owens SM, Kohno T, Fleshner M, Watkins LR, et al. Exposure to acute stress induces brain interleukin-1β protein in the rat. J Neurosci. 1998;18:2239–46.ArticlePubMedPubMed CentralCASGoogle Scholar Nguyen KT, Deak T, Owens SM, Kohno T, Fleshner M, Watkins LR, et al. Exposure to acute stress induces brain interleukin-1β protein in the rat. J Neurosci. 1998;18:2239–46. ArticlePubMedPubMed CentralCASGoogle Scholar Nguyen KT, Deak T, Owens SM, Kohno T, Fleshner M, Watkins LR, et al. Exposure to acute stress induces brain interleukin-1β protein in the rat. J Neurosci. 1998;18:2239–46. ArticlePubMedPubMed CentralCASGoogle Scholar Goshen I, Kreisel T, Ben-Menachem-Zidon O, Licht T, Weidenfeld J, Ben-Hur T, et al. Brain interleukin-1 mediates chronic stress-induced depression in mice via adrenocortical activation and hippocampal neurogenesis suppression. Mol Psychiatry. 2008;13:717–28.ArticlePubMedCASGoogle Scholar Goshen I, Kreisel T, Ben-Menachem-Zidon O, Licht T, Weidenfeld J, Ben-Hur T, et al. Brain interleukin-1 mediates chronic stress-induced depression in mice via adrenocortical activation and hippocampal neurogenesis suppression. Mol Psychiatry. 2008;13:717–28. ArticlePubMedCASGoogle Scholar Goshen I, Kreisel T, Ben-Menachem-Zidon O, Licht T, Weidenfeld J, Ben-Hur T, et al. Brain interleukin-1 mediates chronic stress-induced depression in mice via adrenocortical activation and hippocampal neurogenesis suppression. Mol Psychiatry. 2008;13:717–28. ArticlePubMedCASGoogle Scholar Nguyen KT, Deak T, Will MJ, Hansen MK, Hunsaker BN, Fleshner M, et al. Timecourse and corticosterone sensitivity of the brain, pituitary, and serum interleukin-1β protein response to acute stress. Brain Res. 2000;859:193–201.ArticlePubMedCASGoogle Scholar Nguyen KT, Deak T, Will MJ, Hansen MK, Hunsaker BN, Fleshner M, et al. Timecourse and corticosterone sensitivity of the brain, pituitary, and serum interleukin-1β protein response to acute stress. Brain Res. 2000;859:193–201. ArticlePubMedCASGoogle Scholar Nguyen KT, Deak T, Will MJ, Hansen MK, Hunsaker BN, Fleshner M, et al. Timecourse and corticosterone sensitivity of the brain, pituitary, and serum interleukin-1β protein response to acute stress. Brain Res. 2000;859:193–201. ArticlePubMedCASGoogle Scholar Tynan RJ, Naicker S, Hinwood M, Nalivaiko E, Buller KM, Pow DV, et al. Chronic stress alters the density and morphology of microglia in a subset of stress-responsive brain regions. Brain Behav Immun. 2010;24:1058–68.https://doi.org/10.1016/j.bbi.2010.02.001.ArticlePubMedCASGoogle Scholar Tynan RJ, Naicker S, Hinwood M, Nalivaiko E, Buller KM, Pow DV, et al. Chronic stress alters the density and morphology of microglia in a subset of stress-responsive brain regions. Brain Behav Immun. 2010;24:1058–68.https://doi.org/10.1016/j.bbi.2010.02.001. ArticlePubMedCASGoogle Scholar Tynan RJ, Naicker S, Hinwood M, Nalivaiko E, Buller KM, Pow DV, et al. Chronic stress alters the density and morphology of microglia in a subset of stress-responsive brain regions. Brain Behav Immun. 2010;24:1058–68.https://doi.org/10.1016/j.bbi.2010.02.001. ArticlePubMedCASGoogle Scholar Blandino P, Barnum CJ, Deak T. The involvement of norepinephrine and microglia in hypothalamic and splenic IL-1β responses to stress. J Neuroimmunol. 2006;173:87–95.ArticlePubMedCASGoogle Scholar Blandino P, Barnum CJ, Deak T. The involvement of norepinephrine and microglia in hypothalamic and splenic IL-1β responses to stress. J Neuroimmunol. 2006;173:87–95. ArticlePubMedCASGoogle Scholar Blandino P, Barnum CJ, Deak T. The involvement of norepinephrine and microglia in hypothalamic and splenic IL-1β responses to stress. J Neuroimmunol. 2006;173:87–95. ArticlePubMedCASGoogle Scholar Johnson JD, Campisi J, Sharkey CM, Kennedy SL, Nickerson M, Greenwood BN, et al. Catecholamines mediate stress-induced increases in peripheral and central inflammatory cytokines. Neuroscience. 2005;135:1295–307.ArticlePubMedCASGoogle Scholar Johnson JD, Campisi J, Sharkey CM, Kennedy SL, Nickerson M, Greenwood BN, et al. Catecholamines mediate stress-induced increases in peripheral and central inflammatory cytokines. Neuroscience. 2005;135:1295–307. ArticlePubMedCASGoogle Scholar Johnson JD, Campisi J, Sharkey CM, Kennedy SL, Nickerson M, Greenwood BN, et al. Catecholamines mediate stress-induced increases in peripheral and central inflammatory cytokines. Neuroscience. 2005;135:1295–307. ArticlePubMedCASGoogle Scholar Saito K, Suyama K, Nishida K, Sei Y, Basile AS. Early increases in TNFa, IL-6 and IL-1b levels following transient cerebral ischemia in gerbil brain. Neurosci Lett. 1996;206:149–52.ArticlePubMedCASGoogle Scholar Saito K, Suyama K, Nishida K, Sei Y, Basile AS. Early increases in TNFa, IL-6 and IL-1b levels following transient cerebral ischemia in gerbil brain. Neurosci Lett. 1996;206:149–52. ArticlePubMedCASGoogle Scholar Saito K, Suyama K, Nishida K, Sei Y, Basile AS. Early increases in TNFa, IL-6 and IL-1b levels following transient cerebral ischemia in gerbil brain. Neurosci Lett. 1996;206:149–52. ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Florentino AF, Silvestre C, Comim CM, et al. Tumor necrosis factor alpha (TNF-α) levels in the brain and cerebrospinal fluid after meningitis induced by Streptococcus pneumoniae. Neurosci Lett. 2009;467:217–9.ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Florentino AF, Silvestre C, Comim CM, et al. Tumor necrosis factor alpha (TNF-α) levels in the brain and cerebrospinal fluid after meningitis induced by Streptococcus pneumoniae. Neurosci Lett. 2009;467:217–9. ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Florentino AF, Silvestre C, Comim CM, et al. Tumor necrosis factor alpha (TNF-α) levels in the brain and cerebrospinal fluid after meningitis induced by Streptococcus pneumoniae. Neurosci Lett. 2009;467:217–9. ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Simões LR, Silvestre T, Comim CM, et al. TNF-α, IL-1β, IL-6, and cinc-1 levels in rat brain after meningitis induced by Streptococcus pneumoniae. J Neuroimmunol. 2010;221:42–5.https://doi.org/10.1016/j.jneuroim.2010.02.009.ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Simões LR, Silvestre T, Comim CM, et al. TNF-α, IL-1β, IL-6, and cinc-1 levels in rat brain after meningitis induced by Streptococcus pneumoniae. J Neuroimmunol. 2010;221:42–5.https://doi.org/10.1016/j.jneuroim.2010.02.009. ArticlePubMedCASGoogle Scholar Barichello T, dos Santos I, Savi GD, Simões LR, Silvestre T, Comim CM, et al. TNF-α, IL-1β, IL-6, and cinc-1 levels in rat brain after meningitis induced by Streptococcus pneumoniae. J Neuroimmunol. 2010;221:42–5.https://doi.org/10.1016/j.jneuroim.2010.02.009. ArticlePubMedCASGoogle Scholar Grundy RI, Rothwell NJ, Allan SM. Dissociation between the effects of interleukin-1 on excitotoxic brain damage and body temperature in the rat. Brain Res. 1999;830:32–7.ArticlePubMedCASGoogle Scholar Grundy RI, Rothwell NJ, Allan SM. Dissociation between the effects of interleukin-1 on excitotoxic brain damage and body temperature in the rat. Brain Res. 1999;830:32–7. ArticlePubMedCASGoogle Scholar Grundy RI, Rothwell NJ, Allan SM. Dissociation between the effects of interleukin-1 on excitotoxic brain damage and body temperature in the rat. Brain Res. 1999;830:32–7. ArticlePubMedCASGoogle Scholar Sedger LM, McDermott MF. TNF and TNF-receptors: from mediators of cell death and inflammation to therapeutic giants—past, present and future. Cytokine Growth Factor Rev. 2014;25:453–72.https://doi.org/10.1016/j.cytogfr.2014.07.016.ArticlePubMedCASGoogle Scholar Sedger LM, McDermott MF. TNF and TNF-receptors: from mediators of cell death and inflammation to therapeutic giants—past, present and future. Cytokine Growth Factor Rev. 2014;25:453–72.https://doi.org/10.1016/j.cytogfr.2014.07.016. ArticlePubMedCASGoogle Scholar Sedger LM, McDermott MF. TNF and TNF-receptors: from mediators of cell death and inflammation to therapeutic giants—past, present and future. Cytokine Growth Factor Rev. 2014;25:453–72.https://doi.org/10.1016/j.cytogfr.2014.07.016. ArticlePubMedCASGoogle Scholar Wooff Y, Man SM, Aggio-Bruce R, Natoli R, Fernando N. IL-1 family members mediate cell death, inflammation and angiogenesis in retinal degenerative diseases. Front Immunol. 2019;10:1–21.ArticleGoogle Scholar Wooff Y, Man SM, Aggio-Bruce R, Natoli R, Fernando N. IL-1 family members mediate cell death, inflammation and angiogenesis in retinal degenerative diseases. Front Immunol. 2019;10:1–21. ArticleGoogle Scholar Wooff Y, Man SM, Aggio-Bruce R, Natoli R, Fernando N. IL-1 family members mediate cell death, inflammation and angiogenesis in retinal degenerative diseases. Front Immunol. 2019;10:1–21. ArticleGoogle Scholar O’Connor KA, Johnson JD, Hansen MK, Wieseler Frank JL, Maksimova E, Watkins LR, et al. Peripheral and central proinflammatory cytokine response to a severe acute stressor. Brain Res. 2003;991:123–32.ArticlePubMedGoogle Scholar O’Connor KA, Johnson JD, Hansen MK, Wieseler Frank JL, Maksimova E, Watkins LR, et al. Peripheral and central proinflammatory cytokine response to a severe acute stressor. Brain Res. 2003;991:123–32. ArticlePubMedGoogle Scholar O’Connor KA, Johnson JD, Hansen MK, Wieseler Frank JL, Maksimova E, Watkins LR, et al. Peripheral and central proinflammatory cytokine response to a severe acute stressor. Brain Res. 2003;991:123–32. ArticlePubMedGoogle Scholar Walker AK, Nakamura T, Hodgson DM. Neonatal lipopolysaccharide exposure alters central cytokine responses to stress in adulthood in Wistar rats. Stress. 2010;13:506–15.ArticlePubMedCASGoogle Scholar Walker AK, Nakamura T, Hodgson DM. Neonatal lipopolysaccharide exposure alters central cytokine responses to stress in adulthood in Wistar rats. Stress. 2010;13:506–15. ArticlePubMedCASGoogle Scholar Walker AK, Nakamura T, Hodgson DM. Neonatal lipopolysaccharide exposure alters central cytokine responses to stress in adulthood in Wistar rats. Stress. 2010;13:506–15. ArticlePubMedCASGoogle Scholar Yirmiya R, Goshen I. Immune modulation of learning, memory, neural plasticity and neurogenesis. Brain Behav Immun. 2011;25:181–213.https://doi.org/10.1016/j.bbi.2010.10.015.ArticlePubMedCASGoogle Scholar Yirmiya R, Goshen I. Immune modulation of learning, memory, neural plasticity and neurogenesis. Brain Behav Immun. 2011;25:181–213.https://doi.org/10.1016/j.bbi.2010.10.015. ArticlePubMedCASGoogle Scholar Yirmiya R, Goshen I. Immune modulation of learning, memory, neural plasticity and neurogenesis. Brain Behav Immun. 2011;25:181–213.https://doi.org/10.1016/j.bbi.2010.10.015. ArticlePubMedCASGoogle Scholar Lewitus GM, Pribiag H, Duseja R, St-Hilaire M, Stellwagen D. An adaptive role of TNF in the regulation of striatal synapses. J Neurosci. 2014;34:6146–55.https://doi.org/10.1523/JNEUROSCI.3481-13.2014.ArticlePubMedPubMed CentralCASGoogle Scholar Lewitus GM, Pribiag H, Duseja R, St-Hilaire M, Stellwagen D. An adaptive role of TNF in the regulation of striatal synapses. J Neurosci. 2014;34:6146–55.https://doi.org/10.1523/JNEUROSCI.3481-13.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Lewitus GM, Pribiag H, Duseja R, St-Hilaire M, Stellwagen D. An adaptive role of TNF in the regulation of striatal synapses. J Neurosci. 2014;34:6146–55.https://doi.org/10.1523/JNEUROSCI.3481-13.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Li Q, Barres BA. Microglia and macrophages in brain homeostasis and disease. Nat Rev Immunol. 2018;18:225–42.https://doi.org/10.1038/nri.2017.125.ArticlePubMedCASGoogle Scholar Li Q, Barres BA. Microglia and macrophages in brain homeostasis and disease. Nat Rev Immunol. 2018;18:225–42.https://doi.org/10.1038/nri.2017.125. ArticlePubMedCASGoogle Scholar Li Q, Barres BA. Microglia and macrophages in brain homeostasis and disease. Nat Rev Immunol. 2018;18:225–42.https://doi.org/10.1038/nri.2017.125. ArticlePubMedCASGoogle Scholar Ueno M, Fujita Y, Tanaka T, Nakamura Y, Kikuta J, Ishii M, et al. Layer v cortical neurons require microglial support for survival during postnatal development. Nat Neurosci. 2013;16:543–51.ArticlePubMedCASGoogle Scholar Ueno M, Fujita Y, Tanaka T, Nakamura Y, Kikuta J, Ishii M, et al. Layer v cortical neurons require microglial support for survival during postnatal development. Nat Neurosci. 2013;16:543–51. ArticlePubMedCASGoogle Scholar Ueno M, Fujita Y, Tanaka T, Nakamura Y, Kikuta J, Ishii M, et al. Layer v cortical neurons require microglial support for survival during postnatal development. Nat Neurosci. 2013;16:543–51. ArticlePubMedCASGoogle Scholar Shigemoto-Mogami Y, Hoshikawa K, Goldman JE, Sekino Y, Sato K. Microglia enhance neurogenesis and oligodendrogenesis in the early postnatal subventricular zone. J Neurosci. 2014;34:2231–43.https://doi.org/10.1523/JNEUROSCI.1619-13.2014.ArticlePubMedPubMed CentralCASGoogle Scholar Shigemoto-Mogami Y, Hoshikawa K, Goldman JE, Sekino Y, Sato K. Microglia enhance neurogenesis and oligodendrogenesis in the early postnatal subventricular zone. J Neurosci. 2014;34:2231–43.https://doi.org/10.1523/JNEUROSCI.1619-13.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Shigemoto-Mogami Y, Hoshikawa K, Goldman JE, Sekino Y, Sato K. Microglia enhance neurogenesis and oligodendrogenesis in the early postnatal subventricular zone. J Neurosci. 2014;34:2231–43.https://doi.org/10.1523/JNEUROSCI.1619-13.2014. ArticlePubMedPubMed CentralCASGoogle Scholar Woodburn SC, Bollinger JL, Wohleb ES. Synaptic and behavioral effects of chronic stress are linked to dynamic and sex-specific changes in microglia function and astrocyte dystrophy. Neurobiol Stress. 2021.https://doi.org/10.1016/j.ynstr.2021.100312.ArticlePubMedPubMed CentralGoogle Scholar Woodburn SC, Bollinger JL, Wohleb ES. Synaptic and behavioral effects of chronic stress are linked to dynamic and sex-specific changes in microglia function and astrocyte dystrophy. Neurobiol Stress. 2021.https://doi.org/10.1016/j.ynstr.2021.100312. ArticlePubMedPubMed CentralGoogle Scholar Woodburn SC, Bollinger JL, Wohleb ES. Synaptic and behavioral effects of chronic stress are linked to dynamic and sex-specific changes in microglia function and astrocyte dystrophy. Neurobiol Stress. 2021.https://doi.org/10.1016/j.ynstr.2021.100312. ArticlePubMedPubMed CentralGoogle Scholar Bollinger JL, Burns CMB, Wellman CL. Differential effects of stress on microglial cell activation in male and female medial prefrontal cortex. Brain Behav Immun. 2016;52:88–97.ArticlePubMedCASGoogle Scholar Bollinger JL, Burns CMB, Wellman CL. Differential effects of stress on microglial cell activation in male and female medial prefrontal cortex. Brain Behav Immun. 2016;52:88–97. ArticlePubMedCASGoogle Scholar Bollinger JL, Burns CMB, Wellman CL. Differential effects of stress on microglial cell activation in male and female medial prefrontal cortex. Brain Behav Immun. 2016;52:88–97. ArticlePubMedCASGoogle Scholar Horchar MJ, Wohleb ES. Glucocorticoid receptor antagonism prevents microglia-mediated neuronal remodeling and behavioral despair following chronic unpredictable stress. Brain Behav Immun. 2019.https://doi.org/10.1016/j.bbi.2019.06.030.ArticlePubMedGoogle Scholar Horchar MJ, Wohleb ES. Glucocorticoid receptor antagonism prevents microglia-mediated neuronal remodeling and behavioral despair following chronic unpredictable stress. Brain Behav Immun. 2019.https://doi.org/10.1016/j.bbi.2019.06.030. ArticlePubMedGoogle Scholar Horchar MJ, Wohleb ES. Glucocorticoid receptor antagonism prevents microglia-mediated neuronal remodeling and behavioral despair following chronic unpredictable stress. Brain Behav Immun. 2019.https://doi.org/10.1016/j.bbi.2019.06.030. ArticlePubMedGoogle Scholar Bollinger JL, Horchar MJ, Wohleb ES. Diazepam limits microglia-mediated neuronal remodeling in the prefrontal cortex and associated behavioral consequences following chronic unpredictable stress. Neuropsychopharmacology. 2020.https://doi.org/10.1038/s41386-020-0720-1.ArticlePubMedPubMed CentralGoogle Scholar Bollinger JL, Horchar MJ, Wohleb ES. Diazepam limits microglia-mediated neuronal remodeling in the prefrontal cortex and associated behavioral consequences following chronic unpredictable stress. Neuropsychopharmacology. 2020.https://doi.org/10.1038/s41386-020-0720-1. ArticlePubMedPubMed CentralGoogle Scholar Bollinger JL, Horchar MJ, Wohleb ES. Diazepam limits microglia-mediated neuronal remodeling in the prefrontal cortex and associated behavioral consequences following chronic unpredictable stress. Neuropsychopharmacology. 2020.https://doi.org/10.1038/s41386-020-0720-1. ArticlePubMedPubMed CentralGoogle Scholar Kopp BL, Wick D, Herman JP. Differential effects of homotypic vs heterotypic chronic stress regimens on microglial activation in the prefrontal cortex. Physiol Behav. 2013;122:246–52.https://doi.org/10.1016/j.physbeh.2013.05.030.ArticlePubMedCASGoogle Scholar Kopp BL, Wick D, Herman JP. Differential effects of homotypic vs heterotypic chronic stress regimens on microglial activation in the prefrontal cortex. Physiol Behav. 2013;122:246–52.https://doi.org/10.1016/j.physbeh.2013.05.030. ArticlePubMedCASGoogle Scholar Kopp BL, Wick D, Herman JP. Differential effects of homotypic vs heterotypic chronic stress regimens on microglial activation in the prefrontal cortex. Physiol Behav. 2013;122:246–52.https://doi.org/10.1016/j.physbeh.2013.05.030. ArticlePubMedCASGoogle Scholar Lehmann ML, Cooper HA, Maric D, Herkenham M. Social defeat induces depressive-like states and microglial activation without involvement of peripheral macrophages. J Neuroinflammation. 2016;13:1–19.https://doi.org/10.1186/s12974-016-0672-x.ArticleCASGoogle Scholar Lehmann ML, Cooper HA, Maric D, Herkenham M. Social defeat induces depressive-like states and microglial activation without involvement of peripheral macrophages. J Neuroinflammation. 2016;13:1–19.https://doi.org/10.1186/s12974-016-0672-x. ArticleCASGoogle Scholar Lehmann ML, Cooper HA, Maric D, Herkenham M. Social defeat induces depressive-like states and microglial activation without involvement of peripheral macrophages. J Neuroinflammation. 2016;13:1–19.https://doi.org/10.1186/s12974-016-0672-x. ArticleCASGoogle Scholar Mackaness GB. Cellular Resistance to Infection. J Exp Med. 1962;116:381–406.https://doi.org/10.1002/iroh.19620470121.ArticlePubMedPubMed CentralCASGoogle Scholar Mackaness GB. Cellular Resistance to Infection. J Exp Med. 1962;116:381–406.https://doi.org/10.1002/iroh.19620470121. ArticlePubMedPubMed CentralCASGoogle Scholar Mackaness GB. Cellular Resistance to Infection. J Exp Med. 1962;116:381–406.https://doi.org/10.1002/iroh.19620470121. ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Powell ND, Godbout JP, Sheridan JF. Stress-induced recruitment of bone marrow-derived monocytes to the brain promotes anxiety-like behavior. J Neurosci. 2013;33:13820–33.ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Powell ND, Godbout JP, Sheridan JF. Stress-induced recruitment of bone marrow-derived monocytes to the brain promotes anxiety-like behavior. J Neurosci. 2013;33:13820–33. ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Powell ND, Godbout JP, Sheridan JF. Stress-induced recruitment of bone marrow-derived monocytes to the brain promotes anxiety-like behavior. J Neurosci. 2013;33:13820–33. ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Patterson JM, Sharma V, Quan N, Godbout JP, Sheridan JF. Knockdown of interleukin-1 receptor type-1 on endothelial cells attenuated stress-induced neuroinflammation and prevented anxiety-like behavior. J Neurosci. 2014;34:2583–91.ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Patterson JM, Sharma V, Quan N, Godbout JP, Sheridan JF. Knockdown of interleukin-1 receptor type-1 on endothelial cells attenuated stress-induced neuroinflammation and prevented anxiety-like behavior. J Neurosci. 2014;34:2583–91. ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, Patterson JM, Sharma V, Quan N, Godbout JP, Sheridan JF. Knockdown of interleukin-1 receptor type-1 on endothelial cells attenuated stress-induced neuroinflammation and prevented anxiety-like behavior. J Neurosci. 2014;34:2583–91. ArticlePubMedPubMed CentralCASGoogle Scholar Wohleb ES, McKim DB, Shea DT, Powell ND, Tarr AJ, Sheridan JF, et al. Re-establishment of anxiety in stress-sensitized mice is caused by monocyte trafficking from the spleen to the brain. Biol Psychiatry. 2014;75:970–81.https://doi.org/10.1016/j.biopsych.2013.11.029.ArticlePubMedCASGoogle Scholar Wohleb ES, McKim DB, Shea DT, Powell ND, Tarr AJ, Sheridan JF, et al. Re-establishment of anxiety in stress-sensitized mice is caused by monocyte trafficking from the spleen to the brain. Biol Psychiatry. 2014;75:970–81.https://doi.org/10.1016/j.biopsych.2013.11.029. ArticlePubMedCASGoogle Scholar Wohleb ES, McKim DB, Shea DT, Powell ND, Tarr AJ, Sheridan JF, et al. Re-establishment of anxiety in stress-sensitized mice is caused by monocyte trafficking from the spleen to the brain. Biol Psychiatry. 2014;75:970–81.https://doi.org/10.1016/j.biopsych.2013.11.029. ArticlePubMedCASGoogle Scholar Lehmann ML, Weigel TK, Cooper HA, Elkahloun AG, Kigar SL, Herkenham M. Decoding microglia responses to psychosocial stress reveals blood-brain barrier breakdown that may drive stress susceptibility. Sci Rep. 2018;8:1–19.https://doi.org/10.1038/s41598-018-28737-8.ArticleCASGoogle Scholar Lehmann ML, Weigel TK, Cooper HA, Elkahloun AG, Kigar SL, Herkenham M. Decoding microglia responses to psychosocial stress reveals blood-brain barrier breakdown that may drive stress susceptibility. Sci Rep. 2018;8:1–19.https://doi.org/10.1038/s41598-018-28737-8. ArticleCASGoogle Scholar Lehmann ML, Weigel TK, Cooper HA, Elkahloun AG, Kigar SL, Herkenham M. Decoding microglia responses to psychosocial stress reveals blood-brain barrier breakdown that may drive stress susceptibility. Sci Rep. 2018;8:1–19.https://doi.org/10.1038/s41598-018-28737-8. ArticleCASGoogle Scholar Menard C, Pfau ML, Hodes GE, Kana V, Wang VX, Bouchard S, et al. Social stress induces neurovascular pathology promoting depression. Nat Neurosci. 2017;20:1752–60.https://doi.org/10.1038/s41593-017-0010-3.ArticlePubMedPubMed CentralCASGoogle Scholar Menard C, Pfau ML, Hodes GE, Kana V, Wang VX, Bouchard S, et al. Social stress induces neurovascular pathology promoting depression. Nat Neurosci. 2017;20:1752–60.https://doi.org/10.1038/s41593-017-0010-3. ArticlePubMedPubMed CentralCASGoogle Scholar Menard C, Pfau ML, Hodes GE, Kana V, Wang VX, Bouchard S, et al. Social stress induces neurovascular pathology promoting depression. Nat Neurosci. 2017;20:1752–60.https://doi.org/10.1038/s41593-017-0010-3. ArticlePubMedPubMed CentralCASGoogle Scholar Wilkinson FL, Sergijenko A, Langford-Smith KJ, Malinowska M, Wynn RF, Bigger BW. Busulfan conditioning enhances engraftment of hematopoietic donor-derived cells in the brain compared with irradiation. Mol Ther. 2013;21:868–76.https://doi.org/10.1038/mt.2013.29.ArticlePubMedPubMed CentralCASGoogle Scholar Wilkinson FL, Sergijenko A, Langford-Smith KJ, Malinowska M, Wynn RF, Bigger BW. Busulfan conditioning enhances engraftment of hematopoietic donor-derived cells in the brain compared with irradiation. Mol Ther. 2013;21:868–76.https://doi.org/10.1038/mt.2013.29. ArticlePubMedPubMed CentralCASGoogle Scholar Wilkinson FL, Sergijenko A, Langford-Smith KJ, Malinowska M, Wynn RF, Bigger BW. Busulfan conditioning enhances engraftment of hematopoietic donor-derived cells in the brain compared with irradiation. Mol Ther. 2013;21:868–76.https://doi.org/10.1038/mt.2013.29. ArticlePubMedPubMed CentralCASGoogle Scholar Lehmann ML, Poffenberger CN, Elkahloun AG, Herkenham M. Analysis of cerebrovascular dysfunction caused by chronic social defeat in mice. Brain Behav Immun. 2020;88:735–47.ArticlePubMedPubMed CentralCASGoogle Scholar Lehmann ML, Poffenberger CN, Elkahloun AG, Herkenham M. Analysis of cerebrovascular dysfunction caused by chronic social defeat in mice. Brain Behav Immun. 2020;88:735–47. ArticlePubMedPubMed CentralCASGoogle Scholar Lehmann ML, Poffenberger CN, Elkahloun AG, Herkenham M. Analysis of cerebrovascular dysfunction caused by chronic social defeat in mice. Brain Behav Immun. 2020;88:735–47. ArticlePubMedPubMed CentralCASGoogle Scholar Sial OK, Warren BL, Alcantara LF, Parise EM, Bolaños-Guzmán CA. Vicarious social defeat stress: Bridging the gap between physical and emotional stress. J Neurosci Methods. 2016;258:94–103.ArticlePubMedGoogle Scholar Sial OK, Warren BL, Alcantara LF, Parise EM, Bolaños-Guzmán CA. Vicarious social defeat stress: Bridging the gap between physical and emotional stress. J Neurosci Methods. 2016;258:94–103. ArticlePubMedGoogle Scholar Sial OK, Warren BL, Alcantara LF, Parise EM, Bolaños-Guzmán CA. Vicarious social defeat stress: Bridging the gap between physical and emotional stress. J Neurosci Methods. 2016;258:94–103. ArticlePubMedGoogle Scholar Golden SA, Covington HE, Berton O, Russo SJ. A standardized protocol for repeated social defeat stress in mice. Nat Protoc. 2011;6:1183–91.ArticlePubMedPubMed CentralCASGoogle Scholar Golden SA, Covington HE, Berton O, Russo SJ. A standardized protocol for repeated social defeat stress in mice. Nat Protoc. 2011;6:1183–91. ArticlePubMedPubMed CentralCASGoogle Scholar Golden SA, Covington HE, Berton O, Russo SJ. A standardized protocol for repeated social defeat stress in mice. Nat Protoc. 2011;6:1183–91. ArticlePubMedPubMed CentralCASGoogle Scholar Xu Z, Dong Y, Wang H, Culley DJ, Marcantonio ER, Crosby G, et al. Peripheral surgical wounding and age-dependent neuroinflammation in mice. PLoS ONE. 2014;9:4–10.Google Scholar Xu Z, Dong Y, Wang H, Culley DJ, Marcantonio ER, Crosby G, et al. Peripheral surgical wounding and age-dependent neuroinflammation in mice. PLoS ONE. 2014;9:4–10. Google Scholar Xu Z, Dong Y, Wang H, Culley DJ, Marcantonio ER, Crosby G, et al. Peripheral surgical wounding and age-dependent neuroinflammation in mice. PLoS ONE. 2014;9:4–10. Google Scholar Wohleb ES, Terwilliger R, Duman CH, Duman RS. Stress-Induced Neuronal Colony Stimulating Factor 1 Provokes Microglia-Mediated Neuronal Remodeling and Depressive-like Behavior. Biol Psychiatry. 2018;83:38–49.https://doi.org/10.1016/j.biopsych.2017.05.026.ArticlePubMedCASGoogle Scholar Wohleb ES, Terwilliger R, Duman CH, Duman RS. Stress-Induced Neuronal Colony Stimulating Factor 1 Provokes Microglia-Mediated Neuronal Remodeling and Depressive-like Behavior. Biol Psychiatry. 2018;83:38–49.https://doi.org/10.1016/j.biopsych.2017.05.026. ArticlePubMedCASGoogle Scholar Wohleb ES, Terwilliger R, Duman CH, Duman RS. Stress-Induced Neuronal Colony Stimulating Factor 1 Provokes Microglia-Mediated Neuronal Remodeling and Depressive-like Behavior. Biol Psychiatry. 2018;83:38–49.https://doi.org/10.1016/j.biopsych.2017.05.026. ArticlePubMedCASGoogle Scholar Herman JP. Neural control of chronic stress adaptation. Front Behav Neurosci. 2013;7:1–12.ArticleGoogle Scholar Herman JP. Neural control of chronic stress adaptation. Front Behav Neurosci. 2013;7:1–12. ArticleGoogle Scholar Herman JP. Neural control of chronic stress adaptation. Front Behav Neurosci. 2013;7:1–12. ArticleGoogle Scholar Ulrich-Lai YM, Herman JP. Neural regulation of endocrine and autonomic stress responses. Nat Rev Neurosci. 2009;10:397–409.ArticlePubMedPubMed CentralCASGoogle Scholar Ulrich-Lai YM, Herman JP. Neural regulation of endocrine and autonomic stress responses. Nat Rev Neurosci. 2009;10:397–409. ArticlePubMedPubMed CentralCASGoogle Scholar Ulrich-Lai YM, Herman JP. Neural regulation of endocrine and autonomic stress responses. Nat Rev Neurosci. 2009;10:397–409. ArticlePubMedPubMed CentralCASGoogle Scholar Luczynski P, Moquin L, Gratton A. Chronic stress alters the dendritic morphology of callosal neurons and the acute glutamate stress response in the rat medial prefrontal cortex. Stress. 2015;18:654–67.ArticlePubMedCASGoogle Scholar Luczynski P, Moquin L, Gratton A. Chronic stress alters the dendritic morphology of callosal neurons and the acute glutamate stress response in the rat medial prefrontal cortex. Stress. 2015;18:654–67. ArticlePubMedCASGoogle Scholar Luczynski P, Moquin L, Gratton A. Chronic stress alters the dendritic morphology of callosal neurons and the acute glutamate stress response in the rat medial prefrontal cortex. Stress. 2015;18:654–67. ArticlePubMedCASGoogle Scholar Ayash S, Schmitt U, Müller MB. Chronic social defeat-induced social avoidance as a proxy of stress resilience in mice involves conditioned learning. J Psychiatr Res. 2020;120:64–71.https://doi.org/10.1016/j.jpsychires.2019.10.001.ArticlePubMedGoogle Scholar Ayash S, Schmitt U, Müller MB. Chronic social defeat-induced social avoidance as a proxy of stress resilience in mice involves conditioned learning. J Psychiatr Res. 2020;120:64–71.https://doi.org/10.1016/j.jpsychires.2019.10.001. ArticlePubMedGoogle Scholar Ayash S, Schmitt U, Müller MB. Chronic social defeat-induced social avoidance as a proxy of stress resilience in mice involves conditioned learning. J Psychiatr Res. 2020;120:64–71.https://doi.org/10.1016/j.jpsychires.2019.10.001. ArticlePubMedGoogle Scholar Hawkins J, Hicks RA, Phillips N, Moore JD. Swimming rats and human depression. Nature. 1978;274:460–2.ArticleGoogle Scholar Hawkins J, Hicks RA, Phillips N, Moore JD. Swimming rats and human depression. Nature. 1978;274:460–2. ArticleGoogle Scholar Hawkins J, Hicks RA, Phillips N, Moore JD. Swimming rats and human depression. Nature. 1978;274:460–2. ArticleGoogle Scholar Riga D, Theijs JT, De Vries TJ, Smit AB, Spijker S. Social defeat-induced anhedonia: effects on operant sucrose-seeking behavior. Front Behav Neurosci. 2015;9:1–12.ArticleGoogle Scholar Riga D, Theijs JT, De Vries TJ, Smit AB, Spijker S. Social defeat-induced anhedonia: effects on operant sucrose-seeking behavior. Front Behav Neurosci. 2015;9:1–12. ArticleGoogle Scholar Riga D, Theijs JT, De Vries TJ, Smit AB, Spijker S. Social defeat-induced anhedonia: effects on operant sucrose-seeking behavior. Front Behav Neurosci. 2015;9:1–12. ArticleGoogle Scholar Dieterich A, Srivastava P, Sharif A, Stech K, Floeder J, Yohn SE, et al. Chronic corticosterone administration induces negative valence and impairs positive valence behaviors in mice. Transl Psychiatry. 2019.https://doi.org/10.1038/s41398-019-0674-4.ArticlePubMedPubMed CentralGoogle Scholar Dieterich A, Srivastava P, Sharif A, Stech K, Floeder J, Yohn SE, et al. Chronic corticosterone administration induces negative valence and impairs positive valence behaviors in mice. Transl Psychiatry. 2019.https://doi.org/10.1038/s41398-019-0674-4. ArticlePubMedPubMed CentralGoogle Scholar Dieterich A, Srivastava P, Sharif A, Stech K, Floeder J, Yohn SE, et al. Chronic corticosterone administration induces negative valence and impairs positive valence behaviors in mice. Transl Psychiatry. 2019.https://doi.org/10.1038/s41398-019-0674-4. ArticlePubMedPubMed CentralGoogle Scholar Dieterich A, Stech K, Srivastava P, Lee J, Sharif A, Samuels BA. Chronic corticosterone shifts effort-related choice behavior in male mice. Psychopharmacology. 2020;237:2103–10.ArticlePubMedPubMed CentralCASGoogle Scholar Dieterich A, Stech K, Srivastava P, Lee J, Sharif A, Samuels BA. Chronic corticosterone shifts effort-related choice behavior in male mice. Psychopharmacology. 2020;237:2103–10. ArticlePubMedPubMed CentralCASGoogle Scholar Dieterich A, Stech K, Srivastava P, Lee J, Sharif A, Samuels BA. Chronic corticosterone shifts effort-related choice behavior in male mice. Psychopharmacology. 2020;237:2103–10. ArticlePubMedPubMed CentralCASGoogle Scholar Alves-dos-Santos L, de Resende LS, Chiavegatto S. Susceptibility and resilience to chronic social defeat stress in adolescent male mice: No correlation between social avoidance and sucrose preference. Neurobiol Stress. 2020.https://doi.org/10.1016/j.ynstr.2020.100221.ArticlePubMedPubMed CentralGoogle Scholar Alves-dos-Santos L, de Resende LS, Chiavegatto S. Susceptibility and resilience to chronic social defeat stress in adolescent male mice: No correlation between social avoidance and sucrose preference. Neurobiol Stress. 2020.https://doi.org/10.1016/j.ynstr.2020.100221. ArticlePubMedPubMed CentralGoogle Scholar Alves-dos-Santos L, de Resende LS, Chiavegatto S. Susceptibility and resilience to chronic social defeat stress in adolescent male mice: No correlation between social avoidance and sucrose preference. Neurobiol Stress. 2020.https://doi.org/10.1016/j.ynstr.2020.100221. ArticlePubMedPubMed CentralGoogle Scholar Yuen EY, Wei J, Liu W, Zhong P, Li X, Yan Z. Repeated stress causes cognitive impairment by suppressing glutamate receptor expression and function in prefrontal cortex. Neuron. 2012;73:962–77.ArticlePubMedPubMed CentralCASGoogle Scholar Yuen EY, Wei J, Liu W, Zhong P, Li X, Yan Z. Repeated stress causes cognitive impairment by suppressing glutamate receptor expression and function in prefrontal cortex. Neuron. 2012;73:962–77. ArticlePubMedPubMed CentralCASGoogle Scholar Yuen EY, Wei J, Liu W, Zhong P, Li X, Yan Z. Repeated stress causes cognitive impairment by suppressing glutamate receptor expression and function in prefrontal cortex. Neuron. 2012;73:962–77. ArticlePubMedPubMed CentralCASGoogle Scholar Tauber AI. Metchnikoff and the phagocytosis theory. Nat Rev Mol Cell Biol. 2003;4:897–901.ArticlePubMedCASGoogle Scholar Tauber AI. Metchnikoff and the phagocytosis theory. Nat Rev Mol Cell Biol. 2003;4:897–901. ArticlePubMedCASGoogle Scholar Tauber AI. Metchnikoff and the phagocytosis theory. Nat Rev Mol Cell Biol. 2003;4:897–901. ArticlePubMedCASGoogle Scholar Medzhitov R. Origin and physiological roles of inflammation. Nature. 2008;454:428–35.ArticlePubMedCASGoogle Scholar Medzhitov R. Origin and physiological roles of inflammation. Nature. 2008;454:428–35. ArticlePubMedCASGoogle Scholar Medzhitov R. Origin and physiological roles of inflammation. Nature. 2008;454:428–35. ArticlePubMedCASGoogle Scholar Liu T, Lu J, Lukasiewicz K, Pan B, Zuo Y. Stress induces microglia-associated synaptic circuit alterations in the dorsomedial prefrontal cortex. Neurobiol Stress. 2021;15:100342.ArticlePubMedPubMed CentralGoogle Scholar Liu T, Lu J, Lukasiewicz K, Pan B, Zuo Y. Stress induces microglia-associated synaptic circuit alterations in the dorsomedial prefrontal cortex. Neurobiol Stress. 2021;15:100342. ArticlePubMedPubMed CentralGoogle Scholar Liu T, Lu J, Lukasiewicz K, Pan B, Zuo Y. Stress induces microglia-associated synaptic circuit alterations in the dorsomedial prefrontal cortex. Neurobiol Stress. 2021;15:100342. ArticlePubMedPubMed CentralGoogle Scholar Nair A, Bonneau RH. Stress-induced elevation of glucocorticoids increases microglia proliferation through NMDA receptor activation. J Neuroimmunol. 2006;171:72–85.ArticlePubMedCASGoogle Scholar Nair A, Bonneau RH. Stress-induced elevation of glucocorticoids increases microglia proliferation through NMDA receptor activation. J Neuroimmunol. 2006;171:72–85. ArticlePubMedCASGoogle Scholar Nair A, Bonneau RH. Stress-induced elevation of glucocorticoids increases microglia proliferation through NMDA receptor activation. J Neuroimmunol. 2006;171:72–85. ArticlePubMedCASGoogle Scholar Sugama S, Takenouchi T, Fujita M, Conti B, Hashimoto M. Differential microglial activation between acute stress and lipopolysaccharide treatment. J Neuroimmunol. 2009;207:24–31.https://doi.org/10.1016/j.jneuroim.2008.11.007.ArticlePubMedCASGoogle Scholar Sugama S, Takenouchi T, Fujita M, Conti B, Hashimoto M. Differential microglial activation between acute stress and lipopolysaccharide treatment. J Neuroimmunol. 2009;207:24–31.https://doi.org/10.1016/j.jneuroim.2008.11.007. ArticlePubMedCASGoogle Scholar Sugama S, Takenouchi T, Fujita M, Conti B, Hashimoto M. Differential microglial activation between acute stress and lipopolysaccharide treatment. J Neuroimmunol. 2009;207:24–31.https://doi.org/10.1016/j.jneuroim.2008.11.007. ArticlePubMedCASGoogle Scholar Zhou L-J, Peng J, Xu Y-N, Tan Z, Liu X-G. Microglia are indispensable for synaptic plasticity in the spinal dorsal horn and chronic pain. Cell Rep. 2019;27:3844–59.ArticlePubMedPubMed CentralCASGoogle Scholar Zhou L-J, Peng J, Xu Y-N, Tan Z, Liu X-G. Microglia are indispensable for synaptic plasticity in the spinal dorsal horn and chronic pain. Cell Rep. 2019;27:3844–59. ArticlePubMedPubMed CentralCASGoogle Scholar Zhou L-J, Peng J, Xu Y-N, Tan Z, Liu X-G. Microglia are indispensable for synaptic plasticity in the spinal dorsal horn and chronic pain. Cell Rep. 2019;27:3844–59. ArticlePubMedPubMed CentralCASGoogle Scholar Luo J, Elwood F, Britschgi M, Villeda S, Zhang H, Ding Z, et al. Colony-stimulating factor 1 receptor (CSF1R) signaling in injured neurons facilitates protection and survival. J Exp Med. 2013;210:157–72.ArticlePubMedPubMed CentralCASGoogle Scholar Luo J, Elwood F, Britschgi M, Villeda S, Zhang H, Ding Z, et al. Colony-stimulating factor 1 receptor (CSF1R) signaling in injured neurons facilitates protection and survival. J Exp Med. 2013;210:157–72. ArticlePubMedPubMed CentralCASGoogle Scholar Luo J, Elwood F, Britschgi M, Villeda S, Zhang H, Ding Z, et al. Colony-stimulating factor 1 receptor (CSF1R) signaling in injured neurons facilitates protection and survival. J Exp Med. 2013;210:157–72. ArticlePubMedPubMed CentralCASGoogle Scholar Yuen EY, Liu W, Karatsoreos IN, Feng J, McEwen BS, Yan Z. Acute stress enhances glutamatergic transmission in prefrontal cortex and facilitates working memory. Proc Natl Acad Sci U S A. 2009;106:14075–9.ArticlePubMedPubMed CentralCASGoogle Scholar Yuen EY, Liu W, Karatsoreos IN, Feng J, McEwen BS, Yan Z. Acute stress enhances glutamatergic transmission in prefrontal cortex and facilitates working memory. Proc Natl Acad Sci U S A. 2009;106:14075–9. ArticlePubMedPubMed CentralCASGoogle Scholar Yuen EY, Liu W, Karatsoreos IN, Feng J, McEwen BS, Yan Z. Acute stress enhances glutamatergic transmission in prefrontal cortex and facilitates working memory. Proc Natl Acad Sci U S A. 2009;106:14075–9. ArticlePubMedPubMed CentralCASGoogle Scholar Bagley J, Moghaddam B. Temporal dynamics of glutamate efflux in the prefrontal cortex and in the hippocampus following repeated stress: effects of pretreatment with saline or diazepam: Neuroscience. 1997;77:65–73.ArticlePubMedCASGoogle Scholar Bagley J, Moghaddam B. Temporal dynamics of glutamate efflux in the prefrontal cortex and in the hippocampus following repeated stress: effects of pretreatment with saline or diazepam: Neuroscience. 1997;77:65–73. ArticlePubMedCASGoogle Scholar Bagley J, Moghaddam B. Temporal dynamics of glutamate efflux in the prefrontal cortex and in the hippocampus following repeated stress: effects of pretreatment with saline or diazepam: Neuroscience. 1997;77:65–73. ArticlePubMedCASGoogle Scholar Moghaddam B, Bolinao ML, Stein-Behrens B, Sapolsky R. Glucocortcoids mediate the stress-induced extracellular accumulation of glutamate. Brain Res. 1994;655:251–4.ArticlePubMedCASGoogle Scholar Moghaddam B, Bolinao ML, Stein-Behrens B, Sapolsky R. Glucocortcoids mediate the stress-induced extracellular accumulation of glutamate. Brain Res. 1994;655:251–4. ArticlePubMedCASGoogle Scholar Moghaddam B, Bolinao ML, Stein-Behrens B, Sapolsky R. Glucocortcoids mediate the stress-induced extracellular accumulation of glutamate. Brain Res. 1994;655:251–4. ArticlePubMedCASGoogle Scholar Popoli M, Yan Z, McEwen BS, Sanacora G. The stressed synapse: The impact of stress and glucocorticoids on glutamate transmission. Nat Rev Neurosci. 2012;13:22–37.ArticleCASGoogle Scholar Popoli M, Yan Z, McEwen BS, Sanacora G. The stressed synapse: The impact of stress and glucocorticoids on glutamate transmission. Nat Rev Neurosci. 2012;13:22–37. ArticleCASGoogle Scholar Popoli M, Yan Z, McEwen BS, Sanacora G. The stressed synapse: The impact of stress and glucocorticoids on glutamate transmission. Nat Rev Neurosci. 2012;13:22–37. ArticleCASGoogle Scholar McEwen BS, Bowles NP, Gray JD, Hill MN, Hunter RG, Karatsoreos IN, et al. Mechanisms of stress in the brain. Nat Neurosci. 2015;18:1353–63.ArticlePubMedPubMed CentralCASGoogle Scholar McEwen BS, Bowles NP, Gray JD, Hill MN, Hunter RG, Karatsoreos IN, et al. Mechanisms of stress in the brain. Nat Neurosci. 2015;18:1353–63. ArticlePubMedPubMed CentralCASGoogle Scholar McEwen BS, Bowles NP, Gray JD, Hill MN, Hunter RG, Karatsoreos IN, et al. Mechanisms of stress in the brain. Nat Neurosci. 2015;18:1353–63. ArticlePubMedPubMed CentralCASGoogle Scholar McEwen BS. Allostasis, allostatic load, and the aging nervous system: role of excitatory amino acids and excitotoxicity. Neurochem Res. 2000;25:1219–31.ArticlePubMedCASGoogle Scholar McEwen BS. Allostasis, allostatic load, and the aging nervous system: role of excitatory amino acids and excitotoxicity. Neurochem Res. 2000;25:1219–31. ArticlePubMedCASGoogle Scholar McEwen BS. Allostasis, allostatic load, and the aging nervous system: role of excitatory amino acids and excitotoxicity. Neurochem Res. 2000;25:1219–31. ArticlePubMedCASGoogle Scholar Sapolsky RM. Glucocorticoids, stress and exacerbation of excitotoxic neuron death. Semin Neurosci. 1994.https://doi.org/10.1006/smns.1994.1041.ArticleGoogle Scholar Sapolsky RM. Glucocorticoids, stress and exacerbation of excitotoxic neuron death. Semin Neurosci. 1994.https://doi.org/10.1006/smns.1994.1041. ArticleGoogle Scholar Sapolsky RM. Glucocorticoids, stress and exacerbation of excitotoxic neuron death. Semin Neurosci. 1994.https://doi.org/10.1006/smns.1994.1041. ArticleGoogle Scholar Zoppi S, Pérez Nievas BG, Madrigal JLM, Manzanares J, Leza JC, García-Bueno B. Regulatory role of cannabinoid receptor 1 in stress-induced excitotoxicity and neuroinflammation. Neuropsychopharmacology. 2011;36:805–18.ArticlePubMedCASGoogle Scholar Zoppi S, Pérez Nievas BG, Madrigal JLM, Manzanares J, Leza JC, García-Bueno B. Regulatory role of cannabinoid receptor 1 in stress-induced excitotoxicity and neuroinflammation. Neuropsychopharmacology. 2011;36:805–18. ArticlePubMedCASGoogle Scholar Zoppi S, Pérez Nievas BG, Madrigal JLM, Manzanares J, Leza JC, García-Bueno B. Regulatory role of cannabinoid receptor 1 in stress-induced excitotoxicity and neuroinflammation. Neuropsychopharmacology. 2011;36:805–18. ArticlePubMedCASGoogle Scholar Takahashi T, Kimoto T, Tanabe N, Hattori T, Yasumatsu N, Kawato S. Corticosterone acutely prolonged N-methyl-D-aspartate receptor-mediated Ca2+ elevation in cultured rat hippocampal neurons. J Neurochem. 2002;83:1441–51.ArticlePubMedCASGoogle Scholar Takahashi T, Kimoto T, Tanabe N, Hattori T, Yasumatsu N, Kawato S. Corticosterone acutely prolonged N-methyl-D-aspartate receptor-mediated Ca2+ elevation in cultured rat hippocampal neurons. J Neurochem. 2002;83:1441–51. ArticlePubMedCASGoogle Scholar Takahashi T, Kimoto T, Tanabe N, Hattori T, Yasumatsu N, Kawato S. Corticosterone acutely prolonged N-methyl-D-aspartate receptor-mediated Ca2+ elevation in cultured rat hippocampal neurons. J Neurochem. 2002;83:1441–51. ArticlePubMedCASGoogle Scholar Liu R, Aghajanian GK. Stress blunts serotonin- and hypocretin-evoked EPSCs in prefrontal cortex: Role of corticosterone-mediated apical dendritic atrophy. Proc Natl Acad Sci. 2008;105:359–64.ArticlePubMedPubMed CentralCASGoogle Scholar Liu R, Aghajanian GK. Stress blunts serotonin- and hypocretin-evoked EPSCs in prefrontal cortex: Role of corticosterone-mediated apical dendritic atrophy. Proc Natl Acad Sci. 2008;105:359–64. ArticlePubMedPubMed CentralCASGoogle Scholar Liu R, Aghajanian GK. Stress blunts serotonin- and hypocretin-evoked EPSCs in prefrontal cortex: Role of corticosterone-mediated apical dendritic atrophy. Proc Natl Acad Sci. 2008;105:359–64. ArticlePubMedPubMed CentralCASGoogle Scholar Cook SC, Wellman CL. Chronic stress alters dendritic morphology in rat medial prefrontal cortex. J Neurobiol. 2004;60:236–48.ArticlePubMedGoogle Scholar Cook SC, Wellman CL. Chronic stress alters dendritic morphology in rat medial prefrontal cortex. J Neurobiol. 2004;60:236–48. ArticlePubMedGoogle Scholar Cook SC, Wellman CL. Chronic stress alters dendritic morphology in rat medial prefrontal cortex. J Neurobiol. 2004;60:236–48. ArticlePubMedGoogle Scholar Wellman CL. Dendritic reorganization in pyramidal neurons in medial prefrontal cortex after chronic corticosterone administration. Corticosterone Prefrontal Morphol. 2001;49:245–53.CASGoogle Scholar Wellman CL. Dendritic reorganization in pyramidal neurons in medial prefrontal cortex after chronic corticosterone administration. Corticosterone Prefrontal Morphol. 2001;49:245–53. CASGoogle Scholar Wellman CL. Dendritic reorganization in pyramidal neurons in medial prefrontal cortex after chronic corticosterone administration. Corticosterone Prefrontal Morphol. 2001;49:245–53. CASGoogle Scholar Holmes A, Wellman CL. Stress-induced prefrontal reorganization and executive dysfunction in rodents. Neurosci Biobehav Rev. 2009;33:773–83.ArticlePubMedGoogle Scholar Holmes A, Wellman CL. Stress-induced prefrontal reorganization and executive dysfunction in rodents. Neurosci Biobehav Rev. 2009;33:773–83. ArticlePubMedGoogle Scholar Holmes A, Wellman CL. Stress-induced prefrontal reorganization and executive dysfunction in rodents. Neurosci Biobehav Rev. 2009;33:773–83. ArticlePubMedGoogle Scholar Radley JJ, Rocher AB, Miller M, Janssen WGM, Liston C, Hof PR, et al. Repeated stress induces dendritic spine loss in the rat medial prefrontal cortex. Cereb Cortex. 2006;16:313–20.ArticlePubMedGoogle Scholar Radley JJ, Rocher AB, Miller M, Janssen WGM, Liston C, Hof PR, et al. Repeated stress induces dendritic spine loss in the rat medial prefrontal cortex. Cereb Cortex. 2006;16:313–20. ArticlePubMedGoogle Scholar Radley JJ, Rocher AB, Miller M, Janssen WGM, Liston C, Hof PR, et al. Repeated stress induces dendritic spine loss in the rat medial prefrontal cortex. Cereb Cortex. 2006;16:313–20. ArticlePubMedGoogle Scholar Goldwater DS, Pavlides C, Hunter RG, Bloss EB, Hof PR, McEwen BS, et al. Structural and functional alterations to rat medial prefrontal cortex following chronic restraint stress and recovery. Neuroscience. 2009;164:798–808.https://doi.org/10.1016/j.neuroscience.2009.08.053.ArticlePubMedCASGoogle Scholar Goldwater DS, Pavlides C, Hunter RG, Bloss EB, Hof PR, McEwen BS, et al. Structural and functional alterations to rat medial prefrontal cortex following chronic restraint stress and recovery. Neuroscience. 2009;164:798–808.https://doi.org/10.1016/j.neuroscience.2009.08.053. ArticlePubMedCASGoogle Scholar Goldwater DS, Pavlides C, Hunter RG, Bloss EB, Hof PR, McEwen BS, et al. Structural and functional alterations to rat medial prefrontal cortex following chronic restraint stress and recovery. Neuroscience. 2009;164:798–808.https://doi.org/10.1016/j.neuroscience.2009.08.053. ArticlePubMedCASGoogle Scholar Frank MG, Baratta MV, Sprunger DB, Watkins LR, Maier SF. Microglia serve as a neuroimmune substrate for stress-induced potentiation of CNS pro-inflammatory cytokine responses. Brain Behav Immun. 2007;21:47–59.ArticlePubMedCASGoogle Scholar Frank MG, Baratta MV, Sprunger DB, Watkins LR, Maier SF. Microglia serve as a neuroimmune substrate for stress-induced potentiation of CNS pro-inflammatory cytokine responses. Brain Behav Immun. 2007;21:47–59. ArticlePubMedCASGoogle Scholar Frank MG, Baratta MV, Sprunger DB, Watkins LR, Maier SF. Microglia serve as a neuroimmune substrate for stress-induced potentiation of CNS pro-inflammatory cytokine responses. Brain Behav Immun. 2007;21:47–59. ArticlePubMedCASGoogle Scholar Moda-Sava RN, Murdock MH, Parekh PK, Fetcho RN, Huang BS, Huynh TN, et al. Sustained rescue of prefrontal circuit dysfunction by antidepressant-induced spine formation. Science. 2019;364:1–31.ArticleGoogle Scholar Moda-Sava RN, Murdock MH, Parekh PK, Fetcho RN, Huang BS, Huynh TN, et al. Sustained rescue of prefrontal circuit dysfunction by antidepressant-induced spine formation. Science. 2019;364:1–31. ArticleGoogle Scholar Moda-Sava RN, Murdock MH, Parekh PK, Fetcho RN, Huang BS, Huynh TN, et al. Sustained rescue of prefrontal circuit dysfunction by antidepressant-induced spine formation. Science. 2019;364:1–31. ArticleGoogle Scholar Setiawan E, Wilson AA, Mizrahi R, Rusjan PM, Miler L, Rajkowska G, et al. Role of translocator protein density, a marker of neuroinflammation, in the brain during major depressive episodes. JAMA Psychiat. 2015;72:268–75.ArticleGoogle Scholar Setiawan E, Wilson AA, Mizrahi R, Rusjan PM, Miler L, Rajkowska G, et al. Role of translocator protein density, a marker of neuroinflammation, in the brain during major depressive episodes. JAMA Psychiat. 2015;72:268–75. ArticleGoogle Scholar Setiawan E, Wilson AA, Mizrahi R, Rusjan PM, Miler L, Rajkowska G, et al. Role of translocator protein density, a marker of neuroinflammation, in the brain during major depressive episodes. JAMA Psychiat. 2015;72:268–75. ArticleGoogle Scholar Dowlati Y, Herrmann N, Swardfager W, Liu H, Sham L, Reim EK, et al. A meta-analysis of cytokines in major depression. Biol Psychiatry. 2010;67:446–57.https://doi.org/10.1016/j.biopsych.2009.09.033.ArticleCASPubMedGoogle Scholar Dowlati Y, Herrmann N, Swardfager W, Liu H, Sham L, Reim EK, et al. A meta-analysis of cytokines in major depression. Biol Psychiatry. 2010;67:446–57.https://doi.org/10.1016/j.biopsych.2009.09.033. ArticleCASPubMedGoogle Scholar Dowlati Y, Herrmann N, Swardfager W, Liu H, Sham L, Reim EK, et al. A meta-analysis of cytokines in major depression. Biol Psychiatry. 2010;67:446–57.https://doi.org/10.1016/j.biopsych.2009.09.033. ArticleCASPubMedGoogle Scholar Prasad AS, Fitzgerald JT, Bao B, Beck FWJ, Chandrasekar PH. Duration of symptoms and plasma cytokine levels in patients with the common cold treated with zinc acetate: A randomized, double-blind, placebo-controlled trial. Ann Intern Med. 2000;133:245–52.ArticlePubMedCASGoogle Scholar Prasad AS, Fitzgerald JT, Bao B, Beck FWJ, Chandrasekar PH. Duration of symptoms and plasma cytokine levels in patients with the common cold treated with zinc acetate: A randomized, double-blind, placebo-controlled trial. Ann Intern Med. 2000;133:245–52. ArticlePubMedCASGoogle Scholar Prasad AS, Fitzgerald JT, Bao B, Beck FWJ, Chandrasekar PH. Duration of symptoms and plasma cytokine levels in patients with the common cold treated with zinc acetate: A randomized, double-blind, placebo-controlled trial. Ann Intern Med. 2000;133:245–52. ArticlePubMedCASGoogle Scholar Kemna E, Pickkers P, Nemeth E, Van Der Hoeven H, Swinkels D. Time-course analysis of hepcidin, serum iron, and plasma cytokine levels in humans injected with LPS. Blood. 2005;106:1864–6.ArticlePubMedCASGoogle Scholar Kemna E, Pickkers P, Nemeth E, Van Der Hoeven H, Swinkels D. Time-course analysis of hepcidin, serum iron, and plasma cytokine levels in humans injected with LPS. Blood. 2005;106:1864–6. ArticlePubMedCASGoogle Scholar Kemna E, Pickkers P, Nemeth E, Van Der Hoeven H, Swinkels D. Time-course analysis of hepcidin, serum iron, and plasma cytokine levels in humans injected with LPS. Blood. 2005;106:1864–6. ArticlePubMedCASGoogle Scholar Koch RM, Kox M, Thijs EJM, Rahamat-Langendoen JC, van de Veerdonk FL, Gerretsen J, et al. Development of endotoxin tolerance does not influence the response to a challenge with the mucosal live-attenuated influenza vaccine in humans in vivo. Front Immunol. 2017;8:1–13.ArticleGoogle Scholar Koch RM, Kox M, Thijs EJM, Rahamat-Langendoen JC, van de Veerdonk FL, Gerretsen J, et al. Development of endotoxin tolerance does not influence the response to a challenge with the mucosal live-attenuated influenza vaccine in humans in vivo. Front Immunol. 2017;8:1–13. ArticleGoogle Scholar Koch RM, Kox M, Thijs EJM, Rahamat-Langendoen JC, van de Veerdonk FL, Gerretsen J, et al. Development of endotoxin tolerance does not influence the response to a challenge with the mucosal live-attenuated influenza vaccine in humans in vivo. Front Immunol. 2017;8:1–13. ArticleGoogle Scholar Werry EL, Bright FM, Piguet O, Ittner LM, Halliday GM, Hodges JR, et al. Recent developments in TSPO PET imaging as a biomarker of neuroinflammation in neurodegenerative disorders. Int J Mol Sci. 2019;20:1–21.ArticleGoogle Scholar Werry EL, Bright FM, Piguet O, Ittner LM, Halliday GM, Hodges JR, et al. Recent developments in TSPO PET imaging as a biomarker of neuroinflammation in neurodegenerative disorders. Int J Mol Sci. 2019;20:1–21. ArticleGoogle Scholar Werry EL, Bright FM, Piguet O, Ittner LM, Halliday GM, Hodges JR, et al. Recent developments in TSPO PET imaging as a biomarker of neuroinflammation in neurodegenerative disorders. Int J Mol Sci. 2019;20:1–21. ArticleGoogle Scholar Nutma E, Gebro E, Marzin MC, Valk P, Matthews PM, Owen DR, et al. Activated microglia do not increase 18 kDa translocator protein ( TSPO ) expression in the multiple sclerosis brain. Glia. 2021.https://doi.org/10.1002/glia.24052.ArticlePubMedPubMed CentralGoogle Scholar Nutma E, Gebro E, Marzin MC, Valk P, Matthews PM, Owen DR, et al. Activated microglia do not increase 18 kDa translocator protein ( TSPO ) expression in the multiple sclerosis brain. Glia. 2021.https://doi.org/10.1002/glia.24052. ArticlePubMedPubMed CentralGoogle Scholar Nutma E, Gebro E, Marzin MC, Valk P, Matthews PM, Owen DR, et al. Activated microglia do not increase 18 kDa translocator protein ( TSPO ) expression in the multiple sclerosis brain. Glia. 2021.https://doi.org/10.1002/glia.24052. ArticlePubMedPubMed CentralGoogle Scholar Rizzo G, Veronese M, Tonietto M, Bodini B, Stankoff B, Wimberley C, et al. Generalization of endothelial modelling of TSPO PET imaging: considerations on tracer affinities. J Cereb Blood Flow Metab. 2019;39:874–85.ArticlePubMedCASGoogle Scholar Rizzo G, Veronese M, Tonietto M, Bodini B, Stankoff B, Wimberley C, et al. Generalization of endothelial modelling of TSPO PET imaging: considerations on tracer affinities. J Cereb Blood Flow Metab. 2019;39:874–85. ArticlePubMedCASGoogle Scholar Rizzo G, Veronese M, Tonietto M, Bodini B, Stankoff B, Wimberley C, et al. Generalization of endothelial modelling of TSPO PET imaging: considerations on tracer affinities. J Cereb Blood Flow Metab. 2019;39:874–85. ArticlePubMedCASGoogle Scholar Coughlin JM, Yuchuanwang Y, Minn I, Bienko N, Ambinder EB, Xu X, et al. Imaging of glial cell activation and white matter integrity in brains of active and recently retired national football league players. JAMA Neurol. 2017;74:67–74.ArticlePubMedPubMed CentralGoogle Scholar Coughlin JM, Yuchuanwang Y, Minn I, Bienko N, Ambinder EB, Xu X, et al. Imaging of glial cell activation and white matter integrity in brains of active and recently retired national football league players. JAMA Neurol. 2017;74:67–74. ArticlePubMedPubMed CentralGoogle Scholar Coughlin JM, Yuchuanwang Y, Minn I, Bienko N, Ambinder EB, Xu X, et al. Imaging of glial cell activation and white matter integrity in brains of active and recently retired national football league players. JAMA Neurol. 2017;74:67–74. ArticlePubMedPubMed CentralGoogle Scholar Notter T, Schalbetter SM, Clifton NE, Mattei D, Richetto J, Thomas K, et al. Neuronal activity increases translocator protein (TSPO) levels. Mol Psychiatry. 2020.https://doi.org/10.1038/s41380-020-0745-1.ArticlePubMedPubMed CentralGoogle Scholar Notter T, Schalbetter SM, Clifton NE, Mattei D, Richetto J, Thomas K, et al. Neuronal activity increases translocator protein (TSPO) levels. Mol Psychiatry. 2020.https://doi.org/10.1038/s41380-020-0745-1. ArticlePubMedPubMed CentralGoogle Scholar Notter T, Schalbetter SM, Clifton NE, Mattei D, Richetto J, Thomas K, et al. Neuronal activity increases translocator protein (TSPO) levels. Mol Psychiatry. 2020.https://doi.org/10.1038/s41380-020-0745-1. ArticlePubMedPubMed CentralGoogle Scholar Bottcher C, Fernandez-Zapata C, Snijders GJ, Schlickeiser S, Sneeboer MAM, Kunkel D, et al. Single-cell mass cytometry of microglia in major depressive disorder reveals a non-inflammatory phenotype with increased homeostatic marker expression. Transl Psychiatry. 2020.https://doi.org/10.1038/s41398-020-00992-2.ArticlePubMedPubMed CentralGoogle Scholar Bottcher C, Fernandez-Zapata C, Snijders GJ, Schlickeiser S, Sneeboer MAM, Kunkel D, et al. Single-cell mass cytometry of microglia in major depressive disorder reveals a non-inflammatory phenotype with increased homeostatic marker expression. Transl Psychiatry. 2020.https://doi.org/10.1038/s41398-020-00992-2. ArticlePubMedPubMed CentralGoogle Scholar Bottcher C, Fernandez-Zapata C, Snijders GJ, Schlickeiser S, Sneeboer MAM, Kunkel D, et al. Single-cell mass cytometry of microglia in major depressive disorder reveals a non-inflammatory phenotype with increased homeostatic marker expression. Transl Psychiatry. 2020.https://doi.org/10.1038/s41398-020-00992-2. ArticlePubMedPubMed CentralGoogle Scholar Capuron L, Hauser P, Hinze-selch D, Miller AH, Neveu PJ. Treatment of cytokine-induced depression. Brain Behav Immun. 2002;16:575–80.ArticlePubMedCASGoogle Scholar Capuron L, Hauser P, Hinze-selch D, Miller AH, Neveu PJ. Treatment of cytokine-induced depression. Brain Behav Immun. 2002;16:575–80. ArticlePubMedCASGoogle Scholar Capuron L, Hauser P, Hinze-selch D, Miller AH, Neveu PJ. Treatment of cytokine-induced depression. Brain Behav Immun. 2002;16:575–80. ArticlePubMedCASGoogle Scholar Breitbart W, Rosenfeld B, Tobias K, Pessin H, Ku GY, Yuan J, et al. Depression, cytokines, and pancreatic cancer. Psychooncology. 2014;345:339–45.ArticleGoogle Scholar Breitbart W, Rosenfeld B, Tobias K, Pessin H, Ku GY, Yuan J, et al. Depression, cytokines, and pancreatic cancer. Psychooncology. 2014;345:339–45. ArticleGoogle Scholar Breitbart W, Rosenfeld B, Tobias K, Pessin H, Ku GY, Yuan J, et al. Depression, cytokines, and pancreatic cancer. Psychooncology. 2014;345:339–45. ArticleGoogle Scholar Turvey CL, Schultz SK, Beglinger L, Klein DM. A longitudinal community-based study of chronic illness, cognitive and physical function, and depression. Am J Geriatr Psychiatry. 2009;17:632–41.https://doi.org/10.1097/JGP.0b013e31819c498c.ArticlePubMedPubMed CentralGoogle Scholar Turvey CL, Schultz SK, Beglinger L, Klein DM. A longitudinal community-based study of chronic illness, cognitive and physical function, and depression. Am J Geriatr Psychiatry. 2009;17:632–41.https://doi.org/10.1097/JGP.0b013e31819c498c. ArticlePubMedPubMed CentralGoogle Scholar Turvey CL, Schultz SK, Beglinger L, Klein DM. A longitudinal community-based study of chronic illness, cognitive and physical function, and depression. Am J Geriatr Psychiatry. 2009;17:632–41.https://doi.org/10.1097/JGP.0b013e31819c498c. ArticlePubMedPubMed CentralGoogle Scholar Lynall ME, Turner L, Bhatti J, Cavanagh J, de Boer P, Mondelli V, et al. Peripheral blood cell-stratified subgroups of inflamed depression. Biol Psychiatry. 2020;88:185–96.ArticlePubMedCASGoogle Scholar Lynall ME, Turner L, Bhatti J, Cavanagh J, de Boer P, Mondelli V, et al. Peripheral blood cell-stratified subgroups of inflamed depression. Biol Psychiatry. 2020;88:185–96. ArticlePubMedCASGoogle Scholar Lynall ME, Turner L, Bhatti J, Cavanagh J, de Boer P, Mondelli V, et al. Peripheral blood cell-stratified subgroups of inflamed depression. Biol Psychiatry. 2020;88:185–96. ArticlePubMedCASGoogle Scholar Price RB, Duman R. Neuroplasticity in cognitive and psychological mechanisms of depression: an integrative model. Mol Psychiatry. 2019.https://doi.org/10.1038/s41380-019-0615-x.ArticlePubMedPubMed CentralGoogle Scholar Price RB, Duman R. Neuroplasticity in cognitive and psychological mechanisms of depression: an integrative model. Mol Psychiatry. 2019.https://doi.org/10.1038/s41380-019-0615-x. ArticlePubMedPubMed CentralGoogle Scholar Price RB, Duman R. Neuroplasticity in cognitive and psychological mechanisms of depression: an integrative model. Mol Psychiatry. 2019.https://doi.org/10.1038/s41380-019-0615-x. ArticlePubMedPubMed CentralGoogle Scholar Borsboom D, Cramer AOJ, Kalis A. Brain disorders? Not really: why network structures block reductionism in psychopathology research. Behav Brain Sci. 2019.https://doi.org/10.1017/S0140525X17002266.ArticlePubMedGoogle Scholar Borsboom D, Cramer AOJ, Kalis A. Brain disorders? Not really: why network structures block reductionism in psychopathology research. Behav Brain Sci. 2019.https://doi.org/10.1017/S0140525X17002266. ArticlePubMedGoogle Scholar Borsboom D, Cramer AOJ, Kalis A. Brain disorders? Not really: why network structures block reductionism in psychopathology research. Behav Brain Sci. 2019.https://doi.org/10.1017/S0140525X17002266. ArticlePubMedGoogle Scholar Beck AT, Bredemeier K. A unified model of depression: Integrating clinical, cognitive, biological, and evolutionary perspectives. Clin Psychol Sci. 2016;4:596–619.ArticleGoogle Scholar Beck AT, Bredemeier K. A unified model of depression: Integrating clinical, cognitive, biological, and evolutionary perspectives. Clin Psychol Sci. 2016;4:596–619. ArticleGoogle Scholar Beck AT, Bredemeier K. A unified model of depression: Integrating clinical, cognitive, biological, and evolutionary perspectives. Clin Psychol Sci. 2016;4:596–619. ArticleGoogle Scholar Bienertova-Vasku J, Lenart P, Scheringer M. Eustress and distress: neither good nor bad, but rather the same? BioEssays. 2020;42:1–5.ArticleGoogle Scholar Bienertova-Vasku J, Lenart P, Scheringer M. Eustress and distress: neither good nor bad, but rather the same? BioEssays. 2020;42:1–5. ArticleGoogle Scholar Bienertova-Vasku J, Lenart P, Scheringer M. Eustress and distress: neither good nor bad, but rather the same? BioEssays. 2020;42:1–5. ArticleGoogle Scholar Brachman RA, Lehmann ML, Maric D, Herkenham M. Lymphocytes from chronically stressed mice confer antidepressant-like effects to naive mice. J Neurosci. 2015;35:1530–8.https://doi.org/10.1523/JNEUROSCI.2278-14.2015.ArticlePubMedPubMed CentralCASGoogle Scholar Brachman RA, Lehmann ML, Maric D, Herkenham M. Lymphocytes from chronically stressed mice confer antidepressant-like effects to naive mice. J Neurosci. 2015;35:1530–8.https://doi.org/10.1523/JNEUROSCI.2278-14.2015. ArticlePubMedPubMed CentralCASGoogle Scholar Brachman RA, Lehmann ML, Maric D, Herkenham M. Lymphocytes from chronically stressed mice confer antidepressant-like effects to naive mice. J Neurosci. 2015;35:1530–8.https://doi.org/10.1523/JNEUROSCI.2278-14.2015. ArticlePubMedPubMed CentralCASGoogle Scholar Sankowski R, Böttcher C, Masuda T, Geirsdottir L, Sagar SE, et al. Mapping microglia states in the human brain through the integration of high-dimensional techniques. Nat Neurosci. 2019;22:2098–110.https://doi.org/10.1038/s41593-019-0532-y.ArticlePubMedCASGoogle Scholar Sankowski R, Böttcher C, Masuda T, Geirsdottir L, Sagar SE, et al. Mapping microglia states in the human brain through the integration of high-dimensional techniques. Nat Neurosci. 2019;22:2098–110.https://doi.org/10.1038/s41593-019-0532-y. ArticlePubMedCASGoogle Scholar Sankowski R, Böttcher C, Masuda T, Geirsdottir L, Sagar SE, et al. Mapping microglia states in the human brain through the integration of high-dimensional techniques. Nat Neurosci. 2019;22:2098–110.https://doi.org/10.1038/s41593-019-0532-y. ArticlePubMedCASGoogle Scholar Masuda T, Sankowski R, Staszewski O, Böttcher C, Sagar AL, et al. Spatial and temporal heterogeneity of mouse and human microglia at single-cell resolution. Nature. 2019;566:388–92.ArticlePubMedCASGoogle Scholar Masuda T, Sankowski R, Staszewski O, Böttcher C, Sagar AL, et al. Spatial and temporal heterogeneity of mouse and human microglia at single-cell resolution. Nature. 2019;566:388–92. ArticlePubMedCASGoogle Scholar Masuda T, Sankowski R, Staszewski O, Böttcher C, Sagar AL, et al. Spatial and temporal heterogeneity of mouse and human microglia at single-cell resolution. Nature. 2019;566:388–92. ArticlePubMedCASGoogle Scholar Download references **Acknowledgements** Not applicable **Funding** Authors are supported by funds from the National Institutes of Health (F32-MH123051; R21-MH120614; R01-MH-123545). **Author information** **Authors and Affiliations** Department of Pharmacology & Systems Physiology, University of Cincinnati College of Medicine, Cincinnati, OH, USASamuel C. Woodburn, Justin L. Bollinger & Eric S. Wohleb Department of Pharmacology & Systems Physiology, University of Cincinnati College of Medicine, Cincinnati, OH, USA Samuel C. Woodburn, Justin L. Bollinger & Eric S. Wohleb Department of Pharmacology & Systems Physiology, University of Cincinnati College of Medicine, Cincinnati, OH, USA Samuel C. Woodburn, Justin L. Bollinger & Eric S. Wohleb Samuel C. WoodburnView author publicationsYou can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar Justin L. BollingerView author publicationsYou can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar Eric S. WohlebView author publicationsYou can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar You can also search for this author inPubMedGoogle Scholar **Contributions** ESW defined the topic of review. SCW and ESW prepared the manuscript. SCW created the figures. JLB aided in manuscript review and figure design. All authors read and approved the final manuscript. **Corresponding author** Correspondence toEric S. Wohleb. **Ethics declarations** **Ethics approval and consent to participate** Not applicable. **Consent for publication** Not applicable. **Competing interests** The authors declare no competing interests. **Additional information** **Publisher's Note** Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. **Rights and permissions** Open AccessThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visithttp://creativecommons.org/licenses/by/4.0/. The Creative Commons Public Domain Dedication waiver (http://creativecommons.org/publicdomain/zero/1.0/) applies to the data made available in this article, unless otherwise stated in a credit line to the data. Reprints and permissions **About this article** **Cite this article** Woodburn, S.C., Bollinger, J.L. & Wohleb, E.S. The semantics of microglia activation: neuroinflammation, homeostasis, and stress.J Neuroinflammation18, 258 (2021). https://doi.org/10.1186/s12974-021-02309-6 Download citation Received:05 August 2021 Received:05 August 2021 Received:05 August 2021 Accepted:28 October 2021 Accepted:28 October 2021 Accepted:28 October 2021 Published:06 November 2021 Published:06 November 2021 Published:06 November 2021 DOI:https://doi.org/10.1186/s12974-021-02309-6 DOI:https://doi.org/10.1186/s12974-021-02309-6 DOI:https://doi.org/10.1186/s12974-021-02309-6 **Share this article** Anyone you share the following link with will be able to read this content: Sorry, a shareable link is not currently available for this article. Provided by the Springer Nature SharedIt content-sharing initiative **Keywords** Microglia Inflammation Homeostasis Stress Parainflammation Depression Advertisement ISSN: 1742-2094 Submission enquiries:journalsubmissions@springernature.com Read more on our blogs Receive BMC newsletters Manage article alerts Language editing for authors Scientific editing for authors Policies Accessibility Press center Support and Contact Leave feedback Careers **Follow BMC** BMC Twitter page BMC Facebook page BMC Weibo page By using this website, you agree to ourTerms and Conditions,Your US state privacy rights,Privacy statementandCookiespolicy.Your privacy choices/Manage cookieswe use in the preference centre. © 2025 BioMed Central Ltd unless otherwise stated. Part ofSpringer Nature."}