{"id": 1565, "name": "Wellington Advertiser", "domain": "wellingtonadvertiser.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.wellingtonadvertiser.com/local-lavender-festival-returns-june-28-features-workshops-live-entertainment-artisan-vendors-farm-tours/", "title": "Local Lavender Festival Returns June 28 Features Workshops Live Entertainment Artisan Vendors Farm Tours", "content": "Elections 2025Federal Election 2025Provincial Election 2025 Federal Election 2025 Provincial Election 2025 Federal Election 2025 Provincial Election 2025 LocalCentre WellingtonErinGuelph EramosaMapletonMintoPuslinchWellington NorthWellington CountyCommunity NewsCOVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 OpinionLettersEditorialsColumnistsCartoonsSubmit Letter Letters Editorials Columnists Cartoons Submit Letter Letters Editorials Columnists Cartoons Submit Letter Police SportsSubmit Sports Submit Sports Submit Sports A&E Rural ObituariesSubmit a Family Ad Submit a Family Ad Submit a Family Ad ClassifiedsSubmit a Classified Submit a Classified Submit a Classified EventsSubmit an Event Submit an Event Submit an Event AuctionsSubmit an Auction Submit an Auction Submit an Auction Contests Digital Publications Become a Carrier **Your browser is not supported** Your browser is too old. To use this website, please useChromeorFirefox. Elections 2025Federal Election 2025Provincial Election 2025 Federal Election 2025 Provincial Election 2025 Federal Election 2025 Provincial Election 2025 LocalCentre WellingtonErinGuelph EramosaMapletonMintoPuslinchWellington NorthWellington CountyCommunity NewsCOVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 OpinionLettersEditorialsColumnistsCartoonsSubmit Letter Letters Editorials Columnists Cartoons Submit Letter Letters Editorials Columnists Cartoons Submit Letter Police SportsSubmit Sports Submit Sports Submit Sports A&E Rural Business ObituariesSubmit a Family Ad Submit a Family Ad Submit a Family Ad ClassifiedsSubmit a Classified Submit a Classified Submit a Classified EventsSubmit an EventContests Submit an Event Contests Submit an Event Contests AuctionsSubmit an Auction Submit an Auction Submit an Auction Become a Carrier Submit News + Ads Subscribe Contribute Sections Search Submit News + Ads Subscribe Contribute Login Wednesday, June 11, 2025 |Vol 58 Issue 23 Elections 2025Federal Election 2025Provincial Election 2025 Federal Election 2025 Provincial Election 2025 Federal Election 2025 Provincial Election 2025 LocalCentre WellingtonErinGuelph EramosaMapletonMintoPuslinchWellington NorthWellington CountyCommunity NewsCOVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 OpinionLettersEditorialsColumnistsCartoonsSubmit Letter Letters Editorials Columnists Cartoons Submit Letter Letters Editorials Columnists Cartoons Submit Letter Police SportsSubmit Sports Submit Sports Submit Sports A&E Rural Business ObituariesSubmit a Family Ad Submit a Family Ad Submit a Family Ad ClassifiedsSubmit a Classified Submit a Classified Submit a Classified EventsSubmit an EventContests Submit an Event Contests Submit an Event Contests AuctionsSubmit an Auction Submit an Auction Submit an Auction Become a Carrier Elections 2025Federal Election 2025Provincial Election 2025 Federal Election 2025 Provincial Election 2025 Federal Election 2025 Provincial Election 2025 LocalCentre WellingtonErinGuelph EramosaMapletonMintoPuslinchWellington NorthWellington CountyCommunity NewsCOVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 Centre Wellington Erin Guelph Eramosa Mapleton Minto Puslinch Wellington North Wellington County Community News COVID-19 OpinionLettersEditorialsColumnistsCartoonsSubmit Letter Letters Editorials Columnists Cartoons Submit Letter Letters Editorials Columnists Cartoons Submit Letter Police SportsSubmit Sports Submit Sports Submit Sports A&E Rural Business ObituariesSubmit a Family Ad Submit a Family Ad Submit a Family Ad ClassifiedsSubmit a Classified Submit a Classified Submit a Classified EventsSubmit an EventContests Submit an Event Contests Submit an Event Contests AuctionsSubmit an Auction Submit an Auction Submit an Auction Become a Carrier **Local lavender festival returns June 28; features workshops, live entertainment, artisan vendors, farm tours** SubmittedJune 4, 2025 @ 9:00 amNews WELLINGTON NORTH – The local Lavender Bloom Festival is set to return for its second year June 28 at Tullamore Lavender Co. near Arthur from 11am to 5pm. “Last year 800 people joined us on the farm,” says Carly Klassen, owner of MKT Events and festival co-host. “And we’re looking forward to hosting even more lavender lovers this year.” This year’s event will include a 40-vendor artisan market, yoga class in the lavender field, a suite of free workshops and face painting, farm tours, and musical performances. There will be several local food vendors on-site serving lavender menu items. “The event is a wonderful opportunity to experience our lavender fields in a unique way,” said Stephanie Craig, owner of Tullamore Lavender Co. and festival co-host. “Attendees can listen to live music, make a lavender crown in a workshop, and shop from the curated vendors surrounded by our blooming fields.” As space on the farm is limited, pre-purchasing tickets and carpooling are highly recommended. Tickets are available ateventbrite.ca/e/lavender-bloom-festival-2025-tickets-1345356791379. Tullamore Lavender Co. is located at 7595 Wellington Road 109 near Arthur. Tickets are $18 in advance via Eventbrite or$25 at the gate. Children enter free. Full details attullamorelavender.ca. NewsPoliceSportsRuralA&EBusiness Police Sports Rural A&E Business Police Sports Rural A&E Business OpinionLettersEditorialsColumnistsCartoonsSubmit Letter Letters Editorials Columnists Cartoons Submit Letter Letters Editorials Columnists Cartoons Submit Letter CommunityClassifiedsObituariesEventsAuctionsSubmit an EventFamily Ad Submission Classifieds Obituaries Events Auctions Submit an Event Family Ad Submission Classifieds Obituaries Events Auctions Submit an Event Family Ad Submission MoreContestsDigital PublicationsSponsoredFacebookTwitterArchives Contests Digital Publications Sponsored Facebook Twitter Archives Contests Digital Publications Sponsored Facebook Twitter Archives Contact Our Team Home Delivery Issues Submit News Become a Carrier 905 Gartshore Street, Fergus ON N1M 2W8. © All materials copyrightWellington Advertiser, 2006-2025. Photographs and text found here may not be used for any purpose whatsoever without express permission. If you need something, please ask. Your feedback is welcome. Please direct comments, questions or suggestions toeditor@wellingtonadvertiser.com Site Feedback Terms of Use Accessibility Privacy Policy Editorial Policy Advertising"}