{"id": 2120, "name": "Republican Voters Against Trump", "domain": "rvat.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://rvat.org/testimonial/christopher-2/", "title": "Christopher 2", "content": "Tell Your Story Donate Testimonials About Us Updates Add Your Voice Testimonials Updates About Mobile Menu **Christopher/ South Carolina** “He’s a narcissist. Everybody knows that.” “My name is Chris, and I am from Columbia, South Carolina, and I am a former Trump voter. The reason I voted for Trump in 2016 was because I felt the country needed change. He seemed like the right person at the right time. And then in 2020 when he ran for re-election, because of all the chaos and the scandals and just everything that was going on, it felt like too much to keep him in office again for another four years. “So I voted for Joe Biden the second time. I tend to favor Donald Trump’s policies more than I do Joe Biden’s, but at the same time, I tend to favor Joe Biden’s character. Over Donald Trump’s. I think Donald Trump would be more focused on himself. Oh, he always has been. He’s a narcissist. Everybody knows that and understands that. “I think that is very bad for democracy because it does take the focus away out of making change and doing what needs to be done for, you know, the everyday people on the street, as far as Donald Trump’s charges are concerned. The main one, January 6th, there’s no way around it. You know, you are the leader of this country. “It is your job to take control, to lead, not sit by and wait to see what happens before you decide to make it, you know, a statement or change or whatever it calls for. It was sad being prior military to hear the people storming the capitol on January 6th, being called patriots, that is not what patriotism is. Storming the capitol and threatening our elected. You know, representatives is not how you do it. “There’s two things I look at when I look to elect who’s gonna lead. Number one is, are you trustworthy? Can I trust you to do the right thing? Be calm under pressure. And then the other thing I look at is, you know, is this person willing to listen to those that oppose you? And I think a lot of that Donald Trump fails at he can’t listen. He wants a bunch of yes men, and that’s not going to give you the best outcome.” Republican Accountability PAC1100 Vermont Ave NW, 10th FloorWashington, DC 20005(202) 715-3707 ·[email protected] Testimonials Tell Your Story About Us Updates Privacy Policy Links Donate"}