{"id": 339, "name": "Deadspin", "domain": "deadspin.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://deadspin.com/why-gen-z-lifts-more-than-they-run---and-what-that-means-for-sports", "title": "Why Gen Z Lifts More Than They Run   And What That Means For Sports", "content": "BaseballBaseball NewsMLB BaseballNCAA Baseball Baseball News MLB Baseball NCAA Baseball Baseball News MLB Baseball NCAA Baseball footballFootball NewsNFL FootballNCAA Football Football News NFL Football NCAA Football Football News NFL Football NCAA Football basketballBasketball NewsNBA BasketballNCAA Basketball Basketball News NBA Basketball NCAA Basketball Basketball News NBA Basketball NCAA Basketball betting hockey Join The Discord Baseball News MLB Baseball NCAA Baseball MLB Betting Sites Football News NFL Football NCAA Football NFL Betting Sites NCAA Betting Sites Basketball News NBA Basketball NCAA Basketball NBA Betting Sites Hockey News NHL Hockey NHL Betting Sites Betting Sites Best Betting Sites Live Betting Sites Cash Out Betting Sites Live Betting Sites Where is Sports Betting Legal? Sports Betting Glossary Best Betting Apps Legal Betting News Betting Bonuses Best Betting Bonuses Sportsbook No Deposit Bonuses Sportsbook Free Bets Sports Betting Welcome Bonuses Sportsbooks by State Arizona Sportsbooks Colorado Sportsbooks Connecticut Sportsbooks Illinois Sportsbooks Indiana Sportsbooks Iowa Sportsbooks Kansas Sportsbooks Kentucky Sportsbooks Louisiana Sportsbooks Maryland Sportsbooks Massachusetts Sportsbooks Michigan Sportsbooks NJ Sportsbooks New York Sportsbooks North Carolina Sportsbooks Ohio Sportsbooks PA Sportsbooks Tennessee Sportsbooks Vermont Sportsbooks Virginia Sportsbooks Wyoming Sportsbooks Betting in Canada Betting in Ontario Sportsbook Reviews All Sportsbook Reviews bet365 Review BetMGM Sportsbook Review Caesars Sportsbook Review BetRivers.com Review DraftKings Sportsbook Review FanDuel Sportsbook Review Fanatics Sportsbook Review Daily Fantasy Sports DFS Sites DFS Apps New DFS Sites New DFS Apps DFS Games GPP Tournaments Cash Games Best Ball Snake Drafts Showdown DFS Reviews Underdog Fantasy Review Parlay Play Review Owners Box Review FanDuel Fantasy Review DraftKings Fantasy Review Sleeper Review Sleeper Review Dabble Review Betting Calculators All Betting Calculators Betting Guides Parlay Betting Guide Spread Betting Guide Over/Under Betting Guide Round Robin Betting Guide Expected Value Betting Guide Payment Methods for Betting PayPal Betting Sites Visa Betting Sites Neteller Betting Sites Skrill Betting Sites Apple Pay Betting Sites Social Sportsbooks All Social Sportsbooks Social Sportsbook Apps New Social Sportsbooks Social Betting Promo Codes Free Sports Betting for Real Money Sweepstakes Sportsbooks Legendz Review Onyx Odds Review Fliff Review Kickr Review Thrillzz Review Sportzino Review Get Prophet X Review Social Casino Reviews Real Prize Review Crown Coins Casino Review McLuck Review Stake.us Review Jackpota Review High 5 Casino Review Sidepot.us Review MegaBonanza Review Baba Casino Review MyPrize.us Review Wow Vegas Review Casino.click Review Spree Review The Money Factory Review Spin Blitz Review PlayFame Review Clubs Casino Review Funrize Review Gold Treasure Casino Review Rolling Riches Casino Review Spinfinite Review Lucky Bird Casino Review NoLimitCoins Review Hello Millions Casino Review Moozi Casino Review Sweepstakes Casinos All Sweepstakes Casinos New Sweepstakes Casinos Play Free Slots for Real Money Sweepstakes Apps Social Casinos New Social Casinos Gift Card Casinos Coin Package Finder Play From Home Sweepstakes Sweepstakes Casino Games Social Betting News Latest Social Betting News Stake.us App Launches Fastest Sweeps Payouts Hottest Slots in 2025 Free Jackpot Slots at McLuck Why Plinko is Popular Best Stake Originals Big Sweeps Jackpot Wins Best Sweeps Casino Games Free Online Poker Rooms Promo Codes by Brand Legendz Review Onyx Odds Promo Code Fliff Promo Code Sportzino Promo Code Get Prophet X Promo Code Thrillzz Promo Code Real Prize Casino Promo Code Crown Coins Casino Promo Code McLuck Promo Code Stake.us Promo Code Jackpota Promo Code High 5 Casino Promo Code Sidepot.us Promo Code MegaBonanza Promo Code Legendz Promo Code Baba Casino Promo Code MyPrize.us Promo Code Wow Vegas Promo Code Casino.click Promo Code Spree Casino Promo Code The Money Factory Promo Code Spin Blitz Promo Code Gold Treasure Casino Promo Code Spinfinite Promo Code Social Betting and Casino Promo Codes Sweepstakes Casino No Deposit Promo Codes Free SC Coins Sweeps Daily Login Bonuses Sweepstakes Casino Free Spins Sweeps Coins No Deposit Promo Codes Sweeps Cash No Deposit Promo Code Baseball News MLB Baseball NCAA Baseball MLB Betting Sites Football News NFL Football NCAA Football NFL Betting Sites NCAA Betting Sites Basketball News NBA Basketball NCAA Basketball NBA Betting Sites Hockey News NHL Hockey NHL Betting Sites Betting Sites Best Betting Sites Live Betting Sites Cash Out Betting Sites Live Betting Sites Where is Sports Betting Legal? Sports Betting Glossary Best Betting Apps Legal Betting News Betting Bonuses Best Betting Bonuses Sportsbook No Deposit Bonuses Sportsbook Free Bets Sports Betting Welcome Bonuses Sportsbooks by State Arizona Sportsbooks Colorado Sportsbooks Connecticut Sportsbooks Illinois Sportsbooks Indiana Sportsbooks Iowa Sportsbooks Kansas Sportsbooks Kentucky Sportsbooks Louisiana Sportsbooks Maryland Sportsbooks Massachusetts Sportsbooks Michigan Sportsbooks NJ Sportsbooks New York Sportsbooks North Carolina Sportsbooks Ohio Sportsbooks PA Sportsbooks Tennessee Sportsbooks Vermont Sportsbooks Virginia Sportsbooks Wyoming Sportsbooks Betting in Canada Betting in Ontario Sportsbook Reviews All Sportsbook Reviews bet365 Review BetMGM Sportsbook Review Caesars Sportsbook Review BetRivers.com Review DraftKings Sportsbook Review FanDuel Sportsbook Review Fanatics Sportsbook Review Daily Fantasy Sports DFS Sites DFS Apps New DFS Sites New DFS Apps DFS Games GPP Tournaments Cash Games Best Ball Snake Drafts Showdown DFS Reviews Underdog Fantasy Review Parlay Play Review Owners Box Review FanDuel Fantasy Review DraftKings Fantasy Review Sleeper Review Sleeper Review Dabble Review Betting Calculators All Betting Calculators Betting Guides Parlay Betting Guide Spread Betting Guide Over/Under Betting Guide Round Robin Betting Guide Expected Value Betting Guide Payment Methods for Betting PayPal Betting Sites Visa Betting Sites Neteller Betting Sites Skrill Betting Sites Apple Pay Betting Sites Social Sportsbooks All Social Sportsbooks Social Sportsbook Apps New Social Sportsbooks Social Betting Promo Codes Free Sports Betting for Real Money Sweepstakes Sportsbooks Legendz Review Onyx Odds Review Fliff Review Kickr Review Thrillzz Review Sportzino Review Get Prophet X Review Social Casino Reviews Real Prize Review Crown Coins Casino Review McLuck Review Stake.us Review Jackpota Review High 5 Casino Review Sidepot.us Review MegaBonanza Review Baba Casino Review MyPrize.us Review Wow Vegas Review Casino.click Review Spree Review The Money Factory Review Spin Blitz Review PlayFame Review Clubs Casino Review Funrize Review Gold Treasure Casino Review Rolling Riches Casino Review Spinfinite Review Lucky Bird Casino Review NoLimitCoins Review Hello Millions Casino Review Moozi Casino Review Sweepstakes Casinos All Sweepstakes Casinos New Sweepstakes Casinos Play Free Slots for Real Money Sweepstakes Apps Social Casinos New Social Casinos Gift Card Casinos Coin Package Finder Play From Home Sweepstakes Sweepstakes Casino Games Social Betting News Latest Social Betting News Stake.us App Launches Fastest Sweeps Payouts Hottest Slots in 2025 Free Jackpot Slots at McLuck Why Plinko is Popular Best Stake Originals Big Sweeps Jackpot Wins Best Sweeps Casino Games Free Online Poker Rooms Promo Codes by Brand Legendz Review Onyx Odds Promo Code Fliff Promo Code Sportzino Promo Code Get Prophet X Promo Code Thrillzz Promo Code Real Prize Casino Promo Code Crown Coins Casino Promo Code McLuck Promo Code Stake.us Promo Code Jackpota Promo Code High 5 Casino Promo Code Sidepot.us Promo Code MegaBonanza Promo Code Legendz Promo Code Baba Casino Promo Code MyPrize.us Promo Code Wow Vegas Promo Code Casino.click Promo Code Spree Casino Promo Code The Money Factory Promo Code Spin Blitz Promo Code Gold Treasure Casino Promo Code Spinfinite Promo Code Social Betting and Casino Promo Codes Sweepstakes Casino No Deposit Promo Codes Free SC Coins Sweeps Daily Login Bonuses Sweepstakes Casino Free Spins Sweeps Coins No Deposit Promo Codes Sweeps Cash No Deposit Promo Code **Why Gen Z Lifts More Than They Run - and What That Means for Sports** Even since the 60s and 70s, we haven’t had such a huge expansion of bodybuilders and fitness influencers. Gen Z is going big but not for the right reason. It’s great when you see influencers promoting a healthy lifestyle, training, and eating healthy. But, something else is happening that can influence a younger population in making some bad choices. **Flexing Over Being Healthy** The bad reason why so many young people are training is to flex on social media and boost their following. This isn’t the case for most people, but there’s an expansion of social media influencers and young adults who are using steroids to get a perfect body. This flex culture comes with consequences when supplements are misused. So, the importance of safety in the gym is more important than ever. Reasons why Gen Z loves the gym: Aesthetics over endurance. Social media gym culture. Body positivity and strength culture. Mental health boost. Growing community. **Data about Gym Members** Data backs up the claim that Gen Z is the biggest gym generation so far. One of the claims is that from 2008 to 2018 the number of memberships grew up to 40%. It became accessible for everyone, and it’s never been easier to find a training routine. Everything can be done through your phone instead of having a professional guide you through each exercise. The USA has the most gym goers, around 64 million. The next on the list is Germany, with only 11 million gym members. **How does This Affect Sports?** Some of the sports that weren’t in the spotlight for a while are coming back. Powerlifting was huge, but not comparable to traditional sports like football and basketball. With so many influencers promoting weight lifting, the constant grind to lift more comes with some records being broken. All of the 1000+ pounds squats were made in the last 7 years. Some of them are from older generations, but imagine what the youngsters will do in the upcoming years. **Related** **sports betting calculator** **sports betting calculator** **mlb parlay calculator** **mlb parlay calculator** **moneyline payout calculator** **moneyline payout calculator** **half points in nfl** **half points in nfl** **kelly criterion calculations** **kelly criterion calculations** **how to hedge a bet calculator** **how to hedge a bet calculator** **spread in betting** **spread in betting** **explain over under betting** **explain over under betting** **sportsbook parlays** **sportsbook parlays** **what is round robin betting** **what is round robin betting** **ev sports betting** **ev sports betting** **hedge mean in betting** **hedge mean in betting** **FIFA's CWC Brings Complications, But Could Still Be a Massive Global Hit** **Roman Anthony Shines in Fenway Debut, Red Sox Remain a Work in Progress** **Best NBA Finals Game 3 Bets: Thunder vs. Pacers Picks, Predictions, and Player Props** **MLB Best Bets: June 10th Top Picks, Player Props** **Puck Stops Here: Oilers’ Only Option To Survive in Florida Is Defense** **New York Giants Redshirting Jaxson Dart Is Smart** **Texans Land Nick Chubb, the NFL’s Most Drama-Proof Running Back** **Pete Alonso’s MVP Surge Giving Mets the Season They Let Daniel Murphy Walk For** **Tyrese Haliburton Needs to Wake Up Or These NBA Finals Are Over Early** **MLB Best Bets for June 9th: Top Picks, Player Props and More** NBA Finals Game 2 Picks: Best Bets for Thunder vs. Pacers MLB Best Bets for Saturday, June 7: Top Picks and Totals to Target UFC 316 Best Bets: O’Malley’s Revenge, Harrison’s Statement, and Spivac’s Edge Thursday’s June 5th MLB Best Bets, Top Predictions RBC Canadian Open Best Bets & Props: Rory McIlroy, Canadian Hopefuls, and a Pro Debut NBA Finals 2025 Best Bets: Game 1 Picks, Series Odds, and MVP Value Plays 2025 Stanley Cup Final: Best Bets as Panthers, Oilers Meet Again Sitemap Privacy Terms of Use About Us Copyright2025"}