{"id": 2096, "name": "People's World", "domain": "peoplesworld.org", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://peoplesworld.org/article/d-c-council-session-over-mayor-bowsers-plan-to-end-sanctuary-city-status-draws-strong-pushback/", "title": "D C Council Session Over Mayor Bowsers Plan To End Sanctuary City Status Draws Strong Pushback", "content": "En Español Contact Sign up for Headlines Legacy Giving Ways to Support PW Donate **D.C. Council session over Mayor Bowser’s plan to end sanctuary city status draws strong pushback** WASHINGTON—A mass protest by D.C. residents jammed the City Council’s chambers on June 2 over Democratic Mayor Muriel Bowser’s plan to end the “sanctuary city” status of the Nation’s Capital.Bowser’s plan is in her proposed city budget for the next fiscal year. It “shamefully includes a repeal of the Sanctuary Cities Act,” which protects migrants to D.C., a fact sheet says. The law bans local police from cooperating with President Donald Trump’s Immigration and Customs Enforcement (ICE) agents.That Bowser plan produced the May 2 protest, from members of the coalition formed to protect Black and brown people from ICE. After gathering and speaking outside the John Wilson Building, D.C.’s city hall, they trooped inside to make legislators hear their voices. It followed other protests weeks before.“There’s a lot of abuse by law enforcement,” explained Kaya Chatterjee, executive director ofFree DC, a coalition formed to lobby to make the capital the nation’s 51st state.“They try to divide us and they try to dominate us,” Chatterjee said of Trump and others like him. “They try to use these threats to make us obey in advance,” and not resist. “We’ll stick together across our communities so they can’t” achieve that goal, Chatterjee told the multiracial crowd.ICE agents raid D.C. restaurants and other businesses and have grabbed an estimated 189 people—all people of color—out of cars, houses, workplaces, and off city streets, the coalition’s fact sheet says. It reports ICE raids at more than 100 restaurants and adds that families have been separated.But “Mayor Bowser and council members have remained silent and idle.” Now the mayor wants to “capitulate” to Trump and “further criminalize Brown and Black families,” the coalition asserts.“I came to this country to work. I left my family behind like so many others, hoping for a better life, but instead, I found a harsh reality, low wages, labor abuse, harassment, and fear. Under this political climate, it is worse than before, much, much worse than before,” said Antonia Pena, co-executive director of the D.C.-Maryland-Virginia chapter of the National Domestic Workers Alliance, one of two unions listed as protest sponsors. The Restaurant Opportunities Center is the other.“In recent months, we have learned that workers have been sexually harassed, but they are too afraid to report it because of the immigration threat. A domestic worker has still not received her pay, but her employer is threatening to call ICE if she dares to demand what she is owed…Abusive employers take advantage in this political climate.“This is not just something that we want,” Pena said of D.C. being a sanctuary city. “It is something that we need. D.C. has the opportunity to be a brave city that doesn’t cower and that protects its people regardless of the color of their skin,” against what Pena called “this fascistic government” of Trump.“Over and over again, Bowser has done everything she can to restrict immigrants’ access to safety and support,” said Amy Fisher, a migrant rights organizer from Ward 7 east of the Anacostia River.“And since January, we’ve seen our immigrants, their families, their friends, and their neighbors—hundreds of them—snatched out of their homes and thrust into the Trump administration’s immigration gulag.”The Trump regime has backed the ICE raids, in D.C. and nationwide, with a threat to pull federal funds from cities and states that set themselves up as sanctuaries and don’t cooperate with ICE. That hasn’t stopped D.C., and most of its suburbs, plus Baltimore, from becoming sanctuaries.Other cities that are sanctuaries include Chicago, New York, Los Angeles, Boston, and the entire state of California. “Don’t take the bait,” of keeping federal cash, Fisher warned D.C. “Fight efforts to throw our neighbors into the jaws of Trump’s deportation machine.”But New York Mayor Eric Adams has turned against that metropolis’s “sanctuary city” ordinance and ordered city prison guards to cooperate with ICE. In return, Trump ordered his Justice Department to drop multiple fraud charges against Adams in a case so solid that the Republican Acting U.S. Attorney for that area resigned in protest.And in Boston, Rep. Ayanna Pressley, D-Mass., convened a roundtable on June 2 with local advocates and elected to discuss further measures to battle ICE in the Bay State. Their message:“Hands off our immigrant neighbors.”Pressley cited “an uptick in ICE activity across the Massachusetts 7th Congressional District and the Commonwealth, including a series of harrowing incidents in East Boston, Chelsea, Everett, and other predominantly immigrant communities.”Bowser’s plan to end D.C.’s sanctuary city status also caught the eye of Rep. Adriano Espaillat, D-N.Y., the Congressional Hispanic Caucus chair. “The D.C. Metropolitan Police Department is not the FBI or ICE,” he said in a statement. “They are trained differently, they respond differently, they have different relationships with the community. To deputize local police officers as federal agents is a huge mistake.“I hope she’s not being intimidated by that guy at the White House, and that he’s threatening to withhold funding. Because that has a terminology—it’s called extortion.”Both outside the Wilson Building and in the day-long budget hearing inside, the D.C. residents argued to keep the sanctuary city status—and challenged the council to stand up to Trump.“We are going to go inside because we don’t have anyone brave enough [on the council] to stop Trump and protect our communities,” said rally moderator Antonia Salazar.And they won’t stop with the council session, added Chatterjee of Free DC. “We the people are committed to solidarity and collective courage, through organizing and training so we have a massive pro-democracy movement that is rooted on our values,” Chatterjee said. “Nobody is free until everybody is free, so let’s get everybody free.”We hope you appreciated this article. AtPeople’s World, we believe news and information should be free and accessible to all, but we need your help. Our journalism is free of corporate influence and paywalls because we are totally reader-supported. Only you, our readers and supporters, make this possible. If you enjoy readingPeople’s Worldand the stories we bring you, pleasesupport our work by donating or becoming a monthly sustainer today. Thank you! WASHINGTON—A mass protest by D.C. residents jammed the City Council’s chambers on June 2 over Democratic Mayor Muriel Bowser’s plan to end the “sanctuary city” status of the Nation’s Capital. Bowser’s plan is in her proposed city budget for the next fiscal year. It “shamefully includes a repeal of the Sanctuary Cities Act,” which protects migrants to D.C., a fact sheet says. The law bans local police from cooperating with President Donald Trump’s Immigration and Customs Enforcement (ICE) agents. That Bowser plan produced the May 2 protest, from members of the coalition formed to protect Black and brown people from ICE. After gathering and speaking outside the John Wilson Building, D.C.’s city hall, they trooped inside to make legislators hear their voices. It followed other protests weeks before. “There’s a lot of abuse by law enforcement,” explained Kaya Chatterjee, executive director ofFree DC, a coalition formed to lobby to make the capital the nation’s 51st state. “They try to divide us and they try to dominate us,” Chatterjee said of Trump and others like him. “They try to use these threats to make us obey in advance,” and not resist. “We’ll stick together across our communities so they can’t” achieve that goal, Chatterjee told the multiracial crowd. ICE agents raid D.C. restaurants and other businesses and have grabbed an estimated 189 people—all people of color—out of cars, houses, workplaces, and off city streets, the coalition’s fact sheet says. It reports ICE raids at more than 100 restaurants and adds that families have been separated. But “Mayor Bowser and council members have remained silent and idle.” Now the mayor wants to “capitulate” to Trump and “further criminalize Brown and Black families,” the coalition asserts. “I came to this country to work. I left my family behind like so many others, hoping for a better life, but instead, I found a harsh reality, low wages, labor abuse, harassment, and fear. Under this political climate, it is worse than before, much, much worse than before,” said Antonia Pena, co-executive director of the D.C.-Maryland-Virginia chapter of the National Domestic Workers Alliance, one of two unions listed as protest sponsors. The Restaurant Opportunities Center is the other. “In recent months, we have learned that workers have been sexually harassed, but they are too afraid to report it because of the immigration threat. A domestic worker has still not received her pay, but her employer is threatening to call ICE if she dares to demand what she is owed…Abusive employers take advantage in this political climate. “This is not just something that we want,” Pena said of D.C. being a sanctuary city. “It is something that we need. D.C. has the opportunity to be a brave city that doesn’t cower and that protects its people regardless of the color of their skin,” against what Pena called “this fascistic government” of Trump. “Over and over again, Bowser has done everything she can to restrict immigrants’ access to safety and support,” said Amy Fisher, a migrant rights organizer from Ward 7 east of the Anacostia River. “And since January, we’ve seen our immigrants, their families, their friends, and their neighbors—hundreds of them—snatched out of their homes and thrust into the Trump administration’s immigration gulag.” The Trump regime has backed the ICE raids, in D.C. and nationwide, with a threat to pull federal funds from cities and states that set themselves up as sanctuaries and don’t cooperate with ICE. That hasn’t stopped D.C., and most of its suburbs, plus Baltimore, from becoming sanctuaries. Other cities that are sanctuaries include Chicago, New York, Los Angeles, Boston, and the entire state of California. “Don’t take the bait,” of keeping federal cash, Fisher warned D.C. “Fight efforts to throw our neighbors into the jaws of Trump’s deportation machine.” But New York Mayor Eric Adams has turned against that metropolis’s “sanctuary city” ordinance and ordered city prison guards to cooperate with ICE. In return, Trump ordered his Justice Department to drop multiple fraud charges against Adams in a case so solid that the Republican Acting U.S. Attorney for that area resigned in protest. And in Boston, Rep. Ayanna Pressley, D-Mass., convened a roundtable on June 2 with local advocates and elected to discuss further measures to battle ICE in the Bay State. Their message:“Hands off our immigrant neighbors.” Pressley cited “an uptick in ICE activity across the Massachusetts 7th Congressional District and the Commonwealth, including a series of harrowing incidents in East Boston, Chelsea, Everett, and other predominantly immigrant communities.” Bowser’s plan to end D.C.’s sanctuary city status also caught the eye of Rep. Adriano Espaillat, D-N.Y., the Congressional Hispanic Caucus chair. “The D.C. Metropolitan Police Department is not the FBI or ICE,” he said in a statement. “They are trained differently, they respond differently, they have different relationships with the community. To deputize local police officers as federal agents is a huge mistake. “I hope she’s not being intimidated by that guy at the White House, and that he’s threatening to withhold funding. Because that has a terminology—it’s called extortion.” Both outside the Wilson Building and in the day-long budget hearing inside, the D.C. residents argued to keep the sanctuary city status—and challenged the council to stand up to Trump. “We are going to go inside because we don’t have anyone brave enough [on the council] to stop Trump and protect our communities,” said rally moderator Antonia Salazar. And they won’t stop with the council session, added Chatterjee of Free DC. “We the people are committed to solidarity and collective courage, through organizing and training so we have a massive pro-democracy movement that is rooted on our values,” Chatterjee said. “Nobody is free until everybody is free, so let’s get everybody free.” We hope you appreciated this article. AtPeople’s World, we believe news and information should be free and accessible to all, but we need your help. Our journalism is free of corporate influence and paywalls because we are totally reader-supported. Only you, our readers and supporters, make this possible. If you enjoy readingPeople’s Worldand the stories we bring you, pleasesupport our work by donating or becoming a monthly sustainer today. Thank you! WASHINGTON—A mass protest by D.C. residents jammed the City Council’s chambers on June 2 over Democratic Mayor Muriel Bowser’s plan to end the “sanctuary city” status of the Nation’s Capital. Bowser’s plan is in her proposed city budget for the next fiscal year. It “shamefully includes a repeal of the Sanctuary Cities Act,” which protects migrants to D.C., a fact sheet says. The law bans local police from cooperating with President Donald Trump’s Immigration and Customs Enforcement (ICE) agents. That Bowser plan produced the May 2 protest, from members of the coalition formed to protect Black and brown people from ICE. After gathering and speaking outside the John Wilson Building, D.C.’s city hall, they trooped inside to make legislators hear their voices. It followed other protests weeks before. “There’s a lot of abuse by law enforcement,” explained Kaya Chatterjee, executive director ofFree DC, a coalition formed to lobby to make the capital the nation’s 51st state. “They try to divide us and they try to dominate us,” Chatterjee said of Trump and others like him. “They try to use these threats to make us obey in advance,” and not resist. “We’ll stick together across our communities so they can’t” achieve that goal, Chatterjee told the multiracial crowd. ICE agents raid D.C. restaurants and other businesses and have grabbed an estimated 189 people—all people of color—out of cars, houses, workplaces, and off city streets, the coalition’s fact sheet says. It reports ICE raids at more than 100 restaurants and adds that families have been separated. But “Mayor Bowser and council members have remained silent and idle.” Now the mayor wants to “capitulate” to Trump and “further criminalize Brown and Black families,” the coalition asserts. “I came to this country to work. I left my family behind like so many others, hoping for a better life, but instead, I found a harsh reality, low wages, labor abuse, harassment, and fear. Under this political climate, it is worse than before, much, much worse than before,” said Antonia Pena, co-executive director of the D.C.-Maryland-Virginia chapter of the National Domestic Workers Alliance, one of two unions listed as protest sponsors. The Restaurant Opportunities Center is the other. “In recent months, we have learned that workers have been sexually harassed, but they are too afraid to report it because of the immigration threat. A domestic worker has still not received her pay, but her employer is threatening to call ICE if she dares to demand what she is owed…Abusive employers take advantage in this political climate. “This is not just something that we want,” Pena said of D.C. being a sanctuary city. “It is something that we need. D.C. has the opportunity to be a brave city that doesn’t cower and that protects its people regardless of the color of their skin,” against what Pena called “this fascistic government” of Trump. “Over and over again, Bowser has done everything she can to restrict immigrants’ access to safety and support,” said Amy Fisher, a migrant rights organizer from Ward 7 east of the Anacostia River. “And since January, we’ve seen our immigrants, their families, their friends, and their neighbors—hundreds of them—snatched out of their homes and thrust into the Trump administration’s immigration gulag.” The Trump regime has backed the ICE raids, in D.C. and nationwide, with a threat to pull federal funds from cities and states that set themselves up as sanctuaries and don’t cooperate with ICE. That hasn’t stopped D.C., and most of its suburbs, plus Baltimore, from becoming sanctuaries. Other cities that are sanctuaries include Chicago, New York, Los Angeles, Boston, and the entire state of California. “Don’t take the bait,” of keeping federal cash, Fisher warned D.C. “Fight efforts to throw our neighbors into the jaws of Trump’s deportation machine.” But New York Mayor Eric Adams has turned against that metropolis’s “sanctuary city” ordinance and ordered city prison guards to cooperate with ICE. In return, Trump ordered his Justice Department to drop multiple fraud charges against Adams in a case so solid that the Republican Acting U.S. Attorney for that area resigned in protest. And in Boston, Rep. Ayanna Pressley, D-Mass., convened a roundtable on June 2 with local advocates and elected to discuss further measures to battle ICE in the Bay State. Their message:“Hands off our immigrant neighbors.” Pressley cited “an uptick in ICE activity across the Massachusetts 7th Congressional District and the Commonwealth, including a series of harrowing incidents in East Boston, Chelsea, Everett, and other predominantly immigrant communities.” Bowser’s plan to end D.C.’s sanctuary city status also caught the eye of Rep. Adriano Espaillat, D-N.Y., the Congressional Hispanic Caucus chair. “The D.C. Metropolitan Police Department is not the FBI or ICE,” he said in a statement. “They are trained differently, they respond differently, they have different relationships with the community. To deputize local police officers as federal agents is a huge mistake. “I hope she’s not being intimidated by that guy at the White House, and that he’s threatening to withhold funding. Because that has a terminology—it’s called extortion.” Both outside the Wilson Building and in the day-long budget hearing inside, the D.C. residents argued to keep the sanctuary city status—and challenged the council to stand up to Trump. “We are going to go inside because we don’t have anyone brave enough [on the council] to stop Trump and protect our communities,” said rally moderator Antonia Salazar. And they won’t stop with the council session, added Chatterjee of Free DC. “We the people are committed to solidarity and collective courage, through organizing and training so we have a massive pro-democracy movement that is rooted on our values,” Chatterjee said. “Nobody is free until everybody is free, so let’s get everybody free.” We hope you appreciated this article. AtPeople’s World, we believe news and information should be free and accessible to all, but we need your help. Our journalism is free of corporate influence and paywalls because we are totally reader-supported. Only you, our readers and supporters, make this possible. If you enjoy readingPeople’s Worldand the stories we bring you, pleasesupport our work by donating or becoming a monthly sustainer today. Thank you! District of Columbia Immigrant Rights immigrant workers Immigrants immigration politics sanctuary cities **CONTRIBUTOR** Award-winning journalist Mark Gruenberg is head of the Washington, D.C., bureau ofPeople's World. He is also the editor of the union news service Press Associates Inc. (PAI). Known for his reporting skills, sharp wit, and voluminous knowledge of history, Mark is a compassionate interviewer but tough when going after big corporations and their billionaire owners. Carol Rosenblatt writes from Washington, D.C. Tens of thousands march in Chicago against ICE raids Tens of thousands march in Chicago against ICE raids Tens of thousands march in Chicago against ICE raids No deportation flights! National boycott hits Avelo Airlines No deportation flights! National boycott hits Avelo Airlines No deportation flights! National boycott hits Avelo Airlines L.A. labor stands up for immigrants after Huerta arrest L.A. labor stands up for immigrants after Huerta arrest L.A. labor stands up for immigrants after Huerta arrest **MOST POPULAR TODAY** Nation gears up for June 14 “No Kings Day” protests against Trump Nation gears up for June 14 “No Kings Day” protests against Trump Nation gears up for June 14 “No Kings Day” protests against Trump U.S. government using secret police in terror campaign against the people U.S. government using secret police in terror campaign against the people U.S. government using secret police in terror campaign against the people Czech Republic moves to outlaw Communist Party Czech Republic moves to outlaw Communist Party Czech Republic moves to outlaw Communist Party ‘Sovereign’ review: Thrilling chiller exposes danger of extremism, trauma, and indoctrination ‘Sovereign’ review: Thrilling chiller exposes danger of extremism, trauma, and indoctrination ‘Sovereign’ review: Thrilling chiller exposes danger of extremism, trauma, and indoctrination Convocan en Panamá a paro generalizado contra ley del Seguro Social Convocan en Panamá a paro generalizado contra ley del Seguro Social Convocan en Panamá a paro generalizado contra ley del Seguro Social About People’s World Political Affairs Archive People’s World Resources Mundo Popular Archive Download Print Edition"}