{"id": 1673, "name": "Anti-Empire", "domain": "anti-empire.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://anti-empire.com/uk-sending-missiles-to-be-fired-into-russia-moscow-calls-a-snap-rehearsal-for-firing-tactical-nukes/#comments", "title": "Uk Sending Missiles To Be Fired Into Russia Moscow Calls A Snap Rehearsal For Firing Tactical Nukes", "content": "Anti-Empire - Anti-Empire Home Team Contact Sign Up **UK Sending Missiles to Be Fired Into Russia, Moscow Calls a Snap Rehearsal for Firing Tactical Nukes** **If Storm Shadows start falling and Russia does not fire back it is no longer a Great Power** Recently Macron has stated that France might want to send troops to Ukraine, and David Cameron (ex-British PM, now Foreign Affairs chief) has said Kiev has beengiven authorizationto fire British-supplied cruise missiles into Russia. I should say that the two statements are in no way alike.Macron’s statementis vague, comes with massive qualifiers, and refers to something that may or may not happen, and then only in the distant future: “Ifthe Russians were to break through the front lines,ifthere were a Ukrainian request, which is not the case today,we wouldlegitimatelyhave to ask ourselves this question.” What Macron says is: He doesn’t have troops in Ukraine. There is no Ukrainian request for French troops in Ukraine. IFthe Russians were to “break through”, andIFUkraine were to make a request, France would then stop and think about whether to send troopsor not. So Macron puts two separate conditions on a French deployment, and even then it’s not an automatic deployment, but just a point at which France would deliberate on the question. (He is being awfully dishonest here, were Russians to ever achieve a “breakthrough” that wouldn’t be a point where France started deliberating on sending troops. That would be the point where a significant French deployment became even more improbable.The last time France expected a Russian breakthrough she didn’t send troops, she evacuated her Embassy.) Macron also has nothing to say on where these troops would be sent and in what role. There is a world of difference between sending trainers to Zakarpatia or de-miners to Kiev, and sending combat infantry to Donetsk. (Safe to say he doesn’t have the stomach for the latter.) Cameron’s statement, on the other hand, is a real bomb. It refers to something that hasalready happened.He informs us that Ukraine hasnow received the green lightto fire the batch of British missiles that are already on the way, into Russia. It’s difficult to convey the level of provocation this represents. Evenat the height of the Cold War proxy warswhen the Soviets were shipping massive quantities of weapons to Vietnam, and Americans to Afghanistan,neither would dream of sending missiles for their proxies to fire into the Soviet/US mainland.(For obvious reasons.) Moscow is bombing Ukraine on a daily basis, and can not protest when Kiev does the same to Russia in turn. However, Russia is doing nothing to Britain, and Russia can rightfully feel outraged when Britain allocates military spending to construct and finance missiles to be fired into Russia. British personnel could even help fire into Russia, sinceGermanyandPM Sunakhave confirmed there is a small British deployment to Ukraine connected to the Storm Shadow missiles. The Russian response has been to summon the French and British ambassadors, to order a snap rehearsal for launching tactical nuclear weapons, and to declare that UK military installations “in Ukraine and elsewhere”could be hit. Russia conducts drills with nuclear-armed Iskanders almost every year. In of itself the exercise is nothing special, what is remarkable is that Russian state media has gone out of its wayto make clear the drill is a snap exerciseordered personally by Putinin response to French and British statements. The RussianMinistry of Defensehas echoed this, as has theMinistry of Foreign Affairs. I am not sure how convincing the tactical nuclear threat is. An Iskander has only the range to hit Ukraine, where there are few British targets. Andif the few British personnel in Ukraine are pinpointed it hardly takes a nuke to get them. Meanwhile, if the signal is supposed to be that if British missiles start slamming into Russia, that Moscow may start using atomic weapons on Ukraine this generates no deterrence at all.If a nuclear weapon is detonated on Slavic Ukraine that is no skin off of London’s back.To the contrary that assures the UK it has a whipping boy in Ukraine to suffer the consequences in its stead. The symmetrical tit-for-tat vs Londonisn’t to make nuclear threats on Ukraine, but to signal that if Storm Shadows indeed start falling on Russia proper, Moscow willfinditself looking forpeople who want to fire missiles into Britain, and providing them with such free of charge. The Russian statement thatBritish military installations anywhere in the worldmay be targetedis also appropriate, just because of the difficulties involved in hitting the British Isles via proxy. Finding proxies for a hit on British installations in the Middle East may be more viable, even if that would fall short of matching British proxy attacks onto Russian soil. (But the challenge here is how to hit the British without involving the host country.) On the eve of the 2022 Russian invasion Dmitri Trenin hada fine articlein which he wrote that “great powers do not bluff”. Trenin was in disbelief that Russia would indeed invade, but at the same time he reasoned that having built up the invasion force, Russia must now invade or it is no longer a great power, for it did not receive appeasement from DC or Kiev, and“Great Powers do not bluff.” If British Shadow Storms indeed start falling on air bases and refineries in Russia, will Russia make good on its promise of a tit-for-tat? I make no predictions as to that. But I will say this.If Russia does not fire back it is no longer a great power, but has descended to “some other level in terms of its global status”as Trenin would put it. In 2022 I did not believe Putin was willing to forsake great power status just yet. Britain (of all places) is betting that two years later that time has now come. If she should be proven right missiles from other nations will follow. Scottsays1 year agoI’m thrilled thrilled THRILLED to see this website is publishing once again – you have been MISSED!ReplyTerje Msays1 year agoSeconded. Marko is one of the best analysts around.Replyvanushasays11 months agoAwesome indeed!Reply I’m thrilled thrilled THRILLED to see this website is publishing once again – you have been MISSED! Terje Msays1 year agoSeconded. Marko is one of the best analysts around.Reply Seconded. Marko is one of the best analysts around. vanushasays11 months agoAwesome indeed!Reply Awesome indeed! I’m thrilled thrilled THRILLED to see this website is publishing once again – you have been MISSED! Terje Msays1 year agoSeconded. Marko is one of the best analysts around.Reply Seconded. Marko is one of the best analysts around. Seconded. Marko is one of the best analysts around. vanushasays11 months agoAwesome indeed!Reply Awesome indeed! Awesome indeed! Leave A ReplyCancel Reply Your email address will not be published. Save my name, email, and website in this browser for the next time I comment. FacebookTasty Memes TwitterFollow RSSSubscribe"}