{"id": 2110, "name": "Public Square Magazine", "domain": "publicsquaremag.org", "bias": "right-center", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://publicsquaremag.org/sexuality-family/family-matters/why-the-family-proclamation-needs-supportive-voices/", "title": "Why The Family Proclamation Needs Supportive Voices", "content": "Bulletin Faith Politics & Law Sexuality & Family Media & Education Dialogue Health **Why are Some Latter-day Saints Hesitant to Talk about the Family Proclamation?** Family Matters,Gospel Fare October 2, 2024 This article was originally published onPublish Peace. My mother “didn’t grow up in an ideal family situation,” social media influencerSara Phelpssays, but when she began attending The Church of Jesus Christ of Latter-day Saints with a neighbor friend, “these pure and simple truths changed her life.” “Because of what she learned at church,” Phelps recalls, her mom “felt a hope for the future that things could change for her, and that one day she could have a temple marriage and an eternal family like so many of the happy families she witnessed around her attending church every week.” And she did. Phelps was raised by her mom and dad to relish these same truths, which guide her own growing family today. Yet this young mother wonders whether some members of the Church today would be “too afraid” to teach a young girl from a different background about God’s plan for families. **Scared to Share** There was a time when Phelps herself felt hesitant to broach this same subject since the church’s “Family Proclamation” was becoming, in her words, a “very controversial topic” —with prominent voices in the larger culture increasingly “loud” and leaving members feeling like they are “hateful and mean for supporting that.” This is certainly not the only topic that’s become fraught in modern America, reflected in thecommon fearamong people (onboth sides of the political spectrum) when it comes to sharing openly what they think and believe about many important questions. That includes other Christians whoadmitfear can stop them from sharing their faith. Of course, many other people of faith raise their voices freely and warmly for anyone who will listen. And Latter-day Saints around the world share truths about families and the Savior Jesus Christ widely, even if they’re not always sure of the best way to do that. “I knew what was right in my heart,” Phelps says, “but I didn’t know how to articulate it.” While remarking on some poor examples of overly forceful family advocacy in the past, she says “the pendulum has swung completely in the opposite direction,” where some people “won’t really even talk about it at all.” When others see the proclamation brought up, they say something like, “Wait, are you still even teaching about that? It’s not even relevant anymore.” **Repeated Prophetic Emphasis** Since the beginning of the restoration, leaders of The Church of Jesus of Latter-day Saints have emphasized the importance of marriage, children, and family. But a potent re-emphasis came on Sept. 23, 1995, when President Gordon B. Hinckley stood before the general Relief Society meeting andstatedthat in a world of so much sophistry, deception, and allurement, “we have felt to warn and forewarn.” “In furtherance of this, we of the First Presidency and the Council of the Twelve Apostles now issue a proclamation to the Church and to the world as a declaration and reaffirmation of standards, doctrines, and practices relative to the family which the prophets, seers, and revelators of this church have repeatedly stated throughout its history.” Since the historic announcement of “The Family: A Proclamation to the World,” men and women leading the Church have continued speaking repeatedly and emphatically about marriage being “ordained of God” and the “sacred duty” of parents to raise their children “in love and righteousness.” In the last 5 years alone, this proclamation has been mentioned multiple times inconferencebymultipleapostlesandprophets. Three different times since2017, now-President Dallin H. Oaks, in the First Presidency, has specificallyaffirmedthe unique value of the truths in this proclamation to help people prepare for “exaltation” or “eternal life.” “Those who do not fully understand the Father’s loving plan for His children may consider this family proclamation no more than a changeable statement of policy,” President Oakstaughtlast year. “In contrast, we affirm that the family proclamation, founded on irrevocable doctrine, defines the mortal family relationship where the most important part of our eternal development can occur.” “This is so much more than a document,” says Carol Rice, part of a team that created awebsite dedicated to the teachings and supportive researchon the Family Proclamation. “It’s not an amicus brief; it is not a memo or letter,” she says about the text. “It is a divinely condensed version of the order of heaven and God’s plan for his children. It is a witness and a warning. He is the author.” **Not Going There as ‘Loving’?** Latter-day Saint writer Cassandra Hedelius hasobserveda growing “trend” among online influencers and activists attempting to “persuade members of the Church to keep quiet about the doctrines of chastity and marriage.” Jelaire Richardson, a Latter-day Saint mother living overseas, described “dozens” of times when she’s mentioned the Family Proclamation to someone—suggesting it may be good to bring up in a class lesson, for instance—but hearing something like, “Well, I’m not sure how my Sunday School class feels about the Family Proclamation, so I’d rather not bring it up in case it leads to contention.” Or “Well, some of the kids in my Young Women’s class come from a home with divorced parents, so I want to be sensitive to that.” Phelps readily admits that discussing family and marriage “does require sensitivity” depending on the audience, given the wide variety of family living situations that depart from the aspirations outlined in the proclamation (marriage between a man and a woman who find happiness together, bring children into the world, and seek to follow Christ together). When it comes to people who have never married or divorced—or experienced unhappy marriages, infertility, struggling children, or abuse in any form—the argument goes, “Why would you bring up ideals these people haven’t been able to experience yet? Don’t you realize this will make them feel bad?”“Who is suffering because we won’t talk about this?”And so some people stop talking about the family proclamation altogether. “I can’t remember the last time I’ve heard it mentioned at church,” writes Latter-day Saint therapist Rebecca Taylor. “Who is suffering because we won’t talk about this?” “Who is suffering because we won’t talk about this?” In some cases, this has created an atmosphere where speaking openly about these family truths feels exceptional. Attorney Brent Andrewsen recounts his daughter and her husband speaking about the proclamation in their ward four years ago and being told by several members afterward “how brave” they were—with another ward member mailing them a personal note thanking the family for their “boldness” and courage. **The Greater Danger** A lot obviously depends on how these truths are presented, Phelps hints, pointing out the obvious: that getting in people’s faces is helpful to no one. “I think we all know that, right?” But some today have concluded, Phelps adds, “that in order to show sensitivity and compassion, we need to avoid, tip-toe around, downplay or even denounce the Family Proclamation.” The seeming takeaway, Richardson says, is that even a mention (or glimpse) of the proclamation is somehow inherently “contentious” or insensitive—an argument she rejects. Leaders of the Church “constantly show us how to chart a loving course that welcomes all and forthrightly teaches all our doctrine,” Hedelius adds—without, again, denying some, especially online, who may still, unfortunately, use doctrine to “ostracize.” Members of a lay-run church also acknowledge “varying amounts of good-intentioned clumsiness” occasionally present in a lesson, alongside a collective need to keep improving our ability to teach skillfully with true charity and love. But it’s not just the sharer and teacher who need encouragement. Richardson also calls attention to the importance of listeners needing encouragement to receive teachings “with soft hearts and gratitude … gratitude that this doctrine even exists at all.” After acknowledging some possible stumbles culturally, Hedelius argues that “the far greater danger in many congregations is opposition to any teaching about marriage and chastity at all.” While some insist family doctrine is “already well known,” Hedelius says, others “claim lessons or talks about marriage and chastity just drive people away, so they’re not worth it.” **Not Going There Actually Hurts People** There are consequences for this kind of subtle, indirect silencing, according to these women. “I’m afraid that there are generations of people and kids right now that aren’t realizing how important these truths about the family are,” Phelps says, “that aren’t realizing that the most chance you have for success and happiness in your home is two parents, a mom and a dad married in the temple, raising their children in the gospel of Jesus Christ.” “There are a lot of people right now that don’t really realize that, or that aren’t being taught that,” she says, “and I feel that I owe a lot of my happiness in life to those principles, and so I feel a responsibility to share those things.” In her2023 book, “The Two-Parent Privilege: How Americans Stopped Getting Married and Started Falling Behind,” Melissa Kearney, an economist at the University of Maryland, discusses the economic impact of declining marriage rates and the increase in children raised in single-parent households. BYU’s Jenet Erickson hasexploredhow much babies and children specifically need a mother and a father. “I did not have a good home environment growing up. I had no idea what healthy families looked like,” a new convert to the Church shared on Facebook. “The only place I ever got good advice and modeling of good parenting was class comments during Relief Society lessons (for Latter-day Saint women).” “If it weren’t for sisters sharing their insights and recommendations here and there on Sundays, I never would have learned how to do things like discipline my kids well,” she continued. “Motherhood would have been overwhelming if it hadn’t been for ladies sharing in church about their childrearing insights.” Phelps speaks of feeling especially encouraged by teachings from President Russell M. Nelson, including from a2014 BYU speechin which he said, “Wherever we go, you and I, as disciples of the Lord, bear a solemn responsibility to proclaim the will of God to all people. And one of the more demanding opportunities of our time is to stand up for the truth regarding the sacred nature of marriage.” “I love this quote,” Phelps says, “because I’ve found a lot of people think we don’t really have a responsibility to share the truth. They’ll say loving others is our only job,” she says, pointing out how the prophets teach something else. “As disciples of Christ, we must love all men and proclaim the truth—a delicate and tricky balance, especially in today’s climate. We cannot have one without the other and I’m continually working on how to best strike that balance myself.” “Who is suffering because we won’t talk about this?” Phelps asks. **Tired of Being Silent** Although Phelps has always believed and supported these teachings, she says she didn’t realize how “vital” it was to share this with her own children until a recent eureka moment. “Whoa. What’s in this document is powerful,”—prompting her to feel especially sad that its teachings are sometimes “getting ignored” because “we don’t want to hurt people’s feelings.” So, Phelps decided to start sharing someproclamation-specific messagesonher Instagram, explaining in one of her messages, “I won’t downplay it, I won’t ignore it, and I won’t act as if somehow because times have changed, it’s now irrelevant or too hurtful and insensitive.” Carol Rice has observed a “rise” on social media of “faith content creators discussing the proclamation”—telling me, “I feel I am witnessing … the new generation rediscovering the wisdom of this proclamation.” **Opposition In All Things** Although receiving many messages of support, Phelps acknowledges a degree of “backlash” that can come when someone is willing to speak openly about the “Family Proclamation.” “I understand why people are afraid, but I again think we are doing a massive disservice to those around us when we are too afraid to speak up, and we don’t teach this. Not enough people know how important these truths about the family really are.” “You will likely encounter increasing debate about the definition of marriage,” President Nelson lateracknowledges, adding, “Many of your neighbors, colleagues, and friends will have never heard logical and inspired truths about the importance of marriage as God Himself defined it.” “Activism is increasing the social and emotional cost of teaching and testifying,” Hedelius writes, inducing those who are committed to the gospel to “fearfully introspect: Am I failing to be gentle and Christlike? Am I just clinging to hateful, outdated ideas? … Is it really necessary to teach this when it might cause discomfort? Will my friends and fellow congregants criticize me for being insensitive?” Hedelius summarizes one specific worry many people grapple with: “Straightforwardly teaching and testifying of the doctrine is failing to be gentle and Christlike to people who are struggling with sexuality and identity.” It’s true, Phelps says, that “some people seem to think that it means that I have no sensitivity towards people who identify as LGBT+”—before highlighting the blessing of personal revelation available to help people in different situations understand how to apply prophetic truths in their lives. “These doctrines and truths are too powerful and too important not to share,” this mother and influencer says, even with the expected push-back—pointing to how many people end up being encouraged when she does so. “For our own personal benefit, our children’s benefit, and society’s benefit, we need strong families,” Phelps says. “I’m convinced it would fix many of the issues plaguing our society today.” **Teach The Children Freely** It’s not just out of the home where this hesitance can arise. Some parents have even felt hesitant to teach their children about Latter-day Saint doctrine on the family. In recent years,Cassandra HedeliusandMeagan Koehlerhave both pushed back on the tendency to portray religious parents as somehow exclusive in the socialization they try to provide for their children. “Someone whose thirty hours on TikTok has convinced them biological sex is an arbitrary social construct,” Hedeliuswrites, “has been indoctrinated just as surely as someone whose thirty hours in the scriptures (or a biology textbook) has convinced them it’s not.” “No matter what,” she says, children will be taught and socialized. “The question is, by whom? And with what doctrine? By you? By the Church? By their friends? By the media and social media?” LikeAdam and Eve, we need to “teach these things freely unto your children,” she says—appreciatinghowthe “joy of redemption through Christ is inseparably connected with the joy of marriage and children.” “If activism within a particular congregation succeeds in problematizing the doctrine—making it solely a matter of private study, not to be brought up in Christlike company,” Hedelius adds, “that’s essentially as effective as a sermon proclaiming it isn’t true.” “This will take a particular toll on the youth and new members, who will certainly notice that people shift in their chairs and awkwardly study their toes whenever teachings about family and marriage come up,” she says. “They’ll be subtly persuaded not to believe the ‘controversial’ doctrine.” **“My Family Doesn’t Neatly Fit the Standards”** For those who feel like their family doesn’t line up with the “ideal family,” Phelps cautions against discouragement, which she says is “the opposite message of the gospel of Jesus Christ.” “There is always hope. All is never lost.” After someone commented critically on one of her online messages about the “Proclamation,” saying “not everyone meets the standard” and “this is offensive,” Phelps’ husband suggested, “Well, if everybody met the standard, then there would be no reason for (the “Proclamation”) in the first place.” “Would we ever not want to teach the Word of Wisdom if we knew a teenager’s mother smoked?” Richardson asks. “Of course not. Avoiding that teaching would actually be more of a disservice to that personbecauseof her situation.” She needs to hear testimony and clarity she may not be getting at home and have a “chance to feel the Spirit so she can develop her own testimony of it.” “As a single person, I sometimes find the family proclamation to be a painful reminder,” writes therapist Rebecca Taylor. “But at the same time, I am immeasurably grateful for it.” “We can try to be sensitive and mindful of the many (most!) whose lives don’t fit the ideal, but that doesn’t mean we should not talk about it. I see evidence of its importance with my clients all the time.” “If not now, teachers who tend to be avoidant need to ask themselves: When would it be appropriate to bring it up?” Richardson asks. “When will we ever have a class full of students who all live perfect lives, and whose home lives are perfect, and who know and live every single point of doctrine with exactness?” She then states the obvious: “If we can’t teach truth if anyone in our class struggles with something, or has a family member who struggles with something, we will simply never have the chance to teach truth.” **‘It changed their life (and mine)’** “Every time a bishop shies away from assigning a speaker to preach the doctrine of marriage and chastity, children are deprived of an important spiritual opportunity,” Hedeliusconcludes. “Every time a Primary teacher shies away from testifying that marriage between a man and a woman is ordained of God, children are deprived of needed spiritual nourishment.” At the same time, “Every time a speaker enthusiastically testifies of the doctrine of marriage and chastity, but the tension in the room mounts and members frown at their shoes, children are taught to constrain their faith. Every time a children’s activity leader preaches [that] we must only ‘listen’ and ‘validate’ and ‘hold space for’ (those with doubts) but never stand up for the doctrine of marriage and chastity, children’s light is extinguished.” Even though her parents would have been the kids where people could have said, “Oh, they’re coming to church; let’s be careful. Let’s not say anything that would hurt feelings,” Phelps describes how grateful she was they grew up in a time where it wasn’t so “politically correct,” and they learned what the truth was. “It was great. It put them on a good path, and it changed their life. And so it changed mine.” **About the author** **Jacob Z. Hess** **RECENT ARTICLES** All Post Book Club Bulletin Cartoon Covering the Coverage Devotionals Dialogue Editorials Essays Fact Check Faith Features Four Corners Health Media & Education Politics & Law Profiles Public Square Media Q&A Radical Civility Sexuality & Family Think Twice Top List Uncategorized Utah Scary Stories Women in the Public Square Back Politics Political Atmosphere The 2020 Election Election Aftermath Freedom Legal America The 2024 Election Back The Father & Son Gospel Fare Church & State Holidays Climate & End Times Leadership Tributes American Families of Faith Proclamation On the Family Back News Media Social Media Pop Culture Education Reading Book Club Technology Back Family Matters Parenting Generational Sexual Abuse Identity Back Tolerance Persuasion Racial Healing Social Justice History Back Pandemic Mental Health **Navigating Your Faith Journey: Questioning is Good** **The Prophetic Pattern of New Names and the Promise They Reveal** **A Voice of Warning: Prophets and Proclamations** **POPULAR ARTICLES** All Post Book Club Bulletin Cartoon Covering the Coverage Devotionals Dialogue Editorials Essays Fact Check Faith Features Four Corners Health Media & Education Politics & Law Profiles Public Square Media Q&A Radical Civility Sexuality & Family Think Twice Top List Uncategorized Utah Scary Stories Women in the Public Square Back Politics Political Atmosphere The 2020 Election Election Aftermath Freedom Legal America The 2024 Election Back The Father & Son Gospel Fare Church & State Holidays Climate & End Times Leadership Tributes American Families of Faith Proclamation On the Family Back News Media Social Media Pop Culture Education Reading Book Club Technology Back Family Matters Parenting Generational Sexual Abuse Identity Back Tolerance Persuasion Racial Healing Social Justice History Back Pandemic Mental Health **Our Culture of Contempt** **Social Science is not Enough** **What Past Attacks on Mormons and Catholics Teach Us About the Threat to Muslims** Can conspiracy thinking pave the way for the Antichrist? Yes—it distorts truth, fuels delusion, and prepares minds to worship lies as wonders. Can conspiracy thinking pave the way for the Antichrist? Yes—it distorts truth, fuels delusion, and prepares minds to worship lies as wonders. Latter-day Saints are a notably peaceful people. What keeps their communities nonviolent? Latter-day Saints are a notably peaceful people. What keeps their communities nonviolent? What is the real ecological crisis? Family and fertility decline threaten human and societal sustainability. What is the real ecological crisis? Family and fertility decline threaten human and societal sustainability. The Family Proclamation is beloved by members around the world. So why are some afraid to talk about it? The Family Proclamation is beloved by members around the world. So why are some afraid to talk about it? A near-death experience at 39 leads a mother to challenge her perceptions of entitlement, faith, and mortality. A near-death experience at 39 leads a mother to challenge her perceptions of entitlement, faith, and mortality. **CATEGORIES** Bulletin Women in the Public Square Faith Politics & Law Sexuality & Family Media & Education Dialogue Health Bulletin Women in the Public Square Faith Politics & Law Sexuality & Family Media & Education Dialogue Health **You Might Also Like** **Coherence, Calvinball, and the Consistent Ethic of Life** **Expressive Individualism and the Restored Gospel** The story we tell about the world as a whole (“worldview”) influences everything—including basic notions like truth, identity, belonging, and love. That’s true whether or not we’re aware of it, so let’s pay closer attention. **Women Who Dare to Mother** Is traditional motherhood viable today? Mothers of large families show it’s rewarding and sustainable. **How Narcissism is Fueling a Modern Gnostic Movement** Contemporary culture is fostering narcissism which is increasingly finding expression in new gnosticism, resulting in a self-perpetuating cycle that can lead to pathological outcomes. A project of the Elizabeth McCune Institute. About Us Terms & Conditions Privacy Policy About Us Terms & Conditions Privacy Policy Contact or Submission Receive Public Square Articles In Your Inbox! © 2023 Public Square Mag. All Rights Reserved. **Subscribe To Our Weekly Newsletter** Stay up to date on the intersection of faith in the public square. **You have Successfully Subscribed!** **Pin It on Pinterest** Facebook Twitter reddit LinkedIn Print Friendly"}