{"id": 1015, "name": "The National Institute of Standards and Technology", "domain": "nist.gov", "bias": "pro-science", "credibility": "high-credibility", "reporting": "very-high", "questionable": null, "url": "https://www.nist.gov/office-director/freedom-information-act", "title": "Freedom Information Act", "content": "An official website of the United States government Here’s how you know Official websites use .govA.govwebsite belongs to an official government organization in the United States. Secure .gov websites use HTTPSAlock(LockA locked padlock) orhttps://means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites. https://www.nist.gov/director/freedom-information-act Publications What We DoAll TopicsAdvanced communicationsArtificial intelligenceBioscienceBuildings and constructionChemistryCybersecurityElectronicsEnergyEnvironmentFireForensic scienceHealthInformation technologyInfrastructureManufacturingMaterialsMathematics and statisticsMetrologyNanotechnologyNeutron researchPerformance excellencePhysicsPublic safetyQuantum information scienceResilienceStandardsTransportation All Topics Advanced communications Artificial intelligence Bioscience Buildings and construction Chemistry Cybersecurity Electronics Energy Environment Fire Forensic science Health Information technology Infrastructure Manufacturing Materials Mathematics and statistics Metrology Nanotechnology Neutron research Performance excellence Physics Public safety Quantum information science Resilience Standards Transportation All Topics Advanced communications Artificial intelligence Bioscience Buildings and construction Chemistry Cybersecurity Electronics Energy Environment Fire Forensic science Health Information technology Infrastructure Manufacturing Materials Mathematics and statistics Metrology Nanotechnology Neutron research Performance excellence Physics Public safety Quantum information science Resilience Standards Transportation Labs & Major ProgramsAssoc Director of Laboratory ProgramsLaboratoriesCommunications Technology LaboratoryEngineering LaboratoryInformation Technology LaboratoryMaterial Measurement LaboratoryPhysical Measurement LaboratoryUser FacilitiesNIST Center for Neutron ResearchCNST NanoFabResearch Test BedsResearch ProjectsTools & InstrumentsMajor ProgramsBaldrige Performance Excellence ProgramCHIPS for America InitiativeManufacturing Extension Partnership (MEP)Office of Advanced ManufacturingSpecial Programs OfficeTechnology Partnerships Office Assoc Director of Laboratory Programs LaboratoriesCommunications Technology LaboratoryEngineering LaboratoryInformation Technology LaboratoryMaterial Measurement LaboratoryPhysical Measurement Laboratory Communications Technology Laboratory Engineering Laboratory Information Technology Laboratory Material Measurement Laboratory Physical Measurement Laboratory User FacilitiesNIST Center for Neutron ResearchCNST NanoFab NIST Center for Neutron Research CNST NanoFab Research Test Beds Research Projects Tools & Instruments Major ProgramsBaldrige Performance Excellence ProgramCHIPS for America InitiativeManufacturing Extension Partnership (MEP)Office of Advanced ManufacturingSpecial Programs OfficeTechnology Partnerships Office Baldrige Performance Excellence Program CHIPS for America Initiative Manufacturing Extension Partnership (MEP) Office of Advanced Manufacturing Special Programs Office Technology Partnerships Office Assoc Director of Laboratory Programs LaboratoriesCommunications Technology LaboratoryEngineering LaboratoryInformation Technology LaboratoryMaterial Measurement LaboratoryPhysical Measurement Laboratory Communications Technology Laboratory Engineering Laboratory Information Technology Laboratory Material Measurement Laboratory Physical Measurement Laboratory Communications Technology Laboratory Engineering Laboratory Information Technology Laboratory Material Measurement Laboratory Physical Measurement Laboratory User FacilitiesNIST Center for Neutron ResearchCNST NanoFab NIST Center for Neutron Research CNST NanoFab NIST Center for Neutron Research CNST NanoFab Research Test Beds Research Projects Tools & Instruments Major ProgramsBaldrige Performance Excellence ProgramCHIPS for America InitiativeManufacturing Extension Partnership (MEP)Office of Advanced ManufacturingSpecial Programs OfficeTechnology Partnerships Office Baldrige Performance Excellence Program CHIPS for America Initiative Manufacturing Extension Partnership (MEP) Office of Advanced Manufacturing Special Programs Office Technology Partnerships Office Baldrige Performance Excellence Program CHIPS for America Initiative Manufacturing Extension Partnership (MEP) Office of Advanced Manufacturing Special Programs Office Technology Partnerships Office Services & ResourcesMeasurements and StandardsCalibration ServicesLaboratory Accreditation (NVLAP)Quality SystemStandard Reference Materials (SRMs)Standard Reference Instruments (SRIs)Standards.govTime ServicesOffice of Weights and MeasuresSoftwareDataChemistry WebBookNational Vulnerability DatabasePhysical Reference DataStandard Reference Data (SRD)StorefrontLicense & PatentsComputer Security Resource Center (CSRC)NIST Research Library Measurements and StandardsCalibration ServicesLaboratory Accreditation (NVLAP)Quality SystemStandard Reference Materials (SRMs)Standard Reference Instruments (SRIs)Standards.govTime ServicesOffice of Weights and Measures Calibration Services Laboratory Accreditation (NVLAP) Quality System Standard Reference Materials (SRMs) Standard Reference Instruments (SRIs) Standards.gov Time Services Office of Weights and Measures Software DataChemistry WebBookNational Vulnerability DatabasePhysical Reference DataStandard Reference Data (SRD) Chemistry WebBook National Vulnerability Database Physical Reference Data Standard Reference Data (SRD) Storefront License & Patents Computer Security Resource Center (CSRC) NIST Research Library Measurements and StandardsCalibration ServicesLaboratory Accreditation (NVLAP)Quality SystemStandard Reference Materials (SRMs)Standard Reference Instruments (SRIs)Standards.govTime ServicesOffice of Weights and Measures Calibration Services Laboratory Accreditation (NVLAP) Quality System Standard Reference Materials (SRMs) Standard Reference Instruments (SRIs) Standards.gov Time Services Office of Weights and Measures Calibration Services Laboratory Accreditation (NVLAP) Quality System Standard Reference Materials (SRMs) Standard Reference Instruments (SRIs) Standards.gov Time Services Office of Weights and Measures Software DataChemistry WebBookNational Vulnerability DatabasePhysical Reference DataStandard Reference Data (SRD) Chemistry WebBook National Vulnerability Database Physical Reference Data Standard Reference Data (SRD) Chemistry WebBook National Vulnerability Database Physical Reference Data Standard Reference Data (SRD) Storefront License & Patents Computer Security Resource Center (CSRC) NIST Research Library News & EventsNewsEventsBlogsFeature StoriesAwardsVideo GalleryImage GalleryMedia Contacts News Events Blogs Feature Stories Awards Video Gallery Image Gallery Media Contacts News Events Blogs Feature Stories Awards Video Gallery Image Gallery Media Contacts About NISTAbout UsLeadershipOrganization StructureBudget & PlanningContact UsVisitCareersStudent programsWork with NISTHistoryNIST Digital ArchivesNIST MuseumNIST and the NobelEducational Resources About UsLeadershipOrganization StructureBudget & Planning Leadership Organization Structure Budget & Planning Contact Us Visit CareersStudent programs Student programs Work with NIST HistoryNIST Digital ArchivesNIST MuseumNIST and the Nobel NIST Digital Archives NIST Museum NIST and the Nobel Educational Resources About UsLeadershipOrganization StructureBudget & Planning Leadership Organization Structure Budget & Planning Leadership Organization Structure Budget & Planning Contact Us Visit CareersStudent programs Student programs Student programs Work with NIST HistoryNIST Digital ArchivesNIST MuseumNIST and the Nobel NIST Digital Archives NIST Museum NIST and the Nobel NIST Digital Archives NIST Museum NIST and the Nobel Educational Resources **Office of the Director** Leadership Committees and BoardsExpand or CollapseVisiting Committee on Advanced Technology (VCAT)NIST Safety Commission Visiting Committee on Advanced Technology (VCAT) NIST Safety Commission Visiting Committee on Advanced Technology (VCAT) NIST Safety Commission National Academies NRC Assessments NIST Organization Structure Major Speeches by DoC/NIST Managers **Freedom of Information Act** **Share** The Freedom of Information Act, enacted in 1966, provides that any person has a right, enforceable in court, of access to federal agency records, except to the extent that such records are protected from disclosure by one of nine exemptions or by one of three special law enforcement records exclusions. General information regarding the FOIA can be found atwww.foia.gov. Requests must be made to the particular agency whose documents are the subject of your request. The principal FOIA contacts at other federal agencies can be found athttp://www.foia.gov/report-makerequest.html. How to File a FOIA Request Privacy Act Request — Certificate of Identity NIST FOIA Officer Frequently Asked Questions Exemptions Electronic FOIA Sample Letters DoC FOIA Homepage Electronic FOIA Library NIST and the World Trade Center Federal Register Notice dated August 14, 2009, for Submitters of Photographs and Videos Collected by the National Institute of Standards and Technology for Its Investigation Into the Failures of the World Trade Center Buildings Freedom of Information Act Requests FREQUENTLY ASKED QUESTIONS How do I make a FOIA request? The National Institute of Standards and Technology (NIST) is a scientific agency of the U.S. Department of Commerce. The principal FOIA contacts at other federal agencies can be found athttp://www.foia.gov/report-makerequest.html. To make a request to NIST, submit your request inwritingto the NIST FOIA Office via e-mail tofoia[at]nist.gov(foia[at]nist[dot]gov)or at the following address: National Institute of Standards and TechnologyAmy Egan, Acting FOIA & Privacy Act Officer100 Bureau Drive, STOP 1710Gaithersburg, MD 20899-1710 Do I need to complete a form?No, just write aletteror send an e-mail message with as much detail as possible about the records you want. How does NIST process FOIA requests?When your request arrives in the FOIA Office, it is logged in and then sent to the area(s) within NIST that may have the records you have requested. Program staff in those areas search their files for the records. If our staff find records, they review them and send them to the FOIA Office. The FOIA Office then reviews the response package and determines which records can or cannot be released. All releasable records are sent to the requester with a letter from the FOIA Officer. How long will it take NIST to respond to my request?Under FOIA, agencies have 20 working days to answer a request. What kinds of records can NIST withhold and on what grounds can the agency deny a request?An agency must provide records to a requester regardless of the identity of the requester or the requester's purpose in seeking the records. It must also provide the records even if the requester can otherwise obtain them from a non-government source, so long as the requested records are \"agency records\" subject to the FOIA. The agency can refuse to disclose them only when they fall within one of the nine specific statutory exemptions from the FOIA's disclosure provisions under section 552(b) of the law. Exemptions include: Exemption 1 - Classified documentsExemption 2 - Internal agency rulesExemption 3 - Information exempted by another federal statuteExemption 4 - Confidential business informationExemption 5 - Internal government communicationsExemption 6 - Personal privacyExemption 7 - Law enforcementExemption 8 - Financial institutional recordsExemption 9 - Geological information How do I know if NIST has withheld records from me?The FOIA Office will tell you in its response letter if records or parts of records you requested have been withheld and which exemptions apply. What if I think NIST has withheld records and should not have?If NIST withholds records from you, your response letter will state your appeal rights. The letter will say that you may challenge the decision to withhold records or parts of records and will describe how you may file an appeal. If your appeal is denied, you can file a judicial appeal in the U.S. District Court where you live, in the district where the documents are located, or in the District of Columbia. What happens if NIST does not have the records I want?The FOIA Office will tell you in writing if they are unable to locate records you requested. If our FOIA Office staff know that another agency has the records you want, they will refer you to that agency. What are the fees for filing a FOIA request?FOIA allows agencies to charge requesters for FOIA services, e.g., search and review time, copy costs, and special services such as document certification and Federal Express fees. If you are concerned about costs, ask for a cost estimate in your letter. FOIA staff will let you know roughly what your fees will be before they process your request, and they will give you a chance to approve these fees. How can I reach the NIST FOIA Office?The FOIA Office can be reached by phone at (301) 975-4074. Their address is: National Institute of Standards and Technology, FOIA Office, 100 Bureau Drive, Stop 1710, Gaithersburg, MD 20899-1710. The NIST FOIA Reading Room is located in Building 101, Room B25. To access the room contactfoia[at]nist.gov(foia[at]nist[dot]gov.) SAMPLE LETTERS The bracketed [ ] areas explain how to use these sample letters to write your own letter. Freedom of Information Act Request Letter Amy EganActing Freedom of Information Act OfficerNational Institute of Standards and Technology100 Bureau Drive - Stop 1710Gaithersburg, MD 20899-1710 Re: Freedom of Information Act Request Dear ___________________: This is a request under the Freedom of Information Act, 5 U.S.C. Sec. 552. I request that a copy of the following documents [or documents containing the following information] be provided to me: [identify the documents or information as specifically as possible]. In order to help to determine my status to assess fees, you should know that I am [insert a suitable description of the requester and the purpose of the request]. [Sample requester descriptions: —a representative of the news media affiliated with (a newspaper, magazine, television station, etc., or a public interest organization that publishes or disseminates information, etc.), and this request is made as part of news gathering and not for a commercial use. —affiliated with an educational or noncommercial scientific institution, and this request is made for a scholarly or scientific purpose and not for a commercial use. —an individual seeking information for personal use and not for a commercial use. —affiliated with a private corporation and am seeking information for use in the company's business.] [Optional] I am willing to pay fees for this request up to a maximum of $[ ]. If you estimate that the fees will exceed this amount, please inform me first. [Optional] I request a waiver of all fees for this request. Disclosure of the requested information to me is in the public interest because it is likely to contribute significantly to public understanding of the operations or activities of the government and is not primarily in my commercial interest. [Include a specific explanation] Thank you for your consideration of this request. Sincerely, NameAddressCity, State, Zip CodeTelephone Number [optional] Freedom of Information Act Appeal Letter Assistant General Counsel for Administration (Office)U.S. Department of CommerceRoom 5898-C14th and Constitution Avenue, N.W.Washington, D.C. 20230 Re: Freedom of Information Act Appeal Dear ______________________: This is an appeal under the Freedom of Information Act. On [date], I requested documents under the Freedom of Information Act. My request was assigned the following identification number [00-000-00]. On [date], I received a response to my request in a letter signed by [name of official]. I appeal the denial of my request. [Optional] The documents that were withheld must be disclosed under the FOIA because __________________________________________________________. [Optional] I appeal the decision to deny my request for a waiver of fees. I believe that I am entitled to a waiver of fees. Disclosure of the documents I requested is in the public interest because the information is likely to contribute significantly to public understanding of the operations or activities of the government and is not primarily in my commercial interests. [provide details] [Optional] I appeal the decision to require me to pay review costs for this request. I am not seeking the documents for commercial use. [provide details] [Optional] I appeal the decision to require me to pay search charges for this request. I am a reporter seeking information as part of news gathering and not for commercial use. Thank you for your consideration of this appeal. Sincerely, NameAddressCity, State, Zip CodeTelephone Number [optional] EXEMPTIONS Exemption 1applies to matters that are \"(A) specifically authorized under criteria established by an Executive Order to be kept secret in the interest of national defense or foreign policy and (B) are in fact properly classified pursuant to such Executive Order.\" Executive Order 12356, issued by President Reagan, requires agency records to be classified if their disclosure \"reasonably could be expected to cause damage to the national security.\" Such records, if \"in fact properly classified\" according to the substantive and procedural rules of the Executive Order, are exempt from mandatory disclosure under the FOIA. Requesters should note that courts have upheld agencies decisions to \"neither confirm nor deny\" the existence of requested records in cases where disclosure merely of the records' existence reasonably could be expected to cause damage to the national security. FOIA amendments adopted in 1986 authorize the FBI to do this for its classified records pertaining to foreign intelligence, counterintelligence, or international terrorism investigations. Exemption 2applies to matters that are \"related solely to the internal personnel rules and practices of any agency.\" This has generally been interpreted to exempt from disclosure only those minor and routine matters in which the public could not reasonably be expected to have an interest. It has also been interpreted to exempt law enforcement manuals from disclosure where such manuals are predominantly of internal interest to agency personnel and their disclosures significantly risks circumvention of agency regulations or statutes. Exemption 3applies to matters that are \"specifically exempted from disclosure by statute (other than section 552b of this title), if that statute– (A)(i) requires that the matters be withheld from the public in such a manner as to leave no discretion on the issue; or (ii) establishes particular criteria for withholding or refers to particular types of matters to be withheld; and (B) if enacted after the date of enactment of the OPEN FOIA Act of 2009, specifically cites to this paragraph. (As amended by the OPEN FOIA ACT of 2009.) Statutes Found to Qualify under Exemption 3 of the FOIA can be reviewed on theDepartment of Justice (DoJ) Office of Information Policy (OIP) homepageand will be updated regularly. Exemption 4applies to matters that are \"trade secrets and commercial or financial information obtained from a person and privileged or confidential.\" In order to bring a record within this exemption, an agency must show that the information is (A) a trade secret or (B) information that is (1) commercial or financial, (2) obtained from a person, and (3) privileged or confidential. If the information was generated by the government, it cannot fall within this exemption. However, the term \"person\" is here, as elsewhere in the FOIA, broadly construed to include a wide range of entities, private corporations and the like. Requested records will be considered \"confidential\" within the meaning of this exemption if their disclosure is likely to impair the government's ability to obtain necessary information in the future or cause substantial harm to the competitive position of the person from whom the information was obtained. A pledge of confidentiality from the agency or the fact that the information at issue is not customarily available to the public will not qualify requested materials as \"confidential\" under this exemption. Exemption 4 cases sometimes give rise to so-called \"reverse FOIA\" actions, in which the original submitter of the requested materials will seek to prevent the agency from releasing them to the requester. Exemption 5applies to matters that are \"inter-agency or intra-agency memoranda or letters that would not be available by law to a party other than an agency in litigation with the agency.\" This provision was intended to incorporate certain common law discovery privileges into the FOIA exemption scheme, and it is probably the most complex of the FOIA's nine exemptions. Included within its scope are the \"executive\" privilege (protecting advice, recommendations and opinions that are part of the deliberative, consultative, decision-making processes of government), the attorney \"work-product\" privilege (protecting documents prepared by an attorney in anticipation of particular proceedings, where disclosure would reveal the attorney's litigation strategy or theory of the case), and the attorney-client privilege (protecting confidential communications between attorneys and their clients). The \"executive\" privilege, which is the most frequently encountered application of Exemption 5 generally involves the most difficult \"line-drawing\" problems for the agencies and the courts. Pre-decisional versus post-decisional, fact versus opinion — these distinctions hold clear only to a point. Courts have held that pre-decisional recommendations, which would ordinarily be exempt, lose the protection of the \"executive\" privilege if an agency, in making a final decision, chooses expressly to adopt them or incorporate them by reference. Conversely, facts that would ordinarily be available to the public have been withheld where they are selected or summarized in a way that reflects the deliberative process or where their disclosure would impair the agency's ability to obtain information that is essential to the agency's decision-making process. Exemption 6applies to \"personnel and medical files and similar files the disclosure of which would constitute a clearly unwarranted invasion of personal privacy.\" This exemption requires agencies and Courts to balance personal privacy interests against the public interest in disclosure when the record of information at issue can be identified as applying to a particular individual. Although the Supreme Court has noted that the exemption standard of \"clearly unwarranted\" appears to tilt this balance in favor of disclosure, the Court has also made clear that, for purposes of the FOIA, there is \"public interest\" in the disclosure of \"personal\" information only when such information will shed light on the operations or activities of some government agency or official. Exemption 7applies to records or information compiled for law enforcement purposes, but \"only to the extent that the production of such law enforcement records or information (A) could reasonably be expected to interfere with enforcement proceedings, (B) would deprive a person of a right to a fair trial or an impartial adjudication, (C) could reasonably be expected to constitute an unwarranted invasion of personal privacy, (D) could reasonably be expected to disclose the identity of a confidential source, including a state, local, or foreign agency or authority or any private institution which furnished information on a confidential basis, and, in the case of a record or information compiled by criminal law enforcement authority in the course of a criminal investigation or by an agency conducting a lawful national security intelligence investigation, information furnished by a confidential source, (E) would disclose techniques and procedures for law enforcement investigations or prosecutions if such disclosure could reasonably be expected to risk circumvention of the law, or (F) could reasonably be expected to endanger the life or physical safety of any individual.\" Congress had substantially revised the original 1966 language of this exemption in 1974, and the current version reflects further amendments enacted in October 1986. Before demonstrating that disclosure of particular records would result in at least one of the six enumerated harms, the agency must show that the records are \"compiled for law enforcement purposes.\" Although civil and criminal, judicial and administrative enforcement proceedings may all qualify for protection, the proceedings must involve a specific, suspected violation of law. In the case of a criminal law enforcement agency, whether records were \"compiled for a law enforcement purpose\" is generally a function of whether there is a \"rational\" link between the information connected and one of the agencies law enforcement duties. However, in the case of the FBI, some courts have concluded that virtually all Bureau records are necessarily \"compiled for law enforcement purposes\" because of the nature of the FBI's responsibilities. Many courts have also said that such information, when compiled in the course of a criminal investigation, is presumed confidential under Section (7) (D), unless proven otherwise. It should also be noted that information contained in records originally compiled for law enforcement purposes does not lose exemption protection when it is summarized or reproduced in a new document that is compiled for some purpose other than law enforcement. Conversely, records originally compiled for purposes other than law enforcement can nevertheless qualify for Exemption 7 protection if they are subsequently assembled for law enforcement purposes. The 1986 FOIA amendments permit an agency to refuse to confirm or deny the existence of records when disclosure of their existence could reasonably be expected to interfere with a criminal law enforcement proceeding, and there is reason to believe that the subject of the proceeding is not aware of its pendency. Exemption 8applies to matters that are \"contained in or related to examination, operating, or condition reports prepared by, on behalf of, or for the use of an agency responsible for the regulation or supervision of financial institutions.\" This seldom-encountered exemption is broadly applied by the courts to withhold a wide variety of reporting materials from many different kinds of ''financial institutions.\" Although the term financial institution is not defined in the FOIA or its legislative history, case law has ruled that it may include any entity authorized to do business under federal laws concerning banks and related institutions. The scope of the exemption is, therefore, not limited to depository institutions or entities actually regulated by the agency at issue, nor is it limited to matters affecting the solvency of the particular institution. Exemption 9applies to matters that are \"geological and geophysical information and data, including maps, concerning oil wells.\" This least-asserted, least-litigated exemption of the FOIA provides blanket protection for oil well information, which is in most cases also protected by Exemption 4. It is important to remember that the exemptions listed above are discretionary rather than mandatory; in effect, this means that an agency can decide to release records to a requester even after it has determined that the records may be withheld pursuant to one or more of the exemptions. The FOIA also requires an agency to provide a requester with any \"reasonably segregable portion\" of a record after deletion of the portions which are exempt\" from disclosure. This means that any agency may not withhold an entire document on the grounds that some portions of the document are exempt. **HEADQUARTERS** Webmaster|Contact Us|Our Other Offices Site Privacy Accessibility Privacy Program Copyrights Vulnerability Disclosure No Fear Act Policy FOIA Environmental Policy Scientific Integrity Information Quality Standards Commerce.gov Science.gov USA.gov Vote.gov"}