{"id": 252, "name": "Climate Justice Alliance", "domain": "climatejusticealliance.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://climatejusticealliance.org/get-involved/#Receive-Regular-Updates", "title": "#receive Regular Updates", "content": "En Español Resources Newsroom Podcast Blog Funders & Donors Member Login Contact Who We AreAboutOur TeamBlack CaucusFrontline YouthOur HistoryNewsroom About Our Team Black Caucus Frontline Youth Our History Newsroom About Our Team Black Caucus Frontline Youth Our History Newsroom What We DoJust TransitionJust RecoveryEnergy DemocracyFood SovereigntyIt Takes RootsOur Power CommunitiesReinvest in Our PowerPolicy Just Transition Just Recovery Energy Democracy Food Sovereignty It Takes Roots Our Power Communities Reinvest in Our Power Policy Just Transition Just Recovery Energy Democracy Food Sovereignty It Takes Roots Our Power Communities Reinvest in Our Power Policy How We WorkFight the BadChange the RulesMove the MoneyBuild the Bigger WeBuild the NewChange the Story Fight the Bad Change the Rules Move the Money Build the Bigger We Build the New Change the Story Fight the Bad Change the Rules Move the Money Build the Bigger We Build the New Change the Story Get InvolvedSupportNewsletterBecome a MemberFunders & DonorsJobs Support Newsletter Become a Member Funders & Donors Jobs Support Newsletter Become a Member Funders & Donors Jobs Donate •••En EspañolResourcesNewsroomBlogFunders & DonorsMember LoginContact En Español Resources Newsroom Blog Funders & Donors Member Login Contact En Español Resources Newsroom Blog Funders & Donors Member Login Contact Featured Work Let’s talk about Artificial Intelligence. **Get Involved** **Take Action** **Ways to Support** Climate Justice Alliance and our members are leading the shift from an extractive economy to a regenerative economy by: Demanding bold action by governments and industry to confront climate change; and Collaborating towardsustainable, resilient, regenerative economiesthat benefit allcommunities. You can support Climate Justice Alliance: Do youhave financialor in-kind resources (legal expertise, healing experience, or facilitation skills for example) to help grow the movement and build power? Yoursupportensures that we are building a base that is sustainable and strengthens our ability to continue putting frontline communities first. Contact Hailey Sinoff at hailey@climatejusticealliance.org. Nothing changes hearts, minds, and practices more than word of mouth and friends. We encourage CJA supporters to hold brown bag lunches, dinners, and house/dorm or office parties to raise climate justice consciousness and support for a Just Transition. Contact Hailey Sinoff at hailey@climatejusticealliance.org. Do you have time to volunteer, intern, or commit to a 1-year fellowship with the Climate Justice Alliance? We are in the process of setting up some exciting opportunities like this at CJA. Pleasecheck our Open Positions hereor send your general interest to[email protected] CJA is in a growth phase. The work to curb climate change is a big lift. We encourage you to applyto open positions here. **Receive Regular Updates** **Follow us** Want to hear and see the latest work CJA and our members are doing? FollowFollow FollowFollow FollowFollow FollowFollow **Support the Alliance** **Grow With Us** We are building local alternatives that center traditional ecological and cultural knowledge and create a pathway for a regenerative future. AboutOur MembersOur TeamSpeakers Bureau WelcomeContact UsBecome A Member Energy DemocracyFood SovereigntyIt Takes RootsOur PowerReinvest In Our Power NewsroomBlogFunders Fight The BadChange The RulesMove The MoneyBuild The Bigger WeBuild The NewChange The Story Facebook X"}