{"id": 765, "name": "Knowhere", "domain": "knowherenews.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://knowherenews.com/woman-allegedly-shoots-man-in-the-face-during-road-rage-in-coolbaugh-township-pennsylvania/", "title": "Woman Allegedly Shoots Man In The Face During Road Rage In Coolbaugh Township Pennsylvania", "content": "Us news Riverside Treasure Coast Crime news Local news Politics **Woman Allegedly Shoots Man in the Face During Road Rage in Coolbaugh Township, Pennsylvania** A shocking case of road rage in Coolbaugh Township, Monroe County, Pennsylvania, has left one man injured and a woman facing serious charges. According to Pennsylvania State Police, a woman allegedly shot a man in the face during a road rage incident on Sunday afternoon. The incident happened around 4:20 p.m. on June 2, 2024, on Route 196, near the intersection with Kings Way in Coolbaugh Township. Police say that the woman, identified as 45-year-old Tamika Oliver from Mount Pocono, was involved in a heated confrontation with a 39-year-old man from Tobyhanna. The situation quickly escalated into violence. Investigators say that both drivers were in separate cars when the argument began. At some point during the dispute, Oliver allegedly pulled out a gun and fired it at the man, striking him in the face. Emergency medical teams rushed the injured man to Lehigh Valley Hospital – Pocono for treatment. Authorities have confirmed that he was shot in the jaw. As of now, no updates on his condition have been officially released, but police say he is expected to survive. After the shooting, Tamika Oliver was taken into custody by state police. She is now facing several charges, including aggravated assault and reckless endangerment. Officials said the investigation is still ongoing, and more charges could be filed depending on the evidence gathered. According to the police report, the shooting happened in broad daylight on a busy road, raising concerns among residents in the area. Many locals were shocked by the violent nature of the incident. “It’s scary to think something like this can happen just because of an argument on the road,” said one Coolbaugh Township resident who lives near the scene. The Pennsylvania State Police have not yet shared the exact reason behind the road rage or what may have triggered the altercation between the two individuals. However, they have stated that both parties were not previously known to each other, suggesting that this was a random confrontation between strangers. Oliver was arraigned before a magistrate and is currently being held at the Monroe County Correctional Facility. Her bail has not been publicly disclosed. She is expected to appear in court soon to respond to the charges. In the meantime, authorities are asking anyone who witnessed the incident or has dashcam footage from that area around 4:20 p.m. on Sunday to come forward and share the information with investigators. They hope that more evidence will help clarify the details and lead to a fair outcome in court. This incident adds to a growing number of road rage cases across the country, where minor arguments while driving have ended in serious violence. Law enforcement agencies continue to remind drivers to stay calm in traffic situations and avoid engaging in confrontations with other motorists. Road rage is defined as aggressive or violent behavior by a driver in response to traffic conditions or the actions of another driver. While it often involves yelling or rude gestures, it can sometimes turn physical or even deadly, as seen in this case. Police urge the public to report dangerous driving or aggressive behavior on the road by calling emergency services or using the State Police tip line. Avoiding confrontation and staying focused while driving can help prevent such tragic incidents. As the investigation continues, more details may be released by authorities in the coming days. For now, Coolbaugh Township residents are left shaken by an incident that could have turned even more deadly, and a reminder of how quickly things can go wrong on the road. **Post navigation** **Leave a ReplyCancel reply** Your email address will not be published.Required fields are marked* Comment* Name* Email* Website Save my name, email, and website in this browser for the next time I comment. **Recent Posts** Peaceful Protest Held in Des Moines Against ICE Raids, No Law Enforcement Present Iowa Pride Ensembles Makes History as First LGBTQ Marching Band at Capital City Pride Bethlehem Area School Board Approves 4.3% Tax Increase as Budget Gaps Remain Unresolved Philadelphia City Council Developing Programs to Offer Youth Safe Summer Activities Bear Kills Deer in Residential Maywood Backyard, Police Confirm Incident **Categories** Alabama Alaska Business California Celebrity News Crime news Education Event Finance Georgia Government Health Idaho Illinois Indiana Kentucky Latest News Living Local news Maine Mobility money New Hampshire New Mexico News NonProfit North Dakota Ohio Pennsylvania Politics Region/State Riverside Science Social Security Sports Stimulus Texas Treasure Coast Uncategorized Us news Voices Washington Weather Proudly powered by WordPress|Theme: Newsup byThemeansar. About Us Contact Us Privacy Policy"}