{"id": 906, "name": "Mexico Daily News", "domain": "mexiconewsdaily.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://mexiconewsdaily.com/news/mexicos-first-ever-judicial-elections-draw-international-scrutiny-over-low-turnout-process-flaws/#comments", "title": "Mexicos First Ever Judicial Elections Draw International Scrutiny Over Low Turnout Process Flaws", "content": "Home MND_LocalBaja California PeninsulaEl BajíoGulf CoastMexico City PlusNorth-Central Pacific CoastNorthern Border ZoneSouthwestYucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula News Business Politics Culture Lifestyle Travel Food & Drink Real Estate Mexico Living MND TV Subscribe Login Home MND_LocalBaja California PeninsulaEl BajíoGulf CoastMexico City PlusNorth-Central Pacific CoastNorthern Border ZoneSouthwestYucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula News Business Politics Culture Lifestyle Travel Food & Drink Real Estate Mexico Living MND TV Subscribe Home MND_LocalBaja California PeninsulaEl BajíoGulf CoastMexico City PlusNorth-Central Pacific CoastNorthern Border ZoneSouthwestYucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula Baja California Peninsula El Bajío Gulf Coast Mexico City Plus North-Central Pacific Coast Northern Border Zone Southwest Yucatan Peninsula News Business Politics Culture Lifestyle Travel Food & Drink Real Estate Mexico Living MND TV Subscribe **Mexico’s first-ever judicial elections draw international scrutiny over low turnout, process flaws** After observing Mexico’s judicial elections on June 1, the Electoral Observation Mission (EOM) of the Organization of American States (OAS) offered some blunt advice to other Western Hemisphere countries: don’t attempt to replicate “this model of selecting judges.” In a34-page preliminary reportpublished on June 6, the EOM expressed concern about “the low level of citizen participation” in the elections —around 13% of eligible voters— and noted that “a high percentage of null and unmarked ballots was recorded.” Fewer than 1 in 7 Mexicans voted in first-ever judicial elections It also highlighted that “there is no precedent in the world in which the entirety of a country’s judges is elected by universal suffrage.” The publication of the EOM report came after a 16-person mission led by former Chilean Foreign Affairs Minister Heraldo Muñoz Valenzuela observed the elections at polling stations in Mexico City and México state. In addition to monitoring voting on election day, the mission “analyzed various aspects of the elections such as electoral organization, electoral technology, the evaluation and selection process for judicial candidacies, electoral justice, and the participation of women,” the EOM said. **Criticisms of the judicial elections and electoral process** The report stated that the EOM observed that the process related to Mexico’s first-ever judicial elections “was carried out in a very short timeframe and in a complex political context, characterized by strong polarization and a high level of litigation.” “Last Sunday’s election is the result ofthe constitutional reform approved in September 2024, which establishes popular vote as the selection mechanism for those who will serve as judges and justices at all levels throughout the national territory,” it said. As part of its observation mission, which began May 24, the EOM observers spoke to members of the judiciary, government representatives, academics, judicial election candidates and representatives of civil society organizations, among others. The EOM said in its report that “most of the actors with whom the Mission interviewed agreed that, despite the efforts of the electoral authority, the electorate had little knowledge about the positions at stake in the election, their different responsibilities and the profiles of the applicants.” “The interviewees also agreed that the prohibition on buying advertising space on radio, television, or social media made it very difficult for candidates to make themselves known,” the report said. On June 1, voters faced the gargantuan and confusing task of electing a total of almost 2,700 judges, including nearly 900 federal ones, from a pool of some 7,700 candidates. Despite the low turnout, President Claudia Sheinbaum described the democratic exercise as a great success. For its part, the EOM noted that: Some candidates wereaccused of having links to criminal organizations. Electoral packages containing 131,000 ballots were stolen in Chiapas. Delays in the opening of polling stations “were recorded in various regions of the country.” Complaints were filed “about the distribution of ‘cheat sheets’ (acordeones) during election day.” Some of those cheat sheets were distributed by people affiliated with Mexico’s ruling party Morena, which, government critics say, will effectively come to control the country’s judiciary given that large numbers of candidates it tacitly supported were elected to judgeships. The EOM highlighted that “the nine candidacies with the highest number of votes for the Supreme Courtwere promoted on physical and virtual ‘cheat sheets.'” “Furthermore, it was verified that six of the new justices were nominated by the Executive Branch’s [candidate selection] committee and the remaining three are current members of the court appointed by the former president, which raises reasonable doubts about the autonomy and independence of the highest tribunal with respect to the Executive,” the mission said. The OEM also pointed out thatthe National Electoral Institute (INE) only received just over half the funding it requestedto organize the elections. It noted that the INE was consequently forced to cut costs in a range of ways, including by reducing “the number of sectional polling stations by more than 50%.” **Recommendations ahead of 2027 judicial elections** The OEM made a number of recommendations based on its observation of the process related to Mexico’s June 1 judicial elections. A second round of judicial elections is slated to be held in 2027 on the same day that federal midterm elections will take place. Among the EOM’s recommendations were that: “The responsibility of verifying the eligibility and suitability of applicants” be assigned to “a single body, institutionally separate from the three branches of State, and composed of figures of recognized competence, impartiality and prestige.” “Some type of public financing mechanism” be introduced “that allows applicants to truly make themselves known to the citizenry.” “A working group between the INE and the involved branches of the federal government” be convened “in order to analyze the impact of the budget reduction, and ensure adequate resources for future electoral processes.” “Civic education and dissemination strategies” be strengthened in order to “better explain voting methods, taking into account the age, cultural and educational diversity of the population.” “Necessary legal reforms” be introduced to Congress “to avoid the concurrence of presidential, legislative, gubernatorial and local elections with judicial ones.” **‘An extremely complex and polarizing electoral process’** In the “final considerations” section of its report, the EOM said that “an extremely complex and polarizing electoral process” had taken place in Mexico. “The analysis of this first experience shows that there are multiple opportunities for improvement. The Mission urges electoral authorities and political bodies to consider the recommendations made to strengthen all stages of the process, correct current deficiencies, and ensure the sustainability of the adopted solutions,” it said. The EOM also said that Mexican citizens and institutions “will have to evaluate whether the current model of selecting judicial authorities through popular vote, which is unprecedented worldwide, contributes to strengthening the fundamental principles of the administration of justice; or if, on the contrary, it ends up weakening the transparency, impartiality, effectiveness, and independence of the Judiciary.” “The lessons learned in this process highlight the importance that any reform to the model for selecting judges be done gradually, based on a truly pluralistic debate and, above all, on a comprehensive, technical, and professional diagnosis of the problems sought to be resolved and the most effective mechanisms to do so,” it said. “That being said, the Mission does not recommend that this model of selecting judges be replicated for other countries in the region,” the EOM said. **The Mexican government responds** President Sheinbaum, who argues that judicial elections are necessary to rid Mexico’s judiciary of corruption,declared on Saturdaythat “it’s not within the functions” of the Washington D.C.-based Organization of American States to “give recommendations on how a country should choose its judiciary.” She acknowledged on Monday that improvements to the judicial election process can be made. “I believe the INE has to do a review, and all of us have to as well, about what we learnt from this election and how to perfect the voting process,” Sheinbaum said. The Ministry of Foreign Affairs (SRE) said in astatementon Saturday that through Mexico’s “permanent mission” to the OAS, it “expressed, through a diplomatic note addressed to the secretary general of the organization, its firm rejection of some recommendations contained in the preliminary report of the observers dispatched for the judicial election on June 1.” The SRE said that it argued in the diplomatic note that the EOM “exceeded its mandate” and carried out “actions contrary to the principles ofthe [OAS] charter,” in particular the article that says that “every State has the right to choose, without external interference, its political, economic, and social system and to organize itself in the way best suited to it.” “An Electoral Observation Mission doesn’t have the authority to try to impose its own criteria on the way in which countries, in use of their sovereignty, should put together their judiciary,” the ministry said. Mexico News Daily **Guatemala files formal protest after Chiapas police incite gun battle across border** **Nearly 1,000 neighbors unite to save a 115-year-old tree in Mexico City** **In 3 days, authorities confiscate 44 tonnes of drugs in operations across Mexico** **VIDEO OF THE WEEK** Mexico's English-language newspaper About Us ADVERTISE WITH MND SUBMISSIONS COMMUNITY GUIDELINES Subscription FAQ's Jobs Contact Privacy Policy Mexico News Daily- Property of Tavana LLC"}