{"id": 1713, "name": "Escape all these Things", "domain": "escapeallthesethings.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://escapeallthesethings.com/why-jesus-cant-come-back-in-2024-but-a-proclamation-was-just-spoken-from-the-lord/#comment-110516", "title": "Why Jesus Cant Come Back In 2024 But A Proclamation Was Just Spoken From The Lord", "content": "Order Book About Us FAQ 2024 Holy Days Donate Supporter Studies Glossary KTF Book Forum Login Home/ Discernment/ Why Jesus Can’t Come Back in 2024—But a proclamation was just spoken from The Lord **Why Jesus Can’t Come Back in 2024—But a proclamation was just spoken from The Lord** Can Jesus come back this year or are certain events missing before any end-time prophecies can occur including the rapture? Learn the comforting answer of Scripture from someone who has correctly helped others know whatnotto expect now over 16 years straight! Also,three questions to tell if you are saved according to Jesus. Plus, Katrina adds a message of the proclamation just spoken from The Lord. **The Same Wisdom Prevails!** Every year since 2007, Tim McHyde has started out a new year with a website post about why Christ cannot come in the next year. Having been with him throughout those years, I have seen many emails and predictions sent to Tim, especially at the beginning of the Gregorian calendar, namely January 1st of each year. He spent many hours each day responding to a great number of those emails. I am sure many of you miss that amount of interaction with our deceased beloved Brother who is now with The Lord. He loved the interaction with you as it helped him think even deeper on the subjects of prophecy. It has been two years now since The Father took Tim into His loving hands. And even now, after two years, I find myself trying to continue where he left off in giving encouragement and direction as God gives me strength. This second year without Tim has been intense, to say the least, but God is with each of us to move forward and to run the race with endurance. Upon prayerfully considering what the first blog of the new Gregorian year should be, I realized that what Tim wrote already and updated every year is so solid that it should be shared still, again and again, each year moving forward. This newsletter gives a clear template of Tim's teachings and findings that actually are applicable each year, at least for now. I agree with Tim that we still have just a little while left. And I definitely agree that we must focus on personal preparation of our hearts to be ready for Our Lord's coming because just knowing Bible Prophecy in more detail will not save you. Notice that The Scribes and Pharisees, during Christ's physical life, were blinded because they thought knowing The Scriptures in the most perfect detail they could AND feeling they were superior to others for their knowledge and their practices of perfection would save them and make God happy. They missed the coming of their Messiah, and the world's Messiah, because of their improper focus on what God really wants. Thankfully, Tim pointed people in his yearly article to the things each of us need to focus on in doing and thinking every day of our lives to be prepared for our Messiah's second coming. I will add small comments throughout Tim's article below within parentheses and in italic so you know what is Tim's writing and what I add. I hope on some level the reposting of his article will give you some comfort as it is a strong piece of Tim that is still with us. **First, An Important Note From Katrina About This Year:** There was a proclamation spoken out from The Lord's voice toward the Earth somewhere in the last few weeks. Many on the Earth heard it and you will hear it repeated this next year in various places because of this. But everyone's spirit, including yours, heard the proclamation even if you are not conscious of it. The good news is that the message has the potential to help you hear more consciously for those who think they don't hear in The Spirit. The Lord has called each of us to hear directly from Him through The Holy Spirit that was sent when our Messiah ascended to heaven (John 14:16). All humans were created with the ability to hear spiritually. It's just that many have not even known they can or others have believed that it is only for the few to hear The Lord's voice. But as our Messiah said, \"My sheep hear my voice, and I know them, and they follow me. (John 10:27-28)\" He would not have said this if you were not born with the ability to hear spiritually. So everyone can hear spiritually, and now with this proclamation, it will be even easier to practice hearing directly for yourself what The Spirit says to you personally. Some things get in the way of your hearing but you can fix that. One way to help fix it is by adjusting poor priorities which I just wrote abouthere. That link is to a website that I created to help you strengthen your relationship with God and do what He says, namely loving Him with all your heart and then having the strength to love your neighbor as yourself. THIS PROCESS IS BIBLE PROPHECY! You must prepare yourself and clean your garments and thatwebsitehelps you in the process- Revelation 22:14 14Blessed are those who wash their robes,[c]so that they may have the right to the tree of life and that they may enter the city by the gates.15Outside are the dogs and sorcerers and the sexually immoral and murderers and idolaters, and everyone who loves and practices falsehood. For all those afraid of missing when end-time events are really happening and what to personally do to take care of yourselves or others, you must understand that YOU need to work on hearing directly from The Lord, not just from some leader like the Elijah to come. What you must do personally will be very different from anyone else because you have different circumstances that you live with from anyone else. Do not count on another person to hear for you. God wants to have a DIRECT relationship with you and talk directly to you! Actually, He talks to you most of the time. You just now have to learn how to listen which I already gave you tools to start learning to do. Although Jesus is definitely not coming this year based on the 7-year cycles to watch for, it does not mean we have time to dilly-dally. We must continue to work respectfully and grow spiritually toward knowing God, not just knowing Bible Prophecy- Matthew 24: 45“Who then is the faithful and wise servant, whom his master has set over his household, to give them their food at the proper time?46Blessed is that servant whom his master will find so doing when he comes.47Truly, I say to you, he will set him over all his possessions.48But if that wicked servant says to himself, ‘My master is delayed,’49and begins to beat his fellow servants and eats and drinks with drunkards,50the master of that servant will come on a day when he does not expect him and at an hour he does not know51and will cut him in pieces and put him with the hypocrites. In that place there will be weeping and gnashing of teeth. You are probably on the edge of your seats at this moment to know what the proclamation by The Lord was. This proclamation will speak differently to each person. God will bring to mind specific things for you to consider. Take it to your prayer closet. Let ideas pop up into your head of what it could mean for you. Scriptures will start to come to mind, or you will feel led to do some searching in The Bible to understand the meaning of this proclamation for you. Here is the proclamation- \"Awake all those who slumber\". Your head is probably saying, 'Is that it? That's all there is?' And my answer is- yep. That's it, my loved fellow brothers and sisters. But man does The Lord mean business with this proclamation! In a more general sense, it means to not be distracted from keeping The Lord and His ways as your first priority every day anymore. Do not forget that it's all about loving God with all your heart, might and soul, and loving your neighbor as yourself. You must do this to really have true love for The Lord- 1 John 4: 7Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God.8Anyone who does not love does not know God, because God is love.9In this the love of God was made manifest among us, that God sent his only Son into the world, so that we might live through him.10In this is love, not that we have loved God but that he loved us and sent his Son to be the propitiation for our sins.11Beloved, if God so loved us, we also ought to love one another.12No one has ever seen God; if we love one another, God abides in us and his love is perfected in us. Since learning in 2001 that Yeshua must return in a Sabbath year, I've had to rule out three Sabbath year cycle windows for the final 7 years (2003-2009, 2010-2016, 2017-2023). With the next window (2024-2030) less than 7 years away, I'm ready to share why I believe, based on the real end time sign of Mt 24:14, that this can be the one. If it is, the \"birth pains\" (WW3 + Wormwood, Lk 21:10-11) would hit near its middle in 2026 with Yeshua returning in 2030.Find out what's changed to convince me about 2026 and what you can do about it... Again, these Bible verses ARE BIBLE PROPHECY because those who do not obey these things will be rejected when they stand before their Maker! And standing before your Maker is a future event to fulfill prophecy- unless you are dead right now. I am being a bit silly here, but I think you get what I am trying to say to you: You could die right now. You have no idea how many breaths you have left from The Lord. Please, my brothers and sisters, I implore you to not get sloppy with those breaths you have left. Also, the book that Tim and I were to write together to help people get prepared is done! Tim just did not get to it in time. Most people have blocks to a direct relationship with God because they have hidden anger toward God. This book knocks right at the core of this issue and helps to break free from this sick bondage so that you can better prepare yourself for end-time events or for meeting your Maker. Here is the title: Healing from Being Mad At God- The Wild Ride Back Into Love. You can get afree ebook copy hereORorder a softcover copy here. Remember the only things you can take to the next life are faith, hope, and love. And the greatest of these three is love. These three things take TIME to build. Everything else passes away according to Paul- 1 Corinthians 13: 13So now faith, hope, and love abide, these three; but the greatest of these is love. And remember it is impossible to please The Lord without faith- Hebrews 11: 6And without faith it is impossible to please him, for whoever would draw near to God must believe that he exists and that he rewards those who seek him. May you grow and prosper in The Lord this year Now to Tim's wise article: **\"What's Prophesied For 2021?\"(This applies for 2024 also)** It happens early every January: a spike in visitors to my website. At the prospect of a new year, \"many go to and fro\" (i.e., searching \"to increase knowledge\") on the Internet (Dan 12:4) looking for predictions. With all the prophecies in the Bible, Christians wonder if some of them are about to be fulfilled. The perennial favorites among them are theSecond Coming of Christand theRapture. A large percentage of Christians continue to think every year that \"this could be the year that Christ returns...\" or \"...that the Rapture happens.\" That's not just my opinion as someone who has run a prophecy website since 1999. AnIpsos pollasking how likely certain events were to happen in the coming year confirmed this. According to the poll, here's what percentage of different subgroups of Christians thought it was at least\"somewhat likely that Jesus Christ would return to earth in the next year.\" 46%of white evangelical Christians 34%of Protestants 17%of Catholics 10%of the non-religious (Note:The phrase \"return to earth\" used by the pollsters is an unfortunately vague term. It best fits the Second Coming, yet to those surveyed it could have been understood as the Rapture. Nevertheless, as the article will show, it does not matter which one is referred to.) (Katrina's note- Since this poll's finding in 2006, nothing has changed much in the beliefs of American Christians. Another poll from 2023 confirms that 40% of Americans - this is more than 100 million people- believe we are living in what Bible prophecy calls the \"last days\" of history.) **Why the Poll Results Blindsided Me** When I heard the results of that poll back in December 2006, I was surprised. I had not been expecting so many Christians to think it wasstillpossible for Jesus to come in the next twelve months. Here are two reasons why it blindsided me back then fourteen years ago: Even before 2006, there have been many years of failed expectations for Christ's coming (\"Y2K\"/2000 being the biggest one up till then). Pretty much every year since Christ left, people have been hoping or predicting he would return with no show. Why would anyone expect it imminently anymore after so many failed hopes? Back in 2006, I assumed that more Christians were aware of some basics of prophecy as I had known since my teens. For example, Paul wrote that Jesus cannot return to gather us to him until the \"man of sin\" (Antichrist) takes over \"first\" (2Th 2:2-4). Certainly, I thought, most Christians know that this \"Great Tribulation\" of the Antichrist they heard of must arrive before the Second Coming? Not so... In other words, I was a bit naive =).The poll helped to fix that by learning how blessed I was to be exposed to the history of rapture predictions and key NT verses about Christ's return. I had been in a bubble, in a way, as a person who has studied prophecy and helped those also interested in the topic away from the greater Christian audience who mostly never receive any teaching on prophecy. In fact, I would say most Christians have never evenreadRevelation because it frightens them. Finally, while I hear about every popular prophecy prediction each year from readers who ask my opinion on them, most Christians hear nothing of them except when theygo up on billboards across America as Harold Camping did in 2011. **My Response to the Poll?** After better understanding this Christian blind spot on end-time prophecy, I wrote an article to help. It was the first version of this article called \"Why Jesus Can't Come Back in2007.\" The title was designed to get people to stop and pay attention. In it,I explained why it was impossible for Jesus to come back in 2007based on what Bible prophecyliterallysays. I covered the many missing prophetic events that have to come before not just the Second Coming, but also the Rapture (see below for the list). Most readers thanked me for shedding needed light on this confusing subject, but some were miffed. For example: \"Aren't you claiming to know the day or hour that Jesus said we can't?\" \"How dare you claim to know such a thing, as if you're God?\" \"You're a terrible person for saying this and dashing people's hopes.\" (People hate buzzkills!) I learned from allthat, too, something that I notice most of my readers have not picked up on about their church peers yet:not everyonedelightsin the truth. Paul explained this in his warning about why people get deceived by the Antichrist in the end time: 2 Thessalonians 2:9-11 — 9 The coming of the lawless one [Antichrist] will be accompanied by the working of Satan, with every kind of power, sign, and false wonder, 10 and with every wicked deception directed against those who areperishing,because they refused the love of the truth that would have saved them. 11 For this reason, God will send them a powerful delusion so that they will believe the lie [that theAntichrist is God- 2Th 2:4]. In the past few years, I've become convinced that \"those who are perishing\" refers to not just non-Christians but alsoChristians, \"few\" of whom are saved according to Jesus' warningThis happens because Satan deceives the whole world (Rev 12:9) including Christians (Mt 24:4-5), most of whom want to be left in their comforting reassurance of salvation rather than investigate Revelation's warning about deception (had they read it). If you burst someone's bubble, they may become very \"unchristian-like\" on you, just as Jesus warned about truth-telling (Mt 7:6). If you have \"received a love for the truth\" that is above your desire for reassurance and acceptance (which truth-loving and -seeking will cost you), then read on to learn what most Christians are misunderstanding about end-time prophecy... **My Track Record of Proclaiming \"The end is not yet\" (Lk 21:9) and the Legal Requirements Behind That** Nothing prophetic happened in 2007 just as my article argued from Scripture. It was not much of a gamble to publish that claim. The numerous prerequisite events (listed below) could not have possibly been completed in such a short time. It was as safe as stating that the moon will not descend to earth. Just as it would take some major new force or event for the moon to descend, likewise Jesus is not descending here until certain unprecedented events happen. The requirements for both events were and are simply still not present. Ashistory consistently shows, the real gamble is stating when Jesus will come back or the year of the fulfillment ofanyother Biblical prophecy, for that matter—unless you have a prophetic revelation from God on that, like the Biblical prophets were known to receive. (When it's not speculation or Bible interpretation but the Word of God then it's not a gamble.) After that year passed, I updated this article and went on record again for the next year, 2008. I knew that Christians would again expect or predict the Second Coming for that year. I also knew that just as with 2007, the requirements were not present and it would not and did not happen. Every year since then I have updated this article to let people know that the requirements for Jesus to come back that year are simply not present: 2007... 2008... 2009... 2010... 2011... 2012... 2013... 2014... 2015... 20 16... 2017... 2018... 2019... 2020... (2021...) (2022...) (2023...) That'sfourteen (17)years so far of going out on record that Jesus will not come back in the next year. Why point this out? Am I just \"tooting my own horn?\" Wasn't I just lucky? No. Really I point to my track record to help people who are looking for a different approach and answer in this area than is typical of prophecy researchers out there. The vast majority of prophecy experts either: Make \"invented prophecy\" predictions that always fail (because they are invented, or read into one or more verses) whether they are specific or vague (\"something big will happen\")... ...or claim we don't have enough information to know if Jesus is coming in the next year or not. These views keep the church in alternatively fear and anxiety or confusion and ignorance. In contrast, I have consistently gone on record that popular predictionswon't happenand I have shown how we can at least rule out Jesus' coming in certain years, especially in the short term. For people trying to find someone worth listening to on prophecy, a distinction like this is very helpful to note. **The Secret to My Good Track Record Helps You, Too** What's my secret? And how can knowing it helpyouavoid being confused or troubled by the invented prophecy predictions made every year about the Second Coming and other prophecies? My secret is recognizing the many major events listed in prophecy thatmustcome before Jesus \"returns to earth.\" If you recognize these prerequisite events in your own Bible, too, you will be far ahead of most prophecy researchers in terms of discernment. More importantly, you won't fall for their predictions anymore. Why are these prerequisite events not common knowledge? Because most Christians are taught to believe in the\"pretrib rapture\" doctrineand therelated doctrine of\"imminency.\"This imminency doctrine states that the\"pretrib rapture can come at any moment without any prerequisite event.\"Just as the pretrib rapture is false and unscriptural, so is the imminency teaching used to justify it. It's false because there is no plain verse saying that \"Jesus can come back at any moment\" or \"without any prerequisite.\" Instead, this theory relies on verses saying other things that perhapscould be\"because the Second Coming is imminent.\" For example, Jesus said\"always be ready\"(Lk 12:40). Did he say that because he can come any second (again, not stated elsewhere in the Bible)...or because when you backslide you can become deceived with the \"strong delusion\" (2Th 2:11) and miss or misunderstand the signs of Jesus' coming (1Th 5:4-5) as the religious Jews did before (clearly taught throughout Jesus' parables)? If \"imminency\" is not biblical, then how can it be so popular?Two reasons: Few Christians are Bible experts able to discern whether a doctrine they hear from other Christians is really taught by the Bible or not. Further, this doctrine is telling them exactly what they want to hear, so they are not looking to disprove it. As alluded to earlier, Christians naturallyhopethat Jesus will come back soon for many reasons. At the very least they are fed up with this evil world and look forward to him cleaning it up. The idea that \"Jesus can come at any moment\" or any year sounds wonderful and comforting. Remember, most Christians prefer comfort to inconvenient truth when push comes to shove. Despite supposed imminency, here we are nearly 2000 years after Jesus left without his return. Isn't it time to move on from the dubious doctrine of imminency (along with the pretrib rapture)? If Jesus' coming was really \"imminent\" for every single one of over 1,990 years since he left in 30 AD, why has he not shown up? **The Bible Reveals a Full Roadmap of Future Events** Why Jesus has not come back yet is not commonly understood. In simple terms, contrary to what most Christians believe and are taught,Jesus said that there are indeedprerequisitesto his returnand the start of his reign in the Millennium. Until these preliminary events happen, he said that the \"end is not yet/by and by\" (Mt 24:6; Lk 21:9) and hewill notbe appearing. He cannot come until the end does and the end is not here yet. Where do I get all this? Straight from the Bible as read plainly at face value (John 10:35). It is hard to read it that way until you put any preconceptions (and emotionally-charged hopes) aside. Once you do, this literal approach unlocks a sequence of future events described in the key prophecies of Revelation, Daniel, and Jesus (in Mt 24). Put together properly, these prophecies draw a roadmap revealing what we are to expect to happen as God's servants (Rev 1:1). Unfortunately, it is not easy to do this. Many Bible prophecies are labeled difficult \"mysteries\" (Rev 10:7; 17:5, 7) or call for \"understanding\" and \"wisdom\" (Dan 12:10; Mt 24:15; Rev 13:18). As such, it is like putting together a large jigsaw puzzle—a puzzlewhere you have to scavenge for and identify the pieces firstif you will. The pieces to this puzzle are not all conveniently in one place and in order but are scattered throughout several books of both the Old and New Testament. Similar to working with a real jigsaw puzzle, if you have one piece out of place, it can stop you from completing the puzzle to see the picture that it was intended to reveal. The surer you are about that out-of-place piece being right, the more blocked you will be. For example, havingthe Rapture in the wrong place (before the Great Tribulation)in the sequence of events effectively blocks understanding of end-time prophecy. If you get past those obstacles to assembling the end-time prophecy puzzle pieces, the picture emerges that there is much more than just the Great Tribulation, Rapture, and Second Coming ahead (which is what sums up the eschatology of most Christians). There are more events ahead than Christians have imagined. Importantly,most of these unknown prophetic events precede the Second Coming. That means the Second Coming or the Rapture are not \"next\" or \"imminent.\" In other words, if Jesus' return to earth is \"Event C,\" then it cannot come until \"Event B\" has already happened. Likewise, \"Event B\" will not be seen unless \"Event A\" has already been fulfilled. It's really that simple: Event A → Event B → Event C / Jesus Prerequisite Prophecy Event 1 → PPE 2 → ... → Second Coming **Potential vs. Impossible Years of Jesus' Return** Now, if hypothetical Event A has not happened, this means that theend has not even begun. But does that mean we cannot have any clue at all as to when the end is or when the end is not? Thankfully, no. Although the exact timing of Jesus' Second Coming has been unknown to the general public just as Jesus said in Matthew 24:36\"no man knows the day or hour\" (read: exact time),that does not mean that the general public willneverknow the exact time even after nearly two millennia have passed. Nor does it preclude a few with the wisdom of God from knowing the timing before the general public does!Jesus never said, \"no man WILL EVER know.\" Even before then, you can be sure that the end is \"not yet\" (Mt 24:6; Mk 13:7) without knowingabsolutelywhen it will be yet. We can do this by working from the relatively fewpotentialyears of his return to rule out the many years when hecannotcome. The potential years come from the many timing clues given in the end-time prophecies. **Leap Years Analogy** This is similar to how we can know what years are not leap years and which are. A leap year is almost always every fourth year, in the years divisible by four—but not divisible by 100 unless also divisible by 400. This means, for example, that 2096 and 2104 will be leap years but not 2100. With similar use of rules-based logic, we can know what years Jesus cannot return ahead of time. As long as the end times and Revelation roadmap have not begun, this fact itself continually rules out the next several years from Jesus' appearing. This is because the missing prerequisite events on the roadmap take substantial time to play out, several years, in fact. This describes exactly the situation we have been in ever since the New Testament was written, in a holding pattern waiting for the first end-time event. Unmistakably, therefore \"the end isnot yet.\" (Note that other prophecies not related to the final seven years have been fulfilled, such as the resurgence of Israel in 1948 per Isaiah 11:10-12 and also the fulfillment ofPaul's \"last days people\" prophecyhere in the last decade) If the Body of Christ had understood Jesus' words on the preconditions of his coming, they would not bepronouncing or expecting the Rapture or imminent return of Jesus every year, just the same as we would not pronounce a new US president every single year. Because few believers have understood these overlooked prerequisites, each generation has naturally maintained hope that perhaps they were already in the end times and that Jesus could come back at any moment. Yet this has been proven to be false hope. Then what typically happens is that we justify this belief through other misread prophecies. For example, some might see a world figure who seems to fit the Antichrist (like Emperor Nero) or a technological development that seems to fulfill themark of the beast(like bar codes or bio-chips) and conclude that it is a sign that the time must be near or in their lifetime. That kind of reasoning has been used innumerable times and always resulted in disappointment. It is important to put aside these pseudo-signs and look only to the real milestones listed in the Bible if you want to correctly know when there really is something prophetic coming to worry about. Given the fact thatnoneof the prerequisite end-time events have transpired, it is safe to say that it is impossible for Jesus to come in 2021—or any year this decade of the 2020s! **List of Prerequisites to Jesus' Return** So, what are these prerequisite events? Here are several examplesfrom my bookstarting with the first event to come: Psalm 83/Isaiah 17 War - Damascus Destroyed/Second Holocaust— Rather than the Rapture, thenext event in prophecyis a swiftnuclear war in the Middle East between Israel and many of her Arab/Islamic neighbors. You do not need a Bible to tell you this, as many secular sources fear one due to the tensions between Israel and the Arabs and Iran (not Arab, but Persian). The concern over Iran's uranium enrichment program has only added to this. The outcome of this war will be the destruction of Damascus (Isa 17:1) and several other major Arab cities and regions, along withenough devastation in Israel to classify it a second holocaust!Obviously, this event has still not happened because Damascus remains a city to this day (whether you consider it \"in ruins\" by your First World nation standards or not :-).If you are wondering when this will happen,God gave me dreams that lead me to conclude the year 2022. The Sixth Seal/Wormwood— If you read Revelation 6:12-17 carefully you will see that it depicts the entire world panicking and running for cover in response to signs in the heavens and atremendous global earthquakeon earth that shakes every mountain and island out of place.It is obvious that a global cataclysm like this has not happened since the first century when this prophecy was written.This event is a\"sign of the end\"that Jesus told his followers to expect when they asked about his return (Mt 24:7-8=Lk 21:10-11=Joel 2:30-32=Rev 6:12-17). God'send-time escape instructionsshared by Jesus, Joel, and Revelation would thenbecome relevant for the faithful. (By the way, ignore anyone saying they have pictures ofWormwood since it is not here yet.) Third Temple—Several passages describe a Third Temple on the Temple Mountwith sacrifices going during the Great Tribulation (Rev 11:1-2; Mt 24:15; 2Th 2:3-4). The Antichrist is even going to sit in this end-time temple as part of his declaration of himself as God (2Th 2:4).Obviously, there is as yet still no temple or even a construction project underway for one, nor sacrifices yet.Speaking of the construction, some say that everything is already being prepared for this temple and it can go up fast, in less than a year. Even if that's true, under the current political situation they still could not break ground on the Temple Mount without the Arab's approval given their historic belligerence against any Jewish worship on the Temple Mount. The Arab control and power need to be broken first, and that is not going to happen without a war, probably the futurePsalm 83 war as above. The Abomination of Desolation— The Great Tribulation starts 30 days (as in the1290 - 1260 days)after the Abomination of Desolation is \"stood\" up at the Temple Mount(Mk 13:14). The abomination refers to theImage of the Beast statuebeing erected for worship (Rev 13:14). At the same time, the Third Temple sacrifices are halted by the Antichrist.This is another unfulfilled prophecy as only the Antichrist can accomplish this and he is not here yet. Great Tribulation— This is the most obvious and well-known end-time event. According to Daniel 9:27 = Matthew 24:21, Jesus must return after a period of \"Great Tribulation.\" During this Great Tribulation, the Antichrist willrule over the world for 42 months(Rev 13). He will force all the unsaved (Rev 13:8) to take a mark in their right hand or forehead during that time.Plainly, we are not in the Great Tribulation and nomark of the beasthas been issued yet. The Rapture—The Rapture comes after the Great Tribulation or post-trib,yet not to save anyone from any threat on earth as Christians suppose. The Rapture arrives right on time for the faithful to be \"rewarded\" (Rev 11:18) with glorified eternal bodies (1Co 15:52) so they can thenrule for the entire 1000 year Millenniumalong with those in thefirst resurrection(Rev 20:4-5). (But you have to qualify for the Rapture by listening to what Jesus said to do.) The Wrath of God/7 Bowls—The seven bowls of God's wrathimmediately fall when the faithful leave temporarily to heaven (Rev 15:5-8) apparently for the marriage supper of the lamb (Rev 19:9), just as Jesus described in saying it would be just like as in thedays of Noah and Lot when one is taken (the righteous) and one is left (the wicked). The Second Coming— Finally, Jesus \"returns to earth\" onYom Kippur/The Day of the LORDto fight the Battle of Armageddon (Rev 19:11-21). He brings back with him the raptured and resurrected saints from the marriage supper of the lamb (Rev 19:9) in Heaven (Rev 15:5-8). Then they/wereign for the Millennium on earth—not in heaven. These are only some of the events from the full end-timeroadmap as covered in my comprehensive book: Nevertheless, the above list does include the \"Event A\" from my earlier explanation: thePsalm 83 War. Until we see that event,the end time roadmap/final seven years has not begun. This has meant in the past that we could still have years or even a decade (or two?) before the end times events start and finish with Jesus' return. Since the events of 2020, I feel we are definitely under a decade now until Jesus' return(Katrina's note- Unlike Tim, I think we have this decade safe and next decade looks very suspicious as a possible decade for Jesus' return based on what I see happening in the world at the moment. BUT let's not get lazy- our life can end at any moment and then our time is up already. Plus, if we don't take our time seriously in becoming more Christ-like now every day, we won't be ready for end-time events when they do come. Tim intended to write a book with me on HOW to become more Christ-like, thus becoming prepared for the end-times, but did not find the way to write it before he passed. I have been diligently working on materials for this purpose and have it on a separate site because it is information that is truly essential for those who study Bible Prophecy AND those who choose to look away from prophecy-every Believer. If you want that websitepress on this highlighted text.Now back to Tim...)For sure, as long as the Damascus war and destruction are unfulfilled, we have a good minimum of seven years before Jesus can come back, which is the length of the 70th Week of Daniel time frame in which all but one of the events above must take place.(Katrina's note- Right now we see many things starting to heat up in the Middle East, but things are ramping up slowly compared to where it needs to become to be certain we are approaching the last 7 year cycle. Even though things look very difficult in the Middle East, we are looking for Damascus not to just be attacked but that it becomes a ruinous heap.) **The Prophetic \"Sabbath Years\" Narrow It Down Even Further** Usually, you can rule out Jesus' coming even more than seven years in advance. How? Through the special insight that Jesus can only return in one out of every seven years: aSabbath year. The Sabbath year commanded to ancient Israel not only gave them a blessing of a year of rest from planting their fields with the associated promise of bounty in the sixth year before that. It also was prophetic like all the Torah (Mt 5:17-18). That means it had an end-time meaning and fulfillment. The fulfillment of the Sabbath year is that it picturesthe Millennium peace and rest, the 1000-year period that begins with Jesus' return. Just as the ancient Israelites rested their fields and experienced God's blessing, provision, and peace in that year, so will the entire earth during the Millennium (and after). Putting this together, it means that the final seven years or 70th week of Daniel (Dan 9:27) are aligned on a Sabbath year cycle or a \"week of years\" (Dan 9:26). This cycle consists of six regular years followed by a special Sabbath year. Jesus returns in that final Sabbath year of the 70th Week, whenever that is. It's impossible for him to return during one of the six non-Sabbath years.This rules out six out of seven years on the calendar, right off the bat! For example, here in 2021, we are in the Sabbath year cycle of 2017-2024. Because of the missing events listed above, it's impossible for this cycle to be the one Jesus returns in. That rules out the entire period from 2017-2024 and makes the next period the first possible after that (2024-2030). This means Jesus cannot return from 2021-2029. 2030 is the next possible Sabbath year for Jesus' return. For more on why the 70 Weeks are aligned on Sabbath year cycles, see my free study on that. **2026 - Why I'm Convinced It's the Year the End Starts** If 2030 is the year Jesus returns, then the 70th week spans 2024-2030, ending in the fall 6 months before the Sabbath year completes in spring, 2031 because \"he cuts short the time\" (Mt 24:22). But that does not mean the bad stuff or \"beginning of sorrows\" starts in 2024. It actually would begin in2026. 2026 is not too far off which is why I'm sad to report that the closer we get to it, the more confirmation keeps falling into my lap about it, despite my not wanting it to be true. For example, I already have hadseveral dreams and developments in my own life that led me to share publicly why I am convinced the end begins in 2026. Then in 2017, when Trump announced the decision to recognize Jerusalem as Israel's capital and move the US Embassy to Jerusalem,God gave me a dream. I never asked for confirmation about 2026 for obvious reasons, but it came anyway in a remarkable fashion: a dream in three separate interrupted sleep segments. That morning I released my article on how God had confirmed through the dream that Trump's provocative announcement was prophetic and leading tothe nuclear Middle East war. It was very angering to the Muslims with immediate demonstrations and followed by calls to make a bigger Arab alliance against Israel. Many others have written me since then to say they also heard from God that Trump's announcement was a move towards end-time prophecy. But time will tell on that and whether I understood my dream properly (1Co 14:26, 29). Further confirmation camein early 2019. If asked I would have told you that no end-time prophecy had been fulfilled so far until Damascus is gone. But I would have been wrong. I was overlooking Paul's \"last days people\" prophecy (2Ti 3:1-3) which I could never understand and ignored for 20 years. An inspiration struck me that finally demystified it and I wrote amajor article explaining how a seductive recent technology has brought out the worst in people in all 19 ways Paul predicted! **New:How COVID-19 Confirms No More Delay** 2020's events are the greatest confirmation so far that the end is now due this decade. This is ironic because, as I've shared previously, I did not see this early downturn of civilization coming. There is no pandemic in Bible prophecy before the pestilence Jesus spoke of that is associated with Wormwood's global devastation (the earthquakes, famine, pestilence of Lk 21:11). Did it just happen naturally and by chance, now, as scientists conclude? Or was COVID-19 part of God's plan for humanity, just as Wormwood is? I see a pattern in this event that makes me conclude the latter. In hindsight, something akin to2020'slockdowns, restrictions, economic devastation, and isolation had to happen. The pandemic has provided what Jesus told this generation to pray for: \"gold refined in the fire\" of trials bad enough to bring us to the breaking point (Rev 3:18). This is Jesus' prescription for the illness of spiritual poverty, nakedness, and blindness that characterize \"Laodiceans\" like us who have lived rich, sensual, comfortable lives in the modern world. When Jesus said that it was hard for a rich man to enter the kingdom, this is why (Mt 19:23). We do not need God nor do we get sufficiently humbled and aligned with love when life is working for us pretty well as is. **Jesus 3 Tests of Whether You Are Saved** I hate to break it to you, but if you live in the developed world, you qualify as rich by the standard of Jesus' day. What he said about the rich not entering the kingdom applies toyou.Odds are that you are not yet saved or headed to the kingdom. You may believe in God andwantto serve him but belief and intention are not enough according to Jesus' own words demanding we bear fruit of a radically changed life. Here are three requirements found in Jesus' words to determine whether you are saved: Are you \"as humble as a child\" (Mt 18:3-4)? Does your \"righteousness exceed that of the Scribes and Pharisees\" who were zealous for God, too (Mt 5:20)? Is your life philosophy to love others for God (Mt 7:12=Mt 7:21) so you bear fruit and don't hear\"depart from me I never knew you\"(Mt 7:23)? If not, don't feel ashamed to admit it. Christianity did not teach us or disciple us in these things like Jesus did with his followers. God is really the only teacher for making us ready for the kingdom. You need that gold refined in the fire to become the bride of Christ who God protects in the end. That is why COVID-19 happened now and why I'm so convinced it is confirmation that the end is about to begin. The bride is getting the \"makeover\" that she needs through this disruption to life as we are used to it. Since the beginning of the pandemic, I have witnessed this refining process in my life, my household, and the saints I fellowship with. I haveheard testimonies from several readers about God also leading their lives into hard times that brought them closer to him than ever. Without COVID-19 or something like it, we would mostly be stuck poor, naked, and blind spiritually, lacking the faith and trust in God to be able to escape all these things. To see COVID-19 as necessary for us and part of God's loving plan for us makes acceptance of and submission to our new reality easier. The next step is to then ask God what he has for you to learn in this with the time we have left before the end begins. To summarize, while I'm happy to say that the end can't come this year or even in the next few years, sadly developments like COVID-19 have convinced me that the end is starting this decade, probably in 2026 :-(. **Common Objections To Hearing Jesus Can't Come Back** To state that Jesus is not coming this year (even without ruling out the rest of the decade, too) may sound plain wrong or at least arrogant to many. Most don't realize Jesus himself said \"the end is not yet\" and gavethe conditions for discerning that ourselves(Mt 24:6; Lk 21:9). To help you see the truth of what Jesus plainly said about not expecting his return until \"the end\" conditions arrive, here are a few of the common objections I hear with my responses: Objection #1: \"The world is falling apart too fast to last as long as you say...\" People often point to the multiplying and worsening problems in the world as proof that \"the end is nigh\"...(for sure this time!). However, if you study history,every generationhas been able to point tosomethinggetting worse as proof that they were the \"last generation\" yet here we are. Relative and subjective arguments like that don't compare to the absolute specific descriptionJesus gave of the end-time sign. Objection #2: \"Jesus comes as a thief in the night, by surprise, so you won't have any clue as to years...\" There are verses implying that Jesus will come suddenly and unexpectedly like a \"thief in the night\" (1Th 5:2; 2Pe 3:10). However, if you check out the passages in their context you will find that this thief-like surprise applies to the world and not to the \"sons of light and sons of the day\" (1Th 5:4)! God's children have \"a more sure word of prophecy\" about the circumstances of the coming of Jesus, a few of which this article has shared above. If Christians keep them in mind, they will not find that Jesus' coming surprises them like the world (1Th 5:4). Objection #3: \"You're claiming to know the day or hour!\" Some always argue that my proclamation about 2021 (2023) contradicts \"no man knows the day or the hour\" (Mt 24:36). This seems valid at first until you understand what was covered already above about Jesus' statementnot meaning we were forever prohibited from knowing. The public will know when the end is close, once it is. Also, a prohibition on knowing when somethingwillhappen does not mean you don't have enough clues to know certain times whenit cannot possibly happen. For example, say a friend tells you he will drop by on one of his days off to catch up, but he does not tell you which one. You don't know the \"day or hour\" (which means \"time\") of his coming. Yet say you know his day off from work is Saturday. Would you sit there on Sunday or Monday hoping or believing he might just come \"today?\" Or would you know he can't be coming that day for a major visit like he promised? The answer is obvious. It is the same with Jesus' Second Coming. Although theabsolute timingof his coming is not publicly known, we still can know many years when hecannotcome according to his own words. Jesus' coming has conditions and circumstances to it that mean he cannot come just any random time even if we don't know the-one-and-only-time he will come. Objection #4: \"You're effectively telling Christians to relax and not be ready for the return. (Shame on you!)\" Others complain that to say \"Jesus is not coming this year\" translates to saying people don't have to be alert, pray and stay close to God (Lk 21:36). However, knowing Jesus cannot come back soon does not change anything about needing to \"always be ready\" and not backslide into sin. Also, we all are stillmortal. We can lose our life tomorrow through \"time and chance\" that the Bible says happens to us all (Ecc 9:11-12). Because we can \"meet our maker\" at any moment, we \"always need to be ready\" as Jesus taught (Mt 24:44; Lk 12:40). Ultimately, let's not forget that Jesus himself is the origin of this message that \"the end is not yet\"; or \"the end is not by and by\" (Mk 13:7; Lk 21:9) until certain(unmistakable) global conditions appear. Jesus did not teach \"imminency\" or toexpecthis coming any and every day. Instead, He encouragedconstant prayer and vigilance to not allow yourself to backslidebecause you don't know when you will die or when he will come (Lk 12:45). So, rather than this end-time wisdom having disadvantages or a curse, there is a clear advantage to it compared to the popular \"the end is nigh\" thinking which focuses people on something that is not going to happen yet. The continual \"invented prophecy\" predictions about the end comingaround every corner every yearkeep many people in fear. That needless anxiety (Php 4:6; Mt 6:25) can lead people to live under costly short-term thinking and make very poor decisions for themselves and their families. I've seen many sad cases of this (including my own experience for a time when I still had not discovered what this article shares). It truly is better to know the truth and act off of that—prayerfully and righteously—rather than act off a misunderstanding that opens you up to constant false alarms or paranoia or influences you to make bad choices or live in dread. **Conclusion** The popular hope and expectation that Jesus is coming \"this year\" persists among Christians despite a \"no show\" every year so far. Not surprisingly, it turns out that this belief is based more on fantasy than fact. The doctrine that \"the pretrib rapture is the next event in prophecy\" is mainly to blame for this. That the Second Coming can happen imminently or without lead-up events breaks Scripture (John 10:35) and is to be rejected by Bereans who test religious doctrine against God's revelation (Acts 17:11). Scripture teaches that there are prerequisites or events that must come first. If we put aside popular Christian speculation and prophecy invention and consult the Bible's prophetic roadmap directly, we can know that Jesus certainly cannot return in2020(20212022 2023)(2024). Even more, he won't return for several years after that for sure because of Sabbath year cycles. I agree that it is disappointing to hear that Jesus is not coming in 2021 (2024) or any time soon after that. The good part of this is that by the same principle, manybad things like Wormwoodand the Great Tribulation are also certain to not come next year either! It means you can stop worrying about the end coming suddenly and unexpectedly as long as the situation of the past 2000 years of no prerequisite events continues. You can focus instead onmaking sure you are savedbygetting right with God through Biblical repentance. My best writing for preparing yourself teacheshow to not lose your faith when bad things happen (including when everyone knows God caused them!). If you are interested in learning all the things you do not have to worry about in 2021(2023)without it taking years of personal study and/or in supporting this ministry and \"help get the word out,\" check out the bookKnow the Futureoffered on this site. Orders directly support my writing of free articles.(Katrina's note- orders help me keep the website up and support me in writing more articles). If you want help on seeking the narrow path Jesus spoke about as the only one \"leading to life\" that \"few find,\" mysupporter content will help you greatly.(Katrina's note- I still add special content for only supporters to read.) If you want to understand why I finally wrote an article to answer the question that people always email me on \"When do you think the end is?\"see my in-depth study on 2026 in prophecy. If you have found a spelling error, please, notify us by selecting that text and pressingCtrl+Enter. If this article blessed you and you want to bless back, you can...(NOTE:For instant access tothe special Supporter content, please use the buttonsover hereinstead.) **Receive Tim's Prophecy Updates By Email** Join 30,000 subscribers receiving Tim's new articles and updates by email. Understanding Bible prophecy better will dispel your end time fear and bless you (Rev 1:3). I am increasingly persuaded that Matthew 23-25 primarily addresses the destruction of Jerusalem in 70 AD, marking the end of the Old Covenant era, rather than serving as a dual prophecy extending to our contemporary end-times. The text itself lacks explicit indicators of a future, global eschatological scenario. Consequently, many end-times timelines, such as Tim’s, which extrapolate contemporary events from Matthew 24, appear to be based on an interpretive framework that I now question. The failure of predicted events to materialize in 2022 and 2024 has further fueled my reconsideration. Currently, I am exploring a preterist perspective, specifically partial preterism, which posits that the majority, if not all, of the events described in Matthew 24 and Revelation have already occurred. This link,https://www.godisreal.today/return/, while not explicitly labeling itself as preterist, presents arguments that align with this viewpoint. A compelling possibility exists that the thousand-year binding of Satan, as described in Revelation, has already taken place, followed by his release approximately 200 years ago. This could explain the widespread perception among Christians that Satan’s power will increase before the end, a notion that may hinder the Church’s active engagement in transforming the world for God. While I acknowledge Tim’s sincere pursuit of truth through a literal interpretation of scripture, I now believe that Matthew 24, and potentially other relevant passages, may not directly apply to our current era. It is possible that his interpretation of personal dreams, attributed to divine origin, requires reassessment. However, I remain open to the possibility that certain biblical prophecies, such as the destruction of Damascus, might still hold future significance. Therefore, complete dismissal of end-times timelines, including Tim’s, may be premature. As we approach 2026, further observation is warranted. God bless. Save my name, email, and website in this browser for the next time I comment. Estimada Katrina, Hace muchos años en una de las publicaciones del hermano Tim encontré un link relacionados a un instituto de estudios bíblicos cuyo director fue de Oregón y ya fallecido. El tiene muchos libros publicados en esta pagina y entre ellos estaban los 101 secretos de la biblia y uno de ellos recuerdo que indicaba el tamaño de las tablas de los diez mandamientos que son equivalentes al tamaño de un teléfono celular y otro libro recuerdo el verdadero sitio de la crucifixión. Me puede ayudar con ese link se lo agradecería mucho. Saludos, Roberto FernandezLouisiana – Estados Unidos. Save my name, email, and website in this browser for the next time I comment. Estimada Katrina, Hace muchos años en una de las publicaciones del hermano Tim encontré un link relacionados a un instituto de estudios biblicos cuyo director fue de Oregon y ya fallecido. El tenine muchos libros y entre ellos estaban los 101 secretos de la biblia y uno de ellos recuertdo que indicaba el tamaño de las tablas de los diez mandaMIENTOS Que eran eq Save my name, email, and website in this browser for the next time I comment. Yep the resurrection/rapture can not happen until after these last 7 years of tribulation are finished and the “year of recompense” commences: https://sumofthyword.com/2016/10/04/the-rapture-of-the-church-is-after-the-tribulation/ Save my name, email, and website in this browser for the next time I comment. The three tests to know if you are saved. The first are you humble as a child. That’s the toughest one and it’s a personal issue. The second is a little easier. The only way for anyone’s righteousness to exceed the righteousness of a Pharisee is to put your trust in Jesus the righteous one. And third is pretty easy. The only way to love people the way God wants is to be born of the Spirit as love is one of the fruits thereof. Curious to know your thoughts. Thanks. Save my name, email, and website in this browser for the next time I comment. I forgot to ask why do you say this went out to everyone. How do you know it’s not just for you, or to certain people. Save my name, email, and website in this browser for the next time I comment. When you received the Proclamation, was in a general sense, or did you get those specific words exactly? And did other people get that exact phrase? I was curious about that. Save my name, email, and website in this browser for the next time I comment. Save my name, email, and website in this browser for the next time I comment. Δ Search Tags My Favorite Interview Part 11st Hour.mp3Part 22nd Hour.mp3Get the book from the interview hereor read all about ithere. Why is Revelation’s mysterious overlooked star“Wormwood”(Rev 6-8) the key to understanding Revelation?Answer… Recent Comments Yahshua ElohimuseonEATT Is Back Up After After Cyber Attack To Share About End Time Prophecy!I know most of you are waiting for the prophet Elijah to come and give you answers. He will come in due time, but you... Timothy BellonWhy Jesus Can’t Come Back in 2024—But a proclamation was just spoken from The LordI am increasingly persuaded that Matthew 23-25 primarily addresses the destruction of Jerusalem in 70 AD, marking the end of the Old Covenant era, rather... SteveonIdentifying the Antichrist: 8 Myths Not To Fall ForDon't know about all thats been said, but my two cents is that, true followers of Jesus will know who the antichrist is during the... JasononWhy Jesus Will Tell Christians, “Depart From Me, I Never Knew You!”Tim, For an issue as important as Salvation I personally don’t want to be the one getting a talking to from Jesus for trying to... SherryonMalachy’s Last Pope Identified – in Bible ProphecyPope Francis is currently in the hospital in ICU not expecting to survive. If he IS the last Pope, we are minutes / hours away... More Comments... Understanding Bible prophecy will bless you (Rev 1:3) and dispel your fears about the end times. Join my newsletter to start understanding prophecy literally. Categories Bible Mysteries(30) Debunking(42) Discernment(42) End Time Prophecy(60) Jesus' Difficult Words(9) Ministries(16) On the Narrow Path(1) Other musings(5) Planet X(9) Reviews(10) Support Team(28) Tim passed away in 2022(10) ©2018 CopyrightTim McHyde— All Rights Reserved Privacy Policy Contact **Spelling error report** **The following text will be sent to our editors:** **Your comment (optional):**"}