{"id": 383, "name": "Experimental Biology and Medicine", "domain": "ebm-journal.org/journals/experimental-biology-and-medicine", "bias": "pro-science", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.ebm-journal.org/journals/experimental-biology-and-medicine/for-authors/policies-and-publication-ethics", "title": "Experimental Biology And Medicine", "content": "Anatomy/Pathology Artificial Intelligence/Machine Learning Applications to Biomedical Research Biochemistry and Molecular Biology Bioimaging Biomedical Engineering Bionanoscience Cell and Developmental Biology Clinical Trials Editorials and Commentaries Endocrinology and Nutrition Environmental Health/Biomarkers/Precision Medicine Genomics, Proteomics and Bioinformatics Immunology/Microbiology/Virology Mechanisms of Aging Neuroscience Pharmacology and Toxicology Physiology and Pathophysiology Population Health Stem Cell Biology Structural Biology Synthetic Biology Systems Biology and MicroPhysiological Systems Translational Research Scope Mission & scope Editorial and Advisory Boards Journal information Journal categories Open access statement Copyright statement Editorial and quality processes Contact For authors Why publish with us? Publishing fees Article type list Category list Author guidelines Submission checklist Statistical guidelines Policies and publication ethics Propose a special issue Contact editorial office For reviewers Peer review policy Become a reviewer Anatomy/Pathology Artificial Intelligence/Machine Learning Applications to Biomedical Research Biochemistry and Molecular Biology Bioimaging Biomedical Engineering Bionanoscience Cell and Developmental Biology Clinical Trials Editorials and Commentaries Endocrinology and Nutrition Environmental Health/Biomarkers/Precision Medicine Genomics, Proteomics and Bioinformatics Immunology/Microbiology/Virology Mechanisms of Aging Neuroscience Pharmacology and Toxicology Physiology and Pathophysiology Population Health Stem Cell Biology Structural Biology Synthetic Biology Systems Biology and MicroPhysiological Systems Translational Research Scope Mission & scope Editorial and Advisory Boards Journal information Journal categories Open access statement Copyright statement Editorial and quality processes Contact For authors Why publish with us? Publishing fees Article type list Category list Author guidelines Submission checklist Statistical guidelines Policies and publication ethics Propose a special issue Contact editorial office For reviewers Peer review policy Become a reviewer Anatomy/Pathology Artificial Intelligence/Machine Learning Applications to Biomedical Research Biochemistry and Molecular Biology Bioimaging Biomedical Engineering Bionanoscience Cell and Developmental Biology Clinical Trials Editorials and Commentaries Endocrinology and Nutrition Environmental Health/Biomarkers/Precision Medicine Genomics, Proteomics and Bioinformatics Immunology/Microbiology/Virology Mechanisms of Aging Neuroscience Pharmacology and Toxicology Physiology and Pathophysiology Population Health Stem Cell Biology Structural Biology Synthetic Biology Systems Biology and MicroPhysiological Systems Translational Research Scope Mission & scope Editorial and Advisory Boards Journal information Journal categories Open access statement Copyright statement Editorial and quality processes Contact For authors Why publish with us? Publishing fees Article type list Category list Author guidelines Submission checklist Statistical guidelines Policies and publication ethics Propose a special issue Contact editorial office For reviewers Peer review policy Become a reviewer **Policies and Publication Ethics** 1.1 Review Guidelines 1.2 Open Access 1.3 Registration with the Journal 1.4 Authorship 1.5 Acknowledgements 1.6 Financial Support 1.7 Conflict of Interest 1.8 Research Ethics 1.9 Dual Submission 1.10 Preprints 1.11 Guidelines for Artificial Intelligence and Related Technologies 2.1 Plagiarism 2.2 Theses and Dissertations 2.3 Conferences, proceedings, and abstracts 2.4 Blogs 2.5 Corrections 2.6 Retractions 2.7 Image Manipulation 3.1 Availability of Materials 3.2 Availability of Data 3.3 Exceptions Related to Availability of Data 3.4 Data Citation Guidelines 3.5 Data Availability Statements 3.6 Mandatory Data and Recommended Repositories 3.7 Inclusion of RNAseq Data 3.8 Inclusion of Proteomics Data 3.9 Code 3.10 Exceptions Related to Code Availability **1. Editorial policies** Only manuscripts of sufficient quality that meet the aims and scope ofExperimental Biology and Medicinewill be processed for review. Manuscripts are assigned to Global Editors based on the country of origin. Manuscripts from countries without Global Editors are assigned to the Editor-in-Chief. Impactful manuscripts deemed by the Global Editor to fall within the interests of the Journal's readership and to be written in clear, concise and grammatical English are assigned to an Associate Editor. Manuscripts are assigned to Associate Editors based on subject category. Authors should indicate their preference of category during the submission process. However, the final decision of reviewing Associate Editor and category rests with the Editor-in-Chief. If the reviewing Associate Editor determines that the manuscript has sufficient impact and scientific rigor, and the English language is suitable for review, then he/she will assign reviewers. All articles are published with open access under the CC-BY Creative Commons attribution license (the current version is CC-BY, version 4.0). This means that the author(s) retains copyright, but the content is free to download, distribute, and adapt for commercial or non-commercial purposes, given appropriate attribution to the original article. Upon submission, the author(s) grants Frontiers a license to publish, including to display, store, copy, and reuse the content. The CC-BY Creative Commons attribution license enables anyone to use the publication freely, given appropriate attribution to the author(s) and citing the journal and Frontiers as the original publisher. The CC-BY Creative Commons attribution license does not apply to third-party materials that display a copyright notice to prohibit copying. Unless the third-party content is also subject to a CC-BY Creative Commons attribution license, or an equally permissive license, the author(s) must comply with any third-party copyright notices. Please note that the corresponding and all submitting authors MUST register with the journal before submitting an article. You must be logged in to your personal account to submit an article. For any co-author who would like their name on the article abstract page and PDF to be linked to a profile on the Loop network, please register before the final publication of the paper. Papers should only be submitted for consideration once consent is given by all contributing authors. Those submitting papers should carefully check that all those whose work contributed to the paper are acknowledged as contributing authors. The list of authors should include all those who can legitimately claim authorship. This is all those who: 1. Made a substantial contribution to the concept or design of the work; or acquisition, analysis or interpretation of data, 2. Drafted the article or revised it critically for important intellectual content, 3. Approved the version to be published, 4. Each author should have participated sufficiently in the work to take public responsibility for appropriate portions of the content. Authors should meet the conditions of all of the points above. When a large, multicentre group has conducted the work, the group should identify the individuals who accept direct responsibility for the manuscript. These individuals should fully meet the criteria for authorship. Acquisition of funding, collection of data, or general supervision of the research group alone does not constitute authorship. All contributors who do not meet the criteria for authorship should be listed in the Acknowledgments section. Please refer to the International Committee of Medical Journal Editors (ICMJE)authorship guidelinesfor more information on authorship. Any changes to authorship requests shall be handled by the Handling Editor. Name Change PolicyName and pronoun changes can occur for many reasons including, but not limited to, changes in marital status, religion, and gender identity. To request a name or pronoun change, please complete thisname change request formand email it to us atdevelopment@ebm-journal.org. All contributors who do not meet the criteria for authorship should be listed in an Acknowledgements section. Examples of those who might be acknowledged include a person who provided purely technical help, or a department chair who provided only general support. Individuals who provided writing assistance, e.g. from a specialist communications company, do not qualify as authors and should be excluded from the Acknowledgements section. Authors must disclose any writing assistance – including the individual’s name, company and level of input – and identify the entity that paid for this assistance. Language polishing and copyediting services should NOT be included in the Acknowledgements. Experimental Biology and Medicinerequires that all authors acknowledge all grant, contract and industrial support of the work in the published article and on-line submission form. All submitted articles must include a Funding section/statement in the Manuscript (seeAuthor Guidelines). All articles are published with open access under the CC-BY Creative Commons attribution license. Articles published with the journal automatically fulfill or exceed the requirements for open access mandated by many institutions and funding bodies, including the National Institutes of Health, the Medical Research Council, Research Councils UK, and the Wellcome Trust. The journal submits funding data to the Open Funder Registry, which is a funder identification service from CrossRef resulting from collaboration between scholarly publishers and funding agencies. Authors are required at the time of submission to disclose potential conflict of interests (eg., consultancies, stock ownership, equity interests, patent-licensing arrangements, lack of access to data, or lack of control of the decision to publish) in the on-line submission form. Authors will have to select that they either declare no Conflict of Interest, or that they declare a Conflict of Interest, in which case they will have to provide additional details. Such information, unless already disclosed in the submitted manuscript, will be held in confidence while the paper is under review. If the manuscript is accepted for publication, any information on the potential conflict of interest not disclosed in the submitted article, including a lack of control of the decision to publish, will be inserted during typesetting. The corresponding author is responsible for obtaining signed forms from all authors that have a potential conflict of interest. Failure to declare competing interests can result in the rejection of a manuscript. If an undisclosed competing interest comes to light after publication, the journal will take action in accordance with internal policies and Committee on Publication Ethics guidelines. For guidance on conflict of interest statements, please see theICMJE recommendations. Guidelines for formatting the Conflict of Interests section in the Manuscript can be found in the Author Guidelines. All research submitted to the journal for consideration must have been conducted in accordance with the journal guidelines on study ethics. In accordance with COPE guidelines, the journal reserves the right to reject any manuscript that editors believe does not uphold high ethical standards, even if authors have obtained ethical approval or if ethical approval is not required. Authors are encouraged to follow the ARRIVE guidelines for the design, analysis, and reporting of scientific research. Human Data Studies involving human subjects must conform to the ethical standards set by the Belmont Report: Ethical Principles and Guidelines for the Protection of Human Subjects of Research OR the World Medical Association's Declaration of Helsinki; must have been reviewed and approved by the appropriate institutional Review Board (IRB); and must be presented in such a manner as to assure preservation of the anonymity of the subjects. It must be stated in the Materials and Methods section of the article that the study had been approved by the responsible IRB and that informed consent was obtained from research subjects or it must be explained why IRB review and /or informed consent were not required. Please ensure that you have provided the full name and institution of the review committee, in addition to the approval number in the Ethical Approval section in the Manuscript (seeAuthor Guidelines). Animal Data All research involving regulated animals (i.e. all live vertebrates and higher invertebrates) must have been reviewed and approved by an ethics committee prior to commencing the study and performed in accordance with relevant institutional and national guidelines and regulations. The journal follows the International Association of Veterinary Editors guidelines for publication of studies including animal research. Clinical studies involving animals and interventions outside of routine care require ethics committee oversight as per the American Veterinary Medical Association. Authors must provide ethics approval information within the submission system, which generates an ethics statement to be included in the submission. The generated ethics statement will be included in the reviewer file, in the following format: \"The animal study was reviewed and approved by [Full name and affiliation of ethics committee]\". Should the study be exempt from ethics approval, authors need to state the reasons for exemption within the generated statement. Studies involving client-owned animals (non-commercially available animals, e.g. pets or livestock) should demonstrate the best practice veterinary care and confirm that written informed consent has been granted by the owner(s), or the legal representative of the owner(s). An example of a generated statement for a study involving client owned animals can be found below: \"The animal study was reviewed and approved by [Full name and affiliation of ethics committee]. Written informed consent was obtained from the owners for the participation of their animals in this study\". Inclusion of Identifiable Human Data The journal follows the ICMJE recommendations on the protection of research participants, which state that patients have a right to privacy that should not be violated without informed consent. We require nonessential identifiable details to be omitted from all manuscripts, and written informed consent will be required if there is any doubt that anonymity can be maintained. It is the responsibility of the researchers and authors to ensure that these principles are complied with, including the obtaining of written informed consent for publication of any potentially identifiable data or images. Written informed consent can be documented on a form provided by an institution or ethics committee, and it must clearly state how the identifiable data will be used. The journal’s publisher, Frontiers, makes available its own form, which may be used for this purpose, although not required if an alternative form of consent, meeting the ICMJE recommendations, is used. We consider it to be the author's duty to encourage participants or patients whose consent for publication is required to read and understand the ICMJE guidelines, for their information prior to completing the consent form. Participants should also be encouraged to ask any questions and to ensure they are comfortable before they sign the consent form. The completed consent forms should be stored by authors or their respective institutions, in accordance with institutional policies. Completed forms should not be included with your submission. However, consent forms should be made available upon request from the editor or editorial office, during the review process or post-publication. The determination of what constitutes identifiable data lies with our editors and editorial office staff, and manuscripts may be rejected if the required consent documents cannot be provided. Please note that written informed consent for publication is required for all case report articles where the patient or subject is identified or identifiable. Information regarding participant/patient consent for publication of identifiable data should be provided within the submission system. This will generate an ethics statement that will be directly included in the manuscript. Clinical Trials The World Health Organization defines a clinical trial as \"any research study that prospectively assigns human participants or groups of humans to one or more health-related interventions to evaluate the effects on health outcomes\". In accordance with the Clinical Trial Registration Statement from the International Committee of Medical Journal Editors (ICMEJ), all clinical trials must be registered in a public trials registry at or before the onset of participant enrolment. To meet the requirements of the ICMJE and the journal, clinical trials can be registered with any Primary Registry in the WHO Registry Network or an ICMJE approved registry. Clinical trial reports should be compliant with the Consolidated Standards of Reporting Trials (CONSORT) by including a flow diagram presenting the enrolment, intervention allocation, follow-up, and data analysis with number of subjects for each and taking into account the CONSORT Checklist of items to include when reporting a randomized clinical trial. The information on the clinical trial registration (Unique Identifier and URL) must be included in the abstract. Manuscripts are accepted for review with the understanding that the same work has not been submitted or published elsewhere, or be under consideration for publication elsewhere, and, if accepted by the Journal, will not be submitted or published elsewhere. If evidence of dual submission is found, the manuscript will be rejected or, if published, retracted. Posting submitted material on a website prior to publication may also be considered dual submission. If any material published previously is included, for clarity or other reasons, this should be indicated with appropriate citation in the manuscript. Contact theFrontiers Editorial Officeif you require further information. The journal’s supportive preprint policy encourages full open access at all stages of a research paper, to share and generate knowledge researchers need to support their work. Authors publishing in the journal may share their work ahead of submission, as well as during the review process, on repositories or preprint servers (such as bioRxiv, medRxiv PeerJ Preprints, and others), provided that the server imposes no restrictions upon the author's full copyright and re-use rights. Also note that any manuscript files shared after submission to the journal, during the review process, cannot contain the Frontiers, or journal logo or branding. Correct attribution of the original source in repositories or preprint servers must be included within the manuscript on submission or added at re-submission if the deposition is done during the review process. We ask that the preprint is both listed within the acknowledgement section and the full citation included in the reference list. Should their article be accepted for publication authors are requested to update preprint records with a link to the final published article to enable readers to find, access, and cite the final peer-reviewed version. Please note that we cannot consider for publication content that has been previously published, or is already under review, within a scientific journal, book or similar entity. These guidelines cover acceptable uses of generative AI technologies such as Large Language Models (ChatGPT, Jasper) and text-to-image generators (DALL-E 2, Midjourney, Stable Diffusion) in the writing or editing of manuscripts submitted toExperimental Biology and Medicine. Authors should not list a generative AI technology as a co-author or author of any submitted manuscript. Generative AI technologies cannot be held accountable for all aspects of a manuscript and consequently do not meet the criteria required for authorship. If the author of a submitted manuscript has used written or visual content produced by or edited using a generative AI technology, this use must follow allExperimental Biology and Medicineguidelines and policies. Specifically, the author is responsible for checking the factual accuracy of any content created by the generative AI technology. This includes, but is not limited to, any quotes, citations or references. Figures produced by or edited using a generative AI technology must be checked to ensure they accurately reflect the data presented in the manuscript. Authors must also check that any written or visual content produced by or edited using a generative AI technology is free from plagiarism. If the author of a submitted manuscript has used written or visual content produced by or edited using a generative AI technology, such use must be acknowledged in the acknowledgements section of the manuscript and the methods section if applicable. This explanation must list the name, version, model, and source of the generative AI technology. We encourage authors to upload all input prompts provided to a generative AI technology and outputs received from a generative AI technology in the supplementary files for the manuscript. **2. Publishing Ethics** The knowing duplication of published work without appropriate attribution will not be tolerated. This policy covers all material, whether in the form of text, tables, figures or other exhibits, which has been published or is being considered for publication in another journal, and applies to the published work of the submitting author(s) as well as the work of other investigators. Experimental Biology and Medicinetake issues of copyright infringement, plagiarism or other breaches of best practice in publication very seriously. We seek to protect the rights of our authors and we always investigate claims of plagiarism or misuse of published articles. Equally, we seek to protect the reputation of the journal against malpractice. Submitted articles may be checked with duplication-checking software. Where an article, for example, is found to have plagiarized other work or included third-party copyright material without permission or with insufficient acknowledgement, or where the authorship of the article is contested, we reserve the right to take action including, but not limited to: publishing an erratum or corrigendum (correction); retracting the article; taking up the matter with the head of department or dean of the author's institution and/or relevant academic bodies or societies; or taking appropriate legal action. Three levels of plagiarism are covered by this policy, with progressively more severe sanctions: Level one: Limited duplication of text from the authors' own published work, with somewhat more relaxed stringency for materials and methods: In these cases, the manuscript will be returned to the authors with instructions to rewrite/rephrase the duplicated text, before publication of the submission may proceed. If the materials and methods are heavily duplicated, the authors could be advised to reference their published work, thereby shortening that section. Level two: Substantial duplication of an author's own work, or significant duplication of the work of others, will result in rejection of the manuscript or retraction after publication. Level three: Duplication of an author's own work so extensive that it could be considered an attempt to publish the same work twice (dual or redundant publication), or lifting of large chunks of text or data from the work of others, will result in rejection of the manuscript or retraction after publication and, in addition, contacting the appropriate officials at the author's institution. Every manuscript submitted to the journal is screened for textual overlap by the software CrossCheck, powered by iThenticate. If the software identifies possible plagiarism, further investigation will be conducted by the Associate Editor of the assigned category of EBM. Findings of potential plagiarism requiring one of the sanctions described above will be forwarded to the Editor-in-Chief for further review. Every effort will be made to conduct these reviews in a careful, fair and impartial manner, to avoid inappropriate imposition of sanctions. EBM urges submitting authors to avoid duplication either of their own work or that of others, and recommends authors evaluate their manuscripts with plagiarism-detecting software before submitting their work to EBM. Under the Conditions for Website Use and the General Conditions for Authors, authors of articles published in EBM retain copyright on their articles, except for any third-party images and other materials added by EBM, which are subject to copyright of their respective owners. Authors are therefore free to disseminate and re-publish their articles, subject to any requirements of third-party copyright owners and subject to the original publication being fully cited. Visitors may also download and forward articles subject to the citation requirements and subject to any fees EBM’s publisher, Frontiers, may charge for downloading licenses. The ability to copy, download, forward or otherwise distribute any materials is always subject to any copyright notices displayed. Copyright notices must be displayed prominently and may not be obliterated, deleted or hidden, totally or partially. The journal allows the inclusion of content which first appeared in an author's thesis so long as this is the only form in which it has appeared, is in line with the author's university policy, and can be accessed online. If the thesis is not archived online, it is considered original, unpublished data and is subject to the unpublished data restrictions of some article types. Inclusion of material from theses or dissertations should be noted in the Acknowledgements section of the manuscript AND cited accordingly in the reference list. Manuscripts that first appeared as conference papers must be expanded upon if they are to be considered as original work. Authors are required to add a substantial amount of original content in the form of new raw material (experiments, data) or new treatment of old data sets which lead to original discussion and/or conclusions, providing value that significantly exceeds the original conference version. As a rule of thumb, at least 30% of the content must be original. Authors submitting such work are required to: Seek permission for reuse of the published conference paper if the author does not hold the copyright Seek permission for reuse of the published conference paper if the author does not hold the copyright Seek permission for reuse of the published conference paper if the author does not hold the copyright Cite the conference in the acknowledgments section, or the references section if applicable. Cite the conference in the acknowledgments section, or the references section if applicable. Cite the conference in the acknowledgments section, or the references section if applicable. Although permissible, extended manuscript content which previously appeared online in non-academic media, e.g. blogs, should be declared at the time of submission in the acknowledgements section of the manuscript. The journal recognizes our responsibility to correct scientifically relevant errors in previously published articles. Authors should contact the Editorial Office directly. Corrections can be submitted if: a small portion of an otherwise reliable publication proves to be misleading; OR a small portion of an otherwise reliable publication proves to be misleading; OR a small portion of an otherwise reliable publication proves to be misleading; OR there is an error in a figure that does not alter the conclusions; OR there is an error in a figure that does not alter the conclusions; OR there is an error in a figure that does not alter the conclusions; OR there is an error in statistical data not altering conclusions; OR there is an error in statistical data not altering conclusions; OR there is an error in statistical data not altering conclusions; OR there are mislabeled figures; OR there are mislabeled figures; OR there are mislabeled figures; OR the wrong slide of microscopy was provided; OR the wrong slide of microscopy was provided; OR the wrong slide of microscopy was provided; OR if the author / contributor list is incorrect when a deserving author has been omitted or somebody who does not meet authorship criteria has been included. if the author / contributor list is incorrect when a deserving author has been omitted or somebody who does not meet authorship criteria has been included. if the author / contributor list is incorrect when a deserving author has been omitted or somebody who does not meet authorship criteria has been included. A correction must be submitted through our submission system, authors should contact the Editorial Office first. The Impact Statement should be used to clearly state the reason for the correction and the title of the submission should have the following format: “Corrigendum: Title of original article”. If the error was introduced during the publishing process, the Editorial Office should be contacted. The publisher of the journal (Frontiers) is a member of the Committee on Publication Ethics (COPE). As such, the journal abides by their guidelines and recommendations in cases of potential retraction. The journal also abides by two other key principles, as recommended by COPE: retractions are not about punishing authors; retractions are not about punishing authors; retractions are not about punishing authors; retraction statements should be public and linked to the original, retracted article. retraction statements should be public and linked to the original, retracted article. retraction statements should be public and linked to the original, retracted article. All potential retractions will be judged on their own merits and will be the subject of an internal investigation or, where satisfactory, the recommendations from the institutional investigation of the author(s). The journal considers the following reasons as giving cause for concern and potential retraction: clear evidence that findings are unreliable, either as a result of misconduct (e.g. data fabrication) or honest error (e.g. miscalculation or experimental error); clear evidence that findings are unreliable, either as a result of misconduct (e.g. data fabrication) or honest error (e.g. miscalculation or experimental error); clear evidence that findings are unreliable, either as a result of misconduct (e.g. data fabrication) or honest error (e.g. miscalculation or experimental error); findings have previously been published elsewhere without proper attribution, permission or justification (i.e. cases of redundant publication); findings have previously been published elsewhere without proper attribution, permission or justification (i.e. cases of redundant publication); findings have previously been published elsewhere without proper attribution, permission or justification (i.e. cases of redundant publication); major plagiarism; major plagiarism; major plagiarism; the reporting of unethical research, the publication of an article that did not have the required ethics committee approval; the reporting of unethical research, the publication of an article that did not have the required ethics committee approval; the reporting of unethical research, the publication of an article that did not have the required ethics committee approval; legal issues pertaining to the content of the article, e.g. libelous content; legal issues pertaining to the content of the article, e.g. libelous content; legal issues pertaining to the content of the article, e.g. libelous content; major authorship issues, i.e. proven or strongly suspected cases of ghostwriting or sold ('gift') authorship; major authorship issues, i.e. proven or strongly suspected cases of ghostwriting or sold ('gift') authorship; major authorship issues, i.e. proven or strongly suspected cases of ghostwriting or sold ('gift') authorship; politically motivated articles where objectivity is a serious concern; politically motivated articles where objectivity is a serious concern; politically motivated articles where objectivity is a serious concern; the singling out of individuals or organizations for attack; the singling out of individuals or organizations for attack; the singling out of individuals or organizations for attack; faith issues (e.g. intelligent design); faith issues (e.g. intelligent design); faith issues (e.g. intelligent design); papers that have made extraordinary claims without concomitant scientific or statistical evidence (e.g. pseudoscience). papers that have made extraordinary claims without concomitant scientific or statistical evidence (e.g. pseudoscience). papers that have made extraordinary claims without concomitant scientific or statistical evidence (e.g. pseudoscience). Readers who would like to draw the editors' attention to published work that might require retraction should contact the authors of the article and write to the journal, making sure to include copies of all correspondence with authors. The journal takes concerns regarding image manipulation seriously. We request that no individual features within an image are modified (eg. enhanced, obscured, moved, recycled, removed or added). Image processing methods (e.g. changes to the brightness, contrast or color balance) must be applied to every pixel in the image and the changes should not alter the information illustrated in the figure. Where cropped images of blots are shown in figures, a full scan of the entire original gel(s) must be submitted as part of the supplementary material. Where control images are re-used for illustrative purposes, this must be clearly declared in the figure legend. If any form of image processing is legitimately required for the interpretation of the data, the software and the enhancement technique must be declared in the methods section of the manuscript. Image grouping and splicing must be clearly stated in the manuscript and the figure text. Any concerns raised over undeclared image modifications will be investigated and the authors will be asked to provide the original images. **** **3.Materials and Data Policies** The journal is committed to open science and open data; we require that authors make available all data relevant to the conclusions of the manuscript. Generated data should be publicly available and cited in accordance with our data guidelines in the information for authors document. We aim to achieve the best community standards regarding data availability, ensuring increased levels of transparency and reproducibility in our published articles. Our policies on data availability are informed by community-driven standards, which the journal endorses, such as the Transparency and Openness (TOP) guidelines, and the joint declaration of data citation principles produced by FORCE 11. Authors are required to make all materials used to conduct their research available to other researchers. Research materials necessary to enable the reproduction of an experiment should be clearly indicated in the Materials and Methods section. Relevant materials such as protocols, analytic methods, and study material should preferably be uploaded to an online repository providing a global persistent link/identifier. If this is not possible, authors are strongly encouraged to make this material available upon request to interested researchers, and this should be stated in the manuscript. Authors are encouraged to make the \"minimal data set\" underlying the findings described and used to reach the conclusions of the manuscript, available to any qualified researchers. The data should be FAIR—findable, accessible, interoperable, and reusable—so that other researchers can locate and use the data. However, exceptions are granted if data cannot be made publicly available for legal or ethical reasons. To comply with best practice in their field of research, authors are encouraged to make certain types of data available to readers at the time of publication in specific, stable, community-supported repositories such as those listed below. Authors should contact the Editorial Office if they have any questions. We strongly encourage sharing the maximal amount of data; however where ethical, legal or privacy issues are present the data should not be shared. In cases where some or all data cannot be shared for legal, ethical or privacy restrictions, the authors should make these limitations clear in the Data Availability Statement at the time of submission. Possible limitations to making data publicly available include patient confidentiality and participant privacy. Authors should ensure that the data shared are in accordance with the ethical consent provided by participants on the use of confidential/identifiable human data. We require that the authors demonstrate that publication of such data does not compromise the anonymity of the participants or breach local data protection laws. In situations where access is restricted to protect confidential or proprietary information, authors are required to explain the restrictions on the dataset and make the data available upon request with permission of the third party. The Data Availability Statement should include all necessary contact information to request access to the dataset. Authors are encouraged to cite all datasets generated or analyzed in the study. Where datasets are cited, they should be included in the references list to maximize future usability. The following format should be used: [Dataset] Author names. (year) Data Title. Repository name. Version. Persistent identifier Data availability statements are required for all articles published with the journal. During the submission process, authors will be asked to detail the location of the raw data underlying the conclusions made in the manuscript, and whether it will be made available to other researchers following publication. Authors will also be asked for the details of any existing datasets that have been analyzed in the manuscript. These datasets should be cited in accordance with our data citation guidelines. A statement will be automatically generated using the information provided in the submission form; however, manuscripts containing incomplete or incorrect statements will be prevented from entering the review process. Examples of Acceptable Statements Original datasets are available in a publicly accessible repository:The original contributions presented in the study are publicly available. This data can be found here: [link/accession number]. Original datasets are available in a publicly accessible repository: The original contributions presented in the study are publicly available. This data can be found here: [link/accession number]. Original datasets are available in a publicly accessible repository: The original contributions presented in the study are publicly available. This data can be found here: [link/accession number]. Existing datasets are available in a publicly accessible repository:Publicly available datasets were analyzed in this study. This data can be found here: [link/accession number]. Existing datasets are available in a publicly accessible repository: Publicly available datasets were analyzed in this study. This data can be found here: [link/accession number]. Existing datasets are available in a publicly accessible repository: Publicly available datasets were analyzed in this study. This data can be found here: [link/accession number]. Information for existing publicly accessible datasets are contained within the article (e.g. for studies using greater than 10 accession numbers):The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/supplementary material. Information for existing publicly accessible datasets are contained within the article (e.g. for studies using greater than 10 accession numbers): The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/supplementary material. Information for existing publicly accessible datasets are contained within the article (e.g. for studies using greater than 10 accession numbers): The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/supplementary material. All relevant data is contained within the article:The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author/s. All relevant data is contained within the article: The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author/s. All relevant data is contained within the article: The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author/s. Restrictions apply to the datasets:The datasets presented in this article are not readily available because [VALID REASON]. Requests to access the datasets should be directed to [text input]. Restrictions apply to the datasets: The datasets presented in this article are not readily available because [VALID REASON]. Requests to access the datasets should be directed to [text input]. Restrictions apply to the datasets: The datasets presented in this article are not readily available because [VALID REASON]. Requests to access the datasets should be directed to [text input]. Authors are encouraged to deposit the following mandatory data types in public, community-supported repositories, such as those listed below, prior to publication of an associated manuscript: Data-type Recommended Repositories Metadata Standard Genetic and genomic sequence (DNA/ RNA) * GenBank DNA Data Bank of Japan (DDBJ) European Nucleotide Archive (ENA) MiXS Metagenomic sequence EBI Metagenomics MiXS DNA and RNA trace or short-read sequencing data NCBI Trace Archive NCBI Sequence Read Archive MiXS Genetic polymorphism data, including SNP and CNV data dbSNP dbVar European Variation Archive DGVa MiXS Gene expression data; chromatin immunoprecipitation data (deep-sequencing or microarray) ArrayExpress Gene Expression Omnibus (GEO) MIAME / MINSEQE Data linking genotype to phenotype dbGaP Protein sequence data UniProt > Proteome profiling data PRIDE PeptideAtlas ProteomeXchange MIAPE Small molecule, protein, protein complex data structural data Crystallography Open Database Cambridge Structural Database wwPDB (Protein DataBank) Electron Microscopy Databank CIF Taxonomy data Zoobank * Genetic sequence variants should be annotated according to the guidelines established by the Human Variome Project. Authors are encouraged to consider deposition in public, community-supported repositories of the data-types listed below: Data-type Recommended Repositories Metadata Standard Protein-protein interaction data Database of Interacting Proteins (DIP) MIMIx Metabolite and metabolome profiling data MetaboLights Human Metabolome Database MSI Small-molecule screening data, chemical compound data PubChem CIF Flow cytometry data Flow Repository Brain Imaging data; neuroimaging data OpenfMRI INDI NITRC NeuroVault [Statistical maps] BIDS Trait data TRY database Phenology data National Phenology Network Any data FigShare Dryad Digital Repository None Studies employing RNASeq for comparative transcriptomic analyses must contain at least three biological replicates (unless otherwise justified). Each biological replicate should be represented in an independent library, each with a unique barcode if libraries are multiplexed for sequencing. Validation on a number of key transcripts highlighted in the study is also highly recommended. Full data accompanying these experiments must be made available to reviewers at the time of submission in a freely accessible resource, e.g the sequence read archive (SRA) or European Nucleotide Archive (ENA). Depending on the question addressed in a manuscript, de novo assemblies of transcriptomes may also require multiple replicates, and assembled sequences together with sequence annotation must be made freely available, e.g figshare or dryad. Authors should provide relevant information relating to how peptide/protein matches were undertaken, including methods used to process and analyze data, false discovery rates (FDR) for large-scale studies, and threshold or cut-off rates for peptide and protein matches. Further information should include software used, mass spectrometer type, sequence database and version, number of sequences in database, processing methods, mass tolerances used for matching, variable/fixed modifications, allowable missed cleavages, etc. Authors should provide as supplementary material the information used to identify proteins and/or peptides. This should include information such as accession numbers, observed mass (m/z), charge, delta mass, matched mass, peptide/protein scores, peptide modification, miscleavages, peptide sequence, match rank, matched species (for cross-species matching), number of peptide matches, etc. Ambiguous protein/peptide matches should be indicated. For quantitative proteomics analyses, authors should provide information to justify the statistical significance, including biological replicates, statistical methods, estimates of uncertainty, and the methods used for calculating error. For peptide matches with biologically relevant post-translational modifications (PTMs) and for any protein match that has occurred using a single mass spectrum, authors should include this information as raw data or annotated spectra, or submit data to an online repository (recommended option; see table below). Raw or matched data and 2-DE images should be submitted to public proteomics repositories such as those participating in ProteomeXchange. Submission codes and/or links to data should be provided within the manuscript. Authors are encouraged to make available all code used to conduct their research available to other researchers. Code necessary to enable the reproduction of an experiment should be clearly indicated in the Materials and Methods section, and where possible code should be uploaded to an online repository (such as github.com or code ocean) providing a global persistent link/identifier. Our policies on code availability are informed by community-driven standards, which the journal endorses, such as the Transparency and Openness (TOP) guidelines, and the joint declaration of data citation principles produced by FORCE 11. We strongly encourage sharing original code where possible. In situations where custom code is proprietary, an exception will be granted providing that all relevant software needed to replicate the results of the study are available commercially for researchers. Details of the proprietary software used should be listed in the materials and methods section. At submission, authors should declare any intellectual property relating to the code and themselves in a conflict of interest statement. Menu GuidelinesAuthor guidelinesReview guidelinesPolicies and publication ethicsPublishing fees Author guidelines Review guidelines Policies and publication ethics Publishing fees Author guidelines Review guidelines Policies and publication ethics Publishing fees ExploreArticlesIssuesJournalAbout the SocietyAbout Frontiers Publishing Partnerships Articles Issues Journal About the Society About Frontiers Publishing Partnerships Articles Issues Journal About the Society About Frontiers Publishing Partnerships ConnectHelp centerEmails and alertsContactSubmit Help center Emails and alerts Contact Submit Help center Emails and alerts Contact Submit"}