{"id": 1628, "name": "WUSF - NPR - Tampa", "domain": "wusf.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.wusf.org/wusfnoticias/2025-06-11/el-proyecto-de-ley-grande-y-hermoso-de-trump-incluye-recortes-a-medicaid-y-snap-lo-que-eso-significa-para-los-floridanos", "title": "El Proyecto De Ley Grande Y Hermoso De Trump Incluye Recortes A Medicaid Y Snap Lo Que Eso Significa Para Los Floridanos", "content": "NewsHome(Text-Only Site)WeatherLocal / StateUS / WorldPoliticsEducationUniversity BeatEnvironmentArts / CultureEconomy / BusinessTransportationCourts / LawScience / SpaceSportsWUSF NoticiasHome(Text-Only Site)WeatherLocal / StateUS / WorldPoliticsEducationUniversity BeatEnvironmentArts / CultureEconomy / BusinessTransportationCourts / LawScience / SpaceSportsWUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Health News Florida Shows & PodcastsScheduleProgramsPodcastsWake Up CallFlorida MattersThe Florida RoundupThe Zest PodcastOur Changing StateMorning EditionAll Things ConsideredScheduleProgramsPodcastsWake Up CallFlorida MattersThe Florida RoundupThe Zest PodcastOur Changing StateMorning EditionAll Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered More2025 Atlantic Hurricane Season2025 Florida LegislatureYour FloridaPaycheck To PaycheckFlorida And Climate ChangeVote 2024Corporate BuyoutsTampa Bay Eviction CrisisGrowing Up With GunsQueer SpacesBlack Mental HealthUnequal Shots2025 Atlantic Hurricane Season2025 Florida LegislatureYour FloridaPaycheck To PaycheckFlorida And Climate ChangeVote 2024Corporate BuyoutsTampa Bay Eviction CrisisGrowing Up With GunsQueer SpacesBlack Mental HealthUnequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots Events About UsOur MissionEditorial Integrity and Code of EthicsSocial Media Commenting PolicyMeet the StaffContact UsCareersInternshipsWUSF Station NewsSubscribe to our NewslettersWays To ListenDownload Our AppWUSF RebrandRules and RegulationsOur MissionEditorial Integrity and Code of EthicsSocial Media Commenting PolicyMeet the StaffContact UsCareersInternshipsWUSF Station NewsSubscribe to our NewslettersWays To ListenDownload Our AppWUSF RebrandRules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations SupportSave Public MediaNPR PlusWays To Support WUSFOne-Time GiftSustainer MembershipsDonate A VehicleIncrease Your Monthly GiftSave Public MediaNPR PlusWays To Support WUSFOne-Time GiftSustainer MembershipsDonate A VehicleIncrease Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift WUSF NetworkWUSFClassical WSMRWUSF JazzArts Axis FloridaThe Zest PodcastWUSF's Longest TableWUSFClassical WSMRWUSF JazzArts Axis FloridaThe Zest PodcastWUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table facebook instagram youtube twitter On AirNow PlayingWUSF 89.7 On AirNow PlayingClassical WSMR NewsHome(Text-Only Site)WeatherLocal / StateUS / WorldPoliticsEducationUniversity BeatEnvironmentArts / CultureEconomy / BusinessTransportationCourts / LawScience / SpaceSportsWUSF NoticiasHome(Text-Only Site)WeatherLocal / StateUS / WorldPoliticsEducationUniversity BeatEnvironmentArts / CultureEconomy / BusinessTransportationCourts / LawScience / SpaceSportsWUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Home (Text-Only Site) Weather Local / State US / World Politics Education University Beat Environment Arts / Culture Economy / Business Transportation Courts / Law Science / Space Sports WUSF Noticias Health News Florida Shows & PodcastsScheduleProgramsPodcastsWake Up CallFlorida MattersThe Florida RoundupThe Zest PodcastOur Changing StateMorning EditionAll Things ConsideredScheduleProgramsPodcastsWake Up CallFlorida MattersThe Florida RoundupThe Zest PodcastOur Changing StateMorning EditionAll Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered Schedule Programs Podcasts Wake Up Call Florida Matters The Florida Roundup The Zest Podcast Our Changing State Morning Edition All Things Considered More2025 Atlantic Hurricane Season2025 Florida LegislatureYour FloridaPaycheck To PaycheckFlorida And Climate ChangeVote 2024Corporate BuyoutsTampa Bay Eviction CrisisGrowing Up With GunsQueer SpacesBlack Mental HealthUnequal Shots2025 Atlantic Hurricane Season2025 Florida LegislatureYour FloridaPaycheck To PaycheckFlorida And Climate ChangeVote 2024Corporate BuyoutsTampa Bay Eviction CrisisGrowing Up With GunsQueer SpacesBlack Mental HealthUnequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots 2025 Atlantic Hurricane Season 2025 Florida Legislature Your Florida Paycheck To Paycheck Florida And Climate Change Vote 2024 Corporate Buyouts Tampa Bay Eviction Crisis Growing Up With Guns Queer Spaces Black Mental Health Unequal Shots Events About UsOur MissionEditorial Integrity and Code of EthicsSocial Media Commenting PolicyMeet the StaffContact UsCareersInternshipsWUSF Station NewsSubscribe to our NewslettersWays To ListenDownload Our AppWUSF RebrandRules and RegulationsOur MissionEditorial Integrity and Code of EthicsSocial Media Commenting PolicyMeet the StaffContact UsCareersInternshipsWUSF Station NewsSubscribe to our NewslettersWays To ListenDownload Our AppWUSF RebrandRules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations Our Mission Editorial Integrity and Code of Ethics Social Media Commenting Policy Meet the Staff Contact Us Careers Internships WUSF Station News Subscribe to our Newsletters Ways To Listen Download Our App WUSF Rebrand Rules and Regulations SupportSave Public MediaNPR PlusWays To Support WUSFOne-Time GiftSustainer MembershipsDonate A VehicleIncrease Your Monthly GiftSave Public MediaNPR PlusWays To Support WUSFOne-Time GiftSustainer MembershipsDonate A VehicleIncrease Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift Save Public Media NPR Plus Ways To Support WUSF One-Time Gift Sustainer Memberships Donate A Vehicle Increase Your Monthly Gift WUSF NetworkWUSFClassical WSMRWUSF JazzArts Axis FloridaThe Zest PodcastWUSF's Longest TableWUSFClassical WSMRWUSF JazzArts Axis FloridaThe Zest PodcastWUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table WUSF Classical WSMR WUSF Jazz Arts Axis Florida The Zest Podcast WUSF's Longest Table facebook instagram youtube twitter **El 'proyecto de ley grande y hermoso' de Trump incluye recortes a Medicaid y SNAP. Lo que eso significa para los floridanos.** Facebook Twitter LinkedIn Email **Republicanos de la Cámara de Representantes aprobaron recientemente su versión que realizaría recortes históricos a Medicaid y al Programa de Asistencia Nutricional Suplementaria. El debate sobre la medida ahora pasa al Senado.** Un proyecto de ley está avanzando en el Congreso que recortaría billones de los programas de beneficios federales, incluyendo SNAP y Medicaid. El 22 de mayo, los republicanos de la Cámara de Representantes aprobaron unproyecto de ley de reconciliación presupuestaria(este link está en inglés) que recortaría aproximadamente $700 billón de Medicaid y $300 billón de SNAP durante la próxima década. El proceso de reconciliación presupuestaria es un proceso legislativo que históricamente se ha utilizado para agilizar los cambios en el gasto federal, los impuestos o el límite de deuda. Defensores de la atención médica y las políticas alimentarias en Florida están rechazando los recortes históricos propuestos por los legisladores federales. \"En conjunto, estos dos recortes propuestos en SNAP y Medicaid realmente tendrán impactos devastadores en nuestras comunidades y básicamente devastarían nuestra red de seguridad estatal\", dijo Sadaf Knight, CEO del Florida Policy Institute. **Recortes de SNAP transferirían costos a los estados** A lo largo de sus 86 años de historia, SNAP, que fue precedido por el Programa original de Estampillas para Alimentos, ha sido pagado en su totalidad por el gobierno federal. Bajo la ley actual, el 100% de los beneficios alimentarios y el 50% de los costos administrativos para distribuir el programa se pagan con fondos federales. Ahora, eso podría cambiar. \"Una de las disposiciones más alarmantes de este proyecto de ley es una reestructuración silenciosa pero profunda del modelo de financiación de SNAP\", dijo Gina Plata-Nino, subdirectora del Food Research and Action Center, enun memorando de política(este link está en inglés). Una disposición en el proyecto de ley de reconciliación presupuestaria aprobado por los republicanos de la Cámara de Representantes cambiaría la forma en que se financia SNAP de dos maneras. LEA TAMBIÉN:Fondos en riesgo para un programa federal que facilita a los floridanos comprar productos locales.(este link está en inglés) De ser aprobado, a partir del año fiscal 2028, se requeriría que los estados paguen entre el 5% y el 25% de los costos de los beneficios alimentarios por primera vez. La escala móvil se decidiría por la tasa de pagos erróneos realizados por los estados. Por ejemplo, en Florida, el estado debería al gobierno federal el 25% del costo total de los beneficios alimentarios, según datos de errores de 2023 publicados por elComité de Agricultura de la Cámara de Representantes(este link está en inglés) Además, los estados recibirían menos apoyo federal para administrar SNAP. Los cambios propuestos disminuirían la tasa de reembolso federal para los costos administrativos de operar SNAP del 50% al 25%. En conjunto, ambos cambios de financiación tendrían impactos graves en Florida, donde alrededor de 3 millones de personas dependen de SNAP. Se estima que los cambios en la financiación federal duplicarían con creces el costo de administrar SNAP en Florida, de alrededor de $89 millones a $1.6 billón, segúnun informe del Center on Budget and Policy Priorities (CBPP)(este link está en inglés). \"Estos aumentos dramáticos ponen en riesgo a millones de niños y familias de Florida de perder un programa crítico. Con uno de cada cinco niños que ya experimentan inseguridad alimentaria en nuestro estado, estos cambios amenazan la capacidad de una familia para comprar alimentos saludables y nutritivos\", dijo Sky Beard, directora de No Kid Hungry en Florida. Expertos nacionales en políticas alimentarias advierten que los estados con bases impositivas más débiles, como Florida, pueden tener menos opciones para asumir los costos adicionales de proporcionar beneficios de SNAP si se aprueban los cambios propuestos. \"Los estados que cumplen con ese perfil serían realmente excesivamente dependientes… de un enfoque basado únicamente en recortes\", dijo Wesley Tharpe, experto en política fiscal del CBPP. Dijo que es posible que los líderes de Florida opten por salirse completamente del programa SNAP. **Recortes federales a Medicaid podrían impactar significativamente el programa de Florida** Desde 1965, Medicaid ha proporcionado cobertura de atención médica a familias e individuos de bajos ingresos en todo el país a través de una asociación de fondos federales y estatales. El programa también ayuda a los ancianos, personas con discapacidades y mujeres embarazadas. En Florida, una forma en que se compensan los déficits de fondos federales es a través deimpuestos a los proveedores(este link está en inglés), que son impuestos relacionados con la atención médica que se aplican a instituciones como hospitales y hogares de ancianos. Sin embargo, la \"Ley de Un Gran Proyecto de Ley Hermoso\" prohibiría a los estados imponer impuestos nuevos o aumentados a los proveedores. Y Knight dijo que esa disposición podría tener el impacto más significativo en Florida. \"Esto realmente dificultaría nuestra capacidad de recaudar los fondos que necesitamos para financiar nuestro programa de Medicaid, y sería devastador para los floridanos que dependen de Medicaid para recibir seguro médico\", dijo Knight. Knight dijo que los recortes al programa también podrían presionar a los hospitales rurales. \"No solo afectará a las personas que reciben atención médica a través de Medicaid o beneficios de nutrición, nos afectará a todos\", dijo ella. Pero lospartidarios de la medida(este link está en inglés) dijeron que proporcionará alivio fiscal, controlará el \"gasto imprudente\" y fortalecerá la seguridad nacional. \"Así que lo que veremos en Florida y en todo el país, pero especialmente en Florida, es un enorme aumento de floridanos sin seguro médico\", dijo Knight. \"Al mismo tiempo, verán un recorte en SNAP, la gente no podrá llegar a fin de mes y recibir la atención médica o los beneficios nutricionales que necesitan, especialmente durante una recesión económica\". Alrededor de2.3 millones de floridanos(este link está en inglés) menores de 65 años carecen de seguro médico. Florida estableció su programa de Medicaid en 1970. Ahora, laAgencia para la Administración de la Atención Médica(este link está en inglés) supervisa el programa, con más de 4 millones de personas inscritas. Joan Alker es la directora ejecutiva y cofundadora delCenter for Children and Families de la McCourt School of Public Policy de la Universidad de Georgetown(este link está en inglés). En un seminario web en abril, dijo que de todos los fondos federales que llegan a Florida, el 44 por ciento — alrededor de $19.5 billón — provienen de Medicaid. Si esos fondos federales desaparecieran, Alker dijo que tendría un impacto \"enorme\" en el presupuesto del estado y su capacidad para financiar otras iniciativas. Además, los recortes de Medicaid podríanamenazar alrededor de 33,000 empleos en Florida(este link está en inglés) – aproximadamente la mitad de ellos en campos relacionados con la atención médica. Si tiene alguna pregunta sobre la sesión legislativa, puede preguntar al equipo de Your Florida haciendoclick aquí. Esta historia fue producida por WUSF como parte de una iniciativa de periodismo estatal financiada por la Corporation for Public Broadcasting. Esta nota de WUSF se tradujo del inglés al español utilizando una herramienta de inteligencia artificial generativa. Un periodista de WUSF informó y produjo la nota original. Miembros bilingües de WUSF editaron, actualizaron y verificaron la precisión de la traducción. Si tiene preguntas o inquietudes sobre el uso de IAG para este proyecto, comuníquese con Mary Shedden ashedden@wusf.org. Facebook Twitter LinkedIn Email Courts / LawTampa's Cambridge Christian School urges U.S. Supreme Court to rule on pregame prayers PoliticsGov. Ron DeSantis signs bills targeting sexual offenders and AI deepfakes EducationDeSantis reappoints Hosseini, Ridley to University of Florida Board of Trustees Economy / BusinessSilver Airways, which had flights out of Tampa, ceases operations amid bankruptcy filing In Miami, deportations are raising concerns among Cuban-Americans Performers and video game companies reach deal that ends nearly year-long strike Trump's EPA plans to repeal climate pollution limits on fossil fuel power plants Trump's DOJ makes its most sweeping demand for election data yet **Subscribe to Wake Up Call** **Our daily news update, sent to you Monday-Friday*indicates requiredEmail Address*** **** **** twitter instagram youtube facebook About Us Contact Us Newsletter Editorial Integrity and Code of Ethics Social Media Commenting Policy Careers Internships The Florida Channel Governance and Public Reports FCC Public Files Public File Assistance 2024 EEO Report Digital Stream Help Donate Your Vehicle Corporate Sponsor Download Our App Ways To Support Privacy Policy WUSF Brand Guidelines"}