{"id": 1428, "name": "The Ringer", "domain": "theringer.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.theringer.com/project/100-best-sports-moments-of-the-century#tigerwoodswinsusopen:~:text=Tiger%20Woods%20Wins%20the%20U.S.%20Open%20on%20One%20Leg", "title": null, "content": "Ranking All sports All years **The Ringer PresentsTHE 100BEST SPORTSMOMENTSof the Quarter Century** Since the calendar turned from 1999 to 2000 and none of us succumbed to the great machine uprising of Y2K, there have been 60,096 games played in Major League Baseball, 32,579 in the NBA, 31,377 in the NHL, 6,758 in the NFL, and 5,884 in the WNBA. That isa lotof sports in 25-plus years, a total of 136,694 games, which doesn’t even take into accountcollegesports, all of the Olympics, the tennis matches, the rounds of golf, and the myriad other ways to behold athletic competition. You’d be forgiven if it all blended together. But the wild thing about sports is that it never really does. With such an unparalleled ability to bottle up the human condition—the highs, the lows, the adversity, the intensity, the buildup, the release, the heartbreak, the triumph—sports are capable of delivering moments of true wonder that become memories, that become part of our lives. When the impossible becomes possible, when the definition of absurd is redefined, when men and women turn into superheroes—you don’t easily forget something like that. As we bid farewell to the first quarter of the 21st century, there’s no time better than now to celebrate the moments in this era of sports that stand above the rest—the ones that brought tears to eyes, left jaws on floors, and exemplified why we all spend so much time watching this stuff. To come up with this list of the best sports moments of the quarter century,The Ringerpolled our entire staff, hoping to cover every corner of the wide world of sports and everykindof sports moment (most of the things on this list happened on the field of play, but our scope was not limited to in-game moments). Of course, we also had to define “best,” as it applies to sports moments. Because “best” does not necessarily mean “most important”—the Malice at the Palace is undoubtedly one of the most important sports moments of the 21st century, yet no one would call it one of thebest—we leaned on this set of criteria in assembling our ranking: The Collective Joy Factor:Simply put, did the moment spark joy? (The “collective” part here is pretty important, too: It’s not like you’re gonna find a Yankees fan who loved the Red Sox comeback in ’04, buteveryoneelse had a great time.) The Ubiquity Factor:Did it transcend its sport and become a moment of monoculture? TheHoly Shit!Factor:Did it make you say, well, “Holy shit”? The “I Remember Where I Was When …” Factor:The staying power of the best sports moments is such that you can remember not only the moment but also where you were sitting when it happened—the shirt you had on, the people you were with, the way the bar smelled like popcorn … The Championship Stakes Factor:After all, great moments are often born out of great pressure. The Key Characters Involved Factor:Relatedly, great moments often feature sports’ most important figures coming through in the clutch. (This is admittedly a chicken-or-the-egg thing, as sports’ most important figures oftenbecomemost important through great moments.) The Legacy Factor:Did the moment burnish or solidify the legacy of a given athlete or team? The Nickname Factor:Because let’s be honest: If a moment has a widely recognized moniker, it’s probably one of the best. The “Will You Talk About This in 25 Years?” Factor:If your grandkids aren’t going to hear you drone on about it, it’s not that great of a moment. Not every moment on this list will satisfy each of these criteria. Some mayreallysatisfy only one of these factors. But mix all of the above together in any way, and you come out with a good idea of what makes a sports moment the “best.” As for which moments fit the definition most, well, let’s get toThe Ringer’s 100 Best Sports Moments of the Quarter Century. **The Fail Mary** The Fail Mary The Fail Mary How would you explain this moment to someone who’s never watched sports? This was a classic “You don’t know what you’ve got till it’s gone” tale. The nature of being a referee is such that you’re going to be hated. Everyone thinks you’re terrible at your job, and they only notice when you screw up. In 2012, the NFL and the refs were locked in a labor dispute. That led to replacement refs calling the games, and they were a complete disaster. At the end of a Week 3 game between the Seahawks and Packers, Russell Wilson threw up a Hail Mary to Golden Tate. It looked like a clear interception for the Packers, but the officials ruled it a touchdown catch, giving the Seahawks the victory. Everybody—from the announcing crew to then-president Barack Obama—agreed that the call was an embarrassment. Two days later, the usual refs agreed to terms on a new deal with the NFL. For a couple of weeks, we appreciated them. Now? We’re back to thinking they’re terrible again. Who is the unsung hero of this moment? Jimmy Connors (stay with me). This disaster unfolded during the peak of Sports Twitter. It seemed like everybody was watching and everybody had a take, including the tennis legend. Remember, the Packers were 3.5-point favorites and had a 12-7 lead before that final throw. The touchdown ended up flipping the betting result. And apparently, Connors had Green Bay to cover as one of his locks of the week. I love the action, but I will never bet on the#NFLagain. Thirteen years later, has anyone followed up with Connors to see whether he stayed firm on this? Hey, Jimmy, perhaps I can interest you in the latest offer from FanDuel if you want to get back in? **The Dallas Mavericks Trade Luka Doncic to the Los Angeles Lakers** The Dallas Mavericks Trade Luka Doncic to the Los Angeles Lakers The Dallas Mavericks Trade Luka Doncic to the Los Angeles Lakers Where were you when this moment happened? Doomscrolling through Twitter in Los Angeles, expecting to find something upsetting about politics. It turned out I found something upsetting about basketball! How has the way this moment is viewed changed since it happened? Shock and anger have given way to shock and anger. Seriously, this moment is interesting to me because of the unanimity of opinion. Everyone thinks Nico Harrison threw a generational player into the garbage can for nothing. Will there ever be a moment when we don’t think this? Or think itless? More onthe Luka Trade More onthe Luka Trade **T.J. Oshie’s Solo Shoot-Out Versus Russia** T.J. Oshie’s Solo Shoot-Out Versus Russia T.J. Oshie’s Solo Shoot-Out Versus Russia What is the most indelible image or quote from this moment? It’s T.J. Oshie, pride of Warroad, Minnesota—sorry, contractually obligated to mention that as a Minnesotan—standing near center ice, waiting to pick up the puck and skate toward Russian goaltender Sergei Bobrovsky. It’s an image we saw six times in the shoot-out that decided the Russia-U.S. game in the 2014 Sochi Olympics because, well, Oshie tooksixof the team’s eight shoot-out attempts. He scored on his first shot—through the five-hole of Bobrovsky, who was coming off a Vezina Trophy–winning season in the NHL. And when the shoot-out went to sudden death, he took every. Single. American. Shot. He finished the night 4-of-6 on his attempts—with most of his successes sliding right between the legs of Dear Old Bob. Much like getting nutmegged in soccer, getting scored on through the five-hole is incredibly demoralizing. And rather than being content with making Bobrovsky feel that anguish just once, Oshie did it three times—and saved the game for the Americans. What is the best behind-the-scenes anecdote about this moment? On theSpittin’ Chicletspodcast three years ago,Oshie revealedthat this shoot-out plan hadn’t been discussed before. And in fact, it was a surprise to him each time coach Dan Bylsma called his name against Russia. “I had an idea I was going to be going in the shoot-out,” Oshie said. “Then, when I scored my first one, I thought maybe that he would come back to me and have me go in the four-hole if we needed extra innings. And then after that, … literally every time I shot, I didn’t know when I got back to the bench that he was going to call me again.” So basically this was theHerb Brooks “AGAIN”scene fromMiracle. Only instead of skating suicides, Oshie was taking shoot-out attempts in the Olympics. Casually. **The Creation—and Immediate Collapse—of the European Super League** The Creation—and Immediate Collapse—of the European Super League The Creation—and Immediate Collapse—of the European Super League What is the biggest “what if?” surrounding this moment? What if it hadn’t been planned by 32 clowns in a clown car? The drive to create a hermetically sealed league for the top clubs in European soccer—freeing them from the tyranny of sharing broadcast money with lesser clubs, affixing their suction-cup mouths to the sweet, sweet flow of guaranteed annual revenue—had been going on for years. The 2021 Super League was the closest it had ever come to fruition. The big clubs (and also Tottenham Hotspur) wereso closeto liberating themselves from the unbearable, albeit purely notional, threat of relegation! But thanks to the dizzyingly incompetent way in which the project was conceived, implemented, announced, and marketed, it prompted a backlash so vast, so loud, and so multifarious that the whole thing collapsed about six seconds after they pulled the tarp off it. And so we shall never know the joys of a world in which Liverpool plays Real Madrid but not Everton. At least not until the next time they try it. Rewatching this moment makes me ________. … shed tears of laughter into my copy ofThe Marx-Engels Reader. **Michelle Kwan: “Fields of Gold”** Michelle Kwan: “Fields of Gold” Michelle Kwan: “Fields of Gold” What is the most indelible image or quote from this moment? The image of Kwan at the precise moment this routine ended: arms suspended above her head, fingers dangling, tears streaming down her face, smile beaming. The crowd roaring in approval as one of the great athletes of her generation reminded us why sports matter—and how they can touch us in a way that few other things in life can. Figure skating at the 2002 Winter Olympics is best remembered for the judging scandal in the pairs competition and for Sarah Hughes winning gold in the women’s singles. Neither of those packs nearly the emotional resonance of Kwan’s “Fields of Gold” skate at the Champions Gala after the outcome had already been decided. Kwan arrived in Salt Lake City as the gold medal favorite four years after finishing behind Tara Lipinski for silver in Nagano. This was supposed to be Kwan’s time, the crowning achievement in a career that seemingly had everything else. Instead, she took home bronze. But then Kwan transformed her pain into one of the most beautiful, elegant, and enduring programs of all time. Sports broke her heart, so she showed the world her soul. Rewatching this moment makes me ___________. … completely devastated and endlessly hopeful? If you were to simply look at her career arc, Kwan could be considered a tragic sports figure: She burst onto the scene in the mid-’90s, became the best women’s figure skater in the world, and never reached the pinnacle of her sport. Her quest for the thing that she wanted more than anything else fell short. In this moment, she knew that, and so did everyone else. But as she glided around the ice to Eva Cassidy’s haunting vocals, she left a much more meaningful legacy. Her pursuit of perfection revealed what a perfect human moment truly looks like. Kwan was never an Olympic gold medalist. She was something better. **American Pharaoh Wins the Triple Crown** American Pharaoh Wins the Triple Crown American Pharaoh Wins the Triple Crown How would you explain this moment to someone who’s never watched sports? It’s impossible to overstate just how beloved champion racehorses can be. When Secretariat won the Triple Crown in 1973, he ascended to a level of celebrity few ever reach: A2020 ESPN storyfound that Secretariat has263roads named after him, far more than any other athlete. In 2015, American Pharoah proved that the power of a once-in-a-lifetime racehorse endures. His wire-to-wire triumph in the Belmont Stakes not only made him the first Triple Crown winner in 37 years—it connected horseracing’s storied past with the present, and redefined the sport of kings for a new generation. What is the best behind-the-scenes anecdote about this moment? Just how beloved can champion racehorses be? Ask Serena Williams. In December 2015,Sports Illustratednamed Williams its Sportsperson of the Year. This didnotsit well with horseracing fans, who dominatedSI’s online reader poll; American Pharoah got 47 percent of the vote, with none of the other candidates—including Williams, Steph Curry, and Lionel Messi—receiving more than 29 percent. TheSIdecision got people extremely mad online, as many couldn’t believe that a horse was denied an honor specifically reserved for humans. ESPNwrote a storyabout the reaction. So didCNN, theBBC, and theLos Angeles Times. I worked forSIat the time, and I can attest that the staff was overwhelmed by apoplectic horse emails for about a month. Multiple meetings were called to rein in (sorry!) the outrage. The lessons here are simple: People like horses a lot more than they like people. And the results of an online poll are legally binding. **Carli Lloyd’s 13-Minute Hat Trick in the World Cup Final** Carli Lloyd’s 13-Minute Hat Trick in the World Cup Final Carli Lloyd’s 13-Minute Hat Trick in the World Cup Final How would you explain this moment to someone who’s never watched sports? Brandi Chastain ripping off her shirt after her winning penalty handed the U.S. the 1999 World Cup is indisputably one of the greatest moments in soccer history. But over the next 16 years, American fans wondered why our World Cup dominance seemed to wane.The USWNT claimed three straight Olympic golds from 2004 to 2012, but another star above the crest remained elusive. That is, until a particularly peeved New Jerseyan decided that, surrounded by some of the best attacking talent this team has ever had—Abby Wambach, Alex Morgan, Megan Rapinoe, Tobin Heath—it was HER moment to shine. What is the most indelible image or quote from this moment? Lloyd’s hat trick clincher is one of the most iconic goals in World Cup history, so please afford me two. First, themomentwhen Carli decided to hit the shot is so ridiculous that it deserves its own30 for 30. The USWNT was already up 3-0, with Lloyd having scored twice in the game’s opening five minutes, so you’d be forgiven for thinking that she would simply play it safe when she found herself surrounded by Japanese defenders near the halfway line. Instead, she took a look down to set herself before absolutely hammering the ball toward goal. Sometimes being greedy pays off! Second, the poor Japanese keeper, Ayumi Kaihori, knew what was about to happen but couldn’t do anything to stop it. As she backpedaled toward her own goal, she tripped herself a bit and threw a flailing hand at the shot, even managing to get a slight touch on it before it settled into the goal. And just as it went in, she placed her hands—comically large with the goalkeeper gloves on—over her face to try to hide from the 53,000 fans in attendance. It was heartbreaking for everyone outside the 50 states, and it made Lloyd a permanent fixture in our lives, forbetterandworse. **Jadeveon Clowney De-helmets a Michigan Running Back** Jadeveon Clowney De-helmets a Michigan Running Back Jadeveon Clowney De-helmets a Michigan Running Back How would you explain this moment to someone who’s never watched sports? South Carolina’s Jadeveon Clowney separated Michigan running back Vincent Smith from the football (and his helmet) like the Ancient One punching Bruce Banner’s consciousness out of his body inAvengers: Endgame. The tackle was perfect in both technique and raw physicality, and it might be thesecond-most impressive part of the play, considering Clowney ripped the ball away from two players withonehand. The hit isn’t just an iconic moment in college football; it ultimately came to define Clowney’s college career and solidified him as the most terrifying player in the sport a year before he’d even be draft eligible. Who is the unsung hero (or goat) of this moment? We owe thanks to some awful officiating for making Clowney’s hit possible because the play never should’ve happened in the first damn place. Just moments before, Michigan tried a fake punt that clearly came up short of the line to gain. I’m not talking about coming up short in our present-day context, where 4K cameras and ultra-slow motion give us a visual clarity that’s impossible for the actual human eye. I mean that three officials looked at THIS MEASUREMENT and still decided to move the chains. **Mo’ne Davis Throws a Shutout at the Little League World Series** Mo’ne Davis Throws a Shutout at the Little League World Series Mo’ne Davis Throws a Shutout at the Little League World Series How would you explain this moment to someone who’s never watched sports? The most talented, badass 13-year-old girl outshined all the boys in the Little League World Series. Davis, a pitcher for the Taney Dragons of Philadelphia, threw an incredible 70 mile per hour fastball to help her team win against the team from Nashville. That made her the first girl—and first African American girl—to win a Little League World Series game, and the first to pitch a shutout, as Taney won, 4-0. Rewatching this moment makes me ________. … emotional.Everyone—including myself—was rooting for Mo’ne. We all wanted to be like her. We all wanted our daughters to be like her. She represented everything awesome and cool about true girl power. When she succeeded the way she did, that phrase,girl power, seemed tangible. Thepower.It wasn’t a corny slogan or a catchphrase. It was reality: This girl beat the boys, and she did it on the highest stage of her sport. Would I have that kind of grace, that kind of poise, at her age? I continue to ask myself this and marvel at the way she carried herself when I re-watch this moment. **Trout vs. Ohtani at the World Baseball Classic** Trout vs. Ohtani at the World Baseball Classic Trout vs. Ohtani at the World Baseball Classic How would you explain this moment to someone who’s never watched sports? The best player of the 2010s (and best young player ever) faced the best player of the 2020s (and most impressive/skilled player ever) in a momentous, title-determining matchup between teammates andmememateswho were perennial absentees from October. In baseball, no player (or two players) can carry a team to the playoffs. And bound by the batting order, baseballcan’t be trustedto produce best-on-best, bottom-of-the-ninth heroics reliably. “Did you think it was going to end any other way?” Mike Troutasked. Actually, yes! Yet this time, the baseball gods played along, and Shohei Ohtani struck out Trout in an unforgettable torch pass. What is the best behind-the-scenes anecdote about this moment? For all of his talents, Ohtani isn’t known as an inspirational speaker,à la Ichiro. But before the WBC final, Ohtani addressed his Samurai Japan teammates and hyped them up to beat Team USA with a baller line that anL.A. Timesreportertranslatedas: “Let’s stop admiring them. … If you admire them, you can’t surpass them.” Ohtani followed that motivational masterpiece up by putting his pitches where his mouth was. After saving the championship game in theperfect climaxto anall-timer of a tournament, he delivered anothermemorable message: “I believe this is the best moment in my life.” **Holly Holm Upsets Ronda Rousey** Holly Holm Upsets Ronda Rousey Holly Holm Upsets Ronda Rousey Rewatching this moment makes me ________. … remember how swiftly the mighty can fall. It’s a tale as old as time in combat, right? Rousey was phenomenal when it came to submissions, but Holm was able to land hard strikes, leaving her opponent bloodied by the end of the first round. Fifty-nine seconds into the second round, Holm scored the upset of the year by defeating Rousey, proving that a skilled striker could nullify Rousey’s offense. Rousey returned at UFC 207 over a year later to face Amanda Nunes, andshedispatched Rousey via TKO early in the first round, in what became Rousey’s last MMA bout. Smart viewers (and fighters) learned that you could eliminate Rousey’s biggest threat, that arm bar, and coax a knockout if you tapped Rousey’s chin hard enough. So it was no surprise that Rousey—who had been spotted fraternizing with WWE Superstarsas early as 2014, during her phenomenal reign—signed a WWE contractafter a surprise appearance at the 2018 Royal Rumble. She’d previously called herself a lifelong fan of WWE and made her WWE debut witha “Rowdy” Roddy Piper–inspired shirt and kilt. Compared to getting your brains bashed in, this was a W career move. How did this moment change sports? Let’s discusssports entertainment, specifically Rousey’s impact on WWE. The former bantamweight championwasa huge influence on the “revolution” in WWE’s women’s division and the development of better story lines and higher-quality matches for women in WWE. Rousey’s time in WWE may not be looked back at fondly—by fans or by Rousey herself—but the snowball effect of her presence has to be highlighted. A decade later, fans are clamoring for women like Bianca Belair, Rhea Ripley, and Tiffany Stratton, who don’t have to dilute their athletic abilities to be a huge part of WWE’s women’s division. Hell, multi-time champions like Charlotte Flair have heaped praise on NXT's roster of women; shedeclared it“the greatest women’s division in the world!” If Rousey had never run through the UFC in the decisive manner that she did, and never gotten run out of it as resolutely as she did, it’s hard to believe that WWE would have gotten as far as it has with its women’s division. WWE just needed to see what happens when a dominant woman is allowed to get “rowdy.” **Isner vs. Mahut: The Neverending Match** Isner vs. Mahut: The Neverending Match Isner vs. Mahut: The Neverending Match How would you explain this moment to someone who’s never watched sports? You could watchThe Brutalistthrice—with intermissions—in the time it would take to relive this 11-hour, five-minute showdown from the 2010 Wimbledon Championships. The longest tennis match ever (by four hours!) was less a sporting event than a test of will—for the participants, the spectators, andthe IBM-powered scoreboard. Perhaps this infinity match was a result of these men being the most perfectly paired opponents in tennis history. Or perhaps they’ve simply been locked in an eternal struggle that has spanned past lives and many centuries. Either way, the ordeal lasted three days and 183 games and included215aces. The 6-foot-10 American John Isner would eventually win (“win”) 70-68, a set of numbers he’d later calla “basketball score.”Immediately after the battle, the French journeyman Nicolas Mahut sobbed for an hour—just 14 minutes shy of how long it took Isner to lose his subsequent match to Thiemo de Bakker. That one was played the day immediately after this ultramarathon left both Isner and Mahut shells of themselves. Brutal, indeed. Who is the unsung hero of this moment? Ronald McIntosh, the announcer and a boxing commentator who had never covered a tennis match before Isner-Mahut. However, he seemed more impressed with the players than he was with his own performance. “If I was to give a DVD to my friends and family of the commentary it would take up a few, maybe a box set would do it,”he said shortly afterward. “And it would cure insomnia.” **The Last DanceSaves Us All During COVID** The Last DanceSaves Us All During COVID The Last DanceSaves Us All During COVID What is the most indelible image or quote from this moment? “And then, I took that personally.” The credo to everything in Jordan’s life. When Isiah Thomas wouldn’t kiss the ring, Jordan took it personally. When Jerry Krause gave a little too much love to future teammate Toni Kukoc, MJ took it to heart. When LaBradford Smith said all that stuff—which he didn’t actually say; MJ just made it up because he needed an edge—of course Mike had a problem with it. Jordan’s competitive zeal is the stuff of legend, but it was really something to watch the greatest player of all time work through his beefs—especially during a time when we weren’t getting much live sports action. And honestly, the whole thing made him more relatable than he’s ever been. Where were you when this moment happened? In the house, presumably with Jordans on. **There’s Just Something About NBA Twitter** I’ve been to Temecula. Wine country in a Southern California valley, with an Indigenous casino that powers the entire local economy. Nice enough place for day drinking, a round of golf, or pai gow poker, if that’s your vice. But for a certain generation of digital natives, Temecula will forever be a portal to Christmas 2014, the site of the greatest duel that never was. @SnottieDrippen versus @MyTweetsRealAF, a modern-day Alexander Hamilton versus Aaron Burr. “Meet Me in Temecula,” as the interaction would be immortalized, wasa landmark moment in social media history, cementing the NBA as a perfect surrealist canvas on the easel of reality. Here’s the Hollywood tagline:How far would you go—and how far would you drive—to defend Kobe Bryant’s honor?Alternatively:What if the true meaning of Christmas can be found inthe act ofleaving your family to drive 20 miles in search of an online troll? Maybe you just had to be there—and bythere, I mean on NBA Twitter a decade ago. What a time. What a space. Back then, there was still a thrill in witnessing events unfold in real time at a maximum velocity of 140 characters. To see @MyTweetsRealAF threaten @SnottieDrippen with violence for roasting his NBA takes was one thing; to see the two hash out a neutral site where they could square up felt like being privy to something you weren’t meant to overhear. (The blurry smartphone photo of Temecula’s town welcome signand a middle finger as proof of intent? Pure art.) Less than a year later, the weird soul of NBA Twitter would go mainstream, refracted by the league itself. That’s how we arrive at the iconicDeAndre Jordan Hostage Crisis of 2015. Long story short, Jordan had agreed to a max contract with the Mavericks in the offseason but was having second thoughts during the moratorium period before contracts could be made official. Seeing a window of opportunity, Clippers front office brass and Jordan’s teammates put up the bat signal. Cryptic emoji tweets, as common as air these days, signaled for the whole cavalry to descend on Jordan’s home in Houston. (Sidenote: This is famously when we collectively realized that Paul Pierce had no idea how to use emojis.) The Clippers stayed with him until the clock struck 12:01 a.m. on July 9. They locked the doors and barred any Mavericks personnel from entering the home. They were successful. How do we know this?Adrian Wojnarowski, of course. AndBlake Griffin. These were absolutely inconsequential events in the grand scheme of NBA history, no doubt, but that’s not exactly what we’re talking about, is it? There is something about the league that inspires absurdity. The league lends its cast of characters, lore, and IP, but the instantaneous mythmaking that happens on NBA Twitter might be only tangentially related to the game itself. That’s always been the case. It’d be disingenuous to claim NBA Twitter as a phenomenon that manifested out of thin air. For as long as the internet has existed as a broadscale mode of communication, it has attracted a particular strain of hoops fanatic. “According to net traffic reports, the basketball newsgroups consistently rank in the top 40 newsgroups in terms of readership size and number of postings (right up there with comp.unix.questions and alt.sex),”wrote early Usenet poster Ellie Cutler, back in 1993—just a year after the Dream Team captured the world’s imagination at the 1992 Olympic games in Barcelona. Even back then, basketball was as integral to the fabric of online community building as coding and porn. There is a synergy in the NBA’s particular relationship with social media: The league traffics in avatar building, which is inarguably the most effective use of the internet. No other major North American team sport presents individual style with such clarity. In soccer, the full range of a body’s dexterity is, by rule, severely limited. In football and hockey, style is hidden beneath armor. In baseball, it’s shrouded by inescapable metrics. The NBA, with Michael Jordan as its lodestar, turns its best players into symbols and paragons. Being a Shai Gilgeous-Alexander supporter or a Joel Embiid apologist says something about you. Players can be reduced to a trope or aggrandized as something far bigger than they could ever fully embody. The shorthand on a player can follow them their entire lives, but it can just as easily be turned upside down to garner an equal and opposite reaction. It’s how Twitter can turn Dell Curry—whose genetics and all-American family ethos served as the foundation for one of the most influential players in NBA history—into a cautionary tale in what has become adefinitive treatise on the perils of modern dating. Or, better yet, just ask MJ, who is somehow simultaneously the face of dominance and utter defeat, largely due to just how universal and ubiquitous the “Crying Jordan” meme became. It was always meant to end up like this. Ten years after the DeAndre Jordan hostage crisis, perhaps it only makes sense that NBA Twitter’s true thought leader these days is@TheNBACentel, a parody of an NBA aggregator account that has been peddling misinformation for clicks and laughs since 2022. Kevin Durant turnedcentel’dinto a verb, a movecosigned byMerriam-Webster. In the brief window of time in which NBA Centel was thought to have been banned in late February, there was public mourning, with media pundits like Stephen A. Smith and actual NBA players like Jared McCain paying their respects. For all the hand-wringing about the state of the league, maybe the biggest issue the NBA faces is the degree to which fans would rather believe in fiction than fact. The only way to combat that sentiment is to affirm reality as the ultimate absurdity. And what better way to do that than to use the platform to confirm the Luka Doncic trade, which brought NBA Twitter together in a generational collective hallucination. No one knew what, how, when, or why. But we were all dumbfounded together, in agony, in joy. Just like the good old days. **Hakim Warrick’s Block Clinches It for Syracuse** Hakim Warrick’s Block Clinches It for Syracuse Hakim Warrick’s Block Clinches It for Syracuse How would you explain this moment to someone who’s never watched sports? Jim Boeheim, one of the winningest coaches in NCAA men’s basketball history, paired with one of the best players in NCAA men’s basketball history, Carmelo Anthony. They’ve run through the bracket and are in the title game, up three, mere seconds away from a championship. This is their only shot: Melo’s going to the NBA next year, and though he doesn’t know it at the time, Boeheim will never make it to another championship game. And their hopes rely on the outstretched—and somehow still stretching—arm of Hakim Warrick, as Kansas’s Michael Lee pulls up for what would be a game-tying triple. What is the best behind-the-scenes anecdote about this moment? It’s not quite behind-the-scenes, but to add more context here: That lunge by Warrick only partially captures the desperation that Syracuse was playing with in the waning seconds of the 2003 national championship. The Orange led Kansas by 11 at halftime, and once had a lead of 18 points, but spent the entire second half the Boeheim Way: holding on for dear life until the clock hit zeroes. The only reason Warrick had to make the block is because he missed two game-icing free throws seconds beforehand. This is one of the best sports moments of the 21st century, but it’s perhaps underrated how close it was to becoming one of the worst choke jobs of the 21st century. **Noah Lyles Wins Gold by (Less Than) a Hair** Noah Lyles Wins Gold by (Less Than) a Hair Noah Lyles Wins Gold by (Less Than) a Hair What is the most indelible image or quote from this moment? Seconds after everyone crossed the finish line in the fastest 100-meter race in history, Noah Lyles found his way over to Jamaica's Kishane Thompson. Lyles patted his chief rival on the back and said, “I think you’ve got that, good going.” It was an extraordinarily gracious gesture, especially given that if Thompson hadactuallypulled out the win in the 100-meter Olympic final, it would have been a huge letdown for Lyles and American sprinters. Lyles entered the Paris Games as one of the world’s biggest stars, a boastful and flamboyant 27-year-old whose best race wasreallythe 200 meters but who nonetheless was looking to add Olympic 100-meter gold to his world championship the year before. Imagine the fuel for his haters. Lyles had already antagonized the NBA’s American stars by questioning their use of the term \"world champion\" when referring to winning a league title. But facing down the possibility of a photo-finish loss in the Olympics’ marquee race, Lyles still had the presence of mind to congratulate his would-be conqueror. Then not even a few seconds later the stadium displayed the official results, showing Lyles had prevailed byfive-thousandths of a second. He took off around the track in celebration, ripping off his name tag and showing it to the crowd. Thompson dropped his head. The time for sportsmanship was now over, and Lyles had restored the order of things. What is the biggest “what if?” surrounding this moment? Just imagine what might’ve happened if Lyles had lost. It would have extended the Americans’ losing streak in the marquee event to five straight Olympics, a once unfathomable drought. It would have put a premature end to Lyles’s attempt at doubling in the 100 and 200, denying the Games one of the most intriguing story lines of the event. And it would have given NBA players so much ammunition in their year-long grudge against Lyles. “Somebody help this brother,” Kevin Durant had said on social media after learning of Lyles’s comments. Lyles would have left Paris as a punch line, another over-hyped American media fascination who failed to deliver in the only race that matters for sprinters of his caliber. Of course, Lyles came through in dramatic fashion. He also went on to finish third in the 200 after testing positive for COVID, a feat maybe even more impressive than his victory in the 100. He didn’t get the double but it’s hard to deny that Lyles lived up to the hype. **Arike Ogunbowale’s Final Four Buzzer-Beaters** Arike Ogunbowale’s Final Four Buzzer-Beaters Arike Ogunbowale’s Final Four Buzzer-Beaters Where were you when this moment happened? I was still working atSports Illustrated. We had an advance feed of the national championship playing on the office TVs that hung above our desks; it was about five seconds or so ahead of the game broadcast, so it truly felt like we were witnessing the future. Women’s hoops wasn’t as popular then as it is now, but I remember all of us standing up and watching the game together as the clock crept down.It can’t be overstated that Arike’s first buzzer-beater felt like an earthquake throughout the sport. With that shot, Notre Dame got a semifinal victory over UConn, a team that was two years removed from going 38-0. That first buzzer-beater was a warning. And when Notre Dame’s Jackie Young was standing along the sideline with less than three seconds left and the score tied against Mississippi State with a natty on the line, everyone in the gym—hell, everyone in the world—knew where that ball was going. Arike collected the inbound, and as she made her way to the right wing, the only thing in my mind wassurely she can’t do it again. I’ve never been so happy to be wrong. Ogunbowale nailed the shot to give us one of the most aesthetically pleasing buzzer-beaters of all time and permanently etched herself into hoops history. The last thing I remember from that night is being 23, a year out of college, and thinking, “This is what I got into this industry for.” Rewatching this moment makes me ___________. … nostalgic, mostly. Look at the talent on the court! Notre Dame was absolutely stacked, featuring Ogunbowale, Young, and Marina Mabrey, while that UConn team had Napheesa Collier, Kia Nurse, Gabby Williams, Katie Lou Samuelson, Azurá Stevens, and Crystal Dangerfield. And don’t sleep on Mississippi State, headlined by Teaira McCowan, Victoria Vivians, and Morgan William, who had sent the Huskies packing with herownFinal Four buzzer-beater a year earlier. All of which is to say: If the Dallas Wings somehow screw up the no. 1 pick in the WNBA draft this year and fail to surround Ogunbowale with more talent, we’ll be further deprived of the magic that made her a college legend. **Zion Williamson’s Shoe Explodes** Zion Williamson’s Shoe Explodes Zion Williamson’s Shoe Explodes What is the most indelible image or quote from this moment? It’s that floor-level shot of Zion, on his butt and wincing in pain with the failed Nike PG 2.5 stretched out in front of him, completely ruptured on the side like a pack of biscuits. There’s an eeriness to it now. When I headed off to college, I was very excited about the fact that I’d bought what I thought at the time was a nice laptop with my own money. I’d picked this particular laptop because it had both a powerful processing chip and a video card (yeah, baby), but what I couldn’t have known was that I’d bought a laptop with a heat sink that was not adequately paired with those components. It couldn’t cool itself down, so while I initially had a great time with its performance, it ultimately failed on me before the end of my freshman year. (There was actually a class-action lawsuit over it.) Breathtaking, aberrational athletes make me think of that laptop. In the time since Zion’s shoe exploded, it’s been an odd cocktail of joy, lament, and worry. Love, thinking about all of the crazy shit I’ve seen him do. Some sadness over the time we’ve already lost. Worry that we might lose more. There’s still a lot of time left for Zion’s story to have a great middle and end, but his beginning has toggled between extreme highs and extreme lows. We’re in year six, and out of a possible 482 regular-season games, Zion has played in only 205. We’ve been robbed of a whopping 56.2 percent of his career so far. You just cross your fingers and hope that the infrastructure (his own discipline included) around his phenomenal abilities can hold up. How has the way this moment is viewed changed in the years since it happened? The subject in frame is the same, but the lens is different. When this happened in early 2019, we were in full-blown Zion Mania. Duke was picking up steam, and week after week, there were fall-off-the-couch highlights or still frames going viral. In this moment I was thinking, “Welp, throw that on the pile of true tall tales that will fill this kid’s legacy,” but also, “I hope this doesn’t become a trend.” I’d never seen someonecompletely separatethe upper part of their shoe from the midsole with one powerful step, and I haven’t since. It became clear that in all phases of Zion, careful choices needed to be made. For one, maybe don’t wear a lightweight shoe with a Flywire upper if you’re built like a Mack truck and you can corner like a Lotus Elise. His extra-fortified Kyrie 4s, and later his first signature shoe, were much smarter choices. But today, it’s hard not to see this wild physical ability bleeding over the edges as a symbol of the way the first few years of his career have gone. I once jokingly wondered whether we might someday call Zion “Thiccarus” because of the scary situations that his jaw-dropping explosiveness and power seemed to put him in. When on the court, he’s still one of the true quandaries of the NBA—blowing by bigs who might contest him and big-boying guards who try to stay in front. It’s just never a given that he’ll be on the court. **Lisa Leslie Dunks** Lisa Leslie Dunks Lisa Leslie Dunks How would you explain this moment to someone who’s never watched sports? The early days of the WNBA were heady but anxious, featuring bothchart-busting ratingsand looming existential dread. Much of it was mediated through the question of when and whether a woman would perform an in-game dunk. Lisa Leslie, who attempted and missed a dunk in her inaugural game, was determined to do it. Her coach Michael Coopertoldher it wasn’t something she “can plan, but it’s something that’s going to happen.” Five years later, on July 30, 2002, Leslie found the right moment: On a breakaway against the now-defunct Miami Sol, she threw down the one-handed slam. How did this moment change sports? It’s a defining moment for Leslie, a multiple-time champion, Olympian, MVP, and Defensive Player of the Year and one of the first three players to sign a WNBA contract. She also bucked conventional wisdom about the physical capabilities of women in a league where the perception of the game as ground bound has created a self-fulfilling prophecy. AsNatalie Weiner puts it, even after you account for the height and vertical leap deficit, women’s basketball players who could dunk haven’t been encouraged to practice it or maximize their athleticism. Leslie, it’s worth noting,did. So did a teenage Candace Parker, who watched highlights of Leslie’s dunk over and over again before becoming the first woman to dunk in an NCAA tournament game in 2006. In the 22 seasons since Leslie’s dunk, the WNBA has seen 37 in-game dunks. **The Chicago Blackhawks Score Twice in 17 Seconds to Win the Cup** The Chicago Blackhawks Score Twice in 17 Seconds to Win the Cup The Chicago Blackhawks Score Twice in 17 Seconds to Win the Cup Where were you when this moment happened? I wasthere, baby, up in the TD Garden press box to cover Game 6 of the 2013 Stanley Cup Final between the Bruins and the Blackhawks for Grantland dot com. And while normally I wouldn’t presume to speak on behalf of close to 18,000 people, in this case I feel confident in my reporting: With the Bruins up 2-1, the Blackhawks’ net empty, and just over a minute left to play, pretty much everyone in the house assumed that this one would be heading back to Chicago for a Game 7. Doing so would have been on brand for the series. The clash between the 2010 and 2011 Cup winners had already featured three overtime finishes (one atriple-OT thriller) in the first five games. But in the end, all it took for the Blackhawks to win in six was a span of 17 seconds. Hot hand Bryan Bickell tied the game, then Dave Bolland added another on the very next shift, and just like that there was no more Game 7 back in Chicago. There was just Gary Bettman, on the ice in Boston, handing the Blackhawks their Cup. Rewatching this moment makes me ___________. … remember the specific electric-zap feeling of TD Garden abruptly draining of its proud, puckish swagger in the manner of Slimer getting got by the Ghostbusters. The Blackhawks earned their second of three Cups in a six-season stretch with that Game 6 win. The Bruins, meanwhile, never really did quite recover from the Game 7 that wasn’t. **The Tip: Richard Sherman Shuts Down a “Sorry Receiver”** The Tip: Richard Sherman Shuts Down a “Sorry Receiver” The Tip: Richard Sherman Shuts Down a “Sorry Receiver” What is the most indelible image or quote from this moment? The play itself was incredible, showcasing Richard Sherman’s rare coverage instincts, his body control, and his length in a game-sealing pass breakup against Michael Crabtree and the 49ers that sent the Seahawks to the Super Bowl. But Sherman’s infamous postgame interview with Erin Andrews will go down in history, for better or for worse, as the culmination of an awesome, years-long rivalry between two of the best teams of that era. Sherman’s opening salvo was unforgettable: “I’m the best corner in the game! When you try me with a sorry receiver like Crabtree, that’s the result you’re going to get!” Incredible stuff. Iconic. What is the best behind-the-scenes anecdote about this moment? The Sherman vs. Crabtree rivalry went deeper than just simple Seahawks-49ers hate.As the story goes, Sherman hadtried to shake Crabtree’s handat Larry Fitzgerald’s celebrity softball game during the prior offseason, and Crabtree was not having it. Sherman never forgot that moment, and vowed to embarrass the rival receiver when he got the chance. Well, he ended up getting his revenge on one of the biggest stages imaginable. Immediately after tipping the pass to his teammate, Shermanchased Crabtree down and troll-tastically tried to shake his handonce again. **Germany Destroys BrazilinBrazil, 7-1** Germany Destroys BrazilinBrazil, 7-1 Germany Destroys BrazilinBrazil, 7-1 How would you explain this moment to someone who’s never watched sports? Brazil is a nation with an impeccable soccer pedigree, producing all-time greats like Pelé, Ronaldo, Ronaldinho, Romario, Neymar, and Rivaldo. As the host nation of the 2014 World Cup, Brazil were the odds-on favorites to win the trophy, and the Seleção advanced to the semifinals against Germany. Unfortunately, that’s where it all came crashing down for Brazil, with the biggest margin of defeat in a World Cup semifinalandthe worst loss a host nation has suffered in the tournament’s history. You hate to see it. What is the most indelible image or quote from this moment? Highlights from the match were uploaded to porn sites and given R-rated titles that emphasized how thoroughly the Germans [clears throat] had dominated Brazil. The videos became so widespread that Pornhub (!)issued a pleaon Twitter: **The Publishing ofMoneyball** The Publishing ofMoneyball The Publishing ofMoneyball How did this moment change sports? How did itnot? Granted, the sabermetric movement was well underway by the time Michael Lewis caught wind of what the Oakland A’s were up to; Sandy Alderson, Billy Beane, and Paul DePodesta weren’t so much pioneering new concepts as they were applying existing ones. But it was one thing for Bill James and the denizens of SABR orrec.sport.baseballto make recommendations and another for a major league team to implement them, just as it was one thing for Rob Neyer andBaseball Prospectusto expound on sabermetric concepts and another for the author ofLiar’s PokerandThe New New Thingto bring them to the masses. We wouldn’t still be speaking solely about batting average, RBI, and pitcher wins in a world withoutMoneyball, but the book’s success accelerated the data-driven revolution by recruiting quants who hadn’t thought there was a place for them in sports, conditioning fans to think from a front-office perspective, and convincing owners that their teams could be run more like regular businesses. To a great degree, the buzzwordy way we talk and think about sports and, for that matter, every other topic today—“analytics,” “process,” “inefficiencies”—can be credited to (or blamed on)Moneyball. How has the way this moment is viewed changed in the years since it happened? WhenMoneyballburst onto bookshelves, it drew blowback from old-schoolers because it was,allegedly, “a book about a computer, that gives computer numbers.” In the decades since, the battle between stats and scouts has been resolved pretty peacefully: Scouting intelligence and tracking-derived data largely overlap and dovetail, and teams havehired more scoutseven as they’ve stocked up on statheads. These days, much of thebacklash to the book comes from fans and media members who lament thatMoneyballwas a Pandora’s box that moved up the timeline for sports being “solved” (and, in some respects, broken) and that it led to teams being lionized for suppressing payrolls. Throw inthebacklashtoLewisregardingThe Blind Sideand Sam Bankman-Fried, the roster truthers who correctly point out that the A’s employed better (but less narratively compelling) players than Chad Bradford and Scott Hatteberg, and the ways in which some of Beane’s dreamboats (Jeremy Brown) and bêtes noires (Carlos Peña) proved him wrong, and the book has, in some quarters, become a problematic fave in different ways than it was in 2003. ButMoneyballremains an extraordinarily readable book and an unsurpassably influential one. **Kemba Walker’s Stepback Buzzer-Beater in the Big East Tournament** Kemba Walker’s Stepback Buzzer-Beater in the Big East Tournament Kemba Walker’s Stepback Buzzer-Beater in the Big East Tournament How would you explain this moment to someone who’s never watched sports? UConn was a program of note by this point, but in the 2011 season they were young, and by this point they were floundering. The Huskies were at .500 in their conference and fighting to make it to the Big Dance. But they had Kemba Walker, and Kemba was a goddamn comet—a swaggering NYC-born guard who could create miracles. He led UConn to 11 straight wins that postseason and eventually the NCAA championship—though no victory was as indelible asthis one, on the biggest stage in the sport in Madison Square Garden, over the best team in the conference, via one of the most thrilling buzzer-beaters in NCAA history. Who is the unsung hero (or goat) of this moment? Poor Gary McGhee. There was no reason a guy as big as a rush end should’ve been guarding one of the quickest guards in the game that far out on the perimeter—especially since Brad Wanamaker, Walker’s primary defender, had clearly recovered from the screen in time to pick him back up at the top of the key. This play is now shown over and over again every March, which means witnessing the Pitt center not only stumbling to the floor like he’s learning how to roller-skate, but also turning his head just in time to see Kemba drill the shot. **Dez Caught It** Dez Caught It Dez Caught It How would you explain this moment to someone who’s never watched sports? It’s the playoffs. Lambeau Field. The never-won-anything 2010s Cowboys, led by their never-won-anything quarterback Tony Romo, are down five. It’s fourth-and-2. Romo throws it. Dez Bryant catches it. So we think. The Packers challenge the catch, and the refs overturn it. America learns some tremendously awkward phrases like “maintain possession throughout the process of the catch.” Who is the unsung hero (or goat) of this moment? Dez is the unsung hero. By a mile. What got lost was how crazy good his effort was and just how high the stakes were! (Never forget thepictureof Bryant lying on the Lambeau turf and holding the ball loosely in his arms.) Joe Bucksaid it in the moment… and then we started a national conversation about the rules. **J.R. Smith Runs Out the Clock in a Tie Game** J.R. Smith Runs Out the Clock in a Tie Game J.R. Smith Runs Out the Clock in a Tie Game How would you explain this moment to someone who’s never watched sports? Michelangelo is finishing his latest fresco,The Conversion of Saul.A splendid work from an artist at his apex.It is late. He is weary. He calls for his assistant.Fetch me a bowl of soup.The assistant—who has long complained ofblurred vision—returns, only to trip over his feet,launching the bowl of soupdirectly at the painting. The focal point—a beam of light emanating from Christ—is disfigured beyond recognition. Word of the inadvertent ruin spreads. The painting becomes iconic in its own right: no longerThe Conversion of Saul,butThe Conversion of Soup. What is the biggest “what if?” surrounding this moment? What if George Hill—who had the lifeless look of a man who wished to vacate his flesh prison when he was standing at the charity stripe for a potentially game-winning free throw—hadn’t bricked the second free throw? What if J.R. Smith had made an attempt at the rim over Kevin Durant after securing the offensive rebound? What if the Cavs had actually taken Game 1? What if the vibes were jubilant heading into Game 2 and team morale hadn’t suffered a massive hemorrhage? Perhaps nothing in the grand scheme would have changed: The 2018 NBA Finals had the most lopsided series odds in at least two decades, and the Cavaliers were swept by the Warriors, losing by an average margin of 15 points. Set aside altering the course of history—how might we have remembered this game if the Cavs had lost under even slightly more normal circumstances? Lost in the J.R. of it all is the fact that Game 1 was the greatest postseason scoring performance of LeBron’s career. In the 14 seasons before and the seven since, James has never surpassed the 51 points he scored against the 2018 Warriors juggernaut, whose inevitability no longer inspired awe but existential crises. As we inch closer and closer to what must be the twilight of LeBron’s legendary career, it feels increasingly important to frame these performances properly. No opponent has consistently pushed LeBron to the brink like the Warriors have; no team has consistently forced him to transform into a player he never wanted to become, to play a brand of basketball antithetical to his grand unified theory of the game. The Warriors saga of the mid-to-late 2010s shaped both his greatest success and most consistent failures. Dropping 51 in the Finals against one of the greatest teams ever is damn near an act of God. What if we remembered the moment as such? **Barry Bonds Hits No. 71** Barry Bonds Hits No. 71 Barry Bonds Hits No. 71 Rewatching this moment makes me ___________. … think of that summer, and the first time I can remember being in awe of an athlete. Barry Bonds dominated in a sport in which even the greatest hitters can be made to look like fools in most of their plate appearances. But it felt like Bonds was in control every time he stepped into the box, and that continued for a few years after this. I still visit hisBaseball-Reference pageevery so often and just marvel at how good he was from 2001 to 2004, when he won a record four consecutive MVP awards, but watching the clip of his 71st has a similar effect on me. How has the way this moment is viewed changed in the years since it happened? Well, you know. Barry Bonds still isn’t in Cooperstown, and after the veil was lifted on baseball's steroid era, many chose not to recognize him as MLB’s home run king. It hasn’t affected my view of Bonds’s legacy and my memories of the moment he hit his 71st. Bonds remainsmyGOAT, and that four-year stretch, which kicked off with the 2001 season, is still the most dominant run I’ve ever seen from an athlete. **Caitlin Clark’s Logo 3 Breaks the NCAAW Scoring Record** Caitlin Clark’s Logo 3 Breaks the NCAAW Scoring Record Caitlin Clark’s Logo 3 Breaks the NCAAW Scoring Record What is the most indelible image or quote from this moment? The “22 Clark” logo that’s been emblazoned on the floor of the Carver-Hawkeye Arena, in the spot—35 feet away from the rim—where Caitlin Clark pulled up against Michigan and became the all-time leading scorer in women’s basketball history, putting her on the map and elevating the game to new heights of popularity. In practice videos of her teammates lining up to take shots from there, she was the only one who ever made it. I imagine the freshman class has taken its shots, too, only to realize it’s too high a standard to aspire to consistently—but certainly something to be inspired by, a permanent reminder of the magical dust that Clark speckled around Iowa in the four years she was there. Rewatching this moment makes me ___________. … tingle. Imagine the kinetic energy, snowballing from game to game and broken record to broken record, accumulating finally in the one that mattered most: the NCAAW’s all-time scoring record, then held by Kelsey Plum. Clark not only met the moment but also surpassed it, shattering the all-time record within three minutes of the game, with her patented logo 3 no less, en route to a career-high 49 points, establishing herself as a showman of the highest order and turning the millions of fans who tuned in into permanent converts. **Scottie Scheffler Gets Arrested in the Morning, Shoots 5-Under in the Afternoon** Scottie Scheffler Gets Arrested in the Morning, Shoots 5-Under in the Afternoon Scottie Scheffler Gets Arrested in the Morning, Shoots 5-Under in the Afternoon Where were you when this moment happened? Trying to get into the very same PGA Championship, which was an absolute shit show. Patrons were supposed to park in downtown Louisville and take an hour-long bus ride to the course. Very few people had that information. Even fewer were willing to do it. We got turned away by a million traffic guards. When we heard that the top-ranked golfer on the PGA Tour had gotten arrested trying to make his tee time, it actually made perfect sense. It was like the PGA had hired the Fyre Festival guys to handle parking. PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers PGA Championship Recap: Xander Schauffele Secures First Major, Scottie Scheffler’s Arrest, and Winners and Losers What is the most indelible image or quote from this moment? This one is a tap-in … **Tim Tebow to Demaryius Thomas, 80 Yards to Win It in OT** Tim Tebow to Demaryius Thomas, 80 Yards to Win It in OT Tim Tebow to Demaryius Thomas, 80 Yards to Win It in OT Who is the unsung hero of this moment? Tim Tebow did the easy part, taking the first snap of overtime, rearing his left arm back and uncorking a pass that traveled about 34 yards in the air in a direct line to Thomas. But the receiver did the rest. Thomas, selected in the first round of the 2010 draft along with Tebow, caught the pass on the run, threw a brutal stiff-arm into the face of Pittsburgh cornerback Ike Taylor near midfield, and outran the rest of the Steelers defense to the end zone. It was a star-making moment for Thomas, who went on to become one of the greatest Broncos ever. We aren’t supposed to play favorites in this business, but Thomas was mine, and I’ll be forever grateful for the way he trusted meto tell his storythroughout his career. Thomasdied in 2021 at age 33. Where were you when this moment happened? If you slow down the video of Thomas running through the back of the end zone after the Broncos’ walk-off overtime touchdown against the Steelers, you’ll see a woman in a purple coat standing a few yards past the end line. That’s me. If you really zoom in, you’ll see my reporter’s notebook covering my face, hiding a look ofWhat in the world did I just witness? Apparently, I waslive blogging the game forThe Denver Post, but I have zero memory of emailing in the final update to my editor. I do, however, vividly remember rushing into the Broncos tunnel immediately after Thomas scored, and somewhere, I still have the blurry photo I took with my Blackberry of Champ Bailey and D.J. Williams hugging after they realized the game was over. This was the first overtime game since the league altered the rules for postseason overtime, ensuring that both teams would get a possession unless a team scored a touchdown on its first OT drive. **David Freese Puts St. Louis on His Back in the World Series** David Freese Puts St. Louis on His Back in the World Series David Freese Puts St. Louis on His Back in the World Series How would you explain this moment to someone who’s never watched sports? It’s impossible to overstate how unlikely it was that the St. Louis Cardinals would win the 2011 World Series. It was a minor miracle that they even qualified for the playoffs, having trailed Atlanta by 10 and a half games late in that season. Then they upset the Phillies in the first round of the postseason. Then the Brewers in the second. And in Game 6 of the World Series, they trailed the Rangersfive separate timesand were one strike away from eliminationtwice. Freese was the Cardinals’ third baseman, a hometown kid who was relatively anonymous until his scorching heater in that year’s playoffs. With two outs in the ninth, he tripled home the game-tying run to force extra innings. And in the bottom of the 11th inning, his homer to straightaway center capped off one of the best World Series games, one of the most improbable comebacks, and one of the most iconic postseasons in all of baseball history. Who is the unsung hero (or GOAT) of this moment? We have to say it: The GOAT is Nelson Cruz, whoprooooooobablyshould have caught Freese’s game-tying triple in the ninth. **One Yard Short, Super Bowl XXXIV** One Yard Short, Super Bowl XXXIV One Yard Short, Super Bowl XXXIV Who is the unsung hero (or goat) of this moment? If Titans receiver Kevin Dyson had turned that 7-yard slant from Steve McNair into an 8-yard touchdown, maybe nobody would have blamed Mike Jones outside of the St. Louis Rams locker room. Dyson appeared to have a step on Jones at the moment of the reception, which should have been enough for the score. But Jones closed quickly, wrapping his right arm around Dyson’s right leg and quickly bringing down the speedy receiver a few inches shy of the goal line. It was a spectacular play that preserved the Rams’ Super Bowl victory, but it was also the kind of ordinary efficiency that typified Jones’s workmanlike NFL career over 13 years. He totaled 620 tackles over those seasons, never more than 97 with Oakland in 1996. Jones’s professional longevity defies reason, given that he came into the league as an undrafted linebacker after tallying 2,076 yards of offense and 23 touchdowns as a running back at Mizzou. The Raiders asked Jones to change positions in rookie camp, moving him back to linebacker for the first time since high school. It was an inspired move, and Jones eagerly seized the opportunity. What is the most indelible image or quote from this moment? In the frozen frame of the dramatic final play of Super Bowl XXXIV, known to some as the Tackle, Dyson is making a valiant effort to escape a tackle and extend the football over the goal line. It’s not happening. Jones brings him down to the ground, a yard shy of the tying touchdown that could’ve sent the game into overtime. But the image of Dyson almost parallel to the ground, the ball hopefully thrust toward the end zone in his gloved right hand and his left elbow already touching the turf, was maybe the perfect full circle moment for Dyson and the Titans. It came 22 days after Dyson took Frank Wycheck’s lateral 75 yards for the game-winning touchdown against Buffalo, a play that breathed new life into the Titans’ postseason. That bit of goofy luck was a gift, and maybe it shouldn’t have counted if you think that Wycheck illegally lateraled the ball forward to Dyson. But this run ended at the 1-yard line in the Georgia Dome, with Dyson, his right arm, and the Titans coming up painfully short. It was, in its way, a beautiful—but futile—struggle. **A Drive Into Deep Left Field by Castellanos** A Drive Into Deep Left Field by Castellanos A Drive Into Deep Left Field by Castellanos How would you explain this moment to someone who’s never watched sports? There’s a lot of lore here, so, ideally, I’d direct them to thethousandsof words I once wrote about it (link below). But, briefly: Nick Castellanos, ahimboslugger for the Reds, hit a homer just as broadcaster Thom Brennaman was delivering an on-air apology for an anti-gay slur he’d uttered hours earlier, which was caught on his hot mic. Interrupted by the blast, Brennaman paused his apology to provide play-by-play. The solemn monologue that sandwiched the score update, juxtaposed with Brennaman’s business-as-usual, mid-mea-culpa call, created an absurd spectacle of cringe comedy that spawned one of baseball’s most enduring mainstream memes. How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How “A Drive Into Deep Left Field by Castellanos” Became the Perfect Meme for These Strange Times How has the way this moment is viewed changed in the years since it happened? For one thing, Castellanos’s unwittingly incredible comic timing pulled focus from the slur itself; the two are intertwined, but for better or worse, this moment is remembered more for the homer and humor than for Brennaman’s disgrace. (Although Brennaman didn’t put onthatheadset again, he has wornother ones.) For another, as the copypasta took on a life of its own and broke baseball containment, Castellanos kept going yard duringsomberbroadcastmoments, which extended the meme’s lifespan—though, in my mind, the jokejumpedthesharkwhen itmorphedto encompass any Castellanos homer hit on the day of any unrelated tragic event. **The Best Worst Sports Moments of the Quarter Century** While coming up with the list of thebestsports moments, we couldn’t escape the unforgettable inglorious moments—the cheating scandals and the salacious sports-adjacent tabloid fodder that became some of the defining stories of the quarter century. Doping? Game fixing? Anal beads (allegedly)? Catfishing? Infidelity? Social media hacking? You get the vibe. This isn’t a place for horrific injuries or serious crimes, but the feel-bad moments we’ll never forget: The 2002 Kings lose to the Lakers … and maybe the refs:Look, ifTim Donaghy,who knows a thing or two about fixing games,is saying the Kings got “robbed,”maybe there’s something to the theory that Game 6 of the Western Conference finals was, well, rigged. The Lakers attempted 18 more free throws than the Kings in the fourth quarter alone (never forget Mike Bibby beingcalled for a foul after getting elbowedin the face by Kobe Bryant). The Lakers would go on to win the game, the series, and, ultimately, the NBA championship. The Kings, meanwhile, are still waiting for their first title since 1951. The Astros bang the trash can:Back in 2020, myRingercolleague Brian Phillips perfectly described Houston’s scheme to use video technology to steal signs and relay the incoming pitch by banging on a trash can from the dugout as “a rickety-ass scandal.” Five stars. No notes. This wasn’t some highly sophisticated act of cheating, no cool spy shit here. And yet, the bangs worked, and the Astros’ 2017 World Series title will always be tainted. Lance Armstrong winssevenzero yellow jerseys:Livestrong, my ass. Armstrong was the most dominant cyclist in the world at the start of the century and had won seven Tour de France titles when he retired as an American hero—with an inspiring story of surviving cancer—in 2005. Five years later, after Armstrong had unretired and returned to racing, former teammate Floyd Landis admitted to doping and accused Armstrong of cheating, too. Armstrong spent years denying the accusations before finally coming clean in 2013, admitting to doping throughout his Tour de France reign from 1999 to 2005. “This story was so perfect for so long. It’s this myth, this perfect story, and it wasn’t true,” Armstrong told Oprah Winfrey. Barry Bonds and BALCO:Bonds became baseball’s new home run king in the early aughts (read all about him hitting dinger no. 71 to break Mark McGwire’s single-season record on our main list!), but, like McGwire, he is now remembered as one of the faces of baseball’s steroid era because of his role in the BALCO scandal involving his trainer, who allegedly provided anabolic steroids to a number of professional athletes across multiple sports. Bonds was indicted in 2007 on charges of perjury and obstruction of justice for allegedly lying under oath about steroid use. Bonds never failed a drug test and maintains he never knowingly took steroids. Deflategate:We had a few Patriots scandals to choose from here. While the Spygate name was certainly catchier (and the Aaron Hernandez saga wassignificantlydarker), Deflategate made for a very weird chapter in NFL history. It really had everything: accusations that the league’s biggest star was cheating, a destroyed cellphone, the ideal gas law, a courtroom sketch for the ages, and so, so many jokes about deflated balls. Manti Te’o gets catfished:Nev Schulman could only dream of a catfish tale this juicy: Lennay Kekua, Manti Te’o’s girlfriend, died tragically from leukemia in 2012. The Notre Dame linebacker didn't miss any games because he promised her to keep playing before her death (which was the subject of thousands of words in sports media). Turns out, Lennay Kekua was a hoax. She simply never existed. In January 2013, about a month after Te’o finished as the Heisman Trophy runner-up and days after playing in the national championship game,Deadspindropped its bombshell report detailing how Te’o had been duped, catfished by an acquaintance. Laremy Tunsil and the gas mask bong:Tunsil was the presumptive no. 1 pick in the 2016 NFL draft but tumbled down the draft board after a video of him taking a giant bong rip while wearing a gas mask was posted on Twitter hours before the draft began. Take a deep breath and let that sink in: He was smoking weed out of a gas mask. Honestly, impressive ingenuity! Joke’s on the rest of the league though: Tunsil has gone on to have a solid NFL career, and, at one point, he was even the league’s highest-paid offensive tackle. Tiger Woods, tabloid star:What does the name Rachel Uchitel mean to you these days? Probably stirs up memories buried deep in your brain about the days in the late aughts and early 2010s when you were just as likely to read about Woods onPage Sixas you were inSports Illustrated. First there was the Thanksgiving incident in 2009, when his then-wife, Elin Nordegren, discovered Tiger's infidelity and chased him out of their house with, you guessed it, a golf club. From there, Tiger was tabloid gold, as affair after affair was uncovered, and the image of Woods as golf’s Golden Son was forever tarnished. Hans Niemann cheats (we think?) in chess:It would be scandalous enough that a young American chess grand master, Hans Niemann, was accused of cheating. But throw in rumors that a sex toy was involved? That, friends, is arealscandal, even if the part about the anal beads was never found to be true. Naomi Osaka beats Serena Williams:When does a huge win feel like a loss? Naomi Osaka’s first Grand Slam title should have been celebrated. Instead, because Osaka was playing against her idol, Serena Williams, in the twilight of the tennis GOAT’s career, in a match marred by questionable officiating, fans at the U.S. Open booed throughout the game, and Osaka ended the match in tears, with Williams consoling her. **Mario Chalmers’s 3 Ties the National Championship Vs. Memphis** Mario Chalmers’s 3 Ties the National Championship Vs. Memphis Mario Chalmers’s 3 Ties the National Championship Vs. Memphis Who is the unsung hero (or goat) of this moment? It’s a miracle that Kansas gotanyshot off given how the possession started. Sherron Collins took the inbounds pass and was able to get past Derrick Rose just after half court, but Collins was moving too quickly and lost his balance by the time he needed to make a pass. Instead of the dribble handoff that was designed, Collins had to make a highly difficult pass going against his momentum. Somehow, he connected while also picking off Chalmers’s defender, Antonio Anderson, in the process. That freed up Chalmers for a wide-open shot to send the game to overtime. What is the biggest “what if?” surrounding this moment? I think about this a lot: What if John Calipari had instructed his Memphis team to foul before Mario Chalmers could get his game-tying shot off? How would that have changed the trajectory of modern college basketball? I can’t imagine Cal leaving Memphis—even for Kentucky—after winning a national title. Surely a major conference would have scooped up Memphis if it had title-winning pedigree, which would have had implications for the school beyond the world of basketball. Instead, Memphis is stuck in the declining AAC. I have no ties to the school and even I’m still pissed that Cal didn’t do the correct thing and foul. **The Miracle of Istanbul** The Miracle of Istanbul The Miracle of Istanbul How would you explain this moment to someone who’s never watched sports? The matchup between Liverpool and AC Milan in the 2005 Champions League final was a true David and Goliath situation. On the one hand, you had AC Milan, an Italian powerhouse with a who’s who of legendary players in the starting XI: Paolo Maldini, Andrea Pirlo, Kaká, and Andriy Shevchenko. On the other hand, there was Liverpool, who sputtered to a fifth-place finish in the Premier League. AC Milan had raced to a 3-0 lead by halftime, and their Champions League coronation seemed like a foregone conclusion. But in the second half, Liverpool scored three goals in the span of seven chaotic minutes before winning on penalties. It was a comeback so unexpected that everyone now literally calls it a miracle. Who is the unsung hero (or GOAT) of this moment? Three goals in seven minutes is the headline of Liverpool’s comeback, but the Reds wouldn’t have triumphed on penalties if it weren’t for Polish goalkeeper Jerzy Dudek. In the 117th minute of extra time, Dudek pulled off a double save on Shevchenko,the second of which defies logic. Afterward, Dudek said that he was inspired by Pope John Paul II, a fellow Pole who died the month before the final. In a nod to Diego Maradona’s infamous “Hand of God,” Dudek dubbed his save the“Hand of Pope.” **Luis Gonzalez’s World Series Walk-off** Luis Gonzalez’s World Series Walk-off Luis Gonzalez’s World Series Walk-off How would you explain this moment to someone who’s never watched sports? The Yankees won the World Series in 1996, 1998, 1999, and 2000. The Diamondbacks didn’t even exist until ’98. The Yankees, buoyed by big feelings in the wake of September 11, came back from a two-game deficit in the series to go up 3-2, even though they were down to their last outs in Games 4 and 5. Following a loss in Game 6, they took a 2-1 lead in the eighth inning of Game 7 and gave the ball to the best closer ever. And then, in defiance of all evidence that fate favors the Yankees, the Diamondbacks won. Where were you when this moment happened? Falling to my kneesin front of a tiny CRT TV in my mom’s bedroom, bursting into tears, and then continuing to blubber in the bathtub like someone who’d just suffered a bad breakup. I don’t expect anyone to feel sorry for 14-year-old me: When one’s most painful sports memory is narrowly losing the World Series on the heels of a three-peat and four titles in five years, one doesn’t deserve deep sympathy. Close to 25 years—and zero Yankees losing seasons—later, I’m almost grateful for the life lessons I learned from that fateful blooper (namely, you can’t win ’em all, anddon’t draw the infield inbehind a bat-breaking pitcher with a lefty at the plate). The tough-luck loss saved me from any chance of turning into the type of fan who thinks their team is always entitled to victory, even if it requiresripping the ballout of an opposing player’s mitt. In the moment, though, after all that had transpired in New York that September, October, andNovember, my main character syndrome, sadness, and self-pity were strong. My mom also acted aggrieved: Thanks to Tony Womack, Luis Gonzalez, and, perhaps,Sandy Alomar Jr., she to this day holds the incandescent take that Mariano Rivera was a choker. She must have missed Mo’s memo aboutblaming Scott Brosius. **Ambush: The Saints Onside Kick It After Halftime, Super Bowl XLIV** Ambush: The Saints Onside Kick It After Halftime, Super Bowl XLIV Ambush: The Saints Onside Kick It After Halftime, Super Bowl XLIV What is the most indelible image or quote from this moment? “You got some big balls. I’m telling you. You set the record.” NFL Films caught Sean Payton talking to Jim Nantzafter the postgame trophy presentation. Payton explained that his mentor Bill Parcells told him that you have to have big balls to win the Super Bowl. Nantz, apparently, was quite impressed with Payton’s ballsiness. For a 48-hour news cycle, there was an uncomfortable amount of discussion about the size of Payton’s testicles. Who is the unsung hero of this moment? Saints linebacker Jonathan Casillas. There are varying accounts of who actually recovered the ball. The official box score credits Casillas, butan ESPN deep diveon the play credits safety Chris Reis, who had the ball in his hands when the refs finally awarded it to the Saints. Regardless, Casillas made a huge play. “I always tell people the unsung hero of the play, without a doubt, is Jonathan Casillas,” punter Thomas Morsteadtold ESPN. “He ran all the way across the field and speared Hank [Baskett]. Chris had the ball between his legs, and [Baskett] made a play on it, and Jonathan just freakin’ smoked this dude.” Indeed, replays showed that the Saints didn’t recover the ball cleanly. After Baskett fumbled it, the ball was still loose, and as he made a second effort, Casillas came over, jumped on the pile, and drilled him. Without that effort, the Colts might have recovered, and maybe takes would still be flying about how reckless Payton was to make that call. **Derek Fisher, 0.4 Seconds** Derek Fisher, 0.4 Seconds Derek Fisher, 0.4 Seconds What is the best behind-the-scenes anecdote about this moment? Fisher, a staple of the Lakers three-peat, had been relegated to the bench for most of this season (and would walk in free agency, to Golden State, over the summer). In fact, everything seemed out of place for the Lakers: Kobe Bryant spent the year flying back and forth from Colorado, where he was on trial for sexual assault; Kobe and Shaquille O’Neal regularly clashed over control of the team, among other things; Phil Jackson was rumored to be eyeing a departure; and Gary Payton, then 35, and Karl Malone, 40, decided to jump into the mud with all of them, forming one of the oddest superteams (and, ultimately, an unsuccessful one). But in a big spot against the Spurs in the Western Conference semifinals, Jackson turned to Fisher, although not to take the shot. This was actually the third play the Lakers ran—the first two were nixed by timeouts, but all appeared designed for Kobe. When Kobe was doubled on the final attempt, the ball went to Fisher—who nowcreditsPayton, the inbounder, for getting it to him and not forcing it to a star. Who is the unsung almost hero of this moment? Tim Duncan, who made what would’ve been a historic bucket right before this—a fadeaway push shot going against the direction of his momentum, from just above the free throw circle, with Shaq so all over him that Duncan could barely see the basket and stumbled headfirst into the hardwood as the ballwent through the net. But as O’Neal famously said after the game, “One lucky shot deserves another.” **The Bush Push** The Bush Push The Bush Push Rewatching this moment makes me ___________. … appreciate Reggie Bush and USC for the once-in-a-lifetime era they gave us. The push was the story of the 2005 game between USC and Notre Dame, and both Bush and Matt Leinart are immortalized in football history because of it. But there’s an argument that Bush had the most impactful game of his college career that night, and it never gets discussed. He finished the game with 195 yards of offense on 19 touches, scored three touchdowns, and was responsible for a fourth. USC was going for a three-peat at the time, and both rosters were as stacked with NFL talent as any you’ll ever come across. These Trojans will always be in the conversation for having one of the most dominant three-year stretches we’ve ever seen, and they might have had the greatest run ever if they hadn’t lost to Texas in the Rose Bowl. If they were in a one-game situation against the other greatest teams in the sport since 2000, I’d confidently take USC against the field—as long as Vince Young wasn’t standing on the other side. What is the biggest “what if?” surrounding this moment? This one is fairly obvious: Would USC have scored and won on third-and-goal if Leinart had spiked the ball instead of running the sneak? As the years have passed since the Bush Push, Leinart and former head coach Pete Carroll have been resolute that the expectation was always for Leinart to try for a touchdown, but I call bullshit. Carroll was signaling for the spike, and Leinart checked with the sideline for confirmation several times. I’m sure I’ve listened to or read every retelling of the play that exists on the internet, and the only person in USC colors who I believe was certain about taking the chance was Bush—and he’s the one who made sure it worked by bailing out an awful sneak attempt from Leinart. **George W. Bush Throws a First-Pitch Strike at the 2001 World Series** George W. Bush Throws a First-Pitch Strike at the 2001 World Series George W. Bush Throws a First-Pitch Strike at the 2001 World Series What is the most indelible image or quote from this moment? This is arguably the last moment in U.S. history when every American, regardless of political persuasion, looked to the president as a unifying symbol of something greater and higher. And in that moment, President Bush delivered. For any nonathlete, throwing a baseball directly into a waiting glove 60 feet and 6 inches away is much, much harder than it seems. To do so while wearing a bulletproof vest, with the entire country watching, while being the commander in chief of a wounded, grieving nation ups the difficulty quite a bit. The nice, easy, confident path that Bush’s pitch took directly into Todd Greene’s glove was exactly what millions of Americans needed to see that night in 2001. How has the way this moment is viewed changed in the years since it happened? There is not enough space to go into the complex emotions I feel when rewatching this in 2025. I was not a fan of Bush’s politics, but I did join the last great American political monoculture in the months after 9/11. I remember the great unity and determination that washed over the nation. To sit here now and consider all that has happened to rend this country apart during the rest of the Bush administration and the four administrations since is profoundly sad. I cannot imagine a similar great coming together during our next national tragedy. **Pete Weber: “Who Do You Think You Are? I Am!”** Pete Weber: “Who Do You Think You Are? I Am!” Pete Weber: “Who Do You Think You Are? I Am!” Rewatching this moment makes me ___________. … want to celebrate every win as loudly as possible. I tied my tie the correct length on the first try? I’m looking straight in the mirror and asking myself Weber’s famous rhetorical question. Got the Wordle in fewer than three tries? I’m sending my family group chat the evidence accompanied by an all-caps “WHO DO YOU THINK YOU ARE? I AM!” message. Hit the game-winning 3 in a pickup basketball game? You guessed it. Weber’s quote will never make grammatical sense, but it will always feel right rolling off the tongue. What is the best behind-the-scenes anecdote about this moment? It’s easy to get distracted by Weber’s theatrics and forget that he was an inner-circle Hall of Fame bowler. In fact, the strike he made in this famous clip gave Weber a record fifth U.S. Open title, breaking a tie with his father, Dick, who was a founding member of the Professional Bowlers Association. The more you know! **The Dunk of Death** The Dunk of Death The Dunk of Death What is the most indelible image or quote from this moment? After he saw Vince Carter pull off the greatest dunk of the new millennium, Doug Collins—calm, cool, and collected—said, “Now you see why Frédéric Weis is going to play in Greece. He doesn’t want to see that on a nightly basis.” That’s right: Weis wanted to play in Greece not because of the sheer beauty and proximity to the hillsides of Santorini, or the legendary functions on Mykonos, or the vibey tranquility of Crete. No, he wanted to hide out there for the rest of his life because he knew the image of Vince Carter sending him into another realm would follow him for the rest of his days. Doug, you’re diabolical for this, and I can’t stop laughing. What is the biggest “what if?” surrounding this moment? What if Vince had jumped higher? What if he’d bumped his head on the roof of the building before the thunderous jam? Would he need stitches? How would you describe that on the next game’s injury report? “Vince Carter is a game-time decision because for three whole seconds, he became Superman reincarnate, and he is now recovering after receiving two stitches and a minor concussion.” Yeah, that sounds about right. Honorable mention: What if Vince’s celebratory fist pump had connected with Kevin Garnett’s face? Would KG just eat the punch and continue celebrating with VC, or run the fade on sight? I’ll take my call offline. **The Tuck Rule** The Tuck Rule The Tuck Rule What is the most indelible image or quote from this moment? Referee Walt Coleman, announcing the change in call on the field: “After reviewing the play, the quarterback’s arm was going forward. It is an incomplete pass.” The tuck rule stated that when a quarterback was holding the ball to pass, “any intentional forward movement of his arm starts a forward pass, even if the player loses possession of the ball as he is attempting to tuck it back toward his body.” It was wordy language that rarely came up and had been codified in the NFL rule book only two years earlier—although the Patriots were familiar with it because they’d lost a Week 2 game against the Jets in which Drew Bledsoe was injured in part because of a similar play by their defense that wound up invoking it. All that, combined with the fact that the play looked so much like a fumble on first glance, meant that chaos ensued. The Raiders were celebrating and Phil Simms was trying to remember the name of the rule on the broadcast before Coleman revealed the fateful conclusion of the review that allowed New England to retain possession. Holy Tuck Holy Tuck Holy Tuck Holy Tuck Holy Tuck Holy Tuck How did this moment change sports? The tuck rule game kick-started the Patriots dynasty, but it was also a watershed moment for replay review, which was fairly new in 2001. The NFL first used replay in 1986, but in 1991 the owners voted to stop using the system, which they didn’t think was getting all the reviews right. It was reinstated in 1999, after Vinny Testaverde’s quarterback sneak was improperly ruled a touchdown in a Jets-Seahawks game—one that knocked Seattle out of the playoffs and got the whole coaching staff fired—because an official mistook Testaverde’s helmet for the ball crossing the plane. But the tuck rule was the highest-profile test of the new system. NFL director of officiating Mike PereiratoldThe Ringerin 2017that his phone blew up almost immediately as he watched from his Saint Louis hotel room (having already gone through half a bottle of wine from room service) ahead of a Rams playoff game the next day. The call, which might have been technically right but felt wrong, is a good stand-in for our relationship with replay review, which has become a bigger part of the NFL-watching experience since then. The tuck rule itself was eliminated in 2013. But for nearly a decade after that game, Pereira said that every fax he got from the Raiders came with a still photo of Brady with two hands on the football, seeming to have it tucked as a runner. **Steph Curry Puts France to Sleep in the Gold Medal Game** Steph Curry Puts France to Sleep in the Gold Medal Game Steph Curry Puts France to Sleep in the Gold Medal Game Rewatching this moment makes me ___________. … laugh? Throw my hands up? Recite the Pledge of Allegiance? With under three minutes to play in the gold medal game, Team France had pulled to within three points of the Americans, threatening not only to win the tournament but to torpedo a victory lap for Team USA’s old guard of Curry, LeBron James, and Kevin Durant. From there, Steph hit four more 3s, each more absurd than the last. His final deep ball—the “Golden Dagger”—is simultaneously the most preposterous shot I’ve ever seen and the perfect encapsulation of the greatest, most audacious shooter to ever walk the earth. Steph Curry Put a Golden Era for Team USA to Bed Steph Curry Put a Golden Era for Team USA to Bed Steph Curry Put a Golden Era for Team USA to Bed Steph Curry Put a Golden Era for Team USA to Bed Steph Curry Put a Golden Era for Team USA to Bed Steph Curry Put a Golden Era for Team USA to Bed Who is the unsung hero (or GOAT) of this moment? Shout-out to Durant, who in the moments preceding the Golden Dagger—mini shout-out to Noah Eagle, another unsung hero, on the call—caught the ball at the top of the key and had LeBron wide open on the left wing. But instead of swinging the ball to the NBA’sall-time leading scorerin hisfavorite spoton the court, Durant kicked it back to Curry on the right wing. The rest is literally history. **Kris Jenkins’s National Championship Buzzer-Beater** Kris Jenkins’s National Championship Buzzer-Beater Kris Jenkins’s National Championship Buzzer-Beater Who is the unsung hero (or GOAT) of this moment? It’s the duo of the premature confetti cannons (who among us, am I right?) and the production worker who decided to put a mic in the vicinity of said cannons. The sonic intensity of that explosion on the broadcast is one of the funnier things I’ve ever seen in a basketball game. On rewatch, I laughed so hard, I pulled an abdominal. It sounded like someone invited Crazy Harry from the Muppets to a children’s birthday party. It sounded like one of those industrial drum kits on a MIDI pad that you’d stop on for a second as you scrolled through the presets before saying, “Oh, God, that’s awful.” In any other situation, of course, the cannon should go off when the buzzer sounds, but this was a buzzer-beating bucket in the national championship game. This has happened only four times in history. So while the cucumber coolness under pressure of Jay Wright and his team made it all seem like familiar territory, I will be the apologist for the confetti operator and say that this was a pretty unprecedented situation. How has the way this moment is viewed changed in the years since it happened? We knew Villanova was on a roll at the time and that they’d curated their talent really well, but their style of play was getting a lot of credit for their success. They didn’t seem to be riding the wave of glaring NBA talent. Watching the game now, your eyes dart to the fact that there were three heavy-contribution New York Knicks on the floor together. In 2016, if I’d said, “One player in this game is going to get a max contract in the NBA, and another will someday be traded for five first-round picks,” how long would it have taken you to guess that I was talking about Jalen Brunson and Mikal Bridges? Goes to show you never can tell. **The Butt Fumble** The Butt Fumble The Butt Fumble How would you explain this moment to someone who’s never watched sports? Perhaps the most embarrassing moment in American sports history? It was the centerpiece of a nightmare scenario in which the New York Jets, in a nationally televised Thanksgiving game, fumbled three times in 52 seconds, each incident leading to a touchdown by the New England Patriots, their hated rival. The final act was Mark Sanchez, on a blown play, running directly into the posterior of lineman Brandon Moore, pancaking him backward and losing possession, resulting in a third TD. It’s an evil, ignominious moment in Jets history. I’m being held against my will, forced to write these words at knifepoint by aRingereditor. A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday A Decade of Butt Jokes and Misery, It’s the Butt Fumble’s Birthday Rewatching this moment makes me ___________. … want to drink bleach. **LeBron James Drops 25 Straight in the Eastern Conference Finals** LeBron James Drops 25 Straight in the Eastern Conference Finals LeBron James Drops 25 Straight in the Eastern Conference Finals How would you explain this moment to someone who’s never watched sports? LeBron James is 40 years old and currently winding down the most impressive career in NBA history. When he was in high school, there was an unfathomable amount of hype for what he could eventually become, and somehow, he exceeded all of it. In this game, achievement and spectacle collided with a budding mythology to form his very first inflection point. It was a signal to everyone who loves basketball that all preconceptions and projection had to be thrown out the window. When you account for age, stakes, and what he was up against, no one ever accomplished what LeBron did that night. How has the way this moment is viewed changed in the years since it happened? It’s simultaneously the stuff of legend and, somewhat tragically, lost to history. LeBron has done enough remarkable stuff since 2007 to make an otherwise historic performance in Game 5 of the Eastern Conference finals seem humdrum. But when he does actually, finally, eventually retire, there’s a good chance 22-year-old (!) James efficiently dropping 48 points in what, up to that point, was by far the most important game of his life will shine through and get the appreciation it deserves. All this time later, it still doesn’t feel like someone actually did that. **The Flip** The Flip The Flip What is the biggest “what if?” surrounding this moment? If Derek Jeter doesn’t make a miraculous heads-up play, a butterfly flaps its wings, and baseball history changes. First and foremost: The Athletics probably would have won this series. They were up 2-0 in a best-of-five, Jeremy Giambi’s run would have tied Game 3, and the Athletics were at home. And if Oakland had advanced to the ALCS that year instead of New York, three additional moments on this top 100 list wouldn’t have happened. First, President George W. Bush wouldn’t have had the opportunity to throw out a post-9/11 first pitch before a World Series game in New York. Second, Luis Gonzalez wouldn’t have become a World Series hero against Mariano Rivera. And third, an A’s postseason run in 2001 might have changed the tenor ofMoneyball, which detailed the events of and strategies behind Oakland’s 2002 season. (For instance, would Giambi’s brother Jason, the Athletics’ brightest star, have signed with the Yankees in free agency after the 2001 season if his A’s had just defeated the Yankees?) Billy Beane’s famous “My shit doesn’t work in the playoffs” line would have been moot if ithadworked in the playoffs a year earlier! And that’s to say nothing of the fact that, after surviving against Oakland, the Yankees went on to upset the record-tying, 116-win Mariners in the ALCS. If Jeter’s flip hadn’t helped propel New York to that point, perhaps Seattle would have gone on to win the World Series and complete the greatest single season in MLB history. Rewatching this moment makes me ___________. … wonder why Jeremy Giambi didn’t slide. He probably would’ve been safe! **Tua Tagovailoa and Alabama Beat Georgia in Overtime** Tua Tagovailoa and Alabama Beat Georgia in Overtime Tua Tagovailoa and Alabama Beat Georgia in Overtime How would you explain this moment to someone who’s never watched sports? Sometimes the grass really is greener, and sometimes people really can change. Alabama’s Nick Saban—college football’s greatest head coach, Little Debbie’s enthusiast, and curmudgeon—made the stunning decision to go against everything he had long stood for by replacing veteran starting quarterback Jalen Hurts with unproven true freshman backup Tua Tagovailoa at halftime of the national championship game against Georgia. The result was a comeback for the ages—punctuated by a walk-off overtime score that will live on forever. How has the way this moment is viewed changed in the years since it happened? When Tagovailoa uncorked his triumphant 41-yard pass to DeVonta Smith, it seemed like the start of a limitless future: This was the arrival of football’s next legendary quarterback, and the birth of the most dominant version of the Crimson Tide that anyone had ever seen. Only it wasn’t. Tagovailoa got injured in each of his next two seasons in Tuscaloosa—he hurt his quad and ankle in late 2018, and dislocated his hip in a terrifying hit in 2019—and never reached the apex of college football again. Tua’s injury trend continued in the NFL; he’s gone down with three concussions as a member of the Miami Dolphins, becoming the poster child for how the leaguefails to protect its playersrather than the generational star he was projected to be during his time on campus. In a way, though, Tagovailoa’s trajectory makes the national title moment all the more poignant. None of us knows what the future will hold. Nothing is certain. But what comes next can never take away from what was. Second-and-26. Touchdown. **Allen Iverson Steps Over Tyronn Lue** Allen Iverson Steps Over Tyronn Lue Allen Iverson Steps Over Tyronn Lue What is the best behind-the-scenes anecdote about this moment? One: Lue and Iverson are close friends, and have been for years. Two: As Luetold me in 2016, the Stepover “made me famous” and Iverson “saved my career.” In 2001, Lue was a fringe rotation player for the Lakers and on the verge of free agency. Coach Phil Jackson put Lue on the playoff roster for his speed and defensive tenacity—in anticipation that they might face Iverson. He played sparingly through the first three rounds of the playoffs, then took on a starring role in the Finals. “Iverson making it to the Finals really saved my career,” Lue told me. “Without Iverson, there probably wouldn’t be me.” How has the way this moment is viewed changed in the years since it happened? Lue wasn’t the victim of a killer Iverson crossover, as so many seem to believe based on the image (or faulty memory). He leaped forward to challenge the shot, then landed, turned, and tripped over Iverson’s foot. The Stepover is viewed as an image of triumph—but that shot and that Game 1 victory was the last moment of success the 76ers had. The Lakers won the next four games to take the title. **The Best Press Conference Quotes of the 21st Century** A lot of the top sports moments of the 21st century are probably what you thought they would be. That’s why we made the damn list. Now if you want to crown us, then crown our ass. The moments are what we thought they were, and we let ’em off the hook! Now we’re on to Cincinnati—all right, you get the idea. In addition to the best sports moments, we wanted to make a list of the best player and coach quotes of the past 25 years. Get your popcorn ready. Here are our top 20: “Practice?! We talkin’ about practice, man!” —Allen Iverson(2002) “I’m just here so I don’t get fined.” —Marshawn Lynch(2015) “The playoffs?! Don’t talk about playoffs!” —Jim Mora Sr.(2001) “We’re on to Cincinnati.” —Bill Belichick(2014) “What’s there to be happy about? Job’s not finished.” —Kobe Bryant(2009) “Take care of y’all chicken. Take care of y’all mentals.” —Marshawn Lynch(2020) “They are who we thought they were!” —Dennis Green(2006) “You the real MVP.” —Kevin Durant(2014) “You play to win the game.” —Herm Edwards(2002) “That’s my quarterback.” —Terrell Owens(2008) “Ha ha ha.” —Kawhi Leonard(2018) “I don’t know what JR was thinking.” —LeBron James(2018) “I’m not going to the fucking White House.” —Megan Rapinoe(2019) “I want winners!” —Mike Singletary(2008) “Both teams played hard.” —Rasheed Wallace(2003) “That’s a clown question, bro.” —Bryce Harper(2012) “Reports of my demise were premature.” —Shane Battier(2013) “I’m a man! I’m 40!” —Mike Gundy(2007) “I got Wheaties!” —Metta Sandiford-Artest(2010) “We’re going to bite a kneecap off.” —Dan Campbell(2021) **Katie Ledecky Dominates the Pool in Rio** Katie Ledecky Dominates the Pool in Rio Katie Ledecky Dominates the Pool in Rio How would you explain this moment to someone who’s never watched sports? Oftentimes, we watch sports for the unpredictability, the thrill of witnessing a competition in which anything is possible. Other times, though, the enjoyment comes from observing pure domination. We know which athlete or team will win; the question is simply by how much. That was the experience of watching Katie Ledecky at the 2016 Summer Olympics in Rio. It was her second Games—at her first, she became the United States’ breakout star when she stunningly won the 800-meter freestyle at 15 years old. By Rio, she was well on her way to establishing herself as the most dominant American female swimmer ever. Once there, she won four golds: She had individual wins in the 200-, 400-, and 800-meter freestyles (and set two individual world records) and led the U.S. to one relay title. And she made each swim look effortless with her long, powerful strokes, separating herself from her competition with each pull. She won the 200 by .35 seconds, the 400 by 4.77 seconds, and the 800 by a whopping 11.38 seconds—nearly tripling her margin of victory from London. What is the biggest “what if?” surrounding this moment? As dominant as Ledecky was in the middle- and long-distance freestyle events in Rio, she didn’t get to swim her best event, the 1500-meter freestyle, because it wasn’t included in the program of swimming events for women until the 2021 Games in Tokyo. There is no doubt that she would have won that race, too—and no competitor would have been close. In 2016, Ledecky was already the world record holder in the event, having swum 15:25.48 a year earlier. In 2018, in her first race as a professional, she lowered that record by about five seconds. She owns the 21 fastest times ever in the women’s 1500-meter free and 24 of the 25 fastest. Because she’s been so dominant for so long, it’s hard to pinpoint her exact athletic peak, but we can only wonder what she could have done in the 1500 in Rio, when there was absolutely no one capable of catching her. **Randy Johnson Kills a Bird** Randy Johnson Kills a Bird Randy Johnson Kills a Bird What is the biggest “what if?” surrounding this moment? What if the bird had been bigger? It makes sense that the feathers would explode right off a dove. They’re small. But say it’s an eagle or a falcon or something. Some big-time bird of prey. Like, a vulture isn’t going to just combust on impact, right? What is the best behind-the-scenes anecdote about this moment?Johnson studied photojournalism while in college at USC. After his 2010 retirement from baseball, he threw himself back into photography. He has his own website where he displays the work he’s shot through the years. Pics from African safaris, Motorhead concerts, trips to Japan, etc. The site’slogo? A dead bird. **Game 6 Klay** Game 6 Klay Game 6 Klay Where were you when this moment happened? Hostile work environs, asking a Thunder fan to write about this. Whatever, I’m numb to the night now. I feel nothing. I’m lying. Anyway, I watched this bullshit at a bar in Princeton, New Jersey. I was there for my wife’s college reunion. Made friends with the bartender and drank myself into a froth. First, in celebration. Then, in agony. I was almost arrested for public urination on the way home and ended the night face down at my in-laws’ apartment, naked in the guest bathroom, using a bath mat as a cot and a towel as a pillow. OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 OKC-GSW, Game 6 2016 (a ‘Rewatchables’ Flashback With Chris Ryan and Joe House) | Book of Basketball 2.0 How did this moment change the future of sports? If Klay Thompson hadn’t gone on a heater that night, the Thunder would have won the game and the series and played Cleveland in the Finals. Maybe they would have won a ring, maybe they wouldn’t have. Maybe getting there would have been enough to satiate Durant’s wandering eyes for another couple of years. The two Warrior titles with Durant never would have happened, and the most explosive offensive lineup of all time never would have actually been realized. **Zinedine Zidane Headbutts Marco Materazzi in the World Cup Final** Zinedine Zidane Headbutts Marco Materazzi in the World Cup Final Zinedine Zidane Headbutts Marco Materazzi in the World Cup Final What is the most indelible image or quote from this moment? There are two images, really. The first is the actual sight of Zidane headbutting Materazzi, a moment that would have blown up social media if it had happened a decade later. But I’d argue the more meaningful image comes after, when Zidane—an all-timer on the precipice of retiring on the ultimate high note—makes his way off the pitch and walks past the World Cup trophy. A perfect, heartbreaking representation of “so close, yet so far.” What is the best behind-the-scenes anecdote about this moment? Whether you watched the headbutt unfold in 2006 or are learning about it for the first time, you probably have the same question: What on earth did Materazzi say to prompt Zidane toheadbutt himin a World Cup final? At the time,The Daily Mailfalsely claimedthat Materazzi aimed racial slurs at Zidane’s mother, who is Algerian, which ultimately led to the outlet paying damages to the player. Finally, in 2020,Materazzi revealedwhat really happened. After a coming together in the Italy penalty area, Zidane told Materazzi that he could have his shirt at the end of the game, to which Materazzi responded: “I’d rather have your sister.” Not exactlyclassy, but pretty standard trash talk in the heat of battle, and hardly the kind of vile abuse that the tabloids claimed. Also, despite the infamous headbutt, Zidane still won the Golden Ball, the award given to the best player at the World Cup. **The Steve Bartman Incident** The Steve Bartman Incident The Steve Bartman Incident What is the most indelible image or quote from this moment? It’s gotta be the headphones! In the various photos and footage from October 14, 2003, Steve Bartman, 26, sits miserably in the left field stands at Wrigley Field, watching his Cubs unravel after he bobbled a foul ball that flew his way in the eighth inning (and pissed off Chicago outfielder Moises Alou in the process). He is wearing a green turtleneck, youth baseball sweatshirt, and Cubbies cap, but it’s the headphones that are the cruelest detail of all. On any other day, they’d be an inside-baseball tell that Bartman is the kind of pure-nerd fan that makes the sport go round. But as the Cubs melted down in front of him, Bartman’s headphones made him an easy, recognizable target for all the monocultural mockery about to come his way, from Halloween costumes toThe Simpsons. Poor guy was just trying to hear the play-by-play, not become the talk of the town. How has the way this moment is viewed changed in the years since it happened? The Chicago Cubs didn’t just break the Curse of the Billy Goat when they won the World Series in 2016. They also wrote a kinder, gentler ending to one of the uglier chapters in the franchise’s history when they reached out to Bartman, the summer after winning the title, to offer him a (private!) visit to Wrigley anda personalized World Series ringof his very own. “No gesture can fully lift the public burden he has endured for more than a decade,” said the Cubs in a statement, but they sure did try. In written remarks of his own, Bartman said: “I humbly receive the ring not only as a symbol of one of the most historic achievements in sports, but as an important reminder for how we should treat each other in today’s society.” He also declined all further interviews.Some things never change. **Freddie Freeman’s World Series Walk-Off Grand Slam** Freddie Freeman’s World Series Walk-Off Grand Slam Freddie Freeman’s World Series Walk-Off Grand Slam How would you explain this moment to someone who’s never watched sports? Consider all the cheesy, embarrassingly inspirational story lines you’ve heard be connected to sports—the comeback, the last-minute win, the injured hero overcoming the odds—and then imagine it all happening in the same split second. Even before Freddie Freeman had completed his swing, an entire, vast fandom knew that the impossible had happened (again, but we’ll get to that in a moment). What is the most indelible image or quote from this moment? “Gibby! Meet Freddie!”Joe Davis, not only Fox’s national announcer for the World Series but also the lead announcer for the Dodgers during the regular season, elegantly and wisely tied this moment to the most famous World Series home run hit before this one: Kirk Gibson’s walk-off homer against the Athletics in Game 1 of the 1988 World Series—itself the beneficiary of alegendary callby Davis’s immortal predecessor, Vin Scully. **The Music City Miracle** The Music City Miracle The Music City Miracle Rewatching this moment makes me ___________. By the time Steve Christie booted his 41-yarder through the uprights with 16 seconds left in the wild-card playoff game, I had convinced myself that I was finally over the Houston Oilers. Buffalo had done it to us again in the playoffs. Imagine willingly being a fan of an NFL team tormented bytheBuffalo Bills.A franchise that didn’t even play in your hometown anymore. Sheer idiocy. But no more. For those of us who never stopped luving the Columbia blue, this was an excellent opportunity to step away for good. Then came the kickoff, the Frank Wycheck lateral (that was behind the line, please save the whining!), Kevin Dyson making a catch that looked deceptively easy and taking off down the left sideline, and the interminable replay review that confirmed the 75-yard return that clinched the Titans’ 22-16 win. Can you blame me for falling hard, again? I had forgotten that a football team could make me feel good, that it could sometimes achieve what seemed impossible. And that it happenedtoBuffalo? Even better for us woebegone Oilers fans. They know what they did. Where were you when this moment happened? Somehow, despite the best efforts of my hard-won common sense, I was crestfallen in my old childhood bedroom in Houston over yet another NFL postseason letdown against Buffalo. I was a 21-year-old college senior who lived four hours away now, no longer a child whose emotional state yo-yoed with the fortunes of the Houston Oilers. When the Oilers coughed up the largest lead in NFL history to Buffalo in 1993, I was ruined for a whole week. When they traded away Warren Moon the next year, I rooted against them in protest. When the Oilers left town in 1996, I resolved never to care about them again. But here I was, watching those zombie Oilers, now the Tennessee Titans, trailing the Bills 16-15 with 16 seconds left in the game. Then came the kickoff, and I ventured outside my room to watch on the larger heavy-bottomed TV in the living room. I yelled in that living room, as I had for so many years of my childhood, for Earl Campbell, for Moon, and for a brief beautiful moment, Steve McNair and Eddie George and Jevon Kearse. It was so hard to stop Luving the Blue. Nashville, that moment was mine, too. **Simone Biles’s All-Around in Paris** Simone Biles’s All-Around in Paris Simone Biles’s All-Around in Paris Rewatching this moment makes me ___________. … feel lucky to have been alive for the Simone Biles era. As sports fans, we use the phrase GOAT too liberally. By definition, there can be onlyone. And when it comes to gymnastics, that one is Biles. She’d already earned that title before the 2024 Summer Olympics in Paris, but her performance in the all-around competition there, at age 27 and in what might be her last major competition, was the exclamation point on one of the greatest athletic careers we’ve ever seen. She changed the sport in countless ways as she won 11 total Olympic medals, two all-around golds, and 30 world championship medals while reinventing what is possible in sport. Her pure athleticism, artistry, creativity, and bravery may never be matched. In Paris, Biles made the women’s all-around competition a must-see event—even some of America’sothermost famous Olympians, the NBA stars of the men’s basketball team, showed up to watch in person. Yet despite her GOAT status, it was no sure thing that she would win, and she even trailed Brazil’s Rebeca Andrade after two rotations. But Biles took the lead after a near-perfect beam routine, setting up what was essentially a victory lap on the floor. The opening bass beats of Taylor Swift’s “... Ready for It?” boomed in the arena, and Biles took off into the most difficult tumbling pass ever attempted by a female gymnast, capped by a Biles II—a double backflip with three twists, a skill so difficult that she’s the only female athlete who can pull it off. What is the best behind-the-scenes anecdote about this moment? Three years earlier, Biles withdrew from the Tokyo Olympics after experiencing the “twisties”—a scary experience in which a gymnast loses their bearings in the air—and essentially quit the sport at age 24. She didn’t officially retire, but it was fair to wonder whether we’d ever see her in a major competition again. Indeed, it would be two years before she returned to competition. And although by the time she got to Paris she had proved that she was still the best gymnast in the world, she still had to do it on the world’s biggest stage, when the spotlight was the brightest. The Tokyo twisties, and the way Biles prioritized her well-being and became a vocal advocate for mental health in the years after, provided the backdrop for her comeback in Paris. **The Kobe-to-Shaq Alley-Oop** The Kobe-to-Shaq Alley-Oop The Kobe-to-Shaq Alley-Oop What is the most indelible image or quote from this moment? Shaq running back up the court, mouth agape, pointing with both fingers to his family in the stands, then leaping into his teammates’ arms. Where were you when this moment happened? Sitting in the baseline press seats as a beat writer for theLos Angeles Daily News. Our view was the same as the most iconic camera angle of the play—facing the far basket, watching from behind as Kobe crossed over Scottie Pippen and threw the lob that Shaq flew in to slam home. In the split second when Kobe first rose up, both his Lakers teammates and the Trail Blazersthought he was going up for a shot. **16-Seed UMBC Takes Down Virginia** 16-Seed UMBC Takes Down Virginia 16-Seed UMBC Takes Down Virginia How did this moment change sports? For one, it was probably the most significant sign of the rising talent level across the sport and the shrinking gap between the strongest traditional powers and the smaller schools. The full embrace of the 3-pointer and the constant race to better space the floor had completely changed the previously unwinnable argument that came with facing off against the biggest and fastest athletes available only to the elite programs. Ryan Odom’s UMBC squad played with a speed and skill that did not look out of place against Virginia, their constant movement—particularly their roll-and-replace concepts—made UVA’s bigs look lost on defense, and Virginia’s players panicked when they had to erase the deficit that their deliberate offensive style had created. With 80 years of NCAA tournament history in their rearview, and UMBC not only proved that this could be done, but also effectively ran a four-minute mile and created the belief that it could happen again. Fire had been stolen from the gods, and now the lid was off: Five years later, 16-seed Fairleigh Dickinson slung a stone and struck down Purdue (a shot bounced off the rim and literally hit Zach Edey in the forehead at one point). It’s no longer a question of whether or not it can happen. It’s a matter of when it’ll happen again. What is the biggest “what if?” surrounding this moment? One does wonder whether Jairus Lyles could have unleashed hell to the tune of 28 points on 9-for-11 shooting had De’Andre Hunter, billed as a perimeter stopper, not been injured during the ACC tournament the week before. Hunter is an NBA veteran now, but at the time, he hadn’t started a single game for UVA and was not among their major contributors. Typically, when the no. 1 seed loses a player, it becomes clear when they square off against another power. If one rotation player is the difference in a 20-point loss to a 16-seed, what does that say, exactly? It might say that Virginia lived by forcing their opponents to play their style, and that balance was a lot more precarious than their season had made it seem.Virginia showed some fortitude by answering with a “we’ll see” attitude that lingered in the following season, when they ran it back and won the title, which tempts you to speculate that such a catastrophic loss was causal, in a way. I doubt it, but the reality is that Kyle Guy and Co.hadto come back and climb all the way up the mountain to wipe away some of the misery of that loss. **The First Double Bang: Steph Curry’s Heave Beats the Thunder** The First Double Bang: Steph Curry’s Heave Beats the Thunder The First Double Bang: Steph Curry’s Heave Beats the Thunder What is the most indelible image or quote from this moment? “They do have a timeout, decide not to use it. Curry, way downtown! BANG! BANG!” It might not be a purely scientific grading process, but there are few better expressions of NBA excitement than announcer Mike Breen’s “BANG!” scale. And it’s fitting that Breen gave his first double bang to Steph Curry, in the midst of perhaps the greatest and most exciting offensive season the NBAhas ever seen. Golden State’s 2015-16 campaign might have ended in ignominy—see a certain entry much higher on this list—but it’s impossible to overstate the nightly entertainment that team provided. The defending champion Warriors started 24-0 and won a record 73 games, and reigning MVP Curry set a still-standing record with 402 made 3-pointers en route to becoming the only player in league history to be unanimously voted MVP. The peak of that magical regular season was this moment, in which Curry polished off a 46-point night with a double-bang-worthy winner. How did this moment change sports? Curry changed his sport more than almost any other basketball player in history. The season before Curry’s unanimous MVP campaign, NBA teams averaged 24 3-point attempts per game; now they’re up to 37 per game, a rise of nearly 70 percent in just a decade. Every NBA game looks different in 2025 than it did in 2015, and Curry’s the main reason why. As part of the broader 3-point boom, more players have imitated Curry’s embrace ofdeep3s, like his game-winner from “way downtown” against the Thunder.According to Stathead, before 2015-16, no player had ever taken more than 16 shots in a season from between 30 and 40 feet away. But Curry attempted 31 such shots in 2015-16, nearly doubling the previous record, and the copycat league was off to the races. In the 2020s, hotshot guards have routinely takendozens of long 3severy year, with Trae Young and Damian Lillard each reachingtriple digitsin 30-foot attempts multiple times. **LSU vs. Iowa, Angel Reese vs. Caitlin Clark** LSU vs. Iowa, Angel Reese vs. Caitlin Clark LSU vs. Iowa, Angel Reese vs. Caitlin Clark How would you explain this moment to someone who’s never watched sports? Have you seenGodzilla vs. Kong,where the whole time they’re beating the breaks off each other but then they reconcile at the end and form a kind ofgrudging truce? This was that—with moreshit-talking, bettercharacter arcs, and a more satisfying conclusion. What is the most indelible image or quote from this moment? It has to be the “You Can’t See Me” handgestureby Angel Reese, followed by the “Ring Me” gesture. The former had a whole new generation feverishly googlingJohn Cena, and the latter is the peak of trash-talking supremacy and a staple of modern-day LSU championships. Even if more chapters have been added to the story since, in this moment Reese basically said, “I heard all the attention you’re getting, but don’t sleep on who the REAL winner is here.” **The Immaculate Interception, Super Bowl XLIII** The Immaculate Interception, Super Bowl XLIII The Immaculate Interception, Super Bowl XLIII Who is the unsung hero (or goat) of this moment? The most underdiscussed piece of James Harrison’s 100-yard pick-six in Super Bowl XLIII is the legendary group of Steelers defenders that contributed to it like aFast & Furiouscrew pulling off a bank heist to smuggle Harrison into the end zone. Harrison probably ran a 4.85-second 40-yard dash, and it took himFIFTEENseconds to run the entire length of the field. It took a village. None of it would have happened if not for a handful of Steelers legends chopping down oncoming tacklers like oak trees. Look at the namesin this video! Ike Taylor! Ryan Clark! Deshea Townsend! LaMarr Woodley! Lawrence Timmons! Brett Keisel! What is the biggest “what if?” surrounding this moment? If we had the modern refereeing technology of 2025 back in 2009, there would’ve been a legitimate chance that Harrison would be called down at the 1-inch line and this would become the greatest blue ball pick-six in NFL history. The Pick If? The Pick-Six-ish? The Pick Miss? **Kobe Bryant Drops 81** Kobe Bryant Drops 81 Kobe Bryant Drops 81 Rewatching this moment makes me ___________. … cackle. The word “awestruck” is too clean. From Kobe’s unrelenting and immaculately precise jump shots, to the inert defensive scheme that was deployed to slow him down, to the fact that he had “only” 61 points halfway through the fourth quarter and then was mentally unable to take his foot off the gas, to theensuing blame gameand basketball trauma the event inflicted upon everyone who was on the other side, all you can do is laugh. What is the most indelible image or quote from this moment? This quotefrom Raptors forward Chris Bosh: “We were just watching him shoot.” **Sergio Aguero Scores in ET, and Manchester City Win the Premier League** Sergio Aguero Scores in ET, and Manchester City Win the Premier League Sergio Aguero Scores in ET, and Manchester City Win the Premier League What is the most indelible image or quote from this moment? “Manchester City are still alive here! Balotelliiii … AGUEROOOOOOOOOOOOO!!! I SWEAR YOU’LL NEVER SEE ANYTHING LIKE THIS EVER AGAIN! SO WATCH IT, DRINK IT IN. They’ve just heard the news at the Stadium of Light! Two goals in added time for Manchester City to snatch the title away from Manchester United—STUPENDOUS!!!” The call from Martin Tyler, the explosion of noise from the crowd—it’s the best “stadium celebrating” sound I’ve ever heard. How did this moment change sports? The European Super League was born on this day. No, but really, we all know how this story goes: Manchester City, with the aid of foreign investment, pluck themselves from relative obscurity to become powerhouse perennial title winners. They dominate the next decade-plus and establish themselves among Europe’s footballing elite. They go on to attract world-class talent like manager Pep Guardiola, who revolutionizes the style of play in the Premier League. Manchester City continue to spend without abandon. And now the club faces115 charges of breaching financial fair play rules. It’s been a wild ride, to say the least, but hey, we’ll always have 90:00 +3:20. **Steve Gleason Blocks the Punt in the Saints’ Return to the Superdome** Steve Gleason Blocks the Punt in the Saints’ Return to the Superdome Steve Gleason Blocks the Punt in the Saints’ Return to the Superdome How would you explain this moment to someone who’s never watched sports? The Louisiana Superdome—which functioned as a shelter and haven for displaced New Orleans residents during Hurricane Katrina—suffered extensive damage from the storm, leaving the Saints without a home field for the entirety of the 2005 season. In their first game back in New Orleans in 2006, the Saints faced the Atlanta Falcons and, within two minutes, took the lead on Gleason’s blocked punt and Curtis DeLoatch’s subsequent scoop-and-score. In the box score, the touchdown counted for six points in a relatively meaningless early-season game. But in reality, it was a cathartic moment for the city and team, offering hope and healing for a fan base eager to celebrate in the wake of a life-changing natural disaster. What is the most indelible image or quote from this moment? The crowd shots of Saints fans after DeLoatch recovered the blocked punt and fell into the end zone. The joy, the relief, the pain, the nirvana. It’s all there when you look closely. **Gordon Hayward’s Prayer Rims Out Versus Duke** Gordon Hayward’s Prayer Rims Out Versus Duke Gordon Hayward’s Prayer Rims Out Versus Duke How would you explain this moment to someone who’s never watched sports? A scrawny 20-year-old from Indiana almost hit the greatest shot in college basketball history—a half-court heave at the buzzer to beat Duke in the NCAA title game in hishometown. It just rimmed out. What is the biggest “what if?” surrounding this moment? What if it had gone in? It would have been the greatest upset and Cinderella story in college basketball history. To win a national title, at the buzzer, in your hometown, on a half-court shot, as a frickin’ 5-seed mid-major … damn. **Appalachian State Beats Michigan** Appalachian State Beats Michigan Appalachian State Beats Michigan How did this moment change the future of sports? Let us count the ways. For one, Appalachian State’s victory set the stage for the most chaotic college football season of all time. 2007 is widely known as the Year of the Upset, and no upset was bigger than an unheralded FBS team from Boone, North Carolina, taking down the fifth-ranked team in the AP poll in front of 109,000 people. For another, this result preceded several seismic shifts in the coaching landscape. Longtime Michigan coach Lloyd Carr retired at season’s end. West Virginia coach Rich Rodriguez replaced him. Thus began one of the worst stretches of Michigan football history, and culminated in the school tapping Jim Harbaugh to restore the program to its former glory. But the most lasting way this game changed the future of sports is even bigger. Michigan–Appalachian State was the first game broadcast by the Big Ten Network, which at the time wasn’t even carried by Comcast. The App State upset helped legitimize the nascent network, expediting distribution, sparking a conference TV land grab, and accelerating the realignment arms race that has gone on to reshape the entire structure of the sport. What is the most indelible image or quote from this moment? The image of Appalachian State’s Corey Lynch sprinting toward the end zone after the blocked field goal that clinched the win. As time on the game clock expired, play-by-play man Thom Brennaman—yes, that Thom Brennanman—delivered the call that sealed it: “Appalachian State has stunned the college football world! One of the greatest upsets in sports history!” **The Minneapolis Miracle** The Minneapolis Miracle The Minneapolis Miracle What is the most indelible image or quote from this moment? “DIGGS … SIDELINE … TOUCHDOWN!” I’m not a huge Joe Buck guy, but I have to give him credit for his call of the Minneapolis Miracle: he was ready for the moment and met it with an effective call that is still burned into my brain. It was a moment of redemption for Buck after he failed to properly capture the excitement of David Tyree’s helmet catch. Really, his most famous call up until this point may have been him calling Randy Moss’s fake mooning of a Packers fan a “disgusting act.” But this—this wasn’t just a great call; it may have been a legacy-defining call for one of this generation’s most notable play-by-play announcers. How did this moment change the future of sports? To this day, I’msurethat the New Orleans Saints were the best team of the 2017 NFL season. And if they had just gotten past the Vikings, they would have beaten the Eagles in Philly and then an underwhelming Patriots team in the Super Bowl. Imagine a world in which the Eagles don’t win that Super Bowl and then things go south with Carson Wentz and Doug Pederson. There’s no statue of Nick Foles outside of the stadium, and we’d have a far worse name forThe Ringer’s Philly sports pod. **Leicester City Wins the Premier League** Leicester City Wins the Premier League Leicester City Wins the Premier League Who is the unsung hero (or goat) of this moment? Let’s give a hand to my man Christian Fuchs, not only for having an objectively phenomenal last name, but also for patiently waiting until Matchday 8 to break into the team, only to lead the league in interceptions from that point onward and help Leicester keep the joint-most clean sheets for the rest of the season—on the way to the most unlikely title in … all of sports history? How has the way this moment is viewed changed in the years since it happened? As time has gone by, and the Premier League has more or less been dominated by two teams—Manchester City (four titles in a row) and Liverpool (about to win a second in five years)—we can only marvel even moreathow in the hellLeicester pulled this off. Especially as we witness present-day Leicester get smacked up on a weekly basis on its way to a second relegation in three years. What’s changed is the faintest glimmer of belief that something like this could ever happen again. It probably won’t, so appreciate this monumental achievement and rejoice that we got to experience it even once. **Verstappen Overtakes Hamilton on the Final Lap** Verstappen Overtakes Hamilton on the Final Lap Verstappen Overtakes Hamilton on the Final Lap What is the biggest “what if?” surrounding this moment? What if Michael Masi had gotten his decision right? It was December 2021; Lewis Hamilton and Max Verstappen were battling it out in the last race of the Formula One season, and the winner was set to take home F1’s ultimate prize. Hamilton was out in front late in the race, but a Nicholas Latifi crash (we miss you,GOAT) brought out the safety car, and from there, shit hit an industrial-strength fan. There are hundreds ofdetailedbreakdownsabout what followed, but suffice it to say, Verstappen pitted for fresh tires under the safety car, allowing multiple lapped cars to get between himself and Hamilton; F1 race director Michael Masi let only those cars unlap themselves (which was later ruled to be against regulation, asalllapped cars must be able to unlap themselves); Masi pulled the safety car early to allow the drivers to complete the race’s last lap at speed; and Verstappen passed Hamilton and took the championship from him in the process. In a sport that sees upward of 1,200 racing laps a year, the 2021 championship came down to the very last one—and the“human error”of the man in charge. Had Masi not allowed the cars to unlap themselves, Hamilton would have won his eighth World Drivers’ Championship, breaking the tie with Michael Schumacher for most of all time. Or, had Masi allowedallunlapped cars through, and not just those between Hamilton and Verstappen, Hamilton still would have won because the race would have been over by the time those cars were clear. Instead, Masi made one of the most controversial rulings in sports history—and reshaped the future of F1 in the process. How did this moment change sports? The FIA investigated Masi’s ruling and found he had erred in his interpretation of the rules. Masi left his role as race director and is now an infamous name in global racing circles. F1 also went on to institute some rule changes,clarifying itsprocedure around lapped cars under a safety car. But distrust of the FIAlingers. Even though Verstappen was, in a number of ways, a worthy champion that season, most fans acknowledge that Hamilton’s eighth title was stolen out from under him. And he hasn’t had another shot at a title since: Mercedes fell off after new car regulations were introduced in 2022, Hamilton and the team struggled to find success, and now he’s moving on to Ferrari, hoping for one last chance to break the tie with Schumacher and top the F1 driver hierarchy once and for all. **Sidney Crosby Scores the Gold-Medal Goal in OT Versus Team USA** Sidney Crosby Scores the Gold-Medal Goal in OT Versus Team USA Sidney Crosby Scores the Gold-Medal Goal in OT Versus Team USA How would you explain this moment to someone who’s never watched sports? Here are 87 words (the ceremonial unit of measurement when honoring Sidney Crosby): It was sudden death in the men’s hockey final at the 2010 Vancouver Olympics, and the fellas defending home ice were under some real pressure, eh? Team Canada had been 25 seconds away from gold when the Americans forced overtime; a loss would have been a real blow to the whole Canadian national psyche. Then 22-year-old Sidney Crosby—the country’s most hyped hockey player since Wayne Gretzky—seized the day and scored the goal that won the gold! And lo, all was right in that part of the world. Who is the unsung hero (or goat) of this moment? Crosby’s nifty wrister was, obviously, a huge part of the then-22-year-old Sid the Kid’s growing body of lore. (It was part of a remarkable 26-month span for Crosby, who also captained the Pittsburgh Penguins to back-to-back Stanley Cup Finals in 2008 and 2009, winning the latter, and scored thepicturesque game winnerin the league’s inaugural Winter Classic.) But it was Jarome Iginla’s grit along the boards and squeaker of an assist that set Crosby and Canada up for Olympic success. According toSports Illustrated,Crosby asked only one teammatein Vancouver for an autographed stick: Iginla. **Tiger Woods Wins the U.S. Open on One Leg** Tiger Woods Wins the U.S. Open on One Leg Tiger Woods Wins the U.S. Open on One Leg What is the most indelible image or quote from this moment? There are two, and they happened simultaneously. Woods needed to make a birdie on the tournament’s 72nd hole to tie Rocco Mediate and force an 18-hole playoff. He had a 12-foot birdie putt in front of him, and after making contact, he began to slowly stalk backward. His eyes were locked in, he crouched lower and lower, and when the ball sank to the bottom of the hole, he let loose an almighty double-fist pump that signaled both triumph and relief. It’s one of the most iconic images in all of golf—and NBC commentator Dan Hicks’s call couldn’t have been more perfect. “Expect anything different?!” Absolutely not. How has the way this moment is viewed changed in the years since it happened? For nearly 10 years, it looked like this U.S. Open might be the last major championship Tiger Woods ever won. His life—and reputation and career—took a major turn just a few months later, and his game and health were never the same. There were thePage Sixexposés; the neck, leg, and back injuries; the car accidents; the surgeries; the painful statements and press conferences; and the dwindling hope that he could ever return to the Tiger fans once thought they knew—the guy who went 14-of-14 when he entered a major championship Sunday with a share of the lead and could engender roars the likes of which golf courses had never heard before. Fortunately for Tiger—and for us—we got one more return to glory. But for a good, long while, this one-legged masterpiece was thought of as possibly the final feather in the cap of the greatest golfer of all time. **José Bautista’s ALDS Bat Flip** José Bautista’s ALDS Bat Flip José Bautista’s ALDS Bat Flip How would you explain this moment to someone who’s never watched sports? The 2015 Toronto Blue Jays might be the 21st century’s most fun baseball team; in the midst of a leaguewide offensive drought, Toronto scored 127 more runs than any other team. And its funnest moment came in the decisive fifth game of a playoff series against Texas, when slugger José Bautista, the beating heart of that immensely entertaining Blue Jays squad, hammered a go-ahead, three-run homer. As the Rogers Centre crowd exploded and Bautista’s teammates streamed out of the dugout in celebration, Bautista himself paused to admire his launch—and fling his bat halfway to Nova Scotia. Who is the unsung hero (or GOAT) of this moment? The full seventh inning of this game is one of the wildest in baseball history. In the top of the inning, Texas took a one-run lead on abizarre, never-before-seen blunderfrom Blue Jays catcher Russell Martin, whose toss back to the pitcherricocheted off the batof Rangers hitter Shin-Soo Choo and allowed a runner on third base to scamper home. Toronto’s fans were so upset that they rained trash onto the field. But the tide reversed in the bottom of the inning, thanks to unsung GOAT Elvis Andrus, Texas’s shortstop. Martin stepped to the plate as the leadoff hitter, and Andrus bobbled his grounder. Then Andrus couldn’t corral a throw, allowing a second runner to reach base. Then Andrus fumbled athirdconsecutive play, dropping a dart from future Hall of Famer Adrián Beltré and allowing the Blue Jays to load the bases. All of those errors set the stage for Bautista’s Brobdingnagian blast. **The Odell Beckham Jr. Catch** The Odell Beckham Jr. Catch The Odell Beckham Jr. Catch What is the most indelible image or quote from this moment? The two angles of the catch—one a photo by the Associated Press, the other from the broadcast—were instantly iconic. (I even stumbled on the picture at a photo exhibition in Barcelona.) Only Cowboys and Giants fans remember that the Giants lost this game. People were just obsessed with the catch—more specifically, obsessed with thepicturesof the catch. I am not sure whether any athlete has reached a higher level of celebrity from a photograph alone. Soon afterward, Odell had the most Instagram followers of any NFL player. He was living in Drake’s house (which I swear was cool at the time). In a sport where guys wear helmets, Odellinspired an entire hairstyle. How did this moment change sports? I can’t stress this enough: Receivers used to catch with two hands. Then Odell made the catch, and everyone started using one hand. Odell’s pregame routine of one-handers became the football version of Steph Curry’s warm-ups, and now you see every receiver under 25 trying to catch one-handed passes while pushing the cornerback off with the other hand. The level of receiving in the NFL is better than ever. There is a catch every week that, 20 years ago, would have been the catch of the year. I am convinced that a large part of that is simply because of how many younger receivers were inspired to try ridiculous catches because of Odell. This one play influences every NFL game you watch—and most college and high school ones, too. **Boise State Trick-Plays Its Way Past Oklahoma** Boise State Trick-Plays Its Way Past Oklahoma Boise State Trick-Plays Its Way Past Oklahoma How did this moment change sports? When the WAC champs beat the Big 12 champs, something shifted that could not be ignored. Boise State ended the season 13-0, undefeated and having tackled a squad that, while certainly vulnerable throughout its tale-of-two-halves season, was as fitting a poster team as any in the sport for the guardian of yesteryear, the blue-chip, blue-blooded big boy who simply existed in a different stratosphere of consideration from the blue-turf upstarts. The debate over whether a program like Boise should merit consideration in an undefeated season for a spot in the championship game was not new, but Boise’s 43-42 victory doused that narrative ember in kerosene. In the wake of the Fiesta Bowl, pundits routinely invoked George Mason’s run to the Final Four the year prior—only to note that what Boise had done signaled something more substantial. Yes, Statue Left was another installment in the great underdog annals, but it felt less like a stunning fluke than like a harbinger of a new era that could no longer be kept at bay. The staunchest opponents to the inevitable arrival of a college football playoff might have pointed to the three trick plays (a hook-and-lateral and receiver-passing touchdown preceding the Statue of Liberty) as signs that Boise needed gimmicks to compete or that first-year head coach Chris Petersen’s gall and guts propelled his team to something that obscured the 28-10 lead they’d just blown. But after this game, those defenders were standing at the gates with crumbling shields in their hands, and everyone could feel it. What is the most indelible image or quote from this moment? Boise quarterback Jared Zabransky pump-faking with his empty right hand toward the three-receiver cluster to his right while sticking his left arm, ball in hand, behind his back for the shrouded handoff is one of the most memorable images in college football history, the kind of Magician’s Hot Assistant distraction tactic that makes you pause and go frame by frame to spot how it all worked so smoothly. So how can it not be the most memorable image from the game? Cut to Boise running back Ian Johnson, fresh off the winning two-point scurry into the end zone, going down on one knee during his nationally broadcast postgame interview to ask his girlfriend, Boise cheerleader Chrissy Popadics, to marry him. He did it without a ring because he planned to propose to her postgame onlyif a surely impossible series of outcomes unfolded. It did. So he asked, and she said yes, and they both smiled as widely and purely as two people can. It’s the kind of moment that, even to non-Boise fans, captures a certain organic confluence of good fortune and cheer, joy mounting and compounding and crystalizing into the most memorable night of a lifetime. **The Quarter Century’s No-Moment All-Stars** How is Kevin Dyson on this list twice but Peyton Manning doesn’t appear at all? Some athletes just don’t have amoment. Even some players with multiple rings. Even some with Hall of Fame careers. Even some who are on the Mount Rushmore of their sport. Our Best 100 Sports Moments celebrates singular events of extraordinary wonder and achievement (and also the Butt Fumble!)—and it’s possible to have a career that encompasses those attributes but no one moment that does. Here are the 12 greatest athletes of the quarter century that didn’t make this Top 100, not in order: Roger Federer.Federer does technically make this list, but it’s for the 2008 Wimbledon final—when Rafael Nadal beat him. Fed’s greatness is what makes the moment so memorable, but it isn’thismoment. Peyton Manning.What’s the best Manning moment? His first Super Bowl victory is best remembered for Devin Hester’s opening kickoff return. In his second, he could barely throw the ball. I tried to getthe time he beaned kids onSaturday Night Liveadded to the list but was outvoted. Tim Duncan.Despite his five championships, it shouldn’t be too surprising that a guy nicknamed “The Big Fundamental” didn’t have many “holy shit” highlights. He did once getejected from a game for laughing, though, and I don’t want anyone reading this to forget that. Cristiano Ronaldo.There are supercuts on YouTube that go100 goals deep. But no one moment that truly rises above the rest (and yes,The Ringer’s American bias may be showing here). Novak Djokovic.Look, if Federer didn’t have his own moment on this list, it’s not a surprise that Djokovic didn’t make it, either. Mike Trout.It’s not really his fault, but Trout has played in only three postseason games in his career. It took a lot for regular-season baseball moments to make the list. Diana Taurasi.Six Olympic gold medals, three WNBA championships, three NCAA championships. She has maybe the clearest case for being the GOAT in women’s basketball history—but not really one career highlight to point to. Aaron Donald.Hisfourth-quarter pressure on Joe Burrowwon Super Bowl LVI for the Rams. But there are alotof great Super Bowl moments on this list already. Nikola Jokic.He’s the best player of his generation, which is amazing because it’s not really clear whether he likes basketball. His reaction to winning the NBA championship? “The job is done. We can go home now.” Albert Pujols.Unlike Trout, Pujols had some notable postseason success—including two World Series victories. Histhree-run home run in Game 5 of the 2005 NLCSwith the Cardinals down to their last out is probably his career highlight … but St. Louis went on to lose the series. Kevin Garnett.Garnett’s “anything is possible” clip helped define the 2008 Celtics. Although since this isThe Ringer, we were probably closest to pickinga scene of his fromUncut Gems. In the end, neither made the cut. Kevin Durant.If his shoes were a half size smaller,he’d have made the list. **The Serena Slam** The Serena Slam The Serena Slam How would you explain this moment to someone who’s never watched sports? The GOAT of tennis did the most GOAT thing in 2003, becoming one of six women in the Open Era (after 1968) to win all four major championships. And because she held all four titles at once, the feat was given its own title: the Serena Slam. What’s more, Serena completed this in a final against her sister Venus, who brought out the best in her in a way that no one else could. While Serena won the singles tennis title, she had to work for every point. What is the most indelible image or quote from this moment? Serena hardly ever let opponents see her emotion. But after winning the Australian Open and completing the Serena Slam, she couldn’t help herself. In her acceptance speech, Serena broke into tears of joy and said: “I never get choked up. Never! But I’m really emotional right now and I’m really, really, really happy, and I’d like to thank my mom and my dad for always supporting me. Thanks.” **The Beast Quake** The Beast Quake The Beast Quake How would you explain this moment to someone who’s never watched sports? When you’re watchingthis all-timer of a game-sealing run, one piece of context you need is that Marshawn Lynch has his own Marvel-esque superhero origin story. Accordingto his mother, Delisa Lynch, her son absorbed the placenta of an undeveloped twin in utero and was nourished by both; the midwife told her at the time that Marshawn might turn out to be an “amazingly strong child.” This is something the hapless defenders on the Saints probably should’ve been made aware of before the play went down. How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever How Marshawn Lynch’s “Beast Quake” Run Changed the Seahawks Forever What is the most indelible image or quote from this moment? Mike Mayock’s “GET OFF ME!” line from the broadcast’s replay still gets played whenever you see a stiff-arm go down. But there’s simply no way of topping Lynch’s iconic “Hold my dick!” pose as he flew into the end zone. **Go, Go, USA: The Landon Donovan Goal** Go, Go, USA: The Landon Donovan Goal Go, Go, USA: The Landon Donovan Goal What is the most indelible image or quote from this moment? Three simple yet perfect words: “Go, Go, USA!” There’s no voice more closely associated with United States soccer this century than Ian Darke. I’ve memorized every word of his iconic call of Donovan’s goal—the moment that American men’s soccer had long waited for—but those three words are the oneseveryoneremembers. Darke adds “you could not write a script like this,” as the Americans pile on top of one another, before letting the moment breathe and the swarm of vuvuzelas and crowd cheers take over the broadcast. Darke is English, but he’s worked with ESPN and called so many MLS and U.S. national team matches over the years that the American Outlaws, the U.S. fan club, have a chant for him that goes, “Ian Darke, you are a Yank.” The images of Tim Howard pounding the ground in celebration and the players’ dogpile at the corner flag will always be remembered, but this is the rare time when the greatest call meets the greatest moment. Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Landon Donovan, 2010, and a Breakthrough Moment for American Soccer Where were you when this moment happened? I credit most of my sports fandom to my dad. He owned a dive bar in South Philly about 1.5 miles from the Sports Complex for most of my childhood—the kind of place where the Eagles are basically a religion. A child of divorce, I spent a few weeks with him every summer. I watched countless sports moments at that bar, but none bigger than this goal. It was a Wednesday morning in June, and my dad and I went early so I could help him get ready for opening. A few patrons had come in to watch the match, but the regulars were definitely not much of a soccer-watching community. I was the kid at the end of the bar who had consumed way too many Coca-Cola refills by 11 a.m., trying to ignore my dad’s jokes about how he’d rather watch grass grow than watch soccer. When Donovan scored, 11-year-old me started running up and down the aisle high-fiving patrons, likely annoying a few of them. Every sports fan has their “where were you?” moments—this is undeniably one of my favorites. **The Decision** The Decision The Decision How would you explain this moment to someone who’s never watched sports? The best basketball prospect of his generation, who graced the cover ofSports Illustratedas ahigh schoolernext to the headline “The Chosen One,” is drafted by his hometown NBA team. Somehow, he exceeds the hype. He transforms a long-suffering also-ran into a perennial contender. Eventually, the beloved local kid becomes a free agent. When the time comes to announce his next move, he orchestrates a TV special, broadcast live from the Boys & Girls Club in his hometown. Millions watch on TV. Rows of young children sit behind their hero as he fields small-talk-style questions about his thought process. Then, finally, the big one: “What’s your decision?” In nine words, he announces his intention to leave the team and go to a city that couldn’t be more of a spiritual contrast to his hometown. It wasn’t just an all-time gut punch to his fan base. It also spawned a mini-dynasty, turned arguably the greatest player ever into a villain, and inaugurated a sea change in the power dynamics of pro basketball. How did this moment change sports? Unrestricted free agency had been a part of the NBA since 1988, but the impact of LeBron’s approach in the summer of 2010 is still rippling through the league 15 years later. James didn’t just change teams. He bent the entire NBA apparatus to his will, controlling every aspect of his free agencyandorchestrating a team-up with Dwyane Wade and Chris Bosh on the Miami Heat. In doing so, he established a blueprint that would take Kevin Durant out of Oklahoma City, Kawhi Leonard out of San Antonio, and Anthony Davis out of New Orleans. In the “player empowerment era,” stars exercise more control than ever before—and often more than their own teams. Even our consumption of the league has changed, as the NBA became more player-centric and variable from year-to-year. Of course, the Decision transformed more than just basketball. It scrambled the established world order throughout sports, making it arguably the most consequential moment on this entire list. **The Philly Special, Super Bowl LII** The Philly Special, Super Bowl LII The Philly Special, Super Bowl LII How would you explain this moment to someone who’s never watched sports? Somehow, the backup quarterback of the underdog team caught a wobbly touchdown pass on fourth-and-goal against an NFL dynasty and the GOAT. Where were you when this moment happened? In a mosh pit of bodies in the living room of Amanda Dobbins, with a bunch of Philly transplants, drinking a lot and screaming at the TV even more. **Aaron Boone’s ALCS Walk-off Home Run Versus the Red Sox** Aaron Boone’s ALCS Walk-off Home Run Versus the Red Sox Aaron Boone’s ALCS Walk-off Home Run Versus the Red Sox Where were you when this moment happened? In the upper deck in right field at Yankee Stadium. In my mind’s eye, I can still see that tiny white ball superimposed on the stands down the left-field line, the sea of fans erupting as the ball cleared the wall, and the countless strangers’ hands I victoriously slapped as I stood, celebrated, and finally filed out of the old stadium. No. 66 on our list was the emotional nadir of my charmed life as a partisan baseball fan; this was the summit. I know I’m supposed to say that meeting my wife, or getting married, or greeting my daughter in the delivery room was the happiest moment in my life … and sure, they were, in the sense that they marked the starts of lasting loves that would bring me immeasurably more joy than one home run. But for pure, compressed euphoria, nothing beats the Boone Game. I haven’t really rooted for the Yankees for roughly 15 years, but that feeling is still seared into my memory like an unfaded afterimage from a really bright light. How has the way this moment is viewed changed in the years since it happened? For one thing, many Yankees fans have gone from hailing Boone as a hero to wishing he wouldgoaway. More importantly, Boone’s blast now looks like the last gap of Boston’s legendary run as baseball’s benighted losers. When the Yankees’ third baseman became “Aaron Bleepin’ Boone” to Boston fans, it seemed as if the so-called Curse of the Bambino would extend deep into a second century. Instead, the Sox came back to beat the Yankees in historic fashion in the 2004 ALCS sequel, then swept St. Louis in the World Series toexorcisetheir generational sports trauma. Since 2003, the Red Sox have trounced the Yankees 4-1 in titles, and Boston’s MLB, NFL, NBA, and NHL teams lead New York’s by a combined total of 11-1. In 2003, Boone embodied the Yankees’ never-ending dominance over their traditional rivals; in retrospect, his homer bookended Boston’s bad old days. **13 Seconds** 13 Seconds 13 Seconds How would you explain this moment to someone who’s never watched sports? A generation’s two best quarterbacks forcing each other to realize their full potentials.Twenty-five points scoredafter the two-minute warning. A win probability chart that looks like the Richter scale reading of Pompeii, circa 62 AD. The old adage “left ’em too much time” blown to smithereens. Josh Allen makes a handful of 99th percentile, alien-level, game-winning plays, only to immediately be answered by the inevitability of Patrick Mahomes and the Kansas City Chiefs. But this moment’s moniker does not refer to quarterback genius. It’s not the 13 seconds in which Mahomes led his team to an impossible-seeming, game-tying field goal, and then an almost foregone-conclusion victory in OT—it’s the 13 seconds that the Buffalo Bills special teams and defense somehow could not extinguish. Who is the unsung hero (or goat) of this moment? Oy vey, there are so many. In the unsung hero category, of course: Gabe Davis.Eight receptions, 201 yards, four TDs, and at least four Chiefs defenders’ ankles broken.This game had fantasy owners drafting Davis in the early rounds the following year. This game is why the Jacksonville Jaguars paid him $39 million. He touched god on this January night. But like I said, this moment is about tragedy, not triumph—so who can we blame? Well, the Buffalo Bills have kept us asking that question for more than three years. To this day, no one—not head coach Sean McDermott, not then-special teams coach Matthew Smiley, not kicker Tyler Bass—has taken full responsibility for the decision to kick the ball into the end zone following Allen’s touchdown strike to Davis with 13 seconds left, which made it 36-33. Was it bad strategy or bad execution? As for what happened next, McDermott (deservedly) continues to catch heat in the parking lots of Orchard Park for how his defense was aligned. With the Chiefs holding all three of their timeouts and needing just a field goal to force overtime, the Bills made the mind-numbing call to sit in soft zones and allow the best quarterback in the league to casually complete 19- and 25-yard passes to the Chiefs’ most obvious targets, Tyreek Hill and Travis Kelce. Harrison Butker only had to make a 49-yard field goal! This moment is so legendary because even now, years later, it’s completely unfathomable that it happened. **The Usain Bolt Freeze Frame** The Usain Bolt Freeze Frame The Usain Bolt Freeze Frame How would you explain this moment to someone who’s never watched sports? You don’t have to be a sports fan to understand speed. If someone pulls ahead of a crowd in a footrace, it’s pretty clear what’s going on there. If someone pulls far ahead of a crowd of elite sprinters, it’s pretty clear that person is an anomaly even in the long and competitive history of running fast. And then there’s Usain Bolt, the only man to win three Olympic gold medals in the 100-meter dash. In his push for that final gold during the Rio Games, the 29-year-old Bolt sputtered into Rio after a year of nagging injuries. He was still otherworldly but not nearly as invincible. Then in the semifinals, as if to remind everyone of his legacy, Bolt mugged a little for the cameras near the end of another blowout win. That mischievous smile was yet another reminder that we’d never seen anything like him before and likely won’t again for quite a while. What is the most indelible image or quote from this moment? If you can somehow pry your eyes from Usain Bolt and his smile near the end of his joyful romp in the second 100-meter semifinal of the Rio Games, please think of poor old Chijindu “CJ” Ujah just over his right shoulder. Ujah was a promising 22-year-old sprinter from London in his first Olympics—already the lone hope from the British track team to make the final later that night. As Bolt cheerfully turned toward the infield of the track, where the cameras were, Ujah’s face was twisted in a grimace that basically told the story of his and everyone else’s futility.Someonelater captured the moment in a viral tweet: “Homie is fighting for his life and Bolt is posing for photos mid-race.” Ujah, the aforementioned “homie,” lost that fight, in a manner of speaking: He missed the final by 0.01 seconds. He would never come that close to Olympic glory again. Bolt went on to win his third Olympic 100 final, an unprecedented feat that sealed his legacy as the fastest human to ever live. But for a moment, Ujah represented all of those world-class sprinters who were great in their own right and whostillwound up a footnote in Bolt’s 12-year run of Olympic dominance. You can understand why Bolt was the only one smiling. **Tiger Woods Chips in at the Masters** Tiger Woods Chips in at the Masters Tiger Woods Chips in at the Masters What is the most indelible image or quote from this moment? It’s one of the most iconic moments in sports history, so forgive me for giving multiple answers to this question. First, obviously, is that shot of the golf ball teetering on the edge of the 16th hole, the Nike logo in plain view—just sitting there for what feels like an eternity, and then, somehow, toppling over one more time and falling into the cup. It was like a commercial come to life. (The shot of Tiger’s Nike ball, shown live and then over and over again in replays, was at the time equivalent to $1 million worth of commercial time on CBS’s broadcast,ESPN reported in 2005.) But equal respect must be paid to the legend Verne Lundquist. The man who’d been camped out behind the 16th green for so many years—who famously yelled “Yessir!” when Jack Nicklaus drained a big putt on that same hole in 1986—did not shrink in the face of such a massive moment: “Oh my goodness … OH WOW! In your LIFE have you seen anything like that?!” I never had before, and I never will again. What is the best behind-the-scenes anecdote about this moment? It’s a testament to how ridiculous that hole out is, the way that Nike ball has sort of blocked out the sun of history. After hitting one of the best shots of his entire life and taking a two-stroke lead into the 71st hole of the Masters, Tiger Woods went bogey-bogey to let Chris DiMarco back into the tournament. (Chris DiMarco, by the way? Do not forget that this man wascookingon the back nine of this round.) DiMarco, actually, nearly holed outhis chipon 18—a shot that would’ve won him a green jacket and sent Tiger’s chip-in to the bottom half of this list. But, on the first playoff hole, the Cat reemerged, sinking a 15-footer for birdie to win his fourth Masters. I imagine the gigantic fist-pump Tiger unfurled was partly because of the green jacket, but mostly because he didn’t let such a legendary chip become a footnote. **Abby Wambach’s Equalizing Header Versus Brazil** Abby Wambach’s Equalizing Header Versus Brazil Abby Wambach’s Equalizing Header Versus Brazil How did this moment change sports? This goal sparked Megan Rapinoe’s rise to superstardom. Rapinoe had enjoyed modest success before this, but she was primarily a substitute in the 2011 World Cup and relatively unknown to the casual fan. She would become one of the defining stars from the World Cup championship teams of 2015 and 2019 and go on to winSports Illustrated’s “Sportsperson of the Year” in 2019; this goal is the origin story of all that. Rapinoe is right-footed, but she hit a 50-yard cross with her left foot directly onto Wambach’s head. The play ended with a clutch finish by Wambach, who scored so many vintage goals with her head, but it’s also one of the best passes you’ll ever see on a soccer pitch. This was the soccer equivalent of completing a Hail Mary on the final play to force overtime. An incredible bit of skill, a little bit of luck, and the rest is history. Rapinoe and Wambach would go down in history for ushering in the best era of U.S. women’s soccer ever. What is the best behind-the-scenes anecdote about this moment? Rapinoesaidthat then-U.S. manager Pia Sundhage almost took her off the pitch before the goal happened. Coming on as a substitute and getting subbed out in the same match is a terrible look for a player. It usually only happens due to injury or complete ineffectiveness. “At one point, Pia was even thinking about taking me out, a sub for a sub, which is not ideal,” Rapinoe said. “Somehow I redeemed myself.” Rapinoe’s supreme creative abilities on the pitch are a must-have asset, especially when trailing by a goal, but those skills hadn’t been fully realized by this point in her career. Without this assist and the ensuing moments in the 2011 World Cup, Rapinoe’s career may have gone differently. **Federer vs. Nadal, the Wimbledon Final** Federer vs. Nadal, the Wimbledon Final Federer vs. Nadal, the Wimbledon Final How would you explain this moment to someone who’s never watched sports? Immovable object overcomes unstoppable force. The two most beloved men's tennis players of their era, and probably of any era, playing a match so astonishingan entire book has been written about it. (And amovie has been madeout of that book.) A younger star finally overcoming his—at that point—seemingly unstoppable rival and changing the trajectory of an entire sport. How did this moment change the future of sports? This was not the moment when Federer's career went into decline. He won four of the next six majors, including the 2009 French Open (Nadal's best tournament), and took the Wimbledon title back from Nadal the year after this match. But in 2008, Federer was as dominant an athlete as I've ever seen in any sport. He'd been ranked no. 1 for more than four years. He'd won 10 of the previous 16 Grand Slam tournaments. He'd beaten Nadal in two straight Wimbledon finals. Nadal was better on clay, yes; off clay, Federer wasn't really perceived to have any rivals at all. This was the match that changed all that. After this match, Federer was never invincible in the same way again. This was the match that opened the way for the Big Three era (and briefly the Big Four era) that established Nadal as a legitimate rival, and that kept the door of the GOAT debate open just long enough for Nadal and then Djokovic to shoulder their way through it. Maybe all that stuff would have happened anyway if Federer had won this match. Regardless, this is the dividing line in modern men's tennis history. We're still living in the future it revealed. **Kawhi Leonard’s Buzzer-Beater Hits Every Part of the Rim** Kawhi Leonard’s Buzzer-Beater Hits Every Part of the Rim Kawhi Leonard’s Buzzer-Beater Hits Every Part of the Rim Where were you when this moment happened? Funnily enough, I did not see this moment—the kind of shot every kid practices from the moment they become conscious of the concept of a game-winning shot—live because I was watching the penultimate episode ofGame of Thronesand getting ready for our post-Gameshow. And when I say funnily, I mean it’s the least funny thing that’s ever happened to me. An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever An Oral History of the Shot That Changed Toronto and Kawhi Leonard Forever What is the most indelible image or quote from this moment? The pregnant moments between bounces when all these different realities exist: where Ben Simmons’s game and body don’t fall apart; where the Sixers choose Jimmy Butler over Tobias Harris; where the Sixers are the team facing a decimated Warriors in the Finals. One where the Process worked. **Vince Young Beats USC in the Rose Bowl** Vince Young Beats USC in the Rose Bowl Vince Young Beats USC in the Rose Bowl How would you explain this moment to someone who’s never watched sports? We've seen so many mega-games that it's hard to describe just how mega this one was. USC-Texas wasn't just no. 1 versus no. 2—it was the matchup of the only two major undefeated teams of 2005. USC had won the last two national titles. The last two Heisman Trophy winners were on the field. The topthreeHeisman vote-getters of ’05 were on the field. Texas had won at Ohio State that year. USC had beaten Notre Dame with the Bush Push. You’ve heard the cliché \"it all comes down to this.\" Really and truly, it all came down to this. What is the biggest “what if?” surrounding this moment? Easy. What if Pete Carroll had opted to give the ball to Reggie Bush—or, you know, at least have him on the field—onfourth-and-2 in the fourth quarter? I celebrated for several days before I started to think about how strange that decision was. **28-3, Super Bowl LI** 28-3, Super Bowl LI 28-3, Super Bowl LI What is the biggest “what if?” surrounding this moment? What if Kyle Shanahan had run the ball? The Falcons offense entered the Super Bowl on a high and carried that high into the second half. They’d been the best unit in football all year, scoring 33.8 points per game. Matt Ryan won MVP, and Shanahan parlayed his brilliant play calling and trendy wide zone running game into a head coaching job in San Francisco. But with a big lead late in the Super Bowl, Shanahan effectively abandoned the Falcons’ running game. After a Tom Brady–to–James White touchdown (and a Stephen Gostkowski missed PAT) with 2:06 left in the third cut the lead to 28-9, Atlanta ran the ball just five more times for 9 yards despite needing to burn clock. The two most haunting plays for Falcons fans: a third-and-1 pass call from the Atlanta 36-yard line with 8:31 left that became the team’s first turnover of theentire postseason, and the sack Ryan took from Dont’a Hightower with 3:56 remaining that pushed the Falcons out of field goal range. More than eight years later, Shanahan is still one of the NFL’s best offensive coaches. But he hasn’t won a Super Bowl, and he gets this vacant look behind the eyes sometimes. What is the most indelible image or quote from this moment? With 2:33 left before halftime, cornerback Robert Alford picked Brady off and returned the interception 82 yards for a touchdown that put the Falcons up 21-0. As Alford picked up his sprint toward the end zone, the only Patriot with a chance to make a tackle was Brady, who loped as fast as he could toward the sideline to try to cut him off. Brady’s lunge for Alford’s ankles was in vain, and left the Patriots quarterback on his knees on the turf looking up at the game literally running away from him. The game seemed so out of reach soon afterThe Boston Globesent its earliest edition to press with that photo on the front page, running it under the headline, “A BITTER END.” The papers only went to a handful of readers in Florida, whose location necessitated the early deadline, but the cover became a “Dewey Defeats Truman” moment for Boston sports fans, and a symbol of the dangers of ever counting Brady out. Rumor has it that he got a copy framed. **Linsanity** Linsanity Linsanity Who is the unsung hero (or goat) of this moment? Knicks head coach Mike D’Antoni, who threw Jeremy Lin into the fire mostly for lack of alternatives but within days was—and I quote—“riding him like freakin’ Secretariat.” Other coaches might have been hesitant to let Lin cook, in part because doing so would mean admitting they had been wrong about not playing him in the first place. D’Antoni has always been too pragmatic for that. If you can play his style, you can play. If you’re apoint guardwho can play his style, you can play the best basketball of your life. Lin got the perfect opportunity at the perfect time for the perfect coach, and from that made a run unlike anything we’d ever seen. He became so important so quickly as to raise questions about how Carmelo Anthony—who was sidelined at the start of Lin’s emergence—would fit aroundhim. The Legacy of Linsanity, 10 Years Later The Legacy of Linsanity, 10 Years Later The Legacy of Linsanity, 10 Years Later The Legacy of Linsanity, 10 Years Later The Legacy of Linsanity, 10 Years Later The Legacy of Linsanity, 10 Years Later What is the biggest “what if?” surrounding this moment? It remains a cosmic cruelty that Linsanity didn’t get the chance to end on its own terms. Lin played well through and after Anthony’s return to the lineup, but his dream run ended when he tore his meniscus about a month before the start of the playoffs. That Knicks team never got the chance to see what it could accomplish. And Lin never wore a Knicks jersey again; when New York failed to make him a competitive offer that summer, Lin left for the Houston Rockets. He went on to a reasonably successful career that was marred by injuries. Was the meniscus tear the beginning of the end? Was that injury a by-product, in some way, of Lin’s sudden ramp-up and dramatic increase in minutes? The just-add-opportunity whirlwind that made Lin such an inspirational story also might have been his career’s undoing. **Malcolm Butler Picks off Russell Wilson, Super Bowl XLIX** Malcolm Butler Picks off Russell Wilson, Super Bowl XLIX Malcolm Butler Picks off Russell Wilson, Super Bowl XLIX Rewatching this moment makes me ___________. It makes me very sad, thanks for asking. It makes me very sad, indeed. Oh, by the way, I am a Seahawks fan. The Pick Heard Round the World The Pick Heard Round the World The Pick Heard Round the World The Pick Heard Round the World The Pick Heard Round the World The Pick Heard Round the World What is the biggest “what if?” surrounding this moment? It’s one of thegreatest plays in Super Bowl historyand one of the all-time moments in Patriots dynasty lore. It also dismantled a burgeoning dynasty in Seattle. Had Russell Wilson completed that pass, or had they handed the ball off to Marshawn Lynch and let him run it in, the Seahawks almost surely would’ve secured their second straight Super Bowl and set themselves up to challenge for a three-peat the following year. The team’s defense would’ve cemented a legacy as one of the best units ever, having beaten Peyton Manning and Tom Brady in back-to-back Super Bowls. God, it would’ve been amazing (sorry; as I just said, I’m a Seahawks fan). Instead, everything went to shit:The blame game over that failed play ensued, the locker room fell apart, and Seattle sank quickly into mediocrity. **The “They Would Have Built a Statue for This, Except …” Moments** With so many of the moments on this list, you knew you were watching history as they unfolded. For many of them, you probably knew exactly where you were and who you were with as they happened. Maybe you’ve spent some time imagining how you’ll tell your grandkids about one or two of these moments as you bounce them on your knee. But what happens when history doesn’t unfold the way you think it will? When a historical feat becomes nothing more than a footnote in real time? How do we account for the incredible, unbelievable plays and highlights that were canceled out almost as quickly as “Oh my God” could leave your lips? Think Tim Duncan hittingthe shot of his careerin the 2004 Western Conference semifinals … only for Derek Fisher to erase it in 0.4 seconds (our no. 64 moment of the quarter century). Sometimes history becomes, well,history. And it leaves us wondering whether a moment can be truly great if it serves only as a prelude to an even greater moment or to that team’s heartbreak. With that in mind, here are the 10 best moments that just didn’t end up mattering: Jermaine Kearse’s juggling catch in Super Bowl XLIX Kevin Durant wears shoes a half size too large Rajai Davis’s game-tying home run in Game 7 of the 2016 World Series Tom Watson’s 2009 British Open heartbreak Josh Hamilton’s go-ahead home run in the 10th of Game 6 of the 2011 World Series Larry Fitzgerald’s Super Bowl XLIII scamper Derek Jeter becomes Mr. November with a walk-off homer in Game 4 of the 2001 World Series Endy Chavez saves a home run in Game 7 of the 2006 NLCS Marcus Paige’s 3 in the 2016 national championship Julio Jones's sideline grab, Super Bowl LI **The Chicago Cubs Win the World Series** The Chicago Cubs Win the World Series The Chicago Cubs Win the World Series How would you explain this moment to someone who’s never watched sports? A team wins the World Series every year, and every year it’s a great baseball story. But the 2016 Cubs were a human-interest story. It was the ultimate triumph, overcoming the desperation of more than a century of losing. This proud city and fan base waited108 yearsfor a title. Multiple generations of fans dreamed of—but never got to experience—the Cubs winning the World Series. The fans who were fortunate enough to see it made sure to make the celebration count. What is the biggest “what if?” surrounding this moment? After the Indians took a 3-1 series lead, Chicago won Game 5 at home and Game 6 in Cleveland to even the series. The Cubs led Game 7 6-3 with two outs and a man on in the eighth inning when Joe Maddon turned to dominant reliever Aroldis Chapman to close out the World Series. Instead, Rajai Davis smacked a game-tying, two-run homer to tie the game. With the Cubs on the precipice of completing a historic comeback, the then-Indians ripped out the city’s hearts. The Cubs would have to wait a little longer for history. Just before extra innings, there was a 17-minute rain delay. If you’re a fan of either team, that was the longest and most painful 17 minutes of your sports life. After the Cubs went on to win 8-7 in the 10th, they credited a speech by Jason Heyward during the delay for resurrecting their chances. It raises the question: What if the 17-minute rain delay had never happened? In baseball, you can’t really call timeouts. Your best reliever just blew a save. The weight of 108 years of history is on the shoulders of every single Cubs player. The Indians are at home. But Mother Nature gave Chicago a breather to go compose itself and win the game in extras. The Cubs haven’t really been close to another World Series since 2016. Without a little rain, are we talking about a116-yeardrought? **Messi’s Argentina Beats Mbappé’s France in the World Cup Final** Messi’s Argentina Beats Mbappé’s France in the World Cup Final Messi’s Argentina Beats Mbappé’s France in the World Cup Final How would you explain this moment to someone who’s never watched sports? Just, like, take every single reality television show ever made, take every stunning plot twist from the past 300 years of film, TV, and literature, and distill all of that into a single two-and-a-half-hour experience. Watching this World Cup final is how you get people who claim they don’t like sports to like sports: It’s not a game—it’s the highest expression of human DRAMA. What is the biggest “what if?” surrounding this moment? It has to be the question of if Lionel Messi didn’t win, no? Would we still be entertaining debates that Cristiano Ronaldo is the superior player? Would we be having “Is Kylian Mbappé already in the GOAT conversation?” conversations (two World Cups at 23!!) like he’s some freaky, alternate-dimension Patrick Mahomes? Would Messi ever have left European soccer to enjoy a semi-retirement in Miami? Would millions of American children who’ve presumably become inspired by watching Messi play in MLS never have actually given a shit about soccer, setting back the U.S.’s own timeline for winning a World Cup even longer and leading to numerous unforeseen economic and geopolitical consequences? I guess we’ll never know. **Tiger Woods Finally Wins the Masters Again** Tiger Woods Finally Wins the Masters Again Tiger Woods Finally Wins the Masters Again How would you explain this moment to someone who’s never watched sports? Imagine if millions of people watching an event were all rooting for the same thing even though it had astronomically low odds, but then it actually happened. The greatest golfer who ever lived pulled off the greatest comeback in golf history. Eleven years after winning his last major, and after suffering through numerous spinal fusions and devastating personal setbacks, Tiger Woods, at 43 years old, pulled off his greatest win yet. Where were you when this moment happened? I’ve covered the Masters just once. But it was in 2019. Experiencing the crescendo of anticipation first hand on Augusta’s grounds is something I’ll carry with me forever. When it was clear on Sunday that Tiger wasactually going to fucking win, media members abandoned their posts and ran to the 18th green to try to catch a glimpse. The entire state of Georgia might as well have been there. I desperately sought higher ground. I ran into the clubhouse, saw Danny Willett sipping red wine in his green jacket while watching the CBS telecast, and got on to the second-floor balcony, which overlooked the green. Every single person at Augusta National had stopped doing their job to try to see history. It was that big of a deal. More onTiger in 2019 More onTiger in 2019 **Ray Allen Saves the Heat With a 3** Ray Allen Saves the Heat With a 3 Ray Allen Saves the Heat With a 3 What is the best behind-the-scenes anecdote about this moment? After Allen made one of the most dramatic shots in basketball history, he had some choice words for—of all people—the arena officials. So likely was a Spurs championship that AmericanAirlines Arena personnel had already begun to cordon off the court with yellow ropes, preparing for the imminent NBA title celebration. Allen wasn’t having it. In the mayhem of a loose ball, Allen backpedaled into the right corner, tucked his feet behind the 3-point line, and let loose a shot that would change the course of the NBA. Once he made history, he had but onevery important messageto deliver: “Get those motherfucking ropes out of here.” What is the biggest “what if?” surrounding this moment? Where to even begin? Allen’s shot saved the Heat’s season, swinging a title with the precision of his footwork and shooting form. But it also gave precious validation to that entire era of basketball in Miami, and in the agreement that had united LeBron James, Dwyane Wade, and Chris Bosh in the first place. That team had already won a title, but a loss against the Spurs would have meant the “not one, not two, not three …” Heat would have lost two Finals series in their first three seasons together. That surely would have brought significant changes; Bosh might have been shipped off, and Erik Spoelstra—one of the longest-tenured coaches in the NBA today—might have been fired. The story of the Heat was rewritten by Allen’s hand, and with it LeBron’s legacy. Winning a second title in Miami—against an opponent as formidable as San Antonio—was a triumph for James, not only as the team’s best player but as one of the architects of the modern superteam. It furthered his case as perhaps the greatest of all time. It gave him cover, a year later, when he decided it was time to move on. LeBron’s arc would take on a very different shape if it weren’t for Allen bailing out his missed 3 with a make, and rescuing a Heat season that should have been over. But also: If the Spurs had won in 2013, would they have still won again in 2014? The pain of Allen’s shot was so searing that Gregg Popovich opened training campthe following seasonwitha seven-hour film sessiondetailing all of his team’s implosive mistakes. The shot became a motivator—a regret that drove a champion. If Allen had missed, would the Spurs have played the next season with the same edge? And if they hadn’t, could the title have gone to the 59-win Thunder? You can follow the ripple effects to Kevin Durant’s free agency, the Warriors dynasty, and every Finals result for a decade. **The Kick Six** The Kick Six The Kick Six Rewatching this moment makes me ___________. … appreciate the unique magic and mania of college football. Every sport can deliver a thrilling ending, a shocking upset, a feat that makes participants and viewers alike gasp. But only college football can do it in a way that makes people find or lose religion, that shifts the sands of a rivalry tracing its roots across eons, that forges in its cauldron a brew of alchemical import and impact. Here are the facts: In 2013, no. 1 Alabama faced no. 4 Auburn at Jordan-Hare Stadium in the Iron Bowl, the annual rivalry game between the Crimson Tide and Tigers. The winner of that game would make the SEC championship game, and the winner ofthatgame would, without question, make the BCS title game. With mere seconds left, the game had lived up to the considerable hype, tied 28-28 and seemingly headed to overtime. Here is what those facts fail to capture: Something in the fabric of the universe changed that day. Auburn was just weeks removed from another mesmerizing comeback, having toppled Georgia on a Hail Mary in the Prayer at Jordan-Hare, but it drove the beak and talons of the War Eagle spirit into the heart of all laws of probability by achieving the implausible yet again. Chris Davis did not just return Alabama’s missed game-winning kick 109 yards to win in odds-defying fashion; in doing so, he positioned his team to play for the national championship and, almost more meaningfully, ripped Alabama’s title chances out of those poll-topping hands and buried them in a shallow grave in a way that time can not erase. In a grave that surely saw the pebbles atop it dance and roll as the 87,451 fans in attendance roared and stomped so fiercely thattheir celebration registered on a seismic scale. The Kick Six wasn’t just a play. It wasn’t just an ending. It was afeeling, a type of truth. And it became both a promise and a warning. It is forever embedded in the sporting vernacular, shorthand for never giving up and never getting comfortable. Until the Gatorade has flowed, fans of losing teams now delude themselves into thinking their squad can Kick Six; fans of winning teams cannot truly know a moment’s peace until time has expired and they have avoided the shame of allowing a rival to rob them of their victory, their prospects, their joy. The Kick Six is at once the product of its moment, the stew born of the particular circumstances of that 2013 season, and a timeless fable, the product of an utterly specific rivalry game on the Plains rippling across space and time. What is the most indelible image or quote from this moment? With apologies to Verne Lundquist, who called the game for a national audience on CBS and later branded the Kick Six“the greatest finish in any sporting event I’ve ever witnessed,”this honor goes to late Auburn announcer Rod Bramblett, who delivered one of the most memorable calls in the history of sport as he watched Davis dance along the sidelines. Bramblett’s call captured something elemental, almost feral, about the way sports can alter our view of the possible. Sure, he had a responsibility to explain to his audience what was unfolding, to process how this stunning circumstance had come to be and what it now meant. But instead, he screamed. He hit vocal registers he may not have known himself capable of reaching. He sounded as though he might weep. As he counted down the yard markers and yelped in astonishment and proclaimed, “They’re not gonna keep ’em off the field tonight,” he could, at a certain point, turn only to the spiritual: “Holy cow!”he shouted. “Oh, my God! Auburn wins! Auburn has won the Iron Bowl! Auburn has won the Iron Bowl in the most unbelievable fashion you will ever see! I cannot believe it! 34-28! And we thought a Miracle in Jordan-Hare was amazing! Oh, my lord in heaven!” If you had never seen a second of college football, let alone spent a second caring about Auburn, you could still listen to this and understand something core about the entire proposition of fandom. About the transcendent euphoria of knowing in real time that you had witnessed something lasting. About the lies we tell ourselves when we dare to hope and the ecstasy some of us are lucky enough to taste when our teams accomplish the divine. **Michael Phelps and the Greatest Relay Ever** Michael Phelps and the Greatest Relay Ever Michael Phelps and the Greatest Relay Ever Who is the unsung hero (or goat) of this moment? The last person to compete in a relay race is usually known as the anchor. But when Jason Lezak swam his final leg of the 4x100 freestyle relay at the 2008 Beijing Olympics, he was part torpedo, part life raft. He sankFrench antagonisteAlain Bernard when it mattered. He buoyed Team USA to a gold medal just when they seemed dead in the water. And he kept the biggest story line of those Olympics afloat: his teammateMichael Phelps’s attemptto outdo Mark Spitz’s 1972 record of seven gold medals in a single Summer Games. Where were you when this moment happened? I was on the sofa with my face in my hands, watching live on prime time like all good Americans, thank you very much. “I just don’t think they can do it,” remarked NBCbroadcaster Rowdy Gainesas Phelps squirmed on the pool deck, the sport’s biggest fish out of water, his splashy side quest about to end practically before it had even begun. Phelps had never been coy about wanting to outperform Spitz in Beijing. His plan was auspicious—lucky no. eight!—and also really audacious. He would have to perfectly execute, day after day, every last stroke and kick and flip turn within his control …andrely on a bunch of people he had no control over. The second of Phelps’s eight events in Beijing was thatdangfreestylerelay, and the U.S. trailed France by the time Lezak dived into the pool. Somehow, though, Lezakdiddo it, patiently and strategically edging out Bernard for the gold. And in living rooms across America in that moment, we reacted much the same way Phelps was: hooting, pacing, flexing, our helpless relief replaced by primal delight. Two golds down, six to go. And ultimately, Phelps collected ’em all. **The Red Sox Come Back From 3-0 Versus the Yankees in the ALCS** The Red Sox Come Back From 3-0 Versus the Yankees in the ALCS The Red Sox Come Back From 3-0 Versus the Yankees in the ALCS How would you explain this moment to someone who’s never watched sports? Reality was suspended for most of a week. Gravity stopped working. The speed of light got so slow you could jog past it. In 2004, even if you weren’t a baseball person, you knew about the Curse of the Bambino. You also knew the rules.No team has ever come back from 3-0 down to win a seven-game series. It was a law of nature. 3-0? Series over. When the Red Sox started winning games—and winning improbable,unbelievablegames, ludicrous extra-innings marathons that broke the five-hour mark twice—it felt like the whole giddy world was turning upside down. What is the most indelible image or quote from this moment? It has to be the bloody sock, right? October 19, 2004, at Yankee Stadium. Red Sox ace Curt Schilling has a torn tendon sheath in his right ankle. TV tells us doctors have basically stapled him together so he can play. We’re coming off two of the wildest games in baseball history, one that went 12 innings and one that went 14, both must-wins by the Red Sox. But both those games were at Fenway. Now we’re back in New York for Game 6, where, you have to assume, the old empire is about to reassert its dominance. Except … the empire doesn’t. Schilling stays out for seven hard innings and gives up only one run. The sutures in his ankle tear, and his right sock turns red with blood, and the Red Sox, the team that never gets it done when it counts, the team that hasn’t won a World Series in 86 years, the team that’s lagged the Yankees for its entire existence, hangs on to level the series 3-3. And look, I know he’s a bad guy. I know that two decades later, the fairy tale doesn’t look as innocent as it used to. What I can tell you is that in the moment, watching the Red Sox win via aliteral red sockfelt like the most magical thing that had ever gone down in sports. **The Block** The Block The Block How would you explain this moment to someone who’s never watched sports? The greatest NBA player of his generation leveraged every ounce of his strength, size, athleticism, and basketball IQ to obliterate a shot that—had it gone in—could have denied him the 2016 NBA championship and altered the course of his career. How did this moment change sports? If Andre Iguodala had made the shot, the Warriors would have taken a 91-89 lead with 1:50 left in Game 7 of the Finals. Would it have been enough? Or would Kyrie Irving have hit his game-winning 3-pointer (with 53 seconds left) anyway? Hard to say. But let’s invoke the butterfly effect and assume the Warriors would have hung on for the win: They’d be back-to-back champions. They’d have avoided becoming the first team to blow a 3-1 lead in the Finals. They’d have completed the greatest season in NBA history, certifying their 73-win regular season. They might still have pursued Kevin Durant that summer—but he’d have had less incentive to join a two-time champion than a team that (say it with me) blew a 3-1 lead. LeBron, meanwhile, would have been denied his third ring and his moment of hometown vindication. Wave goodbye to “Cleveland! This is for you!” More onthe Block More onthe Block **The Helmet Catch** The Helmet Catch The Helmet Catch How would you explain this moment to someone who’s never watched sports? The Helmet Catch is the single most improbable sports moment of the 21st century. The kind of thing that makes you believe in God. Down four with 75 seconds remaining in the Super Bowl, Eli Manning escaped two Patriots defenders and heaved a prayer downfield. Giants special teamer David Tyree, who caught four passes in the regular season, jumped upAngels in the Endzonestyle, and pinned the ball to his helmet inches from the ground for the greatest catch in Super Bowl history. The catch set up the biggest pro football upset in 40 years and robbed Tom Brady’s New England Patriots of a 19-0 season that would grant them sports immortality. What is the best behind-the-scenes anecdote about this moment? Three days before the helmet catch, Tyree dropped a half dozen passes in the worst practice of his career. The play before the Helmet Catch, Tyree ran the wrong route, and Manning was nearly picked. Then Tyree tilted the Super Bowl with a catch orchestrated by divine provenance. The catch helped fell perhaps the greatest American team in any sport ever, but the magic was that it was done bythis random guy. He never even played for the Giants again. Tyree’s catch lingers in our memory because it is why we watch sports. We are all weaving our little thread into the grand tapestry. The Helmet Catch is the hope that any of us, given the opportunity, can weave a little thread that may not be so little after all. **Nope.** We can’t find anything matching. Try broadening you filter. Yep, we have one too **Archive** We’ve been around since Brady was a QB"}