{"id": 2136, "name": "The Canary (UK)", "domain": "thecanary.co", "bias": "left", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.thecanary.co/discovery/2024/06/17/eu-elections-point-to-growing-public-desire-for-new-policymaking-approach-in-brussels/", "title": "Eu Elections Point To Growing Public Desire For New Policymaking Approach In Brussels", "content": "Disrupting Power Since 2015 Donate Login Login Register NewsUKGlobalAnalysisTrending UK Global Analysis Trending UK Global Analysis Trending Editorial FeaturesFeaturesEnvironmentLifestyleHealthMoneyScienceBusinessTechTravelSport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming MediaVideoCartoons Video Cartoons Video Cartoons Opinion NewsUKGlobalAnalysisTrending UK Global Analysis Trending UK Global Analysis Trending Editorial FeaturesFeaturesEnvironmentLifestyleHealthMoneyScienceBusinessTechTravelSport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming MediaVideoCartoons Video Cartoons Video Cartoons Opinion **EU elections point to growing public desire for new policymaking approach in Brussels** The recent EU elections, while preserving a centre-right majority, witnessed significant advances for far-right parties, most notably in heavyweights France and Germany. This political shift is likely to be, in part, attributable to growing public frustration with EU policies perceived as out-of-touch and elitist. Some elements of its ‘Farm to Fork’ strategy embody the flawed approach of the outgoing mandate. In the months leading up to the elections, continent-spanningfarmers’ protestsagainst these initiatives underscored widespread dissatisfaction. The healthy food pillar of ‘Farm to Fork,’ Brussels’s controversial front-of-package (FOP) nutrition labelling file—notably including France’s candidate for the bloc-wide system, Nutri-Score—exemplifies this disconnect between EU policymakers and citizens particularly aptly. As the EU embarks on a new five-year mandate, it must strive to build a healthy, sustainable food system through fair and genuine collaboration with its citizens. Addressing these concerns will be crucial in restoring confidence in the political process, ensuring that future policies resonate with and benefit all of Europe’s communities. Unpacking Nutri-Score Since its proposal as a candidate for the EU’s mandatory FOP nutrition label in 2020, France’s Nutri-Score label has been an agent of division. While initially welcomed by certain member-states, including Germany, Luxembourg and Belgium, the system quickly alienated the likes of Greece, Cyprus and a host of Central and Eastern European countries among others. The primary issues with Nutri-Score revolve around its biased scoring system, reductive approach and questionable scientific basis. Critics have notably argued that Nutri-Score’s algorithm is overly simplistic and outdated, failing to account for the complexity of nutritional value. Moreover, concerns have been raised about the independence of the science behind the label, with a recentstudysuggesting potential conflicts of interest involving researchers linked to Nutri-Score’s team publishing favourable research while attempting to block less flattering scientific evaluations of the system. Small farmers and food producers across Europe have been particularly vocal against Nutri-Score. Traditional European foods, such as PDO cheeses and cured hams, largely produced by small-scale regional farmers, have received unjustifiably negative grades, putting them at a significant competitive disadvantage and threatening the long-term viability of the EU’s culinary heritage as well as wider rural economies. Despite these criticisms, Belgium’s EU presidency hasattemptedto revive support for Nutri-Score. However, as the Belgian Presidency nears its end, opposition to Nutri-Score across Europe is only growing. This widening opposition suggests the need for a more inclusive and scientifically-sound approach to nutritional labelling that supports all EU food producers and dietary needs. Governments turning backs on Nutri-Score Indeed, just days after the EU elections, Belgium’s ill-fated push for Nutri-Score consensus hit a significant roadblock. In Portugal, the new centre-right government led by Luís Montenegro has dramatically challenged the legality of the former socialist government’s official adoption of Nutri-Score last April. On June 11, Portugal’s Agriculture Ministry published a decree expressing “reservations” about Nutri-Score, confirming that despite food labelling falling under the General Directorate of Food and Veterinary (DGAV), this body had not been consulted before the label’s adoption by the former health secretary via order no. 3637/2024. Beyond rendering the previous order legally invalid, the Agriculture Ministry’s new decree emphasises that “the Nutri-Score system, which is based on an algorithm and constitutes a summary indicator, does not reflect the real contribution of the different nutrients.” The Nutri-Score debacle has sparked strong divisions in Portugal, reflecting the broader continental picture. Critics, such as the country’s Order of Engineers, are highlighting flaws in the algorithm, which, despite recent revision, still excludes sweeteners and additives, risking misinterpretation and consumer confusion that undermine its health goals. In Luxembourg, Nutri-Score has experienced a similar reversal of its fortunes this month, with the Ministry of Agriculture highlighting that the label fails to account for additives, pesticides, or the degree of food processing “because we do not yet have sufficient scientific data to integrate all these dimensions into a single score.” Mirroring long-held criticism against the system, Maurice Muller of Luxembourg’s Chamber of Skilled Trades and Crafts equally decries a system with “major weaknesses…developed for highly processed industrial foods, to the disadvantage of more natural, artisanal products.” Luxembourg’s rebuke adds to Nutri-Score’s recent challenges, with the Spanish Senate blocking its official adoption, Romania opting for an outright ban and the Swiss parliament considering a similar measure, casting doubt on the label’s future. Agri-food giants finally following suit In a surprising twist, Switzerland, once a stronghold of Nutri-Score support both politically and industrially, is witnessing a significant shift among agri-food’s heavy hitters. In late May, Swiss supermarket giant Migros decided to remove the Nutri-Score label from its products, citing its poor effectiveness and excessive costs. Following Migros, leading Swiss dairy group Emmi has also opted to abandon the label. Given both Switzerland’s and industrial food groups’ traditional support of Nutri-Score, this retreat underscores the extent to which disillusionment with the label has grown in recent months. Conversely, Nestlé remains steadfast in its endorsement of Nutri-Score—support hardly surprising considering the company’s long-standing use of the label to present its products, like Chocapic, in a deceptively positive light despite their self-confessed questionable nutritional profiles. Nestlé’s commitment to Nutri-Score has extended beyond mere usage; in 2020, the company, along with other agri-food giants like Danone, spearheaded a vigorous campaign to mandate Nutri-Score across the board. This unwavering support from industry behemoths like Nestlé raises critical questions about the integrity and effectiveness of Nutri-Score. As Switzerland’s initial enthusiasm wanes, EU and national policymakers must reconsider whether Nutri-Score genuinely serves public health or merely acts as a smokescreen for corporate interests. Chance for fresh start The recent EU election results send a clear message to Brussels and national leaders: it’s time to listen to its citizens and small businesses. The Nutri-Score controversy should serve as a lesson as the bloc’s political leaders aim to move away from top-down, out-of-touch decision-making and launch a more inclusive and pragmatic deal. Moving forward, the new EU mandate offers a fresh start to prioritise policies that address public concerns while achieving health and environmental goals. By fostering collaborative, transparent and realistic policymaking, the EU can regain public trust and ensure the Green Deal unites rather than divides, balancing ambition with practicality for a better Europe. **Palestine Action just created more metaphorical ‘fires’ across the UK than the cops can put out** **Palestine Action just created more metaphorical ‘fires’ across the UK than the cops can put out** **New study exposes SHOCKING bias of BBCQT, leaving broadcaster with serious questions to answer** **New study exposes SHOCKING bias of BBCQT, leaving broadcaster with serious questions to answer** **New study exposes SHOCKING bias of BBCQT, leaving broadcaster with serious questions to answer** **Shocking comments from Labour candidate challenging Corbyn just came to light** **Tory-led North Warwickshire council using public money to protect private oil terminal** **Manchester cops beat peaceful pro-Palestine protesters in crowd with elderly people and children** **E-coli scandal continues: superbug now found on nearly HALF of Lidl chickens tested** **Met Police putting Israeli apartheid tanks on our streets is just part of its complicity with war crimes** **Keir Starmer just got schooled over nationalising water companies** **Sunderland school prom ban targets disabled kids as backlash grows** **Israel accused again of the crime against humanity of extermination as governments and MSM fail** **Climate group calls for a clean energy transition in Wales, not the polluting coal power of the past** Contact About & FAQ Get our Daily News Email Privacy Policy Cookie Policy The CanaryPO Box 71199LONDONSE20 9EX Canary Media Ltd – registered in England. Company registration number 09788095. For guest posting, contact[email protected] For other enquiries, contact:[email protected] The Canary is owned and run by independent journalists and volunteers, NOT offshore billionaires.You can write for us, or support us by making a regular or one-off donation. © Canary Media Ltd 2024, all rights reserved | Website byMonster| Hosted byKrystal|Privacy Settings **Welcome Back!** Login to your account below Remember Me **Create New Account!** Fill the forms below to register **Retrieve your password** Please enter your username or email address to reset your password. NewsUKGlobalAnalysisTrending UK Global Analysis Trending UK Global Analysis Trending Editorial FeaturesFeaturesEnvironmentLifestyleHealthMoneyScienceBusinessTechTravelSport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming Features Environment Lifestyle Health Money Science Business Tech Travel Sport & Gaming MediaVideoCartoons Video Cartoons Video Cartoons Opinion © 2023 Canary - Worker's co-op. **Before you go, have you seen...?** **Met Police putting Israeli apartheid tanks on our streets is just part of its complicity with war crimes** **Keir Starmer just got schooled over nationalising water companies** **Sunderland school prom ban targets disabled kids as backlash grows** **Israel accused again of the crime against humanity of extermination as governments and MSM fail** **Vote for the Press Photograph of the Year 2024** **Why Santiago Ways is the Leading Choice for Walking the Camino de Santiago** **EU elections point to growing public desire for new policymaking approach in Brussels**"}