{"id": 1002, "name": "Newsroom New Zealand", "domain": "newsroom.co.nz", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://newsroom.co.nz/2025/06/10/why-our-rates-are-rising-as-valuations-drop-and-the-wealthy-exceptions-to-the-rule/", "title": "Why Our Rates Are Rising As Valuations Drop And The Wealthy Exceptions To The Rule", "content": "Donate Subscribe Sign In NewsroomPro News Politics Business Sustainable Future Investigations Opinion Personal Wealth LockerRoom ReadingRoom Puzzles Facebook Page Twitter Username Instagram YouTube Bluesky Donate Subscribe NewsroomPro News Politics Business Sustainable Future Investigations Opinion Personal Wealth LockerRoom ReadingRoom Puzzles Podcasts Video Newsletters About Newsroom Contact Us Support Newsroom’s Journalism My Donor Account Facebook Twitter Instagram YouTube Bluesky Donate Subscribe NewsroomPro News Politics Business Sustainable Future Investigations Opinion Personal Wealth LockerRoom ReadingRoom Puzzles Podcasts Video Newsletters About Newsroom Contact Us Support Newsroom’s Journalism My Donor Account Facebook Twitter Instagram YouTube Bluesky Facebook Page Twitter Username Instagram YouTube Bluesky Newsroom Quality worth making room for Donate Subscribe Sign In NewsroomPro News Politics Business Sustainable Future Investigations Opinion Personal Wealth LockerRoom ReadingRoom Puzzles **Why our rates are rising as valuations drop – and the wealthy exceptions to the rule** **Share this:** Share Click to share on Facebook (Opens in new window)Facebook Click to share on LinkedIn (Opens in new window)LinkedIn Click to share on X (Opens in new window)X Click to share on Bluesky (Opens in new window)Bluesky Click to print (Opens in new window)Print Click to email a link to a friend (Opens in new window)Email Personal Wealth in association with Analysis:Howls of pain are emerging from Auckland as homeowners compare the declines in this week’s new rateable valuations with the rises in their rates bills, taking effect from the start of next month. My family lives in Onehunga. This week’s new figures show our home’s rateable valuation is down 8 percent on 2021, yet our rates will rise about 5.8 percent ($315) from July 1. Add to that a 7.2 percent hike to Watercare charges, and it’s costly. (Not everybody’s valuation has diminished. For instance – and for the property voyeurs among us – the capital value of the Mowbray mansion in Coatesville has increased 3 percent, from $39.3 million to $40.5m. The CV for the former Hotchin mansion in Ōrākei has jumped from $58m to $72.5m.) **read more** **Denser housing coming for Auckland, but not (necessarily) in your back yard** **The real reason Meridian shut down its grand green hydrogen project** On average, Aucklanders’ CVs have dropped 9 percent. And while Auckland’s cries may echo loudest, because there are more of us, the discrepancies are even more stark elsewhere in the country. Wellington residents, for instance, will pay on average 16.9 percent more in rates, even though their property values have dropped 24.4 percent – a big chunk out of their wealth that will push some into negative equity (on the books, at least). Nelson locals face a 6.5 percent rates rise, despite their house values dropping 9.4 percent. Understandably, homeowners’ realisations that they are are less wealthy, yet they’re being asked to pay more, will harden opposition to rates rises. And that will shape the political debate in October’s local elections. Christopher Luxon’s Government has told councils to “get back to the basics” of fixing pipes, filling potholes, and delivering core local services. Start your day informed. Make room for newsroom's top stories. Direct to your inbox daily. Challenger local candidates who promise to rein in rates rises will no doubt get a more sympathetic hearing from local electors; those incumbents who are aware just how hard that is will struggle make their arguments heard. But let’s set aside some of the spin and look at this more dispassionately. **Rates hikes v residential property valuation changes** The ways in which central government taxes and local government rates are set are critically different. Central government starts with tax rates (PAYE, company tax, GST, etc) then asks revenue officials to make an informed guess about what that rate will raise. If my gross earnings increase, I pay more tax – but generally I don’t complain too much because I can see it’s a consistent rate. Every year, as individual and company earnings and expenditure increase, the Government takes a bigger clip from a bigger ticket – and that helps cover its increased costs servicing a growing population. What this means is that the Government increases its tax take every year, without having to make any active decision. The passing of the Budget Appropriation Bill does not require MPs to vote on increasing tax revenue. MPs don’t face the wrath of those who elected them, for voting in favour of a tax revenue rise. It just happens. Every year. Local government is required to work the other way round. It predicts how much money it will need to service its own growing population, then works backwards to decide how big an increase in rates revenues is needed to pay for that. What this means is that when your house value rises, increasing your equity and making you more wealthy, that doesn’t flow through to paying more rates. All it does is slightly change the share you pay of your city or district’s total rates bill, relative to your neighbour whose house value may have declined. The net effect is that over the past century, tax increases have massively outstripped rates rises, leaving local government genuinely struggling to pay the bills. **Tax v rates as a percentage of GDP** That’s why Auckland Mayor Wayne Brown, this week, is putting the hard word on the Government to allow the city to charge bed taxes to fund tourism infrastructure. That’s why Local Government NZ and its members (61 of the country’s 67 city and district councils) have been pushing for new revenue tools, like a share of local GST take, or the ability to charge rates on Crown estate. That’s right, even though the Government’s books are in a much healthier state than councils’, and its debt is lower by global measures, it still exempts itself from paying rates. So, as the local government elections roll around in October, by all means hold your councillors to account on their spending and the rates rises they’ve imposed – but listen cautiously to MPs who punch down on cash-strapped councils. Be sure you’re comparing apples with apples – because the big picture is, successive governments have increased their tax take far faster than councils have hiked their rates. **Jonathan MilneManaging editor** Newsroom Pro managing editor Jonathan Milne writes on economics, infrastructure, business and politics, and pens the daily 8 Things subscriber newsletter.More by Jonathan Milne **Join the Conversation** 4 Comments John Burnssays:11/06/2025 at 7:04 amAuckland house prices may have dropped 9% from 2021 -2025, but they had previously increased by 35% from 2016-2021. CV’s are just a snapshot in time, useful for assessing rates but nothing else.Log in to ReplyTam Irvinesays:11/06/2025 at 8:54 amI can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices.Log in to Reply Auckland house prices may have dropped 9% from 2021 -2025, but they had previously increased by 35% from 2016-2021. CV’s are just a snapshot in time, useful for assessing rates but nothing else. Tam Irvinesays:11/06/2025 at 8:54 amI can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices.Log in to Reply I can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices. Auckland house prices may have dropped 9% from 2021 -2025, but they had previously increased by 35% from 2016-2021. CV’s are just a snapshot in time, useful for assessing rates but nothing else. Tam Irvinesays:11/06/2025 at 8:54 amI can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices.Log in to Reply I can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices. I can’t help but imagine how much more prosperous the country would be if we were still paying 2016 property prices. Tam Irvinesays:11/06/2025 at 8:53 amPresumably the cost of delivering services increases the further out from the centre you get. Stands to reason that properties further out should be subject to further rates (although this is of course not the basis on which they’re calculated).Log in to Reply Presumably the cost of delivering services increases the further out from the centre you get. Stands to reason that properties further out should be subject to further rates (although this is of course not the basis on which they’re calculated). Presumably the cost of delivering services increases the further out from the centre you get. Stands to reason that properties further out should be subject to further rates (although this is of course not the basis on which they’re calculated). John Staggsays:11/06/2025 at 12:14 pmSuccessive governments have happily legislated or regulated to impose costs on Councils without regulation. Example recently is the cost to Councils of the removal of speed reductions.Log in to Reply Successive governments have happily legislated or regulated to impose costs on Councils without regulation. Example recently is the cost to Councils of the removal of speed reductions. Successive governments have happily legislated or regulated to impose costs on Councils without regulation. Example recently is the cost to Councils of the removal of speed reductions. Only Members may post a comment. If you already have a membership, thensign in.Subscribe now. **Leave a comment** Start your day with a curation of our top stories in your inbox **Most Popular** Cost-benefit behind $10b Northland highway called into question Architects suffer worst slump in 50 years Last call for supermarkets and off-licences selling cut-price alcohol Why our rates are rising as valuations drop – and the wealthy exceptions to the rule Splintered early childhood sector holds its breath for funding review Start your day with a curation of our top stories in your inbox. Facebook Page Twitter Username Instagram YouTube Bluesky Contact Us Terms and Conditions Privacy Policy Pro FAQ New Zealand Media Council Commenting Rules and FAQ This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply. **Sign in** Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to, or clicking the magic link in the email. I agree to Newsroom's Terms and Conditions. This site is protected by reCAPTCHA and the GooglePrivacy PolicyandTerms of Serviceapply."}