{"id": 110, "name": "Austin Daily Herald", "domain": "austindailyherald.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.austindailyherald.com/2025/06/new-minnesota-budget-sealed-up-in-legislative-spree-as-immigrant-health-coverage-rescinded/", "title": "New Minnesota Budget Sealed Up In Legislative Spree As Immigrant Health Coverage Rescinded", "content": "Home NewsCrime, Courts & EmergenciesEducationHealthProgress 2021State, Nation and WorldWeather Crime, Courts & Emergencies Education Health Progress 2021 State, Nation and World Weather Crime, Courts & Emergencies Education Health Progress 2021 State, Nation and World Weather Sports OpinionEditorialsLetters to the EditorColumnists Editorials Letters to the Editor Columnists Editorials Letters to the Editor Columnists ObitsObituary Information And Guidelines Obituary Information And Guidelines Obituary Information And Guidelines Austin Living Magazine Progress 2025Progress 2024Progress 2023Progress 2021Progress 2015 Progress 2024 Progress 2023 Progress 2021 Progress 2015 Progress 2024 Progress 2023 Progress 2021 Progress 2015 ContestsBest of Mower County Best of Mower County Best of Mower County Classifieds Public Notices ServicesAbout UsPoliciesNews TipPhotoAdvertise with UsLetter to the EditorEngagement AnnouncementWedding AnnouncementBuy PhotosEmail Customer ServiceSubscriptions About Us Policies News Tip Photo Advertise with Us Letter to the Editor Engagement Announcement Wedding Announcement Buy Photos Email Customer Service Subscriptions About Us Policies News Tip Photo Advertise with Us Letter to the Editor Engagement Announcement Wedding Announcement Buy Photos Email Customer Service Subscriptions E-Edition **New Minnesota budget sealed up in legislative spree as immigrant health coverage rescinded** Published 8:12 am Tuesday, June 10, 2025 ByMinnesota Public Radio ByBrian Bakst,Peter CoxandEllie Roth A budget bottleneck came unclogged as the Minnesota Legislature bolted through bill after bill to finish a $66 billion two-year spending plan early Tuesday and avoid a possible government shutdown. It took a special session to complete the job after the regular session ended in May with much undone. With a firm deal in hand, lawmakers churned through sprawling bills one after another and wrapped up their work. **Email newsletter signup** The House beat the Senate to the finish line, adjourning at 10:40 p.m. after about 12 hours of work. Senators clocked out around 1:55 a.m. “From the very beginning, this has been a hard-fought session,” Senate President Bobby Joe Champion, DFL-Minneapolis, said as he drew things to a close. “And to get here we ultimately had to forge relationships and compromises that are not always easy.” The closely divided Legislature — there are 101 DFLers and 100 Republicans — had some skirmishes over priorities and spending levels. “We were charged with doing a state budget for the people of Minnesota. That is what we have done,” Republican House Speaker Lisa Demuth said, adding, “I know this was successful because we were able to get the work done — not quite on time, but before a government shutdown.” She noted that a tied House for only the second time in state history made it impossible for either side to have its way. House DFL Caucus Leader Melissa Hortman concurred. “Minnesotans expect that when Democrats and Republicans are elected to co-govern in the state Legislature that we would compromise and get things done and fund their state government,” she said. “And that’s exactly what we did.” An education budget offered schools some fiscal stability in this budget but laid the groundwork for cuts in a couple of years. A nursing home and disability services budget clamped down on fast growth. New or increased fees are sprinkled throughout the budget. A tax plan bumped up charges on cannabis products and a related measure reframed regulations on data centers. None of the special session debates were more intense than a bill to strip health insurance coverage from immigrants in the country without legal status. Undocumented immigrants who are adults will lose eligibility for the premium-based MinnesotaCare program after December while children will remain eligible. Republicans said the restriction was imperative because state costs for care are ballooning. “I think for most Minnesotans, this issue is quite simple. We shouldn’t be incentivizing illegal immigration to our state by making it easy, providing taxpayer funded benefits and looking the other way when someone came here to break our laws at a time when we’re facing cuts,” said Sen. Jordan Rasmusson, R-Fergus Falls. Democrats took issue with the cost estimates, noting that the MinnesotaCare program requires buy-in by the recipient. They said it wouldn’t end the need for health care but would cause some people to put off preventative care or just go to emergency rooms that can’t turn away patients even if they can’t pay. “This is a horrible priority. It’s a horrible thing to do to people, to call them illegal, to say they don’t matter, to say that their taxpayer dollars somehow don’t exist, that their families don’t matter, that their pain and their suffering doesn’t matter,” said Sen. Erin Maye Quade, DFL-Apple Valley. The bill passed with the minimum number of votes needed to clear the House. Hortman was the only DFLer to cross over to vote with Republicans, a necessity of the budget deal she signed her name to. “I’ll continue to have health insurance, so I’m fine,” Hortman said after the session ended, her voice cracking. “What I worry about is the people who will lose their health insurance. I know that people will be hurt by that vote.” Similarly, DFL Senate Majority Leader Erin Murphy also voted for it while disparaging the aim of the proposal. She was joined by three Democrats from swing districts. The coverage removal applies only to adult immigrants; children will retain the coverage after Jan. 1. For the most part, lawmakers breezed through consideration of the budget bills. Some were outlined and passed within 30 minutes; others took a bit more time. Gov. Tim Walz was out of sight on Monday but never really far from mind. Some Democrats jabbed at him for agreeing to the MinnesotaCare change for immigrants. Rep. Maria Isa Perez-Vega, DFL-St. Paul, was gaveled out of order when she tried to start a chant of “This ain’t One Minnesota” during the House floor debate, mocking a Walz campaign slogan. House Education Finance Committee Co-Chair Ron Kresha, R-Little Falls, faulted Walz for letting the state’s finances get squeezed to the point where the education budget could be in for a $400 million-plus cut in the budget after this one. “I would urge the governor to stop going around the country and showboating and get back here and look at what’s in front of you,” Kresha said. “Look at the policies that we have. Stop touting that you’re the education governor, when you forced $420 million cuts on us.” This budget starts to identify places where costs could be trimmed if the fiscal picture doesn’t improve. Kresha’s DFL counterpart, Rep. Cheryl Youakim of Hopkins, said the budget at hand makes thoughtful adjustments. “A cut budget was hard to work with,” she said. “We did our best to keep the majority of the cuts away from directly in the classroom.” Among the items in the education bill is a task force to look at ways to account for growth in special education costs and have it report back to the Legislature soon. Walz will have his say yet this week as the bills start officially arriving to his office. He’s expected to sign the entire package given that he was a signatory to the final deal. **New grant may help scientists change the fight against liver cancer** **Grillin & Chillin event raises money for Humane Society and prospects for expanded event** **Special session convenes to vote on rest of Minnesota budget, avoid shutdown** **A place to call home: Austin pickleball group continues work toward funding public courts** Construction UpdatesConstruction UpdatesSeptember 16, 2021 **Construction Updates** Construction UpdatesSeptember 16, 2021 **Construction Updates** **Construction Updates** Construction UpdatesSeptember 16, 2021 **Construction Updates** **Construction Updates** Southern Minnesota News Collection **Southern Minnesota News Collection** **Southern Minnesota News Collection** Home News Sports Opinion Spotlight Obits Classifieds Small Business About Us Policies News Tip Photo Subscriptions Email Customer Service © 2025, Austin Daily Herald"}