{"id": 393, "name": "Education Next", "domain": "educationnext.org", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.educationnext.org/college-students-as-tutors-an-innovation-with-an-impact-ohio-initiative-ed-school-students-teacher-training/", "title": "College Students As Tutors An Innovation With An Impact Ohio Initiative Ed School Students Teacher Training", "content": "News Research Podcasts The Journal Blog Book Reviews Teachers and Teaching Tutoring **College Students as Tutors: An Innovation with an Impact** Liz Cohen Liz Cohen In December 2022, Kate Brodeur, an assistant professor at Bowling Green State University in Ohio, pitched an idea to Zeb Kellough, principal at the nearby Crim Elementary School: Would he be interested in having 57 Bowling Green education students work in his building as tutors, starting the next month? Kellough didn’t hesitate. He had seen learning losses grow among his students during the pandemic and believed tutoring could help address those deficits. Also, he had been working with the Bowling Green education school for years. Its campus sits just blocks from Crim, the lowest-performing elementary school in Bowling Green City Schools. Almost 90 percent of the school’s students live at or below the federal poverty line. Education school students have long worked in local public schools to fulfill practice teaching requirements, a foundational training experience that’s formed a mainstay of teacher preparation since the 1850s. But the roughly five dozen Bowling Green students who arrived at Crim in 2022 were going to play a very different role: They would serve as tutors providing small-group instruction to selected students in 30-minute sessions three times a week. Education schools are not typically known for innovative practices or effective new initiatives. As scholar David Labaree of Stanford University wrote more than two decades ago, “Complaining about ed schools is as commonplace as griping about the cold in the middle of winter.” But Dawn Shinew, dean of Bowling Green’s College of Education and Human Development, the largest producer of teachers in Ohio, had seen firsthand how the summer and afterschool tutoring that Brodeur ran at Crim in 2021 and 2022 had benefited both college students and their young charges. So she gave her team the green light to rework Bowling Green’s education major requirements so that every student would spend at least a semester working as a tutor. This model, if scaled up nationally, could greatly improve the experiential component of training for the approximately 500,000 students studying to become teachers in the nation’s 1,500 college and university education programs. As an added benefit—perhaps the primary benefit—deploying education students in this role would tap into a vast new lost-cost source of high-quality tutors for schools as federal pandemic-recovery funding winds down. School districts have deployed tutoring as their primary academic response to the pandemic, withabout halfof all public schools reporting they have offered one or more tutoring programs to students. Tutoring represents a win-win, potentially boosting student outcomes while better preparing future teachers for classrooms in which tutoring will play a key role. And with the end of federal assistance through the Elementary and Secondary School Emergency Relief fund, districts now have less money available for tutoring. Bowling Green was well positioned to participate in a formal tutoring program, as the school already prioritized field placement for its undergraduate education majors. Its students get more than twice the 100 hours of work in schools required by the state of Ohio—more than any other teacher-prep program in the state. Says Shinew: “I want students to have enough opportunities to see what teaching is like, to make sure this is really the right fit for them, and to gain all the experience they can while still in the supportive environment of their own schooling.” Bowling Green incorporated tutor training into its existing pedagogy courses, making them a new component of these courses instead of replacing any of them. “We were already working on individual and small-group instruction,” explains Shinew. “This new approach using assessment data, consulting with the classroom teaching, and linking all of that with high-quality instructional materials took everything to a different level.” As Shinew hinted, Bowling Green was already working to improve aspects of its program beyond tutoring. In a 2023 review of teacher-prep programs, theNational Council on Teacher Quality(NCTQ) gave Bowling Green a grade of “B” for its approach to preparing teachers to effectively teach reading. Of 695 programs, only 160 (23 percent) received an “A,” and another 104 (15 percent) received a “B.” NCTQ conducted its review of Bowling Green the year before the college revamped its approach. Whether Bowling Green’s program changes improve its rating on NCTQ’s scorecard remains to be seen. Tutoring in Action In fall 2024, in the second full year of the program, 60 second-year education majors spent three days a week tutoring at one of six schools across three nearby districts. Another 90 are tutoring in the schools during the spring 2025 semester. Three days a week, students spend three hours in a classroom. They dedicate 30 minutes of that time to the classic model of high-impact tutoring (the same adult working with no more than four students for at least 30 minutes each time, at least three days a week). The remaining two-and-a-half hours is used in a variety of ways at the classroom teacher’s discretion. The Bowling Green students are unpaid; the tutoring hours count toward their field-placement hours for graduation and constitute a mandatory part of required elementary-education pedagogy courses. At Crim Elementary in November 2024, two Bowling Green tutors each spent 30 minutes working on reading with two 5th-grade students who are both three grade levels behind, and they also assisted various students during work periods. The tutors provided these services in addition to the “formal” high-impact tutoring sessions. During one 4th-grade classroom’s intervention block, when students typically work in small groups, on technology platforms, or on individual worksheets in a period of highly individualized learning, the Bowling Green tutor worked on math skills with three students. A few feet away at another table, the teacher sat with four students, practicing a different set of skills. Ten other students were spread across the classroom, either completing a worksheet, playing a math game with dice, or finishing an online math activity. About 15 miles northeast of Bowling Green lies the more affluent suburban town of Maumee, Ohio, where Bowling Green students began tutoring at Fairfield Elementary, a K–3 school just a mile from the town’s main street, in spring 2024. Maumee might have less poverty than Bowling Green City Schools, but it’s not free of challenges. Second-grade teacher Theresa Fleck told me that the changes in student behavior she’s seen since the pandemic continue to create significant disruptions. “You’re lucky you didn’t see one of my students flip a desk or throw a chair. I can’t even believe this happens in a 2nd-grade classroom.” While Fleck and other veteran Fairfield and Crim elementary school teachers have found that integrating tutoring into their classrooms requires some work on their part, she says the benefits outweigh the costs. “One difference is that I’ve really been able to stretch the time I spend in small groups,” she told me when I visited her classroom in November 2024. “That part has been fantastic.” Bowling Green students submit their tutoring lesson plans for review as part of their college coursework, and they undergo observation during tutoring at least twice during the 12-week semester. Many have embraced the experience of tutoring. One student said she gained insight into how progress monitoring should work, and actually monitoring the progress of several students during the term deepened both her conceptual and her practical knowledge of why and how that part of teaching matters. Another tutor said that the chance to build lesson plans and test them out on students will serve her well when she has her own classroom and must plan lessons every day. On the Bowling Green campus, tutors can tap into a variety of materials to support their work, such as math manipulatives, kits, and other teaching aids from the education building’s resource center. And the second floor of the university library is essentially a children’s library for education students, stocked with 30,000 volumes of fiction and nonfiction, from picture books to young adult novels. Bowling Green tutors say they value the way tutoring eases their way into working with students. “It’s a lot of pressure to feel like I might waste the kids’ time, or the teacher’s time,” one student told me during the weekly class on elementary math instruction that also covers effective tutoring practices. “But tutoring feels like a lower-stakes way to get experience that I can really learn from.” Another student, one of the few male education majors in the program, explained that one of the benefits lies in learning how to make effective use of small-group instruction. Both Bowling Green education faculty and students have become convinced that the tutoring placement is essential to building a strong foundation for teaching. They see tutoring not as a replacement for traditional student teaching but as a bridge between observing and leading a classroom. Questions About Teacher Training While it’s widely believed that student teaching is a critical piece of teacher training, the evidence is ambiguous. One2017 studyfound that teachers are more effective when the student demographics where they teach match the student demographics where they were student teachers. Anearlier paperfinds that teacher candidates “exit student teaching feeling more prepared,” though of course it’s hard to know if feeling prepared equates to being prepared. How prepared any teacher is after completing an education-school teacher-preparation program is itself a question. One source of long-held skepticism lies in the minimal difference in teacher performance between traditionally certified and alternatively certified teachers. In a 2006 study of New York City teachers, Thomas Kane, Jonah Rockoff, and Doug Staiger found that certification status predicted almost nothing about teacher quality (see “Photo Finish,”research, Winter 2007). They suggest identifying which teachers, in the real world, are doing the best job and working to retain those teachers matters more than prioritizing one kind of certification over another. It’s hard not to read this as an indictment of education schools if they don’t produce teachers who are better, after several years of a full-time program, than those who complete an alternative program of significantly shorter duration. Could Bowling Green’s willingness to embrace a different strategy be a marker of a long-awaited interest in rethinking education programs? The answer could depend on how widely the tutoring idea catches hold at other institutions. **EdNext in your inbox** Sign up for the EdNext Weekly newsletter, and stay up to date with the Daily Digest, delivered straight to your inbox. Opt in to another list Subscribe A Work in Progress The Bowling Green team is working to adjust the tutoring program as they learn. For 2025–26, they plan to have first-year undergraduates take the college’s required phonics instruction course, currently not offered until spring of sophomore year, so that tutors have that material under their belts before they start helping students at Crim and elsewhere with reading. Not every classroom teacher in the program embraces the definition of “high-impact tutoring”—some don’t always give the Bowling Green students the full 30-minute window, and some ask tutors to work with different students from session to session, even though the gold standard for high-impact tutoring calls for assigning students to a consistent adult. And the current program design may not allow enough time to reap maximum benefits: To give student tutors the chance to work in both math and reading, each spends six weeks tutoring one subject and then switches for the second six weeks. Most tutoring research looks at 10 weeks of tutoring or more. Moreover, that switch often comes with a move to a different classroom or even another school. Bowling Green students say they find it frustrating that, just as they are getting into a routine and developing relationships with the kids, they have to move to another assignment. It’s also frustrating when teachers don’t have much for them to do outside of the 30-minute tutoring block. Some of them end up simply observing the class. And while that might have some value for a future teacher, Bowling Green students say it feels like a missed opportunity. They want to contribute. Everyone remains enthusiastic, Brodeur reports, but nobody thinks the current program is perfect. Still, the early results are encouraging: Crim’s test scores on the Ohio state reading assessment rose in 2024 to 65 percent proficient from 53 percent in spring 2022. Some Crim classroom teachers now request two or three Bowling Green tutors each semester. Says Kellough: “I can’t even imagine what we would do if we didn’t have these tutors. Our gains would start to disappear.” To further the partnership between Crim and Bowling Green, Kellough taught a class in the Bowling Green ed school during the spring 2025 semester. “He was supposed to be teaching a social studies pedagogy class,” said Brodeur, “and he was, but he ended up fielding so many questions from our students about why a teacher would make this choice, or how they could tackle a specific problem. Plus, he is so data-driven. Every semester he runs an orientation with our tutors, and he prints out the data for every student they’ll work with.” Not every principal working with Bowling Green is a Kellough, though all of them, according to Brodeur, are committed to making the experience beneficial for Bowling Green and elementary students alike. More Ed Schools Join the Movement Twenty-seven other educator-prep programs and nonprofits, along with Bowling Green, joined the Aspiring Teachers As Tutors Network launched in 2023 by the national nonprofit Deans for Impact. The members of this collaborative are all working to get more pre-service teachers serving as tutors. EduTutorVA, one of the nonprofit partners, places college students as virtual tutors in Virginia public schools. The students all attend postsecondary institutions in Virginia, with the current cohort of 150 tutors representing 14 different institutions, from community colleges to the flagship state university. About 20 percent of this year’s tutors are education majors, but EduTutorVA executive director Meredith Fortner hopes that share will increase as more education-school deans recognize the value of tutoring as pre-service field experience. Willis Walter, dean of Virginia State University’s education school, is one of those deans. Several VSU education students are working this year as EduTutorVA tutors in Richmond Public Schools, and Walter is pushing his school in the direction of Bowling Green, hoping to make tutoring a degree requirement. He is also leading a conversation among other Virginia education-school deans about what role tutoring should play in teacher training. “Simply observing in classrooms doesn’t do too much for our students,” Walter shared. “The next step is for them to tutor and connect with children in that way. It also helps them understand how today’s students might be different from them, or that the way these students are growing up is different than their own childhood.” Walter says that his VSU students enjoy tutoring. “They all want to be part of people’s lives and want to help students. That’s why many of them got into education in the first place.” Making tutoring a formal part of teacher preparation achieves two goals, according to Walter. “Yes, I want tutoring to be more of a teaching tool in the process of developing teachers,” he said, “but I also want our state legislators and delegates to understand the process of developing educators. The more we can get them to understand the process, the skills, the more they understand just what it means to be a classroom teacher.” Like Shinew in Ohio, Walter wants his students to fully understand what teaching entails before they commit to a classroom position. Fortner would love the Virginia Department of Education to either require or strongly recommend tutoring as a pre-service placement. Her organization, which pays tutors $20 to $30 per hour and has waitlists of both qualified college students and public schools hoping to get tutors, would welcome the support of apprenticeship and workforce dollars. Right now, schools pay nothing. The annual cost of approximately $1,300 per student for 60 tutoring sessions is covered by EduTutorVA through its philanthropic fundraising. At William Ramsay Elementary School in Alexandria, Virginia, Principal Michael Routhouska says the tutoring has had a real impact. Last year, the students who received tutoring jumped from 28 percent proficient to 70 percent proficient on the state reading assessment. The tutors are Black, Latino, Asian, and white, just like the highly diverse student population at Ramsay. Unlike the Bowling Green students, these tutors may not be enrolled in a course offering explicit support, but they do work with a coach provided by EduTutorVA. The coach engages with all of the tutors assigned to a given school, observing multiple tutoring sessions and providing feedback. “The tutors are so open to feedback,” said coach Brenda Tarquinio, a former Alexandria City Public Schools teacher. “I’ve never had a single one push back on anything I share, and they often tell me how helpful this is. They really want to do a good job.” Fortner says several tutors have shared with her that they are switching their majors to education after spending the year tutoring. College students provide a natural source of tutors, and the supply could grow dramatically if more schools of education were to adopt Bowling Green’s approach, building a semester or more of high-impact tutoring into the aspiring teacher’s course of study. Ed schools could also build on EduTutorVA’s approach to create meaningful virtual tutoring opportunities. If one-quarter of the nation’s teacher-education students worked as tutors each year, tutoring three groups of students three times a week (devoting about six hours a week, including planning time), about one million U.S. students could experience high-impact tutoring, and many future teachers would gain the skills and confidence to serve effectively—a win for students, teachers, and the nation. Other organizations, including Teach for America, are also using college students as tutors. ItsTFA Ignite Fellowshippays college students a stipend to tutor a small group of students four days a week in 30-minute sessions for 10 weeks. More than 2,200 college students have served as TFA Ignite Fellows since 2020, and a growing number of them join the TFA Corps as teachers after graduation. If we want tomorrow’s teachers prepared to make the most of sound curricula, appropriately leverage rapidly evolving technology, and understand the needs of 21st-century students, asking them to spend time engaging in the very practices that might yield dramatic results for students, like tutoring, is perhaps just common sense. And perhaps this innovation presents an opportunity to finally reimagine education schools and the preparation of America’s teachers. Liz Cohen is vice president of policy at 50CAN, a research fellow at the Johns Hopkins University Institute for Education Policy, and the author ofThe Future of Tutoring: Lessons from 10,000 School District Tutoring Initiatives(forthcoming, Harvard Education Press). FutureEd, a think tank at Georgetown University’s McCourt School of Public Policy, funded the research and writing of this piece. Last Updated License this Content License this Content Liz Cohen Author Bio Liz Cohen Author Bio **Latest Issue** **Spring 2025** Vol. 25, No. 2 **Latest Issue** **Spring 2025** Vol. 25, No. 2 **The Journal** Spring 2025 Vol. 25, No. 2 Education Next is a journal of opinion and research about education policy. Subscribe Today Sign Up Today **NEWSLETTER** Notify Me When Education Next Posts a Big Story **Business + Editorial Office** Program on Education Policy and GovernanceHarvard Kennedy School79 JFK Street, Cambridge, MA 02138Phone(617) 496-5488EmailEducation_Next@hks.harvard.edu **Discover** About Us The Journal EdFacts Education Next Survey Press Interactive Graphics Contact Us **More Information** Advertise User-Agreement Privacy Policy Reporting Copyright Infringement Guidelines For Submissions Permissions FAQ Copyright © 2025 President & Fellows of Harvard College"}