{"id": 1372, "name": "The Dispatch", "domain": "thedispatch.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://thedispatch.com/article/assessing-claims-about-expunging-the-criminal-records-of-transgender-people/", "title": "Assessing Claims About Expunging The Criminal Records Of Transgender People", "content": "Politics World Events Law Economics Science & Technology Society & Culture Religion Boiling Frogs Capitolism Dispatch Faith Dispatch Weekly The G-File The Morning Dispatch Wanderland Fact Checks Monday Essays Debates Explainers Mailbags Dispatch Live Premium Town Halls Member Experiences Jonah GoldbergLet There Be War Kevin D. WilliamsonThe Totalitarian Tendency and the Confessional Nick CatoggioThe Real Enemy Michael WarrenTrump’s Reality Show Drama Is Back for a Second Season Advisory OpinionsLiberal Justices, Conservative Outcomes The Dispatch PodcastCan Anyone Save the Democrats? The RemnantPunching Hippies The SkiffThe Legacy of Pope Francis Join The Dispatch Gift Memberships Student Sponsorship Program Donate to The Dispatch The Store Politics World Events Law Economics Science & Technology Society & Culture Religion Boiling Frogs Capitolism Dispatch Faith Dispatch Weekly The G-File The Morning Dispatch Wanderland Fact Checks Monday Essays Debates Explainers Mailbags Dispatch Live Premium Town Halls Member Experiences Join The Dispatch Gift Memberships Student Sponsorship Program Donate to The Dispatch The Store Advisory OpinionsLiberal Justices, Conservative Outcomes The Dispatch PodcastCan Anyone Save the Democrats? The RemnantPunching Hippies The SkiffThe Legacy of Pope Francis Jonah GoldbergLet There Be War Kevin D. WilliamsonThe Totalitarian Tendency and the Confessional Nick CatoggioThe Real Enemy Michael WarrenTrump’s Reality Show Drama Is Back for a Second Season Politics World Economics Science & Tech Society & Culture Religion Law SCOTUSblog Newsletters Podcasts Explainers Fact Checks **Assessing Claims About Expunging the Criminal Records of Transgender People** No states have laws that expunge records based on a name change. Facebook (Meta) Twitter (X) LinkedIn Threads Email Audio versions are only available to subscribers of The Dispatch.Join Today! to listen to this post. Are state legislators pushing proposals that would expunge the criminal records of transgender individuals who change their legal names? While several prominent social media accounts have circulated this claim in recent weeks, there is no evidence to suggest these provisions were under consideration by state policymakers. On May 26, the Instagram account “MentorHouse0,” which has more than 500,000 followers, shared a55-second video clipfrom a June 2023 episode of businessman Patrick Bet-David’s video podcast, the PBD Podcast. Thatepisode featuredInfowars’ Alex Jones—a well-known conspiracy theorist and the source ofseveralpreviousDispatch Fact Checkarticles—as a guest. “They’re trying to pass laws in California and other states where once you change your name, and if you’re trans, it expunges your criminal record.”Jones saidin the episode. The viral video clip then shows Adam Sosnick, a financial advice podcaster affiliated with Bet-David, indicating Jones’ claim was true. “Oh, yeah,” he said. “Just change your name, Alex. Now you’re Alexandra Jones—exonerated, you’re good, you owe no money,” Sosnick added, referring to the$1.4 billiona Connecticut jury ordered Jones to pay in 2022 to the families of victims killed in the 2012 Sandy Hook Elementary School shooting following a defamation suit that centered around Jones’ false claim that the massacre was a hoax. “MentorHouse0” did not identify who was speaking in the video clip, that it was taken from the PBD Podcast, or that the clip was nearly two years old. In its caption, it stated, “Credits : Unknown.” Later that day, the X account “Concerned Citizen”—which has nearly 1 million followers and describes itself as a “Conspiracy Realist/Coincidence Analyzer”—tweeted outthe clip, and, in its caption, quoted Jones’ claim about the provisions supposedly being pushed in California and other states. “This is so wrong,” it stated. On May 27, “Defiant L’s”—an X account with 1.5 million followers and affiliated with the right-wing media group Resist the Mainstream—shareda nearly identical tweet, adding, “If true, this is stupid beyond imagination.” There is no evidence behind this claim. While some states have passed “clean slate” legislation in recent years expunging or sealing the records of some convicts, no state has a law doing so explicitly for individuals who undergo either a gender transition or a legal name change. Jones never specified which bill included the supposed provisions he claimed were being pushed. However, around the time the podcast was released, a California law expunging some criminal records was about to go into effect, and, separately, state legislators were considering a bill to make certain public records of transgender minors confidential. In September 2022, California Gov. Gavin Newsom, a Democrat, signed into lawSenate Bill 731, also known as the “Clean Slate Law,” which expanded the types of felony convictions that California would either seal from the public or expunge from that individual’s criminal record. The statute wentinto effecton July 1, 2023, one week after the PBD Podcast episode aired. Under the law, convicted felons who were not sex offenders or found guilty of “serious” or “violent” crimes would see their arrest and conviction records sealed or expunged from public view four years following their conviction, unless they were convicted of a separate felony charge in that time. The criminal history for convicted felons who have their records sealed or expunged under the law is still accessible in background checks for those applying to work in education, law enforcement, or seeking a seat in public office. The law would also not interfere with law enforcement’s ability to access an individual’s criminal history. Furthermore, longstanding California statelaw barssome felons from holding statewide and local public office, and those individuals are still considered ineligible to hold public office under the “Clean Slate Law.” A separate piece of legislation that California policymakers were also considering wasAssembly Bill 223, dubbed the “Transgender Youth Privacy Act,” introduced by Democratic State Assemblymember Chris Ward in January 2023. The bill made itout of committeeon June 13, 2023—11 days before the podcast aired—and was signed into law by Newsom in September of that year. But the “Transgender Youth Privacy Act” did not expunge the criminal record of transgender individuals. Ward’s office confirmed that this law made confidential all records relating to a legal name or gender change for individuals under 18 years old, stating to theDispatch Fact Checkthat its primary purpose was “protecting the privacy of a minor.” As Ward explained when heintroduced thebill, it was intended to ensure that transgender minors in California can live “without fear of retaliation from someone who discovers that information in the public record.” Ward’s office explained that any statement claiming the law expunged criminal offenses from the public record was “false,” and that the bill only sealed petitions filed by a minor to change their gender or sex identifier and name, as well as “any paper associated with the proceedings.” The Dispatch Fact Checkhas reached out toInfowarsand Patrick Bet-David’s company Valuetainment with a request for comment. If you have a claim you would like to see us fact check, please send us an email atfactcheck@thedispatch.com. If you would like to suggest a correction to this piece or any otherDispatcharticle, please emailcorrections@thedispatch.com. **Peter Gattuso** Peter Gattuso is a fact check reporter for The Dispatch, based in Washington, D.C. Prior to joining the company in 2024, he interned at The Dispatch, National Review, the Cato Institute, and the Competitive Enterprise Institute. When Peter is not fact-checking, he is probably watching baseball, listening to music on vinyl records, or discussing the Jones Act. **Gift this article to a friend** Your membership includes the ability to share articles with friends. Share this article with a friend by clicking the button below. Please note that we atThe Dispatchhold ourselves, our work, and our commenters to a higher standard than other places on the internet. We welcome comments that foster genuine debate or discussion—including comments critical of us or our work—but responses that include ad hominem attacks on fellow Dispatch members or are intended to stoke fear and anger may be moderated. With your membership, you only have the ability to comment on The Morning Dispatch articles. Consider upgrading to join the conversation everywhere. **More From The Dispatch** **The Latest** **The Real Enemy** **Let There Be War** **DOGE Looked Broken Before the Trump-Musk Breakup** **School Cellphone Bans Gain Momentum** Speed About About Careers Contact Us FAQs Masthead Submissions Newsletters Boiling Frogs Capitolism Dispatch Faith Dispatch Weekly The G-File The Morning Dispatch Wanderland Podcasts Advisory Opinions The Dispatch Podcast The Remnant The Skiff Subscription Join The Dispatch My Account Login Gift The Dispatch Student Sponsorship Program Donate to The Dispatch The Store Follow Us Opens in new window to The Dispatch's FacebookOpens in new window to The Dispatch's LinkedInOpens in new window to The Dispatch's TwitterOpens in new window to The Dispatch's ThreadsOpens in new window to The Dispatch's YouTube Opens in new window to The Dispatch's Facebook Opens in new window to The Dispatch's LinkedIn Opens in new window to The Dispatch's Twitter Opens in new window to The Dispatch's Threads Opens in new window to The Dispatch's YouTube Opens in new window to The Dispatch's Facebook Opens in new window to The Dispatch's LinkedIn Opens in new window to The Dispatch's Twitter Opens in new window to The Dispatch's Threads Opens in new window to The Dispatch's YouTube AboutAboutCareersContact UsFAQsMastheadSubmissions About Careers Contact Us FAQs Masthead Submissions About Careers Contact Us FAQs Masthead Submissions NewslettersBoiling FrogsCapitolismDispatch FaithDispatch WeeklyThe G-FileThe Morning DispatchWanderland Boiling Frogs Capitolism Dispatch Faith Dispatch Weekly The G-File The Morning Dispatch Wanderland Boiling Frogs Capitolism Dispatch Faith Dispatch Weekly The G-File The Morning Dispatch Wanderland PodcastsAdvisory OpinionsThe Dispatch PodcastThe RemnantThe Skiff Advisory Opinions The Dispatch Podcast The Remnant The Skiff Advisory Opinions The Dispatch Podcast The Remnant The Skiff SubscriptionJoin The DispatchMy AccountLoginGift The DispatchStudent Sponsorship ProgramDonate to The DispatchThe Store Join The Dispatch My Account Login Gift The Dispatch Student Sponsorship Program Donate to The Dispatch The Store Join The Dispatch My Account Login Gift The Dispatch Student Sponsorship Program Donate to The Dispatch The Store Opens in new window to The Dispatch's Facebook Opens in new window to The Dispatch's LinkedIn Opens in new window to The Dispatch's Twitter Opens in new window to The Dispatch's Threads Opens in new window to The Dispatch's YouTube **Get the news, not the drama—straight to your inbox.** © 2025 The Dispatch Privacy Policy Terms & Conditions **Gift this article** Use the options below to copy or email a special link so that friends or family can access this article without a subscription."}