{"id": 2035, "name": "Lifezette", "domain": "lifezette.com", "bias": "fake-news", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.lifezette.com/2025/06/helicopter-team-spots-man-matching-alleged-child-killer-travis-deckers-description-he-flees-into-the-mountains/", "title": "Helicopter Team Spots Man Matching Alleged Child Killer Travis Deckers Description He Flees Into The Mountains", "content": "Home Subscribe News Politics Entertainment Sports Shop Advertise with Us About Us Jobs Contact Us Privacy Policy Terms of Use **Helicopter Team Spots Man Matching Alleged Child Killer Travis Decker’s Description, He Flees Into the Mountains** News Politics Sports Entertainment Shop Get premium content and a completely ad-free experience with a premium subscription today! **Helicopter Team Spots Man Matching Alleged Child Killer Travis Decker’s Description, He Flees Into the Mountains** June 11, 2025 Share Tweet Share Comment Print Law enforcement officials have confirmed they have laid eyes on Travis Decker, the Washington man accused of killing his three young daughters, following a tip from hikers in the Wenatchee Mountains, as reported byTMZ.Decker, a former military serviceman, has been on the run since late May after disappearing with hisdaughters— Paityn, 9, Evelyn, 8, and Olivia, 5 — during a court-ordered visit.Travis Decker – X Screenshot – Chelan County Sheriff’s OfficeTheir bodies were discovered on June 2 near a remote campground in Chelan County, approximately 70 miles northeast of Seattle.Trump's Sovereign Wealth Fund: What Could It Mean For Your Money?MORE NEWS:LA Mayor Karen Bass Does the ‘Everything is Fine’ Meme on Live TV [WATCH]According to the Chelan County Sheriff’s Office, hikers recently contacted authorities after encountering a man matching Decker’s description along a trail in the Enchantments, near Blewett Pass.They may be closing in on Travis Decker!pic.twitter.com/bR1jHrM0rl— A Fin (@BittertotheEnd)June 11, 2025Aerial surveillance was quickly deployed, and one of the department’s helicopter pilots confirmed visual contact with a lone individual fitting Decker’s profile. The man immediately fled upon being spotted.Washington StateMANHUNT INTENSIFIES FOR TRAVIS DECKERLaw enforcement tracks person believed to be Travis Decker into Blewett PassWednesday, June 11, 2025A joint press conference with Sheriff Morrison and a U.S. Marshals Service representative is scheduled for Wednesday,…pic.twitter.com/20QfHvkOAB— S.A. Dupres (@Susan_Dupres)June 11, 2025This Could Be the Most Important Video Gun Owners Watch All YearDo you think President Trump's decision to send troops to LA to control the riots was a good idea?YesNoEmail Address (required)By completing the poll, you agree to receive emails from LifeZette, occasional offers from our partners and that you've read and agree to ourprivacy policyandlegal statement.ResultsVoteChelan County Sheriff Mike Morrison said the manhunt is ongoing, and search teams are now focusing operations in the mountainous region where the sighting occurred.MORE NEWS:Trump Secures Legal Win as Federal Appeals Court Rules Tariffs Stay, For Now [WATCH]Authorities are urging anyone who has recently hiked or camped in the area and noticed unusual activity to call the tipline.“Decker is still at large, but it’s only a matter of time,” Morrison told local media.“We continue to follow up on all leads and are determined to bring him into custody.”It remains unclear whether Decker is armed. Officials say they are preparing for any scenario but are hoping for a peaceful resolution.Law enforcement has emphasized the difficulty of the search due to Decker’s background. He is reportedly trained in military survival tactics and capable of living off-grid for extended periods.MORE NEWS:Anti-ICE Protester Hilariously Roasted Over Her Homemade Tactical Suit, Including Leaf Blower [WATCH]The investigation began when Decker failed to return his daughters to their mother after a court-approved visitation at the end of May.A missing persons alert was issued on May 31, and two days later, the bodies of allthreegirls were discovered near a rural campsite in Chelan County.Authorities are continuing to work with state and federal partners to expand search efforts and monitor the surrounding wilderness areas.Decker is considered extremely dangerous. Officials urge the public not to approach him and instead to report any sightings immediately.Connect with Vetted Off-Duty Cops to Instantly Fulfill Your Security NeedsThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.Contact usfor guidelines on submitting your own commentary. Law enforcement officials have confirmed they have laid eyes on Travis Decker, the Washington man accused of killing his three young daughters, following a tip from hikers in the Wenatchee Mountains, as reported byTMZ. Decker, a former military serviceman, has been on the run since late May after disappearing with hisdaughters— Paityn, 9, Evelyn, 8, and Olivia, 5 — during a court-ordered visit. Their bodies were discovered on June 2 near a remote campground in Chelan County, approximately 70 miles northeast of Seattle. Trump's Sovereign Wealth Fund: What Could It Mean For Your Money? MORE NEWS:LA Mayor Karen Bass Does the ‘Everything is Fine’ Meme on Live TV [WATCH] According to the Chelan County Sheriff’s Office, hikers recently contacted authorities after encountering a man matching Decker’s description along a trail in the Enchantments, near Blewett Pass. They may be closing in on Travis Decker!pic.twitter.com/bR1jHrM0rl — A Fin (@BittertotheEnd)June 11, 2025 Aerial surveillance was quickly deployed, and one of the department’s helicopter pilots confirmed visual contact with a lone individual fitting Decker’s profile. The man immediately fled upon being spotted. Washington State MANHUNT INTENSIFIES FOR TRAVIS DECKER Law enforcement tracks person believed to be Travis Decker into Blewett Pass Wednesday, June 11, 2025 A joint press conference with Sheriff Morrison and a U.S. Marshals Service representative is scheduled for Wednesday,…pic.twitter.com/20QfHvkOAB — S.A. Dupres (@Susan_Dupres)June 11, 2025 This Could Be the Most Important Video Gun Owners Watch All Year Do you think President Trump's decision to send troops to LA to control the riots was a good idea? Chelan County Sheriff Mike Morrison said the manhunt is ongoing, and search teams are now focusing operations in the mountainous region where the sighting occurred. MORE NEWS:Trump Secures Legal Win as Federal Appeals Court Rules Tariffs Stay, For Now [WATCH] Authorities are urging anyone who has recently hiked or camped in the area and noticed unusual activity to call the tipline. “Decker is still at large, but it’s only a matter of time,” Morrison told local media. “We continue to follow up on all leads and are determined to bring him into custody.” It remains unclear whether Decker is armed. Officials say they are preparing for any scenario but are hoping for a peaceful resolution. Law enforcement has emphasized the difficulty of the search due to Decker’s background. He is reportedly trained in military survival tactics and capable of living off-grid for extended periods. MORE NEWS:Anti-ICE Protester Hilariously Roasted Over Her Homemade Tactical Suit, Including Leaf Blower [WATCH] The investigation began when Decker failed to return his daughters to their mother after a court-approved visitation at the end of May. A missing persons alert was issued on May 31, and two days later, the bodies of allthreegirls were discovered near a rural campsite in Chelan County. Authorities are continuing to work with state and federal partners to expand search efforts and monitor the surrounding wilderness areas. Decker is considered extremely dangerous. Officials urge the public not to approach him and instead to report any sightings immediately. Connect with Vetted Off-Duty Cops to Instantly Fulfill Your Security Needs The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.Contact usfor guidelines on submitting your own commentary. Law enforcement officials have confirmed they have laid eyes on Travis Decker, the Washington man accused of killing his three young daughters, following a tip from hikers in the Wenatchee Mountains, as reported byTMZ. Decker, a former military serviceman, has been on the run since late May after disappearing with hisdaughters— Paityn, 9, Evelyn, 8, and Olivia, 5 — during a court-ordered visit. Their bodies were discovered on June 2 near a remote campground in Chelan County, approximately 70 miles northeast of Seattle. Trump's Sovereign Wealth Fund: What Could It Mean For Your Money? MORE NEWS:LA Mayor Karen Bass Does the ‘Everything is Fine’ Meme on Live TV [WATCH] According to the Chelan County Sheriff’s Office, hikers recently contacted authorities after encountering a man matching Decker’s description along a trail in the Enchantments, near Blewett Pass. They may be closing in on Travis Decker!pic.twitter.com/bR1jHrM0rl — A Fin (@BittertotheEnd)June 11, 2025 Aerial surveillance was quickly deployed, and one of the department’s helicopter pilots confirmed visual contact with a lone individual fitting Decker’s profile. The man immediately fled upon being spotted. Washington State MANHUNT INTENSIFIES FOR TRAVIS DECKER Law enforcement tracks person believed to be Travis Decker into Blewett Pass Wednesday, June 11, 2025 A joint press conference with Sheriff Morrison and a U.S. Marshals Service representative is scheduled for Wednesday,…pic.twitter.com/20QfHvkOAB — S.A. Dupres (@Susan_Dupres)June 11, 2025 This Could Be the Most Important Video Gun Owners Watch All Year Do you think President Trump's decision to send troops to LA to control the riots was a good idea? Chelan County Sheriff Mike Morrison said the manhunt is ongoing, and search teams are now focusing operations in the mountainous region where the sighting occurred. MORE NEWS:Trump Secures Legal Win as Federal Appeals Court Rules Tariffs Stay, For Now [WATCH] Authorities are urging anyone who has recently hiked or camped in the area and noticed unusual activity to call the tipline. “Decker is still at large, but it’s only a matter of time,” Morrison told local media. “We continue to follow up on all leads and are determined to bring him into custody.” It remains unclear whether Decker is armed. Officials say they are preparing for any scenario but are hoping for a peaceful resolution. Law enforcement has emphasized the difficulty of the search due to Decker’s background. He is reportedly trained in military survival tactics and capable of living off-grid for extended periods. MORE NEWS:Anti-ICE Protester Hilariously Roasted Over Her Homemade Tactical Suit, Including Leaf Blower [WATCH] The investigation began when Decker failed to return his daughters to their mother after a court-approved visitation at the end of May. A missing persons alert was issued on May 31, and two days later, the bodies of allthreegirls were discovered near a rural campsite in Chelan County. Authorities are continuing to work with state and federal partners to expand search efforts and monitor the surrounding wilderness areas. Decker is considered extremely dangerous. Officials urge the public not to approach him and instead to report any sightings immediately. Connect with Vetted Off-Duty Cops to Instantly Fulfill Your Security Needs The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.Contact usfor guidelines on submitting your own commentary. **Join the Discussion** COMMENTS POLICY:We have no tolerance for messages of violence, racism, vulgarity, obscenity or other such discourteous behavior. Thank you for contributing to a respectful and useful online dialogue. Δ Δ **Trending Stories** **Democrat Civil War Explodes: DNC Chair Threatens to Quit Over David Hogg [WATCH]** **Tom Homan Slaps LA Rioters and Their Backers with a Hard Reality Check [WATCH]** **Greta Thunberg’s ‘Gaza Cruise’ Stopped by the Israeli Navy, Her Hypocrisy Exposed [WATCH]** **Recent Stories** **LA Mayor Karen Bass Does the ‘Everything is Fine’ Meme on Live TV [WATCH]** **Trump Secures Legal Win as Federal Appeals Court Rules Tariffs Stay, For Now [WATCH]** **Anti-ICE Protester Hilariously Roasted Over Her Homemade Tactical Suit, Including Leaf Blower [WATCH]** News Politics Sports Entertainment Shop Advertise· About Us· Contact Us· Privacy Policy· Search· Back to Top· Facebook Twitter Instagram RSS © 2025 LifeZette –ALL RIGHTS RESERVED. Designed & Developed byPrecision Creations"}