{"id": 810, "name": "La Junta Tribune-Democrat", "domain": "lajuntatribunedemocrat.com", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.lajuntatribunedemocrat.com/manzanola-united-methodist-church-added-to-national-register-of-historic-places/", "title": "Manzanola United Methodist Church Added To National Register Of Historic Places", "content": "Home News Sports Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Contact Us Careers Subscribe Login Subscribe Login Home News Sports Entertainment Lifestyle Opinion ObituariesSubmit an Obituary Submit an Obituary Submit an Obituary ClassifiedsSubmit a ClassifiedJobs Submit a Classified Jobs Submit a Classified Jobs LegalsSubmit a Legal Notice Submit a Legal Notice Submit a Legal Notice Digital Issues Subscribe Login **Manzanola United Methodist Church added to National Register of Historic Places** June 10, 2025 News,Newsletter-Early-Week Login Sign Up Now Fowler School Board hires assistants, sets meeting dates Bent’s Old Fort commemorates the 250th birthday of the U.S. Army, Flag Day Manzanola United Methodist Church added to National Register of Historic Places Remick among 22 semifinalists for 2026 Colorado Teacher of the Year Hope Mitchell named to Missouri State University’s spring 2025 dean’s list Baseball: All-State teams announced for 2025 season How to remain positive in a negative world Colorado State Patrol warns riders to respect the Colorado lane filtering law 46 senior golfers enjoy LJ Golf Course Black Hills Energy advances wildfire prevention strategy, Public Safety Power Shutoff program in development Fowler School Board hires assistants, sets meeting dates Bent’s Old Fort commemorates the 250th birthday of the U.S. Army, Flag Day Manzanola United Methodist Church added to National Register of Historic Places Remick among 22 semifinalists for 2026 Colorado Teacher of the Year Hope Mitchell named to Missouri State University’s spring 2025 dean’s list Baseball: All-State teams announced for 2025 season How to remain positive in a negative world Colorado State Patrol warns riders to respect the Colorado lane filtering law 46 senior golfers enjoy LJ Golf Course Black Hills Energy advances wildfire prevention strategy, Public Safety Power Shutoff program in development **Other News** June 10, 2025 June 10, 2025 June 10, 2025 Home About Accessibility Archives Community Rules Contact Us Cookie Policy Privacy Policy Terms of Service Copyright © 2025 La Junta Tribune-Democrat, aCherryRoad MediaNewspaper. All rights reserved."}