{"id": 1714, "name": "Europe Reloaded", "domain": "europereloaded.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.europereloaded.com/orban-calls-on-french-patriots-to-help-save-europe-from-the-brussels-guillotine-in-fiery-rally-speech/#mh-comments", "title": "Orban Calls On French Patriots To Help Save Europe From The Brussels Guillotine In Fiery Rally Speech", "content": "HOME ABOUT HEALTH GOVERNMENT SOCIETY WORLD TYRANNY COMMENTARY ENVIRONMENT MEDIA FINANCIAL MILITARY [ June 11, 2025 ]LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los AngelesGOVERNMENT [ June 11, 2025 ]Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual AssaultGOVERNMENT [ June 11, 2025 ]Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing MagGOVERNMENT [ June 11, 2025 ]Poland’s Tusk set to win confidence vote, but faces uphill slog to governGOVERNMENT [ June 10, 2025 ]RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of CorruptionGOVERNMENT **Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech** June 10, 2025GOVERNMENT0 . Somebody at Politico was having fun with their title — **Beer-soaked nationalist rally in rural France turns into Marine Le Pen love-fest** Here are two normal-sounding paragraphs — An all-star lineup of European nationalists including Hungary’s Viktor Orbán, Italy’s Matteo Salvini, Czechia’s Andrej Babiš and Spain’s Santiago Abascal joined Le Pen in the small village of Mormant-sur-Vernisson, population 133, tocelebrate one year since the parties that make up the Patriots for Europe group scored a major win in the European election. Organizers said more than 6,000 people were in attendance, mostly supporters of Le Pen’s National Rally from the local area, with some traveling from further afield. And — The strongest words of support for Le Pen came from Hungary’s Viktor Orbán, who made the 1,200-kilometer trip to France to back his ally. Orbán lauded his “long-time friend” as a “courageous fighter” who “doesn’t betray” and “doesn’t let you down.” *** C’est aujourd’hui la fête de la Victoire 🇨🇵💪 avec les alliés Européens 💪 On vous attend nombreux a#MormantSurVernisson💪 Qui y sera ?#TousAvecLeRNpic.twitter.com/EQEEhv9EpO — Tous avec le RN (@marinejordanrn)June 9, 2025 🚨 C’est dans 3 jours. Marine Le Pen et Jordan Bardella seront avec les chefs des partis européens Patriotes a#MormantSurVernissona 11h30 💪 Venez nombreux 💪🇨🇵 🥰#TousAvecLeRNpic.twitter.com/H5wKDSw7ld — Tous avec le RN (@marinejordanrn)June 6, 2025 Marine, Marine …#FetedelaVictoire#mormantsurvernisson#RNpic.twitter.com/ltuuYYrxnt — Antho Ⓜ️ (@MAnthoParis)June 9, 2025 Translation: Today, Mormant-sur-Vernisson was the center of Europe! Patriots from across the continent gathered to celebrate the resounding French victory of June 9, 2024, which will go down in history as the beginning of the revolt of nations against the European superstructure! 🔴 Aujourd’hui, Mormant-sur-Vernisson était le centre de l’Europe ! Les patriotes des 4 coins du continent s’étaient réunis pour célébrer l’éclatante victoire française du 9 juin 2024, qui restera marquée dans l’histoire comme le début de la révolte des nations face à la…pic.twitter.com/mptuIOzbtD — Aymeric Durox (@AymericDurox)June 9, 2025 ******** **Orbán’s Fiery Speech: Hungary as Europe’s Final Bastion of Christianity against Brussels** *** **Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech** **THOMAS BROOKE for REMIX NEWS** “France is a great power,” Orbán told the crowd, “and Hungary is a small country with 11 million people, modest GDP, and limited military strength. But what makes Hungary interesting is its politics. We are the black sheep of the European Union. Brussels’ nightmare. The hope of Europe’s patriots. And the last bastion of Christians.” Orbán acknowledged the historical distance between Hungary and France, but said the nations are now united in a shared struggle.Recalling esteemed French writer Victor Hugo’s praise of Hungarian heroism and philosopher Albert Camus’ words about the 1956 Hungarian Uprising, he cast Hungary as a nation forged in resistance — and today, once again resisting ideological occupation. “I was born in a communist dictatorship under Soviet occupation. We had to fight for freedom and democracy,” he said. “The intellectual bureaucrats in Brussels who criticize Hungary have no idea what it means to fight for your country.” 🇭🇺@PM_ViktorOrban: “What is happening is not migration. It’s an organized exchange of people to replace Europe’s cultural base. “For us, €1 million a day is a lot of money, but we’d rather pay than let anyone in illegally. It’s the best investment for the future.”pic.twitter.com/AZi3Yqqfl8 — Remix News & Views (@RMXnews)June 9, 2025 The Hungarian leader accused Brussels and Western elites of attempting todismantle national identity, Christianity, and the family.He said Hungary had witnessed a cultural siege over the past two decades, with global corporations, progressive NGOs, and foreign-funded media taking over national institutions. “For them, the family, the nation, and Christianity were just a joke,” he said. He outlined his government’s response: a new constitution that enshrines national sovereignty and Christian values, a total rejection of illegal migration, and laws that define “a father as a man and a mother as a woman.” He said that protecting children now takes precedence over all other rights, and that illegal border crossings are treated as crimes. “Only those with prior authorization may enter Hungarian territory,” he said. ************ **••••** The Liberty Beacon Projectis now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB) **••••** Comment Policy:As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning. **••••** Disclaimer:TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of“fair use”in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than“fair use”you must request permission from the copyright owner. **••••** Disclaimer:The information and opinions shared are for informational purposes only including, but not limited to, text, graphics, images and other material are not intended as medical advice or instruction. Nothing mentioned is intended to be a substitute for professional medical advice, diagnosis or treatment. **Share this:** Click to share on Facebook (Opens in new window)Facebook Click to share on X (Opens in new window)X EU Patriots European elections 2024 Marine Le Pen Matteo Salvini Mormant-sur-Vernisson Patriots for Europe rally Thomas Brooke Remix News Viktor Orban **Related Articles** **EU: Politicizing the Internet Already Underway** **New French Law Proposing Health Dictatorship Temporarily Retracted** **Le Pen & Trump aren’t even close – are we stuck with Emmanuel Macr-Obama?** **Leave a Reply** Your email address will not be published. Comment Name* Email* Website Notify me of follow-up comments by email. Notify me of new posts by email. LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los AngelesJune 11, 20250 LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los Angeles LA Mayor Declares Local Emergency, Issues A Curfew For Downtown Los Angeles Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual AssaultJune 11, 20250 Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual Assault Anti-Migrant Riots Erupt in Northern Ireland After “Romanian Teenagers” Charged With Sexual Assault Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing MagJune 11, 20250 Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing Mag Press Freedom at Stake (Again): Germany Weighs Ban on Right-Wing Mag Poland’s Tusk set to win confidence vote, but faces uphill slog to governJune 11, 20250 Poland’s Tusk set to win confidence vote, but faces uphill slog to govern Poland’s Tusk set to win confidence vote, but faces uphill slog to govern RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of CorruptionJune 10, 20250 RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of Corruption RFK Jr. Orders Clean Sweep of Entire CDC Vaccine Advisory Panel to End Decades of Corruption 100,000 Protest in Madrid Against Sánchez’s ‘Mafia’ GovernmentJune 10, 20250 100,000 Protest in Madrid Against Sánchez’s ‘Mafia’ Government 100,000 Protest in Madrid Against Sánchez’s ‘Mafia’ Government Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speechJune 10, 20250 Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech Orbán calls on French patriots to help ‘save Europe from the Brussels guillotine’ in fiery rally speech Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border ChecksJune 10, 20250 Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border Checks Fed Up with Migrant Chaos, Dutch Citizens Set Up DIY Border Checks Thousands attend ‘Ireland Says No’ Rally in CorkJune 9, 20250 Thousands attend ‘Ireland Says No’ Rally in Cork Thousands attend ‘Ireland Says No’ Rally in Cork Los Angeles Warzone: “Insurrectionist Mobs” Attack Cops, Set Fires, Block 101 FreewayJune 9, 20250 Los Angeles Warzone: “Insurrectionist Mobs” Attack Cops, Set Fires, Block 101 Freeway Los Angeles Warzone: “Insurrectionist Mobs” Attack Cops, Set Fires, Block 101 Freeway Copyright © 2012 - 2025 | TLB Project™ LLC"}