{"id": 265, "name": "Common Cause", "domain": "commoncause.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.commoncause.org/work/trumps-budget-plan-a-direct-attack-on-medicaid-snap-and-climate-programs/", "title": "Trumps Budget Plan A Direct Attack On Medicaid Snap And Climate Programs", "content": "On June 14, NO KINGS mobilizes nationwide against Trump’s abuses.Find an Event Skip to navigationAccesskey \"n\" Skip to contentAccesskey \"c\" Skip to footerAccesskey \"f\" Search Menu PrioritiesPrioritiesFeatured IssuesVoting & Fair RepresentationMedia & TechnologyAnti-Corruption & AccountabilityCivil Rights & Civil LibertiesSee All IssuesFeatured WorkTrump’s Budget Plan: A Direct Attack on Medicaid, SNAP, and Climate ProgramsCampaignTrump’s Budget Plan: A Direct Attack on Medicaid, SNAP, and Climate Programs Voting & Fair Representation Media & Technology Anti-Corruption & Accountability Civil Rights & Civil Liberties See All Issues Campaign Voting & Fair Representation Media & Technology Anti-Corruption & Accountability Civil Rights & Civil Liberties See All Issues Campaign Our Impact Search Take Action DonateDonate to Common CauseGive MonthlyJoin Or Renew Your MembershipOther Ways to Give Donate to Common Cause Give Monthly Join Or Renew Your Membership Other Ways to Give Donate to Common Cause Give Monthly Join Or Renew Your Membership Other Ways to Give National Choose Your StatePlease select:ArizonaCaliforniaColoradoConnecticutDelawareFloridaGeorgiaHawaiiIllinoisIndianaMarylandMassachusettsMichiganMinnesotaNebraskaNew MexicoNew YorkNorth CarolinaOhioOregonPennsylvaniaRhode IslandTexasVirginiaWisconsin Updates About Us Research & Resources EnglishPlease select:EnglishSpanishTagalogVietnameseFrenchArabicKoreanGermanRussian Close Search Campaign Anti-Corruption & Accountability: Working For The People Government Transparency Money in Politics Protecting Dissent Stopping Voter Suppression Trump Administration Accountability Voting & Fair Representation: Protecting Your Voice x facebook email Right now, Donald Trump is pushing a slash-and-burn agenda — and trying to turn it into law. As working Americans struggle with rising costs and the impact of Trump’s tariffs, they’re leading an effort to rip hundreds of billions of dollars from the programs that keep our communities fed, healthy, and safe from pollution. **What’s in Trump’s Budget Bill?** **Cuts to Medicaid, SNAP, and Climate Funding** The bill Trump and his allies are rushing through Congress would: Kick7.6 million Americans off Medicaid Gut SNAPbenefits for families in need Slash funding for climate action All to bankroll Trump’smass deportation machineand give more handouts to the top 1%.See what’s in the bill **This Bill Doesn’t Balance the Budget — It Reshapes America for the Ultra-Wealthy** This bill wouldn’t balance the budget — because that was never the goal.It’s a calculated power grab designed toreshape American life for the benefit of the billionaire class, and they’re counting on us to be too distracted, divided, or exhausted to fight back. **Real People Will Suffer if This Budget Becomes Law** This fight isn’t just about the federal budget. It’s aboutprotecting our health, rights, and democracy: Families will lose healthcare coverage. Kids will go hungry as food assistance is gutted. Communities will face more pollution with fewer environmental protections. Voices will be silenced for challenging those in power. **Hidden Extremist Policies: AI Deregulation and Attacks on Nonprofits** Trump’s allies are using this bill to sneak in extremist provisions, including: A10-year exemption for AI companiesfrom state regulation — blocking local efforts to fight deepfakes and AI-driven election lies.Read more A provision that could allow Trump toshut down nonprofitshe disagrees with.Thanks to public pressure, this language was removed — but it could return.More info **Join the Movement: Stop Trump’s Extremist Budget** We’ve faced threats like this before. And every time, it’sdemocracy activists like youwho’ve risen up to protect our values. OurPeople’s Promisemobilization—which we recently launched to run all summer long—is all about giving ordinary folks like us the seat at the table we deserve. Members of Congress work for us—and we can’t let them spend another day ignoring our wants, hopes, and needs as they spend our tax dollars and make decisions that affect every aspect of our lives. Join us in taking action atPeoplesPromise.us Petition April 30, 2025 Trump had his 100 days. Now it’s our turn. President Trump and his allies have spent the past 100 days attacking our rights, undermining our democracy, and enriching the ultra-wealthy, while driving up the cost of living for working-class Americans. It’s a deliberate strategy to distract and divide us while they seize power and wealth. We see through their games. It’s time to join together and demand something different — not just by resisting their agenda, but by offering our own that guarantees justice, equality,... Take Action **Your financial support helps us make an impact byholding power accountableand strengthening democracy.** Donate **Updates** See all Related Articles Blog Post May 23, 2025 Article March 13, 2025 Blog Post January 28, 2025 Article February 26, 2025 Article March 25, 2025 Article November 12, 2024 Article March 14, 2025 Article November 13, 2024 Receive breaking news, action opportunities, and democracy resources. By providing your phone number, you are consenting to receive mobile alerts from Common Cause at 95559. Message and data rates apply. *By providing your phone number, you are consenting to receive mobile alerts from Common Cause at 95559. Message and data rates apply. Show your support with Common Cause merchandise. Visit the Shop Press Join Our Volunteer Team Careers Financials Contact Us Youth Engagement facebook x tiktok youtube instagram threads bluesky ©Copyright Common CauseWebsite Policies Made withbycreatives with a conscience Close EnglishPlease select:EnglishSpanishTagalogVietnameseFrenchArabicKoreanGermanRussian PrioritiesVoting & Fair RepresentationMedia & TechnologyAnti-Corruption & AccountabilityCivil Rights & Civil LibertiesSee All Issues Voting & Fair Representation Media & Technology Anti-Corruption & Accountability Civil Rights & Civil Liberties See All Issues Voting & Fair Representation Media & Technology Anti-Corruption & Accountability Civil Rights & Civil Liberties See All Issues Our Impact Take Action DonateDonate to Common CauseGive MonthlyJoin Or Renew Your MembershipOther Ways to Give Donate to Common Cause Give Monthly Join Or Renew Your Membership Other Ways to Give Donate to Common Cause Give Monthly Join Or Renew Your Membership Other Ways to Give Updates About Us Research & Resources facebook x tiktok youtube instagram threads bluesky Close Want to see what's happening in your state? Go to Common Cause {state}"}