{"id": 1965, "name": "Feminist Current", "domain": "feministcurrent.com", "bias": "left", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.feministcurrent.com/2024/03/06/emma-thomas-father-came-out-as-trans-when-she-was-nine-now-she-fights-to-protect-kids-like-her/#respond", "title": "Emma Thomas Father Came Out As Trans When She Was Nine Now She Fights To Protect Kids Like Her", "content": "AboutInformationDonate Information Donate Information Donate ReadNewsCommentaryInterviewsWhat’s CurrentThe Personal is PoliticalReviews News Commentary Interviews What’s Current The Personal is Political Reviews News Commentary Interviews What’s Current The Personal is Political Reviews ListenPodcast Episodes Podcast Episodes Podcast Episodes Donate Shop AboutInformationDonate Information Donate Information Donate ReadNewsCommentaryInterviewsWhat’s CurrentThe Personal is PoliticalReviews News Commentary Interviews What’s Current The Personal is Political Reviews News Commentary Interviews What’s Current The Personal is Political Reviews ListenPodcast Episodes Podcast Episodes Podcast Episodes Donate Shop **Emma Thomas’ father ‘came out’ as trans when she was nine—now she fights to protect kids like her** It’s only recently that we are beginning to hear the stories of family members of men who have begun identifying as women, from the “trans widow” to, now, the children of transitioners. I discovered Emma Thomas, founder of the campaign group,Children of Transitioners, after aletterfrom the University of Sussex Hospitals NHS Trust responding to Emma’s group, who hadquestionedthe trust on their “perinatal care policy for trans and non binary people policy,” was leaked. Children of Transitioners had inquired about “safeguarding concerns about the sexual and emotional abuse of babies and children of transitioners” and asked about evidence supporting the claim that “male secretions” (that is to say, the “lactation” trans identified males claim they can produce to “breastfeed” babies) are “safe and beneficial for infants.” In the letter, the NHS uses terms like “human milk” as it is “neutral and not gender biased,” andclaimsthe “milk” produced by trans-identified men after taking a combination of drugs is “comparable to that produced following the birth of a baby.” As I looked further into Emma’s story, I found she has very important insight into the adult transexual male, and the impact these men can have as fathers of children. In this episode, I speak with her about her childhood, her father, and her concerns about protecting kids and babies from trans ideology. Enjoy fiercely independent, women-led media? Support Feminist Current!$Donation Amount:Donate NowSelect Payment MethodPayPalPersonal InfoFirst Name*Last NameEmail Address*Donation Total:$5Donate To AddressDonate Via WalletsBitcoinEthereumLitecoinDonate Bitcoin to this addressScan the QR code or copy the address below into your wallet to send some BitcoinReveal QR CodeDonate Ethereum to this addressScan the QR code or copy the address below into your wallet to send some EthereumReveal QR CodeDonate Litecoin to this addressScan the QR code or copy the address below into your wallet to send some LitecoinReveal QR CodePlease Add coin wallet address in plugin settings panel **Enjoy fiercely independent, women-led media? Support Feminist Current!** PayPal First Name* Last Name Email Address* Donation Total:$5 Bitcoin Ethereum Litecoin **Donate Bitcoin to this address** Scan the QR code or copy the address below into your wallet to send some Bitcoin **Donate Ethereum to this address** Scan the QR code or copy the address below into your wallet to send some Ethereum **Donate Litecoin to this address** Scan the QR code or copy the address below into your wallet to send some Litecoin **Enjoy fiercely independent, women-led media? Support Feminist Current!** PayPal First Name* Last Name Email Address* Donation Total:$5 Bitcoin Ethereum Litecoin **Donate Bitcoin to this address** Scan the QR code or copy the address below into your wallet to send some Bitcoin **Donate Ethereum to this address** Scan the QR code or copy the address below into your wallet to send some Ethereum **Donate Litecoin to this address** Scan the QR code or copy the address below into your wallet to send some Litecoin Meghan Murphy is a freelance writer and journalist from Vancouver, BC. She has been podcasting and writing about feminism since 2010 and has published work in numerous national and international publications, including The Spectator, UnHerd, Quillette, the CBC, New Statesman, Vice, Al Jazeera, The Globe and Mail, and more. Meghan completed a Masters degree in the department of Gender, Sexuality and Women’s Studies at Simon Fraser University in 2012 and is now exiled in Mexico with her very photogenic dog. If the work we produce here at Feminist Current is work that you value and support, please consider donating. Your support means the world. Thank you. CONTRIBUTE TODAY About Read Listen Donate Shop Copyright © 2021. Feminist Current AboutInformationDonate Information Donate Information Donate ReadNewsCommentaryInterviewsWhat’s CurrentThe Personal is PoliticalReviews News Commentary Interviews What’s Current The Personal is Political Reviews News Commentary Interviews What’s Current The Personal is Political Reviews ListenPodcast Episodes Podcast Episodes Podcast Episodes Donate Shop About Read Listen Donate Shop Our site uses cookies. Learn more about our use of cookies:Cookie Policy"}