{"id": 468, "name": "WSYM - Lansing News", "domain": "fox47news.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.fox47news.com/neighborhoods/delhi-township-holt-and-southside-lansing/eaton-county-considers-deep-cuts-to-mental-health-services-following-failed-public-safety-millage", "title": "Eaton County Considers Deep Cuts To Mental Health Services Following Failed Public Safety Millage", "content": "Menu Neighborhood NewsCharlotte & Eaton RapidsDansville, Leslie, Mason & StockbridgeDelhi Twp - Holt - Dimondale - Southside LansingDelta Township & Grand LedgeDeWitt & St. JohnsDowntown, Old Town & REO TownEast Lansing, Haslett, Okemos & WilliamstonJackson & Hillsdale CountiesMSU CampusState CapitolGood NeighborsWeek of Kindness Charlotte & Eaton Rapids Dansville, Leslie, Mason & Stockbridge Delhi Twp - Holt - Dimondale - Southside Lansing Delta Township & Grand Ledge DeWitt & St. Johns Downtown, Old Town & REO Town East Lansing, Haslett, Okemos & Williamston Jackson & Hillsdale Counties MSU Campus State Capitol Good Neighbors Week of Kindness Charlotte & Eaton Rapids Dansville, Leslie, Mason & Stockbridge Delhi Twp - Holt - Dimondale - Southside Lansing Delta Township & Grand Ledge DeWitt & St. Johns Downtown, Old Town & REO Town East Lansing, Haslett, Okemos & Williamston Jackson & Hillsdale Counties MSU Campus State Capitol Good Neighbors Week of Kindness WeatherWeather HomeNeighborhood Hourly Planner7-DayLive RadarAlertsSchool Closings & Delays3 Degree GuaranteeWeather Kids Weather Home Neighborhood Hourly Planner 7-Day Live Radar Alerts School Closings & Delays 3 Degree Guarantee Weather Kids Weather Home Neighborhood Hourly Planner 7-Day Live Radar Alerts School Closings & Delays 3 Degree Guarantee Weather Kids Things to Do Scripps News GroupState CapitolState NewsNationalExcellence In EducationDont Waste Your Money State Capitol State News National Excellence In Education Dont Waste Your Money State Capitol State News National Excellence In Education Dont Waste Your Money SportsLocal SportsCollege BasketballCollege FootballLionsPistonsPress PassRed WingsTigersWorld Cup Soccer Local Sports College Basketball College Football Lions Pistons Press Pass Red Wings Tigers World Cup Soccer Local Sports College Basketball College Football Lions Pistons Press Pass Red Wings Tigers World Cup Soccer Contests Download FOX 47 Apps Morning Blend Excellence In Education Give A Book Donation Page About UsAdvertise With UsContact UsNews StaffStaffSupportJobsSAP Programming ProblemsTV ListingsNews Tips Advertise With Us Contact Us News Staff Staff Support Jobs SAP Programming Problems TV Listings News Tips Advertise With Us Contact Us News Staff Staff Support Jobs SAP Programming Problems TV Listings News Tips Banking on Business Brightest and Best Michigan Trivia Sign In Newsletters Sign Out Manage Emails Apps Careers Search Home In Your Neighborhood Charlotte & Eaton Rapids Dansville, Leslie, Mason & Stockbridge Delhi Township, Holt & Southside Lansing Delta Township & Grand Ledge Dewitt & St. Johns Downtown, Old Town & REO Town East Lansing, Haslett, Okemos, Webberville & Williamston Jackson & Hillsdale Counties MSU Campus State Capitol **Actions** Facebook Tweet Email **Eaton County considers deep cuts to mental health services following failed public safety millage** LANSING, Mich. — LANSING, Mich. — After a public safety millage failed in May in Eaton County, local officials are looking at making budget cuts that could significantly impact mental health services in the area. • Proposed cuts include a 30 percent reduction to community mental health funding.• Mental health providers worry about their ability to serve clients if cuts are approved.• The Barry-Eaton District Health Department could face 25% cuts, while Capital Area United Way could lose 75% of county funding. WATCH: Eaton County mental health services face potential cuts after failed millage According to Eaton County officials, these proposed cuts will affect mental health clinics throughout the region, potentially limiting access to critical services for residents. I spoke with Sheryl Fosgate, a therapist at Lansing Counseling, who expressed deep concern about the potential impact. \"Please please don't forget the people that are down here that are being the most impacted by what's going on here,\" Fosgate said. Fosgate has major concerns for her clinic and the mental health of our neighbors. \"My major concern is the impact of our clients,\" Fosgate said. \"There's a lot of unrest, and people are very unsure and uncomfortable. And they are seeking out mental health more now than before,\" she said. Rebecca Cox, the Clinical supervisor at Lansing Counseling, says this potential cut would directly affect their clientele. \"That means they'll have to take fewer clients. They'll have to lay off some folks or folks might leave their job because they are worried about stability and the ability to make money,\" Cox said. According to Cox, neighbors might have to go elsewhere for mental health services. She says more neighbors would need to take a longer drive to other counties for counseling. \"It's possible that we could get some clients from that area. We see people from all three counties so it could increase our caseload,\" Cox said. \"I think everybody deserves the opportunity and the space to get the help they need when they need it,\" she said. This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking NewsNewsletter.** **GRAND LEDGE NEIGHBORS: Do you have a story idea? Let's Talk!** **GRAND LEDGE NEIGHBORS: Do you have a story idea? Let's Talk!** Neighborhood News Neighborhood Weather Planner Rebound Jobs at FOX 47 Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Public File Contact FCC Application Accessibility Statement Scripps Media Trust Center Closed Captioning Contact fox47news fox47news FOX47News UCa7XAqQh4gzBgPGwTTF0ofg"}