{"id": 1998, "name": "The Indian Express", "domain": "indianexpress.com", "bias": "left-center", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://indianexpress.com/article/entertainment/television/navjot-singh-sidhu-says-he-had-one-condition-regarding-archana-puran-singh-before-returning-to-kapil-sharmas-show-how-can-i-be-the-reason-of-10059926/", "title": "Navjot Singh Sidhu Says He Had One Condition Regarding Archana Puran Singh Before Returning To Kapil Sharmas Show How Can I Be The Reason Of 10059926", "content": "Bollywood Hollywood Videos Television Tamil Telugu Malayalam Web series News Entertainment Television Navjot Singh Sidhu says he put one condition regarding Archana Puran Singh before returning to Kapil Sharma's show: 'How can I be the reason of...' **Navjot Singh Sidhu says he put one condition regarding Archana Puran Singh before returning to Kapil Sharma’s show: ‘How can I be the reason of…’** **Navjot Singh Sidhu is all set to return to Kapil Sharma's show after a gap of nearly six years. He will return as permanent guest on the Netflix show alongside Archana Puran Singh.** Netizens were delighted after Netflix announced that the third season of The Great Indian Kapil Show will markthe comeback of former cricketer and politician Navjot Singh Sidhu.This will mark his return as the permanent guest of the show after nearly six years. Ahead of his comeback, Navjot Singh Sidhu shared a vlog on his YouTube channel claiming how he played a key role in helping Kapil Sharma have his independent show about 13 years ago. **Navjot Singh Sidhu was instrumental in Kapil Sharma getting his first show** Speaking to his viewers,Navjot Singh Sidhurecalled the days when he judged the show The Great Indian Laughter Challenge which became the origin of talents like Kapil Sharma and Bharti Singh. He said, “Kapil Sharma rose to fame after he appeared in the show Laughter Challenge. Later, he was exploited in Comedy Circus, he didn’t have an identity of his own.” He added, “After my Bigg Boss stint, Kapil Sharma came to me and said, ‘Paaji, I have a request. If you will agree to be part of my show, they will give me an independent show.’ I was like who, ‘He said Raj Nayak sahab’. Raj Nayak was the head of Colors back then. He wanted me to be the judge of the show. He wanted me as he wanted to increase the channel’s TRP. We met over breakfast and I agreed to do it.” **‘I brought Dharmendra as the first guest on Kapil’s show’** Sidhu shared that he actively took part in suggesting ideas to Kapil for his independent show and took credit in making it a huge success. “I suggested Kapil Sharma to work on the show’s format and how he should present it. When I came, we didn’t have any guest. I suggested him to bringDharmendraon show, and he did. When he came and shared rare anecdotes from his life and journey as an actor, it took the show’s TRP to another level. I had to leave the show for political reasons. Ever since, people missed me on the show and requested me to be back on the show.” **‘Came back to Kapil’s show on public demand’** Sidhu said it was the audience love that has brought his life to full circle with him once again returning to the show. “On public demand, I made a rare appearance on the show with my wife and the amount of love I received was overwhelming. Now, that I am returning to the show it is like a home run for me. Ghar wapsi.” ALSO READ | Arbaaz Khan confirms wife Sshura’s pregnancy, embracing fatherhood at 57: ‘Becoming a dad after a long gap is a…’ In the same vlog, Sidhu also shared how he requested Netflix to keep Archana Puran Singh in the show despite his return. “When it came to Archana Puran Singh, I just said one thing, ‘I am a devotee of Goddess Durga, how can I be the reason for her losing her job?’ I requested the makers to keep and her and now we will both appear on the show together. We are finally back together. All of us, Sunil Grover, Krushna Abhishek, we are all part of the same engine.” Two days ago, the makers of The Great Indian Kapil Show took to Netflix’s official Instagram handle to share the return of Navjot Singh Sidhu. Sharing a video featuring Kapil Sharma, Archana Puran Singh and Navjot Singh Sidhu, the makers wrote, “Ek kursi paaji ke liye please. Har Funnyvaar Badhega Humara Parivaar with the comeback of Navjot Singh Sidhu & Archana Puran Singh. Watch them in the new season of The Great Indian Kapil Show, streaming from 21st June, at 8 PM only on Netflix.” The news attracted a lot of attention from fans who expressed their excitement for the return of Navjot Singh Sidhu. The former cricketer resigned the show in 2019 after his comment on the Pulwama attack received severe backlash. The new season of the show will premiere on June 21. Clickhere to follow Screen Digital on YouTubeand stay updated with the latest from the world of cinema. Tags: Archana Puran Singh Kapil Sharma navjot singh sidhu The families of Raja and Sonam Raghuvanshi finally met after weeks of a tragic honeymoon turned fatal. Sonam's brother apologised and promised justice for Raja's murder. The police revealed that the main accused paid the killers and Sonam was allegedly present during the murder. She fled to Indore and then Uttar Pradesh, but surrendered after the main accused was caught. The families of Raja and Sonam Raghuvanshi finally met after weeks of a tragic honeymoon turned fatal. Sonam's brother apologised and promised justice for Raja's murder. The police revealed that the main accused paid the killers and Sonam was allegedly present during the murder. She fled to Indore and then Uttar Pradesh, but surrendered after the main accused was caught. Inside Thug Life trailer launch: Kamal Haasan, Trisha and Silambarasan steal the spotlight, Abhirami gets emotional From Salman Khan to Virat Kohli: How celebs honoured their moms this Mother’s Day 01Zeeshan Akhtar, key accused in Baba Siddique murder case, held in Canada: Mumbai Police 02Suresh Raina hails MS Dhoni’s ICC Hall of Fame induction: ‘His legacy will continue…’ 03In foreign countries, people still fondly remember Gandhi, Nehru & Indira: Supriya Sule 04Police file 3000-page chargesheet in Vadodara car crash case 05Cops fail to recognise DCP in civil dress, ask her to take breath test, later get rewarded for vigilance e-paperPremiumIndiaElections 2024Bollywood e-paper Premium India Elections 2024 Bollywood e-paper Premium India Elections 2024 Bollywood OpinionPolitical PulseExplainedScienceCricket Opinion Political Pulse Explained Science Cricket Opinion Political Pulse Explained Science Cricket SportsWorldBusinessEntertainmentJobs Sports World Business Entertainment Jobs Sports World Business Entertainment Jobs HealthLifestyleTechnologyEducationMovie Review Health Lifestyle Technology Education Movie Review Health Lifestyle Technology Education Movie Review EyeTrendingCitiesNewslettersWebSeries Eye Trending Cities Newsletters WebSeries Eye Trending Cities Newsletters WebSeries PhotosVideosAudioWeb StoriesRSS Photos Videos Audio Web Stories RSS Photos Videos Audio Web Stories RSS Trending WTC Final Live Score My Express Archives Mini Crossword Express Shorts Health & Wellness 🎙️ Podcast India International.(Open in new tab) Subscribe Sign In e-paper Premium India Elections 2024 Bollywood Opinion Political Pulse Explained Science Cricket Sports World Business Entertainment Jobs Health Lifestyle Technology Education Movie Review Eye Trending Cities Newsletters WebSeries Photos Videos Audio Web Stories RSS Explained News Political Pulse Latest Opinion Mumbai News Delhi News Pune News Bangalore News Bollywood News Health News India News Sports News Lifestyle News Latest News Cricket Tech Reviews Gadgets Mobile & Tabs Food & Wine Elections Fitness Stock Analysis Live Cricket Score Screen Videos International Videos WEB STORIES Indian Express Live TV Horoscope Today UPSC CSE Prelims 2025 Result Los Angeles protests Delhi News NEET Result 2025 Covid-19 India Cases 2025 HC to hear afresh pleas against Maratha reservation from July 18 After presidential election blow, Donald Tusk wins vote of confidence in Polish parliament Hockey, FIH Pro League: Erratic India made to pay for mistakes as Argentina prevail 4-3 in a rollercoaster 2024 Maharashtra Assembly polls data: Congress to hold ‘torch march’, demand probe into LoP Rahul’s allegations on EC CBI case: Court rejects accused’s plea for nod to travel to 23 countries for 6 months This improbable reason might be causing you sensitive teeth In first time in 6 years, CPI inflation may have fallen below 3% in May Meghalaya honeymoon murder: CM Conrad Sangma says ‘there’s no need for any CBI probe as of now’ Amit Shah agrees with need for popular govt in Manipur, but call based on situation: Biren Singh US secures Chinese rare earths in ‘done deal’ as Trump revises tariffs to 55% Telangana HC stays conviction of Gali Janardhan Reddy & others in illegal mining case BMC launches new mobile app for residents to raise pothole issue Pune triathletes shine: 68-year-old bizman, coach hit Ironman milestones With 4.6 billion views, this devotional song is the most viewed video on YouTube; Hariharan recalls a priest ‘almost touched his feet’ because of it Peter Thiel-backed crypto company Bullish confidentially files for IPO amid surge in crypto IPOs under Trump US reaffirms support to India on terror, but its Military General says ties with Pakistan also vital to counter ISIS-K The Indian Express ieTamil.com The Financial Express ieBangla.com Loksatta ieMalayalam.com Jansatta ieGujarati.com inUth IE Education IE Choice The ExpressGroup Newsletters 26/11 Stories of Strength Ramnath Goenka Excellence in Journalism Awards Light House Journalism Careers T&C Privacy Policy Advertise with Us Brand Solutions Contact Us Subscribe Statutory provisions on reporting (sexual offenses) This website follows the DNPA’s code of conduct CSR"}