{"id": 1262, "name": "Silicon Republic", "domain": "siliconrepublic.com", "bias": "center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.siliconrepublic.com/start-ups/burke-midlands-enterprise-ireland-founders-listening-tour-startups-supports", "title": "Burke Midlands Enterprise Ireland Founders Listening Tour Startups Supports", "content": "Home TechnologyBusinessEnterpriseCommsStart-upsAll Business Enterprise Comms Start-ups All Business Enterprise Comms Start-ups All ScienceInnovationMachinesClimateAll Innovation Machines Climate All Innovation Machines Climate All CareersAdvicePeopleEmployersJobs NewsAll Advice People Employers Jobs News All Advice People Employers Jobs News All AI Future Human MoreVideoAdvertiseFollow UsContact usAboutCookie & Privacy Policy Video Advertise Follow Us Contact us About Cookie & Privacy Policy Video Advertise Follow Us Contact us About Cookie & Privacy Policy TECHNOLOGYBUSINESSENTERPRISECOMMSSTART-UPSALL SCIENCEINNOVATIONMACHINESCLIMATEALL CAREERSADVICEPEOPLEEMPLOYERSJOBS NEWSALL AI FUTURE HUMAN MOREVIDEOADVERTISEFOLLOW USCONTACTABOUTCOOKIE & PRIVACY POLICY **Minister Burke drops in on midlands edition of Founders Listening Tour** 11 Jun 2025 From left: Barry Kennedy, Conor O’Donovan, Jenna Farrell, Minister Burke, Mark Gibbons, Ann O’Dea, Carol Gibbons and David Bowles. Image: Connor McKenna/SiliconRepublic.com Start-ups and scale-ups from the midlands gathered in Mullingar for the sixth edition of the Founders Listening Tour. Monday (9 June) saw the midlands leg of the current Enterprise Ireland Founders Listening Tour take place at Irish Manufacturing Research (IMR) in Mullingar. The region’s start-ups had the opportunity to give their feedback to Enterprise Ireland on the needs of the Irish ecosystem, particularly for those starting businesses in the region, and they got to hear from a special guest, Minister for Enterprise, Tourism and Employment Peter Burke, TD. This was the sixth edition of the tour that sees EI travel around Ireland to gather input and insights from founders. The aim is for the feedback gathered to help shape the roadmap for its newstrategy to support 1,000 new start-upsover the next five years. “This is a very critical part of our journey trying to improve and support the start-up space,” said Minister Burke. “It’s critical that people who have gone on that journey establishing their own business get all the support they can quickly, and what we want to do is really have a simpler, lighter, faster approach whereby we can get support into them at a key stage in that journey to ensure that they can be successful and realise their objectives. “We also are very clear that we want to realise that objective of having 1,000 new start-up companies over the next five years – which is a very significant target – and the employment that that brings and the increase in exports as well which will be critical for Enterprise Ireland’s mission statement.” The event began with a panel discussion where chair Ann O’Dea and EI’s Conor O’Donovan were joined by two local founders. New Zealand-born Jenna Farrell is a co-founder of Scopey, an AI tool for subcontractors on fast-moving large projects who use WhatsApp to log voice and message notes.Scopey AIthen takes those voice notes and turns them into logged data and structured reports for the office. Having run a software agency in Melbourne, Australia, Farrell moved to Ireland three years ago where she founded Scopey which is run from Longford. “I think it’s great that Enterprise Ireland are asking for real feedback and they definitely got a lot of that today,” she said. “Enterprise Ireland has been a really great support for us from the beginning but, like every company and organisation, there’s lots of improvements that can be made.” Mark Gibbons is CEO and co-founder ofTapitag, a software development company based in Athlone, shipping out to 87 countries globally with more than 50,000 users on its platform, that specialises in digital business cards, review management, gamified donations and proximity marketing. It boasts clients such as Airbus, UEFA, Chelsea Football Club and IDA Ireland. “I thought it was really, really beneficial to be here and to get our points across of what we think would help our companies. And it was lovely to see that we weren’t on our own in terms of some of the stuff we discussed,” Gibbons said. “I’m absolutely delighted to welcome the community here today, all the founders and Enterprise Ireland, and to have the conversation about what are the support structures that they need to help them and support them as businesses to grow,” said Barry Kennedy, CEO of Irish Manufacturing Research. “It was a full house here in Mullingar at IMR,” said O’Donovan. “We heard a lot around how can we be a little bit more digital in terms of making the supports that are available for start-ups across the Government ecosystem more accessible, how using digital tools, using AI could speed that up. And speed came up a lot. How can we really ensure that we’re keeping up, that we’re being fast enough in terms of delivery of services to support entrepreneurs as they chase the next big opportunity.” The regional leg of the tour finished up yesterday, with a well-attended north-west edition. Watch out for our report from Letterkenny on Friday (13 June). The tour finishes with a stakeholder event in Dublin later this month. As the tour can only reach a representative sample of start-ups and founders, Enterprise Ireland welcomes feedback from interested founders and start-ups via theFounders Listening Tour survey here,before the end of June. Don’t miss out on the knowledge you need to succeed. Sign up for theDaily Brief, Silicon Republic’s digest of need-to-know sci-tech news. In-Depth:Founders Listening Tour,More on Enterprise Ireland Related:accelerators,funding and investment,Enterprise Ireland **You May Also Like** **You May Also Like** **Plastic bottle alternative wins Student Entrepreneur Awards 2025** **Plastic bottle alternative wins Student Entrepreneur Awards 2025** 9 Jun 2025 **The Mill in Drogheda hosts Enterprise Ireland’s Founders Listening Tour** **The Mill in Drogheda hosts Enterprise Ireland’s Founders Listening Tour** 6 Jun 2025 **GreenTech HQ welcomes EI’s Founders Listening Tour** **GreenTech HQ welcomes EI’s Founders Listening Tour** 29 May 2025 **Cork hosts south-west stop on Enterprise Ireland Founders Listening Tour** **Cork hosts south-west stop on Enterprise Ireland Founders Listening Tour** 4 Jun 2025 **EI’s Founders Listening Tour stops off at Galway’s PorterShed** **EI’s Founders Listening Tour stops off at Galway’s PorterShed** 22 May 2025 **Enterprise Ireland’s Founders Listening Tour kicks off in Dublin** **Enterprise Ireland’s Founders Listening Tour kicks off in Dublin** 12 May 2025 **Latest News** Minister Burke drops in on midlands edition of Founders Listening Tour11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 ‘Information explosion’: How AI is changing the research sector11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 Researchers to quench public curiosity at 2025 Soapbox Science11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 School of life: 5 STEM careers that don’t require a third-level degree11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 Follow Us IBM lays out roadmap for new mega quantum computer by 202911 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 Mistral’s new reasoning model is a European first11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 4chan under investigation by UK Ofcom over online safety concerns11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 ‘Responsible AI is no longer just a buzzword’11 Jun 2025 11 Jun 2025 11 Jun 2025 11 Jun 2025 ChatGPT goes down as OpenAI suffers major site outage10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Uber enlists Wayve to test fully driverless vehicles in London10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Data centres consumed 22pc of Ireland’s electricity in 202410 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Age-proofing your CV for every phase of life10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Three things from Apple’s WWDC 2025 you should know about10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 M&M Qualtech creating new opportunities in Galway10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 UCC to lead European testicular cancer project using XR10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Why repurposing drugs for MS can’t be rushed10 Jun 2025 10 Jun 2025 10 Jun 2025 10 Jun 2025 Top tips for older employees rejoining the workforce9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 Plastic bottle alternative wins Student Entrepreneur Awards 20259 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 UK’s new Nvidia-powered sandbox to give banks an AI edge9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 Is there room for a devil’s advocate in the workplace?9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 Griffdon Engineering creating 48 jobs in Roscommon9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 EasyGo, Irish Government partner for EV charger sharing pilot9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 WordPress and Linux aim to boost open web security with FAIR project9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 UK’s Latent Technology raises $8m for AI-driven game animation9 Jun 2025 9 Jun 2025 9 Jun 2025 9 Jun 2025 **More from Technology** **Latest News** Home About Contact Advertise Subscribe Privacy Policy Privacy Settings All content copyright 2002-2025 Silicon Republic Knowledge & Events Management Ltd. Reproduction without explicit permission is prohibited. All rights reserved.Website bySquare1.io"}