{"id": 1710, "name": "Doctors for Covid Ethics", "domain": "doctors4covidethics.org", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "very-low", "questionable": null, "url": "https://doctors4covidethics.org/gold-standard-covid-science-in-practice-an-interdisciplinary-symposium-v-in-the-midst-of-darkness-light-prevails/", "title": "Gold Standard Covid Science In Practice An Interdisciplinary Symposium V In The Midst Of Darkness Light Prevails", "content": "Home AboutAbout Doctors for COVID Ethics About Doctors for COVID Ethics About Doctors for COVID Ethics Posts SymposiumsDecember 2022June 2022February 2022December 2021July 2021 December 2022 June 2022 February 2022 December 2021 July 2021 December 2022 June 2022 February 2022 December 2021 July 2021 PublicationsScientific OutreachScience In DepthExpert StatementsBooks Scientific Outreach Science In Depth Expert Statements Books Scientific Outreach Science In Depth Expert Statements Books VideosSymposiumsCOVID and Gene-Based Vaccine ExplainedGene-based Vaccine DamageIn Memoriam Arne BurkhardtRelated Interviews and Videos Symposiums COVID and Gene-Based Vaccine Explained Gene-based Vaccine Damage In Memoriam Arne Burkhardt Related Interviews and Videos Symposiums COVID and Gene-Based Vaccine Explained Gene-based Vaccine Damage In Memoriam Arne Burkhardt Related Interviews and Videos Dr. Bhakdi’s Legal CaseAbout Sucharit BhakdiTimeline: Prof. Sucharit Bhakdi CaseJudgmentZeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi About Sucharit Bhakdi Timeline: Prof. Sucharit Bhakdi Case Judgment Zeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi About Sucharit Bhakdi Timeline: Prof. Sucharit Bhakdi Case Judgment Zeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi LettersD4CE LettersOther Letters D4CE Letters Other Letters D4CE Letters Other Letters Resources Doctors for COVID Ethics Home AboutAbout Doctors for COVID Ethics About Doctors for COVID Ethics About Doctors for COVID Ethics Posts SymposiumsDecember 2022June 2022February 2022December 2021July 2021 December 2022 June 2022 February 2022 December 2021 July 2021 December 2022 June 2022 February 2022 December 2021 July 2021 PublicationsScientific OutreachScience In DepthExpert StatementsBooks Scientific Outreach Science In Depth Expert Statements Books Scientific Outreach Science In Depth Expert Statements Books VideosSymposiumsCOVID and Gene-Based Vaccine ExplainedGene-based Vaccine DamageIn Memoriam Arne BurkhardtRelated Interviews and Videos Symposiums COVID and Gene-Based Vaccine Explained Gene-based Vaccine Damage In Memoriam Arne Burkhardt Related Interviews and Videos Symposiums COVID and Gene-Based Vaccine Explained Gene-based Vaccine Damage In Memoriam Arne Burkhardt Related Interviews and Videos Dr. Bhakdi’s Legal CaseAbout Sucharit BhakdiTimeline: Prof. Sucharit Bhakdi CaseJudgmentZeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi About Sucharit Bhakdi Timeline: Prof. Sucharit Bhakdi Case Judgment Zeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi About Sucharit Bhakdi Timeline: Prof. Sucharit Bhakdi Case Judgment Zeitleiste: Gerichtsverfahren Prof. Dr. Sucharit Bhakdi LettersD4CE LettersOther Letters D4CE Letters Other Letters D4CE Letters Other Letters Resources **Gold Standard Covid Science in Practice – An Interdisciplinary Symposium V: IN THE MIDST OF DARKNESS LIGHT PREVAILS** Session I The Fundamental Flaws of mRNA Vaccine TechnologyWith Sucharit Bhakdi, Michael Palmer, Brian Hooker, and Meryl Nass Session II Legal Update: How to stop the shots?With Philipp Kruse, Renate Holzeisen, Ros Jones, and Ray L. Flores Session III Getting Away from the Control GridWith Catherine Austin Fitts, Carolyn A. Betts, Sasha Latypova, Meryl Nass, John Titus, and Corey Lynn Session IV Understanding Tactics of OppressionWith Taylor Hudák, Thomas Binder, Aga Wilson, Ryan Cole, Meryl Nass, Liz Evans, Daniel Broudy, Valerie Kyrie and David Hughes Session V Remember DemocracyWith Wolfgang Wodarg, Catherine Austin Fitts, Polly Tommey, and Meryl Nass, and Michael Palmer in alphabetical order Carolyn A. BETTS, ESQ.is a self-employed attorney, practicing as part of John E. Stillpass Attorneys in Blue Ash, Ohio and part-time general counsel and journalist for Solari, Inc. She served as the lead financial advisor for the USA Federal Housing Administration. She served as an associate and then partner in the corporate finance departments of Omaha and Washington, DC law firms, representing affordable housing development, federal government, capital market, financial services and other major clients in connection with large mergers and acquisitions, mortgage securitizations and other finance transactions, many involving commercial real estate and affordable housing, and with securities and regulatory compliance matters. During the savings and loan crisis, her practice group represented Resolution Trust Corporation in designing and executing transactions involving assets of savings loans in government receivership. Prof. Sucharit BHAKDI MDis Professor Emeritus of Medical Microbiology and Immunology, Former Chair, Institute of Medical Microbiology and Hygiene, Johannes Gutenberg University of Mainz. Daniel BROUDY, PhDis a professor of applied linguistics with research interests in symbols, signs, sounds, images, and colors as communication tools deployed by power centers which aim to shape knowledge and influence human perception and emotion. He holds a doctorate in applied psycholinguistics and has experience as an imagery analyst. He lectures in areas ranging from communication theory to visual rhetoric. Selections of his work can be found at ResearchGate. Daniel is an associate researcher with the Working Group on Propaganda and the 9/11 Global ‘War on Terror’. Dr. Elizabeth EVANS, MA (Cantab), MBBS(Hons), DRCOGis co-founder and director ofthe UK Medical Freedom Alliance – set up in October 2020. They are a group of healthcare professionals, scientists and lawyers, campaigning for people’s rights to medical freedom, informed consent and bodily autonomy to be upheld in all circumstances. She is a front-facing member of HART since inception. She is a member of the Children’s Covid Vaccine Advisory Council (CCVAC) led by Dr. Ros Jones. She practised as a doctor for a few years (GP Registrar) then deregistered and moved into complementary medicine. For the last 12 years she has had a private practice seeing patients, using a holistic nutritional and energy medicine approach. Catherine Austin FITTSis the president of Solari, Inc., publisher of the Solari Report, and managing member of Solari Investment Advisory Services, LLC. Catherine served as managing director and member of the board of directors of the Wall Street investment bank Dillon, Read & Co. Inc., as Assistant Secretary of Housing and Federal Housing Commissioner at the United States Department of Housing and Urban Development in the first Bush Administration, and was the president of Hamilton Securities Group, Inc. Catherine has designed and closed over $25 billion of transactions and investments to-date and has led portfolio and investment strategy for $300 billion of financial assets and liabilities. She graduated from the University of Pennsylvania (BA), the Wharton School (MBA) and studied Mandarin Chinese at the Chinese University of Hong Kong. Ray L. FLORES II, Esq. is a health freedom rights attorney. His interest in natural living started in the 1980’s when he began working in the burgeoning natural foods industry. Seeing the FDA ban L-tryptophan in 1989, passing of DSHEA in 1994, the removal of most fresh juices in 1996, made it obvious that our health was under attack by regulatory agencies. He became an attorney 17 years ago to devote his attention to that battle. Now that the world is fully engulfed in this crisis, he believes his choice was a good one. He is grateful to work tirelessly to preserve our natural rights. Dr. Renate HOLZEISENis a European Human Rights lawyer based in South Tyrol who is fighting the Corona measures legally. She contends that any newly developed vaccine cannot be made mandatory using the rationale that was used for their approval. She is also a Barrister practicing before the Supreme Courts and is specialized in European and International Law. She is a formidable force in cases at the European and national level by unifying, sharing and coordinating initiatives. She is actively engaged in issues regarding Fundamental Rights and Freedoms. Dr. Brian HOOKER, PhD, PE,is an Associate Professor of Biology at Simpson University in Redding California where he specializes in microbiology and biotechnology. Brian Hooker is the co-inventor for five patents, and recipient of the Battelle Entrepreneurial Award in 2001. Brian Hooker’s over 60 science andengineering papers have been published in internationally recognized, peer reviewed journals. In 2013 and 2014, Dr. Hooker worked with the CDC Whistleblower, Dr. William Thompson, to expose fraud and corruption within vaccine safety research in the CDC, which led to the release of over 10,000 pages of documents. Taylor HUDAK, MA,is an American Hungarian journalist focused on human rights, media freedom and health. She researches, writes, and produces video reports and interviews for The Last American Vagabond and acTVism Munich. Taylor received a master’s degree in journalism and mass communication from Kent State University. David A. HUGHES, PhDis a Senior Lecturer of International Relations at the School of Social and Political Sciences at the University of Lincoln. He holds doctorates in German Studies and International Relations. He lectures in areas including security studies, international relations theory, foreign policy analysis, globalization, and US exceptionalism. His research focuses on psychological warfare, 9/11, COVID-19, the deep state, intelligence crime, technocracy, resurgent totalitarianism, and global class relations. A selection of his work can be found on Academia.edu. David is an Associate Researcher with the Working Group on Propaganda and the 9/11 Global ‘War on Terror’. Dr Ros JONESis a retired Consultant Paediatrician with a special interest in neonatal intensive care and paediatric HIV. She has served on the Advisory Committee of the National Perinatal Epidemiology Unit and on the Education & Training committee of the RCPCH. An active member for many years in the British Perinatal Trials Group, she was also involved in reviewing NICE guidelines alongside some time editorial. Since retiring from the NHS, she has undertaken several tours teaching on SAFE Obstetrics courses in countries in Africa. Philipp KRUSEis a Swiss Attorney. After a career in commercial and constitutional law, he dedicated his life to challenge the path Switzerland is moving along with many other nations. He has run several cases in relation to regulations impacting children, constitutional controversies and is leading several initiatives supporting activists. Valerie KYRIEholds a doctorate in psychology on the topic of reality-perception and its manipulation. She has contributed to work in the areas of international human rights, advocacy and policy, focusing on the tactics and machinations underpinning collective violence and atrocity. Alexandra LATYPOVAis serial entrepreneur and a founder of iCardiac Technologies, a company based on technology developed by students and faculty at the University of Rochester. It has received in excess of $7 million in venture capital funding and currently serves 6 of the top 10 pharmaceutical companies in addition to a broad range of clients across North America, Europe and Asia. Prior to iCardiac Technologies, Ms. Latypova worked at VirtualScopics, Inc., a technology spin out from the University of Rochester and Analysis Group, Inc., a Boston-based economics, financial and strategy consultancy. Corey LYNNis an investigative journalist whose popular website, Corey’s Digs, has been helping readers “learn truths, go deeper, and understand what’s coming down the pike” since 2018. Lynn’s fearless and wide-ranging investigations use detailed analysis of primarily open-source information and timelines to connect the dots and trace money flows in areas such as education, health, science, technology, law and order and human trafficking. In addition to shining a light on topics ordinarily left in the shadows, Corey’s Digs offers reflections on consciousness and encourages solutions to combat tyranny and create new social and financial structures that benefit everyone. Meryl NASS, MD, ABIMis an internist with special interests in vaccine-induced illnesses, chronic fatigue syndrome, Gulf War illness, fibromyalgia and toxicology. As a biological warfare epidemiologist, she investigated the world’s largest anthrax epizootic in Zimbabwe, and developed a model for analyzing epidemics to assess whether they are natural or man-made. She has played a major role in creation of acoalition that has fought the Anthrax Vaccine Immunization Program. Nass is active in assisting legal teams defending anthrax vaccine refusers and ill service members in the U.S. and Canada. Michael PALMER, MDis a former Associate Professor in the Department of Chemistry at the University of Waterloo, Ontario, Canada, and is board certified in Medical Microbiology. His experimental research focus is on bacterial toxins and antibiotics. Michael has authored a textbook on Biochemical Pharmacology. John TITUSis an attorney. He has written, produced and directed videos about the loss of the rule of law in the U.S. since 2014. His videos focus largely on Wall Street crime, and cronyism in the Financial system. He has a juris doctor and has litigated patents for 25 years. He also holds bachelor’s and master’s degrees in electrical engineering and worked as an electrical engineer in the space industry. Since 2020 John has co- produced and co-hosted Money & Markets with Catherine Austin Fitts at Solari Inc. Polly TOMMEYis director of programming for CHD-TV. She is the mother of Billy Tommey, whose vaccine injury story is prominently featured in the documentaryVaxxed: From Cover-Up to Catastrophe. Tommey is a film producer known forWho Killed Alex Spourdalkis? (2015),Vaxxed: From Cover-Up to Catastrophe(2016) andVaxxed II: The People’s Truth. She is a book author, founding editor-in-chief of the world’s preeminent autism magazine, The Autism File and co-founder of the Autism Media Channel. An outspoken autism advocate and founder of the Autism Trust in the UK and U.S., Tommey has appeared in print and television media around the globe, gone head-to-head with top political leaders and never compromised her position on telling the truth about vaccine injury. Dr. Wolfgang WODARGdid his medical studies in Berlin and Hamburg and received his doctor ́s grade from the University of Hamburg. Postgraduate qualifications: internal medicine and pneumology, public health, social medicine, hygiene and environmental medicine in Germany, and further training in epidemiology at Johns Hopkins University/ Baltimore, USA. He practiced medicine in several clinics and became the director of a public health institute in Northern Germany. He was elected to the German Bundestag in 1994 and was amember of the Health Committee and the Committee for Economic Cooperation and Development. As MP, Dr. Wodarg was a member of the Parliamentary Assembly of the Council of Europe (PACE) and Deputy Chairman of the Committee on Culture, Education and Science. Dr. Thomas BINDER, MDis specialised in Cardiology and Internal Medicine, with a thesis in Immunology and Virology, and 32 years experience in diagnosis and treatment of Acute Respiratory Illness. Ryan COLE, MDis a medical doctor, who trained at the Mayo Clinic and completed his residency in Anatomic and Clinical Pathology, as well as a fellowship in Surgical pathology, serving as chief fellow in his final year. In 2004 he founded Cole Diagnostics, an independent, full-service medical laboratory in Boise, Idaho, and is the Chief Medical Officer and Laboratory Director. He is a board certified Anatomic and Clinical pathologist with sub-specialty training and 20 years experience in dermatopathology with particular interest in molecular diagnostics. Cole Diagnostics processes and reports on approximately 40,000 blood and biopsy patient samples annually. In the last year, the lab has handled over 100,000 COVID testing samples. Producers: Mike Robinson, UK Column & Orsolya Győrffy, CHD Europe / Doctors for COVID Ethics We thank Taylor Hudak,The Last American Vagabondand Aga Wilson,CHD Europefor the extracts of their interviews with Dr. Thomas Binder and Dr. Ryan Cole."}