{"id": 46, "name": "Anchorage Daily News", "domain": "adn.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.adn.com/opinions/2018/11/09/we-want-your-feedback/", "title": "We Want Your Feedback", "content": "Subscribe Log in/Log outOpens in new window Games All content Business/EconomyEnergy Energy Energy Alaska NewsAnchorageMat-SuRural AlaskaEducationScienceWildlifeAviationMilitaryCrime & Courts Anchorage Mat-Su Rural Alaska Education Science Wildlife Aviation Military Crime & Courts Anchorage Mat-Su Rural Alaska Education Science Wildlife Aviation Military Crime & Courts PoliticsAlaska Legislature Alaska Legislature Alaska Legislature ADN Politics Podcast OpinionsNational OpinionsEditorialsLetters to the Editor National Opinions Editorials Letters to the Editor National Opinions Editorials Letters to the Editor Nation/World Arts and EntertainmentBooksFilm and TVMusic Books Film and TV Music Books Film and TV Music Outdoors/Adventure SportsHigh School SportsUAA AthleticsSkiingHockeyNational Sports High School Sports UAA Athletics Skiing Hockey National Sports High School Sports UAA Athletics Skiing Hockey National Sports Alaska LifeFood and DrinkTravelGardeningAdvice Food and Drink Travel Gardening Advice Food and Drink Travel Gardening Advice Lawless Visual Stories Iditarod Alaska Journal of CommerceOpens in new window The Arctic Sounder The Bristol Bay Times e-Edition Today's PaperOpens in new window Obituaries Legal NoticesOpens in new window Calendar EventsPeak 2 Peak EventsOpens in new windowEducator of the YearOpens in new windowCelebrating NursesOpens in new windowTop 40 Under 40Opens in new windowAlaska Spelling BeeOpens in new windowAlaska Craft Brew FestivalBest of AlaskaSpring Career FairOpens in new windowAchievement in BusinessYouth Summit Awards Peak 2 Peak EventsOpens in new window Educator of the YearOpens in new window Celebrating NursesOpens in new window Top 40 Under 40Opens in new window Alaska Spelling BeeOpens in new window Alaska Craft Brew Festival Best of Alaska Spring Career FairOpens in new window Achievement in Business Youth Summit Awards Peak 2 Peak EventsOpens in new window Educator of the YearOpens in new window Celebrating NursesOpens in new window Top 40 Under 40Opens in new window Alaska Spelling BeeOpens in new window Alaska Craft Brew Festival Best of Alaska Spring Career FairOpens in new window Achievement in Business Youth Summit Awards PromotionsHighland Games Ticket Giveaway3 Barons SweepstakesTeacher of the Month Highland Games Ticket Giveaway 3 Barons Sweepstakes Teacher of the Month Highland Games Ticket Giveaway 3 Barons Sweepstakes Teacher of the Month Special Sections2025 Summer Camps GuideOpens in new window2024 Best of AlaskaOpens in new windowAlaska Visitors Guide 2024Opens in new windowAlaska Health CareOpens in new windowGraduation 2025Opens in new windowSenior Living in AlaskaOpens in new window 2025 Summer Camps GuideOpens in new window 2024 Best of AlaskaOpens in new window Alaska Visitors Guide 2024Opens in new window Alaska Health CareOpens in new window Graduation 2025Opens in new window Senior Living in AlaskaOpens in new window 2025 Summer Camps GuideOpens in new window 2024 Best of AlaskaOpens in new window Alaska Visitors Guide 2024Opens in new window Alaska Health CareOpens in new window Graduation 2025Opens in new window Senior Living in AlaskaOpens in new window Alaska Visitors Guide ADN StoreOpens in new window Reprints MarketplaceClassifiedsOpens in new windowJobsOpens in new windowPlace an AdOpens in new window ClassifiedsOpens in new window JobsOpens in new window Place an AdOpens in new window ClassifiedsOpens in new window JobsOpens in new window Place an AdOpens in new window Contact UsCustomer ServiceAdvertiseCareers at ADNOpens in new window Customer Service Advertise Careers at ADNOpens in new window Customer Service Advertise Careers at ADNOpens in new window Sponsored Content Archives **We want your feedback** We love hearing from readers. Please use the form below so it gets to the right team. General feedback on content? Use the form below. Have a news tip or coverage suggestion? Use the form below orgo here. Experiencing issues with our website? Check outour troubleshooting page. If you’re a subscriber who hasn’t received today’s newspaper or having trouble accessing online content, you can let us know below. You can also read thee-Edition, the online replica of the print paper. More ways to contact us directlyhere. **Most read by subscribers** 1 **Anchorage Assembly repeals mandatory ID checks for alcohol at bars, breweries and restaurants** **Anchorage Assembly repeals mandatory ID checks for alcohol at bars, breweries and restaurants** 2 **Crew ejects before South Korean fighter jet crashes at Eielson Air Force Base** **Crew ejects before South Korean fighter jet crashes at Eielson Air Force Base** 3 **‘Mixed bag’: Some Alaska tourism operators see signs of a slowdown as economic concerns and Trump policies take a bite** **‘Mixed bag’: Some Alaska tourism operators see signs of a slowdown as economic concerns and Trump policies take a bite** 4 **Dozens of ICE detainees transferred to Alaska are being held at an Anchorage facility** **Dozens of ICE detainees transferred to Alaska are being held at an Anchorage facility** 5 **University of Alaska seeks to create the state’s second spaceport** **University of Alaska seeks to create the state’s second spaceport** **Latest** **New study shows social media use predicted future depression in tweens** **EPA moves to repeal limits on greenhouse gas emissions by power plants** **‘If you’re not here, you think L.A.’s burning’: Trump’s alarm meets city calm** **Anchorage Assembly repeals mandatory ID checks for alcohol at bars, breweries and restaurants** **Letter: Alaskans need to speak out about ICE detentions in our prisons and jails** Anchorage Daily News 300 W. 31st Ave.Anchorage, Alaska, 99503"}