{"id": 682, "name": "Inforum (The Forum of Fargo-Moorhead)", "domain": "inforum.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.inforum.com/lifestyle/arts-and-entertainment/singers-vietnamese-heritage-helps-her-connect-with-starring-role-in-actups-the-sound-of-music", "title": "Singers Vietnamese Heritage Helps Her Connect With Starring Role In Actups The Sound Of Music", "content": "📣 Advertise With Us Watch WDAY+ 🎧Podcasts 📆 Events Calendar 🎲 Free Games Advertise With UsDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public Notice (MN)Place a Public Notice (ND)Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice (MN) Place a Public Notice (ND) Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice (MN) Place a Public Notice (ND) Get Our Advertising Newsletter Sponsored Content NewsFargoMoorheadWest FargoBismarckMinnesotaNorth DakotaSouth DakotaNationalWorldThe VaultAgweekWDAY+Forum News Network Fargo Moorhead West Fargo Bismarck Minnesota North Dakota South Dakota National World The Vault Agweek WDAY+ Forum News Network Fargo Moorhead West Fargo Bismarck Minnesota North Dakota South Dakota National World The Vault Agweek WDAY+ Forum News Network Weather SportsPrepPrep StandingsWDAY Sports+CollegeBison Media ZoneFCS StandingsUND HockeyProNorthland Outdoors Prep Prep Standings WDAY Sports+ College Bison Media Zone FCS Standings UND Hockey Pro Northland Outdoors Prep Prep Standings WDAY Sports+ College Bison Media Zone FCS Standings UND Hockey Pro Northland Outdoors Obituaries Health BusinessBusiness Announcements Business Announcements Business Announcements OpinionEditorialsColumnsLettersCartoons Editorials Columns Letters Cartoons Editorials Columns Letters Cartoons LifestyleArts / EntertainmentHome / GardenAstro BobComicsOn the Minds of MomsFree Games Arts / Entertainment Home / Garden Astro Bob Comics On the Minds of Moms Free Games Arts / Entertainment Home / Garden Astro Bob Comics On the Minds of Moms Free Games CommunityMilestonesWDAY+ContestsCalendarWeather AnnouncementsBest of the Red River Valley 2024 Milestones WDAY+ Contests Calendar Weather Announcements Best of the Red River Valley 2024 Milestones WDAY+ Contests Calendar Weather Announcements Best of the Red River Valley 2024 From The ArchivesArchives FAQToday In HistorySports Time Machine Archives FAQ Today In History Sports Time Machine Archives FAQ Today In History Sports Time Machine Podcasts Magazines and MoreFull Magazine RackWest Fargo Focus Full Magazine Rack West Fargo Focus Full Magazine Rack West Fargo Focus ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **Singer's Vietnamese heritage helps her connect with starring role in ActUp's 'The Sound of Music'** **“Leaving a culture you know to stand up for what’s right and stand up for your values. It allows me to hone in on my family history,” Julie Ly said.** MOORHEAD — When Julie Ly plays Maria in “The Sound of Music,” she’s not just starring in her first ActUp Theatre production, she’s making her debut in musical theater. “Maria is one of those roles everyone knows. It’s such an incredible role with all of the classics she sings,” Ly said when asked what drew her to the part. “But it’s so much more than that. I feel connected to Maria.” ADVERTISEMENT No, Ly isn’t a nun who has fallen in love with the father of the children she cares for as Maria does in the musical. What she relates to in the show is the theme of immigration, of parents willing to leave their homeland in search of a better life for their family. The show opens Tuesday night at Minnesota State University Moorhead. Though Ly was born and raised in West Fargo, her parents left Vietnam after the war to find more opportunities for themselves and their family. “Their journey was one of sacrifice and resilience and a pursuit of hope. I feel connected to her story,” Ly said of Maria. Richard Rodgers and Oscar Hammerstein’s classic 1959 musical focuses on Maria, a young nun in 1938 Austria questioning whether the cloistered life is right for her. She is sent to care for the children of the widowed Captain von Trapp and teaches them the joys of singing songs like “Do-Re-Mi” and “So Long, Farewell.” As she starts to have feelings for Capt. von Trapp, the Germans annex Austria. Maria and the family are forced to choose whether they will fall in line with the Nazis or stand up against the authoritarian power. ADVERTISEMENT “Leaving a culture you know to stand up for what’s right and stand up for your values — it allows me to hone in on my family history,” Ly said. “Unfortunately, it’s still timely as a large portion of the show is about standing up to a regime they don’t believe in,” director Craig Ellingson said, talking about why ActUp, a troupe with a mission of producing shows that deal with social justice and health issues, chose the piece. There’s also the fact that the music is not just recognizable, but catchy. “It’s infectious,” he said. “It’s one of those chestnuts of American musical theater.” Although she relates to the story personally, Ly doesn’t bring her family’s history to the stage and instead the show stays true to the original musical. “This story is about the von Trapps for me,” the North Dakota State University graduate said. While she grew up hearing the music, she didn’t really know the show too well before auditioning. Though she’s never been in musical theater, she has some experience singing on stage with the Fargo-Moorhead Opera. ADVERTISEMENT With so many classic tunes in the show, she’s reluctant to pick one as a favorite, but she’s particularly fond of “The Lonely Goatherd.” “It’s spirited and uplifting and kind of embodies Maria. She’s whimsical and warm and those are the qualities that make her so charming,” Ly said. “Playing Maria is being the best version of myself. The authenticity she leads with makes her so compelling. She reminds us of the joys one can take from the simple things in life.” “It’s summer theater, we want them to feel a sense of escapism, but there’s a reason this show is still around and being performed,” Ellingson said. “It’s very easy to not stand up and be complicit in silence. By not standing up or speaking up, you’re making a choice, you’re making a statement.” While Ly’s goal is to put on an engaging and entertaining show, she wants guests to leave with more than a song in mind. “The music and sentiment give it an accessibility, but the historical context gives (the show) weight. Behind the songs and the scenery, the story has real stakes,” she said. “There’s a journey that so many families go through these days.” **If you go** What:“The Sound of Music” When:7:30 p.m., Tuesday through Saturday ADVERTISEMENT Where:Gaede Stage, MSUM Info:Tickets are $30,actuptheatre.org ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersE-PaperOur News Network Subscription Options Email Newsletters E-Paper Our News Network Subscription Options Email Newsletters E-Paper Our News Network ContactGet HelpContact UsAdvertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Instagram Facebook"}