{"id": 1645, "name": "Yes Magazine", "domain": "yesmagazine.org", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.yesmagazine.org/racial-justice/2025/05/16/kentucky-activists-indigenous-land-restoration-prison", "title": "Kentucky Activists Indigenous Land Restoration Prison", "content": "Environmental Justice Racial Justice Body Politics Political Power Economic Power MoreAbout YES!EventsTeacher Resources About YES! Events Teacher Resources About YES! Events Teacher Resources MagazineCurrent IssueThe “Truth” IssueFALL 2024All Issues Current IssueThe “Truth” IssueFALL 2024 All Issues Current IssueThe “Truth” IssueFALL 2024 All Issues **Trending:** DONATE About Events Environmental Justice Racial Justice Body Politics Political Power Social Justice Economic Power Teacher Resources Truth Fall 2024 All Issues Get YES! Emails **Trending:** **Indigenous Stewards Reclaim Prison Land** Activists in eastern Kentucky are forcing the Bureau of Prisons (BOP) to go back to the drawing board mere months after the federal agencysigned off on a Record of Decisionapproving a 500-acre site in Roxana, Kentucky, as the location for a $500 million medium-security prison. On Jan. 22, theAppalachian Rekindling Project (ARP), a community-building and land restoration organization led by Indigenous women, announced that it purchased a section of the site the BOP identified as its first choice for the new prison. With the acquisition of 68 acres of private land, the ARP aims to heal the land and the local community—in part by stopping the prison from ever getting built. “This land has already seen so much harm in the strip-mining industry and has already been out of access [to] environmental care and tending,” said Tiffany, one of the leaders of ARP who declined to use her last name for privacy and safety reasons. “The thought of adding another extractive industry—one that extracts people from their communities and extracts labor out of them—was really horrifying to us.” The land purchase, made with the help of the Institute to End Mass Incarceration (IEMI), comes after 20 years of back and forth between the federal government and residents of Letcher County, the eastern Kentucky municipality with a population of 21,000 where the prison was originally intended. The saga began in 2006, when Republican Rep. Hal Rogers requested that the BOP evaluate the potential for a new prison in Kentucky, citing the need for an economic stimulus. Ten years after, the BOP approved $500 million for a new prison built atop a former mountaintop coal-removal site. In 2018, a small coalition ofrural organizers succeededin forcing the agency to table the project. By then it was clear that the BOP preferred to spend the funds improving aging prison infrastructure rather than on building new prisons. Also concerning to locals was that most of the initial cost for the Letcher County facility was slated for preparation of the land, as mountaintop removal sites require extensive remediation. “The last time [Donald] Trump was in office, he did speak out vocally against this project; he thought it was a wasteful allocation of funds,” said Joan Steffen, an attorney at theInstitute to End Mass Incarceration. She toldPrismthat the Department of Justice has consistently asked for the earmarked funds to be taken out of the agency’s budget. This is why it was a surprise when in 2022, the BOP announced that it was revisiting the project—this time under the guise of constructing a medium-security facility. When the agency released the Record of Decision in late 2024, locals assumed it was the end of the road for any resistance, despite significant gaps inthe agency’s environmental justice analysis. But throughout 2024, the ARP quietly organized and collected funds for the purchase. Tiffany also met with the landowners multiple times and built a relationship with them, finding common ground in that they were both born and raised in Letcher County. The landowners even knew her mom. She emphasized the importance of community ties in Appalachia, explaining that her deep roots in Letcher County resonated with landowners. There’s no chance that the ARP will sell to the BOP, Tiffany toldPrism. This means that the federal government has to reconsider its plan and reevaluate potential sites for prison construction—a lengthy and bureaucratic process that can take years. Meanwhile, the price tag for a new construction project will balloon beyond what the agency wants to spend. In this latest iteration of the fight against the prison in Letcher County, organizers hoped to articulate not just what they are against, but what they are for. “Rematriation is a solid strategy for abolition,” Tiffany toldPrism. One of the hopes of organizers is toreturn bison to the land. The animals were once ubiquitous throughout the Midwest and Appalachia until they were hunted into extinction for the purpose of rendering Indigenous life unlivable. They also plan to plant native and non-native plants like persimmons, pawpaws, and grasses, both as food sources and as natural flood prevention. Of course, they’ll also need to hire local people to put up fencing for the bison, help plant and restore the area, and manage other projects. The ARP’s approach to economic development and land care offers a tangible alternative to the promises made by the region’s congressman. Rogers insisted that a prison would result in jobs and a local boost to the economy. However, locals worried about the educational requirements for correctional officer positions as well as mounting evidence that prisons depress local economies. In one study of how the introduction of prisons affected rural Central Appalachian communities, researchers found that poverty rates remained just as high as before construction. The federal agency, Appalachian Regional Commission, lists the Kentucky counties where three federal prisons have opened under Rogers’ tenure as “distressed.” Recent research from the Prison Policy Initiative also found that chronic understaffing at prisons and jails isn’t effectively countered by promises of pay increases or workplace benefits. In other words, the growing body of research contradicts the purported reasons for constructing prisons. “​It’s become something that [Rogers] is so ingrained towards establishing that his ego will not let him let go of it,” said Artie Ann Bates, a resident of Letcher County and organizer with the coalition group Concerned Letcher Countians. “I think when someone is so driven to acquire something that they no longer listen to logic or reason or dissenting voices, then that’s a problem.” But it’s not just claims about jobs that concern local residents like Bates; it’s also that the BOP appears to have no comprehensive plan for issues such as flooding. Eastern Kentucky and much of Central Appalachia faced catastrophic flooding in 2022. This includes Roxana, where the Letcher facility was planned for. Not only have the impacts of mountaintop coal removal increased streamflow, bringing greater amounts of contaminated water at faster paces through Kentucky’s mountains and hollers, but when disaster strikes, prisons rarely have adequate plans for how to evacuate people in their custody. “Folks who are incarcerated really do get bottom-of-the-barrel treatment,” Bates said. “They’re sort of the forgotten population.” Bates has a different view of Letcher County’s potential for economic revitalization. She’d like more mental health services provided to locals and to see an economy based on regenerative agriculture. The ARP’s acquisition is a great place to start. For her it also offers another benefit: healing. “[Concerned Letcher Countians] think that it will be the kind of growth and development that will provide the nexus for young people to learn Indigenous practices and restorative use of the land,” Bates said. “It’s economically good. It’s ecologically productive, it’s culturally positive. It’s the beginning of righting a wrong that started 500 years ago.” This story originally appeared inPrism. **Inspiration in Your Inbox** Sign up to receive email updates from YES! About Events Environmental Justice Racial Justice Body Politics Political Power Social Justice Economic Power Teacher Resources Truth Fall 2024 All Issues Get YES! Emails Environmental Justice Racial Justice Body Politics Political Power Economic Power All Issues Current Issue About Magazine Follow Environmental Justice Racial Justice Body Politics Political Power Economic Power All Issues Current Issue **ABOUT** About YES! Events Teacher Resources Jobs & Internships Privacy Policy Contact Us **SUPPORT** Donor Appreciation **MAGAZINE** All Issues **FOLLOW** Get YES! Emails **Inspiration in Your Inbox.** Sign up to receive email updates from YES! **YES! Media to Sunset June 2025** After nearly 30 years of independent journalism rooted in justice, imagination, and solutions, YES! Media will sunset operations at the end of June 2025. This decision follows years of tireless efforts to secure a sustainable path forward. We are heartbroken but we are also incredibly proud. Proud of what we built. Proud of who we built it with. And proud of the impact that YES! has had on the world. Click Here to read our farewell message and learn how you can support a compassionate closeout"}