{"id": 1184, "name": "International Rescue Committee", "domain": "rescue.org", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.rescue.org/article/malnutrition-irc-helps-children-who-are-affected", "title": "Malnutrition Irc Helps Children Who Are Affected", "content": "Log in Careers Volunteer U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 United Kingdom Deutschland Sverige European Union 한국 U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 United Kingdom Deutschland Sverige European Union 한국 United Kingdom Deutschland Sverige European Union 한국 Donate Who We AreAbout UsAt a GlanceAnnual ReportFinancials & RatingsOur Strategy About Us At a Glance Annual Report Financials & Ratings Our Strategy About Us At a Glance Annual Report Financials & Ratings Our Strategy Our People President David Miliband Staff Leaders Board & Advisors Ambassadors Where We WorkplaceholderAfricaBurkina FasoBurundiCameroonCentral African RepublicChadCôte d'IvoireDemocratic Republic of CongoEthiopiaKenyaLiberiaLibyaMaliNigerNigeriaSomaliaSouth SudanSudanTanzaniaUgandaZimbabweAsiaAfghanistanBangladeshMalaysiaMyanmarPakistanThailandEuropeGermanyGreeceItalyPolandSerbiaUkraineLatin AmericaColombiaEcuadorEl SalvadorHondurasMexicoPeruVenezuelaMiddle EastIraqJordanLebanonOccupied Palestinian territory (oPt)SyriaYemenUnited StatesAbilene, TXAtlanta, GABaltimore, MDBoise, IDCharlottesville, VADallas, TXDenver, CODes Moines, IAElizabeth, NJIowa City, IALos Angeles, CALouisville, KYMiami, FLMissoula, MTNew York, NYOakland, CAPhoenix, AZRichmond, VASacramento, CASalt Lake City, UTSan Diego, CASan Jose, CASeattle, WASilver Spring, MDSpokane, WATallahassee, FLTucson, AZTurlock, CAWichita, KS placeholder AfricaBurkina FasoBurundiCameroonCentral African RepublicChadCôte d'IvoireDemocratic Republic of CongoEthiopiaKenyaLiberiaLibyaMaliNigerNigeriaSomaliaSouth SudanSudanTanzaniaUgandaZimbabwe Burkina Faso Burundi Cameroon Central African Republic Chad Côte d'Ivoire Democratic Republic of Congo Ethiopia Kenya Liberia Libya Mali Niger Nigeria Somalia South Sudan Sudan Tanzania Uganda Zimbabwe AsiaAfghanistanBangladeshMalaysiaMyanmarPakistanThailand Afghanistan Bangladesh Malaysia Myanmar Pakistan Thailand EuropeGermanyGreeceItalyPolandSerbiaUkraine Germany Greece Italy Poland Serbia Ukraine Latin AmericaColombiaEcuadorEl SalvadorHondurasMexicoPeruVenezuela Colombia Ecuador El Salvador Honduras Mexico Peru Venezuela Middle EastIraqJordanLebanonOccupied Palestinian territory (oPt)SyriaYemen Iraq Jordan Lebanon Occupied Palestinian territory (oPt) Syria Yemen United StatesAbilene, TXAtlanta, GABaltimore, MDBoise, IDCharlottesville, VADallas, TXDenver, CODes Moines, IAElizabeth, NJIowa City, IALos Angeles, CALouisville, KYMiami, FLMissoula, MTNew York, NYOakland, CAPhoenix, AZRichmond, VASacramento, CASalt Lake City, UTSan Diego, CASan Jose, CASeattle, WASilver Spring, MDSpokane, WATallahassee, FLTucson, AZTurlock, CAWichita, KS Abilene, TX Atlanta, GA Baltimore, MD Boise, ID Charlottesville, VA Dallas, TX Denver, CO Des Moines, IA Elizabeth, NJ Iowa City, IA Los Angeles, CA Louisville, KY Miami, FL Missoula, MT New York, NY Oakland, CA Phoenix, AZ Richmond, VA Sacramento, CA Salt Lake City, UT San Diego, CA San Jose, CA Seattle, WA Silver Spring, MD Spokane, WA Tallahassee, FL Tucson, AZ Turlock, CA Wichita, KS placeholder AfricaBurkina FasoBurundiCameroonCentral African RepublicChadCôte d'IvoireDemocratic Republic of CongoEthiopiaKenyaLiberiaLibyaMaliNigerNigeriaSomaliaSouth SudanSudanTanzaniaUgandaZimbabwe Burkina Faso Burundi Cameroon Central African Republic Chad Côte d'Ivoire Democratic Republic of Congo Ethiopia Kenya Liberia Libya Mali Niger Nigeria Somalia South Sudan Sudan Tanzania Uganda Zimbabwe Burkina Faso Burundi Cameroon Central African Republic Chad Côte d'Ivoire Democratic Republic of Congo Ethiopia Kenya Liberia Libya Mali Niger Nigeria Somalia South Sudan Sudan Tanzania Uganda Zimbabwe AsiaAfghanistanBangladeshMalaysiaMyanmarPakistanThailand Afghanistan Bangladesh Malaysia Myanmar Pakistan Thailand Afghanistan Bangladesh Malaysia Myanmar Pakistan Thailand EuropeGermanyGreeceItalyPolandSerbiaUkraine Germany Greece Italy Poland Serbia Ukraine Germany Greece Italy Poland Serbia Ukraine Latin AmericaColombiaEcuadorEl SalvadorHondurasMexicoPeruVenezuela Colombia Ecuador El Salvador Honduras Mexico Peru Venezuela Colombia Ecuador El Salvador Honduras Mexico Peru Venezuela Middle EastIraqJordanLebanonOccupied Palestinian territory (oPt)SyriaYemen Iraq Jordan Lebanon Occupied Palestinian territory (oPt) Syria Yemen Iraq Jordan Lebanon Occupied Palestinian territory (oPt) Syria Yemen United StatesAbilene, TXAtlanta, GABaltimore, MDBoise, IDCharlottesville, VADallas, TXDenver, CODes Moines, IAElizabeth, NJIowa City, IALos Angeles, CALouisville, KYMiami, FLMissoula, MTNew York, NYOakland, CAPhoenix, AZRichmond, VASacramento, CASalt Lake City, UTSan Diego, CASan Jose, CASeattle, WASilver Spring, MDSpokane, WATallahassee, FLTucson, AZTurlock, CAWichita, KS Abilene, TX Atlanta, GA Baltimore, MD Boise, ID Charlottesville, VA Dallas, TX Denver, CO Des Moines, IA Elizabeth, NJ Iowa City, IA Los Angeles, CA Louisville, KY Miami, FL Missoula, MT New York, NY Oakland, CA Phoenix, AZ Richmond, VA Sacramento, CA Salt Lake City, UT San Diego, CA San Jose, CA Seattle, WA Silver Spring, MD Spokane, WA Tallahassee, FL Tucson, AZ Turlock, CA Wichita, KS Abilene, TX Atlanta, GA Baltimore, MD Boise, ID Charlottesville, VA Dallas, TX Denver, CO Des Moines, IA Elizabeth, NJ Iowa City, IA Los Angeles, CA Louisville, KY Miami, FL Missoula, MT New York, NY Oakland, CA Phoenix, AZ Richmond, VA Sacramento, CA Salt Lake City, UT San Diego, CA San Jose, CA Seattle, WA Silver Spring, MD Spokane, WA Tallahassee, FL Tucson, AZ Turlock, CA Wichita, KS What We DoWhere We FocusEconomic WellbeingEducationHealthEmpowermentSafety Where We Focus Economic Wellbeing Education Health Empowerment Safety Where We Focus Economic Wellbeing Education Health Empowerment Safety Our Approach Centered on Women & Girls Policy & Advocacy How We Use Evidence Airbel Impact Lab Reports and Resources How To HelpGiveDonate MonthlyStart a Fundraising CampaignMake a Planned GiftDonor-Advised Funds, Stocks and CryptoStreaming and GamingMake a Tribute GiftGifts from your IRA Give Donate Monthly Start a Fundraising Campaign Make a Planned Gift Donor-Advised Funds, Stocks and Crypto Streaming and Gaming Make a Tribute Gift Gifts from your IRA Give Donate Monthly Start a Fundraising Campaign Make a Planned Gift Donor-Advised Funds, Stocks and Crypto Streaming and Gaming Make a Tribute Gift Gifts from your IRA Join Us Join the Rescue Collective Become a Corporate Partner Attend an Event Volunteer Sponsor a Refugee Careers LatestNewsMedia CenterNews & FeaturesHopeful News2025 Emergency Watchlist News Media Center News & Features Hopeful News 2025 Emergency Watchlist News Media Center News & Features Hopeful News 2025 Emergency Watchlist Crises & Issues Gaza Crisis Ukraine crisis Border asylum seekers 2025 U.S. News Refugees in America Crisis Watch Search Log in Careers Volunteer U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 United Kingdom Deutschland Sverige European Union 한국 U.S./GlobalUnited KingdomDeutschlandSverigeEuropean Union한국 United Kingdom Deutschland Sverige European Union 한국 United Kingdom Deutschland Sverige European Union 한국 **How the IRC treats malnourished children** Acute malnutrition is among the world's most challenging issues. But there is a simple solution. Malnutrition is a leading cause of death for children globally, but a scalable, cost-effective solution exists that helps more than 90% of treated children recover. Historically, in places where the IRC works, over 80% of children with acute malnutrition go untreated—the IRC is changing that. U.S. aid funding cuts are putting this critical work at risk—but you can help. Every year, up to two million children lose their lives to acute malnutrition—one child every 15 seconds—even though a simple, effective solution exists. The International Rescue Committee (IRC) is helping to change that. We lead innovation with a simpler, more effective way to treat malnutrition, ensuring more children receive life-saving treatment at a lower cost. Each year, our malnutrition programs treat over 600,000 children across the world, delivering support where it’s needed most. Unfortunately,recent cuts to humanitarian aidfrom the United States are putting this critical work at risk. But with your help, we can continue to save lives. Learn how U.S. aid cuts are threatening the IRC’s malnutrition work around the world. **Save a child's life** **Save a child's life** **What is malnutrition?** **** Acute or chronic? There are various degrees of malnutrition. The most severe cases are typically divided into acute and chronic categories. Acute malnutrition results from insufficient nutritional intake over a short period. Severe acute malnutrition, the most serious form of acute malnutrition, often occurs alongside famine.Children suffering from chronic malnutrition experience lasting damage that results in mental disabilities and hindered physical development. Malnutrition occurs when a child does not receive the adequate nutrition they need to grow and thrive. Acute malnutrition is a life-threatening condition caused by a lack of nutritious food or from illness that causes sudden weight loss. Children with severe acute malnutrition, the most serious version, are more than 11 times as likely to die as other children. For children who survive, the effects of malnutrition can be devastating and long-lasting. It can cause irreversible damage to brain development and significantly weaken the immune system, leaving the child more vulnerable to illness throughout their life. In crisis zones, malnourished children often face enormous challenges in reaching medical care. Poverty, unsafe travel conditions, conflict or environmental obstacles such asflooding, can make hospital visits impossible, especially for children who are already weakened. **How does the IRC treat children with malnutrition?** The IRC is leading innovation in treating acute malnutrition, ensuring more children receive life-saving care. Currently, children who need life-saving treatment are divided into two groups—moderate and severe acute malnutrition—and treated with different products at different locations by separate UN agencies. This fragmented system limits how many children can be reached. The IRC is leading the movement for a more effective, unified treatment plan. Our simplified approach treats all forms of acute malnutrition with a single food product and point of care. We use a color-coded measuring tape to diagnose malnutrition and a nutritional peanut paste known as ready-to-use therapeutic food (RUTF) to treat children. Additionally, the IRC trains community health workers to bring this lifesaving care directly to hard-to-reach communities. The results are clear: the IRC’s approach helps over 90% of children recover, costs 20% less per child treated and uses 25% less product than the traditional UN approach to treating malnutrition. Simplifying malnutrition treatment works—and the IRC is ready to scale up our lifesaving work. **Diagnosing malnutrition with measuring tapes** Timely identification of malnutrition could save a child’s life. The IRC uses a color-coded measuring tape to do just that. This simple tool quickly shows whether a child is at risk, and if so, how severe their condition is. For parents, this tape also offers a convenient way to monitor their child’s health from home, so they can take action before the situation worsens. **Life saving peanut paste: A simple, effective solution** One food product, RUTF, can treat all acutely malnourished children—it's simply a matter of adjusting the dosage to meet their specific needs. This life-saving solution comes in the form of a nutrient-rich peanut paste, packaged conveniently in a squeeze pouch. Unlike traditional treatments requiring clinics or IV drips, RUTF allows parents to care for their children at home. By making treatment more accessible, we can reach more children and save more lives. **Meeting malnourished children at home** In crisis zones, families often face enormous challenges in reaching medical care. Poverty, unsafe travel conditions, conflict or environmental obstacles such asflooding, can make hospital visits impossible, especially for children already weakened by malnutrition. That’s why the IRC’s mobile health teams travel to where help is needed most, saving families from having to travel far to hospitals for care. We also train community health workers to diagnose and treat malnutrition, helping build a healthier future at a fraction of the cost of traditional treatment approaches. **At a glance: Meet IRC staff treating malnutrition in Nigeria** Nigeriais one of the 21 countries where the IRC delivers life-saving malnutrition support–and where this work is now in jeopardy. For more than a decade, armed conflict in northern Nigeria has forced countless families from their homes, disrupting their ability to farm and earn a livelihood. Severe flooding has made the crisis worse, devastating food supplies, disrupting agricultural activities, displacing families and pushing more children into malnutrition. In 2023 alone, our teams treated over 125,000 children for malnutrition across seven hospitals and 65 community centers in Nigeria. We’ve also trained community health workers to bring care directly to families. Using a color-coded measuring tape, they can diagnose children with malnutrition and treat them using a nutritional peanut paste. One clinic is facing the threat of closure while also servicing an uptick in clients due to severe flooding. Mashamari Stabilization Center admits on average 250 clients per month. During record flooding in Maiduguri last year, the clinic was entirely flooded, forcing IRC to evacuate staff and clients, keeping children attached to their ICU-like machines to ensure their survival. Learn more about how the IRC is addressing malnutrition in Nigeria. **Why do children with acute malnutrition go untreated?** Despite the existence of a simple, proven treatment, over 80% of children with acute malnutrition never receive care. Why? Barriers like conflict, underfunded health systems, and nowsevere U.S. aid cuts, prevent access to care. This is especially true in countries that grapple with severe humanitarian crises, includingAfghanistan,Gaza,NigeriaandSudan. Additionally, the traditional approach to treating malnutrition is overly complex and fragmented. It separates treatment for different forms of malnutrition and requires multiple visits to clinics that are far from home. The IRC is changing the way the world responds to malnutrition. Our streamlined approach to treating malnutrition brings effective care directly to communities and helps children survive. **U.S. aid cuts are impacting life-saving malnutrition programs** RecentU.S. aid cutsare jeopardizing malnutrition treatment programs around the world. These funding cuts are forcing essential nutrition programs to scale back or close in communities where humanitarian aid is often the only source of support. The consequences are especially severe for children suffering from the most severe forms of malnutrition. The IRC treats these children in ICU-like settings where even a momentary disruption to care can be threatening. These are probably the most vulnerable clients the IRC has around the world. Tragically, aid cuts will force the IRC to cut malnutrition support programs that support tens of thousands of children around the world.Urgent support is needed to keep these programs operating. **How can I help children with malnutrition?** The IRC is committed to saving lives. Our teams work tirelessly to deliver life-saving support in crisis-affected communities around the world—but aid cuts and restrictive policies implemented by the Trump administration are impacting our work. The IRC urgently needs support to maintain our critical programming. Support the IRC as we help people in crisis to survive, recover and rebuild their lives. **Save a child's life** **Save a child's life** **What is the International Rescue Committee (IRC)?** TheInternational Rescue Committee (IRC)treats children experiencing acute malnutrition in 21 countries. We also help refugees and displaced people find safety and rebuild their lives by resettling and integrating into new communities in the U.S. and across Europe and deliver life-saving services in some of the world’s largest and most crisis-affected refugee camps. The IRC also responds to the world’s most urgent humanitarian crises including inSudan,Ukraineand theoccupied Palestinian territory. Founded at the call ofAlbert Einsteinover 90 years ago, the IRC remains dedicated to helping people affected by crises to survive, recover and rebuild their lives. We consistently earntop marksby charity watchdog groups for our efficient use of donor contributions and the effectiveness of our work. Support our mission—help crisis-affected people survive, recover and rebuild their lives. **Save a child's life** **Save a child's life** **Explore related topics:** IRC's malnutrition treatment **Related news & features** Acute malnutritionWhy do most children affected by acute malnutrition go untreated?August 2, 2023 Ending malnutritionHow is the IRC treating malnutrition in northern Nigeria?November 12, 2024 Malnutrition in EthiopiaPhoto story: A simplified approach to combating child malnutrition in EthiopiaMay 28, 2024 Child MalnutritionA woman's fight against her grandson’s malnutrition in NigeriaDecember 3, 2024 Who We Are Where We Work What We Do How To Help Latest Careers Contact Us Donor Help Code of Conduct Ethics Hotline 87%Program services 7%Management and general 6%Fundraising Get the latest news about the IRC's innovative programs, compelling stories about our clients and how you can make a difference.Subscribe U.S./Global UK Germany Sweden EU Korea Phone Opt Out Respecting Your Privacy Terms and Conditions Fraud Prevention"}