{"id": 674, "name": "India.com", "domain": "india.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.india.com/news/india/india-needs-hundreds-of-satellites-to-intercept-hypersonic-missiles-warns-says-us-planning-to-create-500-space-indian-space-research-organisation-isro-ukraine-cyber-warfare-usa-artificial-intelligence-7875020/", "title": "India Needs Hundreds Of Satellites To Intercept Hypersonic Missiles Warns Says Us Planning To Create 500 Space Indian Space Research Organisation Isro Ukraine Cyber Warfare Usa Artificial Intelligence 7875020", "content": "Travel By India.com The Health Site Bollywood Life Cricket Country Petuz Techlusive My-Lord Follow us on: **We are on Telegram now** click this icon for latest updates Latest India Business Sports Entertainment Videos Viral Photos Webstories World Sports StatesUttar PradeshMadhya PradeshKarnatakaBiharRajasthanMaharashtraDelhiWest BengalTamil NaduTelangana Uttar Pradesh Madhya Pradesh Karnataka Bihar Rajasthan Maharashtra Delhi West Bengal Tamil Nadu Telangana Uttar Pradesh Madhya Pradesh Karnataka Bihar Rajasthan Maharashtra Delhi West Bengal Tamil Nadu Telangana Auto Business Tech Health Deals Women Travel WorldSportsStatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle SportsStatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle StatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle SportsStatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle StatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle SportsStatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle StatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle StatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle StatesAutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle AutoBusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle BusinessTechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TechHealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle HealthDealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle DealsWomenTravelInternationalTopicsIFSC CodeEducationLifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle WomenTravelInternationalTopicsIFSC CodeEducationLifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TravelInternationalTopicsIFSC CodeEducationLifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle InternationalTopicsIFSC CodeEducationLifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle TopicsIFSC CodeEducationLifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle IFSC CodeEducationLifestyle EducationLifestyle Lifestyle EducationLifestyle Lifestyle EducationLifestyle Lifestyle Lifestyle Lifestyle Advertise With Us About Us Disclaimer Privacy Policy T&C Contact Us Complaint Home News‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500… ‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500… ‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500… **‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500…** **Space has emerged as the base or the command centre of many countries’ militaries.** Published: June 10, 2025 11:34 PM IST ByTahir Qureshi|Edited byTahir Qureshi Follow Us New Delhi:There was a time when in the modern world when wars were fought between two or more militaries using conventional weapons for both attack and defence. Since the disintegration of the USSR and the end of the Cold War, technology became an integral part of warfare. If we say technology is the lifeline of modern warfare than not many will disagree. The scenario in the 21st century has given way to new, much advanced, sophisticated, and cutting-edge systems. We can say it has become futuristic as we have observed evolution of fighter jets, missiles, artillery, submarines, and other modes.In this process, space has emerged as the base or the command centre of many countries’ militaries. Space has been flooded with satellites that play key role in modern war theatre.In this regard, former Indian Space Research Organisation (ISRO) chairman Dr. Sreedhara Panicker Somanath has warned that without a massive satellite boost, India’s armed forces risk blind spots in crisis. He described it an unacceptable vulnerability in an era where wars are being fought in the skies through networking and signals.“The importance of space for defence has been understood very well now. It has been demonstrated very well in some of the recent conflicts. For example, the Ukraine conflict. It has shown it very well how it played a role, and recently in India also,” said Dr Somanath as he cited studies according to which more than 50% of the space-based applications will be in defence. He went on to say that state-funded military programmes will soon dominate the economics of space systems.Referring to the limited role of human beings in the present day combat, Dr Somanath said, “Many of the conflicts are not in occupation. You wage cyber warfare. Now, wars are fought to create problems and havoc in countries. There is no occupation of anything. In this context, satellites deliver critical frameworks of communication for secure command and frameworks for observation to track threats in real time.”Citing example of hypersonic missiles, which are almost impermeable to ground defences, have hastened the need for orbital early warning. Dr Somanath said the USA is working on the idea of creating a 500 satellite constellation for an early warning system and a neutralising system, detecting launches, and guiding counter-measures long before impact.Dr Somanath warned that India must balance this scale. “You need hundreds of such satellites. Their period of observations is hardly 15 minutes and the next satellite should come immediately to cover that area,” he said.Dr Somanath called for night-vision, beyond visible imaging, thermal, radar, multispectral and hyperspectral sensors, each feeding AI-driven analytics to distil massive data into battlefield decisions. Satellites themselves must evolve into both offensive platforms and hardened assets, as you have to protect your own satellites because the satellites are also a war occupant, he observed.Dr. Somanath served as ISRO chairman from 2022 to 2025. Under his chairmanship, ISRO carried out the lunar exploration mission Chandrayaan-3, making India the first country to successfully land a spacecraft near the lunar south pole.Also Read:Top 10 powerful tanks in the world, China and Pakistan have..., India's Arjun tanks are...Rudram, Astra, SAAW...bad news for Pakistan, China, indigenous missile trinity to arm..., it can travel...China's Nuclear missile sparks global alarm, US urges Asian countries to..., missile can destroy... DF-5 can travel...For breaking news and live news updates, like us onFacebookor follow us onTwitterandInstagram. Read more on LatestIndia NewsonIndia.com.TopicsISROHypersonic MissilesIndiasatellitesMore Stories In this process, space has emerged as the base or the command centre of many countries’ militaries. Space has been flooded with satellites that play key role in modern war theatre. In this regard, former Indian Space Research Organisation (ISRO) chairman Dr. Sreedhara Panicker Somanath has warned that without a massive satellite boost, India’s armed forces risk blind spots in crisis. He described it an unacceptable vulnerability in an era where wars are being fought in the skies through networking and signals. “The importance of space for defence has been understood very well now. It has been demonstrated very well in some of the recent conflicts. For example, the Ukraine conflict. It has shown it very well how it played a role, and recently in India also,” said Dr Somanath as he cited studies according to which more than 50% of the space-based applications will be in defence. He went on to say that state-funded military programmes will soon dominate the economics of space systems. Referring to the limited role of human beings in the present day combat, Dr Somanath said, “Many of the conflicts are not in occupation. You wage cyber warfare. Now, wars are fought to create problems and havoc in countries. There is no occupation of anything. In this context, satellites deliver critical frameworks of communication for secure command and frameworks for observation to track threats in real time.” Citing example of hypersonic missiles, which are almost impermeable to ground defences, have hastened the need for orbital early warning. Dr Somanath said the USA is working on the idea of creating a 500 satellite constellation for an early warning system and a neutralising system, detecting launches, and guiding counter-measures long before impact. Dr Somanath warned that India must balance this scale. “You need hundreds of such satellites. Their period of observations is hardly 15 minutes and the next satellite should come immediately to cover that area,” he said. Dr Somanath called for night-vision, beyond visible imaging, thermal, radar, multispectral and hyperspectral sensors, each feeding AI-driven analytics to distil massive data into battlefield decisions. Satellites themselves must evolve into both offensive platforms and hardened assets, as you have to protect your own satellites because the satellites are also a war occupant, he observed. Dr. Somanath served as ISRO chairman from 2022 to 2025. Under his chairmanship, ISRO carried out the lunar exploration mission Chandrayaan-3, making India the first country to successfully land a spacecraft near the lunar south pole. **Also Read:** Top 10 powerful tanks in the world, China and Pakistan have..., India's Arjun tanks are... Rudram, Astra, SAAW...bad news for Pakistan, China, indigenous missile trinity to arm..., it can travel... China's Nuclear missile sparks global alarm, US urges Asian countries to..., missile can destroy... DF-5 can travel... For breaking news and live news updates, like us onFacebookor follow us onTwitterandInstagram. Read more on LatestIndia NewsonIndia.com. **Topics** ISRO Hypersonic Missiles India satellites **More Stories** In this process, space has emerged as the base or the command centre of many countries’ militaries. Space has been flooded with satellites that play key role in modern war theatre. In this regard, former Indian Space Research Organisation (ISRO) chairman Dr. Sreedhara Panicker Somanath has warned that without a massive satellite boost, India’s armed forces risk blind spots in crisis. He described it an unacceptable vulnerability in an era where wars are being fought in the skies through networking and signals. “The importance of space for defence has been understood very well now. It has been demonstrated very well in some of the recent conflicts. For example, the Ukraine conflict. It has shown it very well how it played a role, and recently in India also,” said Dr Somanath as he cited studies according to which more than 50% of the space-based applications will be in defence. He went on to say that state-funded military programmes will soon dominate the economics of space systems. Referring to the limited role of human beings in the present day combat, Dr Somanath said, “Many of the conflicts are not in occupation. You wage cyber warfare. Now, wars are fought to create problems and havoc in countries. There is no occupation of anything. In this context, satellites deliver critical frameworks of communication for secure command and frameworks for observation to track threats in real time.” Citing example of hypersonic missiles, which are almost impermeable to ground defences, have hastened the need for orbital early warning. Dr Somanath said the USA is working on the idea of creating a 500 satellite constellation for an early warning system and a neutralising system, detecting launches, and guiding counter-measures long before impact. Dr Somanath warned that India must balance this scale. “You need hundreds of such satellites. Their period of observations is hardly 15 minutes and the next satellite should come immediately to cover that area,” he said. Dr Somanath called for night-vision, beyond visible imaging, thermal, radar, multispectral and hyperspectral sensors, each feeding AI-driven analytics to distil massive data into battlefield decisions. Satellites themselves must evolve into both offensive platforms and hardened assets, as you have to protect your own satellites because the satellites are also a war occupant, he observed. Dr. Somanath served as ISRO chairman from 2022 to 2025. Under his chairmanship, ISRO carried out the lunar exploration mission Chandrayaan-3, making India the first country to successfully land a spacecraft near the lunar south pole. **Also Read:** Top 10 powerful tanks in the world, China and Pakistan have..., India's Arjun tanks are... Rudram, Astra, SAAW...bad news for Pakistan, China, indigenous missile trinity to arm..., it can travel... China's Nuclear missile sparks global alarm, US urges Asian countries to..., missile can destroy... DF-5 can travel... For breaking news and live news updates, like us onFacebookor follow us onTwitterandInstagram. Read more on LatestIndia NewsonIndia.com. **Topics** ISRO Hypersonic Missiles India satellites **More Stories** **People Are Also Reading** **Latest In News** Big challenge for Zomato, Swiggy, Blinkit and Zepto as Ratan Tata's Bigbasket aims to launch... Big challenge for Zomato, Swiggy, Blinkit and Zepto as Ratan Tata's Bigbasket aims to launch... Honeymoon horror: Kangana Ranaut calls Sonam Raghuwanshi ‘dumb’, says ‘couldn’t even…’ Honeymoon horror: Kangana Ranaut calls Sonam Raghuwanshi ‘dumb’, says ‘couldn’t even…’ PM Modi plans biggest move against Pakistan's friend Turkey amid boycott claims, plans to..., Turkey will now be... PM Modi plans biggest move against Pakistan's friend Turkey amid boycott claims, plans to..., Turkey will now be... ChatGPT down: Users across the world report massive outage in OpenAI service ChatGPT down: Users across the world report massive outage in OpenAI service Meet Ajay Devgn's sister, as beautiful as any Bollywood actress, her name is..., she works as... Meet Ajay Devgn's sister, as beautiful as any Bollywood actress, her name is..., she works as... **Related Stories** Top 10 powerful tanks in the world, China and Pakistan have..., India's Arjun tanks are... Top 10 powerful tanks in the world, China and Pakistan have..., India's Arjun tanks are... ‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500… ‘India needs hundreds of satellites to intercept hypersonic missiles’, warns…, says US planning to create 500… Good news for Team India ahead of IND vs ENG series 2025, Star bowler joins This team for....., his name is..... Good news for Team India ahead of IND vs ENG series 2025, Star bowler joins This team for....., his name is..... How Monsoon Brings Life And Color To The Heart Of Kochi How Monsoon Brings Life And Color To The Heart Of Kochi PM Modi plans biggest move against Pakistan's friend Turkey amid boycott claims, plans to..., Turkey will now be... PM Modi plans biggest move against Pakistan's friend Turkey amid boycott claims, plans to..., Turkey will now be... By clicking “Accept All Cookies”, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing effortsCookies Policy."}