{"id": 1062, "name": "Open", "domain": "open.online", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.open.online/2025/06/10/gaza-ancora-raid-dellesercito-israeliano-evacuate-immediatamente-verso-sud-lattacco-nei-pressi-del-centro-aiuti-umanitari/", "title": "Gaza Ancora Raid Dellesercito Israeliano Evacuate Immediatamente Verso Sud Lattacco Nei Pressi Del Centro Aiuti Umanitari", "content": "SOSTENIBILITÀ ECONOMIA & LAVORO ESTERI CULTURA & SPETTACOLO ATTUALITÀ POLITICA Governo Meloni Austria Nazionale italiana Maturità Mondiale per Club 2025 Greta Thunberg ATTUALITÀ CULTURA & SPETTACOLO POLITICA SCUOLA E UNIVERSITÀ ESTERI ECONOMIA & LAVORO SPORT SALUTE DIRITTI SCIENZE E INNOVAZIONE SOSTENIBILITÀ FACT-CHECKING Chi siamo Contatti **Gaza, ancora raid dell’esercito israeliano: «Evacuate immediatamente verso sud». L’attacco nei pressi del centro aiuti umanitari** Ancora missili dell’esercito israeliano su Gaza. Secondo quanto riportato daAl Jazeera, almeno 60 palestinesi sarebbero morti oggi nei raid dell’esercito israeliano a Gaza. Di questi, 14 persone sono state uccise nei pressi del centro di aiuti sostenuto dagli Stati Uniti dellaGaza Humanitarian Foundation(Ghf) nella parte meridionale di Rafah. Intanto il portavoce in lingua araba dell’esercito israeliano,Avichay Adree, ha fatto sapere tramite il suo account X: «Risponderanno con fermezza a qualsiasi atto terroristico o attacco missilistico. Per la vostra sicurezza, evacuate immediatamente a sud, verso i rifugi di Gaza». Il tutto mentre Israele harespinto lo yacht di Freedom Flotilla, la nave carica di aiuti umanitari che voleva sensibilizzare l’opinione pubblica, e harimpatriato alcuni dei suoi passeggeri, tra cui l’attivistaGreta Thunberg. **Crosetto: «Inaccettabile che si ritardino aiuti Gaza»** Sugli avvenimenti a Gaza, è intervenuto anche il ministro della DifesaGuido Crosetto, che, a margine della conclusione del tour della Vespucci, ha commentato il ritardo degli aiuti a Gaza: «Una delle cose più assurde di questa guerra è che ci sono problemi anche negli aiuti. Questo non è accettabile. Finora siamo riusciti a portare sempre alla fine quello che volevamo. Quindi: o siamo stati fortunati o bravi». **Il Regno Unito sanziona due ministri israeliani dell’ultradestra** Anche il governo britannico diKeir Starmerè intervenuto, sanzionando due ministri israeliani d’ultradestra del governo diBenjmin Netanyahu, Itamar Ben-Gvir e Bezalel Smotrich, in relazione alla recente nuova escalation nella Striscia di Gaza palestinese e per i progetti di espansione delle colonie in Cisgiordania. Lo anticipano i media del Regno, precisando che le sanzioni sono condivise assieme a tre alleati: Canada, Australia e Nuova Zelanda. **Il rapporto della commissione Onu** Oggi 10 giugno è stato diffuso anche ilnuovo rapportodella Commissione indipendente d’inchiesta delleNazioni Unitesui territori palestinesi occupati. Il presidente della Commissione Navi Pillay ha commentato: «Gli attacchi di Israele alla vita educativa, culturale e religiosa del popolo palestinese danneggeranno le generazioni presenti e future, ostacolando il loro diritto all’autodeterminazione». Nel rapporto si legge che: «Oltre 658.000 bambini a Gaza non hanno frequentato la scuola per 20 mesi e uccidendo civili che si rifugiavano in scuole e siti religiosi, le forze di sicurezza israeliane hanno commesso il crimine contro l’umanità di sterminio». Conclude il rapporto: «Tali atti sono indicativi dell’intenzione delle forze israeliane di distruggere queste strutture per limitare l’accesso dei palestinesi all’istruzione a lungo termine». La Commissione ha riscontrato un caso in cui anche l’ala militare di Hamas aveva utilizzato una scuola per scopi militari. **Garlasco, il Racis, Andrea Sempio e l’omicidio di Chiara Poggi: «Cercano prove per un altro indagato»** **Odori insopportabili in ufficio, a Mestre doccia inclusa nell’orario di lavoro: la circolare sulla «maggiore igiene personale»** **I tatuaggi, il volto «sfigurato», i tratti dell’Est: la donna fantasma di Villa Pamphili e la figlia forse strangolata** **Elena Belloli ammazzata dal marito, ora i funerali insieme a lui: «Per evitare lo strazio al figlio». È polemica sulla decisione delle due famiglie** **Garlasco, lo sfogo di Sempio: «Preoccupato per i miei genitori, non per l’indagine». Giovedì ai periti i reperti di casa Poggi per l’incidente probatorio** **Greta Thunberg arriva a Parigi e accusa Israele: «Ci ha rapiti in acque internazionali». Espulsi altri 4 attivisti della Flotilla, in 8 hanno rifiutato** **Freedom Flotilla, Greta Thunberg rimpatriata da Israele dopo l’arresto: l’attivista costretta a prendere l’aereo – Il video** **La falsa prima pagina di Repubblica «Perdonateci» su Gaza** **Corteo per Gaza a Roma: «Siamo oltre 300mila». Lo striscione «Stop al massacro» davanti alle bandiere di Palestina, Israele e della Pace – Il video** ATTUALITÀ CULTURA & SPETTACOLO POLITICA SCUOLA E UNIVERSITÀ ESTERI ECONOMIA & LAVORO SPORT SALUTE DIRITTI SCIENZE E INNOVAZIONE SOSTENIBILITÀ FACT-CHECKING Governo Meloni Donald Trump Dazi Scuola Israele Ucraina Scioperi Suoni e Visioni Fact-Checking Chi siamo Contatti Privacy Policy & conditions Cookie"}