{"id": 389, "name": "EDF Action Fund", "domain": "edfaction.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.edfaction.org/news-resources/manatee-school-for-the-arts-a-bilingual-charter-school-in-florida-investing-in-solar-to-power-education/", "title": "Manatee School For The Arts A Bilingual Charter School In Florida Investing In Solar To Power Education", "content": "It’s all hands on deck to continue the fight for our climate future. Donate nowLinks to: Manatee School for the Arts: A bilingual charter school in Florida investing in solar to power education Impact News and Resources Take ActionShow submenu for “{$title}”EventsPetitions Events Petitions Events Petitions Donate Donate **Manatee School for the Arts: A bilingual charter school in Florida investing in solar to power education** Share Share this page on Facebook https://www.edfaction.org/news-resources/manatee-school-for-the-arts-a-bilingual-charter-school-in-florida-investing-in-solar-to-power-education/ The school in Palmetto, Fla. south of Tampa Bay is currently installing one of the largest solar projects of its kind in the state. Their energy savings will be substantial, especially if they can access federal clean energy incentives. Saving money, strengthening their buildings, providing a teachable moment: The power of solar. **Stay GreenStay Informed** Climate action requires all of us to play our part. Connecting is a start. By signing, you are opting into becoming a member of EDF Action and receiving breaking news and updates from EDF Action, EDF, and its agents and affiliates. You may unsubscribe at any time. By providing your phone number, you agree to receive texts and calls that may be automatically dialed or prerecorded from EDF Action, EDF, and its agents and affiliates on important environmental news, programs, ways to take action, and membership. Text STOP to opt out, HELP for more information. Message and data rates may apply. Impact News & Resources About EDF Action Votes EDF Action PAC Clean Air Moms Action Contact us Become a member Attend an event Advocacy partner of Environmental Defense Fund © EDF Action 2025 Privacy Policy Terms of Service Facebook X YouTube Instagram **Mobile Menu Overlay** Impact News and Resources Take Action Donate"}