{"id": 1567, "name": "Die Welt", "domain": "welt.de", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.welt.de/finanzen/article250958734/ING-Zinsen-3-0-auf-angelegtes-Guthaben-So-schneidet-das-Angebot-im-Vergleich-zur-Konkurrenz-ab.html", "title": "Ing Zinsen 3 0 Auf Angelegtes Guthaben So Schneidet Das Angebot Im Vergleich Zur Konkurrenz Ab.html", "content": "Inhaltsbereich Hauptnavigation Suche Login Fußbereich Ticker Suche Anmelden AboAbonnement Menu Hauptnavigation: Nutzen Sie die Tabulatortaste, um durch die Menüpunkte zu navigieren. Öffnen Sie Untermenüs mit der Leertaste. Schließen Sie Untermenüs mit der Escape-Taste. Hauptnavigation: Nutzen Sie die Tabulatortaste, um durch die Menüpunkte zu navigieren. Öffnen Sie Untermenüs mit der Leertaste. HomeAppsAutorenPodcastsThemenWELT VerantwortungWetterNewsletterWELTGo!KreuzworträtselSudokuWordleSchachmattSchlagzeilen-Archiv Apps Autoren Podcasts Themen WELT Verantwortung Wetter Newsletter WELTGo! Kreuzworträtsel Sudoku Wordle Schachmatt Schlagzeilen-Archiv Apps Autoren Podcasts Themen WELT Verantwortung Wetter Newsletter WELTGo! Kreuzworträtsel Sudoku Wordle Schachmatt Schlagzeilen-Archiv Live-TVWELT LiveN24 Doku WELT Live N24 Doku WELT Live N24 Doku MediathekPolitikergrillenDuell des TagesLive-SportDeffner & ZschäpitzReportagenWELT TalkDokumentationenMagazineSendungen A-ZVideosModeratorenTV-EmpfangTV-App Politikergrillen Duell des Tages Live-Sport Deffner & Zschäpitz Reportagen WELT Talk Dokumentationen Magazine Sendungen A-Z Videos Moderatoren TV-Empfang TV-App Politikergrillen Duell des Tages Live-Sport Deffner & Zschäpitz Reportagen WELT Talk Dokumentationen Magazine Sendungen A-Z Videos Moderatoren TV-Empfang TV-App WELTPLUSPolitikWirtschaftFinanzenSportPanoramaWissenGesundheitKulturMeinungGeschichteReiseLifestyle Politik Wirtschaft Finanzen Sport Panorama Wissen Gesundheit Kultur Meinung Geschichte Reise Lifestyle Politik Wirtschaft Finanzen Sport Panorama Wissen Gesundheit Kultur Meinung Geschichte Reise Lifestyle WirtschaftStellenmarktAlles auf AktienBeruf & KarriereGeldDigitalBörseMotor-NewsMittelstandBetter FutureFuture Pioneers SummitVision NowDeutscher KI-PreisMessewirtschaftAnzeigenScalable CapitalThought LeadersInnovation DeutschlandContentway HighlightsBusiness ReporterService ValueDigitalisierung Mittelstand Stellenmarkt Alles auf Aktien Beruf & Karriere Geld Digital Börse Motor-News Mittelstand Better Future Future Pioneers Summit Vision Now Deutscher KI-Preis Messewirtschaft Anzeigen Scalable Capital Thought Leaders Innovation Deutschland Contentway Highlights Business Reporter Service Value Digitalisierung Mittelstand Stellenmarkt Alles auf Aktien Beruf & Karriere Geld Digital Börse Motor-News Mittelstand Better Future Future Pioneers Summit Vision Now Deutscher KI-Preis Messewirtschaft Anzeigen Scalable Capital Thought Leaders Innovation Deutschland Contentway Highlights Business Reporter Service Value Digitalisierung Mittelstand LIFESTYLEPartnerschaftModeTrendsServiceFitness & WellnessEssen & Trinken Partnerschaft Mode Trends Service Fitness & Wellness Essen & Trinken Partnerschaft Mode Trends Service Fitness & Wellness Essen & Trinken SportFußballBundesligaBundesliga-Video-HighlightsDFB-PokalErgebnisse & TabellenLive-TickerHandballBasketballFormel 1DartsGolfTennisFitness Fußball Bundesliga Bundesliga-Video-Highlights DFB-Pokal Ergebnisse & Tabellen Live-Ticker Handball Basketball Formel 1 Darts Golf Tennis Fitness Fußball Bundesliga Bundesliga-Video-Highlights DFB-Pokal Ergebnisse & Tabellen Live-Ticker Handball Basketball Formel 1 Darts Golf Tennis Fitness PanoramaKriminalitätLeuteMeine GeschichteKuriosesKatastrophenWeltgeschehenkmpktFood - Rezepte von WELTKaufberatung Kriminalität Leute Meine Geschichte Kurioses Katastrophen Weltgeschehen kmpkt Food - Rezepte von WELT Kaufberatung Kriminalität Leute Meine Geschichte Kurioses Katastrophen Weltgeschehen kmpkt Food - Rezepte von WELT Kaufberatung PolitikDeutschlandAusland Deutschland Ausland Deutschland Ausland MeinungKommentareKolumnenZippert zapptSatire Kommentare Kolumnen Zippert zappt Satire Kommentare Kolumnen Zippert zappt Satire KulturStützen der GesellschaftLiterarische WeltFilmPopKunstTheaterArchitekturKlassikMedien Stützen der Gesellschaft Literarische Welt Film Pop Kunst Theater Architektur Klassik Medien Stützen der Gesellschaft Literarische Welt Film Pop Kunst Theater Architektur Klassik Medien GesundheitWissenDemenzHerzKrebsPsychologieNatur & UmweltWeltraum Wissen Demenz Herz Krebs Psychologie Natur & Umwelt Weltraum Wissen Demenz Herz Krebs Psychologie Natur & Umwelt Weltraum ICONFashionDesignWatchesIconsOntourJewelsBeauty Fashion Design Watches Icons Ontour Jewels Beauty Fashion Design Watches Icons Ontour Jewels Beauty GeschichteErster WeltkriegZweiter WeltkriegKalter KriegMittelalterArchäologie Erster Weltkrieg Zweiter Weltkrieg Kalter Krieg Mittelalter Archäologie Erster Weltkrieg Zweiter Weltkrieg Kalter Krieg Mittelalter Archäologie ReiseEuropaFernreiseDeutschlandStädtereiseReisewetterNordseeOstseeKreuzfahrtWinterurlaubAnzeigenGenussland Rheinland-Pfalz Europa Fernreise Deutschland Städtereise Reisewetter Nordsee Ostsee Kreuzfahrt Winterurlaub Anzeigen Genussland Rheinland-Pfalz Europa Fernreise Deutschland Städtereise Reisewetter Nordsee Ostsee Kreuzfahrt Winterurlaub Anzeigen Genussland Rheinland-Pfalz RegionalHamburg & Schleswig-HolsteinBerlin & BrandenburgNordrhein-WestfalenBayernBaden-WürttembergNiedersachsen & BremenHessenRheinland-Pfalz & SaarlandSachsenSachsen-AnhaltThüringenMecklenburg-Vorpommern Hamburg & Schleswig-Holstein Berlin & Brandenburg Nordrhein-Westfalen Bayern Baden-Württemberg Niedersachsen & Bremen Hessen Rheinland-Pfalz & Saarland Sachsen Sachsen-Anhalt Thüringen Mecklenburg-Vorpommern Hamburg & Schleswig-Holstein Berlin & Brandenburg Nordrhein-Westfalen Bayern Baden-Württemberg Niedersachsen & Bremen Hessen Rheinland-Pfalz & Saarland Sachsen Sachsen-Anhalt Thüringen Mecklenburg-Vorpommern SonderthemenReiseland DubaiMedizin der ZukunftWeinland FrankreichBierreportElektromobilitätMode & LifestyleMade in ItalyGenussland SpanienAnzeigenSonderveröffentlichungenGenussland Rheinland-Pfalz Reiseland Dubai Medizin der Zukunft Weinland Frankreich Bierreport Elektromobilität Mode & Lifestyle Made in Italy Genussland Spanien Anzeigen Sonderveröffentlichungen Genussland Rheinland-Pfalz Reiseland Dubai Medizin der Zukunft Weinland Frankreich Bierreport Elektromobilität Mode & Lifestyle Made in Italy Genussland Spanien Anzeigen Sonderveröffentlichungen Genussland Rheinland-Pfalz Home Geld ING Zinsen: Vier Monate 2,50 % auf angelegtes Guthaben sichern **ING Zinsen: Vier Monate 2,50 % auf angelegtes Guthaben sichern** **ING Zinsen: Vier Monate 2,50 % auf angelegtes Guthaben sichern** 0 **Vier Monate 2,50 % aufs Tagesgeld bei ING** In puncto Tagesgeld werben viele Broker und Banken mit attraktiven Zinssätzen. Die ING hält mit und bietet 2,50 % auf angelegtes Guthaben. Aber wie schneidet das Angebot der deutschen Direktbank im Vergleich zur Konkurrenz ab? Ein Check. 0 Wer ein neues Tagesgeldkonto eröffnen möchte, muss sich erst mit zahlreichen Angeboten auseinandersetzen. Verschiedenste Geldhäuser werben mit attraktiven Zinsen auf kurzfristigeGeldanlagen, sodass es bei der Entscheidung oft um die Feinheiten geht. Um aus der Menge herauszustechen, setzen manche Banken nicht nur auf hohe Aktionszinse für befristete Laufzeiten, sondern auch auf angenehme Zinssätze danach. So etwa die ING. Hier zum Tagesgeldkonto Hier zum Girokonto **ING Tagesgeld Zinsen: Die Vor- und Nachteile im Vergleich** Mit ihrem Zinssatz von2,50 %findet sich dieINGin der Mitte des Tagesgeldmarkts. DieDKB*bietet etwa1,00 %variable Zinsen p. a. aufs Tagesgeld an. Andere Anbieter wie beispielsweise dieConsorsbank*glänzen wiederum mit bis zu2,80 %Zinsen p. a. auf befristete Laufzeiten. DieStellantis Direktbank* bietet im Gegensatz derzeit2,55 Prozent Zinsen p.a.für Tagesgeld-Neukunden. Bestandskunden erhalten derzeit2,75 Prozentp.a. auf ihr Tagesgeld. Nach Ablauf des Aktionszeitraums von drei Monaten greift der reguläre Zinssatz von derzeit 1,35 Prozent p.a. Was manche Anleger jedoch ärgert: Die attraktiven Zins-Angebote, mit denen viele Banken derzeit werben, sind meist nur an Neukunden gerichtet. Hier kann die ING punkten. Ihr Tagesgeldzinssatz gilt nämlich für alle Personen, die erstmals einExtra-Konto* eröffnen, vorausgesetzt Sie haben in den letzten 6 Monaten kein Extra-Konto bei der ING geführt – Bestandskunden sind also nicht automatisch ausgeschlossen. Nach den ersten vier Monatenwird das Extra-Konto bei der ING mit einem variablen Zinssatz von0,75 % verzinst. Das gilt für Beträge ab 250.000 Euro sowie für jedes weitere Extra-Konto, das man eröffnet. Manche Anbieter wie dieComdirect*können da nicht mithalten: Nach Ablauf des Aktionszeitraums fallen die Zinsen auf0,75 %. **Zinsen: Diese Banken bieten dauerhaft gute Zinsen** Achten Sie jedoch neben den verlockenden Aktionszinsen auch auf Angebote mit verhältnismäßig hohen Basiszinsen, denn nach Ablauf des Aktionszeitraums gelten in der Regel andere Zinssätze. Stellantis Direktbank - bis zu 2,75 % Zinsen Trade Republic – 2,00 % für unbegrenzte Laufzeit Suresse Direkt Bank - dauerhafter Zinssatz von 1,95 % Renault Bank – dauerhaft 1,75 % Zinsen **ING Tagesgeld: Wann findet die Verzinsung statt?** Die ING berechnet die Zinsen beim Extra-Konto taggenau; die Auszahlung findet jährlich am 31. Dezember statt. Ab dem 1. Januar können Kunden die Zinsgutschrift dann auf ihrem Konto finden – wobei sie vorher bereits ihre aktuellen Zinsen jederzeit im Online-Banking einsehen können. Negativzinsen berechnet die Direktbank seit August 2022 nicht mehr. Durch die Verzinsung zum Jahresende kommt es bei der ING innerhalb des Jahres nicht zum Zinseszinseffekt – Anleger erhalten nur auf das eingelegte Guthaben Zinsen. Bei der Konkurrenz sieht das anders aus: Die DKB etwa zahlt die Tagesgeldzinsen vierteljährlich aus. Ähnlich ist es bei derComdirect. Andere Banken und Broker wieTrade Republic*schreiben die Zinsen monatlich gut, die niederländischebunq* sogar wöchentlich. **Tagesgeldvergleich: Die Angebote im Überblick** **** **ING Sparbrief: Ergänzend zum Tagesgeld, oder im Anschluss** Neben oder anschließend zu dem Extra-Konto bietet die ING auch eine Festgeld-Einmalanlage (Sparbrief) für das erste Jahr mit bis zu2,00 % Festzinsp. a. an. Kunden können sich für eine Laufzeit zwischen einem und fünf Jahren entscheiden, wobei ab dem zweiten Jahr das angelegte Geld nur zu 1,75 % verzinst wird. Voraussetzung ist, dass der Anlagebetrag zwischen 2.500 und 500.000 Euro liegt. Über dieStartseite der ING* können Interessierte mehr erfahren. **Konto-Angebote: Bei WELT-Lesern am beliebtesten** Unter der Vielzahl an Neukundenaktionen zum Tagesgeld haben sich folgende Anbieter als Favoriten unter den WELT-Lesern behauptet: Consorsbank - 2,80 % für 3 Monate Klarna - 2,74 % für 3 Jahre Trade Republic - 2,00 % für unbegrenzte Laufzeit Targobank - 2,00 % für 4 Monate **Einlagensicherung bei der ING: Wie wird mein Geld abgesichert?** Die deutsche Direktbank ING (ehemals ING-DiBa) mit Sitz in Frankfurt am Main gehört als vollwertige Tochtergesellschaft zur niederländischen ING Groep. Sie bietet diverse Finanzprodukte und Dienstleistungen wie etwaKreditkarten, Girokonten,Wertpapierdepots, Baufinanzierungen und Kredite. Als drittgrößte Bank in Deutschland ist die ING besonders auf die Einlagensicherung ihrer Kunden bedacht. Die von EU-Richtlinien vorgeschriebene Grundabsicherung von bis zu 100.000 Euro pro Person erfolgt bei der Bank durch die Entschädigungseinrichtung deutscher Banken GmbH (EdB). Überdies sichert die ING bis zu 5 Millionen Euro pro Kunde über den Einlagensicherungsfonds des Bundesverbandes deutscher Banken e.V. ab. Somit ergibt sich eine doppelte Einlagensicherung, auf die viele Anleger vertrauen. Laut der Verbraucherorganisation Stiftung Warentest ist es ratsam,Fest- und Tagesgeldkontenin Deutschland zu eröffnen, weil die Einlagensicherung durch einen Staat mit guter Bonität erfüllt werden kann. Bei ausländischen Banken ist dies – je nach Bonitätsbewertung des Staats – nicht zwingend gewährleistet. Bei den Ratingagenturen Standard & Poors, Moody’s, Fitch und DBRS schneiden Deutschland und die Niederlande regelmäßig sehr gut ab. *Dieser Text enthält Affiliate-Links. Das bedeutet: Sollten Sie über die mit einem Stern gekennzeichneten Links einen Kauf abschließen, erhält WELT eine kleine Provision. Die Berichterstattung beeinflusst das nicht. Unsere Standards der Transparenz und journalistischen Unabhängigkeit finden Sie unteraxelspringer.de/unabhaengigkeit. Anmerkung: Die Inhalte auf welt.de sind keine spezifischen Anlage-Empfehlungen und enthalten lediglich allgemeine Hinweise. Autoren, Herausgeber und die zitierten Quellen haften nicht für etwaige Verluste, die durch den Kauf oder Verkauf der in den Artikeln genannten Wertpapiere oder Finanzprodukte entstehen. Angebote Banken Tagesgeld Girokonto Produkte TV WELT News App WELTgo! WELT Community WELT Edition WELT Club Podcasts Newsletter Abonnement WELT Plus WELT Plus Premium Meine WELT B2B Zeitung ePaper Abo kündigen Services Kontakt WELT-photo Syndication Künstliche Intelligenz Verantwortung FAQ Impressum Datenschutz AGB Privacy-Manager Widerruf Tracking & Cookies Widerruf Nutzerkennung UTIQ verwalten Jugendschutz © PREMIUM-GRUPPE GmbH2025 EinAxel SpringerUnternehmen Die WELT als ePaper: Die vollständige Ausgabe steht Ihnen bereits am Vorabend zur Verfügung – so sind Sie immer hochaktuell informiert. Weitere Informationen https://epaper.welt.de"}