{"id": 1869, "name": "AMAC (Association of Mature American Citizens)", "domain": "amac.us", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://amac.us/newsline/national-security/arkansas-republicans-lead-the-charge-against-foreign-influence/", "title": "Arkansas Republicans Lead The Charge Against Foreign Influence", "content": "Login Newsline Benefits Join AMAC MoreStay ConnectedNewslinePodcastNewslettersGamesPollsBook ClubLifestyleSweepstakesServicesMember BenefitsMedicareSocial SecurityRetirement PlanningAMAC MagazineAMAC ActiveResourcesAMAC EventsAction Annual ReportFind Your RepresentativeGet InvolvedOur ActionsWeekly UpdateAbout UsMission, Vision, ValuesOur Stance on Key IssuesOur TeamFAQContact UsAMAC ActionAMAC FoundationAMAC StoreMy Profile Newsline Podcast Newsletters Games Polls Book Club Lifestyle Sweepstakes Member Benefits Medicare Social Security Retirement Planning AMAC Magazine AMAC Active AMAC Events Action Annual Report Find Your Representative Get Involved Our Actions Weekly Update Mission, Vision, Values Our Stance on Key Issues Our Team FAQ Contact Us AMAC Action AMAC Foundation AMAC Store My Profile Newsline Podcast Newsletters Games Polls Book Club Lifestyle Sweepstakes Member Benefits Medicare Social Security Retirement Planning AMAC Magazine AMAC Active AMAC Events Action Annual Report Find Your Representative Get Involved Our Actions Weekly Update Mission, Vision, Values Our Stance on Key Issues Our Team FAQ Contact Us AMAC Action AMAC Foundation AMAC Store My Profile **Newsline** Advocacy Economy Education Elections Member Benefits National Security Press Releases Society Act 134 Act 473 Act 999 America First Arkansas Republicans campaign finance China Confucius Institutes economic independence education policy foreign influence foreign land ownership political transparency U.S. sovereignty **Arkansas Republicans Lead the Charge Against Foreign Influence** Ensuring the safety and security of Americans is generally associated with foreign policy and counterterrorism efforts, but the reality is that U.S. leaders must be just as vigilant about foreign influence at home as they are abroad. From purchases of large farmlands near sensitive military sites to influencing academic institutions and commandeering political influence, there is clear reason to view this behavior as a very real threat. Now, some states are beginning to push back against this quiet takeover, and Arkansas Republicans are leading the charge for the rest of the country. Republican legislators are sending a clear message and setting a blueprint for others to follow in ensuring foreign entities have no foothold in Arkansas or any other state. One of the most powerful tools for long-term defense against foreign influence is in education. Arkansas Republicans took a bold step with Act 134, which mandates instruction in elementary schools on the resilience of the U.S. constitutional republic and the failures of communist and autocratic systems. Act 473 requires disclosure and approval of major foreign contracts, vetting of foreign researchers, and limits on cultural exchanges and travel in state universities. We have also banned Confucius Institutes and restricted sister-city ties with adversarial nations under Act 937. These legislative achievements mark more than a much-needed curriculum update and improvement in transparency; they relay a strong message to our adversaries. In teaching Americans about the dangers of authoritarian ideologies, Arkansas is equipping the next generation with the historical and civic understanding they need to recognize and resist foreign propaganda that undermines our freedoms and values. In a time when many classrooms actively shy away from discussing the destructive nature of regimes, Arkansas is standing firm in defense of truth. Foreign influence isn’t always public-facing. Often, it disguises itself in campaign contributions, deceptive ads, and ballot initiatives. Arkansas has taken decisive steps to close these loopholes and draw a line against such influence. Act 999 prohibits foreign entities from funding state and local ballot measures and strengthens disclosure requirements for campaign-related communications. This ensures that Arkansans, not adversarial powers, are the ones deciding their laws. In addition, Act 998 requires individuals and organizations acting on behalf of hostile foreign principals to register and disclose their political activities and financial contributions. Transparency is a critical weapon in the battle against covert interference, and these measures expose efforts to buy political influence from the shadows. Arkansas Republicans are working to cut economic dependencies that give hostile nations leverage over our institutions. Act 943 bans state agencies from purchasing promotional items manufactured in China, a clear signal that Arkansas is driving an America First agenda and dollars will not be used to subsidize adversarial economies. Act 937 subsequently requires public investment entities to divest from Chinese companies and submit annual reports verifying compliance. These laws safeguard state resources and create momentum for a broader movement toward economic independence from nations that do not share our values. The battle for America’s sovereignty is no longer solely fought overseas; it’s a fight unfolding in our classrooms, our elections, our universities, and our economy, and Arkansas is showing the nation how to take action. By enacting some of the strongest protections in the country against foreign influence, Arkansas Republicans have built a model of leadership grounded in oversight, transparency, and commitment to American values, and other states have taken note. Texas has passed laws banning Chinese citizens and entities from purchasing land near military installations; Florida has cracked down on the influence of Confucius Institutes and strengthened restrictions on foreign gifts to universities; and Oklahoma is investigating foreign land ownership tied to illicit activity. These efforts reflect a growing recognition that the threats we face are real and immediate. The federal government and the remaining states would do well to follow our lead. Howard Beaty Jr.is the majority leader of the Arkansas House. Blake Johnsonis the majority leader of the Arkansas Senate. Reprinted with Permission fromDC Journal– By Howard Beaty Jr. & Blake Johnson The opinions expressed by columnists are their own and do not necessarily represent the views of AMAC or AMAC Action. **Trending Articles** **Most Commented** **Related News** **Nation Pivoting Toward True Colorblind Justice** A Supreme Court ruling in Ames v. Ohio affirms equal legal protection for all, striking a blow to double standards... **Anti-ICE Protests Fueled in Part by CCP-Linked Communist...** A deep dive into the Communist Party for Socialism and Liberation’s role in violent anti-ICE protests, its ties to CCP-linked... **Why “Pride Month” 2025 Is Falling Flat** Major brands are scaling back Pride Month support amid backlash and declining public support for radical gender ideology, marking a... **LA Riots Underscore Recklessness of Democrat Crusade to...** Democrat leaders’ rhetoric and actions—like doxxing ICE agents—are fueling real-world violence against law enforcement, as seen in the recent LA... **Stay informed! Subscribe to our Daily Newsletter.** \"*\" indicates required fields Join Login AMAC Action AMAC Foundation AMAC Store Newsline Podcast Newsletters Games Polls Book Club Lifestyle Sweepstakes Medicare Social Security AMAC Active Retirement Planning About Our Stances on Key Issues Annual Report Find Your Representative Get Involved Our Actions Weekly Update Mission, Vision, & Values Our Team FAQ Contact Us Partner With Us Advertise With Us © 2025AMAC, Inc. / AMAC Senior Resources Network.All Rights Reserved. Terms of Use Privacy Policy The Association of Mature American Citizens (AMAC) is here to protect your interests, and to offer an alternative perspective on how to best solve the problems seniors face today. We need you. America needs you. **Subscribe to AMAC Daily News and Games** *By providing your email address and subscribing, you agree to allow AMAC to send you \"Join AMAC\" emails, if you are not already an AMAC Member. Login Newsline Member Benefits AdvocacyOur ActionsAboutAdvocacy IssuesGet InvolvedWeekly UpdateAnnual ReportFind Your Representative Our Actions About Advocacy Issues Get Involved Weekly Update Annual Report Find Your Representative Our Actions About Advocacy Issues Get Involved Weekly Update Annual Report Find Your Representative AMAC App Better for America Podcast Book Club AMAC Blog FAQ About UsOverviewOur TeamOur Stance on Key Issues Overview Our Team Our Stance on Key Issues Overview Our Team Our Stance on Key Issues Magazine Medicare Games Voice Your Opinion in AMAC Polls AMAC in the Media AMAC Action AMAC Foundation Social Security GuaranteePrime Directives BriefPrime Directives Details Prime Directives Brief Prime Directives Details Prime Directives Brief Prime Directives Details The AMAC Store Sweepstakes AMAC Active Contact Advertise with AMAC Terms & Conditions Privacy Policy"}