{"id": 2220, "name": "The Political Garbage Chute", "domain": "politicalgarbagechute.com", "bias": "satire", "credibility": "n/a", "reporting": "", "questionable": null, "url": "https://politicalgarbagechute.com/texas-woman-identifies-as-tesla-dealership/", "title": "Texas Woman Identifies As Tesla Dealership", "content": "Totally Bulls*it News Mostly Bulls*it Opinions YouTube TikTok Facebook Instagram Twitch LinkTree Totally Bulls*it News Mostly Bulls*it Opinions **Texas Woman Identifies as Tesla Dealership So Government Will Protect Her Rights** “…I just thought it might be cool if my government defendedmy rightsfor a change…” 37 year old Texas native Jeanette Willamette made headlines in the Lone Star State last week. Ms. Willamette agreed to speak to us about why she decided it was time to file official paperwork with the state, declaring herself a Tesla dealership. “Don’t get me wrong, as a woman, living in America I know my rights aren’t as important as a man’s. Living in Texas, that reality is infinitely more clear,” Ms. Willamette told us as we began our conversation. “But when our country’s attorney general, a woman by the way, said that she agreed with the president, and that violence against Tesla dealerships will be considered domestic terrorism, I thought maybe I should give it a go. I’ve been to a handful of Planned Parenthoods and seen violent, angry protesters there, so it dawned on me that I was only ever going to be protected if I was a rich, white man, or one of his car dealerships.” Willamette is a fourth grade teacher. Each month, she and her students do a lockdown drill to prepare for potential active shooters on campus. She said she finds it “odd” that school shootings aren’t considered domestic terrorism but spray painting a swastika on a Cybertruck would be. “Again, don’t take this as surprise or shock. I’m a woman in my thirties living in a country where at least 30% of the population thinks they should tell me when, why, and how to fuck. You get used to being bossed around by Jesus Nazis, I guess. I’m just saying that to me, if you’re gonna pretend to be pro-life, and that you want to protect your citizens from terrorism, why wouldn’t you treat every single school shooter as a domestic terror event?” Building up that backup account with the hits.#windmillcancer#trump#politicalsatire#fyp#politik#politics#backupaccount#liberal ♬ original sound – James Schlarmann Texas Attorney General Ken Paxton issued a statement condemning Ms. Willamette, and asking the FBI to arrest her on charges of “being an uppity, smart-mouthed broad.” “Here in Texas, we don’t take kindly to having our beliefs mocked and our authoritarian kookery called out at all, much less in such an intellectually astute manner,” Paxton declared in his statement. “Ms. Willamette should probably self-deport, or at the bare minimum self-report herself to one of our state’s beautiful new camps for concentrating populations of lesser-valued humans to work off her debt to society. I encourage and welcome the Glorious Trump Reich to arrest her now and teach her a lesson for being an uppity, smart-mouthed broad.” “You know, I just thought it might be cool if my government defendedmy rightsfor a change, that’s all,” Jeanette said as she ended our Zoom call. Check out our sketch comedy show: **More Cool Sh*t** **Why Did The Secretary of Defense Text Me Dick Pics and Nuclear Launch Codes?** **Trump Orders Every American to Buy Six Teslas** **I Can’t Afford Groceries, But I Bought a Cybertruck Because Libs Are Mean to Elon** 2025 2024 2023 2022 2021 2020 ©James SchlarmannAll Material is Satirical"}