{"id": 1189, "name": "ReWire News Group", "domain": "rewirenewsgroup.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://rewirenewsgroup.com/2025/06/06/our-trans-health-study-was-terminated-by-the-government-the-effects-of-abrupt-nih-grant-cuts-ripple-across-science-and-society/", "title": "Our Trans Health Study Was Terminated By The Government The Effects Of Abrupt Nih Grant Cuts Ripple Across Science And Society", "content": "**** Facebook Instagram Twitter YouTube Abortion Parenthood Power Sex Abortion Parenthood Power Sex Subscribe Boom! Lawyered Campus Dispatch Angry Black Lady Chronicles You Deserve Good Sex Explore our Series... Where Do We Go From Here? Whose Choice? Your One Stop for All Things Endometriosis Explore our Special Editions... About Rewire News Group Press Releases Contact Us **Our Trans Health Study Was Terminated by the Government. The Effects Will Ripple Across Science and Society.** On top of canceling the trans health study, losses include millions of dollars the NIH has already spent and the next generation of scientists whose work has been cut short. Given the Trump administration’s systematic attempts to medically and legallydisenfranchise trans people, and its abrupttermination of grants focused on LGBTQ+ health, we can’t say that the notice of termination we received regarding our federally funded research on transgender and nonbinary people’s health was unexpected. As researchers whostudy the experiencesof trans and nonbinary people, we have collectively dedicated nearly 50 years ofour scientific careersto developing ways toaddress the health disparities negatively affecting these communities. The National Institutes of Health hadplaced a call for projectson this topic, and we had successfully applied for their support for our four-year study on resilience in trans communities. However, our project on trans health became one of thehundreds of grants that have been terminatedonideological grounds. The termination notice stated that the grant no longer fit agency priorities and claimed that this work was not based on scientific research. These grant terminationsundermine decades of scienceon gender diversityby dismissing research findings and purging data. During Donald Trump’s current term, the NIH’sSexual and Gender Minority Research Officewasdismantled,references to LGBTQ+ people were removedfrom health-related websites, anddatasets were removed from public access. The effects of ending research on trans health ripple throughout the scientific community, the communities served by this work, and theU.S. economy. **Studying resilience** Research focused on the mental health of trans and nonbinary people hasgrown substantiallyin recent years. Over time, this work has expanded beyond understanding the hardships these communities face to also study their resilience and positive life experiences. Resilienceis often understood as an ability to bounce back from challenges. For trans and nonbinary people experiencing gender-based stigma and discrimination,resilience can take several forms. Thismight look likesimply continuing to survive in a transphobic climate, or it might take the form ofbeing a role modelfor other trans and nonbinary people. As a result of gender-based stigma and discrimination, trans and nonbinary people experience a range of health disparities, from elevated rates ofpsychological distressto heightened risk forchronic health conditions and poor physical health. In the face of these challenges andgrowing anti-trans legislationin the U.S., we believe that studying resilience in these communities can provide insights into how to offset theharms of these stresses. With the support of the NIH, we began our work in earnest in 2022. The project was built on many years of research from our teams preceding the grant. From the beginning, we collaborated with trans and nonbinary community members to ensure our research would be attuned to the needs of the community. At the time our grant was terminated, we were nearing completion of year three of our four-year project. We had collected data from over 600 trans and nonbinary participants across the U.S. and started to follow their progress over time. We had developed a new way tomeasure resilience among trans and nonbinary peopleand were about to publish a second measure specifically tailored topeople of color. The termination of our grant and others like it harms ourimmediate research team, the communities we worked with and the field more broadly. **Loss of scientific workforce** For many researchers in trans health, the losses from these cuts go beyond employment. Our project had served as a training opportunity for the students and early career professionals involved in the study, providing them with the research experience and mentorship necessary to advance their careers. But with the termination of our funding, two full-time researchers and at least three students will lose their positions. The three lead scientists have lost parts of their salaries and dedicated research time. These NIH cuts will likely result in the loss of much of thenext generation of trans researchersand the contributions they would have made to science and society. Our team and other labs in similar situations will be less likely to work with graduate students due to alack of available fundingto pay and support them. This changes the landscape for future scientists, as it means there will be fewer opportunities for individuals interested in these areas of research to enter graduate training programs. As universities struggle to address federal funding cuts, junior academics will be less likely to gain tenure, and faculty in grant-funded positions may lose their jobs. Universities may also become hesitant to hire people who work in these areas because their research has essentially been banned from federal funding options. **Loss of community trust** Trans and nonbinary people have often been studied underopportunistic and demeaning circumstances. This includes when researchers collect data for their own gains butreturn little to the communitiesthey work with, or when they do research that perpetuates theories that pathologize those communities. As a result, many are often reluctant to participate in research. To overcome this reluctance, we grounded our study on community input. We involved an advisory board composed of local trans and nonbinary community members who helped to inform how we conducted our study and measured our findings. Our work on resilience has been inspired by feedback we received from previous research participants who said that “[trans people] matter even when not in pain.” Abruptly terminating projects like these can break down trust between researchers and the populations they study. **Loss of scientific knowledge** Research that focuses on the strengths of trans and nonbinary communities is in its infancy. The termination of our grant has led to the loss of the insights our study would have provided on ways to improve health among trans and nonbinary people and future work that would have built off our findings. Resilience is a process that takes time to unfold, and we had not finished the longitudinal data collection in our study—nor will we have the protected time to publish and share other findings from this work. Meanwhile, the Department of Health and Human Services released a May 2025 report stating that there is not enough evidence to support gender-affirming care for young people,contradicting decades of scientific research.Scientists,researchers andmedical professional organizationshave widelycriticized thereport asmisrepresenting study findings, dismissing research showing benefits to gender-affirming care, and promoting misinformation rejected by major medical associations. Instead, the report recommends “exploratory therapy,” which experts havelikened todiscreditedconversion therapy. Despite claims that there isinsufficient researchon gender-affirming care andmore data is neededon the health of trans and nonbinary people, the government has chosen to divest from actual scientific research about trans and nonbinary people’s lives. **Loss of taxpayer dollars** The termination of our grant means we are no longer able to achieve the aims of the project, which depended on the collection and analysis of data over time. This wastes the three years of NIH funding already spent on the project. Scientists and experts who participated in the review of our NIH grant proposal rated our project more highly than 96% of the projects we competed against. Even so, the government made the unscientific choice to override these decisions and terminate our work. Millions of taxpayer dollarshave already been invested in these grants to improve the health of not only trans and nonbinary people, but alsoAmerican society as a whole. With the termination of these grants, few will get to see the benefits of this investment. This article is republished fromThe Conversationunder a Creative Commons license. Read theoriginal articlebyJae A. Puckett, Associate Professor of Psychology,Michigan State University,andPaz Galupo, Professor of Sexual Health and Education,Washington University in St. Louis. Disclosure statement: Jae A. Puckett and Paz Galupo have each received funding from the National Institutes of Health. **** Facebook Instagram Twitter YouTube Events Information Weekly Newsletter Fundraising Information Home About Us Contact Us Advertising © 2025 Rewire News Group. All rights reserved. **Search:**"}