{"id": 385, "name": "Alexandria Echo Press", "domain": "echopress.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.echopress.com/lifestyle/arts-and-entertainment/minnesota-sings-auditions-include-stops-in-st-cloud-bemidji-for-12th-annual-statewide-competition", "title": "Minnesota Sings Auditions Include Stops In St Cloud Bemidji For 12th Annual Statewide Competition", "content": "📣 ADVERTISE WITH US 🎲 FREE GAMES 🎧 PODCAST 🚓 BLOTTER 🗓️ CALENDAR SPECIAL PUBLICATIONS ☀️SUMMER FUN Advertise With UsDigital AdvertisingPrint AdvertisingPrinting ServicesTV AdvertisingVideo ServicesPlace a Public NoticeGet Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter Digital Advertising Print Advertising Printing Services TV Advertising Video Services Place a Public Notice Get Our Advertising Newsletter NewsLocalMinnesotaNationalWorldThe VaultAgweekWatch: FNN TV Local Minnesota National World The Vault Agweek Watch: FNN TV Local Minnesota National World The Vault Agweek Watch: FNN TV Weather SportsPrepPrep standingsCollegeProNorthland Outdoors Prep Prep standings College Pro Northland Outdoors Prep Prep standings College Pro Northland Outdoors Obituaries Health Business OpinionEditorialsColumnsLetters Editorials Columns Letters Editorials Columns Letters LifestyleArts / EntertainmentHome / GardenAstro BobComicsFree Games Arts / Entertainment Home / Garden Astro Bob Comics Free Games Arts / Entertainment Home / Garden Astro Bob Comics Free Games CommunityMilestonesCalendarContestsAnnouncements Milestones Calendar Contests Announcements Milestones Calendar Contests Announcements Podcasts ListingsClassifiedsPublic NoticesJobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices JobsHQ Local InterestOsakisMagazines and More Osakis Magazines and More Osakis Magazines and More AccountFCC NetworkProfileNewslettersHelpSubscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits FCC Network Profile Newsletters Help Subscriber Benefits Sponsored By ADVERTISEMENT ADVERTISEMENT **Minnesota Sings auditions include stops in St. Cloud, Bemidji for 12th annual statewide competition** **The 12th annual statewide competition for amateur vocalists will hold auditions in St. Cloud, Bloomington, Mankato and Bemidji. Reservations are required; there will be no walk-on auditions.** WILLMAR— The 12th annual Minnesota Sings statewide competition for amateur vocalists will conduct auditions in St. Cloud, Bloomington, Mankato and Bemidji beginning late in June. There will be two divisions for the competition, which offers up to $20,000 in cash prizes, in addition to music recording equipment and a private recording session at Pachyderm Studios in Cannon Falls. Singers will be competing in two age brackets — those ages 13 to 20, and those 21 and older. ADVERTISEMENT Reservations are required; there will be no walk-on auditions. Singers who previously competed in Minnesota Sings and who also finished in the top four are not required to attend an audition, but must email info@minnesotasings.com to complete their registration. Previous first-place winners are not eligible to compete. Red Willow Arts Coalition to serve as the 2025 Vikingland Band Festival grand marshal3d ago 4 students, 1 teacher from Kalon Prep form a band called the LadyslippersJun 3 Minnesota to host Farm Aid in SeptemberJun 2 Auditions will take place at noon on June 29 at Bridge of Harmony, St. Cloud; July 27 at Groth Music, Bloomington; Aug. 17 at Scheitel's Music, Mankato; and Sept. 21 at Headwaters Music and Arts, Bemidji. Vocalists must bring a backing track loaded onto their phones; harmonies are allowed on the track. Each audition song must be under five minutes in duration, memorized and contain family-friendly lyrics. The audition fee is $10 per entry. Each audition will be digitally recorded and will be judged by a panel. The entry fee to compete in the state competition on Oct. 11-12 at the Historic Paramount Theatre in Austin is $40. To reserve an audition slot or to find more information, visitwww.minnesotasings.com. ADVERTISEMENT ADVERTISEMENT AccountManage My AccountPrivacy PolicyTerms and ConditionsPolicies and StandardsSubscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits Manage My Account Privacy Policy Terms and Conditions Policies and Standards Subscriber Benefits NewsSubscription OptionsEmail NewslettersE-PaperOur News Network Subscription Options Email Newsletters E-Paper Our News Network Subscription Options Email Newsletters E-Paper Our News Network ContactGet HelpContact UsAdvertise With UsGet Our Advertising NewsletterCareers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers Get Help Contact Us Advertise With Us Get Our Advertising Newsletter Careers MoreJobsHQClassifiedsPublic Notices JobsHQ Classifieds Public Notices JobsHQ Classifieds Public Notices Twitter Instagram Facebook"}