{"id": 1907, "name": "CAMERA", "domain": "camera.org", "bias": "right", "credibility": "medium-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://www.camera.org/article/the-few-versus-the-1000s-reuters-underreports-israeli-figure-for-unrwa-staffers-with-terror-group-membership/", "title": "The Few Versus The 1000s Reuters Underreports Israeli Figure For Unrwa Staffers With Terror Group Membership", "content": "Donate K-12 Education CampusIn Focus, a Campus BlogCAMERA on Campus“Apartheid Week Exposed” In Focus, a Campus Blog CAMERA on Campus “Apartheid Week Exposed” In Focus, a Campus Blog CAMERA on Campus “Apartheid Week Exposed” BritishCAMERA UK CAMERA UK CAMERA UK HebrewPresspectiva Presspectiva Presspectiva SpanishCAMERA Espanol CAMERA Espanol CAMERA Espanol Arabic AboutCAMERAMissionHistoryJoin and ContributeCAMERA AuthorsContact UsEmployment Mission History Join and Contribute CAMERA Authors Contact Us Employment Mission History Join and Contribute CAMERA Authors Contact Us Employment NewsSourcesOutletJournalistOrganizations Outlet Journalist Organizations Outlet Journalist Organizations Middle EastIssuesTopicsPeople Topics People Topics People MediaCorrectionsAllOutletSubject All Outlet Subject All Outlet Subject CAMERA Videosand PublicationsEducational AdsMonographsVideos Educational Ads Monographs Videos Educational Ads Monographs Videos Book and FilmReviewsBook ReviewsFilm ReviewsFilm Recommendations Book Reviews Film Reviews Film Recommendations Book Reviews Film Reviews Film Recommendations CAMERAin the NewsCAMERA Op-Eds & LettersInterviewsPress Releases CAMERA Op-Eds & Letters Interviews Press Releases CAMERA Op-Eds & Letters Interviews Press Releases MediaActivismJoin the Email TeamLetter WritingCodes of Ethics Join the Email Team Letter Writing Codes of Ethics Join the Email Team Letter Writing Codes of Ethics **The Few Versus The 1000s: Reuters Underreports Israeli Figure For UNRWA Staffers With Terror Group Membership** 3 2 0 5SHARES Few. Dozens. Hundreds. Thousands. Each of these words denotes vastly different quantities. They all provide important information in war coverage where numbers play an important role. For instance, an Oct. 30 Reuters headline states: “Israeli strike kills dozens in north Gaza residential block, US calls incident ‘horrifying.’“ The first paragraphs of Nidal Al-Mughrabi’s accompanying story provide more details about the dozens of reported fatalities: At least 93 Palestinians were killed or missing and dozens wounded in an Israeli strike on a residential building in the northern Gaza town of Beit Lahiya on Tuesday, the Gaza health ministry said, and the U.S. called the incident “horrifying”. Medics said at least 20 children were among the dead. “A number of victims are still under the rubble and on the roads, and ambulance and civil defence crews cannot reach them,” the territory’s health ministry said in a statement. Later on Tuesday, Ismail Al-Thawabta, director of the Gaza government media office, put the number of fatalities at 93. That’s a great deal of emphasis on numbers. Clearly, numbers are newsworthy, and their accurate depiction is essential for reliable reporting. Thus, with regard to the 93 Palestinians reported killed or missing, Reuters’ headline rightly refers to “dozens,” not “a few.” Yet, when it comes to thethousandsof UNRWA staffers whom Israel has accused of holding membership in terror organizations, withhundredsof them said to be serving as military operatives, Reuters’ recounting of numbers suddenly lacks the precision which characterized the reporting of the reported Palestinian fatalities. Not only does Al-Mughrabi fail to report the actual number, but his stand in for the figure is downright false. Thus, Al-Mughrabi grossly underreports the number of UNRWA employees that Israel has said belong to terror organizations, erring: Israeli officials citedthe involvement of a handful of the United Nations Relief and Works Agency for Palestine Refugees’ thousands of staffers in the Oct. 7, 2023 attack anda few staffers’ membership in Hamas and other armed groups.[Emphasis added.] “Few”meansa small number. And yet Israel has accusedmore than 2000UNRWA staffers of belonging to terror organizations. “Few” is not a fair stand in for more than 90 reported fatalities, and Reuters rightly cited “dozens” in that case. All the more so, “few” is a false representation of more than 450 reported UNRWA staffers who moonlight as military operatives. With respect to more than 2000, which is how many UNRWA staffers Israel has accused of possessing membership in Hamas or other terror organizations (either as military operatives or otherwise), “few” is a farce. As Reuters itself reported in March, Israel cited more than 450 UNRWA employees moonlighting for Hamasas military operatives(“Israel says over 450 UN aid agency workers in Gaza are ‘military operatives“). Reuters reported at the time: Israel’s military said on Monday that the U.N. aid agency UNRWA in Gaza employed over 450 “military operatives” from Hamas and other armed groups, and that Israel has shared this intelligence with the United Nations. . . . “Over 450 UNRWA employees are military operatives in terror groups in Gaza. Over 450. This is no mere coincidence. This is systematic. There is no claiming ‘We did not know’,” military spokesperson Rear Admiral Daniel Hagari told reporters in a briefing. “We sent the information that I am sharing now, as well as further intelligence, to our international partners, including the U.N.,” he said. #Breaking: IDF Spokesperson releases a full statement on UNRWA: “Over 450@UNRWAemployees are military operatives in terror groups in Gaza… This is no mere coincidence, this is systematic. There is no claiming: ‘we didn’t know.'”pic.twitter.com/hJFHZA86ps — Open Source Intel (@Osint613)March 5, 2024 Moreover, Israel’s Foreign Ministry has cited more than 2,315 UNRWA employees with membership in Hamas or Islamic Jihad — meaning both “military operatives” and members with non-combat positions (administrative, finance, propaganda, social welfare, education, etc).Voice of Americaquoted Adi Farjon, deputy permanent representative of Israel to the United Nations in Geneva: “For example, it is a fact, that 19 members of the organization took an active part in the October 7 terrorist attack. It is also a fact that more than 2,135 UNRWA workers in Gaza are members of either Hamas or Palestinian Islamic Jihad,” she said. Last week, CAMERA contacted Reuters reminding editors of its own coverage of Israel’s information concerning the several hundred UNRWA employees who double as terror operatives, and also informing the news agency about the Foreign Ministry’s information regarding 2,135 UNRWA staffers who belong to terror groups. Yet, as of this writing, Reuters has failed to rectify the “few” falsehood. Reducing thousands to a few gives readers a “few” reasons to question Reuters’stated commitmentto trust, integrity and freedom of bias. TheArabic versionof the same Reuters article also grossly underreports the number of UNRWA employees Israel has accused of belonging to terror groups. It says that “a small number of staffers joined Hamas and other armed groups.” Share on: Facebook Twitter Pinterest Comments are closed. **CAMERA Author** Tamar SternthalTamar Sternthal is director of CAMERA’s Israel Office. She monitors both U.S. publications and English-language Israeli publications, and heads up CAMERA’s “Haaretz, Lost in Translation” project. Her columns have appeared in numerous American and Israeli publications, including the Times of Israel, Jerusalem Post, Ynet, Algemeiner, Philadelphia Daily News, St. Petersburg Times, and the Jewish Journal of Greater Los Angeles. Sternthal is interviewed on radio about the media's coverage of the Arab-Israeli conflict and regularly participates in panels about the media, hosted by universities and think tanks in Israel.Twitter handle:http://twitter.com/TamarSternthal **Outlets** Reuters **Topics** Hamas Terrorism, Terrorists and Terrorist Groups United Nations on Israel UNRWA **Unknown Feed** **CAMERA Departments** **It Didn’t Begin on October 7** **CAMERA Education Institute** **UK Media Watch** **ReVista** **CAMERA on Campus** **The Six-Day War** **CAMERA's Partnership of Christians and Jews** **CAMERA Arabic** **Presspectiva** **BBC Watch** **\"Israel Apartheid Week\"** **Eyes on Israel Curriculum** **About CAMERA** Mission History Contact Us **Recent Posts** Unmoored Coverage: AP Conceals U.N. Ruling on Legality of Israeli Naval Blockade Spain’s RTVE Delivers Systematic Misinformation and Disguised Activism CAMERA Discusses Anti-Israel Media Bias with the Washington Times USA Today’s Tears for Terrorist’s Family CAMERA Op-Ed: Excavating the Truth about Israel When the media minimizes antisemitism, it puts everyone at risk"}