{"id": 1311, "name": "Süddeutsche Zeitung", "domain": "sueddeutsche.de", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.sueddeutsche.de/panorama/kreis-recklinghausen-autofahrer-uebersieht-motorrad-22-jaehriger-schwer-verletzt-dpa.urn-newsml-dpa-com-20090101-250611-930-657903", "title": null, "content": "SZ.de Zeitung Magazin Jetzt Dossier Meine SZ SZ Plus Bundesregierung USA Ukraine Politik Wirtschaft Meinung Panorama Sport München Kultur Medien Bayern Reportage Gesellschaft Stil Wissen Gesundheit Reise Auto mehr Home Panorama Unglück und Unfall Kreis Recklinghausen - Autofahrer übersieht Motorrad: 22-Jähriger schwer verletzt **Kreis Recklinghausen - Autofahrer übersieht Motorrad: 22-Jähriger schwer verletzt** **Kreis Recklinghausen - Autofahrer übersieht Motorrad: 22-Jähriger schwer verletzt** **Kreis RecklinghausenAutofahrer übersieht Motorrad: 22-Jähriger schwer verletzt** Folgenschwerer Fehler: Ein Autofahrer verlässt einen Parkplatz und sieht dabei nicht, dass sich ein Motorrad nähert. Für den Biker endet der Abend im Rettungshubschrauber. Direkt aus dem dpa-Newskanal:Dieser Text wurde automatisch von der Deutschen Presse-Agentur (dpa) übernommen und von der SZ-Redaktion nicht bearbeitet. Artikel teilenTeilen FeebackFeedback Artikel druckenDrucken Haltern am See (dpa/lnw) - Ein Motorradfahrer ist bei einem Unfall im Kreis Recklinghausen schwer verletzt worden. Ein Autofahrer habe die Maschine übersehen, als er in Haltern am See von einem Parkplatz fuhr, sodass beide Fahrzeuge zusammenstießen, sagte eine Polizeisprecherin. Ob der Mann im Auto auch verletzt wurde, blieb zunächst unklar. Der 22-jährige Motorradfahrer wurde per Hubschrauber ins Krankenhaus gebracht. © dpa-infocom, dpa:250611-930-657903/1 Artikel teilenTeilen FeebackFeedback Artikel druckenDrucken Lesen Sie mehr zum Thema Unglück und Unfall Verkehr Nordrhein-Westfalen Deutschland **SZ Stellenmarkt:Entdecken Sie attraktive Jobs** **SZ Stellenmarkt:Entdecken Sie attraktive Jobs** In anspruchsvollen Berufsfeldern im Stellenmarkt der SZ. Medizin, Gesundheit & Soziales Tech. Entwicklung & Konstruktion Consulting & Beratung Marketing, PR & Werbung Fahrzeugbau & Zulieferer IT/TK Softwareentwicklung Tech. Management & Projektplanung Vertrieb, Verkauf & Handel Forschung & Entwicklung Sie möchten die digitalen Produkte der SZ mit uns weiterentwickeln? Bewerben Sie sich jetzt!Jobs bei der SZ Digitale Medien Gutscheine: Gutscheine & AngeboteDie besten Rabatte im Überblick! eBayGutscheine für jede Kategorie OTTOGutscheincodes für Rabatt auf Top Marken Shop ApothekeGutscheine für deine Online-Apotheke LIEFERANDOLecker essen mit Lieferando Gutscheine AmazonMit Gutschein beim Allrounder sparen DAZNStreaming-Angebote mit Rabatt ParshipGutscheine für das Liebesglück mömaxRabatt auf trendige Möbel nutzen FARFETCHDesignermode mit Rabatt shoppen SixtGünstige Mietwagen mit Gutscheincodes DouglasRabatt auf Parfüm, Pflege & Make Up C&AGutscheine für modische Deals Uber EatsGutscheincodes für leckere Gerichte reBuyExtra Rabatt auf Elektronik B-Ware SaturnGutscheine für innovative Technik ZooplusRabatt auf alles für Ihr Tier Black FridayRabatte am Höhepunkt der Black Week SalesAttraktive Rabatte & Sales Aktionen nutzen! SonderaktionenDas ganze Jahr mit Aktionen sparen! Mediadaten Newsletter Eilmeldungen RSS Apps Jobs AGB Datenschutz Datenschutz-Einstellungen Abo kündigen Vertragsbedingungen Datenschutz Cookie-Policy Vertrag mit Werbung kündigen Widerruf nach Fernabsatzgesetz Widerspruch Utiq verwalten Kontakt und Impressum"}