{"id": 1641, "name": "Xtra Magazine", "domain": "xtramagazine.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://xtramagazine.com/power/politics/in-the-face-of-uncertainty-u-s-queer-creatives-are-building-alternatives-274145", "title": "In The Face Of Uncertainty U S Queer Creatives Are Building Alternatives 274145", "content": "**Need A Suggestion? We got You...** Addiction Arts Asexuality Bisexuality Blood Ban Coming Out Conversion therapy Cruising Disability Discrimination Education Faith & Spirituality Fetish & Kink Gender identity History HIV/AIDS Human Rights Indigenous Marriage Equality Parenting Policing Pride Race issues Sex education Social justice Trans Two-Spirit Youth PowerActivismIdentityPoliticsDispatchesProtest and Pleasure Series Activism Identity Politics Dispatches Protest and Pleasure Series Activism Identity Politics Dispatches Protest and Pleasure Series CultureDrag RaceBooksMusicMonthly Tune-UpPlaylist QTV & FilmQueer Culture CatchupQueer View Mirror Drag Race Books Music Monthly Tune-Up Playlist Q TV & Film Queer Culture Catchup Queer View Mirror Drag Race Books Music Monthly Tune-Up Playlist Q TV & Film Queer Culture Catchup Queer View Mirror Love & SexDatingRelationshipsAsk KaiLove Like Mine Essays Dating Relationships Ask Kai Love Like Mine Essays Dating Relationships Ask Kai Love Like Mine Essays HealthSexual HealthMental HealthTrans HealthReproductive HealthAsk an Expert Sexual Health Mental Health Trans Health Reproductive Health Ask an Expert Sexual Health Mental Health Trans Health Reproductive Health Ask an Expert VideoAfter the SashayAsk Kai: QuickiesInspiredLucky StarsMy Queer KitchenSpeed DateQueer Artists in a Pandemic After the Sashay Ask Kai: Quickies Inspired Lucky Stars My Queer Kitchen Speed Date Queer Artists in a Pandemic After the Sashay Ask Kai: Quickies Inspired Lucky Stars My Queer Kitchen Speed Date Queer Artists in a Pandemic Xtrais an online magazine and community platform covering LGBTQ2S+ culture, politics and health. We aim to break boundaries, think outside of binaries and build bridges within our communities and beyond. Get free Xtra newsletters Xtra is being blocked on Facebook and Instagram for Canadians as part of Meta’s response to Bill C18. Stay connected, and tell a friend. Our principles Inside Xtra The Latest Podcasts **In the face of uncertainty, U.S. queer creatives are building alternatives** Federal cuts are forcing LGBTQ2S+ artists and organizations to scramble for survival 2024 Criminal Queerness Festival at PAC NYC.Credit: Marion Aguas The email arrived late Friday night on May 2. Stephen Motika, director and publisher ofNightboat Books, received notice that his organization’s $30,000 National Endowment for the Arts (NEA) grant had been terminated. The non-profit independent press, which publishes queer and experimental literature, has received NEA grants for more than a decade, which have enabled them to publish works likeWe Both Laughed in Pleasure: The Selected Diaries of Lou SullivanandThe Fifth Woundby Aurora Mattia. “The NEA is updating its grantmaking policy priorities to focus funding on projects that reflect the nation’s rich artistic heritage and creativity as prioritized by the President,” the email stated. “Consequently, we are terminating awards that fall outside these new priorities.” Nightboat was one of hundreds of cultural organizations across the United States to receive grant termination notices that weekend. “I think the big wake-up now is, do not think these things are small and insignificant—take them very seriously,” Motika says. “We have to get together and hold our ground, because this is a really terrible precedent.” In February, the NEA announced changes to guidelines for 2026 grants.Organizations cannot be “promoting” principles of diversity, equity and inclusion or what the administration calls “gender ideology”and grant applicants must agree to follow executive orders from the administration. ForNational Queer Theater, a LGBTQ2S+ theatre collective, these new restrictions pose what founding artistic director Adam Odsess-Rubin calls “a very existential threat.” In March, the New York-based organization joined three other arts groupsin filing a lawsuitto challenge the NEA’s ban on funding projects related to “gender ideology.” Get free Xtra newsletters Xtra is being blocked on Facebook and Instagram for Canadians as part of Meta’s response to Bill C18. Stay connected, and tell a friend. National Queer Theater’s $20,000 NEA grant for their annual Criminal Queerness Festival, which showcases the work of international playwrights from countries where queerness is criminalized, was terminated. The grant represented 20 percent of the festival’s budget and covered artist payments, costumes and set materials for shows by creators from places like Cuba, Indonesia and Uganda. 2024 Criminal Queerness Festival at PAC NYC.Credit: Marion Aguas The impact of the administration’s rollback of DEI extends beyond federal cuts. Odsess-Rubin explains that New York City Pride has reduced funding to partner organizations ascorporate sponsors pull back from Pride eventsand LGBTQ2S+ organizations, since some companies are “afraid of being targeted by the administration over DEI. “The arts are central to a thriving democracy and America is known for its arts and culture. We’re a beacon, especially for queer artists from all over the world,” Odsess-Rubin says. “And now we’re losing that position.” Elizabeth Larison, director of the National Coalition Against Censorship’s Arts & Culture Advocacy Program, says the effects might go beyond immediate funding concerns and into the territory of self-censorship. “I’m seeing a lot of fear and concern among artists and internally among arts organizations,” she says. “When there’s a lot on the line in terms of institutional viability, it can be a lot scarier for institutions to feel like they can speak up.” The broader impact, Larison warns, is that “it just pushes a lot of art into the shadows. It doesn’t mean that art will stop; it’s just going to become much less visible.” Beyond the direct effects of funding cuts, some institutions are already making pre-emptive changes without direct government pressure. Andil Gosine, an artist and professor at York University in Toronto, discovered his multimedia exhibition,Nature’s Wild, was cancelled by the Art Museum of the Americas in Washington, D.C., in February. The show, which explores connections between ecology, sexuality and colonial law in the Caribbean through works by a dozen artists, had been planned for three and a half years with funding entirely from Canadian sources. “Calling Card”Credit: Andil Gosine The cancellation came one day after the Trump administration issued an executive order reviewing groups like the Organization of American States, which oversees the museum, to determine if they are “contrary to the interests of the United States.” No reasons were given for the cancellation. The show was not described as queer in any materials, but Gosine suspects his identity as a queer artist may have influenced the decision. A photograph of him as a child in sparkly shoes was used as the main visual to advertise the exhibition on the museum’s facade, and, according to him, the show had been informally referred to within museum circles as “the queer Canadian show.” “I am guessing that probably played a part,” Gosine says. “Magna Carta”Credit: Andil Gosine The effects of the new policies also vary by location. Odsess-Rubin says he has “definitely seen a lot of self-censorship in more conservative parts of the U.S.” “I think [if] you;re a queer artist or run a theatre in Iowa or Florida, I think these conversations are very top of mind,” he adds, emphasizing that some organizations in more conservative areas are hiring security for events or cancelling programming altogether due to safety concerns. In contrast, he says, organizations in more progressive urban areas like New York tend to have local government support even without federal funding. Motika believes the cuts go beyond arts funding. “I think it opens up a new line of inquiry that is very time-consuming,” he says about navigating political threats. “I really do think we need to be really strong and not give up any ground, even if it could mean harassment and legal repercussions.” National Queer Theater launched aGoFundMe campaignafter losing their NEA grant, and supporters have so far raised over 50 percent of the lost funding. The organization started rehearsals for their festival with 40 artists already hired. Artists affected by the cuts include Jedidiah Mugarura, a Ugandan playwright based in Toronto whose playTomorrow Never Cameexplores themes of power and queerness in post-liberation Uganda. Set in 1987, one year after Uganda’s current government came to power, the play examines broken promises of freedom. Despite the funding cuts and political climate, Mugarura says artists must maintain focus on their essential work. “If we constantly fixate on the tragedy, we might lose focus on what’s on the ground, on what you must attend to,” they say. The resilience, Mugarura notes, comes from community support: “No matter what is happening with the NEA and the U.S., there’s a lot of amazing human beings who are saying, ‘All that negativity, we’re going to move past it and still create.’” Odsess-Rubin says the group is preparing for longer-term impacts too. “We’re also not expecting any NEA funding for the next four years,” he says. “So as much as we need to fill an immediate gap, we’re going to need to think strategically and in coalition with other arts organizations about how we gain support for the future.” “Artists tend to be on the front lines of responding to crises, to changing political shifts. Some of the best art comes out of that.” For Nightboat Books, the $30,000 represented just under five percent of their budget. Motika says their publishing schedule is staying in place for now, though they may need to make cuts in other areas. Several private foundations have launched emergency funding programs to offset federal cuts, including theMellon Foundation, theHelen Frankenthaler Foundation and the Andy Warhol Foundation for the Visual Arts. Despite the challenges, artists and organizations are finding ways to continue their work. Gosine says he doesn’t expect the political climate to reduce artistic creation overall. “I don’t actually feel like it will mean less art,” he says. “It might mean a different kind of art in spaces, but artists tend to be on the front lines of responding to crises, to changing political shifts. Some of the best art comes out of that.” Nightboat Books is preparing what Motika calls a “stacked” fall publishing lineup. Some of Gosine’s work from the cancelled exhibition will appear in smaller gallery shows in Toronto and Montreal, and National Queer Theater will continue on with the festival. “We started rehearsals last night,” Odsess-Rubin says. “Artists will continue to create, even outside of state-sponsored institutions, and the government can’t stop people from the act of creation.” Simon Feisthauer Fournet (he/him) is a French freelance journalist based in New York City. His work focuses on healthcare, housing and social justice issues. He speaks English and French. **Corrections or Feedback?** **Keep Reading** **The U.S. government is coming for poppers—again** **Thousands of LGBTQ2S+ Americans are considering moving to Canada** **Where does the new pope stand on queer and trans issues?** **Get ready for conservative civil war** About usOur principlesInside XtraEditorial StandardsPrivacy PolicyTerms of Use Our principles Inside Xtra Editorial Standards Privacy Policy Terms of Use Our principles Inside Xtra Editorial Standards Privacy Policy Terms of Use Contact UsMeet the TeamHow to pitch XtraAdvertiseSponsorship Meet the Team How to pitch Xtra Advertise Sponsorship Meet the Team How to pitch Xtra Advertise Sponsorship ConnectXtra’s newslettersWhere to find XtraKen Popert Media FellowshipGet Queer podcast Xtra’s newsletters Where to find Xtra Ken Popert Media Fellowship Get Queer podcast Xtra’s newsletters Where to find Xtra Ken Popert Media Fellowship Get Queer podcast Get free Xtra newsletters Xtra is being blocked on Facebook and Instagram for Canadians as part of Meta’s response to Bill C18. Stay connected, and tell a friend. **Connect with the writer** Communication not private: Your email will be forwarded to the writer by an Xtra editor."}