{"id": 1739, "name": "I Heart Intelligence", "domain": "iheartintelligence.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "mixed", "questionable": null, "url": "https://iheartintelligence.com/james-brolin-loves-his-wife-barbra-streisand-so-much-that-he-cant-wait-to-see-her-again-in-the-morning-even-after-2-decades-of-marriage/", "title": "James Brolin Loves His Wife Barbra Streisand So Much That He Cant Wait To See Her Again In The Morning Even After 2 Decades Of Marriage", "content": "Likes Followers Welcome, Login to your account. Recover your password. A password will be e-mailed to you. Thursday, June 12, 2025 I Heart Intelligence.com - HOME NEWS Relationships Science ConsciousnessSelf-development Self-development Self-development SOCIETY Health SHOP About usAdvertise Advertise Advertise Home Relationships James Brolin loves his wife, Barbra Streisand so much that he “can’t wait to see her again in the morning” even after 2 decades of marriage **James Brolin loves his wife, Barbra Streisand so much that he “can’t wait to see her again in the morning” even after 2 decades of marriage** **James Brolin and Barbra Streisand's love story is a heartwarming reminder that true love can be found at any age if one is open to it** True love is not just a fairytale reserved for movies and television; it can be a real, tangible part of life for those who are open to it.Hollywood actors James Brolin and Barbra Streisand are a testament to this fact, with their strong chemistry and enduring romantic relationship. Before finding each other, both James and Barbra had been married and divorced. James was previously married to actresses Jane Cameron Agee and Jan Smithers, with whom he had two sons and a daughter, respectively. Barbra was married to actor Elliot Gold and had a son, Jason, with him. Despite these past relationships, both James and Barbra had given up on love and decided to embrace their single lives. Barbra even admitted to People that she had come to enjoy her solitude. But fate had other plans.In 1996, James and Barbra met on a blind date and immediately hit it off.James was smitten with Barbra from the start, and it took her a few months to realize her own true love for him. Two years later, in 1998, they got married at Barbra’s Malibu estate in a ceremony attended by several celebrities, including Tom Hanks, John Travolta, and Sydney Pollack. On their wedding day, James gave an emotional speech declaring his love for Barbra, saying,“I can’t tell you how lucky I am that this would happen to me so late in life. Every night is a new adventure. Sleeping is a waste of time. I can’t wait to see her again in the morning.” Embed from Getty Images The couple has now been married for over 24 years and their love has only grown stronger with time.They show us thatonly your soumate can teach you the meaning of true love. James gushes about coming home to Barbra and the special surprises and plans she has waiting for him, and she in turn is always happy to see him. They make an effort to spend their evenings together, cherishing every moment they have. James credits Barbra for making their relationship even more romantic than ever, saying, “I’m always welcome when I get home… When I get there, there’s always something kind of great waiting for me, some plan, and I try to reciprocate.” True love means fighting through life as a team, not giving up on each other any time things get tough. But their love is not the only factor that keeps their relationship strong. The couple also has secrets to maintaining their bond, which they have shared with the public. One key aspect is their ability to give each other space and independence.Barbra values her alone time to work on her music and other projects, while James stays busy with his own endeavors. They also prioritize communication, openly discussing any issues that may arise and making an effort to understand each other’s perspectives. Overall,James Brolin and Barbra Streisand’s love story is a heartwarming reminder that true love can be found at any age, as long as you are open to it. Despite the challenges they faced in past relationships, they were able to find happiness and love with each other, and their bond has only grown stronger over the years. Their secrets to a successful relationship, including independence, communication, and appreciation, are valuable lessons for all couples. **Follow Us@iheartintelligence** FacebookJoin us on Facebook InstagramJoin us on Instagram"}