{"id": 2185, "name": "WMAL - 105.9 FM - WMAL", "domain": "wmal.com", "bias": "right", "credibility": "medium-credibility", "reporting": "mixed", "questionable": null, "url": "https://www.wmal.com/2025/06/11/gop-america-will-be-better-for-passing-trumps-big-beautiful-bill/", "title": "Gop America Will Be Better For Passing Trumps Big Beautiful Bill", "content": "ShowsO’Connor & Company | 5am-9amMilitary Medicine MinuteThe Chris Plante Show | 9am-12pmThe Vince Show | 12pm-3pmThe Derek Hunter Show | 3pm-6pmMark Levin | 6pm-9pmAmerica at Night with Rich Valdés | 9pm-11pmJohn Batchelor | 11pm-1amRed Eye Radio | 1am-5amDMV Spotlight with Barbara BrittOn-Air ScheduleFeaturesMilitary Medicine MinuteCal Thomas Commentary O’Connor & Company | 5am-9amMilitary Medicine Minute Military Medicine Minute The Chris Plante Show | 9am-12pm The Vince Show | 12pm-3pm The Derek Hunter Show | 3pm-6pm Mark Levin | 6pm-9pm America at Night with Rich Valdés | 9pm-11pm John Batchelor | 11pm-1am Red Eye Radio | 1am-5am DMV Spotlight with Barbara Britt On-Air Schedule FeaturesMilitary Medicine MinuteCal Thomas Commentary Military Medicine Minute Cal Thomas Commentary O’Connor & Company | 5am-9amMilitary Medicine Minute Military Medicine Minute Military Medicine Minute The Chris Plante Show | 9am-12pm The Vince Show | 12pm-3pm The Derek Hunter Show | 3pm-6pm Mark Levin | 6pm-9pm America at Night with Rich Valdés | 9pm-11pm John Batchelor | 11pm-1am Red Eye Radio | 1am-5am DMV Spotlight with Barbara Britt On-Air Schedule FeaturesMilitary Medicine MinuteCal Thomas Commentary Military Medicine Minute Cal Thomas Commentary Military Medicine Minute Cal Thomas Commentary NewsWMAL News NowWMAL Local NewsWMAL TrafficWMAL WeatherSchool ClosingsNewsmax – NewsfrontPoliticsBusinessHealth WMAL News Now WMAL Local News WMAL Traffic WMAL Weather School Closings Newsmax – Newsfront Politics Business Health WMAL News Now WMAL Local News WMAL Traffic WMAL Weather School Closings Newsmax – Newsfront Politics Business Health Podcasts EventsWMAL Photo Galleries WMAL Photo Galleries WMAL Photo Galleries StationStoreContestsContact InformationSign Up For Our NewslettersWMAL HistoryAdvertisingEmployment OpportunitiesEEO Public File Report Store Contests Contact Information Sign Up For Our Newsletters WMAL History Advertising Employment Opportunities EEO Public File Report Store Contests Contact Information Sign Up For Our Newsletters WMAL History Advertising Employment Opportunities EEO Public File Report Advertise With UsContact Us Contact Us Contact Us **OP-ED: GOP & America Will Benefit From Trump’s Big Beautiful Bill** Ned Ryun | June 11, 2025 (RealClearWire) — The debate over the Big, Beautiful Bill went next-level last week when Elon Musk sent out a series of rage posts on X targeting President Trump that were more personal than substantive. But for all the wailing and gnashing of teeth about the bill from the likes of Elon, Rand Paul, Thomas Massie – even Andy Biggs, who felt the need to commiserate with Rocket Boy about voting for it – there really is no debate. Senate Republicans get to pass this bill. That’s right, and for the pleasure of getting to pass it, they can also feel a certain amount of pride in codifying Trump’s campaign promises, a concept which is in short supply these days. Most politicians will lie to get elected. Not Trump. He actually fully intends to keep his promises, which makes him one of the most honorable people in the public arena. But let me explain why Republicans should be eager to pass this bill: their own self-preservation, which is one of the most motivating forces for the overwhelming majority of them. The Big, Beautiful Bill makes the Trump tax cuts permanent. That alone, right there, should be more than enough incentive to pass the bill, because if they don’t, Republicans will trigger upwards of a 60% tax increase, and, according to Russ Vought, head of the Office of Management and Budget, also trigger a recession. Now I’ve been in D.C. for 25 years, with a dad who served in Congress for a decade. I’ve seen Republicans in D.C. up close for many years, and I’ve reached the conclusion that many of them are intellectually impaired and will go out of their way to snatch defeat from the jaws of victory. But not passing this bill and raising taxes and triggering a recession, going into a midterm year? That would be viciously stupid. There are other reasons to pass the bill: from no taxes on tips to work requirements for able-bodied people on welfare to eliminating 1.4 million illegal aliens from Medicaid to defunding the Green New Deal. And the list could go on and on. But one of the other reasons Republicans must absolutely pass this bill is that it is one of the most incredible immigration and deportation bills we’ve ever seen in our history. That alone would be a single reason to vote for the bill: it will bring about structural change and create massive savings for the American people. Let me explain. There is $175 billion in this bill for deportations of up to a million illegals a year, 10,000 new ICE agents, the doubling of ICE detention facilities, and here’s the best part: funding for 701 miles of the border wall. In Trump’s first term, we couldn’t even get $25 billion for the wall, and now we get funding for over 700 miles AND massive funding for deportation? If this is a dream, don’t wake me up because that right there is incredible. Think about it. Illegal aliens cost the taxpayer no less than $150 billion a year. If, in theory, we can remove most, if not all, of that financial drain on the American people, we could be looking at a cost savings of well over a trillion dollars in the next decade (with the caveat it has to be fully ramped up beyond a million deportations and Democrats can’t be allowed to have political power to open up the floodgates again and import their new voters). But think about that as part of the savings brought about by this bill, in addition to the $1.6 trillion in mandatory savings that’s already in the bill. And while the Trump tariffs aren’t part of the bill, it should be noted that the CBO, which isn’t exactly a friendly resource for Trump or any Republican administration for that matter, announced yesterday that Trump’s tariffs could reduce the federal deficit by $2.8 trillion over the next decade. When you start to add the mandatory savings, the savings from seriously addressing illegal immigration and then the tariffs, you are talking about very serious savings and deficit reduction. Throw in rescission bills and then the strategy of pocket rescissions, and you’re talking hundreds of billions more in cuts. I will be the first to tell you we have to have a serious conversation about spending and cutting the size and scope of government, but I think most semi-intelligent people who know how this works understand you save that conversation for a budget bill and not a reconciliation bill, which is what the Big, Beautiful Bill is. So while I applaud the Ron Johnsons and Rick Scotts of the world, who are serious people and want to get the best bill possible, it is incumbent on Senate Republicans to make their tweaks to the bill, pass it, reconcile it with the House bill and send it on to President Trump for him to sign it into the law. The Republican Party will be better for it, but more importantly, the country will be as well. Ned Ryun is the founder and CEO of American Majority.This article was originally published by RealClearPolitics and made available to WMAL via RealClearWire. **MORE FROM WMAL NEWS** **OP-ED: GOP & America Will Benefit From Trump’s Big Beautiful Bill** **U.S., China Reach Framework to Relieve Export Controls** **Trump Gets ‘Good Reports’ from Team in Talks with China** **National Guard Moves Into Los Angeles** **Trump Sends National Guard to Quell Anti-ICE Riots** **U.S., China to Meet on Trade in London, Trump Says** **Trump-Musk Breakup Gets Nasty** **Trump Orders DOJ Probe of Biden Aides Commandeering the Autopen** **Missed a Show? Listen Here** **WMAL APPS** **Newsletter** **Local Weather** **Contact WMAL** Studio Lines: 888-630-WMAL (9625)News Room: 202-686-3020Programming: 202-686-3100 Ext. 2358Email DirectoryProgrammingNewsroomSalesWebsite Questions or Comments Studio Lines: 888-630-WMAL (9625) News Room: 202-686-3020 Programming: 202-686-3100 Ext. 2358 Email Directory Programming Newsroom Sales Website Questions or Comments Studio Lines: 888-630-WMAL (9625) News Room: 202-686-3020 Programming: 202-686-3100 Ext. 2358 Email Directory Programming Newsroom Sales Website Questions or Comments Privacy Policy Terms of Service General Contest Rules Advertise With Us Station Information Employment Opportunities FCC Public File for WMAL-FM Cumulus Media Corporate EEO Public File Report Copyright 2024 Cumulus Media /Cumulus Media is an equal opportunity employer / AA View Full Site"}