{"id": 1577, "name": "WHAS - Louisville News", "domain": "whas11.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.whas11.com/article/syndication/instagram/honor-flight-bluegrass-veterans-2025-mary-clark-carroll-dorroh-john-ross-ken-hardin-sr-donald-sheroan-joe-schnitterbaum-charles-wycoff-terry-chasteen/417-6879598b-5555-4708-91e5-d12ed17dc8a1", "title": "Honor Flight Bluegrass Veterans 2025 Mary Clark Carroll Dorroh John Ross Ken Hardin Sr Donald Sheroan Joe Schnitterbaum Charles Wycoff Terry Chasteen", "content": "Share on Facebook Share on SMS Share on Email **Navigation** NewsBackLocalLOUtodayNear MeEntertainmentHealthMoneyNation WorldPoliticsFOCUS InvestigationsCommunityFeaturesExcel AwardLatest News StoriesNorton Children's to build new hospital, pediatric campus in east LouisvilleLouisville Metro Police 'monitoring' Saturday protest plans Back Local LOUtoday Near Me Entertainment Health Money Nation World Politics FOCUS Investigations Community Features Excel Award Norton Children's to build new hospital, pediatric campus in east Louisville Louisville Metro Police 'monitoring' Saturday protest plans Back Local LOUtoday Near Me Entertainment Health Money Nation World Politics FOCUS Investigations Community Features Excel Award Norton Children's to build new hospital, pediatric campus in east Louisville Louisville Metro Police 'monitoring' Saturday protest plans WeatherBackForecastRadarMapsWeather SmartsEnvironmentWeather CamerasTrafficClosings/DelaysLatest Weather StoriesAir Quality Alert Wednesday | WHAS11 Weather Impact ForecastFlash flooding swamps streets, forces rescues after heavy rain in Salem, Indiana Back Forecast Radar Maps Weather Smarts Environment Weather Cameras Traffic Closings/Delays Air Quality Alert Wednesday | WHAS11 Weather Impact Forecast Flash flooding swamps streets, forces rescues after heavy rain in Salem, Indiana Back Forecast Radar Maps Weather Smarts Environment Weather Cameras Traffic Closings/Delays Air Quality Alert Wednesday | WHAS11 Weather Impact Forecast Flash flooding swamps streets, forces rescues after heavy rain in Salem, Indiana SportsBackHigh School SportsUniversity of LouisvilleUniversity of KentuckyCollege SportsLocked On Podcast NetworkLatest StoriesFemale athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination lawAaron Rodgers reveals secret marriage during Steelers debut Back High School Sports University of Louisville University of Kentucky College Sports Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Aaron Rodgers reveals secret marriage during Steelers debut Back High School Sports University of Louisville University of Kentucky College Sports Locked On Podcast Network Female athletes appeal landmark NCAA settlement, saying it violates federal antidiscrimination law Aaron Rodgers reveals secret marriage during Steelers debut SearchSearch:Search Advertise With Us Good Morning Kentuckiana Assignment Education Unsolved Contests FOCUS Investigations Moments That Matter Breonna Taylor Case Kentuckiana Schools Beyond Bardstown Ann Gotlib Case Kentucky Tornadoes Coronavirus Gas Prices Weather Cameras VERIFY Great Day Live Crimetracker Seen on TV A Different Cry Love Local **'It gives you cold chills.' | Rain soaked Honor Flight ends in the warmest welcome for 84 veterans** Honor Flight Bluegrass gives 84 veterans the memories they may have missed the first time they came home. Brooke Hasch **** To stream WHAS11 on your phone, you need the WHAS11 app. **** **Download the WHAS11 app** Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Next up in5 Example video title will go here for this video Play Video Close Video Up and readyStories are shared. Hands are shaken. Up and ready Stories are shared. Hands are shaken. Up and ready Stories are shared. Hands are shaken. Up and ready Stories are shared. Hands are shaken. Welcome to Washington D.C.'I have goosebumps.' Welcome to Washington D.C. 'I have goosebumps.' Welcome to Washington D.C. 'I have goosebumps.' Welcome to Washington D.C. 'I have goosebumps.' The World War II Memorial'Only 66,000 left' The World War II Memorial 'Only 66,000 left' The World War II Memorial 'Only 66,000 left' The World War II Memorial 'Only 66,000 left' The Wall of Remembrance'This is what I came for' The Wall of Remembrance 'This is what I came for' The Wall of Remembrance 'This is what I came for' The Wall of Remembrance 'This is what I came for' Vietnam Veteran's Memorial'Parts of it will never go away' Vietnam Veteran's Memorial 'Parts of it will never go away' Vietnam Veteran's Memorial 'Parts of it will never go away' Vietnam Veteran's Memorial 'Parts of it will never go away' The Sacred Grounds of Arlington'They’re still out there' The Sacred Grounds of Arlington 'They’re still out there' The Sacred Grounds of Arlington 'They’re still out there' The Sacred Grounds of Arlington 'They’re still out there' Who brought extra socks?'I learned' Who brought extra socks? 'I learned' Who brought extra socks? 'I learned' Who brought extra socks? 'I learned' Mail call'This is from my family!' Mail call 'This is from my family!' Mail call 'This is from my family!' Mail call 'This is from my family!' Welcome home, veterans.It's a little closure' Welcome home, veterans. It's a little closure' Welcome home, veterans. It's a little closure' Welcome home, veterans. It's a little closure' WASHINGTON, D.C., USA It's the most precious cargo an American Airlines plane will transport all day and an honor for the two Marines sitting in the cockpit. On what has to have been the rainiest day in May thus far, 84 veterans, their guardians and volunteers with Honor Flight Bluegrass sat in a dimmed cabin, waiting to head back home. It's the second time today they've heard the pilot say there will be an hour-long delay thanks to low cloud cover and heavy rain. Our veterans are tired, wet and ready for bed. Little do they know, the highlight of their day is still on the horizon. **Up and ready:Stories are shared. Hands are shaken.** Alarms went off well before 4 a.m. for those able to sleep the night before. I heard from a number of veterans and their guardians who were too excited to sleep. They checked into Ali International by 6 a.m. and were greeted by dozens of Honor Flight ground crew members. You can't miss those neon yellow shirts. Take a donut, have a coffee and enjoy the tunes from your childhood. 'Boogie Woogie Bugle Boy' is always on the playlist for the Ladies for Liberty, who carry on the legacy of the Andrews Sisters, with songs from the 40's on. You can always spot the World War II and Korean War veterans in the crowd mouthing the words to each song. And then there's the Vietnam veterans, many of whom are able-bodied enough to dance along with them. Stories are shared. Hands are shaken. And a brotherhood is formed. In this case, with one sister in the mix -Lt. Col. Mary Clark. When it's finally time to board the plane - and all of the wheelchairs - we're told there's a ground stop in D.C. Mother Nature's determined to soak us all. All day long. **Welcome to Washington D.C.:'I have goosebumps.'** We arrive in D.C. an hour later than planned, but even through the rain, you can see a water cannon salute outside the plane window. I hear a 'that's so cool' over my shoulder. This is just the beginning. Walking through the jetway to the gate, you can't see anyone, but you can hear them - clapping, cheering. And then it hits them. Passengers from neighboring gates have made their way to ours to welcome our veterans, one by one. It's emotional even thinking about it now. The first tears of the morning.Hollie Hazzard, from Brownfield, Maine is of those in the crowd. \"I have goosebumps, like tears in my eyes. It’s an honor to be here to welcome them home,\" Brownfield said. \"Both of our dads were in World War II. So this is very touching,\" Bonnie Ferone, from Cincinnati said alongside her husband Bruce. \"We heard people clapping and we came over. This has been a fabulous opportunity for us to see these guys get off that plane. My dad was up in Greenland, and he would’ve loved this.\" **The World War II Memorial:'Only 66,000 left'** It's not long before we board four buses and head for the World War II Memorial. It's grand, it's beautiful and usually evokes more smiles than any other stop so, it's often the site for group photos. On this Tuesday, it was a bit harder to see faces through the ponchos and rain drops on lenses. The group stands in front of the Wall of Stars. Each of the 4,048 gold stars represents 100 American military deaths from the war. \"There were 16 million men and women who served in World War II. There are only 66,000 left,\" Jeff Thoke, the chairman for Honor Flight Bluegrass said to the crowd. \"We owe everything to them who saved the world so we could be here today. We lost over 400,000 veterans who lost their lives for us.\" \"This is something else right here. I’m really impressed with this,\" Carroll Dorroh, a U.S. Army veteran said. \"It is beautiful. It’s something we needed and I like what it says about the women over there. They were building airplanes, boats and ships and they played a big part in this war, too.\" **The Wall of Remembrance:'This is what I came for'** Within the hour, we're headed for one of the more emotionally draining memorials: The Vietnam and Korean War Memorials. It's also the longest stop of the day, allowing veterans the time needed to get to both and be in the moment. \"It brings back memories and believe me, I have a short memory, but there’s a lot of things you don’t forget,\" John Ross, a Korean War veteran in the Army said. \"Now I’m ready to go home. This is what I came for.\"Before he can walk away, a man in a blue Kentucky shirt comes up to shake his hand. Nick Vahle's a combat engineer from Nicholasville, and on active duty with the Reserves. He just happened to be here with his family, at the right place, right time. \"We really appreciate your service,\" he tells Ross. \"You’re the reason we do it.\" **Vietnam Veteran's Memorial:'Parts of it will never go away'** Across the rain soaked grounds, stands the Vietnam Wall, made of polished black granite and more than 58,000 names. Air Force veteran Ken Hardin, Sr. is down there with his son. He was an aircraft mechanic during the Vietnam War. \"We had two mortar attacks on our base. And just a week before I went home, a bomb went off and killed 28 servicemen,\" Hardin said. \"I was stuck with the chore of removing their bodies off the runway and ramp. And then came home a week later, and was supposed to act natural and normal. I did pretty well. Tried hard.\" He doesn't remember all 28 names, but he does remember one other. \"We were looking for a Robert O’Reilly. He was a pilot and I sent him off one day and he says it’s his son’s birthday. He hollers,Happy Birthday Robbie!Three days later his pane didn’t make it back from a mission. His plane was shot down,\" Hardin said. \"I’m kind of having a little resolve from all of this, but parts of it will never go away,\" Donald Sheroan, a Vietnam veteran from Rineyville said. \"It was hard in a way. I had a brother-in-law who lost his life over there so I made it a point to go see that, so my wife can cherish that when I get home. It means a lot to come here and visit all these sites, especially to have my son with me.\"At the entrance to the Wall, we see a crowd of umbrellas congregating around a veteran. Remember Clark? She was our only female veteran on this flight, a 28-year veteran with the Air Force as a dietician and officer in charge during the Vietnam War. \"We saw her on the news. We were watching you and she is my sorority sister as well,\" Kimberly Marshall said. \"We’re actually from Shelbyville but we’ve been here for seven weeks. So as soon as we got this all narrowed down, we said we had to see Mary. We’ve got to go. We have to make this trip.\" **The Sacred Grounds of Arlington:'They’re still out there'** The bells toll over Arlington National Cemetery as the clock strikes 3 p.m. Rain hitting umbrellas and the steps from the Sentinels are the only noises you hear. Everyone's quiet and still, watching the Changing of the Guard at the Tomb of the Unknown Soldier. This moment is a favorite for our veterans who are in awe at the precision and commitment of these soldiers. \"Even in the pouring rain, they’re still out there, every single day, 24/7,\" Joe Schnitterbaum, an Army veteran from Mount Washington said. We stop at Iwo Jima and the Air Force Memorial, at which point the rain is keeping some veterans on the bus. But it's a sight to behold for those who get up close. \"I don’t see how it’s standing, it’s so big,\" Gary Kaelin, a Marine and Vietnam veteran from the 70's, said looking up at the three spires. **Who brought extra socks?:'I learned'** Relief from the rain comes as we head back to Reagan National. \"We’re all wet. There are a couple folks who don’t even have shoes on right now,\" Michael Montgomery, a photographer with Honor Flight said. \"Changed socks, bought sweatshirts.\" My photojournalist, Phillip Murrell and I are the first to head to the gift shop, for a dry long-sleeved shirt. Several others follow suit. \"I did change my shoes one time today,\"I heard Jeff Thoke tell a veteran.\"The last flight, I was wet the whole time. I said I’m not doing that again, so I learned.\" We're cold, we're wet. It's not the greatest combination for our veterans, but the Chick-fil-A sandwiches are a welcomed sight. This is where most of our guys think it ends. They're ready for a hot shower and bed. **Mail call:'This is from my family!'** Then, they hear their names called by Honor Flight staff. Guardians are handed a manila envelope with their veteran's name on the front. It's mail call for all 84. Stacks of cards, handwritten, typed, some colored in by school-aged kids, by friends, family and complete strangers. 'That’s…Is that you?'one veteran asks looking down at a letter.'This is from him!'he yells to me.'This is from family!' It brings back memories of all the letters these soldiers received while away from home. Good memories for everyone except Vietnam veteran Jesse Varner, who's holding his stack of letters, crying in his seat. \"I spent six and half years in the Army. Went to Mail Call every day like everybody else did. I never heard my name called,\" Varner said, as a tear rolled down his cheek. \"Today, I told them they finally caught up with me. This is my mail. And I’m going to read every one of them when I get home.\" The first letter from the pile is from his oldest daughter, Becky. He reads aloud, 'I am proud to call you my father. You have worked very hard to protect us and sacrificed along the journey. Thank you for being in my life and giving me the freedom to live my life.\" A few rows behind Varner, are next door neighbors from Jeffersonville. \"We’ve known each other for probably 50 years,\" Charles Wycoff said. \"His wife came over to my yard one day and asked if I would come on an Honor Flight with him, and I said there’s no way. So, of course, here we are.\" \"He served over there. I did not. I was in a submarine below the water,\" John Scott said, at which point I reminded him the sacrifice was still the same. \" Yea, we lost some men, with dangers at sea.\"Both received an envelope full of letters. \"This right here is making my whole trip,\" Scott said. \"I’m gonna need a mail truck. That’s the most mail I’ve gotten in one day in ever! Most people family, people I don’t even know.\" \"At least we got recognition. Before, we got zero. In fact we got shamed,\" Wycoff said. \"They didn’t want to see you in uniform. It was embarrassing. But at least we came home. Our name ain't on the wall.\" **Welcome home, veterans.:It's a little closure'** Back home, in Louisville, crowds are already arriving at the airport for a surprise welcome home celebration. It's raining there, too. One couple from Hikes Point Christian Church knows two veterans in the group. 'They have no idea, the surprise is the best part.' Then, there's Carroll Bean, the wife of Vietnam veteran Jack Bean, who was waiting with the whole family. Bean spent 28 years in the Air Force and flew with the KC-135 Tanker Squadron. \"My husband has no idea what’s going to happen when he gets off that plane,\" she said. \"It’s a little closure. We called the news stations when he came home the first time and they were not interested.\" Patty Thompson's husband, Staff Sgt. John Thompson, had a similar story. \"This welcome home has been a long time coming,\" she said. \"I remember when he got back from Vietnam. They told him three things: don’t wear your uniform, don’t tell anybody you are in the military and don’t say you just got back from Vietnam. And that was the mood of the country at the time. So, we are so grateful for people who honor the Vietnam vets now.\" \"We’re proud of America. We’re proud of our veterans, especially the Vietnam and Korea. Because I think those two are the lost ones that never got the recognition they deserved,\" Thompson said. By 10 p.m., the crowd has grown to more than two thousand people and they still have another hour to wait because - you guessed it - we're delayed again due to weather. It's an incredible sight for anyone who's never done this before. \"This is my first time being here and they said a lot of people come, but I never in a million years thought there would be this many people,\" Thompson said. It's nearing 11 p.m. when our veterans finally turn the corner at the TSA checkpoint in Louisville and an explosion of applause and cheers breaks out. American flags are flying. Families are holding posters calling out their individual veterans. And a little girl, who was fast asleep in someone else's arms, is now wide awake. We all are. This is the welcome home they should've had decades ago. This is us righting that wrong. And they absolutely loved it. Air Force and Vietnam veteran Terry Chasteen was the last to go through the line. His family coincidentally, was one of the first to greet him. He almost didn't continue on, until I told him, this moment was his - 'don't miss it.' I've spoken to Honor Flight veterans before about this celebration, who days later still can't believe the love they felt on their big night. One Vietnam veteran told me he wondered if this was what entering Heaven was like, walking past all the people who your life has influenced and they're thanking you for that. \"I can’t believe all this,\" Chasteen said. \"When I came back from Vietnam, we flew into San Francisco, went through Customs and they told us to go straight to your flight, don’t get out in the airport.\" Fifty years later, these veterans received the red carpet treatment. I just wish Chasteen's wife could have been there with him. His daughter, Melanie, reached out to me days before the flight to let me know the love of his life, Linda, died just two weeks before, and the day of the trip would've been their 48th wedding anniversary. She made him promise he'd go on this flight. \"She made all the girls promise that I had to go,\" Chasteen said.Was it worth it?I asked.\"Every bit of it.\" If you know a veteran who served time from 1941 to 1975 who's yet to board an Honor Flight, this is their time. They pay nothing. They've already paid enough. Get themsigned upand then be there when they get home, or be their guardian. Guardians pay their way through a donation of $600 to the Honor Flight. Often times, companies will sponsor one or several. This flight happened all because one person decided to pay for the whole thing. And because of that, Honor Flight Bluegrass will be able to fly to D.C. not twice but three times next year, which is incredible considering the 450 Vietnam veterans currently on the waiting list. And that's just locally. We know we can't get everyone on a flight. There are health reasons, time constraints and quite a few who just don't want to - some feel undeserving. Pish Posh. If you served, you sacrificed, whether stateside or overseas. You answered the call and you made it home. Take the trip. There's just nothing else like it. Tune in at 5:30 p.m. to WHAS11 News on Memorial Day to watch our 30 minute special of the day. **Before You Leave, Check This Out** Jobs Terms of Service Privacy Policy Ad Choices EEO Public File Report FCC Online Public Inspection File Closed Caption Procedures Do Not Sell or Share My Personal Information"}