{"id": 1110, "name": "Politiken", "domain": "politiken.dk", "bias": "left-center", "credibility": "high-credibility", "reporting": "mostly-factual", "questionable": null, "url": "https://politiken.dk/debat/kroniken/art10426585/Fra-f%C3%B8rste-dag-vidste-TV-2-at-jeg-arbejdede-for-politiet-herunder-b%C3%A5de-NSK-og-PET.-Alligevel-valgte-de-at-smide-mig-under-bussen", "title": "Fra F%c3%b8rste Dag Vidste Tv 2 At Jeg Arbejdede For Politiet Herunder B%c3%a5de Nsk Og Pet. Alligevel Valgte De At Smide Mig Under Bussen", "content": "Debat Kroniken 27. maj 2025, 20.00 27. maj 2025, 20.00 27. maj 2025, 20.00 Få digital adgang for 1 kr. Log ind **Dagens avis** **Aktuelle emner** Fodbold i flammer Donald Trump Ruslands angreb på Ukraine Krig i Mellemøsten **Sektioner** Danmark Kultur Debat Internationalt Klima Sport Mad IBYEN Se alle sektioner → Du er ikke logget ind Log ind Brug for hjælp? Som abonnent får du Fri adgang til alt Politikens digitale indhold Rabat på alle oplevelser hos Politiken Plus og på Politiken Live-arrangementer KronikenFra første dag vidste TV 2, at jeg arbejdede for politiet, herunder både NSK og PET. Alligevel valgte de at smide mig under bussenLæs næsteEkspert kalder mulig spionage begået af Amira Smajic for politiet mod TV 2 »problematisk« Fra første dag vidste TV 2, at jeg arbejdede for politiet, herunder både NSK og PET. Alligevel valgte de at smide mig under bussen Læs næste Fra første dag vidste TV 2, at jeg arbejdede for politiet, herunder både NSK og PET. Alligevel valgte de at smide mig under bussen Læs næste Få digital adgang for 1 kr. Log ind **Dagens avis** **Aktuelle emner** Fodbold i flammer Donald Trump Ruslands angreb på Ukraine Krig i Mellemøsten **Sektioner** Danmark Kultur Debat Internationalt Klima Sport Mad IBYEN Se alle sektioner → Du er ikke logget ind Log ind Brug for hjælp? Som abonnent får du Fri adgang til alt Politikens digitale indhold Rabat på alle oplevelser hos Politiken Plus og på Politiken Live-arrangementer Kronik afAmira Smajic Amira Smajic er hovedmedvirkende i TV 2-dokumentaren ’Den sorte svane’. Jeg bliver nu igen tvunget ind i tv-skærmen af TV 2’s succesprogrammer uden mit samtykke, og gennem brugen af mit fortrolige materiale — som jeg har ejendomsret over, og som TV 2 ikke har rettigheder til — med information der potentielt sætter mit og mine nærmestes liv og helbred i fare. **Fra første dag vidste TV 2, at jeg arbejdede for politiet, herunder både NSK og PET. Alligevel valgte de at smide mig under bussen** Dette er en Kronik. Kroniken er udtryk for skribentens holdning. Du kan indsende Kronik-forslagher. Pressen er vores demokratis vagthund, den fjerde statsmagt. Denne magt bærer et stort ansvar. For som al anden magt kan den misbruges med store konsekvenser for både samfundet som helhed og enkeltpersoner i særdeleshed. I den sidste tid har der været en del danske dokumentarer, der har skabt debat om genrens vigtige lødighed, balancegang og magt. Herunder den dokumentar, jeg var hovedkilde og muldvarp i: ’’. Dette er en Kronik. Kroniken er udtryk for skribentens holdning. Du kan indsende Kronik-forslagher. **Læs videre for 1 kr.** Du er godt i gang – få adgang til hele artiklen, alt på politiken.dk og dagens e-avis i en måned for kun 1 kr. Ingen binding. **Mest læste** 1 1 I spilder jeres liv med ligegyldigtpseudoarbejde.Gå dog hjem! **I spilder jeres liv med ligegyldigtpseudoarbejde.Gå dog hjem!** **I spilder jeres liv med ligegyldigtpseudoarbejde.Gå dog hjem!** **I spilder jeres liv med ligegyldigtpseudoarbejde.Gå dog hjem!** 2 2 Nu svarer TV 2 påomdiskuteredeanklager i Berlingske **Nu svarer TV 2 påomdiskuteredeanklager i Berlingske** **Nu svarer TV 2 påomdiskuteredeanklager i Berlingske** **Nu svarer TV 2 påomdiskuteredeanklager i Berlingske** 3 3 Et’rockwool­lag’af lobbyister har fundamentalt forandret dansk politik **Et’rockwool­lag’af lobbyister har fundamentalt forandret dansk politik** **Et’rockwool­lag’af lobbyister har fundamentalt forandret dansk politik** **Et’rockwool­lag’af lobbyister har fundamentalt forandret dansk politik** 4 4 Hun skriver nogle af Nordens bedste krimier **Hun skriver nogle af Nordens bedste krimier** **Hun skriver nogle af Nordens bedste krimier** **Hun skriver nogle af Nordens bedste krimier** 5 5 »Jeg bor for helvede i Vedbæk. Sådan noget må du ikke sige« **»Jeg bor for helvede i Vedbæk. Sådan noget må du ikke sige«** **»Jeg bor for helvede i Vedbæk. Sådan noget må du ikke sige«** **»Jeg bor for helvede i Vedbæk. Sådan noget må du ikke sige«** 6 6 Protester i New York endte i en seks timer lang konfrontation medhundred­visaf betjente **Protester i New York endte i en seks timer lang konfrontation medhundred­visaf betjente** **Protester i New York endte i en seks timer lang konfrontation medhundred­visaf betjente** **Protester i New York endte i en seks timer lang konfrontation medhundred­visaf betjente** **USA forbereder delvis evakuering af ambassade i Irak** **USA forbereder delvis evakuering af ambassade i Irak** Vi har nyhedsbreve om alt lige fra klassisk musik til chefredaktørens anbefalinger. Vi har nyhedsbreve om alt lige fra klassisk musik til chefredaktørens anbefalinger. Hvilken ukrudtsplante, der er en plage for mange pollenallergikere, findes i Danmark bl.a. i en grå- og en mark-variant? Hvilken ukrudtsplante, der er en plage for mange pollenallergikere, findes i Danmark bl.a. i en grå- og en mark-variant? **Lang historie kort** **Lang historie kort** De klogeste flygter fra USA, Københavns kamp mod Airbnb, manden der vil slås med Trump De klogeste flygter fra USA, Københavns kamp mod Airbnb, manden der vil slås med Trump ❌Der opstod en fejl **Bogfolk** **Bogfolk** Den er 100 år gammel, men du kan læse 'Den store Gatsby' og forstå USA i dag Den er 100 år gammel, men du kan læse 'Den store Gatsby' og forstå USA i dag ❌Der opstod en fejl **Du lytter til Politiken** **Du lytter til Politiken** »Du er dumpet«: Det store svigt i folkeskolen »Du er dumpet«: Det store svigt i folkeskolen ❌Der opstod en fejl **Poptillægget** **Poptillægget** Bachelorette: Leder 23-årige drenge fra Varde egentlig efter kærligheden, og hvad fanden er en ordkunstner? Bachelorette: Leder 23-årige drenge fra Varde egentlig efter kærligheden, og hvad fanden er en ordkunstner? ❌Der opstod en fejl **Den levende** **Den levende** Narcissisme: Forstå tidens store diagnose (PREMIUM) Narcissisme: Forstå tidens store diagnose (PREMIUM) ❌Der opstod en fejl **Sådan er politik** **Sådan er politik** Derfor kan Mette lide Meloni Derfor kan Mette lide Meloni ❌Der opstod en fejl **Du lytter til USA** **Du lytter til USA** Sådan endte Musk og Trump i slåskamp og anklager om pædofili Sådan endte Musk og Trump i slåskamp og anklager om pædofili ❌Der opstod en fejl **Blod på trøjen** **Blod på trøjen** Afsnit 5: Trojanske heste Afsnit 5: Trojanske heste ❌Der opstod en fejl **Putin - verdens farligste mand?** **Putin - verdens farligste mand?** Afsnit 5: Den store plan Afsnit 5: Den store plan ❌Der opstod en fejl **Musikmakker** **Musikmakker** Nytårsspecial (2): Med Lamin og Ida Laurberg på Orange Scene Nytårsspecial (2): Med Lamin og Ida Laurberg på Orange Scene ❌Der opstod en fejl **Ibyens Kærlighedsbrevkasse** **Ibyens Kærlighedsbrevkasse** Noah Umur Kanber, Magnus Haugaard og Barbara Gjerluff Nyholm: Om mindsket sexlyst og åbne forhold Noah Umur Kanber, Magnus Haugaard og Barbara Gjerluff Nyholm: Om mindsket sexlyst og åbne forhold ❌Der opstod en fejl **Krigens børn fortæller** **Krigens børn fortæller** Julies mor kommer hjem fra Bosnien og har det dårligt. Hør Julies historie Julies mor kommer hjem fra Bosnien og har det dårligt. Hør Julies historie ❌Der opstod en fejl **Ung kærlighed læst op** **Ung kærlighed læst op** »Den gentagelse, hvor tingene ender med ikke at lykkes, betyder, at man efterhånden mister troen på, at man vil finde en partner« »Den gentagelse, hvor tingene ender med ikke at lykkes, betyder, at man efterhånden mister troen på, at man vil finde en partner« ❌Der opstod en fejl **Meme dig til magten** **Meme dig til magten** 'Brainrot', 'wholesome' og #freeluigi: Her kommer året i memes 'Brainrot', 'wholesome' og #freeluigi: Her kommer året i memes ❌Der opstod en fejl **Politiken læst op** **Politiken læst op** Alt spiller på denne udstilling. Men forstår man den? Alt spiller på denne udstilling. Men forstår man den? ❌Der opstod en fejl **Politolog skoser itanke­vækkendebog politikerne i Vesten for at overse, hvor magten reelt ligger** **Politolog skoser itanke­vækkendebog politikerne i Vesten for at overse, hvor magten reelt ligger** **Professor rejser etisk diskussion om stor indvandring til Danmark** **Professor rejser etisk diskussion om stor indvandring til Danmark** Politiken laver masser af lyd, og her har vi samlet det hele til dig. Lyt til store lydfortællinger og hør vores journalister læse artikler op. Politiken laver masser af lyd, og her har vi samlet det hele til dig. Lyt til store lydfortællinger og hør vores journalister læse artikler op. **Nyt dansk socialt medie vil være alt det, som Facebook ikke er** **Nyt dansk socialt medie vil være alt det, som Facebook ikke er** Organet for den højeste oplysning siden 1884 DanmarkInternationaltKlimaSport LederKronikenKlummerDebatindlægDagens tegningSend debatindlæg IBYENFilm og TVMusikMedierBøgerKunstSceneArkitektur PodcastNyhedsbreveUnderholdningPlusLiveNavneArkivErhverv **Dagens avis** Du er ikke logget ind Log ind Brug for hjælp? Som abonnent får du Fri adgang til alt Politikens digitale indhold Rabat på alle oplevelser hos Politiken Plus og på Politiken Live-arrangementer © Alt materiale på denne side er omfattet af gældende lov om ophavsret.Læs om reglerne her"}