{"id": 1821, "name": "Thinking Humanity", "domain": "thinkinghumanity.com", "bias": "conspiracy-pseudoscience", "credibility": "low-credibility", "reporting": "low", "questionable": null, "url": "https://www.thinkinghumanity.com/2021/10/73-year-old-man-from-south-dakota-confirmed-as-sitting-bulls-great-grandson-through-new-advanced-dna-technique.html", "title": "73 Year Old Man From South Dakota Confirmed As Sitting Bulls Great Grandson Through New Advanced Dna Technique.html", "content": "**Thinking Humanity** HomeThinking Humanity - Freedom of Speech, Human Values, Human Rights and Justice! Topics about Science and Technology, Energy and Sustainability, Consciousness and Philosophy, Truth, Awareness, Self-Improvement and the Universe. Health, Education, Documentaries, Humanism & Activism, Photography, Arts and more! Global NewsThe latest interesting news from around the globe. HumanismEnvironmentOur beautiful Earth provides us with an environment full of beautiful, extraordinary animals and landscapes. Let's explore nature together!JusticeJustice is essential for the whole of humanity.TruthThe word \"truth\" in Greek is translated as \"αλήθεια,\" which means anti + oblivion. EnvironmentOur beautiful Earth provides us with an environment full of beautiful, extraordinary animals and landscapes. Let's explore nature together! JusticeJustice is essential for the whole of humanity. TruthThe word \"truth\" in Greek is translated as \"αλήθεια,\" which means anti + oblivion. EnvironmentOur beautiful Earth provides us with an environment full of beautiful, extraordinary animals and landscapes. Let's explore nature together! JusticeJustice is essential for the whole of humanity. TruthThe word \"truth\" in Greek is translated as \"αλήθεια,\" which means anti + oblivion. ConsciousnessOur global consciousness derives from the philosophers and the finest minds from all over the world. Philosophy & Spirituality as the keys to global improvement of our lives.DocumentariesDocumentaries, thought-provoking movies, and films to expand your mind on many different topics.HistoryA people without the knowledge of their past history, origin, and culture is like a tree without roots.PhilosophyThe word philosophy derives from the Greek words \"φίλος\" + \"σοφία,\" which mean the friend of wisdom. Try to be knowledgable and teachable, never losing the willingness to improve your self.PhotographyPhotographs and pictures for various topics.Quantum PhysicsA light touch on Quantum Physics and Metaphysics.QuotesThought-provoking and mind-stretching quotes by various great personalities of the past and of the present, to enhance your brain.SpiritualitySpirituality is the way to look yourself internally, find your inner powers, and help yourself achieve what you really want in your life. DocumentariesDocumentaries, thought-provoking movies, and films to expand your mind on many different topics. HistoryA people without the knowledge of their past history, origin, and culture is like a tree without roots. PhilosophyThe word philosophy derives from the Greek words \"φίλος\" + \"σοφία,\" which mean the friend of wisdom. Try to be knowledgable and teachable, never losing the willingness to improve your self. PhotographyPhotographs and pictures for various topics. Quantum PhysicsA light touch on Quantum Physics and Metaphysics. QuotesThought-provoking and mind-stretching quotes by various great personalities of the past and of the present, to enhance your brain. SpiritualitySpirituality is the way to look yourself internally, find your inner powers, and help yourself achieve what you really want in your life. DocumentariesDocumentaries, thought-provoking movies, and films to expand your mind on many different topics. HistoryA people without the knowledge of their past history, origin, and culture is like a tree without roots. PhilosophyThe word philosophy derives from the Greek words \"φίλος\" + \"σοφία,\" which mean the friend of wisdom. Try to be knowledgable and teachable, never losing the willingness to improve your self. PhotographyPhotographs and pictures for various topics. Quantum PhysicsA light touch on Quantum Physics and Metaphysics. QuotesThought-provoking and mind-stretching quotes by various great personalities of the past and of the present, to enhance your brain. SpiritualitySpirituality is the way to look yourself internally, find your inner powers, and help yourself achieve what you really want in your life. Inspiring StoriesHuman intelligence, relationships and the two essential factors for self-improvement inspiration and motivation.Art“Every child is an artist. The problem is how to remain an artist once he grows up.” -Pablo PicassoHuman IntelligenceHuman intelligence and human ingenuity are the drivers of humanity to a brighter future!Self Improvement“There is nothing noble in being superior to your fellow man; true nobility is being superior to your former self.” -Ernest HemingwayRelationships“The meeting of two personalities is like the contact of two chemical substances: if there is any reaction, both are transformed.” -Carl Gustav JungQuizzes & TestsQuizzes, tests, brain games & puzzles to boost your brain. Art“Every child is an artist. The problem is how to remain an artist once he grows up.” -Pablo Picasso Human IntelligenceHuman intelligence and human ingenuity are the drivers of humanity to a brighter future! Self Improvement“There is nothing noble in being superior to your fellow man; true nobility is being superior to your former self.” -Ernest Hemingway Relationships“The meeting of two personalities is like the contact of two chemical substances: if there is any reaction, both are transformed.” -Carl Gustav Jung Quizzes & TestsQuizzes, tests, brain games & puzzles to boost your brain. Art“Every child is an artist. The problem is how to remain an artist once he grows up.” -Pablo Picasso Human IntelligenceHuman intelligence and human ingenuity are the drivers of humanity to a brighter future! Self Improvement“There is nothing noble in being superior to your fellow man; true nobility is being superior to your former self.” -Ernest Hemingway Relationships“The meeting of two personalities is like the contact of two chemical substances: if there is any reaction, both are transformed.” -Carl Gustav Jung Quizzes & TestsQuizzes, tests, brain games & puzzles to boost your brain. Science & TechScientific innovation and technological breakthroughs that help humanity as a whole, and each one of us personally. “The saddest aspect of life right now is that science gathers knowledge faster than society gathers wisdom.” -Isaac AsimovTechnologyTechnological innovations for various and essential aspects of our lives.SustainabilitySustainability and Environmental Awareness, the keys to thriving on our wonderful planet Earth.Do it Yourself (DIY)When you really want to achieve something, you might as well do it yourself! TechnologyTechnological innovations for various and essential aspects of our lives. SustainabilitySustainability and Environmental Awareness, the keys to thriving on our wonderful planet Earth. Do it Yourself (DIY)When you really want to achieve something, you might as well do it yourself! TechnologyTechnological innovations for various and essential aspects of our lives. SustainabilitySustainability and Environmental Awareness, the keys to thriving on our wonderful planet Earth. Do it Yourself (DIY)When you really want to achieve something, you might as well do it yourself! HealthHealthy lifestyle, proper nutrition, the cure to every illness.Coronavirus (CoVid-19)Useful information about the Coronavirus (CoVid-19), an infectious disease. The disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing. You can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with unwell people. Coronavirus disease spreads primarily through contact with an infected person when they cough or sneeze. It also spreads when a person touches a surface or object that has the virus on it, then touches their eyes, nose, or mouth.CuresA light touch on some cures for various illnesses.NutritionProper nutrition, healthy foods, and a good lifestyle for long life. Coronavirus (CoVid-19)Useful information about the Coronavirus (CoVid-19), an infectious disease. The disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing. You can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with unwell people. Coronavirus disease spreads primarily through contact with an infected person when they cough or sneeze. It also spreads when a person touches a surface or object that has the virus on it, then touches their eyes, nose, or mouth. CuresA light touch on some cures for various illnesses. NutritionProper nutrition, healthy foods, and a good lifestyle for long life. Coronavirus (CoVid-19)Useful information about the Coronavirus (CoVid-19), an infectious disease. The disease causes respiratory illness (like the flu) with symptoms such as a cough, fever, and in more severe cases, difficulty breathing. You can protect yourself by washing your hands frequently, avoiding touching your face, and avoiding close contact (1 meter or 3 feet) with unwell people. Coronavirus disease spreads primarily through contact with an infected person when they cough or sneeze. It also spreads when a person touches a surface or object that has the virus on it, then touches their eyes, nose, or mouth. CuresA light touch on some cures for various illnesses. NutritionProper nutrition, healthy foods, and a good lifestyle for long life. ShopThinking Humanity Store, T-shirts, Hoodies, Mugs, Bags, Leggings, stickers, beach towels, and more! **Header$type=social_icons** facebook|6.6M|Likes|Like instagram|155K|Followers|Follow twitter|7K|Followers|Follow **73-Year-Old Man From South Dakota Confirmed As Sitting Bull's Great-Grandson Through New Advanced DNA Technique** A73-year-oldman fromSouth Dakotahas been confirmed as the great-grandson of Native American leaderSitting Bullafter scientists used a new technique and DNA from the hair of the icon.Ernie LaPointehas long claimed that he was a direct descendant, but this had been dismissed by others. The new method could mean that many others alive today could be directly traced back to famous people throughout history.Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems.The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way.LaPointetold reporters:\"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\"Eske Willerslev, who led the team of scientists,added:\"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\"Adding:\"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\"Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government.[Based on reporting by:Reuters] Ernie LaPointehas long claimed that he was a direct descendant, but this had been dismissed by others. The new method could mean that many others alive today could be directly traced back to famous people throughout history.Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems.The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way.LaPointetold reporters:\"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\"Eske Willerslev, who led the team of scientists,added:\"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\"Adding:\"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\"Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government.[Based on reporting by:Reuters] Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems. The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way. LaPointetold reporters: \"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\" Eske Willerslev, who led the team of scientists,added: \"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\" Adding: \"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\" Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government. [Based on reporting by:Reuters] Ernie LaPointehas long claimed that he was a direct descendant, but this had been dismissed by others. The new method could mean that many others alive today could be directly traced back to famous people throughout history.Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems.The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way.LaPointetold reporters:\"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\"Eske Willerslev, who led the team of scientists,added:\"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\"Adding:\"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\"Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government.[Based on reporting by:Reuters] Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems. The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way. LaPointetold reporters: \"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\" Eske Willerslev, who led the team of scientists,added: \"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\" Adding: \"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\" Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government. [Based on reporting by:Reuters] Previously, while DNA analysis is a highly accurate tool for confirming lineage, it had been very difficult to confirmDNAfrom those who had died a long time previously or when minimal DNA was available. The new technique developed by scientists at the Lundbeck Foundation GeoGenetics Centre at theUniversity of Cambridgeovercame these problems. The team at the university has spent the last 14 years perfecting their technique and Mr LaPointe is the first to have his ancestry confirmed in such a way. LaPointetold reporters: \"I feel this DNA research is another way of identifying my lineal relationship to my great-grandfather. People have been questioning our relationship to our ancestor as long as I can remember. These people are just a pain in the place you sit - and will probably doubt these findings, also.\" Eske Willerslev, who led the team of scientists,added: \"LaPointe asked me to extract DNA from it and compare it to his DNA to establish relationship. I got very little hair and there was very limited DNA in it. It took us a long time developing a method that, based on limited ancient DNA, can by compared to that of living people across multiple generations.\" Adding: \"There existed methods, but they demanded for substantial amounts of DNA or did only allow to go to the level of grandchildren. With our new method, it is possible to establish deeper-time family relationships using tiny amounts of DNA.\" Sitting Bull was aHunkpapa tribal leaderin the Dakota area who died in 1890. He famously led the Native Americans into battles against the US Government who sought to expand their control over Native lands. He famously led the battel against Custer at the Battle of Little Bighorn where Custer had his' last stand'. Sitting Bull later went on tour with Buffalo Bill's wild west show but was arrested by US officials soon after. While facing arrest he was murdered by an official of the government. [Based on reporting by:Reuters] **Translate** **Subscribe to our mailing list** **Visit our new shop!** **Our Social Networks$type=social_counter** facebook|7.2M|Likes|Like instagram|360K|Followers|Follow pinterest|17K|Followers|Follow twitter|7K|Followers|Follow reddit|1.8K|Redditors|Join youtube|Subscribe telegram|Follow **/fa-clock-o/ WEEK TRENDING$type=list** 10 Truths About The Real IlluminatiThe hidden truth behind the symbols of the most well known secret organization of the world. Its story from establishment to prohibition (v... Neuroscientists Discover a Song That Reduces Anxiety By 65 Percent (Listen)Anxiety — that feeling of dread, fear, worry, and panic — is certainly nothing new. Hippocrates wrote about it in the fourth century BCE. A... Fascinating 1930’s Pharmacist Map of Herbal Cures Released To Public“It is simply no longer possible to believe much of the clinical research that is published, or to rely on the judgment of trusted physicia... Harsh Truths About An Over-thinker With A Sensitive HeartOver-thinkers tend to analyze every single thing, stick to details and try to find a meaning about everything. They don't give themselv... How The Female Body Standards Have Been Altered Over The Last 100 YearsThroughout the 20th and the 21st century, the basic idea of the “ideal body figure” for females has been altered almost as frequently as fa... **RANDOM$type=list-tab$date=0$au=0$c=5$src=random-posts** Activism Art BLM Consciousness CoVid-19 Cures Do it Yourself Documentaries Environment Fiction Health History Human Intelligence Inspirations Inspiring Stories Justice Mental Health News Nutrition Philosophy Photography Quantum Physics Quizzes & Tests Quotes Relationships Science Self Improvement Spirituality Sustainability Technology Truth **/fa-fire/ MONTHLY POPULAR$type=one** Neuroscientists Discover a Song That Reduces Anxiety By 65 Percent (Listen)Anxiety — that feeling of dread, fear, worry, and panic — is certainly nothing new. Hippocrates wrote about it in the fourth century BCE. A... 10 Truths About The Real IlluminatiThe hidden truth behind the symbols of the most well known secret organization of the world. Its story from establishment to prohibition (v... 73-Year-Old Man From South Dakota Confirmed As Sitting Bull's Great-Grandson Through New Advanced DNA TechniqueA 73-year-old man from South Dakota has been confirmed as the great-grandson of Native American leader Sitting Bull after scientists us... New French Study Shows That Ham And Meat Preservatives Contribute To Cancer Leading To Calls For A BanA scientific report from researchers in France has stated that there is a clear link between nitrates used in ham for preservation purpo... Couple Recovers Woodstock Photo 50 Years After It Was Taken To Mark The Beginning Of Their RelationshipJudy and Jerry Griffin met on August 15th, 1969, on their way to Woodstock Music Festival. They are still together. Even though family and... Home Privacy Policy/Cookies About us **Subscribe to our mailing list** **$type=social_counter** facebook|7.2M|Likes|Like instagram|360K|Followers|Follow pinterest|17K|Followers|Follow twitter|7K|Followers|Follow reddit|1.8K|Redditors|Join youtube|Subscribe telegram|Follow"}