{"id": 984, "name": "WJCT - NPR - Jacksonville", "domain": "news.wjct.org", "bias": "left-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://news.wjct.org/show/florida-roundup/2025-05-30/leadership-changes-at-florida-universities-how-big-beautiful-bill-could-impact-floridians-still-no-state-spending-plan-and-weekly-news-briefing", "title": "Leadership Changes At Florida Universities How Big Beautiful Bill Could Impact Floridians Still No State Spending Plan And Weekly News Briefing", "content": "Shows & PodcastsFirst Coast ConnectThe Florida RoundupWhat's Health Got to Do with It?Morning EditionAll Things ConsideredPBS NewshourPodcastsNPR+ Podcast BundleWJCT News 89.9 FM - Radio ScheduleJax PBS 7.1 ScheduleFirst Coast ConnectThe Florida RoundupWhat's Health Got to Do with It?Morning EditionAll Things ConsideredPBS NewshourPodcastsNPR+ Podcast BundleWJCT News 89.9 FM - Radio ScheduleJax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule NewsJacksonville TodayNational NewsLocal WeatherLocal TrafficLocal Gas PricesJacksonville TodayNational NewsLocal WeatherLocal TrafficLocal Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices AboutWJCT News 89.9 TeamWJCT Public MediaWJCT News 89.9 TeamWJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media On AirNow PlayingWJCT News 89.9 On AirNow PlayingClassical 24© 89.9 HD2 On AirNow PlayingAnthology 89.9 HD3 On AirNow PlayingJacksonville's Jazz Radio 89.9 HD4 On AirNow PlayingWJCT Radio Reading Service Shows & PodcastsFirst Coast ConnectThe Florida RoundupWhat's Health Got to Do with It?Morning EditionAll Things ConsideredPBS NewshourPodcastsNPR+ Podcast BundleWJCT News 89.9 FM - Radio ScheduleJax PBS 7.1 ScheduleFirst Coast ConnectThe Florida RoundupWhat's Health Got to Do with It?Morning EditionAll Things ConsideredPBS NewshourPodcastsNPR+ Podcast BundleWJCT News 89.9 FM - Radio ScheduleJax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule First Coast Connect The Florida Roundup What's Health Got to Do with It? Morning Edition All Things Considered PBS Newshour Podcasts NPR+ Podcast Bundle WJCT News 89.9 FM - Radio Schedule Jax PBS 7.1 Schedule NewsJacksonville TodayNational NewsLocal WeatherLocal TrafficLocal Gas PricesJacksonville TodayNational NewsLocal WeatherLocal TrafficLocal Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices Jacksonville Today National News Local Weather Local Traffic Local Gas Prices AboutWJCT News 89.9 TeamWJCT Public MediaWJCT News 89.9 TeamWJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media WJCT News 89.9 Team WJCT Public Media **Leadership changes at Florida universities; how ‘Big Beautiful Bill’ could affect Floridians; still no state spending plan; and weekly news briefing** Leadership changes at Florida universities There are a dozen public state universities in Florida. Half of them have or soon will have new presidents. Some of the incoming leaders have close connections to Gov. Ron DeSantis — a growing trend in Florida higher education. That’s the case for Manny Diaz Jr., the current state education commissioner who was recently approved to be the interim president of the University of West Florida in Pensacola. Another recent example is former Lt. Gov. Jeanette Nunez, who is now interim president at Florida International University. Guest: Andrew Atterbury, education reporter for Politico's Florida bureau. How ‘Big Beautiful Bill’ could affect Floridians The U.S. Senate will soon consider a massive tax and spending package with cuts to spending on Medicaid and federal food assistance. We break down some key elements of the sweeping bill and look at how federal cuts to Medicaid could affect Florida’s program. Guest: Claudia Grisales, congressional correspondent for NPR. Still no state spending plan Florida lawmakers need to pass a budget by July 1 in order to prevent a state government shutdown. But legislative leaders do not appear any closer to reaching an agreement. Guest: Douglas Soule, state government reporter for WUSF. Weekly news briefing As Floridians prepare for the hurricane season that begins June 1, many have yet to fully recover from recent major storms. Some in Southwest Floridaare still rebuildingnearly three years after a direct hit from Hurricane Ian. Florida is on pace to execute more people this year than it has in any single year since the death penalty was reinstated in 1976. The state has executed five death row inmates so far in 2025. Two more are scheduled to die by lethal injection in June if there are no other legal challenges. twitter National NewsL.A. is quiet a day after downtown curfew 'Pink Pony Club' carries the Oilers National NewsHow the Los Angeles protests fit into conservative immigration strategy National NewsIn Miami, deportations are raising concerns among Cuban-Americans Performers and video game companies reach deal that ends nearly year-long strike Trump's EPA plans to repeal climate pollution limits on fossil fuel power plants twitter instagram youtube flipboard facebook FCC Public Inspection File Studio Rentals Privacy Policy DMCA Policy Sponsorship Opportunities"}