{"id": 1456, "name": "Times-Georgian", "domain": "times-georgian.com", "bias": "right-center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.times-georgian.com/how-to-submit-an-obituary/article_072e2b10-1d6f-11ed-975f-5bc9d5594764.html", "title": "How To Submit An Obituary", "content": "Log outLog inRegisterActivateSubscribeAccount Management About Us Contact Us Advertise Promote Your Event Terms of Use Privacy Policy Subscription Services Local Weather AI Policy Local News Business Farm and Garden Faith and Values Leisure Southern Spice Friday Night Lights Bowdon Schools Bremen Schools Carrollton Schools Central Schools Haralson County Schools Heard County Schools Holy Ground Baptist Academy Mt. Zion Schools Oak Mountain Academy Temple Schools University of West Georgia Villa Rica Schools West Georgia Technical College Columnists Editorials Letters to the editor Times-Georgian Gateway-Beacon Subscribe Today! Carroll County Classifieds Haralson County Classifieds Georgia Press Association Anniversary Announcement Birth Announcement Engagement Announcement Wedding Announcement How to submit an obit About Us Contact Us Subscribe e-Edition 84°Carrollton, GA(30117)TodayPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%..TonightPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.Updated: June 11, 2025 @ 5:44 pmFull Forecast Carrollton, GA(30117)TodayPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%..TonightPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.Updated: June 11, 2025 @ 5:44 pm Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.. Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%. Updated: June 11, 2025 @ 5:44 pm Full Forecast Carrollton, GA(30117)TodayPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%..TonightPartly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.Updated: June 11, 2025 @ 5:44 pm Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.. Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%. Updated: June 11, 2025 @ 5:44 pm Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%.. Partly cloudy this evening followed by increasing clouds with showers developing after midnight. Low 67F. Winds light and variable. Chance of rain 30%. Updated: June 11, 2025 @ 5:44 pm Full Forecast HomeAbout UsContact UsAdvertisePromote Your EventTerms of UsePrivacy PolicySubscription ServicesLocal WeatherAI Policy About Us Contact Us Advertise Promote Your Event Terms of Use Privacy Policy Subscription Services Local Weather AI Policy About Us Contact Us Advertise Promote Your Event Terms of Use Privacy Policy Subscription Services Local Weather AI Policy NewsLocal NewsBusinessFarm and GardenFaith and ValuesLeisureSouthern Spice Local News Business Farm and Garden Faith and Values Leisure Southern Spice Local News Business Farm and Garden Faith and Values Leisure Southern Spice SportsFriday Night Lights Friday Night Lights Friday Night Lights Villa Rican Gateway-Beacon Your SchoolBowdon SchoolsBremen SchoolsCarrollton SchoolsCentral SchoolsHaralson County SchoolsHeard County SchoolsHoly Ground Baptist AcademyMt. Zion SchoolsOak Mountain AcademyTemple SchoolsUniversity of West GeorgiaVilla Rica SchoolsWest Georgia Technical College Bowdon Schools Bremen Schools Carrollton Schools Central Schools Haralson County Schools Heard County Schools Holy Ground Baptist Academy Mt. Zion Schools Oak Mountain Academy Temple Schools University of West Georgia Villa Rica Schools West Georgia Technical College Bowdon Schools Bremen Schools Carrollton Schools Central Schools Haralson County Schools Heard County Schools Holy Ground Baptist Academy Mt. Zion Schools Oak Mountain Academy Temple Schools University of West Georgia Villa Rica Schools West Georgia Technical College OpinionColumnistsEditorialsLetters to the editor Columnists Editorials Letters to the editor Columnists Editorials Letters to the editor Obituaries e-EditionTimes-GeorgianGateway-BeaconSubscribe Today! Times-Georgian Gateway-Beacon Subscribe Today! Times-Georgian Gateway-Beacon Subscribe Today! ClassifiedsCarroll County ClassifiedsHaralson County ClassifiedsGeorgia Press Association Carroll County Classifieds Haralson County Classifieds Georgia Press Association Carroll County Classifieds Haralson County Classifieds Georgia Press Association To SubmitAnniversary AnnouncementBirth AnnouncementEngagement AnnouncementWedding AnnouncementHow to submit an obit Anniversary Announcement Birth Announcement Engagement Announcement Wedding Announcement How to submit an obit Anniversary Announcement Birth Announcement Engagement Announcement Wedding Announcement How to submit an obit Special Sections Galleries Videos Facebook Twitter WhatsApp SMS Email **How to submit an obituary** Aug 16, 2022 Aug 16, 2022UpdatedApr 19, 2023 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save Always check with the funeral home first. Many funeral homes provide basic information and will write the full obituary for you as part of the services they provide. Obits must be e-mailed toobits@times-georgian.comAll photos must include only the deceased. Be a jpeg format with a 300 DPI resolution. The deadline to submit an obituary is 3 pm for the following day's edition. Deadlines may differ on holidays. We encourage you to submit as early as possible to allow time for verification of the death. Verification of death is required (death certificate) OR name and phone number of the funeral home or crematory. Without verification, we cannot publish. You are urged to ensure the information is accurate and spelled correctly as the Times-Georgian assumes no responsibility for inaccurate information provided to us. Cost is based on the length and option you choose from our options below. Once received via email, we will provide the prepaid cost. Death notices are published free of charge. Death notices include name, age, date of death, town and funeral date, time and location. Standard obituaries are available to allow the family to convey additional information beyond a death notice. In addition to information on death and services, standard obituaries may include a brief objective biography of the deceased and a list of survivors that may include by name parents, spouse, children and their spouses, siblings and their spouses, and grandparents. The number of surviving grandchildren, nieces, nephews, aunts, uncles, cousins and other in-laws may be included, but not listed by name. Fee is $40 for obituaries 200 words or less and $75 for 200-400 words. Photo can be added for $35. Enhanced obituaries include subjective biographical information along with any information the family may choose, provided that information does not violate libel laws or standard newspaper policies. Additionally, enhanced obituaries will appear with a border surrounding text. Fee will be $60 for 200 words or less; and $100 for 200-400 words. An additional charge of .25 cents per word over 400 will be assessed. Photo can be added for $35.Once received via email, we will provide the prepaid cost. Prepayment is required and we accept all major credit cards. For more information, call 470-729-3249 or e-mail:obits@times-georgian.com We reserve the right to edit content to conform with style, policy and accuracy. All obituaries are prepaid unless credit has been extended. Facebook Twitter WhatsApp SMS Email Print Copy article link Save **Featured Local Savings** **Georgia Press Association** **Latest e-Edition** **Times-Georgian** To view our latest e-Edition click the image on the left. **Click here to subscribe!** **Latest News** Today in History: June 12, 49 people killed in Pulse nightclub shooting Judge rules against Democrat running for PSC Georgia adoption regulations come under fire Atlanta is the latest to hit the brakes on data centers My Answer: The Bible tells all people to ‘prepare to meet thy God’ Villa Rica Council overrides mayor's appointment Johnson named new UWG president BREAKING: Officer struck on Hwy. 27; roads shut down **Most Popular** Articles Images Videos Commented Former teacher arrested for child exploitation Downtown throwdown lands two in jail Neighborly dispute takes a shocking turn Ammo store fire causes explosion Garrett appointed to State Board of Education Underground Books set to begin new chapter Broken bats, star performances at West Ga. All-Star game Subscription Services Upgrade Dana Diment retires from RaLin; successor named 6 Ga. lawmakers oppose federal freeze on state-level AI regulation Sorry, there are no recent results for popular commented articles. Success!An email has been sent towith a link to confirm list signup. Error!There was an error processing your request. Sign up today to have our e-edition delivered to your inbox. Stay Informed: Sign up for our newsletter so you can receive news updates every publication day. News Sports Villa Rican Gateway-Beacon Your School Opinion Obituaries Local Events Business Faith and Values Farm and Garden Leisure Southern Spice West Georgia Living Archives Submission Forms Classifieds Place an Ad Promote Your Event Email Alerts Search e-Edition Weather How to submit an obit **Contact Information** times-georgian.com 901 Hay's Mill Rd. Carrollton, GA 30117 Facebook Twitter Your browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:"}