{"id": 903, "name": "Detroit Metro Times", "domain": "metrotimes.com", "bias": "left", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.metrotimes.com/news/the-detroit-riverfront-conservancys-shimmer-on-the-river-fundraiser-kicks-off-summer-on-june-26-at-valade-park-39652513", "title": "The Detroit Riverfront Conservancys Shimmer On The River Fundraiser Kicks Off Summer On June 26 At Valade Park 39652513", "content": "News & Views Metro Detroit News & ViewsLatest News & ViewsMetro Detroit NewsMichigan NewsPolitics & ElectionsFlint Water CrisisAbortion RightsICYMIDetroit GuidesDigital Issue Latest News & Views Metro Detroit News Michigan News Politics & Elections Flint Water Crisis Abortion Rights ICYMI Detroit Guides Digital Issue Latest News & Views Metro Detroit News Michigan News Politics & Elections Flint Water Crisis Abortion Rights ICYMI Detroit Guides Digital Issue Arts & CultureLatest Arts & CultureArts Stories & InterviewsThings to DoCultureMoviesTelevisionMovie TimesFind a TheaterHoroscopes Latest Arts & Culture Arts Stories & Interviews Things to Do Culture Movies Television Movie Times Find a Theater Horoscopes Latest Arts & Culture Arts Stories & Interviews Things to Do Culture Movies Television Movie Times Find a Theater Horoscopes Food & DrinkLatest Food & DrinkFood NewsDrink NewsRestaurant ReviewsFind a Restaurant Latest Food & Drink Food News Drink News Restaurant Reviews Find a Restaurant Latest Food & Drink Food News Drink News Restaurant Reviews Find a Restaurant MusicLatest MusicMusic NewsLocal MusicConcert AnnouncementsFind a Concert Latest Music Music News Local Music Concert Announcements Find a Concert Latest Music Music News Local Music Concert Announcements Find a Concert WeedLatest WeedMarijuana NewsCanna-BusinessOne HittersBusiness Directory Latest Weed Marijuana News Canna-Business One Hitters Business Directory Latest Weed Marijuana News Canna-Business One Hitters Business Directory Things to DoToday's EventsThis WeekendSubmit an Event Today's Events This Weekend Submit an Event Today's Events This Weekend Submit an Event Detroit in Pictures Best Of DetroitBest Of HomeFoodBars & ClubsDrinksBest BetShops & ServicesArts & EntertainmentWeed Best Of Home Food Bars & Clubs Drinks Best Bet Shops & Services Arts & Entertainment Weed Best Of Home Food Bars & Clubs Drinks Best Bet Shops & Services Arts & Entertainment Weed Partner CornerCannabisDatingNightlifeWellness Cannabis Dating Nightlife Wellness Cannabis Dating Nightlife Wellness News & Views Metro Detroit Latest News & Views Metro Detroit News Michigan News Politics & Elections Flint Water Crisis Abortion Rights ICYMI Detroit Guides Digital Issue **THE DETROIT RIVERFRONT CONSERVANCY’S SHIMMER ON THE RIVER FUNDRAISER KICKS OFF SUMMER ON JUNE 26 AT VALADE PARK** The Detroit Riverfront Conservancy is inviting Metro Detroiters to kick off summer in style during Shimmer on the River, the nonprofit’s iconic annual fundraiser, which will be held June 26 from 5 to 9 p.m. at Robert C. Valade Park. The festive and unforgettable beach party evening will be filled with all-ages fun and feature a riveting performance by David Brighton’s Space Oddity – The Ultimate David Bowie Tribute Experience, as well as a boardwalk lined with summer activities, a family-friendly Adventure Park, a Kids Dance Party, delicious food and refreshments from local food trucks, and more! The Conservancy will also bestow the Shimmer Award—which is its highest honor—on three individuals during the Shimmer festivities. Valade Park is located at 2670 Atwater Street along the East Riverfront in downtown Detroit. Main event tickets to Shimmer are $150 each and include access to the main event from 6 to 9 p.m., a strolling dinner and refreshments, live entertainment, prizes, games and free admission for up to two children 12 and under. VIP tickets to Shimmer are $250 each and include access to an exclusive VIP reception and Shimmer award ceremony from 5 to 6 p.m., plus all Main Event benefits. Shimmer will have something for guests of all ages to enjoy. **Family-Friendly Fun for Everyone** The popular Adventure Park returns with activities for adults and kids alike. Guests can climb the rock wall for a stunning view of the riverfront or enjoy fun and interactive games like an obstacle course, basketball challenge, Skee Ball and Zap-A-Mole. There is also a giant dart board and a giant ring toss, as well. Additionally, younger guests can show off their moves during a Kids Dance Party on Valade Beach. Youth Activities are sponsored by Delta Dental. Along the Riverfront Boardwalk, a mini carnival tent will feature fun midway games and let guests test their skills and win custom riverfront swag. Eclectic Line Up of Local Food Trucks From street eats to Caribbean fare and a little in between, Shimmer will have a delicious lineup of Detroit’s favorite food trucks, including Cool Jacks, Detroit Original Fish & Shrimp, Detroit Panzerotti Company, Paradise Street Eats & Biryani, Tacos El Caballo and Xav’s Jammin Caribbean Fusion. **David Bowie Tribute Experience Takes Guests on a Musical Journey** While there is something for everyone to enjoy every year at Shimmer, the featured musical act is always one of the most anticipated components of the evening. This year’s entertainment will take guests on a journey through David Bowie’s extensive musical catalogue, complete with several costume changes. David Brighton’s Space Oddity – The Ultimate David Bowie Tribute Experience has dazzled audiences worldwide with a faithful tribute to one of music’s most unique and celebrated artists whose classic songs include Let’s Dance, China Girl, Space Oddity, Fashion, Jean Genie and Ziggy Stardust. **Shimmer Award Recognizes Efforts of Three Individuals** In addition to the fun, food, music and hands-on activities, a highlight of every Shimmer on the River is the presentation of the Shimmer Award, which is the highest honor that the Conservancy can bestow and is presented to an individual or organization that has had a lasting impact on the mission of the organization. The Conservancy is proud to honor Vivian Day and John Stroh III, alongside Robert Alan Davis with Shimmer Awards for their myriad contributions to the successful and ongoing revitalization of the Detroit Riverfront. Robert Alan Davis has played a pivotal role in the Detroit Riverfront revitalization as a founding Conservancy board member during his tenure as a leader at the Michigan Department of Transportation, where he worked on Milliken State Park and Harbor, Mt. Elliott Park, Robert C. Valade Park and the Riverwalk connection across the Uniroyal factory site. Vivian Day and John Stroh III have championed the development of the Detroit Riverfront for decades. John Stroh has played a pivotal role in the Conservancy since the organization’s inception as a founding board member who has served on several committees. He and Vivian have attended countless Conservancy events throughout the years, and in the fall of 2023, they were honored to name the Christopher Stroh Plaza at Gabriel Richard Park in memory of their son. Shimmer on the River is the nonprofit Conservancy’s largest fundraiser of the year. “Shimmer is an opportunity for our community of riverfront supporters to celebrate and sustain the best riverwalk in the USA,” said Cassie Brenske, chief development and communications officer for the Detroit Riverfront Conservancy. “Support of this event helps make possible the Conservancy’s work along Detroit’s riverfront, from large-scale transformations to the ongoing operations, it all comes together thanks to our partners from every corner of the community.” Shimmer would not be possible without the support of numerous sponsors:Presenting: Friends of Robert C. Valade ParkYouth Activity Sponsor: Delta DentalChampions of the Conservancy: Bedrock, Matt & Karen Cullen, Detroit Wayne Joint Building Authority, General Motors, Henry Ford Health and Bob & Sandy Riney, PVS Chemicals, Inc. and Visit Detroit.Riverwalk Partners: Diamond Jack’s River Tours, Steven Hamp & Sheila Ford Hamp, Sarah & Chip McClure, SmithGroup, Vivian Day & John Stroh III, Quatrro Business Support Services and Wolverine Packing Company.Shimmer Partners: Bridgewater Interiors LLC, Cassie Brenske & Mike Smet, Detroit Marriott at the Renaissance Center, Hollywood Casino at Greektown, Hudson-Webber Foundation, Operating Engineers 324, The Parade Company, Caroline, Scott, & Jill R. Riddle, Ryan & Callie Sullivan, UNITE HERE Local 24.In-Kind Partners: EXP Photo, HOUR Media, Metro Times and WDET. To purchase tickets or sponsorships, please visitdetroitriverfront.org/Shimmer. The Detroit Riverfront attracts 3.5 million visitors annually along its seven miles of parks, plazas and greenways. Over the last two decades, the revitalization of the Detroit Riverfront has generated more than $2 billion in public and private investment. The Detroit Riverwalk was named Best Riverwalk in the country by USA TODAY 10 Best Readers’ Choice Awards in 2021, 2022 and 2023. **Tags:** **About The Author** Facebook X Instagram Threads TikTok Reddit Apple News Google News RSS **Rep. Tlaib to join ‘No Kings’ rally in Detroit to protest attacks on immigrants, democracy** **Rep. Tlaib to join ‘No Kings’ rally in Detroit to protest attacks on immigrants, democracy** **Latest in News & Views** Rep. Tlaib to join ‘No Kings’ rally in Detroit to protest attacks on immigrants, democracy By Steve Neavling Rep. Tlaib to join ‘No Kings’ rally in Detroit to protest attacks on immigrants, democracy By Steve Neavling Jury finds Michigan labor contractor guilty in human trafficking trial By Steve Neavling Jury finds Michigan labor contractor guilty in human trafficking trial By Steve Neavling NBC’s ‘Grosse Pointe Garden Society’ needs a streaming miracle to survive By Jim McFarlin NBC’s ‘Grosse Pointe Garden Society’ needs a streaming miracle to survive By Jim McFarlin Activists urge officials to help Detroit high school student facing deportation By Steve Neavling Activists urge officials to help Detroit high school student facing deportation By Steve Neavling This Week's Issue Find Metro Times in Print Subscribe to Metro Times Newsletters Local Detroit News & Views Things to Do Arts & Culture Food & Drink Music Weed Detroit in Pictures More Best Of Detroit Detroit Guides Submit an Event Partner Corner About Metrotimes About Us Advertise Contact Us Jobs Staff Big Lou Holdings, LLC Cincinnati CityBeat Detroit Metro Times Louisville Leo Weekly Sauce Magazine Local DetroitNews & ViewsThings to DoArts & CultureFood & DrinkMusicWeedDetroit in Pictures News & Views Things to Do Arts & Culture Food & Drink Music Weed Detroit in Pictures News & Views Things to Do Arts & Culture Food & Drink Music Weed Detroit in Pictures MoreBest Of DetroitDetroit GuidesSubmit an EventPartner Corner Best Of Detroit Detroit Guides Submit an Event Partner Corner Best Of Detroit Detroit Guides Submit an Event Partner Corner About MetrotimesAbout UsAdvertiseContact UsJobsStaff About Us Advertise Contact Us Jobs Staff About Us Advertise Contact Us Jobs Staff Big Lou Holdings, LLCCincinnati CityBeatDetroit Metro TimesLouisville Leo WeeklySauce Magazine Cincinnati CityBeat Detroit Metro Times Louisville Leo Weekly Sauce Magazine Cincinnati CityBeat Detroit Metro Times Louisville Leo Weekly Sauce Magazine All material © 2025 Detroit Metro Times, Ferndale, MI. All rights reserved."}