{"id": 792, "name": "KTVQ - Billings News", "domain": "ktvq.com", "bias": "center", "credibility": "high-credibility", "reporting": "high", "questionable": null, "url": "https://www.ktvq.com/community/athlete-of-the-week/q2-aow-rodeo-royalty-huntleys-swenson-siblings-capture-high-school-all-around-titles", "title": "Q2 Aow Rodeo Royalty Huntleys Swenson Siblings Capture High School All Around Titles", "content": "Menu NewsLocal NewsMontana NewsNational NewsWorld NewsMontana PoliticsMontana Ag NetworkCrime WatchIndian CountryWildfire Watch Local News Montana News National News World News Montana Politics Montana Ag Network Crime Watch Indian Country Wildfire Watch Local News Montana News National News World News Montana Politics Montana Ag Network Crime Watch Indian Country Wildfire Watch WeatherInteractive RadarWeather CamerasDaily ForecastHourly Forecast Interactive Radar Weather Cameras Daily Forecast Hourly Forecast Interactive Radar Weather Cameras Daily Forecast Hourly Forecast SportsMontana SportsAthlete of the Week Montana Sports Athlete of the Week Montana Sports Athlete of the Week Positively Montana CommunityOut and AboutOne Class at a TimeSuper SeniorsA Waiting ChildCounsel's CornerAsk A DoctorContestsGive A Child A BookJob SpotLocally Owned, Locally LovedSubmit Anniversary or BirthdayUnder The Big SkyYour Health MattersZooCams Out and About One Class at a Time Super Seniors A Waiting Child Counsel's Corner Ask A Doctor Contests Give A Child A Book Job Spot Locally Owned, Locally Loved Submit Anniversary or Birthday Under The Big Sky Your Health Matters ZooCams Out and About One Class at a Time Super Seniors A Waiting Child Counsel's Corner Ask A Doctor Contests Give A Child A Book Job Spot Locally Owned, Locally Loved Submit Anniversary or Birthday Under The Big Sky Your Health Matters ZooCams MTN Investigates VideosPhoto GalleriesOn KTVQ Photo Galleries On KTVQ Photo Galleries On KTVQ Find MTN About UsContact UsQ2 News StaffStream Q2 NewsMy MTNJobs at KTVQQ2 AppsDoes your business need help?Closed Captioning Information Contact Us Q2 News Staff Stream Q2 News My MTN Jobs at KTVQ Q2 Apps Does your business need help? Closed Captioning Information Contact Us Q2 News Staff Stream Q2 News My MTN Jobs at KTVQ Q2 Apps Does your business need help? Closed Captioning Information Sign In Newsletters Sign Out Manage Emails Apps Careers Search **Actions** Facebook Tweet Email **Q2 AOW: Rodeo royalty: Huntley's Swenson siblings capture high school all-around titles** HUNTLEY — Here in Huntley, rodeo is life for the Swenson siblings. And right now, life is good after combining to win four titles at the 2025 Montana High School Rodeo Finals last weekend. “I told my parents … I was like, ‘I want to go out with a bang on my last high school rodeo of my life,’” AJ Swenson told MTN Sports in the family’s backyard. Watch the video below to see AJ and Aspen Swenson in action: And he did just that, earning the boys' all-around title at the finals last Saturday. His sister, Aspen, matched him by winning the girls' all-around title. “I don’t know … (if) that’s ever been done with two siblings winning it the same year,” Aspen said. If so, the achievement hasn't been seen in decades. MTN Sports first showed the Swensons making headlinesin October during the fall rodeo season. Both were coming off outstanding summers— AJ filled with fire and Aspen, who loves fashion, showcasing a Little Britches world title. Fast forward to last week, when neither all-around title was a sure thing for the Swensons. Both Aspen and AJ opened the finals sitting in second place. A pivotal moment in AJ’s all-around victory arrived in the calf roping’s championship round. “(The calf) came out and took a step left like he was supposed to, and he was supposed to keep going left. As soon as he took that step right, which he hadn’t done, I just knew it was game over,” AJ recalled. Indeed, it was. AJ won the calf roping short go. While polishing one of his many championship saddles, he paused to humbly admit that two recently earned scholarships fill him with the most pride. “This is based off of what kind of a person you are and not how good you can rope,” he said while holding the two certificates. “If people can remember me as being a good upstanding guy helping the next generation in and out of the arena, that means more to me than any saddle or buckles ever will.” Aspen not only won the all-around title but is also the latest champion in both breakaway roping and goat tying, giving her the chance to let her older brother hear about it. “I didn’t really brag. … I mean, I could have, but I didn’t. Thought I’d better stay humble,” Aspen said with a laugh. While she stayed humble, their parents, Sarah and Andy, had knots in the stomach. “Oh, I wanted to throw up. I was terrible,” Sarah admitted without hesitation. “You just pray for your kids to have focus and clarity and to compete to the best of their abilities.” Andy, who’s not always able to travel to competitions, wasn’t about to miss these finals. “It was very touching knowing that it was AJ’s last night of school rodeo. And all the ones I’ve missed … I can’t get those back,” Andy said, fighting back tears. Both siblings are qualified for next month’s High School National Finals in Rock Springs, Wyo. After that, AJ will head south to join the Cisco College Wranglers. “If you were to throw a dart at the dead center of Texas, you’d probably hit it,” AJ said of the location. There’s one more title addition to this story: Boomer, the horse borrowed from family friends who has been good to both AJ and Aspen. “He’s an old man. He’s 20 years old this year,” Aspen said while standing alongside him. Age didn’t stop Boomer from earning horse of the year honors last weekend. “My best friend … she was just crowned the queen. I was getting my breakaway award and told her, ‘If Boomer wins horse of the year, I might actually cry. That’ll probably be the one that means the most.’ And sure enough, it was,” Aspen said. “Since he did so good, I thought I’d spoil him with a Louis Vuitton halter. And it’s turquoise, the color he looks best in,” Aspen added with a laugh. Who knows when Boomer will retire, but right now, the grass is certainly greener for him — and for the Swensons. **Sign up for theBreaking News Newsletterand receive up to date information.** **now signed up to receive theBreaking NewsNewsletter.** **Coverage of your favorite teams from Montana's Sports Leader** **Coverage of your favorite teams from Montana's Sports Leader** News Weather Community Sports Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Us Accessibility Statement Scripps Media Trust Center Closed Captioning Contact Q2News/ ktvq ktvq"}